{
  "id": "yLOcTGYBTlTomsSBATtL",
  "document": {
    "title": "Parish v. Maryland and Virginia Milk Producers Association Inc.",
    "full_title": "PARISH, ET AL. v. MARYLAND AND VIRGINIA MILK PRODUCERS ASSOCIATION, INC., ET AL.",
    "jurisdiction": "Court of Appeals of Maryland",
    "date": "1968-05-27T00:00:00.000Z",
    "docket": "No. 103, September Term, 1967",
    "body": "This appeal involves the question of whether the third amended bill of complaint, filed by eight plaintiffs, members of the Maryland and Virginia Milk Producers Association, Inc. (the Association), in the Circuit Court for Montgomery County, in equity, against the Association and thirty-four individual defendants, stated a cause of action in equity. The Circuit\n\nCourt (Pugh, J.) held that it did not and sustained demurrers to it without leave to amend. From the order dismissing the complaint and requiring the plaintiffs to pay the costs entered by the Circuit Court on March 29, 1967, the present appeal to this Court was timely taken by six of the eight plaintiffs. We have concluded that the Chancellor was in error in sustaining the demurrers. We will reverse the order of March 29, 1967, and remand the case for further proceedings.\n\nThe original bill of complaint was filed February 4, 1965, by Frank P. Parish and Theodore F. Parish, his wife (Parish), who together owned a single membership in the Association, as a derivative suit against the Association, its directors, its auditor and two of its former employees. On April 9, 1965, the Circuit Court granted leave to six other members of the Association to intervene as parties plaintiff (four of those intervening plaintiffs and the two original plaintiffs are appellants in the present appeal), and, on the same day, granted leave to file an amended bill of complaint. The amended bill of complaint was filed the same day. On July 20, 1965, the Circuit Court (Shook, J.) sustained demurrers to the amended bill of complaint and on July 23, 1965, a second amended bill of complaint with one exhibit was filed. Demurrers were filed to this bill and after hearings before the Circuit Court (Shook, J.) some of the demurrers were sustained as to certain paragraphs and, in toto, as to certain parties. There were numerous proceedings thereafter, including extensions of time to answer, motions for separate trials, motions for taking depositions, a motion of the Parish plaintiffs to represent themselves, a motion for summary judgment, to protect witnesses and the like, all of which are of little importance to the present appeal (with one exception in regard to the argument of some of the appellees in regard to res judicata), as the Circuit Court (Pugh, J.), on February 13, 1967, passed an order dismissing all motions, demurrers and then permitted the filing of a third amended bill of complaint. The third amended bill of complaint (the complaint), with a number of exhibits, was duly filed on February 28, 1967, and, as we have indicated, it is from the Chancellor's order sustaining the demurrers to the complaint, dismissing it\n\nand requiring the plaintiffs to pay the costs, that the present appeal was taken.\n\nThe complaint, with its eight exhibits, is a rather formidable document. In the record, it consists of 39 legal-size papers with 53 pages of exhibits, a total of 92 pages; in the record extract the complaint consists of 41 printed pages with 36 printed pages of exhibits to which the Association has added 7 pages in the appendix to its brief, a total of 43 exhibit printed pages, or a total of 84 printed pages for both complaint and its exhibits. Although both the appellants and the appellees have in both their briefs and in their arguments occasionally considered material not in the complaint and its exhibits, it is clear that we are confined to the allegations in the complaint and its exhibits and reasonable inferences from those allegations in considering the propriety of the sustaining of the demurrers by the Chancellor. Standard Founders v. Oliver, 168 Md. 317, 345-46, 178 A. 223, 235 (1935). We will confine ourselves to those allegations and reasonable inferences.\n\nThe first five paragraphs of the complaint designate the parties, both plaintiff and defendant. Paragraph 1 describes the plaintiffs as follows:\n\n(a) The plaintiffs, Parish, are together members of the Association and residents of Maryland. Their farm, \"Thorndale Farm\" which they have owned continuously since prior to 1953, sold milk to the Association as a member since 1952 until the spring of 1966 under two contracts with the Association -- one in the name of Mrs. Parish dated November 18, 1942 and the other in both names dated October 9, 1961. The contracts are attached as exhibits A and B as a part of the complaint. Mrs. Parish, in 1941, was enrolled as a member and operated the farm as a member until 1957. In accordance with the terms of the original contract, exhibit A, and the subsequent contract, exhibit B, the farm was operated from 1957 to 1961 in the name of Schott Brothers, but the leasing arrangement did not terminate the Parish membership in view of the provisions of Article VIII of the Association's Certificate of Incorporation, exhibit C, filed as part of the complaint. In 1961, the Schott Brothers lease was terminated and Parish executed the October 9, 1961 contract with the Association (exhibit B) and\n\nParish continued to operate the farm from 1961 until a bona fide sale of their cowherd in the spring of 1966.\n\n(b) The plaintiffs, Wayne E. Lenn and Edwin R. Lenn, trading as \"Lenn Brothers,\" have been continuously members of the Association since 1952, and reside at Route 2, Culpeper, Virginia.\n\n(c) The plaintiff, J. A. Bernard Dahlgren, trading as \"Windsor Lodge Farm,\" has been continuously a member of the Association since 1959 and resides at Huntley, Virginia.\n\n(d) The plaintiff, E. Irving Eldridge, has continuously, since 1955, been a member of the Association and resides at The Plains, Virginia.\n\n(e) The plaintiff, Edward M. Wharff, Jr., has continuously, since 1959, been a member of the Association and resides at Woodbine, Maryland.\n\n(f) The plaintiff, B. G. Wenger, Jr., has continuously, since 1950, been a member of the Association and resides at Woodstock, Virginia.\n\nIt is then alleged that the original complaint in the case was filed by the Parish plaintiffs on behalf of themselves and all other members of the Association similarly situated and that subsequently the other plaintiffs, above named, having received permission of the Circuit Court, intervened as plaintiffs and adopted the allegations of the Parish complaint.\n\nParagraph 2 describes the defendant Association. It is a Maryland corporation created and functioning as a \"farm cooperative\" under Code (1957), Article 23, Sections 349 to 377. A copy of the Certificate of Incorporation, amended to date, was filed as part of the complaint as exhibit C. Under Article VII and VIII of the Articles of Incorporation \"the Association has the character of an incorporated trust, it acting as consignee of the members' milk-produce and as their agent 'to handle * * * process, store, finance, haul, transport, advertise, grade, standardize, market, distribute and do any of the foregoing things * * * [the] milk-produced by its members and products and by-products derived therefrom * * *.'\" The Association has a statutory principal office in Frederick County, Maryland. It is regularly doing business in Montgomery County and in many other counties of Maryland and is\n\nalso doing business in Virginia, the District of Columbia and elsewhere in the United States.\n\nParagraph 3 describes the defendants William B. Hooper (Hooper) and Arthur V. Robinson (Robinson) as the principal managing and operating officers of the Association during the period of 1955 (approximately) to 1963. Hooper, who was secretary-treasurer-general manager of the Association, resides in Virginia and is engaged in business in the District of Columbia. Robinson, who was named as a defendant in the original bill of complaint and who was manager of the milk processing plant at Laurel, Maryland, and a resident there, died on September 20, 1965. His executors, Robert M. Goldman and J. Robert Sherwood, were on a proper motion substituted as parties defendant in Robinson's place.\n\nParagraph 4 describes the defendant directors of the Association. In view of the arguments of some of the director defendants, it will be necessary to set out the allegations of paragraph 4 in some detail. It alleges that all but three of the defendants listed below are present directors of the Association. These three are Charles C. T. Stull, Lester W. Huff and Dr. Oscar S. Martin. The year in parenthesis opposite each name indicates the year when each director became a member of the board of directors in accordance with the plaintiff's knowledge and belief:\n\n\"Directors Resident in Maryland\n\nMerhl A. Adams (1962)\n\nHarry W. T. Fouche (1963)\n\nUpton F. Gladhill (1953 or earlier)\n\nPaul B. Harlan (1953 or earlier)\n\nWilliam I. King (1963)\n\nWalter A. Martz (1964)\n\nJ. Homer Remsberg (1953 or earlier)\n\nCharles C. T. Stull (1962) (Terminated end of 1964)\n\nH. Lehman Toms (1959)\n\nDavid Weitzer (1964)\n\nDirectors Resident in Virginia\n\nWilliam H. Cockerill (1962)\n\nWilliam C. Crossman, Jr. (1956)\n\nLuther L. Day (1962)\n\nLester W. Huff (1957) (Terminated October 9, 1964)\n\nDr. Oscar S. Martin (1957) (Terminated early 1965)\n\nGiles H. Miller, Jr. (1956)\n\nEdward C. Norman (1951)\n\nW. W. Sanford, Jr. (1963)\n\nC. T. Sollenberger (1963)\n\nAlton A. White (1956)\n\nDirector Resident in West Virginia\n\nI. D. Van Metre, Jr., (1953 or earlier).\n\nSaid defendants have held the following executive offices in the Association:\n\nJ. Homer Remsberg, president from 1953 to 1964\n\nEdward C. Norman, first vice-president 1963 and president 1964\n\nI. D. Van Metre, Jr., first vice-president 1964\n\nUpton F. Gladhill, second vice-president 1962 to 1964\n\nCharles C. T. Stull, second vice-president 1964\n\nThe principal policy-making committees of the Board of Directors with respect to matters herein complained of are the Executive Committee, Plant Committee and the Finance Committee. The defendants listed below are or have been members of the following committees at times during the matters herein complained of:\n\nExecutive Committee\n\nMerhl A. Adams\n\nUpton F. Gladhill\n\nCharles C. T. Stull\n\nLuther L. Day\n\nWilliam C. Crossman, Jr.\n\nGiles H. Miller, Jr.\n\n{PA}\n\nPage 38} Plant Committee\n\nUpton F. Gladhill\n\nEdward C. Norman\n\nGiles H. Miller, Jr.\n\nW. J. Hahn\n\nPaul B. Harlan\n\nJ. Emory Kirkpatrick\n\nHoward W. Clark\n\nAlton A. White\n\nWilliam C. Crossman, Jr.\n\nLester W. Huff\n\nJ. Homer Remsberg\n\nI. D. Van Metre\n\nLuther L. Day\n\nWilliam I. King\n\nWilliam H. Cockerill\n\nMerhl A. Adams\n\nJ. F. Potts\n\nFinance Committee\n\nUpton F. Gladhill\n\nEdward C. Norman\n\nPaul B. Harlan\n\nGiles H. Miller, Jr.\n\nThe following defendants who are former directors served on the Executive Committee or the Finance Committee at times during the matters herein complained of:\n\nExecutive Committee\n\nEdwin D. Fry (1954 to 1960)\n\nPaul R. Marsh (1954 to 1960)\n\nM. H. Ramsburg * (1954 to 1961)\n\n(* on information and belief, this defendant is now deceased)\n\nJennings F. Potts (1956 to 1961)\n\nHoward W. Clark (1960 to 1962)\n\nJ. Emory Kirkpatrick (1962)\n\nFinance Committee\n\nG. W. Carper (1954-1955)\n\nW. J. Hahn (1954-1963)\n\nBasil Mobley * (1954 to 1961)\n\n(* was second Vice President from 1953 or earlier to 1961).\"\n\nParagraph 5 describes the defendant Wayne Kendrick (Kendrick) as a certified public accountant practicing in the District of Columbia where, on information and belief, he is a resident. He or the firm of \"Wayne Kendrick \u0026 Company,\" of which he is a partner, prepared and issued all of the audited financial statements of the Association during the period 1955 to the present time. The references in the complaint to the \"defendants\" or to the \"individual defendants\" do not include Kendrick unless otherwise indicated.\n\nWe now come to paragraph 6 of the complaint which sets out its objects and purposes in three parts, the first part being subdivided into 12 sub-parts. These objects and purposes are to set forth:\n\nFIRST. (1) a series of acts which the plaintiffs charge \"constitute waste, illegality, gross negligence, culpable mismanagement of the affairs of the Association and breach of trust and fiduciary duty by the individual defendants who constituted its officers and directors at the times when the respective acts took place and who are hereinafter specified in subsequent paragraphs of this Amended Complaint;\"\n\n(2) acts of self-dealing by certain defendants \"hereinafter specified\" to their profit and to the substantial injury of the Association;\n\n(3) the issuance of incorrect, misleading and contradictory reports and financial statements to the members of the Association by the defendants \"who are hereinafter specified as officers and directors\" including a false and misleading report adopted at the Association's Annual Meeting on February 24, 1964, on the acquisition, operation and sale of the Embassy Dairy. Page 17 of this false and misleading report is filed as part of the complaint as exhibit D, and, upon information and belief, shows in the handwriting of Sollenberger, one of the directors, the falsity of some of the reported information;\n\n(4) serious infractions of the anti-trust laws of the United States by the defendants who were officers and directors of the Association and caused it to purchase a dairy in violation of those laws and was thereafter ordered by the United States District Court for the District of Columbia to divest itself of that dairy business;\n\n(5) upon information and belief, the continued sale of fluid milk to Embassy Dairy at Class 2 price after the sale of that dairy pursuant to the District Court's order;\n\n(6) the then officers and directors causing the Association to make an improvident sale of the dairy with no down payment being obtained, except out of cash transferred by the Association to the purchaser as cash assets of the business sold;\n\n(7) the then officers and directors falsely reporting to the membership that a capital gain of $450,000 was realized on the sale of the dairy when in fact it was made at a loss;\n\n(8) the then officers and directors causing the Association to reduce the price by allowing the purchaser a \"discount\" of $500,000 without informing the membership with respect to it in the text of the next annual report or in the operating statement;\n\n(9) the then officers and directors continuing the manager of the dairy business on the Association's payroll after the sale of the dairy and attempting to retain such control or influence over its operation as to frustrate the purposes of the divestment order of the District Court and expose the Association to heavy penalties for the violation of that order;\n\n(10) the then officers and directors making improvident so-called settlements with Hooper and Robinson by which clear liabilities of approximately $250,000 or more, for profits illegally diverted by them from the Association to their own private competing business, and other liabilities in an even greater amount, were purportedly released for a grossly inadequate consideration;\n\n(11) the then officers and directors causing the Association to purchase such private competing business from Hooper and Robinson for \"an excessive price after being advised of such derelictions and conspiring among themselves and with others to withhold vital information relating to these matters from\n\nthe members of the Association from the time of these transactions to date;\"\n\n(12) \"upon information and belief other acts of fraud upon the membership by the officers and directors and breach of their fiduciary duties, the details of which remain at this time undisclosed to the membership but contained in the Dugan Report.\" In connection with the conspiracy charged in subparagraph (1), supra, it is the object and purpose of the complaint to set forth those actions of the officers, directors and others who have \"combined, conspired and confederated among themselves and with each other to conceal and withhold from the members the information relating to the foregoing alleged transactions by various obstructive strategems including but not limited to the following:\" (a) the refusal of Edward L. Merrigan, an agent of the then officers and directors, to furnish a list of the members of the Association to the plaintiff, Frank Parish, in March, 1964; (b) their subsequent refusal to furnish such a list as set forth in a letter from Merrigan, general counsel for the Association, in his letter of August 18, 1964, a copy of which is filed as part of the complaint as exhibit E; (c) the refusal of the then officers and directors adequately to inform the membership of the facts surrounding the operation, disposition and sale of the Embassy Dairy pursuant to a members' resolution adopted at the annual meeting of members held on February 24, 1964; (d) the refusal by the officers and directors and of their agent, Merrigan, at the annual meeting of members held on February 22, 1965, and their subsequent and continued refusal to furnish any requesting members the opportunity to examine or have a copy of the Dugan Report which outlines the results of an investigation conducted at the expense of the Association by Frank Dugan and which, upon information, reports the evidence and constitutes an admission by the Association of many of the allegations in the complaint; (e) \"an illegal attempt by the Board of Directors through By-Law Amendment on March 30, 1966, to impose restrictions upon future derivative suits brought by members requiring: (1) an application to the Board of Directors and [if] authority for the suit is refused and (2) a\n\nmajority vote of all members attending an annual or special meeting -- all contrary to the laws of the State of Maryland.\"\n\nSECOND, the plaintiffs charge that they are entitled to require an accounting by the individual defendants to the Association \"for the great losses and damage suffered it as a result of said culpable acts.\"\n\nTHIRD, the plaintiffs charge that they are entitled to request such further judicial action as may permit the Association to recover its losses from those defendants who are beyond the court's jurisdiction and obtain such other relief as may be appropriate.\n\nFor the specification as to the charges and as to the particular defendants responsible for them in each instance, reference is made to the subsequent paragraphs of the complaint.\n\nIn paragraph 7, the plaintiffs set forth why they are not required as a condition of bringing suit to apply to the Board of Directors of the Association (the Board), or to the members, for relief, as follows:\n\n(a) The Board consisted of the defendants and the application to the defendants as directors for relief of the matters alleged in the complaint \"would be unavailing, fruitless and futile,\" and such application is \"not required as a condition of bringing this suit.\" This is further elaborated by alleging that 21 of the directors at the time when the original bill of complaint was filed are listed in paragraph 4 of the complaint and are all named as defendants. Nineteen of these directors were members of the Board during the year 1964 when the Board:\n\n(1) approved the improvident settlements with Hooper and Robinson as alleged in paragraphs 19 and 20;\n\n(2) employed Professor Frank Dugan at the Association's expense to investigate and report the wrongful acts already alleged in the complaint, obtained the Dugan Report and then determined to refuse members of the Association access to it although the president of the Association had promised that the Dugan Report would be made available;\n\n(3) as alleged in paragraphs 21 and 24 of the complaint, concealed and conspired to conceal from members of the Association\n\nvital information as to operations and particularly facts establishing the causes of action against various defendants which are described in the complaint.\n\nIt was further alleged that the complaint charges that members of the Board during the year 1964, who have been named as defendants, should be required personally and individually to account to the Association for the losses it suffered as a result of these acts. A majority of the present Board have been members of the Board since 1959 and are alleged in the complaint to be responsible to account to the Association for losses suffered by it during the past six years. It is then alleged:\n\n\"It is therefore apparent both from the nature of the Complaint and the relief sought against the directors that to request them as a board to institute a suit against themselves for an accounting, or if such a suit were instituted in the name of the Association, to prosecute it vigorously and impartially would be futile. Complainants are therefore advised and aver that they have the right to maintain the present representative suit to establish the Association's right to an accounting against these directors and the other defendants without first requesting the defendant directors to institute such a suit in the name of the Association.\"\n\nIt is further alleged that Frank Parish has repeatedly sought access to the Association's membership list for the purpose of informing the members of the matters alleged in the complaint and, as can be seen from the summary of correspondence between Frank Parish, or his attorney, and the Association contained in the letter of its general counsel dated August 18, 1964, (exhibit E), the directors have consistently refused to permit his bringing the matters to the attention of (1) 10% of the members (approximately 2200 in number) for filing a petition with the directors requiring a call of a special meeting of members under Code (1957), Article 23, Section 361, and (2) the general membership attending such a specially convened meeting.\n\nThe plaintiffs alleged that if it be assumed, arguendo, that they might otherwise be expected to request the members to direct the institution of suit by the Association before doing so themselves (which the plaintiffs deny is a correct view of the law), they are relieved from making such a request by the action of the directors (listed in paragraph 4 of the complaint) in preventing the plaintiffs from making an appeal to members, by refusing to release the membership list for that purpose and by refusing to release the Dugan Report as a particularized statement of many of the wrongs complained of in the complaint.\n\nIt is further alleged that the plaintiffs have stated the wrongful acts of the members of the Board in as much detail as they are able to do without the Dugan Report, the minute books of the Board and the statement of charges against Hooper, the general manager, by James E. Click, assistant secretary, when Mr. Click submitted his resignation to the Board, all of which precipitated the resolution of the Board on November 8, 1963, to conduct a fact finding study, subsequently delegated on November 22, 1963, to the plant committee, which thereafter retained Frank J. Dugan to develop the pertinent facts relating to the Click charges. Professor Dugan took the testimony of 19 witnesses covering 1467 transcript pages, and wrote a 75 page report to the directors, all of which facts are referred to in exhibit G, and none of which information has been made available to the plaintiffs although it is in the hands of the defendants. It is then alleged:\n\n\"It is therefore impossible for these complainants at this time to specify, with any greater particularity than herein appears, which of the defendants voted in favor of or otherwise assumed responsibility for the particular wrongful acts of which they complain. With the aid of discovery procedures in this litigation complainants will be able to bring fully to the attention of this Court the actual facts as to the participation of each individual director-defendants in the acts complained of.\"\n\nIt is further alleged that the Circuit Court had jurisdiction\n\nand that venue is properly laid in the Circuit Court for the independent reasons:\n\n(1) the Association is regularly doing business in Montgomery County within the meaning of Code (1957), Article 23, Section 95 (a), and\n\n(2) apart from the doing business by the Association in Montgomery County, four individual co-defendants reside in the County and by the provisions of the Code (1957), Article 16, Section 101, the Circuit Court is empowered to adjudicate the plaintiffs' complaint against all defendants who are residents or corporations of the State of Maryland.\n\nWe now turn to the paragraphs in the complaint which allege the facts in regard to various transactions already mentioned and alleged in the complaint.\n\nParagraphs 8 to 15 allege the facts in regard to the Embassy Dairy. In paragraph 8 it is alleged that on or about August 1, 1954, by the action of its directors, a majority of whom (later listed) are defendants in the present suit, the Association purchased the Embassy Dairy in the District of Columbia in violation of the Sherman and Clayton Anti-Trust Acts. It is alleged that according to the judicial findings in the civil anti-trust suit brought by the United States the motives of the transaction were to \"eliminate the largest producers of non-Association milk in the area,\" and \"increase the Association's control of the Washington market,\" and \"the transaction * * * was entered into with the intent and purpose of restraining trade.\" The Association paid $3,890,000 for Embassy Dairy. In making its findings in regard to motive the United States District Court for the District of Columbia \"accepted and relied upon evidence that 'the price paid by the Association was far in excess of the actual and intrinsic value of the property purchased.'\"\n\nIt was further alleged that the Association asserted unsuccessfully \"the colorable defense that it was wholly exempt from control under the anti-trust laws and laws forbidding monopolies.\" Judgment was entered establishing that the purchase and operation of the Embassy Dairy were in clear violation of law and the District Court ordered the Association to divest itself of the entire dairy property. The Association prosecuted\n\na fruitless appeal to the Supreme Court of the United States at a cost, on information and belief, of more than $300,000, and that Court affirmed and extended the judgment (Maryland and Virginia Milk Producers Ass'n v. United States, 362 U.S. 458 (1960)), holding that the District Court wrongfully dismissed an additional charge under Section 2 of the Sherman Anti-Trust Act, stating that \"the Association's anti-competitive activities are so far outside the 'legitimate objects' of a co-operative that, if proved, they would constitute clear violations of Section 2 of the Sherman Act by the Association, a fact, indeed, which the Association does not really dispute if it is subject to liability under this section.\" The District Court issued a final judgment as of June 20, 1960, (subsequently amplified by a consent decree signed November 22, 1960) pursuant to which the Association was required promptly to divest itself of all interest in the Dairy. Action was taken pursuant to the judgment as of January 1, 1961. The defendants who constituted the Board which approved the purchase of the Embassy Dairy in 1954 are deemed to have assented to the Board's action unless absent from the meeting or unless they affirmatively registered their dissent pursuant to Article 23, Section 62(b) of the Maryland Code then in effect. On information and belief, each of the defendants was present and did not register his dissent. The defendants who participated in the action of the Board were: Carper, Fry, Gladhill, Hahn, Harlan, Kirkpatrick, Marsh, Mobley, Norman, Potts, Ramsburg (since deceased, on information and belief) and Remsberg. On information and belief, these actions were particularly investigated and approved by the Association's then president, the defendant Remsberg, by the Executive Committee including the defendants Fry and Marsh and by the Finance Committee including the defendants Carper, Gladhill, Hahn, Mobley and Norman. The duties of the Executive and Finance Committees appear in Article XI and XII of the By-laws appearing in exhibit C.\n\nThe plaintiffs then alleged that they further charge that:\n\n\"* * * the acquisition of said Dairy was illegal, and without seeking clearance from the Department of\n\nJustice, was an act of reckless mismanagement, and was a proximate cause of substantial and heavy loss and damage to the Association, as hereinafter set forth. Complainants have been denied access to minute books and other records of the Defendant Association and are therefore at this time unable to specify in greater particularity the negligent acts and responsibility of individual defendants with respect to said acquisition.\"\n\nIn paragraph 9 the improvident nature of the Embassy Dairy sale are alleged. It is alleged that in addition to the purchase price of $3,890,000, the Association expended large sums (the amount of which is not specifically ascertained by the plaintiffs without access to books and records denied them) in improvements to the Embassy Dairy between 1954 and 1961. On information and belief, the total adjusted cost basis of the Embassy Dairy as of the time of its sale in 1961 exceeded $5,000,000. By an agreement effective January 1, 1961, a memorandum of which was executed on November 4, 1960, the Association acting by its Board, of which 17 out of the 21 members are named defendants in the suit, sold the Dairy in installments to Metropolitan Food Corporation (Metropolitan), a Virginia Corporation, which, on information and belief, had no substantial assets. A copy of the memorandum of agreement is attached as exhibit F as a part of the complaint. It appears from the memorandum of agreement that the total price for the sale was $3,250,000, plus \"cash in banks and on hand\" of the Dairy and the amount of its accounts receivable.\n\nThe assets sold were to consist of all the assets of the \"Embassy Dairy Division\", including \"the capital stock of the Richfield Dairy Corporation and Simpson Bros., Inc. t/a Wakefield Dairy, the acquisition and cost of which are described\" later in paragraph 17, and also included \"an amount equal to the cash on hand or in banks as of the date of settlement,\" and the accounts receivable, so that, apart from the cash and accounts receivable, all of the assets were sold for $3,250,000. The terms of sale were:\n\n(a) The sole cash payment at settlement was \"an amount equal to the cash in banks and on hand\" so that no cash payment\n\nwas made by the buyer except to the extent it received cash from the seller at the date of settlement.\n\n(b) A non-interest bearing note for $250,000 was deliverable due in six months.\n\n(c) A non-interest bearing note was to be delivered in the amount of the notes and accounts receivable, but this note was payable only as collections were made and was subject to discounts allowed and for uncollected items, so that this note would require no substantial cash outlay by the buyer.\n\n(d) A note for $3,000,000 due in semi-annual installments beginning two years after the settlement, with the balance of $500,000 due 14 years after settlement. (Exhibit F indicates that this note would bear interest at 5% per annum from the date of settlement).\n\nThe notes mentioned were to bear the endorsement of \"Irving D. Berger\" but \"were unsecured, the seller not even retaining a lien on the Dairy assets for payment of the balance of the purchase price. By reason of the above stated terms requiring no down payment beyond the cash turned over to the buyer on the sale, and no security, the sale was wholly improvident and made for an insubstantial consideration.\" The following named defendants are deemed by reason of Code (1957), Article 23 Sec. 62(b) to have assented to the action of the 21-member Board which approved the terms and the sale: Clark, Crossman, Jr., Gladhill, Hahn, Harlan, Martin, Jr., Miller, Jr., Mobley, Norman, Potts, Ramsburg (now deceased), Remsberg, Toms and White. It is alleged, on information and belief, that these directors were present at the meetings of the Board when the action was taken and did not dissent from the action taken.\n\nIt is further alleged, on information and belief, that the sale was particularly considered by the then president, Remsberg, and vice-president, Mobley, by the executive committee, including the defendants Marsh, Potts, Miller and Clark, and, by the finance committee, including the defendants Gladhill, Hahn, Mobley and Norman. The plaintiffs further charge that the approval of these defendants of the sale and its terms \"was an act of reckless mismanagement and gross negligence in the discharge of their duties as directors whereby substantial loss and damage has been proximately caused\" to the Association.\n\nThe plaintiffs further charge that under the terms of sale and due to the clear and certain sources of income from the Dairy business, acquired by the purchaser with no actual investment, the purchaser was reasonably assured of being able to make all future payments under the contract \"without providing a single dollar of its own to be paid as consideration for this purported sale, which closely approximated, and was in substance, a gift of corporate assets of substantial value which had cost the Association not less than $5,000,000.\"\n\nParagraph 10 alleges the false and misleading statements in regard to the Embassy Dairy sale in the Association's Report for 1960 issued in February, 1961. In this report the following is alleged to appear:\n\n(a) The sale was described as made to \"a Washington businessman\" and elsewhere as one made to \"Irving D. Berger,\" and no mention was made of the true identity of the corporate purchaser or those interested in it.\n\n(b) The installment payments were represented to be \"adequately secured,\" whereas they were in fact unsecured, no security whatever being taken as shown by exhibit F.\n\n(c) The sale was described as being at a \"capital gain of $450,000\" whereas the sale was consummated without profit and in fact at a loss, as shown by exhibit F and by the facts already alleged as to the cost basis for the property.\n\nIt is alleged that the directors who approved the sale are the same defendant directors who were responsible for issuing the Annual Report for 1960, early in 1961, except that Marsh was no longer on the Board and Day was then a member of the Board. The plaintiffs charge that the issuance of the false and misleading statements to the members by the directors mentioned \"constituted a violation of the fiduciary responsibility of directors to the Association and to its members, and was likewise an act of reckless mismanagement.\"\n\nParagraph 11 describes a false statement in regard to the sale of Embassy Dairy in the Annual Report for 1961, issued in early 1962, in which it was stated that there was a \"gain on sale of fluid milk division $435,794.\" The allegations are similar to those in Paragraph 10. The defendant directors alleged to be responsible for this false statement were: Adams, Clark, Cockerill,\n\nDay, Gladhill, Hahn, Harlan, Huff, Kirkpatrick, Martin, Miller, Jr., Norman, Remsberg, Stull, Toms, Van Metre and White. Remsberg, as president, and Gladhill, as vice-president, are alleged to have particularly considered and approved the 1961 Report as did Clark, Day, Gladhill, Kirkpatrick and Miller of the executive committee and Gladhill, Hahn, Harlan and Norman of the finance committee. The same charges of breach of fiduciary responsibility and of reckless mismanagement are made.\n\nParagraph 12 alleges the facts and circumstances in regard to the allowance of a $500,000 discount on the Embassy Dairy purchase price in 1963. It is alleged that in 1963, by action of the Board, a discount of $500,000 on the Embassy Dairy purchase price was allowed thereby reducing the ultimate price paid from $3,250,000 to $2,750,000. On information and belief, it is alleged that Metropolitan resold the Embassy Dairy to another corporation, Eastern Food Products, Inc. (Eastern), which declined to assume the balance due but offered to pay the balance due, less a discount of $500,000. The Association collected nothing on the endorsement of the $3,000,000 note by \"Irving D. Berger,\" nor did the Association and the defendants pursue the bulk sale remedies available to it on the transfer by Metropolitan of the assets of Embassy Dairy to Eastern which is especially significant since Metropolitan claimed that it was without assets to pay the note to the Association. The directors named as defendants who approved the arrangement were: Adams, Cockerill, Crossman, Jr., Day, Fouche, Gladhill, Hahn, Harlan, Huff, King, Martin, Jr., Miller, Jr., Norman, Remsberg, Sanford, Jr., Sollengerber, Stull, Toms, Van Metre and White. President Remsberg and vice-presidents Norman and Gladhill, as well as Miller, Stull, Day, Crossman and Adams of the executive committee and Gladhill, Hahn, Norman, Harlan and Miller of the finance committee, particularly considered and approved the arrangement. The plaintiffs charge that the action \"was grossly negligent and improvident and was an act of reckless mismanagement\" resulting in loss to the Association of $500,000 plus future interest payments and, in the alternative, that the loss resulted from two grossly negligent and improvident acts, i.e., (1) approving the terms of sale without cash or security as was done in 1960 by the then Board, listed in Paragraph 9, and (2)\n\napproving the discount in 1963. The defendants who assented to both transactions and were members of the Board at both times were: Crossman, Jr., Gladhill, Hahn, Huff, Martin, Jr., Miller, Jr., Norman, Remsberg, Toms and White.\n\nParagraph 13 alleges the facts in connection with the misleading statement in the 1963 Annual Report of the Association in regard to the Embassy Dairy matter and particularly the $500,000 discount. Not only were the statements in the 1960 and 1961 Annual Reports indicating a gain of $450,000 or $435,795 never corrected in any future operating report (the discount of $500,000 in 1963 would on its face convert the so-called profit into a loss), but the discount was not in any way connected with the Embassy Dairy sale. In the 1963 Annual Report the only item appearing was in the \"Statement of Members' Revolving Reserve Fund\" appended to the 1963 financial statements as follows: \"Discount allowed on Payment of Eastern Food Products, Inc. Note $500,000.00.\" Eastern Food Products, Inc. was not the purchaser named in the Memorandum of Agreement itself, the 1963 Annual Report made no mention of the transaction in the text and there was no indication in the Report that this was a note given in connection with the so-called sale \"to a Washington businessman\" of the assets of Embassy Dairy. The directors in office in 1964 and listed in Paragraph 4 are deemed responsible for the misleading statement which is alleged to be an \"act of reckless mismanagement\" by those defendants.\n\nParagraphs 14 and 15 allege the relationship of the Embassy Dairy sale to the divestiture orders of the District Court in the anti-trust case. It is alleged that the Agreement of January 1, 1961, was submitted by the Association to the District Court solely for a determination that it complied with the Court's divestiture orders of January 20, 1959, and June 30, 1960, and was approved by the court on November 22, 1960. The agreement was consummated on or about January, 1961, and thereafter the $500,000 \"discount\" was allowed. The Agreement of January 1, 1961, provided that certain employees would be released by the Association and taken over into the employ of the purchaser, especially naming one \"J. R. Parks\" to be so transferred. Parks was the operating general manager of the Association\n\nfor the Dairy and was transferred to become, and became, the general manager of the operation for the purchaser. On information and belief, the plaintiffs allege that the Association continued to pay regular compensation for services and \"advice\" to Parks and further guaranteed him against loss of his position and salary, thus violating the spirit and intent of the divestiture orders and exceeding the authority given the Association by the order of court approving the sale in that such an arrangement constituted a reservation of power to influence the purchaser's conduct and thereby vitiated the court's requirement of complete divestiture in good faith. This exposed the Association to a charge of contempt of the anti-trust order of the District Court with resulting heavy liabilities by way of penalty. The defendant directors responsible have already been specified in prior paragraphs and the plaintiffs charge that this violation was \"illegal and an act of reckless mismanagement\" on the part of the directors responsible.\n\nParagraph 16, in effect, summarized with respect to the matters set forth in Paragraphs 8 to 15 inclusive the \"gross mismanagement, gross negligence and dereliction of duty\" of the directors alleged to be responsible, as follows:\n\n(a) Authorizing and approving the Embassy Dairy purchase for $4,890,000 and making extensive additions without prior clearance as to anti-trust matters from the Department of Justice.\n\n(b) Approving the price which was, on information and belief, grossly excessive in view of the finding of the District Court.\n\n(c) In wasting large sums, exceeding $50,000, in fruitless litigation to sustain an indefensible transaction.\n\n(d) In hastily entering into a sale of the Embassy Dairy property on January 1, 1961, with a purchaser of doubtful responsibility, without any actual down payment and on terms which amounted to a gift of corporate assets.\n\n(e) In concealing from members and misrepresenting the true terms and conditions of the sale and even the identity of the purchaser.\n\n(f) In falsely representing that future payments were \"adequately secured\" when they were unsecured.\n\n(g) In representing that the sale was made at a profit when in fact it was made at a loss.\n\n(h) In wasting $500,000 of members' funds by allowing a \"discount\" to the purchaser or its successor.\n\n(i) In making the misleading statements in regard to the \"discount.\"\n\n(j) In continuing and approving compensation to Parks, thereby exposing the Association to a contempt charge.\n\nParagraph 17 alleges certain facts in regard to the acquisition of the capital stock of Richfield and Simpson Bros., trading as Wakefield Model Farm Dairy (Wakefield). It is alleged that the price was in excess of $1,000,000 but the exact amount has not been disclosed. The 1958 Annual Report of the Association, however, does disclose that \"these companies were facing bankruptcy and unable to pay their milk bill.\" This stock investment was placed among the assets of Embassy Dairy which was operated as the \"fluid milk division\" of the Association. Complaint was made in the anti-trust litigation of the acquisition of Richfield and Wakefield and, following the decision of the Supreme Court of the United States which sustained the complaint as to these properties also, the consent decree of November 22, 1960, required the Association to divest itself of these assets also. The total investment in the three dairies made in violation of the anti-trust laws, including the purchase prices, improvements and additions, exceeded $5,000,000, all of which assets were sold, as above indicated, for no additional consideration, thereby further adding to the loss resulting to the Association from the sale, which loss resulted from gross negligence on the part of the defendant directors already specified in prior paragraphs.\n\nParagraphs 18, 19, 20 and 21 allege certain facts in regard to Hooper and Robinson, the alleged improvident settlement with them and the suppression of the full Dugan Report.\n\nIn Paragraph 18 it is alleged, on information and belief, that the defendants Hooper and Robinson had prior to 1963, in flagrant disregard of their fiduciary responsibilities as trusted agents and officers of the Association and by making use of their official positions and powers, consummated the following acts of personal aggrandizement at the expense of the Association:\n\n(a) Robinson acquired large tracts of agricultural land near Laurel, Maryland and sold it to the Association at a substantial profit, although the land was not needed for Association purposes the description, amount and cost of the land being unavailable to the plaintiffs but included in the Association's records.\n\n(b) Robinson acquired a milk processing plant near Laurel, known as \"Olney Acres Dairy Products Plant\" (Olney Acres), which he sold to the Association on December 1, 1955, for $1,000,000, representing a large and unconscionable profit to him. Here again the figures are unavailable to the plaintiffs, but they believe they are included in the Association's files and records.\n\n(c) While Hooper was Secretary-Treasurer and General Manager of the Association and Robinson was manager of the Laurel plant, they acquired or constructed a milk plant in Florida and, in a short time, diverted over $1,300,000 worth of gross business from the Association's Laurel plant to their Florida plant, the diversions being consummated by mere entries in the books of the Laurel plant, \"constituting clear misappropriations of assets of the Association by said Hooper and Robinson.\"\n\n(d) They purchased milk products from the Association at a low price and sold the product at a high price to customers of the Association.\n\n(e) When they were questioned as to these operations they caused the Association to buy the Florida plant from themselves at an excessive price after that plant was no longer operating.\n\n(f) Robinson personally went into the business of owning and operating trucks and, by means of his official position, required the products of the Laurel plant to be hauled and delivered in his trucks.\n\n(g) Hooper and Robinson caused the Association to pay certain excess percentage compensation to Robinson aggregating over $130,000 in one year by paying members of the Association too little for their surplus milk and thereby inflating and overstating the profits of the plant so as to result in higher compensation for Robinson under the excess percentage arrangements made by the Association.\n\n(h) They caused the Association to employ inexperienced and incompetent relatives of Hooper and Robinson in positions of trust at the Laurel plant and elsewhere in the employ of the Association.\n\nParagraph 19 alleges the following:\n\n\"During the year 1964 the then directors of the Association listed in paragraph 4 as defendants, having had some or all of these matters brought to their attention, reached a wholly improvident settlement with the defendants Hooper and Robinson by which said defendants resigned or were removed as officers, agents and employees of the Association, but their alleged rights to salary, compensation and severance pay were recognized, notwithstanding the clear forfeiture of all such rights by reason of their conduct; by which said defendants paid the wholly inadequate sum of $95,000.00 out of their gains illegally obtaining from the Association, as well as said alleged rights to compensation aggregating approximately $40,000.00 for a general release from the Association. Such settlement was wholly unreasonable and unjustifiable, allowing them to retain hundreds of thousands of dollars of gains, profits and benefits illegally taken from the Association. On information and belief, such settlement was made by said defendant directors without adequate investigation, without the exercise of due care and indeed in reckless and flagrant disregard of the rights of the Association and its members.\"\n\nIn Paragraph 20, Subparagraph (a), the plaintiffs allege the source of detailed and specific statements in regard to certain of the wrongs committed by Hooper and Robinson in a Special 1964 Report prepared by the Association in the summer of 1964 for the purpose of oral presentation to regional meetings of the Association. This Special 1964 Report is attached as a part of the complaint as exhibit G. The plaintiffs allege that they believe the statement of facts in the Special Report is true and adopt all of that statement of facts as their own.\n\nExhibit G consists of 16 printed pages in the Record Extract.\n\nIt is entitled \"Statements of Facts Contained in Special 1964 Report Prepared by Maryland and Virginia Milk Producers Association.\" This Statement first gives the background in regard to the employment arrangements and contracts of Hooper and Robinson. Hooper had been employed by the Association for 29 years prior to his dismissal. He became General Manager and Secretary-Treasurer in 1956. His most recent management contract provided for a salary of $30,000 a year, plus deferred compensation at the rate of 1% per year on any earnings of the Association in excess of the value of milk as determined by Federal Order #2 (which amounted to $50,855.55 in the Reserve Account as of December 31, 1963), plus a Pension Plan furnished by the Massachusetts Mutual Life Insurance Company and plus the use of a residential property at Lake Barcroft, Virginia, for a monthly rental of $200, which was carried on the Association's books at a net value of $60,422.12 (the cost of the residence is not stated) and which Hooper had the right to purchase at its net value at any time during his employment or within six months after termination of employment.\n\nExhibit G next describes how Robinson came to be employed by the Association. On November 14, 1955, the Association purchased from Robinson and his then partner Melvin Berman the manufacturing dairy products business then being operated as Olney Acres Dairy Products in Laurel, Maryland. The purchase price was $1,000,000 for the business and approximately 20 acres of land with improvements. Additional land was acquired from the parties around July 31, 1957. As of December 31, 1963, the Association's total capital investment, less depreciation, in its Laurel Manufacturing Division was $3,549,725.24. In the beginning, Robinson and his then partner Berman were employed as managers. Their compensation was 5% each of the net profits resulting from the operation of the Laurel plant, the maximum compensation for each not to exceed $20,000 a year or a total of $40,000. Berman later withdrew and thereafter Robinson was sole manager and received 10% of the net profits resulting from the operation of the Laurel plant. In his latest employment contract Robinson was obligated to \"cooperate fully with the General Manager and the Board of Directors in carrying out all policy directives\" and he was obligated as follows:\n\n\"The said Robinson agrees to devote such time to the management of the said business as may be necessary to conduct said business at the highest degree of efficiency, and said business shall, at all times, * * * have a first call upon the time and effort of the said Robinson, but he shall have the right, subject to the foregoing, to engage in other businesses for his own account, providing said business or enterprise shall not conflict with the interest of the Association.\"\n\nThe exact figures for the net profits from the operation of the Manufacturing Division, 1958-1963, are then given as follows:\n\n1958 $360,302.14\n\n1959 827,450.55\n\n1960 1,003,700.97\n\n1961 1,020,875.58\n\n1962 563,732.41\n\n1963 383,213.49\n\nTotal Net Profit $4,159,435.14\n\nRobinson received the following compensation from 1958 through 1962:\n\n1958 $40,000.00\n\n1959 64,602.66\n\n1960 77,376.20\n\n1961 113,430.62\n\n1962 62,636.93\n\nThe Statement then gives an account of the various transactions which finally led to the change in management. The first one was in regard to Harrison Dairy Products, Inc. in Jacksonville, Florida. The purchase arrangements and the proposed operations by Hooper and Robinson of these Florida dairy facilities \"were never officially or formally approved by the Board * * * at any time prior to the commencement of the operation or the making of the investment.\" The Statement then sets forth the following:\n\n\"Professor Dugan's Fact Finding Report, to be referred to later on, has developed certain information\n\nwhich shows that from time to time, Mr. Hooper and/or Mr. Robinson advised the President of the Association and some of the directors that an investment had been made in the Harrison operation; but on each of these occasions, the advice given was either extremely nebulous or gave the impression that the program had been embarked upon by these two employees for the purpose of benefiting the Association in its effort to gain new markets in the State of Florida.\n\n\"Later on, it developed that the actual ownership of the stock in Harrison Dairy Products, Inc. had been placed by Robinson and Hooper in the names of their respective children and Mr. Hooper's wife. This fact, when brought to the attention of the President of the Association in the Fall of 1961, caused him to conclude finally that \"This will never do', with the result that he brought the matter to the attention of the Board of Directors. At that time, the Board was not possessed of any details regarding the day to day sales operation of Harrison, but the little it did know about the operation convinced it that it represented the nucleus for a possible conflict of interest.\"\n\nIn January, 1962, the Board sent the Executive Committee to Jacksonville to inspect the Harrison operation. This Committee after its trip, voted on February 9, 1962, to recommend to the Board that Harrison Dairy Products be purchased by the Association from Hooper and Robinson who were acting as voting trustees for their families. The Board on the same day, February 9, 1962, adopted the recommendation and authorized the purchase \"-- the sole purpose of the Board being to try by every means available to eliminate any possible area for conflict of interest among its employees.\" Kendrick was authorized to audit the Harrison operation and to furnish a Certified Balance Sheet and Profit and Loss Statement for Harrison as of March 21, 1962, and to supply certified figures on which the purchase price could be based.\n\nAfter the reports were completed, the Association entered into an agreement to purchase the entire Harrison operation for\n\n$81,341.27. The details of the payment of the purchase price were given. $40,000 was paid upon the signing of the agreement, $20,000 on June 1, 1962, subject to certain possible adjustments and the balance of $21,341.27 when written proof was received from the Internal Revenue Service of the approval of the Harrison return for the period ended October 31, 1961, if no additional income tax were assessed, and if assessed, the additional amounts would be deducted from the purchase price. After the purchase of Harrison, this corporation was dissolved and the Jacksonville operation became the Jacksonville, Florida Manufacturing Division of the Association. The specific figures for the operation of this Division are given and may be summarized as follows:\n\n(a) For the six months ended December 31, 1962, the sales from Cottage Cheese, Skim Powder and Sterile Milk amounted to $110,854.79 upon which a net profit of $5,045.53 was made.\n\n(b) For the year 1963 the sales were $250,784.58 and there was a net profit of $14,032.38.\n\n(c) These figures are compared with the sales and net profit for the 5 1/2 month period of control of the same operation by Hooper and Robinson prior to the sale, from May 8, 1961, to October 31, 1961, during which period the sales amounted to $749,352.03 with a net profit, before income taxes of $54,085.26, so that the sales were three times larger during the 5 1/2 month period than for the entire year 1963 and the net profit was $54,085.26 as contrasted with approximately $19,000 for the 18 month period ending December 31, 1963. It is then stated:\n\n\"These facts constituted a danger signal which convinced a large segment of the Board of Directors that a thorough, independent Fact Finding Study and Audit were absolutely essential. In fact, some members of the Board itself had already commenced to make independent studies of their own to determine what was wrong and why.\"\n\nThe Statement then turns to a consideration of the Mutual Milk Sales, Inc. and Mutual Milk Sales Packaging Division, Inc. (Mutual) transaction at Oneida, New York. Robinson, unknown to the Board when it authorized the purchase of Harrison,\n\nhad \"already embarked upon another brand new venture in the State of New York.\" Robinson formed these Mutual corporations to construct a milk processing plant in Oneida very similar to the Association's Laurel Plant for the Mutual Milk Producers Federation of New York, a federation consisting of 53 bargaining cooperatives comprised of approximately 6400 members. This venture began around June, 1961, and proceeded until the construction of the plant was completed in 1962 Robinson's participation in this venture had no formal or official approval of the Board or of the President of the Association. Robinson not only participated in the construction of the Oneida plant, and in its sale to the Mutual Federation, but later on accepted employment as manager of the operation of that plant. These activities on top of the Harrison problem, together with several \"other unanswered questions then pending before the Board\" involving Robinson's management policies and practice at Laurel, resulted in the Board's refusal to renew Robinson's employment contract when it expired on December 31, 1963.\n\nThe Statement then gives the event which precipitated action by the Board. On November 8, 1963, James E. Click (Click), Assistant Secretary of the Association, tendered his resignation and presented a statement of charges against Hooper. After a general discussion the Board refused Click's resignation and adopted a resolution that a committee of the president and the first and second vice-presidents make a full investigation of the affairs of the Association and that sufficient funds be appropriated for that purpose. At a Special Meeting of the Board on November 22, 1963, the powers of the investigating committee were delegated to the Plant Committee which was then empowered to take the steps deemed necessary to inquire into the affairs of the Association and to report its findings to the Board as quickly as possible. The Board also decided that Edward J. Merrigan (Merrigan), the Association's new General Counsel, be forthwith invited to attend all meetings of the Board.\n\nThe employment of Professor Frank J. Dugan (Professor Dugan), of the Georgetown University Graduate Law School, was then described. Professor Dugan, who enjoys a national reputation as a fact-finder, arbitrator and as a former Dean of the Graduate Law School, was employed by the Association to\n\nact as Special Counsel for the purpose of developing the relevant facts in regard to the recent management and operation of the Association with particular reference to the Harrison Matter and the operation of the Manufacturing Division. The Plant Committee made arrangements with Kendrick to work closely with Professor Dugan, and Merrigan was authorized to cooperate. Professor Dugan was authorized to take statements from any officer, director or employee of the Association and to employ a court reporter to transcribe the testimony. He heard 19 witnesses and took 1467 pages of testimony as well as examining hundreds of pages of files and documents. Witnesses were afforded the right to counsel. The investigation took place from December 4, 1963, to February 10, 1964. Professor Dugan filed a 75-page Confidential Report, containing his recommendations and conclusions. Kendrick, who had replaced E. C. Clifford, the regular accountant, was in constant communication with Professor Dugan and, together with Merrigan, they developed detailed audit reports, supported by various records, in regard to the Harrison matter, the Mutual affair and the Laurel Manufacturing Plant relations with both.\n\nThe Statement then gives the \"essence\" of Professor Dugan's Report, based upon the investigation and audit. The Harrison and Mutual transactions are the ones principally covered.\n\nIn regard to Harrison, it is stated that after the sale by Harrison of ice cream mix in the Jacksonville area became unprofitable, Hooper and Robinson devised a plan whereby sales made by the Association's Laurel Manufacturing Division were simply diverted, through bookkeeping entries only, to Harrison, which received the benefit of a \"paper\" price mark up on each diverted sale. Some of the sales were diverted from old customers of the Laurel Plant, and in those cases the orders from the old customers were taken at the Laurel Plant and were filled with a product manufactured at the Laurel Plant. On the books of the Association, however, the sale was credited to Harrison but no delivery was made from Laurel to Jacksonville. On the contrary, delivery went directly from Laurel to the old customers. Harrison's books, kept under the same Division Manager who directed the bookkeeping employees at Laurel, reflected each of these alleged \"purchases\" by Harrison from the Laurel\n\nPlant, but at a price considerably below that which Harrison's books showed as the price per pound charged to the actual customer. In short, Harrison was interposed as a \"Phantom broker\" between the Association and the old customers of the Association, which lost the difference in price thus gratuitously given to Harrison. None of the old customers -- with one exception -- was located in Florida, but were located in Maryland, Virginia, New York or Wisconsin. Robinson was, in effect, simultaneously sole salesman for both Harrison and the Laurel Plant. Any \"new\" customers developed by Robinson to purchase through Harrison obviously could and should have been credited directly to the Association, without the price differential or brokerage in favor of Harrison. Here again, the deliveries were made directly from the Laurel Plant to the new customers, Harrison's function being exclusively to collect the uncalled for \"paper\" profit.\n\nSubstantially the same arrangement was made in regard to the Mutual transaction by Robinson. Robinson made a deal with Weldon Farm Products (Weldon), a New York export company, toward the end of 1961 whereby Weldon and other exporters were told they could buy skim powder to be manufactured at the new Mutual Oneida Plant at a certain price and that Robinson would guarantee the price. The construction of the Oneida Plant ran into delays and work was stopped entirely on the construction of that plant in the fall of 1961 and did not commence until April 19, 1962. To supply the skim powder, Robinson turned to the Laurel Plant and employed a \"Harrison-type\" bookkeeping arrangement whereby the Association sold (on the books only) to Mutual and Mutual resold to Weldon. These shipments, however, were made directly from the Laurel Plant to Weldon, but Mutual received a very substantial brokerage fee or price differential on those sales. Mutual paid the Association $800,452.68 for the product, but Mutual resold to Weldon for $946,318.42. Mutual did pay the freight. The gross profit to Mutual from the bookkeeping entries amounted to $100,256.23. The \"back-up papers\" clearly established that all sales from the Association were made directly to Weldon from the Laurel Plant without going through any facilities of Mutual. It is then stated:\n\n\"The Association, through its General Counsel, Mr. Merrigan, formally requested Mr. Robinson to produce the books of Mutual Milk Sales, Inc. and Mutual Milk Sales Packaging Division, Inc. to show exactly why a price differential or mark-up was allowed to Mutual, but while Mr. Robinson agreed to cooperate, he finally limited this production to sales invoices only. The books of the Mutual corporation were never produced.\"\n\nHooper, when confronted by Professor Dugan with the Mutual-Weldon transaction, stated that he thought that Mutual was a part of Weldon and that when he checked the prices they did not seem out of line with Government sales. When asked why the fact that skim powder sales to Mutual were \"consistently the lowest the Association was getting, and usually below the Government support prices,\" did not put him on notice, he stated:\n\n\"* * * in the light of what has come up, I would certainly question it, but at the time I did not, except to discuss it with them as to whether or not it was in the best interests of the Association, because I did not want to get any more stuff in Government warehouses.\"\n\nAs a result of the Dugan Report and audit, the Board, at its meeting of February 12, 1964, voted that Hooper be asked to resign. Hooper claimed he had a contract with the Association which he intended to work under, wished to consult his attorney and did not consider the matters alleged to justify termination of his contract. The Board then adopted a motion relieving Hooper of his duties as General Manager and removing him as Secretary-Treasurer. Hooper's employment contract had terminated at the end of 1963, and had not been renewed. It is stated that the Board's reasons for terminating Hooper's employment were: (1) the Board felt that Hooper's contract of employment had expired like Robinson's, at the end of 1963, and (2) that under the By-Laws the General Manager, subject to the control of the Directors, was fully responsible for carrying on the entire business of the Association; a majority of the\n\nBoard felt that the facts disclosed in the Dugan Report made Hooper responsible directly or indirectly for the over-all losses sustained. The Statement ended with the following summary:\n\n\"In summary therefore, the crucial facts concerning Mr. Hooper were (1) his direct involvement in the Harrison operation and (2) his failure to stop the price advantages given to Harrison and Mutual, even though those prices generally were below the Government support prices and they were consistently lower than those allowed to other customers of the Association's Manufacturing Division. Proof of this last fact is evidence since both Harrison and Mutual were able consistently to 're-sell' the products they purchased from our Laurel Plant at higher prices than those they regularly received from this Association.\"\n\nIn Paragraph 20, Subparagraph (b), it was alleged that Robinson and Hooper, until their resignations or removal from office in 1964, \"did in fact administer and direct the entire business of the Association.\" All of the funds, books and accounting of the Association were entrusted to their hands by the Board. Hooper and Robinson by reason of their power and authority \"were in fact fiduciaries to the same extent as if they had been the chief executive officers of the Association.\" It is then alleged:\n\n\"Said delegations of power and authority to Hooper and Robinson by the Board of Directors were unreasonable and excessive and placed in the hands of said individuals the power to defraud the Association and misappropriate the large sum shown in Exhibit G.\"\n\nIn Subparagraph (c) it is alleged that Hooper and Robinson together misappropriated corporate assets, funds and business as described in exhibit G, and in so doing, \"they together violated the fiduciary obligations which they had assumed with respect to the operations of the entire business, and more particularly, the Laurel Plant.\"\n\nIn Subparagraphs (d) and (e) it is alleged that the facts set forth in exhibit G demonstrate a conspiracy between Hooper\n\nand Robinson to misappropriate corporate assets, funds and business and to collectively defraud the Association. In doing this they became constructive trustees of all of the assets and property so obtained by the Association. Each participated in the breach of trust by the other. The Association continued to hold equitable title to the diverted property and hence Hooper and Robinson could not by paying back part of the misappropriated property extinguish the Association's equitable title to the remainder of the property; the so-called release, obtained by them for an inadequate consideration was, and is, void and should be set aside by the Court.\n\nIn Subparagraph (g) it is alleged that notwithstanding the disclosure of the facts appearing in exhibit G to the Board, the Board \"remained 'very significantly divided when it came time to vote on whether Mr. Hooper should have been terminated as general manager, and previously on the question of whether Mr. Robinson should have been retained at the Laurel Plant.'\" It is then alleged as follows:\n\n\"In the light of the manifest frauds committed by said defendants, complainants charge that only persons subject to undue pressure and influence by said defendants, or persons implicated in their wrongful acts could have supported retaining them in office. Complainants are unable to name the directors who unreasonably supported Robinson and Hooper in said votes, but charge that those directors condoned the frauds and wrongs committed by said Robinson and Hooper, and endeavored to prevent disclosure of said frauds and wrongs to the members of the Association. The records of the Association will disclose the names of said directors, and complainants, as well as this Honorable Court, are entitled to full disclosure thereof.\"\n\nParagraph 21 of the complaint considers the Dugan Report. It is alleged that it was promulgated in 1964; that Parish and other members repeatedly requested that they be permitted to examine it; that the defendants have conspired together to suppress it; and, that President Remsberg, at the Annual Meeting in February, 1964, advised that the Report was being prepared\n\nand as soon as it was completed members would be permitted to examine it, \"but the said defendant directors have refused to honor said promise and commitment by the then chief executive officer of the Association.\" It is then alleged:\n\n\"On information and belief complainant charges that the suppression of said Report is not justifiable for any corporate purpose, and the said defendants have suppressed the same because of apprehension that it may lay the foundation for imposing personal liability on them for huge losses suffered by the Association.\"\n\nIn Paragraphs 22 and 23 it is alleged that certain of the defendant directors, whose identity is not available to the plaintiffs at this time, have further conspired together \"to suppress, color and falsify information rightfully due the members\" in regard to the operation of the Association, both in its Annual Reports and otherwise, and by doing this, have hindered and obstructed efforts to bring the defrauders to justice over a long period of years by lulling the members into a false sense of security causing them to take no action until after the running of the three-year statute of limitations as to many of the acts complained of (if the statute of limitations is applicable) and by the delay and obstructions have made it more difficult to ascertain and prove the necessary facts to establish these claims. It is also alleged that certain defendant directors, whose identity is not presently available to the plaintiffs, have fraudulently concealed the causes of action complained of and have collectively fraudulently concealed and conspired among themselves and with others to conceal those causes of action.\n\nIn Paragraph 24 it is alleged that the conspiracy, already mentioned, to withhold the facts disclosed in the Dugan Report is demonstrated by the conduct and remarks of an authorized representative of the Board at the Annual Meeting of members on February 22, 1965, contained in an excerpt from the transcript of that meeting filed as part of the complaint as exhibit H. This exhibit gives the colloquy between Merrigan, the general counsel of the Association, and Mr. Fulks, a member of the Association. Fulks put the direct question to Merrigan: \"Can I, as a member, can I ask to see the * * * original Dugan\n\nReport? Can I read it, can I have it?\" Merrigan replied that \"It is a matter involved in a court proceeding.\" Fulk persisted and stated: \"* * * Can I see it or can't I see it? Is it under the rug and the directors standing on it?\" After denying that it was under the rug and the directors standing on it, Merrigan stated: \"There is nothing in the Dugan Report essentially that has not already been told you. Did you attend the meetings last spring, when the directors made a report to you, at your district meeting?\" After Fulks stated that he was in Florida at that time, Merrigan stated: \"In any event, the substance of the Dugan Report has already been made available to most of the members -- to all of the members who attended their district meetings.\" After giving the background of the employment of Professor Dugan, Merrigan stated:\n\n\"It was a fact-finding thing. Professor Dugan who made the report insisted as part of his own employment that he would do that only if his report would be confidential, because he wanted to make an honest straightforward answer which could not be used anywhere else against him, if he went out and did an honest job. He took approximately two or three thousand pages of testimony and then made a report which he himself wrote across the front cover 'confidential,' meaning that it was for the use of the Board. The day that report was filed with the Board, the Board took certain extreme actions against some employees at that time. All of this was involved -- could have been involved in litigation which would not have helped your backyard poultry one bit, either. So the Board of Directors in their best judgment have not put it on the front page of the Washington Post or in the Culpeper newspaper or in the Frederick newspaper as other people are trying to do. But there is nothing in that report that essentially any member should not already know if he went to his meetings last spring.\n\n\"The answer is the Dugan Report will not be circulated around to people that want to put it in the newspaper until a court says we should do that, and\n\nthen it is no longer our judgment, it is the court's judgment.\"\n\nMerrigan further stated that Professor Dugan made the report acting in his professional capacity as an attorney and that he \"insisted that the attorney-client privilege cover it. He made it to the Board.\" When again pressed by Fulks as to whether he could see the Dugan Report, Merrigan replied, \"The answer at the present time is no, because the matter is involved in a court proceeding.\"\n\nIn Paragraph 25 the participation and conspiracy of Kendrick, the accountant, to conceal the true facts, in regard to the derelictions of Hooper and Robinson and the losses to the Association in the sale of the Embassy, Wakefield and Richfield Dairy assets, by consciously issuing incorrect and misleading statements in respect to these matters are alleged. The details are then given. There was no disclosure in the 1963 financial statements, certified by Kendrick under date of February 7, 1964, of the improper Hooper and Robinson diversion of $1,300,000 of the Association's business to their Florida plant by book entries, although these matters had been brought to Kendrick's attention. The 1961 financial statements issued by Kendrick and included in the 1961 Annual Report of the Association included a \"so-called\" capital gain of $435,794 on the Embassy sale, without disclosing that the sale included the Wakefield and Richfield stock, and that losses or charge-offs exceeding $1,000,000 applicable to these assets had been incurred. The fictitious capital gain was carried into the operating statement for 1961; yet in 1963 when the $500,000 discount was allowed applicable to this sale, this was not included in the operating statement or mentioned in any footnote to the statement. The only mention of the transaction was contained in a charge to surplus identified as \"Discount allowed on payment of Eastern Food Products, Inc. Note $500,000.00.\", which, it is alleged, \"Kendrick well knew * * * did not identify the loss as applicable to the Embassy Dairy sale and therefore must be deemed to have intentionally concealed the fact from the members of the Association to whom said Report was issued.\"\n\nIn Paragraph 26 it is alleged that because of the long course of conspiracy and concealment of facts from the membership,\n\nthe members were not in a position to vote intelligently at the Annual Meeting of February 22, 1965, and to have determined whether the defendant directors should have been replaced by new directors and further that they will never be able to vote intelligently until they have full information in regard to the acts of management made available through this litigation or otherwise and particularly until the Dugan Report is made available for circulation among the members. A resolution was made at the February 22, 1965, meeting of members to express confidence in the directors and to pay any judgments rendered against them. The plaintiffs voted against this, endeavored to be recognized to speak against it, but the minutes, on information and belief, state that only one person, \"Mrs. Wharff\", voted against it, even though there was a large vote in opposition. It is alleged that the resolution is without legal significance, but it demonstrates that the present officers and directors are now in control of the Association and \"it would have been wholly futile\" for the plaintiffs to apply to the membership with any reasonable hope that any might authorize the filing of a suit against directors in the name of the Association.\n\nIn Paragraph 27 the times and circumstances in regard to when the plaintiffs discovered the wrongs complained of in the complaint are set out. Without giving the detailed facts alleged, it is sufficient to state that the plaintiffs did not learn of the wrongs, or facts putting them on notice, until 1964 (the plaintiff Wenger knew some facts in either December 1963 or January 1964). Parish learned of the Hooper wrongdoing in February, 1964, when they received a circular letter from M. Belmost Verstandig, the public relations official of the Association, complaining of the dismissal of Hooper by the Board \"on the ground that everything that Mr. Hooper had done was done with the full knowledge of the Board of Directors and with their full consent and approval.\" The derelictions of Hooper and Robinson were announced by Remsberg, as president of the Association, at the Annual Meeting late in February, 1964. The plaintiffs learned in late 1964 of the substantial losses in the Embassy sale, and were prevented from learning of these facts earlier by the fraudulent concealment by the directors. Beginning in May, 1964, the plaintiffs were advised, at regional meetings\n\nof the Association, that the investigation had been completed and \"an outline of the expected and promised Dugan Report was read orally to those present at such meetings.\" The plaintiffs asked to see and obtain a copy of the outline of the Dugan Report but these requests were refused. Parish, \"also sought and obtained the signatures of more than five percent of the members on petitions requesting access to the books and records of the Association but said request was denied as not being in proper form.\" Parish propounded questions, answers to which were refused. Present counsel was employed in November, 1964, who immediately investigated the claims and filed with reasonable diligence a complaint in the Circuit Court for Baltimore County, followed by filing the present complaint on February 4, 1965. The other plaintiffs intervened on April 7, 1965.\n\nThe prayers for relief are that:\n\n1. The individual defendants be required to account to the Association for all profits derived by them from dealings with the Association with respect to the matters alleged in the complaint;\n\n2. The individual defendants, including Kendrick, be determined and decreed to be jointly and severally liable to the Association for all losses suffered by it \"through acts, connivance, negligence, culpable inattention and derelictions of duty of them and each of them\";\n\n3. The purported general releases to Hooper and Robinson should be set aside and cancelled;\n\n4. The Association be ordered to institute and maintain appropriate litigation by independent counsel in other jurisdictions against persons named as defendants in this suit who cannot be reached by the court's process; and\n\n5. The plaintiffs have other and further relief.\n\nThe complaint is followed by an affidavit by Frank P. Parish, one of the plaintiffs, that the facts alleged \"are true and correct, except as to allegations made on information and belief, and as to such allegations, he has made a reasonable investigation thereof and certifies them to be true and correct to the best of his knowledge, information and belief.\"\n\nThe demurrers of the various parties defendant raise the following questions for our consideration:\n\n1. Does the complaint allege sufficient facts which constitute actionable fraud, waste of corporate assets, gross negligence or culpable mismanagement on the part of the directors?\n\n2. Does the complaint allege sufficient grounds to excuse the plaintiffs from exhausting their intra-corporate remedies before seeking to institute the present suit?\n\n3. Does the complaint allege facts which entitled the plaintiffs to disclosure of the Association's records in view of the provisions of Code (1957), Article 23, Section 51?\n\n4. Are the claims against the defendant directors which arose more than three years prior to the filing of suit barred by laches?\n\n5. Are the matters complained of in the complaint barred by the doctrine of res judicata as to those director defendants whose demurrers to the Second Amended Bill of Complaint were sustained without leave to amend?\n\n6. Do the Parish's, as plaintiffs, have standing to maintain a derivative action on behalf of the Association when they sold their cowherd in the spring of 1966?\n\n7. May a derivative suit be maintained in regard to events antedating the membership of a member of the Association?\n\n8. Does the complaint allege facts which would justify the setting aside of the general release to the defendant Robinson?\n\n9. Is the complaint multifarious as to the defendant Robinson?\n\nWe will consider these questions in the order indicated.\n\n1.\n\nWe are of the opinion that the complaint alleges sufficient facts to constitute, prima facie, actionable fraud, waste of corporate assets, gross negligence or culpable mismanagement on the part of the defendant directors.\n\nIn ruling on a demurrer to a bill of complaint, the truth of all material relevant facts properly alleged, together with the inferences which may reasonably be drawn from those facts, is admitted. See Killen v. Houser, 239 Md. 79, 210 A.2d 527 (1965), and prior Maryland cases cited in the opinion in that case. Maryland Rule 301 b permits the adoption of an exhibit by reference as part of a bill of complaint.\n\nIt has been necessary for us to set out in some detail the allegations of the complaint as the Chancellor was of the opinion\n\nthat these allegations, with their reasonable inferences, did not state actionable fraud, waste of corporate assets, gross negligence or culpable mismanagement on the part of the defendant directors. As we have indicated, we do not agree with the Chancellor's conclusion. In the Chancellor's opinion certain phrases and statements found in some of the paragraphs of the complaint are selected and these selected portions are treated as representative of the entire complaint. These selected portions are for the most part taken from paragraphs 6 and 7 of the complaint which, as has been seen, are introductory paragraphs to those that follow. It is in these subsequent paragraphs that many of the ultimate facts of the fraud, concealment, illegality, gross negligence, waste of corporate assets and conspiracy to conceal certain losses appear. See the allegations in paragraphs 8 through 15 and 17 relating to the purchase, operation and sale of the Association's Fluid Milk Division, paragraphs 18 through 20 relating to Hooper and Robinson, paragraphs 21 through 24 relating to the concealment from the membership by the director defendants of the results of their investigation into the operation and management of the Association affairs and paragraph 25 in regard to Kendrick's participation in the conspiracy to conceal.\n\nFraud and Concealment\n\nThe fraud alleged against the director defendants and the defendant Kendrick consists principally of allegations charging them with concealment of facts which should have been accurately disclosed to the Association and its members, but which were concealed by the publication of false and misleading annual reports. A conspiracy to conceal is also alleged. See the allegations in paragraphs 13 and 21 to 24, supra.\n\nIt is well established that actionable fraud may result from the concealment of material facts as well as from the false statement of material facts. See Levin v. Singer, 227 Md. 47, 175 A.2d 423 (1961). It is equally well-settled that it is not necessary to charge the defendants specifically with \"fraud\" or with \"acting fraudulently\" if the facts alleged indicate fraud or are such that fraud is necessarily implied from the alleged facts. As was stated in 24 Am. Jur., Fraud and Deceit,  244, pages 74-75:\n\n\"Fraud may be well pleaded even though the conduct referred to is not alleged expressly to be 'fraudulent,' provided the facts alleged are such as constitute fraud in themselves or are facts from which fraud will be necessarily implied. The acts charged are not less fraudulent because the word 'fraud' or 'fraudulent' is not employed by the pleader characterizing them. In other words, an allegation of facts from which the conclusion of fraud necessarily results is sufficient. Neither law nor equity requires that the specific details of the transaction in which fraud is predicated, or facts which are merely evidentiary, be pleaded. Conversely, where fraud is sufficiently alleged, the pleading is not affected by superfluous allegations of facts not constituting fraud.\" (Footnotes omitted.)\n\nSee also 37 C.J.S. Fraud,  80, page 374.\n\nIn the present case, the plaintiffs have alleged in paragraphs 22 and 23 that there was a fraudulent concealment by certain of the defendant directors, whose identity is not yet available to the plaintiffs, and that collectively they have fraudulently concealed and conspired among themselves to conceal the causes of action of the Association. Thus, fraud has been specifically charged in the complaint after the facts establishing it have been previously alleged.\n\nThe fraud and concealment, as well as the clear breach of fiduciary duty on the part of Hooper and Robinson are specifically and graphically alleged in paragraphs 18, 19 and 20 of the complaint. Many of the specific acts of fraud, doubledealing and breach of fiduciary duty are described in detail in exhibit G, which is a statement taken, in part, from the Dugan Report and which was circulated by the defendant directors for use in oral presentation to the members at the district meetings. There appears to be no contention by the defendants that these allegations are not sufficient to charge Hooper and Robinson with fraud, concealment, doubledealing and breach of fiduciary duty. The defendants take the position that the general release given Hooper and Robinson is shown to be a complete bar on the face of the complaint. As we will point out later in this opinion, that position is not well founded.\n\nIt is clear that officers and directors of a corporation stand in a sufficiently confidential relation to the corporation's stockholders to impose a duty upon them to reveal all facts material to the corporate transactions. A. B. C. Packard, Inc. v. General Motors Corp., 275 F. 2d 63 (9th Cir. 1960). See 37 C.J.S. Fraud,  16, page 248. The confidential relation is even more apparent in a member corporation such as the Association. The allegations of the complaint indicate that the members have not been properly informed by the officers and directors of the Association in regard to the various transactions set forth in the complaint and, indeed, that the members have been deceived by the false Annual Reports. The members have been lulled into inaction and the Association has been damaged by failing to take action promptly to assert its rights so that possible defenses of limitations may have accrued and, in any event, it has been made more difficult to ascertain and have the facts necessary to establish the claims of the Association.\n\nThe complaint sufficiently alleges facts which in themselves indicate a fraudulent concealment by the defendant directors and the defendant auditor and active fraud by Hooper and Robinson as well as a fraudulent concealment by them and breach of fiduciary duty. The concealed facts were material, properly relied on by the Association and its members, and the Association's damage resulting therefrom has been alleged.\n\nGross negligence, waste of corporate assets and culpable mismanagement.\n\nIt is well established that courts generally will not interfere with the internal management of a corporation at the request of a minority stockholder or a member. The conduct of the corporation's affairs are placed in the hands of the board of directors and if the majority of the board properly exercises its business judgment, the directors are not ordinarily liable. This sound general rule, however, is subject to the important exception that directors will be held liable if they permit the funds of the corporation or the corporate property to be lost or wasted by their gross or culpable negligence.\n\nIn 1881 Judge Alvey, in Booth v. Robinson, 55 Md. 419, for the Court, reviewed the cases in this country and in England\n\nand established the Maryland law that directors were personally liable for the consequences of their gross negligence, adopting the rule expressed by the House of Lords in Overend v. Gibb, L.R. 5 H.L. 480 (1872). Booth v. Robinson was cited with approval and followed in Fisher v. Parr, 92 Md. 245, 48 A. 621 (1901); in Reus Loan Co. v. Conrad, 101 Md. 224, 60 A. 737 (1905); in Emerson v. Gaither, 103 Md. 564, 64 A. 26 (1906); in Murphy v. Penniman, 105 Md. 452, 66 A. 282 (1907); in Foutz v. Miller, 112 Md. 458, 76 A. 1111 (1910); and in Carrington v. Basshor, 118 Md. 419, 84 A. 746 (1912). In Carrington v. Basshor, the Court compared the liability of one of the directors of the Hammond Ice Company resulting from his gross and culpable negligence with the ordinary negligence of the other directors who were held not to be liable under the facts of that case.\n\nWe do not understand that our predecessors intended to depart from this well established rule by the opinion of the Court in Pritchard v. Myers, 174 Md. 66, 77, 197 A. 620, 625-26 (1938), inasmuch as the Court in the opinion in that case relies on Carrington v. Basshor, Foutz v. Miller, Murphy v. Penniman, and Emerson v. Gaither, although the language in the opinion might seem to indicate liability for the failure to exercise reasonable skill and care rather than for gross negligence. Cf. Feinberg v. George Washington Cemetery, 226 Md. 393, 174 A.2d 72 (1961).\n\nThe Maryland law is summarized in Brune, Maryland Corporate Law and Practice, Rev. Ed. 1953, Sec. 226, page 225 as follows:\n\n\"In addition to the specific statutory liabilities and penalties just outlined, a director may, of course, be liable to the corporation or its receiver for the consequences of breach of his fiduciary duties. Thus, it is said that directors are liable for 'gross and culpable negligence' in the discharge or omission of their duties.\" (Footnote omitted.)\n\nSee also 3 Fletcher, Corporations,  1048, page 639, where it is stated:\n\n\"Directors are also liable if they suffer the funds of the corporation or its property to be lost or wasted by gross negligence and inattention to the duties of the trust.\" (Footnotes omitted.)\n\nThe United States Court of Appeals for the Fourth Circuit in McQuillen v. National Cash Register Co., 112 F. 2d 877 (1940), a case governed by Maryland law, quoted with approval a summary of the Maryland law given by Judge Coleman in the District Court in the same case, as follows:\n\n\"It is not the function of a court of equity to attempt to substitute its judgment for that of the persons who are lawfully in control of a corporation's affairs, once it has been determined that their conduct is neither ultra vires, fraudulent, illegal, nor grossly negligent.\" (Emphasis supplied.) (112 F. 2d 883)\n\nIn our opinion, the complaint alleges facts sufficient to establish the liability of the defendant directors for gross negligence, waste of corporate assets and culpable mismanagement.\n\nThe Hooper-Robinson matters.\n\nThe allegations of the complaint, fortified and elaborated by the facts appearing in exhibit G, indicate that the Board placed complete confidence in Hooper, the Association's general manager, and in Robinson, the manager of the manufacturing division. Hooper had been in the employment of the Association since February 1935 and became general manager and secretary-treasurer of the Association in 1956. Robinson's employment as manager began in 1955 when the Association purchased the Laurel manufacturing dairy products business from Robinson and Berman. It is clear from the allegations of the complaint and the statements in exhibit G that Hooper and Robinson in May, 1961, conspired to defraud the Association by competing with it through Harrison Dairy Products, Inc. in Florida and diverting the Association's accounts. It is also clear that Hooper and Robinson did not obtain the approval of the Board for the operation, but, on the contrary, misled the president and some of the directors in regard to the nature of the Harrison operation. It may be that the affording of complete trust and\n\nconfidence to Hooper and Robinson at this time could be said to be only ordinary negligence, but beginning in the Fall of 1961, when the president of the Association discovered that the stock of Harrison was in the names of the Hooper and Robinson children and Hooper's wife, and certainly after January and February 1962, when the Executive Committee had been to Florida to inspect the Harrison operation, the allegations of the complaint in regard to the conduct of the Board concerning Hooper and Robinson are sufficient to indicate gross negligence and culpable mismanagement. The competing nature of the Harrison operation was clearly known to the Executive Committee and to the Board on February 9, 1962, when, extraordinarily enough, the Executive Committee recommended to the Board, and the Board accepted the recommendation, that the Association purchase Harrison from the families of the two conspirators, Hooper and Robinson, for the \"sole purpose\" to try by every means \"to eliminate any possible area of conflict of interest among its employees.\" Kendrick was instructed to make an audit of the Harrison operation as of March, 1962, in order to supply figures on which the purchase price could be based. On April 12, 1962, the Harrison operation was purchased for $81,341.27. The reasonable inferences from this are (1) that the Board had actual knowledge of the conflict in interest in which Hooper and Robinson had engaged, and (2) instead of immediately investigating the Harrison operation as it related to the Association, the Board not only failed to do this, but, on the contrary, purchased the competing operation to eliminate the conflict of interest of the faithless employees. Later in exhibit G it appears that the diversion of the Association's customers and their accounts from the Association to Harrison appeared on the books of either Harrison or the Association, or both, and the fraudulent and illegal \"brokerage fee\" or price differential could obviously have been discovered in the spring of 1962 if the indicated investigation of the Hooper-Robinson operation had been made. Moreover, other facts appeared which cried out for a complete investigation of the Hooper-Robinson operation of the Association's affairs. As appears in exhibit G, the audit of the Harrison operation showed that while Hooper and Robinson were operating the conflicting business for the\n\napproximately 5 1/2 month period from May 8, 1961, to October 31, 1961, there were sales in the amount of $749,352.03 with a net profit, before income taxes, of $54,085.26, whereas for the six months ended December 31, 1962, there were only sales of $110,854.79 with a net profit of $5,045.53 and for the entire year 1963 there were sales of $250,784.58 with a net profit of $14,032.38. This startling difference should have put the directors on inquiry to ascertain its cause. Here again the books and records of Harrison and of the Association would have disclosed the true situation.\n\nNothing, however, was done by the Board -- and apparently nothing would have been done -- until Click, the assistant secretary, on November 8, 1963, tendered his resignation and made the statement of charges against Hooper. This courageous and proper action finally caused the Board at the special meeting of November 22, 1963, to take steps to inquire into the affairs of the Association. Thereafter Professor Dugan was employed and the facts were then brought out. The Board did nothing to investigate the conduct of either Hooper or Robinson from the time of their actual knowledge of the wrongful conduct in the Harrison matter in January, 1962, until November of 1963, a period of approximately one year and ten months. If an investigation had been made the Board would most likely have discovered the Robinson Mutual venture in Oneida as the plant there was not completed until after January 1962. If this conflict in interest of Robinson's had been discovered (he participated in the construction of the Oneida plant and was employed as manager of this operation by Mutual), the entire scheme to defraud the Association would never have been effectuated. The failure of the Board to investigate the operation of Hooper and Robinson after actual knowledge that they were faithless employees is, prima facie, gross negligence and culpable mismanagement for which the defendant directors are liable for resultant losses to the Association. As we will consider later, the allegations of the complaint are sufficient to indicate that the general release to Hooper and to Robinson was improvident, the result of gross negligence and culpable mismanagement and, prima facie, should be set aside.\n\n{PA}\n\nPage 79} The Embassy Dairy Purchase and the Violations of the Sherman Anti-Trust Act.\n\nThe complaint, in paragraphs 8 to 15, alleges the facts in regard to the purchase of the Embassy Dairy in the District of Columbia with the intent to violate the anti-trust laws of the United States, the various court proceedings in regard to this violation, the requirement of the sale of Embassy and the improvement sale, the $500,000 discount, and the attempt to circumvent the decree of the United States District Court for the District of Columbia.\n\nOn August 1, 1954, by authorization by the Board, Embassy was purchased by the Association. The United States District Court for the District of Columbia in a suit filed by the United States against the Association to enjoin the violation of the Sherman Anti-Trust laws found, after a trial on the merits, and this purchase was entered into \"with the intent and purpose of restraining trade.\" See United States v. Maryland \u0026 Virginia Milk Producers Ass'n, 168 F. Supp. 880, 881 (D. D. C. 1959) (Holtzoff, J.). Earlier, this same Court had held that the \"price paid by the Association for the transfer was far in excess of the actual and intrinsic value of the property purchased.\" See United States v. Maryland \u0026 Virginia Milk Producers Ass'n, 167 F. Supp. 799, 806 (D. D. C. 1958) (Holtzoff, J.). The District Court had earlier held that the Association had not violated Section 2 of the Sherman Anti-Trust (see United States v. Maryland \u0026 Virginia Milk Producers Ass'n, 167 F. Supp. 45 (D. D. C. 1958) (Holtzoff, J.) but this decision was reversed by the Supreme Court of the United States in Maryland and Virginia Milk Producers Ass'n v. United States, 362 U.S. 458, 80 S. C. 847, 4 L. Ed. 2d 880 (1960) (Black, J.). The Supreme Court of the United States, however, affirmed the decision of the District Court holding that the Association had violated Sections 1 and 3 of the Sherman Anti-Trust Act and ordering a divestiture of the Embassy assets within a reasonable time. The complaint alleges that the Association's appeal to the Supreme Court was \"fruitless\" -- as it indeed turned out to be -- and that it cost more than $300,000.00. The cost of Embassy to the Association was alleged to be $3,890,000, in addition to which the Association expended large sums in improvements\n\nfrom 1954 to 1961 and, on information and belief, the cost basis of the Embassy property at the time of its sale in 1961 was in excess of $5,000,000. On November 4, 1960, a memorandum of sale for the Embassy assets was executed, effective January 1, 1961 -- approved by 17 of the 21 members of the Board -- by which the Embassy assets were sold to Metropolitan Food Corporation, which on information and belief, \"had no assets.\" The selling price for the Embassy assets was $3,250,000, but no cash or other assets were paid by Metropolitan. The cash paid was that in the hands of Embassy on the date of settlement. This sale also included the capital stock of Wakefield and Simpson. The terms of sale have already been set forth and it appears that there was indeed no cash or other assets paid down by the purchasers, the non-interest bearing note for $250,000 was payable only from collections made on the notes and accounts receivable, and the $3,000,000 note, payable in semi-annual installments of $100,000 each over a 15 year period with a final settlement of $500,000, the first installment to begin 2 years after date of settlement, was not secured by any mortgage or pledge of assets but did bear the endorsement of Irving D. Berger. This arrangement, supported by exhibit F in regard to the terms of sale, is alleged to be a gift of corporate assets of substantial value which has cost the Association not less than $5,000,000.\n\nThe false and misleading statements in the Annual Reports of 1960, 1961 and 1962 are alleged, as well as the discount of $500,000 during 1963 on the $3,000,000 note, without any collection from, or proceeding against, Berger, who had endorsed the note. It is alleged that not only did the original transaction result in a loss, rather than the \"capital gain\" stated in the Annual Reports, but this \"discount\" further increased the loss.\n\nAlthough the ultimate determination that there has been a violation of the anti-trust laws of the United States by a corporation may not, per se, result in a finding of gross negligence or culpable mismanagement on the part of the directors of the corporation, the allegations in the complaint in this case establish, prima facie, such gross negligence and culpable mismanagement. As alleged, the directors deliberately purchased Embassy to eliminate competition and violate the anti-trust laws\n\nand the evidence reviewed by the District Court clearly indicates that this was the situation. In view of the decision of the Supreme Court of the United States in United States v. Borden Co., 308 U.S. 188, 60 S. Ct. 182, 84 L. Ed. 181 (1939), decided before the purchase of Embassy in 1954, it was apparent that the possible exemption of the Association from the operation of the anti-trust laws was so doubtful that it was, prima facie, an act of gross negligence and culpable mismanagement to proceed with the expenditure of $3,890,000 -- far in excess of the actual and intrinsic value of the property -- and to expend further amounts on the Embassy property, without first obtaining clearance from the Department of Justice in regard to whether or not, in its opinion, the purchase would violate the anti-trust laws.\n\nThe sale of the Embassy assets for $1,750,000 less than the cost to the Association and the extraordinary provisions of sale, without the payment of any cash or delivery of assets by the purchaser -- alleged to be a corporation without assets -- with no security for the $3,000,000 note by mortgage or a pledge of assets with a later discount of $500,000 without a proceeding against, or even a demand upon, the endorser of the note are, prima facie, acts of gross negligence or culpable mismanagement by the directors involved. This is also indicated by the misleading statements appearing in the Annual Reports of 1960, 1961 and 1962 and these misleading statements also involve Kendrick with the involved directors as alleged in paragraph 15 of the complaint.\n\nIt may be, of course, that the involved directors may be able to show at the trial on the merits that their conduct in all or part of the matters above set forth was not grossly negligent or the result of culpable mismanagement, but as we have indicated the allegations of the complaint indicate, prima facie, that the involved directors were grossly negligent or guilty of culpable mismanagement.\n\n2.\n\nWe are of the opinion that the complaint alleges sufficient grounds to excuse the plaintiffs from exhausting their intracorporate remedies before seeking to institute the present suit.\n\nIt is well established that ordinarily the courts will not entertain\n\na derivative suit by a stockholder on behalf of a corporation until it appears that the intra-corporate remedies have been unsuccessfully pursued by the complaining stockholder. This means that, generally speaking, the complaining stockholder must make demand upon the corporation itself to commence the action, and show that this demand has been refused or ignored. This general rule, however, is subject to a well recognized exception, i.e., that no such prior demand is required when it would be futile. Our predecessors in Eisler v. Eastern States Corporation, 182 Md. 329, 333, 35 A.2d 118, 119 (1943) cited 14 C.J. Corporations,  1339 as stating the general rule as follows:\n\n\"Before a stockholder may sue the Corporation to enforce and protect its rights or to redress wrongs to it, he must first make an earnest and unsuccessful effort to obtain remedial action by the Corporation itself, first by application to the directors, and then by application to the body of the stockholders. But he need not do so where the circumstances are such that an application would be futile.\" (Emphasis supplied.)\n\nJudge Coleman in his opinion in the United States District Court for the District of Maryland in considering and sustaining the sufficiency of a complaint charging fraud on the part of the directors of a stock corporation, in McQuillen v. National Cash Register Co., 22 F. Supp. 867 (D. Md. 1938), aff'd, 112 F. 2d 877 (4th Cir. 1940), cert. denied, 311 U.S. 695, 61 S. C. 140, 85 L. E. 450 (1940), rehearing denied, 311 U.S. 729, 61 S. C. 316, 85 L. E. 474 (1940), stated:\n\n\"It is well settled that this portion of Equity Rule 27\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e must be applied in a practical, common-sense manner. Delaware \u0026 Hudson Co. v. Albany \u0026 Susquehanna Railroad Company, 213 U.S. 435, 29 S. Ct.\n\n540, 53 L. Ed. 862; Krause v. Brevard Tanniu Company, 4 Cir., 249 F. 538. In the present suit the bill alleges that the fraud of which plaintiffs complain has been committed by the present directors of the National Cash Register Company, all of which have been made parties defendant. The bill further states that plaintiffs have made no effort to secure action on the part of the directors, officers, or stockholders for the reason that \"The Company is, and has been for many years, dominated and controlled by the individual defendants, who constitute a large majority, or practically all, of the present officers and directors. If the individual defendants were permitted to conduct this suit, it would be prosecuted by them for the company against themselves.' It thus clearly appears that an appeal to the directors would be futile, since it is apparent on the face of the pleadings that their interests are antagonistic to those of the plaintiffs. Surely, the usual preliminary steps incident to a stockholder instituting a suit of this kind are not to be treated as indispensable, when the interests of the directors are antagonistic to those of the corporation, and such fact is shown by the pleadings. The same commonsense rule must be applicable with respect to the requirement of first appealing to stockholders through regular or special meetings.\" (Citing cases.) (22 F. Supp. 874)\n\nSee also 19 Am. Jur. 2d Corporations,  540, page 77.\n\nAs we are of the opinion, as above set forth, that the allegations of the complaint state causes of action against the defendant directors for acts of fraud, concealment, illegality, gross negligence, waste of corporate assets and conspiracy to conceal losses and causes of action, and as it is alleged that a majority of the Association's present Board have participated in various of the alleged acts, it is clear to us that it would be futile for the plaintiffs to make demand upon those directors to cause the Association to sue them to recover for their own wrongful injuries to the Association. It is well established under these circumstances that the plaintiffs, as minority members of the Association,\n\nare excused from the usual requirement that they make a prior demand upon the directors as a condition precedent to maintaining a derivative action. Indeed, as the Supreme Court of Missouri stated in Caldwell v. Eubanks, 326 Mo. 185, 192, 30 S. W. 2d 976, 979 (1930) \"* * * the court would not permit them (directors) to conduct litigation against themselves even if they were willing to do so.\" See Winter v. Farmers Educational and Coop. Union of America, 259 Minn. 257, 107 N. W. 2d 226 (1961). Russell v. Weyand, 5 Cal. App. 2d 259, 42 P. 2d 381 (1935), Bissell v. Taylor, 229 App. Div. 369, 241 N. Y. S. 717 (1930), and Craftsmen Finance and Mortgage Co., Inc. v. Brown, 64 F. Supp. 168 (S. D. N. Y. 1945). See also 13 Fletcher, Cyclopedia of Corporations,  5965 at page 471 where it is stated:\n\n\"Demand on the director is excused where the alleged wrongdoers constitute a majority of the board of directors * * *.\" (Footnotes omitted.)\n\nThe plaintiffs are also excused from making prior demand upon the members before instituting the derivative suit. Here again such a demand would be futile as the majority of the directors of the Association are defendants charged, prima facie, with the wrongful conduct for which the Association will sue. As these directors control the Association, the Association under their management could not effectively or properly prosecute the litigation. See McQuillen v. National Cash Register Co., supra, Hand v. Kansas City Southern Railroad Co., 55 F. 2d 712 (S. D. N. Y. 1931). It also is alleged that at the annual meeting of February 22, 1965, a short time after filing the suit in the present case on February 4, 1965, a resolution was allegedly passed by the majority of the members expressing confidence in the present Board and undertaking to indemnify them for the payment of any judgments which might be rendered against them, a resolution declared to be carried although the complainants tried unsuccessfully to be recognized and speak against it. This extraordinary action indicates the futility of requiring a prior demand on the members by the complainants. See Escoett v. Aldecress Country Club, 16 N. J. 438, 109 A.2d 277 (1954), and Winter v. Farmers Educational and Coop. Union of America, supra.\n\nThen too, it is alleged that the plaintiffs were refused (unlawfully as we shall later point out) the list of members, so that it would have been practically impossible for them to acquaint the membership with the relevant facts allegedly concealed from the members of the Board. This fact alone is sufficient to excuse the minority members from making prior demand upon the general membership. See Escoett v. Aldecress Country Club, supra.\n\nNor may a majority of the membership ratify the fraudulent action of the directors. Cf. Penn. R. R. Co. v. Minis, 120 Md. 461, 87 A. 1062 (1913). See also 19 Am. Jur. 2d Corporations,  542, pages 78-79:\n\n\"A requirement of application to the general body of stockholders is not absolute and will readily give way in the interests of justice. A stockholder need not seek action by the stockholders as a body, where under the facts he cannot do so or it would be unreasonable or useless to require it. Thus, if the body of stockholders has no adequate power or authority to remedy the wrong asserted by the individual stockholders, an application to it to redress the wrong before bringing a representative action is unnecessary. It has been held that if a stockholder's derivative action is based upon an alleged wrong committed by directors against the corporation, of such a nature as to be beyond ratification by a majority of the stockholders, as in the case of fraud, it is not necessary to make a demand upon the stockholders before bringing the action. Resort to the general body of stockholders would be unnecessary where it * * * affirmatively appeared to be futile or impracticable or otherwise unwarranted.\" (Emphasis supplied.) (Footnotes omitted.)\n\nFor the reasons already stated it seems apparent that the plaintiffs are not required to pursue the remedy of mandamus against the directors, as the Chancellor thought was required. The framing and prosecuting of a suit against the defendant directors would require the exercise of personal judgment and would not be a mere ministerial act. See Devin v. Belt, 70 Md. 352, 354,\n\n17 A. 375, 376 (1889). The directors cannot be permitted to control the litigation by the Association against them so that the issuance of a writ of mandamus would be ineffectual. A writ of mandamus will not be issued where it would be unavailing and nugatory. See Bd. of Co. Comms. v. Oxford Dev. Co., 209 Md. 373, 121 A.2d 239 (1956). See also 34 Am. Jur., Mandamus  37, page 830.\n\nIn considering this entire question, it should be kept in mind that the trend in the more modern authorities is to be more tolerant of the derivative suits of minority members or stockholders. The size and complexity of corporate transactions makes necessary and important this form of \"legal therapeutics,\" to quote a phrase used by George D. Hornstein in his article entitled \"Legal Therapeutics: The 'Salvage' Factor in Counsel Fee Awards,\" 69 Harv. L. Rev. 658, (1956). See also Hornstein, \"The Counsel Fee in Stockholder's Derivative Suits,\" 39 Col. L. Rev. 784 (1939) and 39 A.L.R.2d 580. The allegations of the complaint are, in our opinion, sufficient to excuse the plaintiffs from making a prior demand upon the Board and the general membership and from pursuing the remedy of mandamus against the Board.\n\n3.\n\nWe will now consider the interesting question of whether or not the complaint alleges facts which entitled the plaintiffs to the disclosure of corporate records in view of the provisions of Code (1957), Article 23, Section 51. This section provides as follows:\n\n\"(a) During usual business hours; what may be inspected. -- Any stockholder of a corporation may, during usual business hours, inspect and copy the bylaws, the minutes of the proceedings of the stockholders, the annual statement of the affairs of the corporation, and any voting trust agreement on file in the office of the corporation.\n\n\"(b) Holders of five percent of capital stock. -- Any one or more persons who are and for at least six months have been stockholders of record of five percent, in the aggregate, of the outstanding capital stock of any class of a corporation of this State:\n\n\"(1) May, upon written request, inspect and copy, in person or by agent or attorney, during usual business hours, the corporation's books of account and the stock ledger.\n\n\"(2) May present to any officer or resident agent of the corporation a written request for a statement of its affairs, and it shall be the duty of the corporation to prepare and to have available on file at the principal office of the corporation within the State within twenty days after such request, such a statement sworn to by the president or a vice-president or by the treasurer or an assistant treasurer, setting forth in reasonable detail its assets and liabilities as of a reasonably current date.\n\n\"(3) May, in the case of any corporation which does not maintain the original or a duplicate stock ledger at its principal office in the State, present a written request to any officer or resident agent of the corporation for a list of its stockholders; and it shall be the duty of the corporation to prepare and to have available on file at the principal office of the corporation in the State, within twenty days after such request, a list containing the names and addresses of all stockholders and the number of shares of each class held by each stockholder, certified to as correct by an officer of the corporation or by the stock transfer agent or the registrar.\"\n\nIt will be observed that Section 51 does not purport to apply to members in a member corporation.\n\nCode (1957), Article 23, Section 132 (b), however, provides:\n\n\"Wherever the term stockholder, holder of shares, or other equivalent words are used in this Article, they shall be deemed to include members, unless the context otherwise clearly requires.\" (Emphasis supplied.)\n\nIn our opinion the context does clearly require a holding that it was not the legislative intent that the provisions of Section\n\n51 include \"members.\" Indeed, the legislative history of this section shows this.\n\nAt common law, a stockholder of a stock corporation, as well as a member of a member corporation, had a right to inspect corporate records, provided there was a proper purpose for the inspection. The burden was upon the stockholders or members to allege and prove this proper purpose in a mandamus action to compel the corporate officials to permit the desired inspection. 5 Fletcher, Cyclopedia Corporations (1967 Rev. Vol.)  2214, 2251.\n\nIn Maryland this common law right of stockholders and of members was substantially broadened by Chapter 471 of the Laws of 1868 which provided in the then corporate article of the then existing Code, in Section 5:\n\n\"That the President and Directors of every corporation shall keep full, fair and correct accounts of their transactions, which shall be open at all times to the inspection of the stockholders or members and they shall annually prepare a full and true statement of the affairs of the Corporation, which shall be certified to by the President and Secretary and submitted at the annual meeting of the stockholders or members.\" (Emphasis supplied.)\n\nThere was a similar right of inspection given by Section 67 with respect to stockholders' or members' lists.\n\nIt should be observed (1) that this broadening of the common law right included both stockholders and members, and (2) there was no requirement that either allege or prove that they had a proper purpose for the inspection. Our predecessors, in construing these statutory provisions, held in Weihenmayer v. Bitner, 88 Md. 325, 333 (1898), a stockholder's mandamus action to compel inspection, that this right was \"absolute and not made to depend upon circumstances but the ownership of stock.\" The Court, however, pointed out that if the purpose of inspection was for an evil, improper and unlawful purpose the writ of mandamus might be denied if the corporate defendant were to allege and prove such a purpose on the part of the stockholder.\n\nIn the general revision of the corporate article of the Code in 1908 the language on which the decision of the Court in Weihenmayer v. Bitner rested was replaced with three new sections, which were Sections 47, 48 and 49 of Chapter 240 of the Laws of 1908 (Article 23, Section 72, 73 and 74 of the 1911 Code):\n\n\"Stockholders' Rights.\n\n\"Demanding Statement\n\n\"Sec. 47. If any person or persons owning in the aggregate five per cent of the outstanding capital stock of any corporation of this State (or five per cent of any class of such stock, if two or more classes have been issued), shall present to the president or treasurer a written request for a statement of its affairs, it shall be his duty to make such a statement under oath, embracing a particular account of its assets and liabilities in detail, and to have the same ready and on file at the principal office of the corporation within twenty days after the presentation of such request. And such statement shall at all times during business hours be open to the inspection of any stockholder, and he shall be entitled to copy the same. And if such president or treasurer to whom such request shall be delivered, shall neglect to file such statement, he shall forfeit and pay to the person presenting the request the sum of fifty dollars for each and every day's delay; and if he shall refuse to permit any stockholder to inspect such statement and copy the same, he shall forfeit and pay to such stockholder the sum of fifty dollars for each and every refusal.\n\n\"Inspection of Books.\n\n\"Sec. 48. The books of every corporation of this State, including such books as show the names of the stockholders thereof, and their places of residence and the number of shares held by them, shall during the usual business hours of every business day be open for the inspection of any person or persons holding in the aggregate five per cent of the outstanding capital stock, or five per cent of any class thereof, if two or more\n\nclasses have been issued, at its principal office in this State; every officer or agent of any such corporation who shall refuse to exhibit the same, shall be guilty of a misdemeanor, and the corporation shall forfeit and pay to the stockholder demanding such inspection the sum of fifty dollars for every such refusal.\n\n\"Duties and Liabilities of Directors\n\n\"Accounts and Statements\n\n\"Sec. 49. The directors, managers and trustees of every corporation of this State shall keep full and fair accounts of their transactions; and they shall annually prepare a full and true statement of the affairs of the corporation, which shall be submitted at the annual meeting of the stockholders or members.\" (Emphasis supplied.)\n\nIt is significant that this change in the corporation laws in regard to the five per cent requirement for stockholders providing for the preparation and filing of a corporate statement, with a penalty upon the president and treasurer for non-compliance and providing for the inspection of the corporate books, including the stockholder's list, with a criminal sanction on the officers and agent of the corporation and a $50 penalty on the corporation for refusal, applied only to stockholders, with no mention of \"members,\" but Section 49 in regard to the submission of the annual statement provided that it should be submitted at the annual meeting of the \"stockholders or members.\"\n\nThe deliberate inclusion of \"stockholders\" in Sections 47 and 48 and the exclusion of the words \"or members\" in these sections (but their inclusion in Section 49) indicates to us that it was not intended that the five per cent restriction was intended to apply to \"members\" or to \"member corporations.\" This is not only clear from the language of the statute itself, but also from the purpose of the five per cent restriction. This five per cent restriction was to prevent an abuse of the common law right of a single stockholder to demand inspection of books, etc., with possible attendant substantial expense, when the amount of the stock holding was insignificant compared to the whole stock structure. It was, in short, to prevent \"strike\"\n\nsuits by litigious stockholders holding less than five per cent of the corporate stock of a class of corporate stock. Generally stock in a stock corporation may be purchased by any one at any time without the prior consent of the other stockholders or of the board of directors of that type of corporation. The business reasons underlying the five per cent limitations are not generally present in a \"member\" corporation which has no shares to be purchased by any one at will and without the approval of the board of directors or of the members. In member corporations generally and in the Association, membership is not freely bought or sold. On the contrary a member is admitted to membership by the Board and, quite unlike the holder of shares in a stock corporation, has only one vote regardless of his capital investment in the milk producing business. This relationship is far more analogous to partnership than it is to the holding of stock in a stock corporation. \"Membership\" must be granted, not freely acquired by purchase, each member has one vote, and death would terminate the membership, as there is no provision for succession of the membership to the personal representatives or assigns of the member. In short, the purpose of the five per cent limitation does not apply to a member in a member corporation such as the Association and we are of the opinion that the General Assembly did not intend that that limitation apply to a member. The member in a member corporation continued to have his right of inspection without the five per cent limitation. We do not need to decide whether his common law right of inspection or his statutory right of inspection under Chapter 471 of the Acts of 1868 continued, as under either assumption, the five per cent limitation did not apply and under the allegations of the complaint it appears that the purpose of the demand for inspection was an entirely proper one intended for the ultimate benefit of the Association itself.\n\nIn Wight v. Heublein, 111 Md. 649, 75 A. 507 (1910), our predecessors, in a case involving a demand by a stockholder owning more than five per cent of the corporate stock in a distilling company, did not find it necessary to decide the nature of the stockholder's right of inspection as the answer of the corporation to the mandamus petition clearly indicated an improper motive on the part of the petitioner-stockholder in seeking the\n\ninspection of the corporate books and records. As there was a demurrer to the answer which admitted for the purpose of the demurrer the improper purpose, it was held that the trial court improperly overruled the demurrer to the answer. In Jackson v. Hopkins, 113 Md. 557, 78 A. 4 (1910), the Court had before it a mandamus action filed by an alleged vestryman of an Episcopal Church established under the Vestry Act (Act of 1798, Chapter 24) to inspect the records of the church. In the answer to the petition for a mandamus it was denied that the petitioner was a vestryman and the Court held that the demurrer to this portion of the answer was properly overruled. It was then contended, however, by the petitioner that he was a member of the church and, as such, had the right of inspection. The Court assumed, without deciding, that the petitioner as a member of the church, established under the Vestry Act \"may ordinarily have standing in a court of law to ask for a mandamus to require\" the person having custody of the books of the church \"to permit him to inspect them.\" It was not necessary to decide this issue, because, in any event, the answer to the petition alleged that the petitioner as such a member had established a \"competing\" Sunday school in defiance of the ecclesiastical authority of the church and desired the inspection for an improper purpose. We think it is significant, however, that the Court did not mention the five per cent requirement in the then recent Act of 1908, Chapter 240 as even possibly being applicable to a member in a member corporation, thus indicating that the Court did not think that it was so applicable.\n\nSections 72, 73 and 74 of the 1911 Code (Laws of 1916, Chapter 596, previously enacted by Chapter 240 of the Laws of 1908) were amended by eliminating the provision declaring the refusal to be a misdemeanor and the penalty of $50 for each refusal to comply with the request of a five per cent holder of the corporate stock. In 1927, by Chapter 581 of the Laws of 1927, there were unimportant amendments requiring that the corporation at the request of five per cent or more of the stockholders prepare and have on file at its principal office in the State a list of stockholders if the original or duplicate stock ledgers were not kept at such principal office. The only change thereafter prior to the institution of suit in the present case occurred\n\nin the general revision of Article 23 of the Code by Chapter 135 of the Laws of 1951 which enacted what is now Article 23, Section 51 of the 1957 Code, already set out above in full. It will be observed that there has been no change in the important language in regard to the applicability of Section 51 since the passage of the Act of 1908, Chapter 240, so that the legislative intent that the five per cent requirement should not apply to members of member corporations has continued until the present time. Each plaintiff as a member of the Association was, therefore, entitled to examine the books and records of the Association, including the list of the general membership and the full Dugan Report.\n\nIn regard to the Dugan Report, it was indicated by officials of the Association that Professor Dugan gave a \"confidential\" report and to allow the plaintiff members to see it would breach this \"confidence,\" and, in any event, the plaintiff members would use the report to place its contents in the press and thereby injure the Association. The difficulty with the first contention is that when the Dugan Report was given by Professor Dugan as an attorney to his client the report lost whatever \"confidential\" character it might otherwise have had. There can be no confidential nature of an attorney's report to his client so far as the client is concerned. The confidence restricts disclosure by the attorney without the client's consent; it does not restrict the client. This is clearly the case when the report involved is intended to form the basis of possible future action by the client, as was the situation in the present case. Then too, the client had already issued what purported to be the \"substance\" of the Report to the members so that any confidential quality of the Dugan Report had been dissolved by this action by the Association. Any member after that action had the right to inspect the original Report to see whether the Board had in fact made a full, objective summary of the Report or had possibly omitted portions of it unfavorable to the Board and indicating possible liability of the directors. The reluctance of the Board to exhibit the original Report under all of the circumstances alleged in the complaint indicates the reasonableness on the part of the plaintiffs, as minority members, in insisting on seeing the full Report. Nor can the excuse given by the Board or its representatives\n\nthat the material would be used by the plaintiffs for publicity purposes in the newspapers to the injury of the Association be thought valid in view of the fact that the plaintiffs already had what the Board represented to be the substance of the Report and whatever publicity would come from the facts thus summarized had either occurred or was within the power of the plaintiffs to make it occur. In short, if the representation that the Statement of Fact (exhibit G) was a true and correct summary of the Dugan Report was correct, the plaintiffs already had the basic information and whatever damage the Association could suffer from publicity had either occurred or the danger would not be increased by showing a copy of the Dugan Report to the plaintiffs. In our opinion they were entitled to see it.\n\nIn view of our opinion that the complaint sufficiently states causes of action against the defendant directors without having seen the full Dugan Report, we need not consider whether under the unusual circumstances of the present case, the plaintiffs would be confined to the usual remedy of mandamus to compel the Association, its officers and agents, to show them the requested books, records and report. Doubtless by appropriate discovery proceedings the plaintiffs will be able to obtain the production of those books, records and report. Nor do we need to consider whether or not the allegation in paragraph 26 (g) of the complaint that \"Complainants Parish also sought and obtained the signatures of more than five per cent of the members on petitions requesting access to the books and records of the Association but said request was denied as not being in proper form\" is a sufficient allegation of compliance with Article 23, Section 51, assuming, arguendo, that Section 51 would apply to demands of inspection of members as well as to such demands by stockholders.\n\n4.\n\nWe are of the opinion that the claims against the defendant directors which arose more than three years prior to the time suit was filed are not barred by laches.\n\nThe suit in the present case was filed on February 4, 1965. The defendant directors urge upon us that the three year statute of limitations established by Code (1957), Article 57, Section\n\n1 is applicable to transactions which arose more than three years prior to that date of which the plaintiffs had notice and could and should have investigated more promptly and in time to have filed the complaint within the three year period. There are two answers to this contention. One is that in paragraph 27 of the complaint the plaintiffs allege that there was fraudulent concealment of the principal causes of action by the defendant directors and the plaintiffs did not, and reasonably could not, discover the existence of the causes of action prior to late in 1963 or early 1964, well within the three year period from the discovery of the causes of action and the time of filing suit. It is provided by statute that where an adverse party keeps a party in ignorance of the cause of action by fraud, the right to bring suit will be deemed to have first occurred when the fraud was, or with usual and ordinary diligence might have been known or discovered. Code (1957), Article 57, Section 14. See Brack v. Evans, 230 Md. 548, 187 A.2d 880 (1963). The complaint, on its face, similarly shows no lack of diligence on the part of the plaintiffs in seeking to discover any possible causes of action against the defendant directors and other parties.\n\nThe other answer is that there is nothing in the allegations of the complaint to show that the defendant directors have suffered any prejudice or disadvantage by the delay in filing suit so that the doctrine of laches does not apply regardless of the passage of more than the statutory period or of an unreasonable time. Spangler v. Sprosty Bag Co., 183 Md. 166, 176-77, 36 A.2d 685, 690 (1944), quoting with approval from 4 Pomeroy, Equity Jurisprudence,  1440 (Third Ed. 1906) as follows:\n\n\"Laches, in legal significance, is not mere delay, but delay that works a disadvantage to another. So long as parties are in the same condition, it matters little whether one presses a right promptly or slowly, within limits allowed by law, but when, knowing his rights, he takes no steps to enforce them until the condition of the other party has, in good faith, become so changed that he cannot be restored to his former state, if the right be enforced, delay becomes inequitable, and operates an estoppel against the assertion of the right.\"\n\n5.\n\nWe have concluded that the matters complained of in the complaint are not barred by the doctrine of res judicata as to those defendant directors whose demurrers were sustained without leave to amend.\n\nThis interesting question arises by prior rulings on prior bills of complaint filed by the plaintiffs. Judge Shook after hearing argument on the demurrer of the defendant director King to the second amended bill of complaint, passed an order on December 13, 1966, sustaining his demurrer without leave to amend. On the same day the docket entries indicate that Judge Shook sustained the demurrers of the defendant directors Marty, Weitzer, Fouche, Adams and Stull, but there is no indication one way or the other in regard to whether leave to amend was granted. No appeals were taken from these orders to this Court within thirty days. On February 13, 1967, however, as we have already indicated, Judge Pugh passed an order dismissing all motions, demurrers and other pleadings without prejudice and directed the plaintiffs to file a third amended bill of complaint. This third amended bill of complaint was filed by the plaintiffs on February 28, 1967, and is the complaint principally involved in the present case.\n\nThe seven defendant directors, however, contend that the prior rulings on demurrer were res judicata and preclude the plaintiffs from proceeding against them in the third amended bill of complaint. They argue that Maryland Rule 373 d provides (as it does) that Section e of Rule 345 (e) provides that an order sustaining a demurrer to an entire declaration (bill of complaint) without leave to amend shall be deemed to include and constitute a final judgment for costs for the demurring party; that a judgment on demurrer, in view of our decision in Moodhe v. Schenker, 176 Md. 259, 4 A.2d 453 (1939), may, if made on the facts alleged and not upon technical considerations, be a judgment on the merits which will support a subsequent defense of res judicata ; and, that since the record in the present case contains the second amended bill of complaint and the rulings on demurrer, the plaintiffs are barred in the third amended bill of complaint by the doctrine of res judicata\n\nas to the same or similar matters which were raised or could have been raised in the second amended bill of complaint.\n\nThe difficulty with this contention is that Maryland Rule 605 (a) requires a different result. Rule 605 (a) provides:\n\n\"Where more than one claim for relief is presented in an action, whether as an original claim, counterclaim, cross-claim, or third-party claim, the court may direct the entry of a final judgment upon one or more but less than all of the claims only upon an express determination that there is no just reason for delay and upon an express direction for the entry of judgment. In the absence of such determination and direction, any order or other form of decision, however designated, which adjudicates less than all the claims shall not terminate the action as to any of the claims, and the order or other form of decision is subject to revision at any time before the entry of judgment adjudicating all the claims.\" (Emphasis supplied.)\n\nThis rule applies to suits in equity as well as to actions at law. There can be little doubt that all of the bills of complaint filed in this case involved multiple claims, i.e., (1) an accounting to the Association for the profits derived by Hooper and Robinson, (2) a determination and decree that each of the defendant directors and the auditor of the Association are jointly and severally liable for losses to the Association resulting from their fraud, concealment, gross negligence, illegal conduct, waste of corporate assets and conspiracy to conceal losses by issuing false and misleading reports, (3) a declaratory decree cancelling and setting aside the general release to Hooper and Robinson, (4) relief in the nature of the appointment of a receiver to institute appropriate suits against others beyond the court's jurisdiction and (5) other relief.\n\nWhere multiple claims are involved, as in the case at bar, it is required by Rule 605 a that the trial court may direct a final judgment upon one or less than all of the claims, but only upon (a) an express determination that there is no just reason for delay and (b) upon an express direction for the entry of judgment. The rule further provides that in the absence of such\n\ndetermination and direction any order or form of decision, however designated, which adjudicates less than all the claims shall not terminate the action as to any of the claims.\n\nIn regard to the King order which sustained his demurrer \"without leave to amend\" there was no express determination that there was no just reason for delay and no express direction to enter judgment for costs. The provision in Rule 345 e that the sustaining of a demurrer without leave to amend shall be deemed to include and constitute a final judgment for costs does not amount to an express direction by the trial court for the entry of judgment for costs required in multiple claim cases under Rule 605 a.\n\nThe demurrers of the remaining six defendant directors were merely \"sustained,\" without an indication of whether there was leave to amend or not. There was no express determination that there was no just reason for delay or an express direction to enter judgment for costs. The order was therefore not a termination of any of the claims of the seven defendant directors mentioned.\n\nThe present case illustrates the wisdom of Rule 605 a which was designed, as was Rule 54 (b) of the Federal Rules of Civil Procedure (Maryland Rule 605 a is identical with Federal Rule 54 (b)), \"to prevent piecemeal appeals as far as possible, and thereby avoid the confusion, delay and expense which would be caused by having two or more appeals in the same suit.\" Durling v. Kennedy, 210 Md. 549, 554, 123 A.2d 878, 880 (1956). See Sears, Roebuck \u0026 Co. v. Mackey, 351 U.S. 427, 76 S. C. 895, 100 L. Ed. 1297 (1956); Southern Parkway Corp. v. Lakewood Park Corp., 273 F. 2d 107 (D.C. Cir. 1959), Atkins, Kroll (Guam), Ltd. v. Cabrera, 277 F. 2d 922 (9th Cir. 1960).\n\n6.\n\nParagraph 1 (a) of the complaint alleges that the plaintiff, Mrs. Parish, was enrolled as a member of the Association in 1941, and operated Thorndale Farm as a member from that time until 1957, selling milk to the Association. From 1957 to 1961 the farm was operated in the name of Schott Brothers under lease from Mr. and Mrs. Parish, but this lease under the Certificate of Incorporation of the Association did not deprive\n\nthe plaintiffs Parish of their continued membership during that period, but, on the contrary, required it. Thereafter Mr. and Mrs. Parish executed the October 9, 1961 contract with the Association which is filed as part of the complaint as exhibit B. It is alleged that they continuously so operated the farm from 1961 \"until the bona fide sale of their cowherd in the spring of 1966.\" There is no allegation that Mr. and Mrs. Parish are no longer members of the Association.\n\nThe Association, however, urges upon us that Mr. and Mrs. Parish have no standing as \"a former member\" to maintain the derivative action in this case on behalf of the Association. It relies upon the well recognized rule that a stockholder in the usual stock corporation cannot sue unless he is a stockholder at the time the derivative suit is instituted or if he transfers his stock, pendente lite, he has no further right to maintain the suit. This rule is founded upon the theory that the very interest a stockholder has in the corporation is represented by his holding of the stock of the corporation and when he transfers this interest to another, his interest ceases and passes to the transferee of the stock. Membership in the Association is not negotiable or transferrable by the member to another person. Although it is true as the Association points out that in order to be eligible for admission as a member the \"person, firm or corporation must be engaged in dairying or owning or leasing land on which dairying is carried on and sharing in the products therefrom,\" and upon admission such member \"shall have voting power and property rights therein on the same basis as all other members\" as provided in Article XIV (b) of the Certificate of Incorporation, there is no provision in the Certificate of Incorporation which indicates that the sale of a cowherd, ipso facto, results in a cancellation of existing membership. The remaining provisions of Article XIV indicate the contrary. For example, in the remaining portion of Subsection (b) itself, there is a provision that if a partnership is admitted to membership and is dissolved, each co-partner who continues to produce milk as an individual shall succeed to individual membership, and the outstanding membership to the dissolved partnership * * * shall be cancelled\" and each individual shall be entitled to receive and shall accept an individual membership certificate without further fees.\n\nSubsection (d) provides that a member who fails to remain qualified as provided in Subsection (b) \"shall not be entitled to vote or hold office or participate in any of the benefits of the Association until said qualifications shall be restored * * *.\" There is also a provision that any member so qualified \"who shall fail to market all milk produced or acquired by or for him in compliance with the terms and provisions of the marketing agreements, referred to in subsection (b) of Article XIV hereof, and then in force, shall not cease to be a member hereof unless and until the Board of Directors, by a majority vote, passes a specific resolution to that effect.\"\n\nSo far as the allegations of the complaint and the provisions of exhibit C (the Certificate of Incorporation) are concerned, there is nothing to show that Mr. and Mrs. Parish are not still members of the Association. Subsection (d) of Article XIV indicates that the failure to remain qualified only results in the loss of the right to vote, hold office or participate in the benefits of the Association until qualification is restored, not that membership is discontinued or that prior accrued benefits are forfeited. Even when there is a violation of a marketing agreement, the member is not automatically expelled from membership, but a specific resolution of the Board by a majority vote is required for the expulsion of a member. Assuming, without deciding, that the loss of membership in the Association would terminate the right to maintain a derivative suit on behalf of the Association, there is nothing on the face of the complaint or exhibits to indicate that the plaintiffs Parish are not still members of the Association and as such are entitled along with the other plaintiffs to maintain the derivative suit.\n\n7.\n\nThe Association urges that the plaintiffs Parish, \"who instituted the proceedings in their status as a single member of the Association,\" had no standing to maintain the derivative suit with respect to actions complained of prior to October 9, 1961, when they signed their contract with the Association, upon the analogy to stockholders in a stock corporation. Our predecessors have held that stockholders must have been such at the time the alleged wrongful acts injuring the corporation took\n\nplace in order to bring a derivative suit on behalf of the corporation to recover for damages resulting from those wrongful acts. Eisler v. Eastern States Corp., 182 Md. 329, 35 A.2d 118 (1943), Matthews v. Headley Chocolate Co., 130 Md. 523, 100 A. 645 (1917); Brune, Maryland Corporation Law and Practice,  251, p. 257,  252, p. 260 and  255, p. 271.\n\nAssuming, without deciding, that the members in a member corporation like the Association would by analogy be subject to the rule applicable to stockholders in a stock corporation, the doctrine would not be applicable in the present case inasmuch as paragraph 1 (a) of the complaint alleges that Mrs. Parish was a member of the Association since 1941, signed an agreement with the Association on November 18, 1942, operated Thorndale Farm until 1957, then leased the farm, during which time Mrs. Parish's individual ownership was changed to a joint tenancy with her husband and after the termination of the lease, the joint tenants, Mr. and Mrs. Parish, as members, executed the agreement with the Association of October 9, 1961. In view of the law that joint owners, and certainly tenants by the entireties, hold per my et per tout (see 2 Tiffany, Real Property,  418,  430 (3rd ed.)), the mere change of individual ownership to joint ownership would not deprive the right of the joint owner to maintain a derivative suit on the part of the Association for wrongful acts arising after 1941, which all of the wrongful acts do in the present case.\n\n8.\n\nThe executors of the estate of Robinson contend that the complaint does not allege facts which would justify the court in setting aside the general release executed and apparently delivered to Robinson by the Association in 1964. We disagree. Ordinarily a defense based upon a release is complete. A release, however, is a contract and may be set aside for the same reasons for which any other contract may be avoided. Thomas v. Erie Insurance Exchange, 229 Md. 332, 182 A.2d 823 (1962). If the release is obtained by fraud, it may be set aside for this reason. Spitze v. B \u0026 O Railroad Co., 75 Md. 162, 23 A. 307 (1892). In addition to actual fraud, which is not alleged in the complaint, when the release is challenged, a party to it who stands in a confidential relationship to the other party has the\n\nburden of showing that the release was not obtained by fraud, undue influence or over-reaching. See Indurated Concrete Corp. v. Abbott, 195 Md. 496, 74 A.2d 17 (1950).\n\nIn our opinion, the complaint alleges sufficient facts to indicate, prima facie, that Robinson, as well as Hooper, did stand in a confidential relationship to the Association and they have the burden of establishing that the general release given by the Association to them in 1964 was not obtained by their fraud, undue influence or over-reaching. It may be that either Robinson or Hooper, or both, may be able to allege in their answers and prove at the trial of the case on the merits that the general release was obtained in an arms-length transaction, untainted by fraud, undue influence or over-reaching on their part and when the Association had, or should have had, a full and complete knowledge of the relevant facts concerning the matter, but the burden of showing all of this is upon Robinson and Hooper.\n\nWe now consider the allegations in the complaint which establish, prima facie, the confidential relationship of Hooper and Robinson to the Association.\n\nIn paragraph 20(a) it is alleged that the facts appearing in the statement of fact in the Special 1964 Report attached as part of the complaint as exhibit G are correct and these facts are adopted by the plaintiffs as their own. In exhibit G, it appears that Hooper was first employed by the Association in 1935 as accountant and office manager. He became general manager and secretary-treasurer in 1956. In his contract of employment as general manager he was given \"the usual powers of a general manager of an enterprise including general power, under the supervision of the Board of Directors, to conduct the affairs of this Association, such powers to include general control over the buying and selling of the Association's products * * *.\" (Emphasis supplied.) Robinson was, with his then partner Berman, employed in 1955 as manager of the manufacturing division at the Laurel Plant. Later Berman withdrew and Robinson was sole manager. The Laurel Plant had been purchased from Robinson and Berman and in Robinson's employment contract with the Association he was obligated to \"give * * * the same executive direction and the same skilled\n\nmanagement that he had theretofore given the operation of said business.\"\n\nIt further appears in exhibit G that Hooper and Robinson arranged the Harrison affair together and placed the stock of Harrison in the names of their respective children and Hooper's wife, Hooper and Robinson acting as voting trustees of the stock. Even after the Board discovered the fraudulent and illegal activities in connection with Harrison, it did not investigate either Hooper or Robinson, but on the contrary agreed in April, 1962, to purchase Harrison from the two wrong doers for $81,341.27 in order to \"eliminate any possible area of conflict of interest.\" In paragraph 18(e) this price is alleged to be \"an excessive price,\" and it is further alleged in paragraph 18(c) that Hooper and Robinson had between them diverted in excess of $1,300,000 worth of gross business from the Association's Laurel Plant, managed and controlled by Robinson, to the Harrison operation in Florida. In exhibit G, it appears that Robinson was \"sole-salesman\" for both Harrison and the Laurel Plant.\n\nIn the latter part of 1961, exhibit G indicates, Robinson made the \"deal\" with Weldon, whereby Weldon would buy skim milk powder at the new Oneida plant to be erected by Mutual, referred to in exhibit G as \"Robinson's corporation.\" The same type of \"Harrison operation\" was engaged in by Robinson so that \"Mr. Robinson's Mutual Milk Sales Packaging Division received a very substantial brokerage fee or price differential in their sales.\" Mutual, Robinson's corporation, bought skim powder from the Association's Laurel Plant, of which Robinson was manager, for $800,452.68 and resold the product to Weldon for $946,318.42, the shipments being made directly from the Laurel Plant to Weldon in New York. The gross profit to Mutual on the bookkeeping entries was $100,256.23. It is significant that it appears in exhibit G that even after the discovery of the unlawful conduct of Robinson, the Association never did receive the Mutual books to show the exact figures in regard to the mark-up, although these books were demanded by counsel for the Association provided by Robinson. There was no investigation of Hooper or Robinson until Click, the assistant secretary, tendered his resignation\n\non November 8, 1963, and presented his charges against Hooper. Professor Dugan was retained on December 4, 1963, and even after his Report was presented to the Board containing the detailed facts in regard to the misconduct of Hooper and Robinson, Hooper was removed by the Board as general manager and secretary-treasurer on February 12, 1964, Hooper even then maintaining that the matters disclosed did not justify termination of his contract and there was a significant division in the Board in regard to this matter. Robinson's contract had expired and was not renewed.\n\nIt is alleged in paragraph 20(a) that Robinson participated in each breach of trust by Hooper, and Hooper in each breach of trust by Robinson, they having conspired between themselves to misappropriate corporate assets.\n\nIn paragraph 18(g) it is alleged that Robinson and Hooper caused the Association to pay excessive compensation to Robinson, amounting in one year to over $130,000; in paragraph 18(h) that they caused the Association to employ inexperienced and incompetent relatives of Hooper and Robinson in positions of trust in the Laurel Plant and elsewhere in the employ of the Association. Even after the termination of Hooper's employment, it is alleged in paragraph 27(a) that the public relations official of the Association issued a circular letter complaining of the termination on the ground that Hooper's actions were done with the full knowledge, consent and approval of the Board. In addition it is alleged that after the transaction the Board and the auditor conspired to conceal the true facts in regard to the derelictions of Hooper and Robinson.\n\nFrom all of these facts the reasonable inference is that Hooper and Robinson were in actual control of the operations of the Association and dominated and controlled those operations. The Board relied upon them implicitly, trusted them completely and were guided by them in regard to the Association's affairs. Because of all these facts and circumstances, Hooper and Robinson stood in a position of such confidence and trust to the Board and to the Association that they and each one of them had the burden of showing that transactions between them were free from the taint of fraud, undue influence or over-reaching. In short, under the facts and circumstances alleged and the\n\nreasonable inferences from those facts and circumstances, Robinson (as well as Hooper) has the burden of showing that the general release was fair, free from fraud, undue influence and over-reaching, and that the Association executed the general release with full knowledge of the applicable facts. By the facts appearing in exhibit G, already referred to above, it is clear that so far as Robinson is concerned, the Association did not receive the Mutual books, demanded by the general counsel of the Association, prior to the execution by the Association of the general release. It thus appears, prima facie, that the Association did not in fact have full and complete knowledge of the amounts and details of Robinson's misconduct in the Mutual transaction at the time the general release was executed. It is clear from the authorities that a general release of a person standing in a fiduciary relation to a corporation does not release such a person even though the official relationship of that person to the corporation has been terminated in substantial time prior to the execution of the release. There still must be a full and frank disclosure by the person in the fiduciary relationship in order to sustain the effectiveness of the release. Irving Trust Co. v. Deutsch, 73 F. 2d 121 (2d Cir. 1934). See Stevens v. Marco, 147 Cal. App. 2d 357, 305 P. 2d 669, 684-85 (1956). Cf. Hawker v. Worley, 33 F. 2d 491 (8th Cir. 1929).\n\nThe plaintiffs alleged in paragraph 20 that Hooper and Robinson were constructive trustees, or trustees ex maleficio, of all the assets, funds and property obtained by them by their breaches of trust and that (a) they could not by paying back part of the misappropriated property extinguish the Association's equitable title to the remainder by the \"so-called release\" which is void as obtained by them for an inadequate consideration, and (b), in the alternative, they, as such constructive trustees, have the burden of showing that the release was fairly obtained. In our opinion, however, the burden of showing the bona fide circumstances surrounding the obtention of the release is upon Robinson (and Hooper) not because they are constructive trustees but because, as we have indicated, they, prima facie, were in a position of confidential relation with the Board and the Association.\n\n9.\n\nThe executors of Robinson also contend that the complaint is multifarious as to Robinson. Again we do not agree.\n\nThe Maryland Rules have sought to liberalize the prior common law and equity rules in regard to the joinder of parties and of claims in one action. Rule 313 d permits the joinder of separate claims involving different plaintiffs or defendants or both whenever any substantial question of law or fact common to all claims \"or for any other reason the claims may conveniently be disposed of in the same proceeding.\" The defense of multifariousness still may be raised and be effective in certain cases, see Rule 283, but, in our opinion, the present case is not one in which the defense of multifariousness can be successfully made.\n\nThe executors for Robinson point out that some of the transactions alleged in the complaint arose prior to Robinson's employment by the Association and that Robinson's estate should not have the trial of those claims combined with the claims against him with attendant delay and expense. The allegations in the complaint, however, are such that all of the transactions alleged have some connection with the others alleged in the complaint. Hooper and Robinson are charged with conspiracy to misappropriate corporate funds and each allegedly participated in the misconduct of the other. Their confidential relationship with the Board and the Association make relevant all matters in which Robinson took the leading part. It would be far more inconvenient to attempt to separate the transactions in which Robinson apparently played the leading part and the claims against him from the other transactions and claims than it would be to consider all of the claims in one case, especially when all of the claims are tried in an equity suit before the Chancellor. In other words, it is our opinion that all of the claims \"may conveniently be disposed of in the same proceeding\" and, hence, all of the claims may be joined in the present suit in accordance with the provisions of Rule 313 d. See Martin v. Carl, 213 Md. 564, 132 A.2d 601 (1957), Townsend v. Morgan, 192 Md. 168, 63 A.2d 743 (1949).\n\nFor all of the reasons stated, the order of the Chancellor sustaining the demurrers of the various parties without leave to\n\namend must be reversed and the case remanded to the lower court so that the parties defendant may file their answers and that further proceedings may be had in regular course.\n\nOrder reversed, case remanded for further proceedings in accordance with this opinion, the costs to be paid as follows: one-half of the costs to be paid by the appellee, Maryland and Virginia Milk Producers Association, Inc., and the remaining one-half of the costs to be paid in equal parts by the appellees other than Maryland and Virginia Milk Producers Association, Inc.\n\nDisposition\n\nOrder reversed, case remanded for further proceedings in accordance with this opinion, the costs to be paid as follows: one-half of the costs to be paid by the appellee, Maryland and Virginia Milk Producers Association, Inc., and the remaining one-half of the costs to be paid in equal parts by the appellees other than Maryland and Virginia Milk Producers Association, Inc.\n\nHammond, C. J., concurring in part and dissenting in part:\n\nI have considerable doubt that the allegations against any defendant other than Hooper and Robinson sufficiently charge fraud or the gross and culpable negligence in discharge or omission of duties necessary to make him liable, but I bow to the contrary views of my brethren on this point. As to Robinson and Hooper during their periods of employment by the Association, fraud or breach of a fiduciary duty may well have been alleged but to me it clearly appears that the release given them when they were no longer employed was negotiated and executed in good faith at arms length, after full knowledge of all the facts had been obtained by the Association from the Dugan report, and that it is unassailable as far as they are concerned. This is to say that fraud and breach of fiduciary duty that tainted the transactions that led to the release may have been alleged, but that there is no sufficient allegation that fraud or other invalidating agent played any part in its obtention or execution. In my view, Hooper and the executors of Robinson should be let out.\n\n\u003cspan class=\"fn\"\u003e1. The portion of Equity Rule 27 referred to provided as follows: The bill of complaint must \"set forth with particularity the efforts of the plaintiff to secure such action as he desires on the part of the managing directors or trustees, and, if necessary, of the stockholders, and the causes of his failure to obtain such action, or the reasons for not making such effort.\"\u003c/span\u003e\n\n",
    "body_length": 163389,
    "citedas": [
      "250 Md. 24",
      "242 A.2d 512"
    ],
    "attorneys": "Charles Norman Shaffer and Herbert M. Brune, with whom were Brune, Robertson \u0026 Iglehart, on the brief, for Wayne E. Lenn, et al., part of appellants; Frank P. Parish, in proper person, with whom was Theodore F. Parish, on the brief, for Frank and Theodore Parish, other appellants. Francis D. Murnaghan, Jr., with whom were Paul S. Sarbanes, James R. Miller, Jr. and Edward L. Merrigan, on the brief, for Maryland and Virginia Milk Producers Association, Inc., part of appellees; Stedman Prescott, Jr., with whom were Jacob B. Berkson and Charles W. Prettyman, on the brief, for William I. King, et al., other appellees; M. Peter Moser, with whom were Berryl A. Speert and Charles D. Sanger, Jr., on the brief, for Robert M. Goldman, et al., Executors of Estate of Arthur V. Robinson, other appellees.",
    "category": [
      "243",
      "252"
    ],
    "judges": "Hammond, C. J., and Barnes, McWilliams, Finan and Singley, JJ. Barnes, J., delivered the majority opinion of the Court. Hammond, C. J., dissents in part and concurs in part. Dissenting opinion at page 107, infra.",
    "citation_count": 72
  }
}
