{
  "id": "Q7hoTmYBTlTomsSBCq4W",
  "document": {
    "title": "State v. Bey",
    "full_title": "STATE OF NEW JERSEY v. MARKO BEY (II)",
    "jurisdiction": "Supreme Court of New Jersey",
    "date": "1988-08-02T00:00:00.000Z",
    "docket": "No. A-5",
    "body": "Defendant was convicted of capital murder and sentenced to death. He appealed of right, R. 2:2-1(a)(3), challenging both the guilt and sentencing proceedings. We find no reversible error in the proceedings leading to the verdict that defendant committed capital murder and related offenses. In light of the recent decision of the United States Supreme Court in Mills v. Maryland, U.S. , 108 S. Ct. 1860, 100 L. Ed. 2d 384 (1988), however, we find that the trial court erred in its charge at the penalty phase by requiring that the jury be unanimous in\n\nfinding mitigating factors. For this and other reasons, we reverse the imposition of the death penalty and remand the matter to the Law Division for a new sentencing proceeding.\n\nI\n\nOn April 26, 1983, around 9:20 p.m., Carol Peniston left Neptune High School, where she had attended a computer course, and drove away in her Ford Granada. Ms. Peniston, who was divorced and living alone, neither returned to her apartment nor reported to work the next day.\n\nA week later, on May 3, her former husband, a lieutenant in the Neptune Police Department, received a letter from the Newark Police Department addressed to \"Mr. Carol Peniston.\" The letter advised that Ms. Peniston's car had been involved in an accident the preceding week and that the car had been impounded. Lieutenant Peniston informed the Neptune Police Department, which, in turn, notified the Asbury Park Police Department. Subsequent investigation revealed that the car had been involved in a one-car collision in Newark at 1:46 a.m. on April 26, 1983, approximately four hours after Ms. Peniston left Neptune High School. The defendant's fingerprints were on the rear view mirror.\n\nAt approximately 3:30 p.m. on May 3, Asbury Park police interviewed Attilio Robot, who had found Ms. Peniston's pocketbook near an old industrial building in Asbury Park. Shortly thereafter, the police discovered her body in a shed near the building. An autopsy performed the following day, May 4, disclosed that Ms. Peniston had been dead for several days. The autopsy further disclosed that she had been beaten, sexually assaulted, and strangled. From a sneaker imprint on her chest and from evidence of fractured ribs and hemorrhaging of the right lung, vertebral column, and right atrium of the heart, Dr. Stanley Becker, the Monmouth County medical examiner, concluded that Ms. Peniston's assailant had stomped on her chest. Dr. Becker determined that the ultimate cause of death,\n\nhowever, was ligature strangulation. Subsequent police investigation revealed that characteristics of spermatozoa found on the victim's coat were consistent with those of defendant's saliva, and that defendant's sneakers made an imprint that was similar to the impression on the victim's chest.\n\nOn May 6, Detective Musiello of the Asbury Park Police Department signed a complaint against defendant charging him with receiving stolen property, Ms. Peniston's Ford Granada. Later that day, at approximately 5:15 p.m., five law enforcement officials from Neptune, Asbury Park, and the Monmouth County Prosecutor's Office arrested defendant at his home in Neptune. They handcuffed defendant and took him to the Asbury Park police headquarters, and at approximately 5:35 p.m. placed him in the custody of Detective Musiello and Investigator George of the Monmouth County Prosecutor's Office.\n\nDefendant was placed in an office at police headquarters and given a copy of the complaint. Detective Musiello read to defendant a Miranda warning card, and defendant signed an acknowledgment on the reverse side indicating that he had been advised of those rights. When asked if he wished to see anyone, defendant declined. He was then interrogated concerning his possession of the victim's automobile, during which interrogation he gave conflicting accounts of his activities. The State asserts, but defendant denies, that he was asked at 6:00 p.m. whether he wanted something to drink or to go to the bathroom. About 6:30 p.m., at his request, defendant was given a soda. While he was drinking the soda, defendant stated: \"No matter what I say I'm going to be charged with this offense,\" a statement that referred, according to the State, to the automobile theft charge. The interrogation continued until 7:15 p.m., when defendant was given time to eat dinner. The questioning resumed twenty minutes later at 7:35 p.m., and lasted until 8:20 p.m., when defendant went to the bathroom and was given cigarettes and a soda. On defendant's return to the interrogation room, defendant and Investigator George, the\n\ninterrogating officer, sat in silence for five minutes. Defendant asserts that during this time he may have been crying.\n\nThe trial court found that five minutes later, at 8:30 p.m., defendant said he wanted to lie down so that he could think about what happened. Defendant did not expressly state that the questioning should end. Although the brief in support of defendant's motion to suppress stated that his request to lie down constituted an invocation of his right to remain silent, defendant did not urge that point at the Miranda hearing. In fact at that hearing defendant testified that it was the police who asked whether defendant wanted to lie down.\n\nIn any event, defendant was placed in the Asbury Park municipal jail for about one hour. When he returned to the detective bureau at approximately 9:30 p.m., he was not given a new set of Miranda warnings, but was asked if he wished to communicate with anyone. He declined. Questioning resumed and continued until about 10:05 p.m., when defendant confessed to the crime. Approximately fifty minutes later, defendant was again read his Miranda rights, which he waived. He then gave a written statement, in which he admitted that he accosted Ms. Peniston in front of her apartment building and demanded money from her. The statement continued that when he heard someone coming, he grabbed her and led her to the shed. In the ensuing events, he repeatedly struck Ms. Peniston, sexually assaulted her, and took eight dollars as well as the car keys from her pocketbook. While on his way to Newark in her car, he collided with an iron fence alongside a graveyard, and abandoned the car.\n\nII\n\nGUILT PHASE\n\nOn July 6, defendant was indicted for murder, contrary to N.J.S.A. 2C:11-3a(1) and (2); felony murder, contrary to N.J.S.A. 2C:11-3a(3); kidnapping, contrary to N.J.S.A. 2C:13-1b(1) and (2); aggravated assault, contrary to N.J.S.A. 2C:12-1b(1);\n\naggravated sexual assault, contrary to N.J.S.A. 2C:14-2a(3) and (6); robbery, contrary to N.J.S.A. 2C:15-1a(1), (2) and (3); and theft, contrary to N.J.S.A. 2C:20-3a.\n\nIn response, defendant made numerous pre-trial motions, including an unsuccessful one to suppress his oral and written statements obtained during the custodial interrogation on the night of the arrest. He contends that the confessions are inadmissible because he did not knowingly and intelligently waive his Miranda rights, that the confessions were not voluntary, and that the police failed scrupulously to honor his right to end the interrogation. We disagree.\n\nA. Defendant's Confession\n\nAs a result of the suppression hearing, the trial court found that defendant was properly advised and understood his \" Miranda rights,\" that defendant voluntarily waived those rights, and that he signed the waiver card. The court, however, did not expressly find whether defendant's request to lie down constituted a request to terminate questioning. At the conclusion of the hearing, the court ruled that the oral and written confessions were admissible. We agree.\n\nTo be valid, a waiver must be made \"voluntarily, knowingly, and intelligently.\" Miranda v. Arizona, 384 U.S. 436, 444, 86 S. Ct. 1602, 1612, 16 L. Ed. 2d 694, 707 (1966). The state bears the burden of proof. Id. at 475, 86 S. Ct. at 1628, 16 L. Ed. 2d at 724. Although the United States Supreme Court has held that the state must prove admissibility of a confession by only a preponderance of the evidence, Colorado v. Connelly, 479 U.S. 157, 168, 107 S. Ct. 515, 523, 93 L. Ed. 2d 473, 485 (1986), this Court has held that the State must prove admissibility beyond a reasonable doubt, State v. Miller, 76 N.J. 392, 404-05 (1978). Here, we are persuaded beyond a reasonable doubt that the State has met its burden.\n\nIn determining the voluntariness of a confession, courts consider the characteristics of the accused, as well as the\n\ndetails of the interrogation. Schneckloth v. Bustamonte, 412 U.S. 218, 226, 93 S. Ct. 2041, 2047, 36 L. Ed. 2d 854, 862 (1973). Relevant factors include the defendant's age, education, intelligence, advice concerning his constitutional rights, length of detention, and the nature of the questioning -- specifically, whether the questioning was repeated and prolonged and whether it involved physical punishment or mental exhaustion. Id.; State v. Miller, supra, 76 N.J. at 402.\n\nIn the present case, defendant attained the age of eighteen two weeks before the interrogation. Although young, he had an extensive record of delinquency, which included convictions for robbery, assault, and sexual contact. On the night of his arrest, he was in custody at the police station for approximately nine hours. Altogether he was interrogated for three hours and five minutes before he confessed. During that time, he was offered food, beverages, cigarettes, and the opportunity to rest. The record reveals no evidence of any physical or mental coercion. Defendant was advised of his rights twice during the course of the interrogation, and declined to avail himself of the offer to communicate with an attorney or anyone else. Under these circumstances, we conclude that the trial court correctly found that defendant voluntarily gave his oral and written statements.\n\nDefendant also argues that the police failed to \"scrupulously honor\" his invocation of the right to terminate questioning, in violation of Michigan v. Mosley, 423 U.S. 96, 103-04, 96 S. Ct. 321, 326, 46 L. Ed. 2d 313, 321 (1975), and State v. Hartley, 103 N.J. 252 (1986). He claims that his request to lie down and \"think about what happened\" was an invocation of his right to cut off questioning, and that the police failed to \"scrupulously honor\" his right by resuming interrogation without reissuing the Miranda warning after his one hour of rest. Although defendant alluded to this issue in the brief in support of his motion to suppress, his counsel did not press the point at the Miranda hearing. Instead, defendant claimed at that hearing\n\nthat the confession, because of his youth and fatigue, was extracted involuntarily. He testified that he did not ask for anything during the interrogation at police headquarters and that \"the question [whether he wanted to lie down] was asked me.\" We find that the request did not constitute an invocation of the right to remain silent and, therefore, that the police did not violate that right.\n\nIn Miranda, the United States Supreme Court held that interrogation must cease if the defendant indicates that he wishes to remain silent. 384 U.S. at 473-74, 86 S. Ct. at 1627, 16 L. Ed. 2d at 723. The Court left open the issue \"under what circumstances, if any, the authorities may resume interrogation\" after the defendant asserts the right to remain silent. State v. Hartley, supra, 103 N.J. at 263. Subsequently, in Michigan v. Mosley, supra, 423 U.S. at 104, 96 S. Ct. at 326, 46 L. Ed. 2d at 321, the Court held that \"the admissibility of statements obtained after the person in custody has decided to remain silent depends * * * on whether his 'right to cut off questioning' was 'scrupulously honored.'\" In this regard, the Miranda Court held that \"[o]nce warnings have been given * * * [i]f the individual indicates in any manner * * * that he wishes to remain silent, the interrogation must cease.\" 384 U.S. at 473-74, 86 S. Ct. at 1627, 16 L. Ed. 2d at 723. Similarly, we have stated:\n\n[W]here a suspect makes a statement which arguably amounts to an assertion of his Miranda rights and the interrogating agent recognizes that the statement is susceptible of that construction, his questioning with regard to the crime he is investigating should immediately cease and he should then inquire of the suspect as to the correct interpretation of the statement. [ State v. Wright, 97 N.J. 113, 120 n. 4 (1984) (quoting United States v. Riggs, 537 F.2d 1219, 1222 (4th Cir.1976)).]\n\nAny words or conduct that reasonably appear to be inconsistent with defendant's willingness to discuss his case with the police are tantamount to an invocation of the privilege against self-incrimination. Law enforcement officials, however, are not obliged to accept any words or conduct, no matter how ambiguous, as a conclusive indication that a suspect desires to terminate questioning. State v. LaChappell, 222 Neb. 112, 382 N.W. 2d 343, 348 (1986) (statement that \"[the polygraph] test was over\" was at best \"ambiguous,\" and trial court resolved ambiguity against defendant); see also Nashoalook v. State, 663 P. 2d 975, 978 (Alaska App.1983) (\"ambiguous or equivocal responses following Miranda warnings do not suffice to constitute an assertion by the accused of his constitutional right to silence\"); State v. Hicks, 133 Ariz. 64, 649 P. 2d 267, 277 (1982) (defendant's rambling statement in response to detective's statement that he was willing to end interrogation showed that defendant had not exercised his right to terminate questioning); Watson v. State, 715 S.W. 2d 864, 873 (Tex.App.1986) (when defendant made oral statement after remaining silent when Miranda warnings were administered four times, his prior silence did not sufficiently indicate an invocation of his rights). When the defendant's statement or conduct do not indicate that he is invoking his right to silence, that statement or conduct does not constitute an invocation of the right. See, e.g., Taylor v. Riddle, 563 F.2d 133, 137 (4th Cir.1977) (sustaining trial court finding that defendant's statement, \"[y]ou've done asked me a question I can't answer,\" was not an invocation of the right to remain silent), cert. denied, 434 U.S. 1020, 98 S. Ct. 744, 54 L. Ed. 2d 768 (1978); State v. LaChappell, supra, 382 N.W. 2d at 348 (trial court properly found that the defendant's statement, \"the test was over,\" was not an invocation of the right to cut off questioning); State v. Robbins, 319 N.C. 465, 356 S.E. 2d 279, 298 (1987) (defendant's statement, \"I told you everything I know,\" was not an indication of his desire that all questioning cease); State v. Fincher, 309 N.C. 1, 305 S.E. 2d 685, 694 (1983) (defendant held not to have invoked right to remain silent when he refused to give a second written statement until after his co-defendant told the truth, but agreed to answer after an officer asked if he could ask \"another question.\"). But see United States v. Hernandez, 574 F.2d 1362, 1368 \u0026 n. 9 (5th Cir.1978) (defendant who was arrested, placed in a police van, and interrogated three or four times by two officers in the\n\npresence of each other, invoked his right to remain silent when he repeatedly refused to cooperate with attempts to elicit incriminating statements); People v. Nicholas, 112 Cal.App. 3d 249, 268, 169 Cal.Rptr. 497, 507 (1980) (when defendant said he did not want to discuss matter but three officers repeatedly questioned him to \"wear down his will,\" defendant's request to turn off tape recorder for assurances of privacy constituted an invocation of rights); People v. Williams, 93 Cal.App. 3d 40, 62, 155 Cal.Rptr. 414, 426 (1979) (defendant's statement that he was confused and did not know what to do or say was an invocation of the right to remain silent); Law v. State, 21 Md.App. 13, 318 A.2d 859, 873 (1974) (wounded defendant's statement while handcuffed to a bed and being treated at hospital that he did not want to talk any more until he was further treated constituted an invocation of the right to cut off questioning); Phillips v. State, 701 S.W. 2d 875 (Tex.Crim.App.1985), cert. denied, 477 U.S. 909, 106 S. Ct. 3285, 91 L. Ed. 2d 574 (1986) (in affirming conviction for murder, court found defendant's statement that he \"wanted a little time to think about the matter\" to be an invocation of the right to remain silent, but that the State had scrupulously honored that right); State v. Rissler, 165 W.Va. 640, 270 S.E. 2d 778 (1980) (statement that \"if I give you a statement now, I won't have no shot,\" which interrogating officer understood to be a statement that defendant probably did not want to make a statement, was an invocation of rights). In the present case, the question thus becomes whether defendant's request to lie down and think about what happened constituted an invocation of his right to terminate questioning.\n\nDefendant merely communicated his desire to spend some time thinking about the events that were the subject of the interrogation. He did not ask for an attorney or refuse to sign a waiver of his rights. Similarly, he did not refuse to continue the questioning, and did not indicate in any manner that he wanted to end the interrogation. Not every break in questioning compels renewed administration of the Miranda warnings.\n\nOtherwise, police would be obliged to administer those warnings each time a defendant requested or was offered something to eat or drink, the use of toilet facilities, the opportunity to stand and stretch, or, as here, time to lie down.\n\nConsistent with his position at the suppression hearing, defendant testified:\n\nQ. About 8:30 did you request to go lay down and think about what had happened?\n\nA. Right. I wasn't saying nothing, and the question was asked me, and I said yeah. I was taken to a cell, but the question was asked me. I did go lay down. But the question was asked me. The only thing I asked for when I was in there was the phone call and cigarettes. I didn't ask for nothing else, nothing to eat or no soda or nothing.\n\nDefendant's factual and legal posture at the suppression hearing affects both the testimony of Detective Musiello and the finding of the trial court, on which defendant now relies. Detective Musiello testified:\n\nQ. Directing your attention to about 8:30 or so that evening, can you describe the circumstances of what happened?\n\nA. Yes. At the request of Mr. Bey, he asked if he would be able to think about it and lay down. We told him that we would put him in the cell and come back say in an hour to pick him up and bring him back in an hour, which we did.\n\nQ. That was Mr. Bey's request, to lay down and think about it?\n\nA. Yes.\n\nThe court found that \"[a]t 8:30 p.m. the defendant requested permission to lay down and to think about what happened. He was placed in a cell. At about 9:30 p.m. the police returned to the cell and the defendant was again asked if he wanted to contact anyone, and he replied in the negative.\" Perhaps because defendant did not assert at the suppression hearing that his request constituted an invocation of his right to remain silent, the trial court did not specifically address that issue. Arguably, the trial court's decision could be construed as finding that defendant had not invoked the right to remain silent. The court found both that defendant had requested to lie down and that defendant's statement was voluntary. Implicit in those findings is the conclusion that defendant had not sought the cessation of questioning. Our reading of the record, however,\n\nleads us to believe we come closer to the truth by recognizing that the trial court did not decide the issue because the defendant did not raise it at the hearing.\n\nAlthough the State bears the burden of establishing beyond a reasonable doubt the voluntariness of the confession, State v. Yough, 49 N.J. 587 (1967), defendant must at least claim that he invoked the right of silence for the trial court to adjudicate that claim. See State v. Johnson, 218 N.J. Super. 290, 303-06 (App.Div.), cert. granted and remanded summarily, 108 N.J. 674 (1987); Wharton's Criminal Procedure ยง 361 (1975). Here, defendant did not assert at the hearing on the motion to suppress his confession to the murder of Carol Peniston, which was held in conjunction with a motion to suppress his confession to the murder of Cheryl Alston at the outset of the trial of State v. Bey (I), 112 N.J. 45 (1988), the right that now forms the basis for the attack on his confession. Defendant's silence explains why the trial court did not explicitly address the issue. If we believed that defendant had invoked, no matter how ambiguously his right to remain silent, we would not hesitate to grant his request or to remand the matter to the trial court. Defendant's failure to assert his claim at the hearing has not, as the dissenting opinion suggests, prevented us from reviewing that claim on appeal. His failure, however, explains the absence of an express finding by the trial court. Notwithstanding the failure to address the issue at the trial level, defendant has raised the claim before us. After reviewing that claim, we find it wanting.\n\nWe are confronted with a record that has grown cold with the passage of years. Little purpose would be served by a remand at this late date, and we are obliged to decide the matter in the exercise of our original jurisdiction. R. 2:10-5. Looking at all the circumstances, the record, cold as it is, supports beyond peradventure the conclusion that this defendant did not intend to cut off questioning and remain silent. At the police station, defendant did not refuse to answer questions\n\nabout the Peniston murder. His posture in that regard stands in sharp contrast to his later refusal to discuss the murder of Cheryl Alston. As Investigator George testified at the suppression hearing on defendant's confession to the Alston murder, at the outset, defendant \"indicated he did not want to talk to us about it.\" Bey I, supra, 112 N.J. at 53 (1988). Defendant's subsequent assertion of his constitutional right to terminate questioning about another murder does not invalidate his earlier voluntary confession to the murder of Carol Peniston.\n\nWith respect to the Peniston murder, a remand at this late date would not illuminate the record or serve any other useful purpose. We are remitted to scrutinizing the record and reviewing defendant's statement in light of the surrounding circumstances. That scrutiny leads us to conclude that only in some abstract sense apart from the facts of the case, see W. LeFave \u0026 J. Israel, Criminal Procedure ยง 6.9, at 531 (1984), could defendant's statement be construed as an assertion of the right to remain silent. The police did not construe defendant's request to lie down as an assertion of his right to remain silent, and we do not perceive how any reasonable police officer could have so construed that request. Defendant's Miranda hearing took place several years after the United States Supreme Court ruled that interrogating police officers should scrupulously honor a defendant's assertion of his right to silence. See Michigan v. Mosley, supra, 423 U.S. at 103-04, 96 S. Ct. at 326, 45 L. Ed. 2d at 321. As previously indicated, however, defendant did not contend at his hearing that the challenged statement was a violation of his right to remain silent. Instead, defendant denied seeking permission to lie down, and asserted instead that it was the police who asked him if he wished to \"lie down and think about it.\" Ironically, defendant's own testimony repudiates the argument he now asserts before us. In this context, the trial court's finding that the defendant asked \"to lay down and think about it\" was not so much the resolution of a materially disputed issue as it was a comment leading to the\n\nconclusion that the confession was voluntary. Only by misreading the record can our dissenting colleagues conclude that the defendant was asserting his right to remain silent.\n\nIn finding that defendant's statement cannot reasonably be construed as an invocation of his constitutional rights, we do not retreat from our prior pronouncement that \"a request, 'however ambiguous,' to terminate questioning or to have counsel present must be diligently honored.\" State v. Hartley, supra, 103 N.J. at 263 (quoting State v. Kennedy, 97 N.J. 278 (1984)). Our conclusion reaches no further than finding that under the circumstances of this case defendant's statement did not constitute an invocation of his right to remain silent. That is how defendant and his counsel viewed the issue at the Miranda hearing, and it is how we view the issue now.\n\nFocusing on the issues that were raised at the hearing, the trial court found: \"This defendant was advised of his Miranda warnings prior to giving the statement. That he understood his Miranda warnings. That he signed the Miranda card voluntarily and that he voluntarily waived * * * his rights under Miranda.\" Substantial evidence in the record supports the findings of the trial court, and we decline to disturb them. R. 2:10-1; State v. Johnson, 42 N.J. 146, 162 (1964). Consequently, we hold that the trial court properly found admissible evidence of defendant's oral and written confessions.\n\nOur dissenting colleague Justice Handler concludes that defendant's request to lie down was tantamount to the invocation of his constitutional right against self-incrimination under Miranda. Post at 205-214. Justice Handler reaches that result without reference to the enhanced standard of review he would apply to capital cases. Post at 190, 214. We find, however, even after conducting a meticulous review of the record, which Justice Handler incorporates into his enhanced standard, Bey I, supra, 112 N.J. at 92-93, that defendant did not invoke his right to remain silent.\n\nIn reaching that result, we distinguish defendant's confession in the present case, which we find to be admissible, from his confession to the Alston murder, which we have found to be inadmissible. The different results are not attributable, as the dissent in Bey I contends, to a heightened standard of review. Instead, the inadmissibility of defendant's confession to the Alston murder follows from his unambiguous assertion to the law enforcement officials that \"he did not want to talk to us about it * * *.\" That assertion of his right not to answer questions is a far cry from defendant's posture when he confessed to the Peniston murder. In this case, he received two sets of Miranda warnings, and did not contend at the Miranda hearing that he had invoked his right to remain silent.\n\nB. The Trial\n\nAt trial, the State produced twelve witnesses, who established generally the above-described facts. The defendant testified in the guilt phase of the trial that beginning approximately four and one-half hours before the incident and continuing until shortly before he first saw Carol Peniston, he consumed one hundred and twenty ounces of malt liquor, some straight rum, and smoked a considerable quantity of marijuana. Referring to the incident itself, he admitted to killing Ms. Peniston, but stated he did not know why he did it, and acknowledged that it never should have happened. Defendant's in-court admission was amply corroborated by his fingerprints in the victim's car, the print of his sneakers on the victim's chest, his sperm on her coat, and other evidence. He explained that he became scared when he saw Ms. Peniston looking at him as he went through her pocketbook. He struck and sexually assaulted her, but did not recall stepping on her chest. The only thing he remembered was that once Ms. Peniston saw his face, \"that's when I started hitting her, it just went too far, something that shouldn't have went on.\" The jury returned a verdict convicting defendant of all offenses, including purposeful or knowing murder and felony murder.\n\nC. Intoxication\n\nDefendant contends that the trial court committed reversible error in charging the jury on the defense of intoxication. In this regard, the trial court charged:\n\nThere has been testimony in this case that indicates that [sic] the use of a drug and the consumption of alcoholic beverages by the defendant prior to the time he is alleged to have committed the murder charged. This testimony was received in evidence as bearing on the question of whether the use of drugs and the consumption of alcoholic beverages by the defendant, Marko Bey, can reduce purposeful or knowing murder to aggravated manslaughter or reckless manslaughter * * *.\n\nIf you find * * * that as a result of [alcohol and drug] consumption he was incapable of performing the mental operations that are required for murder, then the defendant could not be found guilty of murder. But the influence of liquor and/or drugs no matter how persuasive * * * is not a defense to the crime of aggravated manslaughter and, therefore, has no bearing on the guilt or innocence of the defendant for that crime.\n\nDefendant did not object to the charge at trial, but now urges that the court failed to make clear that the jury could have found defendant guilty of manslaughter or aggravated manslaughter. His argument is that intoxication is not a defense to a crime such as manslaughter, which requires proof that defendant consciously disregarded \"a substantial and justifiable risk,\" N.J.S.A. 2C:2-2b(3), or to aggravated manslaughter, which requires proof that the defendant caused the victim's death \"under circumstances manifesting extreme indifference to human life,\" N.J.S.A. 2C:11-4a. In support of that argument, defendant points to State v. Warren, 104 N.J. 571 (1986), in which we ruled that \"[d]efendant's conduct is to be measured by an objective standard without regard to his intoxication, and defendant is judged not in his claimed state of intoxication, but as if he were sober.\" Id. at 577. Warren drew upon N.J.S.A. 2C:2-8b, which states that when recklessness is an element of a crime, if intoxication renders defendant \"unaware of a risk of which he would have been aware had he been sober, such unawareness is immaterial.\" Intoxication, however, is a defense to a crime such as capital murder, N.J.S.A. 2C:11-3a(1) and (2), which requires knowing or purposeful conduct. To\n\nconstitute a defense, the intoxication must be sufficient to render defendant incapable of such conduct. State v. Cameron, 104 N.J. 42 (1986); N.J.S.A. 2C:2-8.\n\nAs we stated in Warren,\n\n[a] voluntary drunk may be found guilty of manslaughter, notwithstanding his unawareness 'of a risk of which he would have been aware had he been sober * * *.' N.J.S.A. 2C:2-8. Thus, the defendant who is so drunk that he cannot be found guilty of murder may still be found guilty of aggravated manslaughter or manslaughter. [104 N.J. at 577.]\n\nThe net result is that intoxication is not a defense to a crime predicated on recklessness, and a defendant who was so intoxicated that he cannot be found guilty of capital murder can still be found guilty of manslaughter or aggravated manslaughter. Accordingly, defendant argues that the charge deprived the jury of the option of finding him guilty of manslaughter or aggravated manslaughter. As indicated, defendant did not object to the charge, and State v. Warren had not been decided at the time of the trial. Consequently, the issue is raised as a matter of plain error. Although the charge might have been more explicit, the trial court stated with reference to intoxication, \"[b]ut the influence of liquor and/or drugs no matter how persuasive * * * is not a defense to the crime of aggravated manslaughter and, therefore, has no bearing on the guilt or innocence of the defendant for that crime.\" Thus the trial court made clear that even if defendant's claimed intoxication negated knowing or purposeful murder, it had \"no bearing\" on defendant's culpability for aggravated manslaughter. Although the trial court did not specifically mention manslaughter, we cannot say that the charge constituted plain error. State v. Macon, 57 N.J. 325 (1971); R. 2:10-2. We do not believe that the charge \"is of such a nature as to have been clearly capable of producing an unjust result.\" R. 2:10-2.\n\nIII\n\nSENTENCING\n\nOn September 28, 1984, the trial court conducted a sentencing proceeding in which the State sought to prove two aggravating\n\nfactors. First, that the murder was outrageously or wantonly vile, horrible or inhuman in that it involved torture, depravity of mind or an aggravated battery to the victim, N.J.S.A. 2C:11-3c(4)(c); and second, that the murder was committed during the commission of, or an attempt to commit, or flight after committing, sexual assault or robbery, N.J.S.A. 2C:11-3c(4)(g). The State relied substantially on evidence adduced at the guilt phase of the trial, and also introduced photographs and slides to establish that the murder involved torture or an aggravated battery on Ms. Peniston.\n\nDefendant sought to prove four mitigating factors: first, that he was under the influence of extreme mental or emotional disturbance insufficient to constitute a defense to prosecution, N.J.S.A. 2C:11-3c(5)(a); second, that he was eighteen years old at the time of the murder, N.J.S.A. 2C:11-3c(5)(c); third, that his capacity to appreciate the wrongfulness of his conduct or conform his conduct to the requirements of the law was significantly impaired as a result of intoxication, but not to a degree sufficient to constitute a defense to prosecution, N.J.S.A. 2C:11-3c(5)(d); and fourth, any other factors, including his childhood and upbringing, that would be relevant to his character or record or to the circumstances of the offense, N.J.S.A. 2C:11-3c(5)(h).\n\nIn support of those contentions, defendant presented four witnesses, the first of whom was a sociologist who testified without objection as an expert that the death penalty did not act as a deterrent to other potential murderers. In State v. Davis, 96 N.J. 611 (1984), we ruled that defendant should be given wide latitude on the introduction of testimony in support of mitigating factors. Notwithstanding that pronouncement, we fail to see the relevance of testimony directed to the deterrent effect of the death penalty. For example, the testimony does not relate \"to the defendant's character or record or to the circumstances of the offense.\" N.J.S.A. 2C:11-3c(5). Whether or not the death penalty acts as a deterrent is both controversial and problematic. Gregg v. Georgia, 428 U.S. 153,\n\n96 S. Ct. 2909, 49 L. Ed. 2d 859 (1976); compare T. Sellin, The Penalty of Death 132, 171-72 (1980) (comparison of homicide death rates in different states \"yield[ed] no support for the belief in the deterrent power of the death penalty\") with Ehrlich, The Deterrent Effect of Capital Punishment: A Question of Life and Death, 65 American Economic Rev. 397 (1975) (concluding that there was a significant negative correlation between the probability of execution and the murder rate, thus suggesting a deterrent effect). The National Academy of Science has concluded\n\nthat there is currently no evidence for determining whether or not it does have a deterrent effect. Furthermore, we are skeptical that the death penalty, so long as it is used relatively rarely, can ever be subjected to the kind of statistical analysis that would validly establish the presence or absence of a deterrent effect. [ Deterrence and Incapacitation: Estimating the Effects of Criminal Sanctions on the Crime Rate (A. Blumstein, J. Cohen, and D. Nagin 1978).]\n\nBalancing deterrence against countervailing considerations remains, however, primarily a legislative decision. Here, the sociologist was allowed to testify without objection about the deterrent effect of the death penalty. Such testimony ordinarily is inadmissible because it diverts \"the jurors' attention from the facts of the case before them.\" State v. Ramseur, 106 N.J. 123, 322 (1987).\n\nDefendant's aunt testified about defendant's parents and childhood, stating that defendant was an illegitimate child whose father rejected him and whose mother, the sister of the witness, became an alcoholic and abused defendant. According to his aunt, when defendant was fourteen years old, he began to drink alcoholic beverages and use drugs. He overdosed on alcohol and marijuana, and was hospitalized twice. Defendant's mother confirmed her sister's testimony and placed the blame for her son's conduct on herself. Defendant testified on his own behalf, apologized to Ms. Peniston's family, and stated that \"maybe if I never would have taken drugs it would never have happened.\"\n\nAt the conclusion of the sentencing phase, the court charged, in relevant part:\n\nIf you find that at least one aggravating factor has been proved and at least one mitigating factor exists, then you must weigh the value represented by the mitigating factor or factors against the value represented by each aggravating factor proved. And check on the verdict form whether in your judgment each aggravating factor is or is not outweighed by the mitigating factor or factors found to exist.\n\nUnless each aggravating factor proved is outweighed by the mitigating factor or factors, the sentence will be death. If each aggravating factor is outweighed by the mitigating factor or factors, the sentence will be life imprisonment with a parole ineligibility term of 30 years.\n\nThe weighing process is not mechanical or numerical. If, for example, you find one aggravating factor and three mitigating factors, that does not justify an automatic answer to the weighing process required by you. The answer does depend on your careful and considered judgment as to whether the mitigating factors as you evaluate them favor the defendant to the extent that they outweigh the gravity of the aggravating factor.\n\nUnless each aggravating factor proved is outweighed by the mitigating factor or factors, the sentence will be death. If each aggravating factor is outweighed by the mitigating factor or factors, then you must consider whether all of the aggravating factors collectively are outweighed by the mitigating factors.\n\nYou must check yes or no. Check no only if you find that the mitigating factors do not outweigh the aggravating factors. If the mitigating factors do not outweigh the aggravating factors, the sentence will be death.\n\nSince this is a criminal case your verdict must be unanimous, all 12 jurors deliberating must agree as to the existence or non-existence of particular aggravating or mitigating factors. And you must all agree as to whether the mitigating factors outweigh the aggravating factors.\n\nDefense counsel objected to that part of the charge that required the jury to be unanimous in finding the existence of a mitigating factor. After noting this objection, the court read the special verdict form that the jury was to use in its deliberations:\n\nAGGRAVATING FACTORS\n\nDo you unanimously find beyond a reasonable doubt that any of the following aggravating factors exist? (Check appropriate answer.)\n\n1. That this murder was outrageously or wantonly vile, horrible or inhuman in that it involved torture, depravity of mind, or an aggravated battery to the victim? Yes No\n\n2. That this murder was committed while the defendant was engaged in the commission of or an attempt to commit sexual assault and/or robbery? Yes No\n\nIf all of the above are checked \"no,\" proceed no further but return this verdict sheet to the Court as your verdict in the case signed by your foreperson.\n\nMITIGATING FACTORS\n\nDo you unanimously find that any of the following mitigating factors exist? (Check appropriate answer.)\n\n1. That the defendant, Marko Bey, was at the time of the offense, under the influence of extreme emotional disturbance, although that disturbance was insufficient to constitute a defense to the prosecution? Yes No\n\n2. That the defendant's capacity to appreciate the wrongfulness of his conduct or to conform his conduct to the requirements of the law was significantly impaired as the result of intoxication but not to a degree sufficient to constitute a defense to the prosecution? Yes No\n\n3. The defendant's age at the time of the murder? He was eighteen years old. Yes No\n\n4. Any other factor which you find relevant to the defendant's character or record or to the circumstances of the offense? Yes No\n\nIf you have checked at least one aggravating factor \"yes\" and have checked all of the above mitigating factors \"no\" proceed no further but return this verdict sheet to the Court as your verdict in the case.\n\nIf you have checked one or more aggravating factors \"yes\" and one or more mitigating factors \"yes,\" then state as to each aggravating factor checked \"yes\" whether it is or is not outweighed by any one or more of the mitigating factors checked \"yes.\" This decision also must be unanimous. If an aggravating factor is found and not outweighed by a mitigating factor or factors, the penalty will be death.\n\nThe jury retired at 4:22 p.m. and returned at 5:15 p.m. It found that both aggravating factors, but none of the four mitigating factors, existed. Pursuant to the trial court's instructions, the jury made no further findings. The court stated that the verdict would be that the defendant would be sentenced to death, and polled each juror to confirm the verdict.\n\nA. Jury Selection Issues\n\n1. Death Qualification\n\nPreliminarily, we address several jury selection issues. Defendant contends that the death qualification process, which\n\nrequired each potential juror to express his or her ability to return a death sentence prior to the guilt phase of defendant's trial, violated his right to an impartial jury as such a process results in a jury that is more \"conviction-prone\" than non-death qualified juries. His point is that jurors should be asked their views on capital punishment only after a murder conviction and prior to the sentencing phase. We rejected this contention in Ramseur, supra, 106 N.J. at 248-54. The Death Penalty Act (the Act) presupposes that the same jury that heard the guilt phase of the trial will hear the sentencing phase. Accordingly, \"the State is entitled to insist on a properly conducted interrogation of jurors prior to the guilt phase of a capital trial to determine whether their views on capital punishment will substantially interfere with the performance of their duties as jurors [in either the guilt or penalty phase].\" Id. at 254.\n\nIn his dissent, Justice Handler, post at 191-98, continues to disagree with this Court's ruling in State v. Ramseur that a death qualified jury does not intrude impermissibly on defendant's right to an impartial jury under the state and federal constitutions. We ruled in Ramseur, however, that death qualification of a jury does not violate either the federal or state constitutions. 106 N.J. at 248-54. Contrary to the dissent, we believe that the results of \"ongoing social science research,\" post at 191, do not compel a change in constitutional interpretation on that issue.\n\n2. \"Struck Jury\" System\n\nDefendant contends that the trial court's refusal to implement a \"struck jury\" system for exercising peremptory challenges violated his right to a fair and impartial jury. This argument was rejected in Ramseur, supra, 106 N.J. at 239-43.\n\nUnder a struck jury system, peremptory challenges are used only when an adequate number of potential jurors have been\n\nquestioned and qualified. An \"adequate\" number of jurors generally means the twelve that must be empanelled, plus at least twenty to account for the defendant's peremptory challenges, and at least twelve more to account for the State's peremptories. R. 1:8-3(d). As discussed in Ramseur, supra, 106 N.J. at 241, a struck jury system enables the parties to exercise their peremptory challenges with a better perception of the total composition of the jury. Qualifying additional jurors for cause, however, raises questions about the efficiency of the struck jury system.\n\nIn Ramseur, we did not disapprove of the use of a struck jury system, but left use of such a procedure to the sound discretion of the trial courts, which are to balance the \"exigencies of the judicial system with the interest of the parties in exercising informed peremptory challenges.\" Id. at 242. Accordingly, we find that the trial court acted within its discretion in refusing defendant's request for a struck jury system.\n\n3. Exclusion for Cause\n\nDefendant contends that he should have been permitted to exclude juror Kurlowicz for cause because of the juror's bias in favor of imposing the death penalty. Last year, in Ramseur, supra, 106 N.J. at 248-56, we traced the evolution of the standard for the exclusion for cause of jurors from Witherspoon v. Illinois, 391 U.S. 510, 88 S. Ct. 1770, 20 L. Ed. 2d 776 (1968), to Adams v. Texas, 448 U.S. 38, 100 S. Ct. 2521, 65 L. Ed. 2d 581 (1980), and Wainwright v. Witt, 469 U.S. 412, 105 S. Ct. 844, 83 L. Ed. 2d 841 (1985). Witherspoon held that jurors who would automatically vote against the death penalty may be excused for cause. Adams and Witt modified Witherspoon by stating \"a prospective juror may be excluded for cause because of his or her views on capital punishment. That standard is whether the juror's views would 'prevent or substantially impair the performance of his duties as a juror in accordance with his instructions and his oath.'\" Witt, supra, 469 U.S. at 424, 105 S. Ct. at 852, 83 L. Ed. 2d at 851-52 (quoting Adams, supra,\n\n448 U.S. at 45, 100 S. Ct. at 2526, 65 L. Ed. 2d at 589). In adopting the Adams-Witt modification of Witherspoon as applied to the opponents of capital punishment, we observed in Ramseur that the protection accorded a defendant under the New Jersey Constitution was generally co-extensive with that under the federal Constitution. 106 N.J. at 251.\n\nAlthough Witherspoon, Adams, and Witt dealt with the exclusion of opponents of the death penalty, we believe that the same standard should apply to jurors who are proponents of the death penalty. All jurors are obliged to give \"a true verdict * * * according to the evidence.\" N.J.S.A. 2A:74-6. Jurors are equally bound to render a just and impartial verdict whether they are for or against the death penalty. Our duty to assure that a defendant is tried by an impartial jury leads us to conclude that a single test should apply to all jurors irrespective of their predilection concerning the death penalty. Accord Pope v. State, 256 Ga. 195, 345 S.E. 2d 831, 838 (1986). Recently the United States Supreme Court similarly concluded that it would be reversible error to permit jurors to sit on the penalty phase if their bias in favor of the death penalty substantially impaired their impartiality, provided the defense properly preserved the right to challenge the court's failure to remove the jurors for cause. Ross v. Oklahoma, U.S. , 108 S. Ct. 2273, 101 L. Ed. 2d 80 (1988). In the present case, because defense counsel peremptorily excused Kurlowicz, we need not decide whether it is reversible error to permit a juror who favors the death penalty to sit on the guilt phase.\n\nThe voir dire of juror Kurlowicz reflects his inability to consider all mitigating factors and to decide impartially either defendant's guilt or punishment. Under initial questioning from the court, Kurlowicz denied both that he opposed capital punishment in all situations and that he favored it for every person convicted of murder. He acknowledged his belief that capital punishment is \"justified in certain cases,\" but denied that his feelings about the death penalty would influence his deliberation on guilt:\n\nQ. Even if you are in favor of the death penalty, could you still fairly and impartially consider the evidence in determining whether the defendant is guilty or not guilty of the charges.\n\nA. Yes. Your Honor.\n\nIn response to questions from defense counsel, the juror indicated \"[l]ike I say, if it's a violent crime I think a man should be put to death.\" Pursuing the juror's response to an earlier question, counsel asked what the juror meant by \"cold-blooded murder:\"\n\nA. Like in a robbery, a hold-up.\n\nQ. Rape?\n\nA. Rape, yes.\n\nQ. Is that what you mean by cold-blooded murder?\n\nA. Could be, yes.\n\nQ. * * * I want you to assume something. I want you to assume that you have heard all of the evidence and I want you to assume that you and the other ladies and gentlemen with you * * * have found unanimously and beyond a reasonable doubt that a defendant committed a murder during the course of robbery, rape and kidnapping, no defense to it, no defense at all * * *. In that situation when you were so convinced would you automatically then vote for the death penalty.\n\nA. I believe I would.\n\nQ. You would. Would you find it extremely difficult in a circumstance like that then to vote for a jail term * * *? * * * Would you say it would be very difficult?\n\nA. It would be.\n\nQ. Would you say it would be almost impossible?\n\nA. Well, yes.\n\nQ. Almost impossible?\n\nA. Yes.\n\nThe juror indicated to the prosecutor, however, that he would consider factors in mitigation of the punishment, and that he could return a sentence less than death. On further questioning by the defense, Kurlowicz reverted to the position that he would \"find it very difficult to vote against\" the death penalty where the murder was \"cold-blooded.\" Finally, the court asked Kurlowicz whether he would \"automatically vote for the death penalty or would you consider the mitigating factors?\" The juror indicated that his decision would not be \"automatic * * * one way or the other.\" Because of Kurlowicz's response, the court\n\nwas \"satisfied he does not come within the purview of Witherspoon \" and seated the juror. The defense, as previously indicated, later excused juror Kurlowicz peremptorily.\n\nAs the preceding interrogation discloses, the juror stated that his decision would not be \"automatic,\" but that he would find it \"almost impossible\" not to vote for the death penalty. That statement suggests that his capacity to credit the evidence in mitigation would be \"substantially impaired\" within the meanings of Adams and Witt. Notwithstanding his assertion that he would consider the evidence in mitigation, his capacity to deliberate impartially was \"substantially impaired\" by his belief that \"if it's a violent crime I think a man should be put to death.\"\n\nHere, however, the error was harmless. Defendant excused juror Kurlowicz through the exercise of a peremptory challenge. Despite the fact that it was forced to use a peremptory challenge, the defense never exhausted its allotment of peremptory challenges. Although \"the denial of the right of peremptory challenge is the denial of a substantial right,\" State v. Singletary, 80 N.J. 55, 62 (1979), defendant in the present case, unlike the defendant in Singletary, did not exhaust his peremptories. Kurlowicz, moreover, was the first juror challenged by defendant, who at that time had nineteen challenges remaining. Thus, we disagree with Justice Handler's conclusion that the \"erroneous refusal to excuse a prospective juror for cause on death-qualification grounds should be reversible regardless of whether a defendant ultimately exhausts his peremptory challenges.\" Post at 205.\n\nUnder the sixth amendment to the United States Constitution, it is not reversible error to fail to excuse for cause a juror who is thereafter peremptorily dismissed by a defendant who exhausts all his peremptory challenges \"[s]o long as the jury that sits is impartial * * *.\" Ross v. Oklahoma, supra, U.S. at , 108 S. Ct. at 2278, 101 L. Ed. 2d at 90. In the present case, we need not determine whether that error would\n\nbe reversible under article I, paragraph 10 of the New Jersey Constitution.\n\nWe recognize that forcing a defendant to \"waste\" a peremptory challenge could force defense counsel to be more cautious in the exercise of remaining peremptories. Consequently, we caution trial courts to be particularly sensitive in capital cases to the defendant's right to a full complement of twenty peremptory challenges. See R. 1:8-3(d). Here, the defendant did not exhaust his full complement of peremptory challenges, and the error in failing to excuse Kurlowicz for cause was harmless. Thompson v. State, 721 P. 2d 1290, 1291 (Nev.1986).\n\nIn that regard, Rule 1:8-3(d) provides that \"[t]he trial judge shall have the discretionary authority to increase proportionally the number of peremptory challenges available to the defendant and the State in any case in which the sentencing procedure in subsection c. of N.J.S.A. 2C:11-3 might be utilized,\" i.e., in a death penalty case. As the defendant approaches the exhaustion of his or her peremptory challenges, the trial court should become increasingly sensitive to the possibility of prejudice from its failure to dismiss the juror for cause. That heightened sensitivity should lead to a more generous exercise of discretion as defendant approaches the exhaustion of his or her peremptory challenges.\n\nB. Sentencing Procedures\n\nIn State v. Biegenwald, 106 N.J. 13 (1987), and in State v. Ramseur, supra, 106 N.J. 123, we sustained the Death Penalty Act, N.J.S.A. 2C:11-3c, as facially constitutional, finding that the statute had been drafted to avoid the risk that it would be applied arbitrarily and capriciously. Ramseur, supra, 106 N.J. at 183. We also addressed certain issues pertaining to the interpretation and application of the Act. Specifically, we concluded that the death penalty may not be imposed \"without a finding that the aggravating factors outweighed the mitigating factors beyond a reasonable doubt,\" Biegenwald,\n\nsupra, 106 N.J. at 53, and that jury instructions should never dilute the jury's responsibility for the decision whether the defendant should live or die, Ramseur, supra, 106 N.J. at 316. The present case requires us to elaborate on the procedures a sentencing jury is to follow in reaching that decision. We proceed with the awareness of the qualitative difference between the death penalty and other penalties, a difference that makes it unthinkable for jurors to impose the death penalty when they harbor a \"reasonable doubt as to its justness.\" Biegenwald, supra, 106 N.J. at 60.\n\n1. Consideration of Mitigating Factors\n\nThe United States Supreme Court has struggled to develop a system of capital punishment that is \"at once consistent and principled but also humane and sensible to the uniqueness of the individual.\" Eddings v. Oklahoma, 455 U.S. 104, 110, 102 S. Ct. 869, 874, 71 L. Ed. 2d 1, 8 (1982). In a progression of cases, the Court has ruled that such a system must channel the discretion of the jury, but not so severely as to deflect the jury's attention from the individual who is being sentenced. The sentencer, therefore, must consider \"the character and record of the offender and the circumstances of the particular offense * * *.\" Woodson v. North Carolina, 428 U.S. 280, 304, 96 S. Ct. 2978, 2991, 49 L. Ed. 2d 944, 961 (1976). We, too, have recognized that \"[t]he sentencer, whether judge or jury, has a constitutional obligation to evaluate the unique circumstances of the individual defendant.\" Biegenwald, supra, 106 N.J. at 48 (quoting Spaziano v. Florida, 468 U.S. 447, 459, 104 S. Ct. 3154, 3161, 82 L. Ed. 2d 340, 352 (1984)). It follows that a state statute may not preclude the jury from considering any relevant mitigating evidence pertaining to any aspect of defendant's character. Sumner v. Shuman, 483 U.S. , - , 107 S. Ct. 2716, 2722-23, 97 L. Ed. 2d 56, 65-66 (1987); Eddings v. Oklahoma, 455 U.S. 104, 102 S. Ct. 869, 71 L. Ed. 2d 1 (1982); Lockett v. Ohio, 438 U.S. 586, 608, 98 S. Ct. 2954, 2967, 57 L. Ed. 2d 973, 992 (1978); Ramseur, supra, 106 N.J. at 185-86;\n\nState v. Davis, 96 N.J. 611, 617 (1984). The jury should know whom it is sentencing to death.\n\nA sentencing procedure, moreover, may not expose a defendant to \"the risk that the death penalty will be imposed in spite of factors which may call for a less severe penalty.\" Lockett, supra, 438 U.S. at 605, 98 S. Ct. at 2965, 57 L. Ed. 2d at 990. Consistent with these constitutional principles, the Act enumerates eight mitigating factors, including a catch-all factor, which provides for the introduction of evidence relating to:\n\n(h) Any other factor which is relevant to the defendant's character or record or to the circumstances of the offense. [ N.J.S.A. 2C:11-3c(5).]\n\nThe legislative intent that the defendant be granted wide leeway in presenting evidence in mitigation of the death penalty is apparent also from the history of the Act. Public Hearing Before Senate Judiciary Committee on Senate, No. 112, Feb. 26, 1982, at 2 (Public Hearing) (\"The leeway for the factors of mitigation is wide.\") (statement of Senator John F. Russo, Chairman); id. at 13 (\"The jury has a right to consider whatever evidence [the defendant] presents in mitigation of the imposition of the death penalty.\") (statement of Edwin Stier, Director of the Division of Criminal Justice in the Department of Law and Safety).\n\nJury verdicts on guilt must be unanimous. R. 1:8-9; State v. Cordasco, 2 N.J. 189, 202 (1949); State v. Gadson, 148 N.J. Super. 457 (App.Div.1977). In the Act, the Legislature carried forward the unanimity requirement in the sentencing phase of the capital case by providing that \"if the jury is unable to reach a unanimous verdict, the court shall sentence the defendant pursuant to subsection b.\" By requiring that the jury be unanimous on the imposition of the death penalty, the statute assures that each juror must accept full responsibility for the imposition of that sanction. State v. Reynolds, 41 N.J. 163, 187 (1963), cert. denied, 377 U.S. 1000, 84 S. Ct. 1930, 12 L. Ed. 2d 1050, reh'g denied, 379 U.S. 873, 85 S. Ct. 22, 13 L. Ed. 2d 80 (1964).\n\nThe vehicle through which the jury discharges its responsibility is the determination of the existence of aggravating and mitigating factors and the balancing of the former against the latter. In the sentencing phase, the jury is obliged to determine, first, the existence of any aggravating factor or factors. The jury must find that at least one aggravating factor exists before the death penalty may be imposed. If the jury \"finds that no aggravating factors exist * * * the court shall sentence the defendant pursuant to subsection b,\" which requires a term of imprisonment. If, however, the jury finds an aggravating factor exists, then it must determine whether any mitigating factors also exist. After making fact findings about the \"existence or non-existence\" of aggravating and mitigating factors, the jury must then make the normative judgment whether the aggravating outweigh the mitigating factors beyond a reasonable doubt. That decision, in effect, determines the appropriateness of the death penalty for the defendant.\n\nIn reaching that decision, the jury should balance all aggravating factors against all mitigating factors. We recognize an apparent inconsistency between N.J.S.A. 2C:11-3c(3) and N.J.S.A. 2C:11-3c(3)(a). The former section provides:\n\nThe jury, or if there is no jury, the court shall return a special verdict setting forth in writing the existence or non-existence of each of the aggravating and mitigating factors set forth in paragraphs (4) and (5) of this subsection. If any aggravating factor is found to exist, the verdict shall also state whether or not it outweighs beyond a reasonable doubt any one or more mitigating factors. [ N.J.S.A. 2C:11-3c(3).]\n\nThe latter section, however, provides that in the weighing process,\n\n[i]f the jury or the court finds that any aggravating factors exist and that all of the aggravating factors outweigh beyond a reasonable doubt all of the mitigating factors, the court shall sentence the defendant to death. [ N.J.S.A. 2C:11-3c(3)(a).]\n\nConceivably, N.J.S.A. 2C:11-3c(3) could be read to require the jury to weigh each aggravating factor against one or more mitigating factors. We have no doubt, however, that for the death penalty to be imposed, the overall effect must be that all\n\naggravating factors outweigh mitigating factors beyond a reasonable doubt. Biegenwald, supra, 106 N.J. at 62.\n\nAlthough the Act does not expressly require the jury to be unanimous in finding the existence of an aggravating factor or factors, the lack of unanimity suggests that the factor has not been established beyond a reasonable doubt as required by N.J.S.A. 2C:11-3c(2)(a). Requiring a unanimous finding on the existence of an aggravating factor is consistent with the general requirement of unanimity in criminal cases, and is not disputed by the State. The unanimity requirement extends only to verdicts adverse to the defendant, and the Legislature may provide for the return of a verdict favorable to the defendant on less than unanimity. See, e.g., State v. Kirkley, 308 N.C. 196, 302 S.E. 2d 144, 163 (1983) (Exum, J., dissenting); Molandes v. State, 571 S.W. 2d 3, 4 (Tex.Crim.App.1978). For example, under the Act, the unanimity requirement redounds to the benefit of the defendant by mandating that he or she must be sentenced to imprisonment rather than death unless the jury is unanimous on the imposition of the death penalty. N.J.S.A. 2C:11-3c(3)(c).\n\nIn the present case, one issue is whether the jury must be unanimous in finding the existence of a mitigating factor. Although the legislative history is inconclusive, the logic of the Act indicates that the Legislature intended that jurors need not unanimously find the existence of a mitigating factor. Unlike the State, which must establish the existence of an aggravating factor beyond a reasonable doubt, the defendant bears only \"the burden of producing evidence of the existence of any mitigating factor.\" N.J.S.A. 2C:11-3c(2)(a). Thus, the defendant bears the burden only of coming forward, not the burden of proof on the existence of a mitigating factor. Public Hearing, supra, at 12.\n\nIt would contravene the logic of the Act to rule that a jury could unanimously reach a verdict that the aggravating outweigh the mitigating factors beyond a reasonable doubt if eleven jurors believed that the evidence supported the existence\n\nof a mitigating factor or factors and those jurors were prevented, because of the disagreement of a solitary juror, from weighing those mitigating factors against the aggravating factors. The same result follows if just one juror believes in the existence of a single mitigating factor. All jurors might agree that some mitigating factors exist, and some jurors might agree that all mitigating factors exist, but all may not agree on the existence of any particular mitigating factor. In such a case, where the jury does not unanimously find the existence of any mitigating factor, if it finds at least one aggravating factor to exist, that finding would be tantamount to the imposition of the death sentence. A juror who found a mitigating factor would be precluded from weighing that factor despite the fact that he or she did not believe that the aggravating factor outweighed that mitigating factor. The same result would follow if eleven of twelve jurors acknowledged that a particular mitigating factor existed. In effect, a single dissenting juror could force the imposition of the death penalty.\n\nAs we have previously stated, \"[w]e do not believe the Legislature intended a man should go to his doom because one juror disagreed with [the other] eleven.\" State v. Reynolds, supra, 41 N.J. at 187. As long as one juror believes in the existence of a mitigating factor, that juror should be permitted to engage in the weighing process. Mills v. Maryland, supra, U.S. at - , 108, S. Ct. at 1865-66, 100 L. Ed. 2d at 393-95. But see State v. Kirkley, supra, 308 N.C. at 196, 302 S.E. 2d at 157 (\"consistency and fairness dictate that a jury unanimously find that a mitigating circumstance exists before it may be considered for the purpose of sentencing\"). Each juror must be convinced beyond a reasonable doubt that the aggravating outweigh the mitigating factors. Any juror who believes in the existence of a mitigating factor must be allowed to determine whether he harbors such a doubt by conducting his or her own weighing process.\n\nThe jury instructions in the present case did not comply with that requirement. The court charged the jury: \"Since this\n\nis a criminal case your verdict must be unanimous, all 12 jurors deliberating must agree as to the existence or non-existence of particular aggravating or mitigating factors.\" Consistent with the charge, the verdict sheet provided: \"Mitigating factors: Do you unanimously find that any of the following mitigating factors exist?\" The effect of that charge was to prevent each juror from considering any mitigating factor or factors, no matter how strongly the juror believed in the existence of the factors, unless all other jurors agreed that the factors existed. That such a charge can produce arbitrary and unreliable results is obvious.\n\nAs a corollary to the rule that the jury must not impose the death penalty if even one juror finds that the aggravating factors do not outweigh the mitigating factors, each juror must individually determine the existence of mitigating factors. As long as one juror perceives any mitigating factor relating to the defendant or to the crime that is not outweighed beyond a reasonable doubt by the aggravating factors, the jury must not sentence the defendant to death. Mills v. Maryland, supra, U.S. at - , 108 S. Ct. at 1865-66, 100 L. Ed. 2d at 393-95. Each juror, therefore, should individually determine the existence of mitigating factors and then individually decide whether the aggravating outweigh the mitigating factors beyond a reasonable doubt. Only after such independent weighing by each juror may the unanimous agreement of all jurors lead to the imposition of the death penalty.\n\nAs the United States Supreme Court recently held, a contrary interpretation would violate the United States Constitution. Specifically, the Court found that requiring a jury to agree unanimously to the existence of a mitigating factor before the jury may give effect to that factor unconstitutionally precludes the jury from considering mitigating evidence proffered by the defendant and risks an erroneous imposition of the death sentence. Ibid. For the preceding reasons, we reverse the imposition of the death penalty on defendant.\n\n2. The Jury's Sense of Responsibility for Its Verdict\n\nIn capital cases, jury sentencing constitutes a link between contemporary community values and the penal system. Without that link, the determination of punishment could hardly reflect \"the evolving standards of decency that mark the progress of a maturing society.\" Gregg v. Georgia, 428 U.S. 153, 173, 96 S. Ct. 2909, 2925, 49 L. Ed. 2d 859, 874 (1976) (quoting Trop v. Dulles, 356 U.S. 86, 101, 78 S. Ct. 590, 598, 2 L. Ed. 2d 630, 642 (1958)). When the jury speaks, it is as the conscience of the community. Ramseur, supra, 106 N.J. at 316. As important as correct jury instructions are to all criminal cases, State v. Collier, 90 N.J. 117 (1982); State v. Green, 86 N.J. 281 (1981), they are even more crucial in a capital case because of the jury's responsibility to decide whether a defendant shall live or die. Correlative to that responsibility is the requirement of enhanced \"reliability in the determination that death is the appropriate punishment in a specific case.\" Caldwell v. Mississippi, 472 U.S. 320, 330, 105 S. Ct. 2633, 2640, 86 L. Ed. 2d 231, 240 (1985) (quoting Woodson v. North Carolina, 428 U.S. 280, 305, 96 S. Ct. 2978, 2991, 49 L. Ed. 2d 944, 961 (1976)). Consequently, in its charge to the jury in the sentencing phase of a capital trial, a trial court must be careful not to dilute the jury's sense of responsibility for determining the appropriateness of the death penalty. Id. at 328-29, 105 S. Ct. at 2639, 86 L. Ed. 2d at 239; State v. Mount, 30 N.J. 195, 214 (1959); accord Johnson v. Tennessee, No. 83-241 III (Jan. 20, 1988) (slip op. at 26) [available on WESTLAW, 1988 WL 3632].\n\nEach juror must decide whether the law requires that the defendant must be put to death. Witherspoon v. Illinois, supra, 391 U.S. 510, 88 S. Ct. 1770, 20 L. Ed. 2d 776. Accordingly, the court's instructions must communicate to the jury that a death verdict is not the product of a mechanical application of the statute, but a reflection of the jury's normative judgment that death is \"the fitting and appropriate punishment.\" Ramseur, supra, 106 N.J. at 316 n. 80. Jurors are not mere fact\n\nfinders, but the ultimate determiners of whether the defendant shall live or die.\n\nA court should not instruct the jury that it can avoid that ultimate determination merely by making factual findings. Such an instruction dilutes the jury's sense of responsibility for the death verdict. The trial court must ensure that the finding of the absence of mitigating factors reflects the unanimous agreement of the jurors that they are convinced that the death penalty is fitting and appropriate. People v. Durre, 690 P. 2d 165, 174 (Colo.1984). The instructions should apprise the jury that it is not merely to decide the existence of aggravating and mitigating factors, but to evaluate the evidence supporting those factors in making the \"unique, individualized judgment\" regarding the appropriateness of the death penalty. Zant v. Stephens, 462 U.S. 862, 900, 103 S. Ct. 2733, 2755, 77 L. Ed. 2d 235, 265 (1983) (Rehnquist, J., concurring). Thus, the sentencing phase of a capital case requires the jury to make a judgment based on conflicting values whether defendant should live or die. Biegenwald, supra, 106 N.J. at 62. In addition to providing appropriate instructions, a trial court insures compliance with that weighing process by providing a verdict sheet that informs the jury of the consequences of its decisions and by polling jurors to assure their individual agreement with the verdict. Ramseur, supra, 106 N.J. at 316 n. 80.\n\nIn the present case, the trial court began correctly by stating that \"[t]he ultimate burden rests upon the State to convince you that the death penalty is fitting and appropriate punishment in this case.\" Then, the court instructed the jury that it should decide whether it was convinced beyond a reasonable doubt that any aggravating factor existed. If it so decided, the jury was then to find whether any mitigating factors existed. If the jury failed to find any mitigating factors, it was to cease its deliberations and return its findings as a verdict. Specifically, the trial court charged:\n\nIf you find that the State has proved at least one aggravating factor beyond a reasonable doubt but you are not satisfied as to the existence of any mitigating factor, check the verdict form accordingly * * *.\n\nIn that event the sentence will be death.\n\nThe problem with this instruction is that it reasonably could have left the jury with the impression that its function was merely to determine the existence of aggravating and mitigating factors. Further, if the jury found at least one aggravating factor but no mitigating factors, the death penalty would automatically follow from the mechanical operation of the statute. Consequently, the charge failed to communicate that the jury, not the mechanics of the statute or the \"law,\" is ultimately responsible for the imposition of the death penalty. The court should have expressly instructed the jury that a consequence of finding one or more aggravating factors and no mitigating factors meant that the jury thought that the death penalty was a fitting and appropriate punishment for the defendant. Such a charge would have \"suitably directed\" any belief of a juror about the inappropriateness of the death penalty to one or more mitigating factors. Gregg v. Georgia, 428 U.S. 153, 189, 96 S. Ct. 2909, 2932, 49 L. Ed. 2d 859, 883 (1976).\n\nIn fact, the jury found that two aggravating and no mitigating factors existed. Although the verdict reflected the jury's factual findings, it is not clear that the jury understood that it bore the burden of deciding whether to impose the death sentence and that it was not relieved by some statutory scale as the ultimate arbiter of defendant's life. In sum, we find reversible error in the trial court's failure to inform the jury that it need not unanimously find the existence of any mitigating factor and to instruct the jury that it was responsible for the imposition of the death penalty.\n\n3. Instructions by the Trial Court and Comments by Prosecutor that Diluted Jury's Sense of Responsibility for the Death Sentence\n\nDefendant contends that other portions of the guilt phase instructions diluted the jury's responsibility for the imposition of the death penalty. The court charged:\n\nLet no fear of responsibility deter you from discharging your duties faithfully for the consequences that may follow from your verdict neither you nor this Court is responsible.\n\nWhen we have discharged our duty fairly, conscientiously and firmly, our responsibilities are at an end and we may leave the consequences to the law.\n\nYou should not concern yourselves with the possible penalty a guilty verdict will bring. The imposition of punishment is solely for the Court.\n\nFurther, the court assured the jury that \"[t]here is nothing peculiarly different in the way a jury is to consider the proof in a criminal case from that in which all reasonable persons treat any questions depending upon evidence presented to them.\"\n\nWe iterate that it is unconstitutional \"to rest a death sentence on a determination made by a sentencer who has been led to believe that the responsibility for determining the appropriateness of the defendant's death rests elsewhere.\" Caldwell v. Mississippi, supra, 472 U.S. at 328-29, 105 S. Ct. at 2639, 86 L. Ed. 2d at 239. Trial judges are bound \"to make absolutely certain [that] the jury is aware, not simply of the consequences of its actions, but of its total responsibility for the judgment.\" Ramseur, supra, 106 N.J. at 316. In Ramseur, we found that the trial court's instruction that the jury was \"merely to determine the presence or absence of aggravating or mitigating factors and if you find that they are present you are to weigh them\" may have left the jury with the impression that its function was one of mechanical fact-finding. Accordingly, we held that the instruction constituted prejudicial error. Id. at 316.\n\nDefendant focuses on the instruction in the guilt phase that the jurors should \"[l]et no fear of responsibility deter you from discharging your duties,\" \"not concern yourselves with the possible penalty a guilty verdict will bring,\" and \"leave the consequences to the law.\" In brief, defendant argues the instruction violated our admonition in Ramseur. We believe, however, that the concerns on the guilt and penalty phases of the trial are sufficiently distinct for the instruction to pass muster. Trial courts are obligated to ensure that jurors do not\n\nlet their views on capital punishment substantially interfere with the performance of their duties at either phase of a capital trial. See id. at 254. In the present case, the trial court's guilt phase instruction did not dilute the jury's sense of responsibility on the penalty phase.\n\nDefendant also contends that comments by the prosecutor on the penalty phase summation improperly diluted the jury's sense of responsibility for the death penalty decision. Specifically, defendant refers to the following statements by the prosecutor: \"You have given him a fair trial. If the results, if the end is death, then so be it. If the balancing factor is equivalent to that, so be it. But don't feel sorry for Marko Bey.\" Those comments, however, do not rise to the level of impropriety that we found prejudicial in Ramseur. Here, the prosecutor was simply urging the jury to perform the statutory weighing process without allowing extraneous pity to bias its verdict. Like judges, however, prosecutors should refrain from gratuitous comments that could lead to the unconstitutional dilution of a jury's sense of responsibility for its verdict.\n\n4. Adequacy of the Jury Instructions Regarding Mitigating Factors\n\nAnother aspect of the charge requires our attention. As previously indicated, defendant requested the trial court to charge the jury with a general explanation of the nature and function of mitigating factors:\n\nMitigating factors do not necessarily constitute a justification or excuse for the offense in question; rather, they are circumstances which in fairness and mercy, may be considered as extenuating or reducing the degree of moral culpability.\n\nDefendant, who had not asserted the defense of insanity or diminished capacity at the guilt phase, requested a comprehensive explanation of \"extreme emotional disturbance insufficient to constitute a defense to the prosecution.\" Concerning intoxication, defendant requested an instruction on the distinction\n\nbetween intoxication as a defense to the charge of murder and as a mitigating factor on sentencing. With regard to defendant's age, defendant requested an instruction emphasizing both his relative youth and immaturity at the time of the offense and his potential for rehabilitation. Finally, concerning the factor that authorizes the jury to consider anything relevant to the defendant's character or record or the circumstances of the offense, defendant requested an instruction focusing the jury's deliberations on the evidence of the defendant's difficult background, the expert witness's opinion about the deterrent effect of the death penalty, and the defendant's possibility of rehabilitation.\n\nThe actual instructions did not incorporate any of the defendant's requests. In the instruction pertaining to the general function of mitigating factors, the court simply stated that \"mitigating factors are those which would tend toward the sentence of life imprisonment.\" Then the court charged the jury that \"[t]he factors have to do both with the circumstances of the crime and the personal traits, qualities, and background of the defendant.\" The entire charge concerning the specific mitigating factors was:\n\nThe defense has advanced the following mitigating factors in accordance with the listing of them in the Criminal Code:\n\n1. That the defendant, Marko Bey, was at the time of the offense under the influence of extreme emotional disturbance although that disturbance was insufficient to constitute a defense to prosecution.\n\n2. That the defendant's capacity to appreciate the wrongfulness of his conduct or to conform his conduct to the requirements of the law was significantly impaired as a result of intoxication but not to a degree sufficient to constitute a defense to the prosecution.\n\n3. The defendant's age at the time of the murder. He was eighteen years old.\n\n4. Any other factor which you would find relevant to the defendant's character or record or to the circumstances of the offense.\n\nYou have heard the testimony from Dr. William J. Bowers, an expert in the field of sociology. He has been permitted to express his opinion as to the deterrent value and effect of the death penalty. As he is an expert in the field to which he spoke, you may consider the qualifications of that witness and the reasons given for his opinion.\n\n[The court then instructed the jury on how to evaluate the testimony of an expert witness.]\n\nNow with respect to the last mitigating factor, I charge you that you are required to consider anything concerning a defendant's life and characteristics and the particular circumstances of the crime for which he was found guilty.\n\nIn brief, the charge of mitigating factors was essentially a recitation of the statutory language. Defendant contends that the elaboration of mitigating factors was so minimal as to preclude the jury from giving adequate consideration to defendant's mitigating evidence. He further contends that the charge violated requirements of New Jersey law on jury instructions, and prevented the jury from properly conducting the weighing process mandated by the Act. Because of our decision to reverse on other grounds, ante at 162-63, we find it unnecessary to decide whether the alleged inadequacy in the jury instructions warrants reversal. Nonetheless, we consider defendant's claim for the purpose of guidance in other cases. See Ramseur, supra, 106 N.J. at 287 (considering the adequacy of instructions on aggravating factors solely for guidance and not addressing the issue whether the deficient instructions in that case warranted reversal).\n\nDefendant concedes that he has \"no right to select the particular phrasing of the jury instructions in his case.\" See id. at 292 (quoting United States v. Gaines, 690 F.2d 849, 855 (11th Cir.1982)). Both the federal courts and this Court have declined to prescribe specific language to guide the jury's consideration of mitigating factors. Setting such standards could deprive a trial court of the discretion it needs in molding a charge. As the United States Supreme Court has written, \"the Constitution does not require a State to adopt specific standards for instructing the jury in its consideration of aggravating and mitigating circumstances.\" Zant v. Stephens, 462 U.S. 862, 890, 103 S. Ct. 2733, 2750, 77 L. Ed. 2d 235, 258 (1983). The important point is not so much requiring a specific charge as it is providing the jury with guidelines for \"an individualized determination on the basis of the character of the individual and the circumstances of the crime.\" Id. at 879, 103 S. Ct. at\n\n2743, 77 L. Ed. 2d at 251. Consequently, \"the Constitution does not require specific and detailed instructions * * * with respect to mitigating and aggravating circumstances, so long as there is no reasonable possibility that the jury misunderstands its role in the capital sentencing procedure or misunderstands the meaning and function of mitigating circumstances.\" See Peek v. Kemp, 784 F.2d 1479, 1493-94 (11th Cir.1986); Briley v. Bass, 750 F.2d 1238, 1244-45 (4th Cir.1984). Although the instructions did not directly preclude the jury from considering any mitigating evidence, defendant argues that the jury was effectively so precluded because the instructions did not sufficiently communicate the meaning and purpose of mitigating factors.\n\nThe requirement that capital sentencing must not preclude consideration of relevant mitigating circumstances would be hollow without an explanation of how the evidence can mitigate the imposition of the death penalty. Otherwise, the court would subject the defendant to the risk of an arbitrary and capricious jury determination. Gregg v. Georgia, supra, 428 U.S. at 189, 96 S. Ct. at 2932, 49 L. Ed. 2d at 883. Even before the enactment of the Act, we recognized that \"[a]ppropriate and proper charges are essential for a fair trial\" and that the charges \"should explain to the jury in an understandable fashion its function in relation to the legal issues involved.\" State v. Green, supra, 86 N.J. at 287. In sum, it is the trial court's duty to assure that a reasonable juror will understand the meaning and function of mitigating factors.\n\nA trial court is not bound to any particular language when instructing a jury on mitigating factors, but the court must adequately explain those factors \"in the text and purport of the whole charge.\" Ramseur, supra, 106 N.J. at 292 (quoting State v. Thompson, 59 N.J. 396, 411 (1971)). That requirement may be viewed as a corollary of the principle that \"faithful performance of the court's duty of expounding the law for the jury's guidance and instruction requires a plain and\n\nclear exposition of the issues.\" State v. Green, supra, 86 N.J. at 288. Also consistent with the legislative mandate is the requirement to implement the Act's procedure so as to \"cover every possible contingency for the protection of the defendant.\" Public Hearing, supra, at 1 (statement of Senator John F. Russo, chairman). Consequently, a charge must assure that there is no reasonable possibility that a juror will misunderstand the function of mitigating factors and the meaning of the particular factors on which the defendant relies. Accord Andrews v. Shulsen, 802 F.2d 1256, 1264-65 (10th Cir.1986); Peek v. Kemp, supra, 784 F.2d at 1494; Spivey v. Zant, 661 F.2d 464, 471 (former 5th Cir.1981).\n\nWe turn now to the charge in this case. With respect to the general function of mitigating factors, the trial court should have made clear that the attempt to establish the existence of those factors was not to justify or excuse defendant's conduct, but to present extenuating facts regarding the defendant's life or character or the circumstances surrounding the murder that would justify a sentence less than death. In failing to tell the jury that it could consider all mitigating evidence adduced in either the guilt or sentencing proceedings, the charge failed to meet that test. Similar deficiencies appear in the charge concerning specific mitigating factors. For example, the court merely read the words of the statute when charging the jury on the mitigating factors pertaining to defendant's emotional disturbance at the time of the offense, ยง c(5)(a); intoxication; ยง c(5)(d); age, ยง c(5)(c); and the catchall mitigating factor, ยง c(5)(h). Jurors are untrained in statutory interpretation, State v. Green, supra, 86 N.J. at 288, and instructions that merely repeat verbatim the language of the Act generally are inadequate. Accord People v. Lucky, supra, 221 Cal.Rptr. at 897, 710 P. 2d at 976.\n\nIn fairness to the court, the trial in this case occurred before the date of our opinion in Ramseur, in which we discussed the\n\nadequacy of jury instructions on particular mitigating factors. On remand, the trial court should conform its charge to the requirements of that opinion.\n\n5. Additional Issue Related to Instructions Concerning Mitigating Factors: The Omission of Instructions on the Role of Sympathy in the Jury's Penalty Phase Deliberations\n\nDefendant contends that the trial court erred in refusing to instruct the jury regarding the proper role of sympathy and mercy in its penalty phase deliberations. At the close of the penalty phase, defendant requested that the jury be instructed that mitigating factors are circumstances that warrant \"fairness and mercy\" and \"compassion and sympathetic understanding,\" and that \"[a]ny sympathy or compassion which [the proffered] mitigating circumstances may engender can be taken into consideration by you in coming to your decision as to penalty.\" The charge, however, did not include the requested instructions.\n\nAn instruction not to base a verdict on \"mere sympathy\" focuses jury deliberations on mitigating evidence. See California v. Brown, 479 U.S. 538, 107 S. Ct. 837, 93 L. Ed. 2d 934 (1987) (upholding the constitutionality of instructions \"not [to] be swayed by mere sentiment, conjecture or sympathy\"). In Ramseur, supra, 106 N.J. at 296-99, we found no error in the charge that the jury \"should decide the case * * * without any * * * sympathy.\" Underscoring that result, we emphasized that the jury be instructed, pursuant to section c(5)(h), that it may consider as mitigating evidence any other factor that is relevant \"to defendant's character or record or to the circumstances of the offense. The reference to such other factors as 'mitigating' inevitably suggests that the jury may properly consider whether they engendered feelings of sympathy for the defendant.\" Id. at 296. The instructions, however, may not \"preclude the jury from considering all possible mitigating circumstances and such sympathy as those circumstances might inspire.\" Id. at 297. Instructions aimed at removing emotion\n\nfrom capital sentencing must not mislead the jury into rejecting sympathy engendered by defendant's background, character, or other mitigating circumstances.\n\nHere, the challenged instruction did not preclude the jury from considering sympathy generally. It merely failed to advise the jury that it could properly consider the sympathy and compassion engendered by the mitigating factors it found to exist. This is not error. We believe that a trial court can properly channel a jury's discretion by instructing it that it should not decide a case on sympathy or by omitting any reference to sympathy. If the court communicates the function of mitigating factors and the meaning of particular factors, the failure to explain the proper role of sympathy and mercy should not cause a juror to misunderstand the legitimate use of those feelings.\n\n6. Instructions Concerning Aggravating Factors\n\na. Constitutionality of Aggravating Factor c(4)(g)\n\nDefendant alleges that the Act is unconstitutional because it promotes irrational sentencing by allowing a felony murder committed by one's own act to be treated as either an aggravating factor to a capital murder, N.J.S.A. 2C:11-3c(4)(g), or a lesser degree homicide, N.J.S.A. 2C:11-3a(3), punishable by a term of thirty years to life imprisonment. This contention was rejected, however, in Ramseur, supra, 106 N.J. at 188-89 n. 21, and we are disinclined to change our ruling. The death penalty may not be imposed on a felony murderer unless he kills \"by his own conduct\" or hires another to commit the murder. N.J.S.A. 2C:11-3c. Commission of a felony murder, however, remains an aggravating factor if the defendant committed the murder \"purposely\" or \"knowingly.\" Ibid. Accordingly, we reaffirm the constitutionality of section c(4)(g). 1\n\nb. Sufficiency of Charge on Section c(4)(c)\n\nDefendant also alleges that the jury charge regarding aggravating factor c(4)(c) was unconstitutionally vague. Section c(4)(c) provides that the jury may find as an aggravating factor that \"[t]he murder was outrageously or wantonly vile, horrible or inhuman in that it involves torture, depravity of mind, or an aggravated assault to the victim.\" In Ramseur, we recognized the \"obvious vagueness\" of Section c(4)(c), 106 N.J. at 198, but rendered the factor constitutional by supplying a narrowing construction that adequately guided the jury's discretion. Once again, because the trial occurred before the Ramseur decision, the trial court did not have the benefit of our opinion in that case.\n\nHere, the trial court read the statutory language to the jury, and then interpreted the introductory language as modifying the second part of the provision. The effect of the charge was to instruct the jury that the torture, battery, or depravity must warrant a characterization of being \"wantonly vile, horrible or inhuman.\" In rejecting that interpretation in Ramseur, we found that the introductory language was neither an independent requirement nor a qualitative modification of the second portion of the provision. Id. at 199-200. Presumably all murders will be perceived as \"outrageously or wantonly vile, horrible or inhuman,\" and, therefore, this introductory language could mislead the jury about the essence of this aggravating factor. The distinction between capital and non-capital murder is the defendant's state of mind, not the physical or mental pain actually suffered by the victim. Id. at 207. Consequently, the court should charge this factor without reading the statute. The jury should be instructed that \"[t]orture or aggravated battery to the victim shall be found if the defendant intended to cause, and did in fact cause, severe physical or psychological pain or suffering to the victim prior to the victim's death,\" and that depravity shall be found if the murder \"served no purpose for the defendant beyond his pleasure of killing,\" id. at 211, or if the defendant caused mutilation after death. In Ramseur,\n\nwe set forth sample jury instructions on each of these concepts and explained that, depending on the facts of the particular case, it might be inappropriate to charge on both \"torture and aggravated battery\" and \"depravity.\" Id. at 211, 291-92.\n\nThe charge in this case failed to focus the jury's consideration on defendant's intent and improperly instructed the jury that if the murder could be characterized as \"wantonly vile or horrible or inhuman,\" it should find this factor to exist. On remand, the trial court should frame its charge on section c(4)(c) pursuant to the Ramseur requirements.\n\nc. Double Counting Aggravating Factors\n\nDefendant contends further that the instruction on the penalty phase permitted the jury to double count defendant's rape of Ms. Peniston as an aggravating factor. In sum, the argument is that defendant was convicted of robbery, aggravated sexual assault, and felony murder. Assuming that the conviction for aggravated sexual assault supported the conviction for felony murder, evidence of the sexual assault would count as an aggravating factor under N.J.S.A. 2C:11-3c(4)(g). That same evidence was included, so the argument goes, to support the finding of aggravated assault, torture, or depravity under N.J.S.A.2C:11-3c(4)(c). Thus, the defendant contends that the evidence of the aggravated sexual assault was impermissibly double counted.\n\nThe State denies that it ever contended \"that the sexual assault was sufficient to support a finding that an outrageously or wantonly vile, horrible, or inhuman murder had occurred.\" Rather, the State's theory was that the viciousness of the attack, resulting in numerous internal injuries and an unrecognized battered body, clearly reached the level of an outrageously or wantonly vile, horrible, or inhuman murder. In light of our ruling in Ramseur that the focus in N.J.S.A. 2C:11-3c(4)(c) is on the defendant's state-of-mind, not the victim's suffering, the State's theory was misguided.\n\nBecause we are reversing the death penalty on other grounds, we need not resolve the dispute about double counting the sexual assault. We believe, nonetheless, that it would be helpful in this and in future cases to set forth guidelines where the same evidence supports more than one factor.\n\nThe Act represents an attempt to comply with the constitutional mandate that the discretion of the jury \"be suitably directed and limited so as to minimize the risk of wholly arbitrary and capricious action.\" Gregg v. Georgia, supra, 428 U.S. at 189, 96 S. Ct. at 2932, 49 L. Ed. 2d at 883. That guidance must be provided by objective sentencing standards designed to compel the jury to \"focus on the particularized circumstances of the crime and the defendant.\" Id. at 199, 96 S. Ct. at 2937, 49 L. Ed. 2d at 889.\n\nThe Act enumerates eight distinct aggravating factors, N.J.S.A. 2C:11-3c(4)(a)-(h), and eight distinct mitigating factors, N.J.S.A. 2C:11-3c(5)(a)-(h). Those factors are designed to serve the narrowing function mandated by Gregg and its progeny. The determination whether to impose the death penalty, however, does not follow from the mere counting of the aggravating and mitigating factors to see which is the greater. Instead, the decision whether to impose the death penalty turns on a qualitative analysis of the circumstances of the offense and defendant's character. For the jury to conclude that the defendant is to be executed, it must make the normative judgment that the death penalty is appropriate. Thus, one aggravating factor could outweigh beyond a reasonable doubt numerous mitigating factors. Similarly, a solitary mitigating factor may outweigh all aggravating factors. Still, we recognize that the side with the largest number of factors may have a practical advantage before a sentencing jury. See Wiley v. State, 484 So. 2d 339, 357 (Miss.1986) (Robertson, J., concurring).\n\nThe fact that the same evidence supports two aggravating factors does not necessarily mean that a defendant will be prejudiced merely because the jury finds two factors instead of\n\none. Nonetheless, the jury's focus \"on the particularized circumstances of the crime and the defendant is undercut when the defendant's conduct is artificially inflated by the multiple charging of overlapping special circumstances.\" People v. Harris, 36 Cal. 3d 36, 201 Cal.Rptr. 782, 797-98, 679 P. 2d 433, 448-49 (1984). Accordingly, several jurisdictions have held that it is improper to present to the jury the aggravating factor that murder was committed for pecuniary gain when the aggravating factor that the murder occurred during the course of a robbery also is presented. Both factors refer to the same aspect of the defendant's crime. See, e.g., Cook v. State, 369 So. 2d 1251, 1256 (Ala.1979); Provence v. State, 337 So. 2d 783, 786 (Fla.1976); State v. Rust, 197 Neb. 528, 250 N.W. 2d 867, 874 (1977); see also People v. Harris, supra, 201 Cal.Rptr. at 800-01, 679 P. 2d at 451-52 (permitting the prosecution to charge both aggravating factors, but requiring court to instruct jury to consider the factors as one for purposes of determining appropriateness of death penalty). But see Engberg v. State, 686 P. 2d 541 (Wyo.1984) (finding no double counting because murder for pecuniary gain relates to defendant's motive while murder during a robbery refers to the character of defendant's act).\n\nWe believe the appropriate resolution is to allow the prosecution to use the same evidence in seeking to prove multiple aggravating factors, provided the trial court advises the jury that it should not simply compare the number of aggravating factors against the number of mitigating factors, that it is considering the same facts more than once, and that it should be cognizant that the same facts are being used to prove more than one aggravating factor. This result permits the jury to consider the evidence relevant to each aggravating factor, and should prevent it from giving undue weight to the number of factors when one aspect of the defendant's conduct supports multiple aggravating factors.\n\nJustice Handler disagrees with that resolution and repeats his argument, originally set forth in his dissent in Ramseur, supra, 106 N.J. at 384-94, that aggravating factors \"do double duty; they are used simultaneously to narrow the class of capital murders and to guide the sentencer's discretion.\" Post at 217. We rejected that argument in Ramseur, supra, 106 N.J. at 186-88 and n. 20, finding that N.J.S.A. 2C:11-3a(1)-(2) and N.J.S.A. 2C:11-3c define the class of death eligible defendants as those who have caused death purposely or knowingly by their own hand, or who have paid someone else to do so. The class of offenders subjected to the death penalty, as distinguished from those who are eligible for it, is limited to those as to whom the jury has found that \"the aggravating factor (or factors) outweigh any mitigating factor or factors beyond a reasonable doubt.\" Ramseur, supra, 106 N.J. at 123 n. 20.\n\n7. Instructions Concerning Possible Jury Verdicts\n\nDefendant asserts that the trial court erred in refusing to instruct the jury that the failure to reach a unanimous verdict would result in at least thirty years' imprisonment without parole. According to defendant, that error violated his right to a fair penalty trial and created a substantial risk that the death sentence would be imposed in an arbitrary and capricious manner. The trial court's instructions to the jury regarding the possible verdicts that it could return omitted any reference to a non-unanimous verdict:\n\nUnless each aggravating factor proved is outweighed by the mitigating factor or factors, the sentence will be death. If each aggravating factor is outweighed by the mitigating factor or factors, the sentence will be life imprisonment with a parole ineligibility term of thirty years.\n\nSince this is a criminal case your verdict must be unanimous, all twelve jurors deliberating must agree as to the existence or non-existence of particular\n\naggravating or mitigating factors. And you must all agree as to whether the mitigating factors outweigh the aggravating factors.\n\nSimilarly, the special verdict form instructed the jury:\n\nIf you have checked one or more aggravating factor \"yes\" and one or more mitigating factor \"yes,\" then state as to each aggravating factor checked \"yes\" whether it is or is not outweighed by any one or more of the mitigating factors checked \"yes.' This decision also must be unanimous. If an aggravating factor is found and not outweighed by a mitigating factor or factors, the penalty will be death. [Emphasis added.]\n\nAt the time of the trial, N.J.S.A. 2C:11-3c(3) provided:\n\n(a) If the jury or the court finds that any aggravating factor exists and is not outweighed by one or more mitigating factors, the court shall sentence the defendant to death.\n\n(b) If the jury or the court finds that no aggravating factors exist, or that any aggravating factors which exist are outweighed by one or more mitigating factors, the court shall sentence the defendant pursuant to subsection b.\n\n(c) If the jury is unable to reach a unanimous verdict, the court shall sentence the defendant pursuant to subsection b.\n\nConstruing these provisions in Ramseur, we found it \"clear that the Legislature contemplated three possible final verdicts in a capital case: a unanimous verdict that results in imprisonment, a unanimous verdict that results in death, and a non-unanimous verdict that results in imprisonment.\" 106 N.J. at 301. We therefore found it reversible error for a trial court to fail to advise the sentencing jury of all three options.\n\nThe trial court in Ramseur initially advised the jurors that if they were unable to agree on their findings and verdict, they should so report to the court. In such an event, the court would \"either require further deliberations with additional instructions or I will accept your inability to reach a verdict in which case the penalty shall not be death.\" Id. at 303. When, after deliberating for about four hours, the jury reported its inability to return a unanimous decision, however, the court did not inform the jury that a non-unanimous verdict leading to a life sentence was an acceptable outcome of its deliberations. Rather, the trial court's supplemental charge stressed the \"importance of reaching a unanimous verdict.\" Id. at 306.\n\nTo prevent the arbitrary and capricious imposition of the death penalty, we ruled that a jury must be informed of its sentencing options:\n\nTo hide from the jury the full range of its sentencing options, thus permitting its decision to be based on uninformed and possibly inaccurate speculation [about what the outcome would be in the event there was not unanimity] is to mock the goals of rationality and consistency required by modern day death penalty jurisprudence. [Id. at 311.]\n\nOur decision in Ramseur also was guided by a 1985 amendment to the Act, N.J.S.A. 2C:11-3f, which requires that:\n\nPrior to the jury's sentencing deliberations, the trial court shall inform the jury of the sentences which may be imposed pursuant to subsection b. of this section on the defendant if the defendant is not sentenced to death. The jury shall also be informed that a failure to reach a unanimous verdict shall result in sentencing by the court pursuant to subsection b.\n\nThus, we required that \"juries in capital cases be informed of, and free to exercise, their statutory option to return a final, non-unanimous verdict resulting in imprisonment if, after a reasonable period of deliberations, they are unable to agree.\" Ramseur, supra, 106 N.J. at 312.\n\nHere, the State argues that it was harmless error for the trial court to refuse to inform the jury that the failure to reach a unanimous verdict would result in a sentence of imprisonment. The State reasons that the possibility that the jury might be unable to reach a unanimous verdict could arise only if the jury first found both aggravating and mitigating factors and then disagreed about the balance of those factors. Because the jury found no mitigating factors existed, the State argues that the jury was not obliged to balance the factors. As a result, so the State argues, the possibility of a non-unanimous verdict regarding the outcome of the weighing process never arose. We disagree. The fallacy in the State's argument is that it ignores the defects in the charge arising from the failure both to inform the jury that it need not be unanimous in finding the existence of any mitigating factor and to charge adequately the meaning of particular mitigating factors.\n\nWe find it to be insignificant that the error in Ramseur occurred in the supplemental charge, while the error in the\n\npresent case occurred in the original charge. Indeed, the flaw in the Ramseur charge may be viewed as less serious because the trial court there instructed the jury at the outset of its deliberations that the failure to agree would be an acceptable verdict. In contrast, the jury in the present case never received this instruction. To prevent unacceptable speculation about the consequences of a non-unanimous verdict, the court must inform the jury of its option of returning a final, non-unanimous, verdict that would result in a minimum of thirty years of imprisonment without parole. In addition to that instruction, the special verdict forms provided to the jury should include as a possible verdict the inability of the jury to reach a unanimous decision.\n\nThe factual distinction between Ramseur and this case, however, may affect the issue of remedy. First, an error \"which impact[s] substantially and directly on fundamental procedural safeguards, and particularly upon the sensitive process of jury deliberations,\" cannot be considered harmless error. State v. Czachor, 82 N.J. 392 (1980). We noted in Ramseur that the \"usual and proper remedy for such errors is reversal of the death sentence and a retrial of the sentencing proceeding in which the defendant may again face the death penalty.\" 106 N.J. at 313. In Ramseur, however, the court's failure to inform the jury of its sentencing options occurred after the jury had deliberated for four hours and \"clearly demonstrated an inability or unwillingness to bring in an uncoerced unanimous verdict for the death sentence.\" Ibid. The supplemental charge deprived the defendant of \"not merely the theoretical possibility but a substantial likelihood that, absent the error, the jury would have reached a verdict resulting in imprisonment rather than death.\" Id. at 314. Thus, we held, as a matter of fundamental fairness, that on remand the trial court should sentence the defendant as if the jury had reached a final non-unanimous verdict.\n\nIn the instant case, however, the jury never indicated \"a substantial likelihood that, absent the error, [it] would have\n\nreached a verdict resulting in imprisonment rather than death.\" The jury returned a unanimous verdict within fifty-three minutes without ever suggesting the possibility of deadlock. Thus, we do not regard it as \"intolerably unfair\" to require the defendant to undergo a second capital sentencing proceeding. Id.\n\n8. Improper Charge on Balancing Aggravating and Mitigating Factors\n\nThe trial court charged the jury that \"if the mitigating factors do not outweigh the aggravating factors, the sentence will be death.\" This was an improper charge on the balancing of aggravating and mitigating factors. In Biegenwald, supra, 106 N.J. at 63-67, we held that as a matter of fundamental fairness, the death penalty may not be imposed unless the jury finds that \"the aggravating factors outweigh the mitigating factors beyond a reasonable doubt.\" The failure to instruct the jury as to this standard mandates reversal and retrial of the death penalty decision. Ibid. A 1985 amendment to the Act intended to \"clarify\" the previous law explicitly requires this balancing standard. As we stated in Biegenwald, it would be \"both unjust, and probably outside the Legislature's intent, not to give those previously tried the benefit of provisions intended to have been in the law in the first place.\" Id. at 66-67. In another case, if no juror finds that any mitigating factor exists, the failure to give a proper weighing instruction could constitute harmless error. We need not, however, reach that issue in this case because the finding of no mitigating factors was tainted by the deficient instructions pertaining to those factors.\n\n9. Additional Errors in the Penalty Phase\n\na. Admission of Photographs to Prove Aggravating Factor c(4)(c)\n\nDefendant contends that the trial court erred in not suppressing certain photographs depicting the victim's body, which were\n\nintroduced by the prosecution, during the penalty phase to establish aggravating factor c(4)(c). The photographs and slides show the entire body of the victim, including her face, which was discolored and graphically described by the State's pathologist as maggot infested. According to the defendant, the inflammatory nature of these pictures far exceeded their probative worth. In response, the prosecution contended that the pictures were the \"best way\" for the State \"to show an aggravated battery and/or torture which arises from depravity of mind.\" The trial court agreed and ruled that these pictures were admissible to prove aggravating factor c(4)(c).\n\nIt is well settled that \"the admissibility of photographs of the victim of a crime rests in the discretion of the trial court, and the exercise of its discretion will not be reversed in the absence of palpable abuse.\" State v. Thompson, 59 N.J. 396, 420 (1971); see also Evid.R. 4 (\"the judge may in his discretion exclude evidence if he finds that its probative value is substantially outweighed by the risk that its admission will * * * create a substantial danger of undue prejudice or of confusing the issues or misleading the jury\"). Palpable abuse exists only where the \"logical relevance will unquestionably be overwhelmed by the inherently prejudicial nature of the particular picture.\" State v. Smith, 32 N.J. 501, 525 (1960), cert. denied, 364 U.S. 936, 81 S. Ct. 383, 5 L. Ed. 2d 367 (1961).\n\nIn the instant case, of course, the pictures were required to be \"logically relevant\" to the issue of whether the murder committed by defendant was \"outrageously or wantonly vile, horrible or inhuman in that it involved torture, depravity of mind, or an aggravated assault to the victim.\" N.J.S.A. 2C:11-3c(4)(c). Other jurisdictions that have considered the admissibility of photographic evidence pursuant to variations of section c(4)(c) have held them admissible to prove that an offense was \"vile,\" Justus v. Commonwealth, 220 Va. 971, 266 S.E. 2d 87, 93 (1980), or \"especially heinous,\" Smith v. State, 419 So. 2d 563, 567 (Miss.1982), cert. denied, 460 U.S. 1047, 103 S. Ct. 1449, 75 L. Ed. 2d 803 (1983).\n\nUnder the reformulation of section c(4)(c) set forth in Ramseur, however, photographs would not be admissible to prove that a murder was \"outrageously or wantonly vile, horrible or inhuman.\" 106 N.J. at 197. Rather, evidence of the section c(4)(c) factor must relate to the intent of the defendant or pain of the victim. Specifically, to prove that the defendant intended to torture the victim or commit an aggravated battery on her, the prosecutor must show that the defendant \"intended to cause, and did in fact cause, severe physical or psychological pain or suffering to the victim prior to the victim's death\"; and to prove that defendant acted with a depraved mind, the prosecutor must prove that the murder \"served no purpose for the defendant beyond his pleasure of killing.\" Id. at 211.\n\nIn light of our reversal of the sentence on other grounds, we need not determine whether the trial court abused its discretion in admitting the photographs. Nonetheless, we caution the court to evaluate any photographic evidence in light of the interpretation of the section c(4)(c) factor announced in Ramseur. Photographs may be admissible on torture and aggravated battery as proof of intent to inflict severe pain or on depravity to show mutilation after death. Pictures of gruesome details unrelated to the defendant's state of mind, however, should be excluded.\n\nb. Defendant's Right to Make the Initial Opening Statement and Final Summation\n\nDefendant argues that fundamental fairness demands that the defendant should make the initial opening statement and the final summation during the penalty phase of a capital trial. This argument is predicated on the false premise, implicit in the trial court's instructions, that the defendant bore the burden of proof to demonstrate that the mitigating factors outweighed the aggravating factors. Because it bears the burden at the penalty trial to prove beyond a reasonable doubt that the aggravating factors outweigh the mitigating factors,\n\nthe State has the right to open and close. Ramseur, supra, 106 N.J. at 318 n. 81.\n\nWe affirm defendant's murder conviction, but reverse the imposition of the death penalty and remand the matter for a new trial on sentencing.\n\nCLIFFORD, J., dissenting.\n\nI record here my agreement with what Justice Handler says on the peremptory-challenge issue, in Part I B of his dissent, see post at 198-205. Because defendant did not exhaust his peremptory challenges, this case differs from State v. Singletary, 80 N.J. 55 (1979). But as most persuasively explained by Justice Handler, post at 200-205, that feature does not render harmless the error created by the forced exercise of a peremptory challenge in the non-struck-jury, death-qualification context.\n\nBeyond that, because the record reveals with unmistakable clarity the deprivation of defendant's right to remain silent under the fifth amendment and state-law privilege against self-incrimination, I dissent from the Court's judgment upholding the conviction of capital murder. In that respect I am in substantial agreement with Part II of Justice Handler's opinion in which he so persuasively establishes that faithful adherence to Miranda v. Arizona, 384 U.S. 436, 86 S. Ct. 1602, 16 L. Ed. 2d 694 (1966), and Michigan v. Mosley, 423 U.S. 96, 96 S. Ct. 321, 46 L. Ed. 2d 313 (1975), at the federal level, and to this Court's decisions in State v. Kennedy, 97 N.J. 278 (1984), and State v. Hartley, 103 N.J. 252 (1986), leaves no room for any conclusion other than that defendant's confession was unconstitutionally compelled. I would ask, as the Court asks, ante at 143, \"whether the error is harmless beyond a reasonable doubt.\" For me the answer is an unequivocal \"no.\"\n\nTo Justice Handler's convincing exegesis I would add only the following. The issue on which I focus is whether defendant invoked his right to remain silent. If, no matter how ambiguously,\n\nhe did request that the questioning cease, then that request must be scrupulously honored, Hartley, supra, 103 N.J. at 263, and police-initiated custodial interrogation cannot resume until the Miranda warnings have been reissued. The Court states its conclusion as \"reach[ing] no further than finding under the circumstances that defendant's statement [that he wanted to lie down and think about what happened] did not constitute an invocation of his right to remain silent.\" Ante at 142. That precise finding is at the heart of the Court's decision on the confession issue. And it is with that precise finding that I precisely disagree.\n\nThe custodial interrogation started at 5:38 p.m. It was interrupted at 7:15 p.m., resumed at 7:35, and continued until 8:20. Defendant then remained silent. What happened immediately thereafter was sharply disputed below, but the trial court made a specific finding of fact (of which more below) based on the police version of the events:\n\n[A]t 8:30 p.m. the defendant requested permission to lay down and to think about what happened. He was placed in a cell. At about 9:30 p.m. the police returned to the cell and the defendant was again asked if he wanted to contact anyone, and he replied in the negative.\n\nPause here for a moment -- a long-paragraph moment. The majority suggests that I \"misread [ ] the record,\" ante at 142, when I characterize this unembellished, unadorned, flat-out statement of the trial court as a finding of fact that leads to but one conclusion: defendant invoked his right to silence. No, says the Court, it is only a \"comment,\" ante at 141 -- one to which we should pay little attention and from which we should not draw the obvious (indeed, in my view, as will be developed below, the only possible) conclusion because the trial court did not realize the significance of that finding, did not fully appreciate the conclusion of law that would follow from it, and did not intend it as the \"resolution of a materially disputed issue.\" Ante at 141. But a finding is a finding is a finding. And how could a fact issue be more \"materially disputed\"? The police said one thing, defendant said another. The court made a specific finding that the police version represented the truth. To suggest that that is not a finding of fact is, in the Court's way of expressing it, to \"misread\" the trial court's statement and to close one's eyes to the record. To suggest that it is simply an idle comment, one thoughtlessly dropped into the record, one not worthy of being invested with reliability because the trial court was blind to its potential critical significance, smacks of a cynicism that is out of place in our jurisprudence (would there have been a different finding of fact had the court given just a little more thought to where this one would lead?). And to suggest that we should close our eyes to that specific finding because defendant did not at trial rely on it as support for the proposition he urges on appeal is to ignore the place of the \"plain error\" Rule in capital-murder cases. See State v. Ramseur, 106 N.J. 123, 260 (1987) (in capital case, Court considered sua sponte whether there was plain error in voir dire of juror); State v. Biegenwald, 106 N.J. 13, 62 (1987) (\"In no proceeding is it more imperative to be assured that the outcome is fair than in [capital] cases\"); id. at 53 (\"While defendant did not raise the issue either at trial or on appeal, we find that the trial court's instructions in the sentencing proceeding constituted plain error of a nature to warrant our consideration sua sponte \"); State v. Mount, 30 N.J. 195, 213 (1959) (\"where a life is at stake, this court does not hesitate in the interests of justice to invoke the plain error rule and to reverse where the trial errors were impregnated with the likelihood of having harmed the substantial rights of the defendant.\" (citation omitted)). It is unthinkable that this Court, in any criminal appeal, never mind a capital murder case, would treat a specific finding of fact as anything less than or different from what it is simply because a defendant did not use that finding the right way in arguing legal points to the trial court. But that is what the Court has done. It is unthinkable that this court would say that because a defendant urged a finding of fact different from the one made by the trial court, defendant therefore could not rely on the court's finding to support a legal argument on\n\nappeal. But again, that is what the Court has done. And it is, in a word, unthinkable that this Court would let a capital-murder appeal deteriorate into some sort of high-stakes \"Gotcha\" game. See Ross v. Oklahoma, U.S. , , 108 S. Ct. 2273, 2280, 101 L. Ed. 2d 80 (1988) (Marshall, J., dissenting: \"A life is at stake. We should not be playing games.\"). And it pains me to observe that that is what the Court will very likely be perceived as having done.\n\nBut let us return to the detective bureau. The interrogation resumed, after defendant was given the opportunity to lie down and collect his thoughts, at 10:05 p.m. without, as everyone agrees, the readministering of the Miranda warnings. If defendant's request, quoted above in the trial court's fact-finding, amounts to a request that the police stop their questioning, then -- again as everyone agrees -- the circumstances would trigger the Hartley principle requiring new Miranda warnings, in the absence of which defendant's confession was inadmissible.\n\nHere is the way the majority interprets the request \"to lay down and to think about what happened\":\n\nDefendant merely communicated his desire to spend some time thinking about the events that were the subject of the interrogation. [ Ante at 138.]\n\nReasonable enough, as long as you keep in mind, as apparently the Court does not, see ante at 138, the obvious distinction between, on the one hand, \"spend[ing] some time thinking about the events that were the subject of the interrogation,\" and, on the other, a momentary interruption for purposes of relieving oneself, getting a drink or a bite to eat, standing and stretching, or otherwise relaxing before continuing. Here defendant spent an hour in a cell before the police brought him back to the detective bureau for further interrogation. The question is: how, in the midst of a custodial interrogation, does one lie down and think for an hour about the subject of the interrogation without the interrogation stopping? The Court says that \"[i]mplicit in the [trial court's] findings is the conclusion that defendant had not sought the cessation of questioning'! Ante at 139 (emphasis added). Only the most profound\n\nrespect for my colleagues mutes my expression of exasperation with the stated \"implicit\" conclusion, as well as with the Court's equally extravagant declaration, ante at 141, that no reasonable police officer could have construed defendant's request as an assertion of his right to remain silent. In fact, there is no other way to construe it.\n\nMy reading of this record yields but one conclusion: defendant invoked his right to silence by asking, in mid-interrogation, that he be permitted to lie down and think about what he was being asked. I see nothing ambiguous about the request. It can mean nothing other than that he wanted the questioning to stop. He was entitled to his Miranda warnings before the police resumed their pursuit of a confession. He did not get them. Therefore, his confession was inadmissible.\n\nI would reverse the conviction and remand for a new trial.\n\nHANDLER, J., dissenting.\n\nThe Court today continues the attempt, begun in State v. Ramseur, 106 N.J. 123 (1987), and State v. Biegenwald, 106 N.J. 13 (1987), to narrow by construction the reach of N.J.S.A. 2C:11-3 in order to make the application of the statute constitutional. For this attempt the Court is to be commended. I continue to believe, however, that the statute as drafted is invalid under our State Constitution, and that the Court's construction of the statute has thus far failed to assure the reliability and consistency necessary to prevent the arbitrary infliction of the death penalty.\n\nIn State v. Ramseur, I took the position that N.J.S.A. 2C:11-3 should be held to violate this State's proscription of cruel and unusual punishments and its requirement of due process. I expressed the belief, contrary to the legislature's assumption, that the federal Supreme Court precedent provides only a minimum level of protection of individual rights; indeed, the variety of statutory structures and the degrees of arbitrariness approved by the Supreme Court, and the Court's vacillations\n\nin recent years, have convinced me that capital punishment is a topic suited to the broader protections of individual rights afforded under our State Constitution. See Ramseur, supra, 106 N.J. at 345-69 (Handler, J., dissenting). This did not require, in my view, a holding that the death penalty is per se unconstitutional; rather, I contended that the statute is capable of such broad and variable application that it should have been invalidated without reaching the question of whether any death penalty statute, however narrowly drafted, would be unconstitutional. Id. at 382-406 (Handler, J., dissenting).\n\nThe statute begins with a definition of capital murder that, by itself, does not even require that a capital defendant have intended to kill, id. at 387-390, cf. id. at 194 (majority acknowledges that federal court's decision in Enmund v. Florida, 458 U.S. 782, 102 S. Ct. 3368, 73 L. Ed. 2d 1140 (1982), may require intent to kill for capital murder). The basic or primary definition does not include any major element or factor that plausibly makes a murder a capital offense. The constitutionally required narrowing of the class of capital murderers is thus committed to the definition of the aggravating factors, which are considered not when the jury is deciding whether the defendant is culpable but when the jury is deciding whether the defendant should be executed. Moreover, these aggravating factors are, as the majority conceded, themselves so broad as to include most, if not all, murders. Ramseur, supra, 106 N.J. at 390-94 (Handler, J., dissenting); cf. id. at 188-89 (acknowledging breadth of aggravating factors). Given the absence of any meaningful or effective narrowing through the guilt or penalty phases, the discretion afforded prosecutors by such a scheme is virtually limitless; a prosecutor can choose to prosecute as capital murder almost any killing done by one's \"own conduct\" by serving a notice of aggravating factors, thus rendering the defendant death-eligible and enabling the prosecutor to try him before a death-qualified, demonstrably punitive, jury. The results of the exercise of such prosecutorial discretion, I asserted, can only be arbitrary. Id. at 404-08\n\n(Handler, J., dissenting). The likelihood, moreover, of conducting an effective proportionality review, when the varieties of murder comprehended by the statute are so great, seemed to me remote. Id. I reiterate those objections today. The statute both as enacted and as construed fails to assure the enhanced reliability this Court should require under the State Constitution.\n\nI therefore dissent from the Court's opinion in this case for the reasons expressed in my opinions in State v. Ramseur, 106 N.J. at 343, and State v. Biegenwald, 106 N.J. at 72, relating to the constitutionality of the death penalty statute. I also disagree with the Court's opinion on several additional grounds. I am of the view that defendant was not tried by a fair and impartial jury. These trial deficits inhere in the death qualification of the jury and in the improper application of death qualifying standards in accepting a juror for service and the failure to excuse that juror for cause. I am also of the view that the defendant's confession was elicited in violation of his fifth amendment and state privilege against self incrimination by refusing to honor his right to remain silent, which he invoked in the course of custodial interrogation. In addition, I dissent from the views of the Court with respect to the application in this case of the potentially overlapping aggravating factors of c(4)(c) and c(4)(g).\n\nIn my opinion these errors constituted grounds for reversal under either the conventional standards for reversibility used by the majority, or under the enhanced standard of review for capital causes discussed in the companion case of State v. Bey (I), 112 N.J. 45, 106-19 (1988) (Handler, J., dissenting). It is the majority's failure to engage in the scrupulous review of the record, the aspect of an enhanced standard of review that was followed by this Court in State v. Bey (I), supra, 112 N.J. at 91-95, that I believe has contributed to its decision to uphold the conviction despite errors that call for its reversal.\n\nI.\n\nA.\n\nDefendant challenges the use of a death-qualified jury during the guilt phase of his bifurcated trial. The majority, without discussion, summarily rejects this contention, ante at 149-50, relying on this Court's opinion in State v. Ramseur, supra, 106 N.J. at 248-54. This Court, in Ramseur, without extended reasoning, chose to follow the decision in Lockhart v. McCree, 476 U.S. 162, 106 S. Ct. 1758, 90 L. Ed. 2d 137 (1986), where the Supreme Court ruled that it was not unconstitutional to determine a defendant's guilt by a death-qualified jury. Ramseur, supra, 106 N.J. at 248-54.\n\nI continue to disagree with this position. Id. at 428-35 (Handler, J., dissenting). I noted in my opinion that there was authoritative support in ongoing social science research to suggest that individuals who favor the imposition of the death penalty are generally more punitive than those who disfavor the death penalty. Id. at 431 (Handler, J., dissenting), (citing Wilson, \"Belief in Capital Punishment and Jury Performance\" (unpublished, University of Texas 1964); Jurow, \"New Data on the Effects of a 'Death-Qualified' Jury on the Guilt Determination Process,\" 84 Harv.L.Rev. 657 (1971); Fitzgerald and Ellsworth, \"Due Process vs. Crime Control: Death-Qualification and Jury Attitudes,\" 8 Law Hum.Behav. 31 (1984)). I underscored the observation that jurors generally favoring the death penalty are \"less likely to consider mercy, more likely to favor harsh punishment as a means of reducing crime, and more likely to believe in the strict enforcement of all laws, no matter what the consequences,\" 106 N.J. at 431 (Handler, J., dissenting) (quoting Fitzgerald and Ellsworth, supra, 8 Law Hum.Behav. at 43-44). The literature appearing since McCree reaffirms this conclusion. See Seltzer, Lopes, Dayan, and Canan, \"The Effect of Death Qualification on the Propensity of Jurors to Convict: The Maryland Example,\" 29 How.L.J. 571 (1986).\n\nIn addition to selecting for service jurors whose attitudes are more punitive than death-scrupled jurors' attitudes, the process of death qualification itself engenders partiality among the jurors. The process makes paramount the issue of the imposition of the death penalty itself, thus suggesting that the guilt of the defendant is a foregone conclusion. See Haney, \"On the Selection of Capital Juries: The Biasing Effects of the Death Qualification Process,\" 8 Law Hum.Behav. 121 (1984). One cannot read the transcript of a death-qualifying voir dire proceeding without a sense of impending doom. See State v. Ramseur, 106 N.J. 331, 341 (O'Hern, J., concurring) (quoting Hovey v. Superior Court of Alameda County, 28 Cal. 3d 1, 70-71, 168 Cal.Rptr. 128, 175, 616 P. 2d 1301, 1348 (1980)).\n\nThe Ramseur majority eschewed dealing critically with the problems created by using a death-qualified jury. It simply acquiesced in the determination of the United States SupremeCourt, observing only that \"the protections regarding death qualification afforded under the New Jersey Constitution are no different from or greater than those under the federal Constitution.\" Ramseur, supra, 106 N.J. at 251. This uncritical acceptance of the Supreme Court's lead on this fundamental issue is baffling for several reasons.\n\nFirst, it fails woefully to appreciate just how restrictive and minimal are the protections of the federal Constitution. In Buchanan v. Kentucky, 483 U.S. , 107 S. Ct. 2906, 97 L. Ed. 2d 336 (1987), for instance, petitioner challenged the death-qualification of his jury when the death penalty was sought as to only his co-defendant (the capital portion of petitioner's indictment was dismissed on the basis of Enmund v. Florida, supra, 458 U.S. 782, 102 S. Ct. 3368, 73 L. Ed. 2d 1140, because the petitioner had not killed or intended to kill). 483 U.S. at , 107 S. Ct. at 2910, 97 L. Ed. 2d at 346. Thus, the question of the conviction-proneness of death-qualified juries was squarely posed, for the petitioner was subject only to conviction for non-capital murder, and not to a possible death sentence.\n\nThe Court rejected petitioner's claims, holding that \"[t]he decision in McCree controls the instant case.\" Id. at , 107 S. Ct. at 2913, 97 L. Ed. 2d at 350. The Court addressed the issue of the conviction-proneness of death-qualified juries by noting that \"just as it was assumed in McCree that the studies were 'both methodologically valid and adequate to establish that \"death qualification\" in fact produces juries somewhat more \"conviction-prone\" than \"non-death-qualified\" juries'. . . we make a similar assumption here.\" Id. at n. 16, 107 S. Ct. at 2913 n. 16, 97 L. Ed. 2d at 350 n. 16. Despite this increase in conviction-proneness with death qualification, and despite the fact that petitioner was not charged with a capital offense, the Court upheld the use of the procedure on the basis of McCree, id. at , 107 S. Ct. at 2913-14, 97 L. Ed. 2d at 350-51. The Court stated:\n\nPetitioner's primary error is his characterization of the issue presented here as affecting his trial, as opposed to the actual trial, in this case -- the joint trial of petitioner and Stanford. . . . [T]he Commonwealth has determined that it has an interest in providing prosecutors with the authority to proceed in a joint trial when the conduct of more than one criminal defendant arises out of the same events. [ Id. at , 107 S. Ct. at 2915, 97 L. Ed. 2d at 352.]\n\nGiven the State interest in joint trials, and the constitutional presupposition \"that a jury selected from a fair cross section of the community is impartial, regardless of the mix of individual viewpoints actually represented on the jury, so long as the jurors can conscientiously and properly carry out their sworn duty to apply the law to the facts of the particular case,\" id. at , 107 S. Ct. at 2916, 97 L. Ed. 2d at 354 (quoting Lockhart v. McCree, supra, 476 U.S. at 184, 106 S. Ct. at 1770, 90 L. Ed. 2d at 155), the Court found no constitutional violation in death-qualifying the jury of the non-capital petitioner.\n\nBuchanan illustrates just how permissive the federal -- and, regrettably, after Ramseur, the State -- constitutional standard is. This decision implicates Justice O'Hern's concern that \"[t]he real question for us is not what the State can do, but rather what we should do in the just exercise of our common law supervisory power over criminal practice within our jurisdiction.\"\n\nRamseur, supra, 106 N.J. at 333-34 (O'Hern, J., concurring). It also glaringly illustrates the vast differences between the minimal protection afforded under the federal Constitution and the greater protections that the State Constitution should provide.\n\nIn addition to failing to recognize how low is the ceiling of federal constitutional protection, the Ramseur majority's acceptance of juries that are \"somewhat more conviction-prone\" departs radically from this Court's decisions safeguarding the integrity of the right to an impartial jury. While no one insists that procedure can be made perfect, in no other context has this Court accepted the proposition that mere prosecutorial convenience -- or any state interest -- justifies procedures that render the jury \"somewhat more 'conviction-prone.'\" McCree, supra, 476 U.S. at 173, 106 S. Ct. at 1764, 90 L. Ed. 2d at 147. In State v. Simon, 79 N.J. 191 (1979), this Court rejected the submission of special interrogatories to a jury in a criminal conspiracy case prior to the jury's deliberation of a general verdict precisely because of the interrogatories' \"potential for destroying the ability of the jury to deliberate upon the issue of guilt or innocence free of extraneous influences.\" Id. at 199 (emphasis added). The Court continued, noting that, \"[t]his potential for harm inheres in the subtly coercive effect interrogatories can have upon the course of a jury's deliberations. They can constitute a form of mental conditioning which is antithetical to the untrammeled functioning of a jury.\" Id. at 199-200 (emphasis added). This Court required no conclusive showing that the interrogatories rendered the jury \"somewhat more conviction-prone;\" indeed, the Court's decision in the event of such a showing would have been unanimous. Id. at 208 (Pashman, J., dissenting). Rather, it was the interrogatories' \"unique capacity to proselytize the jury to the guilt of a defendant\" before the jury deliberated that issue, id. at 200, that led this Court, based on \"our own standards applicable to the administration of justice,\" to reverse. Id. at 203. No considerations involving prosecutorial convenience or judicial economy could outweigh\n\nthe perceived harm in tolerating a procedure that could bias the jury.\n\nNor is State v. Simon an aberration; this Court has been steadfast in disapproving practices that risk predisposing the jury to consider a defendant guilty. In Ramseur itself, this Court followed its earlier decision in State v. Czachor, 82 N.J. 392 (1980), in reversing defendant's death sentence because of the trial court's issuance of coercive jury instructions. In doing so, the Court reaffirmed its rejection of the argument that conservation of \"time and resources\" justifies the issuance of forceful instructions designed to produce a unanimous verdict. 106 N.J. at 308 (citing State v. Czachor, supra, 82 N.J. at 403). The Court quoted, moreover, the Czachor majority's conclusion that the prejudice resulting from coercive instructions need not be \"readily measured by the empirical or objective assessment of the evidence bearing upon defendant's guilt.\" 106 N.J. at 312 (quoting State v. Czachor, supra, 82 N.J. at 404 (citations omitted)). Thus, in Czachor the Court rejected the identical state interest advanced to support death qualification.\n\nIn State v. Collier, 90 N.J. 117, 124 (1982), moreover, this Court (per Pollock, J.), held that a partial directed verdict of guilt on a charge of contributing to the delinquency of a minor required reversal of the conviction on the other, more serious charge of rape because \"the partial directed verdict on the contributing charge impaired the jury's ability to assess objectively the defendant's guilt on the rape charge.\" Because, in other words, the partial directed verdict rendered the jury \"somewhat more conviction-prone,\" this Court saw fit to reverse. See State v. Ingenito, 87 N.J. 204, 216-17 (1981) (prohibiting the use of collateral estoppel against a criminal defendant because, \"by removing significant facts from the deliberative process,\" it constitutes \"a strong, perhaps irresistible, gravitational pull towards a guilty verdict, which is utterly inconsistent with the requirements that a jury remain free . . . in its deliberations\"); see also State v. Corsaro, 107 N.J. 339, 352-53 (1987) (prohibiting substitution of a juror after partial verdicts had\n\nbeen returned because the fact-finding underlying those partial verdicts would have predisposed the substituted juror toward guilt on the open charges); State v. Ragland, 105 N.J. 189, 195-96 (1986) (reversing conviction for possession of a weapon by a convicted felon because the charge had the effect of directing the verdict); State v. Ingram, 98 N.J. 489, 500 (1985) (while State may rely on statutory presumption that defendant's failure to adduce gun permit entails the failure to procure one, the jury must be instructed that it is \"at liberty to find the ultimate fact one way or the other\"). This Court has historically insisted, moreover, that \"[i]t is vital in capital cases that the jury should pass upon the case free from external causes tending to disturb the exercise of deliberate and unbiased judgment.\" State v. Kociolek, 20 N.J. 92, 105 (1955) (quoting Mattox v. United States, 146 U.S. 140, 149, 13 S. Ct. 50, 53, 36 L. Ed. 917, 921 (1892)). See State v. Jackson, 43 N.J. 148, 158 (1964), cert. denied sub nom. Ravenell v. New Jersey, 379 U.S. 982, 85 S. Ct. 690, 13 L. Ed. 2d 572 (1965); State v. Mount, 30 N.J. 195, 212-13 (1959). It is difficult to imagine an \"external cause\" that would tend more to \"disturb the deliberate and impartial judgment\" of the jury than death qualification, which both selects a more punitive jury and conditions that jury to believe that a defendant is guilty.\n\nThe balance this Court strikes under our Constitution between a defendant's entitlement to an impartial jury and the state's prosecutorial convenience has not been in other contexts, and should not be in the context of the death penalty, controlled by the low ceiling of federal protection. To allow it to be so controlled is to render our own jurisprudence incoherent, for while in cases such as Simon even the risk of \"mental conditioning\" toward guilt was sufficient to override procedural convenience, under federal doctrine a demonstrated propensity toward conviction-proneness does not affect the balance in favor of convenience in the slightest. We did not insist, in Simon, on empirical proof that the special interrogatories rendered the jury conviction-prone; that they could was a matter\n\nof common sense, and the risk that they had was sufficient. Similarly, the studies demonstrating conviction-proneness in death-qualified juries may not prove conviction-proneness scientifically, but they do ratify the common sense notion that I am more likely to believe an accused guilty if I am asked if I would be willing to vote to execute him before I am asked to consider the evidence of his guilt. The studies are consistent, moreover, with the intuition that those who would be willing to vote to impose the death penalty are more likely to believe, for instance, that \"[p]eople accused of crimes should be required to prove their innocence\" or that \"[t]he courts are too lenient with criminals these days.\" Seltzer, et al., supra, 29 How.L.J. at 605. In short, these death qualification studies identify a substantial risk; under our jurisprudence, that risk should be enough to compel the State to develop alternatives. What the majority has endorsed, in contrast, is either an incoherent view of jury impartiality, or, ironically, a different standard of review for capital cases, in which death is considered different, but perversely so, entitled to fewer safeguards.\n\nFinally, the only reason advanced to justify this procedure is the state's interest in a single-jury bifurcated trial; it is simpler and easier to try a defendant for capital murder on a bifurcated basis before the same jury. This was the state's interest relied on by the Supreme Court in McCree, based on Arkansas' legislative policy mandating unitary capital juries and thus, by implication, was the same interest relied on by this Court in Ramseur. What the Ramseur majority failed to recognize, however, is that this State's interest simply is not as strong as Arkansas' interest was in McCree; in contrast to Arkansas' death penalty statute, which mandated this procedure, see Ark. Stat.Ann. ยง 41-1303(3), our death penalty statute makes a unitary jury discretionary. See N.J.S.A. 2C:11-3c(1). If nothing else, this attenuated State policy, considered in light of this State's jurisprudence and the social science evidence, should mandate the development of State alternatives that will vindicate both the State's interest in economical prosecution and the\n\ndefendant's right to a jury that has not been informed before deliberating a defendant's guilt of a crime that they may have to consider executing him for it. The literature emerging since McCree has challenged the notion that alternatives to death qualification are unworkable. See, e.g., Robert M. Derry, \"Remedies to the Dilemma of Death-Qualified Juries,\" 8 U.Ark. Little Rock L.J. 479 (1986); Comment, \"Inequities and Abuses of Death Qualification: Causes and Cures,\" 32 S.D.L.Rev. 281 (1987). I continue, in short, to agree with Justice O'Hern's concurring opinion in State v. Ramseur, supra, 106 N.J. at 339-43, that the inconvenience entailed in providing for a non-death-qualified jury -- one that is fair and impartial -- in the trial of guilt is not too high a price to pay to vindicate constitutional interests.\n\nB.\n\nDefendant challenges, under the sixth and fourteenth amendments to the United States Constitution, Article I, ยง 10 of the New Jersey Constitution, and this Court's supervisory powers, the trial court's refusal to excuse for cause juror Kurlowicz. Kurlowicz, defendant claims, was \"unable to assure the court that he could consider all proposed mitigating factors and impartially decide the issue of guilt or punishment;\" as a result of the trial court's refusal to excuse Kurlowicz, defendant argues, he was forced to exercise a peremptory challenge and was denied his right to an impartial jury. The Court now rules that this juror should have been excused for cause but that no reversible error ensued because defendant had not exhausted his peremptory challenges. Ante at 154. I dissent from this determination.\n\nAs recounted by the majority, ante at 152-54, Kurlowicz initially denied both that he opposed capital punishment in all situations and that he favored it for every person convicted of murder. He acknowledged his belief that capital punishment is \"justified in certain cases,\" but denied that his feelings about\n\nthe death penalty would influence his deliberation as to guilt. However, the defense's questioning elicited answers that indicated Kurlowicz's strong inclination in favor of capital punishment. While Kurlowicz also indicated that he would consider factors in mitigation of the punishment, and that he could return a sentence less than death, Kurlowicz reverted to the position that he would \"find it very difficult to vote against\" the death penalty where the murder was \"cold-blooded.\" The trial court refused to excuse Kurlowicz for cause apparently because the juror indicated that his decision would not be \"automatic\" \"one way or the other.\" As a result the defendant was forced to exercise a peremptory challenge to exclude Kurlowicz. Ante at 153-54.\n\nIn Witherspoon v. Illinois, 391 U.S. 510, 88 S. Ct. 1770, 20 L. Ed. 2d 776 (1968), the Supreme Court held unconstitutional a system of capital jury selection that excluded those \"who expressed conscientious or religious scruples against capital punishment and all those who opposed it in principle.\" Id. at 520, 88 S. Ct. at 1776, 20 L. Ed. 2d at 784. The Court added that potential jurors could be challenged for cause if \"they would automatically vote against the imposition of capital punishment without regard to any evidence that might be developed at the trial.\" Id. at 522 n. 21, 88 S. Ct. at 1777 n. 21, 20 L. Ed. 2d at 785 n. 21 (emphasis in original).\n\nSubsequent Supreme Court cases modified substantially those principles as applied to opponents of capital punishment. Adams v. Texas, 448 U.S. 38, 100 S. Ct. 2521, 65 L. Ed. 2d 581 (1980); Wainwright v. Witt, 469 U.S. 412, 105 S. Ct. 844, 83 L. Ed. 2d 841 (1985). In State v. Ramseur, 106 N.J. at 255-57, this Court adopted the standard for death-qualification as clarified and modified in Adams v. Texas and Wainwright v. Witt. The new standard is that \"a juror may . . . be challenged for cause based on his views about capital punishment [if] those views would prevent or substantially impair the performance of his duties as a juror in accordance with his instructions and his oath.\" Adams, supra, 448 U.S. at 45, 100 S. Ct. at 2526, 65\n\nL. Ed. 2d at 581; see Witt, supra, 469 U.S. at 420-22, 105 S. Ct. at 850-51, 83 L. Ed. 2d at 849-53.\n\nThe majority now adopts the Adams-Witt modification of Witherspoon as applied to proponents of capital punishment. Ante at 152; see Ross v. Oklahoma, U.S. , 108 S. Ct. 2273, 101 L. Ed. 2d 80 (1988). I agree with this determination. I agree further with the Court that in this case the juror's view that he would find it \"almost impossible\" to return a verdict less than death in the event of a murder accompanied by rape suggests sufficiently that his capacity to credit the evidence in mitigation would be \"substantially impaired,\" and that he should have been excused for cause. Ante at 154.\n\nI disagree, however, with the Court's ruling that \"the error was harmless.\" Id. at 154. In my view, \"'the denial of the right of peremptory challenge is the denial of a substantial right.'\" State v. Singletary, 80 N.J. 55, 62 (1979) (quoting Wright v. Bernstein, 23 N.J. 284, 295 (1957)). In State v. Singletary, the Court held that the trial court's decision not to exclude the juror in question was not erroneous, and thus did not reach the contention that the error was harmless. Thus, the Singletary majority established no analytical framework for disposing of this issue.\n\nTwo members of this Court, joined by Chief Justice Hughes, dissented, however, from the Singletary majority's conclusion that the trial court's refusal to excuse the juror for cause was not error; accordingly, both members reached the question that the majority found unnecessary to reach, namely, whether the trial court's error was harmless. Justice Clifford offered this analysis:\n\n[The answer to the question of whether the error was harmless] lies, I think . . . in the importance one attaches to the attainment of a fair and impartial jury and to the process available to achieve that end. I tend to view that process . . . as considerably more than a procedural formality. The right to be tried by a fair and impartial jury is a \"fundamental\" one to be \"jealously guarded,\" Wright v. Bernstein, 23 N.J. 284, 295 (1957). Our rules are carefully, albeit imperfectly, designed to assure the empaneling of a jury that to the greatest extent possible will reach its verdict on the evidence with absolute fairness and complete\n\nimpartiality. Hence in a criminal case such as this one defendant is afforded twenty opportunities to excuse any venireman peremptorily -- for a good reason, a bad reason, or no reason at all. . . . Any diminution of or infringement upon that legislatively granted opportunity deprives defendant of as fair a trial as our rules permit. Defendant's argument here, with which I agree, is that his . . . entitlement to relief springs from the legislative grant of twenty peremptory challenges and his right thereto, which he was denied. [Id. at 71 (Clifford, J., dissenting) (emphasis added).]\n\nSee also id. at 79-81 (Handler, J., dissenting). While the exhaustion of peremptory challenges is without doubt indicative of prejudice, it simply does not follow, as the majority assumes, that the failure to exhaust peremptory challenges automatically precludes a claim of prejudice. Indeed, given the nature of the peremptory challenge as described by Justice Clifford, the issue of whether the erroneous refusal to excuse a juror is harmless cannot depend exclusively on whether a defendant has exhausted his peremptory challenges. There are two reasons for this. First, every time a peremptory challenge is \"wasted\" on a juror who should have been excused for cause, the calculus is altered with respect to the rest of the panel and the defendant's right to his full complement of challenges is abridged. As the Supreme Court of Missouri has explained, in an analogous context, \"'Purity of the right to be tried by an impartial jury is so zealously guarded that an accused may covet his peremptory challenges and \"spend\" them as he alone sees fit. . . . [I]f an accused is not presented with a full panel of jurors objectively demonstrated as qualified before he exercises his peremptory challenges, his given number of peremptory challenges is proportionately reduced and his right to \"spend\" them as he alone sees fit is accordingly impinged.'\" State v. Morrison, 557 S.W. 2d 445, 446 (Mo.1977) (quoting State v. Thompson, 541 S.W. 2d 16, 17 (Mo.App.1976)); State v. Brown, 496 So. 2d 261, 265-66 (La.1986) (loss of peremptory is denial of right); accord State v. Ealy, 624 S.W. 2d 490, 492-93 (Mo.App.1981).\n\nThe Missouri Court's analysis, it should be noted, speaks to a context in which a \"struck jury\" system is mandated, and therefore in which peremptory challenges can be exercised with\n\nsome idea of the overall jury composition.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e The force of the Missouri Court's logic is redoubled where, as in this case, peremptory challenges are exercised with no sense of the overall jury composition. Because, in this case, the peremptory challenges had to be exercised by the defendant and the State immediately after the potential juror was qualified for cause by the trial judge, the defendant was forced to use his peremptories without being able to compare that potential juror to all the other potential jurors who were qualified for cause. Each exercise of a peremptory thus carried the danger that a potential juror who would be qualified for cause later during the voir dire could not be removed by a peremptory because of an earlier use of the peremptory challenges. Further, the defendant could not intelligently weigh each potential juror against others, making the exercise of a peremptory challenge a more significant decision than in a struck jury system. In sum, the defendant in a non-struck jury system must treat each use of a peremptory as potentially his last peremptory. Hence, the fact that the defendant did not use all of his peremptory challenges is of no import.\n\nIn the context of this case, Justice Clifford's analysis, in my view, controls this issue: \"[a]ny diminution of or infringement upon that legislatively granted opportunity [to exercise a full complement of peremptory challenges] deprives defendant of as fair a trial as our rules permit.\" State v. Singletary, supra, 80 N.J. at 71. This conclusion is unshaken by the United States Supreme Court's recent retrenchment in Ross v. Oklahoma, supra. In Ross, the Court held that the trial court's erroneous failure to excuse for cause a juror biased in favor of the death penalty was harmless error, despite the fact that the defense exhausted its allotment of peremptory challenges and had to use one of them to excuse the juror in question. Ross is readily distinguishable on its own terms, however, for in reaching its result the Court noted that \"it is for the State to determine the number of peremptory challenges allowed and to define their purpose and the manner of their exercise,\" and emphasized that \"although Oklahoma provides a capital defendant with nine peremptory challenges, this grant is qualified by the requirement that the defendant must use those challenges to cure erroneous refusals by the trial court to excuse jurors for cause.\" U.S. at , 108 S. Ct. at 2279. The law of New Jersey is far more protective than that of Oklahoma in this respect and is, if anything, consistent with the case law holding that \"denial or impairment of the right is reversible error without a showing of prejudice.\" Swain v. Alabama, 380 U.S. 202, 219, 85 S. Ct. 824, 835, 13 L. Ed. 2d 759, 772 (1965). See State v. Singletary, supra, 80 N.J. at 82 (Handler, J., dissenting) (\"the denial to defendant of the full range of choice accorded by the allowance of the right to challenge jurors peremptorily constituted reversible error\"); State v. Pereira, 202 N.J. Super. 434, 438 (App.Div.1985) (citing State v. Hammond, 107 N.J. Super. 588, 589-90 (App.Div.1969)). The application of Ross to this case becomes even more questionable because Ross represents a dramatic retrenchment from the view taken by the Court just a year ago in Gray v. Mississippi, 481 U.S. , 107 S. Ct. 2045, 95 L. Ed. 2d 622 (1987). It is thus highly problematic that it should be followed as a matter of state constitutional law. In Gray a majority of the Court rejected as \"unpersuasive\" the argument that the erroneous exclusion for cause of a death-scrupled juror was harmless because the State retained a peremptory challenge it could have used to excuse the juror. As the Court stated (correctly, in my view) in Gray, \"the relevant inquiry is 'whether the composition of the jury panel as a whole could possibly have been affected by the . . . error.'\" Id. at , 107 S. Ct. 2055, 95 L. Ed. 2d at\n\n637 (quoting Moore v. Estelle, 670 F.2d 56, 58 (5th Cir.) (concurring opinion), cert. denied, 458 U.S. 1111, 102 S. Ct. 3495, 73 L. Ed. 2d 1375 (1982)). The Ross Court's contrary position, focusing exclusively on the actual composition/impartiality of a given jury, simply ignores the due process-related argument that \"everyone concedes that the trial judge could not arbitrarily take away one of the defendant's peremptory challenges. Yet, that is in effect what happened here.\" Ross v. Oklahoma, supra, U.S. at , 108 S. Ct. at 2280 (Marshall, J., dissenting, joined by Brennan, Blackmun, and Stevens, JJ.). The question of whether peremptories were exhausted, or in what order they were used, is therefore irrelevant; as Justice Marshall points out, the question is not whether \"a defendant has the right to any particular venire or panel,\" but whether a defendant's \"right to a jury selection procedure untainted by constitutional error\" has been vindicated. Id. (Marshall, J., dissenting); see State v. Singletary, supra, 80 N.J. at 71 (Clifford, J., dissenting).\n\nThe second reason that the defendant's failure to exhaust peremptory challenges should not preclude a claim of prejudice is that the error in this case took place in the context of death qualification. Death qualification prior to the guilt phase necessarily reduces a defendant's complement of peremptories by requiring defense counsel to assess a prospective juror's possible bias as to punishment in addition to the usual assessment as to possible bias as to guilt. Compounding this impingement of defendant's \"substantial right,\" moreover, is the fact that the death qualification process itself induces bias as to guilt by requiring potential jurors to presuppose it. See discussion supra at 191-92. Thus, even the defense counsel's normal calculation of when to \"spend\" a peremptory challenge for possible bias as to guilt is skewed by a process that induces bias as to guilt in seeking to discover bias as to penalty.\n\nIn assessing whether the court's refusal to excuse a juror for cause is harmless, a defendant's failure to exhaust his peremptory challenges is a relevant consideration in the ordinary case.\n\nI insist that given the singularly important function of peremptory challenges such an error could be reversible even in the ordinary case. Moreover, the principle that \"death is different\" thus requiring an enhanced standard of review with a stricter standard for reversibility, combined with the distorting effects of death qualification, leads me to conclude that an erroneous refusal to excuse a prospective juror for cause on death qualification grounds should be reversible regardless of whether a defendant ultimately exhausts his peremptory challenges.\n\nII.\n\nDefendant claims that the trial court erred in not suppressing defendant's oral and written confessions obtained on the night of his arrest. The Court rejects defendant's claim, in particular, that the oral and written confessions were obtained improperly after defendant's assertion of his right to cut off questioning. Ante at 140-42.\n\nA.\n\nThe facts are important and are recited in the Court's opinion. Ante at 131-33. Defendant's custodial interrogation commenced at 5:38 p.m. Questioning was interrupted at 7:15 p.m. and resumed at 7:35 p.m., continuing until 8:20 p.m. At that point defendant remained silent for approximately five minutes. At 8:30 p.m., as the trial court found, defendant asked to lie down so that he could think about what had happened. Defendant was placed in a cell for an hour, then brought back to the interrogation room. It is undisputed that defendant was not reissued his Miranda rights at this time; nevertheless, interrogation resumed. Shortly thereafter, starting at 10:05 p.m., defendant began to incriminate himself. At 10:55 p.m. the police commenced to take a typed statement from defendant concerning his involvement. Only then was defendant reissued his Miranda warnings. Defendant checked \"yes\" on the form waiving his Miranda rights. The statement was completed at\n\n11:52; defendant read and initialed every page and signed the last page.\n\nDefendant contends that, following his actual silence for about five minutes, his request, at 8:30 p.m., to lie down and think about what had happened was an invocation of his right to cut off questioning, and that by bringing him back for interrogation without readministering his Miranda warnings the police failed to \"scrupulously honor\" that assertion, in violation of Michigan v. Mosley, 423 U.S. 96, 103-04, 96 S. Ct. 321, 326, 46 L. Ed. 2d 313, 321 (1975), and State v. Hartley, 103 N.J. 252 (1986). His subsequent confessions, therefore, defendant argues, should have been suppressed.\n\nIn Miranda v. Arizona, 384 U.S. 436, 86 S. Ct. 1602, 16 L. Ed. 2d 694 (1966), the Supreme Court held that, because of the inherently coercive nature of custodial interrogation, a suspect must be apprised of his rights to remain silent and to have an attorney present. Because custodial interrogation is presumptively coercive, any statements given in the absence of explicit warnings were held inadmissible; conversely, silence after the issuance of explicit warnings was held to require an end to interrogation:\n\nOnce warnings have been given, the procedure is clear. If the individual indicates in any manner, at any time prior to or during questioning, that he wishes to remain silent, the interrogation must cease. . . . [A] statement taken after the person invokes his privilege cannot be other than the product of compulsion, subtle or otherwise. [384 U.S. at 473-74, 86 S. Ct. at 1627-28, 16 L. Ed. 2d at 723.]\n\nMiranda left open the question of \"under what circumstances, if any, the authorities may resume interrogation\" when the right to silence is asserted. State v. Hartley, supra, 103 N.J. at 263. Under Michigan v. Mosley, supra, \"the admissibility of statements obtained after the person in custody has decided to remain silent depends . . . on whether his 'right to cut off questioning' was 'scrupulously honored.'\" 423 U.S. at 102-04, 96 S. Ct. at 325-26, 46 L. Ed. 2d at 320-21. The meaning and scope of the \"scrupulously honor\" requirement was explored by this Court in State v. Hartley, supra, 103 N.J. 252. We held\n\nthat \"[i]n the absence of . . . renewed warnings any inculpatory statement given in response to police-initiated custodial interrogation after the right to silence has been invoked is inadmissible.\" Id. at 256.\n\nThe dispositive question, then, in light of Mosley and Hartley, is whether defendant's request to lie down and think about what happened was an invocation of his right to cut off questioning under Miranda. If it was, then the failure of the interrogating police officer to renew the warnings an hour later brings this case within the proscriptions of Hartley.\n\nThe Miranda Court was quite explicit that the defendant's request to cut off questioning does not have to be an overt, clear or obvious assertion of his rights; the Court stated that \"[o]nce warnings have been given . . . [i]f the individual indicates in any manner. . . that he wishes to remain silent, the interrogation must cease.\" 384 U.S. at 473-74, 86 S. Ct. at 1627, 16 L. Ed. 2d at 723 (emphasis added). Substantial case law illustrates the range of behavior that is sufficient to alert the authorities that a right to cut off questioning has been invoked. In People v. Randall, 1 Cal. 3d 948, 955, 464 P. 2d 114, 118, 83 Cal.Rptr. 658, 662 (1970), the California Supreme Court stated that \"[t]o strictly limit the manner in which a suspect may assert the privilege, or to demand that it be invoked with unmistakable clarity . . . would subvert Miranda's prophylactic intent.\" Accordingly, that Court has held that\n\nAny words or conduct which \"reasonably appears inconsistent with a present willingness on the part of the suspect to discuss his case freely and completely with police . . .\" [citation omitted] must be held to amount to an invocation of his Fifth Amendment privilege. [ People v. Burton, 6 Cal. 3d 375, 382, 491 P. 2d 793, 797, 99 Cal.Rptr. 1, 5 (1971).]\n\nSee also United States v. Hernandez, 574 F.2d 1362, 1368 (5th Cir.1978) (refusal to cooperate with attempts to elicit statements held an invocation of rights); United States v. Clayton, 407 F. Supp. 204, 205-06 n. 1 (E.D.Wisc.1976) (failure to answer question following issuance of Miranda warnings held an invocation of rights); People v. Nicholas, 112 Cal.App. 3d 249, 267-68,\n\n169 Cal.Rptr. 497, 506-07 (1980) (requests to turn off tape recorder and for assurances of privacy held an invocation of rights); People v. Williams, 93 Cal.App. 3d 40, 60-63, 155 Cal.Rptr. 414, 425-27 (1979) (defendant's statement that he was confused and didn't know what to do or say held an invocation of right to cut off questioning); Law v. State, 21 Md.App. 13, 34, 318 A.2d 859, 872-73 (1974) (hospital statements that \"I will tell you what happened\" but \"I want to get treated\" and didn't want to talk any more held an invocation of rights); State v. Rissler, 165 W.Va. 640, 648, 270 S.E. 2d 778, 783-84 (1980) (statement that \"if I give you a statement now I won't have no shot\" held an invocation of rights).\n\nIn Phillips v. State, 701 S.W. 2d 875 (Tex.Cr.App.1985), cert. denied, 477 U.S. 909, 106 S. Ct. 3285, 91 L. Ed. 2d 574 (1986), the Texas Court of Criminal Appeals, faced with a factual setting arguably similar to that of this case, analyzed the issue as follows:\n\nThe first question we must address is whether appellant \"in any manner\" invoked his right to remain silent. When appellant was first asked whether he wanted to discuss the offense, he stated that he \" wanted a little time \" to think about the matter. Prior to this statement, appellant had been given his Miranda warnings on three separate occasions. We conclude that this request was an invocation of appellant's right to remain silent at that time. [ Id. at 891.]\n\nThe Court cites not a single case to the contrary. Its position is that the request to \"lie down and think about it\" was not an invocation of the right to silence. The Court indicates that \"the trial court did not specifically address that issue. . . .\" Ante at 139. Rather, it stresses that defendant did not, until this appeal, press this issue and that the trial court was not asked to focus its decision on this issue. Ante at 139-42. To the extent that the majority's conclusion rests on the defendant's failure to pursue the issue below, Justice Clifford argues persuasively that \"[i]t is unthinkable that this Court would say that because a defendant urged a finding of fact different from the one made by the trial court, defendant therefore could not rely on the court's findings to support a legal argument on appeal.\" Ante at 186-87 (Clifford, J., dissenting). It is worth\n\nnoting, moreover, that in State v. Bey (I) defendant similarly failed to argue below that his indication to police that \"he did not want to talk\" (\"I wasn't saying nothing\") about the Alston murder was an invocation of his right to cut off questioning; that fact has not deterred this Court from vindicating defendant's right in Bey (I), and it should not bear on this Court's decision in this case. Nevertheless, the Court is somehow able five years later to view this record and determine that \"beyond peradventure . . . this defendant did not intend to cut off questioning and remain silent.\" Ante at 140. I do not see how.\n\nThe Court acknowledges that defendant testified that \"I wasn't saying nothing,\" but argues that this language means that defendant denies having asked to lie down. The Court fails utterly to consider that defendant's expression may simply have been ambiguous; it need not have been either a request to remain silent or a request to continue. I fail to share the Court's dogmatic conclusion that no \"reasonable police officer\" could have construed the request as one to remain silent. Ante at 141.\n\nThe point is, however, that even if defendant's expression could be understood as no more than a desire for some time to get his story straight before he continued talking to the police, it was a sufficient indication of a desire that questioning cease and thus sufficient to invoke his right to cut off questioning. Phillips v. State, supra, 701 S.W. 2d at 891; Law v. State, supra, 318 A.2d at 872-73. As this Court noted in State v. Bey (I), 112 N.J. 45, 64-65, \"[t]he overwhelming majority of courts have agreed that \"any declaration of a desire to terminate the contact or inquiry. . . should suffice\"' to invoke the right to cut off questioning. (Quoting W. LaFave \u0026 J. Israel, Criminal Procedure ยง 6.9(e) at 310 (1985) (emphasis added)).\n\nTaking the court's finding of fact at face value -- that \"at 8:30 p.m. the defendant requested permission to lay down and to\n\nthink about what happened\" -- I believe that the case law compels the conclusion that defendant had invoked his right to cut off questioning. I think it is clear that, for whatever reason, the defendant wished the questioning to cease at that time; that was his constitutional right, and it implicated the police's constitutional duty to scrupulously honor that right.\n\nEven if the defendant's expression is viewed as \"ambiguous,\" it must be considered an assertion of rights. State v. Hartley, supra, 103 N.J. at 263, citing State v. Kennedy, 97 N.J. 278, 288 (1984). Permissible police conduct in such circumstances is limited to asking \"questions designed to clarify whether a suspect intended to invoke his right to remain silent.\" Christopher v. State of Fla., 824 F.2d 836, 842 (11th Cir.1987) petition for cert. filed October 29, 1987 (citations omitted). As this Court noted in State v. Wright, 97 N.J. 113, 120 n. 4 (1984):\n\n[W]here a suspect makes a statement which arguably amounts to an assertion of his Miranda rights and the interrogating agent recognizes that the statement is susceptible of that construction, his questioning with regard to the crime he is investigating should immediately cease and he should then inquire of the suspect as to the correct interpretation of the statement. Only if the suspect makes clear that he is not invoking his Miranda rights should substantive questioning be resumed.\n\nId. at 120 n. 4 (quoting United States v. Riggs, 537 F.2d 1219, 1222 (4th Cir.1976), quoted in State v. Fussell, 174 N.J. Super. 14, 21 (1980)) (emphasis added).\n\nThe trial court's additional findings dictate the conclusion that defendant's right to remain silent was not scrupulously honored. The court found that \"at about 9:30 p.m. the police returned to the cell and the defendant was again asked if he wanted to contact anyone, and he replied in the negative.\" No questions designed to clarify defendant's intent were asked; no fresh set of Miranda warnings was issued. Interrogation resumed, and defendant incriminated himself before Miranda warnings were readministered.\n\nThe trial court concluded that \"this defendant was advised of his Miranda warnings prior to giving the statement . . . he understood his Miranda warnings. . . . he signed the Miranda\n\ncard voluntarily and . . . he voluntarily waived . . . his rights under Miranda.\" These findings, however, simply do not address the unassailable fact that the Miranda warnings were not readministered before the interrogation was resumed and defendant began to incriminate himself.\n\nThe majority purports to examine the companion case, State v. Bey (I), supra, 112 N.J. 45, involving the same suppression hearing relating to the murder of Cheryl Alston, ante at 141, and to find that his expression in this case \"stands in sharp contrast to his later refusal to discuss the murder of Cheryl Alston.\" Id. I find the contrast difficult to see. In Bey (I), defendant testified that when the police resumed interrogation after his initial confession, \"I wasn't saying nothing. I was just sitting there crying or whatever I was doing. They was asking me questions. I wasn't saying nothing.' State v. Bey (I), supra, 112 N.J. at 61 (emphasis in original). The police officers recounted that they interpreted defendant's behavior as an indication that \"he did not want to discuss it.\" Ante at 139-41 (emphasis added). The Court holds that this behavior manifested an invocation of the right to cut off questioning, regardless of defendant's failure to raise this theory below. Ante at 143-45. By \"contrast,\" in this case, defendant was asked whether he \"requested to go lay down and think about what happened,\" and answered, \"Right. I wasn't saying nothing, and the question was asked me, and I said yeah. I was taken to cell, but the question was asked me. I did go lay down. But the question was asked me.\" Ante at 139 (emphasis added.) The trial court did not credit this testimony, but rather believed the officers who testified that \"[the defendant] asked if he would be able to think about it and lay down. . . .\" The Court now adopts the trial court's finding that defendant requested to lie down and think about it, but points to the fact that defendant did not press this issue below and holds that the record \"supports beyond peradventure the conclusion that this defendant did not intend to cut off questioning and remain silent.\" Ante at 140.\n\nA close comparison of the circumstances of the two confessions reveals, however, that they are more alike than different. In both instances, defendant's testimony communicated his hostility to the questioning, and in identical language (\"I wasn't saying nothing\"). In Bey (I), defendant \"did not want to discuss it,\" while in this case \"he asked if he would be able to lay down and think about it;\" in both instances the officers interpreted defendant's behavior as manifesting a desire not to be interrogated. In other words, the purport of defendant's testimony in both contexts was that the police were asking him questions, and that he \"wasn't saying nothing;\" in both instances, the police understood the defendant's posture to be a resistance to further questioning at that time. In neither case did defendant state below in so many words that his behavior constituted an invocation of his right to cut off questioning. The principal difference, therefore, is that in this case the court below made a specific fact finding crediting the police's testimony that \"[a]t 8:30 p.m. defendant requested permission to lay down and to think about what happened. . . . At about 9:30 p.m. the police returned to the cell and the defendant was again asked if he wanted to contact anyone, and he replied in the negative.\" Are we really to believe that a different result would have obtained in Bey (I) if, instead of indicating \"that he did not want to discuss it\" in so many words, defendant had communicated that sentiment by asking to lie down and think about it?\n\nRead together, the Court's results exalt form over substance and require defendants, in the inherently coercive atmosphere of interrogation, to draw distinctions of law and language the validity of which troubles even those intimately familiar with the case law. See W. LaFave \u0026 J. Israel, Crim.Proc., ยง 6.9(e). Did Marko Bey mean something different when he attempted to stop the questioning at 8:30 p.m. from when he said he did not want to talk at 12:20 a.m.? I doubt that he saw a difference; I know that I do not.\n\nUnder the bright-line rule of State v. Hartley, supra, 103 N.J. 252, the failure of the police to readminister the Miranda warnings is fatal. \"[A]ny statement that a suspect may make after his right to silence has not been scrupulously honored,\" the Court held, \"is unconstitutionally compelled as a matter of law. . . .\" Id. at 256.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Thus, this case is within the contemplation of Hartley 's command that authorities \"cease interrogation of a suspect on his request and . . . not resume until a new set of warnings has been given, to impress upon the accused that his right to remain silent is still in effect and that he need not speak unless it be by his own choice.\" Id. at 287. Cf. Phillips v. State, supra, 701 S.W. 2d at 891 (rights held scrupulously honored where, after affording defendant \"a little time to think about the matter,\" the investigator reissued the Miranda warnings and reminded defendant of his right to remain silent).\n\nThe Court finds it unnecessary to deal with the contention that Hartley should not be given retroactive effect. To the extent that Hartley was based on federal law, Griffith v. Kentucky, 479 U.S. 314, 107 S. Ct. 708, 93 L. Ed. 2d 649 (1987) commands that it be applied retroactively to all cases pending on appeal when it was decided. See State v. Stever, 107 N.J. 543, 548-53, cert. denied U.S. , 108 S. Ct. 348, 98 L. Ed. 2d 373 (1987). Moreover, Hartley is not a clear break with the past, but a simple extension of the principle of cases such as State v. Kennedy, supra, 97 N.J. at 288, holding that the State must honor \"a defendant's request -- however ambiguous -- to terminate interrogation.\"\n\nI am constrained, in short, to conclude that defendant's request to have the interrogation stop constituted an invocation of the right to silence, and the subsequent failure of the interrogating police officer to readminister the Miranda warnings violated defendant's right to remain silent under the fifth amendment and state-law privilege against self-incrimination under the standards of State v. Hartley, supra. I have expressed, in prior cases, my concern that our criminal procedure jurisprudence may become hyper-technical by constitutionalizing the intricacies of essentially prophylactic rules. See State v. Novembrino, 105 N.J. 95, 159 (1987) (Handler, J., concurring) (arguing that the exclusionary rule should not be read into the state constitution); State v. Hartley, supra, 103 N.J. at 288 (Handler, J., concurring and dissenting in part) (explaining that the police's failure to reissue Miranda warnings after invocation of right to silence should not automatically preclude the issue of whether defendant waived his right). I am convinced, however, that my conclusion in this case that defendant's confession should be suppressed follows from a faithful reading of the case law. I believe strongly, moreover, that, as I stated in State v. Biegenwald, supra, 106 N.J. at 106-07, our established principles should not be abdicated, and the rules embodying those principles should not be finessed, in the one context where all agree they should apply most rigorously, namely, where a defendant's life is at stake. I do not need to rely upon an enhanced standard of review with its stricter standard for reversibility in the context of this issue, but would note that the principle that guides this standard's applicability to capital appeals strongly support reversal of this issue. I would therefore reverse defendant's conviction, which was based upon his unconstitutionally compelled confession.\n\nIII.\n\nThere remains another important issue. Defendant objected to the trial court's instruction during the penalty phase of the trial that permitted the jury to redouble aggravating factors.\n\nDefendant argues that the trial court failed to instruct the jury that factor c(4)(c), involving the elements of aggravated assault, torture or depravity, could not be based on the evidence supporting factor c(4)(g), involving the commission of a felony murder, because the same evidence or conduct, i.e., the sexual assault of the victim, supports both factors. Such a redoubling of aggravating factors by using the same evidence twice, defendant argues, corrupts the balancing process by making a murder appear more \"aggravated\" than it was. The Court rejects this argument.\n\nIn my opinion, where a capital punishment system is structured like New Jersey's, overlapping aggravating factors that use the same underlying evidence twice distort the balancing process. The trial court's failure in this case to inform the jury that evidence of sexual assault could be considered and used to determine only a single aggravating factor, either c(4)(c) or c(4)(g), and could not be considered in connection with both factors, resulted in a redoubling of statutory aggravating circumstances, and constitutes reversible error.\n\nNew Jersey employs in its death penalty scheme one of the broadest definitions of capital murder in the nation. This broad definition of murder, which appeared in the Georgia capital-murder statute, was held constitutional in Gregg v. Georgia, 428 U.S. 153, 96 S. Ct. 2909, 49 L. Ed. 2d 859 (1976), only because of the narrowing effect of aggravating circumstances. By the application of aggravating factors, the class of capital murderers was effectively restricted before sentencing. In Georgia, \"the finding of an aggravating circumstance does not play any role in guiding the sentencing body in the exercise of its discretion. . . .\" Zant v. Stephens, 462 U.S. 862, 874, 103 S. Ct. 2733, 2741, 77 L. Ed. 2d 235, 248 (1983).\n\nIn New Jersey, however, the statutory aggravating circumstances function not only to narrow the class of capital murders, but also to guide the jury in its determination of whether the death penalty should be imposed. Moreover, these functions\n\noccur simultaneously. The aggravating factors under New Jersey's scheme narrow the definition of capital murder only in conjunction with -- and not until -- the ultimate determination of the death penalty itself. There is no separate submission of aggravating factors at the guilt stage of the trial by which the determination of death-eligibility of the defendant is made. Hence, strictly but realistically viewed, the determination of the death penalty is undertaken prematurely, that is, before death-eligibility has been properly ascertained. I continue to stress that this clearly should be held unconstitutional under our State Constitution. See State v. Ramseur, 106 N.J. at 384-94 (Handler, J., dissenting).\n\nTo appreciate this constitutional vice it is helpful to place the New Jersey statute in context. As noted, the New Jersey statute, like Georgia's, uses the broad definition of murder as \"knowing or purposeful\" homicide and the language of the statutory aggravating factors in New Jersey's statute are modeled explicitly on Georgia's. Compare, N.J.S.A. 2C:11-3 with Ga.Code Ann. ยง 17-10-31 (1981). Because, in Georgia, aggravating factors operate only to restrict the definition of capital murder and narrow the class of death-eligible offenses, and not to guide the sentencer's discretion, the Supreme Court held that the invalidation of one aggravating factor would not invalidate a death sentence where other aggravating factors were found. Zant v. Stephens, supra, 462 U.S. 862, 103 S. Ct. 2733, 77 L. Ed. 2d 235.\n\nAs noted, in New Jersey, aggravating factors are also used as a guide in sentencing determinations. In this aspect New Jersey's statute resembles not Georgia's but Florida's death penalty scheme. In Florida the definition of capital murder or the class of death-eligible homicides is itself statutorily narrowed by traditional division into degrees, leaving consideration of aggravating and mitigating circumstances only to guide the sentence-recommending discretion of the jury. See Proffitt v. Florida, 428 U.S. 242, 96 S. Ct. 2960, 49 L. Ed. 2d 913 (1976).\n\nWhile the respective Georgia and Florida approaches has each been upheld by the Supreme Court, see respectively, Gregg v. Georgia, supra and Proffitt v. Florida, supra, New Jersey's death penalty statute is a hybrid of these. Unlike Georgia, where consideration of statutory aggravating circumstances serves the sole function of narrowing the class of death-eligible offenses, in New Jersey aggravating circumstances serve the dual functions of determining death-eligibility and the death sentence. Unlike Florida, where aggravating factors are used only to guide sentencing discretion, in New Jersey they serve also to determine whether the defendant is death-eligible. Hence, aggravating factors under the New Jersey statute do double duty; they are used simultaneously to narrow the class of capital murders and to guide the sentencer's discretion. In my opinion, Georgia's method of defining the class of capital murders cannot be combined with Florida's method for guiding sentencing discretion.\n\nUnder Georgia's scheme, overlapping or doubling of aggravating factors was not believed to create real problems because the aggravating factors serve only to narrow the class of death-eligible offenses. If the offense has been properly determined to be death-eligible by at least one valid aggravating factor, the existence of other aggravating factors does not further qualify death-eligibility; once an offender has properly been determined for a valid reason to be includible as a \"death-eligible\" offender, it is unnecessary and therefore legally irrelevant whether he could be included for another reason. Thus, under Georgia's law, aggravating factors are used only to determine death-eligibility, and in this process their number and weight are irrelevant; they are not implicated as such in the sentencing determination. Hence, it is of no moment that these factors may be aggregated.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e This may be contrasted with the Florida scheme in which, as in New Jersey's, the weighing of aggravating against mitigating factors takes place at the sentencing stage. Hence, it is not the existence of aggravating factors, but their number and weight, that becomes determinative. For this reason, under that approach the overlapping or doubling of aggravating factors is prohibited. In Provence v. State, 337 So. 2d 783, 786 (1976), cert. denied, 431 U.S. 969, 97 S. Ct. 2929, 53 L. Ed. 2d 1065 (1977), the Florida Supreme Court prohibited the overlapping of the \"murder occurred in the commission of the robbery\" and murder \"committed for pecuniary gain\" factors. Acknowledging that \"in some cases, such as where a larceny is committed in the course of a rape-murder, subsections (d) and (f) refer to separate . . . concepts\" and are distinguishable, the court insisted nonetheless that in the case of a robbery-murder \"both subsections refer to the same aspect of the defendant's crime. Consequently, one who commits a capital crime in the course of a robbery will always begin with two aggravating circumstances against him. . . .\" Id. (emphasis in original). Despite its earlier admonition in State v. Dixon, 283 So. 2d 1, 10 (Fla.1973), cert. denied sub nom. Hunter v. Florida, 416 U.S. 943, 94 S. Ct. 1950, 40 L. Ed. 2d 295 (1974), that \"the procedure to be followed by the trial judges and juries is not a mere counting\n\nprocess of X number of aggravating circumstances and Y number of mitigating circumstances, but rather a reasoned judgment as to what factual situations require the imposition of death . . .,\" the Provence court held that \"pecuniary motive at the time of the murder constitutes only one factor . . .\" and therefore, in effect, that the overlapping of factors would be prejudicial. 337 So. 2d at 786. See also Delap v. State, 440 So. 2d 1242, 1256 (Fla.1983), cert. denied, 467 U.S. 1264, 104 S. Ct. 3559, 82 L. Ed. 2d 860 (1984) (reaffirming Provence but holding that previous conviction of \"another felony involving the use of violence\" and \"committed by a person under sentence of imprisonment\" \"do not cover the same aspect of defendant's crime\"); White v. State, 403 So. 2d 331, 338 (Fla.1981), cert. denied, 463 U.S. 1229, 103 S. Ct. 3571, 77 L. Ed. 2d 1412 (1983) (finding evidence sufficient to support \"capital felony committed to avoid or prevent a lawful arrest or effect an escape from custody\" factor, but disapproving \"use of these same incidents\" as a basis for another factor because \"this doubling-up of aggravating circumstances violates the rule in Provence \"); Maggard v. State, 399 So. 2d 973, 977 (Fla.1981), cert. denied, 454 U.S. 1059, 102 S. Ct. 610, 70 L. Ed. 2d 598 (1981) (murder during burglary and murder for pecuniary gain overlap under Provence). Cf. Francois v. State, 407 So. 2d 885, 891 (Fla.1981), cert. denied, 458 U.S. 1122, 102 S. Ct. 3511, 73 L. Ed. 2d 1384 (1982) (sentence upheld despite submission of overlapping and invalid aggravating circumstances because there were no mitigating circumstances; \"[w]here the consideration of erroneous aggravating circumstances does not interfere with the weighing process . . . because there are no mitigating circumstances to weigh, no resentencing is required\"); Henry v. Wainwright, 721 F.2d 990, 996 (5th Cir.1983), cert. denied, 466 U.S. 993, 104 S. Ct. 2374, 80 L. Ed. 2d 846 (1984) (violation of Provence rule not fatal where no mitigating circumstances).\n\nThe Supreme Courts of Alabama, Nebraska, and California have held likewise that consideration of overlapping aggravating\n\nfactors at the sentencing stage is impermissible. See Cook v. State, 369 So. 2d 1251, 1256 (Ala.1979) (\"robbery\" and \"pecuniary gain\" factors overlap, \"in effect condemning Cook twice for the same culpable act -- stealing money\" and so pecuniary gain factor cannot be considered by trial judge who under statute determines sentence); State v. Rust, 197 Neb. 528, 538, 250 N.W. 2d 867, 874, cert. denied, 434 U.S. 912, 98 S. Ct. 313, 54 L. Ed. 2d 198 (1977) (where same conduct could support both murder to conceal the perpetrator's identity or murder for pecuniary gain, court held that \"it is not reasonable to construe the definitions in such a manner as to make them overlap and make the same identical facts constitute two aggravating circumstances\"; some \"added different and important element, e.g., motive or purpose,\" must distinguish aggravating circumstances from one another); State v. Stewart, 197 Neb. 497, 522-23, 250 N.W. 2d 849, 864 (1977) (same). In People v. Harris, 36 Cal. 3d 36, 62, 201 Cal.Rptr. 782, 798, 679 P. 2d 433, 448-49, cert. denied, 469 U.S. 965, 105 S. Ct. 365, 83 L. Ed. 2d 301 (1984), the California Supreme Court, referring explicitly to its state's statute's similarity to the Florida scheme, held that \"the constitutionally mandated objective of focusing on the particularized circumstances of the crime and the defendant is undercut when the defendant's conduct is artificially inflated by the multiple charging of overlapping special circumstances . . . based on an indivisible course of conduct having one principal criminal purpose.\"\n\nThe proposition remains controversial. Thus, in Wiley v. State, 484 So. 2d 339 (Miss.1986), cert. denied, 479 U.S. 906, 107 S. Ct. 304, 93 L. Ed. 2d 278 (1986), the defendant made the familiar argument that the pecuniary gain and robbery factors overlap, and that this overlap corrupts the balancing process. The Mississippi majority dismissed this argument, noting that it had already decided that the two factors were independent and that, in any case, \"the jury must find the existence of only one aggravating circumstance to return a death sentence.\" Id. at 351. The jury, in fact, had found two aggravating factors\n\napart from its robbery and pecuniary gain findings. \"Thus,\" the court concluded, \"the failure of one repetitious aggravating circumstance does not invalidate the two remaining . . . factors to reverse the death sentence.\" Id. at 351-52. Justice Robertson's concurrence acknowledged that \"the balancing process is not to be performed mathematically,\" but took issue nonetheless with this analysis. Citing Provence, Justice Robertson argued that the prior cases holding the factors distinct did so either \"[w]ithout offering so much as a whisper why\" or by employing the \"bootstraps logic\" that \"'the robbery was committed for pecuniary gain.'\" Id. at 357. \"[N]o one doubts,\" moreover, \"that the side with the largest number of 'circumstances' has a practical advantage before the sentencing jury.\" Id. The prior cases are unreasoned, in Justice Robertson's view, because they ignore the structure of the statute:\n\nOur present course is illogical because the very structure of the act contemplates eight distinct aggravating circumstances. . . . In the end, the fallacy of our rule is its failure to recognize that murders are aggravated by a defendant's conduct, not by statutory language. Regardless of the label put on it, the defendant's taking of the victim's money is what aggravates the murder. A single, legally indivisible act of the defendant may rationally aggravate a murder but once. [ Id. at 358 (emphasis in original).]\n\nDissenting from the United States Supreme Court's denial of certiorari in Wiley, Justice Marshall likewise emphasized the structure of the statute, in particular the requirement that aggravating circumstances be weighed in guiding sentencing discretion:\n\nThe State Supreme Court relied on the fact that the jury found . . . a third aggravating factor. . . . But under the Mississippi capital sentencing statute . . . the jury was instructed to balance aggravating against mitigating circumstances. While the jury might have returned a verdict of death even if there had been only one aggravating circumstance, we cannot be sure what it would have done in view of the mitigating factors presented; the jury's verdict merely stated that \"there are insufficient mitigating factors to outweigh the aggravating circumstances.\"[Wiley v. Mississippi, 479 U.S. at 908-909, 107 S. Ct. at 305-06, 93 L. Ed. 2d at 280-81 (citations omitted).]\n\nI find that the reasoning thus expressed is most persuasive. I am satisfied that it is improper for the jury for sentencing purposes to aggregate, overlap or double aggravating factors\n\nwhere these factors are based on the same evidence and implicate the same conduct. This leads, I believe, inevitably tothe conclusion that the capital murder statute as it is currently enacted and applied is irrational. It should be considered unconstitutional because it is not susceptible of a construction that can cure this infirmity. If the Court limited the application of the aggravating factors only to the weighing process in conjunction with sentencing, the statute would fail to narrow the class of death-eligible offenses; conversely, if the Court were to invalidate the weighing process by relegating the application of aggravating factors solely to narrowing the class of death-eligible offenders, it would leave the sentencing discretion wholly unguided.\n\nThe Court responds to these objections by permitting the overlapping of aggravating factors, so long as the sentencer is made \"cognizant that the same facts are being used to prove more than one aggravating factor.\" Ante at 176. The Court emphasizes further that it sees no difficulty with the statute's mechanics, according to which death-eligibility is defined by a murder conviction and the finding of aggravating circumstances, while death-selection is a function of the weighing of aggravating and mitigating circumstances. Ante at 177.\n\nIn so holding, the Court sanctions in death penalty cases what it has proscribed in the ordinary criminal context. In State v. Yarbough, 100 N.J. 627 (1985), cert. denied, 475 U.S. 1014, 106 S. Ct. 1193, 89 L. Ed. 2d 308 (1986), this Court considered for the first time, in the context of consecutive-sentencing discretion, the mechanics of the aggravating and mitigating circumstances listed in N.J.S.A. 2C:44-1 to guide the court's discretion in imposing a sentence. The Court adopted as one of its general sentencing criteria the principle that \"there should be no double counting of aggravating factors,\" id. at 644; even granting the distinguishable factual context of Yarbough, I fail to see the difference in principle, or the justification for permitting juries in capital cases to double-count aggravating factors while preventing experienced sentencing judges in ordinary\n\ncriminal cases from doing so. Equally important, this Court remanded for resentencing in Yarbough because \"certain of the factors that the trial court used in its discretion whether to make the sentences consecutive were, in part, the same factors that the Legislature has invoked to establish the very degree of the crime. . . .\" Id. at 645. That is in effect, however, what the majority now permits in a capital context. It allows an aggravating factor, that indirectly establishes death eligibility, as much as an element of a crime determines its degree, to be considered anew in the deliberation of the sentence, and to do so during the sentencing deliberation. Cf. State v. Link, 197 N.J. Super. 615, 620 (App.Div.1984), certif. den., 101 N.J. 234 (1985) (where a fact of the offense is, in essence, an element establishing the degree of the crime, that fact/element may not be used as an aggravating factor to impose a sentence more harsh than the presumptive term). Following the logic of Yarbough, in other words, a determination of death-eligibility -- the degree of the crime -- should be based on factors that are not used again to determine the sentencing discretion. This could be achieved if the guilt-phase definition of capital murder adequately narrowed the class of those eligible for the death penalty; the majority has conceded, however, that the guilt-phase definition does not by itself adequately narrow the class, and is thus forced to rely on the sentencing factors to define the offense. See State v. Ramseur, supra, 106 N.J. at 187-88 n. 20. I renew the objection, stated in dissent in State v. Ramseur, that the guilt-phase definition of capital murder is unconstitutionally overbroad, and cannot be narrowed by recourse to factors used to deliberate sentencing, id. at 384-94 (Handler, J., dissenting), but would add that at a minimum the same evidence cannot be used to support overlapping aggravating factors.\n\nWhile the Court's result today would no doubt be held to satisfy the federal Constitution under Zant v. Stephens, supra; see Lowenfield v. Phelps, 484 U.S. , 108 S. Ct. 546, 98\n\nL. Ed. 2d 568 (1988), I believe that this Court should require discrete guidance at both the definitional and the sentencing phases. This Court should not settle for a scheme that guides sentencing discretion by defining the offense for which sentence is to be imposed. Short of this result, I believe that the resentencing jury must not be permitted to consider redoubled aggravating factors.\n\nIV.\n\nFor these several reasons, I would reverse defendant's conviction and sentence. I would add only that, as I argued in State v. Ramseur, we profess to follow our own constitutional conscience in matters suitably addressed by the State Constitution, but persist in constitutional cloning when it comes to capital punishment, id. at 369-82 (Handler, J., dissenting), despite the fact that the Supreme Court itself has encouraged states to deal with the death penalty in terms of their own constitutions and jurisprudence. California v. Ramos, 463 U.S. 992, 1013-14, 103 S. Ct. 3446, 3460, 77 L. Ed. 2d 1171, 1188-89 (1983). It cannot be doubted that we have enduring and distinctive traditions and standards in the administration of criminal justice that truly call for the independent application of the State Constitution. I continue to believe that N.J.S.A. 2C:11-3 should be evaluated in light of those standards and traditions, and that such an evaluation finds the statute deficient.\n\nFor all of the foregoing reasons, I respectfully dissent.\n\n\u003cspan class=\"fn\"\u003e1. In a struck jury system the voir dire of the potential juror is completed, challenges for cause are decided by the trial judge, and the venireperson is then qualified for jury service in the instant case. All of the preliminarily qualified venirepersons return as a panel and are then subject to peremptory challenges by the defendant and prosecution who have the opportunity to exercise these peremptory challenges in light of the composition of the total qualified jury panel.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Even the defendant's subsequent post-warning confessions to this murder and to the murder that was the focus in Bey (I) would be inadmissible as \"tainted\" under Hartley. Between the resumption of questioning and the issuance of new warnings at 10:55 p.m. defendant let \"the cat out of the bag\" by admitting involvement, Hartley, 103 N.J. at 281-82. In any event, the interrogation upon defendant's return was \"one continuous process,\" id. at 279-81.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. This was explained by the Supreme Court in Zant v. Stephens, supra, 462 U.S. 862, 103 S. Ct. 2733, 77 L. Ed. 2d 235. In upholding the death sentence imposed under the Georgia scheme, the Court reasoned that \"statutory aggravating circumstances play a constitutionally necessary function at the stage of legislative definition: they circumscribe the class of persons eligible for the death penalty.\" Id. at 878, 103 S. Ct. at 2743, 77 L. Ed. 2d at 250-51. The Court noted, however, that \"[w]hat is important at the selection stage [at which the imposition of the death penalty itself is determined] is an individualized determination on the basis of the character of the individual and the circumstances of the crime,\" id. at 879, 103 S. Ct. at 2744, 77 L. Ed. 2d at 251; the Georgia statute provided for this individualized determination by affording the jury discretion -- after the aggravating circumstance(s) had defined the crime as death-eligible and thus established the possibility of a death sentence -- to consider the case as a whole. Thus, because \"the narrowing function has been properly achieved in this case by the two valid aggravating circumstances upheld by the Georgia Supreme Court,\" id. at 879, 103 S. Ct. at 2744, 77 L. Ed. 2d at 251, the federal court held that the unconstitutionality of the third factor in Zant did not affect the validity of the death sentence.\u003c/span\u003e\n\n",
    "body_length": 201195,
    "citedas": [
      "548 A.2d 887",
      "112 N.J. 123"
    ],
    "attorneys": "Judith L. Borman, Assistant Deputy Public Defender, and James K. Smith, Jr., Deputy Public Defender, argued the cause for appellant (Alfred A. Slocum, Public Defender, attorney, Judith L. Borman, James K. Smith, Jr., Lois A. DeJulio, First Assistant Deputy Public Defender, Matthew Astore, and Claudia Van Wyk, Assistant Deputy Public Defenders, on the brief). Alton D. Kenney, Assistant Prosecutor, argued the cause for respondent (John A. Kaye, Monmouth County Prosecutor, attorney, James W. Kennedy, and Mark P. Stalford, Assistant Prosecutors, of counsel). Steven Pasternak, Deputy Attorney General, argued the cause for amicus curiae, Attorney General of New Jersey (W. Cary Edwards, Attorney General, attorney, Jay Hindman, Deputy Attorney General, of counsel, Steven Pasternak, Jay Hindman, and Boris Moczula, Deputy Attorney General, on the briefs).",
    "category": [
      "36",
      "78",
      "75"
    ],
    "judges": "For affirmance of conviction, reverse, sentence and remand -- Chief Justice Wilentz, and Justices Pollock, O'Hern, Garibaldi and Stein. For reversal -- Justices Clifford and Handler. The opinion of the Court was delivered by Pollock, J. Clifford, J., dissenting. Handler, J., dissenting.",
    "citation_count": 137
  }
}
