{
  "id": "n7hvTmYBTlTomsSBDbk1",
  "document": {
    "title": "State v. Ball",
    "full_title": "STATE OF NEW JERSEY v. PATRICK BALL AND BIG APPLE LEASING CO. . STATE OF NEW JERSEY V. GEORGE HURTUK . STATE OF NEW JERSEY V. JOSEPH DULANIE . STATE OF NEW JERSEY V. JOSEPH MOCCO . STATE OF NEW JERSEY V. MICHAEL HARVAN . STATE OF NEW JERSEY V. RICHARD BASSI",
    "jurisdiction": "New Jersey Superior Court",
    "date": "1993-08-06T00:00:00.000Z",
    "docket": "Nos. A-6040-88T1, A-6041-88T1, A-6043-88T1, A-6050-88T1, A-6051-88T1, A-6052-88T1",
    "body": "On April 1, 1986, the State Grand Jury handed down a 116-count indictment charging numerous individuals and entities with various crimes, including conspiracy to commit racketeering, bribery, theft of services, falsifying and tampering with public records, forgery, and the unlawful engagement in the business of solid waste collection and disposal. The indictment alleged that the defendants conspired to illegally dump solid waste generated in New York in several New Jersey sites. They were tried by jury before Judge Humphreys from October 11, 1988 until April 17, 1989 and convicted of certain of the charges. It is from these convictions that defendants appeal. These appeals have been consolidated for the purpose of this opinion. After a careful review of the issues they raise, we affirm.\n\nSpecifically, defendants Richard Bassi and Michael Harvan (dirt brokers), Patrick Ball (a dumper) and Big Apple Leasing Co. (a truck company Ball owned), and three public officials from the Town of North Bergen (Joseph Mocco, Town Clerk, Joseph Dulanie, Deputy Chief of Police, and George Hurtuk, License Inspector), have appealed from their convictions. Many of the issues raised by these defendants, and the arguments posed with respect to them are identical. A statement of facts presented by the State at trial describing the general scenario relevant to the appeals of all seven defendants follows.\n\nFACTS\n\nDuring the time frames involved, Joseph Mocco was the Town Clerk of North Bergen, George Hurtuk was the License Inspector, and Joseph Dulanie was the Deputy Chief of Police. Mocco, Hurtuk and Dulanie shall hereinafter be jointly referred to as the\n\npublic official defendants. Richard Bassi and Michael Harvan were dirt brokers. A dirt broker brings together individuals who need their property filled and dumpers who provide that fill. Patrick Ball was the sole owner of Big Apple Leasing Co., a New York company that engaged in waste dumping or hauling.\n\nBassi and Harvan located illegal dump sites in North Bergen and other North Jersey locations, contacted New York waste haulers (such as Ball and Big apple Leasing) looking for less expensive ways to dispose of the solid waste they hauled, and arranged for those haulers to dump their solid waste at the illegal sites. The public official defendants accepted bribes to permit and facilitate this illegal dumping enterprise.\n\nThe evidence of this scheme introduced at trial is voluminous. It consists of trial testimony, surveillance videotapes, recorded telephone conversations and records created by the various codefendants. The events leading to the convictions of these defendants is essentially the same and, for the most part, not disputed.\n\nBassi and Harvan, by paying bribes to Mocco ($29,100); to Dulanie ($42,100); and Hurtuk ($27,500), obtained \"permission\" to dump debris at illegal dumping sites in North Bergen and at a waste disposal operation (baler) owned and operated by the Hackensack Meadowlands Development Commission (HMDC). This dumping began in North Bergen in January 1986 at a site adjacent to the intersection of 83rd Street and West Side Avenue (83rd Street) and at a site near the intersection of 69th Street and West Side Avenue (69th Street). After the dumping was stopped at the 83rd Street location, a new area was opened at the Walsh Trucking property on 16th Street (Walsh).\n\nThe dumping at Walsh eventually encroached upon a nearby Public Service Electric and Gas (PSE \u0026 G) right-of-way, underneath the company's high tension power lines. At 7:55 p.m., May 13, 1986, a truck carting debris from New York, while in the process of raising its back to dump a load of debris, struck a line carrying 138,000 volts, causing an explosion. When representatives of PSE \u0026 G arrived on the scene, they observed the truck, in\n\nthe \"up\" position, entangled in the wires. The high voltage had grounded through the body of the truck, causing its tires to be blown out and burnt. They also noted that previously dumped debris had raised the level of the ground underneath the wires about fifteen feet. The driver of the dump truck told a PSE \u0026 G engineer that they were filling in a road off Tonnele Avenue to make the area accessible.\n\nThe baler was a landfill operated by the HMDC which compacted waste into bales. These were then stacked and covered with earthen material. Haulers dumping at the baler were required to complete origin and destination (O \u0026 D) forms promulgated by the Department of Environmental Protection (DEP), to prove that the trucks came from areas approved to send waste to the baler. Trucks dumping at the baler were required to present an HMDC decal and a rate-averaging ticket, which would be used for filling purposes, based on the weight of the loaded trucks. The haulers, including Ball's company, Big Apple Leasing, as well as other companies, would falsely indicate on the O \u0026 D forms that the waste originated in a place from which the baler was permitted to take waste, usually Clifton, in Passaic County, when in reality the waste originated in New York.\n\nNot only the baler, but all North Bergen dumping sites were within an area over which the HMDC had jurisdiction for purposes of controlling dumping. Therefore, its approval, plus North Bergen's, as well as approval by the DEP, were all required before legal dumping could proceed. No such approvals were ever received. Once a dumping site was \"acquired\", Bassi and Harvan would \"contract\" with New York haulers to dump their waste material.\n\nIn order to protect and control their program, checkers were hired to monitor the dumping activity; men were placed at crossing locations to warn off truckers if the time for dumping was not right; much of the dumping activity was done at night; and fictitious placards were used to cover each truck's true identity. \"Big M\" and \"Harbas\" were two of the more frequently used\n\ncover logos. Additionally, in order to provide money for their program, a fictitious check-cashing scheme was established. Fraudulent dumping permits were also reproduced.\n\nNorth Bergen dumping licenses were issued for the dumping sites to a fictitious M. Black. Initial casual inquiry or complaints about the dumping were met with these licenses. HMDC undercover investigators were assured that HMDC had also granted approval (no such approvals had ever been obtained). Dumping was also attributed to the town's desire to fill paper streets and to create a pistol range for the police department near the Walsh site.\n\nDumping began in January 1986 and continued into June. Ultimately, the operation came under the joint scrutiny of investigators from the DEP, the HMDC and the New Jersey Department of Criminal Justice (DCJ). During the investigation, permission was granted to obtain telephone records and to install telephone wire taps. In addition, some conversations with various defendants were recorded by using personal concealed recording devices. All of this material was produced as State's evidence at trial.\n\nDespite the ongoing investigations which resulted in the closure of various sites, the enterprise continued its efforts to provide dumping sites in and out of North Bergen. On July 10, 1986, Dulanie was overheard telling Harvan that he was \"trying to work on that thing for you\" and that he had called a political figure from Jersey City to help. Harvan claimed to Dulanie that Hurtuk and Mocco had gone \"around his back\" and \"opened up a place\" on their own. Harvan complained, \"I paid a lot of rent and got fucked . . . what they're doing now is not right.\" Harvan wanted to find a couple of acres in Jersey City, just \"[t]o bring dirt [in] and bring the dirt out[.] I'm not looking to fill nothing in.\" Dulanie agreed to see what he could find out.\n\nMeanwhile, Harvan and Bassi were conducting a dumping operation near Routes 1 and 9 in Newark, as well as continuing to dump at the baler. On July 16, Bassi's vehicle was spotted at the\n\nRoutes 1 and 9 site. On July 20, Bassi and Harvan discussed other possible sites for dumping in that area. They also discussed who was going to dump, and the amount to charge for each load. Bassi said he thought $300 per load was the \"magic number\" because they would still be \"below everybody.\" Harvan also mentioned that if \"they do start up in North Bergen, that's gonna solve all our . . . heat . . . with the law.\" A few days later, Bassi and Harvan again discussed the prices. Bassi said that Morabito (a New York dumper) could not afford the $300, but that Paul Serra (another dumper) could. Bassi suggested that they not use Harbas signs in the baler, because Hurtuk or Baglino might see one and drop \"dimes and quarters.\" Harvan said they would use DAV-MIK Trucking signs.\n\nSearch warrants were executed at a number of sites on August 6 and 7, 1986. At Harvan's residence, investigators found the illegal licenses issued by the North Bergen defendants for 69th and 83rd Streets and for the Walsh site. Also seized were a number of records of the enterprise, including fill tickets, load count recap sheets, and expense records. In addition, investigators discovered twenty envelopes containing $23,000 in cash, and a number of checks and money orders made out to Edward Harvan (Michael Harvan's father). Harvan also possessed a June 16 memorandum from the HMDC, as well as records of the telephone numbers of Hurtuk, Dulanie, and Ball; a complaint against Harvan from April 26;\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e and a copy of a receipt for a permit issued June 4.\n\nAt Bassi's residence, investigators found more enterprise records, including a license issued June 4; receipts for the three licenses; and numerous fill tickets, load counts, expense figures, and canceled CMB Enterprise checks made out to fictitious payees.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nAlso in Bassi's possession was a May 21 letter from PSE \u0026 G, a June 3 letter from Ogden Realty, both demanding that the dumping at the PSE \u0026 G right-of-way and at the Walsh site cease. In a search at Big Apple Leasing in Medford, New York, investigators found a number of corporate checks payable to Bassi, as well as evidence of wire transfers from Big Apple's account to First Fidelity Bank (which held the CMB Enterprises account). Also found were a number of fill tickets labelled Harbass Trucking with various dates and the job described as N.B. or N. Berg.\n\nIn a search of safety deposit boxes leased to Edward Harvan in various Florida banks, and of Edward Harvan's house, investigators seized approximately $122,800 in cash, as well as a number of stock certificates, savings bonds, and gold coins. These represented part of the proceeds from the operation realized by Michael Harvan and sent to his father for safekeeping.\n\nAnalysis of the financial records seized revealed that the billings of Harvan and Bassi for dumping from about February 13, 1986 to June 25, 1986, totalled $888,220. The records also showed that among the expenses of Harvan and Bassi were payments totaling $29,100 to the \"boss\" or \"big guy\", (Mocco); $42,100 to the \"chief,\" (Dulanie); and $27,500 to the \"fat man,\" (Hurtuk).\n\nBased on this review of the financial records, Harvan and Bassi each netted approximately $300,000 to $350,000 from their participation in the dumping enterprise. To pay their expenses, Bassi and Harvan used Nicholas Zimbardi (a codefendant severed from this trial) to cash checks at Valley National Bank from a CMB Enterprises (a corporation controlled by Bassi) bank account. The checks were made out to fictitious payees and were presented for cash by Zimbardi who co-signed as a second payee. The basic pattern discerned from the records was that Bassi and Harvan would list the expenses for the day on a sheet of paper, put a\n\ncheck number next to it, and write a check payable to a fictitious person for the amount of the expenses. The pattern generally involved three checks of less than $10,000, cashed at Valley National Bank. If more than $10,000 was needed, a fourth check would be cashed at First Fidelity Bank. Zimbardi cashed seventy-six checks for a total of approximately $245,000.\n\nTHE DEFENDANTS AND THE ISSUES THEY RAISE RICHARD BASSI\n\nOn April 17, 1989, the jury found Richard Bassi guilty of conspiracy to commit racketeering, a second degree crime, contrary to N.J.S.A. 2C:41-2(d) (count one); racketeering, a second degree crime, contrary to N.J.S.A. 2C:41-2(c) (count two); bribery in the second degree, contrary to N.J.S.A. 2C:27-2(c) and (c) and N.J.S.A. 2C:2-6 (counts three, four, and ten); uttering forged instruments in the fourth degree, contrary to N.J.S.A. 2C:21-1 and N.J.S.A. 2C:2-6 (counts fourteen through twenty-eight); third degree criminal mischief, contrary to N.J.S.A. 2C:17-3a(1) and N.J.S.A. 2C:2-6 (counts thirty-two and thirty-three); and engaging in solid waste collection or disposal without a certificate of public convenience, a fourth degree offense, contrary to N.J.S.A. 48:13A-6 and N.J.S.A. 48:13A-12 (count thirty-four).\n\nCounts one and two (racketeering) arose from the activity of unlawfully disposing of solid waste. Counts three, four, and ten (bribery) were based upon the payment of money bribes to each of the public employee defendants in return for permitting the unlawful dumping. Counts fourteen through twenty-eight (uttering a forged instrument) involved the drawing of fifteen checks on various dates from March 25, 1986 to June 3, 1986 to fictitious individuals which, when cashed, were used to fund the bribes paid to the three public officials. Counts thirty-two and thirty-three (criminal mischief) pertain to the dumping of waste material on the PSE \u0026 G right-of-way (count thirty-two), and damaging the\n\nPSE \u0026 G high voltage transmission lines (count thirty-three). Count thirty-four charged Bassi with engaging in the business of solid waste collection or disposal without a \"certificate of public convenience.\"\n\nOn July 17, 1989, Bassi appeared before Judge Humphreys for sentencing. The court merged count thirty-four into count one, merged count one into count two, and sentenced defendant to nine years imprisonment on count two. Defendant was then sentenced to concurrent prison terms of eight years on counts four, eight, and ten which were, however, to be served consecutive to the sentence on count two. Finally, the court sentenced Bassi to concurrent one year terms for each of the counts fourteen through twenty-eight and after merging count thirty-two into count thirty-three to three years concurrent on count thirty-three. The court fined defendant a total of $150,000, and imposed an aggregate Violent Crimes Compensation Board penalty of $450.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Defendant's aggregate prison term was seventeen years.\n\nDefendant Bassi raises these issues on appeal:\n\nPOINT I\n\nTHERE WAS INSUFFICIENT EVIDENCE TO SUSTAIN RICHARD BASSI'S CONVICTIONS FOR CONSPIRACY TO COMMIT RACKETEERING AND RACKETEERING.\n\nPOINT II\n\nTHE TRIAL COURT IMPROPERLY ADMITTED EVIDENCE FROM ILLEGALLY OBTAINED TELEPHONE RECORDS AND CONVERSATIONS A REVERSAL OF DEFENDANT'S CONVICTIONS IS FULLY WARRANTED.\n\nPOINT III\n\nTHE TRIAL JUDGE COMMITTED REVERSIBLE ERROR IN DENYING ALL DEFENSE MOTIONS TO CONDUCT A FULL INTERVIEW OF JURORS MICHAEL BIONDO AND RAYMOND GREAVES.\n\nPOINT IV\n\nTHE TRIAL COURT ERRED IN DENYING THE DEFENDANT'S MOTION FOR A JUDGMENT OF ACQUITTAL AS TO THE FIFTEEN COUNTS OF UTTERING A FORGED INSTRUMENT.\n\nPOINT V\n\nTHE JUDGE ERRED IN ADMITTING THE HEARSAY STATEMENT OF JOSEPH LOMUSCIO.\n\nPOINT VI\n\nTHE DEFENDANT'S SENTENCE WAS EXCESSIVE.\n\nMICHAEL HARVAN\n\nOn April 17, 1989, the jury also found Michael Harvan guilty of conspiracy to commit racketeering, a second degree crime, contrary to N.J.S.A. 2C:41-2(d) (count one); racketeering, a second degree crime, contrary to N.J.S.A. 2C:41-2(c) (count two); bribery in the second degree, contrary to N.J.S.A. 2C:27-2(c) and (d) and N.J.S.A. 2C:2-6 (counts three, four, and ten); uttering a forged instrument in the fourth degree, contrary to N.J.S.A. 2C:21-1 and N.J.S.A. 2C:2-6 (counts fourteen through twenty-eight); third degree criminal mischief, contrary to N.J.S.A. 2C:17-3a(1) and N.J.S.A. 2C:2-6 (counts thirty-two and thirty-three); and engaging in solid waste collection or disposal with a certificate of public convenience, a fourth degree offense, contrary to N.J.S.A. 48:13A-6 and N.J.S.A. 48:13A-12 (count thirty-four).\n\nOn July 17, 1989, Harvan appeared before Judge Humphreys for sentencing. The court merged count thirty-four into count one, count one into count two, and sentenced defendant to nine years imprisonment on count two. The sentence on count two was made consecutive to counts four, eight and ten. Defendant was then sentenced to concurrent prison terms of eight years on counts four, eight, and ten; concurrent one year terms for each of the counts fourteen through twenty-eight and three years concurrent on count thirty-three. Count thirty-two was merged into count thirty-three. The court fined defendant a total of $150,000, and imposed an aggregate Violent Crimes Compensation Board\n\npenalty of $450.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Defendant was thus sentenced to an aggregate prison term of seventeen years.\n\nDefendant Harvan raises these issues on appeal:\n\nPOINT I\n\nTHE DEFENDANT'S RIGHT OF DUE PROCESS OF LAW WAS VIOLATED: THE TRIAL COURT IMPROPERLY INSTRUCTED THE JURY ON THE LAW OF RACKETEERING INFLUENCE AND CORRUPTION ORGANIZATION.\n\nPOINT II\n\nTHE MOTION TO SUPPRESS EVIDENCE SHOULD HAVE BEEN GRANTED:\n\nA. THE AFFIDAVIT SUPPORTING THE WARRANT APPLICATION FAILED TO ESTABLISH PROBABLE CAUSE.\n\nB. A SEIZURE OF TELEPHONE BILLING RECORDS TRIGGERS THE NEW JERSEY ELECTRONIC SURVEILLANCE ACT.\n\nPOINT III\n\nTHE JURY SELECTION PROCESS VIOLATED DEFENDANT'S RIGHT TO A FAIR AND IMPARTIAL JURY AS GUARANTEED BY THE FEDERAL AND STATE CONSTITUTIONS.\n\nPOINT IV\n\nTHE RICO STATUTE VIOLATES THE FEDERAL AND STATE CONSTITUTIONS: THE VAGUE \"PATTERN OF RACKETEERING\" LANGUAGE IN THE RICO STATUTE VIOLATES DUE PROCESS OF LAW.\n\nPOINT V\n\nTHE FAILURE OF THE TRIAL COURT TO MERGE THE PREDICATE CRIMES INTO THE SUBSTANTIVE RACKETEERING OFFENSE VIOLATES THE FOLLOWING: FEDERAL AND STATE CONSTITUTIONAL BARS AGAINST DOUBLE JEOPARDY, DUE PROCESS OF LAW, AND NEW JERSEY MERGER LAW.\n\nPOINT VI\n\nTHE RACKETEERING CONVICTION SHOULD RUN CONCURRENT WITH, NOT CONSECUTIVE TO, THE REMAINING COUNTS.\n\nPOINT VII\n\nDEFENDANT JOINS AND ADOPTS CODEFENDANTS' ARGUMENTS.\n\nPATRICK BALL AND BIG APPLE LEASING CO.\n\nDefendants Ball and Big Apple were found guilty of second degree conspiracy to commit racketeering, contrary to N.J.S.A. 2C:41-2(d) (count one). Ball was sentenced to a term of nine years imprisonment and was fined $100,000. A Violent Crimes Compensation Board penalty of $30 was also imposed. Big Apple was fined $150,000.\n\nDefendants Ball\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e and Big Apple appeal urging:\n\nPOINT I\n\nTHE VARIOUS COUNTS OF THE INDICTMENT ON WHICH BALL WAS TRIED WERE DEFECTIVE AS A RESULT OF THEIR FAILURE TO ALLEGE CRIMINAL INTENT, AN ESSENTIAL ELEMENT OF THE OFFENSES CHARGED.\n\nPOINT II\n\nBY FAILING TO INSTRUCT THE GRAND JURY WITH RESPECT TO THE MEANING OF THE CONCEPT OF ENTERPRISE -- A CRITICAL ELEMENT OF THE RACKETEERING OFFENSE -- THE GRAND JURY WAS PREVENTED FROM FULFILLING ITS CONSTITUTIONAL ROLE.\n\nPOINT III\n\nTHE VARIOUS WIRETAP ORDERS WERE IMPROPERLY ISSUED AND THE RESULTING EVIDENCE SHOULD HAVE BEEN SUPPRESSED.\n\nA. THE SEVERAL TOLL BILLING APPLICATIONS WERE FACTUALLY AND LEGALLY INSUFFICIENT.\n\n1. THE FACTS.\n\n2. THERE WAS NO BASIS UPON WHICH TO JUSTIFY THE ISSUANCE OF A WARRANT FOR THE TOLL RECORDS OF THE Dunkin['] DONUTS PUBLIC PHONE.\n\n3. THE APPLICATION FOR TOLL RECORDS OF THE PLAZA DINER TELEPHONE WAS LIKEWISE DEFECTIVE SINCE IT DID NOT DEMONSTRATE PROBABLE CAUSE NOR DID IT COMPLY WITH THE NEW JERSEY WIRETAP ACT.\n\nB. THE INITIAL WIRETAP ORDER WAS INVALID.\n\nPOINT IV\n\nTHE EVIDENCE WAS INSUFFICIENT TO SUSTAIN BALL'S CONVICTION OF RACKETEERING CONSPIRACY.\n\nA. The Evidence Failed to Establish The Existence of The Enterprise Charged During The Time Period Set Forth in the Indictment.\n\nB. The Proofs Failed to Establish That Ball Agreed To Participate In The Affairs Of An Enterprise Through A Pattern of Racketeering Activity.\n\nC. CONCLUSION\n\nPOINT V\n\nTHE BRIBERY COUNTS AGAINST BALL SHOULD HAVE BEEN DISMISSED FOR INSUFFICIENT EVIDENCE; ACCORDINGLY, THEIR SUBMISSION TO THE JURY PREJUDICED BALL NOTWITHSTANDING HIS ACQUITTAL ON THOSE CHARGES.\n\nPOINT VI\n\nTHE STATE AND FEDERAL CONSTITUTIONAL RIGHTS OF DEFENDANT BALL TO DUE PROCESS AND TO A FAIR TRIAL WERE VIOLATED BY INCIDENTS OF JURY TAMPERING AND BY THE TRIAL COURT'S REFUSAL TO CONDUCT AN INTERVIEW OF THE APPROACHED JUROR AFTER FINDING OUT THAT THE JUROR HAD LIED ABOUT CERTAIN FACTS AND HAD NOT DISCLOSED CERTAIN OTHER FACTS THAT SHOULD HAVE BEEN DISCLOSED.\n\nA. FACTUAL BACKGROUND.\n\nB. THE VIOLATION OF DEFENDANT'S STATE AND FEDERAL CONSTITUTIONAL RIGHTS TO DUE PROCESS AND TO A FAIR TRIAL.\n\nTHE PUBLIC OFFICIAL DEFENDANTS\n\nJOSEPH MOCCO -- (TOWN CLERK)\n\nDefendant Mocco was found guilty of second degree conspiracy to commit racketeering, contrary to N.J.S.A. 2C:41-1d (count one); second degree bribery, contrary to N.J.S.A. 2C:27-2(c) and (d) (counts three and nine) and second degree official misconduct, contrary to N.J.S.A. 2C:30-2(a) (count twenty-nine).\n\nMocco was sentenced on count one to ten years imprisonment, to run consecutive to concurrent ten year terms for counts three and nine. Count twenty-nine was merged into count three. Mocco was also fined $200,000, ordered to make restitution in the sum of $56,300 and assessed a total Violent Crimes Compensation Board penalty of $90. Thus, his aggregate prison term is twenty years.\n\nGEORGE HURTUK -- (DEPUTY POLICE CHIEF)\n\nDefendant Hurtuk was found guilty of second degree conspiracy to commit racketeering, contrary to N.J.S.A. 2C:41-1d (count one); second degree bribery, contrary to N.J.S.A. 2C:27-2(c) and (d) (count nine); second degree official misconduct, contrary to N.J.S.A. 2C:30-2(a) and (b) (count thirty-one) and third degree criminal mischief, contrary to N.J.S.A. 2C:17-3a(1) and N.J.S.A. 2C:2-6 (counts thirty-two and thirty-three).\n\nHe was sentenced on count one to seven years imprisonment to run consecutive to concurrent terms of eight years imprisonment on count nine and three years imprisonment on count thirty-three. Count thirty-one was merged into count nine and count thirty-two was merged into count thirty-three. He was also fined $75,000, ordered to make restitution in the sum of $27,000 and a Violent Crimes Compensation Board penalty of $90 was imposed. His aggregate prison term is fifteen years.\n\nJOSEPH DULANIE -- (LICENSE INSPECTOR)\n\nDefendant Dulanie was found guilty of second degree conspiracy to commit racketeering, contrary to N.J.S.A. 2C:41-1d (count one); second degree bribery, contrary to N.J.S.A. 2C:27-2(c) (count seven) and second degree official misconduct, contrary to N.J.S.A. 2C:30-2(a) and (b) (count thirty).\n\nHe was sentenced on count one to seven years imprisonment to run consecutive to a term of eight years on count seven. Count thirty was merged into count seven. He was also fined $75,000, ordered to make restitution in the sum of $41,600 and a Violent Crimes Compensation Board penalty of $60 was imposed. His aggregate prison term is fifteen years.\n\nThese public official defendants jointly raise the following issues on appeal:\n\nPOINT I\n\nTHE CONVICTIONS FOR COUNT ONE IN THE INDICTMENT MUST BE REVERSED AS THE PROOF FAILED AS TO THE EXISTENCE OF A RICO ENTERPRISE. THE TRIAL COURT ERRED IN INSTRUCTING THE JURY\n\nAS TO THE ELEMENTS OF RACKETEERING IN THE FACE OF INSUFFICIENT PROOF. THAT ERROR WAS PLAIN AND HARMFUL ERROR, REQUIRING REVERSAL.\n\nPOINT II\n\nTHE APPELLANTS' CONVICTION SHOULD BE REVERSED AS THE COURT ERRED IN DENYING DEFENDANTS' MOTION TO SUPPRESS ILLEGALLY OBTAINED WIRETAPS.\n\nPOINT III\n\nTRIAL COURT ERRED IN PERMITTING THE ADMISSION OF THE HEARSAY STATEMENT MADE BY JOSEPH LOMUSCIO.\n\nPOINT IV\n\nTHE JURY IN THE TRIAL HEREIN WAS TAINTED, TRIAL COURT'S DENIAL OF DEFENDANTS' MOTION INTERVIEWING JURORS MICHAEL BIONDO AND RAYMOND GRAVES REPRESENTS REVERSIBLE ERROR.\n\nPOINT V\n\nTHE TRIAL COURT ERRED IN DENYING DEFENDANTS' MOTION TO DISQUALIFY THE HONORABLE BURRELL IVES HUMPHREYS, A.J.S.C., FROM SITTING IN THIS MATTER.\n\nPOINT VI\n\nTHE ORIGINAL ORDER TO INTERCEPT THE TOLL-BILLING RECORDS WAS IMPROPER.\n\nPOINT VII\n\nTHE GOVERNMENT'S LOSS AND/OR DESTRUCTION OF THE EVIDENCE REQUIRES REVERSAL OF THE CONVICTIONS HEREIN.\n\nI\n\nRICO ISSUES\n\nINDEX OF RICO ISSUES\n\nRICHARD BASSI P. 96\n\nA. WHAT QUALIFIES AS A RICO ENTERPRISE P. 97\n\nB. MULTIPLE CONSPIRACIES AS SINGLE EN-\n\nTERPRISE P. 108\n\nMICHAEL HARVAN P. 111\n\nA. ENTERPRISE -- COMMON PURPOSE P. 111\n\nB. PATTERN OF RACKETEERING -- NEW JERSEY\n\nRICO NOT UNCONSTITUTIONALLY VAGUE P. 114\n\nPATRICK BALL P. 118\n\nA. THE ENTERPRISE ELEMENT AND ALLEGED\n\nFAILURE TO ADEQUATELY CHARGE THE\n\nGRAND JURY P. 118\n\nB. ENTERPRISE -- FAILURE OF PROOF P. 120\n\nC. NO NEED TO PERSONALLY COMMIT ACTS P. 122\n\nD. FAILURE TO SPECIFY INTENT IN INDICT-\n\nMENT P. 126\n\nE. PATTERN OF RACKETEERING ACTIVITY --\n\nRELATEDNESS AND CONTINUITY P. 130\n\nPUBLIC EMPLOYEES P. 132\n\nA. RICO-CONSPIRACY -- EXTENT OF AWARE-\n\nNESS AND PARTICIPATION REQUIRED P. 133\n\nB. PATTERN OF RACKETEERING ACTIVITY -- NO\n\nNECESSITY FOR CONTINUITY P. 138\n\nRICO SUMMARY P. 143\n\nRICHARD BASSI\n\nCount one charged Bassi with conspiracy to commit racketeering, contrary to N.J.S.A. 2C:41-2d. The State alleged that the conspiracy took place between the months of January and August 1986 at various locations in New York, New Jersey, and Florida, and involved fifteen individuals and eleven entities. These individuals and entities were alleged to have comprised an \"enterprise\" in violation of N.J.S.A. 2C:41-1c. The alleged primary purpose of the enterprise was the unlawful disposal of out-of-state solid waste within New Jersey for the members and associates of the enterprise, through a pattern of racketeering activity.\n\nCount two charged Bassi with the substantive offense of racketeering, contrary to N.J.S.A. 2C:41-2 and N.J.S.A. 2C:2-6.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e The State alleged that between January and August of 1986, he committed racketeering acts related to forgery and fraudulent practices, bribery, and theft.\n\nBassi unsuccessfully moved to dismiss both RICO counts at the close of the State's case on the ground that the evidence was insufficient to prove that an \"enterprise\" existed within the meaning of N.J.S.A. 2C:41-1c. He again raises this point in the instant appeal.\n\nDefendants Mocco, Dulanie, Hurtuk, Harvan, and Ball were also named in counts one and two of the indictment. They likewise moved for judgment of acquittal at the close of the State's case based upon the State's alleged failure in proving the RICO counts. Each defendant alleges on appeal that denial of his motion was in error. See Issue I by Mocco, Hurtuk, and Dulanie, Issue IV by Ball and Issues I and IV by Harvan. To the extent that each defendant advances the same Rico \"enterprise\" issue, this part of the decision is intended to apply to each of those defendants.\n\nAs an offshoot of his enterprise argument, Bassi also contends that there was a variance between the indictment, which charged a unified RICO conspiracy, and the State's proofs at trial, which allegedly established only that isolated multiple conspiracies may have existed. He contends that this \"fatal variance\" between the indictment and the proofs requires reversal of the RICO convictions.\n\nIn a supplemental pro se brief, Bassi argues that New Jersey RICO was intended to protect legitimate businesses and shareholders and thus does not reach the allegedly illicit enterprise charged in the indictment. This argument is patently without merit. It is clear our New Jersey RICO statute applies to both licit and illicit associations. See N.J.S.A. 2C:41-1c. Bassi also argues that he cannot be liable under RICO provisions since the enterprise corrupted was his own company. This argument is also without merit. The offense for which defendant was convicted was participation in the affairs of an \"enterprise\" through a pattern of racketeering activity. The enterprise was not alleged to be Bassi's own personal company, but rather an organization consisting of many members, whose common purpose was to profit from the dumping of illegal waste.\n\nA. WHAT QUALIFIES AS A RICO ENTERPRISE\n\nThe crux of Bassi's argument as well as arguments of the other defendants is that the State failed to prove the existence of an \"enterprise\" as required by our statute. Specifically, they contend\n\nthat defendants' short-lived, informal, relationship or incidental association did not constitute a separate ongoing highly structured organization apart from their criminal activity. Accordingly, they contend that the New Jersey RICO statute does not apply. We disagree.\n\nThere are few reported decisions interpreting the New Jersey \"Little RICO\" statute, which is patterned after the Racketeer Influenced and Corrupt Organizations (RICO) provisions of Title IX of the Federal Organized Crime Control Act of 1970, 18 U.S.C.A. §§ 1961-1968. However, a body of federal case law has emerged interpreting Federal RICO. Since our own statute essentially \"borrows its structure, purpose and remedies from Federal RICO,\" it is appropriate to seek guidance from those federal decisions. Matter of Integrity Ins. Co., 245 N.J. Super. 133, 135, 584 A.2d 286 (Law Div.1990); State v. Kuklinski, 234 N.J. Super. 418, 419, 560 A.2d 1295 (Law Div.1988). Additionally, a number of states\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e have enacted \"Little RICO\" statutes and have addressed some of the questions raised in this appeal.\n\nBroadly speaking, a RICO offense arises from \"the use of power, acquired by crime, to gain or maintain a foothold in an enterprise that operates in interstate commerce.\" United States\n\nv. Jannotti, 729 F. 2d 213, 230 (3d Cir.), cert. denied, 469 U.S. 880, 105 S. Ct. 243, 83 L. Ed. 2d 182 (1984). Phrased differently, New Jersey RICO prohibits predicate acts (enumerated Federal and State crime) which form a pattern of racketeering activity carried on by an enterprise engaged in commerce. Specifically, the New Jersey racketeering statute provides that:\n\nc. It shall be unlawful for any person employed by or associated with any enterprise engaged in or activities of which affect trade or commerce to conduct or participate, directly or indirectly, in the conduct of the enterprise's affairs through a pattern of racketeering activity or collection of unlawful debt.\n\nd. It shall be unlawful for any person to conspire as defined by N.J.S. 2C:5-2, to violate any of the provisions of this section.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\n[ N.J.S.A. 2C:41-2c and d.]\n\nPursuant to N.J.S.A. 2C:41-2c, the State must prove the following five elements in a substantive RICO offense: (1) the existence of an enterprise; (2) that the enterprise engaged in or its activities affected trade or commerce; (3) that defendant was employed by, or associated with the enterprise; (4) that he or she participated in the conduct of the affairs of the enterprise; and (5) that he or she participated through a pattern of racketeering activity. Cf. United States v. Russo, 796 F. 2d 1443, 1455 (11th Cir.1986) (construing parallel provision of Federal RICO statute).\n\nIn order to prove a conspiracy to violate RICO under N.J.S.A. 2C:41-2d, the State must present evidence that defendant agreed to participate directly or indirectly in the conduct of the affairs of the enterprise by agreeing to commit, or to aid other members of the conspiracy to commit, at least two racketeering\n\nacts (N.J.S.A. 2C:41-1a(1) and (2); N.J.S.A. 2C:41-1d(1)); and that he or she acted knowingly and purposely with knowledge of the unlawful objective of the conspiracy and with the intent to further its unlawful objective. Cf. United States v. Riccobene, 709 F. 2d 214, 224-25 (3d Cir.), cert. denied sub nom., Ciancaglini v. United States, 464 U.S. 849, 104 S. Ct. 157, 78 L. Ed. 2d 145 (1983) (construing parallel provision of Federal RICO). See also N.J.S.A. 2C:5-2 (New Jersey conspiracy law).\n\nThe Federal Circuits are split over whether a RICO conspiracy requires that defendant agree that he personally will commit two predicate acts, (predicate acts are those acts defined by statute to be illegal or \"Racketeering Activity\" as set forth in N.J.S.A. 2C:41-1a(1) and (2)) or whether it is sufficient that defendant agree that other members of the conspiracy will commit two such acts. The latter is the majority rule. This issue is raised by defendants Ball and Big Apple Leasing and will be discussed infra.\n\nThe terms \"enterprise\" and \"pattern of racketeering activity\" are defined under New Jersey RICO as follows:\n\nc. \"Enterprise\" includes any individual, sole proprietorship, partnership, corporation, business or charitable trust, association, or other legal entity, any union or group of individuals associated in fact although not a legal entity, and it includes illicit as well as licit enterprises and governmental as well as other entities.\n\nd. \"Pattern of racketeering activity\" requires\n\n(1) Engaging in at least two incidents of racketeering conduct one of which shall have occurred after the effective date of this act and the last of which shall have occurred within 10 years . . . after a prior incident of racketeering activity; and\n\n(2) A showing that the incidents of racketeering activity embrace criminal conduct that has either the same or similar purposes, results, participants or victims or methods of commission or are otherwise interrelated by distinguishing characteristics and are not isolated incidents.\n\n[ N.J.S.A. 2C:41-1c and d.]\n\nUnder the Federal RICO statute, the term \"enterprise\" is given substantially the same definition as New Jersey's. It includes \"any individual, partnership, corporation, association, or other\n\nlegal entity, and any union or group of individuals associated in fact although not a legal entity.\" 18 U.S.C.A. § 1961(4).\n\nWith respect to the \"pattern\" element, Federal RICO provides only that:\n\n\"pattern of racketeering activity\" requires at least two acts of racketeering activity, one of which occurred after the effective date of this chapter and the last of which occurred within ten years . . . after the commission of a prior act of racketeering activity;\n\n[18 U.S.C.A. § 1961(5).]\n\nIn United States v. Turkette, 452 U.S. 576, 101 S. Ct. 2524, 69 L. Ed. 2d 246 (1981), the Supreme Court elaborated on the definition of an illegal enterprise for RICO purposes. The indictment in Turkette described the enterprise as a \"group of individuals associated in fact for the purpose of illegally trafficking in narcotics and other dangerous drugs, committing arsons, utilizing the United States mails to defraud insurance companies, bribing and attempting to bribe local police officers, and corruptly influencing and attempting to corruptly influence the outcome of state court proceedings . . . .\" Id. at 579, 101 S. Ct. at 2526-27, 69 L. Ed. 2d at 252. At the Turkette trial, the evidence \"focused upon both the professional nature of this organization and the execution of a number of distinct criminal acts.\" Ibid. The specific issue before the Court was whether the term \"enterprise\" encompassed both legitimate organizations as well as those that were exclusively criminal. The Court construed the statute broadly, holding that neither the language nor the legislative history of the Act limited its application solely to legitimate enterprises. In so doing, the Court discussed the Government's burden of proof in all RICO prosecutions:\n\nIn order to secure a conviction under RICO, the Government must prove both the existence of an \"enterprise\" and the connected \"pattern of racketeering activity.\" The enterprise is an entity, for present purposes a group of persons associated together for a common purpose of engaging in a course of conduct. The pattern of racketeering activity is, on the other hand, a series of criminal acts as defined by the statute . . . . The former is proved by evidence of an ongoing organization, formal or informal, and by evidence that the various associates function as a continuing unit. The latter is proved by evidence of the requisite number of acts of\n\nracketeering committed by the participants in the enterprise. While the proof used to establish these separate elements may in particular cases coalesce, proof of one does not necessarily establish the other. The \"enterprise\" is not the \"pattern of racketeering activity\"; it is an entity separate and apart from the pattern of activity in which it engages. The existence of an enterprise at all times remains a separate element which must be proved by the Government.\n\n[ Id. at 583, 101 S. Ct. at 2528-29, 69 L. Ed. 2d at 254-55.]\n\nPresently, there is a split of authority among the Federal Circuits over the proper scope of the RICO enterprise element, and the requirements for establishing this element. The First, Second, Sixth, Seventh, Ninth, Eleventh, and D.C. Circuits have not grafted additional requirements on Turkette and adhere closely to the language of that decision. According to those Circuits, an enterprise exists where there is an ongoing organization, formal or informal, evidence that members of the organization function as a continuing unit, and evidence that the enterprise is an entity separate and apart from the pattern of activity in which it is engaged. United States v. Doherty, 867 F. 2d 47, 67-68 (1st Cir.), cert. denied sub nom., Salerno v. United States, 492 U.S. 918, 109 S. Ct. 3243, 106 L. Ed. 2d 590 (1989); Fleischhauer v. Feltner, 879 F. 2d 1290, 1297 n. 4 (6th Cir.1989), cert. denied, 493 U.S. 1074, 110 S. Ct. 1122, 107 L. Ed. 2d 1029 (1990); United States v. Alvarez, 860 F. 2d 801, 819 (7th Cir.1988), cert. denied, 490 U.S. 1051, 109 S. Ct. 1966, 104 L. Ed. 2d 434 (1989); United Energy Owners v. United States Energy Management, 837 F. 2d 356, 362 (9th Cir.1988); United States v. Perholtz, 842 F. 2d 343, 363 (D.C.Cir.), cert. denied, 488 U.S. 821, 109 S. Ct. 65, 102 L. Ed. 2d 42 (1988); United States v. Qaoud, 777 F. 2d 1105, 1114-16 (6th Cir.1985), cert. denied sub nom., Callanan v. United States, 475 U.S. 1098, 106 S. Ct. 1499, 89 L. Ed. 2d 899 (1986); United States v. Russo, supra, 796 F. 2d at 1462; United States v. Mazzei, 700 F. 2d 85, 88-89 (2d Cir.), cert. denied, 461 U.S. 945, 103 S. Ct. 2124, 77 L. Ed. 2d 1304 (1983).\n\nThe Eleventh and Second Circuits have taken the broadest approach. The Eleventh Circuit has defined a RICO enterprise \"as any group of persons 'whose association, however loose or\n\ninformal, furnishes the vehicle for commission of two or more predicate crimes.'\" United States v. Russo, supra, 796 F. 2d at 1462; United States v. Hewes, 729 F. 2d 1302, 1310-12 (11th Cir.1984), cert. denied sub nom., Caldwell v. United States, 469 U.S. 1110, 105 S. Ct. 790, 83 L. Ed. 2d 783 (1985); United States v. Cagnina, 697 F. 2d 915, 920-21 (11th Cir.), cert. denied, 464 U.S. 856, 104 S. Ct. 175, 78 L. Ed. 2d 157 (1983) (informal association with the common purpose of making money from diverse criminal activity is sufficient to constitute a RICO \"enterprise\").\n\nThe Second Circuit has held that an enterprise exists if there is a group of individuals with a community of interest and a continuing core of personnel. The Second Circuit has upheld application of RICO \"to situations where the enterprise was, in effect, no more than the sum of the predicate racketeering acts.\" United States v. Bagaric, 706 F. 2d 42, 55 (2d Cir.), cert. denied, 464 U.S. 840, 104 S. Ct. 134, 78 L. Ed. 2d 128 (1983); United States v. Mazzei, supra, 700 F. 2d at 88-89; United States v. Errico, 635 F. 2d 152, 156 (2d Cir.1980), cert. denied, 453 U.S. 911, 101 S. Ct. 3142, 69 L. Ed. 2d 994 (1981).\n\nThe Third, Fourth, Fifth, Eighth, and Tenth Circuits have taken a narrower approach to the enterprise element. Courts in these Circuits require that the enterprise be an ongoing organization with a purpose greater than the commission of predicate acts, and that it have an \"ascertainable structure.\" This structure is evidenced, for example, by a mechanism for decision making and for controlling the affairs of the group. Calcasieu Marine Nat. Bank v. Grant, 943 F. 2d 1453, 1461 (5th Cir.1991); United States v. Sanders, 928 F. 2d 940, 943-44 (10th Cir.), cert. denied, U.S. , 112 S. Ct. 142, 116 L. Ed. 2d 109 (1991); United States v. Tillett, 763 F. 2d 628, 631-32 (4th Cir.1985); United States v. Riccobene, supra, 709 F. 2d at 222-24; United States v. Bledsoe, 674 F. 2d 647, 665 (8th Cir.), cert. denied, sub nom, Phillips v. United States, 459 U.S. 1040, 103 S. Ct. 456, 74 L. Ed. 2d 608 (1982); United States v. Griffin, 660 F. 2d 996, 1000 (4th Cir.1981), cert.\n\ndenied, sub nom, Garonzik v. United States, 454 U.S. 1156, 102 S. Ct. 1029, 71 L. Ed. 2d 313 (1982).\n\nThe judicial dispute giving rise to the split of authority centers around disagreement over the purpose and scope of RICO. Courts that broadly interpret the term enterprise as a group associated only for the purpose of committing one or more predicate acts adhere to the view that RICO was intended to supplant traditional conspiracy law, and reject the notion that it was intended for use only against highly organized criminal organizations. Ibid. Compare United States v. Bledsoe, supra, 674 F. 2d at 664 (unless proof of enterprise also requires proof of a structure, distinct from the organization necessary to commit the predicate offenses, it will be used to punish merely the commission of two or more predicate offenses within a ten-year period), with United States v. Qaoud, supra, 777 F. 2d at 1114-17 (RICO was intended to establish new means of combatting continuing patterns of criminal activities, as well as organized crime). See also State v. Hughes, 108 N.M. 143, 767 P. 2d 382, 387 (N.M.Ct.App.1988), cert. denied, 108 N.M. 115, 767 P. 2d 354 (1989) (noting split of authority among Federal Circuits and declining to follow the narrower construction in applying state RICO law).\n\nIn denying all defense motions for acquittal on counts one and two, Judge Humphreys acknowledged the split of authority, but ultimately rejected the narrower construction. He explained:\n\nThe defendants are correct that a number of Federal Courts have reached different constructions of the Federal RICO Statute and have also expressed in different words their views and analysis of the structure issue. The defendants are also correct in calling attention to a growing concern that some RICO prosecutions may trespass on the fundamental distinction in criminal law between guilt by acts and guilt by association.\n\nNevertheless, a crabbed construction of the New Jersey Racketeering Statute would not be consonant with its legislative intent. The New Jersey Legislature's stated objective in adopting the Racketeering Statute is to provide \"strict civil and criminal sanctions\" in order to \"prevent, disrupt and eliminate the infiltration of organized crime type activities which are substantial in nature into the legitimate trade or commerce of this State.\" See N.J.S.A. 2C:41-1.1(c). The New Jersey Statute is broadly drawn, arguably even more broadly drawn than the Federal Statute . . . . Taking the restrictive interpretations advanced by some Federal\n\nCourts would fly in the face of this New Jersey legislative intent and would erode the beneficial purposes of the New Jersey Statute.\n\nThe key to avoiding a narrow nullifying construction and avoiding infringing upon the individual's rights of association is to focus on the facts of a given case . . . .\n\nHere the answer is clear. A group of people associate together in order to provide and operate illegal dumping sites in New Jersey for out-of-state waste. Municipal officials are bribed to permit and protect this venture. The organization continues for a number of months. The participants work together, at least until law enforcement officials accelerate their investigation. The conspirators are animated by the common purpose of providing illegal dump sites for out-of-state waste and out-of-state waste haulers and to make money from this illegal Enterprise and related criminal activity. The above descriptions are a clear example of a racketeering enterprise which the New Jersey Racketeering Statute was designed to prevent and punish.\n\nWe agree with Judge Humphreys' Conclusion for substantially the reasons expressed in his opinion.\n\nThe New Jersey and Federal RICO Statutes are very similar. For example, both share common language and a common legislative purpose: the prevention and punishment of organized criminal activity. Both contain provisions that they shall be \"liberally construed\" to effectuate their remedial purposes. N.J.S.A. 2C:41-6; 18 U.S.C.A. § 1961. However, there are significant differences in their expressed purposes which demonstrate our Legislature's willingness to fashion a state RICO law even broader in scope than its federal counterpart. See State v. Passante, 225 N.J. Super. 439, 442-43, 542 A.2d 952 (Law Div.1987) (comparing Federal RICO with New Jersey RICO).\n\nThe purpose of Federal RICO stated in section 1 of P.L. 91-452 is as follows:\n\nIt is the purpose of this Act to seek the eradication of organized crime in the United States by strengthening the legal tools in the evidence gathering process, by establishing new penal prohibitions, and by providing enhanced sanctions and new remedies to deal with the unlawful activities of those engaged in organized crime.\n\n[Organized Crime Control Act of 1970, Statement of Findings and Purpose, 84 Stat. 922-23 (1970), reprinted in (1970) U.S.Cong. \u0026 Admin.News, at 1073.]\n\nA declaration of policy and legislative findings with respect to New Jersey RICO is found at N.J.S.A. 2C:41-1.1c. It states in relevant part that:\n\nIn order to safeguard the public interest, effective criminal and civil sanctions are needed to prevent, disrupt, and eliminate the infiltration of organized crime type activities which are substantial in nature into the legitimate trade or commerce of this State. It is, therefore, in the public interest to provide that activity which is inimical to the general health, welfare and prosperity of the State and its inhabitants be made subject to strict civil and criminal sanctions.\n\n[Emphasis added.]\n\nThe origin of the Statute was Assembly Bill 1079 ((A-1079) adopted in 1981). The members of the Assembly, Judiciary, Law, Public Safety and Defense Committee were clearly concerned that the scope of the statute was made clear:\n\n[W]e added to the declaration of policy, after \"organized crime,\" the phrase \"and organized crime type activities.\" We did not want to limit the scope of the bill to the traditional, perhaps, press notion of organized crime as either the Mafia or La Cosa Nostra. We wanted it to cover that, but we also wanted to be able to, as the bill is in fact directed to do, to go into organized criminal activity, which could reach labor racketeering, traditional organized crime activities, business or commercial activities.\n\n[ See ] Statement of William F. Bolan, Jr., Deputy Attorney General before the Committee Meeting Before Assembly Judiciary, Law, Public Safety and Defense Committee on A-1079 (Racketeer Influenced and Corrupt Organizations Act), 1-5 (1980).\n\nDespite the similarities between New Jersey and Federal RICO statutes, the New Jersey RICO definition of \"enterprise\" is more expansive than that contained in the federal version. Unlike Federal RICO, it specifically references \"illicit as well as licit enterprises.\" Additionally, New Jersey RICO expressly defines what constitutes a \"pattern of racketeering activity.\" See N.J.S.A. 2C:41-1d(2), supra. This provision is not found in the federal statute. In the section prohibiting investment of racketeering income in an enterprise, New Jersey RICO adds a statutory presumption which makes it easier to trace funds from a specific source into an investment. See N.J.S.A. 2C:41-2a. No such presumption was made part of Federal RICO. Our Statute provides more specificity and clarity respecting the proscribed conduct and counters the \"constitutional vagueness\" argument often leveled against Federal RICO. See H.J. Inc. v. Northwestern Bell, 492 U.S. 229, 109 S. Ct. 2893, 106 L. Ed. 2d 195 (1989).\n\nThis issue is raised by defendant Harvan, and is discussed in subsection B of the Harvan section, infra.\n\nWe, therefore, hold that our Legislature intended the New Jersey RICO statute to be even broader in scope than the federal statute. A narrow construction of the enterprise element would not, therefore, be consistent with this legislative intent. Imposing a requirement that there be evidence of a strict and ascertainable underlying structure, and limiting the scope of a RICO enterprise to groups that serve a function beyond that which is necessary for commission of the predicate racketeering offenses, would erode the enlarged, and we believe intended, purposes of New Jersey RICO and frustrate the very purpose for which it was enacted. A narrow construction of the enterprise element would be inconsistent with the purpose of New Jersey RICO, which broadly targets organized crime \"type\" activities in all its forms. Therefore, in our view, all that is required to satisfy the New Jersey RICO enterprise element is a group of people, however loosely associated, whose existence provides the common purpose of committing two or more predicate acts.\n\nIn United States v. Bagaric, supra, the court noted that \"the nature of the misconduct often provides the best clue toward defining the enterprise . . . . [I]t is logical to characterize any associative group in terms of what it does, rather than by abstract analysis of its structure.\" 706 F. 2d at 55-56. In the present case, we are presented with a somewhat disorganized group of individuals. They had no real \"leader\" as that term is commonly understood; there was no one to whom all members owed allegiance, or to whom all members are required to report. In fact, the group's members did not even seem to like each other, and were often engaged in double-dealing and back-stabbing. However, they deliberately associated themselves with one another in order to make money from illegal dumping. To accomplish this objective, they collectively agreed to take part in a number of criminal activities, including money laundering, forgery, theft of services, and bribery.\n\nThis group's corrupting influence is no less a threat to society, and its members no less deserving of heightened RICO punishment, than any slick \"organized\" crime group of the traditional \"command system of a Mafia family . . . .\" U.S. v. Bledsoe, supra, 674 F. 2d at 665. Its members should not be allowed to escape harsher RICO penalties simply because they lacked the management skills or ambition to raise the group to a higher and more organized realm of criminality. Nor should internal friction caused by individual greed be a bar to the Statute's application.\n\nB. MULTIPLE CONSPIRACIES AS SINGLE ENTERPRISE\n\nBassi also argues that he and other defendants were interested solely in their own economic well-being, and that each acted on his own behalf rather than on behalf of an \"enterprise.\" Defendant argues that, at best, the State's evidence proved the existence of multiple conspiracies, but not the single unified conspiracy that was charged in the indictment. This variance between the indictment and the proofs is alleged to have prejudiced defendant's rights. See Kotteakos v. United States, 328 U.S. 750, 66 S. Ct. 1239, 90 L. Ed. 1557 (1946).\n\nThis argument is not persuasive. The evidence indicated that each defendant shared the common goal of making a profit from the illegal disposal of solid waste in New Jersey. In order to achieve this goal, it was necessary for each member of the enterprise to participate in his own unique way. Bassi and Harvan set up the dumps, Mocco, Dulanie and Hurtuk protected the North Bergen dumps, Ball and other haulers disposed of the solid waste from New York and fueled the operation with cash payments. Nicholas Zimbardi (a severed codefendant) helped to launder the money taken in by the enterprise, and Michael Baglino (another severed codefendant) and other checkers kept a daily log of the dumping operations.\n\nAlthough each defendant may have been primarily concerned with his portion of the operation and his share of the profit, it is\n\nclear from the evidence that everyone's profit was dependent on a cooperative effort to keep the enterprise and its illegal dumping operation an ongoing concern. To this extent, defendants shared a common goal and purpose and agreed to participate in one RICO conspiracy.\n\nWhether the evidence in a particular case establishes single or multiple conspiracies is generally a question of fact to be resolved by the jury. E.g., United States v. Friedman, 854 F. 2d 535, 561 (2d Cir.1988), cert. denied, 490 U.S. 1004, 109 S. Ct. 1637, 104 L. Ed. 2d 153 (1989). In this case, the evidence was sufficient to support the jury's Conclusion that the State had proven defendant's membership in the single RICO conspiracy charged in the indictment. United States v. Heinemann, 801 F. 2d 86, 92 (2d Cir.1986) (proof that conspirators agreed on a common purpose sufficient to render their activities a single enterprise).\n\nFurthermore, as noted in United States v. Riccobene, \"a series of agreements that under pre-RICO law would constitute multiple conspiracies could under RICO be tried as a single 'enterprise' conspiracy\" if the defendants have agreed to commit a substantive RICO offense. Riccobene, 709 F. 2d at 224-25 (quoting United States v. Sutherland, 656 F. 2d 1181, 1192 (5th Cir.1981)), cert. denied, 455 U.S. 949, 102 S. Ct. 1451, 71 L. Ed. 2d 663 (1982) (emphasis added). See also United States v. Jannotti, supra, 729 F. 2d at 230 (the gravamen of a RICO offense is not conspiracy to commit the individual predicate acts, but a conspiracy to participate in the enterprise's affairs through pattern of racketeering activity).\n\nAdditionally, the Riccobene Court noted that:\n\nProof of agreement in a RICO proceeding may be established by circumstantial evidence to the same extent permitted in traditional conspiracy cases. It is well established that one conspirator need not know the identities of all his coconspirators, nor be aware of all the details of the conspiracy in order to be found to have agreed to have participated in it. Blumenthal v. United States, 332 U.S. 539, 68 S. Ct. 248, 92 L. Ed. 154 (1947); United States v. Simmons, 679 F. 2d 1042, 1050 (3d Cir.1982); United States v. Boyd, 595 F. 2d 120 (3d Cir.1978).\n\n[709 F. 2d at 225.]\n\nThe same holds true under traditional New Jersey conspiracy law. There is no requirement that a coconspirator have knowledge of all aspects of a conspiracy or knowledge of all participants. See State v. Carbone, 10 N.J. 329, 338, 91 A.2d 571 (1952); N.J.S.A. 2C:5-2b.\n\nAccordingly, it does not follow that because the same defendants were not involved in every aspect of the operation, or that all defendants did not have direct contact with each other, that there was not one conspiracy or RICO enterprise in which all defendants participated. For purposes of a RICO conspiracy, it is irrelevant whether each defendant participated in the enterprise's affairs through different and unrelated crimes, so long as the jury may reasonably infer that each crime was intended to further the enterprise's affairs. United States v. Elliot, 571 F. 2d 880, 898-902 (5th Cir.) (jury is entitled to infer the existence of an enterprise on the basis of largely or wholly circumstantial evidence since a RICO enterprise cannot be expected to maintain a high profile, its affairs are conducted in secrecy and involve a minimal amount of necessary contact among participants), cert. denied sub nom., Hawkins v. United States, 439 U.S. 953, 99 S. Ct. 349, 58 L. Ed. 2d 344 (1978). See also United States v. Eufrasio, 935 F. 2d 553, 557 n. 29 (3d Cir.) cert. denied sub nom.; Idone v. United States, U.S. , 112 S. Ct. 340, 116 L. Ed. 2d 280 (1991) (there is no requirement that a RICO conspirator be involved in all aspects of the conspiracy, or have knowledge of all its participants); United States v. Campione, 942 F. 2d 429, 436 (7th Cir.1991) (fact that defendants participated in different predicate acts does not mean that they cannot be convicted of participating in the same RICO conspiracy); United States v. Boylan, 898 F. 2d 230, 240-42 (1st Cir.1990) (RICO conspiracy does not require total fusion of all defendants in all predicate acts, or that defendants know of entire scheme or be acquainted with all other defendants); United States v. Friedman, 854 F. 2d 535, 562 (2d Cir.1988) cert. denied, 490 U.S. 1004, 109 S. Ct. 1637, 104 L. Ed. 2d 153 (1989) (single RICO conspiracy\n\ndoes not become multiple conspiracy simply by change of membership, or shifting emphasis on locale of operations, and there is no requirement each member of conspiracy conspire directly with other members).\n\nIn United States v. Pungitore, 910 F. 2d 1084 (3d Cir.1990), cert. denied, U.S. , 111 S. Ct. 2010, 114 L. Ed. 2d 98 (1991), the court found no error in a disputed portion of the trial court's charge regarding RICO coconspirator liability. In Pungitore, the court likened a RICO conspiracy to a train \"where one party knowingly steps on board that train he's part of the crew, knowingly now. He becomes a part of the crew and assumes conspirators' responsibility for the existing freight or conduct, regardless of whether he is aware of just what it is composed of.\" Id. at 1146.\n\nThis analogy is apt in the instant case. Although each individual defendant may not have been aware of the full scope of the enterprise's activities, each knew that its business was the illegal dumping of solid waste for profit, and each knowingly \"stepped on board the train\" and performed his job on behalf of the enterprise and in furtherance of its illegal purpose, for his own gain. Implicit in defendants' actions was a common agreement to commit the substantive RICO offense; i.e., to participate in the affairs of the enterprise (illegal dumping) through a pattern of racketeering activity: bribery of public officials, fraudulent submission of forms at the HMDC baler, theft of services at the baler, and money laundering. Here, the varied activities of the defendants constituted a cooperative effort toward the common goal of the enterprise.\n\nMICHAEL HARVAN\n\nA. ENTERPRISE ELEMENT -- COMMON PURPOSE\n\nDefendant Harvan separately contends that the trial court improperly instructed the jury on the definition of a RICO enterprise. Specifically, he argues the Judge failed to charge the jury\n\nthat in order to find the existence of an enterprise, they must find that its associates had a \"common purpose.\" Defendant contends that this omission unconstitutionally diminished the State's burden of proving every element of the RICO offense beyond a reasonable doubt. Since defendant made no objection to the jury charge below, this issue is raised as plain error, that is \"error possessing a clear capacity to bring about an unjust result.\" State v. Irving, 114 N.J. 427, 444, 555 A.2d 575 (1989). The State contends that the RICO instructions, when considered as a whole, were proper and did not constitute plain error. We agree.\n\nIt is axiomatic that appropriate jury instructions are essential for a fair trial. State v. Clausell, 121 N.J. 298, 330, 580 A.2d 221 (1990); State v. Collier, 90 N.J. 117, 122, 447 A.2d 168 (1982). Although a party is not entitled to a charge in his own words, he is entitled to a charge which fully, clearly, and as accurately as possible sets forth the fundamental issues. State v. Labrutto, 114 N.J. 187, 204, 553 A.2d 335 (1989); State v. Green, 86 N.J. 281, 288-89, 430 A.2d 914 (1981). \"The test is to examine the charge in its entirety, to ascertain whether it is either ambiguous and misleading or fairly sets forth the controlling legal principles relevant to the facts of the case.\" State v. Labrutto, supra, 114 N.J. at 204, 553 A.2d 335. Significantly, we note that within the context of the trial, counsel did not consider these alleged \"errors\" to be of sufficient importance to object. State v. Macon, 57 N.J. 325, 333, 273 A.2d 1 (1971).\n\nThe State in a RICO case must prove both the existence of an enterprise and a connected pattern of racketeering activity. As previously stated, an enterprise is a group of people, however loosely associated, whose existence provides the common purpose of committing two or more predicate acts.\n\nThe court here charged the jury as follows with respect to the \"enterprise\" element of RICO:\n\nThe State contends that the defendants named in the Indictment did constitute an enterprise, that is a group of persons including individuals and corporations associated in fact as an enterprise which engaged in the unlawful disposal of solid waste within New Jersey as set forth in the Indictment.\n\nThe statute defines an enterprise as including any individual, sole proprietorship, partnership, corporation, association or other legal entity. And enterprise also includes legal as well as illegal entities.\n\nTo find that an enterprise existed, you must find: (1) an organization, formal or informal, which was ongoing; (2) in which the various associates functioned as a continuing unit; and (3) which existed separate and apart from the pattern of racketeering acts in which the various associates engaged.\n\nSupporting the existence of an ongoing organization would be evidence that the group had some structure for making decisions and some mechanisms for controlling its own affairs on an ongoing basis.\n\nSupporting the requirement that various associates functioned together as a continuing unit would be evidence that the associates performed roles which fit the structure of the group and furthered its aims and activities. The fact that some members of the group leave and others join the enterprise does not necessarily disprove the existence of an enterprise. However, the group must have an existence beyond what is necessary to merely commit the racketeering acts.\n\n[Emphasis added.]\n\nThroughout the RICO charge, the Judge repeatedly instructed the jury that in order to find defendants guilty of a RICO violation, they had to be satisfied that the State proved beyond a reasonable doubt that an enterprise existed which was \"engaged in the unlawful disposal of solid waste within New Jersey.\"\n\nAlthough Judge Humphreys did not use the words \"common purpose\" or explicitly state that members of the enterprise were required to have such a purpose, the charge as a whole adequately conveyed this notion to the jury. Essentially, the Judge identified the \"common purpose\" of the enterprise and its members for the jury, i.e., the unlawful disposal of solid waste for profit, and properly instructed the jury that they should not return a guilty verdict unless they were convinced beyond a reasonable doubt that this common purpose existed. Thus, the jury was given a legally correct and adequate definition which conveyed the essential elements of a RICO \"enterprise.\" State v. Ramseur, 106 N.J. 123, 280, 524 A.2d 188 (1987); State v. Wilbely, 63 N.J. 420, 422, 307 A.2d 608 (1973) (appellate review of jury charge requires examination of the charge as whole rather than selected portions).\n\nRelying on State v. Weeks, 107 N.J. 396, 405, 526 A.2d 1077 (1987), defendant argues that in other instances where the State is\n\nrequired to prove a common purpose, such as accomplice liability, the failure to so instruct the jury has resulted in reversal of the conviction. In Weeks, the instruction did not clearly require the jury to find that defendant shared the purpose to commit robbery with a weapon. Ibid. The Court was therefore primarily concerned with the need to \"carefully impart to the jury the distinction between the specific intent required for the grades of the offense.\" Id. at 410, 526 A.2d 1077 (emphasis added).\n\nIn citing to Weeks, defendant is confusing two different concepts. In accomplice liability, the accomplice must share the same intent or culpable mental state required to be proven against the actual perpetrator. State v. Madden, 61 N.J. 377, 396-97, 294 A.2d 609 (1972). See also State v. Sims, 140 N.J. Super. 164, 174-75, 355 A.2d 695 (App.Div.1976) (reversible error where jury was not instructed that alleged accomplice to attempted murder must possess the same intent as the murderer).\n\nThe concept of a \"common purpose\" in the context of the racketeering statute is not equivalent to an individual's specific culpable mental state or intent. Instead, it relates to a characteristic of the enterprise. It is their unlawful participation in the enterprise which provides evidence that defendants' association was more than merely incidental, and which justifies prosecution under RICO.\n\nHere the jury was told it was required to find that an enterprise existed for the purpose of engaging in the disposal of solid waste, whose associates formed an ongoing organization, and who functioned together as a continuing unit. This instruction adequately conveyed the notion that there must be a community of purpose among the members of the enterprise. Defendant's allegation of plain error in the charge is rejected.\n\nB. \" PATTERN OF RACKETEERING ACTIVITY\" -- NEW JERSEY RICO NOT UNCONSTITUTIONALLY VAGUE\n\nDefendant Michael Harvan argues that N.J.S.A. 2C:41-1 is unconstitutionally vague. Specifically, he contends that the\n\nterm \"pattern of racketeering activity\" in the statute does not adequately specify the proscribed conduct. Defendant also did not raise this point below, so it too must be considered on the basis of plain error, that is, \"error possessing a clear capacity to bring about an unjust result.\" State v. Irving, supra, 114 N.J. at 444, 555 A.2d 575.\n\nThe State argues that New Jersey RICO contains a more specific definition of the term \"pattern of racketeering activity\" than its federal counterpart. Thus, any constitutional infirmity in the federal statute based on vagueness would be inapplicable to New Jersey RICO.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e We agree with this assessment.\n\nThe void-for-vagueness doctrine recognizes that a law must be clear enough to provide fair notice of what is forbidden. Matter of C.V.S. Pharmacy Wayne, 116 N.J. 490, 500, 561 A.2d 1160 (1989), cert. denied sub nom., Consumer Value Stores v. Board of Pharmacy of New Jersey, 493 U.S. 1045, 110 S. Ct. 841, 107 L. Ed. 2d 836 (1990); State v. Norflett, 67 N.J. 268, 283, 337 A.2d 609 (1975). The test is whether the statute is so vague that a person could not reasonably understand that his conduct is prohibited. Palmer v. City of Euclid, 402 U.S. 544, 545, 91 S. Ct. 1563, 1564, 29 L. Ed. 2d 98, 100 (1971); State v. Cameron, 100 N.J. 586, 593, 498 A.2d 1217 (1985).\n\nUnder Federal RICO, 18 U.S.C.A. § 1961(5):\n\n\"pattern of racketeering activity\" requires at least two acts of racketeering activity, one of which occurred after the effective date of this chapter and the last of which occurred within ten years . . . after the commission of a prior act of racketeering activity;\n\nPursuant to N.J.S.A. 2C:41-1d(1) and (2), the \"pattern\" element has two parts. It requires:\n\n(1) Engaging in at least two incidents of racketeering conduct one of which shall have occurred after the effective date of this act and the last of which shall have occurred within 10 years . . . after a prior incident of racketeering activity; and\n\n(2) A showing that the incidents of racketeering activity embrace criminal conduct that has either the same or similar purposes, results, participants or victims or methods of commission or are otherwise interrelated by distinguishing characteristics and are not isolated incidents.\n\nThere have been a multitude of \"vagueness\" challenges with respect to Federal RICO. Consistently, federal courts addressing this issue have concluded that RICO passes constitutional muster. See, e.g., United States v. Ruggiero, 726 F. 2d 913, 923 (2d Cir.), cert. denied sub nom., Rabito v. United States, 469 U.S. 831, 105 S. Ct. 118, 83 L. Ed. 2d 60 (1984); United States v. Martino, 648 F. 2d 367, 381 (5th Cir.1981), cert. denied sub nom., Russello v. United States, 456 U.S. 943, 102 S. Ct. 2006, 72 L. Ed. 2d 465 (1982); United States v. Boffa, 513 F. Supp. 444, 460-61 (D.C.Del.1980) (collecting federal decisions addressing this issue).\n\nSince New Jersey RICO gives greater definition to the \"pattern\" requirement, there is even less basis for finding the New Jersey statute unconstitutionally vague. This was the Conclusion reached in State v. Passante, 225 N.J. Super. 439, 446-48, 542 A.2d 952 (Law Div.1987) (holding that New Jersey's more precise definition of \"pattern\" element is neither vague nor overbroad); cf. Moorehead v. State, 383 So. 2d 629, 631 (Fla.1980) (holding that Florida RICO statute which, like New Jersey, defines \"pattern of racketeering activity\" to include interrelated incidents which are not isolated, is not unconstitutionally vague).\n\nIn any event, the Supreme Court, in H.J. Inc. v. Northwestern Bell Tel. Co., 492 U.S. 229, 235 n. 2, 109 S. Ct. 2893, 2898 n. 2, 106 L. Ed. 2d 195, 205 n. 2 (1989), ruled that the Federal RICO \"pattern\" element was not unconditionally vague. In doing so, it also held that the \"pattern\" requirement would be met by a showing that the predicate racketeering offenses were related, and that they \"amount to, or that they otherwise constitute a threat of, continuing racketeering activity.\" Id. at 239, 109 S. Ct. at 2900, 106 L. Ed. 2d at 208. Thus evolved the \"relationship plus continuity\" test which will be discussed infra under Public Employees, part B.\n\nIn addition to the more explicit language of our statute, the vagueness issue can also be met by analyzing the allegedly ambiguous terms in context of the subject case. Dealt with in that fashion, a defendant must establish that the statute could not reasonably be applied to his own conduct, rather than the conduct of some hypothetical defendant. This is the \"as-applied\" analysis which is sound as a matter of constitutional law. See Maynard v. Cartwright, 486 U.S. 356, 361, 108 S. Ct. 1853, 1857-58, 100 L. Ed. 2d 372, 380 (1988) (vagueness challenges which do not implicate first amendment rights may be Judged on an \"as-applied\" basis).\n\nSince Northwestern Bell, the First Circuit considered the vagueness issue but used an \"as-applied\" analysis to reject the notion that RICO's \"pattern\" requirement was unconstitutionally vague under the specific facts presented. In United States v. Angiulo, 897 F. 2d 1169, 1179-80 (1st Cir.1990), cert. denied, 498 U.S. 845, 111 S. Ct. 130, 112 L. Ed. 2d 98 (1990), defendants were convicted of participating in loansharking and other illegal activities of an organized crime family. Id. at 1179. The court succinctly stated the relevant test for constitutionality as follows:\n\n[F]or defendants' vagueness challenge to succeed, they must demonstrate that the meaning and scope of RICO's \"pattern\" element was unclear and vague as to their conduct at issue here. Phrased another way, they must show that persons of ordinary intelligence in their situation would not have had adequate notice that the gambling, loansharking and conspiracy offenses at issue here constituted a \"pattern of racketeering activity\" under RICO.\n\n[897 F. 2d at 1179.]\n\nAs in Angiulo, defendant Harvan has not made this showing. The incidents of racketeering activity at issue embraced criminal conduct that had the same purpose, the facilitation of illegal dumping in New Jersey for monetary profit, and were not merely isolated incidents. For example, submitting fraudulent forms at the HMDC baler to facilitate unauthorized dumping, bribing public officials to issue licenses and protect illegal dumping in North Bergen, and laundering money to pay expenses related to these activities, is the kind of conduct which Harvan, or any person of ordinary intelligence, could reasonably have understood as falling\n\nwithin a \"pattern of racketeering activity\" as defined in New Jersey's RICO statute.\n\nThus, even if one accepted the argument that New Jersey RICO may be constitutionally vague in some marginal situations, the facts in this case do not present such a situation. Defendant, a major player in the enterprise, reasonably should have known that various related criminal acts he committed to further the illegal goal of the enterprise constituted a \"pattern\" proscribed by the New Jersey statute. As in Angiulo, defendant's constitutional challenge can be rejected without reaching the precise question raised by Justice Scalia.\n\nIn any event, we conclude that the higher degree of specificity in the New Jersey RICO statute, as opposed to its Federal counterpart, renders defendant's claim of unconstitutional \"vagueness\" meritless.\n\nPATRICK BALL and BIG APPLE -- RICO\n\nA. THE ENTERPRISE ELEMENT AND ALLEGED FAILURE TO ADEQUATELY CHARGE THE GRAND JURY\n\nDefendants Patrick Ball and Big Apple argue that the grand jury received only the statutory definition of the term \"enterprise,\" which did not include refinements to that definition made by subsequent case law. Defendants contend that since the grand jury received \"no guidance with respect to this complex idea and its relationship to the facts of this case . . . it could not exercise its constitutional function and the indictment should have been dismissed.\"\n\nPrior to trial, codefendant Hurtuk moved to dismiss the indictment on the ground that the grand jury should have been informed that the \"enterprise must be separate and apart from the pattern of racketeering.\" All defendants joined in this motion. The prosecutor read to the jury the statutory definitions of \"enterprise\" and \"pattern of racketeering activity.\" Defendants\n\nconcede that \"all of the various statutes involved, including the definition of enterprise contained in the racketeering statute\", were read.\n\nThey argue, however, that due to the complex and evolving nature of RICO case law, the statutory definition did not include all the elements of an enterprise. Defendants have not identified what would have constituted sufficient instruction, they merely contend that the grand jury should have been instructed beyond reading the statute.\n\nDefendants rely principally on Crimmins v. Superior Court, 137 Ariz. 39, 668 P. 2d 882 (1983), where the Arizona Supreme Court directed the dismissal of an indictment for kidnapping because the prosecutor had not read to the grand jury the Arizona statutes allowing for citizens' arrest. This case does not support defendants' argument that the grand jury must be given legal instruction beyond the reading of relevant statutes. The issue in Crimmins was not whether the prosecutor explained the law, but whether he fully informed the grand jury of what the law was. In Crimmins, the prosecutor erred by failing to read all applicable statutes, including ones that were exculpatory under the facts. Here, all relevant statutes pertaining to the RICO charges were read, including the definitions of key terms. We, therefore, affirm the trial Judge's denial of defendants' motion to dismiss the indictment for the reasons expressed by our Supreme Court in State v. New Jersey Trade Waste Ass'n, 96 N.J. 8, 18-19, 472 A.2d 1050 (1984):\n\nWhether an indictment should be dismissed or quashed lies within the discretion of the trial court. Such discretion should not be exercised except on \"the clearest and plainest ground\" and an indictment should stand \"unless it is palpably defective.\" State v. Weleck, 10 N.J. 355, 364 [91 A.2d 751] (1952) (quoting State v. Davidson, 116 N.J.L. 325, 328 [184 A. 330] (Sup.Ct.1926), and State v. Russo, 6 N.J. Super. 250, 254 [71 A.2d 142] (App.Div.1950)); State v. Porro, 175 N.J. Super. 49, 51 [417 A.2d 573] (App.Div.1980). Similarly, if an indictment alleges all the essential facts of the crime, the charge is sufficiently stated and the indictment should not be dismissed unless its insufficiency is \"palpable.\" See State v. LaFera, 35 N.J. 75, 81 [171 A.2d 311] (1961); see generally R. 3:7-3 (requiring a written statement of the essential facts constituting the crime charged).\n\nSee also State v. Laws, 262 N.J. Super. 551, 563, 621 A.2d 526 (App.Div.1993), where we recently stated that:\n\nBecause of the non-adversarial nature of grand jury proceedings, however, incomplete or imprecise legal interpretations will not warrant dismissal of the indictment. State v. Schmidt, 213 N.J. Super. 576, 584, 517 A.2d 1226 (App.Div.1986), rev'd on other grounds, 110 N.J. 258, 540 A.2d 1256 (1988). Because an indictment should only be quashed on the \"clearest and plainest grounds,\" State v. Dixon, 125 N.J. 223, 237, 593 A.2d 266 (1991), the conduct of a prosecutor should not warrant dismissal unless it clearly invades the grand jury's decision-making function. State v. Schamberg, 146 N.J. Super. 559, 564, 370 A.2d 482 (App.Div.), certif. denied, 75 N.J. 10, 379 A.2d 241 (1977) (involving alleged prosecutorial misconduct before a grand jury).\n\nThe prosecutor's instruction to the grand jury was not an incorrect statement of the law, nor was it misleading. The time to consider the more detailed instructions suggested by defendants was during the adversarial stage of proceedings, following trial before a petit jury.\n\nHere, the jury's verdict, after appropriate instruction, represents a finding beyond reasonable doubt that defendants were guilty of the offense. Thus, even if the grand jury instructions were erroneous, the error was rendered harmless by the subsequent guilty verdict. Cf. United States v. Mechanik, 475 U.S. 66, 70, 106 S. Ct. 938, 941-42, 89 L. Ed. 2d 50, 56-58 (1986). In accord see State v. Lee, 211 N.J. Super. 590, 599-600, 512 A.2d 525 (App.Div.1986), where we held that procedural irregularities in a grand jury proceeding are rendered harmless where defendant is ultimately found guilty by petit jury.\n\nPATRICK BALL and BIG APPLE\n\nB. ENTERPRISE -- FAILURE OF PROOF\n\nDefendants Ball and Big Apple also appeal the denial of their motions for judgment of acquittal on the RICO counts. Specifically, they contend that the evidence did not establish the existence of the enterprise charged during the time set forth in the indictment, or that Ball had agreed to participate in the affairs of the enterprise through a \"pattern of racketeering activity.\" Ball and\n\nBig Apple were found guilty of engaging in a conspiracy to commit racketeering contrary to N.J.S.A. 2C:41-2d (count one) and acquitted of the substantive racketeering charges.\n\nThe standard to be applied by the trial Judge when considering such a R. 3:18-2 motion is, whether viewing the evidence in its entirety, be it direct or circumstantial, and giving the State the benefit of all of its favorable testimony as well as all favorable inferences therefrom, the evidence is sufficient to enable a jury to find that the State's charge has been established beyond a reasonable doubt. State v. Reyes, 50 N.J. 454, 458, 236 A.2d 385 (1967).\n\nIn denying defendants' motion, Judge Humphreys stated:\n\nBall and his company, Big Apple Leasing, are major solid waste haulers, or at least major in this case, who paid very large sums of money to Bassi and Harvan in order to ship solid waste materials from New York to the dumpsites in New Jersey. The evidence indicates that at one point Ball attempts to restart dumping operations in North Bergen by dealing directly with Hurtuk and through Hurtuk, with Mocco. In sum, the evidence is ample that Ball and his company were likewise at the core of this criminal Enterprise.\n\nThe evidence produced at trial amply supports this summary of the Ball and Big Apple involvement.\n\nDefendants argue that the evidence established the existence of three separate groups, and that each group was interested solely in its own activities. Bassi and Harvan comprised one group, the public officials comprised another separate group, and the waste haulers were another group with their own agenda, i.e. finding a place to dispose of their solid waste. Thus, there was no \"coherent 'enterprise'\" as exemplified by a \"Mafia-like\" structure. This argument is clearly without merit. The contention that the evidence did not establish a single unified RICO enterprise or conspiracy is addressed in the Bassi-RICO portion of this opinion.\n\nIn addition, defendants Ball and Big Apple argue that even if the three groups were a single RICO conspiracy at the outset, they did not remain linked by a common objective for the entire period set out in the indictment. Defendants claim that by early June, the situation began to deteriorate and the group had \"fragmented.\"\n\nThe closure of the North Bergen dumps undoubtedly created difficulties for the enterprise, and defendants correctly note that the evidence demonstrates a certain animosity among the group members. However, the evidence also demonstrates that in spite of problems caused by law enforcement investigation, defendants tried their best to continue business as usual. For example, Harvan and Bassi made substantial efforts to resume dumping in North Bergen after the closure of two landfill sites. At the same time, dumping at the HMDC baler continued unabated, and included defendants Ball and Big Apple. This evidence justifies the Conclusion that the conspiracy and the enterprise did not dissolve in June.\n\nC. RICO -- NO NEED TO PERSONALLY COMMIT ACTS\n\nDefendant Ball also contends that he cannot be convicted of participating in a RICO conspiracy because he did not agree to personally commit two or more predicate crimes. However, the majority of courts do not require agreement to personally commit two predicate acts. It is sufficient if defendant agreed that other members of the enterprise, such as Bassi, Harvan, or the public officials, would commit the predicate offenses on behalf of the conspiracy. United States v. Pryba, 900 F. 2d 748, 760 (4th Cir.), cert. denied, 498 U.S. 924, 111 S. Ct. 305, 112 L. Ed. 2d 258 (1990); United States v. Stern, 858 F. 2d 1241, 1246-47 (7th Cir.1988); United States v. Kragness, 830 F. 2d 842, 860 (8th Cir.1987); United States v. Joseph, 781 F. 2d 549, 554 (6th Cir.1986); United States v. Adams, 759 F. 2d 1099, 1116 (3d Cir.), cert. denied, 474 U.S. 971, 106 S. Ct. 336, 88 L. Ed. 2d 321 (1985); United States v. Tille, 729 F. 2d 615, 619 (9th Cir.), cert. denied, 469 U.S. 845, 105 S. Ct. 156, 83 L. Ed. 2d 93 (1984); United States v. Carter, 721 F. 2d 1514, 1528-31 (11th Cir.), cert. denied sub nom., Morris v. United States, 469 U.S. 819, 105 S. Ct. 89, 83 L. Ed. 2d 36 (1984).\n\nOnly two of the Federal Circuit Courts, the First and Second, require that defendant agree to personally commit at least two predicate acts. United States v. Ruggiero, 726 F. 2d 913, 921 (2d\n\nCir.), cert. denied sub nom., Rabito v. United States, 469 U.S. 831, 105 S. Ct. 118, 83 L. Ed. 2d 60 (1984); United States v. Winter, 663 F. 2d 1120, 1136 (1st Cir.1981), cert. denied, 460 U.S. 1011, 103 S. Ct. 1250, 75 L. Ed. 2d 479 (1983).\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nWe hold that the approach followed by the majority of the Federal Circuits favoring a broader application of the RICO conspiracy provision, is the better reasoned approach and the one, therefore, to adopt. It also coincides with our perception of the New Jersey legislative intent to extend the scope of our RICO Statute beyond that of the federal statute. In determining that personal commission of the predicate acts was not a requirement under Federal RICO, the Third Circuit was particularly impressed with the reasoning of the Court in United States v. Carter, supra, and adopted that reasoning as its own:\n\nAs the Eleventh Circuit noted, the statutory language itself does not require the personal commission of predicate offenses. \"When read together, the statutes speak only to 'conspiring to conduct or participate, directly or indirectly, in the conduct of such enterprise's affairs through a pattern of racketeering activity within at least ten years of each other.'\" . . . Moreover, requiring the government to prove that each defendant agreed to commit personally two predicate acts would severely dilute the effectiveness of the RICO conspiracy remedy, and thwart Congress' objectives in enacting those statutes.\n\n[ United States v. Adams, supra, 759 F. 2d at 1116 (citations omitted).]\n\nUnder the minority rule of the First and Second Circuits, a \"mob boss\" who is \"intimately involved in the conspiracy, [but who] neither agreed to personally commit nor actually participated in the commission of the predicate crimes\" would elude prosecution. United States v. Neapolitan, supra, 791 F. 2d at 496-97. This result is contrary to our Legislature's stated intent that RICO provide \"effective criminal and civil sanctions . . . to prevent,\n\ndisrupt and eliminate the infiltration of organized crime type activities\" within the state. N.J.S.A. 2C:41-1.1c.\n\nDefendants alternately argue that they were merely customers of the enterprise and that there was no evidence that they agreed to participate in the enterprise in any other capacity. We disagree. In this case, there was substantial evidence that Ball and Big Apple Leasing agreed to participate directly in the conduct of the affairs of the enterprise, and from which the jury could infer that Ball agreed that he, or members of the enterprise, would commit at least two predicate acts. We note that when Harvan and Bassi failed to resume dumping in North Bergen in early June, Ball attempted to take over the Bassi/Harvan managerial role and restart dumping operations himself.\n\nBy way of further example, on July 12, 1986, Hurtuk spoke to a severed codefendant, Michael Baglino (truck checker), and advised him that he was going to meet with Mocco about restarting the dumping in North Bergen. Baglino told Hurtuk that Ball had been calling for him, but Hurtuk said that there was nothing to talk about until he saw Mocco. A short time later, Baglino told Ball that Hurtuk was with the \"big guy\" at the moment, to determine if Ball could \"run . . . tomorrow night.\" When he had not heard from Hurtuk later, Ball told Baglino that he had moved equipment onto the proposed site so he wanted to get it in operation. Ball said, \"I could do a lot [of] nice things for everybody, everybody can help me, I can help them.\" Ball said he had two people \"in the city\" \"so jammed up with material, that . . . the city's gonna close down their yard.\"\n\nDuring a conversation on July 14, Baglino told Ball that Hurtuk \"wants to get going,\" and Ball said he had to know that day whether there was a deal. A short time later, Ball called Hurtuk at town hall and Hurtuk agreed to meet Ball at 9 p.m. After meeting with Ball, Hurtuk told Baglino that Ball \"didn't do the right thing\" and that Baglino had better talk to Ball and \"tell him the big guy is very upset.\" Apparently Ball gave Hurtuk a $300 license fee in an attempt to get a permit to dump, but would not\n\ngive Hurtuk any more money in order to actually receive the permit.\n\nAs of July 17, the issue had still not been settled. Baglino told Ball that Hurtuk claimed \"he had [an] . . . agreement with you guys that . . . before you guys start . . . rollin' you're supposed to come up with something.\" Ball denied that there was such an agreement. Baglino also informed Ball that Hurtuk said Ball had not shown \"good faith\" for two nights of dumping that Ball had been given. Ball claimed that he did, and threatened to take his equipment from the site and \"go about [his] business.\" Hurtuk later told Baglino to relate to Ball that he wanted \"two weeks in advance\" by the next day or he would \"pull everything away.\" On July 25, Ball told Baglino that he needed to see Hurtuk to get \"those papers.\" Hurtuk asked Baglino to tell Ball that he could not get the papers by the next day, and Baglino related this to Ball. Ball said, \"[w]e got to start Monday night without fail.\"\n\nFrom these conversations, a reasonable jury could find that Ball had offered a bribe to Mocco (though Hurtuk) in order to receive a North Bergen license to dump solid waste. It could also be inferred that Ball's involvement in the enterprise extended beyond that of a customer.\n\nThe predicate acts in this RICO conspiracy included not only bribery, but also money laundering, forging waste origin forms at the HMDC baler, and theft of services from the HMDC baler. These acts were a necessary part of the enterprise's activities; without the money laundering activity, the bribes, etc., there would be no enterprise from which Ball could profit. A jury could infer from the evidence of Ball and Big Apple's involvement in the affairs of the enterprise, including their disguising of truck identity, that they conspired to join the group, knowing the nature and scope of its activities, and agreed that various members would commit at least two predicate acts which formed a \"pattern of racketeering activity\" as defined under the New Jersey RICO statute. See N.J.S.A. 2C:41-1d.\n\nPATRICK BALL and BIG APPLE\n\nD. FAILURE TO SPECIFY INTENT IN INDICTMENT\n\nDefendants Ball and Big Apple Leasing contend that the court erred in failing to dismiss certain counts of the indictment which were alleged to be fatally deficient because they did not specify the requisite mental elements.\n\nDefendants argue that counts one (racketeering conspiracy), two (racketeering), six and twelve (bribery), and eighty-seven through ninety-one (tampering with public records), failed to specify the requisite mental state required for the offenses charged. Defendants moved to dismiss these counts prior to trial, arguing that such omission rendered the counts fatally deficient. The Judge denied the motion, ruling that the indictment as a whole fully apprised defendants of the crimes with which they were charged. We agree.\n\nIt is well-settled that \"judicial power to dismiss an indictment is not to be exercised except on the clearest and plainest grounds and that an indictment should stand unless manifestly deficient or palpably defective.\" State v. Ramseur, 106 N.J. 123, 232, 524 A.2d 188 (1987) (citing State v. Wein, 80 N.J. 491, 501, 404 A.2d 302 (1979)); State v. Weleck, 10 N.J. 355, 364, 91 A.2d 751 (1952). An indictment is sufficient if it 1) adequately identifies and explains the criminal offense so that the accused can prepare a defense; 2) the language is sufficiently detailed to avoid the risk of double jeopardy; and 3) the language is specific enough to preclude the possibility that the petit jury will substitute an offense that is different from the crime which the grand jury considered and charged. Russell v. United States, 369 U.S. 749, 763-64, 82 S. Ct. 1038, 1047, 8 L. Ed. 2d 240, 250-51 (1962); State v. LeFurge, 101 N.J. 404, 415, 502 A.2d 35 (1986); See also State v. Wein, supra, 80 N.J. at 497, 404 A.2d 302; State v. Mancine, 241 N.J. Super. 166, 180, 574 A.2d 525 (App.Div.1990), aff'd in part, rev'd in part on other grounds, 124 N.J. 232, 590 A.2d 1107 (1991).\n\n1. Counts Two, Six, and Twelve.\n\nDefendants were ultimately acquitted of counts two, six and twelve. Thus, even if one could successfully argue error, it was harmless in this case.\n\nThe racketeering and bribery statutes upon which counts two, six and twelve were based do not contain a culpable mental state as one of the elements of the offense. Thus, it was not necessary to include a mental state as an element of the offense within the indictment. In any event, a person is held to be culpable if they acted knowingly by operation of N.J.S.A. 2C:2-2c(3), which provides, in pertinent part, that:\n\nAlthough no culpable mental state is expressly designated in a statute defining an offense, a culpable mental state may nevertheless be required for the commission of such offense, or with respect to some or all the material elements thereof, if the proscribed conduct necessarily involves such culpable mental state. A statute defining a crime, unless clearly indicating a legislative intent to impose strict liability should be construed as defining a crime with the culpability defined in paragraph b. (2) [knowingly] of this section . . . .\n\nParagraph b. (2) of N.J.S.A. 2C:2-2 provides:\n\nKnowingly. A person acts knowingly with respect to the nature of his conduct or the attendant circumstances if he is aware that his conduct is of that nature, or that such circumstances exist, or he is aware of a high probability of their existence. A person acts knowingly with respect to a result of his conduct if he is aware that it is practically certain that his conduct will cause such a result. \"Knowing,\" \"with knowledge\" or equivalent terms have the same meaning.\n\nThus, although the mental elements were not explicitly stated in the indictment, defendants were nonetheless presumptively subject to the culpability requirement of \"knowingly\" by virtue of this statute. See State v. Rovito, 99 N.J. 581, 586, 494 A.2d 309 (1985).\n\n2. Counts Eighty-Seven Through Ninety-One.\n\nCounts eighty-seven through ninety-one charged defendants with tampering with public records, i.e., presenting Origin-Waste Disposal forms to the Hackensack Meadowlands Development Commission \" knowing the said origin of solid waste to be false,\" and \"with the purpose that it be taken as a genuine part of the records\" of the HMDC (emphasis added). These counts were withdrawn by the State and never submitted to the petit jury for\n\nconsideration. Even if there was error with respect to these counts, they did not have the capacity to prejudice defendants.\n\nFurthermore, as is evident from the above cited language, defendants' contention that counts eighty-seven through ninety-one contained no culpable mental state is simply incorrect. The language explicitly cited \"knowing\" and \"purposeful\" conduct.\n\n3. Count One.\n\nBall and Big Apple were both found guilty of count one, conspiracy to commit racketeering. The indictment charged defendants with the following (emphasis supplied):\n\n[A]t the times and places herein specified, with the purpose of promoting and facilitating the commission of the crime of racketeering, did commit the crime of conspiracy, that is, the defendants and the unindicted co-conspirators agreed:\n\nA. That one or more of them would engage in conduct which would constitute the crime of racketeering; and\n\nB. That one or more of them would aid the others in the planning, solicitation and commission of the crime of racketeering, that is, that the defendants and the unindicted co-conspirators, being persons employed by and associated with an enterprise, which enterprise was engaged in and the activities of which affected trade or commerce, would conduct and participate, directly or indirectly, in the conduct of the enterprises [sic] affairs through a pattern of racketeering activity, in violation of N.J.S.A. 2C:41-2(c), all as hereinafter described.\n\nThe State argues that the language in the indictment explicitly contains the requisite mental state: the indictment charged that defendants acted \"with the purpose of promoting and facilitating the commission of the crime of racketeering\" (emphasis added). We agree.\n\nN.J.S.A. 2C:41-2d (RICO conspiracy) prohibits any person from conspiring, as defined by N.J.S.A. 2C:5-2, to violate the provisions of the racketeering law. With respect to the elements of conspiracy generally, N.J.S.A. 2C:5-2 provides that:\n\nA person is guilty of conspiracy with another person or persons to commit a crime if with the purpose of promoting or facilitating its commission he:\n\n(1) Agrees with such other person or persons that they or one or more of them will engage in conduct which constitutes such crime or an attempt or solicitation to commit such crime; or\n\n(2) Agrees to aid such other person or persons in the planning or commission of such crime or of an attempt or solicitation to commit such crime.\n\n[ N.J.S.A. 2C:5-2a(1) and (2) (emphasis added).]\n\nThus, the culpability required for conviction of conspiracy is purposeful conduct. E.g., State v. Bridges, 254 N.J. Super. 541, 562, 604 A.2d 131 (App.Div.1992). Count one tracks the language of N.J.S.A. 2C:5-2a, and clearly conveys the notion that defendants acted purposefully with respect to formulating a conspiratorial agreement to facilitate the crime of racketeering. Defendants contend that the word \"purpose\" in count one was merely used to introduce the object of the conspiratorial agreement, and was not intended to allege a mental state. However, we find this to be an unreasonable reading of the plain language. Moreover, this interpretation is not consistent with N.J.S.A. 2C:5-2a, supra, which contains language identical to that used in the indictment and which requires purposeful conduct.\n\nState v. Wein, supra, 80 N.J. 491, 404 A.2d 302 (1979), cited by defendants, actually supports the State's position. With respect to a charge of conspiracy to violate an obscenity statute, the Court found that the indictment adequately set forth the element of scienter by asserting a willful intent among the conspirators to sell obscene films. Id. at 498, 404 A.2d 302. The court found that the word \"willful\" sufficiently communicated to defendants a charge of intentional conspiracy, and that by its plainest implication the language connoted that defendants knew of the nature and character of the material conspired to be sold. Id. at 498-99, 404 A.2d 302. In the instant case, we believe the word \"purpose\" likewise sufficiently communicated to defendants a charge of intentional conspiratorial conduct.\n\nDefendants cite to cases for the proposition that failure to allege scienter is fatal to a federal racketeering indictment. Specifically, defendant cites, United States v. Pupo, 841 F. 2d 1235 (4th Cir.), cert. denied sub nom., Govantes v. United States, 488 U.S. 842, 109 S. Ct. 113, 102 L. Ed. 2d 87 (1988). However, this case addressed a violation of the Comprehensive Drug Abuse Prevention and Control Act of 1970, not the federal racketeering statute. Id. at 1237. The court held that counts charging defendant with\n\npossession with the intent to distribute, and actual distribution of cocaine, were deficient because they failed to allege elements of scienter expressly contained in the statute that describes the offense, or alternatively because they failed to use words of similar import. Id. at 1238-39 (emphasis added). Accord United States v. Wabaunsee, 528 F. 2d 1, 2-3 (7th Cir.1975); United States v. Beard, 414 F. 2d 1014, 1015-16 (3d Cir.1969). Such is not the case here.\n\nIn United States v. Hooker, 841 F. 2d 1225, 1227 (4th Cir.1988), also relied upon by defendants, the court held that a RICO indictment should have been dismissed for failure to allege that the enterprise had an effect on interstate commerce, an essential and express element of the offense. Here, counts two, six, and twelve related to statutes that did not expressly contain a scienter requirement as an element of the offense, and count one contained language that conveyed the required mental state of \"purposeful.\"\n\nIn sum, defendants' allegation of prejudicial error with respect to the sufficiency of certain counts of the indictment is without merit.\n\nE. PATTERN OF RACKETEERING ACTIVITY -- RELATEDNESS AND CONTINUITY\n\nIn a supplemental letter brief, Ball and Big Apple also argue that as a matter of law, the State failed to present sufficient evidence from which the jury could find, beyond a reasonable doubt, that they participated in the affairs of the enterprise through a pattern of racketeering activity. Reliance is placed principally on United States v. Pelullo, 964 F. 2d 193 (3d Cir.1992), and H.J. Inc. v. Northwestern Bell Telephone Co., 492 U.S. 229, 109 S. Ct. 2893, 106 L. Ed. 2d 195 (1989), both of which were decided after completion of the trial in this case, and which require \"relatedness\" among the predicate acts, as well as continuity.\n\nThe substantive law of racketeering and the import of the above cases regarding the \"pattern\" element has been discussed in the Bassi portion of this opinion. For the reasons previously set\n\nforth, the State's evidence was sufficient to withstand a motion for acquittal on the RICO offenses with respect to all defendants.\n\nBall and Big Apple also contend that the jury was not properly instructed on the law pertaining to the RICO \"pattern element.\" Defendants did not challenge the accuracy or adequacy of the instructions below; hence this issue is raised as plain error.\n\nAfter reviewing the Judge's charge, we find defendants' contention is without merit. The Judge charged the jury:\n\nActs do not constitute a pattern if they reflect merely isolated or sporadic activity. Rather, taken together, the acts must be related in some way and must reflect continuous activity during the period in which they were committed . . . . Evidence of continuous activity could be shown by the existence of a threat of an ongoing series of criminal violations over a significant period of time. You should consider the number of acts committed, the length of time during which they were committed, the similarity of the acts, the number of victims and any distinguishing characteristics of the acts.\n\nThis charge comported with the definition of a RICO \"pattern of racketeering\" pursuant to N.J.S.A. 2C:41-1d, and also incorporated the \"continuity\" requirement which we hold infra is not required under New Jersey RICO, but which is required under Federal RICO.\n\nFinally, defendants Ball and Big Apple, joined by the public official defendants, seek reversal of their guilty convictions on the RICO charges based upon the recent United States Supreme Court decision of Reves v. Ernst \u0026 Young, U.S. , 113 S. Ct. 1163, 122 L. Ed. 2d 525 (1993). There the Supreme Court affirmed the Eighth Circuit's affirmance of a District Court summary judgment dismissal of a RICO indictment against an accounting firm because liability under 18 U.S.C.A. § 1962(c) (the federal equivalent to our N.J.S.A. 2C:41-2c), requires \"participation in the operation or management of the enterprise itself.\" Id. at , 113 S. Ct. at 1168, 122 L. Ed. 2d at 540. Albeit such participation is not limited to \"upper management\" but may include \"lower-rung participants in the enterprises who are under the direction of upper management.\"\n\nThus, defendants Ball and Big Apple argue that they, as simply \"customer[s] of the dumping operation\", played no role in the operation or management of the enterprises. However, these defendants all ignore the fact that they were convicted of conspiracy to commit racketeering, contrary to N.J.S.A. 2C:41-2d which makes it \"unlawful . . . to conspire as defined by N.J.S.A. 2C:5-2 to violate any of the provisions of this section\" [the RICO Act]. Thus, under the conspiracy theory, it was only necessary for a defendant to have agreed with another \"that they or one or more of them will engage in conduct which constitutes such crime . . .\" See U.S. v. Neapolitan, 791 F. 2d 489, 494-498 (7th Cir.1986), which held, relying on the majority view of Circuit opinions and most particularly U.S. v. Carter, 721 F. 2d 1514 (11th Cir.), cert. denied sub nom, Morris v. U.S., 469 U.S. 819, 105 S. Ct. 89, 83 L. Ed. 2d 36 (1984) that traditional conspiracy law applies to RICO.\n\nMoreover, even if the State was required to show participation, there was ample evidence to conclude such participation existed.\n\nPUBLIC EMPLOYEES\n\nDefendants Hurtuk, Dulanie, and Mocco were also charged in count one with conspiring to violate New Jersey RICO, N.J.S.A. 2C:41-2d, and in count two with substantive RICO violations, N.J.S.A. 2C:41-1c. The jury returned a verdict of guilty only with respect to the conspiracy count.\n\nThese defendants moved for judgment of acquittal on the RICO counts at the close of the State's case pursuant to R. 3:18-2. In post-trial motions, they again moved for acquittal or alternatively for a new trial pursuant to R. 3:20-1. The principal grounds were that the verdicts were against the weight of the evidence, were the product of passion or prejudice, or were a mistake as a matter of law. The court denied all motions. While it is not clear from the public defendants' brief whether they are appealing from the denial of one or both motions, we will review the issues in the context of both denials.\n\nDefendants argued below that the State's evidence was insufficient to establish the elements of a RICO conspiracy or of a RICO enterprise. As an offshoot of this argument, they claimed that the court erred in charging the jury on conspiracy to commit racketeering and substantive racketeering in the face of insufficient evidence. The instructions were alleged to have resulted in a compromise verdict. These issues are raised once again on this appeal.\n\nBriefly, we again state that the standard to be applied by the trial Judge when considering a R. 3:18-2 motion is whether, viewing the evidence in its entirety, be it direct or circumstantial, and giving the State the benefit of all of its favorable testimony as well as all favorable inferences therefrom, the evidence is sufficient to enable a jury to find that the State's charge has been established beyond a reasonable doubt. State v. Reyes, 50 N.J. 454, 458-59, 236 A.2d 385 (1967).\n\nWith respect to a motion for a new trial, the Judge may grant defendant's motion if required in the interest of Justice. R. 3:20-1. However, the Judge may not set aside the verdict of the jury as against the weight of the evidence unless, having given due regard to the jury's opportunity to assess the credibility of the witnesses, it clearly and convincingly appears that there was a manifest denial of Justice under the law. R. 3:20-1; Dolson v. Anastasia, 55 N.J. 2, 6-8, 258 A.2d 706 (1969).\n\nA. RICO-CONSPIRACY -- EXTENT OF AWARENESS AND PARTICIPATION REQUIRED\n\nDefendants first argue that they could not be found guilty of conspiracy to commit racketeering unless they were fully aware of the scope of the enterprise. This argument is without merit.\n\nTo prove a conspiracy to violate RICO under N.J.S.A. 2C:41-2d, the State must present evidence that defendant agreed to participate directly or indirectly in the conduct of the affairs of the enterprise by agreeing to commit, or agreeing that some other\n\nmembers of the conspiracy would commit, at least two racketeering acts. Defendants must have acted knowingly and purposely with knowledge of the unlawful objective of the conspiracy and with the intent to further its unlawful objective. Cf. United States v. Riccobene, 709 F. 2d 214, 224-25 (3d Cir.) cert. denied sub nom., Ciancaglini v. United States, 464 U.S. 849, 104 S. Ct. 157, 78 L. Ed. 2d 145 (1983) (construing parallel provision of Federal RICO). See also N.J.S.A. 2C:5-2 (New Jersey conspiracy law). The State's evidence was sufficient to allow the jury to conclude, beyond a reasonable doubt, that defendants were aware of the nature and scope of this enterprise which consisted of the illegal dumping of out-of-state solid waste for profit. Furthermore, the jury could have inferred from the evidence that defendants agreed that members of the enterprise would commit predicate acts in furtherance of this objective which constituted a pattern of racketeering activity.\n\nContrary to defendants' assertions, there is no necessity that a RICO conspirator be involved in all aspects of the conspiracy, or have knowledge of all its participants. As noted in United States v. Eufrasio, 935 F. 2d 553 (3d Cir.), cert. denied sub nom., Idone v. United States, U.S. , 112 S. Ct. 340, 116 L. Ed. 2d 280 (1991):\n\nIn order to establish a conspiracy to violate section 1962(c) [RICO conspiracy], 'the government must prove beyond a reasonable doubt that . . . the individuals knowingly agreed to participate in the enterprise through a pattern of racketeering activity.' . . . This association requirement insures \"that the government show, at a minimum, that the defendant was aware of the existence of a group of persons, organized into a structure of some sort, and engaged in ongoing activities, which the government can prove falls within the definition of an enterprise . . . . It is not necessary that a RICO defendant have \"specific knowledge of every member and component of the enterprise\"; rather \" it is sufficient that the defendant know the general nature of the enterprise and know that the enterprise extends beyond his individual role.\"\n\n[ Id. at 577 n. 29 (quoting United States v. Rastelli, 870 F. 2d 822, 827-28 (2d Cir.), cert. denied, 493 U.S. 982, 110 S. Ct. 515, 107 L. Ed. 2d 516 (1989) (citations omitted) (emphasis added).]\n\nSee also United States v. Campione, 942 F. 2d 429, 436 (7th Cir.1991) (fact that defendants participated in different predicate\n\nacts does not mean that they cannot be convicted of participating in the same RICO conspiracy); United States v. Boylan, 898 F. 2d 230, 241-42 (1st Cir.) cert. denied, 498 U.S. 849, 111 S. Ct. 139, 112 L. Ed. 2d 106 (1990), (RICO conspiracy does not require total fusion of all defendants in all predicate acts, or that defendants know of entire scheme or be acquainted with all other defendants).\n\nDefendants have attempted to characterize their involvement as \"mere assent to the commission of a predicate offense\" rather than assent to participation in the RICO enterprise. Assuming, arguendo, that this is a reasonable inference from the evidence, it is not the only reasonable inference. It is well-established that on a motion for acquittal the evidence must be viewed in the light most favorable to the State. The only issue is whether the State's evidence is sufficient to allow the jury to find defendants' guilt of the charge beyond a reasonable doubt. State v. Kluber, 130 N.J. Super. 336, 341-42, 327 A.2d 232 (App.Div.1974), certif. denied, 67 N.J. 72, 335 A.2d 25 (1975).\n\nHere the jury could reasonably have inferred from the evidence of defendants' involvement as protectors and facilitators of the illegal dumping in North Bergen that they were aware of the overall purpose of the enterprise, agreed to participate as active members, had a general understanding that the enterprise extended beyond their own role, and agreed that other members of the enterprise would commit illegal acts in furtherance of the enterprise's waste dumping business.\n\nFor example, Mocco, Hurtuk, and Dulanie's payments were dependent on a viable organization, i.e., one that was able to launder money to meet expenses, fraudulently obtain services at the HMDC baler to attract out-of-state waste haulers, illegally dump solid waste at various locations, and evade law enforcement scrutiny. Implicit in defendants' agreement to participate in the enterprise as \"protectors\" was their understanding that other members would be holding up their end of the operation through the commission of other unlawful acts. Otherwise, there would be nothing for defendants to protect.\n\nIt can be inferred, therefore, that the purpose and scope of the enterprise was known by defendants, even if all of the activities which supported that purpose were not known to each defendant individually. Additionally, although defendants may not have been aware of the details, they had to be aware that the enterprise extended beyond their own limited roles. Federal Courts have found this level of knowledge to be sufficient, and have upheld RICO conspiracy convictions under similar circumstances. E.g., United States v. Boylan, supra, 898 F. 2d at 241-42. We do so here.\n\nDefendants rely on United States v. Diecidue, 603 F. 2d 535 (5th Cir.1979), cert. denied sub nom., Gispert v. United States, 445 U.S. 946, 100 S. Ct. 1345, 63 L. Ed. 2d 781 (1980), where a RICO conspiracy conviction was reversed as to one defendant based on the Government's failure to establish he had knowledge of his codefendants' activities. That case is distinguishable. In Diecidue, there was no evidence that defendant knew the enterprises were engaged in contract murders, a proven purpose of the enterprise, or that dealing in drugs was part of that enterprise's activity. Id. at 556. The court determined that without evidence that defendant \"knew something about his co-defendants' related activities\" he could not be convicted of conspiring to engage in a pattern of racketeering. Ibid.\n\nIn the instant case, the enterprise was not alleged to be engaged in multiple rackets or to exist for multiple purposes, as was the enterprise in Diecidue. The sole purpose of the enterprise was to facilitate the illegal dumping of solid waste for profit. It can be inferred from the State's evidence that defendants were familiar with dumping operations in North Bergen, managed by Bassi and Harvan, and were aware that the enterprise they agreed to join was in the business of illegally disposing of out-of-state solid waste for profit.\n\nDefendants also place reliance United States v. Wexler, 838 F. 2d 88, 91-92 (3d Cir.1988), urging that a conspiracy conviction may not stand where defendant is not proven to have had knowledge of\n\nthe illegal objective contemplated by the conspiracy. Such clearly was not the case here.\n\nDefendant Mocco contends (defendants Hurtuk and Dulanie do not join in the argument) that there was no evidence that he was either a member of the conspiracy or was employed or associated with the alleged enterprise. We disagree. Judge Humphreys, in his opinion denying defendants' motion for acquittal, thoroughly detailed the State's evidence against Mocco, which he characterized as \"both considerable\" and \"substantial\":\n\nThe recorded conversations, taken in context with the expense sheets and the actions and statements of the conspirators, demonstrate the existence of an influential local official in North Bergen, the Big Guy or Top Guy, who is able to control and influence other Town Officials and thereby protect and allow this major criminal Enterprise to continue. Mocco was the Township Clerk and the leader of the political faction then in control of North Bergen government. See as evidence of this State's Exhibits S-19; S-33 S-52; S-71; S-76; S-77; S-80; and S-85. As to S-19, see page 3. As to S-33, see page 1. As to S-52, see page 1. As to S-71, see page 5. As to S-76, see page 1. As to S-77, see page 1. As to S-80, see page 1. And see S-85 in its entirety.\n\nThe evidence further indicates that Mocco also had and exercised strong control over Municipal officials, including Hurtuk. See the aforementioned exhibits. See also, for example, State's Exhibit S-116, pages 5, 6, and 24. See also State's Exhibit 117-H, pages 18 and 24, and S-117F, at page 6. Mocco demonstrated considerable familiarity with illegal dumping sites in North Bergen. He told State Investigators that Hurtuk and others were issuing summonses to illegal dumpers, prosecuting those summonses in the North Bergen Municipal Court, stopping and closing down illegal dumping operations in North Bergen. See in particular State's Exhibits 116C and 117D and the State's Exhibits cited previously.\n\nFurthermore, Hurtuk was, according to Mocco, \"familiar\" with \"all\" of the dump sites. See S-117D, page 24.\n\nAs this Court said in an earlier opinion with respect to the admission of statements by Mr. LoMuscio, \"The State's evidence indicates that Bassi and Harvan had a massive illegal dumping operation in North Bergen. That evidence indicated that a host of trucks day after day, night after night, streamed over from New York for many months and dumped enormous quantities of solid waste at illegal dump sites in North Bergen operated by Bassi and Harvan.\" . . . It seems highly unlikely that such major dumping activity could take place in North Bergen and persist for months without Mocco, the Township Clerk, Mocco the superior of Hurtuk, knowing about this illegal Enterprise.\n\nAs to Mocco's identity as the Big Guy, in two of the recorded conversations at least, Mocco is specifically referred to by name as the Big Guy. See S-76 and S-77. In other recorded conversations between the conspirators, reason and common sense would enable a trier of fact to readily identify Mocco as the Big Guy.\n\nRecorded conversations between State Investigators and Mocco, and State Investigators and Hurtuk also support the State's contention that Mocco was attempting to mislead and confuse the State's Investigators, what has been colorfully referred to as the old razzle dazzle . . . .\n\nFurther, the evidence indicates that Hurtuk was operating at the direction and under the control of Mocco . . . . This leadership role of Mocco over other Municipal Officials is shown by Mocco's own words in his recorded conversations with State Investigators. See, for example, S-116C and S-117D.\n\nGiving the State the benefit of all the reasonable inferences, the favorable testimony, and the inferences therefrom, the court finds the jury could find beyond a reasonable doubt that Mocco is a participant in the Enterprise, is a member thereof, and that he agreed to the Enterprise's engaging in a pattern of racketeering and that he profited thereby through bribes paid to him and to other Municipal Officials so that the criminal dumping enterprise could thrive and prosper in North Bergen.\n\nThe trial court's finding that the evidence was sufficient to allow the jury to find that Mocco was a knowing member of the conspiracy, who agreed to participate in the affairs of the enterprise through a pattern of racketeering activity was amply supported by the evidence.\n\nIn sum, the State's evidence, when viewed with all reasonable inferences drawn in its favor, was sufficient to allow the jury to find all the elements of a RICO conspiracy. Accordingly, the jury's finding of guilt on this count was not manifestly unjust in light of all of the evidence presented at trial.\n\nB. PATTERN OF RACKETEERING ACTIVITY -- NO NECESSITY FOR CONTINUITY\n\nIn a supplemental letter brief, the public defendants argue that the State's evidence failed to establish a \"pattern of racketeering activity.\" They contend that the \"pattern\" element of the New Jersey RICO statute should be construed in the same manner as its federal counterpart. Proof of a pattern of racketeering activity under Federal RICO requires evidence that the racketeering acts were related and constituted a threat of continued activity. See Northwestern Bell, supra, 492 U.S. at 239, 109 S. Ct. at 2900, 106 L. Ed. 2d at 208.\n\nThe State disputes defendants' contentions that New Jersey RICO requires proof of continued activity. Alternatively, it argues that even if required, continuity was established by the evidence. We agree with both positions taken by the State.\n\nFederal RICO, 18 U.S.C.A. § 1961(5), provides that a \"pattern of racketeering activity\":\n\nrequires at least two acts of racketeering activity, one of which occurred after the effective date of this chapter and the last of which occurred within ten years (excluding any period of imprisonment) after the commission of the prior act of racketeering activity.\n\nIn Sedima, S.P.R.L. v. Imrex Co., 473 U.S. 479, 496 n. 14, 105 S. Ct. 3275, 3285 n. 14, 87 L. Ed. 2d 346, 358 n. 14 (1985), the Supreme Court hinted that while two predicate acts were necessary, they may not be sufficient. Consequently, there developed a split of authority over what constituted a RICO pattern. Some Federal Circuits held that a pattern could be established by evidence that defendant performed any two predicate acts. See Superior Oil Co. v. Fulmer, 785 F. 2d 252, 255-56 (8th Cir.1986). Other Circuits resorted to more elaborate tests in response to Sedima 's suggestion that two predicate acts may not suffice. See Brandenburg v. Seidel, 859 F. 2d 1179, 1185 (4th Cir.1988) (identifying numerous factors in determining existence of a RICO pattern such as the number and variety of predicate acts, length of time over which committed, number of victims, whether there were separate schemes and distinct injuries).\n\nIn Northwestern Bell, supra, the Supreme Court undertook the task of resolving the split among the Circuits, and offered guidance on the \"pattern\" element of RICO. This resulted in the \"relationship plus continuity\" test wherein the Government must show that the predicate racketeering acts are related, and that they \"amount to or pose a significant threat of continued criminal activity.\" Northwestern Bell, supra, 492 U.S. at 239, 109 S. Ct. at\n\n2900, 106 L. Ed. 2d at 208.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nTwo state courts that have considered the continuity issue with respect to their own Little RICO statutes have concluded that their state racketeering laws, while requiring a relationship between or among racketeering acts, do not require continuity. Dover v. State, 192 Ga.App. 429, 385 S.E. 2d 417, 420-21 (1989); Computer Concepts Inc. v. Brandt, 310 Or. 706, 801 P. 2d 800, 807-09 (1990).\n\nIn Computer Concepts Inc., the Oregon Supreme Court noted that in its RICO statute, the term \"pattern of racketeering activity\" is specifically defined. ORS 166.715(4) describes criminal acts as \"activit[ies] that have the same or similar intents, results, accomplices, victims, or methods of commission or otherwise are interrelated by distinguishing characteristics, . . . and are not isolated events.\" The Court noted that this definition refers solely to the relationship between the predicate acts. New Jersey defines \"pattern of racketeering activity\" using the same language. Compare ORS 166.715(4) with N.J.S.A. 2C:41-1(2)d(2). The Oregon Court further reasoned that the legislature's sole concern was to ensure that a RICO pattern was understood to include more than merely accidental or unrelated instances of proscribed behavior. The phrase \"not isolated events,\" within the meaning of the statute, was read as describing the relationship between or among the predicate acts, including their nexus to the same enterprise, rather than imposing a concept of temporal continuity. Computer Concepts Inc. v. Brandt, supra, 801 P. 2d at 808. Accordingly, the Court declined to find that, in addition to the express \"relationship\" requirement of ORS 166.715(4), continuity was also required\n\nto prove a pattern of racketeering activity under Oregon RICO. Id. at 809.\n\nIn support of this Conclusion, the Oregon Supreme Court noted that unlike its own statute, the definition of a \"pattern of racketeering activity\" under Federal RICO is neither complete nor selfcontained; on its face, no interrelatedness is necessary between predicate acts. Id. at 807. The \"relationship\" requirement imposed by the Supreme Court in Northwestern Bell was thus viewed as a necessary response to this incomplete definition. Accord United States v. Eufrasio, supra, 935 F. 2d at 563. The continuity requirement, on the other hand, was viewed as an additional element, added in response to the federal statute's specific legislative history, which indicated that Congress was expressly concerned with long-term criminal activity. Northwestern Bell, supra, 492 U.S. at 239, 109 S. Ct. at 2900, 106 L. Ed. 2d at 207-08 (detailing legislative history of Federal RICO). The Oregon Supreme Court also recognized that Northwestern Bell was decided several years after the Oregon RICO statute was enacted, which made its reasoning unpersuasive in construing legislative intent vis a vis Oregon RICO.\n\nFor substantially the same reasons, a Georgia appellate court concluded that the Georgia RICO statute requires a relationship, but not continuity. The court noted that Georgia RICO focuses on \"interconnectedness\" between the predicate acts, a concept that is not contained in the wording of the federal statute. Dover v. State, supra, 385 S.E. 2d at 420-21. See also Larson v. Smith, 194 Ga.App. 698, 391 S.E. 2d 686 (1990).\n\nIndiana and Florida follow Northwestern Bell 's \"relationship plus continuity\" definition even though both of these states use language in their statutory definitions similar to New Jersey, Oregon, and Georgia. Schremmer v. State, 578 So. 2d 392, 393 (Fla.Dist.Ct.App.1991) Kollar v. State, 556 N.E. 2d 936, 940-41 (Ind.Ct.App.1990). The reasoning of these courts is unclear since\n\nthe opinions merely cite to the federal definition without explanatory Discussion or analysis.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nFollowing the reasoning of the Oregon Supreme Court, we are persuaded that New Jersey's statute does not require a showing of continuity. Consistent with the reasoning of Computer Concepts Inc., supra, New Jersey RICO's more complete \"pattern\" definition can stand alone. Therefore resort to federal case law for guidance as to its meaning is not necessary. Moreover, since the New Jersey statute explicitly requires only a showing of relatedness among predicate acts, there is no reason why the additional element of continuity, which is associated with Federal RICO, should be grafted onto New Jersey's statutory definition. The \"Declaration of Policy and Legislative Findings\" contained in N.J.S.A. 2C:41-1.1 does not include \"long term\" criminal activity, indicating that the New Jersey legislature was concerned with the elimination of organized crime in all its forms, regardless of its duration.\n\nAdditionally, legislative history strongly suggests that continuity was not contemplated as a requirement under New Jersey RICO. See Committee Meeting Before the Assembly Judiciary, Law Public Safety and Defense Committee on A-1079 (Racketeer Influenced and Corrupt Organization Act), pp. 7-8 (1980), where in response to a question from Assemblyman Eugene Thompson concerning the showing required to establish a \"pattern of racketeering activity,\" Committee Chairman Martin Herman responded that the activity does not have to be continuous, and that there could be \"interruptions.\"\n\nApplying the relationship test to this case, we hold that relatedness, as defined in N.J.S.A. 2C:41-1d(2), can be inferred from the evidence presented at trial. The Third Circuit, in particular, has taken a flexible approach to the relationship prong of the pattern requirement. In Banks v. Wolk, 918 F. 2d 418, 425 (3d Cir.1990), the Court noted:\n\nWe should avoid interpreting the relatedness requirement too narrowly . . . . In organized crime cases, where the RICO enterprise exists solely for criminal purposes, the necessary nexus between the predicate acts and the enterprise will often be enough to satisfy the relatedness requirement.\n\nThis observation holds true under the facts of this case. A jury could have found, based on the State's evidence, that defendants agreed to commit, and did commit, predicate acts that had the same or similar purposes: the furtherance of the illegal dumping scheme. Moreover, the predicate acts, such as bribery, money laundering, and fraud, had similar purposes and similar participants.\n\nWe hold that the New Jersey RICO statute requires a showing that the predicate acts are related, but does not require continuity. Here, \"relatedness\" among the predicate acts can be inferred from the facts.\n\nRICO -- SUMMARY\n\nIn summary, we adopt a broad approach in defining and applying New Jersey RICO. We hold that the application of New Jersey's statute is not limited to legitimate enterprises. The \"enterprise\" element will be satisfied if there exists a group of people, no matter how loosely associated, whose existence or association provides or implements the common purpose of committing two or more predicate acts. We go so far as to hold the \"enterprise\" element is satisfied if the \"enterprise\" is no more than the sum of the racketeering acts. Thus, the \"enterprise\" does not have to be an organization whose purpose is greater than the predicate acts, nor does it have to evidence any definable structure. In a conspiracy setting, it is not necessary that a defendant agree to personally commit predicate acts. He or she\n\nneed only agree that other members of the conspiracy will commit such acts. Nor is it necessary that a conspirator have knowledge of all aspects of the conspiracy or knowledge of all its participants. We also hold that the \"pattern of racketeering activity\" as defined in N.J.S.A. 2C:41-1d(1) and (2) is not unconstitutionally vague. Further, in order to establish a \"pattern\", it need only be shown the predicate acts are related. It is not necessary to show continuity as required under Federal RICO.\n\n[THE BALANCE OF PAGE 88 AND PAGES 89 THROUGH THE TOP PORTION OF PAGE 173 HAVE BEEN REDACTED FOR THE PURPOSE OF PUBLICATION.]\n\nEXCESSIVE SENTENCE -- BASSI\n\nLastly, defendant Bassi argues that his sentence was improper because the Judge erred in failing to merge the racketeering and bribery offenses, and imposing a sentence on the racketeering count which ran consecutive to, rather than concurrent with, the remaining counts. Whether separate convictions and consecutive sentences are permissible where a defendant has been convicted of a RICO violation, and also separately convicted of offenses constituting predicate acts, is a question of first impression under New Jersey RICO.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e Defendant also contends that even if his sentence is permissible, the Judge abused his discretion by imposing a harsh and excessive sentence which disregarded his past exemplary conduct. We find no reason to disturb Bassi's sentence.\n\nThe standard for appellate review of the sentencing decisions of trial courts was set forth in State v. Roth, 95 N.J. 334, 471 A.2d 370 (1984). On appeal, a reviewing court must 1) determine whether the correct sentencing guidelines have been followed; 2) determine whether there is substantial evidence in the record to support the findings of fact upon which the sentencing court based\n\nthe application of those guidelines; and 3) determine whether in applying those guidelines to the relevant facts the trial court clearly erred by reaching a Conclusion that could not have reasonably been made upon a weighing of the relevant factors. Id. at 365-66, 471 A.2d 370.\n\nThe Roth Court further instructed that an appellate tribunal must avoid substituting its own judgment for that of the trial court. To warrant intervention, the application of the facts to the law must manifest such a clear error of judgment that it shocks the judicial conscience. Id. at 364-65, 471 A.2d 370; See also State v. Ghertler, 114 N.J. 383, 388, 555 A.2d 553 (1989).\n\nBassi received an aggregate sentence of seventeen years imprisonment. Conspiracy to commit RICO (count one) and substantive RICO (count two) were merged and defendant was sentenced to nine years imprisonment on count two, the second-degree substantive RICO count. This sentence was to run consecutively to the remaining counts. With respect to those remaining counts, Bassi was sentenced to concurrent prison terms of: eight years each on counts four, eight and ten (second-degree bribery); three years on count thirty-three (third-degree criminal mischief); and one year each on counts fourteen through twenty-eight (fourth-degree uttering a forged instrument).\n\nA. Consecutive Sentencing in RICO cases\n\nIn enacting RICO, the New Jersey Legislature fully intended to create enhanced penalties for RICO violations. N.J.S.A. 2C:41-1.1. Under Federal RICO, which shares a similar legislative history and similar policy objectives, separate convictions and cumulative sentences for RICO offenses and underlying crimes are permitted. United States v. Sutton, 700 F. 2d 1078, 1081 (6th Cir.1983) (Court held that where Congress intended to impose enhanced punishment for RICO violations, imposition of consecutive sentences does not violate the Constitution). The federal courts have consistently reasoned that since the intent of Congress was clearly to provide for new penal prohibitions and\n\nenhanced sanctions, prohibiting separate convictions and consecutive sentences for the RICO and predicate offenses would frustrate congressional intent. This is one RICO issue upon which the Federal Circuits are in agreement. E.g., United States v. Kragness, 830 F. 2d 842, 864 (8th Cir.1987); United States v. Callanan, 810 F. 2d 544, 546 (6th Cir.) cert. denied, 484 U.S. 832, 108 S. Ct. 107, 98 L. Ed. 2d 67 (1987); United States v. Grayson, 795 F. 2d 278, 286 (3d Cir.1986), cert. denied, 481 U.S. 1018, 107 S. Ct. 1899, 95 L. Ed. 2d 505 (1987); United States v. Persico, 774 F. 2d 30, 32-33 (2d Cir.1985); United States v. Truglio, 731 F. 2d 1123, 1129 (4th Cir.), cert. denied, 469 U.S. 862, 105 S. Ct. 197, 83 L. Ed. 2d 130 (1984); United States v. Phillips, 664 F. 2d 971, 1009 (5th Cir. 1981), cert. denied sub nom., Platshorn v. United States 459 U.S. 906, 103 S. Ct. 208, 74 L. Ed. 2d 166 (1982); United States v. Rone, 598 F. 2d 564, 571-72 (9th Cir.1979), cert. denied sub nom., Little v. United States, 445 U.S. 946, 100 S. Ct. 1345, 63 L. Ed. 2d 780 (1980).\n\nStates that have examined this question in light of their own RICO statutes have followed the federal approach. E.g., State v. Blossom, 88 Or.App. 75, 744 P. 2d 281, 283 (1987), review denied, 305 Or. 22, 749 P. 2d 136 (1988) (construing state racketeering statute patterned after Federal RICO and holding that separate convictions and consecutive sentences are permissible), Accord Donovan v. State, 572 So. 2d 522 (Fla.1990); Swedarsky v. State, 569 N.E. 2d 740 (Ind.Ct.App.1991); State v. Johnson, 105 N.M. 63, 728 P. 2d 473 (N.M.Ct.App.1986), cert. denied, 104 N.M. 702, 726 P. 2d 856 (1986), cert. denied, 481 U.S. 1051, 107 S. Ct. 2185, 95 L. Ed. 2d 841 (1987) (double jeopardy principles do not preclude imposition of separate convictions and consecutive sentences for RICO and predicate offenses).\n\nIn handing down consecutive sentences in this case, Judge Humphreys relied upon the Legislature's intent that RICO violations be subject to enhanced criminal sanctions, and adopted the reasoning and result of federal courts with respect to the merger and consecutive sentencing issues argued by defendant. As Judge Humphreys explained:\n\n[T]he purpose of the New Jersey Racketeering Statute is to combat organized crime and organized crime type activities. As specifically stated by the Legislature in the Statute, the existence of organized crime and organized crime type activities presents a serious threat to the political, social and economic institutions of this State. New Jersey Statute 2C:41-1.1. The Legislature provided in the Racketeering Statute that such criminal activity be made \"subject to strict civil and criminal sanctions.\" And further provided that the remedies would be cumulative. [ N.J.S.A. 2C:41-6.1].\n\nCongress, in enacting the Federal Racketeering Statute, was motivated by similar considerations. The legislative history in back of the Federal Racketeering Statute clearly indicates that Congress intended to provide enhanced sanctions. Consequently, as was said by the Circuit Court in U.S. v. Sutton [700 F. 2d 1078] at page 1081 [6th Cir. (1983)], the clear intent of Congress was to \"permit,\" perhaps even to \"encourage,\" Courts to impose cumulative sentences for RICO offenses and the underlying crimes. Cumulative sentences are the enhanced sanctions which Congress deemed necessary to treat the spreading disease of organized crime.\n\nWe agree with this assessment. The reason for enacting a RICO statute is to deter and punish organized criminal activity through the use of stricter penalties than would otherwise be available. If consecutive sentences are not imposed, there would be no enhanced penalties. A conviction under RICO would actually grant immunity for the offenses charged in the \"pattern of racketeering.\" State v. Blossom, supra, 744 P. 2d at 283 n. 4.\n\nAn analysis under traditional New Jersey sentencing guidelines also supports the result reached by Judge Humphreys. In State v. Yarbough, 100 N.J. 627, 498 A.2d 1239 (1985), cert. denied, 475 U.S. 1014, 106 S. Ct. 1193, 89 L. Ed. 2d 308 (1986), the Supreme Court identified the relevant criteria for determining when consecutive as opposed to concurrent sentences should be imposed in cases where a single criminal episode involves multiple and distinct but similar criminal acts. Id. at 638, 498 A.2d 1239. The Court noted that there should be no free crimes and advised that the sentencing court should consider the factual context of the crime, including whether or not:\n\n(a) the crimes and their objectives were predominantly independent of each other;\n\n(b) the crimes involved separate acts of violence or threats of violence;\n\n(c) the crimes were committed at different times or separate places, rather than being committed so closely in time and place as to indicate a single period of aberrant behavior;\n\n(d) any of the crimes involved multiple victims;\n\n(e) the convictions for which the sentences are imposed are numerous;\n\n[ Id. at 644.]\n\nThe object of punishment under RICO is not the commission of the underlying predicate act, but rather the participation in an enterprise that engages in a pattern of racketeering activity. State v. Cooper, 211 N.J. Super. 1, 16-17, 510 A.2d 681 (App.Div. 1986), (citing United States v. Russotti, 717 F. 2d 27, 33 (2d Cir.1983)), cert. denied, 483 U.S. 1019, 107 S. Ct. 3261, 97 L. Ed. 2d 761 (1984) (holding that conviction for Federal RICO conspiracy did not bar, on double jeopardy grounds, subsequent state court prosecution for underlying robbery offense named as Federal RICO predicate act). It is the enhanced danger to society posed by organized criminal activity that RICO is intended to address. The RICO crime is independent from the commission of the underlying offenses. State v. Cooper, supra, 211 N.J. Super. at 19, 510 A.2d 681. Accordingly, it should be separately sentenced. Concurrent sentences for the RICO offense and its predicate acts would both frustrate legislative intent and give defendants the benefit of \"free crimes.\" Therefore, the consecutive aspect of his sentence will not be disturbed.\n\nB. Merger in Rico Cases\n\nDefendant also argues that the bribery convictions in this case were intertwined in the RICO conviction and should have merged under principles of New Jersey merger law. We disagree. The principle of merger prevents the State from punishing an accused twice for the commission of a single crime. State v. Truglia, 97 N.J. 513, 522, 480 A.2d 912 (1984). N.J.S.A. 2C:1-8a(1) codifies the test for merger set forth in Blockburger v. United States, 284 U.S. 299, 52 S. Ct. 180, 76 L. Ed. 306 (1932). Under the statutory test, defendant may not be convicted of more than one offense if 1) one is included in the other; 2) one offense consists only of a conspiracy or other form of preparation for the other; 3) inconsistent findings of fact are required to establish the commission of the offenses; or 4) the offenses differ only in that\n\none is defined to prohibit a designated kind of conduct generally and the other to prohibit a specific instance of such conduct.\n\nHowever, our Supreme Court in State v. Truglia, supra, 97 N.J. at 521, 480 A.2d 912, expressed its discomfort with utilizing just the statutory mechanical approach set forth in N.J.S.A. 2C:1-8a(1) and has, therefore, combined the statutory approach with a flexible approach formulated in State v. Davis, 68 N.J. 69, 342 A.2d 841 (1975). The Supreme Court has continued to employ that flexible approach which requires focusing on the elements of the crime, the Legislature's intent in creating them and the facts of the case. The statutes must be examined to determine if the Legislature intended to protect different interests and consideration must be given to the merger provisions of N.J.S.A. 2C:1-8. State v. Cole, 120 N.J. 321, 576 A.2d 864 (1990).\n\nThe facts in the instant case strongly mitigate against merger. The underlying offenses were committed at different times and places, different proof was required for the racketeering conviction than for the bribery, the consequences of the criminal standards transgressed were different, and the offenses resulted in distinct and different injuries.\n\nThe same societal interests are not implicated in violating RICO as are implicated in committing bribery or any of the other predicate offenses. RICO seeks to deter and strictly punish organized criminal activity in order to prevent such associations from corrupting societal institutions. This is a different consideration than implicated by the bribery offense, which involves betrayal of the public trust and official malfeasance. Moreover, since the Legislature clearly intended enhanced penalties for RICO violations, merger of underlying predicate offenses with RICO convictions would defeat the very legislative policy that gave rise to the New Jersey racketeering statute. Thus a single racketeering conviction would not provide punishment for the \"profound and distinct injuries\" caused by defendant's participation in the criminal enterprise. State v. Cole, supra, 120 N.J.\n\nat 335, 576 A.2d 864. Accordingly, defendant's merger argument is rejected.\n\nC. Propriety of The Sentence\n\nAdditionally, Bassi argues that the court disregarded his past exemplary behavior in sentencing him to an aggregate sentence of seventeen years imprisonment. He further contends that at worst, the statutory aggravating and mitigating factors were in equipoise, and a presumptive sentence should have been imposed. We disagree.\n\nThe Judge specifically considered Bassi's past good conduct, a factor which weighed in his decision not to impose the maximum sentence allowed. Moreover, the sentence was within statutory bounds, and well within the Judge's discretion. Since there is neither clear error on the Judge's part with respect to following the sentencing guidelines, nor a sentence which, under the circumstances, \"shocks the conscience\", there is no reason for appellate intervention. State v. Ghertler, supra, 114 N.J. at 387-88, 555 A.2d 553; State v. Roth, supra, 95 N.J. at 364, 471 A.2d 370.\n\nDefendant's convictions for racketeering and bribery, both second-degree offenses, carried a presumptive term of seven years each (fourteen years in the aggregate). In sentencing defendant to nine years for the racketeering, and eight years for bribery (seventeen years in the aggregate), Judge Humphreys found the following aggravating factors applied: the nature and circumstances of the offense; the gravity and seriousness of the harm inflicted; the risk that defendant would commit another offense; the substantial likelihood that defendant was involved in organized criminal activity; the need to deter defendant and others; that the offense involved fraudulent or deceptive practices committed against State government; and that the imposition of a fine or penalty without imprisonment would be perceived as part of the cost of doing business. N.J.S.A. 2C:44-1a(1), (2), (3), (5), (9), (10), (11). Defendant does not dispute that these factors were applicable.\n\nAfter considering defendant's exemplary record in the Navy and on the White House staff, the Judge also found the following mitigating factors present: that defendant had no prior criminal history; imprisonment could entail excessive hardship in light of defendant's health and his responsibility to his children; defendant's conduct was the result of circumstances unlikely to recur; that the character and attitude of defendant indicated that he was unlikely to commit another offense; and that defendant was particularly likely to respond to probation. N.J.S.A. 2C:44-1b(7), (8), (9), (10), (11). However, in light of the magnitude of defendant's crimes, the Judge determined that these mitigating factors would be given \"some weight, but not great weight.\"\n\nOn balance, the Judge found that the aggravating factors outweighed the mitigating factors. The Judge was particularly disturbed by defendant's pivotal role in the enterprise. In sentencing defendant, he stated:\n\nYou, Mr. Bassi, and the defendant Mr. Harvan were at the core of this criminal enterprise. You knowingly violated laws and regulations which were for the purpose of protecting the public from illegal dumping. You bribed three separate public officials. You managed and were a principal figure in a major criminal enterprise dedicated to those ends. You did all this for greed. The need for deterring you and others who might be tempted to engage in such criminal enterprises is extremely great and must be given great weight.\n\nAlthough the Judge believed the facts warranted the maximum sentence permitted by law as well as a substantial period of parole ineligibility, he also believed that adding parole disqualifiers to the consecutive sentence would be too punitive. He therefore sentenced defendant to nine years imprisonment for second-degree racketeering, two years in excess of the presumptive term, and eight years for each second degree bribery count, one year in excess of the presumptive term.\n\nWe view this sentence as fair and not an abuse of discretion on the Judge's part. The weighing of aggravating and mitigating factors involves a qualitative rather than quantitative analysis. Here, defendant was convicted of bribing public officials, a serious offense which threatens the integrity of the governmental\n\nprocess and impacted on every citizen of North Bergen. Additionally, the criminal enterprise with which defendant was associated showed little regard for the protection of the environment, or for the safety of the people of North Bergen. Under the facts of this case, the Judge was justified in finding that the aggravating factors outweighed the mitigating factors, both quantitatively and qualitatively. Moreover, the Judge did not avail himself of the maximum sentence available, imposed concurrent sentences for the non-racketeering offenses, and refrained from imposing any parole ineligibility period.\n\nIn sum, Bassi's sentence was fair, comported with existing guidelines, and was fully justified by the underlying circumstances of this case. We find no abuse of judicial discretion warranting a revision of the sentence.\n\nMICHAEL HARVAN\n\nDefendant Harvan raises essentially the same arguments as defendant Bassi with respect to his sentence. For the same reasons just expressed as to Bassi, Harvan's sentence is affirmed.\n\nThe convictions and sentences of all defendants are affirmed.\n\nDisposition\n\nAffirmed.\n\n\u003cspan class=\"fn\"\u003e1. This was a municipal court complaint for simple assault issued by a North Bergen police officer to Hurtuk for an incident which occurred near one of the dumping sites. Apparently $5,000 was paid to have the action withdrawn. It is not in issue before us in this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. CMB Enterprise was a company whose checks were used as forged documents which, when cashed, provided the payoff money for the public official defendants.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Since defendant was sentenced on twenty counts, the minimum Violent Crimes Compensation Board penalty should be $600. See N.J.S.A. 2C:43-3.1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Since defendant was sentenced on twenty counts, the minimum Violent Crimes Compensation Board penalty should be $600. See N.J.S.A. 2C:43-3.1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. We have been advised that defendant Ball, pending appeal, died on June 7, 1993.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. N.J.S.A. 2C:2-6 provides that an actor may be guilty of an offense committed by the conduct of another under certain enumerated circumstances.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Those states which have enacted some form of RICO include: Arizona, Ariz.Rev.Stat.Ann., § 13-2312 (1992); California, Cal.Penal Code, § 186 (West 1988); Colorado, Colo.Rev.Stat.Ann. § 18-17-101 to § 17-109 (West 1990); Connecticut, Con.Gen.Stat.Ann., § 53-393 (West 1992); Delaware, Del.Code Ann., tit. 11, § 1505 (1992); Florida, Fla.Stat.Ann., § 895.01 to 895.06 (West Supp.1992); Georgia, Ga.Code Ann., § 16-14-1 to § 16-14-5 (Michie 1992); Hawaii, Haw.Rev.Stat., § 842-1 to § 842-12 (Michie 1992); Idaho, Idaho Code, § 18-7801 to 18-7805 (Michie 1992); Louisiana, La.Rev.Stat.Ann., § 15:1351 to 15-1356 (West 1992); Minnesota, Minn.State.Ann., § 609.901 to 609-911 (West Supp.1993); Mississippi, Miss.Code Ann., § 97-43-1 to 43-11 (1991); Nevada, Nev.Rev.Stat.Ann., § 207.350 to 207.520 (Michie 1991); New Mexico, N.M.Stat.Ann., § 30-42-1 to 30-42-6 (1992); Ohio, Ohio Rev.Code Ann., § 2923.31 et seq. (Anderson 1992); Oklahoma, Okla.Stat.Ann., tit. 22, § 1401 to 1419 (West 1993); Oregon, Or.Rev.Stat.Ann., § 166.715 to 166.735 (Michie 1991); Pennsylvania, Pa.Stat.Ann., tit. 18, § 911 (West 1992); Rhode Island, R.I.Gen.Laws, § 7-15-4 (1991); Washington, Wash.Rev.Code Ann., § 9A.82.100 (West 1992), and Wisconsin, Wis.Stat.Ann., § 946.86(4) (West 1991).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Under N.J.S.A. 2C:5-2a: A person is guilty of conspiracy with another person or persons to commit a crime if with the purpose of promoting or facilitating its commission he: (1) Agrees with such other person or persons that they or one or more of them will engage in conduct which constitutes such crime or an attempt or solicitation to commit such crime; or (2) Agrees to aid such other person or persons in the planning or commission of such crime or of an attempt or solicitation to commit such crime.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The State also contends that Harvan is procedurally barred from raising this issue for the first time on appeal. We agree. See State v. Souss, 65 N.J. 453, 460, 323 A.2d 484 (1974). Nonetheless, we will address this argument.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The Tenth Circuit's position is unclear. United States v. Sanders, 929 F. 2d 1466, 1473 (10th Cir.) (in absence of briefs or oral argument on issue, court determined that \"only for purposes of this appeal\" defendant must agree to personally commit two predicate acts), cert. denied, U.S. , 112 S. Ct. 143, 116 L. Ed. 2d 109 (1991); United States v. Killip, 819 F. 2d 1542, 1547-48 (10th Cir.) (declining to consider the issue directly since it was not specifically before the court), cert. denied, 484 U.S. 987, 108 S. Ct. 505, 98 L. Ed. 2d 504 (1987).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. In Northwestern Bell, the Eighth Circuit held that a defendant must have engaged in multiple or separate illegal schemes in order to be prosecuted for a pattern of racketeering activity. 829 F. 2d 648, 650 (8th Cir.1987). The Supreme Court reversed the dismissal of the civil RICO complaint holding that the multiple predicate acts alleged in the complaint were found to satisfy the requirements of relationship plus continuity, and thus to constitute a \"pattern.\" 492 U.S. at 250, 109 S. Ct. at 2906, 106 L. Ed. 2d at 214-15.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. In a recent New Jersey Law Division opinion, the court likewise applied the federal relationship plus continuity test without analysis or Discussion. An alleged scheme involving a single real estate transaction with evidence of mail and wire fraud all allegedly relating to the goal of depriving plaintiff of the opportunity to buy a building, was held not to satisfy the continuity prong of the Supreme Court's test for a pattern of racketeering activity because the conduct did not threaten repetition. Sammon v. Watchung Hills Bank, 259 N.J. Super. 124, 129, 611 A.2d 674 (Law Div.1992).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. To the extent that Harvan argues the propriety of merger and consecutive sentences in the context of RICO, this Discussion also applies to Harvan's Issue VI.\u003c/span\u003e\n\n",
    "body_length": 151687,
    "citedas": [
      "632 A.2d 1222",
      "268 N.J.Super. 72"
    ],
    "attorneys": "Harvey Weissbard argued the cause for appellants, Patrick Ball and Big Apple Leasing Co. (Weissbard \u0026 Wiewiorka attorneys; Mr. Weissbard and Alan L. Zegas on the brief). Harold J. Ruvoldt, Jr. argued the cause for appellants, George Hurtuk, Joseph Dulanie and Joseph Mocco (Ruvoldt \u0026 Ruvoldt, attorneys; Mr. Ruvoldt, Avivith Oppenheim and Richard C. Heubel on the brief). Robert E. Bonpietro, Deputy Attorney General, argued the cause for respondent, State of New Jersey (Robert J. Del Tufo, Attorney General, attorney; Mr. Bonpietro of counsel and on the briefs). Zulima V. Farber, Public Defender attorney for appellant Michael Harvan (Kevin G. Byrnes, designated counsel, of counsel and on the brief). Zulima V. Farber, Public Defender attorney for appellant Richard Bassi (Philip A. Ross, designated counsel, of counsel and on the brief).",
    "category": [
      "213"
    ],
    "judges": "King, Brody and Thomas. The opinion of the court was delivered by Thomas, J.A.D.",
    "citation_count": 35
  }
}
