{
  "id": "YoH4PWYBTlTomsSBzYSX",
  "document": {
    "title": "In re Prudential Ins. Co. of America Sales Practices Litigation",
    "full_title": "RICHARD P. KRELL, MDL TRANSFER, N.D. OHIO, DNJ CIVIL ACTION NO. 95-6062 v. PRUDENTIAL INSURANCE COMPANY OF AMERICA RICHARD P. KRELL, AS WELL AS OBJECTORS ELIZABETH BAJEK, AMANDA BAJEK, HELEN BARTSCH, MARK CICONTE, RAYMOND DOLCE, MARGARET DOLICE, LOUISE DUGGAN, PETER DUGGAN, CHARLES DUNCAN, MARY HOWE, MARY KRELL, WILLIAM MORRIS, DIANA RACER, THOMAS RACER, GWENETH REIDEL, THE ESTATE OF CARL J. SCALZO, MARIE SCALZO, TERRY SLIGAR, ALICE SMITH, JERRY SMITH, AND WILLIAM WALTON AT NOS. 97-5155/5156/5312 RICHARD JOHNSON, INTERVENOR-PLAINTIFF IN DISTRICT COURT RICHARD E. JOHNSON AT NO. 97-5217",
    "jurisdiction": "Third Circuit",
    "date": "1998-07-23T00:00:00.000Z",
    "docket": "Nos. 97-5155, 97-5156, 97-5217 \u0026 97-5312",
    "body": "IN RE: PRUDENTIAL INSURANCE COMPANY AMERICA SALES PRACTICE LITIGATION AGENT ACTIONS\n\nOn Appeal from the United States District Court for the District of New Jersey\n\nArgued January 26, 1998\n\nOPINION OF THE COURT\n\nThis is an appeal from the approval of the settlement of a nationwide class action lawsuit against Prudential Life Insurance Company alleging deceptive sales practices affecting over 8 million claimants throughout the fifty states and the District of Columbia.\n\nThe class is comprised of Prudential policyholders who allegedly were the victims of fraudulent and misleading sales practices employed by Prudential's sales force. The challenged sales practices consisted primarily of churning, vanishing premiums and fraudulent investment plans, and each cause of action is based on fraud or deceptive conduct. There are no allegations of personal injury; there are no futures classes. The settlement creates an alternative dispute resolution mechanism and establishes protocols to determine the kind and amount of relief to be granted. The relief awarded includes full compensatory damages consisting of what plaintiffs thought they were purchasing from the insurance agent. There is no cap on the amount of compensatory damages for those who qualify, and although punitive damages are not included in the settlement, Prudential has agreed to pay an additional remediation amount in addition to the payments made through dispute resolution process.\n\nThe case involves five consolidated appeals from the judgments of the District Court for the District of New Jersey approving the settlement and awarding attorneys' fees to class counsel. Appellants, members of the certified class who object to the settlement, challenge the district court's jurisdiction, the certification of the settlement class, the fairness of the settlement itself, the award of attorneys' fees, and the district court's refusal to disqualify itself.\n\nWe hold the district court properly exercised jurisdiction. Federal subject matter jurisdiction is properly grounded on the alleged violations of the federal securities laws. Although most of the claims implicate state law, supplemental jurisdiction is proper because all of the claims arise out of a common nucleus of operative fact. The district court had personal jurisdiction over the class because actual notice was given to each of the 8 million policyholders by direct mail, and disseminated through television, radio and print advertising throughout the fifty states and the District of Columbia. We also hold there was no reason for the district court to recuse itself from these proceedings.\n\nThe district court properly certified a national class under Fed. R. Civ. P. 23(b)(3). The court assessed the numerosity and commonality of the asserted claims, the typicality of those claims, and the adequacy of representation provided by the named plaintiffs and class counsel, and found they satisfied the certification standards. The court also concluded the proposed class action was the superior means of addressing plaintiffs' claims of widespread sales abuse, and the issues common to all members of the class predominated over individual issues related to the members of the class.\n\nWe hold the district court properly evaluated the settlement, finding it fair, reasonable and adequate. Prudential's deceptive practices occurred nationwide. It may be argued that problems national in scope deserve the attention of national courts when there is appropriate federal jurisdiction. Because of the extraordinary number of claims, fairness counsels that plaintiffs similarly injured by the same course of deceptive conduct should receive similar results with respect to liability and damages. The proposed class settlement offers plaintiffs several advantages, including full compensation for their injuries, no obligation to pay attorneys' fees, and a relatively speedy resolution of their claims. The alternative dispute resolution process is sensible and provides adequate safeguards for individual treatment of claims, including appeals. We will affirm the district court's approval of the class certification and the settlement.\n\nThe district court awarded $90 million in attorneys' fees as a percentage of a common fund created under the settlement. We will vacate and remand the fee award and ask the district court to recalculate the fee to account for work done by the multi-state task force whose efforts served as a basis for the final settlement in this case. Furthermore, we question the multiplier employed in the lodestar analysis used by the court to cross check the size of the fee award. Although granting discovery on fee applications is within the sound discretion of the district court, we will ask the district court to reconsider whether it should grant limited discovery to the objectors on the fee application.\n\nI. BACKGROUND AND PROCEDURAL HISTORY\n\nThis case began in early 1994, when the first of many individual and class action lawsuits alleging improper sales and marketing practices was filed against Prudential, the nation's largest life insurer. As lawsuits began to accumulate, the New Jersey Insurance Commissioner sought to organize a group to investigate the allegations against Prudential.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e The resulting investigation into market conduct sought to determine the scope of any improper sales practices, and to develop a remedial plan designed to compensate injured policyholders, to prevent future violations, and to restore public confidence in the insurance industry. Report of The Multi-State Life Insurance Task Force and Multi-State Market Conduct Examination of The Prudential Insurance Company of America at 2 (\"Task Force Report\"). While the Task Force proceeded with its investigation, federal and state court actions alleging sales practice abuses by Prudential continued to accumulate. Although our primary concern is the outcome of the federal litigation, the history of both the Multi-State Life Insurance Task Force's investigation and the various lawsuits filed against Prudential overlap to a certain degree, and thus warrant Discussion.\n\nA. The Multi-State Life Insurance Task Force\n\nAt the instigation of the New Jersey Insurance Commissioner, the Multi-State Life Insurance Task Force was formed on April 25, 1995, with the stated goal of conducting a thorough and extensive examination of Prudential's sales practices during the period from 1985 until 1995. In all, thirty states and jurisdictions elected to participate.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e The Task Force interviewed 283 agents and 27 sales management executives, and reviewed voluminous materials provided by Prudential. Among those materials were internal computer data bases reflecting complaints, policy transactions, and agent discipline. The Task Force also reviewed market conduct reports prepared by other states which had examined Prudential's business practices, and examined the historical developments which affected sales practices in the insurance industry.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nIn July 1996, the Task Force issued its final report, citing widespread evidence of fraudulent sales practices and inadequate supervision by Prudential's management. It explained that Prudential's records revealed the company \"knew of cases of alleged misrepresentation and other improper sales practices by its agents, and in many instances failed to adequately investigate and impose effective discipline.\" Task Force Report at 15. According to the report, interviews with Prudential agents revealed \"little if any consistency in agent training and agent awareness of company and regulatory guidelines.\" Id. at 16. While the Task Force concluded that not all of the sales during the time period investigated were fraudulent or improper, it recognized the difficulty in ascertaining precisely which policyholders had been harmed,\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e and therefore recommended the implementation of a remediation plan which would \"reach out to all potentially affected policyholders.\" Id. at 17-18. Under the plan, which was developed with Prudential's input and cooperation, policyholders were given the option of pursuing claims in an Alternative Dispute Resolution process (\"ADR\") or through a \"no-fault\" remedy known as Basic Claim Relief.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nAs part of the Task Force Plan, Prudential agreed to conduct an extensive outreach program, including individual notice to all persons who purchased a policy between 1982 and December 31, 1995. Those electing the ADR process could submit their claim for evaluation. The remediation plan addressed four categories of claims: financed or replacement sales; sales involving abbreviated payment plans; life insurance sold as an investment; and other claims \"falling outside of the first three categories.\" Id. at 19. Those electing Basic Claim Relief would be eligible for preferred-rate loans or the opportunity to purchase discounted policies.\n\nForty-three states and the District of Columbia signed a Consent Order adopting the Task Force Plan, with the understanding that if the pending class action achieved a better result, the Task Force and the states could join in the improved plan. The Task Force also recommended a separate $35 million fine to be divided among the states and the District of Columbia.\n\nB. The Federal Class Action\n\nWhile the Task Force was conducting its investigation, parties continued to file individual claims and class actions against Prudential in both state and federal court. On February 6, 1995, named plaintiff Nicholson filed a class action in Illinois state court which was removed one month later to the United States District Court for the Southern District of Illinois. The Kuchas plaintiffs filed their federal class action on February 28, 1995 in the District of Connecticut. Four other federal class actions were filed in the District of New Jersey in early 1995. Appellant Krell filed his class complaint in Ohio state court in June 1995.\n\nOn April 26, 1995, Prudential moved to consolidate the various federal actions in the District of New Jersey. On August 3, 1995, the Judicial Panel on Multidistrict Litigation granted Prudential's motion and transferred several actions to the District of New Jersey.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e Prudential then removed the various state actions to federal court, including the Krell action, and requested these additional cases be consolidated in New Jersey. The MDL Panel granted that request as well.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nIn October 1995, the district court appointed Melvin Weiss of Milberg, Weiss, Bershad, Hynes \u0026 Lerach and Michael B. Hyman of Much, Shelist, Freed, Deneberg, Ament, Bell \u0026 Rubenstein as Co-Lead Counsel for plaintiffs, and ordered plaintiffs to file a consolidated complaint. On October 24, 1995, plaintiffs filed the First Consolidated Amended Class Action Complaint.\n\nThe named plaintiffs filed suit on behalf of all persons who purchased new or additional life insurance policies between January 1, 1980 and the time of the complaint as a result of Prudential's alleged fraudulent scheme. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e They alleged that Prudential management developed and implemented a fraudulent scheme to sell life insurance policies through a variety of deceptive sales practices, including \"churning,\" \"vanishing premium,\" and \"investment plan\" sales tactics. Plaintiffs also challenged Prudential's dividend practices, among them the so-called \"investment generation approach,\" and \"Prudential's deceptive administration of class members' policies to conceal fraudulent sales and effectuate the scheme, including Prudential's use of unauthorized policy loans and similar contrivances to deplete policyholders' cash values.\" Lead Counsel Brief at 5. The Complaint alleged violations of Sections 10(b) and 20(a) of the Securities Exchange Act of 1934, common law fraud, breach of contract, bad faith, negligent misrepresentation, negligence, unjust enrichment, and breach of state consumer fraud statutes.\n\nOn December 26, 1995, Prudential moved to dismiss the complaint under Fed. R. Civ. P. 12(b)(6). At the same time, Prudential approached Lead Counsel to discuss a possible settlement. Those Discussions ended, however, when Lead Counsel indicated they would not settle the case without significant discovery. The parties renewed their settlement discussions in early 1996, after Prudential agreed to provide discovery, but once again failed to reach an agreement. When the talks ceased, Prudential stopped its production of documents. Lead Counsel nevertheless pursued its own investigation, interviewing approximately thirty former Prudential agents and customers, and reviewing the limited array of documents provided by Prudential.\n\nThe district court granted Prudential's motion in part on May 10, 1996, dismissing without prejudice all claims of three of the five named plaintiffs, and several claims of the remaining two. It also noted that plaintiffs would not likely prevail on many of their claims at trial. The district court then ordered Prudential to provide plaintiffs with copies of the substantial discovery materials already provided to the Task Force.\n\nFollowing the issuance of the Task Force Report in July 1996, Lead Counsel and Prudential once again entered settlement negotiations, and again Prudential agreed to Lead Counsel's demands for discovery.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e By August 8, 1996, Prudential had provided plaintiffs with over 70 boxes of documents in response to Lead Counsel's requests.\n\nOn September 19, 1996, plaintiffs filed their Second Amended Consolidated Complaint. The Second Amended Consolidated Complaint contained essentially the same claims as the first, alleging Prudential implemented a systematic fraudulent marketing scheme which made use of false and misleading sales presentations, policy illustrations, and marketing materials. Once again, the Complaint specifically referred to Prudential's \"churning,\" \"vanishing premium,\" and \"investment plan\" sales tactics.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Each of the named plaintiffs claimed to have been injured by this common scheme, and alleged one or more of the specified sales practices.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Plaintiffs also sued several persons in their individual capacities: Robert A. Beck, Prudential President from 1972 until 1979 and Chairman from 1978 until 1987; Ronald D. Barbaro, Prudential's President from 1990 until 1992; and Robert C. Winters, Chairman and CEO from 1987 until 1994, and President from 1993 until 1994.\n\nAccording to the Second Amended Consolidated Complaint, Prudential was aware of these fraudulent sales practices as early as 1982, when internal investigations discovered patterns of abuse involving financed insurance. Plaintiffs alleged that Prudential failed to take serious steps to combat the abuses, focusing instead on \"damage control\" and warning internal auditors not to \"rock the boat.\" For example, when Prudential's auditing department tested a new computer system to detect churning in its Minneapolis office, sales dropped off sharply. Instead of addressing the concerns raised by the audit department, Prudential merely referred the matters to the \"marketing\" group, which took no steps to stop the fraudulent activities. Second Am. Cons. Compl. ¶ 86.\n\nThree days after the filing of the Second Amended Consolidated Complaint, Prudential and class counsel entered into a settlement agreement. There were three preconditions to the agreement. First, those states which had adopted the Task Force Remediation Plan through the execution of the Consent Order had to agree to modify the Consent Order to conform to the Settlement Agreement. Second, the final Stipulation of Settlement had to be executed by October 28, 1996. Lastly, the parties reserved the right to modify the Stipulation of Settlement to reflect any new information revealed by class counsel's ongoing discovery.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e The Settlement Agreement did not address attorneys' fees.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nOn October 28, 1996, the parties filed a final Stipulation of Settlement. At that time, the district court issued an order conditionally certifying a national settlement class, directing issuance of class notice, issuing an injunction,\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e and scheduling a fairness hearing for January 21, 1997. The notice was sent to each of the more than 8 million class members by first class mail on or before November 4, 1996, and gave them until December 19, 1996 to file objections or opt out of the class.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\n1. The Proposed Settlement\n\nThe proposed settlement was largely based on the Task Force Report and its proposed remediation plan. Like the Task Force plan, the settlement proposed a remediation scheme by which class members had the option of either pursuing their claims through an Alternate Dispute Resolution procedure or electing Basic Claim Relief. The proposed settlement class included all persons who owned one or more Prudential insurance policies between January 1, 1982 and December 31, 1995, with certain exceptions.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e The class included approximately eight million Prudential policyholders who own or owned approximately 10.7 million policies.\n\na. The Alternative Dispute Resolution process\n\nUnder the ADR process contained in the proposed settlement, class members who believed they had been misled could submit a claim to Prudential. The claim form provided to all potential class members contained both narrowly drawn questions designed to elicit information relating to specific evidentiary scoring criteria established under the settlement, as well as more open-ended questions allowing claimants to explain the exact nature of their claims. Claimants were also asked to submit any supporting documents in their possession. Prudential established a toll-free hotline to allow claimants to speak to a Claimant Support team, whose members are specially trained to answer policyholder inquiries, assist with filling out claim forms, and advise them with respect to the collection of supporting documents. Once the claim form was submitted, Prudential was obligated to locate all of its records pertaining to the claim and submit them for consideration.\n\nOnce a claim has been filed and all the relevant materials gathered, the claim is subject to a four tier review process. At the first level, the claim would be examined by a member of the Claim Evaluation Staff, who will apply a set of specific criteria for each of four general categories of sales complaints: (1) financed insurance (taking a loan against an existing policy in order to pay the premiums on a new policy); (2) abbreviated payment plans (using dividends from a policy to pay the premiums on that policy); (3) life insurance sold as an investment; and (4) other improper sales practices.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e Based on the application of the established criteria, the reviewers then assign a score from zero to 3 to each claim.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e The Claim Evaluation Staff is comprised of specially trained Prudential employees who are not associated with Prudential's individual life insurance sales force.\n\nAny claim not receiving a score of \"3\" will automatically be reviewed by a team of independent claim evaluators who are selected by class counsel and representatives of the state regulators. This team will apply the same criteria as the Claim Evaluation Staff, and make a written recommendation if it believes the claimant's score should be adjusted.\n\nThat recommendation is then examined by a member of the Claim Review Staff, which is comprised of Prudential employees who have not worked as or had supervisory authority over Prudential sales agents. The determination of the Claim Review Staff may not be appealed by Prudential. The claimant, however, may appeal the decision to the fourth level of review, the Appeals Committee. The Appeals Committee is selected by class counsel and representatives of the state regulators from a list agreed upon by class counsel, the state regulators, and Prudential. While the Appeals Committee must apply the same criteria, its review of the claim is de novo.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nThe relief afforded a claimant varies depending on the final score he or she is awarded. Those obtaining a score of zero are afforded no relief. Those with a score of\"1\" may obtain relief only through Basic Claim Relief. Those with scores of \"2\" or \"3\" are entitled to compensatory relief.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nb. Basic Claim Relief\n\nBasic Claim Relief allows the class member to obtain one or more forms of relief without having to demonstrate liability on Prudential's part. The available forms of Basic Claim Relief include: (1) low interest loans to help policy holders make premium payments on existing policies; (2) enhanced value policies which allow members to purchase new policies with additional coverage paid for by Prudential; (3) deferred annuities enhanced by contributions from Prudential; and (4) the opportunity to purchase shares in designated mutual funds enhanced by a contribution from Prudential.\n\nc. Enhancements To the Task Force Plan\n\nThe district court found the settlement improved upon the Task Force's remediation plan in several ways. Fairness Opinion, 962 F. Supp. at 492-95. First, the court found that the settlement improved the structure of the ADR process by including class counsel and their representatives in the monitoring process, and improving the claim scoring criteria\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e and evidentiary factors used to analyze ADR claims.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e It also enhanced the remedies available through both the ADR process and Basic Claim Relief,\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e and provided for a blanket waiver of statute of limitations and other defenses which Prudential might otherwise have.\n\nSecond, it provided minimum financial guarantees which were not contained in the Task Force plan. In addition to the uncapped relief provided under both the Task Force plan and the proposed settlement, Prudential guaranteed to pay at least $260 million for each 110,000 claims remedied (up to 330,000), with a minimum payment of $410 million regardless of the number of claims remedied. Prudential also agreed to pay an additional remediation amount based on a sliding scale from $50 to $300 million, depending on the number of claims remedied. This amount was to be allocated by the district court.\n\nFinally, the district court noted the \"Proposed Settlement establishe[d] an unparalleled outreach program to ensure that class members are adequately informed.\" Fairness Opinion, 962 F. Supp. at 492. This included mailing individual notice to over 8 million current and former policyholders, and publishing summary notices in the national editions of The New York Times, The Wall Street Journal, USA Today, and The Newark Star Ledger. The summary notice was also published in the largest newspaper in each of the fifty states and the District of Columbia. In addition, the Stipulation of Settlement provided that, following final approval of the settlement, post-settlement notice would be (a) mailed to each class member, (b) published in the national editions of The New York Times, The Wall Street Journal, USA Today, The Newark Star Ledger, and other regional newspapers, and (c) disseminated through television and radio advertising \"on stations having representative regional coverage.\" Stipulation of Settlement at 27-29. Finally, the outreach program established a six-day-a-week toll-free \"800\" number, staffed by specially trained personnel, to answer class member questions.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e The Task Force plan did not describe how its outreach program would be implemented. Fairness Opinion, 962 F. Supp. at 494.\n\n2. The Fairness Hearing\n\nThe district court held the fairness hearing on February 24, 1997.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e At that time the court heard oral argument from all parties who requested the opportunity to speak, including objectors. The district court also permitted appearances by several states and allowed the California Insurance Commissioner and the Florida Insurance Commissioner to appear as amicus curiae. The court allowed the Massachusetts Insurance Commissioner, the Massachusetts Attorney General and the Texas Insurance Commissioner to intervene under Rule 24(b). The New Jersey Department of Insurance appeared informally as amicus curiae, on its own behalf and on behalf of the Multi-State Life Insurance Task Force. 961Before the fairness hearing, Prudential reached\n\nagreements with the remaining state objectors - California, Florida, Texas and Massachusetts - whereby several enhancements were made to the Proposed Settlement. Among those were an automatic score of \"3\" where a claimant had a life insurance application containing an unauthorized signature, and consideration as one of the scoring criteria the fact that a claimant was over the age of sixty at the time of sale.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e These enhancements were subsequently incorporated into the settlement and made available to all claimants. Fairness Opinion, 962 F. Supp. at 473.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e The district court also took notice that these four states received, in addition to the negotiated enhancements, additional fines and penalties from Prudential which were paid to the states, and not to aggrieved policyholders.\n\nOn March 7, 1997 the able district court issued a summary Memorandum Opinion and Order certifying the class and approving the settlement as fair and reasonable, and ten days later filed a lengthy (almost 250 pages) and thorough opinion explaining its decision.\n\nII. ISSUES RAISED ON APPEAL AND STANDARDS OF REVIEW\n\nAppellants principally challenge five distinct elements of the settlement. First, they raise the threshold issue whether the district court had jurisdiction over this class action. Second, they challenge the court's certification of the settlement class. Third, they contest the district court's order approving the proposed settlement as fair and reasonable. Fourth, appellants take issue with the district court's $90 million award of attorneys' fees. Finally, they once more take aim at the district court's handling of this case, appealing the denial of their motion to disqualify under 28 U.S.C. §§ 455(a), 455(b)(1) and 455(b)(5)(iv).\n\n\"The decision of whether to approve a proposed settlement of a class action is left to the sound discretion of the district court.\" Girsh v. Jepson, 521 F.2d 153, 156 (3d Cir. 1975). Consequently, we will reverse the district court \"for a clear abuse of discretion.\" Id. at 156 n.7. In addition, the certification of a class and the award of reasonable attorneys' fees are also subject to an abuse of discretion standard. In re General Motors Corp. Pick-Up Truck Fuel Tank Prods. Liab. Litig., 55 F.3d 768, 782 (3d Cir. 1995) (\"G.M. Trucks\"). \"An appellate court may find an abuse of discretion where the `district court's decision rests upon a clearly erroneous finding of fact, an errant conclusion of law or an improper application of law to fact.' \" Id. at 783 (quoting International Union, UAW v. Mack Trucks, Inc., 820 F.2d 91, 95 (3d Cir. 1987)). Our review of jurisdictional issues, however, is plenary. Anthuis v. Colt Indus. Operating Corp., 971 F.2d 999, 1002 (3d Cir. 1992).\n\nIII. JURISDICTION\n\nThe Krell and Johnson appellants contend the district court lacked subject matter jurisdiction over most of the class, including objectors. Additionally, they contend that there is no Article III \"case or controversy\" with respect to the class claims, and that the court's exercise of supplemental jurisdiction was improper.\n\nA. Subject Matter Jurisdiction\n\nAs an initial matter, the district court found it had subject matter jurisdiction over the named plaintiffs in this class action. In particular, the court found it had both federal question jurisdiction and diversity jurisdiction over the class, as well as supplemental jurisdiction under 28 U.S.C. § 1367. Fairness Opinion, 962 F. Supp. at 500.\n\nThe district court found exclusive federal question jurisdiction under 28 U.S.C. § 1331 based on the claims of named plaintiff Dorfner. Dorfner alleged violations of the federal securities laws, in particular Sections 10(b) and 20(a) of the Securities and Exchange Act, and Rule 10b-5 promulgated thereunder. In addition, approximately 30% of the policies at issue were registered securities, and thus fell within the court's federal question jurisdiction. The district court also found it had diversity jurisdiction over each of the named plaintiffs under 28 U.S.C. § 1332. All named plaintiffs were residents of different states from the defendants named in the complaint. Additionally, the named plaintiffs have each alleged more than $50,000 in losses as a result of Prudential's fraudulent scheme, and thus meet the \"amount-in-controversy\" requirement in effect at the time the complaint was filed.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\n\nThe primary jurisdictional objection raised on appeal relates to the district court's assertion of supplemental jurisdiction over the absentee class members on the basis of 28 U.S.C. § 1367. The court found that all of the class claims are \"inextricably factually intertwined\" because they are all \"premised upon a common course of conduct by Prudential . . . relat[ing] to the same alleged company wide development and implementation of the patently fraudulent sales techniques.\" Fairness Opinion, 962 F. Supp. at 501. Noting that § 1367 applies to both pendent parties and pendent claims, the district court concluded it had the discretion to exercise supplemental jurisdiction over the entire dispute and the proposed settlement on the basis of its initial federal question jurisdiction. The court also found it could exercise supplemental jurisdiction over the state claims on the basis of its diversity jurisdiction. Id. at 505.\n\nAppellants dispute both of these asserted grounds for supplemental jurisdiction. They contend the federal claims of plaintiff Dorfner, the claims of persons with purely state law claims, and the panoply of \"other\" sales claims do not derive from a common nucleus of operative fact, and thus the district court cannot exercise supplemental jurisdiction based on its jurisdiction over plaintiffs' federal securities claims.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e Johnson Brief at 4. Appellants also contest the district court's assertion of supplemental jurisdiction based on its initial diversity jurisdiction. They contend that, in order for the district court to exercise supplemental jurisdiction, each putative class member must meet the amount-in-controversy requirement of § 1332. Johnson Brief at 7-8 (citing Zahn v. International Paper Co., 414 U.S. 291 (1973)). Finally, appellants argue the district court's application of 28 U.S.C. § 1367 to assert jurisdiction over the proposed class violates Article III.\n\nThe settling parties respond with two arguments. First, they claim the district court correctly exercised supplemental jurisdiction based on its original federal question jurisdiction because all class members' claims arise from the same case or controversy. Thus there is no need to address the question of the district court's diversity jurisdiction. In the alternative, they argue that appellants' reliance on Zahn is misplaced, and that§ 1367 overruled Zahn's requirement that all class members meet the amount-in-controversy requirement of § 1332. Consequently, the court could properly exercise supplemental jurisdiction based on its original diversity jurisdiction.\n\n1. Federal Question Jurisdiction as a Basis of r Supplemental Jurisdiction\n\nNone of the parties contest the district court's assertion of federal question jurisdiction \"over [plaintiff] Dorfner's federal securities claims, and the federal securities claims of other similarly situated plaintiffs.\" Fairness Opinion, 962 F. Supp. at 500. Instead they focus their arguments on the court's exercise of supplemental jurisdiction.\n\nBefore enactment of § 1367, a district court could only exercise jurisdiction over claims which did not satisfy the requirements of §§ 1331 and 1332 by applying the principles of ancillary or pendent jurisdiction. The concept of pendent jurisdiction, as explained by the Supreme Court in United Mine Workers v. Gibbs, 383 U.S. 715 (1966), allowed a court to hear non-federal claims over which it did not have diversity jurisdiction provided those claims shared a \"common nucleus of operative fact\" with the claims that supported the court's original jurisdiction. But this extension of jurisdiction was permitted only when it would promote \"judicial economy, convenience and fairness to litigants.\" 383 U.S. at 726.\n\nWhile pendent jurisdiction allowed district courts to hear additional, non-federal claims which were part of the same \"case\" as those claims within the court's original jurisdiction, the doctrine of ancillary jurisdiction allowed courts to hear claims brought against additional parties. Ancillary jurisdiction, however, was more limited than its counterpart. In Owen Equip. \u0026 Erection Co. v. Kroger, 437 U.S. 365 (1978), the Court held ancillary jurisdiction could not be asserted when to do so was contrary to the rule of complete diversity. Further, the Court found the doctrine of ancillary jurisdiction did not allow the addition of parties who were not within the court's original jurisdiction, even in cases in which the district court had exclusive federal jurisdiction. Finley v. United States, 490 U.S. 545 (1989). But the Finley Court noted the cases addressing the scope of ancillary and pendent jurisdiction were not entirely consistent, and offered the possibility that \"[w]hatever we say regarding the scope of jurisdiction conferred by a particular statute can of course be changed by Congress.\" Id. at 556.\n\nCongress responded by passing the Judicial Improvements Act of 1990, which added § 1367 to the jurisdictional arsenal of the federal courts and essentially overruled Finley. Section 1367 combined the two concepts of pendent and ancillary jurisdiction under the rubric of \"supplemental\" jurisdiction, providing for jurisdiction \"in any civil action of which the district courts have original jurisdiction\" over \"all other claims that are so related . . . that they form part of the same case or controversy under Article III.\" 28 U.S.C. 1367(a). The statute explicitly included \"claims that involve the joinder or intervention of additional parties.\" Id.\n\nThe enactment of § 1367 has elicited a strong reaction from legal scholars. Some have argued that Congress intended § 1367 to be interpreted broadly, and hoped to encourage the federal courts to hear claims which might otherwise have fallen outside of their reach. See John B. Oakley, Recent Statutory Changes in the Law of Federal Jurisdiction and Venue: The Judicial Improvements Acts of 1988 and 1990, 24 U.C. Davis L. Rev. 735, 766 (Spring 1991) (\"By the juxtaposition of sections 1367(a) and 1367(c) Congress appears to have created a strong presumption in favor of the exercise of supplemental jurisdiction.\"); 2 Herbert B. Newberg and Alba Conte, Newberg on Class Actions, § 6.11, at 6-45 (3d ed. 1992) (\"[T]here are multiple reasons to expect that the rulings of Zahn v. International Paper Co., requiring allegations that each class member satisfied jurisdictional amount requirements in diversity actions, have been legislatively bypassed.\"). Others have felt that § 1367 is constrained by prior Supreme Court decisions, and does not expand the courts' jurisdictional grant. Thomas D. Rowe, Jr., Stephen B. Burbank \u0026 Thomas M. Mengler, Compounding or Creating Confusion About Supplemental Jurisdiction? A Reply to Professor Freer, 40 Emory L.J. 943, 960 n.90 (Fall 1991) (acknowledging that while a facial construction of § 1367 would appear to overrule Zahn, \"the legislative history was an attempt to correct the oversight\"); Denis F. McLaughlin, The Federal Supplemental Jurisdiction Statute - A Constitutional And Statutory Analysis, 24 Ariz. St. L.J. 849, 973 (Fall 1992)(\"[Section] 1367 should be interpreted as effecting no change in the prior practice and continuing undisturbed the rule of Zahn.\"). Regardless of Congress's intent with respect to Zahn, it is clear that § 1367 does not abrogate the rule of law established in Gibbs, and thus any exercise of supplemental jurisdiction must meet the requirements of Article III's \"case or controversy\" standard. See H.R. Rep. No. 101-734 at n.15 (1990), reprinted in 1990 U.S.C.C.A.N. 6860, 6875 n.15 (stating that § 1367(a) \"codifies the scope of supplemental jurisdiction first articulated by the Supreme Court in United Mine Workers v. Gibbs\"); New Rock Asset Partners, L.P. v. Preferred Entity Advancements, Inc., 101 F.3d 1492, 1505 (3d Cir. 1996) (\"The Supreme Court delineated the modern constitutional bounds of pendent [now referred to as supplemental] jurisdiction in United Mine Workers v. Gibbs.\"); Oakley, 24 U.C. Davis L. Rev. at 764 (noting that under § 1367, the district court's exercise of supplemental jurisdiction \"extends to the limits of Article III, thus ratifying and incorporating the constitutional analysis of United Mine Workers v. Gibbs\").\n\nThere is no dispute the district court had jurisdiction over the federal securities claims alleged in the Second Amended Consolidated Complaint. Caterpillar, Inc. v. Williams, 482 U.S. 386, 392 (1987) (citing Gully v. First National Bank, 299 U.S. 109, 112-113 (1936)) (\"The presence or absence of federal-question jurisdiction is governed by the `well-pleaded complaint rule,' which provides that federal jurisdiction exists only when a federal question is presented on the face of the plaintiff 's properly pleaded complaint.\"). It is equally clear that, under § 1367, the district court could exercise supplemental jurisdiction over any claims which were part of the same Article III \"case or controversy\" as the federal securities claims. Consequently, our analysis turns on whether the claims asserted in the Second Amended Consolidated Complaint meet the standard established in Gibbs.\n\nUnder Gibbs, three requirements must be met for a court to exercise supplemental jurisdiction:\n\nThe federal claims must have substance sufficient to confer subject matter jurisdiction on the court. The state and federal claims must derive from a common nucleus of operative fact. But if considered without regard to their state or federal character, a plaintiff 's claims are such that he would ordinarily be expected to try them all in one judicial proceeding, then, assuming substantiality of the federal issues, there is power in the federal courts to hear the whole.\n\n383 U.S. at 725 (emphasis omitted) (footnote and internal citation omitted).\n\nA district court may not assert supplemental jurisdiction over state claims that are totally unrelated to the federal claims that form the basis of the court's jurisdiction. Lyon v. Whisman, 45 F.3d 758, 761 (3d Cir. 1995). In Lyon, the district court had original jurisdiction to hear claims under the Fair Labor Standards Act, and elected to exercise supplemental jurisdiction over state contract and tort claims. The federal claim involved the employer's failure to pay overtime wages, while the state claims related to a failure to pay certain bonuses. This Court ruled that the exercise of supplemental jurisdiction was inappropriate, because the only nexus between the state and federal claims was the employer/employee relationship, rather than the conduct underlying the claims.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e Id. at 764.\n\nThe Second Amended Consolidated Complaint alleges that Prudential engaged in a widespread scheme to defraud customers. As part of that scheme, Prudential allegedly used \"false and misleading sales presentations, policy illustrations, marketing materials, and other information approved, prepared and disseminated by Prudential to its nationwide sales force. Second Amended Consolidated Complaint at 3. According to plaintiffs, certain actions taken by Prudential in furtherance of that scheme violated § 10(b)\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e and § 20(a)\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e of the Securities and ExchangeAct. As noted, the district court agreed with the settling parties, finding that all of the class claims were \"inextricably intertwined\" because there was a common scheme to defraud.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\n\nWe agree. The Second Amended Consolidated Complaint clearly alleges that Prudential engaged in a common scheme to defraud. Each category of claims raised in the Complaint relied on the implementation of that scheme, the training of Prudential's agents in conformity with it, and the use of pre-approved materials to support it. While only one category of claims alleged in the Complaint involved violations of the federal securities laws, all of the claims derive from the same common scheme, and thus from the same \"nucleus of operative fact.\" That implementation of Prudential's scheme resulted in a variety of unlawful transactions does not negate the common basis they all shared. We recognize the need to scrutinize assertions of federal subject matter jurisdiction in these kinds of class actions where there are significant state law claims. But we believe the nexus between the federal and state claims is so close here that federal jurisdiction is appropriate. Consequently, we hold the district court properly exercised supplemental jurisdiction over the class members' state claims based on its federal question jurisdiction.\n\nOf course, § 1367 does not permit courts to take jurisdiction over tangentially related claims. The issue is whether there is a \"common nucleus of operative fact\" and whether the claims are part of the \"same case or controversy under Article III.\" Here the facts underlying the investment deception are so intertwined with the other misrepresentations and frauds that, given the allegations of the overall scheme, they have the same factual predicate, making extension of federal jurisdiction appropriate.\n\n2. Diversity Jurisdiction as a Basis for Supplemen tal Jurisdiction\n\nThe district court also found that it had supplemental jurisdiction under § 1367 based on its original diversity jurisdiction over named plaintiffs' claims under§ 1332. As noted, the named plaintiffs satisfy the prerequisites for diversity jurisdiction. None of the named plaintiffs is a citizen of the same state as any defendant, satisfying the complete diversity requirement, and each of the named plaintiffs has alleged damages in excess of $50,000, satisfying the amount in-controversy requirement. The more perplexing question is whether the remaining class members must also satisfy the requirements of diversity jurisdiction in order for the court to exercise supplemental jurisdiction over their claims.\n\nBefore enactment of § 1367, absentee class members seeking to establish the court's subject matter jurisdiction based on diversity of citizenship were not subject to the same requirements as the class representatives. According to the Supreme Court, the complete diversity requirement did not apply to absentee class members, but was satisfied so long as the named plaintiffs were completely diverse from defendants. Supreme Tribe of Ben Hur v. Cauble, 255 U.S. 356, 365-67 (1921). But the absentee class members were each subject to the same amount-in-controversy requirement as the named plaintiffs, and could not aggregate their claims in order to satisfy § 1332. Zahn, 414 U.S. at 301.\n\nAlthough the complete diversity rule of Supreme Tribe of Ben-Hur remains intact, the passage of § 1367 has raised serious questions about the continuing viability of Zahn. On the one hand, it is generally conceded that the plain language of § 1367 states a different amount-in-controversy rule from that set forth in Zahn.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e See, e.g., Russ v. State Farm Mut. Auto. Ins. Co., 961 F. Supp. 808, 817-20 (E.D. Pa. 1997). Section 1367(a) gives courts discretion to exercise supplemental jurisdiction in all cases where the original claim supporting federal jurisdiction and the additional claim are part of the same Article III case or controversy, including those additional claims involving the joinder of parties. At the same time, § 1367(b) establishes certain exceptions to this permissive rule in cases where the court's original jurisdiction is based solely on diversity. In particular, § 1367(b) prohibits federal courts from exercising supplemental jurisdiction over persons made parties under Rules 14, 19, 20, and 24, unless those additional claims independently satisfy § 1332. Under the principle of expressio unius est exclusio alterius, Congress's failure to include Rule 23 among the restrictions in subsection (b) would seem to indicate Congress did not intend to restrict the district court's exercise of supplemental jurisdiction in class actions. In addition, Zahn's critics contend that, from a policy standpoint, the decision runs counter to Supreme Tribe of Ben-Hur. They argue that while the complete diversity requirement upholds the very essence of diversity jurisdiction, the amount-in-controversy requirement is merely an administrative concept designed to limit the caseload of the federal judiciary. Consequently, they contend it would make little sense to create an exception to complete diversity in the context of class actions but to continue requiring all class members to meet the amount-in-controversy requirement. See Zahn, 414 U.S. at 309 (Brennan, J. Dissenting) (\"Particularly in view of the constitutional background on which the statutory diversity requirements are written, it is difficult to understand why the practical approach the Court took in Supreme Tribe of Ben-Hur must be abandoned where the purely statutory `matter in controversy' requirement is concerned.\").\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e By contrast, others contend § 1367 was never intended to eliminate the amount-in-controversy requirement for 661absentee class members established in Zahn. This argument relies heavily on the legislative history of the statute, in particular the House Judicial Committee Report that explicitly states § 1367 \"is not intended to affect the jurisdictional requirements of 28 U.S.C. § 1332 in diversity-only class actions, as those requirements were interpreted prior to Finley.\" H.R. Rep. No. 101-734 at 29 (1990), reprinted in 1990 U.S.C.C.A.N. 6860, 6875 (footnote omitted). The footnote to this section of the Report specifically refers to Supreme Tribe of Ben-Hur and Zahn, and supports the argument that the complete diversity and amount-in-jurisdiction rules of those cases survive the enactment of § 1367. Additionally, the Report of the Federal Courts Study Committee urges Congress to \"expressly authorize federal courts to hear any claim arising out of the same `transaction or occurrence' as a claim within federal jurisdiction, including claims, within federal question jurisdiction, that require the joinder of additional parties, namely, defendants against whom that plaintiff has a closely related state claim.\" Report of the Federal Courts Study Committee 47 (1990) (quoted in Russ, 961 F. Supp. at 815). The limited scope of the Committee's suggestion can be read as support for upholding the restrictions of Zahn.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e\n\nThe cases addressing this issue reflect this difference of opinion. The only two appellate courts to examine this question have both found the language of the statute controlling, and concluded that § 1367 overrules Zahn. See In re Abbott Laboratories, 51 F.3d 524, 528 (5th Cir. 1995); Stromberg Metal Works v. Press Mechanical, Inc., 77 F.3d 928, 930 (7th Cir. 1996). The Abbott Laboratories court reasoned that it could not \"search legislative history for congressional intent unless [it found] the statute unclear or ambiguous,\" and that in the absence of such ambiguity \"the statute is the sole repository of congressional intent.\" 51 F.3d at 528-9 (citing United States v. X-Citement Video, Inc., 513 U.S. 64, 68-71 (1994); West Virginia Univ. Hosps., Inc. v. Casey, 499 U.S. 83, 99-100 (1991)). Because it found the plain language of the statute unambiguous, the court concluded that \"under § 1367 a district court can exercise supplemental jurisdiction over members of a class, although they did not meet the amount-in-controversy requirement, as did the class representatives.\" Id. at 529.\n\nUnlike the class action facing the court in Abbott Laboratories, the Court of Appeals for the Seventh Circuit addressed this question in the context of two plaintiffs seeking to join an additional claim that did not meet the amount-in-controversy requirement. Stromberg, 77 F.3d at 930. The Stromberg court also reasoned that \"[w]hen text and legislative history disagree, the text controls,\" and allowed the exercise of supplemental jurisdiction in that instance. 77 F.3d at 931 (citing In re Sinclair, 870 F.2d 1340 (7th Cir. 1989)).\n\nMost of the district courts that have addressed this issue have concluded otherwise. These courts have relied primarily on the legislative history to find that Zahn is still good law. See, e.g., Russ, 961 F. Supp. at 817-20; Crosby v. America Online, Inc., 967 F. Supp. 257, 263-64 (N.D. Ohio 1997); Griffin v. Dana Point Condominium Ass'n, 768 F. Supp. 1299, 1301-02 (N.D. Ill. 1991). Judge Louis Pollak's opinion in Russ, while conceding that the plain language of the statute would appear to overrule Zahn, presents a persuasive analysis of the legislative history and the policy reasons supporting his Conclusion that Zahn is unaffected by the enactment of the supplemental jurisdiction statute.\n\nThe district court here followed the reasoning of Abbott Laboratories and concluded the plain language of § 1367 overruled Zahn. Consequently, the district court found it also had supplemental jurisdiction over the non-federal claims of absentee class members based on its diversity jurisdiction over the claims of the named plaintiffs.\n\nThe question is by no means an easy one. From a policy standpoint, it can be argued that national (interstate) class actions are the paradigm for federal diversity jurisdiction because, in a constitutional sense, they implicate interstate commerce, foreclose discrimination by a local state, and tend to guard against any bias against interstate enterprises. Yet there are strong countervailing arguments that, at least under the current jurisdictional statutes, such class actions may be beyond the reach of the federal courts.\n\nRegardless of the relative strength of the competing arguments over Zahn's continued viability, we need not enter the fray. Because we have found that the district court properly exercised supplemental jurisdiction over class members' non-federal claims based on its original federal question jurisdiction, we need not decide whether the district court properly found it had supplemental jurisdiction based on its exercise of diversity jurisdiction over the claims of the named plaintiffs. The continued viability of Zahn and its effect on class actions will undoubtedly be addressed in the near future, either by the Supreme Court or by Congress, and at present we need not resolve the issue.\n\nB. Personal Jurisdiction\n\nThe district court also found it had personal jurisdiction over all members of the proposed class. We agree. In the class action context, the district court obtains personal jurisdiction over the absentee class members by providing proper notice of the impending class action and providing the absentees with the opportunity to be heard or the opportunity to exclude themselves from the class. Phillips Petroleum Co. v. Shutts, 472 U.S. 797, 811-12 (1985). The combination of reasonable notice, the opportunity to be heard and the opportunity to withdraw from the class satisfy the due process requirements of the Fifth Amendment. Consequently, silence on the part of those receiving notice is construed as tacit consent to the court's jurisdiction. Id.; see also Carlough v. Amchem Prods., Inc., 10 F.3d 189, 199 (3d Cir. 1993).\n\nThe district court here directed that notice of the class action be sent to all persons who owned one or more Prudential insurance policies between 1982 and the present. Initially, we note the provision of individual notice to each class member is by no means typical of the notice provided in most class actions, and certainly qualifies as unprecedented. The notice provided here met the requirements for personal jurisdiction. It explained that each individual receiving notice was a member of the proposed class, and clearly set forth the procedure for opting out of the class. The notice also contained the proposed release, which explained that all claims would be waived if the individual did not elect to opt out of the class. Consequently, we find the members of the proposed class were adequately informed of their potential claims against Prudential, and the district court had personal jurisdiction over those members of the putative class who did not timely opt out.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e\n\nC. Article III\n\nAppellants also dispute the district court's finding that this case qualified as a \"case or controversy\" under Article III. Fairness Opinion, 962 F. Supp. at 505-6. Appellants contend that, \"whether analyzed under the feigned case doctrine or as a failure of Article III standing,\" the inclusion of both injured and uninjured policyholders in the certified class violates the case or controversy requirement of Article III because the parties have not suffered an \"injury in fact.\" Public Citizen Brief at 16. Appellants also contend the inclusion and release of claims arising out of not only the three primary activities complained of, but also based on \"other improper sales practices,\" disqualifies the action as a case or controversy under Article III. Id. at 16-17. Amicus curiae Public Citizen further argues that the record is devoid of information concerning these other improper sales practices, that no plaintiff has claimed an injury as a result of them, and that there was never an intent to litigate them. Consequently, \"there never has been any live controversy between Prudential and the `other improper sales practices' class.\" Id. at 17. The district court addressed appellants' contentions and found them to be without merit. Fairness Opinion, 962 F. Supp. at 506.\n\nWe agree with the district court. Article III requires that federal courts may only adjudicate an actual \"case or controversy.\" As the district court noted, whether an action presents a \"case or controversy\" under Article III is determined vis-a-vis the named parties. Id. at 506 (citing Allee v. Medrano, 416 U.S. 802 (1974)). \"Once threshold individual standing by the class representative is met, a proper party to raise a particular issue is before the court, and there remains no further separate class standing requirement in the constitutional sense.\"1 Newberg on Class Actions § 2.05 at 2-29 (3d Ed. 1992). The record in this case is replete with examples of the adversarial nature of these proceedings, and it is clear that all of the named representatives have a valid \"case or controversy\" with respect to Prudential's alleged fraudulent sales scheme. There is also ample evidence that each named party has suffered an \"injury in fact\" as a result of Prudential's sales practices and therefore has standing to bring suit. Thus, the named plaintiffs satisfy Article III. The absentee class members are not required to make a similar showing, because once the named parties have demonstrated they are properly before the court, \"the issue [becomes] one of compliance with the provisions of Rule 23, not one of Article III standing.\" Goodman v. Lukens Steel Co., 777 F.2d 113, 122 (3d Cir. 1985), aff'd, 482 U.S. 656 (1987).\n\nWe also note that, with respect to appellants' \"feigned case\" argument, the notice and the ADR process here were designed to determine which members of the class could demonstrate a compensable injury as a result of Prudential's allegedly deceptive practices. To require the named plaintiffs to determine beforehand which of the 8 million policyholders were deceived and provide notice to only those persons would eliminate the viability of the class action device.\n\nWe also disagree that the parties never intended to litigate the \"other sales practices\" claims. As discussed, those claims, along with the three categories of specific violations, were all intertwined as part of the common scheme allegedly employed by Prudential. If the parties litigated the churning, vanishing premium and investment plan claims, they would have litigated their \"other sales practice\" claims as well.\n\nBased on the foregoing, we will affirm the district court's exercise of jurisdiction.\n\nIV. CLASS CERTIFICATION\n\nA. Settlement-Only Class Certification\n\nUnder the Federal Rules of Civil Procedure, a district court generally makes a determination whether to certify a class \"as soon as practicable after the commencement of an action brought as a class action.\" Fed. R. Civ. P. 23(c)(1). This certification may be conditional, and may be modified as needed. Id. Although the initial complaint in this case was filed on October 24, 1995, the district court delayed consideration of the certification issue pending the outcome of the Task Force investigation.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e\n\nOn October 28, 1996, the district court conditionally certified the proposed class for settlement purposes only. Reviewing the class action device historically, the Supreme Court noted that \"[a]mong current applications of Rule 23(b)(3), the `settlement only' class has become a stock device. . . . all Federal Circuits recognize the utility of Rule 23(b)(3) settlement classes.\" Amchem Prods. Inc. v. Windsor, ___ U.S. ___, 117 S. Ct. 2231, 2247 (1997) (citations omitted); see also G.M. Trucks, 55 F.3d at 786-800 (examining the arguments for and against the use of settlement classes). But drawing on Judge Edward Becker's comprehensive opinion in Georgine v. Amchem Products, Inc., 83 F.3d 610 (3d Cir. 1996),\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e the Amchem Court noted the special problems encountered with settlement classes. Although as a general matter it approved the certification of classes for settlement purposes only, the Supreme Court cautioned that the certification inquiry is still governed by Rule 23(a) and (b), and that \"[f]ederal courts . . . lack authority to substitute for Rule 23's certification criteria a standard never adopted - that if a settlement is`fair,' then certification is proper.\" Amchem, 117 S. Ct. at 2248-49.\n\nConsequently, a district court must first find a class satisfies the requirements of Rule 23, regardless whether it certifies the class for trial or for settlement. Amchem, 117 S. Ct. at 2248 (\"The safeguards provided by the Rule 23(a) and (b) class-qualifying criteria, we emphasize, are not impractical impediments - shorn of utility - in the settlement class context.\"); G.M. Trucks, 55 F.3d at 799-800 (\"In sum, `a class is a class is a class,' and a settlement class, if it is to qualify under Rule 23, must meet all of its requirements.\").\n\nThe district court may take the proposed settlement into consideration when examining the question of certification. Amchem, 117 S. Ct. at 2248.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e In Amchem, the Supreme Court held \"a district court [determining whether to certify a class for settlement purposes only] need not inquire whether the case, if tried, would present intractable management problems . . . for the proposal is that there be no trial.\" Id. at 2248. But at the same time the Court noted that \"other specifications of the rule - those designed to protect absentees by blocking unwarranted or overbroad class definitions - demand undiluted, even heightened, attention in the settlement context.\" Id. In particular, the Court emphasized the importance of applying the class certification requirements of Rules 23(a) and (b) separately from its fairness determination under Rule 23(e). The Court noted that \"[i]f a common interest in a fair compromise could satisfy the predominance requirement of Rule 23(b)(3), that vital prescription would be stripped of any meaning in the settlement context.\" Id. at 2249-50.\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e At the same time, the Court stressed the requirements found under Rule 23(a), in particular the stricture that\"the representative parties will fairly and adequately protect the interests of the class.\" Indeed, the key to Amchem appears to be the careful inquiry into adequacy of representation. Id. at 2248 (\"Subdivisions (a) and (b) [of Rule 23] focus court attention on whether a proposed class has sufficient unity so that absent members can fairly be bound by decisions of class representatives. That dominant concern persists when settlement, rather than trial, is proposed.\")\n\nWith this standard in mind, we will review the district court's analysis of the Rule 23 certification criteria.\n\nB. Class Certification under Rule 23\n\n\"Rule 23 is designed to assure that courts will identify the common interests of class members and evaluate the named plaintiff 's and counsel's ability to fairly and adequately protect class interests.\" G.M. Trucks, 55 F.3d at 799. In order to be certified, a class must satisfy the four requirements of Rule 23(a): (1) numerosity; (2) commonality; (3) typicality; and (4) adequacy of representation.\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e If the Rule 23(a) criteria are satisfied, the court must also find that the class fits within one of the three categories of class actions defined in Rule 23(b).\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e In this instance the parties sought to certify the class under Rule 23(b)(3).\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e In order to pass muster under Rule 23(b)(3), the district court must determine that common questions of law or fact predominate and that the class action mechanism is the superior method for adjudicating the case. The requirements of subsections (a) and (b) are designed to insure that a proposed class has \"sufficient unity so that absent class members can fairly be bound by decisions of class representatives.\" Amchem , 117 S. Ct. at 2248; see also Hassine v. Jeffes, 846 F.2d 169, 177 n.4 (3d Cir. 1988) (\" `[C]ommonality' like`numerosity' evaluates the sufficiency of the class itself, and `typicality' like `adequacy of representation' evaluates the sufficiency of the named plaintiff . . . .\"). As noted, these class certification requirements are to be determined independently from the court's determination of the \"fairness\" of the proposed settlement under Rule 23(e). \u003cspan class=\"fnref\"\u003e45\u003c/span\u003e Amchem, 117 S. Ct. at 2248 (Rule 23(e) \"was designed to function as an additional requirement, not a superseding direction, for the`class action' to which Rule 23(e) refers is one qualified for certification under Rule 23(a) and (b).\").\n\n1. The Rule 23(a) Criteria\n\na. Numerosity\n\nThe court must find that the class is \"so numerous that joinder of all members is impracticable.\" Fed. R. Civ. P. 23(a)(1). No one has challenged the district court'sfinding that the proposed class satisfies the numerosity requirement. Indeed, the proposed class consists of more than 8 million present and former policyholders.\n\nb. Commonality\n\nThe commonality prong of Rule 23(a) asks whether\"there are questions of law or fact common to the class.\" Fed. R. Civ. P. 23(a)(2).\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e The district court found the proposed class easily satisfied the commonality requirement, citing several common factual and legal issues which the class members would need to establish in order to prove Prudential's liability.\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e Fairness Opinion, 962 F. Supp. at 512. The district court also noted that the MDL Transfer Order recognized that the transferred actions \"involve common questions of fact . . . involv[ing] allegations that deceptive life insurance sales practices occurred or were encouraged as a [sic] result of some larger scheme or schemes organized by Prudential.\" Id. (quoting August 3, 1995 Transfer Order at 1-2). Finally, the court found Prudential had asserted affirmative defenses which were common to all class members, and independently would satisfy the predominance requirement. Id. at 512-13.\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e\n\nWe believe the court's finding that the proposed class satisfied the commonality requirement was within its sound discretion. A finding of commonality does not require that all class members share identical claims, and indeed \"factual differences among the claims of the putative class members do not defeat certification.\" Baby Neal v. Casey, 43 F.3d 48, 56 (3d Cir. 1994) (citing Eisenberg v. Gagnon, 766 F.2d 770 (3d Cir. 1985)).\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e\"The commonality requirement will be satisfied if the named plaintiffs share at least one question of fact or law with the grievances of the prospective class.\" Id. As the district court found, the allegations in the Second Amended Consolidated Complaint raise numerous issues which all members of the class would need to demonstrate in order to succeed at trial. Consequently, the proposed class satisfies Rule 23(a)(2).\n\nc. Typicality\n\nThe district court found the claims of the class representatives were typical of the class as a whole. First, the court noted all of the named plaintiffs have alleged either churning, vanishing premium, or investment plan claims, or some combination of the three. Second, it relied on the \"prominent guiding thread through all plaintiffs' claims - Prudential's scheme to defraud\" to support its conclusion that the claims of the named plaintiffs are typical of the class as a whole. Fairness Opinion, 962 F. Supp. at 518. The court rejected the argument that\"the class fails for lack of typicality because no class representative claims to have been injured by `other improper sales practices.' \" Id. The court reasoned that the \"class members injured by `other fraudulent sales practices' have suffered the same injury - they are victims of Prudential's deception - and have suffered the same generic type of harm - they have economic damages - as the named plaintiffs,\" thereby satisfying the typicality requirement. Id. at 519 (citing General Tel. Co. of Southwest v. Falcon, 457 U.S. 147, 159 (1982)).\n\nOn appeal, Krell reasserts his argument that the inclusion of the \"other claims\" defeats afinding of typicality. In particular, Krell contends the named plaintiffs' claims cannot be representative of the class because the \"other claims\" are not identified. Krell Brief at 29; see also Public Citizen Brief at 13-16. Additionally, Krell contends the court failed to consider the variations among the laws of the 50 states, making its typicality analysis inadequate.\u003cspan class=\"fnref\"\u003e50\u003c/span\u003e Amicus Public Citizen, relying on Falcon, argues plaintiffs must \"show that the plaintiff class ha[s] been injured in the same manner as ha[ve] the named representative[s].\" Public Citizen Brief at 15 (emphasis omitted).\n\n\"The concepts of commonality and typicality are broadly defined and tend to merge.\" Baby Neal, 43 F.3d at 56 (citing 7A Charles A. Wright, et al., Federal Practice and Procedure § 1764, at 247 (1986)). The typicality requirement is designed to align the interests of the class and the class representatives so that the latter will work to benefit the entire class through the pursuit of their own goals. Id. at 57 (\"The typicality inquiry is intended to assess whether the action can be efficiently maintained as a class and whether the named plaintiffs have incentives that align with those of absent class members so as to assure that the absentees' interests will be fairly represented.\"); 1 Newberg on Class Actions, § 3.13. In this respect the commonality and typicality requirements both seek to ensure that the interests of the absentees will be adequately represented. Falcon, 457 U.S. at 157 n.13. However, \"neither of these requirements mandates that all putative class members share identical claims.\" Baby Neal, 43 F.3d at 56; Hassine v. Jeffes, 846 F.2d at 176-77; Weiss v. York Hosp., 745 F.2d 786, 809 (3d Cir. 1984), cert. denied, 470 U.S. 1060 (1985). In addition, \"factual differences among the claims of the putative class members do not defeat certification.\" Baby Neal, 43 F.3d at 56.\n\nWe believe the district court's typicality analysis is correct. The named plaintiffs, as well as the members of the proposed class, all have claims arising from the fraudulent scheme perpetrated by Prudential. That overarching scheme is the linchpin of the Second Amended Consolidated Complaint, regardless whether each class member alleges a churning claim, a vanishing premium claim, an investment plan claim, or some other injury falling within the category of \"other sales\" claims. \"Commentators have noted that cases challenging the same unlawful conduct which affects both the named plaintiffs and the putative class usually satisfy the typicality requirement irrespective of the varying fact patterns underlying the individual claims.\" Baby Neal, 43 F.3d at 58. Consequently, the factual distinctions among and between the named plaintiffs and the 8 million putative class members do not defeat a finding of typicality. \"[E]ven relatively pronounced factual differences will generally not preclude a finding of typicality where there is a strong similarity of legal theories\" or where the claim arises from the same practice or course of conduct. Id.\n\nThis Conclusion is further buttressed by the Supreme Court's holding in Falcon. The Supreme Court reversed certification of a class of Mexican-Americans who were challenging their employers hiring and promotion decisions on typicality grounds.\u003cspan class=\"fnref\"\u003e51\u003c/span\u003e Falcon, 457 U.S. at 157-59. Krell relies on Falcon for the proposition that\"across-the-board\" classes do not satisfy Rule 23. Krell Brief at 27-28. We disagree. Falcon did not strike down \"across-the-board\" classes per se, and, in fact, it agreed\"with the proposition underlying the across-the-board rule - that racial discrimination is by definition class discrimination.\" Falcon, 457 U.S. at 157. The Court nonetheless reversed the class certification because the district court had improperly presumed that Falcon's claims were typical of the class claims. In particular, the Court emphasized that Falcon's claim was based on the theory of disparate treatment, while the class claims relied on the theory of disparate impact. Consequently, Falcon would need to \"prove much more than the validity of his own claim\" in order to prove the claims of the absentee class members, and thus his claims were not typical of the class. Id. at 158.\n\nThe present case is readily distinguishable. Unlike the plaintiff in Falcon, the named plaintiffs here have not relied on allegations that they were singled out and defrauded by Prudential. They have instead alleged that they suffered harm as the result of the same company-wide conduct that injured the absentee class members. The various forms which their injuries may take do not negate a finding of typicality, provided the cause of those injuries is some common wrong. Baby Neal, 43 F.3d at 58 (citing Falcon, 457 U.S. at 157-59) (\"Where an action challenges a policy or practice, the named plaintiffs suffering one specific injury from the practice can represent a class suffering other injuries, so long as all the injuries are shown to result from the practice.\"). In this instance, the alleged common scheme provides an appropriate basis for a finding of typicality. Since all members of the class would need to demonstrate the existence of this scheme, their interests are sufficiently aligned that the class representatives can be expected to adequately pursue the interests of the absentee class members. Amchem, 117 S. Ct. at 2248 (Rule 23 asks \"whether a proposed class has sufficient unity so that absent class members can fairly be bound by decisions of class representatives\").\n\nd. Adequacy of Representation\n\nThe final Rule 23(a) prerequisite encompasses two distinct inquiries designed to protect the interests of absentee class members. First, the adequacy of representation inquiry \"tests the qualifications of the counsel to represent the class.\" G.M. Trucks, 55 F.3d at 800. Second, it \"serves to uncover conflicts of interest between named parties and the class they seek to represent.\" Amchem, 117 S. Ct. at 2250. The district court found that both class counsel and the named plaintiffs satisfied these tests.\n\nWith respect to class counsel, the court found that plaintiffs' counsel were highly competent and experienced class action attorneys, and had pursued the interests of the class vigorously. Fairness Opinion, 962 F. Supp. at 519-20. With respect to the class representatives, the court found named plaintiffs' interest in proving Prudential's\"knowledge and orchestration of the scheme to defraud\" and their \"interest in obtaining relief commensurate with individual injury,\" as well as punitive damages, demonstrates that \"there are no disparate interests to impair plaintiffs' incentive to prosecute fully all aspects of their claims against Prudential.\" Id. at 521.\n\nKrell contests the district court's analysis on several grounds. First, Krell disputes the district court'sfinding that class counsel adequately served the interests of the class. In particular, Krell argues that class counsel failed to take adequate discovery, and that an improper \"clear sailing\" fee agreement between class counsel and Prudential created an impermissible conflict of interest.\u003cspan class=\"fnref\"\u003e52\u003c/span\u003e Krell Brief at 19-21, 51-53.\n\nSecond, Krell contends the inclusion of the category of \"other claims\" defeats a finding of adequate representation. Krell argues because policyholders have an equity interest in any \"surplus\" of Prudential, the expansion of the class to include policyholders with unidentified \"other claims,\" whose interests were \"adverse to those with asserted claims,\" created a detriment on behalf of the\"other\" policyholders for the benefit of those with asserted claims. According to Krell, this conflict destroys the adequacy of named plaintiffs' representation.\n\nThird, Krell repeats his argument that the court's failure to consider the variations among the laws of the 50 states demonstrates that there was no adequate protection of the claims of absentees. In particular, Krell claims there was a conflict between class members with replacement claims and those without, so that the district court should have created a subclass of replacement claimants.\u003cspan class=\"fnref\"\u003e53\u003c/span\u003e Finally, both Krell and Public Citizen argue the proposed class improperly includes a subset of \"futures\" claimants, thereby running afoul of Amchem.\n\nWe believe the district court exercised its sound discretion when it found class counsel and the named plaintiffs adequately represent the class. First, we believe class counsel vigorously pursued this class action. Both the uncapped nature of the proposed settlement and the \"unprecedented\" outreach program indicate that class counsel and the named plaintiffs have attempted to serve the best interests of the class as a whole. Further, we agree with the district court's finding that the attorneys' fee arrangement between class counsel and Prudential did not affect the adequacy of representation. See (infra) § VI.C.1.\n\nSecond, we also agree with the district court that the named plaintiffs adequately represent the interests of the absentee class members. As discussed, the crux of this class action is the allegation that Prudential engaged in a scheme to defraud policyholders by means of company-wide deceptive sales practices. The named parties, like the members of the class, would need to establish this scheme in order to succeed on any of the claims in the Second Amended Consolidated Complaint. Even those class members with \"other\" claims share the common task of demonstrating the existence and implementation of this scheme. Consequently, we believe the proposed class satisfies the adequacy of representation requirement of Rule 23(a).\n\nWe also reject the argument that the class as constituted included persons who are currently unaware of their injury, and that this \"futures\" class is barred under Amchem. Amchem, of course, found the proposed class did not meet the adequacy of representation standard because the interests of those with present injuries differed from those with \"futures\" claims. Amchem, 117 S. Ct. at 2251 (finding that the economic interest of the currently injured claimants \"tugs against the interest of the exposure-only plaintiffs\"). But Amchem is easily distinguished on its facts. Unlike the \"exposure-only\" plaintiffs in Amchem, the class members here need not wait to determine if they have been harmed by Prudential's fraudulent sales practices. There is no \"future\" manifestation of injury, because any injury suffered by a member of the class has already occurred. Having received notice of the pending class action and the availability of relief, members of the class can determine whether they have been victims of Prudential's fraud, either through a review of their records or by calling the toll-free number established by the settling parties. Consequently, the district court exercised its sound discretion infinding the proposed class meets the adequacy of representation requirement of Rule 23(a)(4).\n\n2. The Rule 23(b) Criteria\n\nIn order to certify an opt-out class under Rule 23(b)(3) the district court must make two additional findings: predominance and superiority. Issues common to the class must predominate over individual issues, and the class action device must be superior to other means of handling the litigation. The district court found both requirements were satisfied.\n\na. Predominance\n\nThe Supreme Court's recent decision in Amchem addressed the application of the predominance prong to \"settlement only\" classes. Although the Court made clear that consideration of the proposed settlement was proper when making a decision on class certification, it also placed limits on the weight to be accorded to the settlement. In particular, Amchem rejected the idea that the potential benefits of settlement are relevant to the predominance inquiry. According to the Court, the predominance \"inquiry trains on the legal or factual questions that qualify each member's case as a genuine controversy, questions that pre-exist any settlement.\" Amchem, 117 S. Ct. at 2249. The court noted the \"claims and defenses\" relevant to both the predominance test and the Rule 23(a)(4) adequacy of representation inquiry \"refer to the kinds of claims or defenses that can be raised in courts of law as part of an actual or impending law suit.\" 117 S. Ct. at 2249 n.18 (quoting Diamond v. Charles, 476 U.S. 54, 76-77 (1986) (O'Connor, J. Concurring in part and Concurring in judgment)).\n\nIn its predominance determination, the court focused primarily on plaintiffs' allegation that Prudential engaged in a common course of conduct by which it defrauded class members, and concluded that \"[w]here many purchasers have been defrauded over time by similar misrepresentations, or by a common scheme to which alleged non-disclosures related, courts have found that the purchasers have a common interest in determining whether the defendant's course of conduct is actionable.\" Fairness Opinion, 962 F. Supp. at 511 (citations omitted).\n\nThe district court also rejected the argument that claimants' need to demonstrate reliance destroyed predominance, reasoning that \"reliance is an issue secondary to establishing the fact of defendant's liability.\" Id. at 516 (citing 1 Newberg § 4.26 at 4-104) (\"Challenges based on . . . reliance have usually been rejected and will not bar predominance satisfaction because [reliance pertains] to the right of a class member to recover in contrast to underlying common issues of the defendant's liability.\"). Additionally, the court noted that\"most of the plaintiffs' claims do not even involve a reliance element,\" including their claims for breach of contract, breach of implied obligation of good faith and fair dealing, negligence, negligent training and supervision, and unjust enrichment. Id. Finally, the court found that, because \"plaintiffs' fraud-based claims stem largely from misleading omissions,\" reliance can be presumed. Id.\n\nThe district court also distinguished this case from Georgine. First, the court reasoned that \"Prudential's alleged intentional use of the fraudulent sales tactics provides the `single central issue' lacking\" in Georgine. Id. at 511 n.45. Whereas Georgine involved a variety of claims encompassing scores of individual issues, a trial in this instance would be focused on Prudential management's conduct. Id. Second, the court noted the class here is comprised of persons who purchased one type of product (life insurance policies) from one company, in contrast to the Georgine class members who were exposed to different asbestos-containing products manufactured by different companies. Finally, the district court noted the class here lacked \"futures\" plaintiffs, because \"class members are readily identifiable and have already suffered injury by the purchase of a product that was misrepresented.\" Id.\n\nAs the Supreme Court noted in Amchem, \"[p]redominance is a test readily met in certain cases alleging consumer or securities fraud or violations of the antitrust laws. . . . [e]ven mass tort cases arising from a common cause or disaster may, depending upon the circumstances, satisfy the predominance requirement.\" Amchem, 117 S. Ct. at 2250 (citing Adv. Comm. Notes, 28 U.S.C. App., p. 697). This case, involving a common scheme to defraud millions of life insurance policy holders, falls within that category. The district court's opinion sets forth a litany of common issues which the class must demonstrate in order to prevail. See supra § IV.B.1 and n.47-48. While individual questions may arise during the course of this litigation, we agree with the district court that the presence of individual questions does not per se rule out a finding of predominance. In particular, the \"presence of individual questions as to the reliance of each investor does not mean that the common questions of law and fact do not predominate.\" Eisenberg v. Gagnon, 766 F.2d 770, 786 (3d Cir. 1985).\n\nKrell contends the district court did not conduct a proper analysis under Rule 23(b)(3), and instead \"presumed\" predominance by finding the central issue in this case was nationwide deceptive conduct by Prudential's management. We disagree. A review of the district court's fairness belies the contention that it merely presumed predominance. See Fairness Opinion, 962 F. Supp. at 510-17. The district court's finding that common issues predominated in this case was within its sound discretion, was supported by the record, and was amply demonstrated in its opinion.\n\nKrell also reasserts his argument that the class here suffers the same defects as the class of asbestos plaintiffs in Amchem. We find the district court's analysis of this comparison convincing. The two cases are markedly different, and easily distinguished. The Amchem class failed the predominance inquiry because of the disparate questions facing class members, based in part on their differing levels of exposure, their differing medical histories, and the presence of exacerbating conditions such as smoking. Of course, the complexity of a case alleging physical injury as a result of asbestos exposure differs greatly from a case alleging economic injury as a result of deceptive sales practices. The elements of proof are less difficult when the vagaries of medical testimony and scientific expertise are removed from consideration. Furthermore, the Amchem class was further undermined by the schism between the differing medical needs of currently injured class members and exposure-only or \"futures\" claimants. As noted, there is no \"futures\" class in this case.\n\nWe also reject Krell's contention that predominance is defeated because the class claims are subject to the laws of the fifty states. Courts have expressed a willingness to certify nationwide classes on the ground that relatively minor differences in state law could be overcome at trial by grouping similar state laws together and applying them as a unit. This Court has affirmed a class certification based on a \"creditable showing, which apparently satisfied the district court, that class certification [did] not present insuperable obstacles\" relating to variances in state law. See In re School Asbestos Litigation, 789 F.2d 996, 1010 (3d Cir. 1986).\u003cspan class=\"fnref\"\u003e54\u003c/span\u003e In this instance Krell has failed to demonstrate that the differences in applicable state law were sufficient to foreclose a similar approach.\u003cspan class=\"fnref\"\u003e55\u003c/span\u003e In support of class certification, plaintiffs compiled \"a series of charts setting forth comprehensive analyses of the various states' laws potentially applicable to their common law claims.\" Fairness Opinion, 962 F. Supp. at 525. The court concluded that the \"elements of these common law claims are substantially similar and any differences fall into a limited number of predictable patterns.\" Id. The district court \"considered the choice of law issues that confront[ed] the Court and conclude[d] that these choice of law issues [did] not render this class action unmanageable.\" Id. We agree.\n\nb. Superiority\n\nRule 23(b)(3) sets out several factors relevant to the superiority inquiry. \u003cspan class=\"fnref\"\u003e56\u003c/span\u003e The district court addressed these factors and found the class action mechanism was superior to other possible means of adjudicating this case. First, the court examined the relatively modest size of individual claims and the sheer volume of those claims in the aggregate, and concluded a class action presented the \"only rational avenue of redress for many class members.\" Id. at 523. Second, the court reasoned the relatively small number of individual suits pending against Prudential indicated that individual policyholders lacked a compelling interest to control the prosecution of their own claims, and at the same time represented a potentially great strain on judicial resources. Third, the court found it was appropriate to litigate the case in New Jersey, Prudential's principal place of business. Finally, the district court determined that the case, while challenging, would not present insurmountable case management problems if it were tried.\u003cspan class=\"fnref\"\u003e57\u003c/span\u003e Id. at 525.\n\nKrell objects to the finding of superiority, claiming the district court erred by only comparing the nationwide class with the prospect of individual proceedings, without considering the possibility of subclasses and without allowing Krell to develop the subclass issue.\n\nThe superiority requirement asks the court \"to balance, in terms of fairness and efficiency, the merits of a class action against those of `alternative available methods' of adjudication.\" Georgine, 83 F.3d at 632 (citing Katz v. Carte Blanche Corp., 496 F.2d 747, 757 (3d Cir.) (en banc), cert. denied, 419 U.S. 885 (1974)). We believe the court's superiority determination was within its sound discretion. With respect to Krell's subclass argument, the district court found no conflict between replacement and non-replacement claimants. Fairness Opinion, 962 F. Supp. at 522. We agree. As discussed (infra) at § V.A.4., Krell has not demonstrated that replacement claimants differ from other class members so as to require the creation of a subclass. Because the replacement claimants did not require specialized or distinct treatment, the court's failure to create a separate subclass for those claimants, as well as its superiority determination, was not an abuse of discretion.\u003cspan class=\"fnref\"\u003e58\u003c/span\u003e\n\nC. Conclusion\n\nBased on our review of the prerequisites of Rule 23(a) and 23(b)(3), we believe the \"proposed class has sufficient unity so that absent members can fairly be bound by decisions of class representatives.\" Amchem, 117 S. Ct. at 2248. Consequently, we will affirm the district court's certification of the class.\n\nV. THE FAIRNESS OF THE PROPOSED SETTLEMENT\n\nEven if it has satisfied the requirements for certification under Rule 23, a class action cannot be settled without the approval of the court and a determination that the proposed settlement is \"fair, reasonable and adequate.\"\u003cspan class=\"fnref\"\u003e59\u003c/span\u003e G.M. Trucks, 55 F.3d at 785. \"Rule 23(e) imposes on the trial Judge the duty of protecting absentees, which is executed by the court's assuring the settlement represents adequate compensation for the release of the class claims.\" Id. at 805 (citations omitted).\n\nIn deciding the fairness of a proposed settlement, we have said that \"[t]he evaluating court must, of course, guard against demanding too large a settlement based on its view of the merits of the litigation; after all, settlement is a compromise, a yielding of the highest hopes in exchange for certainty and resolution.\" Id. at 806 (citations omitted). At the same time, we have noted that cases such as this, where the parties simultaneously seek certification and settlement approval, require \"courts to be even more scrupulous than usual\" when they examine the fairness of the proposed settlement. Id. at 805. This heightened standard is designed to ensure that class counsel has demonstrated \"sustained advocacy\" throughout the course of the proceedings and has protected the interests of all class members. Id. at 806.\n\n\"The decision of whether to approve a proposed settlement of a class action is left to the sound discretion of the district court.\" Girsh v. Jepson, 521 F.2d 153, 156 (3d Cir. 1975). Because of the district court's proximity to the parties and to the nuances of the litigation, we accord great weight to the court's factual findings. Bell Atlantic Corp. v. Bolger, 2 F.3d 1304, 1305-6 (3d Cir. 1993) (citing Ace Heating \u0026 Plumbing Co. v. Crane Co., 453 F.2d 30, 34 (3d Cir. 1971)).\n\nAs the district court recognized, our decision in Girsh sets out appropriate factors to be considered when determining the fairness of a proposed settlement. Those factors are:\n\n(1) the complexity, expense and likely duration of the litigation . . . ; (2) the reaction of the class to the settlement . . . ; (3) the stage of the proceedings and the amount of discovery completed . . . ; (4) the risks of establishing liability . . . ; (5) the risks of establishing damages . . . ; (6) the risks of maintaining the class action through trial . . . ; (7) the ability of the defendants to withstand a greater judgment; (8) the range of reasonableness of the settlement fund in light of the best possible recovery . . . ; (9) the range of reasonableness of the settlement fund to a possible recovery in light of all the attendant risks of litigation . . . .\n\nGirsh, 521 F.2d at 157 (quoting City of Detroit v. Grinnell Corp., 495 F.2d 448, 463 (2d Cir. 1974)) (the \"Girsh factors\"). The court examined each of these factors and found \"the Proposed Settlement is indeed fair, reasonable, and adequate and should be approved.\" Fairness Opinion, 962 F. Supp. at 534.\n\nIn addition to the Girsh analysis, the district court offered other reasons for its Conclusion that the settlement was fair and reasonable. Describing the proposed settlement as \"exceptional,\" the court noted the settlement's structure was based on the class action settlements approved in Willson v. New York Life Ins. Co., No. 94-127804, 1995 N.Y. Misc. LEXIS 652 (N.Y. Sup. Ct. Feb. 1, 1996), aff'd, 644 N.Y.S.2d 617 (A.D. 1st Dep't), and Michaels v. Pheonix Home Life Ins. Co., No. 95-5318, 1997 N.Y. Misc. LEXIS 171 (N.Y. Sup. Ct. Jan. 3, 1997), both of which received the praise of \"[c]courts, academic and industry experts, and various independent organizations.\" Fairness Opinion, 962 F. Supp. at 535. The court also relied on the expertise of the insurance regulators from the fifty states and the District of Columbia, all of whom endorsed the settlement.\n\nThe court found the terms of the settlement \"benefit[ ] the class enormously,\" emphasizing the uncapped nature of the relief, the fairness of the ADR process, and the availability of Basic Claim Relief to those class members who either elect not to participate in the ADR process or who cannot demonstrate they have a compensable claim. The court found this relief was enhanced by the inclusion of \"Additional Remediation Amounts,\" which it described as the \"punitive damage counterpart to the Proposed Settlement,\" and by Prudential's agreement to pay all attorneys' fees and costs associated with the settlement. Id. at 535-36. Finally, the court emphasized the settlement provided class members the opportunity to file claims immediately after court approval of the settlement, rather than waiting through what no doubt would be protracted litigation. Id. at 536.\n\nKrell raises several challenges to the district court's fairness determination.\u003cspan class=\"fnref\"\u003e60\u003c/span\u003e First, Krell claims the district court applied several of the Girsh factors improperly, and in some cases not at all, and that it erred by not creating a separate subclass to address replacement claims. Krell Brief at 43-50. Second, he contends the district court's fairness determination violated the McCarran-Ferguson Act and the Rules Enabling Act by altering the substantive contractual and statutory insurance rights of the class. Id. at 36-40. Finally, Krell alleges the certification and fairness proceedings lacked due process. Id. at 40-42.\n\nA. The Girsh Factors\n\nAlthough Krell has not directly challenged the court's analysis with respect to each of the nine Girsh factors, we will examine each of them in turn.\n\n1. The complexity and duration of the litigation\n\nCiting the myriad complex legal and factual issues which would arise at trial, the district court found the \"anticipated complexity, costs, and time necessary to try this case greatly substantiate the fairness of the settlement.\" Fairness Opinion, 962 F. Supp. at 536. The court found that litigation would require expensive and time consuming discovery, would necessitate the use of several expert witnesses, and would not be completed for years. Consequently, the court concluded this factor weighed in favor of settlement.\n\nWe agree. Examining the sheer magnitude of the proposed settlement class as well as the complexity of the issues raised, we conclude the trial of this class action would be a long, arduous process requiring great expenditures of time and money on behalf of both the parties and the court. The prospect of such a massive undertaking clearly counsels in favor of settlement. \u003cspan class=\"fnref\"\u003e61\u003c/span\u003e\n\n2. The reaction of the class to the settlement\n\nThis factor attempts to gauge whether members of the class support the settlement. Although the response rate in a 23(b)(3) class action is relevant to the fairness determination, see, e.g., Bell Atlantic, 2 F.3d at 1313 n.15 (3d Cir, 1993); Shlensky v. Dorsey, 574 F.2d 131, 148 (3d Cir. 1978), \"a combination of observations about the practical realities of class actions has led a number of courts to be considerably more cautious about inferring support from a small number of objectors to a sophisticated settlement.\" G.M. Trucks, 55 F.3d at 812 (citation omitted).\n\nThe district court found that, of the 8 million policyholders to whom Prudential sent the class notice, approximately 19,000 policyholders or 0.2 per cent of the class opted out.\u003cspan class=\"fnref\"\u003e62\u003c/span\u003e The court also noted that approximately 300 policyholders filed objections to the settlement. The court found the small percentage of opt outs and objectors was \"truly insignificant,\" and noted that the \"most vociferous objectors to the Proposed Settlement are a handful of litigants represented by counsel in cases that compete with or overlap the claims asserted in the Second Amended Complaint.\" Fairness Opinion, 962 F. Supp. at 537. Consequently, the court concluded the limited number of objections filed also weighed in favor of approving the settlement. Id. at 537-38.\n\nWe see no abuse of discretion. While we do not read too much into the low rate of response, we believe the district court properly analyzed this factor.\u003cspan class=\"fnref\"\u003e63\u003c/span\u003e\n\n3. The stage of the proceedings and amount of discovery completed\n\nThe parties must have an \"adequate appreciation of the merits of the case before negotiating.\" G.M. Trucks, 55 F.3d at 813. To ensure that a proposed settlement is the product of informed negotiations, there should be an inquiry into the type and amount of discovery the parties have undertaken. Krell contends that class counsel's discovery was insufficient to support the proposed settlement, claiming that Lead Counsel's pre-settlement discovery consisted only of 70 boxes of documents received in August 1996 pursuant to informal letter requests, and a number of meetings with Prudential's chairman, Arthur Ryan. Krell questions how Lead Counsel could have been in \"second stage settlement negotiations\" before receiving Prudential's production of over 1 million documents, videotapes, audio tapes and computer tapes in mid-August. Finally, Krell contends there was no vigorous, adversarial discovery because \"virtually all of Prudential's discovery obligations\" were stayed between October 1995 and September 10, 1996, and the parties didn't agree on a free exchange of information until August 20, 1996, only a few weeks before the proposed settlement was announced.\n\nThe district court found that \"counsel for plaintiffs and Prudential did not commence serious settlement discussions until 18 months of vigorous litigation had transpired,\" noting the parties had filed and argued a multitude of motions, including consolidation motions, jurisdictional motions, motions to stay competing class actions, case management motions, and Prudential's motion to dismiss under F.R.C.P. 12(b)(6). Fairness Opinion, 962 F. Supp. at 538 n.62. In addition to its in-court efforts, the district court concluded that class counsel's pursuit of discovery also supported the settlement. The court found class counsel reviewed a multitude of documents provided by Prudential,\u003cspan class=\"fnref\"\u003e64\u003c/span\u003e conducted its own interviews with hundreds of current and former Prudential employees, took twenty depositions, and had access to all of the materials collected by the Task Force. Id. at 541. The district court also found class counsel took sufficient time to review the discovery materials it collected, noting that class counsel refused to discuss settlement on two separate occasions because it believed it needed further discovery. Id. (citing Weiss Aff. ¶¶ 49, 101-02.) Finally, the court found class counsels' \"use of informal discovery was especially appropriate in this case because the Court stayed plaintiffs' right to formal discovery for many months, and because informal discovery could provide the information that plaintiffs needed.\" Id. at 542. Based on the foregoing, the district court concluded \"the volume and substance of Class Counsel's knowledge of this case are unquestionably adequate to support this settlement.\" Id. at 541. We see no error here.\n\n4. The risks of establishing liability and damages\n\nThe fourth and fifth Girsh factors survey the possible risks of litigation in order to balance the likelihood of success and the potential damage award if the case were taken to trial against the benefits of an immediate settlement. Examining plaintiffs' ability to establish liability and damages at trial, the court concluded \"the risks of establishing liability weigh in favor of approving the settlement.\" Id. at 540.\n\nWe believe the district court properly examined the risks faced by the putative class. The court found plaintiffs would face a difficult burden at trial demonstrating, inter alia, (1) class members were deceived by Prudential's written disclosures and illustrations; (2) their contract claims were not barred by the parol evidence rule because they conflict with the unambiguous language in the insurance contracts; (3) the necessary reliance to support their federal securities claims; and (4) their federal securities claims were not barred by the one year statute of limitations and the three year statute of repose. Id. at 539. As further evidence of the barriers facing plaintiffs, the district court took notice of a similar life insurance sales practice case in Alabama state court in which the Judge overturned a substantial jury verdict against Prudential. Id. (citing Key v. Prudential Ins. Co. of America, Civ. No. 93-479 (Al. Cir. Ct. Dec. 28, 1995)). We believe the district court offered substantial reasons for its findings.\n\na. Replacement Claims\n\nKrell argues the district court failed to consider separately the likelihood of success at trial for those class members who alleged \"replacement claims,\" contending those claims require a lesser degree of proof and may be established by an objective review of the documents in Prudential's files. Both Prudential and Lead Counsel contend that \"replacement policyholders faced similar burdens to those of other Class Members in establishing liability and damages against Prudential.\"\u003cspan class=\"fnref\"\u003e65\u003c/span\u003e Prudential Brief at 35.\n\nThe district court did not believe that \"replacement claims\" are easier to prove and therefore required separate consideration. Fairness Opinion, 962 F. Supp. at 522. We agree. Krell offers no authority or analysis to support this blanket assertion. In addition, the findings of the Multi-State Task Force undermine Krell's argument.\n\nThe primary focus of the Multi-State Task Force was the practice known as \"churning\" or \"twisting,\" which it defined as \"the sale of any policy based upon incomplete or misleading comparisons.\" Task Force Report at 35. According to the Multi-State Task Force Report, the transactions most frequently the subject of churning or twisting complaints were financed sales and abbreviated payment plans. Replacement transactions are a subcategory of financed sales in which at least 25% of an existing policy's value is used to fund the purchase of a new policy. Id. (citing the current NAIC Replacement Life Insurance and Annuities Model regulation, adopted in 1984).\n\nThe Task Force Report makes clear that \"none of these types of sales, financed, replacement or abbreviated pay, is in violation of the replacement regulation if properly done.\" Id. at 36 (emphasis omitted). It also notes that, during the late 1970s and early 1980's, the previous industry-wide disinclination for replacement sales began to give way. In 1978, for example, the National Association of Insurance Commissioners modified its model replacement regulations to reflect the growing acceptance of replacement sales, provided those sales were accompanied by necessary information and disclosure to allow consumers to\"make an informed choice.\"\u003cspan class=\"fnref\"\u003e66\u003c/span\u003e Id. at 39-40.\n\nTurning to its examination of Prudential, the Task Force acknowledged its goal was \"to determine whether during the sale of new policies, those involving financing or replacement, consumers were adequately advised of the potential failings of the new policies or the funding basis on which they were sold.\" Id. at 45. The Report notes that although all of the required disclosure forms may have been completed and filed by Prudential, \"[o]ne must look beyond the required forms to determine whether or not presentations were accurate and not misleading.\" Id. In its discussion of the remediation protocol, the Task Force explained \"the documentation received from Prudential did not always support the consumer's assertion,\" and consequently \"[w]hat was or was not agreed upon at the time of sale became a question of fact.\" Id. at 189; see also id. at 191 (noting that while \"some replacements may have been appropriate . . . misrepresentation is never appropriate,\" and thus \"the challenge is to distinguish appropriate replacement activity.\")\n\nConsequently, it appears that misrepresentation, rather than compliance with bookkeeping requirements, was the primary concern of the Task Force examination of Prudential's replacement sales. As the Task Force Report states, it is incorrect \"to assume that in any and every case where a replacement was not identified or the regulatory requirements were not met, the policyholder did not understand the transaction or that it was not properly explained.\" Id. at 17. We also find it significant that the state insurance regulators who crafted the initial Task Force Report did not incorporate a lesser burden of proof or otherwise distinguish \"replacement claims\" from other types of claims.\u003cspan class=\"fnref\"\u003e67\u003c/span\u003e Consequently, we believe the district court properly considered the role of replacement claims when analyzing the fourth and fifth Girsh factors.\u003cspan class=\"fnref\"\u003e68\u003c/span\u003e\n\n5. The risks of maintaining the class action t hrough trial\n\nUnder Rule 23, a district court may decertify or modify a class at any time during the litigation if it proves to be unmanageable. In re School Asbestos Litigation, 789 F.2d at 1011 (3d Cir. 1986); G.M. Trucks, 55 F.3d at 815. In this instance, the district court concluded that although\"this case is manageable as a class action and [ ] the class action device is the most appropriate means to adjudicate this controversy, as the case evolves, maintaining the class action may become unworkable\" and require decertification. Fairness Opinion, 962 F. Supp. at 540. The court also noted Prudential had sought to preserve its objections to class certification, and would likely contest certification if the case proceeded to trial. Consequently, the court concluded that there was a risk the case might eventually be decertified, all of which weighed in favor of settlement.\n\nAlthough we agree with the district court's analysis and find there was some risk of decertification which supports settlement, we pause to comment on the application of this factor in \"settlement-only\" class actions following the Supreme Court's decision in Amchem. Because the district court always possesses the authority to decertify or modify a class that proves unmanageable, examination of this factor in the standard class action would appear to be perfunctory. There will always be a \"risk\" or possibility of decertification, and consequently the court can always claim this factor weighs in favor of settlement. The test becomes even more \"toothless\" after Amchem. The Supreme Court in Amchem held a district court could take settlement into consideration when deciding whether to certify a class, and that, \"[c]onfronted with a request for settlement-only class certification, a district court need not inquire whether the case, if tried, would present intractable management problems . . . for the proposal is that there be no trial.\" 117 S. Ct. at 2248. It would seem, therefore, that after Amchem the manageability inquiry in settlement-only class actions may not be significant.\n\n6. The ability of the defendants to withstand a gr eater judgment\n\nThe district court found \"Prudential's ability to withstand a greater judgment is a matter of concern.\"\u003cspan class=\"fnref\"\u003e69\u003c/span\u003e Fairness Opinion, 962 F. Supp. at 540. Noting that the settlement was valued between $1 billion and $2 billion, the court found a larger judgment could negatively impact Prudential's declining credit rating.\u003cspan class=\"fnref\"\u003e70\u003c/span\u003e Id. The court also expressed concern that, because Prudential is a mutual insurer, non-class member policyholders could conceivably be adversely affected by an excessive settlement in the form of lower dividends. Id.\n\nKrell claims the district court erred by finding that Prudential could not withstand a greater judgment because \"neither Lead Counsel nor Prudential submitted any reliable evidence of the true value of the ADR relief.\" Krell Brief at 50. Krell speculates that even the $410 million minimum is inaccurate because it does not account for \"profits, if any\" generated by Basic Claim Relief.\n\nWe see no error here. As the district court noted, the value of the proposed settlement is difficult to determine because both the compensatory relief available under the ADR and the additional relief available through Basic Claim Relief are uncapped. The parties' experts offered valuations between $1 and $2 billion, with an absolute minimum of $410 million. While these numbers are imprecise, they are a sufficient basis for the district court to decide whether Prudential could withstand a greater judgment. In addition, Prudential's credit rating during the course of the litigation may be an appropriate indicator, among others, for the court's consideration, and its decline would support the court's analysis.\n\n7. The range of reasonableness of the settlement f und in light of the best possible recovery and all the attendant risks of litigation\n\nThe last two Girsh factors ask whether the settlement is reasonable in light of the best possible recovery and the risks the parties would face if the case went to trial. In order to assess the reasonableness of a proposed settlement seeking monetary relief, \"the present value of the damages plaintiffs would likely recover if successful, appropriately discounted for the risk of not prevailing, should be compared with the amount of the proposed settlement.\" G.M. Trucks, 55 F.3d at 806 (quoting Manual for Complex Litigation 2d § 30.44, at 252). On appeal, Krell argues the district court declined to address this issue, instead finding the analysis unnecessary because all injured policyholders would receive full compensatory relief.\n\nKrell has mischaracterized the district court's opinion. The district court applied the final two Girsh factors, although it did not attempt to reduce its analysis to a concrete formula. The district court found that calculating the best possible recovery for the class in the aggregate would be \"exceedingly speculative,\" and in this instance such a calculation was unnecessary because the reasonableness of the settlement could be fairly Judged. The court instead examined the nature of the settlement and the range of possible outcomes for those participating in either the ADR process or Basic Claim Relief, and concluded that \"an individual's recovery exceeds the value of the best possible recovery discounted by the risks of litigation.\" Fairness Opinion, 962 F. Supp. at 540.\n\nFor example, the court found class members who have clear claims against Prudential will receive scores of \"3\" and will \"receive a choice between full rescissionary or compensatory relief plus interest.\" Thus they will receive full compensation without paying attorneys fees and without undue delay.\u003cspan class=\"fnref\"\u003e71\u003c/span\u003e The court concluded this relief \"is not only fair, it is exceptional.\" Id. at 540-41. Those class members who received a score of \"2\" - where the evidence on balance supports the claim - would receive 50% of their damages without having to pay litigation costs or fees, an award the court concluded was equivalent to what the claimant would have received at trial. Id. at 541 (\"The 50% award plus 100% interest is equivalent to a full award minus litigation costs, attorneys' fees, and the price of delay.\"). The court also found the settlement was fair for those receiving a score of \"1\" in the ADR process and for those electing Basic Claim Relief - those who would not have had a claim or not elected to bring one - because the Basic Claim Relief recovery is greater than what they would have gotten at trial.\u003cspan class=\"fnref\"\u003e72\u003c/span\u003e Id.\n\nWe believe the district court adequately addressed these factors and agree its examination \"accounts appropriately for the nuances of this Proposed Settlement.\" Id. at 535 n.58. As the court noted, both the structure of the settlement and the uncapped nature of the relief provided make it difficult to determine accurately the actual value of the settlement. Consequently, the traditional calculus suggested by the Manual for Complex Litigation 2d and adopted by this Court in G.M. Trucks cannot be applied to this case. But we cannot find the district court abused its discretion when it found that the remedies available under the proposed settlement provided extraordinary relief. When balanced against the best possible recovery and the risks of taking this case to trial, these remedies weighed in favor of the proposed settlement.\n\nIt is worth noting that since Girsh was decided in 1975, there has been a sea-change in the nature of class actions, especially with respect to mass torts. In this regard, it may be useful to expand the traditional Girsh factors to include, when appropriate, these factors among others: the maturity of the underlying substantive issues, as measured by experience in adjudicating individual actions, the development of scientific knowledge, the extent of discovery on the merits, and other factors that bear on the ability to assess the probable outcome of a trial on the merits of liability and individual damages; the existence and probable outcome of claims by other classes and subclasses; the comparison between the results achieved by the settlement for individual class or subclass members and the results achieved - or likely to be achieved - for other claimants; whether class or subclass members are accorded the right to opt out of the settlement; whether any provisions for attorneys' fees are reasonable; and whether the procedure for processing individual claims under the settlement is fair and reasonable.\u003cspan class=\"fnref\"\u003e73\u003c/span\u003e Of these factors, the only one relevant here is the fairness and reasonableness of the ADR procedure. See also Discussion (supra) § V.D.\n\nB. Other Objections\n\n1. The Rules Enabling Act and the McCarran-Ferguso n Act\n\nKrell argues the proposed settlement violates the Rules Enabling Act\u003cspan class=\"fnref\"\u003e74\u003c/span\u003e and the McCarran-Ferguson Act\u003cspan class=\"fnref\"\u003e75\u003c/span\u003e because it \"would alter policyholders' past and future substantive contractual and statutory insurance rights.\" Krell Brief at 36. The district court rejected both arguments. First, the court found the McCarran-Ferguson Act does not apply to an agreement between private parties. Fairness Opinion, 962 F. Supp. at 561. Second, the court found approval of a settlement under Rule 23 \"merely recognizes the parties' voluntary compromise of their rights\" and does not itself affect their substantive state law rights.\u003cspan class=\"fnref\"\u003e76\u003c/span\u003e Id. at 561-62. For the reasons outlined by the district court, we agree the proposed settlement in this case does not violate either the McCarran-Ferguson Act or the Rules Enabling Act. \u003cspan class=\"fnref\"\u003e77\u003c/span\u003e\n\n2. Failure to Allow Discovery\n\nKrell alleges the district court deprived him of fundamental due process by denying him the opportunity to take necessary discovery. Krell Brief at 40-42. Krell contends additional discovery was essential because class counsel's own discovery was inadequate, and the district court's denial of Krell's requests for settlement and fee related discovery\u003cspan class=\"fnref\"\u003e78\u003c/span\u003e resulted in an erroneous assessment of the fairness of the settlement.\n\nKrell complains his discovery attempts were hampered by the court order requiring all discovery requests be served on Prudential through Lead Counsel. According to Krell, Lead Counsel refused Krell's requests both prior and subsequent to signing the settlement agreement in September 1996, and excluded him from the \"free exchange\" of documents. Krell also requested cross-examination of affiants supporting the settlement, depositions from the named plaintiffs with respect to jurisdiction and adequacy of representation, and other document discovery.\u003cspan class=\"fnref\"\u003e79\u003c/span\u003e\n\nObjectors are \"entitled to an opportunity to develop a record in support of [their] contentions by means of cross-examination and argument to the court.\" Greenfield v. Villager Indus., Inc., 483 F.2d 824, 833 (3d Cir. 1973). There is no dispute Krell was given the opportunity to present his arguments to the court during the fairness hearing. In addition, the district court found Krell had ample opportunity to avail himself of the substantial discovery provided to Lead Counsel but failed to do so, and that additional discovery was unnecessary because Krell focused primarily on legal issues. Fairness Opinion, 962 F. Supp. at 563.\n\nWe believe the district court acted well within its discretion here. Faced with the prospect of immense discovery requests, the district court attempted to exert some control over the discovery process. Krell cannot impute to the court his own failure to avail himself of the opportunity to review the discovery in this case.\n\nC. \"Other Sales Claims\"\n\nThe final issue we address with respect to fairness relates to the category of \"other sales claims.\" Krell raises two arguments in opposition to this broad category of claims. First, Krell contends that the \"other claims\" were improperly added at the last minute to secure an all-encompassing release for Prudential. Second, Krell contends the notice provided under the settlement did not adequately explain the category to absentee members, and consequently millions of policyholders would inadvertently waive their right to recover for Prudential's fraudulent acts.\n\n1. The Alleged Expansion of the Class\n\nAccording to Krell, the \"class definition was at the last minute expanded to release nearly 8 million additional policyholders not included in the class pled only 3 days earlier.\" Krell Brief at 4.\u003cspan class=\"fnref\"\u003e80\u003c/span\u003e In addition to the previously-noted ramifications of this \"expansion\" with respect to the Rule 23 certification prerequisites, Krell also contends the release of these claims is improper because it exceeds the scope of the class complaint.\n\nPrudential and Lead Counsel counter that the certified class is actually smaller than the \"putative class defined in plaintiffs' initial pleadings\" and that the Task Force remediation plan also included an \"other claims\" category. As Lead Counsel explains, plaintiffs have contended\"from the outset that Prudential's common course of deceptive conduct extended beyond the churning, vanishing premium, and investment sales tactics and permeated its product design, agent training and oversight, sales activities, and dividend, expense and investment practices.\" Lead Counsel Brief at 20. The settling parties maintain that, even if such claims were not included in the Second Amended Consolidated Complaint, those claims could still be released because they arose from the conduct alleged in the Complaint.\n\nThe district court held the release was not unfairly broad, finding it generally corresponded with the allegations in the Second Amended Consolidated Complaint. The court also found that \"releases may include all claims, including unpleaded claims that arise out of the same conduct alleged in the case.\"\u003cspan class=\"fnref\"\u003e81\u003c/span\u003e Fairness Opinion, 962 F. Supp. at 558 (citing Grimes v. Vitalink Communications Corp., 17 F.3d 1553, 1563 (3d Cir.), cert. denied, 513 U.S. 986 (1994); Sandler Assocs., L.P. v. Bellsouth Corp. , 818 F. Supp. 695, 704-05 (D. Del. 1993), aff'd, 26 F.3d 123 (3d Cir. 1994)).\n\nThe crux of the plaintiffs' complaint was that Prudential engaged in a common scheme of deceptive sales practices. Although the Second Amended Consolidated Complaint specifically lists three types of deceptive sales claims - the churning, vanishing premium and investment plan claims - other allegations address conduct which supports the common scheme theory and which does not fall neatly within the three enumerated categories. See (supra) note 11. Therefore, we agree with the district court the\"other claims\" were properly released.\u003cspan class=\"fnref\"\u003e82\u003c/span\u003e While it is essential to protect the interests of absentee class members, we believe the claims of the absentees here are adequately incorporated in the terms of the settlement. The category of \"other claims\" are part and parcel of the\"common scheme\" which underlies plaintiffs' entire case, and are separately addressed in the procedural guidelines which forms the basis for the ADR process. Finally, the settling parties have represented that the settlement \"does not release unknown claims relating to the servicing or administration of class members' policies,\" but is limited to claims relating to the actual sale of insurance policies.\u003cspan class=\"fnref\"\u003e83\u003c/span\u003e Lead Counsel Brief at 62-63. Consequently, we believe the \"other claims\" were appropriately included in the release.\n\n2. Adequacy of Class Notice\n\nRule 23 of the Federal Rules of Civil Procedure contains two distinct notice provisions. Rule 23(c)(2) requires notice be given to all potential members of a Rule 23(b)(3) class informing them of the existence of the class action, the requirements for opting out of the class and/or entering an appearance with the court, and the applicability of any final judgment to all members who do not opt out of the class.\u003cspan class=\"fnref\"\u003e84\u003c/span\u003e Rule 23(e) requires all members of the class be notified of the terms of any proposed settlement.\u003cspan class=\"fnref\"\u003e85\u003c/span\u003e The Rule 23(e) notice is designed to summarize the litigation and the settlement and \"to apprise class members of the right and opportunity to inspect the complete settlement documents, papers, and pleadings filed in the litigation.\" 2 Newberg on Class Actions § 8.32 at 8-109.\n\nIn this instance, the parties prepared a joint notice, combining the information required by Rules 23(c)(2) and 23(e). The district court's October 28, 1996 order required the settling parties to mail individual notice\u003cspan class=\"fnref\"\u003e86\u003c/span\u003e to the last known address of the over 8 million present and former policyholders who comprised the putative class. \u003cspan class=\"fnref\"\u003e87\u003c/span\u003e In addition, the Order required the parties to publish notice in the national editions of The New York Times, The Wall Street Journal, USA Today and The Newark Star Ledger.\u003cspan class=\"fnref\"\u003e88\u003c/span\u003e Prudential went even further, publishing notice in the largest circulating newspaper in each of the fifty states and the District of Columbia. Fairness Opinion, 962 F. Supp. at 495. The notices were published over a three day period, from November 20, 1996 until November 22, 1996. \u003cspan class=\"fnref\"\u003e89\u003c/span\u003e\n\nThe district court described the notice and outreach program as unparalleled and found \"the comprehensive notice program in this case far exceeded the requirements of Rule 23 and due process.\" Id. at 526. The district court also examined and rejected various objections to the form and content of the notice. Id. at 528-34.\n\nWe agree with the district court's assessment of the scope of the outreach program.\u003cspan class=\"fnref\"\u003e90\u003c/span\u003e Providing individual notice to over 8 million class members is a daunting task, and no doubt an expensive one. In addition, the combination of individual and publication notice, combined with the unsolicited news coverage the settlement received, greatly increased the possibility that Prudential will ultimately compensate a greater number of injured policyholders than would otherwise have been possible.\u003cspan class=\"fnref\"\u003e91\u003c/span\u003e The parties also provided additional notices to the class, each designed to update the parties as to their rights and obligations under the settlement.\u003cspan class=\"fnref\"\u003e92\u003c/span\u003e\n\nWe agree with the district court that the notice provided all of the required information concerning the class members' right and obligations under the settlement. It detailed the procedures for opting out, entering an appearance, and filing objections, and notified the policyholders that if they did not opt out of the class they would be bound by the settlement if approved. It explained the ADR process and Basic Claim Relief available to the class, provided the text of the release, and provided notification that all related documents were available for public inspection. Finally, it explained the nature of the claims covered under the settlement, and provided an 800 number through which class members could obtain information and make further inquiries. The fact that approximately 1.8 million inquiries have already been processed through the 800 number supports the conclusion that the class notice was effective.\n\nThe only legitimate concern raised with respect to the notice provided relates to the category of \"other claims.\" After a careful review of the record, we hold the notice provided with respect to the category of \"other claims\" provided sufficient information to apprise the class of the scope of the allegations against Prudential. While this catch-all category is by its nature difficult to describe, we believe the class notice makes clear that additional claims which do not fit neatly into one of the other three categories may nonetheless be remedied through the ADR process.\n\nThe third page of the cover letter to the class notice specifically sets forth the four categories of sales claims - financed insurance, abbreviated payment, investment plan, and \"other improper sales practices.\" The types of relief available for each of the four categories of claims are clearly listed on pages 10-11 of the Notice of Class Action, Proposed Settlement, Settlement Hearing And Right To Appear.\u003cspan class=\"fnref\"\u003e93\u003c/span\u003e The four categories of claims are also listed in the question-and-answer pamphlet included with the Class Notice. Compared to the first three categories of claims, which require some understanding of insurance policies, the catch-all category of \"other improper sales practices\" is arguably easier for the uninformed layman to comprehend, and may in fact encourage class members to respond to the Class Notice.\n\nConsequently, we believe the notice provided to the absentee class members in this case supports the district court's finding that the settlement is fair and reasonable.\n\nD. Conclusion\n\nAs we have noted, a review of the Girsh factors strongly supports the district court's Conclusion that the proposed settlement is fair and reasonable. In addition, the parties have fully satisfied the notice requirements of Rule 23, and provided the class with both individual and publication notice regarding the terms of the settlement. There are also other facets of the settlement which counsel in favor of its approval.\n\nFirst, we are impressed with the nature and extent of the relief provided under the settlement. The ADR process provides an efficient and individually tailored approach to the remediation of claims. Rather than offering 8 million class members a small refund or a coupon towards the purchase of other policies (which we believe would have failed the fairness evaluation), the ADR process responds to the individual claims of the class and provides compensation based on the harm they have suffered. As a result, the potential class recovery is uncapped, a fact which weighs strongly in favor of the settlement.\n\nSecond, we are also impressed with the procedural safeguards created by the settlement. The four tier review process, in which the first and third levels of review are conducted by Prudential employees and the second and fourth levels are conducted by independent reviewers selected by class counsel, provide assurance that the ADR process will accurately assess and compensate the claims of injured class members.\n\nThird, we are mindful of the external indicia of fairness which attach to this settlement. In particular, we are cognizant that the original framework of this settlement resulted from the efforts of the Multi-State Task Force. The involvement of the various state insurance regulators, with their vast experience and expertise, provides great support in favor of the fairness of the settlement. In addition, we are impressed by the seal of approval this settlement has received from the insurance regulators of each of the 50 states and the District of Columbia.\n\nFourth, that Prudential will bear all administrative costs associated with the remediation process and will pay class counsel's fees and costs weighs in favor of the settlement. By agreeing to cover these expenses, Prudential has ensured that the administrative and legal costs of the settlement will not diminish the class recovery.\n\nBased on the foregoing, we conclude that the district court's finding that the proposed settlement was fair, reasonable and adequate was well within its sound discretion.\n\nVI. ATTORNEYS' FEES\n\nA. The Fee Agreement\n\nThe settling parties addressed attorneys' fees in§ K of the Stipulation of Settlement filed October 28, 1996. Under the settlement, Lead Counsel would request $90 million in attorneys' fees from the district court, a request Prudential agreed not to oppose.\u003cspan class=\"fnref\"\u003e94\u003c/span\u003e The full amount, as well as certain administrative costs associated with the settlement plan, would be paid entirely by Prudential.\u003cspan class=\"fnref\"\u003e95\u003c/span\u003e Stipulation of Settlement § K.4. The fee arrangement was designed so that payment of class counsel's fees and expenses would not \"directly or indirectly reduce, limit or modify the remedies provided in the ADR process or Basic Claim Relief.\" Id. The Stipulation of Settlement also created a timetable for payment. Prudential would pay $45 million of the attorneys' fees plus expenses within five days of the district court's approval of the settlement, the remaining fees payable after the final Disposition of any appeals.\u003cspan class=\"fnref\"\u003e96\u003c/span\u003e Id. at § K.2.\n\nOn November 22, 1996, Lead Counsel submitted an application for attorneys' fees in conformity with§ K. Several class members, among them Krell, filed objections to the award. As the district court noted, no state insurance commissioner opposed the fee petition. In re The Prudential Ins. Co. of America Sales Practice Litigation, 962 F. Supp. 572, 575 (D.N.J. 1997) (\"Fee Opinion\"). Advocating the propriety of the proposed fee, Lead Counsel contended the remedies established under the Proposed Settlement were analogous to a \"common fund\" and, consequently, the size of the fee award should be determined as a percentage of the class members' total recovery. In order to establish the value of the settlement, Lead Counsel submitted the affidavit of its expert Robert Hoyer, a Participating Principal with Arthur Andersen LLP, and managing partner of the firm's Life \u0026 Health Actuarial Service group. Hoyer estimated the total value of the settlement at $1.987 billion, $1.187 billion attributable to the ADR process, and $799.6 million to Basic Claim Relief.\u003cspan class=\"fnref\"\u003e97\u003c/span\u003e Hoyer Aff. ¶¶ 6, 11, 15. According to Hoyer's calculations, $863.7 million of the settlement's total value was created under the Task Force plan, while the remaining $1.123 billion was the result of the enhancements created by class counsel. See Fee Opinion, 962 F. Supp. at 575.\n\nTo assist with its fee determination, the district court appointed an independent fee examiner, Stephen Greenberg, on November 6, 1996.\u003cspan class=\"fnref\"\u003e98\u003c/span\u003e Greenberg was charged with analyzing the fairness of Lead Counsel's fee request. The fee examiner submitted his Report and Recommendation on February 13, 1997, concluding the $90 million fee award was fair and reasonable. Krell was the only objector to the Fee Examiner's Report. Fee Opinion, 962 F. Supp. at 576. On March 10, 1997, the district court held a hearing dedicated to attorneys' fees, and provided an opportunity for all interested parties to address the fairness of the Fee Petition.\n\nB. Fee\n\nOn March 20, 1997 the court issued its opinion and order with respect to attorneys' fees. As urged by Lead Counsel in its fee petition, the district court found this case analogous to the common fund paradigm, and elected to apply the percentage-of-recovery method to calculate the attorneys' fee award.\u003cspan class=\"fnref\"\u003e99\u003c/span\u003e Fee Opinion, 962 F. Supp. at 579. Despite accepting the percentage-of-recovery method, the district court rejected both the fee petition and the fee examiner's Recommendation and Report, and in its place constructed a bifurcated fee award designed to provide no less than $45 million and no more than $90 million to class counsel.\u003cspan class=\"fnref\"\u003e100\u003c/span\u003e\n\nThe district court found that \"any fee awarded to class counsel in this case should be based upon the entire value of the settlement, including any portion which would have been provided to the class under the Task Force Plan.\" Fee Opinion, 962 F. Supp. at 581 (emphasis omitted). The court reasoned the Task Force Plan \"resulted in substantial measure from the efforts of class counsel in this litigation,\" noting that Prudential began to urge the formation of the Task Force only after the consolidated lawsuits werefiled. Fee Opinion, 962 F. Supp. at 581-82. Considering both the causal connection as well as the additional enhancements created by the Proposed Settlement, the court concluded class counsel could reasonably be credited with all of the benefits provided under the settlement.\n\nTurning to the value of the settlement, the district court found the only \"specific, comprehensive valuation of the settlement that is of record\" was submitted by class counsels' expert, Robert Hoyer.\u003cspan class=\"fnref\"\u003e101\u003c/span\u003e Relying on Hoyer's figures, the fee examiner's report calculated the value of the proposed settlement between $1.2 and $2 billion, depending on the number of class members who ultimately have claims remediated through the ADR process. Fee Examiner's Report at 56. But the district court \"question[ed] the reasonableness of any valuation that may differ by as much as $800 million,\" and expressed concern that a range of possible values might not satisfy the requirement that a district court determine the actual value of the settlement when calculating the award of attorneys' fees. Fee Opinion, 962 F. Supp. at 583. Consequently, the court found \"the nature of the Settlement Agreement simply [did] not lend itself to a reasonable valuation\" and rejected the fee examiner's report. Id.\n\nThe court also found it imprudent to apply the lodestar method as its primary tool in calculating attorneys' fees.\u003cspan class=\"fnref\"\u003e102\u003c/span\u003e First, the court noted there was no need in this instance to \"ensure the procurement of competent counsel,\" one of the underlying purposes of the lodestar method. Additionally, the court found the involvement of over 25 law firms and 250 attorneys and paralegals would make a lodestar calculation time-consuming and burdensome.\u003cspan class=\"fnref\"\u003e103\u003c/span\u003e Finally, the court reasoned that application of the lodestar method was unnecessary because a modified version of the percentage-of-recovery method could be applied. Id. at 27-28.\n\nThe district court decided to calculate the fee award in two parts; first, an award based on \"a percentage of recovery on the known value of the settlement -- Prudential's guaranteed minimum payout of $410 million (the \"Minimum Fund\"),\" Fee Opinion, 962 F. Supp. at 584; and second, an award based on a \"separate percentage of recovery with respect to the future, additional value of benefits to be paid to class members who come forward under the Settlement Agreement (the \"Future Fund\").\" Id.\n\nExamining several factors in order to calculate an appropriate percentage under this two tier analysis, the court noted that, although percentages from 20 to 30% have been deemed appropriate, the exceptional size of the class recovery in this instance counseled in favor of a lower percentage of recovery. The district court examined the fee awards in other cases involving substantial recoveries, and found a range of 4.1% to 17.92% in cases where the recovery exceeded $100 million. The district court also considered the quality of class counsel's representation, the \"innovative\" terms of the settlement, the enhancements over the Task Force Plan, and the overall fairness of the settlement. Id. at 585-87. The court concluded the \"results achieved by plaintiffs' counsel in this case in the face of significant legal, factual and logistical obstacles and formidable opposing counsel, are nothing short of remarkable.\" Id. at 585-86.\n\nFinally, the court considered the fee percentage private parties would likely have negotiated. The fee examiner's report examined the fee awarded in the settlement between Penzoil and Texaco and concluded that class counsel would have received a contingent fee of at least 10-15%. Fee Examiner's Report at 61. While the court ultimately rejected the fee report, it nonetheless agreed that \"given the obvious risks and burdens required for its prosecution, lawyers of plaintiffs' counsels' standing would have negotiated a fee of at least 10 to 15% of the recovery.\"\u003cspan class=\"fnref\"\u003e104\u003c/span\u003e Fee Opinion, 962 F. Supp. at 587 (quoting Fee Examiner's Report at 61).\n\nTurning to the first part of its bifurcated fee award, the district court found that 11% was a fair and reasonable recovery with respect to the $410 million Minimum Fund. Accordingly, the court ordered Prudential to pay class counsel $45 million, plus expenses, within five days. The court then conditioned the second half of the fee award on the number of claims ultimately handled through the ADR process. In the event 330,000 claims were filed by June 1, 1997, Prudential would pay class counsel an additional $45 million. Assuming the full $90 million were awarded, the fee would equal approximately 6.7% of the minimum recovery guaranteed by Prudential under the settlement.\u003cspan class=\"fnref\"\u003e105\u003c/span\u003e The court found this figure to be fair and reasonable. In the event the 330,000 threshold were not met, class counsel would not be entitled to an automatic fee award, but would receive a 5% contingent fee based on the value of the Future Fund - \"the total value of the settlement less the Minimum Fund\" - to be determined annually on the anniversary date of the Fee Opinion.\u003cspan class=\"fnref\"\u003e106\u003c/span\u003e Fee Opinion, 962 F. Supp. at 588-89.\n\nThe court then applied the lodestar method as a cross-check of its initial calculation. According to an analysis provided by Lead Counsel, the lodestar as of January 31, 1997 was $17.7 million, plus expenses of just over $3 million. Id. at 591. Using these figures, the court found the maximum fee award of $90 million would be equivalent to a multiplier of 5.1 and an average hourly rate of $1,148.70. The court found that, when the lodestar was updated, the resulting multiplier and hourly rate would be lower. Nonetheless, the district court found these higher, unadjusted figures were substantially less than the multiplier and average hourly rate applied by the district court and affirmed by this court in Weiss v. Mercedes-Benz of N. Am., Inc., 66 F.3d 314 (3d Cir. 1995), aff'g 899 F. Supp. 1297, 1304 (D.N.J.). Consequently, the district court concluded the cross-check under the lodestar supported the fairness and reasonableness of the fee award. Fee Opinion, 962 F. Supp. at 592-93.\u003cspan class=\"fnref\"\u003e107\u003c/span\u003e\n\nThe district court summarized its reasons why this fee arrangement was both appropriate and beneficial. Id. at 589-91. First, the court found the award \"obviate[d] the need to guesstimate the value of the settlement and ensures an award of attorneys' fees that is rationally related to the success of the settlement.\" Id. at 589. Second, the fee award used the percentage-of-recovery method preferred in common fund cases and avoided the difficulties in applying the lodestar method. Third, the court found the bifurcated award worked as a safeguard in the event the settlement was \"unsuccessful\" by only providing a portion of the award up front, and making the second part of the award dependent on the actual remediation rate. Fourth, the court noted the fee award generally upheld the agreement of the parties. Fifth, the court reasoned the bifurcated award would provide class counsel an incentive to pursue diligently remediation for class members. Finally, the court found the fee arrangement \"answer[ed] the few class members, including Krell, who objected to the parties' fee agreement as a `lay down' by Prudential.\" Id. at 591.\n\nC. Analysis\n\n\"[A] thorough judicial review of fee applications is required in all class action settlements.\" G.M. Trucks, 55 F. 3d at 819. When parties are negotiating settlements, the court must always be mindful of the \"danger . . . that the lawyers might urge a class settlement at a low figure or on a less-than-optimal basis in exchange for red-carpet treatment for fees.\" Weinberger v. Great Northern Nekoosa Corp., 925 F.2d 518, 524 (1st Cir. 1991). On appeal, we review the district court's award of attorney's fees for an abuse of discretion. G.M. Trucks, 55 F.3d at 782.\n\nThere are two basic methods for calculating attorneys' fees - the percentage-of-recovery method and the lodestar method. \"[E]ach method has distinct advantages for certain kinds of actions, which will make one of the methods more appropriate as a primary basis for determining the fee.\" G.M. Trucks, 55 F.3d at 820. The percentage-of-recovery method is generally favored in cases involving a common fund, and is designed to allow courts to award fees from the fund \"in a manner that rewards counsel for success and penalizes it for failure.\" Id. at 821. The lodestar method is more commonly applied in statutory fee-shifting cases, and is designed to reward counsel for undertaking socially beneficial litigation in cases where the expected relief has a small enough monetary value that a percentage-of-recovery method would provide inadequate compensation. Id. \u003cspan class=\"fnref\"\u003e108\u003c/span\u003e It may also be applied in cases where the nature of the recovery does not allow the determination of the settlement's value necessary for application of the percentage-of-recovery method. Id. Although each of these methods is generally applied to certain types of cases, we have noted previously that \"it is sensible for a court to use a second method of fee approval to cross check\" its initial fee calculation. Id. at 820.\n\nWe agree with the district court that this case is more appropriately viewed under the common fund paradigm than as a statutory fee-shifting case.\u003cspan class=\"fnref\"\u003e109\u003c/span\u003e Consequently, the district court was required to make a \"reasonable estimate\" of the settlement's value in order to calculate attorneys' fees using the percentage-of-recovery method. Id. at 822 (holding that \"the district court on remand needs to make some reasonable assessment of the settlement's value\"); Weiss v. Mercedes-Benz of N. Am., Inc., 899 F. Supp. at 1304. But, as the district court noted, this is\"an atypical common fund case\" involving an uncapped, \"future fund\" whose ultimate value is dependent on the final number of claims remediated under the settlement, and, as a result, \"the settlement . . . cannot reasonably be valuated.\" Fee Opinion, 962 F. Supp. at 583. The fee examiner's report reflected this uncertainty. The report could only offer a range of possible values, with the highest and lowest figures separated by over $800 million. Even class counsel's own expert conceded that his calculations were merely \"approximations.\" Hoyer Aff. ¶ 18. Consequently, a straightforward application of the percentage-of-recovery test is difficult in this instance.\n\nThe district court attempted to overcome this problem by bifurcating the fee award, exercising its sound discretion to award reasonable attorneys' fees. Silberman v. Bogle, 683 F.2d 62, 64-65 (3d Cir. 1982) . The district court's plan was designed to overcome the speculative nature of the tentative and imprecise settlement valuations. It took into account the settlement's more definite terms by providing an immediate payment based on a percentage of the guaranteed minimum recovery of $410 million, while requiring future payments to be based on actual results in recognition that the ultimate class recovery is not quantifiable at this point. We hold the district court's creation of a bifurcated fee structure was an appropriate and innovative response to the structure of the settlement, and well within its sound discretion.\u003cspan class=\"fnref\"\u003e110\u003c/span\u003e\n\nOur review does not end here, however. We must still examine the fee award calculated by the district court under this bifurcated structure and determine whether the amount of the award was fair and reasonable. Before doing that, however, we will first address two objections raised by Krell which focus on procedural aspects of the fee award. First, Krell claims the settling parties improperly discussed attorneys' fees and entered into a \"clear-sailing fee\" agreement, thereby creating a conflict between class counsel and the class. Second, Krell maintains the attorneys' fee award adversely affects class members by reducing the value of the members' equity interest in Prudential. The net result, he argues, is that class members are forced to shoulder the burden of the fee award, despite class counsel's and Prudential's assertions to the contrary.\u003cspan class=\"fnref\"\u003e111\u003c/span\u003e\n\n1. \"Clear-Sailing\" Fee Agreement\n\nKrell maintains the settling parties improperly entered into negotiations on counsel fees before concluding settlement negotiations. Krell hypothesizes that because Prudential wanted as broad a release as possible in order to avoid all future liability, they offered class counsel large fees.\n\nIn both its Fairness Opinion and its Fee Opinion, the district court addressed Krell's contention the parties simultaneously negotiated the settlement and fee agreements. The district court found \"the parties obviated the danger of an actual or apparent conflict of interest on the part of class counsel by negotiating in a manner expressly recommended by the Third Circuit in Prandini and by a Task Force appointed by the Third Circuit to report on the subject of court awarded attorneys' fees.\" Fee Opinion, 962 F. Supp. at 577 (citing Court Awarded Attorney Fees, Report of the Third Circuit Task Force, 108 F.R.D. 237 (Oct. 8, 1995)).\u003cspan class=\"fnref\"\u003e112\u003c/span\u003e Relying on the settling parties' sworn affidavits,\u003cspan class=\"fnref\"\u003e113\u003c/span\u003e the district court found all parties acted appropriately, having first completed negotiation of the Settlement Agreement on September 22, 1996 and then obtained the court's authorization on October 11, 1996 to address fees. Id. at 577 n.14; see also Fairness Opinion, 962 F. Supp. at 542 (\"The parties' negotiation of attorneys' fees was completely appropriate and followed the final settlement negotiations.\"). The court also found Krell had failed to produce \"sound evidence\" to support its contentions.\n\nWe agree with the district court. There is no indication the parties began to negotiate attorneys' fees until after they had finished negotiating the settlement agreement. On review we grant deference to the district court's factual findings. Despite Krell's repeated references to the \"September 22, 1996 clear sailing fee provision,\" the Settlement Agreement signed on that date did not contain a \"clear sailing\" provision. Unlike Section K of the final Stipulation of Settlement filed on October 28, 1996, the September 22, 1996 Settlement Agreement did not address the amount of fees, the timetable for the payment of fees, or Prudential's agreement not to object to any fee petition filed by plaintiffs' counsel. As Lead Counsel notes, the September 22 Settlement Agreement contained a termination provision which allowed Prudential, but not plaintiffs, to terminate the agreement if the issue of attorneys' fees was not resolved to its satisfaction.\u003cspan class=\"fnref\"\u003e114\u003c/span\u003e Lead Counsel Brief at 83-84.\n\n2. Adverse Effect on Class Members\n\nKrell also claims the district court failed to consider the negative financial impact the settlement would have on class members. According to this argument, class members, who as policyholders have an \"equity interest\" in Prudential's surplus, are harmed because the settlement will decrease that surplus. Krell Brief at 67-68.\n\nThe district rejected this argument, finding the payment of attorneys' fees would not have a negative financial impact on class members. The court reasoned that\"any such payment of fees may come from the proceeds of director and officer liability insurance or from Prudential's capital surplus . . . [and] will not necessarily affect policyholders' future dividends and interest payments on their policies.\" Fee Opinion, 962 F. Supp. at 589 n.40.\n\nKrell points to no record evidence to demonstrate the settlement would have a detrimental effect on the dividends of Prudential policyholders. Krell cites only to Exhibit G of his fee discovery motion, dated December 11, 1996, which contains the affidavit of Professor David F. Babbel of The Wharton School of the University of Pennsylvania, originally filed in connection with the Phoenix Home Life Mutual Insurance Company litigation in New York state court. Although Professor Babbel's affidavit explains that compensation paid by a mutual insurer to a hypothetical class comprised of the insurer's policyholders may result in \"a reduction in dividends paid to the policyholders, or a reduction in the surplus that backs the claims of the policy owners against the firm,\" Babbel Aff. ¶ 9, he concludes the proposed settlement\u003cspan class=\"fnref\"\u003e115\u003c/span\u003e \"[took] advantage of the financial strength and economies of scale available to\" the mutual insurer and overcame the concerns for the policy owners' equity interest. Babbel Aff. ¶ 11. We see no error here.\n\n3. Fairness of the Award\n\nKrell's remaining objections focus on whether the district court properly calculated the fee award. In particular, he challenges the court's decision to credit class counsel for all of the benefits created by the Task Force plan, as well as its determination of the appropriate fee percentage. Krell also contends the district court improperly denied his requests for discovery, and as a result did not have sufficient information to assess the fairness of the award. Because the discovery issues are intertwined with the court's final calculation of class counsel's fee, we will address these objections together.\n\na. The Value of the Settlement\n\nAs noted, the district court found the settlement was most closely aligned to the common fund paradigm and that a percentage-of-recovery calculation was the appropriate measure of the attorneys' fee award. In addition, the court created a bifurcated award designed to compensate class counsel based on the \"guaranteed minimum\" benefit created under the settlement, while at the same time tying the second part of the award to the class's response rate, in order to create an incentive for class counsel's continued participation in the remediation process. While we agree with both the method of calculation selected by the court and the structure of the fee award it crafted, we are nonetheless troubled by the actual calculation of class counsel's fee.\n\nIn particular, we question the court's decision to base its fee calculation on \"the entire value of the settlement, including any portion which would have been provided to the class under the Task Force Plan.\" Fee Opinion, 962 F. Supp. at 581 (emphasis omitted). This decision was based on the court's Conclusion that class counsel was a\"material factor in bringing about the regulators' Task Force plan.\" Id. at 582. The court offered two reasons for this conclusion. First, the court found \"Prudential's counsel acknowledged the causal relationship between the lawsuits and the Task Force's formation and subsequent remediation plan.\" Id. (citing Fee Examiner's Report at 56). Second, the district court explained \"the record shows that plaintiffs' counsel otherwise substantially contributed to the terms of the Task Force plan.\" Id.\n\nThe district court relied in part on our decision in Institutionalized Juveniles v. Secretary of Pub. Welfare, 758 F.2d 897 (3d Cir. 1985).\u003cspan class=\"fnref\"\u003e116\u003c/span\u003e In that case, a class action civil rights lawsuit was filed on behalf of all juveniles in Pennsylvania who had been voluntarily committed to state mental health institutions. The class challenged the constitutionality of Pennsylvania's \"voluntary\" commitment statute on due process and equal protection grounds. Pennsylvania eventually enacted legislation and accompanying regulations which provided much of the relief sought by the class, and the district court entered judgment for defendants and terminated the class. Plaintiffs petitioned for attorneys' fees under 42 U.S.C. § 1988. We affirmed the causation finding, noting \"the district court specifically found that defendants had been `extensively involved in the legislative process' and that defendants `actively worked with the legislature to achieve passage of the 1976 Act.' \" 758 F.2d at 917. The district court here placed great emphasis on our holding that \"although the litigation must have been a `catalyst' . . . it need not have been the only catalyst.\" Id. at 916. As a result, the district court concluded it \"should consider not only those remedies conferred directly through the litigation process, but also those extra-judicial benefits to the plaintiffs which resulted from counsels' efforts in the litigation.\" Fee Opinion, 962 F. Supp. at 581 (citations omitted).\n\nAs a preliminary matter, we believe the facts of that case are distinguishable. In Institutionalized Juveniles, we noted the record contained an affidavit from the chairman of the Pennsylvania Senate Health and Welfare Committee responsible for drafting the litigation in question, in which he confirmed that the litigation, and plaintiffs' counsel in particular, were an \" `important catalyst' in bringing about the changes in Pennsylvania law.\" 758 F.2d at 917. In addition, it is easy to overstate the principle set forth in Institutionalized Juveniles. While a party need not be the only catalyst in order to be considered a \"material factor\" and may be credited for extra-judicial benefits created, there must still be a sound basis that the party was more than an initial impetus behind the creation of the benefit. Allowing private counsel to receive fees based on the benefits created by public agencies would undermine the equitable principles which underlie the concept of the common fund, and would create an incentive for plaintiffs attorneys to \"minimize the costs of failure . . . by free riding on the monitoring efforts of others.\" Coffee, Understanding the Plaintiff 's Attorney, 86 Colum. L. Rev. at 681 (noting that the \"classic illustration of this pattern is in the field of antitrust enforcement, where private antitrust class actions have tended to piggyback on a prior governmental proceeding\").\n\nIt is not clear on the record before us that class counsel had so significant a role in the institution of the Task Force proceedings that the district court was justified in crediting counsel for all of the benefits created under the Task Force plan. Indeed the district court offers no record citation or other explanation to supports its assertion that class counsel made \"substantial contributions\" to the terms of the Task Force plan.\n\nAfter reviewing the record, we have doubts whether class counsel was a material factor in bringing about the Task Force plan. Although Prudential may have urged the formation of the Task Force following the institution of the lawsuits, there is evidence to suggest that, absent the institution of the class action proceedings, state regulators would have reached an agreement with Prudential similar to the Task Force plan. For example, Lead Counsel notes that \"[a]t least every five years, the New Jersey Department of Banking and Insurance is required to conduct a market conduct examination of Prudential . . .[and in] March 1995, New Jersey was beginning another such examination.\" Weiss Aff. ¶ 27. The results of that examination were issued on July 28, 1996, only a few weeks after the Task Force Report, and examined a number of the same issues as the Task Force Report, including customer complaints of vanishing premiums, misrepresentation, improper replacements, and other improper underwriting other than replacements. Furthermore, the Task Force itself explained that it was formed \"in response to widespread allegations of improper sales and marketing activity of life insurers\" in general, not just allegations involving Prudential. Taken together, the record evidence raises questions about whether the district court could appropriately base class counsel's fee on the entire value of the proposed settlement.\n\nAssuming arguendo that class counsel was a\"catalyst\" for the Task Force plan, the question remains to what degree that factor must be considered when calculating the fee award. \"[N]umerous courts have concluded that the amount of the benefit conferred logically is the appropriate benchmark against which a reasonable common fund fee charge should be assessed.\" Conte, 1 Attorney Fee Awards § 2.05, at 37. The district court found class counsel should be credited for the entire value created by the Task Force plan, instead of only those enhancements created by class counsel under the Settlement Agreement. We are not so certain. Krell notes that a stay order was in place from October 1995 until after the Task Force issued its report on July 9, 1996, and questions how the district court could credit class counsel for the entire value of the Task Force Plan. In addition, we question why class counsel should be credited for the global enhancements negotiated between Prudential and each of the four objecting states, enhancements which the district court found were incorporated into the final settlement.\n\nWe do not dispute that class counsel's efforts benefitted the class and that they should receive a fee award which recognizes those efforts. The district court described several enhancements class counsel made to the Task Force plan. See (supra) § I.B.1. \u0026 notes 21-22. Even Krell conceded that class counsel created additional benefits for the class. Fee Hr'g Tr. at 17-18. Our concern is not the number of enhancements created, but rather how to value the benefits created by class counsel. The crux of this inquiry is distinguishing those benefits created by class counsel from the benefits created under the Task Force Plan. This determination is especially crucial in consumer class actions where federal or state agencies, including attorneys general, have conducted their own investigations of wrongdoing. The district court did not address these issues. Because it credited class counsel with creating the entire value of the settlement it did not attempt to distinguish between those benefits created by the Task Force and those created by class counsel. Consequently, we will remand to the district court for further examination.\n\nIn addition, the matters raised here may counsel in favor of allowing additional limited discovery on this issue on remand. While plaintiffs' expert found that class counsel was responsible for $1.123 billion of the settlement's total value, he also conceded that those figures were merely \"approximations.\" Krell claims the lack of discovery prevented him from performing a similar analysis and rebutting the expert's valuations. Although mindful of the common wisdom that \"discovery in connection with fee motions should rarely be permitted,\" Manual for Complex Litigation, Third § 24.224, we believe limited discovery may be necessary in this instance to properly determine the value of those benefits for which class counsel can properly be credited. We leave this to the sound discretion of the district court.\n\nb. The Appropriate Percentage Recovery\n\nWe are also troubled by the district court's calculation of the appropriate percentage award. The district court actually examined two distinct percentages in connection with its bifurcated fee award. First, it awarded class counsel approximately 11% of the \"Minimum Fund\" of $410 million created by the settlement, resulting in an initial award of $45 million. Second, based on the submission of at least 330,000 election forms, the court awarded class counsel an additional $45 million. Assuming the threshold were met and the full $90 million fee were awarded, the court found this fee constituted 6.7% of the \"common fund\" created under the settlement,\u003cspan class=\"fnref\"\u003e117\u003c/span\u003e a figure the district court concluded was \"fair and reasonable . . . [and] comport[ed] with the Fee examiner's recommendation of an award of 7-8%.\" Fee Opinion, 962 F. Supp. at 587-88.\n\nThe district court considered several factors in order to determine the appropriate percentage award, including the size of the award, fee percentages applied in other class actions, the quality of class counsel, and the fee percentage that would likely have been negotiated between private parties. While we agree these factors offer some guidance, in cases of this magnitude they should receive less weight. In considering the size of the expected recovery under the proposed settlement, the district court observed that \"percentage awards generally decrease as the amount of the recovery increases.\" Fee Opinion, 962 F. Supp. at 580 (citations omitted). The basis for this inverse relationship is the belief that \"[i]n many instances the increase [in recovery] is merely a factor of the size of the class and has no direct relationship to the efforts of counsel.\" In re First Fidelity Bancorporation Securities Litigation, 750 F. Supp. 160, 164 n.1 (D.N.J. 1990). The district court concluded that \"some reduction is appropriate in this case where the recovery will equal at least $410 million.\" Fee Opinion, 962 F. Supp. at 585.\n\nWe agree with the district court's analysis, but question whether the \"reduction\" implemented adequately adjusted the fee in relation to the size of this settlement. Compared to the other large settlements examined by the district court, the size of this settlement exceeds all of them by a considerable margin.\u003cspan class=\"fnref\"\u003e118\u003c/span\u003e Yet the 6.7% fee the court awarded was actually higher than some of the smaller cases it used as a benchmark.\n\nThe district court also examined the fee awards in class actions with recoveries exceeding $100 million and found the fee percentages ranged from 4.1% to 17.92%. Id. at 585. The court reasoned the \"enormous settlements\" in those cases made them comparable, and provided some guidance as to an appropriate percentage. Id. at 586 n.32. While we agree this is an appropriate factor to consider in most class actions, we believe in this instance the size of the class and the settlement render such comparisons unreliable. As noted, the fee percentage awarded by the court was actually higher than some of the fee awards in these large class actions, despite the court's finding that the common fund here would be at least $410 million and could increase to more than $1 billion.\n\nThe district court also found class counsel's representation and the results achieved were \"nothing short of remarkable.\" Id. at 585-86. Among the factors it examined were the \"innovative\" terms of the settlement, including the availability of full compensatory relief, the extensive and comprehensive outreach, and the multi-tiered review process designed to ensure fair scoring of claims; the approval given to the settlement by insurance regulators from all fifty states and the District of Columbia; and the standing and skill of class counsel.\n\nWe agree. As discussed, the settlement is a fair and reasonable resolution of this class action. Furthermore, there is no doubt as to class counsel's skill and reputation. All agree class counsel added value to the Task Force plan.\u003cspan class=\"fnref\"\u003e119\u003c/span\u003e\n\nThe district court then noted the fee examiner's conclusion that \"were this case the subject of a private contingent fee agreement at the time of engagement, counsel might well have demanded and received . . . upward of 20%, and even as high as 40%, of any future recovery.\" Id. at 587 (quoting Fee Examiner's Report at 60). While the court did not give great weight to this hypothetical exercise, it nonetheless agreed with the fee examiner's Conclusion that class counsel \"would have negotiated a fee of at least 10 to 15% of the recovery.\" Id. (quoting Fee Examiner's Report at 61).\n\nWe question the significance of this inquiry to class action lawsuits of this magnitude. While such private fee arrangements might be appropriate in smaller class actions or litigation involving individual plaintiffs, we do not believe they provide much guidance in cases involving the aggregation of over 8 million plaintiffs and a potential recovery exceeding $1 billion.\n\nBecause the district court's basis for, and calculation of, the appropriate fee percentage was unclear in light of the facts and cases it referenced, and because it should set forth a reasoned basis and Conclusion regarding the proper percentage applicable in this case, we will remand for a more thorough examination and explication of the proper percentage to be awarded to class counsel in this case, in light of the magnitude of the recovery.\n\nc. Lodestar Calculation\n\nKrell objects to the district court's application of the lodestar method to cross-check its fee award, in particular its application of a \"risk\" multiplier to the lodestar in order to bring the calculation in line with the fee awarded under the percentage-of-recovery method. In addition, Krell contends the court improperly based its lodestar calculation on inaccurate time summaries provided by class counsel.\n\ni. Multiplier\n\nOnce the district court created its bifurcated fee award using the percentage-of recovery model, it employed the lodestar method to cross-check the fee award. See G.M. Trucks, 55 F.3d at 820. Based on the analysis submitted by Lead Counsel, the court found the lodestar as of January 31, 1997 was approximately $17.7 million\u003cspan class=\"fnref\"\u003e120\u003c/span\u003e plus expenses of just over $3 million. While it noted this figure was understated because it did not include hours billed after Lead Counsel submitted the analysis, the court found the lodestar figure would result in a multiplier of only 5.1 and an average hourly rate of $1,148.70 if the full $90 million were awarded under the modified fee schedule. The court found this multiplier was \"substantially less\" than the multiplier approved by this Court in Weiss v. Mercedes-Benz of N. Am., Inc., 66 F.3d 314 (3d Cir. 1995), aff'g 899 F. Supp. 1297, 1304 (D.N.J.) (awarding a fee that resulted in a multiplier of 9.3 and an average hourly rate of $2,779.63).\n\nWe question the use of such a large a multiplier in this instance. Courts apply multipliers to lodestar calculations for various reasons. Multipliers may reflect the risks of nonrecovery facing counsel, may serve as an incentive for counsel to undertake socially beneficial litigation, or may reward counsel for an extraordinary result. By nature they are discretionary and not susceptible to objective calculation. The Third Circuit Task Force on Court Awarded Attorney Fees implicitly recognized this difficulty. Court Awarded Attorney Fees, 108 F.R.D. at 247 (the lodestar calculation \"is subject to manipulation by Judges who . . . first determine what they wish to award, either in percentage or dollar amount terms, and then massage the major variables in the [lodestar] fee-setting procedure\"). Consequently, courts must take care to explain how the application of a multiplier is justified by the facts of a particular case. Hensley v. Eckerhart, 461 U.S. 424, 437 (1983) (\"It remains important, however, for the district court to provide a concise but clear explanation of its reasons for the fee award.\"); Ranco Indus. Prods. Corp. v. Dunlap, 776 F.2d 1135, 1140 (3d Cir. 1985) (\"[C]areful appellate review requires that the district court explain on the record the basis for its calculation.\").\n\nIn this instance, the court offers little explanation as to why a multiplier was necessary or appropriate. With no explanation for its application, we have no basis to evaluate it.\u003cspan class=\"fnref\"\u003e121\u003c/span\u003e While we are cognizant that \"[m]ultiples ranging from one to four are frequently awarded in common fund cases when the lodestar method is applied,\" 3 Newberg § 14.03 at 14-5, we cannot assess the propriety of a multiplier without findings to review.\u003cspan class=\"fnref\"\u003e122\u003c/span\u003e\n\nFurthermore, the testimony of one of plaintiffs' own experts appears to call into question the multiplier of 5.1. Plaintiffs' expert noted the speed and quality of the results achieved were attributable \"in no small part to the fact that many of class counsel had participated in the New York Life insurance litigation . . . in which they created what became the blueprint for the Task Force plan which, in turn, became the baseline from which class counsel began their negotiations with Prudential.\" Joint Appendix at 4793. While plaintiffs' expert reasoned this expertise should not lead to the Conclusion that class counsel \"should not be rewarded for what arguably appears to be duplicative,\" we also decline to draw the opposite Conclusion.\n\nWe recognize the district court employed the lodestar calculation only as a cross check. Yet we cannot agree with its Conclusion that the \"cross-check under the lodestar method confirms that the fees and expenses awarded here are fair and reasonable under the circumstances of this case.\" Fee Opinion, 962 F. Supp. at 592-93. Based on the present record, we cannot find a justification for the multiplier, which appears merely to correspond with the total fee award. Our concerns regarding the lodestar calculation only underscore our questions about the propriety of the district court's fee award.\n\nii. Time Records\n\nKrell also disputes the district court's calculation of the lodestar figure, claiming its reliance on time summaries, rather than detailed time records, undermines its value as a cross-check of the fee award. Krell raises certain issues which allegedly demonstrate the unreliability of class counsel's time summaries. First, he questions the number of hours worked by class counsel, noting the figure seems high in light of the district court's order staying discovery from October 1995 until August 1996.\u003cspan class=\"fnref\"\u003e123\u003c/span\u003e Second, Krell alleges Lead Counsel's fee petition contained \"millions of dollars of overcharges and potential overcharges.\"\u003cspan class=\"fnref\"\u003e124\u003c/span\u003e Third, Krell notes the lodestar amount nearly doubled between the November and the February petitions, with Lead Counsel claiming additional time had been spent on due diligence, despite the fact that due diligence was expected to end on October 28, 1996. Finally, Krell points out that the fee examiners' report included a $1 million overcharge for expenses.\u003cspan class=\"fnref\"\u003e125\u003c/span\u003e\n\nThe district court disagreed, finding detailed time summaries were unnecessary where, as here, it was merely using the lodestar calculation to double check its fee award. The court also dismissed Krell's objection to the hours allegedly worked after the settlement wasfiled on October, 1996, reasoning that class counsel had other responsibilities after that date, including monitoring the 800 number established under the settlement, negotiating the outreach program, and preparing documents in support of the settlement.\n\nAs we have noted, district courts generally decide fee awards without full blown discovery. In any event, whether to grant discovery is committed to the sound discretion of the court. Also, we are mindful of the Supreme Court's admonition that \"[a] request for attorneys' fees should not result in a second major litigation.\" Hensley, 461 U.S. at 437. We recognize the lodestar calculation in this case was solely intended as a cross-check of the court's primary fee calculation using the percentage-of-recovery methodology, which counsels a cautious approach to additional fee discovery. Furthermore, our primary concern with the lodestar approach here is the multiplier. As a result, we see no abuse of discretion in declining to grant discovery here on the time records. As we have set forth, the district court on remand should reconsider permitting limited discovery on the benefits to the class secured by class counsel.\n\nD. Conclusion\n\nIn awarding attorneys' fees, the district court has considerable discretion. We recognize that in cases of this magnitude, the broad standards set forth in the case law provide little guidance. What is important is that the district court evaluate what class counsel actually did and how it benefitted the class. Furthermore, where so much of the settlement was achieved by the Task Force, and other enhancements resulted from the separate negotiations of state regulators, it is essential to separate out the benefits attributable to class counsel.\n\nVII. KRELL'S MOTION TO RECUSE\n\nA. Procedural History\n\nOn December 3, 1996, the Krell and Kittle plaintiffs moved on an emergency basis to recuse the district Judge from this case under 28 U.S.C. § 455,\u003cspan class=\"fnref\"\u003e126\u003c/span\u003e alleging inter alia improper ex parte meetings and judicial interference with related state court proceedings. The court issued a show cause order dated December 5, 1996, requesting interested parties to oppose or support the motion, and scheduled a hearing for December 13, 1996.\u003cspan class=\"fnref\"\u003e127\u003c/span\u003e Following oral argument, the court denied Krell's motion. Krell subsequently filed a petition for mandamus with this court, again seeking recusal. That petition was denied without opinion on February 7, 1997. On appeal, Krell once more raises the issue of the district court's recusal. Once more, we shall reject it.\n\nOn appeal, Krell reasserts his claim that the district court should have recused itself based on its \"tireless and unrelenting\" bias in favor of the settling parties. According to Krell, \"the District Court did what was necessary to impose upon Prudential's policyholders one sweeping class action resolution providing global peace for Prudential.\" Krell Reply Brief at 67. But Krell's briefs offer no new arguments in support of his claims. We review under an abuse of discretion standard. United States v. Antar, 53 F.3d 568, 573 (3d Cir.1995).\n\nB. Legal Standard\n\nThe Krell objectors brought this motion under 28 U.S.C. §§ 455(a), 455(b)(1) and 455(b)(5)(iv).\u003cspan class=\"fnref\"\u003e128\u003c/span\u003e A party seeking recusal need not show actual bias on the part of the court, only the possibility of bias. Liteky v. United States, 510 U.S. 540, 553 (1994). But, as we noted in Antar,\"[b]iases stemming from facts gleaned during judicial proceedings themselves must be particularly strong in order to merit recusal.\" 53 F.3d at 574. The court must \"reveal such a high degree of favoritism or antagonism as to make fair judgment impossible.\" Liteky, 510 U.S. at 555. Under § 455(a), \"if a `reasonable man, were he to know all the circumstances, would harbor doubts about the Judge's impartiality' under the applicable standard, then the Judge must recuse.\" Antar, 53 F.3d at 574 (quoting In re Larson, 43 F.3d 410, 415 (8th Cir. 1994)).\n\nC. Krell's Arguments on Appeal\n\nWith these standards in mind, we now examine Krell's specific arguments.\n\n1. Ex Parte Meetings\n\nFirst, Krell argues the court's remarks at an October 1996 hearing indicate the district Judge had an off-the-record Discussion of alleged document destruction with Attorney David Gross, counsel to former Prudential employee David Fastenberg. At that hearing, the Judge stated that \"Fastenberg's own lawyers say there was no document destruction.\" Tr. of Hearing, Joint App. at 1975. According to Krell, this was an acknowledgment that the court \"had obtained off-the-record factual information concerning a material and disputed evidentiary matter (document destruction) then before it.\" Krell Brief at 17. We cannot agree.\n\nPrudential fired Fastenberg for allegedly allowing the destruction of documents in the office he supervised. In response, Fastenberg filed a wrongful termination suit against Prudential, denying his involvement in any document destruction. Consequently, Fastenberg's denial was already a matter of public record. In addition, as noted by the district court at the recusal hearing, Fastenberg's termination and his subsequent lawsuit were widely reported in the press. Joint App. at 4728; see also Joint App. at 11421-11438. Finally, Krell has offered no other evidence to support his contention that the district Judge had an improper, ex parte meeting with Fastenberg's attorney. Based on the record before us, we se no abuse of discretion.\n\n2. The Conference With State Insurance Regulators\n\nKrell also claims the district court held an improper, non-judicial conference with insurance regulators and the news media on October 16, 1996, in order to discuss the proposed settlement. Krell claims that notice of this meeting was not provided to counsel of record, and thus he was deprived of the opportunity to present the court and the regulators with class concerns and objections. In addition, Krell takes issue with several statements made by the district court at the conference.\n\nThe district Judge addressed Krell's concerns about the content of the October 16 meeting during the recusal hearing, noting that \"the Court did not request the meeting, nor did it set the agenda.\" Joint App. at 4725. The meeting was organized by Lead Counsel and counsel for Prudential, and the insurance regulators were invited by the\"New Jersey Insurance Regulators.\" Id. Lead Counsel explained the meeting was called in mid-October to address the possibility of merging the two then-pending settlements - the Task Force settlement and the proposed national class settlement. The Task Force settlement called for Prudential to begin sending class notices and election forms to policyholders by November 1, 1998. The meeting on October 16 was called to discuss timing issues related to the November notice deadline and the Rule 23 approval process. Both Prudential and Lead Counsel contend the October 16 conference transcript demonstrates that the adequacy of the settlement was not discussed during this meeting.\n\nOnce again, we see no abuse of discretion. As the settling parties note, and a review of the transcript confirms, the adequacy of the settlement was not discussed at the October 16 meeting. The primary issue considered by the parties at that conference was the timing of the notice Prudential was required to send under the Task Force Plan. The district court gave no indication that his decision was contingent upon or affected by Prudential's obligations under the Task Force plan. Consequently, Krell was not prejudiced by his counsel's absence.\n\nKrell next accuses the district court of using \"an off-the-record procedure to convene\" the October 16, 1996 conference. Krell Brief at 18 n.19. According to Krell, \"there is no record as to how, when and why this conference came about, [and] there is no record which reflects why the Court determined not [sic] to inform various non-party insurance regulators and news reporters but not interested parties including Krell.\" Id.\n\nThis statement is untrue. As the district court explained, the October 16 meeting was organized by Lead Counsel and Prudential, not the district court. Consequently, the court did nothing to prejudice Krell.\u003cspan class=\"fnref\"\u003e129\u003c/span\u003e\n\nKrell also objects to the district Judge's reference to the proposed settlement as \"my settlement.\" Krell claims that judge Wolin demonstrated a bias in favor of the settlement when he \"exhorted\" those present to \"hang together [so that we may] accomplish what we have to accomplish for all our respective interests.\"\n\nWe accept the district court's explanation that he was merely using the expression \"my settlement\" as a convenient method to distinguish between the Proposed Settlement and the Task Force Settlement. Joint App. at 4726. At the October 16th hearing, the district court made it clear that it had not yet made any decisions regarding the terms of the proposed settlement or the proposed settlement class. \"No one should leave here today thinking that Judge Wolin's silence, Judge Wolin's nod, a smile at a particular time, means that he will approve this settlement. I don't have the slightest idea. I don't know who the objectors are. I haven't heard any evidence.\" Tr. of October 16 Hearing at 38. Clearly, Krell's allegation has no merit.\n\n3. Rutt v. Prudential\n\nThird, Krell argues the district court attempted to influence the Pennsylvania state court proceeding in Rutt v. Prudential, scheduled before Judge Allison in the Court of Common Pleas for Lancaster County. According to Krell, the record indicates that Prudential's attorney informed judge Allison that the district Judge was \"receptive to a discussion\" with Judge Allison regarding potential ethical improprieties implicating both cases. Krell also claims that, at the show cause hearing on December 2, 1996, \"Judge Wolin stated he could speak with any state court and saw nothing wrong with the use of the Court's name in the way it was used by Prudential to influence Judge Allison in Rutt.\" Krell Brief at 18-19. The settling parties note the district court expressly denied attempting to influence judge Allison. See Tr. of December 2, 1996 Show Cause Hearing at 6-7.\n\nIn late 1996, Prudential moved to disqualify Bruce Miller, lead counsel in the parallel actions filed against Prudential by a group of former Prudential agents, on the grounds that Miller had arranged for one of his clients to be paid for testimony in a state court action against Prudential in Alabama. The district court requested and received from Mr. Miller certain documents relating to the Alabama case of Key v. Prudential and reviewed those documents in camera. Concerned that the documents raised certain ethical concerns, the district court issued an order to show cause on November 20, 1996 why those documents should not be released to Prudential. Prudential, concerned about Miller's representation in the Pennsylvania state court case Rutt v. Prudential, sought to raise the issue of possible ethical improprieties with Judge Allison. During an on-the-record conference in Judge Allison's chambers, Harold Hirshman, Prudential's attorney and a partner of Prudential's counsel in this matter, provided Judge Allison with a copy of the district court's November 20th letter and show cause order with respect to Mr. Miller. Mr. Hirshman also informed Judge Allison that \"[t]he one thing we did learn in addition to what I've already said, or my office learned, I did not speak to Judge Wolin's office myself, is that Judge Wolin is receptive to a Discussion with Your Honor by telephone about his views, and we have no objection to that telephone call going ahead.\" Tr. of November 26, 1996 Hearing in Rutt v. Prudential at 4. Mr. Hirshman goes on to suggest that Judge Allison \"place such a call to Judge Wolin and see what he has to say.\" Id. at 5. According to Krell, this was a clear attempt by the district court to influence the Rutt litigation, and demonstrates a bias in favor of Prudential.\n\nWe disagree. We do not impute any bias to the district court. There is no indication the district court asked Mr. Hirshman to make such a representation to Judge Allison. On the contrary, during the show cause hearing on December 2, 1996, the district court explicitly stated that he did \"not send any representative to see Judge Allison in the Pennsylvania case of Rutt v. Prudential.\" Tr. of December 2, 1996 Show Cause Hearing at 6-7. According to the district Judge, he had merely stated that, if a state court Judge called him, he would speak to that Judge\"as a matter of courtesy.\" Id. at 7. There is nothing in the record, save the statements made by Mr. Hirshman, to support Krell's contention. Finally, we note that we see nothing wrong with members of the federal and state judiciary trying to coordinate where their cases overlap. Coordination among Judges can only foster the just and efficient resolution of cases.\n\nThere is no basis for believing the district court was attempting to influence the state court proceedings in Rutt. Krell's claims, now before us for the second time, are clearly without merit. We find no abuse of discretion here.\n\nThe resolution of a class action, especially one as large as this, is never a simple task. Based on our review of the record, we note the extraordinary manner in which the district Judge addressed the complex legal and factual issues raised by this case and handled the myriad procedural and administrative responsibilities which accompany a class action of this size.\n\nVIII. CONCLUSION\n\nFor the foregoing reasons, we will affirm the certification of the proposed class and the approval of the settlement, and vacate and remand on the issue of attorneys' fees.\n\nROTH, Circuit Judge, Concurring.\n\nWhile I join in the majority's ultimate Conclusion that the district court had jurisdiction over the claims of all classmembers, I respectfully disagree with its determination in subsection III.A.1 that the district court had supplemental jurisdiction by virtue of its federal question jurisdiction over the federal securities claims of named plaintiff, Martin Dorfner. Only 30% of the absent classmembers have claims arising under federal law; the remaining classmembers assert claims under state fraud statutes. Under the Supreme Court's decision in United Mine Workers v. Gibbs, 383 U.S. 715 (1966), courts may exercise supplemental jurisdiction only when the federal and state claims arise from a common nucleus of operative fact. Thus, for example, supplemental jurisdiction may be asserted when the federal and state claims \"are merely alternative theories of recovery based on the same acts.\" Lyon v. Whisman, 45 F.3d 758, 761 (3d Cir. 1995) (quoting Lentino v. Fringe Employee Plans, Inc., 611 F.2d 474, 479 (3d Cir. 1979)).\n\nIn this case, the district court found the federal and state claims alleged by class members to be \"inextricably intertwined\" because they \"are premised upon a common course of conduct by Prudential; all related to the same alleged company-wide development and implementation of patently fraudulent sales techniques.\" In re the Prudential Ins. Co. of America Sales Practices Litigation, 962 F. Supp. 450, 501 (D.N.J. 1997). Although the injuries of all classmembers may arise from a common scheme to defraud, it is far from clear that all of their state claims share a common nucleus of operative fact with Dorfner's federal securities claims.\n\nIn contrast, I find the requirement of a common nucleus of operative fact would be satisfied if the basis for the application of supplemental jurisdiction was derived from the district court's diversity jurisdiction over the state law claims of the remaining named plaintiffs. These plaintiffs raise a more diverse array of claims than those alleged by Dorfner. As a group, their claims are representative of the claims of the class as a whole.\n\nThe majority opinion undertakes a detailed and well-reasoned analysis of the present uncertainty surrounding the use of diversity jurisdiction as a basis for supplemental jurisdiction in subsection III.A.2, only to avoid answering the ultimate question of whether the Supreme Court's decision in Zahn v. International Paper Co., 414 U.S. 291 (1973), remains good law following the enactment of 28 U.S.C. § 1367. I would reach this question and would hold that under the plain language of § 1367, the amount-in-controversy requirement articulated in Zahn is no longer applicable to absent classmembers.\n\nI am concerned that, by avoiding the question of whether § 1367 overrules Zahn and by basing its finding of jurisdiction on the securities claims, the majority establishes a dangerous precedent. I fear the majority's decision on jurisdiction risks opening the federal courts to a wide array of state claims whenever a complaint incorporates both federal and state claims, no matter how tangentially related the state claims might be to federal claim upon which jurisdiction is based. As this Court wrote in Lyon, \"when a court exercises federal jurisdiction pursuant to a rather narrow and specialized federal statute it should be circumspect when determining the scope of its supplemental jurisdiction.\" 45 F.3d at 764.\n\nAccordingly, I join with the majority in holding that the district court had jurisdiction over the claims of all classmembers, but I do so based on my determination that supplemental jurisdiction can be derived from the diversity claims of the named plaintiffs.\n\nA True Copy: Teste:\n\nClerk of the United States Court of Appeals for the Third Circuit\n\n\u003cspan class=\"fn\"\u003e1.. The New Jersey Department of Banking and Insurance also conducted an independent market conduct investigation of Prudential's New Jersey business. Its report was issued on July 9, 1996.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2.. According to the Task Force Report, eleven states and the District of Columbia \"actively participated\" in the investigation: Arizona, Arkansas, California, Illinois, Maryland, Massachusetts, Minnesota, Nevada, New Jersey, Ohio, and Washington. These twelve jurisdictions represented approximately 36.5 percent of the 10.7 million Prudential policies sold during the investigation period. Report of the Multi-State Life Insurance Task Force and Multi-State Market Conduct Examination of the Prudential Insurance Company of America at 1-2 (\"Task Force Report\"). The Attorney General of the State of Connecticut began a separate investigation of Prudential in April 1995, in response to the filing of a class action complaint in United States District Court for the District of Connecticut. Although the Connecticut Insurance Commissioner subsequently joined the Multi-State Task Force, the Attorney General completed its independent investigation and issued a report on November 21, 1995.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3.. According to the Task Force Report, a combination of regulatory and economic changes in the 1970s and 1980s created an atmosphere within the insurance industry that was more amenable to the replacement of insurance policies. For example, the rise in interest rates allowed insurance companies to offer new products \"designed to compete with banks, money market funds and newly founded life insurers,\" and thus led companies to abandon their usually conservative approach. Task Force Report at 7. At the same time, the original model replacement regulations, which stated that replacement transactions were generally not in the best interest of the customer, were modified to allow for these transactions in certain cases. See Discussion (infra) § V.A.4. \u0026 n.66. As a result of these changes, replacement activity flourished.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4.. The Task Force found that, \"[b]ecause of the nature of the transactions and possible improprieties, an electronic analysis could not identify every instance of sales abuse or violation of law or regulation.\" Task Force Report at 6.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5.. The structure of this remediation plan was based on a settlement reached between a number of the class counsel here and New York Life Insurance Company in a similar class action. Task Force Report at 198.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6.. More than 100 actions have been centralized in the District of New Jersey by the MDL Panel. In re The Prudential Ins. Co. of America Sales Practice Litigation, 962 F. Supp. 450, 479 n.13 (D.N.J. 1997) (\"Fairness Opinion\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7.. Appellant Krell moved the district court to remand his case to state court. After the district court denied that motion on April 16, 1996, Krell filed a petition for mandamus relief with this Court. We denied that motion without opinion on September 25, 1996.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8.. Krell declined to join the class, claiming that Ohio policyholders with replacement claims deserved the protection of Ohio insurance law. Krell Brief at 5.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9.. According to Lead Counsel, the negotiations then proceeded through three stages. The first, from July 6th through August 16th, involved preliminary negotiation of the terms of settlement. During the second phase, which ran from August 17th through September 22nd, the parties negotiated the details of the actual Settlement Agreement. Finally, from September 23rd until October 28th, the parties worked out the final Stipulation of Settlement. Weiss Aff.¶ 103.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10.. While the Complaint stated that \"Prudential's scheme involved [these] three notorious deceptive life insurance sales tactics,\" Second Am. Cons. Compl. ¶ 5, the allegations detailed therein also refer to other sales abuses which fall outside these three categories. See, e.g., Second Am. Cons. Compl. ¶ 89-91 (alleging Prudential took affirmative steps to conceal its misrepresentations); ¶ 114-16 (alleging Prudential agents informed the Nicholson plaintiffs to \"ignore\" notices concerning lapses in their policies); ¶ 128 (alleging a Prudential agent made unauthorized withdrawals from the policy of named plaintiff Dorfner).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11.. Carol Nicholson brought suit as executrix of the estate of her deceased husband Keith. From 1966 to 1984, the Nicholsons purchased four Prudential policies worth approximately $30,000. In 1986, Keith Nicholson purchased an addition $100,000 policy, allegedly as a result of Prudential's fraudulent sales practices. Carol Nicholson alleged churning, vanishing premium and investment plan claims. Martin Dorfner and his wife operate a small grocery store in Pennsylvania. By July 1989, they owned several Prudential policies. Dorfner alleges that his Prudential agent informed the Dorfners that they were entitled to a \"free\" policy, and proceeded to open another whole life policy for them using funds drawn from their existing policies. In addition, the same agent persuaded the Dorfners to purchase a $50,000 variable appreciable life insurance policy from Prudential in April 1991, allegedly using misleading sales information. Dorfner brought suit in January 1995, alleging churning and vanishing premium claims. Vincent and Elizabeth Kuchas are Connecticut residents who purchased individual variable life policies from Prudential. In 1987, their agent suggested that they purchase additional policies. The Kuchases allege that they informed the agent that they were seeking an investment similar to an IRA, and could not afford an investment plan if they had to continue payment on their current Prudential policies. The agent allegedly persuaded the Kuchases to purchase two VAL policies while misinforming them as to their continuing payment obligations with respect to their initial policies. In September 1994, the Kuchases learned that the initial policies had lapsed and that their agent had taken out loans against the initial policies to pay for the VALs. They filed suit in February 1995. Norman Gassman, an Ohio citizen, filed suit against Prudential in May of 1995, alleging an investment plan claim. According to Gassman, a Prudential agent persuaded Gassman to take $20,000 from a certificate of deposit and \"invest\" it in a VAL policy. Gassman alleges that the agent held himself out as a \"financial planner\" or\"financial consultant\" and explained that a VAL policy was part of an \"investment plan,\" paid a higher rate of interest than a CD at a low risk, and was tax free. In reliance on these representations, Gassman purchased the VAL policy.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12.. On October 25, 1996, Prudential formally responded to plaintiffs' discovery requests, producing over one million pages of documents, 160 computer diskettes, and more than 500 audio and video tapes. See Weiss Aff. ¶ 85.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13.. Although § K of the Settlement Agreement was entitled \"Attorneys' Fees, Costs and Expenses,\" subsection K.1 was left blank. Subsection K.2 addressed certain additional expenses to be included in any payment of fees, and guaranteed that any payment of fees would not reduce the remedies provided under the agreement. Subsection K.3 also provided that Prudential's liability for fees would be limited only to those fees expressly provided for by the Settlement Agreement.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14.. The injunction barred policyholders from pursuing overlapping litigation unless the policyholder had opted out of the class, and prevented them from excluding other policyholders from the class. After the class notice was mailed, several named plaintiffs in a competing nationwide class action, filed and certified in Alabama state court three days after the Settlement Agreement was signed (the\"Steele action\"), opted out of the class. The so-called \"Steele Opt-outs\" also attempted, as class representatives in the Steele action, to execute opt-outs on behalf of the entire class. At Prudential's request, the district court issued an Order to Show Cause on January 22, 1997. On May 28, 1997, the district court ruled that the opt-out of the Steele class was null and void as a violation of the permanent injunction. The Steele Opt-outs filed an appeal with this Court. We affirmed the district court in an unpublished opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15.. In December 1996, Krell moved the district court to recuse itself. The district court denied the motion, and Krell's subsequent petition for mandamus relief was denied by this Court without opinion on April 4, 1997.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16.. The following were explicitly excluded from the class: 1) policyholders who were represented by counsel and had already settled a claim and signed a release with Prudential; 2) policyholders that are corporations, banks, trusts or other non-natural entities that purchased policies as corporate or trust-owned life insurance and under which a) there are fifty or more separate insured individuals, or b) the aggregate premium paid over an eight year period, ending with the close of 1996, exceeds $1 million; and 3) those policyholders who were issued policies in 1995 by Prudential Select Life Insurance Company of America. Stipulation of Settlement at 13.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17.. The financed insurance criteria include an assessment of Prudential's conformity with state replacement laws.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18.. The scoring system set forth in the Stipulation of Settlement is as follows: - A score of \"3\" is assigned in the event that either (i) Company Documentation expressly supports the Misstatement, or (ii) the Agent Statement confirms the Claimant's allegation of the Misstatement and this confirmation is not undermined by Available Evidence. - A score of \"2\" is assigned in the event that the alleged Misstatement is not expressly in writing and the Agent Statement denies the allegations, but (i) Available Evidence, on balance, supports the Claimant's allegation of the Misstatement, or (ii) the Agent has a Complaint History. - A score of \"1\" is assigned in the event that the alleged Misstatement is not expressly in writing and the Agent Statement denies the allegation, and Available Evidence, on balance, neither supports nor undermines the Claimant's allegation of the Misstatement. - A score of \"0\" is assigned in the event that Available Evidence exists which undermines the Claimant's allegation of the Misstatement and suggests that no Misstatement occurred. - A score of \"N/A\" is assigned in the event that the Claim Resolution Factor is \"not applicable\" to the Claim submitted. Prudential Alternative Dispute Resolution Guidelines, Stipulation of Settlement, Ex. B, at 9.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19.. During this phase of the review, claimants may receive cost-free representation from a representative selected by class counsel and approved by the state regulators. The claimant is entitled to a full rehearing if the representative determines that a \"manifest inJustice\" has occurred.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20.. Under the Stipulation of Settlement, the following relief is available based on the category of claim proven: Financed Insurance - The policyholder may obtain a refund of the loans, dividends, or values improperly used, with interest in some cases. The policyholder also may be entitled to cancel the \"new\" policy and get back some or all of the premiums paid, with interest in some cases. Abbreviated Payment - The policyholder may be permitted to cancel the policy `and obtain a refund of some or all of the premiums paid, with interest in some cases. Alternatively, the policyholder may be permitted to keep the policy without having to make any additional out-of-pocket payments for some or all of the premiums due. Investment Product - The policyholder may be allowed to cancel the policy and obtain a refund of some or all of the premiums paid, with interest in some cases. Alternatively, the policyholder may be able to exchange the policy for an annuity. Other Claims - If a policyholder was misled in some other way, the policyholder may be allowed to cancel the policy and obtain a refund of some or all of the premiums paid, with interest in some cases, or may be able to use the refund to purchase another policy. Fairness Opinion, 962 F. Supp. at 490 (citing February 1, 1997 Notice at 7-8).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21.. The district court noted several improvements to the Settlement's ADR process that would enhance the ability of a policyholder to establish the presumption that he or she was misled. These enhancements to the ADR process were: (1) Provided that boilerplate statements in policy illustrations and contracts explaining that the dividends, interest or investment returns are \"not guaranteed\" or \"non-guaranteed,\" will not independently undermine a claim; (2) Reduced from six complaints to three the number of policyholder complaints against an agent which would entitle a claimant to a score of at least \"2\"; and (3) Extended the period during which policyholder complaints would be considered from July 9, 1996 to February 1, 1997. Fairness Opinion, 962 F. Supp. at 492.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22.. The district court also noted the proposed settlement \"include[d] significant improvements in the factors and evidentiary considerations used to evaluate claims.\" Fairness Opinion, 962 F. Supp. at 492. The court found that the settlement enhanced the Task Force ADR plan by: (1) Allowing a claimant's score to be raised if documents originally kept by Prudential that could affect the scoring have improperly been destroyed and no copies can be located; (2) Allowing the claimant's score for \"churning\" to be raised if 12% of the selling agent's total sales were \"financed insurance\" sales, as opposed to a threshold figure of 15% under the Task Force plan; (3) Allowing a claimant's score to be raised if blank, unsigned disbursement forms were used without the policyholder's consent; (4) Allowing a claimant's score to be raised for \"vanishing premium\" claims if an agent used the phrases \"vanishing premium\" or \"vanishing point\" in writing in connection with the sale of the policy at issue; (5) Removing as a negative consideration the fact that a policy lapsed prior to the date when the premiums were to \"vanish\", if it appears that the policyholder became aware, prior to the misrepresented \"vanish\" date, that the policy would not perform as illustrated; (6) Requiring Prudential to contact agents regarding policies they sold to obtain additional information about the sale of the policy, and to encourage honest responses by agreeing not to take disciplinary action against an agent based on his or her truthful statements; (7) Removing Prudential from its co-equal role with the regulators in the selection of a representative to advocate on behalf of the claimant at the arbitration level, and eliminating the $10 million cap on the funding the representative could receive; and (8) Creating an entirely new position, the \"Claimant Representative,\" selected by Class Counsel and responsible for overseeing the entire process on behalf of the claimant, including the initial claim review. Id. at 492-93.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23.. The enhancements to the ADR remedies were: (1) The settlement provided 100% interest to claimants scoring a \"2\" or a \"3\" in the ADR process (compared to the Task Force plan, which provided zero interest for scores of \"2\"), and allows rescission of the policy and a refund of the premiums, with interest; (2) The settlement allowed a claim receiving a either a \"2\" or a \"3\" to receive relief where a policy lapsed before the claimant died, as opposed to the requirement under the Task Force plan that a claimant receive a \"3.\" three. (3) Full compensatory relief for a vanishing premium claim where a Prudential agent promised the claimant would have a\"paid up\" policy; (4) Removal of the exclusion in the Task Force plan which prevented claims on behalf of the decedent where the policyholder/decedent died while the policy was in force. Fairness Opinion, 962 F. Supp. at 493-94. The court found that the settlement enhanced the Basic Claim Relief by: (1) Eliminating fifty basis points on Optional Premium Loans; (2) Increasing Prudential's contributions to the annual premiums for Enhanced Value Policies; (3) Increasing Prudential's contributions toward the purchase price of Enhanced Value Annuities; (4) Creating a new form of Basic Claim relief known as Mutual Fund Enhancements, for which Prudential would contribute 4% of the initial purchase price to the fund, up to a maximum of $2,000. Id. at 494.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24.. At oral argument, Lead Counsel noted that approximately 1.8 million phone calls had already been processed. Tr. of Oral Argument, January 26, 1998, at 125 (Testimony of Melvyn Weiss).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25.. The district court postponed the hearing date, originally set for January 21, 1997, in order to allow policyholders more time to respond to the class notice and to provide the parties more time to prepare.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26.. The district court noted five enhancements which resulted from the negotiations between the state regulators and Prudential. These were: (1) The extension of the complaint history cut-off until February 1, 1997; (2) An increase in the interest paid on claims receiving a score of \"2\" from 50% to 100%; (3) The addition of an evidentiary criterion allowing the claim evaluator to consider that a claimant was 60 years or older at the time of the sale; (4) The addition of a claim resolution factor awarding an automatic score of \"3\" if a claimant's life insurance application contained an unauthorized signature; and (5) The requirement that Prudential provide claimants, at the claimants request, with current account information, such as outstanding loans, dividend payments and \"currently illustrated year of abbreviation.\" Fairness Opinion, 962 F. Supp. at 498.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27.. Krell disputes this finding, and argues that the additional enhancements benefitted only the citizens of those four states. Krell Brief at 47 n.56. Krell's argument relies primarily on its assertion that Florida residents received better notice and were benefitted by more favorable evidentiary presumptions, including a more favorable definition of replacements. Id.; see also Krell Reply Brief at 49-51. Lead Counsel responds that the court was correct to rely on Prudential's statements in open court to the effect that the enhancements would be available to all class members. Lead Counsel Brief at 58. Additionally, Lead Counsel notes that the district court found the settlement was fair and reasonable even without the state-negotiated enhancements. Id. We disagree with Krell. At the Fairness Hearing on February 24, 1997, Krell raised his concern regarding the state-negotiated enhancements. Prudential explained that \"the ADR plan changes that were agreed to with the four states in terms of modifications of scoring and relief will be made available nationally through the class settlement.\" Tr. of Fairness Hearing at 141. An examination of the settlements signed by the four objecting states and the Amendment to Stipulation of Settlement filed by the settling parties supports the district court'sfinding. Also, while Prudential's explanation does not specifically respond to Krell's assertion that Florida residents received enhanced notice, we do not believe this is significant. As discussed infra, we find the notice provided under the settlement was adequate, and it is not rendered inadequate by any additional notice provisions negotiated by an individual state. Finally, Krell's argument with respect to replacement claims misses the mark. As Prudential explained at the hearing, the \"scoring enhancements [in the ADR process] where there was a violation of state regulations on replacement will be based on each states' individual replacement regulations where the policy was sold . . . [t]he Florida provision is confirmatory and expands what is already in the plan.\" Tr. of Fairness Hearing at 174. Thus, any provision negotiated by Florida regarding the definition of replacement is based on Florida law and is not applicable to other states.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28.. The 1996 Amendment to 28 U.S.C. § 1332, which raised the amount-in-controversy requirement from $50,000 to $75,000, did not take affect until after the filing of the Second Amended Consolidated Complaint. See Pub. L. No. 104-317, § 205(b) (1996).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29.. They also argue that Dorfner could not be expected to bring both his federal claims and his purely state law claims in the same suit.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30.. The Lyon court found that \"under any standard, the nexus between the federal and state claims in this case is inadequate\" to support supplemental jurisdiction. 45 F.3d at 762. The court went on to note: Lyon's FLSA claim involved very narrow, well-defined factual issues about hours worked during particular weeks. The facts relevant to her state law contract and tort claims, which involved Whisman's alleged underpayment of a bonus and its refusal to pay the bonus if Lyon started looking for another job, were quite distinct. In these circumstances it is clear that there is so little overlap between the evidence relevant to the FLSA and state claims, that there is no \"common nucleus of operative fact\" justifying supplemental jurisdiction over the state law claims. In fact, it would be charitable to characterize the relationship of the federal and state claims as involving even a \"loose\" nexus. Id. at 763.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31.. Section 10(b) of the Securities Exchange Act of 1934 provides: It shall be unlawful for any person, directly or indirectly, by the use of any means or instrumentality of interstate commerce or of the mails, or of any facility of any national securities exchange-- * * * (b) To use or employ, in connection with the purchase or sale of any security registered on a national securities exchange or any security not so registered, any manipulative or deceptive device or contrivance in contravention of such rules and regulations as the Commission may prescribe as necessary or appropriate in the public interest or for the protection of investors. 15 U.S.C. § 78j(b).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32.. Section 20(a) of the Securities Exchange Act of 1934 provides: Every person who, directly or indirectly, controls any person liable under any provision of this chapter or of any rule or regulation thereunder shall also be liable jointly and severally with and to the same extent as such controlled person to any person to whom such controlled person is liable, unless the controlling person acted in good faith and did not directly or indirectly induce the act or acts constituting the violation or cause of action. 15 U.S.C. § 78t(a).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33.. Furthermore, many plaintiffs had more than one claim stemming from the conduct of Prudential's sales agents. For example, named plaintiff Nicholson alleged churning, vanishing premium and investment plan claims, while named plaintiff Dorfner alleged churning and vanishing premium claims. See (supra) note 11.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34.. Section 1367 provides: (a) Except as provided in subsections (b) and (c) or as expressly provided otherwise by Federal statute, in any civil action of which the district courts have original jurisdiction, the district courts shall have supplemental jurisdiction over all other claims that are so related to claims in the action within such original jurisdiction that they form part of the same case or controversy under Article III of the United States Constitution. Such supplemental jurisdiction shall include claims that involve the joinder or intervention of additional parties. (b) In any civil action of which the district courts have original jurisdiction founded solely on section 1332 of this title, the district courts shall not have supplemental jurisdiction under subsection (a) over claims by plaintiffs against persons made parties under Rule 14, 19, 20, or 24 of the Federal Rules of Civil Procedure, or over claims by persons proposed to be joined as plaintiffs under Rule 19 of such rules, or seeking to intervene as plaintiff under Rule 24 of such rules, when exercising supplemental jurisdiction over such claims would be inconsistent with the jurisdictional requirements of section 1332. (c) The district courts may decline to exercise supplemental jurisdiction over a claim under subsection (a) if-- (1) the claim raises a novel or complex issue of State law, (2) the claim substantially predominates over the claim or claims over which the district court has original jurisdiction, (3) the district court has dismissed all claims over which it has original jurisdiction, or (4) in exceptional circumstances, there are other compelling reasons for declining jurisdiction. 28 U.S.C. § 1367.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35.. It is interesting to note that one of the primary rationales for class actions is allowing access to the courts for parties whose individual claims are so small that it would be economically infeasible to pursue them individually. See 1 Herbert Newberg \u0026 Alba Conte, Newberg on Class Actions § 4.27 at 4-107 to 4-109 (3d ed. 1992). Consequently, upholding Zahn's amount-in-controversy requirement would largely undercut this purpose.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36.. The Federal Courts Study Committee Working Papers showed that the matter had come to the attention of the Committee. 1 Federal Courts Study Committee Working Papers and Subcommittee Reports 561 n.33 (\"From a policy standpoint, [Zahn] makes little sense, and we therefore recommend that Congress overrule it.\"). Nonetheless, the Committee did not adopt the proposal and, indeed, cautioned against reliance on the Working Papers. See Preface to Working Papers (\"These [Working Papers] were valued background materials which the Committee determined should be published for general consideration whether or not the Committee agreed with their substantive proposals. . . . In no event should the [Working Papers] be construed as having been adopted by the Committee.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37.. Appellants have questioned whether the notice adequately described the category of \"other improper sales practices\" claims so as to inform members that they might have a valid, compensable claim against Prudential. We believe it did. See Discussion (infra) § V.C.2.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38.. As noted above, the district court partially granted Prudential's motion to dismiss on May 10, 1996.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39.. The proposed settlement in Georgine was the by-product of ongoing negotiation and litigation involving a group of asbestos manufacturers and a myriad of plaintiffs whose cases had been consolidated in the Eastern District of Pennsylvania by the Multidistrict Litigation Panel. Counsel for both sides negotiated separate settlements to resolve both the then-pending claims against the CCR and the inventory of unfiled claims held by plaintiffs' counsel. Once the extant cases were settled, the parties filed the Georgine class action on behalf of approximately 2 million individuals who had not previously filed lawsuits against the asbestos defendants, but who had been exposed to asbestos products produced by defendants. While some members of the class had suffered physical injuries as a result of their exposure, other members of the class were \"exposure-only\" plaintiffs who had not yet developed any asbestos-related illness. The parties simultaneouslyfiled a complaint, an answer, a proposed settlement and a joint motion for conditional class certification. The district court granted the motion, and subsequently approved the settlement. On appeal, the Georgine court vacated the district court's opinion and remanded for decertification of the class, finding that the class did not satisfy the typicality, adequacy of representation, predominance and superiority requirements of Rule 23. Georgine, 83 F.3d at 618. The Supreme Court affirmed. Amchem, 117 S. Ct. at 2244. Throughout this opinion, we will distinguish between the opinions of this Court and the Supreme Court by referring to the Supreme Court's decision as Amchem, and referring to this Court's opinion as Georgine.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40.. The district court did not have the benefit of the Amchem decision when it rendered its opinion, and did not take settlement into consideration when conducting its certification analysis.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41.. In his separate opinion Concurring in part and Dissenting in part, justice Breyer, joined by Justice Stevens, questioned the consistency of the majority approach. \"If the majority means that these pre-settlement questions are what matters, then how does it reconcile its statement with its basic Conclusion that `settlement is relevant' to class certification.\" Amchem, 117 S. Ct. at 2254.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42.. Rule 23(a) provides: One or more members of a class may sue or be sued as representative parties on behalf of all only if (1) the class is so numerous that joinder of all members is impracticable, (2) there are questions of law or fact common to the class, (3) the claims or defenses of the representative parties are typical of the claims or defenses of the class, and (4) the representative parties will fairly and adequately protect the interests of the class. Fed. R. Civ. P. 23(a).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43.. Rule 23(b)(1) authorizes certification in cases where separate actions by or against individual class members would risk establishing \"incompatible standards of conduct for the party opposing the class,\" Rule 23(b)(1)(A), or would \"as a practical matter be dispositive of the interests\" of nonparty class members \"or substantially impair or impede their ability to protect their interests,\" Rule 23(b)(1)(B). Rule 23(b)(2) authorizes class actions seeking declaratory or injunctive relief, for example civil rights cases alleging class based discrimination.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44.. Rule 23(b)(3) provides: (b) An action may be maintained as a class action if the prerequisites of subdivision (a) are satisfied, and in addition: * * * (3) the court finds that the questions of law or fact common to the members of the class predominate over any questions affecting only individual members, and that a class action is superior to other available methods for the fair and efficient adjudication of the controversy. The matters pertinent to the findings include: (A) the interest of members of the class in individually controlling the prosecution or defense of separate actions; (B) the extent and nature of any litigation concerning the controversy already commenced by or against members of the class; (C) the desirability or undesirability of concentrating the litigation of the claims in the particular forum; (D) the difficulties likely to be encountered in the management of a class action. Fed. R. Civ. P. 23(b)(3).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45.. Rule 23(e) provides: A class action shall not be dismissed or compromised without the approval of the court, and notice of the proposed dismissal or compromise shall be given to all members of the class in such a manner as the court directs. Fed. R. Civ. P. 23(e)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46.. Courts frequently examine the Rule 23(a) requirement of commonality in conjunction with Rule 23(b)(3)'s\"predominance\" standard, reasoning that the \"predominance requirement incorporates the commonality requirement.\" Georgine, 83 F.3d at 626; 1 Newberg on Class Actions § 3.13, at 3-71. Although the district court followed this approach and examined the predominance and commonality requirements together, appellants have not questioned the court's finding that the proposed class satisfies this element of Rule 23(a).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47.. The district court found that plaintiffs would need to establish the following common factual issues at trial: - Prudential's common course of conduct; - Prudential's development of the sales presentations and materials, and artificial inflation and maintenance of dividend scales; - the sale of replacement and vanishing premium policies by material omission; - the misrepresentation of po licies as investment or retirement plans; - the failure to train or sup ervise agents; - Prudential's unwillingness to prevent deceptive sales practices; and - Prudential's scienter. Fairness Opinion, 962 F. Supp. at 512. The district court also found that plaintiffs would need to establish the following common legal issues at trial: - whether policyholder relian ce could be presumed; - whether Prudential's offer to finance a policyholder's purchase of a policy constitutes an enforceable financing contract distinct from the policy itself; - whether Prudential breached the financing contract; - whether Prudential breached an obligation of good faith and fair dealing; - whether constructive trust principles apply to premiums received as a (result of deceptive sales practices; - whether compensatory claims can be effectively quantified on a class wide basis; and - whether punitive damages sh ould be imposed. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48.. The court also cited the following as examples of issues common to all class members: Prudential's fraudulent concealment of its misrepresentations; the use of substantially similar, and sometimes identical, oral and written misrepresentations by Prudential agents in furtherance of its fraudulent scheme; the required use of pre-approved written marketing materials; and the fact that Prudential trained its agents to use these fraudulent sales techniques. Fairness Opinion, 962 F. Supp. at 513-16.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49.. Krell objects to the district court's reference to Baby Neal, complaining that the court was inappropriately applying the Rule 23(b)(2) standard for injunctive relief in a Rule 23(b)(3) class action. The objection is clearly without merit. The district court applied Baby Neal in the context of its Rule 23(a) \"commonality\" analysis, a factor applicable whether the class action is brought under Rule 23(b)(2) or (b)(3).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50.. Krell also argues the court improperly evaluated the typicality requirement because it merely presumed the factual and legal elements of named plaintiffs' claims were aligned with the claims of absentee class members. Krell's claim that the district court presumed typicality simply ignores the findings contained in the district court's opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51.. Falcon involved a Mexican-American employee who was denied a promotion, allegedly based on his national origin. After obtaining a right-to-sue letter from the EEOC, Falcon commenced a class action under Title VII of the Civil Rights Act of 1964, alleging discrimination against Mexican-Americans with respect to promotion. The class, however, was comprised of all Mexican-American employees and Mexican-Americans who had been denied employment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52.. The court specifically noted that the fee agreement negotiated with Prudential subsequent to the negotiation of the Proposed Settlement did not undermine the adequacy of class counsel's representation. Fairness Opinion, 962 F. Supp. at 519; see also (infra) § VI.C.1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53.. The district court explicitly rejected this argument. Fairness Opinion, 962 F. Supp. at 522. For a more detailed Discussion of Krell's replacement claims, see (infra) § V.A.4.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54.. While we reached a different Conclusion in Georgine, our decision there turned on our belief that the case \"could not be broken into anywhere near that small a number of patterns.\" 83 F.3d at 627 n.13.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55.. In addition, Krell's concern is addressed by the fact that \"the ADR scoring procedures specifically incorporate state replacement regulations.\" Fairness Opinion, 962 F. Supp. at 550 n.79.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56.. Rule 23(b)(3) lists the following factors for consideration by the courts: (A) the interest of members of the class in individually controlling the prosecution or defense of separate actions; (B) the extent and nature of any litigation concerning the controversy already commenced by or against members of the class; (C) the desirability or undesirability of concentrating the litigation of the claims in the particular forum; (D) the difficulties likely to be encountered in the management of a class action. Fed. R. Civ. P. 23(b)(3).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57.. While we believe the district court correctly analyzed whether application of the laws of the fifty states would be manageable, we note this analysis, depending on the facts in each case, may no longer be necessary in the context of settlement-only class certification. See Amchem, 117 S. Ct. at 2248 (\"Confronted with a request for settlement-only class certification, a district court need not inquire whether the case, if tried, would present intractable management problems . . . for the proposal is that there be no trial.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58.. The district court expressly left open the possibility that it would create subclasses if they became necessary. Fairness Opinion, 962 F. Supp. at 525.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59.. Both Rule 23(e) and Rule 23(c) require that notice of the proposed settlement be given to all members of the class as directed by the court. For a Discussion of the notice provided, see Discussion (infra) § V.C.2.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e60.. Prudential contends that nearly \"[e]very argument Krell makes is based on th[e] mistaken premise that his `replacement claims' were stronger than the misrepresentation claims of the other Class Members.\" Prudential Brief at 41 \u0026 n.10. As a result, Prudential argues, all but one of the objections to the settlement's fairness are\"felled by Krell's error of law.\" Id. We do not agree that Krell's arguments can be dismissed so easily, and will address Krell's replacement claim objections in the context of his other arguments.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e61.. We also note that no parties have objected to this portion of the district court's analysis.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e62.. The court found that approximately 700 of those who opted out wrote \"to indicate they do not feel they were misled in the purchase of their insurance, are satisfied with their policies, and do not want to participate in the action against Prudential.\" Fairness Opinion, 962 F. Supp. at 537 n.61.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e63.. Krell argues that the low response rate was the result of inadequate notice. We disagree. As discussed (infra) § V.C.2, we believe the class notice adequately apprised the class members of their right to enter an appearance, file objections, or opt out of the proposed class, and provided a detailed explanation of the procedures for doing so.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e64.. This discovery included over 1 million documents, 160 computer diskettes, 500 audio and video tapes. Fairness Opinion, 962 F. Supp. at 541.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e65.. Prudential also notes that Ohio state courts have found that a violation of state replacement laws does not give rise to a private cause of action. Prudential Brief at 36 (citing Springfield Impregnators, Inc. v. Ohio State Life Ins. Co., No. C.A. 3090, 1994 WL 95219 at *9 (Ohio Ct. App. Mar. 23, 1994); Strack v. Westfield Cos., 515 N.E.2d 1005, 1007-8 (Ohio Ct. App. 1986)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e66.. The Task Force also noted that, in 1985, the Federal Trade Commission acknowledged that many older insurance policies were \"candidates for replacement.\" Task Force Report at 42-3 (quoting Michael P. Lynch and Robert J. Mackay, Life Insurance Products and Consumer Information, Staff Report, Bureau of Economics, Federal Trade Commission, Washington, D.C. (November 1985)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e67.. We note that even if the different claims alleged by plaintiffs require proof of different elements to establish liability, those differences are adequately addressed during the ADR process. ADR claims will be examined using a set of criteria specific to the type of claim filed. For example, the evidentiary considerations for a churning claim include misstatements by a Prudential agent concerning the applicable interest rate on a policy loan, the policyholder's annual income, and the use of blank, signed disbursement forms. Prudential Alternative Dispute Resolution Guidelines, Stipulation of Settlement, Ex. B, at 17. Considerations for a vanishing premium claim include whether the policyholder was advised to disregard notices from Prudential, whether the policyholder made a \"significant financial decision\" in reliance on the belief that premium payments would cease, and whether the policyholder received altered or unclear sales materials from an agent. Id. at 26-27.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e68.. The district court also noted that \"[n]one of the four states that objected to the Proposed Settlement have ever prohibited financed insurance sales and three of the four did not regulate in any respect financed insurance sales for great portions of the Class Period.\" Fairness Opinion, 962 F. Supp. at 549 n.77.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e69.. Prudential argued that consideration of this factor was unnecessary because of the uncapped nature of the relief. The district court rejected this claim, noting that while the compensatory relief was uncapped, the \"punitive damages\" component of the settlement- the Additional Remediation Amount - was limited, and thus the district court was obligated to examine this factor.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e70.. The court found that Prudential's credit rating had already declined during the course of the litigation. Fairness Opinion, 962 F. Supp. at 540.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e71.. In response, Krell contends that the court's belief that full compensatory relief is available relies on the flawed \"assumption that 100% of the wrongfully replaced policyholders will understand the notice and form the requisite `belief ' and complete the 16 page proof of claim form and thereafter prevail in ADR.\" Krell Brief at 45. But Krell ignores the fact that any claim, whether brought at trial or under the ADR process, will require evidence of deceptive conduct in order to support liability.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e72.. The district court also took notice of the procedural safeguards contained in the ADR process, including the four tier review process designed to ensure an accurate and fair scoring of class members' claims. See Discussion (supra) § I.B.1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e73.. See Edward H. Cooper, Mass Torts Model, prepared for the Conference On Mass Torts, Mass Torts Working Group, Philadelphia, PA (May 1998). Other related factors that also may be relevant to this inquiry are discussed by Judge William Schwarzer in his article, Settlement of Mass Tort Class Actions: Order Out of Chaos, 80 Cornell L. Rev. 837, 843-44 (May 1995). The factors suggested by Judge Schwarzer include: (1) Whether the prerequisites set forth in subdivisions (a) and (b) [of Rule 23] have been met; (2) Whether the class definition is appropriate and fair, taking into account among other things whether it is consistent with the purpose for which the class is certified, whether it may be overinclusive or underinclusive, and whether division into subclasses may be necessary or advisable; (3) Whether persons with similar claims will receive similar treatment, taking into account any differences in treatment between present and future claimants; (4) Whether notice to members of the class is adequate, taking into account the ability of persons to understand the notice and its significance to them; (5) Whether the representation of members of the class is adequate, taking into account the possibility of conflicts of interest in the representation of persons whose claims differ in material respects from those of other claimants; (6) Whether opt-out rights are adequate to fairly protect interests of class members; (7) Whether provisions for attorneys' fees are reasonable, taking into account the value and amount of services rendered and the risks assumed; (8) Whether the settlement will have significant effects on parties in other actions pending in state or federal courts; (9) Whether the settlement will have significant effects on potential claims of class members for injury or loss arising out of the same or related occurrences but excluded from the settlement; (10) Whether the compensation for loss and damage provided by the settlement is within the range of reason, taking into account the balance of costs to defendant and benefits to class members; and (11) Whether the claims process under the settlement is likely to be fair and equitable in its operation. 80 Cornell L. Rev. at 843-44.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e74.. The Rules Enabling Act grants the Supreme Court the \"power to prescribe general rules of practice and procedure.\" 28 U.S.C. § 2072(a). The Act further provides that \"[s]uch rules shall not abridge, enlarge or modify any substantive right.\" 28 U.S.C. § 2072(b).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e75.. The McCarran-Ferguson Act provides \"[n]o Act of Congress shall be construed to invalidate, impair, or supersede any law enacted by any State for the purpose of regulating the business of insurance.\" 15 U.S.C. § 1012(b). Krell claims the Federal Rules of Civil Procedure constitute an Act of Congress for purposes of the McCarran-Ferguson Act. Krell further contends the proposed settlement \"relieves Prudential of compliance with state insurance laws\" which regulate the form and content of documents used to sell insurance or modify existing insurance contracts. Consequently, Krell reasons that the approval of the class action settlement under Rule 23 must violate the McCarran-Ferguson Act.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e76.. For a Discussion of whether settlements of class actions under Rule 23 violate the Rules Enabling Act, see Linda S. Mullenix, The Constitutionality of the Proposed Rule 23 Class Action Amendments, 39 Ariz. L. Rev. 615 (Summer 1997) (responding to arguments that the proposed inclusion of a \"settlement-only\" class in Rule 23 violates the Rules Enabling Act); but see Paul D. Carrington \u0026 Derek P. Apanovitch, The Constitutional Limits of Judicial Rulemaking: The Illegitimacy of Mass-Tort Settlements Negotiated Under Federal Rule 23, 39 Ariz. L. Rev. 461 (Summer 1997).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e77.. In support of its contention, Krell argues the sale of insurance under the Basic Claim Relief and the modification of existing contracts by the incorporation of the release and ADR provision in all contracts since 1982 violates state laws regulating the form and content of insurance contracts. Krell further contends the class certification and settlement notices would not pass muster under state laws requiring that material used to advertise new insurance sales or modify insurance contracts not be misleading, because the class notice omits material facts, including: a) the nature of the \"other sales\" claims; b) the district court's finding that the jury value of each class member's claim could exceed $50,000; and c) the indirect payment of Lead Counsel's fees by the class members. Finally, Krell contends that the settlement violates state laws barring mandatory arbitration of claims. Prudential and Lead Counsel respond by noting that the insurance regulators for all 50 states and the District of Columbia have endorsed the settlement, and that the requirements of state insurance laws have been incorporated in the ADR scoring system. They also respond that: a) the settlement agreement and class notice are not insurance contracts or policy forms and therefore need not meet state requirements for form, content and readability; b) the district court found that the Settlement and Class Notice are excluded from the NAIC definition of advertising; and c) the ADR is not \"mandatory arbitration\" but rather constitutes part of the settlement. We agree. The settlement does not violate applicable state law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e78.. Discovery concerns relating to attorneys' fees will be addressed separately. See (infra) § VI.C.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e79.. The district court suggested that alternative methods might be available to test the veracity of the affidavits.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e80.. Krell also argues that the proposed class here is an \"across the board\" sales practice class, and that the Supreme Court has \"rejected the creation of an `across the board' racial discrimination class because its overbreadth posed serious unfairness to absent class members bound by the judgment.\" Krell Brief at 28-29 (citing Falcon, 457 U.S. at 161). As discussed earlier, Krell misreads the Supreme Court's decision in Falcon. See (supra) n.51 and accompanying text.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e81.. The district court also rejected Krell's objection to the scope of the release on the grounds that class members could simply have opted out of the class. While we agree with the statement as a factual matter, it does not address Krell's concern. The court's line of reasoning would render any objection meritless, and consequently we reject it.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e82.. \"[I]t is widely recognized that courts without jurisdiction to hear certain claims have the power to release those claims as part of a judgment.\" Grimes, 17 F.3d at 1563; see also Class Plaintiffs v. City of Seattle, 955 F.2d 1268, 1287-88 (9th Cir.), cert. denied, 506 U.S. 953 (1992) (noting that the weight of authority holds that a federal court may release claims which are not in the complaint provided they are based on the \"same factual predicate\"). As we noted in Grimes, \"[t]his rule of law serves the important policy interest of judicial economy by permitting parties to enter into comprehensive settlements that`prevent relitigation of settled questions at the core of a class action.' \" 17 F.3d at 1563 (quoting TBK Partners Ltd. v. Western Union Corp., 675 F.2d 456, 460 (2d Cir. 1982)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e83.. Although the release provides that class members waive certain state law protections against the waiver of claims through general releases, that waiver provision is limited to claims arising out of Prudential's \"insurance sales practices.\" Stipulation of Settlement at 36. Of course, we express no opinion of the validity of the waiver of any state law protections.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e84.. Rule 23(c)(2) provides: In any class action maintained under subdivision (b)(3), the court shall direct to the members of the class the best notice practicable under the circumstances, including individual notice to all members who can be identified through reasonable effort. The notice shall advise each member that (A) the court will exclude the member from the class if the member so requests by a specified date; (B) the judgment, whether favorable or not, will include all members who do not request exclusion; and (C) any member who does not request exclusion may, if the member desires, enter an appearance through counsel. Fed. R. Civ. P. 23(c)(2).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e85.. Rule 23(e) provides: A class action shall not be dismissed or compromised without the approval of the court, and notice of the proposed dismissal or compromise shall be given to all members of the class in such a manner as the court directs. Fed. R. Civ. P. 23(e).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e86.. The individual notice provided a description of the litigation, the settlement class, and the terms of the proposed settlement, including the relief available. It set out the information regarding the fairness hearing, including the date of the hearing, the opportunity for class members to appear at the hearing, and the procedure for filing objections with the court. The notice also explained the consequences for class members who remain in the class and provided the full text of the release. Finally, the notice provided class members with the toll-free 800 number established by Prudential to address class member concerns.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e87.. The Stipulation of Settlement also provided the parties would remail any returned notices containing a forwarding address, and retain an independent research firm to determine a current address for any returned notices that did not contain a forwarding address. Stipulation of Settlement § G.3.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e88.. The publication notice described the settlement class and provided information regarding, inter alia, the hearing, the deadline for opting out or entering an appearance, and the consequences of opting out or remaining in the class.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e89.. On January 6, 1997, the district court postponed the fairness hearing from January 21 until February 24, 1997. Although not required to do so, the district court ordered the parties to provide additional notice to all class members notifying them of the postponement.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e90.. We note that, in addition to the outreach program implemented by the settling parties, several states conducted there own outreach programs to supplement the notice provided under the settlement. For example, the California Department of Insurance ran a series of television and radio advertisements during the three weeks preceding the June 1, 1997 claim filing deadline. Prudential v. Florida, No. 97-5264 (3d Cir. May 22, 1997), slip op. at 6.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e91.. The district court took judicial notice of the news coverage received by the settlement, including wire service articles published in various state, local and trade newspapers. Fairness Opinion, 962 F. Supp. at 496.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e92.. For example, following the court's approval of the settlement, the parties provided additional notice to those class members who initially excluded themselves from the class. The notice explained that several enhancements had been made to the original settlement remediation plan as a result of negotiations with various states, and provided an election form with which the class members could indicate their decision to rejoin the class and elect either the ADR process or Basic Claim Relief. A similar notice was provided to the rest of the class, extending the date for electing the ADR process or Basic Claim Relief until June 1, 1997.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e93.. Under the category of \"other claims,\" the notice explains that \"[i]f evidence shows other improper life insurance sales practices, you may be remedied through the cancellation of your policy with a refund of some or all of the premiums you paid, including interest in some cases, or the issuance of a substitute product purchased with the amount otherwise available for refund.\" Class Notice at 11.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e94.. Section K.1. of the Proposed Settlement Agreement states: Lead Counsel agrees to make, and the Defendants agree not to oppose, an application for an award of Attorney's Fees in the Centralized Proceeding not to exceed a total of $90 million (the \"Total Fees\"). Additionally, Class Members will not be required to pay any portion of the Attorneys' Fees. Stipulation of Settlement § K.1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e95.. These costs included the publication, printing and mailing costs of various class notices; post-office box rental costs; the costs of establishing and maintaining the 800 telephone number established under the settlement; the costs of processing the exclusion requests and Election Forms; and all administrative costs associated with both the ADR Process and Basic Claim Relief, including the fees paid to claim evaluators and Appeals Committee members.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e96.. Lead Counsel was responsible for the allocation and distribution of the fee award among the 25 law firms representing plaintiffs, Stipulation of Settlement ¶ K.2, and consequently the court need not undertake the difficult task of assessing counsels' relative contributions. See Dennis E. Curtis \u0026 Judith Resnik, Contingency Fees In Mass Torts: Access, Risk, And The Provision Of Legal Services When Layers Of Lawyers Work For Individuals And Collectives of Clients, 47 DePaul L. Rev. 425, 448-49 (Winter 1998) (noting the difficulty of \"assessing the value of contributions of a multitude of attorneys to a particular outcome\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e97.. This figure assumes a 3% remediation rate, which is equivalent to the remediation of approximately 330,000 claims.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e98.. Although Krell filed an emergency motion to vacate this order, the district court denied the motion on the grounds that Krell had waived his right to object. See Fee Opinion, 962 F. Supp. at 575 n.9 (citing In re Prudential Ins. Co. of America Sales Practice Litig., No. 95-cv-4704, slip op. (D.N.J. Feb. 11, 1997)). Krell has renewed his objections to the fee examiner on appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e99.. The court reasoned that, although the class settlement and the attorneys' fee award were negotiated independently, Prudential was responsible for both and therefore they are drawn from the same \"fund.\" In addition, the court found that the minimum payments required of Prudential constituted a common fund on which it could accurately calculate a portion of the fee award. Fee Opinion, 962 F. Supp. at 579.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e100.. The district court also rejected separate fee petitions filed by attorneys for various objectors. Fee Opinion, 962 F. Supp. at 593-94 (\"The Court finds that Objectors' Attorneys neither improved the settlement, assisted the court nor enhanced the recovery. . . [and] will deny the Objectors' Attorneys request for attorneys' fees.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e101.. Hoyer calculated the settlement's total value at $1.987 billion, assuming 330,000 remediated claims. He attributed $1.187 billion to the ADR program, and the remaining $799 million to Basic Claim Relief. Hoyer also calculated the value of the Task Force plan to be approximately $863 million, with $490 attributable to the ADR program and $373 attributable to Basic Claim Relief. This represents a total enhancement of $1.123 billion. Hoyer also found the settlement would result in increased remediation, calculating that for every 110,000 claims remediated under the proposed settlement, only 83,300 claims would be remediated under the Task Force plan. See Hoyer Aff. ¶¶ 6, 11, 13, 15; Fee Opinion, 962 F. Supp. at 575. Prudential submitted separate valuations from Patricia Guinn, of Tillinghast-Towers Perrin, and Daniel McCarthy, of Milliman \u0026 Robertson, Inc., calculating the value of the ADR and Basic Claim Relief. Guinn found that the \"shared elements\" of the ADR programs contained in the Task Force plan and the proposed settlement have a value of $221 million per 110,000 claims remedied. She also calculated that, with the enhancements, the number of claims remedied would rise to 118,480 and have a value of $261.2 million. McCarthy calculated that the value of the Basic Claim Relief under the proposed settlement would range from $272 million to $686 million, and that the best estimate of its value was $425 million. This was an improvement over the value of the Basic Claim Relief contained in the Task Force plan, which ranged from $208 million to $535 million, with a \"best estimate\" of $330 million. Fee Opinion, 962 F. Supp. at 582 n.25. Although the district court accepted Hoyer's calculations, it found the valuations submitted by Guinn and McCarthy were flawed. The court noted that Guinn's calculations did not provide an estimate of the number of claims that would ultimately be addressed. Similarly, the court questioned McCarthy's conservative estimate of the value of the Basic Claim Relief, which was far below previous calculations, noting that the \"BCR valuations generally have gone uncontested in this litigation.\" Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e102.. The lodestar method calculates the attorneys' fees based on the number of hours reasonably expended by counsel.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e103.. The court found that, as of January 31, 1997, the lodestar amount totaled $17.7 million, a figure which did not include \"significant events\" such as the fairness hearing, which occurred after that date. Fee Opinion, 962 F. Supp. at 584 \u0026 n.29.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e104.. While the district court does not offer any explanation of the \"risks and burdens\" facing class counsel, we assume this is a reference to the risks of establishing liability and damages at trial discussed in the court's fairness opinion. But see Janet Cooper Alexander, Do the Merits Matter? A Study of Settlements in Securities Class Actions, 43 Stan. L. Rev. 497, 578 (Feb. 1991) (arguing that a multiplier designed to address the contingency factor is unnecessary because \"there appears to be no appreciable risk of nonrecovery, for virtually all cases are settled\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e105.. Under the settlement, Prudential guaranteed to pay a minimum of $260 million per 110,000 claims processed. Assuming 330,000 claims, this would result in a minimum payment of $780 million. In addition, Prudential promised to pay an additional remediation amount of $300 million in the event more than 330,000 claims were remediated. Combining these figures with the minimum valuation of the Basic Claim Relief - $272 million - the court calculated that Prudential would be obligated to pay $1.352 billion. See Fee Opinion, 962 F. Supp. at 589 n.38.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e106.. This figure was capped so that the total fee award, including the initial $45 million, would not exceed $90 million. Fee Opinion, 962 F. Supp at 589.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e107.. Krell objected to the district court's application of the lodestar method, arguing the court improperly based its calculations on time summaries provided by class counsel rather than detailed time reports. The court rejected this argument, reasoning that the time summaries were sufficient in this case because the court was only using the lodestar analysis as a cross-check on the fee award. Fee Opinion, 962 F. Supp. at 591 n.47. In addition, the court noted that the lodestar figures used were actually understated because they did not include time spent by class counsel subsequent to January 31, 1997. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e108.. Some critics have argued that the lodestar method gives attorneys an incentive to increase their billable hours by delaying settlement as long as possible. See, e.g., Court Awarded Attorney Fees, Report of the Third Circuit Task Force, 108 F.R.D. 237, 247-48 (Oct. 8, 1995) (citing In re Fine Paper Litig., 751 F.2d 562 (3d Cir. 1984)). Others contend the lodestar method creates a rift between the class and its counsel, and may lead to collusive settlements in which plaintiffs' attorneys are willing to accept a low settlement in exchange for lucrative fees. See, e.g., John C. Coffee, Jr., Understanding the Plaintiff 's Attorney: The Implications of Economic Theory for Private Enforcement of Law Through Class and Derivative Actions, 86 Colum. L. Rev. 669, 716-17 (May 1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e109.. While the use of contingent fees has generally been favored, courts have encountered several difficulties in determining the correct fee. Fee cutting in aggregate mass torts can usually be justified because the aggregation of claims lessens the force of the traditional justifications for contingency fees -- enabling access, providing legal services and rewarding risk. See Curtis \u0026 Resnik, Contingency Fees In Mass Torts, 47 DePaul L. Rev. at 448. Yet aggregation does not entirely eliminate the risks involved in mass torts, and thus these cases often require difficult factual analysis to determine an appropriate fee. We note that there may be better ways to assess the work done by attorneys in these kinds of cases. Administrative regulations or the fees awarded in probate court may provide a closer analogy than the individual contingent award common in individual cases. Id. at 454.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e110.. We note, however, that we have some doubt as to the ultimate effectiveness of the incentives created by the fee award. The court hoped that, by linking the fee award to a threshold number of responses, class counsel will have an incentive to remain involved. But here that threshold figure was easily met, and thus the incentive for class counsel's continued involvement has been removed. While we believe that incorporating such an incentive is appropriate, it would be arguably more effective to link the second half of the fee award to a threshold which is more indicative of the settlement's success. For example, basing the second portion of the fee on the number of claims actually remediated would better serve the district court's goal of encouraging class counsel's continued participation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e111.. Krell also renews his objection that the fee examiner in this case did an inadequate job of reviewing Lead Counsel's fee request. Krell claims that the fee examiner was a Rule 53 special master, as stated in the February 11, 1997 order, and thus was required to keep a record. Instead, Krell claims the fee examiner based his Conclusions on ex parte submissions and kept no record of the evidence or testimony he considered. The district court rejected these arguments in its Fee Opinion, concluding that Krell misunderstood the fee examiner's role. First, the court noted that the November 6, 1996 order does not refer to Rule 53, and points out that, at the fee hearing on March 10, 1996, the court specifically stated that the fee examiner had been appointed as a technical expert under Rule 54(d)(2)(D). Second, the court said it had already addressed Krell's \"hyper-technical\" arguments for disqualification of the fee examiner in its opinion denying Krell's emergency motion to vacate the November 6th order. Finally, the court noted it had determined not to adopt the Fee Examiner's Report. Fee Opinion, 962 F. Supp. at 576 n. 11. We see no abuse of discretion here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e112.. In Prandini v. National Tea Co., 557 F.2d 1015 (3d Cir. 1977), we rejected a settlement agreement which contained an award of attorneys' fees, holding class counsel should not simultaneously negotiate both a settlement and attorneys' fees. The Task Force, concerned about the chilling effect Prandini might have on settlement, suggested \"the defendant should be permitted to make an offer of settlement that is conditional on a subsequent satisfactory resolution of the question of fees,\" or the parties could seek the court's permission to discuss fees. Court Awarded Attorney Fees, 108 F.R.D. at 269. The Supreme Court has also held that parties may simultaneously negotiate a \"defendant's liability on the merits and his liability for his opponents' attorney's fees.\" Evans v. Jeff D., 475 U.S. 717, 738 n.30 (1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e113.. The district court found it could properly rely on the settling parties' affidavits, noting the Third Circuit Task Force report specifically authorizes a district court to \"ascertain whether improper talks have taken place by requesting the information in a signed statement that would be subject to the sanction provisions of Federal Rules 7 and 11.\" Fee Opinion, 962 F. Supp. at 577 n.14 (quoting Court Awarded Attorney Fees, 108 F.R.D. at 267).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e114.. Section N.3 of the Settlement Agreement provides: Notwithstanding the preceding subsection N.2., Plaintiffs may not terminate the Settlement Agreement solely because of the amount of Attorneys' Fees awarded by the [District] Court or any appellate court(s). Prudential, however, may elect to terminate the Settlement Agreement on or before October 25, 1996, if the Settling parties cannot agree on the amount of Attorneys' Fees that Plaintiffs will apply for and Prudential will not oppose.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e115.. The settlement in that case contained relief similar to the ADR process and Basic Claim Relief available here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e116.. Krell argues that this reliance is misplaced. Krell contends that Institutionalized Juveniles only addresses the question of counsel's entitlement to attorneys' fees in the context of a statutory fee-shifting case, but not the distinct question of how much of a common fund may be attributed to the efforts of counsel. We disagree. The question of entitlement to a statutory fee shifting award and the entitlement to a portion of a common fund are analogous, and the same concerns undergird the determination in both cases. As we noted in Institutionalized Juveniles, the relevant inquiry to determine eligibility for fees (whether plaintiffs prevailed and whether the litigation was causally linked to the relief obtained) \"focuses a court's attention on the benefits actually received and caused by plaintiffs, [and] will determine not only the often evident threshold question of eligibility for fees, but it will also be critical in determining the amount of a reasonable fee award, in that the final award must depend on a full assessment of the extent of the benefits received by plaintiffs.\" 758 F.2d at 910.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e117.. The court calculated this figure by taking the minimum ADR payment required in the event 330,000 claims were remediated - $1.08 billion - and adding the lowest estimated value for Basic Claim Relief - $272 million. The resulting \"common fund\" would be $1.352 billion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e118.. Among the settlements considered by the district court were In re Baldwin-United Corp. Litig., 1986 WL 12195 (S.D.N.Y.), where attorneys' fees constituted 4.1% of the $183.8 million settlement fund; In re Agent Orange Prod. Liab. Litig., 611 F. Supp. 1296 (E.D.N.Y. 1985), where the fee award constituted 5.5% fee of the $180 million settlement fund; and In re MGM Grand Hotel Fire Litig., 660 F. Supp. 522 (D. Nev. 1987), where the fee award constituted 7% fee of the $205 million settlement fund. This comparison does not include the $3 billion recovery in the Penzoil litigation, for which plaintiffs' counsel received an estimated fee of 14% based on a privately negotiated fee agreement. See Fee Opinion, 962 F. Supp. at 587 n.35 (citations omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e119.. The district court noted that Krell's counsel conceded that \"there is no question that lead counsel is entitled to a fee. They have created benefits.\" Fee Opinion, 962 F. Supp. at 578 n.15 (quoting Fee Hr'g Tr. at 17-18).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e120.. This figure is based on the 75,607 hours claimed by class counsel, and excludes the district court's estimate of the hours spent in connection with the court-ordered investigation of alleged document destruction.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e121.. Interestingly, the district court noted in its opinion there was some question as to the application of multipliers following the Supreme Court's decision in City of Burlington v. Dague, 505 U.S. 557 (1992), and claimed to avoid the issue by not considering risk enhancement factors in its determination of the appropriate percentage. Fee Opinion, 962 F. Supp. at 581 n.24. As the district court discussed, the Supreme Court held risk enhancements are inappropriate in the statutory fee-shifting context. See Dague, 505 U.S. at 565-67. Although the Supreme Court has not addressed whether this prohibition also applies in common fund cases, the district court found \"the Court's reasoning for excluding risk enhancements in fee-shifting cases applies equally to common fund cases.\" In addition, the court also took notice that jurisdictions are split as to the application of risk enhancements in the common fund context. Fee Opinion, 962 F. Supp. at 581 n.24 (citing Alan Hirsch \u0026 Diane Sheehey, Awarding Attorneys' Fees and Managing Fee Litigation 49, 70-71 (Fed. Judicial Ctr. 1994); 3 Newberg§ 14.03 (Supp. July 1996)). Assuming that multipliers for risk or counsel's expertise are appropriate in the lodestar cross-check in common fund cases, they require particular scrutiny and justification.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e122.. The Federal Judicial Center has also noted that the application of the lodestar method in common fund cases requires\"virtually the same analysis as it does in fee-shifting cases.\" A. Hirsch \u0026 D. Sheehey, Awarding Attorneys' Fees, at 67. In addition, the Judicial Center notes that \"[s]ome of the factors justifying an adjustment of the lodestar in fee-shifting cases will also apply in a common fund situation\" regardless of which method is used to calculate fees. Id. at 69.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e123.. Although the district court based its Fee Opinion on Lead Counsel's analysis of the lodestar as of January 31, 1997, Krell relies primarily on Lead Counsel's fee petition dated November 22, 1996. Krell Brief at 63. Krell raises many of the same issues with regard to the revised fee petition, filed by Lead Counsel on February 7, 1997. Id. at 64-65.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e124.. Krell claims that at least one law firm which petitioned for fees was fictitious. According to Krell, the son of a senior partner at Co-Lead Counsel Much, Shelist, Freed, Deneberg, Ament, Bell \u0026 Rubenstein, filed a fee petition for a non-existent firm requesting over $2 million. The district court deemed these mistakes unintentional and irrelevant. Fee Opinion, 962 F. Supp. at 592 n.47.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e125.. The district court denied Krell's motion for fee discovery by order dated February 18, 1997.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e126.. The Krell and Kittle plaintiffs were joined in their motion by Bruce Miller, on behalf of former Prudential agent Ricky Martin and as lead counsel in the Agent Action, and Anderson B. Doguli, representing seven individual policyholders from the state of Florida.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e127.. In an emergency motion to amend the Court's Order, Krell argued that the existing record was sufficient for the court to decide the recusal motion, and that supplementary evidence was improper. Krell's Brief in Support of Emergency Motion to Amend December 5, 1996 Show Cause Order at 1-2. On appeal, Krell argues that, under Alexander v. Primerica Holdings, Inc., 10 F.3d 155, 163-64 (3d Cir. 1993), the district court improperly supplemented the then-existing record and allowed other parties to do the same. Krell Reply Brief at 68. We disagree. In its decision granting a petition of mandamus seeking the recusal of the district court Judge, the Alexander court specifically considered evidence which was not part of the record at the time the initial motion to recuse was filed. In particular, the court examined a letter written by the district court Judge in response to the petition for mandamus, and found that the letter gave the appearance that the Judge was biased against the moving party. 10 F.3d at 165-66.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e128.. These subsections of 28 U.S.C. § 455 provide: (a) Any Justice, Judge, or magistrate of the Unite d States shall disqualify himself (in any proceeding in which his impartiality might reasonably be questioned. (b) [The Judge] shall also disqualify himsel f in the following circumstances: (1) Where he has a personal bias or prejudice concerning a party, or (personal knowledge of disputed evidentiary facts concerning the proceeding; (5) He or his spouse . . .: (iv) Is to the Judge's knowledge likely to be a material witness in the proceeding.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e129.. In addition, Lead Counsel argues that Krell's counsel was not counsel of record in this case and thus was not entitled to notice of the conference. At the recusal hearing, the district court observed that \"Mr. Malakoff, on behalf of Kittle and Krell, has consistently maintained that he is not part of the national class action.\" Joint App. at 4721.\u003c/span\u003e\n\n",
    "body_length": 265842,
    "citedas": [
      "148 F.3d 283"
    ],
    "attorneys": "Michael P. Malakoff, Esquire (argued) Malakoff, Doyle \u0026 Finberg The Frick Building, Suite 200 Pittsburgh, Pennsylvania 15219 Attorney for Appellants, Richard P. Krell, et al. Lynde Selden, II, Esquire Lynde Selden Chartered 501 West Broadway, Suite 845 San Diego, California 92101 Attorney for Appellant, Richard E. Johnson Melvyn I. Weiss, Esquire (argued) Milberg, Weiss, Bershad, Hynes \u0026 Lerach One Penn Plaza, 49th Floor New York, New York 10119 Allyn Z. Lite, Esquire Goldstein, Lite \u0026 DePalma Two Gateway Center, 12th Floor Newark, New Jersey 07102 Attorneys for Appellee, George A. Zoller, Class Action Plaintiff Representative Reid L. Ashinoff, Esquire (argued) Michael H. Barr, Esquire Sonnenschein, Nath \u0026 Rosenthal 1221 Avenue of the Americas, 24th Floor New York, New York 10020 Attorneys for Appellees, The Prudential Insurance Company of America and Ron D. Barbaro Brian S. Wolfman, Esquire (argued) Alan B. Morrison, Esquire Public Citizen Litigation Group 1600 20th Street, N.w. Washington, D.c. 20009 Attorneys for Amicus Curiae-Appellant, Public Citizen, Inc. John J. Gibbons, Esquire Gibbons, Del Deo, Dolan, Griffinger \u0026 Vecchione One Riverfront Plaza Newark, New Jersey 07102-5497 Attorney for Appellee, Robert C. Winters Frederick B. Lacey, Esquire LeBoeuf, Lamb, Greene \u0026 MacRae One Riverfront Plaza Newark, New Jersey 07102 Attorney for Appellee, Frances K. Beck, as Executrix of the Estate of Robert A. Beck",
    "category": [
      "184"
    ],
    "judges": "Before: Scirica, Roth and Rendell, Circuit Judges",
    "citation_count": 949
  }
}
