{
  "id": "NKJ4R2YBTlTomsSBGVcu",
  "document": {
    "title": "People v. Sanders",
    "full_title": "THE PEOPLE AND v. RICARDO RENE SANDERS AND .",
    "jurisdiction": "California Supreme Court",
    "date": "1995-11-20T00:00:00.000Z",
    "docket": "No. S004484",
    "body": "MOSK, J.:\n\nThis is an automatic appeal (Pen. Code, § 1239, subd. (b)) from a judgment of death under the 1978 death penalty law (id., § 190 et seq.).\n\nOn March 18, 1981, the District Attorney of Los Angeles County filed an information against defendant Ricardo Rene Sanders and Carletha Stewart and Franklin Freeman, Jr. in the superior court of that county, in connection with the robbery murders that became known as the \"Bob's Big Boy murders.\"\n\nDefendant was charged with the murder of David Burrell, Dita Agtani, and Ahmad Mushuk. (Pen. Code, § 187.) It was alleged for death eligibility, as to each murder, that he did so under the special circumstances of multiple murder (id., § 190.2, subd. (a)(3)) and felony murder robbery (id., § 190.2, subd. (a)(17)(i)). He was also charged with robbery (Pen. Code § 211), attempted robbery, (Pen. Code, §§ 664 and 211), and assault with a deadly weapon. (Pen. Code, § 245, subd. (a).) It was further alleged that, during the commission of each of these offenses, he personally used a firearm, to wit, a shotgun, within the meaning of Penal Code sections 12022.5 and 1203.06, subdivision (a)(1), and that, as to certain of these offenses he intentionally inflicted great bodily injury within the meaning of Penal Code section 12022.7. Finally, he was charged with conspiracy to commit robbery. (Pen. Code, §§ 182 and 211.)\n\nDefendant pleaded not guilty to the charges and denied the allegations.\n\nOn December 7, 1981, after the death of victim Cesario Luna, the charge that defendant committed assault with a deadly weapon against Luna was dismissed and the district attorney filed a separate information, charging him with the murder of Luna (Pen. Code, § 187), under the special circumstances of multiple murder (id., § 190.2, subd. (a)(3)) and felony murder robbery (id., § 190.2, subd. (a)(17)(i)). It was also alleged that, during the commission of the murder, he personally used a firearm, to wit, a shotgun, within the meaning of Penal Code sections 12022.5 and 1203.06, subdivision (a)(1). The count was ordered consolidated into the previously filed case.\n\nDefendant again pleaded not guilty to the charges and denied the allegations. Motions he made for change of venue were denied. His case was severed from that of his codefendants.\n\nTrial was by jury. The panel returned verdicts finding defendant guilty as charged of the murders of Burrell, Agtani, Mushuk, and Luna; it also rendered a finding of true on the multiple murder and felony murder robbery special circumstances. It found him guilty as charged of the counts of robbery, attempted robbery, and assault with a deadly weapon. It further found true the allegations that, as to all but one count, he personally used a firearm. Finally, it found him guilty of conspiracy.\n\nThe jury subsequently returned verdicts of death on the counts of murder. The trial court denied defendant's application to modify the verdicts. (Pen. Code, § 190.4, subd. (e).) It imposed sentences of death for the murders of David Burrell, Dita Agtani, Ahmad Mushuk, and also for the murder of Cesario Luna it imposed the sentence of death. For the noncapital offenses, it imposed a total term of 13 years and 8 months to life in state prison, which it stayed, pending execution of the sentence of death. (Pen. Code, § 654.)\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nAs we shall explain, we conclude that the judgment should be affirmed.\n\nI. FACTS\n\nA. Guilt Phase\n\nThe People introduced evidence to the following effect.\n\nIn August 1980, Bruce Woods was riding in a car on La Cienega Boulevard in Los Angeles with a man named Connie and a woman called \"Collie,\" whom he identified as Carletha Stewart. \"Collie\" asked if they wanted to make some money by robbing Bob's Big Boy, one of a chain of fast-food restaurants with that name. Connie replied \"Are you crazy?\" and the subject was dropped.\n\nJerry Lankford learned of a possible robbery of Bob's Big Boy in September 1980. One evening in September, as Lankford was standing on a street corner with friends, defendant drove up in a blue Cadillac. He parked and approached the group. He talked about \"taking down\" the Bob's Big Boy. Lankford, who worked at a Bob's Big Boy, told defendant that the robbery was not a good idea because there were probably off-duty police officers working there. Defendant disagreed, saying that he was \"screwing\" a waitress who had \"cased\" the restaurant. He then walked over to his car and opened the trunk, in which Lankford saw the stock of a shotgun wrapped in a blanket and shotgun shells.\n\nIn September 1980, Brenda Givens was employed as a waitress at Bob's Big Boy restaurant on La Cienega. On September 27, 1980, while visiting her boyfriend at the Los Angeles County jail, she saw Stewart with defendant and Franklin Freeman, Jr. Stewart said: \"Good thing I seen you . . . because they gonna rob Bob's Big Boy tonight, and I don't want you hurt.\" That evening, Givens told two managers at Bob's Big Boy about the planned robbery. One of them, Rodell Mitchell, called the police. That evening, because of an apparently unrelated incident, the area was monitored by police from that time until 1:00 a.m.\n\nAbout 10:00 p.m., Andre Gilcrest was at Stewart's home. She told him that \"Frank and Ricky\" -- Franklin Freeman, Jr. and defendant -- were planning to rob Bob's Big Boy that night and that she had told them how many managers worked at the restaurant, what time they closed, and where the money was kept. Between 11:30 p.m. and 12:30 a.m., Gilcrest and Stewart went to the Bob's Big Boy, where Stewart spoke to two waitresses and made a telephone call. They then returned to Stewart's home. Later that evening, Stewart called Givens at the Bob's Big Boy from her home and asked how long it would be until she \"got out of there.\" She also asked how many employees were still inside the restaurant.\n\nStewart also called Freeman. She told Gilcrest that Freeman and defendant would pick her up for the robbery. Defendant drove up to Stewart's residence 20 minutes later with Freeman in the passenger seat. Gilcrest saw that defendant had a sawed-off shotgun; Freeman also had a shotgun. After defendant and Freeman left, Stewart explained that they planned to drive to the Bob's Big Boy.\n\nWhen defendant and Freeman did not return after about an hour, Stewart went to the restaurant and knocked on the front door, but the manager did not let her in. After she returned home, she received a phone call from defendant explaining that they did not commit the robbery because the manager did not come out.\n\nOn December 13, 1980, about 9 p.m., Franklin's mother, Orasteen Freeman, saw Stewart, defendant, and two others at her home. A few hours later, at 2 a.m. on December 14, 1980, there were nine employees and two customers inside the Bob's Big Boy on La Cienega. The restaurant doors were locked. The night manager was Michael Malloy. The cook was Derwin Logan; the waitresses were Dionne Alicia Irvin, Evelyn Jackson, Rhonda Robinson, and Dita Agtani; the busboys were Cesario Luna and his son Ismael Luna; the cashier was Ahmad Mushuk. The customers were David Burrell and Tami Ellen Rogoway.\n\nMalloy was in the office preparing to count the money from the cash register when Logan told him that the two remaining customers wanted to be let out. Malloy left the office and handed the keys to the restaurant door to Logan. Logan walked to the front door with Burrell and Rogoway. When Logan opened the door, defendant and another man, both armed with shotguns, forced Logan, Burrell, and Rogoway back into the restaurant. Defendant said \"It's a jack. It's a stickup.\" He took the keys from Logan. The cashier came forward and asked: \"Hey, what's going on?\" The man with defendant stepped forward and hit Mushuk on the head with the butt of his shotgun; Mushuk fell to the floor. Irvin, Jackson, Agtani, Robinson, and Cesario Luna, who were at the counter area, were ordered to lie facedown on the floor. A few minutes later they were led to the kitchen area and again ordered to lie down on the floor.\n\nDefendant took Malloy, Logan, Burrell, and Rogoway to the back of the restaurant and ordered them to lie facedown on the floor of the hallway outside the freezer. While they were on the floor, they heard the men checking the lunchroom, restroom, and lockers.\n\nDefendant asked for the manager. Malloy stood up. Defendant walked him over to an electrical panel and asked \"Where's the alarm?\" Malloy pointed to the alarm. Defendant handed Malloy the keys and ordered him to open the door to the office. Inside the office, he asked: \"Where's the safe?\" Malloy pointed to the safe. After defendant ordered him to give him the money in the safe, Malloy placed approximately $1,300 in a box and slid it out the door. Some of the coins were wrapped in Bank of America coin wrappers.\n\nDefendant told everyone to \"get up off the floor. . . We are going to the back. You're going to get hurt.\" Malloy, Logan, Burrell, and Rogoway stood up and went into the freezer, which other employees already occupied. Mushuk was lying on the floor unconscious.\n\nDefendant said: \"I want watches, wallets and jewelry.\" Malloy gathered items from everyone in the freezer, except Mushuk, in a bucket, which he handed to defendant. No one resisted the gunmen. Some of the people in the freezer cried and pleaded, \"Please don't hurt us\"; others prayed out loud. The gunmen ordered everyone to \"turn around and face the wall\" and then to kneel. One of them said, \"You're going to get it first.\" Defendant and the other gunman fired into the backs of the group. Jackson stood up and pleaded: \"Don't hurt me. Don't hurt me.\" One of the gunmen ordered her to turn around; when she complied, she was shot and fell to the floor. After the firing stopped, defendant asked, \"How many rounds do you have?\" The other gunman answered, \"None.\" The gunmen closed the freezer door.\n\nInside the freezer, people lay piled on top of each other and on the floor. Ismael Luna looked at his father's body and called out \"Papa, Papa.\" He jumped up to get to the door. Malloy tried to restrain him; Luna broke loose and ran from the freezer. When he returned, he said the men were gone. The bodies of the dead and seriously wounded were pulled out of the freezer. Burrell, Agtani, and Mushuk were dead. Cesario Luna was gravely wounded, and died several months later of complications from a bullet wound to the brain. Malloy was struck in the right eye, which he lost. Rogoway had shotgun injuries to her back and spine, resulting in numbness on her right side and periodic inability to walk. Jackson suffered cranial injury, resulting in permanent impairment of brain function. Irvin received a gunshot wound to the arm. Logan, Ismael Luna, and Robinson were physically unharmed. Robinson developed psychological problems requiring extensive treatment.\n\nOn December 17, 1980, Lankford called the police anonymously and told them about the conversation, in September 1980, concerning the plan to rob Bob's Big Boy. He described defendant and his car. The police subsequently identified Lankford, who provided a written statement.\n\nOn December 20, 1980, Gilcrest contacted the police and told them what he knew about the crimes. Zola Taylor, who was living with the Gilcrest family, also contacted the police, claiming that she had personal knowledge of meetings among the defendants before the robbery. Both Gilcrest and Taylor provided written statements to the police.\n\nIn subsequent investigations, the police discovered a sawed-off shotgun and shotgun shell in the closet of defendant's bedroom. They found shotgun shells and casings in the bedroom used by defendant's father. At Stewart's residence, they found, among other items, $90 in single dollar bills and several rolls of coins in Bank of America wrappings.\n\nDefendant was arrested on December 22, 1980. A lineup was held the following day.\n\nOn March 10, 1981, Woods testified at a preliminary hearing against defendant and Stewart. Afterwards, as they were transported back to jail in a van defendant told Woods he should not testify against Stewart because she was young and that if they were convicted defendant would get the \"gas.\" He warned that if Woods ever went back to jail, he or \"some of [his] people probably get hurt.\" He told him that \"they have the address where [Woods] lives, that [Woods's] family was going to get involved if [he] talked.\"\n\nMalloy identified defendant at a videotape of the lineup, at the preliminary hearing, and at trial. Rogoway identified defendant at trial and at a videotape lineup. Ismael Luna identified defendant at a lineup, at the preliminary hearing, and at trial. Robinson identified defendant at a lineup and at trial.\n\nFor his part, defendant called into question the accuracy of the eyewitness identification of him and called into question the physical evidence linking him to the crime, including shotgun and shell casings found in his apartment, which were consistent with those used during the robbery, and the dollar bills and rolls of coins found at the home of Stewart, which were consistent with the money stolen -- because the People did not conclusively prove that the weapons were actually used in the Bob's Big Boy robbery or that the bills and coins found at Stewart's home were actually taken from the restaurant.\n\nB. Penalty Phase\n\nThe People presented evidence in aggravation concerning the circumstances of a second degree burglary committed by defendant in 1977 at the home of Dr. Donald Lawrence Cray. It was stipulated that defendant committed the burglary and that he entered a plea of guilty and was sentenced to prison.\n\nThe victim, Dr. Cray, testified to the following effect. About 11:15 a.m. on February 28, 1977, Dr. Cray, a dentist, returned to his home in Orange County. As he drove up the driveway, he saw a car parked facing down towards the entrance. He thought the car might belong to repairmen. He entered through the back door. As he came through the kitchen, he saw through the window that there were two men running toward the car from behind the garage. Both carried rifles.\n\nDr. Cray ran out and asked the men what they were doing there. The driver said: \"Shoot him. Shoot him.\" It appeared that the other man, defendant, was positioning the rifle at him. Dr. Cray ran towards the back of the car to a tree. The men drove off and Dr. Cray noted their license number and telephoned the police. Inside the house, he found personal property, including a camera and vacuum cleaner, piled up in the middle of the den. Two rifles were missing. The rifles were later discovered by the police, in damaged condition, near Dr. Cray's home.\n\nIn mitigation, defendant introduced evidence relating to his background and character.\n\nDefendant's sister, Lisa Gina Sanders, testified that there were six children in the family; defendant was the second oldest. The children lived with both of their parents in a public housing project. Their mother was kind and loving, but stern. She worked and kept the house clean. She was strict about rules; on one occasion, when defendant and Lisa sneaked out on Halloween to go trick or treating, she spanked them. Their mother became ill with leukemia in the mid-1960's. Defendant helped to cook, clean, and take care of the other children. He and Lisa earned money by selling newspapers and doing yard work and other chores around the neighborhood. After their mother died, \"it all just kind of went crazy.\" Their father was lax about discipline. The children stayed out late; the house was filthy; their clothes were old and shabby. Lisa and defendant took care of the younger children. Defendant protected the other children from their older brother, who harassed and bullied them.\n\nDefendant taught Lisa how to swim and to ride a bicycle and roller-skated with her. After he was placed in a foster home, he would return to his family home frequently. He was generous to his younger siblings.\n\nLisa testified that she loved her brother and that it was always a pleasure to visit him in jail and to know that she can go and see him. She also testified that it would mean something to her for him to be alive, even if he were locked in prison for the rest of his life.\n\nShirley Madison testified that she had known defendant since 1968. Defendant's father did not know how to care for the six children. The house was not clean and was filled with broken appliances he collected. He did not discipline the children strictly. He drank alcohol around the children. Defendant showed no bitterness toward his father.\n\nLisa and defendant lived with Madison as teenagers; Madison eventually became their foster mother. While he lived with her, defendant was respectful and helpful around the house. He helped care for her children and they looked up to him. She remained in touch with him and received calls from him once or twice a week. She loves him as though he were her own child.\n\nBoth Lisa Sanders and Madison testified about defendant's relationship with his child, \"Ricky, Jr.,\" who was five years old at the time of the trial. Defendant was excited about having a child. He lived with the infant and mother as a family. He did housework and took care of the child. He was firm but gentle with him. He intervened when the mother was too severe in discipline. He would speak to the child sternly, but did not spank or physically discipline him.\n\nDefendant's brother Adrian Sanders, who was stationed with the Army in Korea, obtained a leave and paid his own way back to testify. During his childhood he looked up to defendant as the provider and protector. Defendant and their other brothers would sometimes steal food to feed the younger children. Defendant gave Adrian money when he needed it and also gave him his first car. When Adrian was overseas with the Army, defendant wrote letters in which he urged Adrian not to get into trouble as he had. He told Adrian to make sure to take care of their father when he returned home and to look after Ricky, Jr. Adrian looked up to defendant and felt proud of him. He would want to be his friend even if he were not his brother. He loves him very much.\n\nDr. Michael Paul Maloney, a clinical psychologist and associate professor of psychiatry at the University of Southern California School of Medicine, testified that he had examined defendant's school records and juvenile probation file records. He learned from the files that before defendant's mother died in 1966, he performed adequately at school. After her death, when he was in junior high school, his behavior deteriorated; he became difficult to handle and his grades dropped. His record improved after he was placed in foster care, although there was a \"negative attitude by the father\" toward foster home placement that appeared to affect defendant's performance at school. His grades deteriorated further after he returned to his father's home.\n\nII. GUILT ISSUES\n\nDefendant raises a number of claims attacking the judgment as to guilt. As will appear, none is meritorious.\n\nA. Motion to Change Venue\n\nIn August 1981, defendant's then-codefendant Franklin Freeman, Jr., moved for a change of venue; he also moved, in a separate motion, for funds, pursuant to Penal Code section 987.9, to conduct a jury venire survey. Defendant joined the motion for change of venue only. Both motions were denied. Defendant's case was subsequently severed from Freeman's.\n\nIn March 1982, defendant filed a renewed motion for change of venue based on pretrial publicity, or, in the alternative, a continuance. He did not request funds for a jury venire survey. The trial court denied the motion without prejudice, observing that defendant \"can always renew your motion and the Court would consider it anew.\"\n\nDuring voir dire, only one of the venire members who had previously heard about the case stated that she might be influenced by pretrial publicity; she was dismissed for cause. At that time, the trial court observed: \"The record is very clear that we have talked to almost 100 jurors and this is the first one, and you can correct me if you think that I am wrong, but I think this is the first that has indicated that she is so affected by pretrial publicity that her mind is made up. . . . I think this is the exception that proves the rule that there has not been such persuasive [sic] pretrial publicity as to deny this defendant a fair trial in this county.\" Defendant did not renew the motion for change of venue.\n\nDefendant contends that the trial court erred in denying the motion for change of venue. He urges that the high percentage of venire members with knowledge of the case, coupled with \"the recognition that juror assurances of fairness are of dubious reliability\" demonstrate prejudice.\n\nThe claim lacks merit.\n\nPenal Code section 1033, in relevant part, provides: \"In a criminal action pending in the superior court, the court shall order a change of venue: [P] (a) On motion of the defendant, to another county when it appears there is a reasonable likelihood that a fair and impartial trial cannot be had in the county.\" Of course, a criminal defendant may move for change of venue on the basis of the prejudicial effect of pretrial publicity on the venire.\n\n\"In passing on such a motion, the trial court looks to the following factors, among others: the nature and gravity of the offense, the size of the community, the status of the defendant, the popularity and prominence of the victim, and of course the nature and extent of the publicity.\" ( People v. Bonin (1988) 46 Cal. 3d 659, 672, 250 Cal. Rptr. 687, 758 P.2d 1217; People v. Anderson (1987) 43 Cal. 3d 1104, 1130, 240 Cal. Rptr. 585, 742 P.2d 1306.) The trial court must resolve whether, on the peculiar facts of the individual case, there is a reasonable likelihood that the jurors chosen for defendant's trial have formed such fixed opinions as a result of pretrial publicity that they cannot make the determinations required of them with impartiality. ( People v. Bonin, supra, 46 Cal. 3d at pp. 672-673.) Defendant, as the moving party, bears the burden of proof. ( 46 Cal. 3d at p. 673.)\n\nOn appeal, we review the trial court's resolution of factual questions under a deferential substantial evidence standard. ( People v. Bonin, supra, 46 Cal. 3d at p. 676.) The ultimate question of the reasonable likelihood of a fair and impartial trial is a mixed question of law and fact, which we review under a de novo standard. (Ibid.)\n\nWe find no error.\n\nDefendant points to the gravity of the crimes and the extensive media coverage, including newspaper and magazine articles, television broadcasts, and even an opening segment of a made-for-television movie depicting a similar incident in a fast-food restaurant. While these factors may weigh in favor of a change of venue, they are not dispositive. Although the crimes were brutal, we have previously upheld denial of change of venue in capital cases involving multiple killings. (See People v. Bonin, supra, 46 Cal. 3d at p. 677.) Furthermore, although there was considerable news coverage immediately after the crimes occurred, much of it in the context of articles concerning a general increase in violent crime in Los Angeles, coverage was substantially reduced by the time defendant renewed his motion 13 months later, in March 1982. The potentially prejudicial effect of the news coverage must be presumed to have diminished by the beginning of jury selection. (Ibid.) The passage of time weighs heavily against a change of venue. (46 Cal. 3d at p. 678.)\n\nMoreover, there were numerous countervailing factors weighing against a change of venue. The crimes and publicity occurred in Los Angeles County, the largest and most populous metropolitan area in the state. As has been frequently emphasized, \" 'adversities of publicity are considerably offset if trial is conducted in a populous metropolitan area.' \" ( People v. Harris (1981) 28 Cal. 3d 935, 949, 171 Cal. Rptr. 679, 623 P.2d 240 (plur. opn. of Clark, J.).) Furthermore, none of the victims or defendants was prominent in the community at the time of the events.\n\nMore important, our examination of the record persuades us that pretrial publicity had no actual prejudicial effect. It is not necessary that jurors be entirely ignorant of the facts and issues involved in the case; it is sufficient that they can lay aside their opinions and impressions and render a verdict based on the evidence presented at trial. ( People v. Fauber (1992) 2 Cal. 4th 792, 819, 831 P.2d 249.) Only one venire member stated that she would be unable to decide the case fairly because of the publicity to which she had been exposed. She was dismissed for cause. We reject defendant's broad assertion that assurances of fairness by prospective jurors are \"inherently untrustworthy.\"\n\nWe cannot discern a reasonable likelihood that the jurors chosen for defendant's trial had formed such fixed opinions as a result of pretrial publicity that they could not make the determinations required of them with impartiality. Indeed, at the time the final juror was selected, defendant had not used seven available peremptory challenges and expressed no dissatisfaction with the jury as selected. His failure to exhaust his peremptory challenges strongly indicates that \"the jurors were fair and that the defense itself so concluded.\" ( People v. Balderas (1985) 41 Cal. 3d 144, 180, 222 Cal. Rptr. 184, 711 P.2d 480; People v. Daniels (1991) 52 Cal. 3d 815, 853-854, 277 Cal. Rptr. 122, 802 P.2d 906.)\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nDefendant's additional claim of erroneous denial of his \"motion\" for Penal Code section 987.9 funds to conduct a venire survey on the impact of pretrial publicity has not been preserved for review. He did not make such a motion in the first place. The record does not indicate that he joined the motion of his former codefendant, Freeman, under Penal Code section 987.9. In his subsequent motion for change of venue, although he attached a copy of Freeman's request for funds as an exhibit and counsel referred at the hearing on the renewed venue motion to denial of the prior request for funds during argument, he did not request funds. Nor does the record reflect that the trial court considered or ruled on that issue.\n\nIn any event, even assuming defendant had made such a motion and it was denied by the trial court, we find no prejudice. As we emphasized in rejecting a similar claim: \"Defendant did not exhaust his peremptory challenges or object to the jury as finally composed. We regard such inaction by defense counsel as a tacit acknowledgment that, regardless of community attitudes generally, the jury as finally selected was a fair and impartial body.\" ( People v. Daniels, supra, 52 Cal. 3d at p. 851.)\n\nB. Exclusion of Expert Testimony on Eyewitness Identification\n\nToward the end of the prosecution's case-in-chief, defendant sought an order to allow psychologist Elizabeth Loftus, Ph.D., to testify in his defense as an expert in the field of eyewitness testimony. In a written offer of proof, he specified that her testimony would be limited to opinions concerning the psychological factors affecting the reliability and accuracy of eyewitness identification.\n\nThe People objected to the expert testimony on the gounds that the subject matter was not beyond common experience and that the expert's opinions had not achieved general acceptance in the scientific community. The court heard an offer of proof at a hearing outside the presence of the jury. Dr. Loftus expounded her opinion that eyewitness testimony is unreliable because, inter alia, memory can be impaired by extreme stress, memories can be transformed by information received after the event, cross-racial identification is difficult, and confidence about accuracy does not correlate with actual accuracy of identification. The trial court excluded the testimony on several grounds. It ruled, first, that the subject matter of the testimony did not relate to a matter sufficiently beyond common experience that an expert would assist the trier of fact (Evid. Code, § 801, subd. (a)). Second, it concluded that the evidence did not satisfy the requirements of the Kelly-Frye rule because it had not achieved general acceptance in the scientific community. ( People v. Kelly (1976) 17 Cal. 3d 24, 130 Cal. Rptr. 144, 549 P.2d 1240; Frye v. United States (D.C. Cir. 1923) 54 App. D.C. 46, 293 F. 1013). Third, it determined that because of the time that would be consumed, its probative value was outweighed by its prejudicial effect.\n\nDefendant claims error. We review the trial court's rulings for abuse of discretion. ( People v. McDonald (1984) 37 Cal. 3d 351, 376, 208 Cal. Rptr. 236, 690 P.2d 709.) We find none.\n\nIn People v. McDonald, supra, 37 Cal. 3d 351, we acknowledged that scholarly research had uncovered a set of psychological principles concerning eyewitness identifications that had become widely accepted in the scientific community. We concluded that the Kelly-Frye rule was inapplicable to expert testimony on psychological factors affecting eyewitness identification. We also observed that the body of information available on psychological factors bearing on eyewitness identification was \" 'sufficiently beyond common experience' that in appropriate cases expert opinion thereon could at least 'assist the trier of fact' (Evid. Code, § 801, subd. (a)).\" (37 Cal. 3d at p. 369, fn. omitted.)\n\nWe held that, in the appropriate case, exclusion of expert testimony concerning eyewitness identification would constitute error. (37 Cal. 3d at p. 377.) We stressed that \"when an eyewitness identification of the defendant is a key element of the prosecution's case but is not substantially corroborated by evidence giving it independent reliability, and the defendant offers qualified expert testimony on specific psychological factors shown by the record that could have affected the accuracy of the identification but are not likely to be fully known to or understood by the jury, it will ordinarily be error to exclude that testimony.\" (Ibid.) We also emphasized, however, that \"the decision to admit or exclude expert testimony on psychological factors affecting eyewitness identification remains primarily a matter within the trial court's discretion\" and that such evidence \"will not often be needed.\" (Ibid.)\n\nBecause McDonald was decided more than two years after defendant's trial took place, the trial court was not guided by that decision. Even under McDonald, however, we find no abuse of discretion under the circumstances of this case.\n\nIn McDonald, no evidence linked the defendant to the crime, apart from eyewitness identification. The eyewitness testimony was equivocal; several witnesses testified that their view of the crime was partially blocked and obscured by rush-hour traffic; one eyewitness asserted that the defendant was definitely not the killer. The defendant also had a strong alibi defense. We concluded that the eyewitness identifications were not corroborated by evidence that would lend them independent reliability.\n\nHere, by contrast, the eyewitness testimony was strong and unequivocal. Three eyewitnesses -- Malloy, Robinson, and Luna -- positively identified defendant in lineups and at trial; a fourth, Rogoway, was \"pretty certain\" of her identification of him at a videotape lineup and positively identified him at trial. The events at the Bob's Big Boy occurred in a lighted interior and the witnesses were in close proximity to the perpetrators. Two of the eyewitnesses, Malloy and Robinson, were Black, as were the gunmen.\n\nAlthough eyewitness testimony was a key element of the prosecution's case, here, unlike McDonald, eyewitness testimony was not the only evidence linking the defendant to the crime. The eyewitness identification was corroborated by other independent evidence of the crime and the conspiracy leading to it. Several witnesses testified that defendant planned the robbery and solicited accomplices. Thus, for example, Lankford testified that he was approached by defendant in September 1980, who solicited help in \"taking down\" the Bob's Big Boy on La Cienega. Givens testified that she was warned in September 1980 by Stewart that Freeman and defendant were planning to rob the restaurant. Gilcrest also testified that he was told by codefendant Stewart, that defendant and Freeman planned to rob Bob's Big Boy. Defendant also threatened Bruce Woods, a prosecution witness who had testified against him and Stewart at the preliminary hearing. On the night of the crimes, he was seen in the company of Stewart and Freeman a few hours before the robbery. Two shotguns and live and spent shells located in his apartment were consistent with those used in the shootings. Other physical evidence included rolled coins and bills found at the home of codefendant Stewart, also consistent with money seized in the robbery. In these circumstances, it was not error to exclude the testimony. In addition, defendant presented no alibi defense.\n\nUnder these circumstances, we find no abuse of discretion; we defer to the Conclusion of the trial court that the probative value of the testimony in assisting the trier of fact was outweighed by its \"prejudicial effect involving the amount of time consumed.\"\n\nIn any event, no prejudice appears; it is not reasonably probable that a result more favorable to defendant would have been reached in the absence of the erroneous exclusion. ( People v. McDonald, supra, 37 Cal. 3d at p. 376; People v. Watson (1956) 46 Cal. 2d 818, 836, 299 P.2d 243.) During the course of the trial, counsel extensively cross-examined eyewitnesses concerning the accuracy and reliability of their testimony. In closing argument, she argued at length about the weaknesses and pitfalls of eyewitness identification, including, specifically, problems of cross-racial identification and the effects on memory of stress and of information received after the event. Furthermore, the trial court instructed the jury to consider several factors in evaluating eyewitness testimony, including the duration of time that the witness had to observe the suspect and the lighting conditions under which such observations were made, the effect of stress on the witness, the similarity or difference in race between the subject and the witness, the degree of certainty of the witness, prior identifications or failure to identify the subject, and the effects of exposure to photographs of the suspects. In light of the foregoing and the strong identification and other testimony of several independent eyewitnesses, defendant's lack of an alibi defense, and the extensive corroborating evidence, it is not reasonably probable that a different result would have occurred had the expert been permitted to testify.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nC. Admission of Excerpts from Manager's Manual\n\nMichael Malloy, the night manager of the Bob's Big Boy restaurant, offered eyewitness testimony identifying defendant as one of the perpetrators. In connection with his testimony, the prosecutor sought to question Malloy concerning his familiarity with and attempt to follow procedures listed in the Bob's Big Boy \"Manager's Manual\" in the event of a robbery. He also sought to introduce into evidence two pages of excerpts from the manual, entitled \"Hold-Ups and Robberies\" and \"In the Event of a Robbery.\" The materials advised employees to cooperate with, and not resist, a robber, to remain calm, and to study the physical features and clothing of the robber so as to be able to provide an accurate description to the police. They also contained detailed suggestions concerning how to identify a robber, including the importance of observing height and weight, eye and skin color, voice and accent, clothing, and use of right or left hand.\n\nDefendant objected on the grounds that the evidence was hearsay and that it would improperly enhance the witness's credibility. The prosecution argued that the evidence would corroborate Malloy's testimony that he was aware of the procedures described in the manual and attempted to follow them during the robbery. The trial court ruled that Malloy could testify \"about the contents of the memorandum and his actions in connection thereto.\" It explained that the testimony was relevant to show that the victims did not offer any resistance to the robbers and to show that \"a logical pattern of conduct was advised and perhaps followed in observing the persons.\"\n\nMalloy testified that he was familiar with the contents of the manual; he had read the manual before each of his three managerial promotions, and the two pages were posted on the office bulletin board. He attempted to follow the procedures during the robbery: he offered no resistance and cooperated with the robbers; he also consciously recalled, and tried to use, the suggestions in the manual about how to identify a robber. The trial court admitted the excerpts into evidence as an exhibit at the close of the prosecution's case-in-chief, observing that the two pages from the manual were \"documents that the witness said that he studied and tried to comply with, and the jury will be entitled to see exactly what he read and exactly what he was trying to comply with.\"\n\nDefendant contends that admission of the evidence was error, on three grounds: first, the excerpts from the Manager's Manual were hearsay (Evid. Code, § 1200); second, the contents were irrelevant (id., § 210); third, the evidence was more prejudicial than probative (id., § 352).\n\nThe evidence was not hearsay; it was not offered for the truth of the matter asserted, but to show what procedures Malloy studied and attempted to follow. Defendant argues that the evidence was at least \"implied hearsay\" under Dillenbeck v. City of Los Angeles (1968) 69 Cal. 2d 472, 72 Cal. Rptr. 321, 446 P.2d 129. Dillenbeck concerned the admissibility of a police safety manual as evidence of the due care required by a police officer under particular circumstances. We held that the manual was admissible as an implied admission of a party opponent, \"on the ground that an employee's failure to follow a safety rule promulgated by his employer, regardless of its substance, serves as evidence of negligence.\" ( Id. at p. 481.) We noted in dictum, however, that the evidence, if \"introduced for the purpose of particularizing the standard of care\" would \"theoretically constitute hearsay: an attempt to prove the truth of the matter implicitly asserted -- that due care requires certain conduct.\" ( Id. at p. 478.) The point is inapposite. The \"Manager's Manual\" was not introduced for the purpose of showing that the procedures established a reliable standard of care to be followed by Bob's Big Boy employees; nor did admission of the evidence imply that the procedures were reliable.\n\nDefendant's relevance argument also fails. \"The trial court is vested with wide discretion in determining relevance.\" ( People v. Green (1980) 27 Cal. 3d 1, 19, 164 Cal. Rptr. 1, 609 P.2d 468.) Admission of the excerpts fell well within that discretion: it corroborated Malloy's testimony concerning how he behaved during the robbery and, in particular, that he used specific techniques in his attempt to focus and concentrate on defendant's appearance so that he could later identify him to the police.\n\nFinally, defendant argues that the trial court abused its discretion in admitting the evidence because it was more prejudicial than probative. No objection on this ground was made in the trial court; the point has not been preserved for review. Even if we construed defendant's argument to the trial court that the excerpts would improperly enhance the witness's credibility as an objection under Evidence Code section 352, which we do not, the claim is unpersuasive. In rejecting defendant's argument, the trial court did not exercise its discretion \"in an arbitrary, capricious or patently absurd manner that resulted in a manifest miscarriage of Justice.\" ( People v. Jordan (1986) 42 Cal. 3d 308, 316, 228 Cal. Rptr. 197, 721 P.2d 79.)\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nD. Cross-examination of Rogoway\n\nTami Ellen Rogoway, who appeared as a prosecution witness, was extensively cross-examined concerning her identification of defendant. Outside the presence of the jury, counsel also sought to cross-examine her on two related points concerning her identification of Freeman.\n\nIn her offer of proof, counsel described the sequence of Rogoway's identification testimony at the preliminary hearing. On direct examination, Rogoway initially did not identify Freeman. She remained in the courtroom during the testimony of another witness who identified him. She then approached the prosecutor and said she could now identify him. On further direct examination, she positively identified him in the courtroom.\n\nCounsel also made an offer of proof that Rogoway collaborated with a prison inmate, Richard Quine, to fabricate identification of Freeman, out of her anger and desire to \"put him away.\"\n\nThe prosecutor informed the trial court that Rogoway's sole contact with Quine occurred during a visit to the state prison in Chino with a friend who was visiting Quine. Rogoway met with Quine to tell him that the friend was not permitted to meet with him because she was under 18 years old. Subsequently, Quine wrote to Rogoway's friend, telling her to find out everything Rogoway knew about the case, adding that he could \"fix it up good so that this guy Freeman gets put away.\" In exchange, he wanted conjugal visits with the friend. Rogoway gave the letter to the prosecutor, who turned it over to defense counsel. According to the prosecutor, another informant identified Quine as an unreliable \"snitch\" who was willing to \"sell himself to anyone.\" Defendant did not dispute this account of the background facts.\n\nThe trial court excluded the identification testimony under Evidence Code section 352, observing: \"I will not let you show that she is a bad identifier by showing she may have been wrong about Freeman.\" In response to argument that the cross-examination was not intended to show that Rogoway identified the wrong person, but to show bias, the trial court remarked: \"Her bias and interest in this case is so obvious . . . that she not only lost her boyfriend who was killed, but she suffered very serious and probably permanent injuries herself. [P] Of course she has a tremendous bias or interest. You don't have to demonstrate that by the evidence.\" The trial court added that the evidence would \"get[] off in a collateral area\" including the \"guilt or innocence of Freeman.\" As it had earlier explained: \"Well, you know my basic position, which is that I hope we can keep away from the question of the identification of Freeman because of the great amount of time and the -- and the collateral matters that would be raised. [P] We get altogether off the question of the identification of [defendant] as to whether or not he's involved, and we get off into somebody else.\"\n\nThe trial court ruled that defendant would not be permitted to cross-examine Rogoway about her alleged collaboration with Quine unless he first called Quine as a witness and established a foundation for the claim of fabrication. It ordered Rogoway to remain available, subject to being recalled for further testimony on these issues. Defendant did not call Quine as a witness or seek to recall Rogoway for cross-examination on this point.\n\nDefendant claims the trial court erred on both points. We review these rulings for abuse of discretion. ( People v. Clair (1992) 2 Cal. 4th 629, 655, 828 P.2d 705.)\n\nWith regard to testimony concerning identification of Freeman, no abuse appears. The trial court did not err in restricting cross-examination on the collateral issue of Rogoway's identification of Freeman, on the ground that the probative value of such an inquiry -- whether to call into question the accuracy of her identification of defendant or to show bias -- was outweighed by the prejudice of undue consumption of time and potential confusion of the jury.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nThe trial court also did not abuse its discretion in requiring defendant to establish a foundation regarding alleged collaboration with Quine before cross-examining Rogoway on the collateral issue of fabricating evidence about Freeman. Evidence Code section 403, subdivision (a)(4) provides: \"(a) The proponent of the proffered evidence has the burden of producing evidence as to the existence of the preliminary fact, and the proffered evidence is inadmissible unless the court finds that there is evidence sufficient to sustain a finding of the existence of the preliminary fact, when [P] . . . [P] (4) the proffered evidence is of a statement or other conduct of a particular person and the preliminary fact is whether that person made the statement or so conducted himself.\" In light of the undisputed background information provided to the court concerning Quine's questionable reliability and limited contact with Rogoway, the trial court properly required defendant to carry the burden of producing evidence as to the existence of the preliminary fact that Rogoway had indeed collaborated with Quine before permitting cross-examination on that point.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nE. Admission of Stewart's Extrajudicial Statements\n\nDuring the guilt phase, the People sought to introduce statements made in September 1980 by Carletha Stewart to Brenda Givens and Andre Gilcrest, and a statement by Stewart in August 1980 to Bruce Woods. Defendant objected on the grounds that the statements were inadmissible hearsay and that their introduction into evidence would violate the Confrontation Clause under the Sixth and Fourteenth Amendments.\n\nAfter conducting a hearing to determine the admissibility of the evidence, the trial court ruled that the statements to Givens and Gilcrest were admissible coconspirator declarations under Evidence Code section 1223.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e It further ruled that the statement to Woods was admissible for the nonhearsay purpose of showing Stewart's state of mind.\n\nDefendant claims the trial court improperly admitted the statements. For the following reasons, no state law error or constitutional error appears.\n\n1. Statements to Givens\n\nGivens testified that she worked as a waitress at Bob's Big Boy in September and December 1980. She was friendly with Stewart, who had also worked as a waitress at the restaurant. On September 27, 1980, while visiting her boyfriend in the Los Angeles County jail, she saw Stewart in the visitors' area, accompanied by defendant, Freeman, and another woman. Stewart approached Givens and said, \"Good thing I seen you today. . . . They going to rob Bob's Big Boy tonight and I don't want you hurt.\" She told Givens she would be coming to the restaurant around closing time.\n\nAlthough defendant does not dispute the existence of a conspiracy on September 27, 1980, he argues that the remarks to Givens were inadmissible because they were not made \"in furtherance of the objective\" of the conspiracy. The point is unpersuasive.\n\n\"Hearsay statements by coconspirators may . . . be . . . admitted against a party if, at the threshold, the offering party presents 'independent evidence to establish prima facie the existence of . . . [a] conspiracy.' . . . Once independent proof of a conspiracy has been shown, three preliminary facts must be established: '(1) that the declarant was participating in a conspiracy at the time of the declaration; (2) that the declaration was in furtherance of the objective of that conspiracy; and (3) that at the time of the declaration the party against whom the evidence is offered was participating or would later participate in the conspiracy.' \" ( People v. Hardy (1992) 2 Cal. 4th 86, 139, 825 P.2d 781; accord, Evid. Code, § 1223.)\n\nWe find no abuse of discretion by the trial court in concluding that Stewart's statement to Givens was made in order to remove her from the scene of the planned crime so that she would not be an eyewitness and victim of the robbery and would be less likely to be able to establish Stewart's connection to the robbery. As the trial court explained: \"Carletha, because of her relationship with Givens, either didn't want her there so she wouldn't be hurt, which I think is the least likely reason, or that she didn't want her there because she ran into her in the company of the two persons that were going to commit the robbery.\" It further reasoned: \"Earlier in the day Miss Stewart, upon seeing a colleague at the county jail and being in the company of Sanders and Freeman, warned that colleague not to go there that night because the place was going to be robbed. [P] A natural and logical inference would be that the colleague, having seen her at the jail with these two men, and if she saw those two men robbing that place that night, would tell the police that she saw Stewart earlier in the day with these two men, and Stewart would be immediately connected with the crime; the police would come looking for her.\"\n\n2. Statements to Gilcrest\n\nBased on Gilcrest's prior testimony, at a hearing on a motion to suppress, the People sought to introduce two statements by Stewart. On September 27, 1980, she told Gilcrest that \"Frank and Ricky are going to rob Bob's Big Boy tonight.\" Later that night, after he had accompanied her to the restaurant for coffee, she told him that \"they didn't do it because the manager didn't come out\" and \"that they were going to do it the next night, the following night.\"\n\nThe trial court expressly found that the statements by Stewart were made in furtherance of the conspiracy and that there was evidence that defendant was a party to the conspiracy at the time the statements were made. In admitting the evidence, it explained: \"I think there is a viable theory which the court can believe and which in fact I tend to believe, and I do believe it sufficiently for review under section 402 of the Evidence Code in which the jury could believe. [P] And that is that Carletha Stewart wanted to involve Gilcrest in this matter, at least to the point of having an escort and somebody there with her while she was at the restaurant. [P] Her presence at the restaurant that night was, obviously, to further the robbery that she expected to happen, and she wanted somebody else with her, and the presence of another man to be with her at that point could have been useful. [P] Maybe he would participate in the robbery itself, maybe he wouldn't. [P] But it's certainly logical that she could want someone there with her who knew what was going to happen, and that would at least not show any alarm at whatever she might do. . . . [P] And to have someone go there and to be aware of what was going on and be cooperative would be of use to her.\" As to Stewart's statement to Gilcrest about why the robbery did not occur that night and her indication that it would happen the next day, the trial court similarly concluded: \"I feel that it does tend to further the conspiracy . . . . to insure his continued cooperation and to prevent his perhaps telling someone about it.\"\n\nDefendant implausibly argues that Stewart's statements to Gilcrest were \"nothing more\" than casual admissions of culpability and speculates that they were not \"necessary\" in order to further the conspiracy. The trial court's Conclusion that the statements were made in furtherance of the conspiracy is adequately supported by the record; we find no abuse of discretion.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\n3. Statement to Woods\n\nThe People made an offer of proof that Woods would testify that, in August 1980, he rode in a car on La Cienega Boulevard with his friend Connie and a woman named \"Collie,\" later identified as Stewart. \"Collie\" asked if he wanted to make some money by robbing a Bob's Big Boy on La Cienega. In support, the prosecutor argued that the proffered testimony was linked to, and tended to corroborate, evidence that defendant had solicited someone else, Jerry Lankford, for the same robbery in September.\n\nThe trial court admitted the testimony: \"The testimony will be permitted for the purpose of showing that a conspiracy was either formed or in the process of being formed. [P] . . . In other words, it's not hearsay at all. It's not being admitted for the purpose of showing that Bob's Big Boy was to be robbed, it is merely circumstantial evidence that there was an effort by one member of the alleged conspiracy [Stewart] to form a conspiracy for the purpose of robbing Bob's Big Boy. [P] In other words, the very fact that she would request someone to assist with her in the robbery of Bob's is circumstantial evidence of her state of mind, which is in issue in this case.\"\n\nAgain, no error appears. Under Evidence Code section 1250, subdivision (a), \". . . Evidence of a statement of the declarant's then existing state of mind, emotion, or physical sensation (including a statement of intent, plan, motive, design, mental feeling, pain, or bodily health) is not made inadmissible by the hearsay rule when: [P] . . . [P] (2) The evidence is offered to prove or explain acts or conduct of the declarant.\" Stewart's statement was admissible for the nonhearsay purpose of establishing her state of mind in August 1980, i.e., her intention to form a conspiracy to rob Bob's Big Boy, which was clearly relevant to the issue whether she subsequently entered into a conspiracy with defendant to commit robbery.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nF. In Camera Review of Gilcrest Interview\n\nDuring cross-examination of Gilcrest, defendant sought to impeach him with statements recorded in an interview of Gilcrest by a defense investigator. As summarized by the trial court: \"[Defense counsel] indicated it was her desire to ask certain questions of the witness without disclosing the transcript or the tape to [the prosecutor]. And then later to call the investigator who would not read the transcript or any tape for the jury, but would merely answer questions not using the tape or the transcript and still not allow the District Attorney access to the transcript or tape recording.\" The People objected to the use of any questions asked of the witness based on the tape-recorded statement.\n\nThe trial court initially observed: \"To permit the defense to take the statement and use only those parts which would favor the defense would be -- would give a misleading picture to the jury, but more importantly it would violate section 356 of the Evidence Code. [P] My intended ruling is to give the defense the following choice: [P] Either to refrain from asking Mr. Gilcrest any questions concerning the tape recorded statement, and along with that not asking the defense investigator any questions about the interview or to disclose the tape recording and the transcript to the District Attorney.\"\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nCounsel objected to disclosure of the transcript on the ground that it was privileged work product. She indicated that she was interested in questioning Gilcrest regarding his knowledge of and feelings about the relationship between Stewart, his former girlfriend, and defendant.\n\nAfter further argument, the trial court modified its ruling: \"I want to make it very clear what I am offering. First of all, I find 356 applies. And that when you go into part of an act, declaration, conversation or writing, that the prosecution is entitled to bring out the entire matter surrounding it. . . . [P] I am offering you the opportunity to tell me what it is you wish to ask in camera, if you wish. [P] That I will examine the statement in its entirety in camera. I will decide what sections you must reveal to the District Attorney in order to ask the question that you are interested in. [P] And then give you the option of either foregoing the questions or submitting to discovery. . . . [P] Or you can reject that entire package and take my ruling as it is.\"\n\nCounsel objected to the ruling as violating defendant's state constitutional privilege against self-incrimination and his right to effective representation. She refused to produce the transcript for in camera review; instead, she did not further cross-examine Gilcrest with express reference to his interview with the investigator.\n\nDefendant contends that the trial court erred in ruling as it did under Evidence Code section 356. He asserts that he could not be required, consistent with his privilege against self-incrimination, pursuant to article I, section 15 of the California Constitution, to disclose the interview transcripts as a condition for using their contents to impeach Gilcrest.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nHis argument has merit. Counsel expressly did not seek to have any portion of the recording or transcript entered into evidence. Indeed, she agreed not to read any portion of the transcript: \"Well, I won't read the statement. If that's the problem, I'll close the book. I know what's in it.\" Under these circumstances, although the prosecutor could not be foreclosed from inquiring into the context of the statements on redirect examination of the witness and cross-examination of the investigator, he was not entitled to review any portion of the tape or transcript under Evidence Code section 356.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nAt the time of trial, moreover, our cases directed that courts should refrain from compelling the disclosure of defense investigative materials, including notes of interviews with witnesses. Thus, in People v. Collie (1981) 30 Cal. 3d 43, 177 Cal. Rptr. 458, 634 P.2d 534, we emphasized that such disclosure had constitutional implications. In Collie, the prosecution, after learning in the course of cross-examination that a defense witness had spoken previously to a defense investigator, requested discovery of the notes prepared by the investigator. Defense counsel objected on the basis of work-product doctrine and the attorney-client privilege. The trial court overruled the objections and ordered discovery. We held that, under those circumstances, the trial court erroneously ordered discovery of the witness's prior statement. ( Id. at p. 56.)\n\nSimilarly, in In re Misener (1985) 38 Cal. 3d 543, 213 Cal. Rptr. 569, 698 P.2d 637, defense counsel was held in contempt for refusing to disclose the contents of witness interviews that were requested under Penal Code section 1102.5, which provided for prosecutorial discovery of statements of any defense witness other than the defendant, after that witness had testified on direct examination. We invalidated the statute, holding that it contravened the state constitutional privilege against self-incrimination. (38 Cal. 3d at p. 558.) We have applied the harmless error standard under People v. Watson, supra, 46 Cal. 2d 818, 836, to Misener error. ( People v. Wright (1990) 52 Cal. 3d 367, 421, fn. 19, 802 P.2d 221, 276 Cal. Rptr. 731.)\n\nEven if the trial court erred under then-governing precedents, however, the claim fails in the absence of prejudice. Counsel repeatedly stated that she intended to use the transcript of the Gilcrest interview in connection with only a narrowly limited area of inquiry: Gilcrest's jealousy of Stewart's relationship with defendant. The record shows that counsel, in fact, extensively cross-examined Gilcrest about his feelings for Stewart, including his accusation that she lied to him about a tattoo she wore depicting a rose with defendant's initial on it, as a motive to implicate defendant. No other testimony was affected by the ruling, which applied only to the Gilcrest interview.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e In addition, there was substantial evidence apart from Gilcrest's testimony concerning a conspiracy to commit robbery involving Stewart and defendant. It is not reasonably probable that a result more favorable to defendant would have occurred in the absence of the asserted error.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nG. Exclusion of Prior Testimony by Zola Taylor\n\nTaylor and Gilcrest had both supplied the police with written statements used to obtain search warrants for the homes of defendant, Stewart, and Franklin. At a pretrial suppression hearing, Gilcrest testified, inter alia, that on September 27, 1980, Stewart told him that defendant and Freeman were planning to rob Bob's Big Boy, that the two men drove up to Stewart's house that night with two shotguns in their car, and that he went with Stewart to Bob's Big Boy. Taylor testified that Gilcrest told her that the meeting between defendant, Freeman, and Stewart occurred not in September, but around Thanksgiving of 1980, that he had gone to Bob's Big Boy in December, on either the day before or the actual day of the shootings, and that he had seen the shotguns when defendant and Freeman drove into the restaurant parking lot. During the hearing, the defense established that Taylor had lied to the police by claiming to have personal knowledge of the pre-robbery meetings among the defendants; the information she reported to the police came directly from Gilcrest.\n\nAt trial, Gilcrest testified as a prosecution witness in conformity with his pretrial testimony. Near the end of his case-in-chief, defendant sought permission to introduce portions of Zola Taylor's prior testimony at a pretrial suppression hearing for the purpose of impeaching Gilcrest.\n\nDefendant contended that Taylor was unavailable (Evid. Code, § 240) and that the testimony fell within the \"former testimony\" exception to the hearsay rule (id., § 129, subd. (a)(2)). After an extensive hearing, held on August 3, 1982, the trial court denied the request. It found that counsel had not exercised reasonable diligence in procuring Taylor's attendance at trial, pursuant to Evidence Code section 240, subdivision (a)(5). It also concluded that because the People did not have a similar interest and motive in questioning Taylor at the suppression hearing, the testimony was not admissible under Evidence Code section 1291, subdivision (a)(2).\n\nDefendant contends the trial court erred. The claim is meritless.\n\n1. Evidence Code Section 240\n\nUnder Evidence Code section 240, subdivision (a)(5), a witness is \"unavailable\" if he or she is \"absent from the hearing and the proponent of his or her statement has exercised reasonable diligence but has been unable to procure his or her attendance by the court's process.\"\n\n\"What constitutes due diligence to secure the presence of a witness depends upon the facts of the individual case. (See People v. Cavazos (1944) 25 Cal. 2d 198, 200-201, 153 P.2d 177.) The term is incapable of a mechanical definition. It has been said that the word 'diligence' connotes persevering application, untiring efforts in good earnest, efforts of a substantial character. ( People v. Horn (1964) 225 Cal. App. 2d 1, 5, 36 Cal. Rptr. 898.) The totality of efforts of the proponent to achieve presence of the witness must be considered by the court. Prior decisions have taken into consideration not only the character of the proponent's affirmative efforts but such matters as whether he reasonably believed prior to trial that the witness would appear willingly and therefore did not subpoena him when he was available ( People v. Banks (1966) 242 Cal. App. 2d 373, 377 [51 Cal. Rptr. 398]), whether the search was timely begun, and whether the witness would have been produced if reasonable diligence had been exercised [citation].\" ( People v. Linder (1971) 5 Cal. 3d 342, 346-347, 96 Cal. Rptr. 26, 486 P.2d 1226.)\n\nThis court has not decided the standard of review for a trial court's determination on the issue of reasonable diligence. ( People v. Price (1991) 1 Cal. 4th 324, 424, 821 P.2d 610.) In People v. Jackson (1980) 28 Cal. 3d 264, 312, 168 Cal. Rptr. 603, 618 P.2d 149, we treated due diligence under Evidence Code section 240 as a \"factual question to be determined by the trial court according to the circumstances in each case\" and its ruling \"will not be disturbed unless an abuse of discretion appears.\" We subsequently reexamined the standard of review: \"Properly considered, due diligence in procuring a witness's[ ] attendance appears to be a mixed question of law and fact. . . . In addressing it the court must . . . determine the underlying facts, select the applicable legal standard, and apply the latter to the former. [P] The proper standard for mixed questions appears to be independent review.\" ( People v. Louis (1986) 42 Cal. 3d 969, 984, 232 Cal. Rptr. 110, 728 P.2d 180.) The Courts of Appeal are divided on this issue. (See People v. Robinson (1991) 226 Cal. App. 3d 1581, 1585, 277 Cal. Rptr. 504.)\n\nUnder either standard, defendant fails to carry his burden of establishing that he exercised due diligence. The record reveals the following.\n\nIn December 1981, Taylor was called by the defense as a witness at the suppression hearing. She was not subpoenaed to testify. After the hearing, defense investigator William Robert Stenberg obtained Taylor's home and work addresses and telephone numbers. He did not attempt to contact or subpoena her, however, until about July 10, 1982, during Gilcrest's testimony and several months after the beginning of trial on March 15, 1982. At that time, he telephoned her at work, but learned that she had left her employment in April. He then assigned a process server, Paul Chester Joseph, the task of locating Taylor at her home address. On July 26, 1982, only a few days before the hearing on whether she was \"unavailable,\" Joseph went to her address. A woman there told him that Taylor was not there, but had been in Gary, Indiana for two weeks. He returned on July 27; a man told him that Taylor was not there and that he did not know when she would return. On July 28, the same man repeated that she was not there and he still did not know when she would be back. On August 1, Joseph served a subpoena on the man at the address, requiring that he appear on August 2. On that occasion, the man identified himself as Taylor's husband, Wayn Ellis. Ellis reportedly said he had not seen his wife for two months and did not know where she was living. He also indicated that he would not appear if subpoenaed to do so.\n\nAfter Joseph reported his lack of success, Stenberg also checked the residence several times. On one occasion, an older woman answered the adjacent door and said \"You just missed him,\" but said she did not know Taylor. On July 28, Stenberg talked to Ellis, who said he did not know where Taylor was and \"didn't know anything about Gary, Indiana.\"\n\nUnder these circumstances, based on our independent review, we find that defendant did not conduct a diligent good faith search under Evidence Code section 240, subdivision (a)(5). The defense was well aware, before trial began, of the nature and importance of Gilcrest's testimony. It was also aware of inconsistencies between Gilcrest's testimony at the suppression hearing and Taylor's; as the trial court observed, \"[It] was perfectly obvious by the time that Miss Taylor testified in the suppression hearing that she would controvert the testimony of Gilcrest to some extent.\"\n\nNonetheless, it appears that the defense made no effort whatever to subpoena Taylor until well into the trial, during Gilcrest's testimony, although the defense investigator knew that she \"might not be a totally reliable person long ago\" and defense counsel knew Taylor was \"known to be uncooperative with and basically not wanting to be approached by the defense.\"\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e Even then, belated efforts to locate her were minimal, consisting of a single phone call to her former work number and several visits to her former address. Attempts to obtain information from Ellis or anyone else at the address were perfunctory; no relatives, friends, or coworkers appear to have been contacted. In sum, the record suggests that the defense was insufficiently diligent in attempting to determine from Taylor's husband or anyone else where Taylor might be located.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\n2. Evidence Code Section 1291\n\nEvidence Code section 1291, subdivision (a)(2), provides, in relevant part: \"(a) Evidence of former testimony is not made inadmissible by the hearsay rule if the declarant is unavailable as a witness and [P] . . . [P] the party against whom the former testimony is offered was a party to the action or proceeding in which the testimony was given and had the right and opportunity to cross-examine the declarant with an interest and motive similar to that which he has at the hearing.\" We review the trial court's ruling under an abuse of discretion standard. (See People v. King (1969) 269 Cal. App. 2d 40, 48, 74 Cal. Rptr. 679.)\n\nAt issue in the suppression hearing was whether the police officers who obtained the warrant to arrest defendant relied in good faith on information provided by Gilcrest and Taylor concerning a conspiracy among defendant, Stewart, and Franklin. The People accordingly had little motive to impeach Taylor's veracity: \"The only issue in the eyes of the People at that time was did the police rely upon him [Gilcrest] in an exigent circumstance where time was of the essence and they had to run with what they had. . . . We didn't care if Zola was lying. [P] Did the police have a reason to believe her? That's the only issue, so probable cause would be issued by a magistrate for the search warrant.\" By contrast, at trial, the People would have a strong motive to impeach Taylor. As the trial court observed, they \"might very well want to bring in her own admissions of untruthfulness to attack her testimony.\"\n\nNo abuse appears. The issues at the suppression hearing and at trial were sufficiently distinct that the trial court could reasonably conclude that the People lacked a similar interest and motive to cross-examine Taylor. As it explained: \"The credibility of Gilcrest, as testified to by Taylor at the suppression hearing, was very tangential to my ruling as to the traversal of the search warrant. . . . The tactics of counsel in a suppression hearing or a traversal hearing before a Court where the issues are so different would be far different now than what is presented to this jury. . . . The credibility of Gilcrest was not an issue in the same sense at that hearing as it is in the trial. His credibility was only relevant to whether or not he had so outrageously lied that the police were negligent or worse in relying upon his statement in getting the search warrant.\"\n\nBecause the People did not have an opportunity to cross-examine Taylor with an \"interest and motive similar to\" that which they had at trial, the testimony was properly excluded.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nH. Prosecutorial Misconduct\n\nDefendant contends that the prosecutor engaged in misconduct during guilt phase arguments in summation.\n\n\" 'What is crucial to a claim of prosecutorial misconduct is not the good faith vel non of the prosecutor, but the potential injury to the defendant.' \" ( People v. Clair, supra, 2 Cal. 4th at p. 661.) We review prosecutorial remarks to determine whether there is a \"reasonable likelihood\" that the jury misconstrued or misapplied the prosecutor's remarks. (2 Cal. 4th at p. 663.)\n\n1. Reference to Victims\n\nIn his guilt phase opening argument in summation, the prosecutor observed that he represented the \"cold\" entity \"known as the People of the State of California,\" adding: \"But I again wish to call your attention to the fact that -- that chair I represent also contains the victims, their loved ones.\" Defendant objected, but was overruled. Later, the prosecutor explained to the jury why he was seeking conviction on the nonmurder counts: \"How would you feel if you were one of the survivors, and no one came -.\" Defendant again interposed an unsuccessful objection.\n\nDefendant asserts that the comments constituted misconduct. In People v. Stansbury (1993) 4 Cal. 4th 1017, 846 P.2d 756, we held that the prosecutor improperly appealed to the passions of the jury in urging them to consider the suffering of the victim: \" 'Think what she must have been thinking in her last moments of consciousness during the assault. [P] Think of how she might have begged or pleaded or cried.' \" ( Id., p. 1057, italics in original.) We reiterated the rule that \"an appeal for sympathy for the victim is out of place during an objective determination of guilt\" but found no prejudice. (Ibid.) Similarly in People v. Fields (1993) 35 Cal. 3d 329, 361, 197 Cal. Rptr. 803, 673 P.2d 680, we found misconduct, though no prejudice, when the prosecutor unmistakably appealed to the sympathy of the jury, asking them to \" 'think of yourself as [the victim].' \" In this case, even if the prosecutor's prosecutor's brief and relatively bland references to \"victims, their loved ones\" and \"survivors\" constituted misconduct, it was similarly not prejudicial.\n\n2. Use of Epithet\n\nAlso during his opening argument in summation, the prosecutor referred to defendant as \"the monster that is sitting before us.\" Defendant's objection was overruled. He now claims that use of the epithet constituted misconduct.\n\nA \"prosecutor is allowed to make vigorous arguments and may even use such epithets as are warranted by the evidence, as long as these arguments are not inflammatory and principally aimed at arousing the passion or prejudice of the jury.\" ( People v. Pensinger (1991) 52 Cal. 3d 1210, 1251, 278 Cal. Rptr. 640, 805 P.2d 899.) In this case, even assuming that the reference to defendant as a \"monster\" \"exceeded the bounds of \"vigorous yet fair argument\" ( People v. Sandoval (1992) 4 Cal. 4th 155, 180, 841 P.2d 862), no prejudice is shown, in light of the record as a whole.\n\n3. Griffin Error\n\nDuring rebuttal argument in summation the prosecutor referred to the presence in the defendant's apartment of ammunition and weapons consistent with those used in the robbery. The jury had previously heard testimony that defendant shared a two-bedroom apartment with his father, his father's girlfriend, his own girlfriend, and his sister.\n\nReferring specifically to defense counsel's explanation for the presence of a holster in defendant's father's closet, the prosecutor argued: \"She gets up and argues it could possibly have been a toy gun or a kid could have been using it. . . . And there is no explanation. What I am saying is that if there are certain damning aspects to a case, I would expect that they would be explained away. [P] There's been no explanation as to why he had a 20 gauge sawed-off shotgun.\"\n\nDefendant objected. The following Discussion took place outside the presence of the jury.\n\n\"[Defense Counsel]: He is getting closer and closer to the point where the defendant could only be the person to explain these things.\n\n\"[The Court]: So long as you make it clear the expected testimony could come from somebody else besides the defendant.\n\n\"[Prosecutor]: What was found in the father's closet.\n\n\"[The Court]: Just so it can't be determined from -\n\n\"[Defense Counsel]: Just a second. When he is talking about things that have to do with either the father or the defendant being able to talk about it, I have presented evidence that the father has suffered a stroke which [the prosecutor] knows. And the jury has heard it. [P] So the only way they could interpret these constant references throughout this whole argument is that the defendant hasn't proven this, that the defense hasn't proven that. [P] That the defendant himself has something to hide.\"\n\n\"[Prosecutor]: I will stay off of what was in his closet, but I am not conceding she is correct. [P] I just want to avoid it altogether.\"\n\n\"[The Court]: All right.\"\n\nImmediately thereafter, the prosecutor inexplicably resumed his point before the jury: \"So there's been no explanation as to what the holster was doing in the father's closet, what the seven and half pellets were doing in the father's closet.\" Defendant's objection, on the same ground, was overruled.\n\nDefendant claims that, through these comments, the prosecutor committed misconduct under Griffin v. California (1965) 380 U.S. 609, 14 L. Ed. 2d 106, 85 S. Ct. 1229. \"In Griffin, the United States Supreme Court held that the privilege against self-incrimination of the Fifth Amendment prohibits any comment on a defendant's failure to testify at trial that invites or allows the jury to infer guilt therefrom, whether in the form of an instruction by the court or a remark by the prosecution. [Citation.] The prohibition, however, does not extend to . . . such comment on the defense's failure at trial to introduce evidence that could reasonably have been expected [citation] - save only, of course, the testimony of the defendant himself.\" ( People v. Clair, supra, 2 Cal. 4th at p. 662.)\n\nDefendant's Griffin claim lacks merit.\n\nThe prosecutor referred to the absence of evidence, not to defendant's failure to testify. We are unpersuaded by defendant's argument that only his own testimony could logically have provided the missing evidence about the items found in his father's closet. Other members of the household -- including defendant's sister, his girlfriend, and his father's girlfriend -- shared use of the closets with defendant and his father and might logically have testified concerning the contents of the father's closet and whether the holster found there was used as a child's toy.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e In the context of all the evidence presented, the prosecutor's comment was not reasonably likely to be misconstrued or misapplied by the jury as referring to defendant's own failure to testify.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\n4. Comment About Opposing Counsel\n\nAlso during rebuttal argument in summation, the prosecutor referred to defense counsel's argument and urged: \"But I don't want anyone here to think that somebody can just prance through with a final argument not founded on fact and with phantom issues and hitting and running with phantom issues and hitting and running unsupported by the transcript, steal 13 weeks of a very carefully laid -.\" Defendant interposed an objection. The trial court overruled the objection, remarking: \"Counsel, as I have indicated to both of you, the court permits great latitude to counsel in final argument.\"\n\nDefendant contends that the remarks of the prosecutor constituted misconduct. We are, again, unpersuaded. Contrary to defendant's assertion, the argument did not amount to improper name calling or suggest fabrication of evidence or other misconduct; it did not cross the \"line of acceptable argument, which is traditionally vigorous and therefore accorded wide latitude.\" ( People v. Fierro (1991) 1 Cal. 4th 173, 212, 821 P.2d 1302.)\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nI. Judicial Misconduct\n\nDefendant contends that the trial court engaged in repeated acts of misconduct.\n\n1. Examination of Witnesses\n\nDefendant argues that, on five separate occasions, the trial court improperly elicited evidence favorable to the prosecution.\n\nFirst, during the testimony of Malloy concerning the manager's manual, the trial court asked the witness, \"Did you attempt to follow that memorandum to the best of your ability, when this incident happened\" Malloy answered, \"Yes, I did.\"\n\nSecond, after Gilcrest admitted on direct examination that he had been given immunity at the preliminary hearing, he was asked, \"That means, to your mind, does it not, that you can't be prosecuted for anything that might conceivably implicate you in this case?\" Gilcrest agreed. The trial court, at that point, asked \"Except perjury, right?\" Gilcrest responded, \"Right.\"\n\nThird, police latent fingerprint examiner Donald Keit testified that certain people whose fingerprint cards had been provided to him had been \"eliminated.\" The trial court asked: \"The term 'eliminate' means that you have -- you have a print that you think might belong to a suspect, but then you find it belongs to a police officer, then that print is eliminated.\" After the witness agreed, the trial court asked, \"So you didn't eliminate Defendant Sanders in that sense; you just didn't find any of his prints.\" The witness responded, \"That's correct.\"\n\nFourth, former Sheriff's Deputy Preston Guillory testified that portions of Givens's trial testimony were inconsistent with \"testimony\" she gave in an interview. Specifically, she said at trial that defendant was present when Stewart warned her about the robbery on September 17, 1980; in her interview, however, she told Guillory that no men were present. The trial court questioned Guillory about his use of the word \"testimony\" to describe Givens's statement in the interview: \"You don't mean she testified --\" It also questioned Guillory about his failure to include in his report Givens's remark that there were no men present: \"But you didn't put that in your report? . . . Although she told you that, you say, at the time you interviewed her.\"\n\nFifth, Police Officer Richard Stallcup testified concerning the lineup on December 23, 1980, at which defendant was the only participant who was barefooted. On direct questioning by the prosecution, he testified that the viewers could not see the feet of the participants. Defense counsel objected that Stallcup had no personal knowledge of what the viewers had seen. The trial court questioned the witness as follows:\n\n\"[Court]: Well, you are familiar with the size of the witnesses in this case and the physical layout of the auditorium?\n\n\"[Stallcup]: Yes.\n\n\"[Court]: We are not talking about some hypothetical person eight feet tall. Being familiar with the height of the witnesses in this case and the position of the stage and the chairs, in your opinion could they have seen his feet?\n\n\"[Stallcup]: I don't believe they could have seen his feet.\"\n\nDefendant made no objection in the trial court. He now contends, in substance, that on each of these occasions, the trial court committed prejudicial misconduct by failing to exhibit neutrality and, in effect, commenting on the evidence. As we have held in similar circumstances, \"defendant's failure to object at trial . . . particularly where (as here) such action would have permitted the court to clarify any possible misunderstanding resulting from the comments, bars his claim of error on appeal.\" ( People v. Mitcham (1992) 1 Cal. 4th 1027, 1053, 824 P.2d 1277.) \"The purpose of the rule requiring timely objection is to give the trial court the opportunity to cure any error, if possible, by an admonition to the jury.\" ( People v. Melton (1988) 44 Cal. 3d 713, 735, 244 Cal. Rptr. 867, 750 P.2d 741.)\n\nIn any event, the claim also lacks merit.\n\n\"A California trial court may comment on the evidence, including the credibility of witnesses, so long as its remarks are accurate, temperate, and 'scrupulously fair.' [Citation.] Of course, the court may not express its views on the ultimate issue of guilt or innocence or otherwise 'usurp the jury's exclusive function as the arbiter of questions of fact and the credibility of witnesses.' [Citation.]\" ( People v. Melton, supra, 44 Cal. 3d at p. 735.) Similarly, of course, the trial court may question a witness in order to elicit additional information or clarify confusing testimony.\n\nWe \"evaluate the propriety of judicial comment on a case-by-case basis, noting whether the peculiar content and circumstances of the court's remarks deprived the accused of his right to trial by jury.\" ( People v. Rodriguez (1986) 42 Cal. 3d 730, 770, 230 Cal. Rptr. 667, 726 P.2d 113.) \"The propriety and prejudicial effect of a particular comment are Judged both by its content and by the circumstances in which it was made. [Citation.]\" ( People v. Melton, supra, 44 Cal. 3d at p. 735.)\n\nWe find no misconduct. The trial court's questions were brief, fair, and nonargumentative. They did not suggest a lack of neutrality or unfairly comment on the evidence.\n\n2. Order to Kimble\n\nDefendant's girlfriend, Denise Elaine Kimble, was called to testify during the guilt phase. At one point, while she was waiting in the courtroom to appear as a witness, she arose and started to leave. The reporter's transcript records the following:\n\n\"[Court]: [to the jury] Sorry, ladies and gentlemen. Forget the ring. Go back to the jury room.\n\n\"[Bailiff]: Judge, the witness is leaving.\n\n\"[Prosecutor]: She left. Would you stop her, please.\n\n\"[Court]: Come back here.\n\n\"[Defense Counsel]: The jurors are in the courtroom, your honor.\n\n\"[Clerk]: Please leave.\"\n\nAlthough defendant interposed no contemporaneous objection to the trial court's statement, several days later counsel referred to the incident, which she described as the trial court's shouting \"Arrest that woman,\" and objected that Kimble's \"credibility was sort of destroyed before she ever got on the stand.\" The trial court responded: \"But this is all much to-do about nothing. Everybody knows she is sympathetic to the defendant. And you would expect her to be.\"\n\nDefendant now alleges that the trial court engaged in misconduct by shouting \"Arrest that woman.\"\n\nAgain, as a threshold matter, defendant failed to preserve the points for review by interposing a timely objection. Moreover, his predicate, that the trial court used those words, is unsupported. The transcript recorded at the time of the incident reports that the trial court said \"Come back here.\" There is no basis for concluding that the transcript was inaccurate or incomplete. We find no impropriety in the trial court's ordering Kimble, a witness, to come back into the courtroom. No misconduct appears.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nJ. Instructional Errors\n\nDefendant claims instructional error, including incomplete, incorrect, and omitted instructions.\n\n1. Accomplice Instructions\n\nThe trial court gave numerous instructions concerning accomplice testimony. Defendant contends, however, that the instructions were incomplete and misleading for several reasons. He argues that the instructions expressly applied only to Andre Gilcrest and not to Carletha Stewart, although she, too, was also an accomplice as a matter of law. In addition, he urges that the trial court failed to meet a sua sponte duty to give two additional instructions, i.e., that Stewart was an accomplice as a matter of law, and that one accomplice may not corroborate another.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nAs a threshold matter, although the trial court informed the parties in advance which accomplice instructions it intended to give, defendant did not request that the trial court modify the instructions given or deliver the \"omitted\" instructions, nor did he make an assignment of error in the trial court. Ordinarily, \"[a] party may not complain on appeal that an instruction correct in law and responsive to the evidence was too general or incomplete unless the party has requested appropriate clarifying or amplifying language.\" ( People v. Lang (1989) 49 Cal. 3d 991, 1024, 264 Cal. Rptr. 386, 782 P.2d 627.)\n\nIn any event, no error appears.\n\nFirst, although in the first accomplice instruction given, on the burden of proving a corroborating witness is an accomplice, the trial court mentioned Gilcrest as an accomplice, none of the remaining instructions either referred to him or was limited to any particular alleged accomplice.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e Thus, the definition of accomplice was given in general terms, as follows: \"An accomplice is one who is subject to prosecution for the identical offense charged against the defendant on trial, conspiracy to commit robbery. [P] To be an accomplice, the person must have aided, promoted, encouraged or instigated by act or advice the commission of such offense with knowledge of the unlawful purpose of the person who committed the offense or was a co-conspirator, as that crime will be defined for you.\" (Italics added.) The trial court subsequently instructed the jury that Stewart was charged as defendant's coconspirator, and was alleged to have committed numerous specific overt acts \"for the purpose of furthering the object of the conspiracy.\"\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e We are not persuaded that there is a reasonable likelihood that, taken as a whole, the instructions were misunderstood to apply to Gilcrest alone.\n\nThe trial court also instructed: \"A defendant cannot be found guilty based upon the testimony of an accomplice unless such testimony is corroborated by other evidence which tends to connect such defendant with the commission of the offense. [P] To corroborate the testimony of an accomplice, there must be evidence of some act or fact related to the offense, which, if believed by itself and without any aid, interpretation or direction from the testimony of the accomplice, tends to connect the defendant with the commission of the offense charged. . . . [P] In determining whether an accomplice has been corroborated, you must first assume the testimony of the accomplice has been removed from the case.\" These instructions, as defendant concedes, correctly stated the law. The trial court had no sua sponte duty to instruct, in addition, that Stewart was an accomplice as a matter of law. Nor did the trial court have a sua sponte duty to instruct that one accomplice may not corroborate another.\n\nMoreover, failure to instruct on accomplice testimony pursuant to Penal Code section 1111 is harmless where there is sufficient corroborating evidence in the record. ( People v. Miranda (1987) 44 Cal. 3d 57, 100, 241 Cal. Rptr. 594, 744 P.2d 1127.) \"Such evidence 'may be slight and entitled to little consideration when standing alone.' [Citations.] . . . It is only required that the evidence ' \" 'tends to connect the defendant with the commission of the crime in such a way as may reasonably satisfy the jury that the [accomplice] is telling the truth.' \" ' \" (Ibid.) As previously discussed, there was here substantial direct and circumstantial evidence apart from statements by Gilcrest and Stewart linking defendant to the crimes, including the testimony of several eyewitnesses. Any error was therefore nonprejudicial.\n\n2. Instruction Regarding Unnamed Perpetrators\n\nThe trial court instructed the jury as follows. \"There has been evidence in this case indicating that a person or persons other than defendant were or may have been involved in the crimes for which the defendant is on trial. [P] You must not discuss or give any consideration as to why the other person or persons are not being prosecuted in this trial or whether they have been or will be prosecuted.\"\n\nDefendant contends that the instruction, as applied to Gilcrest, conflicted with the instruction, also given, that accomplice testimony must be viewed with distrust. Specifically, he argues that it improperly suggested that the jury could neither consider why Gilcrest was not being prosecuted along with defendant nor evaluate his testimony in light of the grant of immunity.\n\nThe claim is unpersuasive. \"It is settled that 'we must look to the entire charge, rather than merely one part, to determine whether error occurred.' \" ( People v. Williams (1988) 45 Cal. 3d 1268, 1313, 248 Cal. Rptr. 834, 756 P.2d 221.) After review, we do not agree that giving these instructions together amounted to error in this case. The instruction not to \"discuss or give any consideration as to why the other person or persons are not being prosecuted in this trial or whether they have been or will be prosecuted\" was not likely to mislead. As in the similar circumstances in Williams, we conclude that \"a reasonable juror would continue to act in accordance with the court's charge on accomplice testimony, but would simply refrain from discussing or giving any consideration to the separate issue why [the accomplice] was not being prosecuted in the present action or whether he had been or would be prosecuted . . . .\" (Ibid.)\n\n3. Instructions Regarding Oral Admissions\n\nLankford testified for the prosecution at trial, and his pretrial statements to the police were admitted into evidence. In the pretrial statements, he told the police that before the Bob's Big Boy robbery, he was approached by defendant about robbing the restaurant. According to the statement, he also saw the stock of a shotgun and some shotgun shells in the trunk of defendant's car. At trial, he recanted this testimony, stating that the information in his statement to the police was not based on any personal knowledge.\n\nWith regard to Lankford's pretrial statements, defendant contends that the trial court erred in failing, sua sponte, to instruct the jury that evidence of oral admissions by the defendant should be viewed with caution.\n\nThe claim is meritless. The trial court did so. It instructed as follows: \"Now, this next instruction has reference to the alleged conversation between the defendant and Witness Bruce Woods in a sheriff's vehicle. [P] If you find that a defendant attempted to suppress evidence against himself in any manner such as by the intimidation of a witness, such attempts may be considered by you as a circumstance tending to show a consciousness of guilt. [P] However, such evidence is not sufficient in itself to prove guilt and its weight and significance, if any, are matters for your consideration. [P] Evidence of an oral statement of a defendant should be received with caution. [P] Certain evidence was admitted for a limited purpose. At the time this evidence was admitted you were admonished that it could not be considered by you for any purpose other than the limited purpose for which it was admitted.\" (Italics added.)\n\nDefendant contends that because of its context, the jury would have understood the instruction to apply only to Woods's testimony. He is unpersuasive. No such limitation was expressed or reasonably inferable. There is no reasonable likelihood that jurors would so have understood the instruction, which referred generally to \"an oral statement of a defendant.\"\n\nIn any event, any possible confusion was nonprejudicial. The trial court gave numerous cautionary instructions applicable to Lankford's testimony, including instructions that the jury could consider prior inconsistent statements and prior conviction of a felony. It also gave a special instruction concerning Lankford's testimony.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e In light of the instructions as a whole, the jury was adequately alerted to view his testimony regarding defendant's statements with caution. A more favorable result was therefore not reasonably probable.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nK. Cumulative Error\n\nDefendant asserts that, when considered together, errors committed at the guilt phase of the trial require reversal. In substance, he argues that the cumulative effect of the errors resulted in an unfair trial, in violation of the Sixth, Eighth, and Fourteenth Amendments to the United States Constitution and article I, sections 7 and 15 of the California Constitution. As shown, there were few errors, none of which was prejudicial. They did not, either singly or together, result in any substantial detriment to the fairness or reliability of the guilt trial.\n\nIII. SPECIAL CIRCUMSTANCE ISSUE\n\nDefendant raises a single claim concerning the special circumstance finding. As will appear, it is meritorious.\n\nDefendant was charged with four multiple murder special circumstances. Each was found to be true. He contends that three of the multiple-murder findings must be vacated as duplicative. We agree, and do so. ( People v. Hardy, supra, 2 Cal. 4th 86, 191.)\n\nIV. PENALTY ISSUES\n\nDefendant raises a number of claims attacking the judgment as to penalty. As will appear, none is meritorious.\n\nA. Death Qualification Voir Dire\n\nDuring voir dire of prospective juror Clifford Wong, defense counsel argued that she was entitled to question jurors about their \"real feelings about both penalties.\" After extensive argument concerning the permissible range of questioning, the trial court agreed to permit defense counsel to \"ask your questions for a while and see where you are going and see what you attempt to do.\"\n\nDefense counsel posed a hypothetical question to prospective juror Wong as follows. \"Two men go into a restaurant in the early morning hours. They herd 11 people, two customers and nine employees, to the back area of the restaurant. The two men are armed with shotguns. They rob all the people and make them lie on the floor and they rob them all. They put them all in a freezer. The people obey all the orders and instructions that the two men give them. They do not fight with them or protest. They are told to get on their knees and face the walls. They do that. No one says anything. And the two men open fire, as you put it, with their shotguns. And they go on firing even though one of the victims begs for her life. They do not stop firing until they run out of ammunition. They pick up the casings that their guns have expended. They leave everybody in this darkened freezer where people are dying and people are moaning. [P] Now, if those are the facts that you are presented with at the penalty phase, you understand you are entitled to rely on those facts as one of the circumstances in deciding a penalty, do you not?\" Defense counsel was also permitted to ask: \"Now, don't you believe that that's precisely the kind of case where with your ideas of Justice, the death penalty is the only appropriate kind of penalty?\" She then asked if various hypothetical aggravating and mitigating factors -- such as the defendant's criminal record, age, and background -- would make a difference to the juror.\n\nThe trial court observed: \"Well, I want the record to be very clear that you have asked him hypothetically only a few of the factors that may arise in aggravation and in mitigation. . . . You gave him hypothetically a very grim picture. And then on the other side you only hypothesized his age, his family background and possible use of drugs. And you ignored most of the other factors which contain a potential for mitigation.\" It subsequently ruled as follows. \"I will not permit any hypothetical facts to be presented to jurors concerning the case; any questions that they are asked about their ability to vote for either penalty must be confined to the face of the information that they have been read, where the defendant is charged with a certain number of robberies and murders and special circumstances.\" It explained, \"I am not going to let you tell them a horror story about what the most aggravating factor is and then give them almost nothing by way of mitigating factors and then ask them what penalty they are going to impose. I don't think it is a proper inquiry.\"\n\nThe trial court also denied a subsequent motion by defendant to permit use of hypothetical questions. At the time the jury was accepted, defendant did not object to the composition of the jury and had seven remaining peremptory challenges.\n\nDefendant contends that the trial court erred in restricting the questions on voir dire and denying counsel permission to use case-specific hypotheticals as a means of exploring possible challenges for cause and peremptory challenges.\n\nThe claim is lacking in merit. Defendant was not precluded from attempting to show in voir dire that a juror harbored any specific bias that would cause him to vote for the death penalty without regard to mitigating evidence and thus should be excused for cause.\n\n\"The scope of questions to be asked at voir dire is a matter for the trial court's discretion. . . . Certainly, we have cautioned that the trial court may limit voir dire couched in terms of the facts expected to be proved, in order to avoid the danger of indoctrinating the jury on a particular view of the facts. . . .\" ( People v. Pinholster (1992) 1 Cal. 4th 865, 915, 824 P.2d 571.)\n\nIn People v. Mason (1991) 52 Cal. 3d 909, 277 Cal. Rptr. 166, 802 P.2d 950, we found no abuse of discretion by the trial court in denying defendant's request to summarize the facts of the prosecution case and to ask each juror based on the summary whether he or she would automatically vote for death. \"The proposed question, as presented to the court, was almost certain to accomplish two of the evils against which we [have] warned . . . ' \"educating the jury panel to the particular facts of the case [and] compelling the jurors to commit themselves to vote a particular way. . . . \" ' . . . It is not a proper object of voir dire to obtain a juror's advisory opinion based on a preview of the evidence. Many persons whose general neutrality toward capital punishment qualifies them to sit as jurors might, if presented with the gruesome details of a multiple-murder case, conclude that they would likely, if not automatically, vote for death.\" ( Id. at p. 940.) As in Mason, we conclude that the trial court properly exercised its discretion to disallow the proposed hypothetical questions.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\n\nB. Discharging of Juror Bateman\n\nShortly after the jury rendered the guilt verdicts, Juror Patricia Bateman collapsed and required emergency medical treatment from paramedics. This was the second time that she had collapsed. Over the objection of defendant, on the ground that she had \"some emotional commitment to the case,\" the trial court discharged her from the jury and replaced her with an alternate juror.\n\nThe trial court explained its ruling as follows: \"For the record, at an earlier point in this trial Mrs. Bateman became ill, became unconscious. The juror even stopped breathing and was resuscitated by the clerk. [P] The paramedics were called. She was evacuated to Queen of Angels Hospital. [P] The court made the determination at that time that she would be able to continue on the case, and in a very admirable fashion she has done so. [P] The court is advised that Mrs. Bateman does suffer from high blood pressure, and under situations of stress can and does become ill. . . . [P] The Court was informed and observed that Mrs. Bateman did collapse again while back in the jury room. She appeared to be in much the same condition as the first time, except that she was still breathing. [P] She was brightly flushed red. She was breathing rather laboriously. Her eyes had a rather fixed and glazed look. [P] The paramedics were then called, and they have determined that she does not require hospitalization at this time but have informed the Court that her condition is due to the high blood pressure and the pressure that's inherent in this long and arduous trial. [P] The Court has made a determination that the service as a juror does not extend to actually having to give one's life or one's health for the matter.\" Defendant did not challenge the competence or impartiality of the alternate juror who was substituted for Juror Bateman.\n\nDefendant claims error, arguing that the decision to discharge Juror Bateman lacked any factual support in the record. The claim is meritless.\n\n\"[Former Penal Code section] 1123 gives the trial court the authority to discharge a juror 'found to be unable to perform his duty.' . . . Section 1123 sets forth no procedure to determine whether a juror is unable to perform his duty. However, California cases construing these statutes have established that, once a juror's competence is called into question, a hearing to determine the facts is clearly contemplated. . . . Failure to conduct a hearing sufficient to determine whether good cause to discharge the juror exists is an abuse of discretion subject to appellate review. . . . [P] . . . [P] 'A \"good cause\" determination in this context is one calling for the exercise of the court's discretion [citations], and if there is any substantial evidence supporting the decision, it will be upheld on appeal. [Citation.]' \" ( People v. Burgener (1986) 41 Cal. 3d 505, 519-520, 224 Cal. Rptr. 112, 714 P.2d 1251, fn. omitted.)\n\nThe trial court personally observed the fact that Juror Bateman collapsed on two occasions during trial proceedings, requiring emergency medical treatment: \"I find as a fact the lady is flat on her back in the jury room for the second time during this trial, and I find as a fact that she is physically unable to continue with the trial. . . . As I told you the first time it happened, she stopped breathing, we had -- I had to rush next door, and I had to actually pull a psychiatrist, literally pull a psychiatrist off the stand who was testifying in another case and rush him into the jury room to attend to Mrs. Bateman. [P] I was frankly afraid at that time she might die. She had stopped breathing and the clerk resuscitated her with mouth-to-mouth resuscitation. [P] I thought at that time it might be a one time thing, but now it's happened again, and I see it's directly related to the stress of the trial.\" The trial court's own observations were corroborated by paramedics, who informed the trial court that Juror Bateman suffered from severe high blood pressure caused by the stress of the trial.\n\nOn this record, we find no abuse of discretion. There is substantial evidence supporting the trial court's finding that Juror Bateman was sick and unable to perform her duty as a juror.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\n\nC. Evidence of Prior Felony\n\nAt the penalty phase, defendant stipulated that he had committed second degree burglary in February 1977 and was sentenced to prison for the offense. The People sought to introduce evidence of the circumstances of the burglary to prove other criminal activity involving \"the use or attempted use of force or violence or which involved the express or implied threat to use force or violence,\" pursuant to Penal Code section 190.3.\n\nAt a hearing under Evidence Code section 402, the People made an offer of proof outside the presence of the jury concerning the circumstances of the burglary, including testimony by the victim, Dr. Donald Lawrence Cray. Defendant objected to the use of the Orange County incident, on the grounds that a charge of assault with a deadly weapon had been dismissed in pretrial proceedings and that the evidence was unreliable and unduly prejudicial. The trial court overruled both objections.\n\nAs will be recalled, Dr. Cray testified that when he returned home on the morning of February 28, 1977, he confronted defendant and another man as they were entering a car in his driveway. The driver said, \"Shoot him\" and defendant positioned a rifle at him. When he returned to his house, he found a pile of belongings in the middle of his den and two missing guns.\n\nDuring cross-examination, defense counsel attempted to ask Dr. Cray if he was present at the preliminary hearing when the municipal court dismissed certain charges. The trial court sustained the prosecutor's objection on relevance grounds, concluding: \"Rulings of the magistrate at the preliminary hearing are irrelevant to this case.\"\n\nDefendant makes numerous claims of error, all unavailing.\n\nFirst, defendant contends that the trial court erred in accepting his stipulation to the prior offense of burglary without obtaining an express personal waiver of his constitutional rights. As defendant acknowledges, we have repeatedly rejected the point as lacking in merit. (See, e.g., People v. Lang, supra, 49 Cal. 3d 991, 1038; People v. Ramirez (1990) 50 Cal. 3d 1158, 1184, 270 Cal. Rptr. 286, 791 P.2d 965.) We reject it here as well.\n\nNext, defendant asserts that the trial court erroneously admitted evidence of brandishing because there was insufficient evidence of the elements of the crime as a matter of law. He is unpersuasive.\n\n\"When the prosecution seeks to introduce evidence of other criminal activity in the penalty phase of trial, it may be advisable for the trial court to conduct a preliminary inquiry (out of the presence of the jury) to determine whether there is 'substantial evidence to prove each element of the other criminal activity.' [Citation.] Such a procedure is strictly a matter of trial court discretion.\" ( People v. Fauber, supra, 2 Cal. 4th at p. 849.) The trial court did so here. Its Conclusion that the evidence of brandishing was admissible was not error.\n\nThe crime of brandishing consists of drawing or exhibiting, in the presence of another person, any firearm, whether loaded or unloaded, in a rude, angry or threatening manner. (Pen. Code, § 417, subd. (a).) The weapon need not have been pointed directly at a victim. ( People v. Mercer (1980) 113 Cal. App. 3d 803, 806, 169 Cal. Rptr. 897.) The elements of the crime include drawing or exhibiting a firearm, loaded or unloaded, in a \"rude, angry, or threatening manner.\" (Pen. Code, § 417, subd. (a)(1).) Dr. Cray's account of the incident, in which he testified that defendant wielded a rifle in a threatening manner, constituted substantial evidence on the elements of a brandishing offense.\n\nNor did the trial court err in overruling defendant's objection under Evidence Code section 352. \" 'The short answer to this claim is that the evidence is expressly made admissible by [Penal Code] section 190.3 The court is not given discretion under Evidence Code section 352, to exclude this evidence when offered at the penalty phase where . . . the question for the jury is not one of fact in determining guilt. . . . ' \" ( People v. Zapien, supra, 4 Cal. 4th at p. 987.)\n\nDefendant also contends that in admitting the evidence of brandishing, the trial court violated \"double jeopardy principles\" because charges of assault with a deadly weapon were dismissed before the burglary trial. He raises the claim for the first time on appeal; he may not do so. ( People v. Zapien, supra, 4 Cal. 4th at p. 987.) It is also without merit. We have repeatedly rejected similar claims, concluding that principles of double jeopardy do not apply. (See, e.g., People v. Medina (1990) 51 Cal. 3d 870, 907, 274 Cal. Rptr. 849, 799 P.2d 1282; People v. Fierro, supra, 1 Cal. 4th 173, 231; People v. Taylor (1990) 52 Cal. 3d 719, 743, 276 Cal. Rptr. 391, 801 P.2d 1142, People v. Heishman (1988) 45 Cal. 3d 147, 193, 246 Cal. Rptr. 673, 753 P.2d 629.) We do so again here.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\nFinally, defendant contends that it was error to permit the People to introduce evidence of the circumstances in the Orange County incident involving nonviolent conduct, including the theft of two rifles belonging to Dr. Cray, the stacking of property in the den of his home, and the implication that defendant and his partner entered the home through the back door after parking in the driveway.\n\nThe point was not preserved for review by a timely objection below. At trial, defendant objected only to the prosecutor's question to Dr. Cray about the pile of personal property in his den. He may not raise additional objections for the first time here. ( People v. Visciotti (1992) 2 Cal. 4th 1, 71, 825 P.2d 388.) In any event, the evidence was properly admitted. \"All crimes committed during a continuous course of criminal activity which includes force or violence may be considered in aggravation even if some portions thereof, in isolation, may be nonviolent.\" ( People v. Cooper (1991) 53 Cal. 3d 771, 841, 281 Cal. Rptr. 90, 809 P.2d 865; People v. Ashmus, supra, 54 Cal. 3d at p. 985.) The evidence at issue concerned the same course of criminal conduct that included the brandishing offense.\n\nD. Testimony of Defense Witnesses in Mitigation\n\nDefendant contends that, in connection with testimony by defense witnesses in mitigation, the trial court erred in excluding certain mitigating evidence and in permitting the prosecution to elicit improper aggravating evidence.\n\n1. Testimony of Lisa Gina Sanders\n\nDefendant called his sister Lisa Gina Sanders at the penalty phase. During her testimony, she testified as follows. \"Q: You understand that as of right now, your brother is going to be in prison the rest of his life? [P] A : Yes. [P] Q: Do you love your brother? [P] A: Yes. [P] Q: Would it mean something to you for him to be alive, even if he's locked in prison for the rest of his life? [P] A: Yes, it does. [P] Q: What would it mean to you?\" The trial court did not permit her to answer the question, stating: \"I don't want the defense to offer opinions, nor would I permit the prosecution to present witnesses with opinions as to what penalty should be imposed.\" She then testified that \"It's always a pleasure -- it's a pleasure to know I can go and see him and know that he's alive and he's there.\"\n\nDefense counsel sought permission to ask questions about stigma to the family that would result from an execution: \"I think I should be permitted to indicate, because I think I'd be permitted to argue, that there's a social cost to the death penalty above and beyond killing the defendant, and that is the impact on his family, not just in grief, but in stigma.\" The trial court denied the request: \"No, I'm not going to permit that. [P] It's quite obvious she wants her brother to continue to live, that she loves him, and I think you can fit that in into one of the aggravating or mitigating factors somewhere, you can put that as part of your argument. . . . I'm not going to permit the defendant's family to express an opinion as to the penalty for the defendant. [P] It's quite obvious what their preference is. It doesn't need to be said. [P] You can argue this is a social stigma.\"\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nDefendant contends that the trial court erred; he should have been permitted to ask whether his sister believed that death was an appropriate sentence and about the stigma to her family that would result from a death verdict. We find no error.\n\nDefendant argues, in substance, that the trial court should have allowed the question because it was relevant to exemplify the feelings held toward him by his sister. His predicate is unsound. The trial court did not bar the evidence on the basis that it was irrelevant, but as duplicative and unduly prejudicial. We find no abuse of discretion. From her testimony it could be readily inferred that Lisa did not want her brother to be given a death sentence. The trial court could reasonably conclude that additional examination on this matter would be duplicative.\n\nThe trial court also did not err in excluding testimony about possible stigma to the family of a defendant sentenced to death. Such testimony would not exemplify feelings toward the defendant and neither \"bears on his overall character and humanity\" nor serves to humanize him for the jury. (See People v. Mickle (1991) 54 Cal. 3d 140, 194, 284 Cal. Rptr. 511, 814 P.2d 290.)\n\nDefendant relies on Skipper v. South Carolina (1986) 476 U.S. 1, 4, 90 L. Ed. 2d 1, 106 S. Ct. 1669, which held that \" ' \"the sentencer . . . not be precluded from considering as a mitigating factor, any aspect of a defendant's character or record and any of the circumstances of the offense that the defendant proffers as a basis for a sentence less than death.\" ' \" He also cites Payne v. Tennessee (1991) 501 U.S. 808, 115 L. Ed. 2d 720, 111 S. Ct. 2597, for the proposition that \"if victim-impact evidence is relevant to the jury's sentencing choice, the impact of the defendant's execution on his family is equally pertinent and admissible.\"\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\n\nThe cases are inapposite. In Skipper, the court referred to evidence concerning a \" ' \"defendant's character or record and any of the circumstances of the offense.\" ' \" ( Skipper v. South Carolina, supra, 476 U.S. at p. 4.) Similarly, Payne: \"Under the aegis of the Eighth Amendment, we have given the broadest latitude to the defendant to introduce relevant mitigating evidence reflecting on his individual personality . . . .\" ( Payne v. Tennessee, supra, 501 U.S. at p. 826-827.) The specific questions whether family members would prefer that defendant not be executed or believe that a death sentence will stigmatize them are not, however, strictly relevant to the defendant's character, record, or individual personality. Moreover, while the impact on the victim's family is arguably relevant to show the specific harm caused by the crime and the blameworthiness of the defendant -- factors the United States Supreme Court has found relevant to the appropriate punishment -- the impact on the defendant's family is not comparably relevant to mitigate the specific harm of the crime or its blameworthiness.\n\n2. Testimony of Madison\n\nShirley Madison, a neighbor who became acquainted with defendant after his mother died, testified at the penalty phase about his childhood. She recounted that he grew up on welfare in a small, dirty, and cluttered house. The children were not kept clean or well groomed and defendant's father did not impose effective discipline. Eventually, defendant came to live with her. He was polite, generous, and loving, showing no bitterness toward his father. Madison had \"no trouble with him at all.\" He was excited about the birth of his son and bought clothes and toys in anticipation. After the birth, he was gentle but firm with his son.\n\nOn cross-examination the prosecutor asked Madison about a causal connection between defendant's background and his crimes: \"You did not form the opinion, did you, that this was a person who was so socially and intellectually deprived and stifled because of his background that he did not, or could not know that it was wrong to murder.\" Defendant objected to the line of questions on the ground that it involved \"a matter of argument\" and called for opinion. The trial court overruled the objection and Madison answered: \"I think his background had a hell of a lot to do with it. . . . I do. I feel that being of that type of background, being of that type of setting would have a burden on anybody's heart. That's what I meant.\" The prosecutor then asked whether any of her friends and associates from modest or deprived backgrounds \"ended up in a situation that Sanders is in now?\" She answered, \"No.\"\n\nThe prosecutor also asked Madison how defendant acquired the money to buy gifts for his family members, eliciting testimony that she did not know where he obtained the money to buy such items. Defense counsel objected on the ground that the prosecutor was \"getting dangerously close to eliciting from this witness that Ricky was incarcerated for things other than what is properly before the jury. [P] I think his nosing around long enough might bring out something improper.\" The trial court instructed the prosecutor, however, \"not to go into any prior offenses without my previous permission.\" Subsequently, after reviewing the transcript of the direct examination, it told the prosecutor \"I think that you shouldn't -- should not pick around in areas that might get into prejudicial matters with this witness. . . . I'm referring to the troubles he might have gotten into that the jury might not be aware of.\"\n\nDefendant contends that the trial court erroneously permitted cross-examination outside the scope of direct examination. The point was sufficiently preserved by counsel's contemporaneous objections. We review the trial court's rulings for abuse of discretion.\n\nNo error appears. Madison testified at length on direct examination concerning defendant's childhood background and his behavior as an adult toward his child. It was not beyond the scope of that examination to question her concerning the effect of his childhood experience on his subsequent character and behavior. Similarly, she testified on direct examination concerning defendant's generosity, including gifts for his child and others. During cross-examination, although defendant objected that the prosecutor's questions were \"getting dangerously close\" to eliciting testimony about prior offenses, the People did not imply that he obtained money through criminal activity or elicit testimony concerning the nature of such activity. Indeed, the trial court expressly and repeatedly instructed the prosecutor not to do so without its permission.\n\nIn any event, defendant fails to show prejudice. Madison testified in general terms to the connection between defendant's background and his current situation, opining that \"that type of background . . . would have a burden on anybody's heart.\" The testimony constituted, if anything, a sympathetic view of defendant as a victim of unhappy childhood circumstances. Nor is there a reasonable possibility that a more favorable outcome would have resulted absent her concession on further cross-examination that she did not know where defendant acquired the money to pay for items for himself or his family.\n\n3. Testimony of Dr. Maloney\n\nDr. Maloney, a clinical psychologist, testified for the defense concerning defendant's school record, charting the decline in his academic performance and conduct after his mother's death, its improvement while he was in foster care, and its deterioration when he returned to his father's custody.\n\nOn cross-examination, the prosecutor was permitted to elicit the following testimony. \"Q: My question to you again is when he does go home you don't know, from what you have before you, the exact causes as to why the defendant's performance in school goes downhill; isn't that correct? [P] A: I have some ideas. I could not say for certain. . . . [P] Q: There's nothing to indicate though that he's battered or beaten or anything like that at home. [P] A: Not physically. [P] Q: Or ever was. [P] A: That's correct.\"\n\nDefendant contends that the subject of physical abuse was outside the scope of direct examination and was improper aggravating evidence. No error appears. Dr. Maloney's testimony linked his performance at school to the negative effects of living with his father. Cross-examination concerning the basis for the expert's opinion, including the nature of the harm to defendant caused by his father, was within the scope of the direct examination. In any event, there is no conceivable prejudice from clarifying the implication of the expert that defendant suffered some form of abuse.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\n\nE. Prosecutorial Misconduct\n\nDefendant claims separate instances of prosecutorial misconduct in his summation.\n\n1. Comments About Victims\n\nIn his summation, the prosecutor referred several times to the impact of the murders on the victims' family members. For example, he warned against a \"psychological mindset\" in which, because it would be painful to consider \"what the consequences are to the husbands, the wives, the mothers and fathers of the victims, and the survivors themselves with their pain and suffering, . . . you tend to shut it out and turn it into an abstraction.\" He noted that although there was mitigating evidence offered by defendant's family members \"you hear nothing about the victims or the other side of the case.\" Referring to the parents of one of the victims, he urged that \"an exercise of mercy on [defendant's] behalf . . . would be a slap in the face and a kick in the buttocks to Burrell's mother and father.\" He also referred to the \"unbearable grief that is lived daily by the brothers, sisters, parents, loved ones, friends, associates, all who loved the four deceased on that particular night.\" Defendant's objections to some of the statements, which were made without stated grounds, were overruled.\n\nDefendant contends that these and similar comments bearing on the emotional impact of the crime on the victims' families constituted misconduct, in violation of Penal Code section 190.3 and the due process clause of the Fourteenth Amendment.\n\nDefendant did not preserve his claim for review by a timely and specific assignment of misconduct and request for admonition. Although counsel made general objections to some of the comments by the prosecutor, she failed to articulate any specific grounds for the objection or to request any corrective instructions. Moreover, we cannot conclude than any harm threatened by the comments could not have been cured by a timely admonition. (See People v. Ashmus, supra, 54 Cal. 3d at p. 989.)\n\nThe point is doubtful on the merits.\n\nIn Payne v. Tennessee, supra, 501 U.S. 808, the United States Supreme Court held that the Eighth Amendment erects no per se bar to the admission of evidence about the impact of murder on the victim's family. \"A State may legitimately conclude that evidence about the victim and about the impact of the murder on the victim's family is relevant to the jury's decision as to whether or not the death penalty should be imposed. There is no reason to treat such evidence differently than other relevant evidence is treated.\" ( Id. at pp. 827.)\n\nShortly thereafter, we held that Penal Code section 190.3 \"allows evidence and argument on the specific harm caused by the defendant, including the impact on the family of the victim. This holding only encompasses evidence that logically shows the harm caused by the defendant. . . . [P] Our holding also does not mean there are no limits on emotional evidence and argument. . . . 'The jury must face its obligation soberly and rationally, and should not be given the impression that emotion may reign over reason. [Citation.] In each case, therefore, the trial court must strike a careful balance between the probative and the prejudicial. [Citations.] On the one hand, it should allow evidence and argument on emotional though relevant subjects that could provide legitimate reasons to sway the jury to show mercy or to impose the ultimate sanction. On the other hand, irrelevant information or inflammatory rhetoric that diverts the jury's attention from its proper role or invites an irrational, purely subjective response should be curtailed.' \" ( People v. Edwards (1991) 54 Cal. 3d 787, 835-836, 819 P.2d 436.)\n\nWe therefore \"examine the prosecutor's argument to determine if it called upon irrelevant facts, or led the jury to be overcome by emotion.\" ( People v. Raley (1992) 2 Cal. 4th 870, 916, 830 P.2d 712.) Here, although we do not condone the prosecutor's references to the victims, they were not so inflammatory as to divert the jury's attention from its proper role or invite an irrational response. Although the prosecutor referred several times to the victims' families, his remarks, for the most part, concerned the absence of testimony from family members and friends of the victims. Indeed, no evidence, as such, was presented. His references to the suffering of family members were generalized and consisted of obvious truisms to the effect that they were aggrieved. We cannot conclude that the prosecutor's remarks constituted misconduct or so infected the sentencing proceeding as to render it fundamentally unfair under the due process clause of the federal Constitution.\n\nDefendant also claims prosecutorial misconduct on the ground that the comments were based on matters outside the record, not part of the circumstances of the crime, and involved facts about the victims unknown to defendant at the time of the crimes. He did not object on that basis in the trial court, although any harm could have been cured by an admonition. ( People v. Raley, supra, 2 Cal. 4th at p. 917.) He may not do so here. In any event, we find no misconduct. The prosecutor did not refer to \"facts\" about the victims outside the record or unknown to defendant; he merely referred generally to the predictable and obvious consequences to the victims' families and friends.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\n\n2. Appeals to Jury's Emotions\n\nDuring the penalty phase argument, the prosecutor distinguished between the \"safe killer,\" who kills during an emotional outburst, and a \"random killer\" like defendant who is \"no different than a foreign enemy seeking to destroy and take over a society as an urban guerrilla acting on his own contrary to all the norms and morays [sic] of society.\" Later, he compared the family relations described by defendant's family to \"the warmth of the family relationships\" in the film The Godfather: \"and yet when those men left after caring for those people in that house by day, and left the threshold of their houses at those times, blood spilled in the streets of New York and Chicago like wine from a spigot.\" In final closing argument, the prosecutor argued: \"This man subjugated a city. . . . A man like him makes us all prisoners in our own cities. . . . You're afraid to walk the streets at night, you're afraid to leave your house at certain hours, you lock your doors.\"\n\nDefendant also claims that the prosecutor improperly played on the jurors' emotions, specifically, their fear of crime.\n\nAs a threshold matter, defendant failed to make a timely and specific assignment of misconduct and request for admonition. (See People v. Ashmus, supra, 54 Cal. 3d at p. 989.) The point has not been preserved for review.\n\nIn any event, however, we find no misconduct. In light of the nature of defendant's crimes, the prosecutor's references to \"random\" killing were a fair and legitimate comment on the evidence. Nor were the prosecutor's allusions to The Godfather, or, more generally, to the fears aroused by urban violence, unduly inflammatory. \"The prosecutor's appeal, to be sure, was largely aimed at the emotions of the jury, but at the penalty phase . . . considerable leeway is given for emotional appeal so long as it relates to relevant considerations.\" ( People v. Bittaker (1989) 48 Cal. 3d 1046, 1110, fn. 35, 259 Cal. Rptr. 630, 774 P.2d 659.)\n\n3. Misstatements of Law\n\nDuring his summation, discussing the difference between a \"random\" killer and a \"safe\" killer, the prosecutor posited a husband who kills his wife's lover in a fit of rage: \"It's emotional. It's a type of situation that we can all say, there but for the grace of God go I. [P] I commiserate for the man, but he violated the laws of society. It is not a sanction, it can't be sanctioned that you would never put such a man to death. [P] I can't conceive of it. I can't conceive of a prosecutor arguing for it.\" Defense counsel objected that \"that case wouldn't be subject to death.\" Although the trial court overruled the objection, the prosecutor clarified his argument: \"Of course it would be if the man caught and tortured the paramour, tortured him, did things of that sort. That would fall under a particular category.\"\n\nDefendant contends that the prosecutor misstated the law at several points during his closing argument. He did not preserve the claim for review by making a timely assignment of error and to seek an admonition. It is also unpersuasive; no misconduct appears. The prosecutor was contrasting a crime of passion to the random, impersonal killings committed by defendant. Seen in its full context, there was no misstatement of law; nor did the prosecutor improperly interject his personal beliefs when he argued that a prosecutor would not seek a death verdict for a crime of passion.\n\nThe prosecutor also argued to the jury that they should not sympathize with defendant, based on testimony of his family or others: \"I say to you what his own family cares about him now is totally and absolutely irrelevant. . . . Well, you're making a huge mistake if you exercise empathy for this defendant on what meager historical background you have on him. . . . You have no right, from what little you know of this man, to assume anything or read into him anything or to give him any empathy or sympathy.\" After defense counsel objected, and the objection was overruled, the prosecutor explained: \"You have the right, you'll be instructed, to consider the subject matter of pity and you can exercise it if you choose. [P] I can't stop you from doing so. . . . This is not a man that should be pitied. This is not a man deserving of sympathy.\"\n\nAfter reviewing the argument in context, we find no misconduct. \"The prosecution may properly argue that the particular facts do not warrant sympathy; the defense may properly argue the opposite.\" ( People v. Edwards, supra, 54 Cal. 3d at p. 840.) We conclude that there is no reasonable possibility that the jury misconstrued the prosecutor's argument that they should not exercise sympathy for defendant to mean that they could not do so.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\n\n4. Caldwell Error\n\nDuring his summation, the prosecutor stated: \"I think the biggest psychological ploy that can be employed by a defense lawyer trying to save a man's life in a position like Ricardo Sanders is to give you the impression that you are killing him. [P] You're not. He killed himself the moment he committed that slaughter, because everyone is presumed to know the law. . . . Ricardo Sanders took his own life the moment he killed and took part in the killing of all those people. [P] You are sitting here not deciding whether you shall take his life or not; you are deciding whether or not the law shall apply and how it shall apply. [P] Now, counsel made it very clear to you during this case you have an out, an escape valve, and you truly do. Like I said before, you can let two plus two equal three, you can let it equal five, you can let it equal ten.\"\n\nDefendant contends that the prosecutor's argument impermissibly minimized the jury's sense of personal responsibility in returning a death sentence.\n\n\"It is constitutionally impermissible to rest a death sentence on a determination made by a sentencer who has been led to believe that the responsibility for determining the appropriateness of the defendant's sentence rests elsewhere.\" ( Caldwell v. Mississippi (1985) 472 U.S. 320, 328-329, 86 L. Ed. 2d 231, 105 S. Ct. 2633.) In Caldwell, the prosecutor advised the jury that their decision was \" 'not the final decision' \" because it was automatically reviewable by the appellate court. ( Id. at p. 325.) The court determined that \"in the capital sentencing context there are specific reasons to fear substantial unreliability as well as bias in favor of death sentences when there are state-induced suggestions that the sentencing jury may shift its sense of responsibility to an appellate court.\" ( Id. at p. 330.)\n\nIn People v. Milner (1988) 45 Cal. 3d 227, 257, 246 Cal. Rptr. 713, 753 P.2d 669, we held that it was reversible misconduct for the prosecutor to repeatedly assure the jurors that they did not have to \" 'shoulder the burden of personal responsibility' \" and could \" 'hide' behind the law\" because it impermissibly suggested to the jurors that they did not have ultimate responsibility for the sentence.\n\nHere, unlike Caldwell and Milner, the prosecutor did not suggest that the jury's decision was not final or that the jurors did not have ultimate responsibility for the sentencing decision. Instead, he urged them not to be swayed by arguments for sympathy, because defendant had only himself to blame for committing crimes that merited a sentence of death. As in People v. Clark (1992) 3 Cal. 4th 41, 167, 833 P.2d 561: \"The prosecutor's exhortations that the jury should 'follow the law,' or perform its 'duty' by returning a verdict of death, correctly admonished the jury that it represented the community, that its decision should be based on a weighing process, and that it should not be swayed by appeals to mere passion and prejudice ungrounded in the evidence.\"\n\nMoreover, we must consider the prosecutor's argument in context. Although he urged the jury to apply the law, and not to be influenced by emotion, he also repeatedly emphasized, as did defense counsel, that they retained discretion not to return a verdict of death. We conclude that there is no reasonable possibility that the prosecutor's remarks misled the jury concerning the scope of their sentencing discretion or their ultimate responsibility for determining the appropriateness of a death verdict.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\n\nF. Closing Argument of Defense\n\nDefendant claims that the trial court erred in limiting his summation on several points.\n\n1. Reference to Charles Manson\n\nAt the Conclusion of evidence in the penalty phase, the trial court informed counsel: \"I don't want any Discussion of any specifics in any case not before the court. . . . Nor would I permit you [defense counsel] to refer to the fact that Charlie Manson lives, is going to continue to live, and he's not as bad as Charlie Manson.\" During her final argument, defense counsel argued in general terms that there were \"worse cases\" than defendant's in terms of the number of victims and the nature of the crime.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e\n\nDefendant contends that the trial court erred in precluding references to the Manson case. The standard of review for decisions as to whether or not certain evidence is relevant is abuse of discretion. ( People v. Gordon, supra, 50 Cal. 3d at p. 1265.) We discern none. The trial court did not err in excluding references to the notorious but unrelated crimes of Charles Manson or to the penalty of life imprisonment that he ultimately received.\n\n2. Life Imprisonment Without Possibility of Parole\n\nBefore her summation, defense counsel informed the court: \"I am very concerned because of the publicity that's been available throughout the trial in the newspapers about people who under pre-1977 legislation . . . are coming up for parole dates, because as we know their death sentences were wiped out by various constitutionality decisions, and they were left with the old law of life with parole.\" She stated that she \"should be entitled to tell this jury that we are not operating under such statutes. It's a new law, and it provides for only two things: Life without or death.\" The trial court ruled that defense counsel could not refer to other cases, but \"can tell [the jury] they must assume whatever decision they make is going to be carried out.\" [Ibid.]\n\nIn her summation, defense counsel argued: \"By your previous verdict, you have already mandated that Ricky Sanders will die behind the walls of a California prison. That is decided.\" She also said that he \"will never walk the streets again.\"\n\nDefendant claims, in substance, that the trial court's ruling was erroneous because counsel was prevented from informing the jury about the \"distinct meaning of a sentence of life without parole.\" He is unpersuasive. Counsel was permitted to, and did, argue that a sentence of life without parole meant just that: defendant would \"never walk the streets again.\"\n\n3. Description of an Execution\n\nDefense counsel also sought to describe an execution. The trial court ruled that she could not: \"You can't describe it at all. What's the point in describing it? [P] If they come in with the death sentence they will have to imagine or believe that at some future date he'll be executed by the state. . . . I think the concept of putting someone to death is something everyone can understand.\"\n\nDefendant claims the trial court erred, because counsel's purpose was \"to impress upon the jury the full weight of their personal responsibility in determining [his] fate.\"\n\nRegardless of counsel's purpose, the trial court did not abuse its discretion in precluding the argument. Indeed, we have emphasized: \" 'A vivid account of an execution has no place at the penalty phase. Unlike mitigating evidence of a defendant's background and character, which may be introduced to elicit the sympathy or pity of the jury, accounts of the executions of others do not aid the jury in making an individualized assessment of the crucial issue whether the death penalty is appropriate for the particular defendant on trial. ' \" ( People v. Gordon, supra, 50 Cal. 3d at pp. 1265-1266, quoting People v. Grant (1988) 45 Cal. 3d 829, 860, 248 Cal. Rptr. 444, 755 P.2d 894.)\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e\n\nG. Brown Error\n\nThe trial court instructed the jury: \"It is now your duty to determine which of the two penalties, death or confinement in the state prison for life without possibility of parole, shall be imposed on the defendant. [P] After having heard all the evidence, and considered the arguments of counsel, you shall consider, take into account and be guided by the applicable factors of aggravating and mitigating circumstances upon which you have been instructed. [P] If you conclude that the aggravating circumstances outweigh the mitigating circumstances, you shall impose a sentence of death. However, if you determine that the mitigating circumstances outweigh the aggravating circumstances, you shall impose a sentence of confinement in the state prison for life without possibility of parole.\"\n\nThe prosecutor referred to the instruction several times during his summation. He argued that the aggravating factors so outweighed any mitigating factors that the jury had \"no choice\" but to impose a sentence of death, and repeatedly quoted the phrase \"you shall impose a sentence of death.\" He urged the jury to \"follow the law,\" arguing that it would be \"a cowardly act to shun that which is difficult, to shun this responsibility that society has placed upon you as 12 jurors.\" He also admonished the jury that they should not feel sympathy for defendant.\n\nDefendant asserts error. Citing People v. Brown (1985) 40 Cal. 3d 512, 538-544, 220 Cal. Rptr. 637, 709 P.2d 440, he argues that the trial court's instructions to the jury, along with the prosecutor's closing penalty phase argument, may have misled the jurors to his prejudice as to the scope of their sentencing discretion and responsibility. He is unpersuasive.\n\nThe instruction incorporates the mandatory sentencing language of Penal Code section 190.3. \"Although in Brown we upheld the constitutionality of section 190.3, we nevertheless recognized that when delivered in an instruction the provision's mandatory sentencing language might mislead jurors as to the scope of their sentencing discretion and responsibility. [Citation.] Specifically, a juror might reasonably understand that language to define the penalty determination as 'simply a finding of facts' [citation] or 'a mere mechanical counting of factors on each side of the imaginary \"scale\" ' [citation.] A juror might also reasonably understand the language to require him to vote for death if he finds that the evidence in aggravation outweighs the evidence in mitigation -- even if he determines that death is not the appropriate penalty under all the circumstances. [Citation.]\" ( People v. Bonin (1989) 47 Cal. 3d 808, 856, 254 Cal. Rptr. 298, 765 P.2d 460.)\n\n\"To determine whether the jury may have been misled to defendant's prejudice in either respect, we examine the entire record.\" ( People v. Hayes (1990) 52 Cal. 3d 577, 642, 276 Cal. Rptr. 874, 802 P.2d 376.) Our task is to examine each case individually to determine whether the instruction and the prosecutor's comments misled the jury in a manner that prejudiced defendant. ( People v. Andrews (1989) 49 Cal. 3d 200, 229, 260 Cal. Rptr. 583, 776 P.2d 285.)\n\nAfter review of the record, we conclude that there is no reasonable possibility that the jurors misapprehended the nature of the penalty determination process or the scope of their discretion to determine through the weighing process whether death or life imprisonment without possibility of parole was the appropriate punishment in this case.\n\nThe trial court expressly told the jurors that their penalty determination was not a mere mechanical counting of factors and they retained discretion to assign whatever value they deemed appropriate to the aggravating and mitigating circumstances. Thus, it instructed that \"in weighing the aggravating and mitigating factors, you are not merely to count numbers on either side. . . . You are instructed, rather, to weigh and consider the factors. [P] You may return a verdict of life imprisonment without possibility of parole even though you should find the presence of one or more aggravating circumstances. One mitigating circumstance may be sufficient for you to return a verdict of life imprisonment without possibility of parole.\"\n\nAs we have previously concluded, such an instruction \"significantly reduced the risk of juror misapprehension. First, it expressly told the jury that penalty was not to be determined by a mechanical process of counting, but rather that the jurors were to assign a weight to each factor, and that a single factor could outweigh all other factors. Second, ' \"when jurors are informed that they have discretion to assign whatever value they deem appropriate to the factors listed, they necessarily understand they have discretion to determine the appropriate penalty.\" ' \" ( People v. Cooper, supra, 53 Cal. 3d at p. 845.)\n\nThe trial court also instructed that the jury could be influenced by pity for defendant. When such an instruction is given, \"it is unlikely that a juror would have interpreted the instructions as a whole to require him or her to return a death verdict even if he or she did not personally believe that the death penalty was warranted under all the circumstances.\" ( People v. Ramirez, supra, 50 Cal. 3d at p. 1200.)\n\nMoreover, although the prosecutor urged the jury to render a verdict of death, he also conceded: \"You don't add up the numbers . . . You must assign individual weight to any given factor, be it aggravating or mitigating.\" He repeatedly emphasized to the jurors that they had discretion to \"go the other way.\" He argued: \"And if you choose to let him out of it by way of section (k) and (1), that's fine, too, because that's what makes this country so great. The escape valve. There is latitude. There is discretion. But just remember if you do that, 2 + 2 will equal three.\"\n\nDefense counsel also stressed that the juror's function was not mechanical: \"We give each individual juror the opportunity to affix for themselves the weight to be given to any of the facts or factors that have been presented in this phase of the trial. [P] Now, what does that mean? You will be specifically instructed that you do not add up numbers, three mitigating, four aggravating, as if they are all marbles of equal size and weight on a scale. That you do not do. [P] Because if that's all you had to do, was add up factors, a computer, a calculator could figure out the result. [P] But it is meant to be the most intensely human decision that not only will be made in a court of law, but that anyone will make in their lives.\"\n\nOn this record, we are satisfied that no Brown error occurred.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e\n\nDefendant also claims that the instruction was defective on several additional grounds, each of which we have rejected in prior cases. Thus, we have previously held that the trial court need not instruct the jury that it may not impose the death penalty unless it finds unanimously and beyond a reasonable doubt that the aggravating circumstances outweigh the mitigating circumstances and that death is the appropriate penalty. ( People v. Rodriguez, supra, 42 Cal. 3d at pp. 777-779; People v. Visciotti, supra, 2 Cal. 4th at pp. 67-68.) Similarly, we have rejected the contention that jury unanimity on the aggravating factors warranting death is required under either the California or the United States Constitution. ( People v. Berryman (1993) 6 Cal. 4th 1048, 1101-1102 fn. 24, 864 P.2d 40, 25 Cal. Rptr. 2d 867.) In addition, neither the state nor the federal Constitution requires that the jury render a written statement of its reasons for returning a verdict of death. ( People v. Fauber, supra, 2 Cal. 4th at p. 859.)\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e\n\nH. Refusal of Proposed Jury Instructions\n\nDefendant claims that the trial court erred by refusing to give the following instructions on his request.\n\nDefense Instruction No. 3: \"You may consider as further mitigating factors the following facts or circumstances: [P] (a) Ricky Sanders had a deprived and chaotic childhood during which he received little or no religious or moral training. [P] (b) Ricky Sanders in his formative years was warehoused in group homes and institutions where he received little if any personal attention or affection. [P] (c) In spite of the inadequacies of his family home Ricky Sanders developed strong personal bonds with his siblings and was a positive force in their lives. [P] (d) While in prison Ricky Sanders consistently furthered his education. [P] (e) Ricky Sanders was a model prisoner.\"\n\nDefense Instruction No. 4: \"I have previously read to you the list of aggravating circumstance which the law permits you to consider if you find that any of them is established by the evidence. You are not allowed to take account of any other facts or circumstances as the basis for deciding that the death penalty would be an appropriate punishment in this case. [P] However, the mitigating circumstances which I have read for your consideration are given to you merely as examples of some of the factors that you may take into account as reasons for deciding not to impose a death sentence upon Ricky Sanders. You should pay careful attention to each of those factors. Any one of them may be sufficient, standing alone, to support a decision that death is not the appropriate punishment in this case. But you should not limit your consideration of mitigating circumstances to these specific factors. You may also consider any other circumstances (relating to the case or to the defendant, Ricky Sanders,) as reasons for not imposing the death sentence.\"\n\nDefense Instruction No. 6: \"During the penalty phase of this trial, the defense has presented evidence from members of the defendant's family. These witnesses have testified to their love for the defendant and the fact that they do not wish him to be put to death. You are instructed that you may consider and take into account, as a mitigating factor, these expressions of love and concern for the defendant in determining whether he should be sentenced to death or life in prison without possibility of parole. [P] This evidence may be sufficient standing alone to warrant the return of a verdict of life imprisonment without possibility of parole if you should believe that it outweighs the aggravating factors found by you to be present in this case.\"\n\nDefense Instruction No. 9: \"The fact that the defendant has been a model prisoner and has attempted to further his education can, and should, be considered as a mitigating circumstance.\"\n\nDefense Instruction No. 10: \"Mitigating circumstances are circumstances that do not constitute a justification or excuse of the offense in question, but which, in fairness and mercy, may be considered as extenuating or reducing the degree of moral culpability.\"\n\nDefendant contends that the trial court erred in rejecting the proposed instructions. He argues that the instructions, taken together, were essential to apprise the jury of the scope of its sentencing discretion and its duty to consider mitigating evidence.\n\n\"As we have declared, a court may, and must, refuse an instruction that is an incorrect statement of the law. The same is true of 'an instruction that is argumentative, i.e., of such a character as to invite the jury to draw inferences favorable to one of the parties from specified items of evidence.' [Citations.] As we have also declared, a court may refuse an instruction that is duplicative.\" ( People v. Mickey, supra, 54 Cal. 3d at p. 697.)\n\nThe trial court refused Defendant's Instruction No. 4 as duplicative and Nos. 3, 6, and 9 as argumentative. It was plainly correct. It also did not err in declining to give Defendant's Instruction No. 10, the Black's Law Dictionary definition of mitigation, in the absence of a request by the jury for clarification of the term. It is well established that the words \"mitigating\" and \"aggravating\" are \"commonly understood terms that the trial court need not define for the jury.\" ( People v. Kirkpatrick (1994) 7 Cal. 4th 988, 1018, 874 P.2d 248.) Accordingly, a court need not give an instruction clarifying these terms on defendant's request. ( People v. Malone (1993) 6 Cal. 4th 1, 50, 859 P.2d 673, 23 Cal. Rptr. 593.)\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e\n\nI. Failure to Reinstruct the Jury\n\nDefendant asserts that the trial court committed reversible error when it did not repeat instructions on the credibility of witnesses and circumstantial evidence, which it gave at the guilt phase, at the Conclusion of the penalty trial. (See CALJIC Nos. 2.20 \u0026 2.00.)\n\nThe claim is meritless. \"Because none of these instructions was, by its terms, limited to the guilt phase, and because no penalty phase instructions contradicted those instructions, 'we believe a reasonable jury would correctly assume those \"generic\" instructions continued to apply.' \" ( People v. Wharton (1991) 53 Cal. 3d 522, 600, 280 Cal. Rptr. 631, 809 P.2d 290.)\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e\n\nJ.Failure to Instruct on Definition of Life Imprisonment Without Possibility of Parole\n\nDuring voir dire, several prospective jurors expressed the belief that sentences of life imprisonment without possibility of parole did not mean that a defendant would never be paroled. The trial court admonished all of the prospective jurors who expressed such a misconception that they must \"assume\" that the sentence would be carried out. None of these prospective jurors actually sat on the jury. In its instructions at the penalty phase, the trial court repeatedly told the jury that it must decide between two penalties, death or \"confinement in the state prison for life without possibility of parole.\"\n\nDefendant contends that the trial court committed reversible error by failing to instruct, sua sponte, that \"LWOP really does mean LWOP.\" We have previously rejected the point, and do so again: \"When a term is commonly understood by those familiar with the English language and is not used in a technical sense peculiar to the law, the court is not required to give an instruction as to its meaning in the absence of a request. [Citation.] In this case, the term 'confinement in the state prison for life without possibility of parole' was used in the common and nontechnical sense that the plain meaning of the words convey. Accordingly, the court was not required to give an instruction as to its meaning sua sponte.\" ( People v. Bonin, supra, 46 Cal. 3d at p. 698.)\n\nLike the defendant in Bonin, defendant argues that jurors share a \"widespread misconception of the applicable law,\" and hence should be instructed on the court's own motion that \" 'without possibility of parole' \" means \" 'without possibility of parole.' \" ( People v. Bonin, supra, 46 Cal. 3d at p. 698.) As in Bonin, we are not persuaded that the argument's factual premise is supported. (Ibid.) Out of a large pool of prospective jurors, defendant quotes remarks from a mere eight, none of whom was selected for the jury, who may have labored under a misconception about the meaning of the sentence. We cannot conclude therefrom that there existed a \"widespread misconception of the applicable law.\" We also find no reasonable possibility that the jury would have misunderstood the word \"assume\" in this context to mean \"pretend\" or \"feign,\" as opposed to \"take for granted.\"\n\nK. Jury Consideration of Four Multiple Murder Special Circumstances\n\nThe trial court instructed the jury that it should consider \"the circumstances of the crime of which the defendant was convicted in the present proceeding and the existence of any special circumstances found to be true.\"\n\nDefendant argues that the trial court erred, because the instructions improperly allowed the jury to consider four multiple murder special circumstances instead of just one. He is correct; all but one of the multiple murder special circumstances must be set aside. ( People v. Bonin, supra, 46 Cal. 3d 691.) Nonetheless, as we have repeatedly held, \" 'consideration of such excessive multiple-murder special-circumstance findings where, as here, the jury knows the number of murders on which they were based, is harmless error. [Citation.]' \" ( People v. Clark, supra, 3 Cal. 4th at pp. 167-168.)\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e\n\nL. Instructions on Aggravating and Mitigating Factors\n\nThe trial court instructed the jury as follows: \"In determining which penalty is to be imposed on defendant, you shall consider all of the evidence which has been received during any part of the trial of this case. You shall consider, take into account and be guided by the following factors, if applicable: (a) The circumstances of the crime of which the defendant was convicted in the present proceeding and the existence of any special circumstances found to be true; [P] (b) The presence or absence of criminal activity by the defendant which involved the use or attempted use of force or violence or the expressed or implied threat to use force or violence; [P] (c) The presence or absence of any prior felony conviction; [P] (d) Whether or not the offense was committed while the defendant was under the influence of extreme mental or emotional disturbance. [P] (e) Whether or not the victim was a participant in the defendant's homicidal conduct or consented to the homicidal act. [P] (f) Whether or not the offense was committed under circumstances which the defendant reasonably believed to be a moral justification or extenuation for his conduct. [P] (g) Whether or not the defendant acted under extreme duress or under the substantial domination of another person. [P] (h) Whether or not at the time of the offense the capacity of the defendant to appreciate the criminality of his conduct or to conform his conduct to the requirements of law was impaired as a result of mental disease or defect or the affects [sic] of intoxication; [P] (i) The age of the defendant at the time of the crime; [P] (j) Whether or not the defendant was an accomplice to the offense and his participation in the commission of the offense was relatively minor; [P] (k) Any other circumstance which extenuates the gravity of the crime even though it is not a legal excuse for the crime. [P] (1) The defendant's character, background, history, mental condition, and physical condition.\"\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e\n\nDefendant contends that the trial court's instructions on aggravating and mitigating circumstances were unconstitutionally vague, because they failed to channel the jury's sentencing discretion as required by the Eighth Amendment of the United States Constitution. We have repeatedly rejected similar claims. We do so again.\n\nSpecifically, defendant asserts that factors (a) and (i) are unconstitutionally vague under the requirements of the Eighth Amendment. Not so. ( People v. Stansbury, supra, 4 Cal. 4th at p. 1017.) Recently, in Tuilaepa v. California (1994) __ U.S. __ [ 114 S. Ct. 2630, 129 L. Ed. 2d 750], the United States Supreme Court held that both factors meet the constitutional requirement under the Eighth Amendment that factors in capital sentencing have \"some 'commonsense core of meaning . . . that criminal juries should be capable of understanding.' \" (Id. at pp. __ - __ [ 114 S. Ct. at p. 2636].)\n\nDefendant also contends that the trial court's instruction failed to inform the jury that the factors listed as (d), (e), (f), (g), (h), (k), and (1) could only be given mitigating weight and that, moreover, factors (d) through (h) were inapplicable, i.e., entitled to no weight. Again, we have repeatedly rejected the same arguments. ( People v. Stansbury, supra, 4 Cal. 4th at p. 1071.) \"The factors listed in [Penal Code] section 190.3 'properly require the jury to concentrate upon the circumstances surrounding both the offense and the offender, rather than upon extraneous factors having no rational bearing on the appropriateness of the penalty. We believe that the aggravating or mitigating nature of these various factors should be self-evident to any reasonable person within the context of each particular case.' \" ( People v. Zapien, supra, 4 Cal. 4th at p. 990; see also People v. Danielson, supra, 3 Cal. 4th at p. 718.)\n\nIn Tuilaepa, the United States Supreme Court also rejected what was, in substance, the same argument: \"Petitioners also suggest that the [Penal Code section] 190.3 sentencing factors are flawed because they do not instruct the sentencer how to weigh any of the facts it finds in deciding upon the ultimate sentence. In this regard, petitioners claim that a single list of factors is unconstitutional because it does not guide the jury in evaluating and weighing the evidence and allows the prosecution (as well as the defense) to make wide-ranging arguments about whether the defendant deserves the death penalty. This argument, too, is foreclosed by our cases. A capital sentencer need not be instructed how to weigh any particular fact in the capital sentencing decision.\" (Tuilaepa v. California, supra, U.S. at p. [114 S. Ct. at p. 2638].) Furthermore: \"the sentencer may be given 'unbridled discretion in determining whether the death penalty should be imposed after it has found that the defendant is a member of the class made eligible for that penalty.' \" (Id. at p. [114 S. Ct. at p. 2639].)\n\nM. Proportionality Review\n\nDefendant seeks \"intercase\" proportionality review. Such review is not required. ( People v. Mincey (1992) 2 Cal. 4th 408, 476, 827 P.2d 388; ( People v. Marshall (1990) 50 Cal. 3d 907, 939, 269 Cal. Rptr. 269, 790 P.2d 676.)\n\nDefendant also seeks \"intracase\" proportionality review, on the ground that Freeman, convicted in a separate trial, received a sentence of life imprisonment without possibility of parole.\n\n\" 'Unless the state's capital punishment system is shown by the defendant to operate in an arbitrary and capricious manner, the fact that such defendant has been sentenced to death and others who may be similarly situated have not does not establish disproportionality violative of constitutional principles.' \" ( People v. Marshall, supra, 50 Cal. 3d at p. 938.) Despite defendant's perfunctory assertion that his sentence was arbitrary and discriminatory, the required showing has not been made.\n\nN. Cumulative Effect of Errors\n\nDefendant contends that even if no single error at the guilt or penalty phase warrants reversal of the death judgment, the errors must be deemed prejudicial when evaluated in combination. We reject the claim. The errors at the trial as a whole were few in number and of minimal significance. Whether considered individually or for their \"cumulative\" effect, they could not have affected the process or result to defendant's detriment.\n\nO. Application to Modify the Death Verdict\n\nDefendant made an automatic application for modification of the verdict of death under Penal Code section 190.4, subdivision (e). The trial court denied the request.\n\nIn stating its findings concerning the applicable factors in mitigation, the trial court observed: \"The final factor that the court must consider is the defendant's character, background, history, mental condition and physical condition. [P] There is absolutely nothing in the record that the court could find to mitigate in that regard. [P] The defendant is a relatively intelligent young man who simply has chosen crime as a career, and who apparently cannot be rehabilitated, even though he's been tried at the level of camp, youth authority, state prison, parole, probation. Nothing seems to help.\"\n\nOn the basis of these remarks, defendant asserts that the trial court erred in two regards: first, by considering evidence in defendant's probation report, which was not introduced at trial, and second, by finding no evidence in mitigation.\n\nOn appeal, we subject a ruling on an application for verdict modification to independent review. ( People v. Ashmus, supra, 54 Cal. 3d at pp. 1006-1007.) Having conducted such review, we find no error.\n\n\" 'In ruling on a verdict-modification application, the trial Judge is required by [Penal Code] section 190.4[, subdivision] (e) to \"make an independent determination whether imposition of the death penalty upon the defendant is proper in light of the relevant evidence and the applicable law.\" That is to say, he must determine whether the jury's decision that death is appropriate under all the circumstances is adequately supported. And he must make that determination independently, i.e., in accordance with the weight he himself believes the evidence deserves.' [Citation.] Obviously, the evidence that he considers is that which was properly presented to the jury [citations] -- no more, no less [citation].\" ( People v. Ashmus, supra, 54 Cal. 3d at p. 1006.)\n\nThe record plainly demonstrates that the trial court correctly understood the scope and limits of its statutory duty. It expressly acknowledged that it could consider only evidence that was properly presented to the jury. Thus, in response to the prosecutor's argument that the trial court was permitted to consider defendant's probation report, the trial court stated: \"No. Wait. Wait. [P] I have to decide the issue of the penalty based upon what the jury heard at the guilt phase. [P] I can't take into consideration other matters that's contained in the probation report. Not for the purpose of deciding the penalty.\" Later, the trial court reiterated: \"In exercising my responsibilities under section 190.4 of the Penal Code, it is necessary for the court to review the factors that the jury was obligated to consider in fixing the penalty and to make a decision as to whether or not that decision was supported by the evidence.\"\n\nWe do not conclude from the trial court's passing reference to defendant's juvenile criminal record in its closing remarks that it impermissibly considered the probation report.\n\nWe also do not interpret the trial court's Conclusion that \"there is absolutely nothing in the record that the court could find to mitigate in that regard\" to mean that it failed to consider all of the evidence presented in mitigation. Indeed, the trial court expressly stated that it had reviewed all of the aggravating and mitigating evidence, emphasizing that \"I have made a review of the entire case, yes.\"\n\nAfter reviewing the trial court's comment in context, we conclude that it expressed the determination, in our view sound, that no mitigating evidence sufficed to extenuate defendant's crime or to justify a sentence of life imprisonment without possibility of parole. (See People v. Ashmus, supra, 54 Cal. 3d at p. 1009; People v. Johnson (1993) 6 Cal. 4th 1, 54, 859 P.2d 673.)\n\nV. DISPOSITION\n\nFor the reasons stated above, we vacate three of the four multiple-murder special-circumstance findings but otherwise affirm the judgment.\n\nLUCAS, C. J., KENNARD, J., ARABIAN, J., BAXTER, J., GEORGE, J. and WERDEGAR, J. Concurring.\n\n\u003cspan class=\"fn\"\u003e1. Counsel was appointed to represent defendant in this automatic appeal in October 1983. After repeated failures to perform the duties of a court-appointed attorney, he was relieved as counsel in November 1987. The State Public Defender was appointed as appellate counsel for defendant in December 1987. Briefing on the merits was completed in mid-1995.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Defendant claims that trial court's erroneous denial of the motion for change of venue was also error under the Sixth and Fourteenth Amendments of the United States Constitution \"and their California counterparts.\" The predicate of his argument is that denial of the motion was error and prejudicial under California law. It was neither.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Defendant claims that exclusion of the expert testimony of Dr. Loftus was also error under the Sixth and Fourteenth Amendments of the United States Constitution and article I, sections 7 and 15 of the California Constitution. He did not present an argument based on these provisions below and may not do so for the first time on appeal. ( People v. Gordon (1990) 50 Cal. 3d 1223, 1264-1265, 270 Cal. Rptr. 451, 792 P.2d 251.) His assertion that the trial court's ruling would not have been different had defense counsel expressly cited the constitutional provisions is merely speculative. In any event, his constitutional claims are premised on the assertion that the trial court erred in excluding the expert testimony and that the error was prejudicial. For the reasons stated in the text, there was no error. Hence the constitutional claims also fail.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Defendant also claims, for the first time on appeal, that admission of the evidence was erroneous under the Sixth and Fourteenth Amendments to the United States Constitution \"and their California counterparts.\" \"It is, of course, 'the general rule that questions relating to the admissibility of evidence will not be reviewed on appeal in the absence of a specific and timely objection in the trial court on the ground sought to be urged on appeal.' \" ( People v. Benson (1990) 52 Cal. 3d 754, 786, fn. 7, 276 Cal. Rptr. 827, 802 P.2d 330, quoting People v. Rogers (1978) 21 Cal. 3d 542, 548, 146 Cal. Rptr. 732, 579 P.2d 1048.) The point is also meritless. It is predicated on the assertion that admission of the evidence was error under California law. It was not.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Defendant points to a standard jury instruction promulgated in 1984 -- after the trial in this case -- which sets forth as a factor for jury consideration in assessing eyewitness testimony \"evidence relating to the witness's ability to identify other alleged perpetrators of the criminal act.\" (CALJIC No. 2.92 (1984).) On the strength of the instruction, which was not given in this case, he argues that any evidence relating to a witness's ability to make other identifications must be admitted. The argument is unpersuasive.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Defendant claims that the ruling was erroneous under the confrontation clause of the Sixth Amendment. He is unpersuasive. \"Trial Judges retain wide latitude insofar as the Confrontation Clause is concerned to impose reasonable limits on such cross-examination based on concerns about, among other things, harassment, prejudice, confusion of the issues, the witness' safety, or interrogation that is repetitive or only marginally relevant.\" ( Delaware v. Van Arsdall, supra, 475 U.S. 673, 679.) \"The confrontation clause 'guarantees an opportunity for effective cross-examination, not cross-examination that is effective in whatever way, and to whatever extent, the defense might wish.' \" ( People v. Clair, supra, 2 Cal. 4th at p. 656, fn. 3, quoting Delaware v. Fensterer (1986) 474 U.S. 15, 20, 88 L. Ed. 2d 15, 106 S. Ct. 292 (per curiam), italics in Fensterer.).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Evidence Code section 1223, in relevant part, provides: \"Evidence of a statement offered against a party is not made inadmissible by the hearsay rule if: [P] (a) The statement was made by the declarant while participating in a conspiracy to commit a crime . . . in furtherance of the objective of that conspiracy; [P] (b) The statement was made prior to or during the time that the party was participating in that conspiracy; and [P] (c) The evidence is offered either after admission of evidence sufficient to sustain a finding of the facts specified in subdivisions (a) and (b) or, in the court's discretion as to the order of proof, subject to the admission of such evidence.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Defendant also contends that admission of the statements to Givens and Gilcrest was \"prejudicial and unfair to the non-declarant defendant regardless of whether it was constitutionally permissible\" because Stewart was unavailable at trial for full and effective cross-examination. ( People v. Aranda (1965) 63 Cal. 2d 518, 529, 47 Cal. Rptr. 353, 407 P.2d 265; Bruton v. United States (1968) 391 U.S. 123, 127-128, fn. 3, 20 L. Ed. 2d 476, 88 S. Ct. 1620.) As we have previously held, the Aranda-Bruton rule is inapplicable to statements made by coconspirators in furtherance of the conspiracy and is therefore not implicated by admission of Stewart's statements to Givens or Gilcrest. ( People v. Roberts (1992) 2 Cal. 4th 271, 304, 826 P.2d 274, 6 Cal. Rptr. 2d 276; People v. Brawley (1969) 1 Cal. 3d 277, 286, 82 Cal. Rptr. 161, 461 P.2d 361.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Defendant also argues that the evidence should have been excluded under Evidence Code section 352, because it lacked probative value and was prejudicial. Alternatively, he claims ineffective assistance of counsel, under the Sixth Amendment, for her failure to object on that ground. He raises the claim of error raised for the first time on appeal; it has not been preserved for review. ( People v. Benson, supra, 52 Cal. 3d at p. 786, fn. 7.) It is also lacking in merit. The evidence, while clearly probative, was not highly prejudicial to defendant, who was apparently not a member of a conspiracy in August 1980. Indeed, the trial court expressly noted that it did \"not see that the testimony offered would be particularly damaging to the defendant.\" Accordingly, the ineffective assistance claim also fails; defendant cannot establish that counsel's representation fell below an objective standard of reasonableness. ( Strickland v. Washington (1984) 466 U.S. 668, 688, 694, 80 L. Ed. 2d 674, 104 S. Ct. 2052; People v. Ledesma (1987) 43 Cal. 3d 171, 215-218, 233 Cal. Rptr. 404, 729 P.2d 839.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Evidence Code section 356, in relevant part, provides: \"Where part of an act, declaration, conversation, or writing is given in evidence by one party, the whole on the same subject may be inquired into by an adverse party . . . when a detached act, declaration, conversation, or writing is given in evidence, any other act, declaration, conversation, or writing which is necessary to make it understood may also be given in evidence.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Proposition 115, enacted on June 6, 1990, is not applicable. Defendant does not dispute that, if tried today, he would be required to disclose the statement of Gilcrest to the extent that the work-product privilege did not apply. (Cal. Const., art. I, § 30, subd. (c) [\"discovery in criminal cases shall be reciprocal in nature\"]; see Pen. Code, § 1054.3, subd. (a) [requiring a defendant to disclose to the prosecuting attorney, inter alia, \"the names and addresses of persons, other than the defendant, he or she intends to call as witnesses at trial, together with any relevant written or recorded statements of those persons, or reports of the statements of those persons\"]; Izazaga v. Superior Court (1991) 54 Cal. 3d 356, 369-372, 285 Cal. Rptr. 231, 815 P.2d 304.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The case is thus distinguishable from People v. Zapien (1993) 4 Cal. 4th 929, 959, 846 P.2d 704, in which we held that, because the defendant introduced portions of a witness's testimony into evidence, the prosecutor was entitled, under Evidence Code section 356, to place the transcript of the entire testimony into evidence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. As counsel conceded, her cross-examination of other prosecution witnesses, to the extent it was also based on taped interviews by the defense investigator, was unaffected by the ruling: \"We are done with all the witnesses that I would have statements on.\" The record reflects that no previous objection under Evidence Code section 356 had been made to her use of recorded interviews with witnesses for the purpose of impeachment. Indeed, she observed, \"It didn't come up in the past when things were done\" and the prosecutor conceded, \"I for the first time realized what was happening.\" Even regarding cross-examination of Gilcrest, the prosecutor initially did not object to questions expressly based on statements the witness made in his recorded interview with the investigator, including use of quotations from the transcript of the interview for impeachment purposes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. As defendant concedes, he has no comparable claim under the Fifth Amendment to the United States Constitution. In United States v. Nobles (1975) 422 U.S. 225, 45 L. Ed. 2d 141, 95 S. Ct. 2160, the United States Supreme Court held that an order compelling the defendant to disclose the contents of his investigator's summaries of interviews with prosecution witnesses did not impinge on his Fifth Amendment privilege against self-incrimination; the privilege was \"personal to the defendant\" and \"does not extend to the testimony or statements of third parties called as witnesses at trial.\" ( Id. at p. 234.) Defendant nonetheless asserts that the trial court's ruling restricting cross-examination of Gilcrest constituted error under the Sixth Amendment of the United States Constitution and article I, section 15, of the California Constitution. He may not do so for the first time on appeal. ( People v. Gordon, supra, 50 Cal. 3d 1223, 1264-1265.) In any event, the point is without merit. The Supreme Court also rejected a Sixth Amendment claim in Nobles. ( United States v. Nobles, supra, 425 U.S. at pp. 240-241 [Sixth Amendment rights to compulsory process and cross-examination were not violated when the trial court issued a preclusion sanction in response to defendant's refusal to disclose his investigator's notes of witness interviews].) For the same reasons, the confrontation clause of the California Constitution is not implicated. Finally, defendant makes a perfunctory assertion of error under the Fourteenth Amendment. We do not discern, and defendant fails to show, any merit to his point.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. The hearing pursuant to Evidence Code section 240 on whether Taylor was an unavailable witness was held on August 3, 1982. The first attempt to serve Taylor was only a few days earlier, on July 26, 1982.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Defendant raises, for the first time on appeal, the claim that the exclusion of Taylor's prior testimony was erroneous on that ground that she was unavailable under Evidence Code section 240, subdivision (a)(4), which provides that a witness is unavailable if \"absent from the hearing and the court is unable to compel his or her attendance by its process.\" The point has not been preserved for review; it is also meritless in the absence of any showing that Taylor was outside the compulsory process of the trial court. Although defendant now contends that the uncontradicted testimony was that Taylor was said to be in Gary, Indiana, the record shows that there was no credible evidence on her whereabouts; although an unidentified neighbor mentioned Gary, Indiana, Taylor's husband \"didn't know anything about Gary, Indiana.\" Indeed, the defense investigator concluded that the woman who mentioned Gary, Indiana may have been making it up. On these facts, the alternative claim of ineffective assistance also fails, in the absence of any evidence that could establish deficient performance by counsel in failing to assert unavailability under Evidence Code section 240, subdivision (a)(4).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Defendant also claims that the trial court's error in excluding Taylor's prior testimony was also a violation of the Sixth and Fourteenth Amendments of the United States Constitution and article I, sections 7 and 15 of the California Constitution. He failed to present an argument based on the provisions in the trial. He may not do so for the first time on appeal. ( People v. Gordon, supra, 50 Cal. 3d 1223, 1264-1265.) In any event, his point is predicated on his assertion that excluding the testimony was error and was prejudicial. We have rejected that predicate.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Defendant points to Lisa Gina Sanders's testimony that she moved out of the house sometime in September 1980. She also disagreed with the prosecutor, however, when he suggested that she would not know what was in her brother's closet after that time: \"I'd still go over to my father's house.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Defendant also contends that the prosecutor's misconduct violated the Sixth and Fourteenth Amendments. His claim is predicated on the existence of misconduct. There was none.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Defendant also contends that even if these instances of prosecutorial misconduct were not prejudicial standing alone, taken together they constituted a violation of the Sixth and Fourteenth Amendments of the United States Constitution and article I, sections 7, 15, and 16 of the California Constitution. He failed to raise the point in the trial court; it has not been preserved for review. In any event, it is predicated on the existence of prosecutorial misconduct and of prejudice. Neither appears.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Defendant contends that the combined effect of these instances of judicial misconduct requires reversal. We are unpersuaded. None of the individual incidents involved misconduct; they do not do so in combination. Defendant also asserts that, taken together, the instances of misconduct constitute a violation of the Sixth and Fourteenth Amendments of the United States Constitution and article I, sections 7, 15, and 16 of the California Constitution. He raises the point for the first time on appeal; as discussed above, he may not do so. The point is, in any event, meritless, because it is premised on the occurrence of multiple instances of misconduct resulting in prejudice. There was no misconduct or prejudice.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Although Stewart did not testify at all as a witness, several statements attributed to her were admitted into evidence, including her comments, on separate occasions, to Givens and to Gilcrest that defendant and Freeman were going to rob Bob's Big Boy and her solicitation of Woods to participate in the robbery.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. The first accomplice instruction was as follows: \"You must determine whether or not the witness Andre Gilcrist [sic] was an accomplice as I will define that term. [P] The defendant has the burden of proving by a preponderance of the evidence that Andre Gilcrist [sic] was an accomplice in the crime of conspiracy to commit robbery charged against the defendant. [P] Preponderance of the evidence means such evidence as when weighed with that opposed to it has more convincing force and greater probability of truth. [P] In the event that the defendant has not proved by a preponderance of the evidence that Andre Gilcrist [sic] is an accomplice or the evidence is evenly balanced so that you are unable to say that the evidence on either side of the issue outweighs the other, then you must find that Andre Gilcrist [sic] was not an accomplice.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. The trial court instructed, inter alia, as follows: \"That the said Ricardo Rene Sanders and Carletha Ann Stewart, between the 27th day of September, 1980, and the 14th day of December, 1980, at and in the County of Los Angeles, State of California, did willfully and unlawfully conspire together with another person, to wit, Franklin Freeman, Jr., to commit the crime of robbery, in violation of Penal Code Sections 211 and 182.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. \"With respect to the witness Jerry Lankford, you have heard in in-court testimony that certain information pertaining to the case was received by him from persons other than the defendant. [P] You have heard evidence also of certain statements allegedly made by Mr. Lankford prior to the trial where he stated that the information came from Defendant Sanders himself. [P] Both versions are before you for your consideration, and it is for the jury to decide which, if either, of the versions is true. [P] If you find that the information came from persons other than the defendant, it is inadmissible hearsay and must be disregarded by you. [P] If you find that the information came from Mr. Sanders himself, then you may consider it and give to it such weight as you feel that it deserves.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Defendant claims that the asserted instructional errors, combined with the arguments of the prosecutor, also constituted error under the Sixth and Fourteenth Amendments to the United States Constitution and article I, section 16 of the California Constitution. The point is without merit. We have rejected his claims of prejudicial state law error. His constitutional claims, predicated thereon, also fall.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Defendant also argues that \"other restrictions\" on the scope of the death-qualification voir dire, although not claimed to be erroneous in themselves, \"compounded\" the error and prejudice from the prohibition against case-specific hypothetical questions. Because we conclude that the trial court did nor err in precluding the hypothetical questions, the other restrictions are immaterial. Defendant also asserts, for the first time on appeal, that the trial court's restrictions on voir dire violated the Sixth, Eighth, and Fourteenth Amendments to the United States Constitution \"and their California counterparts.\" The point has not been preserved for review. ( People v. Gordon, supra, 50 Cal. 3d 1223, 1264-1265.) It is also premised on his unsupported assertion that the restriction \"operated to eviscerate the entire death-qualification examination.\" We reject the premise, without which the claims of constitutional error fall.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Defendant claims that discharging Juror Bateman also constituted error under the United States Constitution. \"As a general rule, a defendant may properly raise in this court a point involving a trial court's allegedly improper discharge of a juror only if he made the same point below.\" ( People v. Ashmus (1991) 54 Cal. 3d 932, 987, fn. 16, 820 P.2d 214.) Defendant neither satisfies the rule as to the constitutional claim nor does he establish that any exception to the requirement is available.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Defendant raises additional claims under the Sixth, Eighth, and Fourteenth Amendments, and article I, sections 7, 15, 16, and 17 of the California Constitution, concerning the brandishing charge. None of the claims has been preserved for review; none has merit. Thus, he contends that the charge was subject to the one-year statute of limitations, that unadjudicated allegations of criminal conduct cannot be admitted at the penalty phase, and that the jury may not consider other violent criminal activity unless it unanimously finds that the activity was proven. To the extent that defendant failed to present the same objections in the trial court, they are forfeited. ( People v. Pinholster, supra, 1 Cal. 4th at p. 973.) They are also meritless. As defendant acknowledges, we have rejected the same points in previous decisions. (See, e.g., People v. Heishman, supra, 45 Cal. 3d at p. 192 [\" 'no time limitation on the introduction of \"violent\" crimes' \"]; People v. Pinholster, supra, 1 Cal. 4th at p. 973 [\"the court's admission of evidence of unadjudicated crimes at the penalty phase did not violate defendant's due process, Sixth Amendment, or Eighth Amendment rights\"; unanimous finding of prior criminal activity not required].) He also contends, for the first time on appeal, that the trial court violated the Eighth and Fourteenth Amendments to the United States Constitution in excluding, as irrelevant, evidence that the charge of assault with a deadly weapon was dismissed. This claim, too, has not been preserved for review. It is also lacking in merit. Dr. Cray's knowledge concerning the magistrate's dismissal of a charge of assault with a deadly weapon was irrelevant to the issue whether defendant was guilty of brandishing. ( People v. Heishman, supra, 45 Cal. 3d at p. 193 [\"dismissal not based on any judicial determination with respect to the truth or falsity of the charge is not an acquittal under section 190.3\"].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Defendant's brother Adrian Sanders also testified about his feelings for defendant: \"Q: Was your whole idea in coming here to attempt to in a sense plead for his life? [P] A: Yes . . . One, because he's family. [P] Two, is because he would be like a friend. I feel for him very deeply inside.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. Payne held that it was not a per se violation of the Eighth Amendment to permit testimony concerning two categories of information, (1) the individuality of the victim and (2) the impact of the crime on the victim's survivors. It did not address the admissibility of a third category of information concerning a victim's family's characterization of and opinions about the crime, the defendant, and the appropriate sentence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. Defendant also contends, for the first time on appeal, that these errors by the trial court in limiting the direct testimony of Lisa Gina Sanders and permitting the People to cross-examine Madison and Maloney outside the scope of direct examination, constituted errors under the Eighth Amendment and Fourteenth Amendments to the United States Constitution and their California counterparts. Defendant did not raise the point in the trial court. He may not do so here. In any event, there was no state law error. The predicate for defendant's constitutional claims is therefore lacking.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. We also reject defendant's contention that he was denied \"confrontation rights,\" presumably to cross-examine family members and friends of the victims concerning the emotional impact of the murders. The prosecutor's rhetorical references to the victims' families -- for example, to the \"unbearable grief that is lived daily by the brothers, sisters, parents, loved ones, friends, associates, all who loved the four deceased\" -- constituted argument, not factual testimony susceptible to cross-examination. Defendant also claims that the prosecutor's references to retribution constituted misconduct. The claim is meritless. In similar circumstances, we held that \"isolated, brief references to retribution or community vengeance such as occurred here, although potentially inflammatory, do not constitute misconduct so long as such arguments do not form the principal basis for advocating the imposition of the death penalty.\" ( People v. Ghent (1987) 43 Cal. 3d 739, 771, 239 Cal. Rptr. 82, 739 P.2d 1250.) Finally, defendant asserts that the prosecutor's misconduct violated the Eighth and Fourteenth Amendments to the United States Constitution. There was no misconduct; the claim falls in the absence of a predicate.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. Defendant also asserts, as \"unrelated instance of prosecutorial misconduct\", that the prosecutor improperly commented on defendant's constitutional right not to turn over discovery, remarking that \"the defense is entitled to full discovery of everything in the prosecution's files\" but \"the defendant need never turn over anything to the prosecution.\" He argues that these remarks were \"not unlike an improper prosecutorial reference to an accused's right not to testify at trial\" and therefore violated the Fifth and Fourteenth Amendments of the United States Constitution and article I, section 15 of the California Constitution. Defendant did not raise the point below and may not do so here. ( People v. Benson, supra, 52 Cal. 3d at p. 794.) In any event, the analogy is unsound. The prosecutor's remarks did not imply that defendant had withheld incriminating evidence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Defendant also asserts that the prosecutor's remarks constituted misconduct in violation of the Fifth, Sixth, Eighth and Fourteenth Amendments to the United States Constitution and article I, sections 7, 15, and 17 of the California Constitution. He raises the point for the first time on appeal; he may not do so. ( People v. Benson, supra, 52 Cal. 3d at p. 794.) The point is, in any event, meritless because it rests on faulty premise; there was no misconduct.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. The jury in the Manson case imposed a penalty of death on Manson and members of his \"Manson Family\" cult for the widely publicized murders of actress Sharon Tate and others. The judgment of death was ultimately modified by the Court of Appeal to provide for a punishment of life imprisonment, pursuant to our decision in People v. Anderson (1972) 6 Cal. 3d 628, 100 Cal. Rptr. 152, 493 P.2d 880, holding that capital punishment was unconstitutional. (See People v. Manson (1976) 61 Cal. App. 3d 102, 217, 132 Cal. Rptr. 265.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. Defendant also contends that the restrictions imposed by the trial court on counsel's argument constituted prejudicial error under the Sixth, Eighth, and Fourteenth Amendments and article I, section 15 of the California Constitution. He failed to raise the point in the trial court and may not do so here. ( People v. Gordon, supra, 50 Cal. 3d 1223, 1264-1265.) It is also predicated on the assertion that the trial court's rulings were erroneous and prejudicial. They were neither.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. Defendant contends that the Brown error also constituted prejudicial error under the Eighth and Fourteenth Amendments of the United States Constitution and article I, sections 7, 15, and 17 of the California Constitution. We reject the defendant's predicate, that there was Brown error. The constitutional provisions, accordingly, are not substantially implicated.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. Defendant argues that numerous additional errors also misled the jury concerning the scope of their discretion and their duty to consider mitigating evidence. His points are unpersuasive. Thus, he argues that the trial court erred in directing the jury to consider \"defendant's character, background, history, mental condition and physical condition.\" We find no reasonable possibility that the jurors applied the instruction in a way as to prevent themselves from considering any or all of the potentially mitigating evidence adduced at trial. (See People v. Mickey (1991) 54 Cal. 3d 612, 693, 286 Cal. Rptr. 801, 818 P.2d 84.) Defendant also contends that the instruction improperly allowed the jury to consider the absence of mitigating evidence as aggravation and to regard his age as an aggravating factor. We have previously rejected similar claims. ( People v. Danielson (1992) 3 Cal. 4th 691, 718, 838 P.2d 729.) We do so again. He also asserts that the prosecutor should not have been permitted to characterize the advice defendant gave his siblings -- that they not grow up to be like him -- as proof that \"Ricardo knew he was evil.\" We reject the point; the argument was not improper. Next, defendant argues that the instructions improperly allowed the jury to consider four multiple murder special circumstances instead of just one. The error was harmless; the jury knew how many murders defendant committed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. Defendant claims that refusal of the instructions was also prejudicial error under the Eighth and Fourteenth Amendments to the United States Constitution and article I, sections 7, 15, and 17 of the California constitution. We reject his premise that there was error under California law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. Defendant contends that the asserted error was of constitutional magnitude, violating the Eighth and Fourteenth Amendments and article I, sections 7, 15, and 17 of the California Constitution. We reject the point. There was no state law error; the provisions are not substantially implicated.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. Defendant asserts that the instructional error concerning the existence of any special circumstances was per se reversible under the Eighth and Fourteenth Amendments, or, in the alternative, was prejudicial error. Neither point has merit. Although there was state law error, it was harmless. The federal constitutional provisions were not substantially implicated.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. The instruction's factors (a) through (k) correspond to the identical factors under Penal Code section 190.3.\u003c/span\u003e\n\n",
    "body_length": 195528,
    "citedas": [
      "11 Cal.4th 475",
      "12 Cal.4th 783C",
      "905 P.2d 420",
      "46 Cal.Rptr.2d 751"
    ],
    "attorneys": "Fern M. Laethem, State Public Defender, under appointment by the Supreme Court, Joel Kirshenbaum and Louis Marinus Wijsen, Deputy State Public Defenders, for Defendant and Appellant. Daniel E. Lungren, Attorney General, George Williamson, Chief Assistant Attorney General, Carol Wendelin Pollack, Assistant Attorney General, Kenneth C. Byrne, Susan Lee Frierson and Kristofer Jorstad, Deputy Attorneys General, for Plaintiff and Respondent.",
    "category": [
      "243",
      "36",
      "78",
      "75"
    ],
    "judges": "Mosk, J.; Lucas, C. J., Kennard, J., Arabian, J., Baxter, J., George, J. and Werdegar, J. Concurring.",
    "citation_count": 702
  }
}
