{
  "id": "zrh1TmYBTlTomsSBWcwv",
  "document": {
    "title": "State v. Loftin",
    "full_title": "STATE OF NEW JERSEY v. DONALD LOFTIN .",
    "jurisdiction": "Supreme Court of New Jersey",
    "date": "1996-08-08T00:00:00.000Z",
    "docket": "A-39 September Term 1995",
    "body": "(This syllabus is not part of the opinion of the Court. It has been prepared by the Office of the Clerk for the convenience of the reader. It has been neither reviewed nor approved by the Supreme Court. Please note that, in the interests of brevity, portions of any opinion may not have been summarized).\n\nState of New Jersey v. Donald Loftin (A-39-95)\n\nArgued April 30, 1996 -- Decided August 8, 1996\n\nGARIBALDI, J., writing for the Court.\n\nThe victim, Gary K. Marsh, was working the midnight shift at an Exxon gas station on May 9, 1992. At 6:10 a.m., the employee who was scheduled to relieve Mr. Marsh found him lying in the gas station office with a bullet wound in the head. A shell casing was found near his body and the bullet was retrieved from the back wall of the office. Mr. Marsh died without regaining consciousness.\n\nThe gas station office was small, approximately nine feet by thirteen feet, without taking into account the furniture. There was no evidence of a struggle. The office was not disturbed, and Mr. Marsh's body showed no signs of any other wounds. Missing were Mr. Marsh's wallet and approximately $90 from the evening's receipts, including a fifty-dollar bill used by a customer to purchase gas from Mr. Marsh at around 4:00 a.m.\n\nDefendant was arrested in Pennsylvania four days later while attempting to make a purchase with one of Mr. Marsh's credit cards. He had other credit cards belonging to Mr. Marsh in his possession, as well as Mr. Marsh's driver's license and social security card. He also had a fifty-dollar bill.\n\nPursuant to a search warrant, the police searched defendant's car and home. In the car, the police found a .380 caliber pistol that ballistics tests revealed to be the murder weapon. The receipt for the gun, which was purchased in Pennsylvania a short time earlier, was found on defendant's person. Police found over 500 rounds of ammunition for the gun in defendant's home.\n\nThe State served notice of its intent to prove three aggravating factors: prior murder conviction; murder to escape apprehension; and murder committed during the course of a robbery. Defendant had previously been convicted of the March 28, 1992 murder of sixty-nine year old Sophia Fetter in Atlantic County. Defendant was convicted of this murder on September 22, 1993.\n\nA jury convicted defendant of the murder of Mr. Marsh. A separately-empaneled jury returned a death-penalty verdict.\n\nHELD: Defendant's murder conviction and death sentence are affirmed.\n\n1. It was not plain error for the trial court to fail to death-qualify the guilt-phase jury or to conduct individualized voir dire of that jury. Defendant was not deprived of his ability to mount a defense as a result of trial court limitations on his attorney's cross-examination and summation. (pp. 30-46)\n\n2. The trial court's failure to include a Mejia charge that informed the guilt-phase jury of the option of returning a non-unanimous verdict on the defendant's mental state (intent to kill or inflict serious bodily injury) was harmless. There was no rational basis for a juror to conclude that defendant did not intend to kill his victim, since defendant, who was experienced with guns, fired a bullet into the side of Mr. Marsh's head from close range without any signs of struggle. (pp. 46-55)\n\n3. There was no reversible error in the penalty-phase as a result of the testimony by defendant's trial attorney in the Atlantic County murder that defendant did not have a mental health defense to that murder; testimony by the State's examining psychiatrist about defendant's statements during a psychiatric examination; and the trial court's instructions to disregard portions of defendant's allocution statement. (pp. 57-67)\n\n4. The brief outburst by a courtroom spectator after defendant's allocution statement did not operate to unduly prejudice the jury against defendant. Since defendant's counsel objected to any instruction by the trial court that would highlight the outburst, defendant cannot now complain that the trial court's inquiry to the jury was not sufficiently probing. (pp. 67-72)\n\n5. It was not reversible error for the trial court to refuse to allow the jury to consider under the catch-all mitigating factor the hardship on defendant's family or that defendant would likely die in prison. The trial court's instructions in respect of the mitigating factor of extreme mental or emotional disturbance and in respect of jury unanimity on mitigating factors were sufficient when the court's instructions are examined in their entirety. (pp. 72-85)\n\n6. The circumstantial evidence presented by the State indicates that defendant did not have to kill Mr. Marsh to effectuate the robbery. This evidence was sufficient to submit to the jury the aggravating factor of murder to avoid apprehension, and the trial court's instructions on that factor were adequate. (pp. 85-91)\n\n7. A newspaper article that quoted a juror as stating that the jury never lost sight of the fact that the victim also had a family did not demonstrate the requisite good cause for interviewing the jurors. (pp. 92-94)\n\n8. Although some of the comments made by the prosecutor were improper, they do not require reversal, especially given the curative instructions of the trial court. Further, the trial court's limiting instruction concerning evidence of defendant's arrest for using Mr. Marsh's credit cards was sufficient. (pp. 95-114)\n\n9. Given the overwhelming evidence of defendant's guilt, the cumulative effect of any trial errors was not clearly capable of affecting either defendant's conviction or his sentence. (pp. 114-115)\n\nDefendant's murder conviction and his death sentence are AFFIRMED.\n\nJUSTICE HANDLER, Dissenting, is of the view that this capital-murder prosecution was rife with errors that strike at the core of our system of capital punishment. These errors include the unbounded and undisciplined use of the aggravating factor of murder to avoid apprehension; failure to death-qualify the guilt-phase jury; and undue restrictions on defendant's ability to proffer relevant mitigation evidence.\n\nJustice O'HERN, Dissenting, in which JUSTICE HANDLER joins, is of the view that the trial court committed reversible error when it failed to instruct the jury that it need not be unanimous as to whether defendant intended to kill or to inflict serious bodily injury. Although the evidence strongly sustains the inference that defendant intended to kill, it is impossible to conclude that a juror could not have found otherwise given the proper instruction.\n\nJUSTICES POLLOCK, STEIN and COLEMAN join in JUSTICE GARIBALDI'S opinion. JUSTICE HANDLER has filed a separate Dissenting opinion. JUSTICE O'HERN has filed a separate Dissenting opinion in which JUSTICE HANDLER joins.\n\nThe opinion of the Court was delivered by\n\nGARIBALDI, J.\n\nA jury convicted defendant, Donald Loftin, of the murder of Gary K. Marsh. At the penalty-phase hearing, a separately empanelled jury returned a death-penalty verdict, and the trial court sentenced defendant to death. Defendant appeals directly to this Court as of right. See Rule 2:2-1(a)(3). We affirm defendant's conviction for murder and his sentence of death.\n\nI\n\nA. Guilt Phase\n\n1. The crime\n\nOn May 5, 1992, Gary Marsh was working the midnight to six-thirty a.m. shift at an Exxon service station located on Alternate Route One in Lawrenceville, New Jersey. Marsh had a key to the office that was located behind the gas pumps, away from the highway. At approximately 4:10 a.m., E. Thomas Citron stopped for gas at the station. He paid for his gas with a fifty-dollar bill.\n\nDavid Paddock was scheduled to relieve Marsh at 6:30 a.m. Arriving early, at approximately 6:10 a.m., he waited in his parked truck. Paddock observed a customer pull up to the pumps, wait without service, and ultimately leave. Paddock then left his truck to find Marsh.\n\nApproaching the station office, Paddock saw three large planters, a cola machine, a pile of pink slip receipts, and a half-eaten orange. The orange was found on the ground just outside the passenger door of Marsh's car. Paddock further observed the office keys in the door. The door was unlocked, but pulled closed. Marsh lay inside the office, his head in a puddle of blood. Paddock closed down the station and called the Lawrenceville Police. The murder had occurred between Citron's visit at 4:10 a.m. and Paddock finding Marsh at 6:10 a.m.\n\nMarsh lay on his back with his head located three feet from the front doorway that was located in the northeast corner of the office. Officer Maple, one of the first police officers on the scene, observed that a large amount of blood was on the floor next to Marsh's head. His feet were pointed toward the southwest (back) corner of the office. Marsh's arms were at his side and his eyes were shut. His right eye was black and blue. Although still alive, Marsh was unconscious and struggling for breath.\n\nMarsh's clothing did not appear to have been disturbed. His pockets were not turned out and he still was in possession of some personal items, including three dollar bills, some change, and lottery tickets. A spent brass shell casing was found on the office floor, four to six inches from Marsh's left ear. Further, the cash drawer sat empty on one of the counters and there was also some loose change on the floor. Closer examination of the station office revealed several crucial pieces of evidence. While no fingerprints of defendant were found anywhere in or around the station, the bullet used to kill Marsh served a similar purpose. The bullet that killed Marsh was found behind a pegboard that hung on the back wall of the office. A few of Marsh's hairs were removed from the area of the bullet hole. Later ballistics testing traced that bullet to a .380 caiber Bryco Model 48 pistol, purchased by defendant from D \u0026 S Gun Supplies of Levittown, Pennsylvania, and subsequently discovered by the police in defendant's car under the dashboard.\n\nAdditionally, Mr. Peterson, the station owner, determined that approximately ninety dollars had been taken from that evening's revenue. Moreover, although Mr. Citron reported purchasing gas from Marsh with a fifty-dollar bill around 4:00 a.m., there was no fifty-dollar bill in the proceeds or on Marsh's person. Defendant was in possession of a fifty-dollar bill at the time of his arrest. However, the two fingerprints detected on that bill did not belong to Marsh, Loftin, or Citron.\n\nFurther examination of the office revealed the absence of a struggle, a significant fact because the office is particularly small and narrow. Without taking account of the furniture in the office, the dimensions of the room are nine feet seven inches by thirteen feet, five inches. The office furniture did, however, consume considerable floor space. As Officer Maple testified, \"Nothing appeared to be touched or disturbed or moved or appeared out of place. I mean, it was . . . the office was, to me appeared basically untouched. There was no signs of any struggle or anybody going through or gone through anything there.\"\n\nMarsh never regained consciousness and died approximately nine and one half hours after he was discovered bleeding in the Exxon station. The next day, Mercer County's Chief Medical Examiner, Dr. Raafat Ahmad, conducted an autopsy and concluded that the cause of death was a gunshot wound to the head and that the manner of death was homicide. The entry wound was located in the left temporal region, with the bullet grazing the top of the left ear on entry. The bullet penetrated Marsh's skull, passed directly through both hemispheres of his brain, and exited on the opposite side at the right temporoparietal area, slightly above the right temple. Dr. Ahmad opined that the bullet's slight upward path through the skull was possibly caused by the tilting of the head on impact. The bullet caused fracturing lines to run from the top to the base of the skull on both sides. The doctor testified that Marsh's right eye was black and blue as a result of the bullet causing fractures inside the skull and the blood seeping into the eye area.\n\nDr. Ahmad observed that Marsh had no external injuries, cuts or bruises. There were no \"defense wounds\" on the hands or arms that would have been indicative of a struggle.\n\n2. The arrest\n\nBecause the police had been unable to find Marsh's wallet, Detective Burns notified each of Marsh's credit card companies that a murder and robbery had taken place. Burns requested that the Lawrenceville Police should be contacted if anyone attempted to use the cards.\n\nDefendant was arrested four days after the murder, on May 9, 1992, when he attempted to purchase a family computer from a Sears store in Pennsylvania with a Sears charge card belonging to Marsh. After selecting a computer system, defendant agreed to open a \"Sears Plus\" account in order to help finance the purchase. Defendant handed the Sears sales representative, Mr. Cassidy, the driver's license and Sears charge card belonging to Marsh.\n\nMr. Cassidy called the central credit office and spoke with John Metzler. Cassidy provided some general information to Metzler and then Metzler spoke directly to defendant, who identified himself as Gary Marsh and provided Metzler with relevant factual information, including Gary Marsh's name, social security card number, age, address, and the fact that he was employed by Exxon.\n\nMetzler discovered the message from the Lawrenceville Police as soon as he accessed Marsh's account. Metzler thereupon instructed Cassidy to stall defendant because this was a potential case of credit fraud. Mr. Metzler then called the Lawrenceville Police and thereafter the Middletown Police, as well as store security. Store security videotaped the events leading up to and including the arrest of defendant for receiving stolen property, fraudulent use of a credit card, and theft by deception. The videotape of the arrest was played to the jury at the guilt and penalty phases of the trial.\n\nA search of defendant's person was conducted at Sears, whereupon the police recovered his bi-fold wallet from his left breast pocket. The wallet did not belong to Marsh, but when Officer Burnett searched the plastic insert of the wallet at the Middletown Township police station, he found four of Marsh's cards: two credit cards, a social security card, and a health insurance card.\n\nAlso found in the wallet were both Mr. Loftin's and Mr. Marsh's driver's licenses; some identification and health plan cards in Mr. Loftin's name; various cards belonging to Mr. Marsh including credit cards, a bank card, and a vehicle registration card; a gun permit in Mr. Loftin's name from the State of Washington; a receipt [from D \u0026 S Gun Supplies of Levittown, Pennsylvania] for the purchase of a [.380 caliber Bryco Model 48 pistol and the receipt indicating that Loftin paid in full for the gun,] and a fifty-dollar bill. The items that belonged to Marsh and defendant were mixed in together, and the date and eye color on Marsh's driver's license had been altered so as to conform to defendant's appearance. None of the items in the wallet indicated that Marsh had worked at Exxon.\n\nAt the time of the offense, defendant, who was twenty-six years old, was residing with his wife Dorothy and two young children, five-year old Danielle and one-year old Jay, in Bristol, Pennsylvania. The police obtained and executed a search warrant of defendant's home and car. At his home they found a box in a closet that contained 500 rounds for a .380 caliber weapon, and a smaller box that contained 26 (of its original fifty) bullets. Various items for making one's own ammunition were also found and confiscated, including smokeless powder, reloading dies, a reloading scale, a powder measurer, and a turret press. The ammunition that was confiscated from Loftin's home was compatible with the murder weapon. An application form for a gun club was seized from the living room closet. The police also confiscated several articles of clothing from defendant's home. Neither blood nor gunshot residue was detected on any of Loftin's possessions.\n\nIn defendant's car, the police found the murder weapon, a .380 caliber gun equipped with a safety that required ten and one half pounds of weight in order to fire the gun. The gun found in defendant's car bore a serial number matching the serial number on a receipt for a recent gun purchase found in defendant's wallet. State Trooper Stephen Deady, the State's ballistics and firearms expert, testified that the spent shell retrieved along-side Marsh's head, and the bullet retrieved from the Exxon office wall behind the pegboard, had both been fired and discharged from defendant's gun. The weapon was hidden under the dashboard on the driver's side. Also in defendant's car were two magazines for a semi-automatic weapon. One magazine was empty and one was partially loaded. There was also a \"side-kick\" shoulder holster under the driver's seat.\n\nThe police additionally found a plastic mask in defendant's car. However, the mask was not confiscated as evidence, and no member of the team that searched defendant's car mentioned finding the mask. Rather, it was only during the penalty-phase cross-examination of Detective Burns that for the first time the State acknowledged the mask's existence.\n\nOn September 11, 1992, defendant was indicted on four counts: purposefully or knowingly murdering Gary K. Marsh by his own conduct, contrary to N.J.S.A. 2C:11-3a(1) and (2) (count I); felony murder, contrary to N.J.S.A. 2C:11-3a(3) (count II); first-degree robbery, contrary to N.J.S.A. 2C:15-1 (count III); and second-degree possession of a handgun with a purpose to use it unlawfully, contrary to N.J.S.A. 2C:39-4a (count IV). Defendant pleaded not guilty.\n\nSubsequently, the State served a notice of its intent to prove three aggravating factors: N.J.S.A. 2C:11-3c(4)(a) (c(4)(a)) (conviction for another murder); N.J.S.A. 2C:11-3c(4)(f) (c(4)(f)) (murder to escape apprehension for another offense); and N.J.S.A. 2C:11-3c(4)(g) (c(4)(g) (murder committed during the course of a robbery). The c(4)(a) prior-murder aggravating factor is based on an Atlantic County conviction for the March 28, 1992, knowing or purposeful murder of sixty-nine year old Sophia Fetter. Defendant was convicted of the Fetter murder on September 22, 1993. His conviction was affirmed by the Appellate Division. State v. Loftin, 287 N.J. Super. 76, 670 A.2d 557 (App. Div. 1996). We denied defendant's petition for certification concerning the Atlantic County murder. 144 N.J. 175 (1996).\n\nThe guilt and penalty phases of the trial were tried before different juries with the same Judge presiding over both phases. Defendant filed several pretrial motions including a motion to strike aggravating factor c(4)(f). Those motions were denied. The State presented witnesses and evidence, including a videotape of defendant's arrest at Sears, to establish the above-mentioned facts. Defendant did not testify and called no witnesses at the guilt phase. Prior to summations, the State moved to preclude the defense from arguing that the killing was the result of \"a robbery gone bad.\" The defense argued that it should be allowed to make arguments from the absence of evidence about what had occurred at the gas station and from Dr. Ahmad's testimony that the evidence did not preclude an accidental shooting. The trial court barred the defense from presenting the \"robbery gone bad\" argument, stating that there was not sufficient evidence to support it.\n\nOn July 8, 1994, defendant was found guilty on all counts. Specifically, the jury concluded that defendant's intent was to kill the victim, Gary Marsh, as opposed to causing him serious bodily injury. The jury also found that defendant had murdered Gary Marsh by his own conduct.\n\nB. Penalty Phase\n\nPrior to the penalty phase trial, defendant filed a Notice of Mitigating Factors which included the following four statutory mitigating factors:\n\nl. Defendant was under the influence of extreme mental or emotional disturbance insufficient to constitute a defense to prosecution, N.J.S.A. 2C:11-3c(5)(a);\n\n2. Defendant's age, 26 at the time of the murder, N.J.S.A. 2C:11-3c(5)(c);\n\n3. Defendant's capacity to appreciate the wrongfulness of his conduct or to conform his conduct to the requirements of the law was significantly impaired as the result of mental disease or defect, but not to a degree sufficient to constitute a defense to prosecution, N.J.S.A. 2C:11-3c(5)(d);\n\n4. Defendant had no significant history of prior criminal activity, N.J.S.A. 2C:11-3c(5)(f).\n\nDefendant also proposed twenty-nine specific factors pursuant to the catch-all statutory mitigating factor, N.J.S.A. 2C:11-3c(5)(h):\n\n5. Defendant was traumatized by the loss of his father at an early age;\n\n6. Defendant was traumatized by a fire he accidentally set that resulted in the loss of the family home;\n\n7. Defendant was emotionally impoverished when growing up;\n\n8. Defendant was deprived of an environment where he could verbalize his sense of loss;\n\n9. Defendant was raised in poverty;\n\n10. Defendant was deprived of a positive male role model while growing up;\n\n11. Defendant was a considerate and loving son;\n\n12. Defendant provided his siblings with a positive sense of direction;\n\n13. Defendant developed and evidenced strong spiritual and religious standards;\n\n14. Defendant assumed the responsibility of the man in the family before he was emotionally and financially prepared to do so;\n\n15. Defendant was forced to become estranged from his family after he got married, choosing to align himself with his wife at the expense of his family of origin;\n\n16. Defendant was traumatized by the loss of his first son, but did not have the support of his mother to help him deal with his pain;\n\n17. Defendant maintained employment and provided for his wife and children;\n\n18. Defendant served in the United States Navy;\n\n19. Defendant attended Bucks County Community College;\n\n20. Defendant shared a positive relationship with his wife and children;\n\n21. Defendant had been a model prisoner;\n\n22. Defendant had led a crime-free and productive existence for the first 26 years of his life;\n\n23. Defendant had been generous to those less fortunate than himself;\n\n24. Defendant was under the influence of mental and emotional pressure at the time the crime was committed;\n\n25. Defendant was suffering from impaired mental capacity at the time the crime was committed;\n\n26. Defendant was a loving father;\n\n27. Defendant's execution would be a hardship to his family;\n\n28. Defendant's execution would be a hardship to his 5 year old daughter, Danielle;\n\n29. Defendant's execution would be a hardship to his 3 year old son, Jay;\n\n30. Defendant had the love and support of his family;\n\n31. Defendant had sincere and heartfelt remorse;\n\n32. Defendant offered the State to plead guilty in exchange for a life sentence;\n\n33. Any other mitigating evidence presented at the trial.\n\nNumerous motions were made before the penalty phase of the trial began on November 14, 1994. On September 13, 1994, the trial court granted defendant's motion to expand the allotted peremptory challenges, providing him with five additional challenges and the State with three. The trial court denied defendant's request to establish the \"likelihood that defendant would die in prison\" as an additional mitigating factor under the catch-all factor. The court granted the State's motion to strike mitigating factors twenty-seven through thirty as irrelevant. However, the court later reversed its ruling on mitigating factor thirty.\n\nA separate penalty-phase determined whether defendant deserved to die. The aggravating factors offered by the State were: (1) evidence of a prior murder, (2) murder during the course of a robbery, and (3) murder to avoid apprehension.\n\nAt the penalty phase, the State called many of the same witnesses that appeared at the guilt phase including Gunnar Marsh (Gary's father), Dr. Ahmad, David Paddock, Edward Peterson, Officer Mosner, Detective Burns, Officer Burnett, and Trooper Deady, all of whom testified in a manner consistent with the evidence adduced at the guilt phase. Gunner Marsh added, however, that Gary did not know defendant, nor did he own or carry a handgun. Detective Burns indicated that a mask had been found in defendant's car. Dr. Charles Martinson, the State's expert, testified that defendant indicated that he had been wearing the mask during the robbery. As at the guilt phase, the Sears surveillance videotape was shown to the jury.\n\nWith respect to the prior murder aggravating factor, the parties stipulated that defendant had been convicted of the March 28, 1992 murder of Sophia Fetter, by a single gunshot wound to the head. Ms. Fetter was sixty-nine years old and a total stranger to defendant. While the court instructed the jury that defendant received thirty years without parole on the Atlantic County sentence, the defense was not permitted to submit to the jury, in mitigation of punishment, that a second life sentence imposed as a result of the Marsh murder would result in defendant's likely dying in prison.\n\nIn mitigation, defendant called Charles Jurman, his attorney at the Fetter murder trial. Jurman testified about defendant's willingness to accept the Mercer County Prosecutor's Office tentative plea offer of consecutive life sentences in exchange for defendant pleading guilty to both Fetter and Marsh murders. Jurman, however, acknowledged that the State had never formalized that offer. Jurman also testified that defendant had no prior criminal record, aside from the Atlantic County murder, the Mercer County murder, and the related credit-card offenses in Pennsylvania. He also stated that defendant was not a drug user, alcoholic, or compulsive gambler. Over the defense's objection, Jurman testified that his investigation for and experience in representing defendant failed to reveal that defendant suffered from any mental disease or defect that could be raised as a defense to the prosecution of the Atlantic County murder.\n\nNext, Jennifer Blumberg, a penal counselor at the Mercer County Detention Center, testified that no \"major\" disciplinary actions had been brought against defendant and that he was a \"model inmate.\"\n\nDefendant did not testify, but told the story of his life primarily through Carmeta Albarus, an expert in conducting psychosocial histories, Dr. Dougherty, a defense psychologist, and a few close family members.\n\nAlbarus constructed a social history of defendant by engaging in repeated interviews with him, his family members, and with other significant people in his life. Albarus also personally reviewed institutional records on defendant such as his school, Navy, and employment records. The goal of her investigation was to explore patterns of behavior in the family system in order to help her draw Conclusions about defendant. On cross-examination, the State brought out that Albarus was not a psychiatrist, psychologist, social worker, or attorney. She also acknowledged that all of her prior appearances in capital cases had been on behalf of defendants.\n\nAlbarus testified that defendant was one of seven children born to Fred and Ellen Loftin. Fred Loftin was the more nurturing parent, but a poor provider. When Donald was five, Fred Loftin suddenly disappeared. Mrs. Loftin was left pregnant, with seven children, and a great amount of debt.\n\nMrs. Loftin worked constantly and extremely hard to keep her children dressed, fed, and educated. Albarus testified that the strain of being the sole provider meant Mrs. Loftin was rarely home, and that she had little ability to nurture the children at home. Albarus believed that Mrs. Loftin was never able to relate to her children in a warm or maternal manner because she came from a dysfunctional and abusive upbringing and dealt with extraordinary stresses.\n\nIn the year following Fred Loftin's abandonment of his family, conditions deteriorated. Defendant, at six years old, set his mattress on fire and as a result the family home burned to the ground. The Loftins, already on public assistance, were moved to a one bedroom hotel room. Though only planning to stay for a brief period, the Loftins actually remained for an extended period. Defendant never received counseling to explore why he acted out in this manner or to help him with the guilt and trauma of causing such a significant event.\n\nAlbarus related that Fred Loftin did attempt to resurface in the children's lives on two separate occasions. In the first instance, when defendant was approximately eleven or twelve, Fred Loftin called his family and invited his children to visit him in Denver, Colorado. Defendant was the only child that refused to meet his father. In the second instance, Fred Loftin came home to visit. Although the transcript is unclear, it appears that defendant was in his early twenties when his father returned. At that time, defendant did confront his father, demanding an answer to why he had left the family. Defendant received no explanation, and never fully resolved the issue. Although Albarus testified on direct that defendant's father's departure \"traumatized\" defendant, she acknowledged that a report prepared by Dr. Ryno Jackson, a defense-retained psychiatrist, concluded that \"Donald does not recall having any feeling regarding his father's leaving.\"\n\nAccording to Albarus, defendant was always struggling to \"do the right thing\" and be the \"perfect son.\" Even when younger, he seemed to want to take responsibility for his mother. Although defendant did drop out of school during a brief stint of marijuana use in his early teens, he soon found a flyer advertising the road to salvation through Jesus. Defendant chose to pursue that avenue. Returning to school, defendant completed his G.E.D. The testimony adduced at trial indicates that defendant actually expended significant time and effort trying to help his siblings get on or stay on the right path.\n\nWhen defendant was twenty-years old, he married Dorothy McMillan. According to Albarus, as a result of Ellen Loftin's strong disapproval, defendant felt compelled to abandon his first family in order to remain loyal to his new family. The separation was most painful when Donald and Dorothy's first son was stillborn and Mrs. Loftin did not attend the funeral.\n\nDefendant and Dorothy had a conflict-filled relationship, although the extent to which the conflicts manifested themselves in various forms of domestic violence was disputed at trial. The conflicts seemed to have several roots. First, defendant and Dorothy each had their own, rather uncompromising, visions of the proper role for a wife. Defendant's vision was far more conservative. Conflicts in the marriage also seem to have been rooted in, or exacerbated by, defendant's inability to achieve the success he desired. Defense experts suggested that Donald wanted to be the provider that his father was not. Defendant went through a number of careers, never attaining the goals to which he aspired. Defendant moved himself and his family to Denver. He eventually joined the Navy and was fairly successful. Within a year, he was assigned to ship duty. Unable to stand the idea of separation and survival in a new place with their young daughter, Dorothy Loftin attempted suicide on the day that defendant was scheduled to sail. He then obtained a general discharge to attend to his wife.\n\nAfter his discharge from the Navy, defendant sent Dorothy home to her family in Pennsylvania. Eventually, however, defendant did return home to live with Dorothy's family and work with his father-in-law. Defendant then decided to return to auto-mechanic school. While successfully completing his training at Lincoln Institute, defendant never obtained a job as a mechanic. Rather, he was able only to find work washing cars. Ultimately he and his wife each decided to return to school at Bucks County Community College. Dorothy Loftin did very well at college, but defendant was not performing on a passing level. He refused to seek counseling for his grades or to handle the depression and frustration resulting from his performance.\n\nAlthough the conflicts can be identified with some certainty, how these conflicts manifested themselves within the relationship is less clear. Probation Officer Daria Christie, the Atlantic County case supervisor who prepared the presentence report following defendant's conviction for the Fetter murder, testified that in a phone interview Dorothy Loftin indicated that she was unhappy in the marriage, that defendant was \"very spiteful\", and that defendant \"frequently abused\" her and the children. Rather than taking responsibility for his actions, Dorothy Loftin reportedly said that defendant shifted the blame. Christie also testified that Dorothy Loftin refrained from calling the police because she was fearful of defendant. Dorothy Loftin also allegedly reported that defendant was mentally abusive.\n\nWhen questioned on direct and cross-examination, however, Dorothy Loftin denied ever stating that defendant \"abused\" her or the children. Although Mrs. Loftin acknowledged that defendant hit her on one occasion, she testified that she did not call the police because she had no bruises and did not see a need to call; she denied that she feared reprisal if she called.\n\nBoth the defense and the State presented testimony of psychologists who evaluated defendant's mental health. Dr. Edward J. Dougherty, a defense psychology expert, concluded that defendant's aberrant behavior was consistent with the fact that he suffered from \"borderline personality disorder.\" On direct examination, Dr. Dougherty explained that the disorder manifests as\n\na pervasive pattern of instability of personal relationships. Self-image sometimes marked passivity. [sic] Begins in early adulthood and appears in various ways. It takes a long to develop. It is a very serious personality disorder.\n\nA person is believed to suffer this disorder if he or she satisfies five out of nine criteria set forth in the American Psychiatric Association's Diagnostic and Statistical Manual (DSM-IV). Dr. Dougherty testified that defendant met six or seven of the nine criteria.\n\nHe demonstrated: (1) frantic efforts to avoid real or imagined abandonment . . . (2) a pattern of unstable and intense interpersonal relationships characterized by alternating between extremes of idealization and devaluation (overridealization of his wife and mother); (3) identity disturbance: markedly and persistently unstable self-image or sense of self; (6) affective instability due to a marked reactivity of mood . . . (7) chronic feelings of emptiness . . . (8) inappropriate, intense anger or difficulty controlling anger . . . and (9) transient, stress-related paranoid ideation or severe dissociative symptoms.\n\nDr. Dougherty further opined that defendant was experiencing moderate to severe symptoms when he committed the offenses. Dougherty based this Conclusion on the degree of stress that defendant was laboring under at the time. Unlike the structured environments that defendant had experienced in the Navy, auto-mechanic school, or prison, defendant was struggling through a period where he did not have structure or stability. He was failing objectively -- in school, in his relationship with his wife, in his employment endeavors -- yet fighting to maintain the image he hoped to achieve by putting on the appearance of success. Dr. Dougherty explained that\n\nDonald Loftin sees the world in black and white . . . no grey areas. This is how he Judges people and life. And when he doesn't see, when he starts being faced with the reality of the world, there are gray areas in everything, he can't handle it. Dealing with people, dealing with jobs, dealing with identity.\n\nThe defense also called numerous family members who corroborated much of the factual background information provided by Albarus, described their relationships with defendant, and begged the jury to spare his life. Some of the family members who testified included defendant's wife, parents, sisters, twin brother, and his father-in-law. None of these witnesses testified that defendant was abused during his childhood, and all indicated that defendant's mother was devoted to her children.\n\nIn rebuttal, the State called Dr. Charles Martinson as its psychiatric expert. Dr. Martinson concluded that defendant did not suffer from any mental illness, disease, defect, or disorder as defined in the DSM-IV. Rather, Dr. Martinson asserted that defendant committed the murder for economic reasons. Dr. Martinson added that the only \"remorse\" defendant exhibited occurred when he learned that Marsh held two jobs. Defendant's responses in a \"sentence completion test\" administered by a defense-retained psychologist also revealed defendant's lack of remorse. For example, when asked to complete the sentence beginning \"My greatest mistake was . . .\" defendant wrote, \"become incarcerated.\" \"I don't know how . . .\" was completed to read \"I allowed myself to get into this predicament.\" \"I feel bad when . . .\" was completed with \"I think about my family.\" \"It hurts when . . .\" was completed with \"things I have achieved in life are taken away\" and \"I only wish that . . .\" was completed with \"racism is banished from society.\"\n\nDr. Martinson also concluded that defendant did not suffer from a borderline personality disorder when he murdered Marsh. Instead, he opined that defendant exhibited narcissistic and antisocial personality traits. On cross-examination Dr. Martinson acknowledged, however, that defendant did exhibit some signs of emotional distress.\n\nAlthough defendant did not testify, he did exercise his right of allocution. See, (infra), at ___ (slip op. at ).\n\nOn December 6, 1994, the jury returned a death sentence, finding that the State has proved each of the three aggravating factors beyond a reasonable doubt. Although at least one juror had found the existence of the statutory mitigating factors, N.J.S.A. 2C:11-3c(5)(a) and N.J.S.A. 2C:11-3c(5)(c), and at least one juror had found the existence of seventeen of the proffered non-statutory mitigating factors, the jury unanimously found that the three aggravating factors outweighed those nineteen mitigating factors. The jury further found that each aggravating factor individually outweighed the mitigating factors beyond a reasonable doubt.\n\nDefendant was sentenced to death on count I, knowing or purposeful murder. Defendant's conviction for felony murder, count II, was merged into his conviction for capital murder. Defendant was sentenced to a term of twenty years with a ten-year parole disqualifier on count III. He was sentenced to a term of five years with a two and one-half year parole disqualifier on count IV. The sentences on counts III and IV were made concurrent to count I. The sentences were run consecutive to the life sentence that defendant was serving for the Atlantic County murder conviction.\n\nA Notice of Appeal was filed with this Court on January 11, 1995. As a result of an article appearing in The Trentonian on the day after the penalty-phase jury returned the verdict, the defense submitted and argued a motion to interview the penalty-phase jurors. That motion was denied. Defendant's motion for a limited remand was denied by this Court.\n\nDefendant made two motions to expand the record, seeking to include the autopsy report and affidavits stating that the prosecutor failed to provide defense counsel with proper notice in advance of obtaining the Atlantic County presentence report. Both motions were granted.\n\nII\n\nConstitutionality of the Act\n\nDefendant argues that the death-penalty statute violates the prohibition against cruel and unusual punishment contained in the Eighth Amendment of the federal Constitution. We have repeatedly rejected similar arguments, see, e.g., State v. Harris, 141 N.J. 525, 574 (1995); State v. Biegenwald, 126 N.J. 1, 16 (1991) (Biegenwald IV); State v. Moore, 122 N.J. 420, 486 (1991); State v. Ramseur, 106 N.J. 123, 185-97 (1987), and continue to reject them today.\n\nIII\n\nGuilt-Phase Issues\n\nA. Death-qualification of guilt-phase jury\n\nIn Lockhart v. McCree, 476 U.S. 162, 106 S. Ct. 1758, 90 L. Ed. 2d 137 (1986), the United States Supreme Court approved of the practice of \"death qualifying\" jurors. \"Death qualification\" excludes for cause those jurors whose views \"would prevent or substantially impair the performance of [their] duties.\" Adams v. Texas, 448 U.S. 38, 45, 100 S. Ct. 2521, 2526, 65 L. Ed. 2d 581, 589 (1980); see also Ross v. Oklahoma, 487 U.S. 8 1, 85-89, 10 1L. Ed. 2d 80, 108 S. Ct. 2273, ___, 101 L. Ed. 2d 80, 88-90 ( 1988)(clarifying that death-qualification entails excluding jurors who would either always oppose or always support death penalty); Ramseur, (supra) , 106 N.J. at 248-56 (requiring New Jersey trial courts to follow Adams test). To death-qualify jurors, the trial court informs them of the capital nature of the case and then questions them closely on their views of capital punishment.\n\nTwo separate juries were empaneled for the guilt and penalty phases of defendant's capital trial because one of the aggravating factors cited by the State for the penalty phase was a prior murder conviction. To avoid the \"blinding impact\" of the prior murder on the determination of guilt, this Court has required separate juries. Biegenwald IV, (supra) , 126 N.J. at 43-44. The penalty-phase jury was fully death qualified.\n\nPrior to jury selection for the guilt phase, defense counsel made clear his objection to death qualification of the jurors who would determine guilt:\n\nJudge, as I stated on the record yesterday, my position is that there should be no mention whatsoever that this is a death penalty case. I mean, as far as I'm concerned that issue is totally irrelevant as to whether this jury determines that Mr. Loftin committed the offense or not. They're determining the guilt or innocence, not death.\n\nI agree with the State there is some impact and the impact is prejudicial. Any time you mention death penalty to jurors or prospective jurors, certain things start going on in their heads. And I think when the juror hears it's a death penalty [case, the juror might think that] this guy is guilty that's why the State is seeking the death penalty. . . .\n\nUltimately, the trial court agreed not to inform the jury of the potential death penalty in the case, but decided that if a juror asked about the potential sentence, the trial court would not lie; if the juror was unable to fairly and impartially decide that issue, then that juror would be removed. Defense counsel again complained:\n\nObviously, the only individuals that are going to say, look, your Honor, I can't sit are the individuals that are against the death penalty. . . . So what we're going to have, if we use that suggestion, Judge, is a jury packed with people pro-death penalty.\n\nHowever, no juror asked about the potential sentence, and thus the guilt-phase jury deliberated without being death-qualified.\n\nDefendant contends that the trial court's failure to sua sponte death-qualify the guilt-phase jury and inform the jurors, during voir dire and during the jury charge at the close of trial, of the potential consequences of their decision, violated his constitutional rights by \"diluting the jury's responsibility for the imposition of the death penalty,\" constituting plain error. State v. Mejia, 141 N.J. 475, 485, 662 A.2d 308 ( 1995) (quoting State v. Bey, 112 N.J. 123, 164, 548 A.2d 887 ( 1988) (Bey II)).\n\nIn Biegenwald IV, (supra) , 126 N.J. at 44, we stated that we \"most likely will require a two-jury system for all capital cases in which the State seeks to prove [the c(4)(a)] factor.\" In reaching that Conclusion, we recognized the differences between a jury's function in the guilt phase and in the penalty phase.\n\nPrior-murder convictions are relevant to the determination of the appropriate sentence because the sentencing phase focuses in part on the character of the defendant. The guilt phase, however, is limited to a determination of what the defendant did. See United States v. Myers, 550 F. 2d 1036, 1044 (5th Cir. 1977) (\"A concomitant of the presumption of innocence is that a defendant must be tried for what he did, not who he is.\"), cert. denied, 439 U.S. 847, 99 S. Ct. 147, 58 L. Ed. 2d 149 (1978). Because of the prejudice that could be engendered by voir dire prior to the guilt phase about a defendant's other murder convictions that are not otherwise admissible as evidence during that portion of the case, see Evid. R. 55, that questioning should almost invariably come only after a jury has found a defendant death eligible. See Pinnell, (supra) , 311 Or. at 121, 806 P. 2d at 116 (finding that \"objective of a bifurcated trial was thwarted\" by voir dire before guilt phase that \"implied that defendant had previously been convicted of other crimes\").\n\n[Id. at 44-45.]\n\nIn State v. Erazo, 126 N.J. 112, 133 (1991), we again stated our belief that \"[a] separate jury [for the penalty phase] would obviate death qualification of the guilt-phase jury.\" In Mejia, (supra) , however, we held that trial courts in capital cases \"must inform juries of the legal effect of their findings.\" 141 N.J. at 485. Both Mejia and Bey II involved one jury for both the guilt and penalty phase hearings and neither involved the prejudicial impact of factor c(4)(a) on a defendant.\n\nThat knowledge of a defendant's prior conviction would have a \"blinding impact\" on a defendant's subsequent conviction is undisputed. Biegenwald IV, (supra) , 126 N.J. at 43-43. Moreover, defense counsel asserts, as have defense counsel in other cases, that death-qualifying a jury prior to the guilt phase produces conviction-prone juries. See, e.g., Lockhart, (supra) , 476 U.S. at 173, 106 S. Ct. at 1764, 90 L. Ed. 2d at 147 (discussing studies that purported to prove that \"'death qualification' in fact produces juries somewhat more 'conviction-prone' than 'non-death qualified' juries\"). Whether defense counsel is correct that death qualification results in death-prone juries is a debatable issue that we need not decide in this case.\n\nEven in death-penalty cases, we have held that \"except in the most extreme cases, strategic decisions made by defense counsel will not present grounds for reversal on appeal.\" State v. Marshall, 123 N.J. 1, 93, 586 A.2d 85 ( 199 1) (Marshall I). Thus, in Marshall I, (supra) , we found no error when the court conducted a limited death qualification at voir dire pursuant to defense counsel's request. Ibid. Therefore, if defense counsel objects to the death-qualification of the guilt-phase jury in a case involving aggravating factor c(4)(a), a trial court shall deem such an objection to be a waiver of defendant's right to a death-qualified jury in the guilt-phase. However, in the absence of any such objection, trial courts will give guilt-phase jurors a severely restricted death qualification, specifically not informing them of defendant's prior conviction for murder. That result presents a proper balance between the concerns expressed by defense counsel that a death-qualified jury is more prone to convict and the Court's holding that jurors should be told \"of the legal effects of their findings.\" Mejia, (supra) , 141 N.J. at 485 (quoting Bey II, (supra) , 112 N.J. at 164-65).\n\nBecause defense counsel made a strategic decision that a death-qualified jury might be more prone to convict and objected to the death-qualification of guilt-phase jurors, his decision does not provide grounds for a finding of plain error.\n\nB. Voir Dire\n\n1. Individualized voir dire\n\nDuring the guilt phase, without objection, the trial court conducted an in banc voir dire of the jury. Sixteen prospective jurors from the entire venire were called for questioning and told to provide responses to any question that applied to them. The court instructed the remaining venire to \"listen very carefully to all of the court's remarks and questions. In the event that one or any of these persons are excused, then it's going to be necessary to replace them with someone from the courtroom. Rather than repeat all of the questions . . . I'm simply going to ask you if you've heard everything . . . and whether or not you have any responses.\" The court further repeatedly instructed the jurors that, if they felt uncomfortable responding to any question, they could wait for a few more questions and then raise their hands and seek a sidebar meeting to discuss the issue on a more private level.\n\nThe court then read the entire indictment. It asked whether the jurors knew anything about the case. The trial court next described the location where the crime took place, and asked if anyone was familiar with that location. The trial court again questioned all jurors furnishing affirmative responses and asked counsel whether additional questioning was needed.\n\nThe next day the court continued voir dire and employed the same procedure, again encouraging jurors to approach the court at sidebar to discuss sensitive issues. The court listed all potential witnesses and individuals whose names were likely to be mentioned during trial, asking whether any juror knew any of them. Given that many witnesses would be law enforcement officers, the court asked whether any juror would be inclined to give more or less weight to their testimony. The trial court also inquired whether any juror, their family, or close friends had ever been employed by the Mercer County Prosecutor's Office or any other law enforcement agency; whether they had been victims of a crime; had ever been accused of a crime; whether they had prior service on a grand or petit jury, and, to those who acknowledged prior civil jury service, explained the differing burdens involved in civil and criminal actions. If a juror responded affirmatively to any of these questions, the court questioned that juror more specifically.\n\nEach juror was then required to provide pedigree information such as name, residence, marital status, and occupations of themselves and their spouses. For every juror, the court turned to counsel and asked whether they had \"any additional questions or applications\" and, at the end, asked counsel if they desired additional sidebar. To each request, counsel responded negatively.\n\nR. 1:8-3(a) provides that \"the court shall interrogate the prospective jurors in the box after the required number are drawn without placing them under oath. . . . At trials of crimes punishable by death, the examination shall be made of each juror individually, as his name is drawn, and under oath.\" Defendant contends that the in banc voir dire violated both the requirement of R. 1:8-3(a) and also failed to provide the \"heightened\" need for juror impartiality in capital cases (citing State v. Williams, 93 N.J. 39, 6 1, 459 A.2d 64 1( 1983) (Williams I)).\n\nAn individualized voir dire is required in capital cases pursuant to R. 1:8-3(a) for two reasons. One purpose is to ascertain \"whether [the juror's opinion regarding capital punishment] disables him from discharging the statutory duty to decide what the punishment should be.\" State v. Mathis, 52 N.J. 238, 245, 245 A.2d 20 ( 1968)(emphasis added), rev'd in part on other grounds, 403 U.S. 946, 9 1S. Ct. 2277, 29 L. Ed. 2d 855 (1971); see also State v. Williams, 113 N.J. 393, 413, 550 A.2d 1172 (1988) (Williams II)(viewing extensive voir dire as necessary to death-qualify the jury). The second purpose behind the individualized voir dire is to ensure that attorneys are more informed and better able to exercise their challenges in order to ensure an impartial jury. Ibid. While an in banc voir dire is ordinarily deemed adequate to ensure an impartial jury, we insist on an individualized voir dire for capital cases \"because of the range of discretion entrusted to a jury in a capital sentencing hearing.\" Turner v. Murray, 476 U.S. 28, 35, 106 S. Ct. 1683, ____, 90 L. Ed. 2d 27, 35 (1986)(affirming conviction but reversing sentence due to failure to conduct voir dire adequate for sentencing jury). Because juries have so much more discretion, there is a greater need to screen out those jurors who cannot be impartial.\n\nWe find no error in the trial court's decision to conduct an in banc voir dire. In State v. Manley, 54 N.J. 259, 282-83, 255 A.2d 193 (1969), the Court set forth the reasons for the adoption of R. 1:8-3(a) and its belief that the in banc procedure would provide an impartial jury. The purposes behind an individualized voir dire are unique to the sentencing phase. The guilt-phase jury in this case was not determining the sentence, and thus was not deciding a case in which death could be the punishment. Therefore, R. 1:8-3(a) does not require an individualized voir dire. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nMoreover, defendant's claim that an individualized rather than an in banc proceeding would have led to more candid responses by jurors is unsupported by the evidence. There is no indication in the record that the prospective jurors were not fully candid with the court or would have been more candid if they were asked the questions in an individualized voir dire. Defendant points to jurors who failed to disclose criminal backgrounds; however, those jurors were all questioned at sidebar, in an individualized manner, yet still failed to disclose the information. Because all the examples cited by defendant occurred initially at sidebar when a new panelist replaced a prospective juror struck by a preemptory challenge, defendant's assertion that prospective jurors kept silent for fear of other people learning their secrets is unfounded.\n\nAlthough no voir dire is perfect, State v. Martini, 131 N.J. 176, 217 (1993) (Martini I), we are satisfied that this voir dire was sufficient to secure an impartial jury in the guilt phase. The trial court's voir dire was thorough and probing. After eight peremptory challenges by the defense and seven by the State, both the defense and the State agreed that the empanelled jury was satisfactory.\n\n2. Adequacy of voir dire on racial bias\n\nWe have previously held that when, as in this case, the trial involves an interracial murder, defendant is entitled to have the potential jurors questioned about prejudices and biases. Ramseur, (supra) , 106 N.J. at 243-48; see also State v. Horcey, 266 N.J. Super. 415, 418, 629 A.2d 1367 (App. Div. 1993)(\"Whenever there is a racial or ethnic difference between victim and accused, at defendant's request the trial Judge should inquire of the prospective jurors as to whether the disparity will affect their ability to be impartial.\").\n\nPrior to voir dire, defense counsel requested that the trial court ask the following questions:\n\nMr. Loftin is a black man, victim white, would that in any way prejudice or influence your sitting as a juror in this case?\n\nDo you know of any reason, such as prejudice, bias, or other opinion that you can think of that would prevent you from serving as a completely impartial juror?\n\nThe trial court agreed to ask the first question and noted that the other question would come out in the court's own extensive voir dire. The court informed defense counsel that \"if at the end of the court's preliminary questioning of the jurors you still have additional questions that you'd like to raise from this list, we can address it at that time.\"\n\nThe trial court gave the following instruction to the prospective jurors:\n\nBut in deciding what the facts are, you are to do so without bias, without prejudice, without sympathy, passion, or favor of any kind, and I'm going to talk a little bit more about bias and prejudice, because for most of us, when we hear the word prejudice, we get defensive because we don't want anybody to think or accuse us of being prejudiced. And that's why I asked that question yesterday.\n\nI pointed out to you that the defendant in this case is an African-American and that the victim in this matter is white, and I asked would any of you make a decision in this case based on the racial makeup, and you all answered no. . . .\n\nWe need to find a little bit about yours, so these attorneys can make a decision as to whether or not your bias or prejudice will impact on your ability to be fair and impartial in this case.\n\nSo I'm going to give you an example. And it's a very simplistic example, but I don't want you to think that because the example is simplistic that I'm not trying to make a serious point. I keep emphasizing your responsibility as a juror is very, very critical. . . .\n\nThe example I'm going to use is a sports example. I am a diehard Cowboys fan. . . . Now, you know, the attorneys in this courthouse know where I'm going from. And some of them are real bold. They let me know, I don't like the Cowboys. How do I handle that? . . . .\n\nGetting back to the attorneys, when they walk in here, do I tell them you can't get Justice because you don't have the . . . right attitude. . . . Do I take that kind of attitude and be open about my bias, or do I take the more subtle approach? . . . .\n\nObviously, isn't that how we deal with our biases and prejudices. This is 1994. We don't go out and openly tell people how we feel about things. Only you know that, but we ask you if have a bias or if you have a prejudice that would affect your ability to be fair to the State of New Jersey and fair to the defendant, tell us about it. You don't -- you can wait a couple of questions, you can do it at sidebar, but if you believe that you have any bias that could affect your ability to be fair and impartial, please raise your hand.\n\nDefense counsel never objected to this explanation or sought to ask additional questions. Defendant now, however, claims that the trial court's failure to question jurors more extensively was plain error. First, defendant contends that the trial court's question invited only one answer, namely, that jurors are not racist. See Moore, (supra) , 122 N.J. at 449. Second, defendant argues that the football analogy trivialized the issue.\n\nWe find defendant's contentions to be without merit. We have often held that a general question about racial prejudice is sufficient absent a specific request or objection from defense counsel seeking more probing questions. See, e.g., State v. Perry, 124 N.J. 128, 157, 590 A.2d 624 (1991)(finding one general question investigating potential presence of \"any passion, prejudice, sympathy or bias\" is sufficient absent request from counsel for more specific inquiry); State v. McDougald, 120 N.J. 523, 550-51, 577 A.2d 419 (1990)(finding one general question sufficient to probe bias and prejudice where defense counsel also had freedom to inquire); Ramsuer, (supra) , 106 N.J. at 244-48 (finding general question sufficient and commenting on ability of counsel to probe further). The trial court invited defense counsel to suggest additional questions if necessary, but defense counsel made no such request.\n\nJustice Handler argues that the trial court had a duty to conduct a further inquiry because defendant was charged with an interracial crime. Post at ___ (slip op. at 27-32) (Handler, J., Dissenting). However, that complaint ignores the basic principle of Perry, MacDougald, and Ramseur, that \"a capital defendant accused of an interracial crime . . . cannot complain of a Judge's failure to question the venire on racial prejudice unless the defendant has specifically requested such an inquiry.\" Turner, (supra) , 476 U.S. at 37, 106 S. Ct. at ___, 90 L. Ed. 2d at 37. Defense counsel asked for a general inquiry into bias, and the Judge honored that request. \"We in no way require or suggest that the Judge broach the topic sua sponte.\" Id. 476 U.S. at 37 n. 10, 106 S. Ct. at ___ n. 10, 90 L. Ed. 2d at 37 n.10.\n\nWe find that the trial court's question was proper and appropriate. The court's football example may not have been ideal, but it adequately conveyed the point.\n\nC. Limitation on defense theories\n\n1. Refusal to allow cross-examination about other perpetrators\n\nDefendant did not testify, nor did he present any witnesses at the guilt phase of the trial. Rather, the defense pursued the following three theories to raise doubt about whether he had committed the murder of Marsh: (1) that there were multiple perpetrators involved in the robbery, or third-party guilt; (2) that defendant did not commit the crime but only found the wallet after the murder; and (3) that the murder resulted from a \"robbery gone bad.\"\n\nIn cross-examining members of the police force who had investigated the Marsh murder, defendant attempted to elicit testimony supporting the theory that multiple perpetrators may have been involved in the robbery of the Exxon station. The trial court twice refused to allow certain questions of police witnesses, and defendant complains that those restrictions deprived him of his right to confront witnesses and present a defense.\n\nN.J.S.A. 2C:11-3c limits death-penalty eligibility to those defendants convicted of murder committed by their own conduct. \" capital-murder defendant may focus his or her efforts in the guilt phase on raising a reasonable doubt about issues that trigger the penalty phase, rather than vigorously contesting guilt or innocence on the murder charge.\" State v. Brown, 138 N.J. 481, 517, 651 A.2d 19 (1994).\n\nPatrolman Thomas Maple was called by the State to testify about the police investigation of the murder scene. During direct examination, the officer described the police arrival at the scene, the appearance of the gas station, and the victim's appearance. Maple further testified that there was no evidence of a struggle. During his testimony, Maple relied upon his partner's report of the crime scene to refresh his recollection.\n\nDuring cross-examination, defense counsel attempted to ask the following question: \"Patrolman Maple, was there anything in your investigation on May 5th, 1992 between 6:15 in the morning and 9:00 in the morning which would eliminate the possibility of multiple actors involved with this particular robbery/homicide?\" The trial court sustained an objection, finding that the question was outside the scope of direct examination. The trial court added: \"to the extent that you want to cover areas not covered by his direct examination, I do believe he is listed on the defense witness list. . . . You want the officer to be available for recall on defense case, you certainly may do that, but this line of questioning must stop.\" Defendant chose not to call Maple and address these questions.\n\nCross-examination is generally limited to the scope of direct examination, N.J.R.E. 611(b). At trial, defense counsel argued that the question was within the scope of direct examination because the report written by Maple's partner that Maple used to refresh his recollection, discussed \"suspects,\" raising the implication of multiple perpetrators. The trial court correctly rejected that attempt, because that reference to a single line in a report that was not admitted into evidence did not constitute part of the direct examination. Defendant now contends that, because Maple discussed the crime scene, it was legitimate to question him about whether the crime scene revealed any evidence about multiple perpetrators. That contention would bring the question into the scope of direct examination if trial counsel had raised it with the trial court. However, any error was harmless because the trial court clearly informed defendant that he could recall Maple and raise those questions. R. 2:10-2. Thus, defendant's right to present a defense was not compromised at all.\n\nThe State also presented Sergeant Joseph Mosner. Mosner described the layout of the gasoline station and the office, including the locations where blood and bullets were found. Defense counsel then cross-examined Mosner about the details of his description of the layout, and elicited from the officer the fact that the police had found several fingerprints in the office (none matched the defendant). Then, suddenly, defense counsel asked: \"Sometime later you were asked to check or investigate the brother of Donald Loftin, Ronald Loftin?\" The trial court refused to allow the question under the third-party guilt doctrine.\n\nThe third-party guilt doctrine is implicated when a defendant \"seeks to prove that another agency produced the death with which he is charged.\" State v. Sturdivant, 31 N.J. 165, 179, 155 A.2d 771 (1959), cert. denied, 362 U.S. 956, 80 S. Ct. 873, 4 L. Ed. 2d 873 (1960). Because of the ease in which unsupported claims may infect the process, we have held that third-party guilt evidence is admissible only when \"the proof offered has a rational tendency to engender a reasonable doubt with respect to an essential feature of the State's case.\" Ibid. In State v. Koedatich, 112 N.J. 225, 300, 548 A.2d 939 (1988) (Koedatich I), cert. denied, 488 U.S. 1017, 109 S. Ct. 813, 102 L. Ed. 2d 803 (1989), we reaffirmed the Sturdivant standard and noted that \"the issue of whether the trial court abused its discretion in excluding evidence of third-party guilt is a particularly fact-sensitive one.\" However, courts have recognized that evidence that tends to create reasonable doubt that someone else, generically, rather than defendant, committed the offense, is admissible. State v. Jorgensen, 241 N.J. Super. 345, 351, 575 A.2d 31 (App. Div.), certif. denied, 122 N.J. 386 (1990). Thus, in Koedatich I, the defendant sought to introduce testimony that a small sports car was in the vicinity of the murder, while the defendant drove a large car; the defendant further sought to introduce evidence that an identified third-party owned such a sports car. We refused to allow testimony about the specific third-party since no evidence linked that person to the crime; however, we did allow evidence about the sports car since it tended to create reasonable doubt about whether someone other than the defendant committed the crime. Koedatich I, (supra) , 112 N.J. at 306.\n\nDefendant does not argue, nor did he argue at trial, that he has any evidence linking his brother to the crime. Thus, the trial court correctly applied Koedatich I and Sturdivant in refusing to allow any questions about Ronald Loftin. As in Koedatich I, defendant was free to introduce evidence tending to prove that a generic \"someone else\" did the crime, but he could not identify any specific individual without more notice. The trial court's ruling was therefore correct.\n\n2. Limitations on defense counsel's summation\n\nPrior to closing statements, the trial court granted a motion in limine precluding the defense from making certain arguments during summation. Defendant contends that those limitations deprived him of \"a meaningful opportunity to present a complete defense.\" Crane v. Kentucky, 476 U.S. 683, 690, 106 S. Ct. 2142, 2146, 90 L. Ed. 2d 636, 645 (1986) (citations omitted).\n\nDuring the trial, the State focused on defendant's statement to the Sears employees that he (as Gary Marsh) worked at Exxon. Since none of Marsh's personal belongings identified him as an Exxon employee, the State asked the jury to conclude that defendant could have known that Mr. Marsh worked at Exxon only if defendant had been at the Exxon station during the robbery/homicide. Defense counsel sought to argue in summation that defendant need not have been at the Exxon station, but could have simply found Mr. Marsh's wallet and read about the homicide in one of the Trenton newspapers that reported the homicide and provided details. Indeed, Thomas Citron, one of the State's witnesses, had first contacted the police after seeing an article about the homicide in the newspaper.\n\nThe trial court refused to allow defense counsel to assert that defendant read about the crime in the newspaper because there was no evidence presented at trial to allow this inference. However, the court did permit the defense to argue that the information in the newspaper was available for \"people\" to read.\n\nI want it to be clear, you're not going to tell the jury that Mr. Loftin could have read the article. You're not going to say those words. You can certainly say to the jury that Mr. Citron read the article . . . Certainly one could infer or conclude a lot of people could have read the article.\n\nDuring summation, defense counsel argued that the information supplied by defendant to Sears was \"the same information that Mr. Citron was equipped with . . . that he had read in the newspapers about the incident.\"\n\nThe scope of defendant's summation argument must not exceed the \"four corners of the evidence.\" State v. Reynolds, 41 N.J. 163, 176, cert. denied, 377 U.S. 1000, 84 S. Ct. 1930, 12 L. Ed. 2d 1050 (1964) (citation omitted). The \"four corners\" include the evidence and all reasonable inferences drawn therefrom. State v. Hill, 47 N.J. 490, 499, 221 A.2d 725 (1966). We agree with the trial court that defendant's claim here was not based on any evidence introduced at trial. Defendant did not establish that he ever read the newspaper, or that he even saw it, especially since he did not live in Trenton but in Bristol, Pennsylvania. Defendant need not have taken the stand and waived his right to remain silent in order to have established a factual basis for this argument; he could have had his wife or mother testify on the availability of Trenton newspapers. Since no such evidence was offered, the trial court properly excluded that argument.\n\nMoreover, even if the argument should have been allowed, its exclusion was harmless error. The defense was adequately able to suggest to the jury that defendant could have acquired the information from the newspaper. Moreover, the evidence was overwhelming that defendant was at the Exxon station and committed the murder, and no rational jury would have concluded that defendant was not at the scene but merely read about the crime in the paper.\n\nDefense counsel also sought to argue in summation that the homicide may not have been intentional but rather an accident, the result of a \"robbery gone bad.\" The trial court restricted that argument in several ways. First, defendant sought to argue that, since Mr. Marsh was a nail biter and nail biters are nervous people, that Mr. Marsh might have acted in a nervous manner \"which could explain the unintended discharge of the weapon which went off.\" We readily agree with the trial court that such an argument had no basis in the evidence.\n\nSecond, defendant sought to argue in summation that the homicide was the result of an accidental discharge of the gun. The State objected, clarifying that it did not object to the defense arguing that \"the evidence cannot tell us whether this is an intentional murder versus an accident or a fight or a robbery that just went awry,\" but it did object to defense counsel asserting an evidentiary basis for a Conclusion that was unsupported by the evidence. As defendant virtually conceded at the in limine hearing, the scenarios he wished to proffer were not based on facts in evidence but the lack of facts. The trial court agreed with the State, asserting that there was no fact or inference to support a \"robbery gone bad\" theory. We agree.\n\nDefendant was permitted to argue, and did in fact argue, that there was no evidence conclusively proving that this was not an accidental death. For example, defense counsel pointed to the medical examiner's inability, based on the autopsy itself, to rule out accidental death. However, because no evidence that actually supported the defense theory was developed on the record, the trial court correctly precluded defendant from arguing that a factual basis existed to affirmatively support the Conclusion that the death was accidental.\n\nThere was no evidence of a struggle and no evidence that the gun discharged accidentally. Indeed, the State presented testimony that the gun could fire only if the safety was removed and ten pounds of pressure was applied to the trigger. Thus, even if defendant were able to argue a \"robbery gone bad\" theory, the sheer weight of the facts would have led the jury to disregard it. Since there was no evidence to support a \"robbery gone bad\" theory, the trial court correctly limited the defense argument on that theory.\n\nD.\n\nFailure to provide non-unanimity instruction\n\nThe trial court's jury charge followed the law as it existed at the time of trial, but we have modified the required jury charges in two recent cases, Mejia, (supra) , 141 N.J. 475 and Brown, (supra) , 138 N.J. 481. Defendant contends that the failure to provide the Brown and Mejia charges constitutes plain error.\n\nN.J.S.A. 2C:11-3 contemplates two types of murder: murders committed with an intent to kill and those committed with an intent to inflict serious bodily injury. In State v. Gerald, 113 N.J. 40, 69, 549 A.2d 792 (1988), we held that only those convicted of murder with an intent to kill could be eligible for the death penalty. Those who killed with an intent to inflict serious bodily injury could be convicted only of non-capital murder.\n\nIn 1992, the New Jersey Constitution was amended to overrule Gerald. N.J. Const. art. I, P 19. The Legislature subsequently passed N.J.S.A. 2C:11-3i, authorizing the death penalty for murders committed with the intent to commit serious bodily injury. However, Gerald is applicable to this case because the offense was committed before Gerald was overruled. Accord Mejia, (supra) , 141 N.J. at 482.\n\nFor a defendant to be eligible for the death penalty, N.J.S.A. 2C:11-3c requires that the defendant have caused death either by his own conduct or by hiring someone to commit the murder. Generally, \"there is no question that a defendant may be convicted of purposeful or knowing murder on a theory of vicarious liability.\" Gerald, (supra) , 113 N.J. at 99. However, N.J.S.A. 2C:11-3c imposes \"a triggering device for the death penalty,\" an additional requirement that renders the defendant death-eligible. Ibid. (quoting State v. Moore, 207 N.J. Super. 561, 576, 504 A.2d 804 (Law Div. 1985)).\n\nThe trial court properly instructed the jury in accordance with Gerald that it must decide whether the defendant acted with an intent to kill or to inflict serious bodily injury. The jury returned a unanimous verdict that defendant intended to kill Marsh. The trial court also instructed the jury that it must decide whether defendant caused Marsh's death by his own conduct. Again, the jury unanimously decided that defendant did in fact do so.\n\nIn Brown, (supra) , we held that \"although a jury verdict that a defendant committed a murder by his own conduct must be unanimous, unanimity is not required to support a verdict that a defendant guilty of murder did not commit the murder by his own conduct.\" 138 N.J. at 511. A jury's inability to decide that crucial issue unanimously is a de facto decision that the defendant is not death-eligible. We expressed fear that although a non-unanimous decision would not create a mistrial but would result in a custodial sentence, \"in the absence of an instruction on the permissibility of a non-unanimous verdict, an erroneous belief that a failure to agree will result in a mistrial 'reasonably may [sway] a juror to join the majority, rather than [to] hold to his honest convictions, . . . to avoid forcing the parties, witnesses and court officials to undergo additional proceedings.'\" Id. at 518 (quoting Ramseur, (supra) , 106 N.J. at 309). As a result, we concluded that \"the proper approach is to inform juries in capital cases of their option to return a non-unanimous verdict on whether the defendant committed the murder by his own conduct.\" Ibid. Because the trial court was without the benefit of our decision in Brown, it did not provide that non-unanimity charge.\n\nIn Mejia, (supra) , also decided after the trial in this case, we extended our holding in Brown to hold that the trial court should also \"inform the jury of the option of returning a non-unanimous verdict on a defendant's mental state.\" 141 N.J. at 486. Without the benefit of our decision in Mejia, the trial court did not provide that charge.\n\n\"In appropriate cases, we have found the failure to give a Gerald charge to be harmless when the evidence did not provide a rational basis for a finding that the defendant intended only serious bodily injury.\" Id. at 488. We have undertaken a similar analysis when the trial court failed to provide a Mejia instruction, see e.g., Id. at 488; Harris, (supra) , 141 N.J. at 544-47, and when the trial court failed to provide a Brown instruction, e.g., Brown, (supra) , 138 N.J. at 522-27. Defendant contends that the evidence did provide a rational basis to infer that he intended serious bodily injury and that he did not commit murder by his own conduct because he was one of multiple perpetrators.\n\nWe address the Gerald issue first. The issue is whether there was a rational basis on which the jury could have concluded that defendant intended only serious bodily injury when he shot the victim, at close range, in the side of the head. (Marsh was shot in the side of the head and the bullet ended up in the back wall. Obviously, then, Marsh was shot from the front wall or the door. When the police arrived, Marsh's head was three feet from the front wall. The clear implication is that Marsh was quite close to defendant (who must have been standing between Marsh and the front wall, three feet away), and that defendant had his gun pointing to the side of Marsh's head.) \"To state the question is virtually to answer it.\" State v. Rose, 120 N.J. 61, 63-64, 576 A.2d 235 (1990). There was uncontradicted evidence that there was no sign of a struggle and that the victim had no defensive wounds on his hands or arms. There was also uncontradicted evidence that defendant had a license to carry weapons, a business card for a shooting range, a membership application for a gun association, equipment to make his own ammunition, and over 500 rounds of ammunition for his gun. He had apparently used his gun before, as one box of ammunition was half-empty. In order to fire the weapon, defendant was required to remove the safety and, with ten and a half pounds of pressure, pull the trigger. \"It is inconceivable that defendant was not 'practically certain' that his action would kill\" the victim. Ibid. (finding no rational basis to believe that defendant only intended serious bodily injury when defendant, who was experienced with weapons and was required to apply four pounds of pressure to fire weapon, killed victim with single, close range shot to abdomen).\n\nDefendant contends that the facts of the current case are similar to those in State v. Long, 119 N.J. 439, 575 A.2d 435 (1990), and State v. Pennington, 119 N.J. 547, 575 A.2d 816 (1990), where we found that the failure to provide a Gerald charge was reversible error because a rational basis existed to find an intent to inflict serious bodily injury. In Long, (supra) , 119 N.J. at 451, the defendant fired one shot that entered the victim's chest and killed him after an hour, and in Pennington, (supra) , 119 N.J. at 557, the defendant fired one shot into the victim's heart from close range. However, both of those cases are distinguishable. The defendant in Long, (supra) , presented evidence that \"defendant had reacted to the victim's reaching down, which defendant thought might be for a gun rather than a bag.\" 119 N.J. at 462. Defendant, however, never presented any evidence that the victim did anything to cause him to shoot; indeed, the victim was shot in the side of the head, hardly a circumstance that is suggestive of an instinctive gun shot. Moreover, the single shot fired by the defendant in Long, (supra) , was not aimed at the victim's head. Ibid. Unlike Long, (supra) , there is no evidence in the record here to justify a finding that defendant only intended serious bodily injury.\n\nSimilarly, the defendant in Pennington, (supra) , claimed that \"he was startled when the victim threw a glass at him, and he fired his gun reflexively.\" 119 N.J. at 561. Immediately after firing the shot, a witness heard defendant state that \"I just shot a woman. I didn't mean to do it.\" Id. at 562. Unlike the defendant in Pennington, defendant presented no evidence that his firing of the gun was accidental or instinctive; the only evidence was that he removed the safety on the gun and applied ten pounds of pressure to the trigger, firing a bullet at close range into Marsh's brain.\n\nJustice O'Hern argues, in Dissent, that Loftin's conduct was similar to that of the defendant in Mejia, where we found a rational basis to conclude that defendant intended serious bodily injury rather than death. Post at ___ (slip op. at 6) (O'Hern, J., Dissenting). However, in Mejia, as in Pennington, (supra) , and Long, (supra) , the defendant presented evidence indicating that the shooting may not have been with an intent to kill. The defendant had been fighting with an acquaintance and had hit him over the head with the gun \"'because I didn't want to use the gun . . .;\" the gun then discharged accidentally when he slipped. Mejia, (supra) , 141 N.J. at 490. Unlike the defendants in those cases, defendant presented no evidence of a struggle or an accidental discharge.\n\nWhile defense counsel argued in summation that there could have been a struggle or an accidental discharge of the weapon and that Marsh might have done something to provoke defendant, counsel's argument is not evidence. There was simply no evidence to contradict the overwhelming proof that defendant intended to kill Marsh without provocation or struggle. Our Dissenting colleague, however, asserts that the defense would have presented a stronger theory of an accidental shooting \"if it had not been unfairly restricted in developing its defense at trial.\" Post at ___ (slip op. at 7) (O'Hern, J., Dissenting). He cites as examples, the pathologist's testimony that based on an examination of the bullet hole in Marsh's skull she could not preclude accidental death and the observation that \"neither the pathologist nor the State's ballistic expert stated that there was any evidence that the gun was fired at point blank range.\" Ibid. Considering that bullets penetrate flesh and bones in the same manner whether the person firing the bullet intends to kill or shoots accidentally, and the ballistic expert's testimony that the gun could only fire if the safety was removed and ten pounds of pressure was applied to the trigger, those revelations offer scant support for an accidental-death theory. In the face of the undisputed evidence that defendant, an experienced shot, removed the safety, exerted over ten pounds of pressure on the trigger, and then fired a bullet into the side of Marsh's head from close range (in the absence of any signs of struggle), those slender reeds could not form a rational basis for a juror to conclude that defendant did not intend to kill his victim. While the jurors did, at one point, ask the court to explain the difference between intent to kill and intent to inflict serious bodily injury, they did so in the context of a question about felony murder and whether defendant could be found guilty only of one or all of the charged crimes. That question seems to have reflected a confusion about whether the jury was required to choose between the different crimes or consider each one independently. We do not infer from that question that the jury could find that a rational basis existed to conclude that defendant only intended serious bodily harm.\n\nDefendant's conduct is similar to that of other cases where we found no rational basis to conclude that the defendant might have only intended to inflict serious bodily injury. See, e.g., Harris, (supra) , 141 N.J. at 550-51 (finding no rational basis when defendant fired single shot into victim's back and neck at close range while victim was laying on ground. \"But what purpose did the gunshot have other than to kill?\"); Biegenwald IV, (supra) , 126 N.J. at 18 (finding no rational basis when defendant shot victim four times in head at close range); State v. Hightower, 120 N.J. 378, 413, 577 A.2d 99 (1990)(finding no rational basis when defendant shot victim three times, including one shot to brain, at close range); Rose, (supra) , 120 N.J. at 64 (finding no rational basis when defendant fired sawed-off shotgun into victim's abdomen at point-blank range). As in those cases, defendant's close-range killing of the victim with a bullet into the head leaves no rational basis for a jury to have found anything but an intentional murder.\n\nWe also find that the court's failure to provide a Brown instruction was harmless because there was no rational basis for a juror to have concluded that defendant did not commit the murder by his own conduct. The uncontradicted evidence revealed that Mr. Marsh was killed by a bullet fired by a gun bought by defendant and found in defendant's car. In addition to owning and possessing the instrumentality of the crime, defendant appeared to be in possession of all of the proceeds of the crime when he was arrested, including Marsh's identification and credit cards as well as the fifty-dollar bill. Defendant presented no evidence to rebut those facts. In the absence of evidence to the contrary, the evidence presented at trial conclusively establishes that defendant killed Marsh \"by his own conduct.\" Since there was no rational basis for a juror to have concluded otherwise, the failure to provide the Brown instruction will not disturb defendant's conviction or sentence.\n\nIV.\n\nPenalty-Phase Issues\n\nA. Exclusion of three photographs\n\nDuring the penalty phase of trial, Dorothy Loftin, defendant's wife, testified about five photographs of defendant and his family. Each photo depicted an event in defendant's life in 1989. The photographs included: (1) defendant in a naval uniform at his graduation from boot camp; (2) defendant, again in his naval uniform, taken after he rushed home from his naval training to tend to his six-month old daughter who had been seriously ill with croup; (3) defendant with his sister-in-law and his daughter, Danielle, just prior to defendant's move to Colorado; (4) defendant with his nephew, Clinton, at the celebration of defendant's graduation from technical school; and (5) defendant and his wife at Saint Francis Hospital in Trenton, immediately after the birth of his daughter.\n\nThe State objected to defendant's motion to introduce the photographs into evidence. The State argued that the photographs were not reliable evidence establishing any mitigating factor properly before the jury, and therefore, were not admissible even under the relaxed rules of evidence. N.J.S.A. 2C:11-3c(2)(b). While not sustaining the State's relevancy argument, the trial court found photos three through five to be cumulative and therefore not admissible. Defendant now asserts that the trial court's ruling on the photos requires a reversal of the penalty-phase verdict because the trial court excluded relevant mitigating evidence in violation of defendant's constitutional rights.\n\nWe need not decide whether the trial court's finding that photographs three through five were cumulative was erroneous. We also need not address whether the trial court improperly excluded relevant mitigating evidence by not admitting those photographs into evidence. Any error that resulted from the exclusion of those photos was harmless. To the extent the excluded photographs possibly conveyed the impression that defendant \"was capable of giving and receiving love\" as he contends, they were no different from the photographs that were admitted and certainly were not more persuasive than the vivid and obviously genuine displays of emotion from the numerous family members who testified to mutual feelings of love. \"The question whether an error is reason for reversal depends finally upon some degree of possibility that it led to an unjust verdict.\" State v. Macon, 57 N.J. 325, 335, 273 A.2d 1 (1971). The exclusion of these photos presented no real possibility of an unjust result.\n\nWe also find defendant's argument that the trial court's rulings on evidence were inconsistent and strongly biased in favor of the State to be without merit.\n\nB. Testimonial evidence that defendant did not have a mental defense to the Atlantic County murder.\n\nAt the penalty-phase trial, defendant called Charles Jurman, defendant's attorney from the Atlantic County murder trial. Defense presented Jurman to support mitigating factor thirty-two, that \"defendant offered the State to plead guilty in exchange for a life sentence.\" On direct examination, Jurman testified that defendant was willing to accept a tentative plea offer, encompassing both the Atlantic County and the Mercer County cases, which would have resulted in consecutive life sentences. (That offer was subsequently withdrawn.) Jurman also testified about defendant's character, explaining that he was intelligent, even tempered and had no prior record before the two murders. On cross-examination, the State elicited two important facts from Jurman. First, Jurman testified that he did not believe that there was a mental health defense to the Atlantic County murder. Second, Jurman acknowledged that, after reviewing the presentence report with his client, he affirmed the accuracy of the presentence report in which defendant indicated that he did not have any history of mental disease.\n\nDefendant argues that the information solicited on cross-examination was irrelevant and exceeded the scope of direct examination. Furthermore, defendant asserts that even if the evidence was relevant to refute a mitigating factor, the prejudicial effect of the evidence outweighed any probative value. Defendant claims that the evidence denigrated three of the defense's mitigating factors, N.J.S.A. 2C:11-3c(5)(a), c(5)(d), and c(5)(h). Defendant also claims that the testimony misled the jury into believing that because there was no mental health defense to the Atlantic County murder, defendant could not have suffered any emotional or mental disturbance at the time of the Marsh murder. Finally, defendant contends that the instruction provided by the court concerning the use of the testimony was insufficient. As a result, defendant argues he was denied his constitutional rights to a fair trial, to due process, and to a reliable sentencing proceeding under the State and federal Constitutions.\n\nQuestions of admissibility of evidence are largely within the broad discretion of the trial court. See McDougald, (supra) , 120 N.J. at 577-78 (citation omitted); State v. Sands, 76 N.J. 127, 386 A.2d 378, 144 (1978). A reviewing court should overrule a trial court's evidentiary ruling only where \"a clear error of judgment\" is established. Koedatich I, (supra) , 112 N.J. at 313.\n\nEvidence is admissible when it is relevant and when the probative value of the evidence outweighs its prejudicial effect. N.J.R.E. 403. Jurman's testimony was clearly relevant. Jurman's testimony, elicited on cross-examination, supported the State's argument that defendant sought to plead guilty to avoid a prosecution for which there was no viable defense, rebutting the defense's attempt to use defendant's willingness to plead as evidence of remorse for committing the murders.\n\nIn order for relevant evidence to be excluded, it must be found that the evidence's probative value is \"so significantly outweighed by [its] inherently inflammatory potential as to have a probable capacity to divert the minds of the jurors from a reasonable and fair evaluation of the basic issue of guilt or innocence.\" State v. Thompson, 59 N.J. 396, 421, 283 A.2d 513 (1971). Jurman's testimony was not unduly prejudicial. Defendant's concern that the jury was misled or confused about the distinction between the lack of a mental defense in the recent prior murder and the evidence of mental impairment that could be considered as mitigation of punishment is without merit. First, the court provided a sufficient limiting instruction that operated to eliminate any confusion present in the minds of the jurors. The trial court's immediate instruction informed the jury that the lack of a mental defense to the Atlantic County murder was irrelevant to their deliberations. That instruction also informed the jury that the mental state necessary to establish mitigating factors did not rise to the level of a legal defense. Second, defense counsel repeatedly emphasized the distinction between mental state as a legal defense and as a mitigating factor through its examination of defense psychiatrist, Dr. Dougherty, and in counsel's summation. Therefore, the trial court's ruling and the limiting instruction were not \"so wide of the mark that a manifest denial of Justice resulted.\" State v. Carter, 91 N.J. 86, 106, 449 A.2d 1280 (1982).\n\nC. Use of inculpatory statements made to psychiatrist.\n\nPrior to the penalty phase, the State notified the court of its intention to have a State psychiatrist, Dr. Martinson, examine defendant for the purpose of rebutting the mental health mitigating factors. Dr. Martinson testified at the penalty phase and concluded that defendant did not suffer from any mental or emotional disturbance at the time of the murder. His Conclusions were based in part on defendant's motives for and reflection on the crime, which defendant relayed to the doctor during an interview. Dr. Martinson recounted the exact words of the defendant during his testimony. The doctor explained that defendant stated:\n\nWhat led to it was my economical situation. A certain lifestyle I was used to, I couldn't have it anymore. I was doing college because I didn't really have anything better to do. I was between a rock and a hard place, this particular evening when I pondered our financial situation and I elected to go out and try to supplement the funds we were receiving from the government, At . . . the point at which the crime was committed, it may be a digression in my life. Maybe bitter, resentful. I needed money at the time. We couldn't do anything we wanted to do. We couldn't eat at our favorite diner any more. First thought it would payoff. Then started looking at the next four years, the fact we were living in a bad neighborhood, I felt we needed money, she didn't, I was disappointed . . . Going back to school as an adult. A little sad because coerced into doing something I didn't want to do.\n\nAt no time did defense counsel request any limiting instruction\n\nconcerning that statement.\n\nDefendant asserts for the first time on appeal that, \"especially since defendant did not testify on his own behalf, the quoting of these remarks into proof transcended proper rebuttal, transforming the remarks into proof of the (4)(g)[felony murder] aggravating factor.\" Therefore, defendant asserts that the admission into evidence, without any limiting instruction, of the statements made to Dr. Martinson, resulted in such undue prejudice to defendant that a vacation of his death sentence is required.\n\nThis Court has held that psychiatrists retained by the State may interview defendants to rebut asserted mental defenses. State v. Whitlow, 45 N.J. 3, 210 A.2d 763, 16 (1965). The Whitlow court added that statements made by a defendant during such an interview, even if inculpatory, are admissible, so long as those statements are necessary for the formulation of the psychiatrist's opinion. Defendant's statements were relevant to Dr. Martinson's evaluation of defendant's mental health. Nonetheless, the Whitlow Court also held that although such statements are admissible, \"the jury [must be] fully and fairly informed as to the purpose of admitting them and to the absolute limitation of their use.\" Id. at 19-20. No such instruction was provided.\n\nThe absence of the Whitlow instruction, however, was harmless error. There was overwhelming evidence presented to prove aggravating factor c(4)(g) (that the murder was committed during a robbery). Indeed, defense counsel never seriously questioned that defendant had committed a robbery. Because the lack of the Whitlow instruction could have had no effect on the outcome of this case, we need not decide whether the defendant's failure to request a Whitlow instruction could constitute a waiver of that instruction under N.J.R.E. 105. See Brown, (supra) , 138 N.J. at 535 (holding that N.J.R.E. 105 \"acknowledges that a party may wish to forego such an instruction for tactical reasons. Thus, while the court may give a limiting instruction, if warranted, despite the lack of a request, we find no support for defendant's suggestion that a court should provide an instruction despite a party's calculated decision to waive it\"). D. Limitations on defendant's right to allocution\n\nAt the Conclusion of the State's penalty-phase case-in-chief, the trial court explained to defendant the right of allocution. The court delineated specific boundaries that defendant would have to respect:\n\nNumber one, you may ask the jury to spare your life. Number two, you may explain to the jury, if it's true, that you are a person who is capable of feeling and expressing remorse, and that you feel remorse, and that you have hope of rehabilitating yourself if your life is spared. . . .\n\nWhat you must not do, Mr. Loftin, is you must not deny your guilt. You must not deny the truth of any evidence, you must not argue about the evidence. You must not argue about aggravating and mitigating factors. You must not say anything about the witnesses, the prosecutor, your lawyers, this court, or the trial. . . . You must not say anything about the legality or morality of capital punishment.\n\nThe court identified the remedies it might pursue if defendant exceeded the court-imposed boundaries. The court also informed defendant that he was permitted to submit a written version of his allocution statement to ensure that it was proper. Defendant and his counsel received a written copy of the court's instructions, which both signed, confirming that they understood and accepted the court's instructions. Defendant chose not to submit a written version of his allocution statement.\n\nIn his allocution statement, defendant blamed his conduct on racial inequities, discussed the adverse impact his execution would have on his family, and commented on the evidence presented with respect to mitigating factors. As a result, the trial court held a sidebar conference to discuss how best to cure the problem. After rejecting the State's suggestion that it be permitted to cross-examine defendant, the trial court and counsel discussed potential curative instructions. Defense counsel agreed to an instruction in which the court would inform the jury that it should disregard what defendant said about the impact of the execution on his family, his comments on racism, and his Discussion of the aggravating and mitigating factors presented in this case. Accordingly, the trial court instructed as follows:\n\nLadies and Gentlemen, it is necessary for the Court at this juncture to instruct you with respect to Mr. Loftin's allocution and to instruct you that some of his remarks went outside the bounds of his right to exercise allocution.\n\nNumber one, it is not an appropriate exercise of his right of allocution to raise the issue of racism, it falls outside of the bounds of his right to speak. Secondly, it falls outside the bounds of his right to speak to discuss the aggravating and/or mitigating factors that have been presented in this case by both sides.\n\nFinally, as I have instructed you repeatedly, the impact of his execution on his mother, his children, his wife and his family is not a proper mitigating factor for you to consider, and you are to disregard not only his comments about racism, his comments with respect to the evidence of mitigating and aggravating [factors], but also the impact that his execution would have upon his family.\n\nIn its final instructions on allocution, the court permitted the jury to \"consider what Mr. Loftin stated insofar as it impacts one or more of the mitigating factors, and subject to the court's limiting instructions at the Conclusion of his statement.\" Defense counsel did not raise any objection relating to the court's limitation on the right of allocution or to the court's remedy after defendant exceeded the court-imposed boundaries. Defendant contends that he did not exceed the scope of proper allocution and now objects to the trial court's restrictions on his right of allocution.\n\nDuring allocution, a defendant is permitted to make a brief statement in order to allow the jury to ascertain that he or she is an \"'individual capable of feeling and expressing remorse and of demonstrating some measure of hope for the future.'\" State v. Zola, 112 N.J. 384, 430, 548 A.2d 1022 (1988) (quoting J. Thomas Sullivan, The Capital Defendant's Right to Make a Personal Plea for Mercy: Common Law Allocution and Constitutional Mitigation, 15 N.M.L. Rev. 41, 41 (1985)), cert. denied, 489 U.S. 1022, 109 S. Ct. 1146, 103 L. Ed. 2d 205 (1989). The right to make a statement in allocution is not commanded by the Constitution, id. at 429, but is rather a common-law right recognized in New Jersey. Id. at 428. In delivering an allocution statement, a defendant is not authorized to argue legal points, advance or dispute facts, or attempt to exculpate himself. Id. at 430. In Zola, (supra) , we made clear that in making an allocution statement, a defendant should limit himself to standing before the jury and, in his own voice, asking that his life be spared. Ibid. If the accused does not stray from that subject matter in his statement, he will not expose himself to cross-examination. However, should a defendant dispute facts in issue or offer other facts to exculpate himself, defendant \"will be subject to corrective action by the court including either comment by the court or prosecutor or in some cases possible reopening of the case for cross-examination.\" Id. at 432.\n\nIn asserting that the substantive limitations imposed on his allocution were improper, defendant misconstrues the nature of that right. Defendant's statements exceeded the scope of the right of allocution envisioned in Zola, (supra) , 112 N.J. at 429-32. In State v. DiFrisco, 137 N.J. 434, 478, 645 A.2d 734 (1994)(DiFrisco II), cert. denied, ___ U.S. ___, 116 S. Ct. 949, 133 L. Ed. 2d 873 (1996), we explained that \"the purpose of allocution is twofold. First, it reflects our commonly-held belief that our civilization should afford every defendant an opportunity to ask for mercy. Second, it permits a defendant to impress a jury with his or her feelings of remorse.\" However, a defendant's allocution should not take on a testimonial color. To allow defendant to testify about mitigating or aggravating factors without permitting the State to cross-examine him would be unfair to the State and could have the effect of misleading the jury. Zola, (supra) , 112 N.J. at 429-32. Because defendant's statements about racism, the mitigating evidence, and the impact that his execution would have on his family went beyond the permitted boundaries, it was proper for the trial court to issue a curative instruction.\n\nDefendant asserts that the trial court's decision to strike the portions of the allocution that went beyond the permitted boundaries was overly drastic and prejudicial. However, the appropriate form of corrective action for an abuse of the right of allocution is within the discretion of the trial court. In Zola, (supra) , we indicated that corrective action might include comment by the court or prosecutor, or, in some cases, reopening the case for cross-examination. Id. at 432. The trial court did not abuse its discretion by striking the improper portions of the allocution statement. Nor were the trial court's instructions regarding the allocution statement inconsistent or confusing.\n\nE. Outburst\n\nAfter defendant delivered his allocution statement, the court called a sidebar conference. Neither the Judge nor the attorneys were observing the jury at that time. A few minutes later, a spectator, allegedly the daughter of the Atlantic County Murder victim Sophia Fetter, rose from the gallery and shouted at a tearful juror: \"Who the hell are you crying for? We --.\" The woman was quickly quieted and removed from the courtroom. Neither the Judge nor the attorneys reacted to the outburst. The court simply instructed the jury on the allocution statement, making no reference to the outburst. Apparently, the jurors did, however, notice the outburst and reported to the sergeant-at-arms that they were concerned for their safety.\n\nThe trial court did not directly address the jurors about the outburst. Instead, the court told the jury:\n\nThings get somewhat testy, the court would make sure that everything is being done to make you feel secure in every regard. And if you have any concern about that, you know, please let us know, because that's what we're here for is to make sure that you feel secure and that you can go about your responsibilities without feeling any undue pressure from any outside forces.\n\nThe jury recessed for four days.\n\nDuring the jury's recess, the trial court conducted a charge conference with the attorneys. Defense counsel moved for a mistrial because of the outburst, arguing that the jury had been prejudicially influenced by the incident. The court ruled that there was no evidence of prejudice requiring a mistrial. The court promised to inquire of the jury whether any individual felt unable to proceed according to the law and whether the specific juror who had been crying felt that her ability to perceive and evaluate the evidence had been compromised. The court explained that if the juror believed that she could not continue, she would be removed for cause.\n\nDefense counsel raised two concerns. First, counsel argued that any comment made by the court would highlight the prejudicial outburst in the minds of the jurors. Second, the defense was afraid that the court might focus the voir dire on the one juror who had been moved to tears despite the court's insistence that it would not focus on any one juror. Defense counsel believed that if defendant had a chance for life, it might be from this one emotional juror.\n\nAcknowledging that it had a responsibility to address the concerns of the jurors, the court addressed the jury:\n\nI'd like to ask you, to poll at this time as to whether or not any of you have experienced anything, whether it was when we last met, I believe it was Wednesday afternoon . . . Or you read anything or saw anything, or has anything happened that would affect your ability to continue to serve in this case, anything at all?\n\nNoting that no juror raised their hands, the court moved on without giving a curative instruction or further individualized voir dire. Defense counsel now argues, despite his prior insistence that no individualized voir dire be conducted or instruction be given, that the trial court failed to inquire sufficiently whether prejudice resulted from the outburst. A more probing voir dire, asserts defendant, was necessary to determine if a mistrial should have been granted. If the court determined that a mistrial was not necessary, then a stronger and more immediate curative instruction was required. Defendant also claims that the outburst amounted to victim impact evidence because it was likely that jurors knew the identity of the woman in the courtroom. Finally, defendant contends that the instruction given by the court, four days after the incident, was insufficient because it failed to directly address the outburst and was too general in nature. Based on the nature of the outburst, the reaction of the jurors, and the inadequate response of the court, defendant argues that prejudice should be presumed and defendant's death sentence reversed.\n\nDefense counsel may not now argue that the inquiry made by the trial court was not sufficiently probing, when counsel insisted that the court refrain from making any individualized voir dire or from singling out any one juror. Defense counsel likewise cannot now argue that the court should have given a more immediate curative instruction, when it was defense counsel who insisted that the court not \"highlight\" the prejudicial outburst with a instruction to the jury. This Court has held that \"except in the most extreme cases, strategic decisions made by defense counsel will not present grounds for reversal on appeal.\" Marshall I, (supra) , 123 N.J. at 93; accord State v. Buonadonna, 122 N.J. 22, 44, 583 A.2d 747 (1991); State v. Pontery, 19 N.J. 457, 471, 117 A.2d 473 (1955). Given the concerns raised by defense counsel and the limited nature of the outburst itself (both the Judge and the attorneys who were at sidebar were not even aware it had occurred), the court's limited inquiry was reasonable and sufficient.\n\nThe trial court recognized it had a responsibility to insure that the jury remain fair and impartial throughout the proceedings. State v. Bey, 112 N.J. 45, 75, 548 A.2d 846 (1988) (Bey I). The jury's impartiality is significantly threatened by extraneous influences arising from contact with non-record facts. Id. at 74-76 (citation omitted). The determination of whether the appropriate response is a curative instruction, as well as the language and detail of the instruction, is within the discretion of the trial Judge \"who has the feel of the case and is best equipped to gauge the effect of a prejudicial comment on the jury in the overall setting.\" State v. Winter, 96 N.J. 640, 647, 477 A.2d 323 (1984) (citations omitted). The trial court properly exercised its discretion and instructed the jury sua sponte, despite defense counsel's insistence that the court take no action.\n\n\"Not every admission of inadmissible hearsay or other evidence can be considered to be reversible error.\" Winter, (supra) , 96 N.J. at 646 (quoting Bruton v. United States, 391 U.S. 123, 135, 88 S. Ct. 1620, 1627, 20 L. Ed. 2d 476, 484 (1968)). In White v. Smith, 984 F. 2d 163, 166-67 (6th Cir. 1993), cert. denied, 500 U.S. 920, 113 S. Ct. 2367, 124 L. Ed. 2d 273 (1993), the court remarked: \"Where [a] communication is innocuous and initiated by a spectator in the form of an outburst, a hearing is not necessarily required. This is particularly true when, in this case, the trial court follows up with a statement to the jury, allaying any apprehensions.\"\n\nIn this case, the brief outburst by a courtroom spectator did not operate to unduly prejudice the jury against defendant. The outburst was momentary, and the woman was immediately quieted and removed from the courtroom. Despite defendant's claim that the outburst amounted to victim impact evidence, there is nothing to suggest that the jury was aware of the identity of the spectator. Additionally, the outburst contained no factual information that could have influenced the jury. See Hunt v. State, 540 A.2d 1125 (Md. 1988)(upholding capital conviction despite trial court's failure to provide a curative instruction after victim's family members, who were never identified on the record, left courtroom crying), cert. denied, 502 U.S. 835, 112 S. Ct. 117, 116 L. Ed. 2d 86 (1991).\n\nThe trial court polled the jury to ensure that nothing had affected their ability to continue. Lastly, in its final charge to the jury, the trial court instructed the jury that neither bias, prejudice, nor sympathy were to play any role in their deliberations, except for sympathy generated by the mitigating factors. The jury presumably followed these instructions. Manley, (supra) , 54 N.J. at 271 (citations omitted). We find that any prejudice resulting from the outburst was harmless error.\n\nF. Hardship on defendant's family as a mitigating factor\n\nDefendant argues that the trial court erred in refusing to allow the jury to consider the hardship of defendant's execution on his wife and children as mitigating factors under the \"catch-all\" mitigating factor, N.J.S.A. 2C:11-3c(5)(h). He claims that by precluding the jury from considering those factors, the trial court violated his due process rights and his right to be protected from cruel and unusual punishment.\n\nWhile the penalty-phase jury selection was in progress, the State moved to bar three of defendant's proposed mitigating factors:\n\n27. Mr. Loftin's execution would be a hardship to his family.\n\n28. Mr. Loftin's execution would be a hardship to his five-year old daughter, Danielle.\n\n29. Mr. Loftin's execution would be a hardship to his three-year old son, Jay.\n\nThe State had not previously questioned the appropriateness of those factors, and all of the jurors who had been qualified in the first five and one-half weeks of the penalty-phase voir dire had been informed that those mitigating factors were among the factors to be presented. In striking the three mitigating factors, the trial court noted that the factors did not relate to either defendant's character, record, or the circumstances of the offense. The basis for the trial court's ruling was our opinion in DiFrisco, (supra) , 137 N.J. 434. In that case the defendant attempted to introduce as a mitigating factor evidence that his execution would cause excessive emotional hardship to his mother, because she had already lost one son. Id. at 505. The trial court denied the defendant's request to introduce the factor under the \"catch-all\" category, holding that the factor did not relate to defendant's character, record, or the circumstances of the offense. In affirming the exclusion, we held that it did not come within the catch-all factor because it \"neither relates to defendant's character or record, nor to the circumstances of the offense, but rather focuses on the potential impact on a third party. Its exclusion was entirely proper.\" Id. at 505-06 (emphasis added).\n\nBecause of the unique nature of the death penalty, the Eighth and Fourteenth Amendments require in nearly every capital case, that the sentencer \"not be precluded from considering as a mitigating factor, any aspect of a defendant's character or record and any of the circumstances of the offense that the defendant proffers as a basis for a sentence less than death.\" Lockett, (supra) , 483 U.S. at 604, 98 S. Ct. at 2964, 57 L. Ed. 2d at 990; accord Woodson v. North Carolina, 428 U.S. 280, 304, 96 S. Ct. 2978, 2991, 49 L. Ed. 2d 944, 961 (1976). In accordance with the Supreme Court's mandate, we have broadly interpreted the scope of the factors that may be submitted and considered under the catch-all factor. See Gerald, (supra) , 113 N.J. at 102; see also State v. Davis, 96 N.J. 611, 620 (1984)(holding that in capital case, \"the sentencing process should embrace an evidential inquiry 'broad in scope, largely unlimited either as to the kind of information that may be considered, or the sources from which it may come.'\")(citations omitted).\n\nAlthough the scope of the catch-all factor is broad, that scope is not unlimited. Gerald, (supra) , 113 N.J. at 103. We have consistently held that the proffered evidence must be relevant to a defendant's character, record, or the circumstances of the offense. Ibid. ; Davis, (supra) , 96 N.J. at 618; accord Lockett, (supra) , 483 U.S. at 604, 98 S. Ct. at 2964, 57 L. Ed. 2d at 990. Indeed, in DiFrisco II, (supra) , 137 N.J. at 505-06, we specifically held that mitigating evidence that focuses on the potential impact on a third party is not relevant to a defendant's character, record, or the circumstances of the offense, and therefore could properly be excluded. Although testimony concerning the potential impact of an execution on a third party may be excluded, a defendant is nevertheless able to provide a wealth of character evidence as revealed by his relationships with his family members.\n\nEven if the trial court's refusal to allow the jury to consider the impact of defendant's execution on his wife and children as mitigating factors was an error, the error would have been harmless, because defendant presented the jury with a multitude of character evidence that directly focused on his relationship with his wife and children. Defendant was allowed to allege and prove as mitigating factors that \"he has the love and support of his family\" (factor 30); that he \"was a considerate and loving son\" (factor 11); and that he \"provided siblings with a positive sense of direction\" (factor 12). In addition, defendant alleged and presented testimony that he \"shared a positive relationship with his wife and children\" (factor 17); that he \"was a loving father\" (factor 26); and that he \"maintained employment and provided for his wife and children\" (factor 17). The accumulation of those mitigating factors was sufficient to cure any error that might have resulted due to preclusion of the rejected mitigating factors regarding the impact of defendant's death on third parties, and therefore we hold that any such error was harmless.\n\nG. Defendant would likely die in prison as a mitigating factor\n\nDefendant contends that the trial court erred by ruling that defendant could not introduce as a catch-all mitigating factor evidence that he was already serving a life sentence, and therefore would likely die in prison before he became eligible for parole. Defendant submits that in light of the United States Supreme Court's recent decision in Simmons v. South Carolina, 512 U.S. __, 114 S. Ct. 2187, 129 L. Ed. 2d 133 (1994), the trial court should have allowed him to use his prolonged parole ineligibility as mitigating evidence. Although the State did not object to the trial court's instructing the jury regarding the possibility of consecutive life sentences, it objected to defendant using his prior life sentence as a mitigating factor.\n\nA capital sentencing jury must be fully informed of its responsibility in determining the appropriateness of the death penalty. Woodson v. North Carolina, (supra) , 428 U.S. at 304-05, 96 S. Ct. at 2991, 49 L. Ed. 2d at 961; State v. Bey, 129 N.J. 557, 601, 610 A.2d 814 (1988)(Bey III); Bey II, (supra) , 112 N.J. at 162-63. As we stated in Ramseur, (supra) :\n\nTo hide from the jury the full range of its sentencing options, thus permitting its decision to be based on uninformed and possibly inaccurate speculation, is to mock the goals of rationality and consistency required by modern death penalty jurisprudence.\n\n[ 106 N.J. at 311.]\n\nNot informing the jury about a prior sentence could lead jurors to speculate that a capital defendant might be released earlier than he otherwise would be.\n\nIn Biegenwald IV, (supra) , 126 N.J. at 49, however, we rejected a defendant's attempt to introduce his prior life sentences for murder under the catch-all mitigating factor. \"Because the sentencing determination is fact specific and remains subject to significant sentencer discretion, the sentence imposed in another case under different circumstances has little probative value to the present jury's sentencing decision.\" Ibid. We determined that the argument that a defendant will never be eligible for parole in his lifetime due to prior sentences should not on its own be presented as a mitigating factor. Ibid. We reaffirmed that holding in Bey III, (supra) , 129 N.J. at 600-01.\n\nNevertheless, although we found that a prior life sentence should not be presented as a mitigating factor in Bey III, (supra) , we held that courts in capital cases should inform juries about the defendant's prior sentences either on defendant's request or when the jury makes such an inquiry. Id. at 603. However, a court should also inform the jurors that they should not consider prior sentences in their decision to impose a life or death sentence because they are not statutory aggravating or mitigating factors. \"To permit consideration of pending sentences for prior crimes might lead to the incongruous result that first-offenders would be more likely to be sentenced to death than would repeat-offenders.\" Ibid. Finally, the court should instruct the jury that it is solely the court's responsibility to determine whether a sentence in the present case is to be served concurrently or consecutively to any prior sentences. Ibid.\n\nDefendant urges us to reconsider our rulings in Biegenwald IV, (supra) , and Bey III, (supra) , in light of Simmons, (supra) . In that case, the United States Supreme Court held that where the defendant's future dangerousness is at issue, and state law prohibits the defendant's release on parole, due process requires that the sentencing jury be told that the defendant is ineligible for parole. Simmons, (supra) , 512 U.S. at ___, 114 S. Ct. at ___, 129 L. Ed. 2d at 138. On three separate occasions, Simmons asked the trial court to inform the sentencing jury that under state law he was ineligible for parole; each time the court refused to issue such an instruction. Id. 512 U.S. at ___, 114 S. Ct. at ___, 129 L. Ed. 2d at 139. Of course, here the State did not proffer defendant's \"future dangerousness\" as an aggravating factor and the only available alternative sentence to death was not life imprisonment without the possibility of parole. Future dangerousness is not an aggravating factor in New Jersey, and our statute limits prosecutors to the enumerated aggravating factors. Pennington, (supra) , 119 N.J. at 584. The holding of Simmons, (supra) , is therefore inapplicable to this case. 512 U.S. at ___, 114 S. Ct. at ___, 129 L. Ed. 2d at 147. Although Justice Handler argues that due process requires a trial court to instruct the jury about parole ineligibility, post at ___ (slip op. at 39-40) (Handler, J., Dissenting), the United States Supreme Court in Simmons held that the due process requirement is met if either the Judge or defense counsel provides the relevant parole ineligibility information to the jury. See Simmons, (supra) , ___ U.S. at ___, ___ S. Ct. at ___, 129 L. Ed. 2d at 149-151 (\"Due process plainly requires that he be allowed to bring it to the jury's attention by way of argument by defense counsel or an instruction from the court\"); Id. at ___, ___ S. Ct. at ___, 129 L. Ed. 2d at 149 (\"Due process requirement is met if the relevant information is intelligently conveyed to the jury; due process does not dictate that the Judge herself, rather than defense counsel provide the instruction\") (Ginsburg, J., Concurring); Id. at ___, ___ S. Ct. at ___, 129 L. Ed. 2d at 151 (\"Where the State puts the defendant's future dangerousness in issue, and the only available alternative sentence to death is life imprisonment without parole, due process entitles the defendant to inform the capital sentencing jury -- by either argument or instruction -- that he is parole ineligible.\") (O'Connor, J., Concurring).\n\nNonetheless, in future cases, if the court, based on the evidence presented believes that there is a realistic likelihood that it will impose a sentence to be served consecutively to any of defendant's prior sentences, in the event the jury does not return a death sentence, the jury should be so informed. We believe that in most cases the courts will conclude that there is a \"realistic likelihood\" that it will impose a consecutive sentence rather than a concurrent sentence in the event of a non-death verdict. However, not every court necessarily will reach that Conclusion. In those cases, the court need not inform the jury whether a non-death sentence is likely to be consecutive or concurrent.\n\nIn this case, failure to give such information was harmless error. Defense counsel was repeatedly allowed to inform the sentencing jury that defendant had already been sentenced to a life term with thirty years of parole ineligibility, and that if defendant was not sentenced to death he would likely die in prison before becoming eligible for parole. In fact, during summation, defense counsel was permitted to argue that defendant's life should be spared because he would likely die in prison.\n\nWhat does a life sentence mean? Life means that the individual is sentenced to prison for life, meaning he must serve a minimum mandatory term of thirty years. I'm not saying that a person gets out after thirty years, but only that he is eligible for parole at the end of thirty years.\n\nAdditionally, keep in mind, members of the jury, that [defendant] already has been convicted and is presently serving life with thirty years without parole for the Atlantic County conviction. The sentence in murder may run consecutive to the ones in Atlantic County. I think its safe to assume, folks, that [defendant] is going to remain in prison for the rest of his natural life. He is never going to get out. In fact, by simply his conviction for knowing and purposeful murder, it is guaranteed that [defendant] will die in prison. The only question becomes who is going to determine whether he dies, you or God?\n\nThrough the arguments of counsel and the voir dire, the jury was \"fully informed about their sentencing options,\" including the practical effect of a life sentence.\" Bey III, (supra) , 129 N.J. at 601. Hence even if Simmons does apply, any error was harmless. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nH. Instructions on mitigating factor c(5)(a)\n\nDefendant challenges the sufficiency of the trial court's instruction with respect to mitigating factor c(5)(a). That factor provides: \"The defendant was under the influence of extreme mental or emotional disturbance insufficient to constitute a defense to prosecution.\" N.J.S.A. 2C:11-3c(5)(a). Defense counsel requested that the trial court instruct the jury on the mitigating factor in conformity with the model jury charge. The trial court agreed to include the requested language, specifically that \"this mitigating factor may be present even though the defendant had neither a mental disease nor [a] mental defect.\" However, prior to charging the jury, the trial court informed counsel that it had made some minor changes to the model jury charge and that the court planned to omit the language in the model charge that specifically instructed the jury that the finding of a mental disease or defect is not necessary for finding the c(5)(a) factor. Defendant objected, but the trial court decided not to alter the planned charge. On appeal, defendant argues that the omission impermissibly restricted the jury's consideration of the c(5)(a) mitigating factor.\n\nProper jury instructions are critical to the penalty-phase of a capital proceeding. See Williams II, (supra) , 113 N.J. at 456-57; State v. Green, 86 N.J. 281, 287, 430 A.2d 914 (1981). While a trial court is not bound to instruct a jury in the language requested by a party, a defendant is entitled to a fair charge. Ramseur, (supra) , 106 N.J. at 292 (quoting Thompson, (supra) , 59 N.J. at 411). In determining whether a charge is proper, a reviewing court will examine the charge as a whole and will attempt to determine whether the challenged language was prejudicial. When the contested instruction concerns a mitigating factor, we similarly examine the instruction in its entirety, focusing on whether there is a \"'reasonable likelihood that the jury had applied the challenged instruction in a way that prevents the consideration of constitutionally relevant evidence.'\" Martini I, (supra) , 131 N.J. at 304 (citation omitted).\n\nConsidering the trial court's instruction in its entirety, we find that the court's instruction on the c(5)(a) mitigating factor properly conveyed to the jury that it could conclude defendant suffered from extreme mental disturbance even if it did not conclude that defendant suffered from a mental disease or defect. Indeed, the trial court specifically mentioned that \"this mitigating factor is established by evidence showing that defendant was suffering from an extreme mental or emotional disturbance and that such disturbance influenced him to commit the murder.\" The court then defined disturbance as \"agitation, confusion, or violent change.\" Although the jury charge did not contain the precise language in the model jury charge, the instruction in no way suggested that the c(5)(a) factor could not be found absent mental disease or defect. We also note that defense counsel's explanation of the c(5)(a) mitigating factor during summation was consistent with the instruction given.\n\nI. Unanimity on mitigating factors\n\nDefendant argues that the trial court improperly instructed the jurors that they should attempt to reach a unanimous agreement on the mitigating factors. During the penalty phase, the court informed the jury that the \"law does not require unanimity with respect to the finding of mitigating factors.\" However, the court added, \"with respect to mitigating factors, to the extent reasonably possible, you should attempt to reach an agreement regarding whether a particular mitigating factor does or does not exist.\" According to defendant, the court's comment conveyed an impression that unanimity was preferred, and thus some jurors who might initially have been inclined to apply one of the mitigating factors may have changed their minds in an attempt to reach the improper goal of unanimity. Defendant claims that he is entitled to a new penalty phase, because the instruction on unanimity might have coerced the jury into returning a unanimous verdict.\n\nIt is black-letter law that a trial court cannot require a unanimous finding of mitigating factors. Mills v. Maryland, 486 U.S. 367, 108 S. Ct. 1860, 100 L. Ed. 2d 384 (1988); State v. Hunt, 115 N.J. 330, 382-85, 558 A.2d 1259 (1988); Bey II, (supra) , 112 N.J. at 160-61. In Bey II, (supra) , we held that \"any juror who believes in the existence of a mitigating factor must be allowed to determine whether he harbors such a doubt [that the aggravating factors outweigh the mitigating factors] by conducting his or her own weighing process.\" 112 N.J. at 160. During the penalty phase, \"each juror must individually determine the existence of mitigating factors.\" Id. at 161. Although jurors should exchange views in order to reflect upon their own opinion of the propriety of a death sentence, the purpose of deliberations in the penalty phase is not served by deliberations that continue until the jury can return a unanimous verdict. Hunt, (supra) , 115 N.J. at 384.\n\nViewed in isolation, the single remark objected to by defendant might suggest that the preferred result is a unanimous Conclusion concerning the existence or non-existence of a mitigation factor. However, when the isolated remark is viewed in the context of the charge as a whole, it is clear that there was no error. On at least five occasions, the trial court informed the jury that unanimity on mitigating factors was not required. The jury verdict also provides compelling evidence that there was no confusion among the jurors about the permissibility of reaching a non-unanimous verdict on the mitigating factors. Of the thirty-one mitigating factors submitted to the jury, a non-unanimous finding was returned on nineteen factors. Defendant's claim is without merit.\n\nJ. Murder to avoid apprehension as an aggravating factor 1. Insufficient evidence\n\nDefendant contends that the trial court erred in submitting aggravating factor c(4)(f) to the jury because there was insufficient evidence to support a jury finding that that factor existed. The c(4)(f) aggravating factor applies to those murders \"committed for the purpose of escaping detection, apprehension, trial, punishment or confinement for another offense committed by the defendant or another.\" N.J.S.A. 2C:11-3c(4)(f). Prior to trial, defense counsel moved to strike aggravating factor c(4)(f). The State opposed the motion and argued that there was no apparent reason for defendant to kill Marsh except to conceal his identity. In denying defendant's motion, the trial court identified several factors as constituting sufficiently probative evidence to warrant the submission of the c(4)(f) factor to the jury. The court noted, for example, that there were no signs of any significant struggle between the victim and his assailant, that the physical scene did not appear unduly disturbed, and that the mortal wound inflicted at close range suggested that the victim may have had the opportunity to get a good look at his perpetrator.\n\nAt the end of the State's penalty-phase case-in-chief, defendant moved for a directed verdict on the c(4)(f) factor, arguing that the State presented insufficient evidence to support that factor. In particular, defendant argued that new evidence presented during the penalty phase, namely, that defendant was wearing a mask at the time of the murder, made it extremely unlikely that defendant killed Marsh to avoid future identification. Despite evidence of the mask, the trial court denied the motion, finding that when the evidence was viewed in its entirety, a reasonable jury could find the existence of the aggravating factor. On appeal, defendant argues that the State's evidence was refuted, is speculative, and is nonconclusive.\n\n\"The key to finding factor c(4)(f) is that the defendant intended to eliminate a potential witness to his crimes\" Martini I, (supra) , 131 N.J. at 281 (citing Hightower, (supra) , 120 N.J. at 421). Although the mere fact that a killing takes place in the course of a felony is not enough to invoke this factor, \"nothing in the language of the factor indicates that it was meant to apply only to those murders undertaken solely for the purpose of eliminating a witness.\" Martini I, (supra) , 131 N.J. at 282; accord Hightower, (supra) , 120 N.J. at 420-23. The State has to produce ample evidence from which a reasonable jury could conclude that at least one of the purposes motivating the killing was defendant's desire to avoid detection, apprehension, and punishment for his crime. Hightower, (supra) , 120 N.J. at 422 (citation omitted). Because direct evidence of a defendant's intention to eliminate a potential witness is rarely available to prosecutors, the State may establish defendant's motive with either circumstantial or direct evidence. Martini I, (supra) , 131 N.J. at 282.\n\nIn the instant case, the State presented sufficient circumstantial evidence to support the jury's finding that one of defendant's motives in killing Gary Marsh was to eliminate the victim as a witness to his robbery of the Exxon Station. Defendant drove miles from his home in Bristol, Pennsylvania, passing hundreds of potential targets along the way, to a secluded station located in Lawrenceville Township, New Jersey to commit the robbery. By traveling far from his home, defendant minimized the possibility that any potential witnesses would be able to identify him. Defendant's decision to wear a mask and fatigues further suggests that defendant feared being identified. Even if defendant wore a mask, Marsh still might have been able to identify his assailant's voice, height, weight, and overall build. In addition, Marsh could have described the color, make, and model of defendant's car, not to mention its Pennsylvania license plates.\n\nFurther, defendant did not have to kill Marsh to effectuate the robbery. There was no sign of forced entry or of physical struggle inside or outside the office. Marsh was no more than a few feet away from defendant when he was shot in the head. He was shot in the temple, suggesting that he was not facing defendant at the time of the attack. Aside from the gunshot wound to the head, the victim was free of bruises, cuts, or defensive wounds. Defendant was also free of injury when he was arrested. No apparent purpose was served by Marsh's murder except for defendant's escape from detection and punishment.\n\nAlthough the evidence produced in support of factor c(4)(f) was sufficient to submit that factor to the jury and was sufficient for a rational jury to conclude that at least one of defendant's intentions in murdering Marsh was to escape detection and apprehension for the robbery, we remind the State that \"the mere fact of death is not enough to invoke this factor.\" Hightower, (supra) , 120 N.J. at 422 (quoting Riley v. State, 366 So. 2d 19, 22 (Fla. 1979)). Most persons who commit felonies hope to avoid apprehension. That does not mean that the c(4)(f) factor would automatically be present in every case in which the (4)(g) felony murder factor exists. Factor c(4)(f) requires that the State present sufficient evidence, either direct or circumstantial, that at least one of the defendant's motives in killing his victim was to avoid detection. Each case will turn on its particular facts. In this case, the State did present sufficient evidence from which a jury could infer that at least one of the purposes motivating the murder was defendant's intention to avoid apprehension and punishment for the robbery.\n\n2. Inadequate instruction\n\nDefendant argues that even if there is sufficient evidence in the record to support the c(4)(f) factor, plain error was nevertheless committed by the trial court because it did not adequately instruct the jury on the meaning of that factor. Specifically, defendant contends that the trial court's decision to deviate from the model charge provided in the Judges Bench Manual for Capital Cases lowered the State's burden of proof.\n\nThe trial court instructed the jury that, to find the c(4)(f) factor,\n\nyou must be satisfied beyond a reasonable doubt that the State has produced sufficient evidence upon which you could reasonably conclude that at least one of the purposes in killing Gary Marsh was to eliminate him as a witness against the Defendant, or for the Defendant to avoid his subsequent arrest and prosecution for robbery of attempted robbery.\n\nDefendant submits that the charge provided appears to instruct the jury that the reasonable doubt standard applies to whether the State produced evidence from which one could draw a reasonable Conclusion about the aggravating factor's existence, rather than to whether the aggravating factor actually existed.\n\nIn reviewing claims of erroneous jury instructions, the passage in question should be evaluated in the context of the charge as a whole. State v. Wilbely, 63 N.J. 420, 422, 307 A.2d 608 (1973) (holding that claim of error in jury charge should not be considered in isolation, but charge must be evaluated \"as a whole to determine its overall effect\"); accord Marshall I, (supra) , 123 N.J. 145. When the jury instructions in the present matter are considered as a whole, they clearly were adequate and did not lower the State's burden of proof.\n\nThe trial court repeatedly emphasized the State's burden of proving each alleged aggravating factor beyond a reasonable doubt as well as the State's burden of proving that the aggravating factors outweighed the mitigating factors beyond a reasonable doubt. With respect to factor c(4)(f) the Court stated:\n\nSpecifically, the State alleges that aggravating factor (4)(f) exists. The statute reads, the murder committed for the purpose of escaping detection, apprehension, trial, punishment or confinement for another offense committed by the defendant. To find this aggravating factor, you must be satisfied beyond a reasonable doubt that the State has produced sufficient evidence upon which you could reasonably conclude that at least one of the purposes in killing Gary Marsh was to eliminate him as a witness against the defendant, or for the defendant to avoid his subsequent arrest and prosecution for robbery or attempted robbery.\n\nWhen the charge is read as a whole, rather than in isolation, including the trial court's instruction that the jury was required to find the existence of each factor beyond a reasonable doubt, the jury instruction made clear that the State's obligation was to prove beyond a reasonable doubt that one of defendant's purposes in murdering Marsh was to escape detection. In addition, not only did defendant's counsel fail to object to the charge, but he affirmatively approved of the exact language used in the instruction at the charge conference.\n\nAfter reading the charge to the jury, the court distributed the verdict sheet; any ambiguity concerning the State's burden of proof with respect to factor c(4)(f) was cured by the clear language contained in the verdict sheet. The verdict sheet asked: \"Do you unanimously find beyond a reasonable doubt that any of the following aggravating factors exists: (1). The murder was committed for the purpose of escaping detection, apprehension, trial, punishment or confinement for another offense committed by defendant?\" The verdict sheet contains a clear instruction that the only standard to be applied to each aggravating circumstance is the reasonable doubt standard. See DiFrisco II, (supra) , 137 N.J. at 489-92 (holding that clear language of verdict sheet cured potentially misleading nature of court's charge).\n\nK. Interview of penalty phase jurors\n\nThe day after defendant was sentenced to death the Trentonian featured an article in which one of the penalty-phase jurors was quoted as stating that the jury never \"lost sight of the fact that the victim also had a family. We had an obligation to them also.\" Pursuant to R. 1:16-1, defense counsel moved for permission to interview the jurors to determine whether improper considerations had tainted the verdict. R. 1:16-1, \"Interviewing Jurors Subsequent To Trial,\" states:\n\nExcept by leave of court granted on good cause shown no attorney or party shall directly through any investigator or other person acting for the attorney interview, examine or question any grand or petit juror with respect to any manner relating to the case.\n\nThe defense claims that the jury's focus on the victim's family was the result of the court room outburst by the daughter of the Atlantic County murder victim. The trial court denied the motion based on lack of jurisdiction because the defendant had already filed a Notice of Appeal. Defense's motion for a limited remand to consider the motion was likewise denied by this Court. Defendant argues that he was entitled to interview the jurors to discover whether they had improperly weighed victim impact considerations in rendering their decision to impose the death penalty. Because defendant believes that a remand at this juncture would be pointless as jurors will be unable to recall what was on their minds in December 1994, he argues that under the First, Sixth, Eighth, and Fourteenth Amendments and the corresponding rights under the New Jersey Constitution, he is entitled to a new penalty trial. Additionally, defendant asserts that, to the extent that Rule 1:16-1 prevents him from interviewing the jurors, the rule is unconstitutional.\n\nRule 1:16-1 \"reaffirms the privilege accorded jurors against disclosure of their communications during deliberations--a privilege required in the interest of fair trial since 'Freedom of debate might be stifled and independence of thought checked if jurors were made to feel that their arguments and ballots were to be freely published to the world.'\" Pressler, Current N.J. Court Rules cmt. 1 on R. 1:16-1 (1996) (quoting State v. LaFera, 42 N.J. 97, 106 (1964)). That rule recognizes that there may be extraordinary circumstances in which jury misconduct or the introduction of extraneous information into the jury deliberations brought about an unjust result. Ibid. \"'Good cause' intended by the rule . . . is some event or occurrence that injected into the deliberation in which the capacity for prejudice inheres.\" Ibid. (citing State v. Kociolek, 20 N.J. 92, 100, 118 A.2d 812 (1955)).\n\nThis Court's decision in Koedatich I, (supra) , 112 N.J. 225 is controlling. In Koedatich I, (supra) , defendant requested to interrogate jurors after his trial relying exclusively on a newspaper article printed after the trial, that quoted some jurors as having knowledge of his involvement in an unrelated murder. Id. at 286. The Koedatich Court observed that \"calling back jurors for interrogation after they have been discharged is an extraordinary procedure which should be invoked only upon a strong showing that a litigant may have been harmed by jury misconduct.\" Id. at 288 (quoting State v. Adorn, 46 N.J. 247, 250 (1966)).\n\nThe Koedatich Court recognized two exceptions to the rule. First, post-verdict interviews may occur when \"any racial or religious bigotry manifested in jury deliberations may invalidate a verdict.\" Ibid. (citing State v. Levitt, 36 N.J. 266, 176 A.2d 465 (1961)). The second exception \"arises when a juror informs or misinforms his or her colleagues in the jury room about the facts of the case based upon his personal knowledge of facts not in evidence.\" Ibid. Finding that the circumstances presented did not fall within one of those exceptions, the Koedatich Court concluded: \"We strongly believe that the contents of a single newspaper article, indisputably hearsay, cannot be the sole basis for the extraordinary procedure of a post-trial interrogation.\" Id. at 289.\n\nThis case presents the same circumstances. As in Koedatich I, the trial court properly denied the motion for post-verdict juror interviews that was based on a single newspaper article. In addition, defendant's claim that R. 1:16-1 is unconstitutional is without merit. See Loftin, (supra) , 287 N.J. Super. at 108-09 (holding that R. 1:16-1 is not unconstitutional).\n\nV. Combined Guilt and Penalty Phases Issues\n\nA. Admission of defendant's ammunition and gun\n\nparaphernalia\n\nWhen the police searched defendant's wallet, car, and house, they found a significant amount of gun paraphenelia. Defendant had a box in his kitchen closet that contained 500 rounds of ammunition for a .380 caliber weapon, a smaller box containing 26 bullets, and equipment and materials used for making one's own ammunition. Defendant did not object to the admission of that evidence at trial, but now claims that the trial court's failure to sua sponte exclude the evidence of the arsenal of bullets and the equipment used to make ammunition constitutes plain error in both the guilt and penalty phases. Defendant asserts that that evidence was not relevant to any issue, but that even if it was relevant, it should have been excluded because it showed defendant's bad character and propensity to commit criminal acts. 1. Relevance\n\nEvidence may only be admitted at trial when it is relevant, \"having a tendency in reason to prove or disprove any fact of consequence to the determination of the action.\" N.J.R.E. 401, 402; see Davis, (supra) , 96 N.J. at 619 (finding evidence relevant where it renders desired inference more probable than it would be without such evidence). Defendant claims that State v. Coyle, 119 N.J. 194, 574 A.2d 951 (1990), requires a finding that the evidence here was not relevant. In Coyle, (supra) , the State introduced into evidence the defendant's Soldier of Fortune magazine, instructions on the use of a silencer, a target, and a gun catalogue. Id. at 218. The State urged that the evidence was relevant to prove that the defendant's conduct was purposeful. The Court conceded that the defendant's \"marksmanship\" would be relevant, but held that \"defendant's ownership of Soldier of Fortune magazine, the silencer instructions, and the gun catalogue does not demonstrate sharpshooter ability.\" Id. at 219. However, the target would be admissible if the State could prove that the defendant had practiced with it or a similar target. Ibid.\n\nDefendant misconstrues Coyle. Coyle did not hold that all gun paraphenilia is per se irrelevant; it simply held that literature about guns merely indicates an interest in guns rather than marksmanship. Ibid. Defendant had more than just literature. Defendant had over 500 rounds of ammunition, a complete set of tools to reload cartridges, and a partially used box of ammunition. Moreover, police found in defendant's home a blank application for the Falls Township Rifle and Pistol Association, a club that the owner of D \u0026 S Gun Supplies (where defendant purchased his weaponry) recommended to his clients who shot guns often. Defendant's wallet contained a Washington State permit to carry concealed weapons and a business card for Target World, an indoor shooting range. In defendant's car, police found, along with defendant's gun, two magazines for the gun (one empty and one partially loaded), a \"side-kick\" shoulder holster that allows a person to conceal a weapon underneath a jacket, and a military identification card from defendant's service in the Navy. Defendant does not object to the admission of those objects into evidence but only objects to the admission of the arsenal of bullets and the bullet-making equipment.\n\nA ballistics expert testified at both the guilt and penalty phase trials that test results indicated a strong likelihood that the bullets found in defendant's closet were derived from the same process as the bullet used to kill Marsh. That testimony supports an inference of the knowledge, competency, and experience of defendant in handling firearms. Such evidence is significant to show that defendant intended to kill Marsh when he shot him in the head, and that the shot was not the result of an accidental discharge caused by an inexperienced marksman. As the State asserts, \"when defendant's possession of 500 rounds is viewed in conjunction with his complete set of tools for reloading cartridges (not to mention his Naval training, his permit to carry a concealed weapon, and his active interest in shooting ranges and clubs), a clear image emerges of a man possessing a wealth of knowledge of the workings of firearms and equally vast firsthand experience in firing them. That inference certainly strengthened the contention of an intentional murder.\" We agree.\n\nIn the penalty phase, the ammunition and reloading equipment evidence also was relevant to help demonstrate that one of defendant's motives for killing Marsh was to avoid apprehension. In conjunction with the other evidence that indicated defendant's familiarity with firearms (e.g., Naval training, a permit to carry a concealed weapon, and an active interest in shooting ranges), the ammunition and gun equipment evidence was germane in establishing the likelihood that the shot to the victim's head was intentional and designed to eliminate a witness.\n\n2. Probative value\n\nDefendant further contends that, even if the evidence was relevant, it should have sua sponte been excluded because it implied that defendant had bad character and a propensity to commit criminal acts, and its probative value was therefore substantialy outweighed by the risk of prejudice. N.J.R.E. 403(a). However, the State never argued that defendant's possession of the ammunition was illegal or that the ammunition indicated that defendant would be dangerous in the future. Accord Loftin, (supra) , 287 N.J. Super. at 93 (approving of introduction of same evidence into defendant's trial for prior murder). Indeed, defense counsel emphasized, on cross-examination of Officer Burnett, that defendant was not charged with unlawful possession of the ammunition.\n\nWhile the ammunition and reloading equipment may have prejudiced defendant, \"that evidence is shrouded with unsavory implications is no reason for exclusion when it is a significant part of the proof.\" State v. Stevens, 115 N.J. 289, 308, 558 A.2d 833 (1989) (quoting State v. West, 29 N.J. 327, 335, 149 A.2d 217 (1959)). The evidence did not prejudice defendant in an inflammatory way. If indeed it prejudiced defendant at all, it was only because it tended to prove a material element of the case against him.\n\nIn any event, even if the evidence should not have been admitted, the trial court's decision to admit the ammunition evidence would be harmless error. It strains credulity to believe that the admission into evidence of 500 rounds of cartridge reloading equipment could have prevented a fair consideration of the evidence, because the jury had already been exposed to similar evidence, including testimony during the penalty phase from defendant's wife that they went target shooting together. The trial court did not abuse its discretion when it admitted that evidence.\n\nB. Prosecutorial Misconduct\n\nThe primary duty of a prosecutor is to see that Justice is done. The prosecutor must refrain from using improper methods calculated just to produce a conviction. See, e.g., Marshall 1, (supra) , 123 N.J. at 152; State v. Farrell, 61 N.J. 99, 104, 293 A.2d 176 (1972). We have held that charges of prosecutorial misconduct will be more severely scrutinized in capital cases than other criminal cases. Ramseur, (supra) , 106 N.J. at 324. We explained that \"because death is a uniquely harsh sanction, this Court of necessity will more readily find prejudice from prosecutorial misconduct in a capital case than in any other criminal matters.\" Ibid. \"Prosecutors in capital cases have a special obligation to seek Justice and to not simply convict. . . .\" State v. Biegenwald, 106 N.J. 13, 40, 524 A.2d 130 (1987) (Biegenwald II).\n\nIn Ramseur, (supra) , we held that in assessing whether prosecutorial misconduct requires reversal of a criminal conviction, an appellate court should determine whether \"the conduct was so egregious that it deprives the defendant of a fair trial.\" Ramseur, (supra) , 106 N.J. at 322 (citing State v. Kelly, 97 N.J. 178, 218, 478 A.2d 364 (1984)). In determining whether a defendant's right to a fair trial has been denied, a court should consider \"whether defense counsel made a timely and proper objection, whether the remark was withdrawn promptly, and whether the court ordered the remarks stricken from the record and instructed the jury to disregard them.\" Id. at 322-23.\n\nThe prosecution is afforded considerable leeway, within limits, in making opening statements and summations. See DiFrisco II, 137 N.J. at 474; Williams II, (supra) , 113 N.J. at 447. Not every deviation on the part of the prosecutor requires reversal of the conviction or sentence. State v. Darrian, 255 N.J. Super. 435, 453, 605 A.2d 716 (App. Div.), certif. denied, 130 N.J. 393 (1992).\n\n1. Guilt Phase\n\nDefendant complains that the prosecutor made certain improper comments during his summation that deprived defendant of a fair trial. Although he did not object to the State's reference to the killing as an \"execution-style murder\" until after the Conclusion of the penalty phase summation, defendant now complains about the prosecutor's characterization of the murder as an \"execution-style murder.\" Defendant asserts that any shot from less than six inches would have left gun powder; thus the absence of powder indicates that this was not an execution-style killing.\n\nIn view of the \"considerable leeway\" prosecutors have in developing a theory and the strong evidence that supports the State's characterization of the murder as \"execution-style,\" we find defendant's claim to be without merit. As discussed (supra) at ___ (slip op. at ___), defendant must have been between Marsh and the door, a distance of three feet. Whether defendant's gun was touching Marsh's head or was slightly further away, we find nothing improper in the State's characterization of this killing as an execution.\n\nDefendant also complains that the State told the jury not to speculate or theorize, but to follow the facts and all rational inferences from the facts. Defendant complains that this statement denigrated the defense \"because the defense legitimately put the State to its proofs by theorizing, based on the absence of evidence.\" We find no misconduct in this statement and do not agree that it denigrated the defense. That statement simply told the jury to evaluate the facts, as is the jury's duty. Moreover, the court's charge to the jury made it perfectly clear that reasonable doubt may arise from the evidence or the lack of evidence.\n\nDuring summation, the State argued that \"there is no evidence about a second slayer. . . . We know that the defendant himself and no other person has all of the credit cards. . . . Two, the defendant has the fifty-dollar bill which is beyond the majority of the proceeds.\" Defendant points out that the State never established that defendant had all of Marsh's credit cards, and furthermore that the State was unable to conclusively link the fifty-dollar bill found on defendant with that stolen from the gas station. He argues that that intentional misrepresentation of the facts warrants reversal.\n\nIn Miller v. Pate, 386 U.S. 1, 87 S. Ct. 785, 17 L. Ed. 2d 690 (1967), the prosecutor knew that a stain on the defendant's clothing was the result of paint but told the court that it was blood. The United States Supreme Court held that the Constitution \"cannot tolerate a state criminal conviction obtained by the knowing use of false evidence.\" Id., 386 U.S. at 7, 87 S. Ct. at ___, 17 L. Ed. 2d at 694. See also Marshall I, (supra) , 123 N.J. at 153-54 (finding misconduct when prosecutor represented knowledge of evidence never presented to court).\n\nThe State's comment does not rise to the level of false evidence in Miller. While no witness conclusively linked the fifty-dollar bill to the robbery, the fact that the relatively uncommon bill was hidden inside defendant's wallet, apart from his remaining money, certainly yields a strong inference that it was the same stolen bill. Similarly, because defendant was carrying Marsh's driver's license, car registration, social security card, health insurance card, ATM card, life insurance card, and various business cards along with five credit cards, there was a strong inference that defendant had all of the contents of Marsh's wallet. The State should not have been so definitive in its description of the evidence, but that misstatement was not so egregious as to deprive defendant of a fair trial.\n\nDefendant next complains that the State impermissibly shifted the burden of proof to the defense when it told the jury that \"there has been no dent made in the proofs of the State.\" Although that comment could be interpreted as shifting the burden to the defense to disprove the State's allegation, it seems more likely to have been intended as an observation of the strength of the State's case. Given the trial court's comprehensive charge explaining the presumption of innocence, that the presumption remains until the State has proven guilt beyond a reasonable doubt, that defendant \"has no burden to come forward with one scintilla of evidence,\" and that the burden is on the State \"and that burden never, ever shifts,\" we do not find that statement to have denied defendant a fair trial.\n\nDefendant also complains that the State characterized him as a \"cold-hearted and depraved murder [sic].\" In Pennington, (supra) , 119 N.J. at 577, we disapproved of the prosecutor's use of epithets to describe defendants. \"We caution prosecutors, as we have in the past, 'to be circumspect in their zealous efforts to win convictions.'\" Ibid. (citation omitted). The use of that phrase was inappropriate. However, the statement was not sufficiently egregious as to deprive defendant of a fair trial. 2. Penalty Phase\n\nDefendant argues that there were several incidents of prosecutorial misconduct in the penalty phase. As a result of those errors, defendant claims he is entitled to a reversal of his death sentence. First, defendant alleges that the State sought and obtained the presentence report prepared on defendant from the Atlantic County Probation Department without first notifying the defense. Over the defense's objection that the report was confidential under R. 1:38(b), the report was admitted for the purpose of cross-examination of defendant's wife and the defense psychiatric expert who had reviewed the report. Although the contents of a presentence report are not for public consumption, R. 1:39(b), the report is not privileged. A defendant may not obstruct a third party from obtaining the report through discovery when a legitimate trial need for discovery of its contents exists. Blue, (supra) , 124 N.J. Super. 276, 282-83 (1973). Furthermore, the report would ultimately have been discoverable because the defense psychiatric expert used it in preparation for trial. Therefore, no prejudice resulted from the State's failure to give notice of the acquisition of the report.\n\nDefendant also alleges in the penalty phase that the State's repeated characterization of the murder as \"execution-style\" amounted to misconduct. Defendant contends that the inflammatory nature of the comments satisfy the plain error standard to Rule 2:10-2. As discussed, (supra) , at ___ (slip op. at ___), there was no error in the State's characterization of the murder as \"execution-style.\"\n\nDefendant also contends that the State's characterization of the murder as a \"cruel, inhumane, senseless act,\" encouraged the jury to find an additional aggravating factor. Defendant did not object to the State's characterization at trial. However, the trial court, sua sponte, observed that the prosecutor had not gone as far as alleging that the murder was \"heinous and cruel,\" but was concerned that the jury might perceive that it should consider \"cruel and inhumane murder\" as an extra aggravating factor. Consequently, the court issued the following curative instruction:\n\nYou are limited to the statutory aggravating factors alleged by the Prosecutor, and may not consider any factors that you believe are aggravating if they are not one of the three alleged aggravating factors specifically set forth by the prosecution, which the Court will instruct you on very shortly.\n\nDefendant did not object to the instruction and only now claims that the instruction was \"too little, too late.\" That the jury will follow the instructions given is presumed. Manley, (supra) , 54 N.J. at 271. The instruction given by the court was proper. Any potential prejudice resulting from the State's comments was cured by the court's instruction.\n\nDefendant also contends that some of the prosecutor's comments violated this Court's directive in Bey III, (supra) , 129 N.J. at 620-21, that a prosecutor may not mischaracterize a possible mitigating factor as an excuse. The comments made by the prosecutor did not amount to a violation of Bey III. The trial court correctly distinguished the first comment (\"what defense counsel 'call' mitigating factors\") as different from characterizing mitigating factors as \"excuses.\" The second comment (\"anything the defense may claim is a mitigating factor\"), was objected to by defense counsel and the trial court provided an immediate curative instruction. Finally, although no immediate curative instruction followed the final comment concerning the relevance of mitigating factors (\"in deciding whether the general information, apart from the murder, is a mitigating factor, you should ask yourself of what relevance is this information? What does it have to do with punishment for this crime.\"), the court instructed the jury to disregard any comments of counsel that were inconsistent with the law pronounced by the court. Any prejudice was cured by that instruction. Even if that instruction were inadequate, the prosecutor's statements were not \"so egregious\" as to require reversal. Ramseur, (supra) , 106 N.J. at 322.\n\nDefendant also complains that the prosecutor implied that he had personal knowledge of facts regarding the prior Atlantic County murder of Mrs. Fetter when he stated that the \"jury knew very little about the murder because the State was only permitted to provide limited information about the killing.\" Defendant asserts that those comments suggested to the jury that the prosecutor had additional information regarding the murder that would require that a death sentence be imposed. The defendant also alleges that the potential prejudice was exacerbated as a result of the courtroom outburst of Mrs. Fetter's daughter. Defendant claims that the jury may have known it was Mrs. Fetter's daughter and therefore assumed that the information the jury lacked on the prior murder was even more emotional and significant. Those inferences would lead the jury, defendant claims, to conclude that there exists additional, important reasons to sentence defendant to death. Defendant's arguments are speculative and meritless. The State's comments concerning the Fetter murder were proper and did not amount to prosecutorial misconduct.\n\nDefendant also alleges that the prosecutor improperly implied that \"the jurors will violate their oath if they fail to convict or return a death sentence,\" when in its summation the State argued: \"Defendant wants you to take the easy road, they say he will get sixty years and so he will never get out of prison, he'll die in prison. We asked you, though, that question in the voir dire process . . . and you all said that if there was a chance he would die in prison that wouldn't affect your decision. You swore to that. I hold you to that promise. . . . \"\n\n\"Remarks implying that jurors will violate their oaths if they fail to convict or return a death sentence are improper.\" Pennington, (supra) , 119 N.J. at 576. However, the comments made by the prosecutor in this case did not convey that message. Instead, those comments referred to a question asked to all jurors in voir dire, about whether the possibility of consecutive life sentences would affect their judgment. The court had determined that such a consideration was not an appropriate mitigating factor. See supra at ___ (slip op. at ___). Despite the court's ruling, the defense was able to argue that the defendant would likely die in prison if the jury sentenced him to life. Therefore, it was reasonable for the prosecutor to remind the jury that it should not consider the potential of sixty years parole ineligibility as a mitigating factor. No misconduct occurred.\n\nFinally, defense cites two instances in which the State arguably disparaged the credentials and objectivity of defendant's expert witnesses, Carmeta Albarus and Dr. Edward Dougherty. The State referred to Albarus as a \"purported\" expert who was \"a student trained in coming to court and telling us a story of someone from . . . a mitigation specialist point of view.\" Referring to Dr. Dougherty, the prosecutor stated that the doctor was \"a professional in the business of testifying in the defense of penalty phase cases\" and instructed the jury to weigh Dougherty's testimony with this \"bias\" in mind. That latter comment regarding Dr. Dougherty's bias was improper. However, it did not rise to the level of impropriety exemplified in State v. Moore, 122 N.J. 420, 462, 585 A.2d 864 (1991), where this Court cautioned against prosecutorial comments to the effect that a defense expert was \"a professional bleeding heart who was duped by the defendant.\"\n\nIn Conclusion, it cannot be said that the prosecutor's remarks at issue so tainted the jury as to render it \"incapable of fairly [assessing] the persuasiveness of [defendant's] case.\" Williams II, (supra) , 113 N.J. at 452.\n\nC. Sufficiency of limiting instruction concerning defendant's arrest for use of Marsh's credit cards.\n\nAt both the guilt and penalty phases of the trial, a videotape and testimonial evidence of defendant's arrest for the attempted purchase, four days after the Marsh murder, of $3000 worth of computer equipment with Marsh's Sears credit card was presented to the jury. There was no objection to the introduction of the evidence at the guilt phase of the trial. At the penalty phase, the defense counsel objected, seeking to preclude the introduction of the videotape. Defendant now contends that the introduction of this evidence at the guilt phase without a limiting instruction and its introduction at the penalty phase with an inadequate legal instruction constituted plain error.\n\nl. Guilt Phase\n\nN.J.R.E. 404(b) provides:\n\nEvidence of other crimes, wrongs, or acts is not admissible to prove the Disposition of a person in order to show that he acted in conformity therewith. Such evidence may be admitted for other purposes, such as proof of motive, opportunity, intent, preparation, plan, knowledge, identity or absence of mistake or accident when such matters are relevant to a material issue in dispute.\n\nIn Stevens, (supra) , 115 N.J. at 302, we recognized the \"widespread agreement that other-crime evidence has a unique tendency to turn a jury against the defendant.\" We therefore required \"a limiting instruction . . . to explain precisely the permitted and prohibited purposes of the evidence,\" informing the jury that it could not infer from that evidence that a defendant acted in accordance with his \"bad character.\" Id. at 304. But see Martini I, (supra) , 131 N.J. at 241 (holding that \"the Rule does not apply to uncharged acts of misconduct that are components of the crime that is the subject of the trial\").\n\nAs defendant concedes, evidence of the credit card use was relevant and admissible in the guilt phase. It proved defendant's motive (greed) and identity (because he could not have known about the victim's employment with Exxon unless he had been at the murder scene). However, defendant contends that the trial court should have sua sponte issued a limiting instruction pursuant to Stevens, (supra) , warning the jury not to infer guilt of murder from his attempted credit-card use. Defendant claims that the court's failure to issue an instruction constituted plain error.\n\nWe need not consider whether, like the evidence in Martini I, (supra) , the evidence here was res gestae and part of the same crime, because \"it seems unlikely to us that a juror would have been so affected by the sight of defendant engaging in the act of credit card fraud that she or he would have been moved to convict defendant of the violent crime of murder.\" Loftin, (supra) , 287 N.J. Super. at 97 (affirming Loftin's conviction of the Atlantic County murder); see also DiFrisco II, (supra) , 137 N.J. at 497 (finding introduction of evidence about prior car theft to be harmless. \"Considering that the defendant had confessed to the execution-style killing of [the victim], the fact that he stole a car, committed a few traffic violations and yelled at his mother had very little tendency to divert the jurors' attention from their duties.\") Because the other crime evidence (credit card fraud) was nonviolent and not at all similar to the murder of Marsh, the fact that a limiting instruction was not given does not require a reversal of defendant's murder conviction.\n\n2. Penalty Phase\n\nAt the penalty phase the other crime evidence was introduced again. The defense counsel insisted that no limiting instruction be provided because of a concern that any instruction would serve to highlight defendant's other crimes. Despite defense counsel's objection, the trial court instructed the penalty-phase jury:\n\nLadies and Gentlemen of the jury, I would just like to at this time give you a limiting instruction. You've heard the testimony from this witness that subsequent to the events at Sears, that the defendant was arrested in connection with the credit card fraud and theft. To the extent that the testimony was disclosed to you, those additional charges are not -- that the testimony was not elicited for the purpose of establishing the three aggravating factors which the State seeks to establish with proof beyond a reasonable doubt.\n\nThe only aggravating factors that the State is seeking to prove are those which have been specifically set forth to you by the State in its opening, and you're not to consider these arrests on these additional charges as evidence in support of the aggravating factors.\n\nThe trial court reiterated those instructions in its final charge to the jury.\n\nDefendant does not challenge the admission into evidence of those crimes, recognizing that the evidence was relevant to aggravating factor c(4)(g)(murder was committed in the course of a robbery). However, defense counsel contends that despite its insistence that no limiting instruction be given, the instruction provided at the penalty phase concerning those crimes was insufficient under Stevens, (supra) , 115 N.J. 289.\n\nIn Stevens, (supra) , we observed that \"trial courts should take pains to instruct juries carefully and comprehensively, with ample reference to the specific evidence and issues in a case, on the limited relevance of other-crimes evidence.\" 115 N.J. at 309. Similarly, in Rose, (supra) , we noted that a penalty phase jury \"is not permitted, in its weighing process, to add other evidence of defendant's past conduct to the weight it assigns to the aggravating factors, nor to consider other evidence of defendant's past conduct, except to the extent offered to rebut mitigating factors, as detracting from the weight it assigns to the mitigating factors.\" 112 N.J. at 507-08.\n\nIn this case, the limiting instruction was sufficient.\n\nIn its instruction, the court explained to the jury the limited relevance of the evidence, advising them \"you're not to consider these arrests on these additional charges as evidence in support of the aggravating factors.\" Furthermore, the trial court again instructed the jury in its final charge: \"You are not permitted in your weighing process to add evidence of defendant's past conduct, except to the extent offered to rebut mitigating factors and as detracting from the weight you assign to mitigating factors.\" That instruction was in full conformance with Rose, (supra) .\n\nFinally, because it was defense counsel who insisted that no instruction of any kind be given, he cannot now attack the adequacy of the charge issued. Supra at ___ (slip op. at ___). Even if the limiting instruction provided in this case was imperfect, the fact that the \"other-crimes\" evidence at issue consisted of a non-violent crime and was not at all similar to the crime charged supports the Conclusion that an imperfect limiting instruction, under these circumstances, is not reversible error.\n\nVI\n\nCumulative Effect of Errors\n\nDefendant argues that if we find, as we do, that none of the trial errors, standing alone, warrant reversal of his death sentence, then the sentence cannot withstand their cumulative weight. Together, defendant argues, the trial court errors contributed to his death sentence, making it constitutionally unreliable. See State v. Orecchio, 16 N.J. 125, 129 (l954) (noting that where \"legal errors . . . in their aggregate have rendered the trial unfair, our fundamental constitutional concepts dictate the granting of a new trial before an impartial jury\").\n\nAs we noted in Marshall I, (supra) , 123 N.J. at 169,\n\nThe fact that capital cases are vigorously contested, protracted, and consistently implicate subtle and difficult legal issues virtually assures that in the course of each trial some errors and imperfections will be apparent. Trial Judges, unlike appellate Judges, make their rulings in the heat of trial, without the opportunity for deliberative review, and not even the most experienced and conscientious trial Judges can be perfect.\n\n\"A defendant is entitled to a fair trial but not a perfect one.\" Lutwak v. United States, 344 U.S. 604, 619, 73 S. Ct. 48l, 490, 97 L. Ed. 593, 605 (l953). That is true even in capital cases, where we \"'subject the record to intense scrutiny,' recognizing that a defendant's very life is at stake.\" Marshall I, (supra) , 123 N.J. at 170 (quoting Bey I, (supra) , 112 N.J. at 92-93).\n\nWe have carefully reviewed each of the errors identified in the course of this opinion. We are satisfied, in the context of a trial that produced overwhelming evidence of defendant's guilt, that the combined effect of those errors was not clearly capable of affecting either defendant's convictions or his sentences.\n\nVII\n\nProportionality Review\n\nAs authorized by the Capital Punishment Act, N.J.S.A. 2C defendant has requested that we determine whether his \"sentence is disproportionate to the penalty imposed in similar cases, considering both the crime and the defendant.\" Review of defendant's sentence shall be undertaken pursuant to a briefing and argument schedule to be established by the Clerk of the Court after consultation with counsel.\n\nVIII\n\nConclusion\n\nIn summary, defendant's conviction for murder and his sentence of death are affirmed. In addition, defendant's convictions for the related offenses are affirmed.\n\nFinally, defendant's request for proportionality review is acknowledged and the matter will proceed according to a briefing and argument schedule to be established by the Clerk of this Court.\n\nJUSTICES POLLOCK, STEIN and COLEMAN join in JUSTICE GARIBALDI'S opinion. JUSTICE HANDLER has filed a separate Dissenting opinion. JUSTICE O'HERN has filed a separate Dissenting opinion in which JUSTICE HANDLER joins.\n\nHANDLER, J., Dissenting.\n\nThis capital-murder prosecution was rife with errors that strike at the core of our system of capital punishment. The errors serve to undermine the fundamental procedures that the Court has determined to be essential and has painstakingly established as the basis for the constitutional imposition of a death sentence. By minimizing and disregarding these errors, the Court sanctions the continued imposition of death sentences unmoored to any firm constitutional anchor. It retrenches on its commitment to a system that strives to guard against the arbitrary and discriminatory imposition of the death penalty.\n\nI\n\nThis case demonstrates with a shameful clarity, this Court's acquiescence in the unbounded and undisciplined use of a recurrent aggravating factor -- a murder to avoid apprehension. It thereby converts common-place, albeit tragic, homicides into capital murder. By bestowing such an overbroad interpretation on this aggravating factor, N.J.S.A. 2C:11-3c(4)(f) (\"c(4)(f)\") (murder to escape apprehension for another offense) here, where the State offered no substantive evidence of defendant's purpose, the Court ignores its own established and principled limiting standards designed to screen out murders that are not truly deathworthy.\n\nI have repeatedly written of the dangers of expanding the c(4)(f) factor. State v. Hightower, ___ N.J. ___ (1996) (Hightower II) (Handler, J., Dissenting) (slip. op. at 17-34); State v. Hightower, 120 N.J. 378, 434-38, 577 A.2d 99 (1990) (Hightower I) (Handler, J., Dissenting). The present case compellingly confirms that the Court's interpretation of the c(4)(f) factor condones an application of that factor that violates the federal and New Jersey constitutions in failing \"to reasonably justify the imposition of the death penalty\" on a defendant.\n\nSimilar to the wanton, vile aggravating factor, N.J.S.A. c(4)(c), the c(4)(f) factor is facially, unconstitutionally broad. See Hightower II, (supra) , ___ N.J. at ____ (slip. op. at 25-28) (Handler, J., Dissenting); see State v. Ramseur, 106 N.J. 123, 200-09, 524 A.2d 188 (1987). The United States Supreme Court has unequivocally stated that \"to pass constitutional muster, a capital sentencing scheme must 'genuinely narrow the class of persons eligible for the death penalty and must reasonably justify the imposition of a more severe sentence on the defendant compared to others found guilty of murder.'\" Lowenfield v. Phelps, 484 U.S. 231, 244, 108 S. Ct. 546, 554, 98 L. Ed. 2d 568, 581 (1988) (quoting Zant v. Stephens, 462 U.S. 862, 877, 103 S. Ct. 2733, 2742, 77 L. Ed. 2d 235, 249-50 (1983)). In New Jersey, aggravating factors perform the function of both guiding jury discretion in the determination of blameworthiness and narrowing the class of offenders to guard against arbitrary application of the sanction. Ramseur, (supra) , 106 N.J. at 186. However, every murder committed during the course of a rape, robbery, or other felony listed in c(4)(g), also automatically falls within the scope of the c(4)(f) factor because every criminal hopes to avoid detection. Ante at ___ (slip op. at 88-89). Therefore, the channeling function of the c(4)(f) aggravating factor is thwarted if the broad statutory language is not tempered by this Court's interpretation.\n\nAlthough the factor is facially overbroad, the United States Supreme Court has ruled that the constitutional overbreadth analysis considers the specific interpretation that the state supreme court imposes on the factor rather than the possible interpretations of the factor. Gregg v. Georgia, 428 U.S. 153, 201, 96 S. Ct. 2909, 2938, 49 L. Ed. 2d 859, 890 (1976). Until recently, this Court has attempted to enforce a standard of sufficiency of the evidence to prevent automatic duplication and unconstitutional application of the factors.\n\nNow, the Court completely abandons the requirement that the c(4)(f) and c(4)(g) factors each must cover some situation not covered by the other. Indeed, \"the c(4)(g) factor has evolved into a completely contained subset of the c(4)(f) factor, such that every c(4)(g) case is also a c(4)(f) case.\" See Hightower II, (supra) , __ N.J. at ___ (slip. op. at 24) (Handler, J., Dissenting). Though the Court professes to require the State to \"produce ample evidence\" that the defendant killed the victim because the defendant desired to escape prosecution, ante at ___ (slip. op. at 87), the nature of the evidence relied on by this Court to affirm the finding of the c(4)(f) factor, within the context of this case and in comparison with other cases, demonstrates that the State's burden of establishing the factor beyond a reasonable doubt requires no more than speculative and equivocal evidence. This case sadly reveals the unprincipled and contradictory manner in which the State applies the factor, and, as well, the pretextual nature of this Court's standards for limiting the factor.\n\nA.\n\nIt is appallingly obvious that the State failed to introduce evidence from which the jury could rationally conclude beyond a reasonable doubt that the c(4)(f) factor existed. Indeed, the Court can point to no specific evidence of the formation of a pre-murder intent to eliminate a witness to some underlying felony. Defendant made no statement confessing that the reason for the murder was to escape detection. Cf. State v. DiFrisco II, 137 N.J. 434, 500-02, 645 A.2d 734 (1994) (DiFrisco II) (noting defendant's statement that he killed victim to eliminate witness to procurer's criminal activity), cert. denied, ___ U.S. ___, 116 S. Ct. 949, 133 L. Ed. 2d 873 (1996); State v. Rose, 112 N.J. 454, 531, 548 A.2d 1058 (1988) (finding evidence of defendant's motive in defendant's own statement that he panicked and did not want to be caught with shotgun). There was no evidence indicating that if defendant did not shoot Gary Marsh, Marsh would identify defendant. In fact, the evidence strongly suggested that Marsh would and could never be able to identify defendant because defendant did not know his victim. Cf. State v. Martini, 131 N.J. 176, 283, 619 A.2d 1208 (1993) (Martini I) (rejecting defendant's claim of insufficient evidence to support the c(4)(f) factor and finding \"most persuasive the fact that the victim had been acquainted with defendant and was in his presence for an extended period of time during which defendant's identity was not disguised\"). There was no extended period of time prior to the shooting during which defendant and Marsh were in contact, and defendant wore a mask and army fatigues so that Marsh would have no ability to identify defendant in the future. Cf. Hightower II, (supra) , ___ N.J. at ___ (noting evidence of opportunity in course of robbery-murder to identify defendant as supporting c(4)(f) factor).\n\nStill further, there is no evidence of the type cited by this Court in State v. Harris, 141 N.J. 525, 535-36, 573, 662 A.2d 333 (1995), in which the Court recognized and relied on the fact that the victim was shot in an apparent escape attempt. No evidence demonstrated that Marsh attempted to attract attention to the scene of the robbery, or escape for help. Finally, defendant fired only one shot, and the victim was still alive when defendant left the station premises. State v. Mejia, 141 N.J. 475, 490, 662 A.2d 308 (1995) (finding rational basis for a finding of intent to commit serious bodily injury where defendant only shot victim one time and the victim survived long enough to speak with his girlfriend).B.\n\nNot only is there a complete absence of circumstances previously relied on by this Court to demonstrate intent to avoid apprehension, but the circumstances on which the Court does rely indicate only an intent to kill or intent to rob, and not an intent to avoid apprehension. Because the Court finds evidence of the most generalized nature to be sufficient in this case, the clear and inescapable import of the Court's ruling is that evidence of an intent to avoid apprehension, no matter how vague, ambiguous, and tenuous, will easily be gleaned from virtually any felony murder. One is hard-pressed to envisage a felony murder in which the State will be unable to use the c(4)(f) factor.\n\n1.\n\nExamples are at hand. The hollowness of the Court's standard for sufficiency of the evidence is flagrantly exposed when the State's arguments supporting the c(4)(f) factor in this case and in Hightower, are viewed together. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e In Hightower, the State argued that the c(4)(f) factor was supported by the fact that defendant robbed a local convenience store in broad daylight. The fact that the store was local implied that there would be an increased likelihood that someone would recognize defendant. The fact that it was a convenience store and the robbery occurred in the daytime implied that defendant would be aware that there was a strong potential for customer traffic and he therefore had to eliminate the witness to keep her quiet and avoid the potential that the clerk might draw the attention of a passerby. The State also argued that Hightower's failure to wear a disguise made the elimination of the witness all the more necessary because it increased the likelihood and ease of identification.\n\nHere, the State now argues that the c(4)(f) factor is supported by the fact that defendant planned to rob a gas station that was not local, and further planned to commit the offense in the pre-dawn hours when no one was on the road. The State finds further support for its argument in the fact that defendant wore a disguise. While in Hightower it was the actual exposure of the defendant that supported the c(4)(f) factor, in this case it is the contrary set of facts, the extreme precautions taken to conceal defendant's identity from any potential witness, that supports the same inference. Additionally, in this case, the prosecutor supported the c(4)(f) factor by pointing to the fact that Loftin did not know his victim, while in Martini I, (supra) , 131 N.J. at 280, the State argued that the defendant's prior relationship with the victim supported a finding of c(4)(f).\n\n2.\n\nWe need look no further than the four corners of this case to observe the standardless and unprincipled manner in which this factor will be pursued by the State if granted such unlimited discretion. In opposition to the defense's pre-trial motion to dismiss the c(4)(f) factor, the State argued that the factor could be established because \"there will be no evidence to show that Mr. Loftin had concealed his identification. . . .\" Therefore, the State contended, the only possible reason for the murder was \"to conceal [Loftin's] identity as the armed robber.\" Nevertheless, at the penalty phase, a significant basis for the prosecutor's argument was refuted when two State's witnesses testified that defendant was wearing a mask at the time of the murder. Though forced to abandon its guilt-phase argument that the lack of effort to conceal defendant's identity proved the intent to murder to escape apprehension, the State was undaunted. The State performed a complete about-face in the penalty phase, arguing that the effort to conceal his identity proved defendant's intent to avoid apprehension.\n\nThe majority accepts the State's inconsistent argument without question and attempts to justify its affirmance of the factor in this case by pointing to vague, emotive evidence of intent to rob and intent to kill as indicative of an intent to avoid apprehension. The majority fails, however, to identify any evidence, or plausible inferences from evidence, of intent to escape detection. It resorts instead to evidence of the planning that went into the robbery and the absence in the record of any other apparent motive to kill as support for the Conclusion that defendant intended to murder to avoid future identification and apprehension. Ante at ___ (slip op. at 87-88). Ultimately, the facts relied on by the majority are attenuated and speculative.\n\nFurthermore, contrary to the State's assertions, the stronger inferences are that defendant would not reasonably have been concerned about the gas station attendant identifying defendant through his plastic mask, army fatigues, or gun holster. There is additionally no reason to believe defendant feared Marsh would track defendant down by defendant's shoes or his car. Ante at ___ (slip op. at 88). Indeed, there is no evidence that defendant parked at the gas station rather than hiding his car on the street behind the station. Further, the arguments that defendant would kill the station attendant because of a fear that the victim would identify defendant's voice or his size and weight is worth mentioning only to expose the incredible lengths that the majority will travel to sustain the factor. Ibid. Neither defendant's voice nor height were distinctive. Hence, circumstances cited by the majority obviously are present almost in every robbery and cannot serve to limit the class of death eligible defendants.\n\nNor is defendant's prior experience with guns or his use of a gun during the robbery indicative of intent to eliminate a witness to avoid apprehension. This Court has recognized that the use of a loaded gun creates a permissible inference of intent to kill or to commit serious-bodily injury. E.g., Martini I, (supra) , 131 N.J. at 271 (quoting State v. Thomas, 76 N.J. 344, 387 A.2d 1187 (1978)); State v. Bucanis, 26 N.J. 45, 138 A.2d 739, cert. denied, 357 U.S. 910, 78 S. Ct. 1157, 2 L. Ed. 2d 1160 (1958). However, that inference has not been extended to an intent to eliminate a witness to avoid detection. If the latter inference arose whenever did the former, the impermissible duplication this Court proscribed would occur. In any event, the use of a gun does not indicate intent to avoid detection because the noise from the gun shot actually has the potential to attract attention. The absence of a silencer on defendant's gun flies in the face of the State's argument that defendant was a serious planner with an extensive knowledge of guns, acting out a firm intent of avoiding apprehension. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nIn sum, more robbers will carefully plan their robbery than will intend to eliminate a witness for the purpose of avoiding prosecution. Similarly, defendant's experience with a gun, his use of the gun, and the location of the wound, while suggesting an intent to kill, do not provide any information as to why that intent exists.\n\nThe majority also attempts to support the c(4)(f) factor by arguing that there is no evidence supporting any additional motive for killing Marsh. The fact is that there is no evidence about what actually did set off that trigger. Marsh was shot in the side of the head. Defendant may have raised his gun in response to Marsh turning away, or Marsh may have turned as defendant raised his gun. Defendant may have thought Marsh was reaching for a weapon and Marsh may have been searching for one. Or, Marsh may have said something to defendant, inciting the act. In sum, it is not only that there is a lack of evidence about any other motive, but there is a lack of any evidence as to what happened at all.\n\nMoreover, the basis of the State's argument that Marsh was cooperative and did not incite defendant is not supported by any evidence except the lack of evidence of struggle. Though Marsh was unarmed and may not have had access to a defensive weapon, defendant was not aware of this fact. Further, Marsh was standing when shot and did not have his back to defendant. There is no evidence that Marsh was in an especially vulnerable position and no affirmative evidence that Marsh did not act to provoke the attack.\n\nThe majority also finds support for the intent to avoid apprehension by arguing that defendant shot Marsh at close range. That highly equivocal fact does not speak to defendant's motive. A close range shot may argue for an intent to kill, but is silent as to underlying motive.\n\nMoreover, it is not at all clear that the shot was fired at close range. The majority draws this Conclusion from a number of facts. Because the room was so small -- 13'5\" by 9'7\" -- the parties were standing close, out of necessity. However, the police found Marsh lying on his back in the station office; Marsh's head lay three feet from the door and his feet were nearly nine feet from the door. Thus, a logical deduction is that Marsh was standing well inside the office; the spent shell near Marsh's head does not prove otherwise. The State's ballistics expert testified that the casing could be thrown between two and ten feet away from the gun if it did not hit any obstructions. The evidence does not prove that Marsh was shot from a very close range, and thus certainly not point blank. As the majority suggests, defendant was standing between the door and Marsh -- defendant could easily have been standing at the door when he pulled the trigger. C.\n\nThe evidence offered in support of the c(4)(f) aggravating factor thus truly boils down to the fact that there is no other apparent motive for the murder. In light of the State's burden to prove the aggravating factor beyond a reasonable doubt and defendant's Fifth Amendment right to remain silent and not present any evidence, the argument that defendant has not demonstrated another potential motive is not sufficient to sustain submission of the factor to the jury.\n\nAlthough the State has made a strong case for an intent to rob without being identifiable, that does not advance the argument that the killing was based on that intent. As the Court recognizes, all robbers will attempt to avoid future identification. If the majority relies on the fact that defendant was careful and, in the planning, made efforts to avoid identification during the robbery, then the Court's decision in Hightower is unjustifiable.\n\nWhere an aggravating factor is applicable to antithetic scenarios, it is clear that the factor is not serving the purpose of narrowing the class of defendants or distinguishing the more blameworthy defendants. Although the Court repeats its Conclusion that \"every murder will not be a murder to escape detection,\" the Court does not suggest why that is so. Every story of a murder committed during the course of a crime will contain a factual background from which to harvest a generic argument for this factor. Rather, if the aggravating factor is to have any limiting and channeling function, the Court must demand more specific evidence supporting the State's contention that a direct motivating purposes for the act of murder was intent to escape detection. As presently applied, the c(4)(f) factor clearly violates the constitutional limitations imposed by the Eighth Amendment.\n\nOur proportionality review studies demonstrate beyond question the deadly effect that the use of the c(4)(f) factor can have on the frequency with which the death sentence will be imposed. The consequences of the expansion of this factor are dramatic -- and in the context of capital punishment tragic. When the c(4)(g) felony murder factor is charged alone, without any other aggravating factor, the rate of death sentencing is 9.5 percent. However, when the c(4)(f) factor is charged along with the c(4)(g) factor the rate of death sentence imposition is 11.9 percent higher -- more than double -- than when c(4)(g) is alone present. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Thus, by sanctioning the charge of the c(4)(f) factor in all cases in which the c(4)(g) factor is raised, without demanding more specific evidence of intent to murder for the purpose of escaping detection, the Court invites and, indeed, renders inevitable, a very high risk of arbitrary and capricious death sentencing.\n\nBecause the totality of the circumstances, and specifically the fact that defendant wore a mask and did not know the victim personally, suggest that defendant would not have a motive to eliminate a witness to avoid apprehension, I Dissent from the Court's affirmance of the application of the c(4)(f) factor in this case.\n\nII\n\nDonald Loftin comes to this prosecution with a prior murder conviction. That prior murder conviction formed the basis of aggravating factor N.J.S.A. c(4)(a), and could be used by the jury during the penalty phase as a basis for imposing the death penalty. This Court previously held that two juries are necessary in a capital prosecution in which the State intends to use the defendant's prior-murder conviction as an aggravating factor. State v. Biegenwald, 126 N.J. 1, 43-44 (1991) (Biegenwald IV). The rationale underlying that ruling is that the prior murder conviction is not ordinarily admissible at the guilt phase of the trial, but the guilt-phase jury would nonetheless be exposed during the death-qualification process to the existence and potential use of the prior-murder aggravating factor. Ibid. In light of the Court's recognition that a prior murder conviction would have a \"blinding impact\" on a jury weighing a defendant's guilt, the trial court here empaneled two separate juries, one for the guilt phase and one for the penalty phase.\n\nBecause the guilt-phase jury would not sit during the penalty phase of defendant's trial, the trial court did not \"death-qualify\" the guilt-jury, nor did the court conduct the extensive individualized voir dire of those jurors that this Court has repeatedly required in death penalty cases. E.g., State v. Williams, 113 N.J. 393, 413, 550 A.2d 1172 (1988) (Williams II). In short, the trial court treated the guilt-phase jury as if it were a jury empaneled only to determine criminal guilt in a non-capital prosecution.\n\nUnlike the majority, I find the error in the trial court's failure properly to qualify and prepare the guilt-phase jury for the death-potential decision it was called on to make to be fundamental and reversible, and non-waivable. Even though it did not fix the ultimate penalty, the guilt-phase jury should have been apprised of the life-and-death consequences of its decision because in the bifurcated trial of this capital prosecution the jury was responsible for the critical finding of death eligibility. The requirement that the jury be fully informed and be responsible for its verdict through an awareness and appreciation of ramifications is not waivable. Furthermore, the voir dire of the guilt phase jury was utterly insufficient because it was not only grossly over-generalized and unfocused, it was not individualized or under oath and, therefore, violated Rule 1:8-3(a).\n\nA.\n\nIn deciding not to inform the guilt-phase jury that this was a death-penalty case and in not death-qualifying the jury, the trial court relied on our decisions in State v. Erazo, 126 N.J. 112 (1991), and Biegenwald IV, (supra) , 126 N.J. 1. In Biegenwald IV, we suggested that in certain circumstances, evidence that is admitted in either the guilt or the penalty phase would be so prejudicial in the other phase that two juries would be necessary. 126 N.J. at 43-44. In Erazo, we went further and suggested in dicta that an attendant benefit of having a separate jury for the penalty phase is that it \"would obviate death qualification of the guilt-phase jury.\" 126 N.J. at 132-33 (citing State v. Hunt, 115 N.J. 330, 396-99, 558 A.2d 1259 (1989) (Handler, J., Dissenting) (discussing the use of two juries throughout the trial)).\n\nMore recently, however, this Court emphasized the need for death-qualification, finding that a jury making the guilt determination must be informed of the life-or-death impact of its decisions. Mejia, (supra) , 141 N.J. 475. Specifically, we required that the jury be informed that a finding of an intent to kill rather than an intent to commit serious bodily injury would expose the defendant to the death penalty. Id. at 483-86. The Court noted that the failure to inform the jury of the legal effect of its findings -- that its determination would render the defendant death eligible -- could dilute the jury's sense of responsibility for the imposition of the death sentence. Id. at 485-86 (citing State v. Bey, 112 N.J. 123, 162, 548 A.2d 887 (1988) (Bey II)). The Mejia ruling highlights a tension inherent in our capital sentencing scheme. On the one hand, the Court has repeatedly recognized that \"in no other determination in the criminal law is it more important to make absolutely certain the jury is aware, not simply of the consequences of its actions, but of its total responsibility for the judgment.\" Ramseur, (supra) , 106 N.J. at 316-17 \u0026 n.80. Indeed, this Court has stated that \"to hide from the jury the full range of its sentencing options, thus permitting its decision to be based on uninformed and possibly inaccurate speculation, is to mock the goals of rationality and consistency required by modern death penalty jurisprudence.\" Id. at 311. In Bey II, (supra) , the Court explained the importance of the jury's awareness of its role in the capital-punishment process in the context of an error in the penalty phase. The Court held that \"in its charge to the jury in the sentencing phase of a capital trial, a trial court must be careful not to dilute the jury's sense of responsibility for determining the appropriateness of the death penalty.\" 112 N.J. at 162.\n\nOn the other hand, there is considerable support for the argument that death-qualification renders guilt-phase juries more prone to convict. See Buchanan v. Kentucky, 483 U.S. 402, 415 n.16, 107 S. Ct. 2906, 2913 n.16, 97 L. Ed. 2d 336, 350 n.16 (1987) (assuming that \"studies were 'both methodologically valid and adequate to establish that \"death qualification\" in fact produces juries somewhat more \"conviction-prone\" than \"non-death-qualified\" juries'\") (quoting Lockhart v. McCree, 476 U.S. 162, 173, 106 S. Ct. 1758, 1764, 90 L. Ed. 2d 137, 147 (1986)); McCree, (supra) , 476 U.S. at 188, 106 S. Ct. at 1772, 90 L. Ed. 2d at 157 (Marshall, J., Dissenting) (arguing that \"the very process of death qualification -- which focuses attention on the death penalty before the trial has even begun -- has been found to predispose the jurors that survive it to believe that the defendant is guilty\"); Rose, (supra) , 112 N.J. at 477 (noting that \"trial courts . . . may take into account defendant's concerns about the collateral effects of the death qualification process\"); Ramseur, (supra) , 106 N.J. at 428-35 (Handler, J., Dissenting) (observing that the issue of guilt of capital defendants should not be determined by a death-qualified jury); id. at 335-41 (O'Hern, J., Concurring) (observing that deathqualification may prejudice jury's ability to determine criminal guilt and, therefore, it is necessary to employ a separate, non-death-qualified guilt-phase jury); see also State v. Marshall, 123 N.J. 1, 216-24, 586 A.2d 85 (1991) (Marshall I) (Handler, J., Dissenting) (arguing that the use of a death-qualified jury for the guilt-phase determination is unconstitutional).\n\nThe tension between the two interests -- the right to a fair and impartial guilt-phase jury and the right to a jury that is fully informed of the consequences of its decision -- further demonstrates the unworkability of the death-penalty scheme. The Court's compromise in the present case -- mandating a restricted death-qualification yet making the requirement waivable -highlights the problem. See Ante at ___ (slip op. at 29) (\"If defense counsel objects to the death-qualification of the guilt-phase jury . . . a trial court shall deem such an objection to be a waiver of the defendant's right to a death-qualified jury in the guilt-phase. However, in the absence of any [objection by defense counsel], trial courts will give guilt-phase jurors a severely restricted death qualification, specifically not informing them of defendant's prior conviction for murder.\").\n\nI concur with the majority's recommendation that the death qualification of a guilt-phase jury in a double-jury capital trial need not be as expansive as that provided for the penalty-phase jury. Indeed, the only concern will be whether those jurors can lawfully fulfill their responsibility in determining guilt, with the knowledge that their determination may permit another group of jurors to find that the defendant deserves the death penalty.\n\nThe majority errs, however, in finding that defendant is precluded from raising this issue on appeal because of the contrary stance he took at trial. Defendant cannot waive his right to a fair and impartial jury that is informed and capable of rendering a responsible verdict. Moreover, it is clear that neither the defense nor the trial court anticipated this Court's ruling in Mejia.\n\nThe majority is wrong to equate this situation with that in Marshall I, (supra) , 123 N.J. at 93, where we reviewed the voir dire under the standard for invited error because trial counsel requested a limited death-qualification. Ante at __ (slip op. at 29). The prejudice resulting from the failure to inform the jury of the consequences of its verdict extends far beyond the prejudice resulting from the limited death-qualification in Marshall. At issue here is one of defendant's fundamental rights -- a right to an accurate jury instruction. We have repeatedly noted that trial courts have a sua sponte obligation to provide correct charges. State v. Robinson, 136 N.J. 476, 489, 643 A.2d 591 (1994); State v. Green, 86 N.J. 281, 289, 430 A.2d 914 (1981); see State v. Loftin, 287 N.J. Super. 76, 97, 670 A.2d 557 (App. Div.), certif. denied, 144 N.J. 175 (1996). \"So critical is the need for accuracy that erroneous instructions on material points are presumed to be reversible error.\" State v. Martin, 119 N.J. 2, 15, 573 A.2d 1359 (1990). Indeed, erroneous instructions \"are ordinarily considered 'poor candidates for rehabilitation under the harmless error philosophy.'\" State v. Harmon, 104 N.J. 189, 213, 516 A.2d 1047 (1986) (quoting State v. Simon, 79 N.J. 191, 206, 398 A.2d 861 (1979)); see State v. Vick, 117 N.J. 288, 289, 566 A.2d 531 (1989). In a remarkably similar context, this Court held that the failure to instruct the jury that it need not be unanimous in determining whether a capital defendant committed murder by his own conduct warranted reversal of the death sentence. State v. Brown, 138 N.J. 481, 509-28, 651 A.2d 19 (1994). No different result is acceptable here.\n\nThe Court's adoption of the waiver analysis in this context is possibly understood as the Court's attempt to reconcile the irreconcilable -- the real and inescapable potential that death-qualification renders a jury conviction prone and the constitutional imperative that capital guilt and punishment can be determined only by a death-qualified jury. Indeed, the majority recognizes that potential today in finding that defense counsel's decision to oppose death-qualification of the guilt-phase jury was \"a sound strategic decision.\" Ante at __ (slip. op. at 29); see also Marshall I, (supra) , 123 N.J. at 223 (Handler, J., Dissenting) (arguing that \"the Court implicitly acknowledges the validity of the position it has professed to reject. It thus characterizes defense counsel's request to limit death qualification as 'a well considered strategic attempt to limit juror exposure to questions concerning capital punishment'\"). Nonetheless, without explanation or justification, the majority declares that it need not determine whether death-qualification poses the alarming, fundamental prejudice that defendant asserts. The Court, I submit, cannot escape that it sacrifices, through defense counsel's waiver, the assurances that only a death-qualified jury can reliably determine whether the death penalty should be imposed. Even if the Court rules that death-qualification is only a waivable, and not a constitutional-fundamental right, the Court has an obligation to confront the potential prejudice that exists in the capital punishment system as a result of a procedure mandated by this Court's own jurisprudence. E.g., Ramseur, (supra) , 106 N.J. at 248-57. At some juncture, this Court will recognize that the many competing and sharply conflicting fundamental interests that collide in the administration of our capital-punishment regime and constantly require illogical and unsatisfactory compromises, justify, if not compel, the abandonment of the death penalty. Without abandoning the death- penalty scheme entirely, however, the Court must continue to confront the impossible task of integrating irreconcilable values, a process that riddles the system with hopeless contradictions.\n\nNor was the failure to inform the guilt-phase jury that it was deciding a capital case harmless. There was a rational basis on the record for finding that defendant had a mental state less than an intent to kill. Post at __ (slip op. at 1) (O'Hern, J., Dissenting). Therefore, the information had the clear possibility of affecting the outcome of the case.\n\nThus, Mejia requires that defendant's death sentence be reversed. The fact that defendant became death-eligible, based on a decision made by a jury that was entirely unaware of the legal effect of its actions, deprived defendant of his rights to Due Process, a fair jury trial, and freedom from cruel and unusual punishment. U.S. Const. Amends. VI, VIII, XIV; N.J. Const. art. I, PP 1, 10, 12.\n\nB.\n\nThe procedure employed for the guilt-phase voir dire violated both the requirement of Rule 1:8-3(a) that the voir dire of jurors in death cases be conducted individually and under oath, and our recognition of a heightened need for juror impartiality in capital cases. State v. Williams, 93 N.J. 39, 61, 459 A.2d 641 (1983) (Williams I).\n\nMoreover, the circumstances of this case -- the murder of a white working class person by an unemployed African-American -obligated the court to conduct a scrupulous and searching review of potential juror prejudices. Shockingly, rather than expanding the scope of the inquiry, the trial court only lightly touched on the subject of racial bias. Its cursory questioning provided no insight into the feelings and attitudes of potential jurors; the voir dire provided absolutely no guidance to the court or counsel in judging the impartiality and quality of jurors and in intelligently exercising peremptory and cause challenges. The deficient voir dire does not even conform to our standards for non-capital cases.\n\nThe right to an impartial jury is guaranteed by the Sixth Amendment of the Federal Constitution as well as by the New Jersey Constitution. Williams I, (supra) , 93 N.J. at 60-61. An impartial jury is essential to ensuring a defendant's right to a fair trial. \"This requirement of fairness -- and particularly jury impartiality -- is heightened in cases in which the defendant faces death.\" Id. at 61; Ramseur, (supra) , 106 N.J. at 324 n.84 (1987). Recognizing the difficulty of exposing both \"potential and latent bias,\" the Court has stressed the importance of \"more exhaustive and searching voir dire examinations\" in capital cases to ensure the educated use of peremptory and cause challenges. Williams II, (supra) , 113 N.J. at 409-10 (quoting Williams I, (supra) , 93 N.J. at 68-69 (footnotes omitted)); id. at 427; State v. Biegenwald, 106 N.J. 13, 27-30, 524 A.2d 130 (1987) (Biegenwald II) (holding that capital defendants require greater freedom to explore potential bias and prejudice); Ramseur, (supra) , 106 N.J. at 243-48. A jury making life or death decisions must be \"as nearly impartial as the lot of humanity will admit.\" Williams I, (supra) , 93 N.J. at 60-61 (citations omitted).\n\nThere is no reason to relax these rules when two juries are used instead of just one. In State v. Moore, 122 N.J. 420, 585 A.2d 864 (1991), this Court recognized the deficiency of a single question such as the one posed in the present case. \"It is not enough just to ask jurors in a capital case whether the nature of the crimes would affect their ability to be fair in deliberating on a death sentence versus a term of years. The question is correct so far as it goes, but it really invites only one answer. Will many say that they will be unfair?\" Id. at 449. Thus, one question posed to a panel of jurors inviting an admission that a juror is prejudiced or unfair, is not sufficient.\n\nNor do the rules governing the selection of jurors in criminal cases provide for a relaxation of the voir dire requirements when two juries are used. Arguing a distinction between a guilt-phase jury in a double-jury capital trial and a jury in a trial of a crime punishable for death, the majority cites Rule 1:8-3(a) as a basis for abandoning the more thorough and comprehensive voir dire for the guilt phase of a capital double-jury trial. Ante at ___ (slip op. at 31-33). Rule 1:8-3(a) provides for a less extensive and less probing voir dire in non-capital trials. Specifically, the Rule provides:\n\nFor the purpose of determining whether a challenge should be interposed, the court shall interrogate the prospective jurors in the box after the required number are drawn without placing them under oath. The parties or their attorneys may supplement the court's interrogation in its discretion. At trials of crimes punishable by death, the examination shall be made of each juror individually, as his name is drawn, and under oath.\n\n[R. 1:8-3(a) (emphasis added).]\n\nDefendant was undeniably tried for a crime \"punishable by death.\" Under the plain language of the rule, defendant's jury should have been subjected to an individualized voir dire. The majority asserts that in requiring individual voir dire \"at trials of crimes punishable by death,\" the authors of the Rule intended for the individualized voir dire to apply exclusively to the penalty phase of capital cases. Ante at __ (slip op. at 32-33). The majority's distinction finds no support in the plain language of the rule, in the commentary to the rule, or in prior case precedents. Its only support is derived from a proposed amendment to the rule which would make guilt-phase juries in double-jury capital trials subject to the traditional en banc voir dire. Ante at ___ n.1 (slip op. at 33 n.1). Legislative intent cannot be inferred from proposed amendments not yet adopted. An individualized and probing voir dire is required.\n\nIn this case, the trial court's two-day collective voir dire was insufficient to ensure defendant's right to a fair and impartial jury. Even in non-capital cases, we require an extensive and probing voir dire when the issue of race dangerously pervades the case.\n\nTo avoid the possibility of impermissible considerations infecting jury deliberations and tainting the verdict, a trial court has a duty to explore potential juror prejudice and bias. That duty is heightened in cases with overt racial overtones. State v. Horcey, 266 N.J. Super. 415, 629 A.2d 1367 (App. Div. 1993) (holding that counsel may directly raise the issue of racism or prejudice during voir dire when issue is clearly present in the case); see Turner v. Murray, 476 U.S. 28, 106 S. Ct. 1683, 90 L. Ed. 2d 27 (1986); Moore, (supra) , 122 N.J. at 449 (noting the need for a searching inquiry into jurors' beliefs and biases).\n\nThe trial court's questions were posed to the entire panel, sitting in open court. Jurors were expected to raise their hands if they had a response to a question or harbored a personal concern. Jurors in the larger venire were instructed to listen carefully to the entire proceedings. When a juror was excused for cause, or as a result of a peremptory challenge, another potential juror selected from the larger pool was asked whether, after having \"an opportunity to hear the Court's opening remarks and questions . . . . [he or she had] any responses so far with respect to any of the questions.\" On the second day, the trial court did not review its questions from the first day. None of the original sixteen people selected, nor any of the additional jurors brought into the pool, were sworn prior to the questioning.\n\nThe court conducted limited, individualized questioning of jurors when the court considered it necessary, such as when jurors indicated prior knowledge of the case or volunteered that they had personal experience with the criminal Justice system. However, on the critical issue of racial bias, the court asked no individual questions and elicited no responses.\n\nOn the first day of the voir dire, the trial court did ask the panel of prospective jurors whether they would be influenced by the fact that defendant was African-American and the victim was white. Specifically, the court stated:\n\nLadies and gentlemen, as you can see, Mr. Loftin is an African-American. The alleged victim in this matter, Mr. Marsh, is white. Would the fact that the defendant is an African-American and the deceased in this matter is white, would that affect your ability to keep an open mind about this case and make a decision based on the evidence rather than the racial makeup of the defendant and the deceased in this matter? If so, please indicate by raising your hand.\n\nNot surprisingly, no hands were raised. The trial court continued without any further individualized questioning on the issue. Though the court instructed the panel that members were free to raise controversial issues at sidebar at an inconspicuous juncture, on the first day of the voir dire the court proceeded directly from the single racial bias question posed to the panel to a questioning of the larger jury pool concerning hardship issues. Therefore, none of the sixteen jurors on the panel had the opportunity to raise their hands to a later, less controversial question in order privately to inform the court about potential racial biases.\n\nThe court revisited the issue of prejudice on the second and final day of the voir dire, stating:\n\nBut in deciding what the facts are, you are to do so without bias, without prejudice, without sympathy, passion or favor of any kind, and I'm going to talk a little bit more about bias and prejudice, because for most of us, when we hear the word bias and we hear the word prejudice, we get defensive because we don't want anybody to think or accuse of being prejudiced. And that's why I ask that question yesterday. I pointed out to you that the defendant in this case is an African-American and that the victim in this matter is white, and I asked would any of you make a decision in this case based on the racial make-up, and you all answered no.\n\nThe court then provided a simplistic example of the very critical responsibility it was imparting to the jurors. Indeed, by equating racial bias to the bias of a sports fan the court only trivialized the concerns over racial discrimination. Thus, the trial Judge explained bias by referring to her own strong feelings about the Dallas Cowboys and her admittedly irrational instinct to express those biases by penalizing attorneys who do not share her football preferences. The court also recognized that in 1994, people do not generally admit to biases; instead of openly admitting the bias people silently act out their feelings. The court then instructed the jury not to act against the defendant and against the State of New Jersey, but to come forward to the court, at a less conspicuous time, \"if you believe that you have any bias that could affect your ability to be fair and impartial.\"\n\nThis limited and cursory voir dire could hardly be expected to uncover actual experiences, attitudes, or latent feelings that might suggest racial bias on the part of individual jurors. Because the case deals with an interracial murder, it is clear that defense counsel was entitled to have the jurors questioned on bias. Ramseur, (supra) , 106 N.J. at 243-48; Horcey, (supra) , 266 N.J. Super. 415. The voir dire in this case was particularly problematic because it failed to elicit even one response from any juror touching on the strong racial themes that pervaded this case. Indeed the broad brush exploration of this critically important and sensitive area of juror qualification left defense counsel \"insufficiently informed to make an intelligent and effective challenge of potential jurors for cause or peremptory.\" Williams II, (supra) , 113 N.J. at 408 (noting also how cursory nature of questioning affected prosecutor's use of his peremptory challenges and \"perhaps most importantly left the trial court unable to fairly evaluate the fitness of many of the jurors to serve\"). Counsel's own perception that the voir dire was adequate cannot redress the institutional requirement that the jury be adequately and correctly qualified to participate in a capital prosecution. As significant, the voir dire left the court itself totally unenlightened about whether it had empaneled a jury with the requisite level of impartiality for the determination of a capital prosecution involving an interracial murder.\n\nThe trial court's procedure for jurors to reopen the issue of racial bias also failed to satisfy the high standards required in the context of this case. Significantly, the court placed the full responsibility and burden of revealing a juror's prejudice on the juror. Just as it is unrealistic to assume that prospective jurors would reveal their prejudices in the open and spectator-filled courtroom, it is not realistic to expect that jurors will readily approach the bench to unburden themselves of personal experiences and feelings of racial bias. The question must be asked of individual jurors directly, discretely, persistently, and privately. The court must be able to evaluate the physical presentation of the spoken answer including the demeanor of the juror. Too much is at stake. The undisclosed prejudice that may go unchecked as a result of the trial court's omission generates a potential for unfairness that cannot be tolerated.\n\nThe dangers of an inadequate voir dire were starkly highlighted in the present case. Juror M. was selected as one of the final sixteen jurors. On June 28, 1994, the fourth day of the trial, two of M.'s coworkers called the court and informed the court that M. had discussed the trial at work. The coworkers additionally alleged that M. was a racist. The court questioned M. in chambers. M. admitted telling his coworkers that he had made up his mind about the trial and was off to the hardware store to purchase some rope with which to hang defendant. M., however, claimed he did not mean what he said and only made the comments to stop the harassment from coworkers. M. never deliberated with the jury. However, the fact that M. slipped through the voir dire points to the dangers of such a restricted voir dire. \"If counsel is unable to screen out prejudice and bias, that inevitably leads to unfair juries. This result -- or the possibility of this result -- cannot be tolerated.\" Williams II, (supra) , 113 N.J. at 409 (emphasis added).\n\nWhether the voir dire conducted here is considered under the rigorous standards governing the voir dire in capital cases or the more relaxed standard governing non-capital cases, the questioning of the potential jurors on their biases was wholly inadequate. The majority's default on its responsibility to safeguard the death-penalty process from the discriminatory application of the ultimate punishment is particularly ominous.\n\nIII\n\nContrary to firmly-settled principles, the majority finds the restriction of defendant's ability to proffer relevant mitigation evidence harmless. Further, the majority unduly restricts a capital defendant's ability to proffer mitigating evidence. Specifically, the majority dismisses as harmless the trial court's failure to inform the jury that it may consider in mitigation of the death penalty the fact that a life sentence will result in defendant's probable, if not certain, death in prison prior to becoming parole eligible. Additionally, the majority restricts the defendant's ability to proffer the impact that the execution would have upon defendant's family as relevant character mitigation evidence. Other additional restrictions sanctioned by the majority further distort this Court's previously established scheme of guided discretion.\n\nThe Eighth Amendment guarantees that a capital defendant may submit all mitigating evidence to his sentencer that is relevant to \"the character and record of the individual offender and the circumstances of the particular offense.\" Woodson v. North Carolina, 428 U.S. 280, 304, 96 S. Ct. 2978, 2991, 49 L. Ed. 2d 944, 961 (1976). The focus of the requirement is to ensure that the sentencer can make a reasoned, individualized decision regarding the deathworthiness of the defendant. The United States Supreme Court has also established \"the corollary rule that the sentencer may not refuse to consider or be precluded from considering 'any relevant mitigating evidence.'\" Skipper v. South Carolina, 476 U.S. 1, 4, 106 S. Ct. 1669, 1671, 90 L. Ed. 2d 1, 6 (1986) (quoting Eddings v. Oklahoma, 455 U.S. 104, 114, 102 S. Ct. 869, 877, 71 L. Ed. 2d 1, 11 (1982)); see also id. at 8, 106 S. Ct. at 1673, 90 L. Ed. 2d at 9 (finding trial court erred in excluding \"credible evidence that petitioner was a good prisoner\" even though the evidence did not directly pertain to defendant's blameworthiness for the crime).\n\nThe United States Supreme Court stated that \"full consideration of evidence that mitigates against the death penalty is essential if the jury is to give a reasoned moral response to the defendant's background, character, and crime.\" Penry v. Lynaugh, 492 U.S. 302, 327-28, 109 S. Ct. 2934, 2951, 106 L. Ed. 2d 256, 284 (1989) (quotation omitted). \"Full consideration\" has repeatedly been interpreted in an expansive manner:\n\nThe Eighth and Fourteenth Amendments require that the sentencer, in all but the rarest kind of capital case, not be precluded from considering as a mitigating factor any aspect of a defendant's character or record and any of the circumstances of the offense that the defendant proffers as a basis for a sentence less than death.\n\n[ Lockett v. Ohio, 438 U.S. 586, 604, 98 S. Ct. 2954, 2964, 57 L. Ed. 2d 973, 990 (1978) (footnotes omitted).]\n\nAs a constitutionally necessary element of individualized capital sentencing, the New Jersey Legislature and this Court have expressed a strong commitment to recognizing mitigating factors, and further to favoring the admission of any reliable evidence relevant to mitigating factors at the penalty phase. N.J.S.A. 2C:11-3c(2)(b) provides, in pertinent part, that \"the defendant may offer, without regard to the rules governing the admission of evidence at criminal trials, reliable evidence relevant to any of the mitigating factors.\" In line with the legislative intent, this Court has adopted a \"'broad [test for relevance that] favors admissibility.'\" State v. Davis, 96 N.J. 611, 619, 477 A.2d 308 (1984) (quoting State v. Deatore, 70 N.J. 100, 116, 358 A.2d 163 (1975)). When applying this test, the Court instructs that doubts be resolved in favor of admissibility. Davis, (supra) , 96 N.J. at 620 (citing Zant v. Stephens, (supra) , 462 U.S. at 886, 103 S. Ct. at 2748, 77 L. Ed. 2d at 256 (citing Gregg v. Georgia, (supra) , 428 U.S. at 203-04, 96 S. Ct. at 2939, 49 L. Ed. 2d at 891 (holding that \"so long as the evidence introduced [at a capitalsentencing hearing does] not prejudice a defendant, it is preferable not to impose restrictions\"))). This Court further held that \"the sentencing process should embrace an evidential inquiry 'broad in scope, largely unlimited either as to the kind of information that may be considered, or the source from which it may come.'\" Davis, (supra) , 96 N.J. at 620 (quoting United States v. Tucker, 404 U.S. 443, 446, 92 S. Ct. 589, 591, 30 L. Ed. 2d 592, 596 (1972)); see also Ramseur, (supra) , 106 N.J. at 187 (sustaining death-penalty statute and aggravating factor concerning felony murder in part because of defendant's ability, under the statute, to introduce \"almost limitless . . . mitigating factors\"). But see State v. Gerald, 113 N.J. 40, 103, 549 A.2d 792 (1988) (finding the scope of mitigating evidence is not unlimited; evidence must be relevant to defendant's character, record, or the circumstances of the offense).\n\nAny restriction on the rights of defendants to present evidence in support of individualized consideration and in mitigation of death is troubling. See Muhammad, __ N.J. __, __ (1996) (Handler, J., Dissenting). Viewed cumulatively, the affirmation of the limitations on mitigating evidence imposed by the trial court in this case significantly undermine the protections that the United State Supreme Court and this Court have previously acknowledged as necessary to fair and consistent application of the death penalty.\n\nA.\n\nI concur with the majority's Conclusion that, when appropriate, a trial court should instruct the penalty-phase jury that the consequence of a life sentence is a minimum of thirty years of parole ineligibility imposed consecutive to defendant's prior sentences. This holding is mandated by the United States Supreme Court decision in Simmons v. South Carolina, 512 U.S. ___, 114 S. Ct. 2187, 129 L. Ed. 2d 133 (1994), and our decision in State v. Mejia, (supra) , 141 N.J. 475. I also maintain that defendant's right to have the jury consider his prior sentence as mitigation of the death penalty is mandated by the Eighth Amendment. The failure to instruct the jury of defendant's certain parole ineligibility in this case was not harmless.\n\n1.\n\nFrom the start of the penalty phase, it was virtually inconceivable that defendant would spend any less than the next fifty-seven years in prison without possibility of parole if he was not sentenced to die. Defendant was already serving a life sentence with a thirty-year parole disqualifier for the Atlantic County murder of Sophia Fetter. A logical and ultimately correct presumption was that the murder conviction in the Mercer County case would result in consecutive life sentences under State v. Yarbough, 100 N.J. 627, 498 A.2d 1239 (1985), cert. denied, 475 U.S. 1014, 106 S. Ct. 1193, 89 L. Ed. 2d 308 (1986). The defense sought to introduce in mitigation the fact that, with two consecutive sentences, defendant would not become parole eligible until he was eighty-six years old, and would probably die in prison.\n\nThe trial court agreed to instruct the jury in conformity with State v. Bey, 129 N.J. 557, 610 A.2d 814 (1992) (Bey III). Bey III provides that, if defendant requests, the trial court should: inform the jury of the prior sentence, including the fact that the sentence is not final while on appeal; inform the jury not to consider the prior sentence in determining the verdict; and inform the jury that the court has the sole responsibility for deciding whether the prior sentence runs concurrent or consecutive to the sentence the jury recommends. Id. at 603; see Biegenwald IV, (supra) , 129 N.J. at 603. The trial court, however, ruled that Bey III dictated that defendant's parole ineligibility was irrelevant to defendant's character or record. Thus, the court held that defendant could not submit his prior sentence as mitigating evidence under the c(5)(h) \"catch-all\" factor. The court also refused to instruct the jury that a life sentence would likely result in defendant spending the next sixty years in prison.\n\nThe majority now holds that in the vast majority of cases, where the trial court has found \"a 'realistic likelihood' that it will impose a consecutive sentence,\" the trial court should instruct the jury that it may consider that evidence in determining the appropriate, ultimate penalty. Ante at ___ (slip op. at 79-80) (finding that \"in future cases, if the court, based on the evidence presented believes that there is a realistic likelihood that it will impose a sentence to be served consecutive to any of defendant's prior sentences, in the event the jury does not return a death sentence, the jury should be so informed\"). This rule will satisfy defendant's right to a fully informed jury in many, if not most, instances. See id. at ___ (slip op. at 80) (noting that \"in most cases the courts will conclude that there is a 'realistic likelihood' that it will impose a consecutive sentence rather than a concurrent sentence in the event of a non-death verdict\"). The majority, however, finds harmless error in the present case.\n\nThe decision to instruct the jury that a life sentence will be imposed consecutive to defendant's prior sentence is mandated by the Due Process Clause as interpreted by Simmons and Mejia.\n\nParole ineligibility must be admissible as mitigating evidence to rebut the c(4)(a) (prior murder) aggravating factor and to ensure that the jury is fully informed of the potential consequences of its verdict.\n\nSimmons v. South Carolina was decided by a divided Court, a five-two plurality opinion, with five separate opinions filed. The actual boundaries of the holding are debatable. The majority correctly asserts that the narrowest holding of Simmons dictates that when defendant's future dangerousness is at issue and state law prohibits defendant's release on parole if a life sentence is rendered, the Due Process Clause of the United States Constitution requires that a jury be informed of defendant's parole ineligibility. Ante at ___ (slip op. at 78). The opinion of the Simmons Court, however, was based on Gardner v. Florida, 430 U.S. 349, 362, 97 S. Ct. 1197, 1207, 51 L. Ed. 2d 393, 404 (1977) (plurality opinion), and Crane v. Kentucky, 476 U.S. 683, 106 S. Ct. 2142, 90 L. Ed. 2d 636 (1986), two cases not raising future dangerousness, in which the Court found that defendants were constitutionally entitled to answer the State's case. Only three members of the Court, Justice O'Connor, Chief Justice Rehnquist, and Justice Kennedy, specifically limited their concurrence to cases in which the State argued future dangerousness. Simmons, (supra) , 512 U.S. at ___, 114 S. Ct. at 2200, 129 L. Ed. 2d at 151. This narrow holding in Simmons neither demands nor precludes defendant's claim.\n\nIndeed, the Supreme Court's narrowest holding in Simmons cannot be detached from its underlying reasoning and from its Due Process analysis, focussing on defendant's right of rebuttal. Simmons, (supra) , 512 U.S. at ___ n.4, 114 S. Ct. at 2193 n.4, 129 L. Ed. 2d at 141 n.4. The right of rebuttal is essential because it ensures that both sides of the issue will be fairly presented to the fact-finder and, therefore, the most reliable determination about the blameworthiness of defendant and the suitability of death will be rendered. Thus, the Court recognizes the essential right of capital defendants to answer and deny the allegations made against them during the penalty phase.\n\nThe majority implicitly recognizes that it would be arbitrary and illogical to limit the Due Process right to rebut the State's evidence with defendant's parole ineligibility, arising from a cumulation of defendant's prior and present sentences, to circumstances in which defendant faces a life sentence without parole and the threat of future dangerousness as an aggravating factor. Rather, common sense compels that defendant's extended period of parole ineligibility should equally rebut the c(4)(a) prior murder aggravating factor. In both situations, the need for rebuttal and the strength of rebuttal evidence are equivalent. After all, the future dangerousness factor and the c(4)(a) factor serve overlapping functions and raise common concerns. See Harris v. State, 312 Md. 225, 539 A.2d 637, 650 (Md. 1988) (\"Separate punishment would address the greater need for retribution for one who had killed twice, and the long parole ineligibility period if defendant were to receive consecutive sentences would address the sentencer's potential concern that a person who had killed twice might kill again.\"). This Court's recognition in Bey III, (supra) , 129 N.J. at 603, that it is most important to instruct the jury on the nature of a defendant's prior punishment when the State seeks the death penalty by the c(4)(a) factor, further demonstrates that a defendant's parole ineligibility rebuts the effect of the c(4)(a) factor.\n\nCritically, Justice Blackmun cited significant evidence of juror confusion about the length of time served on a life sentence. Simmons, (supra) , 512 U.S. at ___ \u0026 n.9, 114 S. Ct. at 2197 \u0026 n.9, 129 L. Ed. 2d at 146 \u0026 n.9 (citations omitted) (recognizing that \"it can hardly be questioned that most juries lack accurate information about the precise meaning of 'life imprisonment' as defined by the States\"); id. at ___, 114 S. Ct. at 2198, 129 L. Ed. 2d at 147 (Souter, J., Concurring) (finding reversible error when trial court denies a defense request to clarify a sentencing term or issue and when evidence of ambiguity exists). That confusion seriously threatens to prejudice defendants. See Anthony Paduano \u0026 Clive A. Stafford Smith, Deathly Errors: Juror Misperceptions Concerning Parole in the Imposition of the Death Penalty, 18 Colum. Hum. Rts. L. Rev. 211, 211-12 (1987) (explaining the effect of juror misperceptions of the meaning of a life sentence is that jurors \"feel[] constrained to vote for a penalty of death\" to avoid providing the defendant with a \"'get out of jail free' on parole\" card). Moreover, as suggested in Simmons, (supra) , 512 U.S. at ___, 114 S. Ct. at 2192, 129 L. Ed. 2d at 147, instructing the jury that the defendant labored under a prior life sentence with a thirty-year parole disqualifier, yet insisting that the jury ignore this fact, has the effect of informing the jury of the availability of parole, yet telling them to be \"blind\" to this fact. The Simmons Court noted the frustrating nature of such an instruction and further implied that a jury might not be capable of following such guidance. Id. at ___, 114 S. Ct. at 2197, 129 L. Ed. 2d at 147. By ensuring that juries will be aware of the legal effect of their findings, Mejia, (supra) , 141 N.J. at 485, this Court's ruling will cure much of the dangerous jury confusion that threatens the sentencing determination.\n\nThis Court has repeatedly stressed that the jury must be aware of the \"practical effect\" of its sentence. Martini I, (supra) , 131 N.J. at 311-13 (recognizing need to inform juries of the practical effect of their verdict, especially when defendant is not likely to survive to parole eligibility); Bey III, (supra) , 129 N.J. at 601, 606 (finding failure to inform the jury that a life sentence would result in the defendant spending the next seventy years in prison \"harmless error because the jury already knew the practical effect of a life sentence\"); cf. Biegenwald IV, (supra) , 126 N.J. at 49 (noting that \"the argument that defendant will never be eligible for parole in his lifetime can be made based on the current proceeding\"). \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nI continue to maintain that a defendant's prior sentence is also admissible mitigating evidence under the Eighth Amendment and New Jersey's constitutional counterpart.\n\nThe requested instruction should be construed as mitigating evidence because an assurance that defendant would die in prison if sentenced to life would weigh against the jury's sentencing defendant to death. That arguably would be relevant to defendant's 'record' or 'background' pursuant to mitigating factor c(5)(h).\n\n[Bey III, (supra) , 129 N.J. at 656-57 (Handler, J Dissenting) (citing Hunt v. State, 321 Md. 387, 583 A.2d 218 (1990), cert. denied, 502 U.S. 835, 112 S. Ct. 117, 116 L. Ed. 2d 86 (1991); Davis v. State, 512 So. 2d 1291, 1293 (Miss. 1987), cert. denied, 485 U.S. 913, 108 S. Ct. 1088, 99 L. Ed. 2d 247 (1988); State v. Henderson, 109 N.M. 655, 789 P. 2d 603, 607 (1990).]\n\nConsideration of a defendant's parole ineligibility under the Eighth Amendment is supported by this Court's decision in Davis, (supra) , 96 N.J. at 617, in which the Court held that statistical evidence demonstrating that a parolee over the age of fifty-five was unlikely to recidivate was relevant mitigation evidence. See Bey III, (supra) , 129 N.J. at 657 (Handler, J. Dissenting). If the Court finds that defendant's age upon release from prison is relevant to the jury's sentencing calculation, then it inevitably follows that the cumulative length of defendant's prior and potential sentence are relevant. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nAlthough the opinion of the Simmons Court specifically declined to address whether the result was mandated by the Eighth Amendment, preferring instead to focus on defendant's Due Process right of rebuttal, 512 U.S. at ___ n.4, 114 S. Ct. at 2193 n.4, 129 L. Ed. 2d at 141 n.4, Justice Souter's concurrence, joined by Justice Stevens, argued that the result is also compelled by the Eighth Amendment's promise of \"a jury capable of a reasoned moral judgment about whether death, rather than some lesser sentence, ought to be imposed.\" Id. at ___, 114 S. Ct. at 2198, 129 L. Ed. 2d at 147 (Souter, J., Concurring); see also Henderson, (supra) , 789 P. 2d at 607 (admitting evidence of parole ineligibility under Eighth and Fourteenth Amendments where future dangerousness was not raised as an aggravating factor). \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\n2.\n\nIn the case at bar, the failure fully to inform the jury about defendant's parole ineligibility was prejudicial and was not rendered harmless by the argument of counsel. In an area of such grave importance as a capital jury's comprehension of its sentencing role, the arguments of counsel cannot substitute for the direct guidance of the trial court. Simmons, (supra) , 512 U.S. at ___, 114 S. Ct. at 2198-99, 129 L. Ed. 2d at 148 (Souter, J. Concurring); see also Taylor v. Kentucky, (supra) , 436 U.S. at 488, 98 S. Ct. at 1936, 56 L. Ed. 2d at 477 (\"arguments by counsel cannot substitute for instructions by the court\"); Bey III, (supra) , 129 N.J. at 656-57 (Handler, J., Dissenting) (arguments of counsel cannot substitute for trial court's instruction). But see Simmons, (supra) , 512 U.S. at ___, 114 S. Ct. at 2199, 129 L. Ed. 2d at 149 (Ginsburg, J., Concurring) (stating that if \"the relevant information is intelligently conveyed to the jury, Due Process does not dictate that the Judge herself, rather than defense counsel, provide the instruction\"); id. at ___, 114 S. Ct. at 2200-201, 129 L. Ed. 2d at 151 (O'Connor, J., Concurring) (finding judicial instruction was unnecessary, despite the fact that even \"common sense\" dictates that juries are confused about the consequence of a life sentence); Bey III, (supra) , 129 N.J. at 312-13 (relying on arguments of counsel as substitutes for court instruction).\n\nHere, the jury was clearly told that if sentenced to life, defendant may serve as few as thiry years before being released. On at least five separate occasions the trial court framed the jury's decision as one between thirty years to life and the death penalty. Though trial defense counsel argued that defendant would likely die in prison, trial counsel also informed the jury that its choice was between thirty years and death. Cf. Bey III, (supra) , 129 N.J. at 312-13 (relying on argument of counsel where the defense and prosecution informed the jury that Bey would definitely not be eligible for parole for seventy years, and the court also explained the sentencing in this fashion at least one time). Moreover, the jury was instructed that the remarks of counsel are argument and not testimony, evidence, or the definitive version of the law. The court firmly admonished the jury to disregard the argument of counsel when it diverged from the law as set out by the court, and the arguments of counsel did not conform to the court's charge. It is very likely, therefore, that the jury did not have a complete understanding of the life sentence alternative, and may have harbored significant doubts about the likelihood of defendant getting out of jail after thirty years. That fact had a strong potential to affect the verdict.\n\nThus, Loftin's jury was never informed that, if sentenced to life, defendant would not face parole at age fifty, but at ninety years of age. There is a clear, substantive distinction in the punishment. In the former scenario, defendant could anticipate the freedom to travel, educate himself, and enjoy the benefits of society. The jury may have also considered that defendant may recidivate if released at fifty years of age. In the latter scenario, the concern disappears because defendant dies in jail. Instructing the jury about the effect of defendant's prior sentence ensures that the jury is equipped to make a fully informed, sound, and confident determination of punishment. The absence of such instructions can only decrease the reliability of any death sentence that is imposed. See Bey III, (supra) , 129 N.J. at 602. Indeed, the jury is more apt to attempt to compensate for an apparently insufficient punishment when the prior murder aggravating factor is charged. Id. at 603 (quoting Harris v. State, (supra) , 539 A.2d at 650). Thus, the denial of defendant's right to submit his parole ineligibility to rebut the c(4)(a) factor was harmful error.\n\nB.\n\nThe majority further restricts the right of defendants to proffer relevant mitigating evidence by denying defendant the ability to introduce the impact of the execution on his family as relevant character evidence, under mitigating factor N.J.S.A. 2C:11-3c(5)(h), ante at ___ (slip. op. at 72-75), and by severely minimizing the import of individualized consideration of the c(5)(a) mitigating factor. Ante at ___ (slip op. at 81-83). The deleterious effect of those improper restrictions of the jury's ability to consider mitigating evidence is exacerbated by the recent expansion of jury discretion to consider aggravating factors that are irrelevant to defendant's blameworthiness. See State v. Muhammad, ___ N.J. ____ (1996).\n\nAs evidenced by our recent decision in Muhammad, as well as the scope and manner of non-capital sentencing in New Jersey, it is clear that defendant's proffered family impact evidence is relevant character mitigating evidence.\n\nThere is precedent for concluding that a family member's testimony about the death of a relative is relevant to the character of the decedent. Cf. Muhammad, (supra) , __ N.J. at __ (slip op. at __) (ruling evidence of impact of loss of the victim on close friends and family members, about victim's character and uniqueness as an individual, is information relevant). If the impact of the loss of the victim on the victim's survivors is relevant, clearly the impact of the execution of defendant on defendant's family is relevant to the uniqueness of defendant as an individual. No other Conclusion can be reasonably asserted. Indeed, although there are cogent -- in fact, unanswerable -objections to the relevance of the victim's character in determining a defendant's death worthiness, id. at __ (slip op. at ___) (Handler, J., Dissenting), the family-impact evidence is deemed relevant to character because it evinces the strength of the bond between the victim and his or her family. The contribution and connection the victim or defendant makes to his or her family is thus indicative of his or her character and relevant in mitigation or, arguably, rebuttal of mitigation.\n\nIn State v. Davis, (supra) , 96 N.J. 611, this Court recognized the relevance of less direct and more generalized character evidence than that offered in the present case. There, the Court held that circumstantial statistical evidence relating to the likelihood that people will recidivate after a certain age is relevant to understanding the character of the particular defendant because it \"embraces those individual qualities that distinguish a particular person.\" Id. at 618. If a generalized statistical estimate that defendants are less likely to recidivate after a certain age is probative of \"those individual qualities that distinguish a particular person,\" it is beyond comprehension on what basis the Court now concludes that the impact of defendant's death on people with whom his life is most intimately entwined, is irrelevant to defendant's character. See also State v. Stevens, 319 Ore. 573, 879 P. 2d 162, 167-68 (Or. 1994) (en banc) (concluding that the use of circumstantial evidence to establish the defendant's character or the factors establishing character was sufficient).\n\nThe consideration of the impact of the execution upon defendant's family is also supported by N.J.S.A. 2C:44-1b(11), which requires the sentencer in a non-capital case to consider the effect of a sentence on a defendant's dependents. See State v. Mirakaj, 268 N.J. Super. 48, 51-52, 632 A.2d 850 (App. Div. 1993) (finding failure to consider impact of sentence on defendant's children in non-capital case was harmful error). Because the death penalty is \"profoundly different from all other penalties . . . . and a lowered threshold of admissibility for evidence proffered in mitigation of [sentence] . . . is consistent with this recognition,\" Davis, (supra) , 96 N.J. at 622 (citation omitted), it would be fundamentally unfair to prevent a defendant in a capital case from presenting mitigating evidence that would be a statutorily required consideration in any other sentencing proceeding. See also Davis, (supra) , 96 N.J. at 619-20 (recognizing the strong analogy between the tasks of a sentencing Judge and a capital penalty-phase jury, and suggesting that the penalty-phase jury operates under similarly relaxed rules of evidence with similar discretion); Moore, (supra) , 122 N.J. at 521 (Handler, J., Concurring in part and Dissenting in part) (citation omitted) (arguing that \"a defendant confronting the death penalty should not for purposes of punishment be placed in a less advantageous position than a defendant convicted of a non-capital crime\").\n\nFinally, it is noteworthy that other jurisdictions recognize the relevance of similar family-impact evidence offered by a defendant in mitigation of death. See Richmond v. Lewis, 506 U.S. 40, 113 S. Ct. 528, 121 L. Ed. 2d 411 (1992) (noting Arizona's practice of accepting evidence of the effect of the execution upon defendant's family in mitigation of death); Cardona v. State, 641 So. 2d 361, 365 (Fla. 1994) (while not allowing such evidence from children's guardian ad litem, court would allow the children themselves to testify and the defense to argue that it would be in the children's best interest if their father was not executed), cert. denied, ___ U.S. ___, 115 S. Ct. 1122, 130 L. Ed. 2d 1085 (1995); Stevens, (supra) , 879 P. 2d at 167-68 (reversing trial court's exclusion of wife's testimony relating that \"daughter would be affected adversely by defendant's execution [because the testimony evidenced that there was] something positive about his relationship with his daughter . . . something positive about defendant's character or background. Put differently, [the testimony becomes relevant in its tendency to] demonstrate that defendant has the capacity to be of emotional value to others\") (citing Skipper v. South Carolina, (supra) , 476 U.S. at 5-7, 106 S. Ct. at 1671-72, 90 L. Ed. 2d at 7-8 (holding that \"a defendant's Disposition to make a well-behaved and peaceful adjustment to life in prison is itself an aspect of his character that is by its nature relevant to the sentencing determination)); State v. Benn, 120 Wash. 2d 631, 845 P. 2d 289, 316 (Wash.) (en banc) (recognizing loss suffered by family if defendant is executed as relevant mitigating evidence) cert. denied, ___ U.S. ____, 114 S. Ct. 382, 126 L. Ed. 2d 331 (1993); cf. Payne v. Tennessee, 501 U.S. 808, 111 S. Ct. 2597, 115 L. Ed. 2d 720 (1991) (finding that testimony by victim's family and close relations regarding the impact of the loss of victim is informative of victim's uniqueness as an individual).\n\nThus, the broad standards for admissibility of mitigating evidence under the Eighth and Fourteenth Amendments compel consideration of the effect of the execution on defendant's family as mitigating character evidence. Each mitigating factor found by the jury tips the scale towards life imprisonment and away from death. The effect that defendant had on his children, as evidenced by the impact of his execution, is relevant because, as the Stevens Court found, it demonstrates defendant's ability to have an emotional impact on others and positively to engage and influence another human life. See Stevens, (supra) , 879 P. 2d at 167-68. It demonstrates defendant's human worth at the moment that the jury is to decide life or death. Indeed, the fact that Donald Loftin's children were aware of their father, were influenced in a positive and loving way by their father, and depended on their father, is clearly as relevant to defendant's character as the fact that he attended Bucks County Community College.\n\nIV\n\nIn addition to the foregoing errors, I note that there were further errors that independently, or cumulatively, mandate reversal including, in particular, the trial court's admission of testimony relating to defendant's lack of mental defense to the Atlantic County murder. These errors require no further elaboration at this time.\n\nI also join in the separate Dissenting opinion of Justice O'Hern regarding the Mejia issue.\n\nFor the foregoing reasons, I Dissent from the Court's opinion and judgment.\n\nO'HERN, J., Dissenting.\n\nThe principal issues in this appeal are whether the court committed reversible error when it failed to instruct the jury that it need not be unanimous as to whether the killing involved intent to kill or intent to inflict serious bodily injury and that it need not be unanimous in deciding whether defendant had committed the murder by his own conduct.\n\nThe points are almost identical to those raised in State v. Mejia, 141 N.J. 475, 662 A.2d 308 (1995), and State v. Brown, 138 N.J. 481, 651 A.2d 19 (1994). I did not agree with the Court's opinion in State v. Brown that we should permit non-unanimous verdicts in the guilt phase of capital murder trials. However, that principle having been adopted as a fair trial right, both the Court and I are bound to apply its precedent.\n\nIn Mejia and Brown, the Court explained that a jury need not be unanimous on the various theories under which guilt for murder may be established. Thus, for example, one may be found guilty of murder even if jurors do not unanimously agree whether the actor's role was that of principal, accomplice, or co-conspirator. State v. Brown, (supra) , 138 N.J. at 520-22. So too in non-capital murder cases we have never required that a jury be instructed that it must be unanimous on whether the defendant knowingly or purposely intended to cause death or knowingly or purposely intended to cause serious bodily injury resulting in death. State v. Mejia, (supra) , 141 N.J. at 486-87. The Mejia Court held that in the circumstances of that case, the jury should have been instructed that it could have returned a verdict of guilty of murder, although it was not unanimous on the theory of murder, whether intentional or serious bodily injury. Ibid. In State v. Gerald, 113 N.J. 40, 77-78, 549 A.2d 792 (1988), we held that the legislative history of the Death Penalty Act limited the penalty of death to intentional killings. We thus ruled in Gerald that if required by the evidence, a jury must consider, in the alternative, whether a defendant purposely or knowingly caused death or purposely or knowingly caused serious bodily injury that resulted in death. Only the former offense renders a defendant death-eligible. Id. at 69-70.\n\nIn 1992, the New Jersey Constitution was amended to overrule Gerald and to permit capital punishment of a defendant who intended only serious bodily injury that resulted in death (SBI murder) without offending the prohibition against cruel and unusual punishment contained in the New Jersey Constitution. N.J. Const. art. 1, P 12. The Legislature subsequently amended the Criminal Code to reflect that change. N.J.S.A. 2C:11-3i. However, because the homicide in this case occurred before those constitutional and statutory amendments, the Gerald distinction still applies.\n\nIn this case, decided after State v. Gerald but before Brown and Mejia, the trial court properly instructed the jury that it must decide beyond a reasonable doubt whether defendant intended to kill or to cause serious bodily injury. The charge did not, however, instruct the jury that it need not be unanimous on the issue of intent. Likewise, the verdict sheet did not inform the jury that it had the option to return a non-unanimous or reasonably-doubtful finding on the distinction between intent to kill and to cause serious bodily injury, and on possible accomplice liability.\n\nI agree with the majority that this is a thin case in which to find a possible accomplice or conspirator charge. See State v. Brown, (supra) , 138 N.J. at 528-29 (holding that jury must be permitted to find defendant guilty of murder as either principal or accomplice). The more difficult issue is whether there was a rational basis on which the jury could have found that defendant intended only serious bodily injury when he shot the victim in the head. (If there is no Gerald issue, there is no Mejia issue of a non-unanimous verdict.)\n\nWe need go no further than the Court's own ruling in State v. Mejia, (supra) , 141 N.J. 475. That case, like this case, involved a single fatal bullet wound. The Mejia Court stressed that \"jury instructions are 'crucial in a capital case because of the jury's responsibility to decide whether a defendant shall live or die.'\" Id. at 487 (quoting State v. Bey II, 112 N.J. 123, 162, 548 A.2d 887 (1988). The charge in this case, like the charge in Mejia, incorrectly required the jury to return a unanimous verdict on defendant's state of mind. The Mejia Court catalogued those circumstances in which a Gerald error may be harmless.\n\nIn appropriate cases, we have found the failure to give a Gerald charge to be harmless when the evidence did not provide a rational basis for a finding that the defendant intended only serious bodily injury. The defendant's actions in those cases, however, were so wantonly brutal that the jury could have concluded only that the defendant intended to cause death. See, e.g., State v. Bey III, 129 N.J. 557, 579, 610 A.2d 814 (1992) (defendant stomped on victim with sufficient force to crush her chest); State v. Biegenwald , 126 N.J. 1, 18, 594 A.2d 172 (1991) (defendant fired four gunshots to victim's head); State v. McDougald, 120 N.J. 523, 558-60, 577 A.2d 419 (1990) (defendant slashed victims' throats, bludgeoned one victim with a baseball bat, and expressed intent to kill victims before and after killings); State v. Hightower, 120 N.J. 378, 412-14, 577 A.2d 99 (1990) (defendant shot victim at close range in chest, neck, and head, and then dragged victim into freezer); State v. Rose, 120 N.J. 61, 63-64, 576 A.2d 235 (1990) (defendant fired twelve-gauge, sawed-off shotgun point-blank into victim's stomach); State v. Pitts, 116 N.J. 580, 614-20, 562 A.2d 1320 (1989) (defendant threatened to kill victims two days before murder, inflicted twenty-five to thirty stab wounds with a combat knife, cut one victim's throat twice, and paused to take victim's pulse to verify death); State v. Hunt, 115 N.J. 330, 374-77, 558 A.2d 1259 (1989) (defendant stated intent to kill immediately prior to stabbing victim twenty-four times).\n\n[So too, in] State v. Harris, 141 N.J. 525, 662 A.2d 333 (1995), . . . we [found] the failure to give a Gerald charge [constituted] harmless error. The facts in that case, however, suggested that when Harris shot the victim in the back of the neck, most likely while the victim was handcuffed and lying on the ground, that the shooting was intentional, and that Harris was practically certain that death would result.\n\nIn contrast, the failure to give a Gerald charge constitutes reversible error whenever the evidence is minimally adequate to provide a rational basis for the jury to hold a reasonable doubt that the defendant intended to cause death.\n\nAs we have stressed,\n\nalthough it might seem probable that the jury had intentional murder in mind, the question is whether there is a rational basis in the evidence on which the jury, if instructed to distinguish the two, might return a verdict of serious-bodily-injury murder. If there is, then the jury, as the finder of fact, must decide the matter. An appellate court cannot.\n\n[ State v. Mejia, (supra) , 141 N.J. at 488-89 (quoting State v. Harvey, 121 N.J. 407, 413, 581 A.2d 483 (1990), cert. denied, 499 U.S. 931, 111 S. Ct. 1336, 113 L. Ed. 2d 268 (1991)) (citations omitted and paragraph re-ordered).]\n\nThis case is far from Harris. In Harris, we stressed that in his final words to the jury, the defense counsel simply \"asked for a 'fair and impartial verdict' on whether 'Joseph Harris was insane or . . . not insane on the night that this alleged offense occurred.'\" 141 N.J. at 550. Thus, Harris' central theory was not to deny intent but to excuse it by reason of insanity. Forensic evidence, including a \"shored exit wound\" on the victim's neck, showed that Harris shot the victim in the back as he lay on the ground. Ibid. In this case, there is no question that Marsh was not bound execution-style. He was standing at the time of the murder. There was a single gunshot wound to the side of the victim's head. No one knows how the shot was fired.\n\nThe prejudice arising from the deficient jury charge was exacerbated by the trial court's limitation of defendant's due process and confrontation rights at the guilt phase of the trial when it prohibited defendant from arguing that this was a killing in a robbery gone bad and from cross-examining witnesses regarding the possibility that others had participated in the homicide. In Mejia, the Court relied on several factual points in determining that a rational basis existed to support a charge that the defendant intended to cause only serious bodily injury. 141 N.J. at 489. First, the Court noted that the murder arose from a conflict between two acquaintances regarding the return of money that the defendant had entrusted to the victim. Id. at 490. Further, Mejia explained to the police that the actual shooting was accidental, occurring when Mejia slipped in pursuit of the victim. Ibid. The Mejia Court relied on this Court's analysis in State v. Pennington, 119 N.J. 547, 575 A.2d 816 (1990), which involved a holdup that ended in a shooting. There we explained that \"to the extent that the evidence sufficed to support a charge that defendant acted recklessly, it raised the possibility that he did not intend to cause death.\" State v. Mejia, (supra) , 141 N.J. at 490 (quoting Pennington, (supra) , 119 N.J. at 562).\n\nBecause Loftin was unable to testify without exposing himself as a prior murderer, he presented no specific version of the facts; instead, he relied on evidence that the shooting could have been an accident. The defense would have presented a stronger theory of accidental shooting--a robbery gone bad--if it had not been unfairly restricted in developing its defense at trial. For example, the State's pathologist testified on cross-examination that her findings did not preclude an accidental killing and that the black and blue mark on the victim's right eye could have been the result of a blow (evidence of a struggle with defendant) or the bullet itself. In addition, neither the pathologist nor the State's ballistic expert stated that there was any evidence that the gun was fired at point blank range. (In the penalty phase, the ballistics expert explained that the safety disengaged \"easily\" with a thumb movement.) Like the defendant in Mejia, (supra) , 141 N.J. at 490, Loftin contends that the fact that only one bullet was fired and that Marsh was alive when Loftin left the premises supports the existence of a rational basis for lack of intent to kill. Marsh survived at least nine and one-half hours after the shooting.\n\nThe State argues that it would be speculation to permit the jury to consider Loftin's case as a robbery gone bad because there is no direct evidence to that effect. State v. Hightower, ___ N.J. ___ (slip op. at 32-34) (1996), explains how far the Court will permit the State to go in constructing a theory of a murder to escape detection without any direct evidence. In Loftin's case, on similar circumstantial evidence, the State was allowed to speculate that this was an execution-style killing.\n\nOf course the evidence strongly sustains the inference that Loftin intended to kill. Marsh was shot in the head and the trajectory of the bullet suggests that the gun was aimed at head level. The State argues that the gun required the exertion of substantial pressure (ten and a half pounds) in order to pull the trigger, that defendant was within a few feet of Marsh at the time of the shooting in the small confines of the gas station office, and that there were no defensive wounds on Marsh's body, indicating a lack of struggle or physical provocation.\n\nTo test the proposition of whether there was a rational basis for a finding that defendant intended to cause only serious bodily injury, we need only ask ourselves whether, if the jury had returned a guilty verdict on that ground, the court would have set aside that verdict as being without any rational basis in the law. Although the State's case is very strong, it is impossible to reach the Conclusion that the facts provide, in the words of Mejia, (supra) , 141 N.J. at 488, the \"wantonly brutal\" certainty that the trier of fact could reach no possible choice but to find intent to kill as evidenced in cases such as State v. Harris, (supra) , 141 N.J. 525 (victim was handcuffed and lying on ground when defendant shot him in back of head), State v. Bey III, (supra) , 129 N.J. 557 (1992) (defendant stomped on victim with sufficient force to crush her chest), or State v. Biegenwald IV, 126 N.J. 1 (1991) (defendant fired four gunshots to victim's head).\n\n\"We have [always] held that at the very core of the guarantee of a fair trial in a criminal case is the judicial obligation to insure that the jury's impartial deliberations are based solely on the evidence and are made in accordance with proper and adequate instructions.\" State v. Purnell, 126 N.J. 518, 531, 601 A.2d 175 (1992). Each of the errors in this case was magnified by the incomprehensibly ineffectual manner in which the guilt phase of the trial was conducted. As we said in State v. Dixon, 125 N.J. 223, 253, 593 A.2d 266 (1991), only a jury that knows the difference between the forms of murder that are death eligible and knows the questions it must answer may decide who shall be sentenced to death. This guilt-phase jury had no guidance as to which of its verdicts was capital and which might have been non-capital or non-unanimous.\n\nI can understand why, but cannot accept, that the majority departs from its own precedent. To explain the reasons why a free society should afford fair trial rights to even the most reprehensible of its members remains difficult. Any explanation may not be enough for those who regard society as the loser when those safeguards produce unpalatable results. Perhaps only the experience of an unjust system of laws can nurture respect for law. Respect for law requires evenhanded application of its principles.\n\nBecause the trial court failed to instruct the jury that it was permissible to reach a non-unanimous verdict on defendant's mental state, the jury may have erroneously believed that a failure to agree would result in a mistrial. This may have swayed certain jurors to abandon their honest convictions and join the majority. Because there was sufficient evidence to provide a rational basis for a finding that defendant did not intend to kill Marsh, the flawed jury instruction cannot be deemed harmless error. Mejia, (supra) , 141 N.J. at 488. I would therefore reverse Loftin's sentence of death and remand the matter for a new penalty phase trial.\n\nJustice Handler joins in this opinion.\n\n\u003cspan class=\"fn\"\u003e1. The Supreme Court's Criminal Practice Committee is currently considering an amendment \"to make it clear that when the guilt phase of a capital case is to be tried separately from the penalty phase, the usual method of jury selection in the guilt phase should be employed rather than individual voir dire.\" Judges Bench Manual for Capital Cases 67 n. 5 (November 1, 1995).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The fact that defense counsel was permitted to argue to the jury that defendant would die in jail would clearly satisfy the Supreme Court's understanding of due process. Justices Rehnquist, Ginsburg, O'Connor, and Kennedy explicitly stated that due process is satisfied if defendant's counsel informs the jury about the possibility of parole ineligibility. Simmons, (supra) , ___ U.S. at ___, ___ S. Ct. at ___, 129 L. Ed. 2d at 149-151. Justices Scalia and Thomas, who Dissented in Simmons, do not believe that the Constitution requires trial counsel or the court to inform the jury of parole ineligibility unless the prosecution has \"specifically suggested parolability.\" ___ U.S. at ___, ___ S. Ct. at ___, 129 L. Ed. 2d at 155.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The State's frequent resort to the c(4)(f) factor has a similar \"'chameleon-like way of adapting to any particular set of [facts]'\" similar to the drug profiles challenged in United States v. Sokolow, 490 U.S. 1, 109 S. Ct. 1581, 104 L. Ed. 2d 1 (1989), where the United States Supreme Court noted the various application of the profiles. The characteristics proffered in various cases included: suspect was first to deplane, last to deplane, deplaned from the middle, one-way tickets, round-trip tickets, nonstop flight, changed planes, no luggage, gym bag, new suitcases, traveled alone, traveled with companion, acted nervously, and acted too calmly. Id. at 13-14, 109 S. Ct. at 1588-89, 104 L. Ed. 2d at 14-15 (Marshall, J., Dissenting). Repeated employment of the c(4)(f) factor also reveals arbitrary, contradictory, and irrational application.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The State argued that defendant fired only once in the head in order to limit the noise of the gunfire. The tenuous nature of the State's argument -- and of the nature of this evidence in general -- is apparent when one considers the argument that a silencer on a gun would not establish purpose to avoid apprehension or every murder committed with a knife would have the same purpose because a knife is quieter than a gun. Menendez v. State, 368 So. 2d 1278, 1282 (Fla. 1979). Clearly, also, a second or third shot would not have been more time expensive, and would have ensured that Marsh was dead.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. This statistic includes those cases in which c(4)(f) was found to be present as well as those where notice of c(4)(f) was served and charged to the jury or urged on the court but was not found to be present.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Because the jury should know the \"practical effect\" of its sentence, if possible the court should determine whether defendant's sentence will run concurrently with or consecutive to his prior sentence prior to the penalty-phase trial. Martini I, (supra) , 131 N.J. at 366 (Handler, J., Dissenting) (arguing that the \"concern for the reliability of the jury's verdict . . . . is no less vital when the sentences are . . . to be imposed for contemporaneous convictions\"). To the extent that this Court held otherwise in Martini I, (supra) , 131 N.J. at 312, this holding should be reconsidered in light of Mejia, (supra) , 141 N.J. at 485 (citations omitted) (holding that \"particularly in capital cases, [trial courts] must inform juries of the legal effect of their findings\") and Simmons, (supra) , 512 U.S. ___, 114 S. Ct. 2187, 129 L. Ed. 2d 133. A pre-penalty-phase determination of the potential non-capital charge would neither threaten the integrity of the process nor burden judicial economy. See Clark v. Tansy, 118 N.M. 486, 882 P. 2d 527, 534 (N.M. 1994) (requiring the determination of non-capital charges prior to penalty-phase jury deliberations in order to inform the jury of defendant's parole eligibility date, if the defendant so requests).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Biegenwald IV, (supra) , 126 N.J. 1, cited by the majority, ante at __ (slip op. at 77), is distinguishable. There, the Court found the prior sentences irrelevant to the defendant's blameworthiness in the context of an instruction to compare the reasoning of the prior jury, or a suggestion that the prior sentence should instruct the jury in their deliberations on the present sentence. Here, however, Loftin presents the prior sentence only to make the argument to which the Court found that Biegenwald was entitled: that he \"will never be eligible for parole in his lifetime.\" Biegenwald IV, (supra) , 126 N.J. at 49. Unlike in Biegenwald IV, the jury here would not be fully informed of the consequence of their verdict without considering the prior sentence. In other words, without the knowledge that Loftin was previously sentenced to life, and the knowledge that another life sentence would run consecutively, the jury would inevitably believe that despite the two murder convictions, there was a possibility of parole within thirty years.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Four years after Henderson, (supra) , in Clark v. Tansy, 118 N.M. 486, 493, 882 P.2d 527 (1994), the New Mexico Supreme Court held that once the length of incarceration is asserted as mitigating evidence, a trial court cannot choose between providing the jury with the possible range of sentences or instructing the jury on the sentence that is the alternative to death. Rather, the Tansy court held that the trial court must impose the sentence on non-capital charges prior to jury deliberations on the capital charge sentence and then inform the capital jury of the total potential sentence.\u003c/span\u003e\n\n",
    "body_length": 274946,
    "citedas": [
      "146 N.J. 295",
      "680 A.2d 677"
    ],
    "attorneys": "Daniel V. Gautieri and Susan Herman, Assistant Deputies Public Defender, argued the cause for appellant (Susan L. Reisner, Public Defender, attorney). Paul H. Heinzel, Deputy Attorney General, argued the cause for respondent (Deborah T. Poritz, Attorney General of New Jersey, attorney).",
    "category": [
      "243",
      "36",
      "78",
      "75"
    ],
    "judges": "The opinion of the Court was delivered by Garibaldi, J. Justices Pollock, Stein and Coleman join in Justice Garibaldi's opinion. Justice Handler has filed a separate Dissenting opinion. Justice O'hern has filed a separate Dissenting opinion in which Justice Handler joins.",
    "citation_count": 117
  }
}
