{
  "id": "lLTfTGYBTlTomsSB-xUZ",
  "document": {
    "title": "07/02/82 JACK L. WIKMAN AND MARY S. WIKMAN v. CITY",
    "full_title": "JACK L. WIKMAN AND MARY S. WIKMAN, HIS WIFE CROSS-APPELLANTS, v. CITY OF NOVI, A MICHIGAN MUNICIPAL CORPORATION, AND EVELYN NATZEL, TREASURER OF THE CITY OF NOVI CROSS-APPELLEES",
    "jurisdiction": "Michigan Supreme Court",
    "date": "1982-07-02T00:00:00.000Z",
    "docket": "Docket No. 62843",
    "body": "As a preface to this opinion, an abbreviated sequential history is appropriate. An opinion initially was filed addressed to the issues briefed and argued by the parties. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e All proceeded by accepting the consistent rulings of the Tax Tribunal and the Court of Appeals that challenges to special assessments levied by a governmental unit for public improvements relating to real property are within the jurisdiction of the Tax Tribunal. The key issue was whether the claim for injunctive relief on this set of facts can remove the case from the tribunal's exclusive jurisdiction.\n\nNow an opinion has been filed which turns upon a question neither briefed nor argued by the parties. It concludes that the Tax Tribunal has no jurisdiction over municipal special assessments such as herein concerned, so there is no question of removal. It is the opinion of my colleague that the words \" ad valorem \" must be read into the Tax Tribunal jurisdictional statute preceding the words \"special assessments\". Otherwise, the words must be read as referring only to the ministerial acts involved in the collection of special assessments. Essentially, the argument is that the Legislature made a mistake.\n\nFor purposes of structure, this opinion will address both the issues as briefed and argued and those raised by my colleague. We hold that the Tax Tribunal Act, MCL 205.701 et seq.; MSA 7.650(1) et seq., grants the Tax Tribunal exclusive jurisdiction over this proceeding seeking direct review of the governmental unit's decision concerning a special assessment for a public improvement.\n\nI\n\nThe Tax Tribunal Act is a culmination of numerous attempts by the Legislature to secure the prompt and fair resolution of disputes concerning the collection of government revenues. The efficient resolution of such disputes is important to both the taxpayer and the government. In Eddy v Lee Twp, 73 Mich 123, 129-130; 40 NW 792 (1888), this Court acknowledged this fact, stating:\n\n\"'The object of that law, as it is of this, is to enable the government to collect its revenues without delay. The obligations of the government must be met promptly, and it is better that the citizen should resort to his common-law remedies to secure his rights, so far as a mere payment of what he claims may be an illegal tax is concerned, than the government should be embarrassed in the collection of revenues necessary to defray its expenditures.\n\n\"'Courts have frequently remarked upon the impossibility of the government calculating with any certainty upon its revenues, if the collection of taxes was subject to be arrested in every instance in which a tax-payer or tax collector could make out prima facie a technical case for arresting such collection, and it is justly said to be much better to let the individual pay to the government the demands it makes upon him, and, if he considers them in whole or in part illegal, apply for the refunding of the money, with interest afterwards.' Cooley, Taxation (2d ed), p 762.\n\n\"This same learned jurist remarks that --\n\n\"'So serious have been the embarrassments by an improvident employment of the writ of injunction, and other obstructive process, that the legislature has in some cases deemed it necessary to interpose and forbid the issue of injunction, replevin, or other specified writs, the tendency of which would be to embarrass collections.'\"\n\nThe significant public interest underlying the collection of revenues by the government resulted in limitations upon a taxpayer's ability to contest tax assessments and obtain refunds of general revenue taxes. Similar, although possibly less compelling, considerations imposed limitations on a landowner's ability to challenge a local special assessment for a public improvement.\n\nIn attempts to remove some of these limitations and provide a forum in which aggrieved taxpayers could obtain relief, the Legislature created statutory procedures for taxpayers to utilize in contesting the legality of their taxes. Statutes provided that a taxpayer could appeal to the State Tax Commission, see MCL 211.152; MSA 7.210, or pay the tax under protest and bring an action in circuit court for a refund, see MCL 211.53; MSA 7.97. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Challenges concerning special assessments were governed by different standards. MCL 211.53; MSA 7.97, \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e provided that one could pay a special assessment under protest and sue for a refund in circuit court. However, the most common way to contest a special assessment was to sue to enjoin the collection of it, see Brill v Grand Rapids, 383 Mich 216; 174 NW2d 832 (1970). \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nThe proliferation of these available remedies created problems of forum shopping and increased the possibility of inconsistent decisions. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e These problems led to the passage of the Tax Tribunal Act with its provisions for exclusive jurisdiction.\n\nThe Tax Tribunal is a \"quasi-judicial agency\" \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e designed to provide a forum in which taxpayers may obtain relief from adverse agency decisions. The primary functions of the Tax Tribunal are to find facts and review the decisions of agencies within its jurisdiction. The Tax Tribunal specializes in reviewing these determinations. To assure that it possesses the necessary expertise to resolve these cases efficiently, the Tax Tribunal Act requires that certain members of the tribunal have special qualifications. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nII\n\nThe facts in the instant case, except for the substantive issue of whether plaintiff's property benefited from the public improvement, are not in dispute. On April 26, 1976, the Council of the City of Novi passed a resolution confirming special assessment rolls for the paving of a portion of Taft Road. Plaintiffs claim the tax bills for the special assessments were mailed on May 14, 1976. On June 9, 1976, plaintiffs, owners of properties abutting that portion of Taft Road, filed suit in circuit court seeking injunctive relief and claiming that the assessments were determined in an arbitrary and inequitable manner. Plaintiffs requested the court to preliminarily enjoin collection during the pendency of this case, to determine that their properties were not especially benefited, to adJudge the assessments null and void with any liens thereof discharged, and to grant any other relief the court determined just and equitable.\n\nThe court issued a preliminary injunction. After a hearing, the court found that the properties received no additional benefit from the improvement not received by the general public and that the assessments were higher than the benefits received. The court declared the assessments void and permanently enjoined collection of them. The Court of Appeals reversed and remanded the case to the Tax Tribunal.\n\nIII\n\nBecause our first task is to resolve a question of Tax Tribunal jurisdiction, we look to the statutory provisions of this relatively new act (effective July 1, 1974).\n\nMCL 205.731; MSA 7.650(31) provides:\n\n\"The tribunal's exclusive and original jurisdiction shall be:\n\n\"(a) A proceeding for direct review of a final decision, finding, ruling, determination, or order of an agency relating to assessment, valuation, rates, special assessments, allocation, or equalization, under property tax laws.\n\n\"(b) A proceeding for refund or redetermination of a tax under the property tax laws.\" (Emphasis added.)\n\nA \"proceeding\" is defined as an \"appeal\" in MCL 205.703; MSA 7.650(3). The tribunal's jurisdiction is based either on the subject matter of the proceeding (e.g., a direct review of a final decision of an agency relating to special assessments under property tax laws) or the type of relief requested (i.e., a refund or redetermination of a tax under the property tax laws). In the instant case, the jurisdiction of the Tax Tribunal is governed by the first subsection since plaintiffs are seeking to enjoin permanently the collection of a special assessment rather than to obtain a refund of a tax. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nAlthough neither party raises the issue, my colleague's opinion concludes that these municipal special assessments cannot be within the jurisdiction of the Tax Tribunal. We disagree.\n\nA\n\nWhether the jurisdiction of the Tax Tribunal includes special assessments is an issue of statutory construction. The primary and fundamental rule of statutory construction is that it is the court's duty to ascertain the Legislature's purpose and intent as expressed in the provision in question, White v Ann Arbor, 406 Mich 554; 281 NW2d 283 (1979). In reviewing such questions, the court first considers the language of the statute in order to ascertain the intention of the Legislature, Kalamazoo City Education Ass'n v Kalamazoo Public Schools, 406 Mich 579; 281 NW2d 454 (1979). Every word of the statute should be considered and no word should be treated as surplusage or rendered nugatory if at all possible, Baker v General Motors Corp, 409 Mich 639; 297 NW2d 387 (1980), State v Levenburg, 406 Mich 455; 280 NW2d 810 (1979).\n\nFocusing on the language of the statute and applying the rules mentioned above, we conclude that the Legislature intended that the Tax Tribunal exercise jurisdiction over this case.\n\nB\n\nMCL 205.731; MSA 7.650(31) grants the Tax Tribunal jurisdiction over proceedings challenging both assessments and special assessments. In the context of taxation, the word \"assessment\" denotes the determination of the share of the tax to be paid by each taxpayer, Williams v Mayor of Detroit, 2 Mich 560, 565 (1853). For the purpose of collecting ad valorem taxes, or taxes based on the value of property, the word \"assessment\" means the determination of the value of property for tax purposes, MCL 211.10; MSA 7.10.\n\nMCL 205.731(a); MSA 7.650(31)(a) also expressly grants the Tax Tribunal jurisdiction over decisions relating to special assessments. These special assessments are different from the assessment decisions discussed above. Special assessments are not special procedures for determining the value of property for tax purposes. The words \"special assessments\" refer to pecuniary exactions made by the government for a special purpose or local improvement, apportioned according to the benefits received; see In re Petition of Auditor General, 226 Mich 170; 197 NW 552 (1924), Detroit v Weil, 180 Mich 593, 599; 147 NW 550 (1914), MCL 211.761(e); MSA 5.3536(1)(e). The impositions in the instant case are clearly special assessments as that term is used in MCL 205.731(a); MSA 7.650(31)(a).\n\nC\n\nAlthough everyone agrees that these pecuniary exactions are special assessments, a difference of opinion has arisen over whether these special assessments are ones \"under property tax laws\" as that term is used in MCL 205.731; MSA 7.650(31). Justice Levin's opinion reasons that the term property tax laws must refer only to ad valorem property taxes because Const 1963, art 6, § 28 uses the same term in reference to ad valorem taxes and because such a construction is consistent with past practices. Therefore, the opinion concludes that the phrase limits the tribunal's jurisdiction to reviewing the ministerial acts involved in collecting special assessments pursuant to the ad valorem tax law.\n\nWe agree that the phrase \"under property tax laws\" modifies the words \"special assessments\". However, it does not exclude these local special assessments for public improvements from the Tax Tribunal's jurisdiction. Rather, the phrase distinguishes between the special assessments involved in this case and other special assessments not levied under property tax laws.\n\nWe recognize that significant differences exist between special assessments and other forms of taxation. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e In fact, if the Tax Tribunal Act did not mention special assessments, we would agree that special assessments are not within the jurisdiction of the tribunal. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e However, the jurisdiction of the tribunal is not limited to general taxes. It also expressly includes special assessments under the property tax laws. Special assessments and the property tax laws are not mutually exclusive concepts.\n\nMost special assessments, like this one for a public improvement, are levied pursuant to the taxing power. In Woodbridge v Detroit, 8 Mich 274, 281 (1860), another road paving case, this Court stated:\n\n\"Taxes for purely local public improvements, like the one before us, more generally called assessments, are not mentioned in the constitution, nor is it necessary they should be to give the legislature power over them. The power to impose and collect such taxes, like all other legislative powers not mentioned in the constitution, is plenary, and in the exercise of it is subject to legislative discretion only.\"\n\nSee, also, Weil, supra, Roberts v Smith, 115 Mich 5, 8; 72 NW 1091 (1897), Motz v Detroit 18 Mich 495 (1869), Williams, supra, 566, 14 McQuillin, Municipal Corporations (3d ed), § 38.01, p 10, 1 Cooley on Taxation (4th ed), § 31, p 107. Special assessments of this type have been described as a peculiar species of taxation, Weil, supra, 599. 2 Cooley on Taxation (3d ed), p 1153. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nThe special assessments in the instant case are clearly in the nature of a property tax, Motz, supra, 523. They are assessed against real property according to the benefits received. They may be collected at the same time and in the same manner as other property taxes. If unpaid, they may become a lien on the property like other property taxes, \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e or may be collected by an action against the owner of the property. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e Several recently enacted legislative definitions of the term \"property taxes\" suggest that special assessments may be included in the definition of \"property taxes\" unless otherwise excluded. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nIn contrast to these special assessments which are levied under the taxing power, some special assessments are clearly not related to property taxes. Such special assessments are exacted through the state's police power as part of the government's efforts to protect society's health and welfare; see Motz, supra, MCL 103.4; MSA 5.1823. Also, special assessments may be collected in connection with a regulatory program to defray the cost of such regulation, see Dukesherer Farms, Inc v Director of Dep't of Agriculture (After Remand), 405 Mich 1; 273 NW2d 877 (1979). Such assessments are not ones under the property tax laws and are not within the jurisdiction of the Tax Tribunal.\n\nHowever, special assessments levied against property owners for public improvements to realty which especially benefit their property are special assessments under the property tax laws for the purposes of the Tax Tribunal Act.\n\nD\n\nThese special assessments for public improvements, a form of taxation, are not outside the property tax laws simply because they are levied pursuant to a municipal charter and ordinance rather than a state statute. The power to levy special assessments for public improvements is a sovereign legislative power. Accordingly, the Legislature has the inherent power to levy such special assessments, Const 1963, art 4, § 1, subject to any applicable constitutional limitations, see Woodbridge, supra, 281, Williams, supra, 70 Am Jur 2d, Special or Local Assessments, § 4, pp 845-846. The Legislature also has the ability to delegate such powers to the appropriate authorities, Turner v Detroit, 104 Mich 326; 62 NW 405 (1895).\n\nHowever, in the absence of such delegation, a municipality does not have the power to levy special assessments, Special or Local Assessments, (supra) , § 6, p 847. Thus, any special assessment levied by a municipal corporation is levied under authority delegated by law from the Legislature. Therefore, such assessments are levied under the property tax laws even though the Legislature has chosen to exercise its power by delegating it to a municipal authority.\n\nThe provisions of MCL 117.24; MSA 5.2103, also support this Conclusion. They provide that after approval and filing, a city charter shall \"thereupon become law\". The assessments in the instant case were levied pursuant to a home-rule city's charter. In other contexts, the Legislature's use of the word \"law\" has included municipal charters, see Sykes v Battle Creek, 288 Mich 660, 663; 286 NW 117 (1939), Hudson Motor Car Co v Detroit, 282 Mich 69, 78; 275 NW 770 (1937). \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e Therefore, we conclude that the word \"laws\" in MCL 205.731; MSA 7.650(31) encompasses both statutes and municipal charters and ordinances.\n\nThis construction is supported by the multitude of references to special assessments in The General Property Tax Act and the chapter on taxation. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e Because these provisions do not authorize any special assessments, they must refer to special assessments levied under other laws. We conclude that they refer to special assessments levied pursuant to statutes, municipal charters and ordinances.\n\nE\n\nThis construction is also supported by the Legislature's decision not to amend MCL 205.731; MSA 7.650(31) after the courts have held that the Tax Tribunal has jurisdiction over special assessments. Since the initial passage of the act, the Tax Tribunal and the Courts have consistently held that the Tax Tribunal has jurisdiction over special assessments; see Emerick v Saginaw Twp, 104 Mich App 243; 304 NW2d 536 (1981), Rogoski v Muskegon, 101 Mich App 786; 300 NW2d 695 (1980), Anderson v Selma Twp, 95 Mich App 112; 290 NW2d 97 (1980), lv den 408 Mich 946 (1980), Sisbarro v City of Fenton, 90 Mich App 675; 282 NW2d 443 (1979), Eggermont v City of Clawson, 88 Mich App 246; 276 NW2d 574 (1979), Edros Corp v Port Huron, 78 Mich App 273; 259 NW2d 456 (1977), Calder v DeWitt Twp, 75 Mich App 674; 256 NW2d 47 (1977), lv den 402 Mich 819 (1977). This consistent construction of the act is entitled to respectful consideration.\n\nFurthermore, the Legislature has amended the act twice since the earlier decisions without changing this jurisdictional provision, see 1978 PA 439, 1980 PA 437. This silence or acquiescence is an indication that the Legislature agreed with the accuracy of these interpretations, Magreta v Ambassador Steel Co (On Rehearing), 380 Mich 513; 158 NW2d 473 (1968), In re Clayton Estate, 343 Mich 101; 72 NW2d 1 (1955).\n\nConsidering this acquiescence and the source, nature and effects of special assessments for public improvements, and contrasting them with assessments made pursuant to the police power, we conclude that the special assessments herein are ones under the property tax laws for the purposes of MCL 205.731; MSA 7.650(31).\n\nF\n\nAlthough we have no arguments or briefs from the parties on this issue, Justice Levin's opinion concludes that the term \"property tax laws\" must refer only to ad valorem property taxes because Const 1963, art 6, § 28, \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e and another section of the Tax Tribunal Act, MCL 205.753(1); MSA 7.650(53)(1), \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e which have no application to special assessments, use that phrase. While we agree with our colleague that the noted sections have no application to special assessments, this nonapplication does not arise from the use of the phrase \"property tax laws\", but rather from the context of its use. Both provisions relate to the appeals of valuation and allocation decisions from a \"final agency provided for the administration of property tax laws\". Since valuation and allocation are not issues in special assessment cases, there was no need for the delegates to the Constitutional Convention to consider whether the phrase \"property tax laws\" included or excluded special assessments. Thus, the Constitutional Record is silent on whether the phrase \"property tax laws\" includes special assessments. 2 Official Record, Constitutional Convention 1961, pp 3240-3243.\n\nThe silence of the Constitutional Convention Record certainly provides no indication that the meaning of \"property tax laws\" excludes special assessments. The argument that because valuation and allocation are said to be under the property tax laws, special assessments are not under the property tax laws, is analogous to arguing that because Great Danes and Dachshunds are said to be dogs, a Pekinese is not a dog. Therefore, we see no relevance of the use of \"property tax laws\" in the 1963 Constitution or MCL 205.753(1); MSA 7.650(53)(1) to its use in the jurisdictional section.\n\nHence, we see no basis for concluding, as our brother does, that when the Legislature wrote \"special assessments * * * under property tax laws\" it was referring only to the ministerial acts involved in the collection of special assessments. If such was its intention, one would expect, at the very least, that it would have used the phrase \"special assessments * * * under ad valorem property tax laws\". Since our brother's interpretation would drastically change the undisputed meaning of \"special assessments\" by the use of a phrase whose meaning in this context is far less clear, we decline to follow it.\n\nA more reasonable interpretation of the effect on \"special assessments\" of the phrase \"under property tax laws\", which would not so drastically change its meaning, would be that the phrase distinguishes special assessments that are under the taxing power and that relate to real property from other types of special assessments.\n\nG\n\nAlso, we cannot accept the contention that the jurisdiction of the Tax Tribunal does not include special assessments because its predecessors did not review special assessments. The statutes creating and defining the functions of the Board of State Tax Commissioners, \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e the State Tax Department \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e and the State Tax Commission \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e do not address or mention special assessments. In contrast, MCL 205.731; MSA 7.650(31) expressly grants the tribunal jurisdiction over special assessments. The Conclusion that the Tax Tribunal's jurisdiction is more extensive than that of the State Tax Commission is also supported by the provisions of MCL 205.741; MSA 7.650(41) and MCL 205.771-205.773; MSA 7.650(71)-7.650(73). These provisions implement the tribunal's broad-based jurisdiction over proceedings previously conducted before both the State Tax Commission and the circuit court. Because the tribunal has jurisdiction over matters formerly heard in circuit court, its jurisdiction is not limited to matters heard by the State Tax Commission. This reasoning is particularly applicable to special assessments, because many of the actions challenging special assessments were heard in circuit court. \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nWe recognize that the Legislature's decision to include special assessments within the jurisdiction of the Tax Tribunal is one which changes past practices. However, in the absence of any constitutional objection, this is not a valid reason to frustrate the expressed intention of the Legislature. The decision whether to experiment with new procedures is a legislative one. The Court's role is to effectuate, if possible, that legislative decision.\n\nThe Legislature's decision to include special assessments within the jurisdiction of the Tax Tribunal is not unwarranted or unreasonable. Since before the turn of the century, the Legislature has been involved in supervising special assessments, see 1899 PA 39, 1895 PA 3. Currently, a substantial number of statutes address the various aspects of levying a special assessment for a public improvement. \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nThe Legislature's decision to channel appeals from special assessments decisions to an administrative agency instead of the circuit court is consistent with similar actions in other contexts. The action did not create a new level of review, see Emmet County, supra, but only substituted one forum for another and broadened its jurisdiction. Ideally, this consolidation will foster standardization and equality in the levying of special assessments.\n\nIn contrast to the rational basis the Legislature demonstrated for channeling appeals from special assessments to the Tax Tribunal, the argument is unpersuasive that the Legislature intended only decisions relating to the collection of special assessments under the ad valorem tax law be within the jurisdiction of the tribunal.\n\nFirst, if the Legislature intended to provide for such limited jurisdiction, it could have clearly expressed this intention. MCL 205.731; MSA 7.650(31) could have been drafted to limit jurisdiction to \"decisions * * * relating to * * * the collection of special assessments * * * under the general property tax act\".\n\nSecond, the suggested construction of the act could result in forum shopping and increase the possibility of inconsistent decisions in similar cases. Under that interpretation, assessments collected by separate bills would not be within the jurisdiction of the Tax Tribunal while those collected with the regular tax roll would be. No justification for this difference has been advanced. The argument appears to elevate form over substance. Also, assuming that two forums would not always resolve the same problem the same way, this construction could lead a municipality into forum shopping via determining whether to collect special assessments on their regular tax rolls or otherwise. One of the main reasons underlying the creation of the Tax Tribunal was to reduce or eliminate forum shopping and the possibility of inconsistent decisions.\n\nThe claim that the tribunal's jurisdiction over special assessments extends only to ad valorem taxes inaccurately described in a statute as \"special assessments\" is equally unpersuasive. No statute has been cited which inaccurately describes an ad valorem as a special assessment. The Drain Code, MCL 280.1 et seq.; MSA 11.1001 et seq., does not incorrectly use the term \"special assessment\". Rather, the revenues, whether special assessments or otherwise, are entitled drain \"tax\" or \"taxes\". \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e MCL 41.721 et seq.; MSA 5.2770(51) et seq., does not inaccurately describe an ad valorem tax as a special assessment, but authorizes the raising of revenue by both special assessments, MCL 41.725; MSA 5.2770(55), and by pledging the full faith and credit of the township, MCL 41.735; MSA 5.2770(65), which could lead to payment from other revenues. Neither does MCL 333.20346; MSA 14.15(20346) inaccurately use the term \"special assessments\". It authorizes paying the cost of ambulance service from available funds, fees for service, and special assessments. In OAG 1979-1980, No 5706, p 770 (May 13, 1980), the Attorney General opined that the cost of such service could not be imposed as a special assessment since no property was especially benefited. Thus, any levy upon property for that purpose must be exacted as an ad valorem tax. I interpret this opinion as indicating that the municipality should defray its costs from available funds (general taxes), see MCL 333.20346(1); MSA 14.15(20346)(1), rather than indicating that the reference in subsection (2) to special assessments meant ad valorem taxes.\n\nSince no statute has been cited which inaccurately describes an ad valorem tax as a special assessment, there is no basis upon which to conclude that the words \"special assessment\" in the Tax Tribunal Act refer only to such non-existent statutes.\n\nIV\n\nA\n\nAlthough an understanding of the Tax Tribunal's jurisdiction is necessary to the resolution of this case, the more immediate concern is the jurisdiction of the circuit court over these proceedings. The jurisdiction of the circuit court is governed by Const 1963, art 6, § 13, which provides:\n\n\"The circuit court shall have original jurisdiction in all matters not prohibited by law; appellate jurisdiction from all inferior courts and tribunals except as otherwise provided by law; power to issue, hear and determine prerogative and remedial writs; supervisory and general control over inferior courts and tribunals within their respective jurisdictions in accordance with rules of the supreme court; and jurisdiction of other cases and matters as provided by rules of the supreme court.\"\n\nMCL 600.601; MSA 27A.601 provides:\n\n\"Circuit courts have the power and jurisdiction\n\n\"(1) possessed by courts of record at the common law, as altered by the constitution and laws of this state and the rules of the supreme court, and\n\n\"(2) possessed by courts and Judges in chancery in England on March 1, 1847, as altered by the constitution and laws of this state and the rules of the supreme court, and\n\n\"(3) prescribed by rule of the supreme court.\"\n\nHistorically, the circuit courts exercised jurisdiction over actions to enjoin the collection of special assessments. The courts continue to exercise this jurisdiction except as prohibited by the laws of this state. The divestiture of jurisdiction from the circuit court is an extreme undertaking. Statutes so doing are to be strictly construed. Divestiture of jurisdiction cannot be accomplished except under clear mandate of the law, Leo v Atlas Industries, Inc, 370 Mich 400, 402; 121 NW2d 926 (1963), Crane v Reeder, 28 Mich 527, 532-533 (1874).\n\nEven under these strict rules of construction, the Tax Tribunal Act clearly evidences a legislative intention that the circuit court not have jurisdiction over matters within the tribunal's exclusive jurisdiction. The tribunal's jurisdiction over proceedings under the property tax laws is \"exclusive\", meaning to the exclusion of others, Black's Law Dictionary (4th ed), p 673.\n\nMCL 205.741; MSA 7.650(41) provides:\n\n\"A person or legal entity which, immediately before the effective date of this act, was entitled to proceed before the state tax commission or circuit court of this state for determination of a matter subject to the tribunal's jurisdiction, as provided in section 31, shall proceed only before the tribunal.\" (Emphasis added.)\n\nMCL 205.774; MSA 7.650(74) provides:\n\n\"The right to sue any agency for refund of any taxes other than by proceedings before the tribunal is abolished * * *.\"\n\nWe find that these provisions sufficiently express the Legislature's intent to make the tribunal's jurisdiction exclusive and to prohibit the circuit court from exercising jurisdiction over matters within the tribunal's exclusive jurisdiction.\n\nPlaintiffs respond that these proceedings raise constitutional issues and seek equitable relief which the Tax Tribunal lacks the power to grant. Because the tribunal lacks the power to decide constitutional issues and to grant an injunction, plaintiffs conclude that the Tax Tribunal Act does not prohibit the bringing of this action in circuit court. \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nB\n\nGenerally speaking, an agency exercising quasi-judicial power does not undertake the determination of constitutional questions or possess the power to hold statutes unconstitutional, Dation v Ford Motor Co, 314 Mich 152; 22 NW2d 252 (1946). However, the constitutional claims in this case do not involve the validity of a statute. Rather, plaintiffs' claim is merely an assertion, in constitutional terms, that the assessment was arbitrary and without foundation.\n\nThe law requires that special assessments be made according to the benefits received, see Dix-Ferndale Taxpayers' Ass'n v Detroit, 258 Mich 390, 395; 242 NW 732 (1932). Plaintiffs' claim is that these special assessments were not made according to the benefits received as required by law. The resolution of this claim involves many fact determinations. The membership of the Tax Tribunal is structured to provide it with experience in resolving these fact issues. The tribunal's de novo review \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e gives it the opportunity to rectify any errors in the agency's determination. This review is sufficient to resolve any of the claims raised by the plaintiffs. Since the issues raised by plaintiffs do not involve the validity of the tribunal's action or a statute, they do not remove this proceeding from the exclusive jurisdiction of the Tax Tribunal.\n\nC\n\nWe agree with plaintiffs' contention that the Tax Tribunal lacks the power to issue an injunction. The issuance of an injunction is an exercise of judicial power. The constitution limits the Legislature's power to transfer judicial power to administrative agencies, see Const 1963, art 3, § 2, Johnson v Kramer Bros Freight Lines, Inc, 357 Mich 254, 258; 98 NW2d 586 (1959). Generally, quasi-judicial agencies lack judicial power, see Dation v Ford Motor Co, supra, Michigan Mutual Liability Co v Baker, 295 Mich 237, 242; 294 NW 168 (1940), Mackin v Detroit-Timkin Axle Co, 187 Mich 8; 153 NW 49 (1915). MCL 205.732; MSA 7.650(32) does not expressly grant the tribunal the power to issue injunctions, and such power will not be extended by implication.\n\nAlthough injunctive relief may not be directly available, the tribunal is empowered to issue \"writs, orders, or directives\", see MCL 205.732; MSA 7.650(32), and nothing in the Tax Tribunal Act prohibits one from seeking equitable relief to enforce a tribunal decision, see Edros, supra, Niedzialek v Journeymen Barbers, Hairdressers \u0026 Cosmetologists' International Union of America, Local 552, AFL, 331 Mich 296; 49 NW2d 273 (1951), Van Buren Public School Dist v Wayne Circuit Judge, 61 Mich App 6, 14; 232 NW2d 278 (1975).\n\nCase law exists indicating that the constitution places some limitations on the Legislature's power to divest the court completely of equity jurisdiction and the judicial power to grant an injunction; see Haggerty v City of Dearborn, 332 Mich 304; 51 NW2d 290 (1952). Thus, while there may be an extraordinary case which justifies the exercise of equity jurisdiction in contravention of a statute, this is not such a case. Where the Legislature has provided a plain, adequate remedy at law, it has the constitutional authority to impose limitations on other available remedies, Eddy v Lee Twp, 73 Mich 123; 40 NW 792 (1888). The legal remedy available in this case is a proceeding before the Tax Tribunal. As indicated above, the tribunal has the jurisdiction and ability to resolve all the claims presented.\n\nAlthough exceptions to statutes purportedly conferring exclusive jurisdiction on other administrative agencies and courts have been recognized by this Court, see Emmet County, supra, Michigan Mutual, supra, plaintiffs' requests for preliminary and permanent injunctions in these proceedings do not take them out of the exclusive jurisdiction of the tribunal pursuant to MCL 205.731; MSA 7.650(31), see Eggermont v City of Clawson, 88 Mich App 246; 276 NW2d 574 (1979); Edros Corp v Port Huron, 78 Mich App 273; 259 NW2d 456 (1977).\n\nD\n\nWhile plaintiffs further argue that the circuit court is the proper forum for this proceeding because the Tax Tribunal lacks jurisdiction to resolve class actions, defendants state that, in effect, the tribunal has jurisdiction to decide suits affecting an entire class. This suit is a proper example. The further resolution of the issue is not necessary to the determination of this case. The tribunal's exclusive jurisdiction includes all proceedings for review of an agency's decision under the property tax laws. Allowing such class actions to be brought in the circuit court while prohibiting suits by a single taxpayer would elevate form over substance. In essence, §§ 41 and 74 prohibit the circuit court from exercising jurisdiction in these proceedings. However, plaintiffs can obtain in the Tax Tribunal the same relief sought by another name in the circuit court.\n\nV\n\nUpon reversing the judgment of the circuit court, the Court of Appeals remanded the case to the Tax Tribunal pursuant to MCL 205.773; MSA 7.650(73) \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e and GCR 1963, 820.1(7). \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e On appeal, defendants contend that the Court of Appeals erred in remanding this case because the tribunal lacked jurisdiction over this equitable matter. MCL 205.735; MSA 7.650(35), the only provision establishing procedures for invoking the jurisdiction of the tribunal, provides:\n\n\"The jurisdiction of the tribunal shall be invoked by the filing of a written petition by a party in interest, as petitioner, within 30 days after the final decision, ruling, determination, or order which he seeks to review or within 30 days after the receipt of a bill for a tax he seeks to contest. The unit of government shall be named as respondent. Service of the petition on the respondent shall be by certified mail.\"\n\nDefendants claim that a timely filing, within 30 days after the final decision is necessary to invoke the jurisdiction of the Tax Tribunal, 2 Am Jur 2d, Administrative Law, § 328, pp 150-151. The word \"shall\" has been construed to mean \"must\", see Sauder v Dist Board of School Dist No 10, Royal Oak Twp, Oakland County, 271 Mich 413, 418; 261 NW 66 (1935). The Tax Tribunal has applied a similar construction of the statute to determine that the 30-day limit is jurisdictional \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e and this construction of the statute is entitled to respectful consideration, Magreta, supra.\n\nDefendants argue that MCL 205.773; MSA 7.650(73) does not apply because it applies only to cases heard in the circuit court or State Tax Commission before the creation of the Tax Tribunal and remanded after appeal.\n\nAlthough MCL 205.735; MSA 7.650(35) provides that the tribunal's jurisdiction shall be invoked by a timely filing, the statute does not state the consequences of failing to file a timely petition. It does not contain any language prohibiting the tribunal from exercising jurisdiction in cases filed later than 30 days after a final ruling or receipt of a tax bill. It contains none of the prohibitive language normally present in statutory limitations. \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e In this respect, MCL 205.735; MSA 7.650(35) is not free from ambiguity.\n\nAlthough defendant's construction of MCL 205.731; MSA 7.650(31) might be persuasive if it were the only statutory pronouncement on this issue, other statutory provisions expressly set forth different limitations on actions brought by taxpayers seeking relief. In contrast to the absence of any language in this section expressly creating a limitation or bar, some statutes within the jurisdiction of the tribunal contain clear expressions of limitations. Many of these periods of limitation are different from or longer than the 30-day period provided in the Tax Tribunal Act. \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\n\nIf the provisions of the Tax Tribunal Act were intended to supersede these express limitation periods, the Tax Tribunal Act does not clearly indicate such an intention. The existence of these longer periods of limitation are not inconsistent with the provisions of the Tax Tribunal Act so as to be repealed by MCL 205.707; MSA 7.650(7). \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e Also, repeals by implication are not favored, see Yarger v City of Hastings, 375 Mich 413; 134 NW2d 726 (1965). In such cases the canon of statutory construction is that:\n\n\"' the courts can by any fair, strict or liberal construction find for the two provisions a reasonable field of operation, without destroying their evident intent and meaning, preserving the force of both, and construing them together in harmony with the whole course of legislation upon the subject it is their duty to do so.'\" Rathbun v Michigan, 284 Mich 521, 544-545; 280 NW 35, 44 (1938), quoting with approval from State ex rel Ellis v Givens, 48 Fla 165, 174; 37 So 308 (1904).\n\nIn light of the existence of longer periods of limitations, the reasonableness of relying on such provisions and the severe consequence to aggrieved taxpayers from a determination that the limitation periods were repealed by implication, we hold that the provisions of § 35 do not supersede the other applicable periods of limitation. When a specific limitation for such actions has been established, the provisions of § 35 will not prohibit the tribunal from exercising jurisdiction in a proceeding brought within the specific time limitation. This construction of MCL 205.735; MSA 7.650(35), does not render it meaningless. It applies in cases in which a specific provision providing a longer period of limitation does not exist.\n\nIn the instant case, the assessment rolls were confirmed on April 26, 1976. Suit was filed on June 9, 1976. Plaintiffs' filing would have been timely under the City of Novi's Charter § 11.4 and Special Assessment Ordinance, No 69-01, § 26.01, because it was filed within 60 days after the confirmation of the rolls. \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e Considering the periods of limitation provided, plaintiffs' action was timely filed in the circuit court.\n\nThe timely filing in the circuit court was not sufficient to invoke the jurisdiction of the Tax Tribunal. However, through this action, the circuit court acquired jurisdiction over defendants. MCL 600.5856; MSA 27A.5856, \u003cspan class=\"fnref\"\u003e34\u003c/span\u003e provides that the statute of limitations is tolled whenever jurisdiction over the defendant was otherwise acquired. \u003cspan class=\"fnref\"\u003e35\u003c/span\u003e Because the period of limitations was tolled and did not expire during the pendency of this suit, MCL 205.735; MSA 7.650(35) did not remove this proceeding from the jurisdiction of the Tax Tribunal. The Court of Appeals did not err in ordering that this case be remanded to the Tax Tribunal pursuant to GCR 1963, 820.1(7).\n\nAffirmed. No costs, this being a public question.\n\nAddendum\n\nColeman, C.J.\n\nIn order to clarify the sequence of opinions, I invite the reader's attention to the fact that the final opinion of the Court was written in response to an initial Dissent which raised a new issue neither briefed nor argued. An entirely new Dissent now is filed, during conference consideration, which blurs the references of the majority opinion and raises new arguments. Because of the long history of this case and Romulus City Treasurer v Wayne County Drain Comm'r, we do not again write to conform the two opinions or state arguments contra to new matter, but leave the reader with this note, the intent of which is to enhance understanding of the two opinions which at first sight may appear as \"ships that pass in the night\".\n\nLevin, J. (dissenting).\n\nThe question is one of statutory construction under the Tax Tribunal Act and is whether the \"exclusive and original\" jurisdiction of the Tax Tribunal encompasses the subject matter of this action which was commenced in the circuit court.\n\nWe would hold that the Tax Tribunal does not have jurisdiction. A special assessment levied by the City of Novi on the authority of the home-rule cities act is not a decision made \"under property tax laws\".\n\nI\n\nThe Wikmans and others commenced this action against Novi and its treasurer in circuit court to set aside and restrain collection of a special assessment. They claimed that the proposed improvement would confer no special benefit on the assessed property owners beyond the benefit to other property owners in Novi. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nAfter a trial with an advisory jury, the circuit court agreed with the Wikmans and the other plaintiffs. The court found that there was no special benefit. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e The special assessments were declared void and collection was enjoined. The jurisdictional question was not raised in the circuit court.\n\nThe Court of Appeals concluded that the matter is within the exclusive jurisdiction of the Tax Tribunal and the circuit court is without jurisdiction. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e The judgment of the circuit court was vacated and the cause was remanded to the Tax Tribunal with a direction \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e that it waive the expiration of the 30-day time limit for filing a petition with the Tax Tribunal. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nThis Court affirms the decision of the Court of Appeals.\n\nA\n\nThe principal issue presented by this appeal is indeed whether this action can be maintained in equity in the circuit court.\n\nBoth the plaintiffs and the defendants have proceeded on the assumption that the Tax Tribunal has exclusive jurisdiction under the Tax Tribunal Act unless an equitable action may be excepted.\n\nThis Court concludes that this action cannot be maintained in equity. Assuming that the Tax Tribunal has jurisdiction, we would be inclined to agree (see part IX below) on the ground that the Wikmans and the other plaintiffs have failed to demonstrate that an appeal to the Tax Tribunal is a substantively or procedurally inadequate remedy justifying equitable intervention in the instant cause.\n\nThe opinion of the Court, in remanding this cause to the Tax Tribunal, seemingly decides the question, the answer to which was assumed by the parties and, as stressed in the opinion of the Court, not briefed, of whether the Tax Tribunal has jurisdiction absent a basis for equitable intervention. This Court declares that the Tax Tribunal has \"exclusive jurisdiction over this proceeding\" \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e challenging a special assessment levied on the authority of the home-rule cities act.\n\nFor reasons stated in part VIII, the Court cannot properly decide or appear to decide that jurisdictional question on the concessions of the parties to this litigation. The proper course would be to order further briefing and argument before deciding or appearing to decide the question.\n\nB\n\nThe jurisdiction of the Tax Tribunal is limited to decisions made under \"property tax laws\". The term \"property tax laws\" appears in three places in the Tax Tribunal Act, twice in § 31 and once in § 53:\n\n-- Section 31 provides that the Tax Tribunal has \"exclusive and original jurisdiction\" of decisions \"relating to assessment, valuation, rates, special assessments, allocation, or equalization, under property tax laws \" and of proceedings for refund or determination of \"a tax under the property tax laws \". \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e (Emphasis supplied.)\n\n-- Section 53 provides for an appeal as of right to the Court of Appeals, subject to the provisions of Const 1963, art 6, § 28, and provides that, \"for purposes\" of that constitutional provision, the Tax \" is the final agency for the administration of property tax laws \". \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e (Emphasis supplied.)\n\nThe view expressed in this Dissenting opinion is that the Tax Tribunal does not have jurisdiction to review a decision levying a special assessment because a decision levying a special assessment is not made under the \"property tax laws\". The limiting term \"property tax laws\" describes that body of statutory law which had been and continues to be administered by the State Tax Commission:\n\n-- The purpose of the Legislature in enacting the Tax Tribunal Act was to transfer the appellate jurisdiction of the State Tax Commission to the Tax Tribunal and to eliminate the alternative remedy in the circuit court. It was not part of the legislative purpose to transfer to the Tax Tribunal jurisdiction of subject matter which had not formerly been a matter of state supervision and the business of the State Tax Commission.\n\n-- The legislative purpose is expressed in the language of the Tax Tribunal Act. The act limits the Tax Tribunal's jurisdiction to decisions made under \"property tax laws \", the laws subject to administration by the State Tax Commission. Special assessments are not levied under The General Property Tax Act or other laws or provisions of law providing for the state tax on real and personal property (the \"property tax laws\"), which are subject to state administrative supervision by the State Tax Commission, but under separate legislation such as the home-rule cities act and the Drain Code authorizing the establishment of and providing for the powers of local units of government. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\n-- The Tax Tribunal Act eliminates the circuit court remedy where a person had been able to proceed either before \"the state tax commission or the circuit court\". \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Persons seeking to challenge a special assessment levy had not theretofore been able to proceed either before the \"state tax commission or the circuit court\", but only in the circuit court. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\n-- The Tax Tribunal Act was not directed to problems which had arisen in the establishment of special assessment districts and in the levying of special assessments by local governmental authorities which appeared to call for supervision at the state level of local governmental decisions to finance public improvements by special assessment but rather was enacted because the State Tax Commission had ceased to be an appropriate place to lodge administrative appellate jurisdiction respecting the state ad valorem property tax, and the dual remedy in the circuit court in property tax appeals had ceased to serve a useful purpose. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\n-- While special assessments are, to be sure, authorized by state enabling legislation and are based on and subject to state law -- as is all local governmental activity -- the Legislature has not subjected to state supervision local governmental decisions to finance a public improvement by creating a special assessment district and levying a special assessment. The Legislature, consistent with the general policy of not supervising local governmental activities at the state level, \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e has not authorized the State Tax Commission or any other state agency to exercise administrative supervision of or to review on appeal decisions of a home-rule city, of a drain commissioner, or of other local governmental authorities respecting local improvements and their financing through special assessments. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nC\n\nThe General Property Tax Act and supplemental laws compiled in the chapter on real and personal property taxation contain a number of provisions concerning special assessments. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e These provisions concern in the main \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e the collection of special assessments and the sale of property which has been specially assessed for nonpayment of the special assessment. Cities, drain commissioners and other governmental authorities levying a special assessment may and generally do utilize the established machinery for the collection of ad valorem property taxes to collect a special assessment. Special assessments are ordinarily billed by the ad valorem tax collector together with the ad valorem tax on real property. While cities, drain commissioners and other local governmental authorities empowered to levy special assessments are not subject to the jurisdiction of the State Tax Commission, the tax collector is subject to the jurisdiction of the State Tax Commission. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nAlthough the State Tax Commission did not and does not have jurisdiction to supervise or review decisions of local governmental authorities to finance a public improvement by establishing a special assessment district and levying a special assessment, its jurisdiction, both before the enactment of the Tax Tribunal Act and now, extends to supervision of a tax collector who is required to collect special assessments under the property tax laws. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nConsistent with the legislative intent that whatever was formerly the appellate business of the State Tax Commission would become the appellate business of the Tax Tribunal, the Tax Tribunal Act provides for the transfer to the Tax Tribunal of the appellate jurisdiction of the State Tax Commission to review decisions concerning \"special assessments * * * under property tax laws\".\n\nThe appellate jurisdiction of the State Tax Commission to review decisions concerning \"special assessments * * * under property tax laws\" was limited to decisions concerning the collection of special assessments and did not extend to, and the transferred jurisdiction of the Tax Tribunal does not extend to, whether property subjected to a special assessment was specially benefited, the meritorious issue litigated in the instant case and which dominates litigation respecting special assessments.\n\nIn sum:\n\n-- The Tax Tribunal has exclusive and original jurisdiction of decisions relating to the collection of \"special assessments * * * under property tax laws\" (which decisions are also subject to administration by the State Tax Commission), but not over decisions levying special assessments under the home-rule cities act, the Drain Code, or other laws or provisions of law conferring on local units of government the authority to finance public improvements by establishing special assessment districts and levying special assessments, decisions not subject to supervision by the State Tax Commission;\n\n-- The circuit court continues to have jurisdiction over an action challenging a special assessment on the ground that the property proposed to be specially assessed was not specially benefited. Before enactment of the Tax Tribunal Act, such an action could not have been brought either before \"the state tax commission or the circuit court\", but only in the circuit court.\n\nD\n\nIn adhering today to the position adopted a few years ago by the Court of Appeals in a conclusory opinion, \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e this Court, by enlarging both the opportunity for litigation and the scope of review (\"independent, original and de novo \" under the Tax Tribunal Act), \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e impairs the capacity of cities, drain commissioners and other local governmental authorities to finance public improvements with special assessments (see part VI below) and involves the state, through the Tax Tribunal, in matters with which the state has not heretofore concerned itself. \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nThe business of the Tax Tribunal (as originally constituted, before jurisdiction over other state taxes theretofore within the jurisdiction of the Board of Tax Appeals was conferred upon it) is, as this Court decided in Emmet County v State Tax Comm, 397 Mich 550, 555; 244 NW2d 909 (1976), limited to providing a means of review of decisions formerly \"heard by the State Tax Commission as an appellate body\". \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e In so deciding, this Court grasped the essence of the Tax Tribunal Act. Today the Court does not see that thread, but words without lineage.\n\nII\n\nIn construing a statute, a court is obliged to effectuate the legislative purpose. A literal meaning may therefore give way to a meaning not wholly consistent with the language used which appears from context or history or other substantial evidence of legislative purpose.\n\nIf it were to appear that the Legislature did not intend to modify or limit the words \"special assessments\" by the term \"property tax laws\" or that \"property tax laws\" is not a term of art which has a fixed meaning in the constitution \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e and that it means simply a law or provision of law providing for a governmental exaction in respect to property, \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e we would be obliged to give effect to the legislative purpose however imprecise or misleading the language chosen to express such a purpose.\n\nIt does not, however, appear from context or history, and no legislative materials or other evidence has been presented, that in using the term \"property tax laws\" the Legislature did not intend to modify the words \"special assessments\" or that it did not adopt the meaning of \"property tax laws\" as that term is used in article 6, § 28 of the constitution.\n\nThe business of the State Tax Commission, both now and before the enactment of the Tax Tribunal Act, consisted of the administration of a body of statutory law described in article 6, § 28 of the constitution and in the Tax Tribunal Act as the \"property tax laws\". \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nThe Tax Tribunal's \"exclusive and original\" jurisdiction (its subsequently conferred jurisdiction in respect to other state taxes is not exclusive) \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e is coextensive with the continuing jurisdiction of the State Tax Commission in the administration of the property tax laws.\n\nA\n\nThe term \"property tax laws\" appears twice in Tax Tribunal Act § 31, concerning jurisdiction, and also (see B below) in § 53, concerning appellate review.\n\nThe Tax Tribunal Act, § 31, provides that the Tax Tribunal has exclusive and original jurisdiction to review a decision relating to \"special assessments * * * under property tax laws\". \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e The term \"property tax laws\", thus, modifies and limits the term \"special assessments\". The Tax Tribunal's jurisdiction extends only to decisions relating to special assessments made under property tax laws and does not extend to decisions relating to special assessments made under laws or provisions of law that are not property tax laws.\n\nThe second part of the jurisdictional statement, also set forth in § 31, concerns \" proceeding for refund or redetermination of a tax under the property tax laws\". \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e Because plaintiffs do not seek either a refund or redetermination but rather bring an action, in equity, seeking to set aside altogether and to restrain collection of any part of a special assessment, the majority \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e and we agree that only the first part of the § 31 jurisdictional statement, quoted in the preceding paragraph, is involved in the instant case.\n\nB\n\nSection 53 of the Tax Tribunal Act establishes the scope of judicial review of decisions of the Tax Tribunal. It designates \"for purposes\" of Const 1963, art 6, § 28, the Tax Tribunal as \"the final agency for the administration of property tax laws \". (Emphasis supplied.) \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nSection 28 of article 6 of the constitution limits the scope of judicial review of an appeal from \"any final agency provided for the administration of property tax laws \". (Emphasis supplied.) \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\n\nThis clause was added to $28 on the floor of the Constitutional Convention in response to concern expressed by delegates that appeals to the courts from the State Tax Commission would delay the collection of ad valorem property taxes. \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\n\nBefore its revision by the committee on style and drafting, the clause, as adopted on the floor, in terms barred appeals to a court from a decision of the \" state tax commission fixing value * * * for property tax purposes \". \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e Thus, indisputably, the \"final agency\" which the delegates to the Constitutional Convention had in mind was the State Tax Commission.\n\nThe committee on style and drafting recommended the substitution of the present language of § 28 for the language approved on the floor:\n\n(i)\"final agency provided for the administration of property tax laws \" for \"State Tax Commission\", and\n\n(ii) \"from any decision relating to valuation or allocation \" for \"a decision\" \"fixing the value of described property for property tax purposes or determining an appeal from a decision of the county tax allocation board\". (Emphasis supplied.) \u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\n\nThe recommendations of the committee on style and drafting respecting § 28 were considered, together with the committee's recommendations concerning a number of other sections of the constitution, and were accepted without further floor Discussion. \u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\n\nA \"property tax law\" is thus, at least for purposes of § 28 of article 6 of the constitution, a law subject to administration by the State Tax Commission. \u003cspan class=\"fnref\"\u003e36\u003c/span\u003e The laws subject to administration by the State Tax Commission, then and even now after the establishment of the Tax Tribunal, are laws providing for the levying and collection of ad valorem property taxes. Then and now the State Tax Commission has had no authority to supervise (to \"administer\") the levying of or to review on appeal a decision of a local governmental authority to finance a public improvement by levying a special assessment.\n\nThe Legislature, in designating, in § 53 of the Tax Tribunal Act, the Tax Tribunal as \"the final agency for the administration of property tax laws\", in express implementation (\"for purposes\") of the constitutional limitation set forth in § 28 of article 6, necessarily incorporated the meaning of that term as used in the constitution. The Legislature therefore comprehended by the term \"property tax laws\", at least in § 53, the functions of the State Tax Commission and the statutes and provisions of law which had been subject to the State Tax Commission's jurisdiction.\n\nIt has been said that \" connotation of a term in one portion of an Act may often be clarified by reference to its use in others.\" United States v Cooper Corp, 312 U.S. 600, 606; 61 S Ct 742; 85 L Ed 1071 (1941). This suggests that the sense in which the Legislature used the term \"property tax laws\" in § 53 (designating the Tax Tribunal as the \"final agency\") connotes the meaning of that term in § 31 (establishing the Tax Tribunal's jurisdiction).\n\nThe Legislature, in using the same phrase, \"property tax laws\", in both §§ 31 and 53 of the Tax Tribunal Act, \u003cspan class=\"fnref\"\u003e37\u003c/span\u003e manifested a purpose to limit the jurisdiction of the Tax Tribunal to the appellate jurisdiction formerly exercised by the \"final agency\" -- the State Tax Commission -- \"provided for the administration of property tax laws\".\n\nThe term \"property tax laws\", in § 31 of the Tax Tribunal Act, as in § 53 of that act, rooted as it is in the constitution, means laws and provisions of law concerning ad valorem property taxes.\n\nC\n\nWe do not argue, as put forth in the opinion of the Court, that \"because\" valuation and allocation are matters \"under the property tax laws\" that special assessments are not. \u003cspan class=\"fnref\"\u003e38\u003c/span\u003e The argument is rather that the framers of the constitution used the words \"property tax laws\" to describe the body of law administered by the State Tax Commission, that the Legislature, in using those words in one section (§ 53) of the Tax Tribunal Act in the very sense in which the framers of the constitution used those words and in another section (§ 31) of the Tax Tribunal Act to describe its jurisdiction had in mind one and the same body of law, the laws formerly and still administered by the State Tax Commission.\n\nBecause \"property tax laws\", subject to administration by the State Tax Commission, are all laws concerning ad valorem taxes, it is possible to explain what is meant by \"property tax laws\" by saying, as we have said in this opinion, that property tax laws are laws levying ad valorem taxes (taxes assessed on the value of real or personal property) or, more descriptively, ad valorem property tax laws. Or one may explain, as we have also said, that they are the laws then and now administered by the State Tax Commission.\n\nEither explanation can be challenged with the empty argument that \"if the Legislature had meant\" to limit property tax laws to ad valorem property tax laws or to the business of the State Tax Commission \"it would have used\" those words. \u003cspan class=\"fnref\"\u003e39\u003c/span\u003e\n\nWhenever one attempts to explain what a word means another word must be used. Whenever a court construes language and explains what words mean, it necessarily uses words other than the words being construed, as does the opinion of the Court in this case. \u003cspan class=\"fnref\"\u003e40\u003c/span\u003e The alternative is to say, and all too frequently one does read arguments by lawyers and judicial opinions which say no more than, the word being construed means the word being construed: \"property tax laws\" means \"property tax laws\". If one wishes to convey meaning, however, one must say that \"property tax laws\" means X or does not mean or include Y or does mean and include Z. The threadbare argument \"if the Legislature had meant, it would have\" should be exorcized.\n\nD\n\nTo say that because the words \"special assessments\" appear in § 31, the context of the Tax Tribunal Act suggests or that the Legislature \"must have\" had in mind a broader purpose or intended that a broader meaning be ascribed to \"property tax laws\" would be wholly circular and would deprive the term \"property tax laws\" of meaning as a modifier of \"special assessments\".\n\nThe context of the Tax Tribunal Act -- the language of the act other than the language being construed -- does not suggest a broader purpose for § 31 than providing for review of decisions relating to ad valorem property taxes. \u003cspan class=\"fnref\"\u003e41\u003c/span\u003e No language in other sections of the Tax Tribunal Act suggests that the Legislature used the term \"property tax laws\" in different senses in §§ 31 and 53 \u003cspan class=\"fnref\"\u003e42\u003c/span\u003e or used the terms \"property\", \"property taxes\" or \"taxes\" in different senses where those terms appear. \u003cspan class=\"fnref\"\u003e43\u003c/span\u003e\n\nThe opinion of the Court acknowledges that \"property tax laws\" are words of limitation. The opinion does not specifically define the term property tax laws, but the import of the opinion is discernible.\n\nThe opinion says that \"the phrase [property tax laws] distinguishes between the special assessments involved in this case and other special assessments not levied under property tax laws\". \u003cspan class=\"fnref\"\u003e44\u003c/span\u003e Putting aside that the examples suggested by the opinion of possible special assessments which would not be subject to Tax Tribunal jurisdiction are, to say the least, tenuous, \u003cspan class=\"fnref\"\u003e45\u003c/span\u003e the \"distinction\" says no more than the words being construed serve to permit a distinction between this case and other cases. But the opinion fails to state the distinction.\n\nThe \"distinction\" drawn in the opinion of the Court ignores that the Legislature was not talking about special assessments alone but also about \"assessments, valuation, rates\" and \"allocation and equalization\" under \"property tax laws\". \u003cspan class=\"fnref\"\u003e46\u003c/span\u003e\n\n\"Allocation and equalization\" are concepts peculiar to ad valorem property taxes. Because \"allocation or equalization\" arise only under the property tax laws, the Court could not say that \"the phrase [property tax laws] distinguishes between\" \"allocation or equalization\" arising under the property tax laws and \"allocation or equalization\" not arising under property tax laws.\n\n\"Property tax laws\" is a common denominator of and pertains to all the words being modified: assessment, valuation, rates, special assessments, allocation, and equalization. Manifestly, in speaking of property tax laws in the clause \"assessment, valuation, rates, special assessments, allocation, or equalization, under property tax laws\", the Legislature meant that body of statutory law pertinent to allocation and equalization and, as well, to assessment, valuation, rates and special assessments. That body of law is The General Property Tax Act, providing for the levying and collection of the ad valorem state tax on real and personal property, pursuant to which body of law special assessments, not levied under that body of law, may be collected.\n\nE\n\nThe opinion of the Court defines \"property tax laws\" generically and does not recognize the phrase as a term of art which is rooted in the constitutional and statutory history of the state. One can isolate each word in the term \"property tax laws\" and make an argument that the term means any governmental exaction or perhaps even a non-governmental exaction authorized by government \u003cspan class=\"fnref\"\u003e47\u003c/span\u003e levied on or in respect to \"property\". Any governmentally authorized exaction can be regarded as a \"tax \". The governmental authorization would be the \"law\". The exaction is bound to be levied on or in respect to \u003cspan class=\"fnref\"\u003e48\u003c/span\u003e and be payable out of \"property\". So defined, the words \"property tax laws\" cease to have meaning as words of limitation.\n\nThe corporation franchise tax law levies a value-based (ad valorem) tax measured by the book value of a corporation's property. \u003cspan class=\"fnref\"\u003e49\u003c/span\u003e The intangibles tax law levies a value-based tax measured by the par value of securities that are not income producing. \u003cspan class=\"fnref\"\u003e50\u003c/span\u003e The use tax is measured by the selling price of tangible personal property. \u003cspan class=\"fnref\"\u003e51\u003c/span\u003e Defining property tax laws as simply laws imposing taxes on property would bring within the Tax Tribunal's § 31 jurisdiction the corporation franchise, intangible and use taxes although it is clear that the Legislature did not intend that they be covered by § 31. These and other state taxes were not within the Tax Tribunal's \"exclusive and original\" § 31 jurisdiction, and are within the Tax Tribunal's jurisdiction by virtue of the provisions of § 79 of the Tax Tribunal Act and the 1976 and 1980 amendments. \u003cspan class=\"fnref\"\u003e52\u003c/span\u003e\n\nDefining \"property tax laws\" as any law authorizing a tax on property would also support the Conclusion that the income tax is a tax on property. Indeed, it is because the United States Supreme Court so declared that the Sixteenth Amendment was submitted to the states. In Pollock v Farmers' Loan \u0026 Trust Co, 157 U.S. 429; 15 S Ct 673; 39 L Ed 759 (1895), the United States Supreme Court held that an act of Congress levying an income tax was unconstitutional insofar as it levied a tax on the rents or income of real estate because such a tax is a \"direct tax\": \u003cspan class=\"fnref\"\u003e53\u003c/span\u003e\n\n\" is admitted that a tax on real estate is a direct tax. Unless, therefore, a tax upon rents or income issuing out of lands is intrinsically so different from a tax on the land itself that it belongs to a wholly different class of taxes, such taxes must be regarded as falling within the same category as a tax on real estate eo nomine.\"\n\nF\n\nThe opinion of the Court states that the \"phrase [property tax laws] distinguishes special assessments that are under the taxing power and that relate to real property from other types of special assessments\". \u003cspan class=\"fnref\"\u003e54\u003c/span\u003e\n\nSpecial assessments have indeed been sometimes denominated as \"taxes\", and it has been said that the constitutional source of the legislative authority to provide for the levying of a special assessment is the \"taxing power\". This Court, in the Detroit Paving Cases in the 1860's, faced with the claim that a special assessment was a taking in violation of the Eminent Domain Clause, said, with some difficulty in opinions which failed to command a majority, \u003cspan class=\"fnref\"\u003e55\u003c/span\u003e that the source of the legislative authority to provide for special assessments was the taxing power:\n\n\"This involves the question, whether the money attempted to be raised by means of the assessment to defray the expenses of improving a public street, is sought to be taken by virtue of the right of eminent domain, or in the exercise of the sovereign power of taxation.\" Williams v Mayor and City of Detroit, 2 Mich 560, 566 (1853). (Emphasis in original.)\n\nFaced with the same question today, the Court might, in light of its subsequent decision in Graham v Saginaw, 317 Mich 427, 431; 27 NW2d 42 (1947), and having in mind its statements regarding the source of the authority to impose drain taxes and special assessments, \u003cspan class=\"fnref\"\u003e56\u003c/span\u003e locate in the police power the constitutional authority to provide for the levying of a special assessment.\n\nConceding, arguendo, however, that the constitutional source of the Legislature's authority to enact laws concerning special assessments in the taxing power, it does not follow that all laws enacted under the taxing power are property tax laws or even that every law enacted under the taxing power in respect to real and personal property is a property tax law. Conceding that the constitutional source of the Legislature's authority is the \"taxing power\", the constructional issue (the meaning of \"property tax laws\") under the Tax Tribunal Act remains.\n\nIn Graham, the Court held that a special assessment is not a \"tax \" \u003cspan class=\"fnref\"\u003e57\u003c/span\u003e within the meaning of the 15-mill constitutional limitation respecting \"taxes assessed against property \" (emphasis supplied). \u003cspan class=\"fnref\"\u003e58\u003c/span\u003e Thus, at least for the purposes of the 15-mill limitation, a special assessment is not a \"property tax\". In light of Graham, this Court cannot properly say that in the phrase \"property tax laws\" the word \"tax\" means a governmental exaction, that a special assessment for local improvements is a governmental exaction, that \"property\" refers to real or personal (as distinguished from intangible) property, and that a law authorizing such an exaction is a property tax law.\n\nBy 1963 and 1974, when the present constitution and the Tax Tribunal Act were drafted, it was clear, \u003cspan class=\"fnref\"\u003e59\u003c/span\u003e whatever the constitutional source of the Legislature's authority, that a special assessment is not a tax on property, and that laws authorizing special assessments for local improvements are not property tax laws.\n\nThe \"property tax\", as clearly appears from the language adopted on the floor of the constitutional convention (\"property tax purposes\"), \u003cspan class=\"fnref\"\u003e60\u003c/span\u003e is the tax requiring \"valuation\" and subject to \"allocation\", concepts which are, again, peculiar to the ad valorem tax on real and personal property. The \"property tax\" is not every governmental exaction in respect to property, or even every governmental exaction in respect to real or personal property, but only the ad valorem tax on real and personal property.\n\n\"Property tax laws\" is a term of art and not a collection of words to which the Court is justified in giving its own meaning. Those words have a fixed meaning, and that fixed meaning is those tax laws administered by the State Tax Commission which are the ad valorem real and personal property tax laws.\n\nThe Legislature did not use the term \"property tax laws\" in different senses in § 53, concerning appellate review, and § 31, concerning jurisdiction.\n\nG\n\nThe opinion of the Court ignores that the words \"property tax laws\" refers to a body of law still subject to administration by the State Tax Commission.\n\nThe opinion fails to take into account that if the provisions of the home-rule cities act empowering a city to levy a special assessment is a property tax law for purposes of Tax Tribunal jurisdiction so too is it a property tax law for purposes of the continuing jurisdiction of the State Tax Commission. The State Tax Commission may thus, after today, have jurisdiction to supervise city and other local governmental units in respect to special assessments in much the same manner as local ad valorem tax assessors are supervised.\n\nThe opinion also fails to take into account that, applying the same reasoning to the Drain Code, the Tax Tribunal may now exercise quasi-judicial review of special assessments levied pursuant to the Drain Code \u003cspan class=\"fnref\"\u003e61\u003c/span\u003e and the State Tax Commission may now be said to have the power and responsibility to supervise county drain commissioners in the administration of the provisions of the Drain Code concerning drain taxes and special assessments.\n\nThe Court, in declaring that a law authorizing a local special assessment is enacted under the taxing power, states that a special assessment authorized under the police power would not be subject to Tax Tribunal jurisdiction. \u003cspan class=\"fnref\"\u003e62\u003c/span\u003e\n\nBecause this case arises under the home-rule cities act and not the Drain Code, an effort will, no doubt, be made on the bases of the distinction drawn by the Court between the taxing and police power and its earlier pronouncements on the source of the authority to provide for drain taxes and assessments, to except special assessments under the Drain Code from Tax Tribunal jurisdiction. The Court will then be called upon to reconsider the reasoning and language of the opinion of the Court filed today and whether to adhere to it or find a basis for withdrawing from it.\n\nH\n\nThe opinion of the Court states that an argument set forth in this opinion is analogous to arguing that because Great Danes and Dachshunds are dogs, a Pekinese is not a dog. \u003cspan class=\"fnref\"\u003e63\u003c/span\u003e The premise that all three are dogs is a matter of common knowledge; there is, therefore, no constructional issue. Here there is. \"That dog\", Sam Rayburn would say, \"won't hunt\"; if the question were which dogs hunt and which dogs don't, we could be faced with a constructional issue.\n\nThe question here is what governmental exactions are within the jurisdiction of the Tax Tribunal and which are not. Unless all governmental exactions are levied under property tax laws and were intended to be subject to Tax Tribunal jurisdiction, there must be some governmental exactions which are not property taxes although there cannot be dogs who are not dogs.\n\nWe know that all governmental exactions are not subject to Tax Tribunal jurisdiction, if for no other reason than because it took the 1976 and 1980 amendments to confer jurisdiction over other state taxes on the Tax Tribunal. \u003cspan class=\"fnref\"\u003e64\u003c/span\u003e\n\nI\n\nThe history of legislation in respect to state and local taxes and assessments persuasively suggests -- concededly that history does not require the Conclusion -- that the Tax Tribunal has not been vested in only this one instance with jurisdiction of a local assessment.\n\nThe Legislature conferred on the Tax Tribunal and its predecessors, the State Tax Commission (and its predecessors) and the Board of Tax Appeals (and its predecessors), the authority to review the levying of state taxes. \u003cspan class=\"fnref\"\u003e65\u003c/span\u003e\n\nWhile real and personal property tax assessment and review is at the local level and today all revenues are collected and expended locally, \u003cspan class=\"fnref\"\u003e66\u003c/span\u003e the state levied and received revenue from the property tax at the time the predecessors of the Tax Tribunal were established. \u003cspan class=\"fnref\"\u003e67\u003c/span\u003e Ad valorem property taxes are state taxes subject to statewide administration, while special assessments are local exactions not subject to statewide administration.\n\nAlthough no portion of the property tax is now remitted to the state, the state is still concerned with the proper administration of the property tax. School aid and other revenue sharing are based in substantial part on state equalized value. \u003cspan class=\"fnref\"\u003e68\u003c/span\u003e The property tax is still subject to statewide administration and it is a state tax.\n\nThe additional jurisdiction granted to the Tax Tribunal as a result of the 1976 and 1980 amendments \u003cspan class=\"fnref\"\u003e69\u003c/span\u003e extends only to state taxes such as the state income and sales taxes formerly subject to appeal to the Board of Tax Appeals. \u003cspan class=\"fnref\"\u003e70\u003c/span\u003e\n\nThere has been no corresponding legislative activity regarding local taxes or assessments. The 1976 amendment to the Tax Tribunal Act did not provide that appeals from adverse determinations in regard to the application of the City Income Tax Act \u003cspan class=\"fnref\"\u003e71\u003c/span\u003e or the City Utility Users Tax Act \u003cspan class=\"fnref\"\u003e72\u003c/span\u003e would be to or \"only before\" the Tax Tribunal. \u003cspan class=\"fnref\"\u003e73\u003c/span\u003e Nor has the Legislature provided for judicial review by the Tax Tribunal of local excise taxes. \u003cspan class=\"fnref\"\u003e74\u003c/span\u003e\n\nThis history, showing that all the statutes identified by the 1976 and 1980 amendments concern state taxes and that the business of the Tax Tribunal and its predecessors is and was state taxes, indicates that the Tax Tribunal, like its predecessors, has been charged only with reviewing decisions relating to state taxes, not decisions levying local taxes or assessments.\n\nWe do not argue, as set forth in the opinion of the Court, that the jurisdiction of the Tax Tribunal does not include special assessments \"because its predecessors did not review special assessments\". The argument is rather that the Legislature has never provided a means of review by a state administrative tribunal of any tax or assessment other than a state tax or assessment and that suggests, although it does not require, that the Tax Tribunal Act should not, for this and other substantial reasons, be construed as providing in this one instance only a means of administrative review at the state level of a decision to levy a local tax or assessment, absent a clearer statement or evidence of a purpose to do so.\n\nWe agree that the Legislature could constitutionally subject local taxes and special assessments to Tax Tribunal or other state administrative agency jurisdiction. We contend only that the Legislature has not done so.\n\nJ\n\nThe opinion of the Court states that channeling special assessment appeals to an \"administrative agency instead of the circuit court is consistent with similar actions in other contexts\". \u003cspan class=\"fnref\"\u003e75\u003c/span\u003e The opinion does not identify those contexts, although there is a hint that recognizing jurisdiction in the Tax Tribunal will reduce the burden on the circuit courts \u003cspan class=\"fnref\"\u003e76\u003c/span\u003e and that an administrative tribunal may know more about this sort of business than a court. \u003cspan class=\"fnref\"\u003e77\u003c/span\u003e\n\nThe argument that \"consolidation will foster standardization and equality in the levying of special assessments\" \u003cspan class=\"fnref\"\u003e78\u003c/span\u003e assumes that there were problems resulting from a lack of standardization, that there was inequality from county to county in drain assessments and from city to city in special assessments, and that the Legislature was therefore moved to intervene and to provide a remedy.\n\nThe argument also assumes that standardization and equality in special assessment are desirable. Some communities have the wherewithal to finance local public improvements with general tax dollars, in whole or in part, while others are more dependent on special assessments as a means of financing. A state administrative tribunal empowered to review local governmental decisions to finance through special assessments will find itself confronted with evidence that in other communities \"similar\" improvements have been financed with general tax dollars which, it will be asserted, indicates that the improvements in suit do not specially benefit property owners in the special assessment district. The Tax Tribunal will be reminded of the legislative purpose, enunciated by this Court, of \" standardization and equality in the levying of special assessments\".\n\nThe Tax Tribunal will be called upon to confront the tension between the constitutional provision limiting ad valorem assessments to 50% of true cash value \u003cspan class=\"fnref\"\u003e79\u003c/span\u003e and the constitutional limitation barring a special assessment unless there is a special benefit. \u003cspan class=\"fnref\"\u003e80\u003c/span\u003e Especially where the community faces a declining property tax base, the Tax Tribunal will find it precariously difficult to hold to the constitutional line on both the issue of ad valorem property tax value and the issue whether a special benefit will accrue from construction of the public improvement proposed to be financed by special assessment.\n\nK\n\nAt the time the Tax Tribunal Act was enacted, the established practice to contest a special assessment was an equitable action in the circuit court to set aside the assessment and to restrain collection. \u003cspan class=\"fnref\"\u003e81\u003c/span\u003e\n\nSubsequent to the enactment of the Tax Tribunal Act and as part of a revision of the enabling acts for villages \u003cspan class=\"fnref\"\u003e82\u003c/span\u003e and fourth-class cities, \u003cspan class=\"fnref\"\u003e83\u003c/span\u003e the Legislature, in 1974, prescribed the timing and procedure for actions instituted \"for the purpose of contesting or enjoining the collection\" of a special assessment. \u003cspan class=\"fnref\"\u003e84\u003c/span\u003e (Emphasis supplied.)\n\nThis provision for equitable actions challenging special assessments -- the established means of contesting a special assessment -- is not merely a re-enactment of prior language. There was no counterpart to the added language in the village \u003cspan class=\"fnref\"\u003e85\u003c/span\u003e and fourth-class city \u003cspan class=\"fnref\"\u003e86\u003c/span\u003e enabling acts before the revision, nor is there a counterpart in other enabling acts. \u003cspan class=\"fnref\"\u003e87\u003c/span\u003e\n\nThis language, added less than a year after the enactment of the Tax Tribunal Act, indicates a legislative understanding that contests of special assessments were still properly brought, as equitable actions, in the courts. \u003cspan class=\"fnref\"\u003e88\u003c/span\u003e\n\nL\n\nConstruing \"property tax laws\" to mean laws concerning ad valorem property taxes is consistent with a prior decision of this Court. This Court has said that the Legislature intended to give the Tax Tribunal jurisdiction over matters formerly \"heard by the State Tax Commission as an appellate body.\" (Emphasis in original.) Emmet County v State Tax Comm, 397 Mich 555.\n\nIn Emmet County, this Court considered the same jurisdictional provision, § 31, of the Tax Tribunal Act that is now an issue. Section 31 confers on the Tax Tribunal jurisdiction to review a final decision relating to \"equalization, under property tax laws\".\n\nWhile a literal reading would indicate that the Tax Tribunal has jurisdiction over all final decisions relating to equalization, this Court concluded that the provision was intended to give the Tax Tribunal jurisdiction over only intracounty equalization decisions and not, in addition, intercounty equalization decisions.\n\nThis Court considered the historical difference between intracounty and intercounty equalization proceedings, the apparent legislative intent to give the Tax Tribunal jurisdiction over matters formerly heard by the State Tax Commission as an appellate body, and the lack of any prior provision for administrative review of intercounty equalization decisions. This Court said that since there had not theretofore been administrative review of intercounty equalization decisions the Tax Tribunal was confined to reviewing intracounty equalization.\n\nSo, too, here we should construe the § 31 language giving the Tax Tribunal jurisdiction to review a final decision relating to \"special assessments * * * under property tax laws\" in light of the historical treatment of actions challenging special assessments -- which were maintained in the circuit court and not before the State Tax Commission -- and the legislative intent to give the tribunal jurisdiction over matters formerly \"heard by the State Tax Commission as an appellate body.\" \u003cspan class=\"fnref\"\u003e89\u003c/span\u003e\n\nThe effort, in the opinion of the Court, to distinguish Emmet County on the ground that there it was proposed to insert an \"additional level of review in the process, thereby endangering the [state tax] commission's ability to function within the time limits established for the collection of taxes\" \u003cspan class=\"fnref\"\u003e90\u003c/span\u003e is not persuasive. The Court today does precisely that: it inserts a new level of administrative review in the special assessment process. The levying of a special assessment was not heretofore subject to administrative review at the state level before a quasi-judicial tribunal. A special assessment levy, just as intercounty equalization (the issue in Emmet County), could be challenged only in the circuit court.\n\nThe opinion of the Court says that the \"review of special assessments by the tribunal will not endanger the timely and orderly collection of taxes or present the risks indicated in Emmet County \". \u003cspan class=\"fnref\"\u003e91\u003c/span\u003e Those statements are made on faith and without apparent recognition of the realities of the time frame involved in review by the Tax Tribunal or the consequences of an enlarged \u003cspan class=\"fnref\"\u003e92\u003c/span\u003e scope of review (de novo) with a right of appeal, under the Tax Tribunal Act, to the Court of Appeals and a constitutional right to have the appellate court determine whether the judgment is supported by substantial evidence on the whole record.\n\nIn holding that the Tax Tribunal has jurisdiction, the Court has not simply construed the act to provide that actions formerly brought in the circuit court must now be brought before the Tax Tribunal. It has construed the act to provide for an entirely different kind of review, de novo review. See part VI below.\n\nThere is much the same danger that interposing, at the state level, a level of administrative and enlarged review will impair the ability of local governmental units to levy special assessments as there would have been had this Court construed the Tax Tribunal Act to provide for review of intercounty equalization.\n\nM\n\nWe do not say or think that \"the Legislature made a mistake\". \u003cspan class=\"fnref\"\u003e93\u003c/span\u003e The Legislature did just fine. It used words with a meaning fixed in the constitutional and legal history of this state and relied on this Court to discern that meaning. It is this Court that makes a mistake.\n\nIII\n\nThe term \"special assessments\" appears, as the opinion of the Court points out, \u003cspan class=\"fnref\"\u003e94\u003c/span\u003e in a number of places in the general property tax laws. That no doubt explains why the words \"special assessments\" were included in the § 31 jurisdictional statement. Otherwise, it might have been thought that administrative appeals from decisions relating to \"special assessments * * * under property tax laws\", subject to the jurisdiction of the State Tax Commission, had not been transferred to the Tax Tribunal and remained subject to quasi-judicial review by the State Tax Commission.\n\nThe opinion of the Court states, and we agree, \" these provisions [referring to special assessments in The General Property Tax Act and in other laws collected in the chapter on real and personal property taxation] do not authorize any special assessments, they must refer to special assessments levied under other laws.\" \u003cspan class=\"fnref\"\u003e95\u003c/span\u003e\n\nAlthough special assessments are levied under other laws, laws which are not property tax laws, \"these provisions\" (concerning [see part B below] the collection of special assessments and the sale of property so assessed for nonpayment of special assessments) are laws or provisions of law which are property tax laws. Decisions respecting the collection of \"special assessments * * * under property tax laws\" are subject to the jurisdiction of the Tax Tribunal.\n\nA\n\nA decision to finance a public improvement by creating a special assessment district and levying a special assessment is not made under The General Property Tax Act \u003cspan class=\"fnref\"\u003e96\u003c/span\u003e or other ad valorem property tax laws or provisions of law which are subject to administration by the State Tax Commission. Rather, such a decision is made pursuant to authority conferred in the statutes defining the municipal powers of counties, \u003cspan class=\"fnref\"\u003e97\u003c/span\u003e cities (home-rule \u003cspan class=\"fnref\"\u003e98\u003c/span\u003e and fourth-class, \u003cspan class=\"fnref\"\u003e99\u003c/span\u003e townships, \u003cspan class=\"fnref\"\u003e100\u003c/span\u003e charter townships, \u003cspan class=\"fnref\"\u003e101\u003c/span\u003e and other governmental bodies (county drain commissioners, \u003cspan class=\"fnref\"\u003e102\u003c/span\u003e metropolitan districts \u003cspan class=\"fnref\"\u003e103\u003c/span\u003e and villages) \u003cspan class=\"fnref\"\u003e104\u003c/span\u003e which are not subject to administrative supervision by the State Tax Commission.\n\nB\n\nThe statutes authorizing the establishment of special assessment districts to finance local improvements and the levying of special assessments often give the assessing authority the option of either collecting the assessment or of turning the assessment roll over to the property tax collector. \u003cspan class=\"fnref\"\u003e105\u003c/span\u003e Thus, although special assessments are not levied \"under property tax laws\", they may be collected by a tax collector under property tax laws.\n\nThe Tax Tribunal has said that the State Tax Commission had authority to exercise supervisory control over the actions of a tax collector respecting special assessments, \u003cspan class=\"fnref\"\u003e106\u003c/span\u003e for example a tax collector's refusal to collect a special assessment. \u003cspan class=\"fnref\"\u003e107\u003c/span\u003e An ad valorem property tax collector, when billing and collecting a special assessment, functions under procedures set forth in the property tax laws and his acts or failure to act have been regarded as decisions relating to special assessments under property tax laws.\n\nAccordingly, action or non-action of a tax collector in respect to special assessments, although levied under laws or provisions of law which are not property tax laws, is subject to administrative supervision by the State Tax Commission when required to be collected pursuant to property tax laws and, since enactment of the Tax Tribunal Act, to the jurisdiction over? appeals transferred to the Tax Tribunal. The Tax Tribunal has jurisdiction under § 31 of decisions, formerly appealable to the State Tax Commission, relating to the collection of special assessments when required to be carried out \"under property tax laws\".\n\nC\n\nThe opinion of the Court argues that there is \"no basis for concluding\" that the Legislature meant to include within the Tax Tribunal's jurisdiction only decisions concerning the \"ministerial acts involved in the collection of special assessments\". \u003cspan class=\"fnref\"\u003e108\u003c/span\u003e The Legislature must have had a larger purpose.\n\nWe do not contend that when the Tax Tribunal Act was enacted the Legislature decided to subject decisions relating to the collection of special assessments to Tax Tribunal review but not decisions relating to the levying of special assessments, and that it therefore made a distinction between levying and collection. The distinction is not the result of conscious choice by the Legislature at the time of the enactment of the Tax Tribunal Act but rather follows from choices made long ago by the Legislature and the resulting circumstance that the State Tax Commission never had jurisdiction over decisions relating to levying but did have jurisdiction over decisions relating to collection pursuant to the property tax laws.\n\nSince it was the Legislature's purpose to transfer to the Tax Tribunal jurisdiction over all the appellate business of the State Tax Commission, the Tax Tribunal Act was worded so that the Tax Tribunal would obtain jurisdiction of administrative appeals respecting special assessments. Administrative appeals were, however, limited to decisions under the property tax laws. The only decisions respecting special assessments under the property tax laws concern the collection of special assessments.\n\nThe Legislature need not have had a larger purpose. The basic legislative decision, made long ago, was that local units of government may levy special assessments without state supervision and may use the existing ad valorem tax collection machinery, which is subject to state supervision, to collect the special assessment. The decision in 1974, when the Tax Tribunal Act was enacted, was simply to try to do a better job (by creating the Tax Tribunal) in an area of prior state involvement, not to -expand that involvement.\n\nMerely because part of the business transferred was the infrequent review of a petition respecting collection, formerly appealable administratively, the Legislature need not have intended to transform altogether the review of local governmental decisions to levy special assessments by providing an administrative appeal at the state level in a relatively large number of cases.\n\nThe premise set forth in the opinion of the Court, that the Legislature would not have been content with merely providing for review of the ministerial acts involved in the collection of special assessments, overlooks the difference between reviewing decisions of the governing body of a city or of a drain commissioner to finance a public improvement by a special assessment and apportioning such an assessment and reviewing the decision of a tax collector whether to bill and collect an assessment or to refuse to do so.\n\nNor is it likely that the different means of review of the different decisions will, as argued in the opinion of the Court, \"result in forum shopping and increase the possibility of inconsistent decisions in similar cases\". \u003cspan class=\"fnref\"\u003e109\u003c/span\u003e The jurisdiction of the State Tax Commission and of the Tax Tribunal with respect to collection does not extend to whether there is a special benefit to the property proposed to be specially assessed, the issue which is generally litigated in special assessment cases. The only issue that could be raised before the Tax Tribunal in regard to collection would be the rarely litigated one of whether the local unit of government had duly adopted, in accordance with procedural requirements, a special assessment roll which the tax collector is required to bill and collect. \u003cspan class=\"fnref\"\u003e110\u003c/span\u003e The danger of forum shopping or of inconsistent decisions in regard to matters of that kind, which infrequently are a matter of serious dispute, is small.\n\nD\n\nIn construing a statute, a court properly looks at the results which will follow from alternate constructions: We do not therefore take issue with the opinion of the Court for advancing \"policy\" arguments and considering, for example, whether the different means of review of the different decisions appear to be consonant with reason. Our difference of opinion does not concern methodology. We both pay homage to the same jurisprudential gods. We simply see different truths.\n\nIV\n\nSection 41 of the Tax Tribunal Act provides that persons who were theretofore entitled to proceed before \"the state tax commission or circuit court\" for determination of a matter \" subject to the tribunal's jurisdiction * * * shall proceed only\" before the tribunal. \u003cspan class=\"fnref\"\u003e111\u003c/span\u003e (Emphasis supplied.)\n\nA\n\nFor reasons already stated -- a decision levying a special assessment is not made \"under property tax laws\" -- a challenge to a special assessment is not a matter \"subject to the tribunal's jurisdiction\".\n\nB\n\nThe history and antecedents of the Tax Tribunal Act -- consistent with a literal reading of § 41 -- indicate a legislative intent to divest the circuit court of jurisdiction over matters which could be brought either before \"the state tax commission or the circuit court\" (emphasis supplied), not of matters which could be brought only in the circuit court.\n\nBefore the enactment of the Tax Tribunal Act, a taxpayer had two means of obtaining relief from ad valorem property tax assessments. An administrative appeal could be filed with the State Tax Commission under § 152 of The General Property Tax Act. \u003cspan class=\"fnref\"\u003e112\u003c/span\u003e If the tax was paid under protest, an action could be commenced in circuit court for refund under § 53 of that act. \u003cspan class=\"fnref\"\u003e113\u003c/span\u003e The two remedies were not mutually exclusive; taxpayers could, and occasionally did, pursue both.\n\nAlthough both remedies could be pursued, challenges to ad valorem property taxes asserting improper valuation were invariably made before the State Tax Commission, not the courts. The courts had exercised only a limited review of property tax assessments and had disavowed any power to set assessments. Almost without exception the courts had refused to disturb valuations set by tax agencies and would, at most, set aside a palpably erroneous assessment subject to proper reassessment. A taxpayer could obtain effective and final relief only before the State Tax Commission. \u003cspan class=\"fnref\"\u003e114\u003c/span\u003e\n\nThe Tax Tribunal Act was enacted to create a specialized, full-time body to hear all property tax appeals. \u003cspan class=\"fnref\"\u003e115\u003c/span\u003e The combination in one body, the State Tax Commission, of both the supervisory and the review function was eliminated; henceforth, taxpayers would have an administrative appeal to a tribunal not directly involved in the assessment process, and the State Tax Commission would devote itself solely to administrative supervision of the assessment and collection process. To provide a unified procedure, it was necessary to vest the tribunal with exclusive jurisdiction of all property tax challenges. The Tax Tribunal Act thus established a forum, the Tax Tribunal, to hear appeals formerly reviewed administratively by the State Tax Commission under § 152 and judicially through circuit court refund actions under § 53.\n\nBecause a challenge to a special assessment levy on the ground that there was no special benefit was not formerly heard by the State Tax Commission, the jurisdiction exercised by the circuit court to hear a challenge to a special assessment levy was not alternative or supplemental to an administrative appeal to the State Tax Commission. The judicial remedy was the only remedy and, in the limited kinds of cases where judicial relief was granted, the courts provided, in contrast with ad valorem property tax appeals, an effective remedy.\n\nIn eliminating the duplicative and essentially ineffectual jurisdiction of the circuit court in ad valorem property tax appeals, there was no purpose to eliminate circuit court jurisdiction where the judicial remedy had no administrative parallel and the circuit court had provided an effective remedy.\n\nIndeed, where an action for refund in a court had been an effective remedy, the Legislature, in subsequent legislation affecting the Tax Tribunal's jurisdiction, continued court jurisdiction although the court remedy was duplicative of administrative review by the Tax Tribunal. Court jurisdiction was continued notwithstanding the \"proliferation\" of remedies, \"problems of forum shopping\" and \"possibility of inconsistent decisions\". \u003cspan class=\"fnref\"\u003e116\u003c/span\u003e In the final resolution, in 1980, of the legislative process adding administrative appeals concerning state taxes formerly heard by the Board of Tax Appeals to the jurisdiction of the Tax Tribunal, the Legislature preserved the taxpayer's alternative judicial remedy by providing that a taxpayer who pays an asserted deficiency under protest may commence an action for refund in the Court of Claims. \u003cspan class=\"fnref\"\u003e117\u003c/span\u003e\n\nThe language of § 41 of the Tax Tribunal Act (\"before the state tax commission or circuit court\") (emphasis supplied) refers quite clearly to contests concerning ad valorem property taxes which, uniquely, could have theretofore been brought either as an administrative appeal \"before the state tax commission\" under § 152 of The General Property Tax Act \"or ['before the'] circuit court\" for a refund of taxes paid under § 53 of that act.\n\nPersons who theretofore challenged the levy of a special assessment were not entitled to proceed \"before the state tax commission or circuit court\" (emphasis supplied). A property owner seeking to challenge a special assessment levy could proceed only in the circuit court. \u003cspan class=\"fnref\"\u003e118\u003c/span\u003e\n\nThe opinion of the Court states that § 41 \" the tribunal's broad-based jurisdiction over proceedings previously conducted both before the State Tax Commission and the circuit court\" \u003cspan class=\"fnref\"\u003e119\u003c/span\u003e (emphasis supplied). Challenges to the levying of a special assessment were not, however, \"previously conducted both before the State Tax Commission and the circuit court\" but only in the circuit court.\n\nThe last quoted statement in the opinion of the Court was the predicate of the argument, \" the tribunal has jurisdiction over matters formerly heard in circuit court, its jurisdiction is not limited to matters heard by the State Tax Commission. This reasoning is particularly applicable to special assessments, because many of the actions challenging special assessments were heard in circuit court\". \u003cspan class=\"fnref\"\u003e120\u003c/span\u003e The argument ignores that everything \"previously conducted both before the State Tax Commission and the circuit court\" was formerly heard in the State Tax Commission as well as formerly heard in the circuit court. It does not follow that matters (appeals from special assessment levies) not formerly heard in the State Tax Commission, matters which formerly could only be heard in the circuit court, are now within the jurisdiction of the Tax Tribunal simply because they were formerly heard in the circuit court. Only matters \"previously conducted both before the State Tax Commission and the circuit court\" are within the exclusive jurisdiction of the Tax Tribunal.\n\nV\n\nThis Court has said that it is to be presumed, in reviewing a claim that a statute has divested a court of original and general authority of a measure of its jurisdiction, that the court retains its authority. \u003cspan class=\"fnref\"\u003e121\u003c/span\u003e It is assumed that if divestiture of jurisdiction is intended the Legislature will express itself \"with clearness and leave nothing for the play of doubt and uncertainty\". \u003cspan class=\"fnref\"\u003e122\u003c/span\u003e There is a parallel rule of strict construction applicable where, as here, it is claimed that language of a statute is in derogation of the jurisdiction of the circuit court. \u003cspan class=\"fnref\"\u003e123\u003c/span\u003e\n\nFor reasons already stated at length, an intent to divest the circuit court of its jurisdiction over an action to set aside and enjoin the collection of a special assessment on the ground that no special benefit will be conferred by the improvement has not been stated in the Tax Tribunal Act in unambiguous terms, \"with clearness * * * nothing for the play of doubt and uncertainty\". An intent to divest general jurisdiction must be indicated with greater clarity and certainty than is evidenced by this act. \u003cspan class=\"fnref\"\u003e124\u003c/span\u003e\n\nVI\n\nToday's holding, that the Tax Tribunal has jurisdiction, works a significant substantive enlargement of the scope of review of special assessments. It does not merely change the forum in which review will occur. The enlarged scope of review provides additional opportunities for objectors to employ delaying tactics with resulting increases in the cost of local improvements if bonds to pay for the cost of the improvement cannot be sold during the pendency of litigation.\n\nIn circuit court challenges to special assessments levied by cities, drain commissioners and other local governmental authorities, the courts of this state have confined the judicial inquiry to the lawfulness of the special assessment and whether there is a special benefit and have generally refused to review the apportionment of benefits. \u003cspan class=\"fnref\"\u003e125\u003c/span\u003e\n\nSection 35 of the Tax Tribunal Act provides that \" proceeding before the tribunal shall be original and independent and should be considered de novo\". \u003cspan class=\"fnref\"\u003e126\u003c/span\u003e\n\nAs a result of today's decision, persons protesting special assessments levied under the home-rule cities act, the Drain Code or other enabling legislation can obtain a Tax Tribunal redetermination of the apportionment of benefits in an \"original\", \"independent\", \" de novo \" proceeding -- contrary to the sense of the Drain Code and to well-established judicial precedents regarding special assessments generally -- with appellate review as of right, under the Tax Tribunal Act, by the Court of Appeals.\n\nBecause a decision of the Tax Tribunal relating to special assessments is, we all agree, not a \"decision relating to valuation\" \u003cspan class=\"fnref\"\u003e127\u003c/span\u003e the appellate review would include, as a constitutional minimum, a determination of whether the Tax Tribunal's decision is \"supported by competent, material and substantial evidence on the whole record\". \u003cspan class=\"fnref\"\u003e128\u003c/span\u003e\n\nA\n\nIn an effort to avoid the delays of judicial proceedings, the Drain Code provides that proceedings to establish a drain shall be subject to review on certiorari in the circuit court within ten days after a copy of the final order is filed in the office of the drain commissioner and, if no certiorari be brought within the time prescribed, \"the drain shall be deemed to have been legally established, and the taxes therefor legally levied, and the legality of said drain and the taxes therefor shall not thereafter be questioned in any suit at law or equity\". \u003cspan class=\"fnref\"\u003e129\u003c/span\u003e\n\nThis Court has held that review on certiorari is limited and that complaints concerning the apportionment of the benefit are not subject to review in certiorari proceedings; absent fraud (actual or constructive) the determination of the board constituted by the probate court \u003cspan class=\"fnref\"\u003e130\u003c/span\u003e for the apportionment of benefits is final. \u003cspan class=\"fnref\"\u003e131\u003c/span\u003e Generally, a court of equity will intervene only when it is demonstrated that there is no special benefit at all or that the assessment or levy was made without statutory authorization. \u003cspan class=\"fnref\"\u003e132\u003c/span\u003e\n\nThis Court has similarly so held in actions brought in the circuit court complaining of special assessments by cities and other local units of government. The rule is that a court of equity will not substitute its judgment and \"weigh the benefits, if, in truth, there are benefits to be weighed\", Fluckey v Plymouth, 358 Mich 447; 100 NW2d 486 (1960), and will intervene only where there is an absence of benefit. Fluckey, supra; Brill v Grand Rapids, 383 Mich 216; 174 NW2d 832 (1970); Johnson v Inkster, 401 Mich 263; 258 NW2d 24 (1977).\n\nThe Drain Code provides that if certiorari proceedings are brought and the proceedings are \"sustained, the party bringing the certiorari shall be liable for the costs thereof, and if they be not sustained, the parties making application for the drain shall be liable for the costs\". \u003cspan class=\"fnref\"\u003e133\u003c/span\u003e Presumably, this provision of the Drain Code is now also superseded upon substitution of Tax Tribunal review for certiorari review. This Court having scrapped the sections of the Drain Code concerning judicial review and the time for review may find it difficult to justify a holding that the Tax Tribunal has authority to apply a provision applicable to a procedure which this Court has ruled has been eliminated by the Tax Tribunal Act.\n\nB\n\nUnder the practice prevailing before the adoption of the Tax Tribunal Act, a city or a drain commissioner could seek summary Disposition or early trial, and, because the courts did not provide independent, de novo review, insubstantial claims were disposed of readily.\n\nBut now, a property owner who formerly could not challenge the apportionment of benefits by a board constituted by a probate court under the Drain Code, who formerly was limited to certiorari review in the circuit court, who could challenge a local assessment made by a city only if he could show an absence of benefit or that the special assessment was not lawfully made, will be able to obtain an independent, de novo review of the apportionment of benefits as well as of a claim that there is no benefit at all.\n\nSubstituting Tax Tribunal review for circuit court review is not likely to reduce, and is more likely to facilitate, further appeals to the Court of Appeals and to this Court. Decisions of the Tax Tribunal not related to valuation or allocation must, under the minimum constitutional standard, be reviewed by the Court of Appeals to determine whether they are supported by competent, material and substantial evidence on the whole record.\n\nProviding for review of apportionment of benefits works a profound change in the appellate procedures respecting decisions levying drain and other local special assessments. The cost of most local improvements is funded through bond issues. The pendency of litigation may prevent the sale of bonds. Providing additional avenues for litigation may thus result in significant delays in the sale of bonds with attendant additional construction and other costs.\n\nThe Legislature desired to facilitate the speedy construction of drain projects and to protect against unfounded litigation by imposing tight time limits and restrictions on appellate review and by providing for the assessment of costs. There is no reason to suppose that in adopting the Tax Tribunal Act to address problems in the administration of the property tax laws the Legislature wished to so alter the scope of review and to work such a dramatic change in the levying and collection of special assessments.\n\nIn the instant case, Novi expects that if it succeeds in persuading this Court that the Tax Tribunal has jurisdiction that it will prevail because this action was not commenced before the Tax Tribunal within the 30-day time limit provided for filing an appeal. \u003cspan class=\"fnref\"\u003e134\u003c/span\u003e In a case where the property owners are seeking to have the amount of a special benefit reapportioned, cities may rue the day on which it was established that property owners have the right to independent de novo review of the apportionment of benefits.\n\nVII\n\nThe opinion of the Court argues that because the Court of Appeals has consistently decided, beginning five years ago in a conclusory opinion, \u003cspan class=\"fnref\"\u003e135\u003c/span\u003e that the Tax Tribunal has jurisdiction of a petition to review the levy of a special assessment, and because the Legislature did not, when amending the Tax Tribunal Act in 1978 or 1980, respond to the Court of Appeals decisions, there has been legislative approval of those decisions. \u003cspan class=\"fnref\"\u003e136\u003c/span\u003e\n\nSome statutes are frequently amended, e.g., the Worker's Disability Compensation Act of 1969, The General Property Tax Act, the Revised Judicature Act of 1961, the Revised Probate Code, the Insurance Code of 1956, and the Michigan Penal Code, to name just a few. This Court cannot seriously regard a failure to incorporate in an amendatory act corrective action in respect to a judicial decision as bicameral and gubernatorial approval of such judicial decision, especially where the sections affected by the amendatory act were not those construed in the judicial decision, only three years intervened between the judicial decision and the enactment of the amendatory act affecting other sections, and the judicial decision is of the Court of Appeals and not of this Court.\n\nThere are other argued cases awaiting decision in this Court which could readily be disposed of by this Court if all that we need to do is to look at the passage of time since a judicial pronouncement (not of the Court of Appeals but of this Court) and the Legislature's failure to respond.\n\nVIII\n\nThe opinion of the Court refers to an \"initially\" circulated opinion which preceded the filing of a responsive opinion by the writer of this opinion \u003cspan class=\"fnref\"\u003e137\u003c/span\u003e and states that the initially filed opinion addressed the issues briefed and argued by the parties.\n\nAn issue briefed and argued by the parties was whether the circuit court has jurisdiction. In arguing that issue, the Wikmans and the other plaintiffs contended that a proceeding challenging the levy of a special assessment sounds in equity and therefore the circuit court continues to have jurisdiction. They did not make the argument advanced in this opinion concerning the meaning of \"property tax laws\" as words limiting the jurisdiction of the Tax Tribunal.\n\nOne can say that the issue was raised or one can say that it was not.\n\nThe initially filed opinion provided, as did the Court of Appeals, for remand of this cause to the Tax Tribunal. Implicit in that decision is that the Tax Tribunal has jurisdiction. The initially filed opinion so declared and the opinion of the Court so declares. \u003cspan class=\"fnref\"\u003e138\u003c/span\u003e\n\nThe opinion of the Court relies (as did the initially filed opinion) on decisions of the Court of Appeals declaring that the Tax Tribunal has jurisdiction and cites decisions of that Court as authoritative. To have ignored the proposed action to remand to the Tax Tribunal because the Wikmans and the other plaintiffs did not make the argument for circuit court jurisdiction advanced in this opinion, but only the argument that the circuit court has jurisdiction as a court of equity, would be to add to that body of \"precedent\" by default. The jurisdiction of the circuit court over special assessments would then, as a practical matter, be ousted by the consent of the litigants in this case.\n\nThe decision of this Court in this cause, remanding the cause to the Tax Tribunal, will be read by the Tax Tribunal, by the circuit courts, and by the Court of Appeals as dispositive of the question of whether an action challenging a special assessment levy may or, indeed, must be brought before the Tax Tribunal or whether it can continue to be brought and maintained in the circuit court.\n\nThis Court has an obligation, when construing a statute concerning the jurisdiction of the circuit court and an administrative tribunal, to consider all the language of the statute -- in the instant case, the term \"property tax laws\" -- although the briefs of counsel fail to advert to all the language. The Court is not limited by counsels' presentations.\n\nThis is not ordinary litigation in which the Court can rest decision upon omissions of counsel or of the parties in the course of litigation. The Court has a responsibility to the other persons who will, as a practical matter, be governed by this decision.\n\nThe issue goes to the jurisdiction of the circuit courts and the Tax Tribunal. It cannot be waived by the parties or their counsel. \u003cspan class=\"fnref\"\u003e139\u003c/span\u003e Indeed, the defendants, Novi and its treasurer, did not raise the jurisdictional issue until after the trial and the matter was on appeal to the Court of Appeals. \u003cspan class=\"fnref\"\u003e140\u003c/span\u003e\n\nThe question of the meaning of \"property tax laws\" could be posed to the litigants and amicus briefs could be invited from the Michigan Association of Counties, Michigan Municipal League, Michigan Townships Association, county drain commissioners and others before deciding or appearing to decide the question. I would favor that course because I agree with the view expressed in the opinion of the Court that we should not decide a question without providing an opportunity for adversary presentation. Despite the long delay in deciding this issue, it is of far greater importance that it be decided correctly than that it be decided today. \u003cspan class=\"fnref\"\u003e141\u003c/span\u003e\n\nIX\n\nThe circuit Judge found that the Wikmans and the other plaintiffs would receive no special benefit from the proposed improvements to Taft Road over and above those enjoyed by the public at large. \u003cspan class=\"fnref\"\u003e142\u003c/span\u003e In a number of cases, this Court has held that such a finding entitles property owners to equitable relief from a special assessment although they failed to observe statutorily prescribed procedures for contesting a special assessment. \u003cspan class=\"fnref\"\u003e143\u003c/span\u003e\n\nIf it were necessary to decision -- although as we would construe the Tax Tribunal Act it is not -- we would nevertheless be inclined to agree with the opinion of the Court that an equitable remedy is not available in the instant case. \u003cspan class=\"fnref\"\u003e144\u003c/span\u003e\n\nThe general rule heretofore has been that courts will not review the judgment of a governmental authority establishing a special assessment district or the apportionment of benefits, but that such deference to the finding of a governmental authority is not warranted and equitable relief is available where the property owner shows that the governmental authority acted without a factual predicate -- without lawful authority or in the absence of special benefit. \u003cspan class=\"fnref\"\u003e145\u003c/span\u003e\n\nThe holding, in the opinion of the Court, that the Tax Tribunal has jurisdiction means that review of the entire matter, factually, on the merits, in an independent, original de novo hearing, \u003cspan class=\"fnref\"\u003e146\u003c/span\u003e is obtainable in a quasi-judicial proceeding. The Tax Tribunal will presumably approach its reviewing responsibility with care. Concern about the adequacy of factual determinations where they are made upon a hearing conducted by the city or other governmental authority levying the special assessment is not likely to provide a basis for equitable intervention.\n\nNor does it appear that there is any need to enjoin collection of a special assessment in order to provide an adequate remedy. While the Tax Tribunal Act requires payment of ad valorem property taxes as a precondition to a hearing, there is no such requirement for other matters within the Tax Tribunal's jurisdiction. \u003cspan class=\"fnref\"\u003e147\u003c/span\u003e Plaintiffs have no need for temporary injunctive relief unless their property is about to be sold, before final decision of the Tax Tribunal and on any appeals therefrom, for nonpayment of the special assessment. A favorable decision by the Tax Tribunal or on appeal would have the effect of a permanent injunction against collection of the special assessment.\n\nThere is no need to decide in this case whether a class action can be maintained in equity to enjoin a special assessment. This is not a class action. Plaintiffs, 45 persons owning 34 separate homes, joined together to bring this action. While it appears that each property owner may be required to pay $50 to commence a proceeding before the Tax Tribunal, it has not been asserted that in the circumstances of the instant case the Tax Tribunal remedy is for that reason inadequate. In Romulus City Treasurer v Wayne County Drain Comm'r, post, p 728, decided today, we explore the class action question.\n\nWe would reverse the judgment of the Court of Appeals, and remand the cause to it for consideration of the other issues raised by the city's appeal and the plaintiffs' cross-appeal.\n\n\u003cspan class=\"fn\"\u003e1. In the order granting leave to appeal, this Court directed the following issues to be addressed:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(1) whether the circuit court has jurisdiction of a complaint for injunctive relief from a special assessment levied by a governmental unit in light of the provision for exclusive and original jurisdiction of the Tax Tribunal,\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(2) whether the 30-day filing requirement is jurisdictional, and\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(3) whether, under the facts of this case, the plaintiffs have complied with the requirements necessary to invoke the jurisdiction of the Tax Tribunal. Wikman v Novi, 406 Mich 977 (1979).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. A third avenue of relief, an injunction to stay the collection and assessment of a tax, was prohibited by MCL 211.114; MSA 7.168. However, this statute has not always been construed as an absolute prohibition, see Haggerty v City of Dearborn, 332 Mich 304, 316; 51 NW2d 290 (1952).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Prior to being amended by 1976 PA 292; MCL 211.53; MSA 7.97 provided:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Any person may pay the taxes or special assessments, or any one of the several taxes or special assessments, on any parcel or description of land, or on any undivided share thereof, and the treasurer shall note across the face of the receipt in ink any portion of the taxes or special assessments remaining unpaid. A person may protest any tax or special assessment which is paid within 60 days of such payment, whether levied on personal or real property, to the treasurer, specifying in writing, signed by him, the grounds of the protest, and the treasurer shall minute the fact of the protest on the tax roll. The person may, within 30 days after such protest, sue the township or city for the amount paid, and recover, if the tax or special assessment is shown to be illegal for the reason shown in the protest.\" The constitutionality of this provision as it relates to special assessments was questioned in Knott v Flint, 363 Mich 483; 109 NW2d 908 (1961). Although four Justices concluded that the statute was unconstitutional, a majority of the Court did not reach this Conclusion. Therefore, it is not binding on later cases, see LeVasseur v Allen Electric Co, 338 Mich 121; 61 NW2d 93 (1953), Zirkalos v Zirkalos, 326 Mich 420; 40 NW2d 313 (1949).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. See Forest Hill Cemetery Co v Ann Arbor, 303 Mich 56; 5 NW2d 564 (1942), and the cases cited in the Dissenting opinion in fn 24. In cases involving assessments for a drain, the availability of injunctive relief is limited by statute, see MCL 280.267; MSA 11.1267, MCL 280.268; MSA 11.1268.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. See Consumers Power Co v Big Prairie Twp, 81 Mich App 120, 156-157; 265 NW2d 182 (1978), Mohawk Data Sciences Corp v Detroit, 63 Mich App 102; 234 NW2d 420 (1975), Fisher-New Center Co v Detroit, 38 Mich App 750; 197 NW2d 272 (1972).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. MCL 205.721; MSA 7.650(21) provides in part:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"The tax tribunal is created and is a quasi-judicial agency which, for administrative purposes only, is in the department of treasury.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. MCL 205.722; MSA 7.650(22) provides in part:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(1) The members of the tribunal shall be citizens of the United States, residents of this state, of which at least 2 shall be attorneys admitted to practice in this state and shall have been engaged for at least 5 years immediately preceding the appointment in active government, corporate, or private practice dealing with federal and state-local tax matters, including the property tax, or in the discharge of a judicial or quasi-judicial office; at least 1 shall be a certified assessor holding the highest level of certification granted by the state assessors board; at least 1 shall be a professional real estate appraiser holding a recognized certification indicating competence in the valuation of complex income producing and residential property of the type subject to property taxation, with a certification having required a review of sample appraisals, and 5 years of experience as an appraiser; and at least 1 shall be a certified public accountant with 5 years' experience in state-local tax matters. Not more than 3 members shall be members of the same professional discipline. Additional appointees who are not attorneys, certified assessors, professional real estate appraisers, or certified public accountants shall have at least 5 years' experience in state or local tax matters.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(2) Each member shall take and subscribe the constitutional oath of office before entering on the discharge of his duties.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(3) Each member shall devote his entire time to, and personally perform the duties of, his office and shall not engage in other business or professional activity for remuneration.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. MCL 205.731(b); MSA 7.650(31)(b) is not involved in this proceeding. It refers to taxes without mentioning special assessments. In many instances, such a reference would be construed as including taxes but not special assessments; see Lake Shore \u0026 M S R Co v Grand Rapids, 102 Mich 374; 60 NW 767 (1894). Whether the reference to special assessments in subsection (a) changes this analysis is a decision which must wait for the appropriate case raising this issue.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. See, Dukesherer Farms, Inc v Director of Dep't of Agriculture (After Remand), 405 Mich 1; 273 NW2d 877 (1979), and Knott, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Graham v Saginaw, 317 Mich 427; 27 NW2d 42 (1947), Forest Hill Cemetery, supra, In re Petition of Auditor General, 226 Mich 170; 197 NW 552 (1924), Lake Shore, supra, Motz v Detroit, 18 Mich 495 (1869), and Woodbridge v Detroit, 8 Mich 274 (1860).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The Legislature, in enacting the Drain Code, has described the revenues received as taxes even though they are special assessments for the purpose of constitutional analysis, see MCL 280.263; MSA 11.1263.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. MCL 41.728; MSA 5.2770(58), MCL 67.10; MSA 5.1294, MCL 104A.3; MSA 5.1854(3), MCL 123.758; MSA 5.570(28).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. MCL 68.18; MSA 5.1366, MCL 104A.3; MSA 5.1854(3), MCL 211.501; MSA 7.721.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. MCL 206.512(2); MSA 7.557(1512)(2) provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"'Property taxes' means general ad valorem taxes due and payable for periods after December 31, 1972, levied on a homestead within this state, including collection fees, but not including special assessments, penalties, or interest.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThis definition is limited to determining property tax credits, see MCL 206.501; MSA 7.557(1501). See also MCL 554.702(12); MSA 26.1287(2)(12).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. But cf. Delta County v Gladstone, 305 Mich 50; 8 NW2d 908 (1943), and Fennell v Common Council of Bay City, 36 Mich 186 (1877).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. MCL 211.53; MSA 7.97, MCL 211.58; MSA 7.102, MCL 211.98; MSA 7.151, MCL 211.108; MSA 7.162, MCL 211.135; MSA 7.194, MCL 211.360; MSA 7.960, MCL 211.372; MSA 7.965(2), MCL 211.381; MSA 7.771, MCL 211.403-211.404; MSA 7.863-7.865, MCL 211.406; MSA 7.867, MCL 211.421; MSA 7.941, MCL 211.492; MSA 7.712, MCL 211.501; MSA 7.721, MCL 211.531; MSA 7.761, MCL 211.711; MSA 7.680, MCL 211.761 et seq.; MSA 5.3536(1) et seq.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Const 1963, art 6, § 28 provides in part:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"In the absence of fraud, error of law or the adoption of wrong principles, no appeal may be taken to any court from any final agency provided for the administration of property tax laws from any decision relating to valuation or allocation.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. MCL 205.753(1); MSA 7.650(53)(1) provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Subject to section 28 of article 6 of the constitution of 1963, and pursuant to section 102 of Act No. 306 of the Public Acts of 1969, as amended, being section 24.302 of the Michigan Compiled Laws, and in accordance with general court rules, an appeal from the tribunal's decision shall be by right to the court of appeals. For purposes of the constitutional provision, the tribunal is the final agency for the administration of property tax laws.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. 1899 PA 154; MCL 211.146 et seq.; MSA 7.204 et seq.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. 1925 PA 155; MCL 209.152; MSA 7.621.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. 1927 PA 360; MCL 209.101; MSA 7.631.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. The decision in Emmet County v State Tax Comm, 397 Mich 550; 244 NW2d 909 (1976), does not dictate a different result. In Emmet County this Court held that the Tax Tribunal did not have jurisdiction to review decisions relating to intercounty equalization. The Court construed the term \"equalization\" in MCL 205.731; MSA 7.650(31) to refer only to intracounty equalization. This construction was based, in part, on the fact that the Legislature has never provided for administrative review of decisions relating to intercounty equalization. Also, granting the Tax Tribunal jurisdiction over these decisions would insert an additional level of review in the process, thereby endangering the commission's ability to function within the time limits established for the collection of taxes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eHowever, granting the tribunal jurisdiction to review special assessments does not create similar problems. It does not insert a new and additional level of review for such assessments. Rather, the Legislature only changed the forum in which this review is conducted. Actions which had been brought in the circuit court must now be brought before the Tax Tribunal. Furthermore, review of special assessments by the tribunal will not endanger the timely and orderly collection of taxes or present the risks indicated in Emmet County.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. See fn 16.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. See MCL 280.51; MSA 11.1051, MCL 280.130; MSA 11.1130, MCL 280.135; MSA 11.1135, MCL 280.151; MSA 11.1151, MCL 280.161; MSA 11.1161, MCL 280.197; MSA 11.1197, MCL 280.198; MSA 11.1198, MCL 280.244; MSA 11.1244, MCL 280.245; MSA 11.1245, MCL 280.263; MSA 11.1263, MCL 280.265-280.275; MSA 11.1265-11.1275. See MCL 280.262; MSA 11.1262, MCL 280.279; MSA 11.1279.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Plaintiffs also contend that the action brought in circuit court seeking injunctive and other relief was not an \"appeal\" under MCL 205.703(e); MSA 7.650(3)(e) but an original action. Although plaintiffs' complaints were not appeals in the narrow sense of the word, the word \"appeal\" in MCL 205.703(e); MSA 7.650(3)(e), was not intended to mean review by a judicial body of an action taken by another judicial body. The word is used in the sense that the tribunal is the forum in which all aggrieved taxpayers must file their complaints, see Newell v Kalamazoo Circuit Judge, 215 Mich 153; 183 NW 907 (1921), Slicho v New Orleans, 235 La 305, 312; 103 So 2d 454, 457 (1958).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. See MCL 205.735(1); MSA 7.650(35)(1).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. MCL 205.773; MSA 7.650(73) provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"When a matter is decided by a forum described in section 41 and the decision is appealed, and when, after the effective date of this act, the matter is remanded, the remand shall be to the tribunal for such action as the appellate court may direct.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. GCR 1963, 820.1(7) provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"The Court of Appeals may, at any time, in addition to its general powers, in its discretion and on such terms as it deems just:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(7) Give any judgment and make any order which ought to have been given or made, and make such other and further orders and grant such relief, as the case may require.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. L \u0026 C Development Co v Torch Lake Twp, 1 MTTR 91 (Docket No. 3665, May 20, 1975), Lake Geneva Associates, Ltd v Oakland County, 1 MTTR 95 (Docket No. 3799, May 15, 1975), Schimmel v Oakland County Tax Allocation Board, 1 MTTR 61 (Docket No. 3674, May 6, 1975); see, also, Sisbarro v City of Fenton, 90 Mich App 675; 282 NW2d 443 (1979).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. See MCL 104A.4; MSA 5.1854(4), \"An action of any kind shall not be instituted * * * unless * * * commenced within 90 days\";\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eMCL 205.59(6); MSA 7.530(6), \"The taxpayer shall not claim refund * * * after the expiration of 4 years\";\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eMCL 211.53; MSA 7.97 (until amended by 1976 PA 292), \"The person * * * may, within 30 days after such protest, sue\";\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eMCL 280.265; MSA 11.1265, \"No suit shall be instituted * * * unless brought within 30 days\";\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eMCL 600.5801-600.5809; MSA 27A.5801-27A.5809, \"No person may bring or maintain any action\", \"No person shall bring or maintain any action\", \"A person shall not bring or maintain an action\";\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eMCL 600.5813; MSA 27A.5813, \"All other personal actions shall be commenced within the period * * * and not afterwards\".\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. In addition to the statutes cited in fn 30, (supra) , see MCL 205.508; MSA 7.411(8); MSA 206.421(3); MSA 7.557(1421)(3).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. MCL 205.707; MSA 7.650(7) provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"The provisions of this act are effective notwithstanding the provisions of any statute, charter, or law to the contrary.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. The provisions of MCL 104A.4; MSA 5.1854(4) are directly applicable only to fourth-class cities, see MCL 81.1; MSA 5.1591, and MCL 81.1b; MSA 5.1591(2); but see MCL 81.1c; MSA 5.1591(3). However, MCL 81.1b; MSA 5.1591(2) authorizes home-rule cities to adopt the provisions of the act as part of their charters. The Charter of the City of Novi, § 11.4, provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"No action of any kind shall be instituted for the purpose of contesting or enjoining the collection of any special assessment, unless (a) within thirty (30) days after the confirmation of the special-assessment roll, written notice is given to the City Council indicating an intention to file such action and stating the grounds on which it is claimed such assessment is illegal; and unless (b) such action shall be commenced within sixty (60) days after the confirmation of the roll. If the City Attorney submits a written opinion finding said roll illegal, in whole or in part, the City Council shall revoke its confirmation, correct the illegality, if possible, and reconfirm the same. Property which is not involved in the illegality shall not be assessed more than was imposed upon the original confirmation without further notice and hearing thereon.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eCity of Novi Ordinance, No 69-01, § 26.01, provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Except and unless notice is given to the Council in writing of an intention to contest or enjoin the collection of any special assessment for the collection of any special assessment for the construction of any pavement, sewer or other public improvement, the construction of any sidewalk, or the removal or abatement of any public hazard or nuisance, within thirty (30) days after the date of the meeting of the Council at which it is finally determined to proceed with the making of the improvement in question, which notice shall state the grounds on which the proceedings are to be contested, no suit or action of any kind shall be instituted or maintained for the purpose of contesting or enjoining the collection of such special assessments; and regardless of whether or not any public improvement is completed in any special assessment district, no owner of real property located in such district shall be entitled to commence any suit or action for the purpose of contesting or enjoining the collection of any such special assessment after he has received the benefits from the substantial completion of that portion of such public improvement for which he is assessed, or unless such suit or action shall be commenced within sixty (60) days after confirmation of the roll.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. MCL 600.5856; MSA 27A.5856 provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"The statutes of limitations are tolled when\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(1) the complaint is filed and a copy of the summons and complaint are served on the defendant, or when\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(2) jurisdiction over the defendant is otherwise acquired, or when,\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(3) the complaint is filed and a copy of the summons and complaint in good faith, are placed in the hands of an officer for immediate service, but in this case the statute shall not be tolled longer than 90 days thereafter.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. See Elgammal v Macomb County Intermediate School Dist Board of Education, 83 Mich App 444; 268 NW2d 679 (1978), Kiluma v Wayne State University, 72 Mich App 446; 250 NW2d 81 (1976), Ralph Shrader, Inc v Ecclestone Chemical Co, 22 Mich App 213; 177 NW2d 241 (1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1 The plaintiffs first contested the special assessment in public hearings held by the Novi City Council. They asserted that the affected property owners would not be specially benefited by the proposed improvement and that its cost should be spread against the entire city.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe city treasurer notified the plaintiffs by letters dated May 14, 1976, that the city council had confirmed the special assessment on April 26, 1976. The letters also stated the amount of the special assessment apportioned to the addressee property owner and that the first installment would be reflected in the 1976 city tax bill.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe plaintiffs filed this action in circuit court on June 9, 1976, reiterating the objections raised at the public hearing. They asked that the special assessment be adJudged illegal and void, that their property be discharged of any liens, and that an injunction be entered restraining all efforts to assess and collect the special assessment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe defendants, Novi and its treasurer, contend that an appeal from a special assessment must be brought within 30 days (see fn 134) of confirmation of the assessment roll before the Tax Tribunal, and that plaintiffs' asserted error -- not noticed by defendants until the cause reached the Court of Appeals on appeal by the defendants from an adverse determination on the merits -- in bringing their appeal in the wrong forum bars any relief because the 30-day time limit has long ago expired.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2 The verdict of an advisory jury was that the paving of Taft Road did not confer additional benefit upon the property of the plaintiffs over and above that conferred upon the general public of Novi.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe circuit Judge entered the following findings of fact and Conclusions of law:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"I. Findings of Fact\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"1. That the improvements to Taft Road, the subject of this lawsuit, included widening the traveled portion of the road, paving the road, adding two eight-foot shoulders and large drainage ditches on both sides, and straightening both vertically and horizontally the road bed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"2. That these total improvements changed the character of this essentially rural road to that of a through road or a thoroughfare.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"3. That the improvements necessitated the removal of all trees, shrubbery and growth along both sides of said road.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"4. That the plaintiffs' abutting property owners, use of Taft Road approximated only five (5%) percent when measured against the impact on the road and use by the school district and the public at large.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"5. That the resident property owners of Taft Road sustained some detriment to their property caused by the improvements and those detriments included the following:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"A. Removal of all trees, approximately 60 in number;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"B. Removal of all screening vegetation;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"C. Loss of sound barrier and privacy from road;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"D. Loss of aesthetics;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"E. Expected increase in volume of traffic;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"F. Increase of the speed of vehicular traffic on the improved surface of Taft Road.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"6. That any benefit received by the plaintiffs in this case was so minimal as to be offset by the detriments. As a consequence this court finds that plaintiffs received no special benefits from the improvements to Taft Road over and above those enjoyed by the public at large.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"II. Conclusions of Law\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"1. That the road improvements to Taft Road between Ten Mile and Grand River in the City of Novi do not confer any special benefits on the abutting property owners over and above the benefits received by the public at large.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"2. That the special assessment roll numbers 32 and 33 by the city assessor of the City of Novi are invalid and void.\" (Emphasis supplied.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAlthough the finding of \"no special benefit\" is not relevant in deciding the construction of the Tax Tribunal Act, it might be relevant in deciding plaintiffs' claim that they can maintain an action in equity although the jurisdiction of the Tax Tribunal is \"exclusive\". See part IX, below.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3 The Court of Appeals said:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Our review of the record convinces us that the equities are on the side of the plaintiffs; nonetheless, it is well-settled that the parties may not confer by waiver, stipulation or otherwise, subject-matter jurisdiction where it does not exist.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe finding \"that the equities are on the side of the plaintiffs\" might, again, be relevant in deciding plaintiffs' equitable claim. See part IX, below.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4 This direction was rested on the authority of GCR 1963, 820.1(7):\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Rule 820. Miscellaneous Relief Obtainable in Court of Appeals.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\".1 Relief Obtainable. The Court of Appeals may, at any time, in addition to its general powers, in its discretion and on such terms as it deems just:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(7) Give any judgment and make any order which ought to have been given or made, and make such other and further orders and grant such relief, as the case may require.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5 MCL 205.735; MSA 7.650(35). See fn 134.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6 Ante, p 626.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7 \"The tribunal's exclusive and original jurisdiction shall be:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(a) A proceeding for direct review of a final decision, finding, ruling, determination, or order of an agency relating to assessment, valuation, rates, special assessments, allocation, or equalization, under property tax laws.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(b) A proceeding for refund or redetermination of a tax under the property tax laws.\" MCL 205.731; MSA 7.650(31).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA \"proceeding\" is defined as \"an appeal\", MCL 205.703(e); MSA 7.650(3)(e).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8 \"(1) Subject to section 28 of article 6 of the constitution of 1963, and pursuant to section 102 of Act No. 306 of the Public Acts of 1969, as amended, being section 24.302 of the Michigan Compiled Laws, and in accordance with general court rules, an appeal from the tribunal's decision shall be by right to the court of appeals. For purposes of the constitutional provision, the tribunal is the final agency for the administration of property tax laws.\" MCL 205.753(1); MSA 7.650(53)(1).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9 See fn 97 ff.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10 See fn 111.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11 See fns 81 and 118.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12 See fn 114.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13 The state has not provided a state administrative tribunal to review decisions of local units of government in regard to, for example, excise taxes, issuance and denial of licenses, and zoning, nor has it enacted an administrative procedures act with respect to the actions of local units of government.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14 See text accompanying and following fn 65.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15 See the opinion of the Court, fn 16, ante, p 637. See also fn 105.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16 At the time of the enactment of the Tax Tribunal Act, § 53 of The General Property Tax Act provided that any person may pay \"any tax or special assessment\" under protest and, within 30 days and not afterwards, commence an action for a refund. MCL 211.53; MSA 7.97. This provision fell into desuetude as to special assessments following this Court's decision in Knott v Flint, 363 Mich 483, 495; 109 NW2d 908 (1961), where four Justices said that the provision concerning actions for refund of special assessments violated the title-object clause of the constitution because the title of The General Property Tax Act related solely to the \"taxation of property\". See fn 59.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17 See fn 105 ff.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18 See fn 106 ff.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19 See fn 135.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20 See fn 126.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21 See text accompanying and following fn 65.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22 See text (subpart L) following fn 88.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23 See text (subpart B) accompanying and following fn 30.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24 See text (subpart D) accompanying and following fn 41.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25 See text (subpart B) accompanying and following fn 30.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26 See fns 69 and 117 and accompanying text.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27 See fn 7.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28 See fn 7.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29 Ante, p 631.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30 See fn 8.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31 \"All final decisions, findings, rulings and orders of any administrative officer or agency existing under the constitution or by law, which are judicial or quasi-judicial and affect private rights or licenses, shall be subject to direct review by the courts as provided by law. This review shall include, as a minimum, the determination whether such final decisions, findings, rulings and orders are authorized by law; and, in cases in which a hearing is required, whether the same are supported by competent, material and substantial evidence on the whole record. Findings of fact in workmen's compensation proceedings shall be conclusive in the absence of fraud unless otherwise provided by law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"In the absence of fraud, error of law or the adoption of wrong principles, no appeal may be taken to any court from any final agency provided for the administration of property tax laws from any decision relating to valuation or allocation.\" Const 1963, art 6, § 28. (Emphasis supplied.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32 \" Mr. Brake : * * *\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"What we said the other day, by a margin of 11 votes, was that after the taxpayer has gone to the board of review in his local community, then has gone to the state tax commission, and they have said how much his property is worth, that then he can always go to a court and have the Judge say: 'No, I don't think that value is right. I don't think this property is worth $10,000. I think it's worth $9,500.' That is just impossible if you're going to have a property tax law that will work. And that is all that we were trying to get at. Never, never in the world can we have a Judge substitute his opinion for the opinion of the assessors and have tax machinery that you can live with. Now, when there is a matter of bad faith, when there is a matter of fraud, an illegal tax, the remedy in the court is ready any time. You always can get in court on those things. All we're talking about is the matter of fixing the value upon which property is to be taxed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"If the assessment is illegal, you don't wait until you've gone through the state tax commission. You have a remedy immediately on an assessment that is illegal, in the circuit court of your own county. This is just a matter of the fixing of the value -- nothing else -- for the decision of the tax allocation board. I think our wording excludes everything else.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\" Mr. Allen : Mr. President, I would also dispute Mr. Hatch's point. I think he feels that somehow or other we're limiting, by this amendment, the right of appeal from the state tax commission that now exists. All we're trying to do in this is to say that on state tax commission matters we preserve all the rights that already exist but we are not going to go further and allow the court to substitute its judgment and become an assessor.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"We also are concerned about the question of time that is involved; in the inability of local units to spread their rolls where you first have the appeal to the state tax commission and then another appeal. The amendment is designed to protect all the existing rights, and I haven't heard complaints on appeals from the state tax commission. I don't think we have a problem there. We take nothing away, but we don't want to broaden it and we do broaden it far too much if we don't put the amendment in.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\" Mr. Thomson : Mr. President, fellow delegates, I believe that Delegate Hatch approached this from a theoretical rather than a practical standpoint. With 12 years' experience as an assessing officer and 20 years' experience as a member of an allocation board, we have enough delay when we have to fool around with the state tax commission; so I don't think that we possibly could get by if it had to be a continuation in the courts. I urge you to vote for the amendment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\" Mr. Buback : Mr. President and fellow delegates, I strongly urge you to approve this amendment. I've been asked to make a little statement here and I think it's worthwhile for the record.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Section 28 of article VI, which in its entirety is statutory language which does not belong in the constitution, most certainly should at least be amended to include an exception for appeals from the proceedings of the state tax commission except in the case of fraud or illegality of assessment. The findings of fact of the state tax commission are normally highly technical determinations of valuations for either assessment or equalization purposes. They should not be disturbed except in the case of fraud. No evidence has been given to demonstrate any abuse of this power on the part of the tax commission and therefore this constitution should not contain a restrictive provision which will result in costly delays in the proceedings for the assessment and collection of property taxes to the detriment of all local units of government. The property tax is and will remain the single most important revenue source for such local units, and unless appeals on matters of assessment and equalization can be handled in an expeditious manner, the furnishing of local services will be interfered with and our citizens will suffer. To open up full review of determination of facts on assessments and equalization will only serve to establish the supreme court of Michigan as a super assessor and will result in disturbing the uniform application of assessing principles by the state tax commission. I strongly urge the adoption of this amendment.\" 2 Official Record, Constitutional Convention 1961, pp 3240-3243.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33 \"No appeal may be taken to any court from a decision of the state tax commission fixing the value of described property for property tax purposes or determining an appeal from a decision of the county tax allocation board.\" 2 Official Record, Constitutional Convention 1961, p 3240.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34 2 Official Record, Constitutional Convention 1961, pp 3291-3293.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35 Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. This becomes even more clear when one considers the language chosen by the committee on style and drafting to express the intention of the delegates to make an exception for decisions of the State Tax Commission fixing the value of property for property tax purposes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe enabling act which created the State Tax Commission provides that it \"shall have general supervision of the administration of the tax laws of the state \". 1927 PA 360; MCL 209.104; MSA 7.634. (Emphasis supplied.) The Department of Revenue was created (1941 PA 122; MCL 205.1; MSA 7.657[1]) to administer the subsequently enacted sales, intangible, and other state taxes and, hence, the need to add \"property\" before \"tax laws\" in the constitution to refer accurately to the State Tax Commission and its functions. See fn 70.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe language quoted from 1927 PA 360 repeats language which first appeared in an act adopted two years earlier (1925 PA 155; MCL 209.152 and 209,153; MSA 7.621 and 7.622) creating a State Tax Department to which was transferred the powers and duties of the Board of State Tax Commissioners which was created by an amendment (1899 PA 154) to The General Property Tax Act of 1893.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe provisions added in 1899, creating the Board of State Tax Commissioners and providing for appeals thereto by those aggrieved by property tax assessments, have remained a part of The General Property Tax Act (see MCL 211.146-211.154; MSA 7.204-7.211) although, as a result of the Tax Tribunal Act, the reviewing functions of the State Tax Commission have been transferred to the Tax Tribunal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe General Property Tax Act was amended in 1969 to exempt the proceedings of the State Tax Commission from the contested case provisions of the Administrative Procedures Act and to provide that \"in its determination, article VI, section 28, of the constitution of the state of Michigan shall apply\". 1969 PA 270; MCL 211.152(3); MSA 7.210(3).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. See fns 7, 8, and 31.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. Ante, p 639.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. Ante, p 640. A similar argument is made in respect to the word \"collection\". Ante, p 642.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. The opinion of the Court declares:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"However, special assessments levied against property owners for public improvements to realty which especially benefit their property are special assessments under the property tax laws for the purposes of the Tax Tribunal Act.\" Ante, p 636.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe opinion of the Court also declares:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\" phrase [\"property tax laws\"] distinguishes special assessments that are under the taxing power and that relate to real property from other types of special assessments\". Ante, p 640.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. The following provisions of the Tax Tribunal Act, for example, could not be applied to special assessments:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Sec. 35. (1) * * * In the case of an assessment dispute as to the valuation of the property or where an exemption is claimed, the assessment must be protested before the board of review before the tribunal may acquire jurisdiction of the dispute, except that for the 1976 tax year only in a county whose state equalized valuation set by the state tax commission exceeds its assessed valuation and its equalized valuation set by the county board of commissioners for that year by at least 10%, a taxpayer may appeal directly to the tax tribunal.\" MCL 205.735(1); MSA 7.650(35)(1). (Emphasis supplied.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Sec. 37. (1) In arriving at its determination of a lawful property assessment, the tribunal shall determine the amount by multiplying its finding of true cash value by a percentage equal to the ratio of the average level of assessment in relation to true cash values in the assessment district.\" MCL 205.737(1); MSA 7.650(37)(1). (Emphasis supplied.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThere is no reference to payment of \"special assessments\", only to payment of \"taxes\". See MCL 205.743(1); MSA 7.650(43)(1). This provision, by its terms as amended by 1976 PA 365, would not apply to a special assessment. See MCL 205.743(2); MSA 7.650(43)(2).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThere is no provision of the Tax Tribunal Act which would be applicable only to special assessments.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. See fns 7 and 8.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. See MCL 205.734; MSA 7.650(34); MCL 205.735; MSA 7.650(35); MCL 205.737; MSA 7.650(37); MCL 205.743; MSA 7.650(43).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. Ante, p 633.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. The opinion of the Court refers to this Court's opinion in Motz v Detroit, 18 Mich 495 (1869); MCL 103.4; MSA 5.1823 and Dukesherer Farms, Inc v Director of Dep't of Agriculture (After Remand), 405 Mich 1, 14, 23; 273 NW2d 877 (1979).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eMotz was one of the Detroit Paving Cases. Three opinions were filed by the four Justices; the opinion of the Court in the instant case does not state what portion of which opinion in Motz is relied on and for what. The Detroit Paving Cases are adverted to further in fn 55 and accompanying text.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe statutory reference concerns the power of the city to cause the construction of sidewalks and to assess the cost to the abutting property owner as a special assessment; the opinion of the court does not state how such a special assessment differs from the special assessment involved in the Detroit Paving Cases, on which it relies, or the special assessment for the improvement of Taft Road involved in the instant case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eDukesherer Farms dealt with the question \"whether the 'assessments' authorized by the Agricultural Commodities Marketing Act constitute 'taxes' subject to constitutional limitations and restrictions and therefore represent an unconstitutional delegation of the taxing power to producers of agricultural commodities in violation of the Michigan Constitution\". The Court concluded that the levy was \"an assessment and not a tax\", and thus there was no unconstitutional delegation of the \"taxing power\" of this state.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe constitutional question (is this governmentally authorized exactment a tax?) presented in Dukesherer Farms is not the question here. We are confronted rather with a constructional question under the Tax Tribunal Act. The opinion of the Court argues that a special assessment levied by a home-rule city is a tax levied under the \"taxing power\". See fn 55 and accompanying text. Dukesherer Farms stands for the proposition that the levy or assessment there involved was not a \"tax \". The levy or assessment involved in Dukesherer Farms not being a \"tax\", a decision appealing from such a levy or assessment would not, in either the construction of \"property tax laws\" discernible from the opinion of the Court or the construction which we believe to be correct, be within the jurisdiction of the Tax Tribunal. (The reasoning of the Court would not include within \"property tax laws\" a non-governmental exaction authorized or required by government [the levy or assessment in Dukesherer Farms or, for example, compulsory insurance programs], and implicit in the construction of \"property tax laws\" which we believe to be correct is that the term includes only a governmental exaction.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. See fn 7.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. See Dukesherer Farms, Inc v Director of Dep't of Agriculture (After Remand), 405 Mich 1, 14, 23; 273 NW2d 877 (1979), (supra) , discussed in fn 45.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. Poll and capitation taxes are no longer exacted.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. The corporation franchise, intangibles (fn 50) and use taxes (fn 51) are taxes on property. Like the ad valorem property tax, they are based on a measure of the value of the property.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe franchise tax is based on \"paid-up capital and surplus\"; the latter is defined as the \"net value of the corporation's property, less its outstanding indebtedness and paid-up capital\". 1921 PA 85, § 4 (formerly MCL 450.304; MSA 21.205), repealed by 1975 PA 230, which transferred certain pending and future appeals to the Tax Tribunal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. The intangibles tax on non-income-producing intangible personal property is based on \"face or par value\", which is also the minimum tax on income-producing intangible personal property. The intangibles tax on banks and savings and loan associations is based on the \"face value\" of deposits in banks and the \"paid-in value of the share\" in a savings and loan association. MCL 205.132; MSA 7.556(2).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. The use tax is based on the \"price\". MCL 205.93; MSA 7.555(3).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe measure of value for the use tax (price) is close to the ad valorem property tax measure of value (true cash value [Const 1963, art 9, § 3] and \"usual selling price\" MCL 211.27; MSA 7.27).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe \"face value\" of bank deposits and the \"paid-in value\" of savings and loan shares (see fn 50) is also close to true cash value or usual selling price, as would be the \"net value\" of a corporation's property (see fn 49). Those measures of value may, indeed, be closer than the amount of a special assessment levy based on \"benefit\" conferred which need not be solely related to the \"enhanced value\" of the property specially benefited. Foren v Royal Oak, 342 Mich 451, 456; 70 NW2d 692 (1955).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe franchise (fn 49) and intangibles taxes (fn 50) are, like the ad valorem property tax, annual taxes. The use tax, like a special assessment, is levied in respect to tangible property and is levied once.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. See fn 69.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. The United States Constitution provides: \"No Capitation, or other direct, Tax shall be laid, unless in Proportion to the Census or Enumeration herein before directed to be taken.\" Art I, § 9.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eOn rehearing, the Court reached the same Conclusion. The opinions are quite lengthy, extending over 100 pages, and for that reason we will simply quote the in 39 L Ed 1108:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"1. Taxes on real estate being indisputably direct taxes, taxes on the rents or income of real estate are equally direct taxes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"2. Taxes on personal property, or on the income of personal property, are likewise direct taxes.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. Ante, p 640.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. Justice Campbell wrote:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"The first question that arises is, under what division of powers is this exercise of authority to be classed? It was held by the former Supreme Court, in Williams v Mayor of Detroit, 2 Mich 560 [1853], that these expenditures and charges could only be justified under the taxing power, as the imposition of burdens for public purposes. Such is the course of modern decisions; and if it be not an exercise of the taxing power, it is not easy to find any basis for it to rest upon.\" Justice Christiancy wrote a separate opinion. Woodbridge v Detroit, 8 Mich 274, 289 (1860).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eJustice Manning disagreed and said:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Taxes for purely local public improvements, like the one before us, more generally called assessments, are not mentioned in the constitution, nor is it necessary they should be to give the legislature power over them. The power to impose and collect such taxes, like all other legislative powers not mentioned in the constitution, is plenary, and in the exercise of it is subject to legislative discretion only.\" Chief Justice Martin concurred in Justice Manning's opinion. Id., 281.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. See Moore v Harrison, 224 Mich 512; 195 NW 306 (1923). See also Cilley v Sullivan, 187 Mich 447; 153 NW 773 (1915); Attorney General ex rel Alexander v McClear, 146 Mich 45; 109 NW 27 (1906); Kinnie v Bare, 68 Mich 625; 36 NW 672 (1888).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57. While a special assessment is a governmental exaction and is in that sense a tax, it is no longer denominated a tax for the purposes of the 15-mill limitation and most other purposes (see fn 59).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58. Graham is discussed and the constitutional provision there construed is set forth in fn 59. The 1963 Constitution, art 9, § 6, eliminates the constructional issue posed and resolved in Graham by adding the words \" ad valorem \" thereby embodying the Graham construction of the words \"tax\" and \"assessed against property\". Graham continues to stand for the proposition that a special assessment is not a \"tax assessed against property\".\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59. This Court has held that provisions of the constitution and of The General Property Tax Act concerning \"property taxes\" do not apply to special assessments because they are not taxes. This Court has said:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"There is a clear distinction between what are termed general taxes and special assessments. The former are burdens imposed generally upon property owners for governmental purposes without regard to any special benefit which will inure to the taxpayer. The latter are sustained upon the theory that the value of the property in the special assessment district is enhanced by the improvement for which the assessment is made.\" In re Petition of Auditor General, 226 Mich 170, 173; 197 NW 552 (1924). Similarly, see Graham v Saginaw, 317 Mich 427, 431-433; 27 NW2d 42 (1947); see also cases cited in In re Petition of Auditor General, 226 Mich 170, 173-174; 197 NW 552 (1924); 2 Cooley, Taxation (3d ed), p 1153.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIllustrative of the distinction between special assessments and property taxes are decisions of this Court holding that\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e-- an exemption from \"property taxes\" does not provide an exemption from special assessments, see Lake Shore \u0026 M S R Co v Grand Rapids, 102 Mich 374; 60 NW 767 (1894); In re Petition of Auditor General, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e-- the 15-mill limitation on the amount of taxes that may be assessed against \"property\" (\"The total amount of taxes assessed against property for all purposes in any one year shall not exceed one and one-half percent of the assessed valuation of said property\". Const 1908, art 10, § 21; similarly, see Const 1963, art 9, § 6.) does not apply to special assessments, see Graham v Saginaw, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e-- a statute providing that \" injunction shall issue to stay proceedings for the assessment or collection of taxes under [The General Property Tax Act]\" (1929 CL 3507; now MCL 211.114; MSA 7.168) is inapplicable to special assessments because special assessments are not levied under The General Property Tax Act, see Forest Hill Cemetery Co v Ann Arbor, 303 Mich 56, 67; 5 NW2d 564 (1942); and\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e-- a term in a lease requiring the lessee to pay \"all taxes\" did not embrace special assessments because the general understanding of the meaning of the word \"taxes\" does not include special assessments, see Blake v Metropolitan Chain Stores, 247 Mich 73; 225 NW 587 (1929); the lease required the payment of \"all taxes, ordinary as well as extraordinary, of every kind that may be levied upon or assessed against said premises\".\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIndeed, special assessments were found so dissimilar to property taxes that an amendment to The General Property Tax Act to add a provision concerning actions for refund of special assessments (1941 PA 234 amending § 53; MCL 211.53; MSA 7.97) was thought by four of eight Justices (before the number was reduced to seven) to violate the title-object clause of the constitution (Const 1908, art 5, § 21; currently Const 1963, art 4, § 24) because the title of the act \"related solely to the taxation of property and the procedure to be followed with reference thereto\". Knott v Flint, 363 Mich 483, 495; 109 NW2d 908 (1961). (Emphasis supplied.) Flint had contended that a law action for refund was an adequate remedy. The other four Justices, three without Discussion of § 53, agreed with the lead opinion (signed by four) that an equitable action could be maintained and that the proofs supported the decree finding no special benefit.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e60. See fn 33 and accompanying text.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e61. Section 265 of the Drain Code provides that \"drain taxes assessed under the provisions of this act shall be subject to the same interest and charges, and shall be collected in the same manner as state and other general taxes are collected, and collecting officers are hereby vested with the same power and authority in the collection of such taxes as are or may be conferred by law for collecting general taxes\". MCL 280.265; MSA 11.1265.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThis might provide a statutory basis for State Tax Commission and Tax Tribunal review of the collection of drain taxes. But see Hillyer v Jonesfield Twp, 114 Mich 644, 646; 72 NW 619 (1897), holding that succeeding language of this section of the Drain Code \"'if such tax shall be paid under protest, the reasons therefor shall be specified, and the same procedure observed as is or may be required by the general tax law,' should be construed as having reference to the protest and the action of the officer to whom the money is paid, and not as intended to give a right of action against the township\".\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSome statutes provide for levies which, although denominated \"special assessments\", are not truly special assessments but rather are ad valorem property taxes because they are to be spread, like an ad valorem tax, not on the basis of special benefit but ad valorem against all real property within the local unit of government making the assessment. Although denominated a special assessment, such a levy is a tax and is subject to constitutional and other limitations applicable to taxes:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\" assessment levied against all real property within a local unit of government which does not confer a special benefit on the property assessed is a tax, notwithstanding the fact that it is denominated by statute as a special assessment. In OAG, 1979-1980, No 5706, p 770 (May 13, 1980), it was determined that a so-called special assessment against all of the property within a municipality to finance a municipal ambulance service would be, in effect, a general tax subject to the voter approval requirements of Const 1963, art 9, §§ 6 and 31. The reason for the Conclusion was that a municipal-wide levy for such a purpose is not a special assessment since it would be for the benefit of all of the residents thereof and would confer no special benefit on the property assessed.\" OAG, 1981, No 6018 (December 22, 1981).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWhile the Drain Code provides that \" apportionments of benefits under the provisions of this act shall be upon the principle of benefits derived\", MCL 280.152; MSA 11.1152, it permits a levy of an entire municipality's share of a special assessment against the municipality, MCL 280.151; MSA 11.1151, which must then levy the same amount against all individual property owners in the municipality ad valorem, MCL 280.263; MSA 11.1263. Such a levy, ad valorem, is not a special assessment, OAG, 1943-1944, No O-2042, p 693 (March 30, 1944).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSince such a levy is made ad valorem, the language of the Drain Code authorizing the municipality to make the levy might, for purposes of the Tax Tribunal Act, be a provision of law authorizing an ad valorem tax on property and, hence, the Drain Code might pro tanto be a property tax law although other provisions of the Drain Code, authorizing assessments on the basis of benefit conferred -- true special assessments -- are not property tax laws.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e62. Ante, p 635.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e63. Ante, p 639.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e64. See fn 69.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e65. The Tax Tribunal and its predecessors (the State Tax Commission, 1927 PA 360; MCL 209.101; MSA 7.631; the State Tax Department, 1925 PA 155; MCL 209.152; MSA 7.621; the Board of State Tax Commissioners, 1899 PA 154; 1915 CL 4144 et seq.; the State Board of Tax Appeals, 1941 PA 122; MCL 205.9 et seq.; MSA 7.657[9] et seq.; also the State Board of Tax Administration and certain functions of the Auditor General and the Secretary of State, see 1945 PA 103; MCL 205.13; MSA 7.657[13]; and the State Board of Equalization, 1911 PA 44; MCL 209.1; MSA 7.601) were constituted to provide a means for the administration of, and for review of decisions relating to, state taxes and not local taxes or assessments.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e66. After the 15-mill limitation was added to the constitution in 1932 and the Property Tax Limitation Act was enacted in 1933, the state ceased to receive a share of the tax revenues generated by the local assessment process.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSee 1933 PA, p 517 for the text of Const 1908, art 10, § 21, adding the 15-mill limitation; now Const 1963, art 9, § 6. See 1933 PA 62; MCL 211.201-211.217; MSA 7.61-7.77, for the Property Tax Limitation Act. See Stason, The Fifteen Mill Tax Amendment and Its Effect, 31 Mich L Rev 371 (1933).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e67. When the Board of State Tax Commissioners was created and empowered in 1899 to revise the assessment of property, the constitutionality of the enabling act was challenged on the ground that it interfered with local self-government. In rejecting that challenge, this Court said:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"It was not distinctively a matter of local concern. The State is concerned in the proper assessment of property, not only as to its own interests as they are affected by the collection or failure to collect the funds necessary to carry on government, but, as the supreme authority in the State, the legislature is required by section 12, art 14, of the Constitution, to see to it that assessments be made on property at its real value.\" Board of State Tax Comm'rs v Grand Rapids Board of Assessors, 124 Mich 491, 496; 83 NW 209 (1900).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAn earlier state involvement was the creation of the State Board of Equalization in 1851. See 1851 PA 106; 1905 PA 248 (repealed as obsolete by 1915 PA 240); 1911 PA 44; MCL 209.1 et seq.; MSA 7.601 et seq.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIt was essential that the state supervise the administration of the real and personal property tax laws lest underassessment or other mal-administration at the local level reduce the amount of state revenues or result in a significant departure between one township, city or county and another in the level of taxation or other variance inconsistent with the basic constitutional principle of uniformity of taxation. See Const 1908, art 10, §§ 3-8; Const 1850, art 14, §§ 11-13; Const 1963, art 9, § 3.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e68. See the State School Aid Act of 1977, 1977 PA 90; MCL 388.1401 et seq.; MSA 15.1919(701) et seq., concerning the allocation of the state school aid fund.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe State Revenue Sharing Act of 1971, 1971 PA 140; MCL 141.901 et seq.; MSA 5.3194(401) et seq., provides larger payments to those local units of government which make a greater tax effort. MCL 141.913; MSA 5.3194(413); MCL 141.905; MSA 5.3194(405). The strength of a local tax effort is gauged by the tax revenue (ad valorem, income and excise) MCL 141.904(3); MSA 5.3194(404)(3), derived in relation to the state equalized value, MCL 141.905(1); MSA 5.3194(405)(1). Absent supervision at the state level, communities might have an incentive to reduce valuations and resulting assessments not only to reduce the community's share of the county tax bill but also to increase revenue sharing entitlements. While the amounts derived from special assessments are treated as part of the tax effort under an alternative formula which can increase but not reduce the amount of revenue sharing, MCL 141.914; MSA 5.3194(414), MCL 141.906; MSA 5.3194(406), since the amount derived is a fact rather than a concept or a formula, MCL 141.904(5); MSA 5.3194(404)(5), it may not be subject to manipulation and has not heretofore been made a matter of state supervision.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e69. When the Tax Tribunal Act was drafted, the jurisdictional statement, § 31, was confined to taxes and assessments under property tax laws. Almost as an afterthought, it was provided, in concluding § 79, that any person who formerly could proceed before \"the board of tax appeals, the corporation tax appeal board, any quasi-judicial body, the court of claims, probate court, district court, municipal court, common pleas court, or circuit court of this state for determination of a matter subject to the tribunal's jurisdiction, as provided in this section, shall proceed only before the tribunal\". (Emphasis supplied.) But there was nary a word in § 79 regarding the § 79 jurisdiction of the tribunal. 1973 PA 186, § 79, subd 2; MCL 205.779(2); MSA 7.650(79)(2).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe Legislature clarified its meaning in 1976 when it amended § 79 to provide that cases formerly appealable to any such body or court for determination of a matter relating to the state income tax, the intangibles tax, the inheritance tax, the franchise fee, the general sales tax, the use tax, the gasoline tax, the cigarette tax, or oil and gas severance tax, \"shall proceed only before the tribunal\". 1976 PA 37; MCL 205.779(2); MSA 7.650(79)(2). Significantly, all the statutes referred to concerned state taxes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe Attorney General ruled that the 1976 amendment was violative of Const 1963, art 4, § 25, prohibiting amendment by reference to the title only and requiring re-enactment and publication at length. OAG, 1975-1976, No 5138, p 704 (December 10, 1976). But see Midland Twp v State Boundary Comm, 401 Mich 641, 656-663; 259 NW2d 326 (1977).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe Legislature tried once again in 1980, providing that a person aggrieved by a decision of the revenue division may appeal the contested portion to the Tax Tribunal or the Court of Claims after payment of the uncontested portion, except that in an appeal to the Court of Claims the appellant \"shall first pay the tax\". 1980 PA 162; MCL 205.22; MSA 7.657(22). Also in 1980, the Legislature repealed the provisions of the income tax act, 1980 PA 169, repealing MCL 206.421; MSA 7.557(1421); the General Sales Tax Act, 1980 PA 164, repealing MCL 205.72; MSA 7.543; the intangibles tax act, 1980 PA 168, repealing MCL 205.143; MSA 7.556(13); and the cigarette tax act, 1980 PA 167, amending MCL 205.508; MSA 7.411(8) -- all state taxes -- theretofore providing for judicial review in the circuit court, thereby underscoring its intention to direct all appeals regarding such state taxes to the Tax Tribunal or the Court of Claims.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe Corporation Franchise Fee Appeal Board was abolished by 1975 PA 230, which also transferred that board's jurisdiction to the Tax Tribunal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e70. With the demise of the state property tax, the state sought other means of revenue, and the sales tax was enacted in 1933 (1933 PA 167; MCL 205.51; MSA 7.521), and a succession of other taxes: the use tax (1937 PA 94; MCL 205.91; MSA 7.555[1]), the intangibles personal property tax (1939 PA 301; MCL 205.131; MSA 7.556[1]), the cigarette tax (1947 PA 265; MCL 205.501; MSA 7.411[1]), and the income tax (1953 PA 150; MCL 205.551 et seq.; MSA 7.557[1] et seq., now 1967 PA 281; MCL 206.1 et seq.; MSA 7.557[101] et seq.).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWith the advent of these taxes, new agencies were created to administer them -- the State Board of Tax Administration, for the sales and use taxes, and the Department of Revenue (now the Revenue Division of the Department of Treasury) to which was transferred all, or substantially all administrative functions in regard to state taxes, with the exception of real and personal property taxes, which continue to be administered by the State Tax Commission and the State Board of Equalization. See MCL 205.13; MSA 7.657(13). As a result, the State Tax Commission ceased to be charged with the administration of \"all the tax laws of this state\". See fn 36.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e71. While the Legislature conferred on the State Commissioner of Revenue, under this act and the one referred to in the next footnote, the power to provide by rule and decision a measure of uniformity in the administration of the uniform city income tax and the uniform city utility users tax ordinances, it did not confer general supervisory powers upon the commissioner. See MCL 141.693; MSA 5.3194(103).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eTo be sure, it did thereby provide for an administrative appeal at the state level. But it did so in respect to a tax levied pursuant to a uniform ordinance potentially having statewide effect. A city income tax is not purely local -- it affects non-residents. The City of Novi levied the special assessments disputed here pursuant to an ordinance drafted by the city fathers or their legal counsel; the provisions of city charters and ordinances on special assessments are not uniform and do not potentially have statewide effect.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe administrative appeal under those uniform acts is not final and does not limit the extent of judicial review; the statutes provide that a person or city aggrieved by a decision of the State Commissioner of Revenue may bring an action in the circuit court \"to obtain a judicial determination of the matter\". MCL 141.694; MSA 5.3194(104), MCL 141.835; MSA 5.3194(335).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe State Commissioner of Revenue was not named in § 79 of the Tax Tribunal Act as originally enacted or as amended. The city income and utility users taxes are not named in § 79 as amended in 1976. See fn 69. Thus, no appeal can be taken to the Tax Tribunal from a decision of the State Commissioner of Revenue in respect to the city income and utility users taxes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e72. See MCL 141.834; MSA 5.3194(334).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e73. The Legislature did not, in 1980 (see fn 69) or at some other time, eliminate the provisions of the City Income Tax Act, MCL 141.694; MSA 5.3194(104), and the City Utility Users Tax Act, MCL 141.835; MSA 5.3194(335), providing for circuit court review.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e74. See MCL 141.851 et seq.; MSA 5.3194(361) et seq.; MCL 141.861 et seq.; MSA 5.3194(371) et seq.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e75. Ante, p 642.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e76. The opinion of the Court, in stating that the \"proliferation of these available remedies created problems of forum shopping and increased the possibility of inconsistent decisions\", ante, p 628, ignores that there was only one means of challenging a special assessment and that was an action in the circuit court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eTo be sure, the statute provided for a refund action in the circuit court. It is, however, of no importance for present purposes whether this statutory provision was or was not constitutional (see fns 16 and 59); whether it was valid or not, the only forum in which a property owner could proceed was the circuit court, and he had only one cause of action, whether at law (for a refund) or in equity (for an injunction) or both. There was no proliferation of remedy respecting challenges to special assessment levies or problem of forum shopping or possibility of inconsistent decisions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e77. Ante, p 629.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e78. Ante, p 642.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e79. Const 1963, art 9, § 3.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e80. See 5 Callaghan's Michigan Civil Jurisprudence, Constitutional Law, § 212, p 414.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e81. See Johnson v Inkster, 401 Mich 263; 258 NW2d 24 (1977); Brill v Grand Rapids, 383 Mich 216; 174 NW2d 832 (1970); Blades v Genesee County Drain Dist No 2, 375 Mich 683; 135 NW2d 420 (1965); Smith v Garden City, 372 Mich 189; 125 NW2d 269 (1963); Knott v Flint, supra, fn 60; Fluckey v Plymouth, 358 Mich 447; 100 NW2d 486 (1960); Foren v Royal Oak, 342 Mich 451; 70 NW2d 692 (1955); Graham v Saginaw, supra, fn 60; Forest Hill Cemetery Co v Ann Arbor, supra, fn 60; Campbell v Plymouth, 293 Mich 84; 291 NW 231 (1940); Cleveland v Detroit, 276 Mich 443; 267 NW 874 (1936); Sumner v Detroit, 275 Mich 689; 267 NW 769 (1936); Marqua v Detroit, 268 Mich 380; 256 NW 455 (1934); Long v Monroe, 265 Mich 425; 251 NW 582 (1933); Lambrecht v Detroit, 264 Mich 577; 250 NW 315 (1933); Emmons v Detroit, 255 Mich 558; 238 NW 188 (1931), (On Rehearing) 261 Mich 455; 246 NW 179 (1933); Barris v Detroit, 260 Mich 622; 245 NW 790 (1932); Linski v Detroit, 260 Mich 385; 244 NW 483 (1932); Campbell v Detroit, 259 Mich 297; 243 NW 11 (1932); Alexander v Detroit, 259 Mich 241; 242 NW 902 (1932); Houseman v Detroit, 257 Mich 557; 241 NW 820 (1932); Frischkorn Investment Co v Detroit, 257 Mich 546; 241 NW 903 (1932); Meyer v Detroit, 257 Mich 361; 241 NW 264 (1932); Rood v Detroit, 256 Mich 547; 240 NW 41 (1932); Theisen v Detroit, 254 Mich 338; 237 NW 46 (1931); Oprisiu v Detroit, 248 Mich 590; 227 NW 714 (1929); Panfil v Detroit, 246 Mich 149; 224 NW 616 (1929); Coburn v Wyandotte, 245 Mich 314; 222 NW 729 (1929); Doherty v Detroit, 244 Mich 660; 222 NW 177 (1928); Miller v Detroit, 244 Mich 38; 221 NW 292 (1928); MacLachlan v Detroit, 208 Mich 188; 175 NW 445 (1919). See fns 13 and 60.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e82. 1974 PA 4.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e83. 1974 PA 345.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e84. As to villages:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"An action may not be instituted for the purpose of contesting or enjoining the collection of a special assessment unless: (a) Within 45 days after the confirmation of the special assessment roll, written notice is given to the council indicating an intention to file such an action and stating the grounds on which it is claimed that the assessment is illegal; and (b) the action is commenced within 90 days after the confirmation of the roll.\" MCL 68.34; MSA 5.1370(4).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAs to fourth-class cities:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"An action of any kind shall not be instituted for the purpose of contesting or enjoining the collection of any special assessment unless, within 45 days after the confirmation of the special assessment roll, written notice is given to the council indicating an intention to file such an action and stating the grounds on which it is claimed that the assessment is illegal and unless that action is commenced within 90 days after the confirmation of the roll. If a portion of an assessment roll is determined to be illegal, in whole or in part, the council may revoke its confirmation, correct the illegality, if possible, and reconfirm it. Property which is not involved in the illegality shall not be assessed more than was imposed upon the original confirmation without further notice and hearing thereon.\" MCL 104A.4; MSA 5.1854(4).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e85. 1948 CL 68.13; MSA 5.1361.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e86. 1948 CL 104.22; MSA 5.1846.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e87. See, e.g., provisions cited in fn 96 ff.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e88. Further evidence that the Legislature was thinking of state statutes and state taxes, not local taxes and special assessments levied under ordinances prescribing their own procedures, is the differential between the times prescribed by Novi's ordinances for the commencement of legal proceedings and the time prescribed by the Tax Tribunal Act.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eNovi's special assessment ordinance does not require that notice be given of the rejection of a protest or of confirmation of a special assessment roll. It provides only that legal action must be commenced within 60 days of confirmation. Novi Ordinance No 69-01, § 26.01, May 20, 1969. A more recent ordinance, adopted after the enactment of the Tax Tribunal Act, extended the time period to 90 days. Novi Ordinance No 78-1.02, § 23, April 3, 1978. In the instant case, letters dated 18 days after confirmation were sent to property owners.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe Legislature, in providing in the Tax Tribunal Act that proceedings shall be commenced within 30 days after the final decision, ruling, determination or order, MCL 205.735; MSA 7.650(35), no doubt contemplated that the aggrieved party would be notified of an adverse decision, ruling, determination or order and have a full 30 days within which to appeal. See MCL 205.22; MSA 7.657(22) regarding state taxes now subject to the tribunal's jurisdiction; and 1921 PA 85, § 9, formerly MCL 450.309; MSA 21.210, repealed by 1975 PA 230, concerning the corporation franchise tax appeals board.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e89. After Emmet County v State Tax Comm, 397 Mich 550; 244 NW2d 909 (1976) was decided, the Legislature, by amendment of the Department of Revenue Act (see fn 69), transferred to the Tax Tribunal jurisdiction of matters formerly appealable to the Board of Tax Appeals.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn all events, each grant of jurisdiction to the Tax Tribunal has been of matters formerly administratively appealable. A challenge to the levy of a special assessment has never been administratively appealable.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e90. Ante, p 641, fn 22.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e91. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e92. The Courts narrowly limited the scope of the inquiry. See fn 129 ff and accompanying text.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e93. The opinion of the Court characterizes the argument of this opinion:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Essentially, the argument is that the Legislature made a mistake.\" Ante, p 626.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e94. Ante, p 637, fn 16. See text accompanying fn 16.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e95. Ante, p 637.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e96. MCL 211.1 et seq.; MSA 7.1 et seq.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e97. MCL 123.751-123.763; MSA 5.570(21)-5.570(33).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e98. MCL 117.4d(1); MSA 5.2077(1).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWhile the home rule act does contain provisions concerning ad valorem property taxation, special assessments are not levied \"under\" those provisions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe home rule act requires that the charter of a city provide for \"annually laying and collecting taxes in a sum, except as otherwise provided by law, not to exceed 2% of the assessed value of the real and personal property in the city\", MCL 117.3(g); MSA 5.2073(g), and for the times of preparation of the assessment roll, the meeting of the board of review and confirmation of the assessment roll, MCL 117.3(i); MSA 5.2073(i). The act also provides a means (vote of the people) for increasing the rate of taxation \"now fixed by law\", MCL 117.5; MSA 5.2084.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe decision levying this special assessment was not, however, made \"under\" those provisions of the home rule act but rather under separate provisions of that act and Novi's charter and ordinance concerning special assessments, MCL 117.4d; MSA 5.2077.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAllowing that the provisions of the home rule act referred to above (§§ 3, 3 and 5) are property tax laws, and putting aside the question whether a charter or ordinance is a \"law\", this special assessment was not made under a provision of law concerning ad valorem property taxes and thus was not made under property tax laws.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eTo say that the entire home rule act, all its provisions, are property tax laws because it contains provisions regarding the rate of ad valorem property taxation, requiring a city charter to provide therefor and for the times of certain acts in the assessment process, would manifestly be an incorrect characterization.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIf the home rule act -- the entire act, all its provisions -- is a property tax law because of the provisions requiring the city charter to establish a rate of ad valorem taxation and the times of certain acts in the assessment process, then the home rule act and all its provisions -- whatever they in fact concern -- would by like token be an election law, a public utility law, a rapid transit law, a zoning law and a civil service law. (The home rule act authorizes a home-rule city to provide \"for the time, manner and means of holding elections and the registration of electors\", MCL 117.3; MSA 5.2073, for the purchase, construction and operation of \"public utilities for supplying water, light, heat, power, and transportation to the municipality and the inhabitants thereof\", MCL 117.4f[3]; MSA 5.2079[3], for \"rapid transit\", MCL 117.4g; MSA 5.2080, zoning, MCL 117.4i[3]; MSA 5.2082[3], among other provisions.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eProvisions of the home rule act, regarding elections, public utilities, rapid transit, zoning, civil service -- and special assessments -- may not, simply because the act also contains provisions regarding ad valorem property taxes, be deemed to be ad valorem property tax laws.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e99. MCL 104A.1-104A.5; MSA 5.1854(1)-5.1854(5).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e100. MCL 41.721-41.737; MSA 5.2770(51)-5.2770(67).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e101. MCL 42.31; MSA 5.46(31).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e102. MCL 280.151-280.161, 280.261-280.283; MSA 11.1151-11.1161, 11.1261-11.1283.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e103. MCL 119.3-119.4; MSA 5.2133-5.2134.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e104. MCL 68.31-68.35; MSA 5.1370(1)-5.1370(5).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e105. Although some of the acts, MCL 280.265; MSA 11.1265 (fn 61); MCL 123.757; MSA 5.570(27); MCL 41.356; MSA 5.2585(6), authorizing special assessments provide that they shall be collected in the same manner as other general taxes, most allow the local authority to provide for the manner of collection which need not be tied to the collection of property taxes. MCL 41.397; MSA 5.2597; MCL 41.729; MSA 5.2770(59); MCL 42.31; MSA 5.46(31); MCL 68.32; MSA 5.1370(2); MCL 104A.2; MSA 5.1854(2); MCL 117.4d; MSA 5.2077; MCL 125.946c; MSA 5.3526(3).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e106. The State Tax Commission has broad supervisory powers over taxing agencies and tax assessment procedures. See In re Dearborn Clinic \u0026 Diagnostic Hospital, 342 Mich 673; 71 NW2d 212 (1955).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWhether by statute, e.g., MCL 41.801; MSA 5.2640(1), or charter provision, special assessment rolls are often spread and collected along with the regular tax roll of the township or city. Such rolls are subject to inspection for at least procedural irregularities. For example, § 37 of The General Property Tax Act provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"The county board of commissioners * * * shall also examine all certificates, statements, papers and records submitted to it, showing the moneys to be raised in the several townships for school, highway, drain, township, and other purposes. It shall hear and duly consider all objections made to raising any such moneys by any taxpayer to be affected thereby. If it shall appear to the board that any certificate, statement, paper, or record is not properly certified, or that the same is in anyway defective, or that any proceeding to authorize the raising of any such moneys has not been had or is in anyway imperfect the board shall verify the same, and if the certificate, statement, paper, record, or proceeding can then be corrected, supplied, or had, the board shall authorize and require the defects or omissions of proceedings to be corrected, supplied, or had. It may refer any or all the certificates, statements, papers, records, and proceedings to the prosecuting attorney, whose duty it shall be to examine the same and without delay report in writing his opinion to the board.\" MCL 211.37; MSA 7.55.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e107. The Tax Tribunal has said that a determination made by the board of county commissioners not to spread a special assessment and, presumably, determinations concerning procedural irregularities, which were formerly appealable to the State Tax Commission, MCL 211.37a; MSA 7.56, are now appealable to the Tax Tribunal. Calder v DeWitt Twp, 1 MTTR 205 (1976).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWhatever authority the State Tax Commission may have over the property tax collector and, thus, to supervise the collection or non-collection of special assessments turned over to the collector, would not enlarge or confer upon the State Tax Commission authority over decisions made by local units of government whether to levy and, if so, how to apportion the burden of the overall assessment or cost of the improvement.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e108. Ante, p 626.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e109. Ante, p 643.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e110. See fns 106 and 107.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e111. \"A person or legal entity which, immediately before the effective date of this act, was entitled to proceed before the state tax commission or circuit court of this state for determination of a matter subject to the tribunal's jurisdiction, as provided in section 31, shall proceed only before the tribunal.\" MCL 205.741; MSA 7.650(41).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e112. MCL 211.152; MSA 7.210.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e113. MCL 211.53; MSA 7.97.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e114. Section 53 authorized an action for refund of ad valorem taxes paid under protest provided that the action was commenced in the circuit court within 30 days of payment. MCL 211.53; MSA 7.97.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAn action for refund was not an effective remedy where the issue was valuation; if it served any purpose, it was to safeguard the taxpayer's right to a refund where the tax had been paid pending a decision of the State Tax Commission.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWe found 17 cases which were brought under § 53 for refunds raising questions of improper assessment or valuation. Of the 17 cases, in 11 the circuit court gave no relief to the taxpayer: Twenty-Two Charlotte, Inc v Detroit, 294 Mich 275; 293 NW 647 (1940); Moran v Grosse Pointe Twp, 317 Mich 248; 26 NW2d 763 (1947); Grand Rapids Steel \u0026 Supply Co v Grand Rapids, 35 Mich App 59; 192 NW2d 376 (1971); Sloman-Polk Co v Detroit, 261 Mich 689; 247 NW 95 (1933); S S Kresge Co v Detroit, 276 Mich 565; 268 NW 740 (1936); Newport Mining Co v Ironwood, 185 Mich 668; 152 NW 1088 (1915); Copper Range Co v Adams Twp, 208 Mich 209; 175 NW 282 (1919); Cleveland-Cliffs Iron Co v Republic Twp, 196 Mich 189; 163 NW 90 (1917); Kingsford Chemical Co v Kingsford, 347 Mich 91; 78 NW2d 587 (1956); Island Mill Lumber Co v Alpena, 176 Mich 575; 142 NW 770 (1913); General Discount Corp v Detroit, 306 Mich 458; 11 NW2d 203 (1943).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn only one case -- on extraordinary facts involving gross overassessment -- did the taxpayers obtain judicial relief. Helin v Grosse Pointe Twp, 329 Mich 396; 45 NW2d 338 (1951). Even there the taxpayers faced reassessment and the prospect of further proceedings if they wished to contest the reassessment -- hardly an effective remedy.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn Mohawk Data Sciences Corp v Detroit, 63 Mich App 102, 107-108; 234 NW2d 420 (1975), the Court of Appeals affirmed a decision of the circuit court holding that personal property tax had been illegally assessed and ordering a refund of the entire tax paid, again subject to reassessment, because the assessor had relied entirely on the list price of data-processing equipment in arriving at cash value. The Court of Appeals said that the evidence showed that this \"method of assessment\" \"was an unrealistic approach to a valuation of this property, that it was at variance with financial realities and that the result was an illegal tax\". Again, the Court did not determine a proper assessment, only that the assessment that had been made was improper, and ordered a refund of the tax without prejudice to reassessment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn Detroit v Fruehauf Trailer Co, 339 Mich 256; 63 NW2d 666 (1954), this Court indicated that the State Tax Commission could simply reassess property after a circuit court had voided a tax as illegal and granted a refund.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn two cases the taxpayer prevailed because the Board of State Tax Commissioners (the predecessor of the State Tax Commission) increased the assessment without following statutory procedure. Bialy v Bay City, 139 Mich 495; 102 NW 1033 (1905); Delray Land Co v Springwells Twp, 149 Mich 397; 112 NW 1132 (1907).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn another case, a refund was ordered because the city assessed property in excess of the amount subsequently determined by the State Tax Commission. Hudson Motor Car Co v Detroit, 282 Mich 69; 275 NW 770 (1937).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eOne taxpayer recovered the amount by which his assessment was increased on account of an illegal reduction in another taxpayer's assessment. Fletcher Paper Co v Alpena, 160 Mich 462; 125 NW 405 (1910).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eOf the 17 cases, 8 had been appealed to the State Tax Commission. Six were not appealed to the State Tax Commission or its predecessors, but the assessment had been set by the State Tax Commission and its action was the basis of the complaint. In three cases there was no appeal to the State Tax Commission or complaint of its actions. In one of these latter cases, the action covered a number of tax years, and it may have appeared that only the court would have jurisdiction to grant relief, General Discount Corp v Detroit, supra. In the other two cases, both decided more than 60 years ago, there is no reference to the commission or its predecessors in the reported opinions, Cleveland-Cliffs Iron Co v Republic Twp, supra; Fletcher Paper Co v Alpena, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e115. \"The legislation was prompted by a desire to create an appellate body for all tax appeals whose members would devote their full time to the matters presented and would thus be able to decide these matters both expeditiously and expertly. The State Tax Commission, because of staffing and budgetary limitations, had become unable to keep pace with the annually accelerating burden of appeals filed with it and, at the same time to perform its numerous other assessment and equalization duties.\" Stanley, Tunstall \u0026 Opper, State and Local Taxation, 21 Wayne L Rev 619, 653 (1975).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e116. Ante, p 628.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e117. The amendatory act providing for appeal to the Tax Tribunal in lieu of the Board of Tax Appeals and for the alternative remedy in the Court of Claims is 1980 PA 162; MCL 205.22 et seq.; MSA 7.657(22) et seq. The remedy in the circuit court was repealed by 1980 PA 169 for income taxes (MCL 206.421; MSA 7.557[1421]), by 1980 PA 164 for sales taxes (MCL 205.72; MSA 7.543), by 1980 PA 168 for intangibles taxes (MCL 205.143; MSA 7.556[13]) and by 1980 PA 167 for cigarette taxes (MCL 205.508; MSA 7.411[8]). See fn 69.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe Tax Tribunal Act had, as originally enacted, provided somewhat ambiguously for the transfer to the Tax Tribunal of matters formerly heard before the Board of Tax Appeals and the Corporation Tax Appeal Board effective January 1, 1976. See fn 69. This transfer of initial jurisdiction was deferred until January 1, 1977, and the language was clarified by 1976 PA 37. See fn 69. The Attorney General ruled that the effort to abolish the Board of Tax Appeals and Corporation Tax Appeal Board did not succeed because of violation of the re-enactment and republication requirements of Const 1963, art 4, § 25. See fn 69.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe Board of Tax Appeals continued to operate. Its abolition and the transfer of its jurisdiction has now been effected by 1980 PA 162.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e118. Research fails to disclose a single instance of an appeal to the State Tax Commission from the levying of a special assessment whether under the Drain Code, MCL 280.1 et seq.; MSA 11.1001 et seq., or the various enabling acts authorizing villages, townships, cities, counties and other units of local government to levy special assessments.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe State Tax Commission may have exercised jurisdiction over a treasurer who refused to collect a special assessment or sought to collect a special assessment that had not been properly levied. See fns 106 and 107.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e119. Ante, p 641.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e120. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e121. \"In dealing with statutes intended to affect or claimed to affect the continuance of jurisdiction in courts of original and general authority the law has always recognized a principle of construction which served to favor the retention of jurisdiction.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Whatever presumptions are permitted are in favor of the retention of the authority, * * * and it is very natural and reasonable to suppose that the Legislature, in so far as they should think it needful to authorize interruptions and the shiftings of jurisdiction, would express themselves with clearness and leave nothing for the play of doubt and uncertainty.\" Crane v Reeder, 28 Mich 527, 532-533 (1874).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eStatutes in derogation of the common law must be strictly construed; and statutes which seek to divest jurisdiction cannot accomplish that goal save under clear mandate of law. Leo v Atlas Industries, Inc, 370 Mich 400, 402; 121 NW2d 926 (1963).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e122. Crane v Reeder, 28 Mich 527, 533.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e123. Paley v Coca Cola Co, 389 Mich 583; 209 NW2d 232 (1973); Leo v Atlas Industries, Inc, 370 Mich 400; 121 NW2d 926 (1963).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e124. The Tax Tribunal is a \"quasi-judicial agency\", not a court, MCL 205.721; MSA 7.650(21), and lacks judicial power. See Dation v Ford Motor Co, 314 Mich 152; 22 NW2d 252 (1946); Michigan Mutual Liability Co v Baker, 295 Mich 237; 294 NW 168 (1940).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe Legislature was probably concerned that were the Tax Tribunal given the full judicial powers of a court its members would have to be elected rather than appointed, tending to defeat the goal of creating a body with specialized, expert experience; and that were the Tax Tribunal a court, its review of valuations and allocations under property tax laws would be limited by Const 1963, art 6, § 28, to review for \"fraud, error of law or the adoption of wrong principles\", instead of the Tax Tribunal being the final agency, contemplated by the constitution, before such limited judicial review. Stanley, Tunstall \u0026 Opper, State and Local Taxation, 21 Wayne L Rev, pp 653-654 (1975).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eEquitable powers, such as the power to enter the injunction sought in this case, are judicial powers. The Tax Tribunal has concluded that it does not have the power to provide an equitable remedy:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"While recent changes in the statutory law and court rules promulgated pursuant thereto have eliminated many of the formalities associated with the historic separation of law and equity, we do not believe these changes have been so far reaching as to extend the availability of equitable remedies such as class actions beyond courts of general jurisdiction, which have traditionally possessed equitable powers, and into administrative agencies without such extension being specifically enumerated in the statutes governing the operation of the agency in question.\" Calder v DeWitt Twp, supra, 1 MTTR 207.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e125. See fns 129 through 132 and accompanying text.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e126. \"(1) A proceeding before the tribunal shall be original and independent and shall be considered de novo.\" MCL 205.735; MSA 7.650(35).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e127. The language adopted on the floor of the Constitutional Convention, prior to changes made by the committee on style and drafting read: \"fixing the value of described property for property tax purposes\". See fn 33.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Valuation\", it appears from context and history, refers to the determination of \"true cash value\" for ad valorem property tax purposes. See Const 1963, art 9, § 3. See also § 35 of the Tax Tribunal Act requiring protest to the board of review where an assessment dispute concerns the \"valuation\" of property, MCL 205.735; MSA 7.650(35). No board of review is provided for protest of a special assessment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Allocation\", it appears from the language of the clause as adopted on the floor of the constitutional convention before revision by the committee on style and drafting, refers to decisions of the county tax allocation board (see fn 33) pursuant to the Property Tax Limitation Act (see fn 66).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e128. Const 1963, art 6, § 28. See fn 31 for text.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e129. MCL 280.161; MSA 11.1161. See also MCL 280.72a; MSA 11.1072(1); MCL 280.88; MSA 11.1088; MCL 280.106; MSA 11.1106; MCL 280.122; MSA 11.1122; MCL 280.122a; MSA 11.1122(1); MCL 280.123; MSA 11.1123; MCL 280.125; MSA 11.1125; MCL 280.151; MSA 11.1151; MCL 280.155; MSA 11.1155; MCL 280.157; MSA 11.1157; MCL 280.158; MSA 11.1158; MCL 280.191; MSA 11.1191; MCL 280.243; MSA 11.1243; MCL 280.493; MSA 11.1493; MCL 280.521; MSA 11.1521; MCL 280.532; MSA 11.1532; MCL 280.563; MSA 11.1563; MCL 280.577; MSA 11.1577; MCL 280.581; MSA 11.1581.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e130. See MCL 280.156-280.157; MSA 11.1156-11.1157.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e131. See Fuller v Cockerill, 257 Mich 35, 39; 239 NW 293 (1932); Hudlemyer v Dickinson, 143 Mich 250, 256; 106 NW 885 (1906); Clinton Twp v Teachout, 150 Mich 124, 128; 111 NW 1052 (1907); Hinkley v Bishopp, 152 Mich 256, 264; 114 NW 676 (1908); Troost v Fellows, 169 Mich 66, 70, 71; 134 NW 1011 (1912).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e132. See Meyering Land Co v Spencer, 273 Mich 703, 708-709; 263 NW 777 (1935); Lake Twp v Millar, 257 Mich 135, 142; 241 NW 237 (1932); Blades v Genesee County Drain Dist No 2, 375 Mich 683, 693, 694; 135 NW2d 420 (1965).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e133. MCL 280.161; MSA 11.1161.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e134. See MCL 205.735; MSA 7.650(35). This section of the Tax Tribunal Act, as last amended by 1976 PA 365, provides that the jurisdiction of the Tax Tribunal \"in an assessment dispute\" shall be invoked \"not later than June 30 of the tax year involved\" but that in all \"other matters\" the time for filing is 30 days after the final decision.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eOnly an appeal from an ad valorem assessment must or may be filed \"not later than June 30 of the tax year involved\". If special assessments are subject to the jurisdiction of the Tax Tribunal, they are subject to the 30-day time limit applicable to \"all other matters\".\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e135. See Edros Corp v Port Huron, 78 Mich App 273; 259 NW2d 456 (1977), submitted on the June calendar and decided in an opinion per curiam. See also Eyde v Lansing Twp, 105 Mich App 370; 306 NW2d 797 (1981); Emerick v Saginaw Twp, 104 Mich App 243; 304 NW2d 536 (1981).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e136. Ante, p 637.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe opinion of the Court cites two decisions of this Court as authority for the proposition that legislative acquiescence in the decisions of the Court of Appeals referred to in fn 135 should be given consideration in deciding the correct construction of the Tax Tribunal Act. In In re Clayton Estate, 343 Mich 101; 72 NW2d 1 (1955), the Court declined to overrule a decision of this Court construing a statute which had been made some 30 years earlier. In Magreta v Ambassador Steel Co (On Rehearing), 380 Mich 513; 158 NW2d 473 (1968), the Court declined to construe the workers' compensation act in a manner inconsistent with the established administrative practice since the first enactment of the statute some 50 years earlier. These decisions do not support the proposition that this Court should be influenced by the concept of legislative acquiescence when exercising its appellate function of reviewing a recent construction of a statute by the Court of Appeals.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWe also note that as a canon of statutory construction \"Legislative silence is a poor beacon to follow in discerning the proper statutory route.\" Zuber v Allen, 396 U.S. 168, 185; 90 S Ct 314; 24 L Ed 2d 345 (1969).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e137. Ante, p 625.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e138. Ante, p 626.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e139. Orloff v Morehead Mfg Co, 273 Mich 62; 262 NW2d 736 (1935). Similarly, see Emerick v Saginaw, supra, fn 135 (special assessment challenge in circuit court; the Court of Appeals, adverting to the Tax Tribunal Act, addressed \"a jurisdictional matter not yet raised by the parties at the circuit level or upon appeal\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e140. See fns 1 and 3.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e141. Romulus City Treasurer v Wayne County Drain Comm, post, p 728, could be released to the parties (with revision of the circulated opinions to reserve the Tax Tribunal Act jurisdictional question) and need not await further briefing and argument of the instant cause because we all agree that the claim pleaded in Romulus may be maintained in circuit court even if the Tax Tribunal generally has jurisdiction.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e142. See fn 2.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e143. See fn 132. See also Wyzlic v Ironwood, 365 Mich 87; 112 NW2d 94 (1961).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e144. The Legislature may be powerless to abrogate the equitable jurisdiction of the circuit court. See Mathias v Owosso Twp Treasurer, 73 Mich 5; 40 NW 926 (1888). Cf. Brown v Kalamazoo Circuit Judge, 75 Mich 274; 42 NW 827 (1889).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e145. See fns 131 and 132 and accompanying text.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e146. See fn 126 and accompanying text.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e147. MCL 205.743(2); MSA 7.650(43)(2).\u003c/span\u003e\n\n",
    "body_length": 215585,
    "citedas": [
      "322 N.W.2d 103",
      "413 Mich. 617"
    ],
    "attorneys": "Draugelis, Ashton \u0026 Scully (by Edward Draugelis and Michael Pollard), Plymouth, Michigan, for plaintiffs. Lampert, Fried \u0026 Levitt, P.C. (by David M. Fried and Gary E. Levitt), Birmingham, Michigan, for defendants.",
    "category": [
      "213"
    ],
    "judges": "Coleman, C.j. Williams, Fitzgerald, Ryan, and Blair Moody, Jr., JJ., concurred with Coleman, C.j. Coleman, C.j. Levin, J. (dissenting). Kavanagh, J., concurred with Levin, J.",
    "citation_count": 0
  }
}
