{
  "id": "no6_QWYBTlTomsSBvaVy",
  "document": {
    "title": "MASSACHUSETTS v. MOSBACHER",
    "full_title": "COMMONWEALTH OF MASSACHUSETTS, EDWARD F. BERLIN AND KAREN J. KEPLER, Plaintiffs, v. ROBERT MOSBACHER, AS SECRETARY OF THE UNITED STATES DEPARTMENT OF COMMERCE; MICHAEL DARBY, AS UNDERSECRETARY OF ECONOMIC AFFAIRS OF THE UNITED STATES DEPARTMENT OF COMMERCE; THE BUREAU OF THE CENSUS; BARBARA BRYANT, AS DIRECTOR OF THE BUREAU OF THE CENSUS; GEORGE HERBERT WALKER BUSH, AS PRESIDENT OF THE UNITED STATES; AND DONNALD K. ANDERSON, AS CLERK OF THE UNITED STATES HOUSE OF REPRESENTATIVES, Defendants.",
    "jurisdiction": "D. Massachusetts",
    "date": "1992-02-20T00:00:00.000Z",
    "docket": "91-11234-WD",
    "body": "WOODLOCK, District Judge\n\nThe Commonwealth of Massachusetts and two of its registered voters bring this action challenging the manner by which the Congress of the United States has apportioned the 435 seats in the United States House of Representatives. The plaintiffs contend 1) that the method for allocating House seats among the 50 states violated the constitutionally grounded principle of \"one person, one vote\" (the \"apportionment claim\"); and 2) that the method used in the 1990 census for counting federal employees serving overseas was improper (the \"overseas census claims\").\n\nThe plaintiffs seek declaratory relief and an injunction directing the defendants--the executive and legislative officers variously charged with overseeing the conduct of the census, the methodology for the allocation of congressional seats, and the certification of the allocation \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\" --to reallocate the seats apportioned to the several states as a consequence of the 1990 census.\n\nThe animating concern which prompted this litigation was the loss by Massachusetts of one of its current eleven congressional seats as a result of the congressional reapportionment process necessitated by the 1990 census. The parties have stipulated (A) that if the plaintiffs prevail on their apportionment claim, Massachusetts will continue to have eleven seats in the House of Representatives while the State of Oklahoma will lose one of the six seats it has been allocated under the challenged apportionment methodology; or, alternatively, (B) that if the plaintiffs prevail on their overseas census claims, Massachusetts will continue to have eleven seats in the House of Representatives while the State of Washington will lose one of the nine seats it has received under the challenged census methodology. At issue is not merely the size of the Massachusetts delegation in the House of Representatives, but also the relative strength of the Massachusetts voice in the selection of the president through the electoral college, where a state's share of the 535 electors is \"equal to the whole Number of Senators and Representatives to which the State may be entitled in the Congress.\" U.S. Const., art. II, § 1, cl. 2.\n\nThe case has been presented to us by cross motions for summary judgment, supported by a stipulation of facts and affidavits. The parties agree that there is no genuine issue of material fact in dispute. While we conclude that the congressional judgment regarding the allocation of congressional seats was not violative of the Constitution and therefore reject plaintiffs' apportionment claim on the merits, we also conclude that the administrative judgment regarding the method of counting overseas personnel in the 1990 census was arbitrary and capricious, and an abuse of discretion in violation of the Administrative Procedure Act. Consequently, conditioned upon timely action by the defendant Commonwealth of Massachusetts, we will order the defendants to recertify state entitlements to seats in the House of Representatives.\n\nIn order to reach the merits of the case we have had to pass through a jurisdictional and justiciability thicket. Part of this thicket came with the territory, which required us to explore the breadth of the jurisdiction conferred by the three-judge court statute. The other part was cultivated by the defendants and the State of Washington as amicus curiae, who variously raised standing, the indispensability of absent parties, and the political question doctrine as justiciability impediments to plaintiffs' claims. Our passage through the several parts of the thicket helps to stake out the merits of the claims at the substantive heartland of the case. Accordingly, we turn first to a report of our passage before discussing the merits of the claims.\n\nI.\n\nTHE JURISDICTION AND JUSTICIABILITY THICKET\n\nA. THE JURISDICTION OF THE THREE-JUDGE COURT\n\nCongress has mandated that \"[a] district court of three judges shall be convened . . . when an action is filed challenging the constitutionality of the apportionment of congressional districts.\" 28 U.S.C. § 2284(a). Section 2284(b)(1) calls for the convening of the three-judge court \"upon the filing of a request for three judges.\" None of the parties, however, initially filed a request for the convening of a three judge court in this action.\n\nUpon prompting by the single judge to whom this case was initially assigned and after a ruling by the United States District Court for the District of Montana before which a similar challenge to the congressional method of apportioning congressional districts among the states was mounted, Montana v. United States Dep't of Commerce, No. Civil Action CV-91-22-H-CCL, slip op at 4-5 (D. Mont. Aug. 15, 1991) (decision of single judge denying motion to dissolve three-judge court), 775 F. Supp. 1358, 1360 (D. Mont., 1991) (three-judge court opinion on merits affirming, inter alia, decision to convene three-judge court) prob. juris. noted, 60 U.S.L.W. 3435 (U.S. Dec. 16, 1991) (No. 91-860), the plaintiffs requested that a three-judge court be convened at least as to the apportionment claim. Plaintiffs also maintained at that time that the overseas census claims merited adjudication by a three-judge court. The defendants opposed the request. This three-judge court was convened without prejudice to the right to move to dissolve it. The defendants made such a motion.\n\nAt oral argument, the defendants, recognizing that the Solicitor General had recently conceded in his submissions to the Supreme Court the propriety of the three-judge district court in the Montana litigation, Jurisdictional Statement, United States Dep't of Commerce v. Montana, U.S. No. 91-860, at 25-28, abandoned their motion to dissolve this three-judge court as to the apportionment claim. The defendants, however, maintained that three-judge court consideration of the overseas census claims standing alone was inappropriate. The plaintiffs, while continuing their request for three-judge court treatment of the apportionment claim, expressed themselves at oral argument as indifferent on the question whether a three-judge court should dispose of the overseas census claims.\n\nBecause we believe the question of the propriety of a three-judge court cannot be left to the variable dispositions of the parties but rather is a jurisdictional issue always open to review, \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\" we have undertaken our own independent analysis of the question.\n\n1. The Apportionment Claim\n\nIn their initial opposition to the convening of a three-judge court, even as to the apportionment claim, the defendants relied upon a distinction they perceived between intrastate and interstate apportionment disputes. Noting that until the Montana decision, all litigated challenges to the constitutionality of the apportionment of congressional districts had been directed at the decisions of state legislatures in the apportioning of districts within particular states, the defendants contended that interstate apportionment of districts could not have been within the contemplation of Congress when it revised the three-judge district court provisions in 1976.\n\nThe distinction drawn by the defendants makes no material difference under § 2284. It is well recognized that the three-judge court procedure imposes heavy logistical demands on the federal judiciary. But the burden has been perceived necessary as a means for \"the saving of state and federal statutes from improvident doom at the hands of a single judge.\" MTM, Inc. v. Baxley, 420 U.S. 799, 804, 43 L. Ed. 2d 636, 95 S. Ct. 1278 (1975) (per curiam). In no area is that concern more critical to the legitimacy of judicial decisionmaking than in the politically charged context of legislative reapportionment. And Congress made a deliberate decision to continue the application of three-judge court procedures to reapportionment cases when it narrowed the jurisdiction of those courts in 1976.\n\nThe provisions for district courts sitting as a panel of three judges, one of whom must be a judge of the court of appeals-- together with the opportunity for direct appeal to the Supreme Court--are useful in diminishing any perception that parochialism or partisanship will dominate decisions about the constitutionality of reapportionment. As the Senate Report supporting the narrowing of the three-judge court jurisdiction recognized, reapportionment matters \"are of such importance that they ought to be heard by a three-judge court.\" S.Rep. No. 204, 94th Cong., 1st Sess. 9 (1975) reprinted in 1976 U.S.C.C.A.N. 1988, 1996. That importance is not affected by whether it is a state or the federal legislature which has made the reapportionment decision under review.\n\nThe language of the three-judge court statute makes no distinction between federal or state action regarding apportionment, and the relevant legislative history indicates Congress had no such distinction in mind. The Senate Report characterized the purpose of the amendments to three-judge court jurisdiction as an effort to \"eliminate[] the requirement for three-judge courts in cases seeking to enjoin the enforcement of State or Federal laws on the grounds that they are unconstitutional, except in reapportionment cases.\" Id. at 1-2 (emphasis supplied). Similarly, the House Report observed that the legislation would \"continue the requirement for a three-judge court in cases challenging the constitutionality of any statute apportioning congressional districts.\" H.R. Rep. No. 1379, 94th Cong., 2d Sess. 6 (1976) (emphasis supplied).\n\nIn short, we are satisfied that the plaintiffs' apportionment claim is a matter which Congress, through § 2284(a), has directed must be determined by a three-judge district court.\n\n2. The Overseas Census Claims\n\nThe plaintiffs' overseas census claims present a different set of circumstances. We recognize that one of the plaintiffs' census claims challenges the constitutionality of the manner by which the Secretary of Commerce chose to allocate overseas federal employees to individual states. That allegedly unconstitutional allocation, in turn, has become a basis upon which the Congress apportioned congressional seats among the states. It is unclear, however, whether the jurisdictional statute was intended to embrace this type of census claim as within the meaning of a challenge to the \"constitutionality of the apportionment of congressional districts.\" 28 U.S.C. § 2284(a). The methods of the census counts are precursors to the ultimate apportionment decisions, and an attack on those methods does not necessarily amount to a direct challenge to apportionment itself.\n\nAs an historical matter, a number of similar census claims have been litigated before single district judges. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\" However, only one court seems to have addressed directly the scope of the jurisdictional grant in § 2284(a) in analogous circumstances. In Federation for American Immigration Reform (\"FAIR\") v. Klutznick, 486 F. Supp. 564 (D.D.C. 1980), appeal dismissed, 447 U.S. 916, 65 L. Ed. 2d 1109, 100 S. Ct. 3005 (1980), a three-judge district court was convened to consider plaintiff's contention that the inclusion of illegal aliens in the 1980 census would be unconstitutional. While disposing of the case on other grounds, the FAIR court concluded that three-judge court jurisdiction was lacking for this indirect challenge to apportionment. Id. at 577-78.\n\nThe commentators, however, would construe the statute more broadly. Professors Wright, Miller and Cooper suggest that § 2284(a) \"ought to include all federal constitutional challenges that could result in a reapportionment.\" 17 Wright, Miller \u0026 Cooper § 4235 at 606. See also Williams, The New Three-Judge Courts of Apportionment and Continuing Problems of Three-Judge Court Procedure, 65 Geo. L.J. 971, 979 (1977). The parties have stipulated here that, if plaintiffs' constitutional overseas census claims are successful, a reapportionment would follow. But while the resulting reapportionment is a certainty in this case, it also looms as a possibility in virtually every census challenge. The construction given by the commentators to the scope of the \"apportionment\" language in § 2284(a) thus suggests that all census litigation is appropriate for three-judge court treatment. We very much doubt that was the congressional intent.\n\nWe need not determine the precise scope of § 2284(a) in this case, however, because, even if the statute does not provide for a direct exercise of three-judge court jurisdiction over the overseas census claims standing alone, concerns for the conservation of judicial resources and the avoidance of litigative entropy counsel for three-judge court treatment in this instance. Plaintiffs' overseas census claims do not stand alone but rather are coupled here to an apportionment claim plainly within the jurisdiction of this three-judge court. The direct apportionment claim and the overseas census claims concern the same general subject matter--the transformation of census apportionment counts into seats in the House of Representatives. They became ripe for decision at the same time and they were heard simultaneously by the three-judge court panel. For orderly review, our contemporaneous judgments regarding them should be appealed to the same court at the same time. While not directly governing the exercise of three-judge court jurisdiction, we believe that analogies to our exercise of three-judge court jurisdiction over the overseas census claims may be found in doctrines of supplemental jurisdiction applicable to district courts generally. The Supreme Court has recognized the power of a properly convened three-judge court to determine claims in the case that otherwise would be appropriate for a single district judge. See, e.g., Lake Carriers' Ass'n v. MacMullan, 406 U.S. 498, 504, 32 L. Ed. 2d 257, 92 S. Ct. 1749 n. 6 (1972); Zemel v. Rusk, 381 U.S. 1, 5-6, 14 L. Ed. 2d 179, 85 S. Ct. 1271 c, 381 U.S. 1, 14 L. Ed. 2d 179, 85 S. Ct. 1271 (1965); Florida Lime \u0026 Avocado Growers, Inc. v. Jacobsen, 362 U.S. 73, 85, 4 L. Ed. 2d 568, 80 S. Ct. 568 (1960). The considerations are similar to those which govern the exercise of pendent jurisdiction when, as here, the claims \"are such that [plaintiffs] would ordinarily be expected to try them all in one judicial proceeding,\" United Mine Workers v. Gibbs, 383 U.S. 715, 725, 16 L. Ed. 2d 218, 86 S. Ct. 1130 c, 383 U.S. 715, 16 L. Ed. 2d 218, 86 S. Ct. 1130 (1966), and all claims are within the Article III jurisdiction of the district courts.\n\nWhile we recognize that in a strict sense the apportionment claim and the overseas census claims do not \"derive from a common nucleus of operative fact,\" cf. United Mine Workers v. Gibbs, 383 U.S. at 725, the values articulated in the jurisprudence of pendent jurisdiction are all present in this case. The \"'commonsense policy of pendent jurisdiction--the conservation of judicial energy and the avoidance of a multiplicity of litigation--'\" Newport Ltd. v. Sears Roebuck \u0026 Co., 941 F.2d 302, 308 n. 9 (5th Cir. 1991) (citation omitted) reh. denied, 946 F.2d 893 (5th Cir. 1991), petition for cert. filed, 60 U.S.L.W. 3482 (U.S. Dec. 23, 1991), applies equally here where time is of the essence as the nation prepares for the reapportionment of seats to be contested in the 1992 elections to the House of Representatives, and the parties have fully presented all aspects of the case at the same time to the three-judge court. Moreover, we see no benefit to be gained by atomizing avenues of appellate review. Any requirement that the overseas census claims be reviewed first in the Court of Appeals while the apportionment claim is available for direct appeal to the Supreme Court would only delay final resolution of the controversy by burdening yet another court without apparent meaningful value to ultimate consideration by the Supreme Court.\n\nOur reliance on this \"commonsense\" and policy-bound approach is further fortified by Congress' decision in 1990 to codify the doctrines of pendent and ancillary jurisdiction in 28 U.S.C. § 1367. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\" The new statute, which conflates the two theories into the unitary concept of \"supplemental\" jurisdiction, evidences congressional endorsement of jurisdictional rulings which subserve the efficient disposition of related claims. The statute provides that:\n\nin any civil action of which the district courts have original jurisdiction, the district courts shall have supplemental jurisdiction over all other claims that are so related to claims in the action within such original jurisdiction that they form part of the same case or controversy under Article III of the United States Constitution.\n\n28 U.S.C. § 1367(a). Congress has thereby authorized supplemental jurisdiction \"to the limits Article III of the Constitution permits.\" 13 Wright, Miller \u0026 Cooper, Federal Practice and Procedure § 3567.3 at 35 (1991 Supp.).\n\nSection 1367 may be read to make the exercise of such jurisdiction virtually mandatory. Not only does the language of subsection (a) state that the district court \"shall have\" jurisdiction, subsection (c) strictly limits the circumstances in which a court may decline to exercise supplemental jurisdiction. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\" None of those circumstances is applicable here. The same concerns for judicial economy and efficient resolution of disputes in a single forum counsel us to hear the overseas census claims in conjunction with the apportionment claim over which we have clear three-judge court jurisdiction.\n\nFinally, because we are informed by the parties' stipulation of facts that the determination of the overseas census claims will translate directly into a specific transfer of a congressional seat from Washington to Massachusetts, we are of the view that the policy considerations which led Congress to preserve the jurisdiction of three-judge courts over challenges to the constitutionality of congressional reapportionment are by analogy applicable here. By the same token the burden of three-judge court business upon either the District Courts or the Supreme Court in the aftermath of the 1976 amendment to the three-judge court statute is not so substantial as to require a hypertechnical restriction on the practical exercise of a supplemental jurisdiction in this case.\n\nThus, we have considered and determined the plaintiffs' overseas census claims as a three-judge court. But see FAIR, 486 F. Supp. at 578 (outlining procedure by which single District Judge to whom case was assigned may separately certify same conclusion as that reached by the three judge court). \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\"\n\nB. STANDING\n\nThe defendants' principal standing argument \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\" is essentially a subtle shell game. The defendants note that if the plaintiffs prevail on the overseas census claims, the injury of which they complain--the loss of a congressional seat by Massachusetts--will have been remedied. Thus, the defendants maintain, the plaintiffs cannot complain of an injury caused by the asserted unconstitutionality of the apportionment method for allocating seats among the states chosen by the Congress.\n\nThe defendants' argument is erected upon a stilted reading of the case law which imposes the unexceptional requirement that in order to establish standing a party must demonstrate that its alleged injuries \"'fairly can be traced to the challenged action.'\" See generally Duke Power Co. v. Carolina Envtl. Study Group, Inc., 438 U.S. 59, 74, 57 L. Ed. 2d 595, 98 S. Ct. 2620 (1978), (quoting Simon v. Eastern Kentucky Welfare Rights Org., 426 U.S. 26, 41, 48 L. Ed. 2d 450, 96 S. Ct. 1917, 38 A.F.T.R.2d (P-H) 5027 (1976)). At bottom, this is a requirement that the relation between a plaintiff's injury and a defendant's action not be so attenuated as to raise a question whether judicial action to redress the injury would be merely advisory or gratuitous.\n\nWe read this requirement as not dissimilar to the requirement of proximate cause in tort law. The mere fact that two independent causes may have contributed to an injury does not make one or the other any less a proximate cause. It is only when the various contributing causes are so diffuse and indeterminate that the requisite showing of causation is put in question. The District of Columbia Circuit has observed that:\n\nThe weight of Supreme Court authority emphasizes that when numerous third parties and independent variables lead to an injury, the complainant has the burden of showing that but for the particular governmental action that he is challenging, the injury would abate. We have interpreted these cases to mean that petitioners \"must show that the agency's action is more than only one of the many factors whose relative influence may affect the third parties' behavior.\"\n\nDellums v. United States Nuclear Regulatory Commission, 274 App. D.C. 279, 863 F.2d 968, 980 (D.C.Cir. 1988) (citations omitted), (quoting Community for Creative Non-Violence v. Pierce, 259 App. D.C. 134, 814 F.2d 663, 669 (D.C.Cir. 1987)).\n\nWhere, as here, the separate causes are distinct and determinate and their influence is direct, the requisites of standing have been demonstrated as to both causes.\n\nTo be sure, considerations of judicial economy and the preference for resolving non-constitutional issues before reaching issues of constitutional dimension may counsel in favor of addressing one asserted independent cause rather than the other initially. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\" But that is not a standing impediment to the assertion of alternative claims for relief by a plaintiff. As an inferior court confronting two claims--both involving intense considerations of timeliness--which are positioned for direct review by the Supreme Court, \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\" we have a special obligation not to resolve this litigation piecemeal or seriatim. Rather, we must undertake to dispose of both claims in order to permit an orderly, timely, and complete resolution of plaintiffs' claims. Defendants' spurious standing defense is no bar to that type of resolution by this court.\n\nC. INDISPENSABILITY OF ABSENT PARTIES\n\nThe State of Washington, which was granted amicus curiae status early in this action, belatedly filed a brief asserting that this case could not properly proceed because of its absence as an indispensable party. Washington, which, like all other states, was given notice of this litigation, observes that the parties have stipulated that if the plaintiffs' overseas census claims are sustained, Washington will lose the one seat in the House of Representatives that Massachusetts will gain.\n\nWashington, however, has affirmatively chosen not to participate in this litigation as a party. Rather it asserts that it will not waive its sovereign immunity rights, that it has commenced its own litigation in the Western District of Washington to seek a declaration of these matters, and that in any event, the Supreme Court of the United States is the only forum available for the resolution of what is essentially an interstate dispute.\n\nWe do not pause to consider whether Washington can be made a party to this proceeding; the present parties have not sought to bring her in and she has not sought to intervene. Those concerned with the defendants' decisions are free to bring appropriate actions as they see fit in those jurisdictions where venue is proper. We are satisfied, moreover, that the Supreme Court is not the sole forum for resolution of reapportionment suits against federal defendants, at least unless two states having adverse interests are indispensable parties to the action. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\" We turn, then, to the question whether Washington is an indispensable party to this proceeding in this forum.\n\nWashington stumbles at both hurdles to achieving indispensable party status. First, even assuming--as we will--that it is not feasible to join the State involuntarily because of her assertion of sovereign immunity, we cannot find her a necessary party under Fed. R. Civ. P. 19(a). See generally Pujol v. Shearson/American Express, Inc., 877 F.2d 132 (1st Cir. 1989). The relief sought, proper recertification by the defendants of House of Representative seat entitlements for each state, will be complete even in Washington's absence. More importantly, the interests of Washington, derived from the favorable census decisions of the defendants, are being fully and vigorously protected by the defendants themselves. And those defendants are no more subject to substantial risks of inconsistent judgments than is the federal government generally at any time it takes action of widespread consequence open to litigation throughout the nation.\n\nMoreover, even if Washington were to overcome the necessary party hurdle presented by Federal Rule of Civil Procedure 19(a), she is still unable to satisfy us that \"in equity and good conscience\" this action should be dismissed in her absence as a formal party under Rule 19(b). See generally Travelers Indemnity Co. v. Dingwell, 884 F.2d 629 (1st Cir. 1989). As a practical matter we see no prejudice to Washington. As we have noted, the defendants are vigorously protecting her right to an additional House seat as a result of their actions. Her concerns have been voiced to us directly through her amicus status. The parties before us recognize that relief in her absence will be adequate. And the unpalatable alternative--given Washington's refusal to participate in this forum--would be to remit the parties to the uncertainties and delay of proceeding in another forum, whether the Supreme Court through its questionable original jurisdiction, see supra note 10, or the Western District of Washington where Massachusetts would have to do what Washington will not do here: submit to a jurisdiction she otherwise objects to.\n\nWe recognize that other courts have been sensitive to the need to protect the interests of all states in census litigation and to the dangers of distortion presented when only one state seeks a census adjustment. See generally Carey v. Klutznick, 653 F.2d 732 (2d Cir. 1981), cert. denied, 455 U.S. 999, 71 L. Ed. 2d 865 (1982); Tucker v. United States Dep't of Commerce, 135 F.R.D. 175 (N.D.Ill. 1991), appeal pending, No. 91-2051 (7th Cir.). Unlike the procedures employed in those cases, all states here received notice of this litigation, and Washington actually presented her views directly to us. There was no impediment to the full and fair development of the facts as a result of Washington's absence. Furthermore, when, as here, the issues are narrowly framed and their resolution can be understood in terms of a single national policy automatically having an equal effect on all states, any residual potential for unfairness is minimized.\n\nIn short, we hold that the absence of the State of Washington--or any other state save Massachusetts--as a formal party to this case is not grounds to pretermit this proceeding.\n\nD. POLITICAL QUESTION\n\nIn their briefing of this case, the defendants have invited us to employ what has quite accurately been termed the \"amorphous and partly prudential doctrine of 'political questions,'\" Morgan v. United States, 255 App. D.C. 231, 801 F.2d 445, 447 (D.C.Cir. 1986) (Scalia, J.), cert. denied, 480 U.S. 911, 94 L. Ed. 2d 529, 107 S. Ct. 1359 (1987), as a device to avoid evaluating their apportionment actions. By this device, the defendants seek to have us abstain from judicial evaluation of the merits of the congressional choice of method for allocating seats in the House of Representatives. It appears, however, that the defendants do not argue for wholesale application of the political question doctrine in this context. In their briefing to the Supreme Court for the parallel Montana litigation, the defendants carefully asserted that they\n\ndo not suggest that all matters concerning the apportionment of Representatives among the States are necessarily nonjusticiable . . . But separation of powers principles--on which the political question doctrine rests--bar a court from setting aside Congress's selection of a particular method of apportionment that is not demonstrably contrary to . . . an explicit textual limitation on its discretion.\n\nBrief for Appellants, United States Dep't of Commerce v. Montana, U.S. No. 91-860, at 34-35.\n\nWe are less than entirely comfortable in relying upon the political question doctrine as an avoidance technique in the context of a reapportionment dispute. As a general proposition, we find considerable force in Professor Wechsler's view that:\n\nthe only proper judgment that may lead to an abstention from decision is that the Constitution has committed the determination of the issue to another agency of government than the courts. Difficult as it may be to make that judgment wisely, whatever factors may be rightly weighed in situations where the answer is not clear, what is involved is in itself an act of constitutional interpretation, to be judged by standards that should govern the interpretive process generally.\n\nWechsler, Toward Neutral Principles of Constitutional Law, 73 Harv. L. Rev. 1, 9 (1959). See also Henkin, Is There a \"Political Question\" Doctrine?, 85 Yale L.J. 597 (1976); but see Mulhern, In Defense of the Political Question Doctrine, 137 U.Pa.L. Rev. 97 (1988).\n\nNevertheless, the doctrine has been raised and not yet abandoned by the defendants as to the apportionment claim in this litigation. Moreover, \"although the Supreme Court has rarely applied the doctrine in recent years, it has also declined the several opportunities available to dispatch it. We [must] honor the doctrine and apply it here.\" Nixon v. United States, 290 App. D.C. 420, 938 F.2d 239, 246 (D.C.Cir. 1991) (citations omitted), reh. denied, 1991 U.S. App. LEXIS 25391 (D.C. Cir. 1991), petition for cert. filed, 60 U.S.L.W. 3376 (U.S. Nov. 4, 1991) (No. 91-740).\n\nThe modern formulation of the political question doctrine is found in Baker v. Carr, 369 U.S. 186, 7 L. Ed. 2d 663, 82 S. Ct. 691 (1962), where the Supreme Court held that a challenge presented to the apportionment of Tennessee's General Assembly did not involve a nonjusticiable political question. 369 U.S. at 209. Describing the doctrine as essentially a function of the separation of powers, the Court outlined six factors which may be observed in cases raising political question considerations:\n\nProminent on the surface of any case held to involve a political question is found [1] a textually demonstrable constitutional commitment of the issue to a coordinate political department; or [2] a lack of judicially discoverable and manageable standards for resolving it; or [3] the impossibility of deciding without an initial policy determination of a kind clearly for nonjudicial discretion; or [4] the impossibility of a court's undertaking independent resolution without expressing lack of the respect due coordinate branches of government; or [5] an unusual need for unquestioning adherence to a political decision already made; or [6] the potentiality of embarrassment from multifarious pronouncements by various departments on one question.\n\nUnless one of these formulations is inextricable from the case at bar, there should be no dismissal for nonjusticiability on the ground of a political question's presence. The doctrine of which we treat is one of \"political questions,\" not one of \"political cases.\" The courts cannot reject as \"no law suit\" a bona fide controversy as to whether some action denominated \"political\" exceeds constitutional authority. The cases we have reviewed show the necessity for discriminating inquiry into the precise facts and posture of the particular case, and the impossibility of resolution by any semantic cataloguing.\n\nId. at 217.\n\nAs our treatment of the merits in Section II of this opinion illustrates, \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\" inquiry into \"the precise facts and posture\" of the apportionment controversy satisfies us that, whatever the scope of the political question doctrine, it is not applicable here. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\" None of the six factors identified in Baker v. Carr as relevant to the question whether the political question doctrine may render the apportionment claim nonjusticiable is implicated in this case. Our extended inquiry has satisfied us that those factors, whether considered individually or together, are not a bar to our resolution of this dispute on the merits.\n\nFirst, and most fundamentally, while it is clear that the language of the Constitution has been understood implicitly to make the principal Constitutional commitment on the issue of apportionment a matter for the Congress itself, there are other Constitutional directives regarding apportionment. Indeed, several different Constitutional provisions come into play. Some are explicit, for example, that the allocation of House seats to the states must be \"according to their respective numbers.\" U.S. Const., art. I, § 2, cl. 3, amended by U.S. Const. amend. XIV, § 2. Other constitutional requirements are implicit, for example the reading given by Wesberry v. Sanders, 376 U.S. 1, 11 L. Ed. 2d 481, 84 S. Ct. 526 (1964) to Article I, Section 2, Clause 1 resulting in application of the \"one person, one vote\" principle to congressional redistricting. Congress must exercise its power over apportionment within the constraints of all the constitutional provisions which explicitly and implicitly govern congressional discretion in this area. And it is the responsibility of the courts to determine \"whether Congress has chosen a constitutionally permissible means of implementing that power.\" Immigration \u0026 Naturalization Serv. v. Chadha, 462 U.S. 919, 940-41, 77 L. Ed. 2d 317, 103 S. Ct. 2764 (1983).\n\nSecond, the standards for resolving this issue are both judicially discoverable and judicially manageable. The implementation of the \"one person, one vote\" principle in the courts over the last 25 years has generated a substantial body of case law and judicial experience which can be brought to bear in making an evaluation of a congressional apportionment judgment.\n\nWe note in this regard that the Supreme Court has recently found the most politically complex of reapportionment disputes, political gerrymandering, to be justiciable against a political question defense. See Davis v. Bandemer, 478 U.S. 109, 124, 92 L. Ed. 2d 85, 106 S. Ct. 2797 (1986).\n\nThird, judicial review does not involve a policy determination of a kind inappropriate for judicial discretion. The issue of apportionment is not beyond the scope of judicial discretion. Of course, the courts can and should avoid extraconstitutional policy making determinations in this area. But evaluation of consonance with the Constitution is the kind of task which is clearly meant for judicial determination. Marbury v. Madison, 5 U.S. 137, 176, 2 L. Ed. 60 (1803) (\"It is, emphatically, the province and duty of the judicial department, to say what the law is.\").\n\nFourth, the rendition of judicial judgment in an apportionment case hardly constitutes an expression of lack of respect for Congress. The responsibilities of the judiciary under our structure of separated and balanced powers necessarily involve the \"duty to review the constitutionality of Congressional enactments.\" United States v. Munoz-Flores, 495 U.S. 385, 110 S. Ct. 1964, 1968-69, 109 L. Ed. 2d 384 (1990). There is no disrespect intended nor understood when the courts exercise their duty in this manner.\n\nFifth, there is no unusual need for an unquestioning adherence to the decision previously made by Congress. Unlike national security matters, this is not an area of special sensitivity. The methodology for apportionment has been adjusted at various times throughout the history of the nation. Judicial examination to determine the constitutionality of such adjustments disturbs no need for repose in a decision previously made by Congress.\n\nFinally, we do not deal with the embarrassment of multifarious pronouncements by various departments on one question. To be sure, the defendants have sought to restyle this issue as raising the danger of different initial opinions from different inferior federal courts. That is a danger that arises whenever a congressional enactment of nation-wide impact is open to examination in various nisi prius venues. The ultimate decision, however, will be that of the Supreme Court. And there will be no multiplicity of ultimate judgment in this area. There is, of course, the possibility that the ultimate judgment of the judicial department through the Supreme Court will be at odds with that of Congress. But, this is neither lack of respect for the Congress nor an embarrassment for the country. Rather, it reflects the bedrock determination that our system of government leaves to the judiciary the duty \"to act as the ultimate interpreter of the Constitution.\" Powell v. McCormack, 395 U.S. 486, 549, 23 L. Ed. 2d 491, 89 S. Ct. 1944 (1969).\n\nII\n\nTHE APPORTIONMENT CLAIM\n\n\"Representatives shall be apportioned among the Several States according to their respective numbers. . .\"\n\nU. S. Const. art. I, § 2, cl. 3, amended by U.S. Const. amend. XIV, § 2. (emphasis supplied)\n\nAllocation of seats in the House of Representatives was at the heart of the bargain by which the several states agreed to enter into and remain a union. It was the issue central to successful drafting of the Constitution in 1787 and it was necessarily the subject of textual revision in 1868 during the rearrangement of the federal-state relationship brought about by the constitutional amendments of the Reconstruction era. Throughout the more than two centuries of this nation's history, the Congress has been the ultimate custodian of power to implement the constitutional bargain reflected by the allocation of House seats. Indeed, it was not until the most recent reapportionment in 1991 that a challenge was mounted in the courts to the congressional stewardship of this responsibility. The merits of such a challenge must be addressed in light of the relevant constitutional text and its necessary implications, the historical treatment of the issue in Congress, and the development of the \"one person, one vote\" principle in the courts.\n\nA. THE RELEVANT CONSTITUTIONAL TEXT AND ITS IMPLICATIONS\n\nArticle I, Section 2, Clause 1 of the Constitution provides that \"The House of Representatives shall be composed of Members chosen every second Year by the People of the several States.\" Clause 3 of Article I, section 2 provides for the allocation of those representatives among the several states. These provisions were the product of the Great Compromise, through which the divergent interests of the states were accommodated by providing a Senate in which each state was to be equally represented by two Senators, and a House of Representatives in which the representatives were to be \"apportioned among the several States which may be included within this Union according to their respective Numbers.\" Under clause 3, however, irrespective of their numbers, \"each State shall have at Least one Representative.\"\n\nAs adopted, Article I, section 2, clause 3 embodied the \"original sin\" of the new American commonwealth by recognizing the peculiar institution of slavery through an indirect, almost invisible and, consequently, profoundly insidious reference. The \"respective Numbers\" of the states were required to \"be determined by adding to the whole Number of free Persons, including those bound to Service for a Term of Years, and excluding Indians not taxed, three fifths of all other Persons.\" (emphasis supplied). The treatment of slaves as three fifths of other persons was another aspect of the Great Compromise in which the slave and non-slave holding states fashioned an accommodation regarding the relative advantages and disadvantages which would accrue to the states from the counting of slaves in a state's population.\n\nThe textual revolution in the Constitution following the Civil War was directed in part to the treatment of the former slave populations in Article I, Section 2, Clause 3. Section 2 of the Fourteenth Amendment repudiated the fractionation of persons. Instead the amendment provided: \"Representatives shall be apportioned among the several States according to their respective numbers, counting the whole number of persons in each State, excluding Indians not taxed.\" As with all of the Fourteenth Amendment--including the equal protection clause of § 1--Congress was given express enforcement powers over § 2 by § 5 of the amendment, which provided that \"the Congress shall have power to enforce by appropriate legislation, the provisions of this article.\"\n\nAlthough not express in clause 3 of Article I, section 2, two principles have been accepted without dispute as implicit in the text, the circumstances of its adoption and the structure of the Constitution. The first was that Congress itself would be responsible for the apportionment of the House of Representatives. As Justice Story observed: \"the power to apportion representatives, after . . . enumeration is made, is nowhere found among the express powers given to congress, but it has always been acted upon, as irresistibly flowing from the duty positively enjoined by the constitution.\" Prigg v. Pennsylvania, 41 U.S. 539, 619, 10 L. Ed. 1060 (1842). The second was that congressional districts were to be assigned by state and no congressional district would be drawn with constituents from more than one state.\n\nThe mathematics of apportioning representatives subjects the process to an irreducible condition. The division of any national population figure by the number of house seats to be apportioned, which is necessary for an allocation of representatives among the states, will, as a practical matter, invariably result in each state being allocated a whole number of representatives with a fraction left over. How to deal with the fractional remainder has been the historic challenge of the apportionment process as administered by Congress during the past two centuries.\n\nB. HISTORICAL DEVELOPMENT13\n\nNot surprisingly, given the centrality of the apportionment issue to the bargain for a union, the method of apportionment has been contested vigorously throughout the nation's history. Indeed, the method chosen by Congress after the first census in 1790 was the subject of the first presidential veto. President Washington, aware that the method championed by his Secretary of Treasury, Alexander Hamilton, and passed by the Congress was perceived to favor northern states at the expense of southern States, vetoed the measure after reference to two grounds which have shaped the discussion of congressional apportionment methodology ever since. The veto message expressed reservations first, about the lack of a clearly defined divisor or number of house seats to be apportioned and second, about the failure to delineate the number of persons each Representative would represent.\n\nThe choice of divisor and the correlative delineation of the number of persons each representative would represent became the defining features for apportionments thereafter. Since the first census in 1790 Congress has employed four methods for apportionment. What has distinguished each has been the manner of disposing of the fractional remainders after a divisor is employed.\n\nIn response to President Washington's veto Congress adopted the Jefferson method--or \"method of greatest divisors\"--for the apportionments which followed the censuses of 1790 through 1830. Under the method of greatest divisors, the population of each state was divided by an identified number of persons per representative. The resulting whole number would be the size of the state's congressional delegation and the fractional remainder would be disregarded. Thus, if the division yielded a result of 4.9, the state would still be entitled only to a congressional delegation of 4, just as would a state for which division yielded a result of 4.2. The precise result of the division, consisting of the whole number and the fractional remainder, is known as the state's House seat \"quota.\"\n\nBy continually increasing the size of the House of Representatives, certain regional tensions created by the greatest divisors (Jefferson) method were suppressed because no state had to confront a contracting number of representatives in its congressional delegation. Nevertheless, over time, the greatest divisors (Jefferson) method was seen to have a tendency to favor the larger states and following the 1830 census apportionment a number of other alternative methods were developed by New Englanders, a region perceived to have been disadvantaged by the greatest divisors (Jefferson) method. Former President John Quincy Adams, then sitting in the House of Representatives as a member of Congress from Massachusetts, proposed a method which was the mirror image of the greatest divisors (Jefferson) method. Under the smallest divisors (Adams) method, each state would receive an additional House seat for any fractional remainder no matter how small. Thus, if the division of each state's population by the identified number of persons per representative yielded a result of 4.2, the state would be entitled to a congressional delegation of 5, just as would a state for which division yielded a result of 4.9.\n\nMeanwhile, a University of Vermont professor of mathematics and astronomy, James Dean, proposed a more complex method--the \"method of harmonic means\"--under which a divisor would be chosen so that the whole numbers generated would create average constituencies for the congressional delegations of each state most closely approximating the divisor. The harmonic means of two numbers is their product divided by their average. The harmonic means (Dean) method can result in certain quotients being rounded up irrespective of whether the fractional division gave the state less than half or more than half an additional congressional seat.\n\nNeither the smallest divisors (Adams) method nor the harmonic means (Dean) method--both of which Montana has pressed in its litigation over the 1990 census apportionment--was ever adopted by Congress. However, yet another method--the \"method of major fractions\" devised by Senator Daniel Webster of Massachusetts--was adopted for the 1842 apportionment following the 1840 census. Under the major fractions (Webster) method, the fractional remainders after division of the state population by the chosen divisor would be allocated by providing one additional representative for each state having a fraction greater than one half.\n\nThe Congress departed from the major fractions (Webster) method with the 1850 census reapportionment. A third method, the \"method of greatest fractions\" advanced by Ohio Congressman Samuel F. Vinton involving a variation on the Hamilton method which President Washington had vetoed in 1792, was employed by the Congress initially in 1852. The greatest fractions (Vinton) method allocated additional Representatives to states having the largest fractional remainders after the whole numbers yielded by division were accounted for. The greatest fractions (Vinton) method had a disturbing paradox, however. Under certain circumstances, a state could receive fewer seats after the number of seats in the House was increased than it would have received if the seat number remained constant. This anomaly was presented most dramatically in the aftermath of the 1880 census when it was discovered that under the greatest fractions (Vinton) method, Alabama would receive eight seats if the House size was 299 but only seven seats if the House size were increased to 300.\n\nCongress used the greatest fractions (Vinton) method in 1862 and 1872 but avoided the paradox by allocating additional representatives beyond those generated through strict use of that method. Because of its concern over the need to adjust the greatest fractions (Vinton) method to avoid the population paradox, Congress began to use the major fractions (Webster) method as a cross check. In the apportionments following the 1880, 1890, and 1900 censuses, the House size was set to insure that no state would lose any House seat and would receive an additional seat for any major fractional remainder.\n\nThis effort proved especially demanding with the 1900 census when Congress was forced to experiment with projected House sizes ranging from 350 to 400 seats in order to understand the impact of apportionment on the projected congressional delegations, especially those of Maine and Colorado. The experiments revealed partisan and ideological fissures within the Congress as various groups sought to reinforce their voting strengths through the apportionment process.\n\nCongress returned to the major fractions (Webster) method in 1911 when it finally fixed House membership at 435 seats. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\" Having fixed the available seats for apportionment, however, the Congress created the conditions for an impasse in which there would be no safety valve of manipulating the number of House seats to reach an accommodation. Henceforth the states would be contesting rights in a limited pool of House seats. The impasse was confronted during the next reapportionment cycle.\n\nIn the reapportionment efforts following the 1920 census, increased industrialization and the mechanization of agriculture accelerated in a war economy caused dramatic demographic changes. The substantial migration from rural to urban areas appeared likely to lead to a loss of House seats by as many as ten states. The time-honored expedient of mitigating relative loss by increasing the size of the House failed, however, when a bill to increase the House size to 483 seats was rejected. Despite repeated but unsuccessful efforts by Congress to meet its constitutional mandate to reapportion after every census, the decade of the 1920's passed with the 1911 apportionment continuing as the basis for allocating seats to the House of Representatives.\n\nDuring the 1920's a sixth method of apportionment was fully articulated by Professor Edward V. Huntington of Harvard University, refining the work of Joseph A. Hill, a senior statistician at the Bureau of the Census. The method--which came to be known as the equal proportions (Huntington-Hill) method--sought to measure the disparities between state congressional delegations in relative terms. Thus, under the Huntington-Hill method, after the divisor provided by the size of the House was chosen, each state was assigned a number of seats so that no transfer of any one seat could reduce the percentage difference in representation between the states.\n\nIn an effort to break the impasse evidenced by the failure to effect a reapportionment following the 1920 census, House Speaker Nicholas Longworth asked the National Academy of Sciences (NAS) to evaluate the various known methods of apportionment. A panel of respected mathematicians chosen for the task reviewed five of the six methods which had evolved for dealing with the problem. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\" Four measures of equity can be found in the panel's analysis:\n\n1) Persons per representative (average district size) - the state's population divided by its number of representatives.\n\n2) Each person's share of a representative - the number of a state's representatives divided by its population.\n\n3) Representation surplus - the difference between (i) the number of representatives of an over-represented state, and (ii) the number of representatives of an under-represented state multiplied by the population of the over-represented state divided by the population of the under-represented state.\n\n4) Representation deficiency - the difference between (i) the number of representatives of an under-represented state, and (ii) the number of representatives of an over-represented state multiplied by the population of the under-represented state divided by the population of the over-represented state.\n\nMeasured in absolute terms in comparisons between any two states, four of the five methods were variously found to achieve most successfully one of these measures of equity. The harmonic means (Dean) method was most successful in reducing the absolute difference between the number of persons per representative. The major fractions (Webster) method was most successful in reducing the absolute difference between each person's share of a representative. The smallest divisors (Adams) method was most successful in reducing the absolute representation surplus, and the greatest divisors (Jefferson) method was most successful in reducing the absolute representation deficiency.\n\nWhen measured in relative terms, however, the equal proportions (Huntington-Hill) method was most successful in reducing the variation in both the number of persons per representative and in each person's share of a representative. Moreover, the NAS panel concluded that the equal proportions (Huntington-Hill) method among the five methods \"occupie[d] mathematically a neutral position with respect to emphasis on larger and smaller states.\" Accordingly, the NAS committee recommended adoption of the equal proportions (Huntington-Hill) method for congressional apportionment.\n\nAfter receipt of the NAS Report in 1929, the Congress passed an apportionment statute which provided that if no new apportionment method were agreed upon, the method of the last apportionment would be used. The 1929 apportionment statute was designed not merely to provide the previous method of apportionment as a default method in the absence of affirmative congressional action, it also required the President to transmit apportionment calculations based on the new census in light of both the major fractions (Webster) method and the equal proportions (Huntington-Hill) method. The reapportionment following the 1930 census proceeded relatively smoothly because both the major fractions (Webster) method and the equal proportions (Huntington-Hill) method led to the same allocations. Although Congress formally utilized the major fractions, it also in fact employed the equal proportions (Huntington-Hill) method at the same time.\n\nThe apportionment following the 1940 census brought matters to a head again, however, because the allocations produced by the two methods were the same except for two states. Under the equal proportions (Huntington-Hill) method, Arkansas, which was a predominantly Democratic state, would be entitled to seven Representatives and Michigan, which was a predominantly Republican state, to seventeen; under the major fractions (Webster) method, Arkansas would be entitled to six Representatives and Michigan to eighteen. In a straight partisan and parochial House vote, \"every Democrat, except those from Michigan voted [to establish the equal proportions (Huntington-Hill) method as the permanent method for calculating reapportionment allocations], and every Republican voted against.\" Balinski \u0026 Young, supra note 13, at 58. Ultimately, after further congressional consideration, the equal proportions (Huntington-Hill) method was signed into law as the permanent method for reapportionment.\n\nCongress has periodically initiated reexamination of the method of reapportionment since 1941. For example, in 1948 Congress requested from the NAS a report on \"developments in the mathematical aspects of the apportionment problem as it affects the Congress of the United States . . . .\" \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\" Three nationally prominent mathematicians re-examined the 1929 NAS study as well as other studies subsequently produced by others. In their 1948 report, the NAS mathematicians reaffirmed the NAS's 1929 findings, stating that the equal proportions (Huntington-Hill) method was the best method for \"minimizing the [percent] discrepancy in the state-averaged district populations and the individual's share in a representative,\" and that this method stood in a middle position (i.e., a mathematically neutral position) as compared to the other methods examined. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\"\n\nIn 1971 the Subcommittee on Census and Statistics of the House Committee on Post Office and Civil Service produced a report which described the methodology and procedures which are used to apportion representatives among the several states. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\" Although this report examined the historical developments which led to adoption of the equal proportions (Huntington-Hill) method, it contained no recommendation for changing that apportionment method.\n\nIn 1981 the Subcommittee on Census and Population of the House Committee on Post Office and Civil Service held a hearing on H.R. 1990, a bill which would have required revisions in the format and timing of certain decennial census reports issued by the Bureau of the Census. However, at the outset of the hearing, the Subcommittee Chairman noted that \"the question of the adequacy of the apportionment formula known as the equal proportions method enacted by Congress in 1941, overshadows any consideration of . . . minor technical changes in census procedures.\" He went on to observe that \"considerable technological advancements and methodological refinements\" had occurred since the enactment of the equal proportions (Huntington-Hill) method, which had \"potentially rendered equal proportion a less than precise method of satisfying the court imposed standards of equal representation.\" \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\"\n\nFollowing the 1981 hearing, no legislation was enacted to modify the authorized method for calculating the allocation of House seats. The equal proportions (Huntington-Hill) method, codified at 2 U.S.C. § 2(a), has thus remained--despite repeated congressional reexaminations--the authorized method for calculating the allocation of House seats; it was the method used to apportion congressional seats following the 1990 census.\n\nPursuant to the directions of § 2(a), a calculation of the House apportionment according to the equal proportions (Huntington-Hill) method based upon the 1990 census was prepared by the defendant officials of the Bureau of the Census and Department of Commerce and delivered to the President, who in turn transmitted this calculation to the Congress. The defendant Anderson, as Clerk of the United States House of Representatives, thereupon transmitted to the governors of the several states a certificate identifying the number of representatives to which that Governor's state would be entitled. The certificate received by the Governor of Massachusetts states that Massachusetts will be entitled to ten representatives, a loss of one member in its current congressional delegation.\n\nWe have rehearsed the history of congressional efforts to address the reapportionment question at some length to illustrate the extent of considered congressional involvement in the issue. The Constitutional command of decennial reapportionment coupled with the Congress's own institutional concerns has resulted in continuous, thoughtful, extensive and intensive examination of the problem by Congress throughout the past two centuries. While parochial and partisan interests have no doubt played their part in those deliberations--as they do in all legislation--it is apparent that Congress has carefully addressed itself to finding a method which implements the basic principle of assuring as nearly as practicable equal representation in the House of Representatives for equal numbers of people.\n\nThe question of practicability has, of course, been hotly debated, but the congressional resolutions of the issue throughout the nation's history have underscored the very practical measure of success enunciated by Justice Story in his Commentaries on the Constitution:\n\nThe truest rule seems to be, that the apportionment ought to be the nearest approximation to the terms of the constitution; and the rule ought to be such, that it shall always work the same way in regard to all the states, and be as little open to cavil, or controversy or abuse as possible.\n\nJ. Story, Commentaries on the Constitution § 676 (1833).\n\nC. JUDICIAL STANDARDS\n\nThe Supreme Court, after avoiding what had been perceived as the inhospitable \"political thicket\" of reapportionment disputes, Colegrove v. Green, 328 U.S. 549, 556, 90 L. Ed. 1432, 66 S. Ct. 1198 (1946) (Frankfurter, J.); see generally Lewis, Legislative Apportionment and the Federal Courts, 71 Harv. L. Rev. 1057 (1958), grasped the nettle in the 1960s and began developing a jurisprudence of reapportionment.\n\n1. State apportionment of federal congressional districts\n\nRelying on the requirement in Clause 1 of Article I, Section 2 that the members of the House be \"chosen by the People of the several States,\" the Court, speaking through Justice Black in Wesberry v. Sanders, 376 U.S. 1, 11 L. Ed. 2d 481, 84 S. Ct. 526 (1964), concluded that state legislatures were obligated to eliminate population disparities among their legislative districts in service of the principle that \"as nearly as is practicable one [person's] vote in a congressional election is to be worth as much as another's.\" Id. at 8. The Wesberry court stated that \"our Constitution's plain objective\" is \"making equal representation for equal numbers of people the fundamental goal for the House of Representatives.\" Id. at 18.\n\nWhatever the historical validity of the Court's decision to locate the otherwise unexpressed \"one person, one vote\" principle in Article I, Section 2, Clause 1, see generally Kelly, Clio and the Court: An Illicit Love Affair, 1965 S. Ct. Rev. 119, 134-37, the subsequent course of Supreme Court review of congressional districting by the states has been straightforward and mathematically demanding. In Kirkpatrick v. Preisler, 394 U.S. 526, 22 L. Ed. 2d 519, 89 S. Ct. 1225 (1969), the Court held that a state \"must justify each variance [of its congressional districts from the mathematical ideal], no matter how small.\" Id. at 531. This strict requirement was reaffirmed in White v. Weiser, 412 U.S. 783, 37 L. Ed. 2d 335, 93 S. Ct. 2348 (1973) and applied with great rigor in Karcher v. Daggett, 462 U.S. 725, 77 L. Ed. 2d 133, 103 S. Ct. 2653 (1983), where the Court held that when it is shown that population disparities among state-created congressional districts can be avoided, \"the State must bear the burden of proving that each significant variance between districts was necessary to achieve some legitimate goal.\" Id. at 731.\n\nAlthough potential justifications for avoidable population disparities are listed in Karcher, 462 U.S. at 740, the rigidity of the mathematics used in the Court's evaluation of congressional districting by states and the repeated refusal of the Court to find that any justification has been established both suggest that Justice Fortas was accurate when he ruefully reflected in Kirkpatrick v. Preisler on the single-mindedness with which the Court was prepared to reject \"every justification that has been--possibly, every one that could be--advanced.\" 394 U.S. at 537 (Fortas, J. concurring). Perhaps the most accurate statement of the law of state congressional apportionment is found in an observation by then Justice Rehnquist for the Court in a state legislative redistricting case: \"population alone has been the sole criterion of constitutionality in congressional redistricting under Art. I, § 2 . . .\" Mahan v. Howell, 410 U.S. 315, 322, 35 L. Ed. 2d 320, 93 S. Ct. 979 (1973). Given the present state of the law it is unlikely that any reapportionment plan established by a state for its congressional districts, however de minimis its disparities, will be upheld if another plan could be drafted which shows even more modest disparities.\n\n2. State apportionment of state legislative districts -\n\nIn contradistinction to judicial evaluation of federal congressional apportionment by the states, which proceeds under Article I, Section 2, Clause 1, judicial review of state apportionment of state legislative districts has its roots in the equal protection clause of the fourteenth amendment. \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\" Reynolds v. Sims, 377 U.S. 533, 12 L. Ed. 2d 506, 84 S. Ct. 1362 (1964) stated the requirement broadly by holding \"that a State [must] make an honest and good faith effort to construct districts . . . as nearly of equal population as is practicable.\" Id. at 577. In implementing this requirement, the Supreme Court has articulated a somewhat more deferential approach to mathematical disparities found in apportionments developed for a state's own legislative apportionments than is found in the approach to state congressional apportionments.\n\nAs we noted recently when dealing with a state legislative apportionment dispute:\n\nFederal courts are prepared to tolerate modest deviations from statistically ideal [state] electoral districts. In this connection a ten percent total deviation, computed by adding the individual deviations of the largest and the smallest districts from the ideal district has been developed to mark the upper limit of the de minimis acceptable range for divergence from population equality. See Brown v. Thomson, 462 U.S. 835, 842-43, 77 L. Ed. 2d 214, 103 S. Ct. 2690 (1983). Justification, however, will be required to uphold deviations of more than ten percent because \"a State's policy urged in justification of disparity in district population, however rational, cannot constitutionally be permitted to emasculate the goal of substantial equality.\" Mahan v. Howell, 410 U.S. 315, 326, 35 L. Ed. 2d 320, 93 S. Ct. 979 (1973).\n\nBlack Political Task Force v. Connolly, 679 F. Supp. 109, 114 (D.Mass. 1988) (three-judge court).\n\nThe Supreme Court has suggested that the differential degree of deference accorded state congressional apportionment decisions, as opposed to purely state legislative apportionments, is a consequence of the different constitutional sources of the mandates for population equality in those respective apportionments. Gaffney v. Cummings, 412 U.S. 735, 741-42, 37 L. Ed. 2d 298, 93 S. Ct. 2321 (1973) (\"there are fundamental differences between congressional districting under Art. I . . . and state legislative reapportionments governed by the Fourteenth Amendment\"). Although not fully articulated by the Court, those differences appear to relate to the role the several states play in the respective apportionment processes.\n\nUnder Article I, Section 2, the state acts as delegatee of the federal government in implementing a matter of federal governmental organization. The federal government is entitled to exercise strict control over the incidents of its own structure. Through its construction of Clause 1, and in the absence of action by the Congress, \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\" the Supreme Court has read the constitutional text to provide that strict control. By contrast, the states are entitled to some latitude in defining the way in which they accommodate the various interests which come into play when they organize their own governmental structures. In arranging their own structures the states are not functioning as the delegatees of another sovereign but rather are implementing their own policies. State judgments under such circumstances are entitled to greater judicial consideration and deference.\n\n3. Congressional apportionment of congressional seats -\n\nIn the instant case, we deal with a dimension to reapportionment not previously addressed by the Supreme Court: the congressional responsibility for apportionment of its own institution. This is a responsibility which has elements of the structural considerations involved in both state congressional districting and a state's own legislative districting. The structure of the assignment of power strongly suggests that deference be shown by the courts to the congressional determination. Congress is no mere delegatee assigned to carry out the apportionment policies of a separate sovereign; rather it is the department of government which, as Justice Story recognized in Prigg v. Pennsylvania, exercises powers in respect to congressional reapportionment \"irresistibly flowing from the duty positively enjoined by the constitution.\" 41 U.S. at 619 . Moreover, after Justice Story wrote, Congress was granted express constitutional authority to make reapportionment determinations. Clause 3 of Article I, Section 2 as amended by section 2 of the Fourteenth Amendment is expressly the subject of congressional authority by virtue of section 5 of that Amendment, which provides that \"the Congress shall have power to enforce, by appropriate legislation, the provisions of this article.\"\n\nThe majority opinion of the only court to address the question of congressional apportionment of congressional seats, the District of Montana, has chosen to import the constitutional imperatives of state congressional reapportionment decisionmaking into its review of congressional apportionment by adopting wholesale the method of state congressional redistricting analysis applied in Karcher v. Daggett. Montana v. United States Dep't of Commerce, 775 F. Supp. at 1363-64. The dissent in the Montana litigation, while recognizing that Karcher was not \"directly applicable,\" nevertheless suggested that the Karcher \"burden shifting scheme . . . provide[s] a helpful analytic framework for evaluating the claims brought before us.\" Id. at 1368.\n\nWe are not persuaded that wholesale assimilation of the Karcher analysis into evaluation of congressional apportionment judgments is appropriate for the task. The congressional judgment on this issue, as we have noted, has not yet been the subject of Supreme Court direction, and greater consideration of the distinctive qualities of such a judgment by a separate and coequal branch appears to be required.\n\nAt the outset we face the question of standard of review. Previous apportionment case law provides no definitive guidance. As we recently observed, \"despite over a quarter century of litigation in this area, uncertainty remains concerning the proper standard of review for reapportionment plans.\" Black Political Task Force v. Connolly, 679 F. Supp. at 113. Yet, whatever uncertainty surrounds the problem of federal judicial review of state decisionmaking, the congressional judgment here falls into a different but familiar pattern. As an aspect of its exercise of enforcement powers under Section 5 of the Fourteenth Amendment, the congressional judgment regarding the implementation of the mandate of Section 2 of that Amendment--that House seats must be apportioned to the states \"according to their respective numbers\"--proceeds from \"a positive grant of legislative power authorizing Congress to exercise its discretion in determining whether and what legislation is needed to secure the guarantees of the Fourteenth Amendment.\" Katzenbach v. Morgan, 384 U.S. 641, 651, 16 L. Ed. 2d 828, 86 S. Ct. 1717 (1966). Thus, the standard of review here should be derived from\n\nthe classic formulation of the reach of [Congressional] powers . . . established by Chief Justice Marshall in McCulloch v. Maryland, 4 Wheat. 316, 421: \"Let the end be legitimate, let it be within the scope of the constitution, and all means which are appropriate, which are plainly adapted to that end, which are not prohibited, but consist with the letter and spirit of the constitution, are constitutional.\"\n\nId. at 650.\n\nWe need not be drawn into the thorny debate over the precise scope of congressional power under Section 5. See, e.g., EEOC v. Wyoming, 460 U.S. 226, 251-59, 75 L. Ed. 2d 18, 103 S. Ct. 1054 (1983) (Burger, C.J., dissenting); Fullilove v. Klutznick, 448 U.S. 448, 65 L. Ed. 2d 902, 100 S. Ct. 2758 (1980); Oregon v. Mitchell, 400 U.S. 112, 27 L. Ed. 2d 272, 91 S. Ct. 260 (1970). This is because the exercise of Section 5 powers here in defining the methodology for reapportionment falls squarely within the settled recognition of the competence of Congress as a legislative fact finder. As Professor Cox has observed, the courts have \"long been committed both to the presumption that facts exist which sustain congressional legislation and also to deference to congressional judgment upon questions of degree and proportion.\" Cox, Foreword: Constitutional Adjudication and the Promotion of Human Rights, 80 Harv. L. Rev. 91, 107 (1966).\n\nThe plaintiffs contended at oral argument that the standard \"is essentially strict scrutiny or, put another way, the extraordinary rigor applied by the federal courts to apportionment challenges. It's that sort of very, very strict type of standard to determine whether or not the method produces the most equal congressional districts that it can produce.\" As a consequence, plaintiffs contend \"there shouldn't be any extraordinary deference to Congress.\" To the extent that plaintiffs' proposed standard of \"extraordinary rigor\" would require, more readily than McCulloch anticipates, that courts interpose a judicial judgment for one of Congress, we reject it.\n\nThe defendants for their part contend that our review must be wholly deferential unless the congressional judgment offends some express textual limitation in the Constitution. To the extent that this formulation is intended to exclude from our consideration the \"one person, one vote\" principle derived in Wesberry from the perceived intent which animated the words \"by the People of the several States\" in Article I, Section 2, Clause 1, we reject the defendants' efforts to narrow the limitations on congressional action. Rather, we believe the \"one person, one vote\" principle is implicit in the letter and animates the spirit of the Constitutional requirements on this question. We turn then to an evaluation of whether the means chosen for giving expression to the Constitution's apportionment directives by Congress in § 2a are \"plainly adapted to that end [and] are not prohibited.\" McCulloch, 17 U.S. at 421 .\n\nD. THE CONSTITUTIONALITY OF THE CONGRESSIONAL JUDGMENT\n\nThe Montana court majority embraced the harmonic means (Dean) method of apportioning House seats among the states as the single constitutionally acceptable methodology for achieving that task. The plaintiffs here contend that the major fractions (Webster) method is the sole constitutionally acceptable methodology. Congress has adopted neither but has instead chosen the equal proportions (Huntington-Hill) method and codified it in 2 U.S.C. § 2(a). We will not disturb the congressional choice. While other choices may also be permitted, the one Congress actually made is not prohibited by the Constitution. And it is plainly adapted to the end of approximating as close as practicable the goal of \"one person, one vote.\"\n\nThe Montana court's determination was a conclusion from the following syllogism:\n\nThe ideal district reflects the size of each district if it were possible to truly achieve equal representation for equal numbers of people--the goal mandated by the Constitution. Any difference from the ideal reflects unequal representation. Thus, absolute difference from the ideal district is the proper criterion to use in determining whether Congress has met the goal of equal representation.\n\nMontana v. United States Dep't of Commerce, 775 F. Supp. at 1364. Because, as the 1928 NAS study observed, the harmonic means (Dean) method is most successful in achieving the measure of equity reflected by absolute difference in the number of persons per representative, the Montana court concluded the matter Q.E.D. as to the singular constitutionality of the Dean method.\n\nThe plaintiffs in this case offer a different syllogism. Plaintiffs argue in their reply submission\n\nthat the constitutional requirement of \"one person, one vote\" is best met by minimizing the absolute difference between each person's share of a representative. As defendants have conceded, the Webster method is \"optimal\" with respect to this measure of inequity. The Webster method, therefore, best satisfies the requirements for a constitutional apportionment formula.\n\nPlaintiffs' Reply to Defendants' Memorandum in Opposition to Plaintiffs' Motion for Summary Judgment at 5 (citations omitted). Thus, because, as the 1928 NAS study observed, the major fractions (Webster) method is most successful in achieving the measure of equity reflected by absolute difference between each person's share of a representative, the plaintiffs would have us conclude the matter Q.E.D. as to the singular constitutionality of the Webster method.\n\nThe NAS Report relied upon by Congress by contrast found that the equal proportions (Huntington-Hill) method was optimal in relative terms in reducing the variation between the number of persons per Representative and each person's share of a Representative.\n\nThe Montana court and the plaintiffs treat the issue as if it were capable of resolution by resort to dispositive mathematical formulae. But the real world environment in which these formulae are employed makes strict mathematical equality an elusive--and illusory--goal. As Judge O'Scannlain observed in his Montana dissent:\n\nthe standard of precise numerical equality announced in [Wesberry and Karcher] is impossible to apply. We engage in a fundamentally different inquiry. Although population equity among districts is a guiding principle, because of the constraints imposed by the Constitution it is impossible to have districts that are even approximately equal in size. Indeed, application of any of the apportionment formulae before this court results in congressional district populations varying by hundreds of thousands of people between states.\n\nMontana v. United States Dep't of Commerce, 775 F.Supp at 1369 (O'Scannlain, J. dissenting).\n\nMore importantly, we can find nothing in the Constitution mandating that a particular mathematical formula be employed to the exclusion of others. If, as Justice Holmes reminded us, \"the Fourteenth Amendment does not enact Mr. Herbert Spencer's Social Statics,\" Lochner v. New York, 198 U.S. 45, 75, 49 L. Ed. 937, 25 S. Ct. 539 (1905) (Holmes J., dissenting), we find it difficult to believe that Article I, Section 2 enacted a particular mathematical formula to the exclusion of other approaches for obtaining equality \"as nearly as is practicable,\" Wesberry v. Sanders, 376 U.S. at 8. Indeed, the plaintiffs' expert in his writings has asked and accurately answered the largely unanswerable rhetorical question in this regard: \"Why choose . . . one divisor criterion [rather] than another? . . . There is no a priori justification for choosing one test or measure of inequality over another.\" Balinski \u0026 Young, The Quota Method of Apportionment, 84 Am. Mathematical Monthly 701, 709 (Aug.-Sept. 1975).\n\nIn all this, the plaintiffs' fundamental proposition--shared, albeit with a different formula, by the Montana court--is that apportionment equality is to be measured on an absolute and not a relative basis. But, that has not been the exclusive--or even the principal--grounds on which the federal courts have evaluated apportionment equality in the infinitely less mathematically complex environment of intrastate apportionment controversies. Rather, the courts have consistently measured equality by relative departures from the ideal district. For example, in each of the apportionment cases cited by the Montana court itself, 775 F. Supp. at 1364, relative differences from the ideal are used as a critical element of evaluation. We have ourselves employed that measure in previous redistricting litigation. Black Political Task Force v. Connolly, 679 F. Supp. at 123-25. We are satisfied that relative measurement is a mathematically acceptable means by which to make equity comparisons and nothing in the case law requires decision makers to disregard it. Certainly nothing in the Constitution prohibits it.\n\nPlaintiffs have focused their attack on the congressionally approved equal proportion (Huntington-Hill) method by arguing that, as against the major fractions (Webster) method, the equal proportions (Huntington-Hill) method has been demonstrated to be biased against larger states. The plaintiffs' historical bias argument depends upon certain assumptions about how to treat the smallest states, which receive at least one congressional seat irrespective of their population. When the core assumption used here by plaintiffs' expert--that only those states with a quota less than .5 should be excluded--is modified to exclude states with quotas below 1.0, the historical bias showing made by plaintiffs all but evaporates. Moreover, it appears that for the current apportionment at issue in this case the equal proportions (Huntington-Hill) method yields a percentage bias closer to 0 than would the major fractions Webster method.\n\nIn light of the special constitutional protection afforded small states with the guarantee of one House seat--and given the willingness of plaintiffs' own expert to use the 1.5 exclusion assumption himself when working with the data on behalf of the Congressional Research Service of the Library of Congress \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\" --we find that the use of any exclusion--at least up to a quota of 1.5--as a means of accounting for the special treatment of small states is reasonable. Thus, plaintiffs' bias arguments do not demonstrate the equal proportions (Huntington-Hill) method to be unconstitutional.\n\nPlaintiffs other principal argument is based on departures from quota. But the showing here is at best mixed. It is the greatest fractions (Vinson) method--with its unacceptable potential for population paradoxes--which is most successful in minimizing departures from quota. The major fractions (Webster) method does bring every pairing of states as near as possible to their quota in absolute terms and in terms of the percentage difference of a state's House seat allocation from its exact quota. However, the equal proportions (Huntington-Hill) method is more successful in minimizing the relative difference between a state's House seat allocation and its exact quota.\n\nWe have briefly canvassed the respective arguments for the various methods to illustrate that this is a question which has generated lively and learned dispute among skilled mathematicians. They variously rely upon competing formulae, methodologies and standards. We share the view expressed by Professor Young in 1981 testimony before the House Subcommittee on Census and Population, that the question presented \"is a complex problem and some of the Nation's finest mathematicians have foundered on it. There is no perfect method. There is no method that satisfies all possible criteria of reasonableness.\" Census Activities and the Decennial Census: Hearing on H.R. 1990 Before the Subcomm. on Census and Population of the House Comm. on Post Office and Civil Service, 97th Cong., 1st Sess., 43 (1981) (Statement of Peyton Young).\n\nWe do not find in this extraordinarily technical dispute any basis for engrafting on the Constitution mathematical prescriptions as to formulae, methodology or standards. The Constitution does not prescribe a particular formula, a specific methodology or a set standard to embody the \"one person, one vote\" principle in this complex setting.\n\nIt is apparent that Congress has confronted the technical dispute at issue before us directly and it has returned to it with some regularity. It has chosen one reasonable method to ensure that in the apportionment of House seats among the states as near as is practicable one person's vote in a congressional election will be worth as much as another's. Congress having adopted a method which is appropriate--if not singularly so--to that end and not, in any event, prohibited by the Constitution, we have no authority to interpose a different method. The equal proportions (Huntington-Hill) method chosen by Congress embodies the letter and spirit of the \"one person, one vote\" principle. The Courts can ask no more of the Congress.\n\nIII\n\nTHE OVERSEAS CENSUS CLAIMS\n\n\". . . counting the whole numbers of persons in each State. . . The Actual Enumeration shall be made . . . in such Manner as [the Congress of the United States] shall by law direct.\"\n\nU. S. Const. art. I, § 2, cl. 3 (emphasis supplied)\n\nThe census is the foundation upon which congressional apportionment is undertaken. Accounting for the United States population in the census involves two sets of rules: 1) enumeration rules, which determine who should be counted; and 2) residence rules, which determine where they should be counted. Congress has delegated to the Secretary of Commerce and the Bureau of the Census the authority to establish those rules. In developing residence rules for the 1990 census, the Secretary reversed the historic practice for counting overseas government personnel. Despite conceded limitations in the data used to do so, the Secretary chose for 1990 to allocate overseas personnel to the several states for residence purposes. This allocation was sufficient to provide the State of Washington with an additional congressional seat while reducing the Massachusetts congressional delegation by one seat. The plaintiffs contend that the Secretary's reversal of the overseas personnel residence rule was arbitrary and capricious and a violation of the constitutional requirement that residence for apportionment purposes requires \"counting the whole numbers of persons in each state.\" U.S. Const. art. I, § 2, cl. 3 (emphasis supplied).\n\nIn order to address the merits of plaintiffs' claims, we first turn to the relevant texts and their implications, followed by a discussion of the historical census practice--particularly the implementation of \"usual residence\" concept by those charged with administering the census program. We then address the standards for judicial review of census practices before considering the propriety of the Secretary's action. binding the Secretary's action improper, we outline a conditional remedy.\n\nA. THE RELEVANT CONSTITUTIONAL AND STATUTORY TEXTS AND THEIR IMPLICATIONS\n\nThe requirement of Article I, Section 2, Clause 3, that a census be conducted every ten years in such a manner as Congress shall by law direct is focused upon the need to have accurate population figures with which to apportion seats in the House of Representatives. But that core focus has not been treated as a constraint on the range of the congressional census powers. As the Supreme Court noted less than a century after the Constitution was enacted:\n\nThe Constitution orders an enumeration of free persons in the different States every ten years. The direction extends no further. Yet Congress has repeatedly directed an enumeration not only of free persons in the States but of free persons in the Territories, and not only an enumeration of persons but the collection of statistics respecting age, sex, and production. Who questions the power to do this?\n\nKnox v. Lee ( The Legal Tender Cases, 79 U.S. 457, 536, 20 L. Ed. 287 (1871). And, as the Court recently observed,\n\nAlthough the national census mandated by Art. I, § 2, of the Constitution fulfills many important and valuable functions for the benefit of the country as a whole, its initial constitutional purpose was to provide a basis for apportioning representatives among the states in the Congress. The census today serves an important function in the allocation of federal grants to states based on population. In addition, the census also provides important data for Congress and ultimately for the private sector.\n\nBaldrige v. Shapiro, 455 U.S. 345, 353, 71 L. Ed. 2d 199, 102 S. Ct. 1103 (1982).\n\nCongress has delegated its census authority to the Secretary of Commerce (\"the Secretary\") by the Census Act, 13 U.S.C. §§ 141 et seq., which permits the Secretary to conduct the decennial census \"in such form and content as he may determine.\" Id. at § 141(a). The first Census Act was enacted in 1790 by the First Congress, in response to the Apportionment Clause's mandate that the first decennial census be conducted within three years of the adoption of the Constitution. The Census Act of 1790 enunciated the \"usual residence\" concept:\n\nThat every person whose usual place of abode shall be in any family on the aforesaid first Monday in August next, shall be returned as of such family and the name of every person, who shall be an inhabitant of any district, but without a settled place of residence, shall be inserted in the column . . . which is allotted for heads of families, in that division where he or she shall be on the said first Monday in August next and every person occasionally absent at the time of the enumeration [shall be returned] as belonging to that place in which he usually resides in the United States.\n\nAct of Mar. 1, 1790, § 5, 1 Stat. 101, 103.\n\nThe parties have stipulated that, while the current version of the census legislation does not contain an express \"usual residence\" provision, \"since the first census in 1790, the Census Bureau has used the concept of 'usual residence' as the guiding principle in formulating enumeration and residence rules for the conduct of each census.\" This principle directs that persons should be included in the census residence counts at the place where they are living and sleeping most of the time, as of the date that the census is taken.\n\nB. HISTORICAL DEVELOPMENT23\n\nIt appears that the question of how to allocate for apportionment purposes Americans serving abroad at the time of the census was not considered by the drafters of the Constitution. Indeed, there is\n\nno indication that the members of the Constitutional Convention had in mind any specific criteria by which persons were to be deemed residents of one State rather than another. It is most likely that they thought in terms of an average inhabitant, whose actual location at the time of the census, domicile, and legal residence would be the same. The fringe problem of persons actually living on the date of the census in places other than the places of their domicile or legal residence was not considered.\n\nBorough of Bethel Park v. Stans, 319 F. Supp. 971, 974 (W.D.Pa. 1970), aff'd, 449 F.2d 575 (3d Cir. 1971).\n\nThe question of counting American military personnel not serving in one of the United States, however, has been addressed with relative consistency throughout the two centuries of this country's history. With the exception of 1970 and 1990, such persons have been counted where they are serving but have not been allocated to individual states for apportionment purposes. \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\"\n\nFrom the nation's beginning, there have been soldiers posted to duty stations outside the admitted states of the Union. Throughout the nineteenth century, those persons serving at forts and posts in the western territories, for example, were counted where they were stationed. Similarly, despite the apparent short-run political disadvantage to the states which had not been a part of the Confederacy, northern troops serving in the occupied southern states were apparently counted in 1870 at their sites of posting in the former Confederacy. \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\"\n\nIn 1880, a residence instruction to census enumerators--adopted formally for the 1850 census and thereafter--which treated a military garrison as a separate household for purposes of residence counts, was crystallized in an express special instruction for military personnel. This instruction provided that \"all soldiers of the U.S. Army, and civilian employees, and other residents at posts or military reservations will be enumerated in the district in which they reside, equally with other elements of the population.\" Land-based members of the military, including the Coast Guard, continue to be counted where they are permanently stationed, provided it is within the United States or its territories.\n\nCommencing with the census in 1900, \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\" all overseas federal personnel were counted at their duty stations as part of the nation's total population but were not allocated to states for apportionment purposes. In a 1949 opinion rendered for the Director of the Census, the Attorney General of the United States determined the practice of not allocating overseas military personnel to particular states to be\n\na practical interpretation of the legislation governing the decennial censuses by the official charged with the execution of that legislation. He has consistently followed the practice in question over a long period of time, and it has not been challenged in Congress or elsewhere.\n\nThe Attorney General concluded that the practice was well within the Census Bureau's discretion.\n\nDuring the peak of the Vietnam War in 1970, the Census Bureau modified this consistent practice by choosing for the first time in the nation's history to allocate overseas personnel to the states for congressional apportionment--but no other--census purposes, on the basis of the employee's designation of a \"home state\" in administrative records maintained by the employing federal agency. This reversal was preceded by an 1969 opinion letter from the Assistant Attorney General for the Office of Legal Counsel, expressing the view \"that the Director of the Census may, in his discretion, validly adopt that procedure.\" This opinion letter was premised on the assumption that \"the factors which led to the Director's former practice with regard to enumeration of persons living abroad--primarily, difficulties in securing reliable information and substantial expenses of allocation--are now largely inapplicable.\" In the wake of the 1970 census, it became clear that the assumption upon which the 1969 opinion was based was not settled.\n\nFollowing the 1970 census, the Census Bureau expressed the view that the agency administrative records purporting to show \"home state\" were of \"unknown reliability.\" This lack of reliability, coupled with the substantial reduction in the number of Americans serving abroad, led the Census Bureau to announce in 1975 that it had determined not to include overseas military in future apportionment counts, but to include them only in the overall count of the American population.\n\nThus, the 1980 census returned to the historic practice under which overseas federal employees were not included in the apportionment counts. The planning for the 1990 census initially anticipated that the same historic practice would be employed again. In a 1987 Policy Paper defining the enumeration and residence rules for the 1990 census, the Census Bureau stated it would \"not include [counts of military personnel and their dependents living overseas and of federal civilian employees and their dependents living overseas] in the official totals for the states since the assignment to geography would be arbitrary and operationally difficult.\"\n\nDespite subsequent congressional interest in modifying this historic practice, as evidenced by a number of proposed bills--none of which were enacted--seeking to require the inclusion of overseas military personnel in apportionment counts, the Census Bureau and the Department of Commerce continued to maintain throughout 1987, 1988 and well into 1989 that the 1990 census counts for apportionment would not and should not include military personnel living outside the United States on the census day. The Acting Assistant Attorney General for the Office of Legislative Affairs of the Department of Justice, in commenting on proposed legislation in 1988, even expressed \"serious doubts as to the constitutionality of any legislation that would seek to include for apportionment purposes military personnel, DOD civilian employees, or their dependents when such individuals live outside the United States.\" \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\"\n\nIn an about-face, however, on July 31, 1989, defendant Secretary Mosbacher decided that the 1990 census would include counts of overseas federal employees for purposes of congressional apportionment. Mosbacher adopted a two-page decision memorandum setting forth three basic factors for the reversal of policy.\n\nFirst, from a political perspective, the memorandum proposed \"to satisfy what appears to be a growing bipartisan concern of the Congress and to avoid unnecessary debate.\"\n\nSecond, from a factual perspective, the memorandum reported that the Department of Defense would be conducting a census of its military and civilian employees and consequently \"it is now feasible to provide the necessary counts of usual residents\" in a timely manner.\n\nThird, from a legal perspective, the memorandum referred to the 1969 opinion letter of the Assistant Attorney General rendered in connection with the 1970 census, concluding that such a policy decision was in the discretion of the Director of the Census.\n\nThe decision to reverse the historic overseas personnel census policy and incorporate a practice used once and then immediately abandoned in the next and most recent census was premised on one factual--as opposed to political or legal--assumption: the expectation of better procedures by the Department of Defense. That assumption was shortly thereafter undermined. In December 1989 the Defense Department cancelled its planned census of military and civilian employees. Following unsuccessful efforts to identify other means to determine the usual residence of overseas military personnel, the Census Bureau and Department of Defense finally returned again to the basis used in, and then dropped after, the 1970 census--the \"home of record\" listed in Defense Department records--as the method for apportioning overseas personnel.\n\nAlthough the core of the overseas census counts was the \"home of record\" data contained in Department of Defense records for military personnel, augmentation was necessary to complete the overseas counts. Thus, if the Defense Department had no home of record for a member of the military, the Department would use the member's legal residence or, failing that, the last duty station. Even after that augmentation, 1,846 military personnel and dependents who were counted in the census could not be apportioned to states because their home states could not be determined.\n\nEfforts to allocate civilian overseas personnel for apportionment purposes were even less complete. Lacking any home of record information for its civilian personnel, the Defense Department circulated questionnaires to 61,205 of these personnel. The dependents of these employees were to be assigned on the basis of the employee responses. Only approximately twenty percent of the civilian employees completed the questionnaires. Consequently, some eighty percent of civilian Defense Department overseas personnel and their associated dependents were not assigned to a state for apportionment purposes.\n\nMeanwhile, of the forty federal agencies asked to submit counts of their overseas employees for apportionment purposes, only thirty actually did so. And of these thirty, only twenty included dependents. Four of the thirty agencies reporting could not provide a home state for all their overseas employees.\n\nc. JUDICIAL STANDARDS\n\nThe Supreme Court has not had occasion to address what standards, if any, are available to employ in judicial review of Census Bureau determinations. The proliferation of litigation during the past quarter century presenting challenges to census procedures, methods and results has, however, more or less consistently relied upon familiar standards of review. These are essentially the \"arbitrary and capricious\" and \"abuse of discretion\" standards codified in the Administrative Procedure Act, 5 U.S.C. § 706(2)(A). See, e.g., City of New York v. United States Dep't of Commerce, 713 F. Supp. 48, 54 (E.D.N.Y. 1989) (arbitrary and capricious); Cuomo v. Baldrige, 674 F. Supp. 1089, 1105 (S.D.N.Y. 1987) (arbitrary and capricious); City of Willacoochee v. Baldridge, 556 F. Supp. 551, 555 (S.D.Ga. 1983) (arbitrary and capricious); Carey v. Klutznick, 508 F. Supp. 420, 430 (S.D.N.Y.) (arbitrary, capricious or an abuse of discretion), aff'd, 637 F.2d 834, 838-39 (2d Cir. 1980) (\"reviewable as to reasonableness of or irrational basis for methods used\") (citation omitted); City of Philadelphia v. Klutznick, 503 F. Supp. 663, 677 (E.D.Pa. 1980) (\"free of arbitrariness, capriciousness and fraudulent conduct\"); Borough of Bethel Park v. Stans, 319 F. Supp. at 977 (\"procedure has a rational basis and represents a proper exercise of discretion\"), aff'd, 449 F.2d 575, 579 (3d Cir. 1971) (\"failure to apply the proper criterion in a reasonable manner or its application lacked a rational basis\"); West End Neighborhood Corp. v. Stans, 312 F. Supp. 1066, 1068 (D.D.C. 1970) (rational basis); Quon v. Stans, 309 F. Supp. 604, 607 (N.D.Cal. 1970) (\"not irrational, arbitrary, or capricious\").\n\nDespite this substantial body of lower court authority for a rational basis, arbitrary and capricious, or abuse of discretion standard in the review of Census Bureau actions, the defendants argue that their actions are not subject to judicial review at all. Relying upon Webster v. Doe, 486 U.S. 592, 100 L. Ed. 2d 632, 108 S. Ct. 2047 (1988), the defendants contend that judicial review of the choice of where to assign the residence of overseas personnel is barred under the Administrative Procedure Act. Defendants further contend that to the degree judicial review is available, their decisions with respect to the overseas census apportionment count were rational, were not arbitrary and capricious or an abuse of discretion and hence, were not violative of either the Administrative Procedure Act or the Constitution.\n\nD. THE IMPROPRIETY OF THE ADMINISTRATIVE ACTION\n\n1. The Inapplicability of Section 701(a)(2)\n\nIn Webster, the Supreme Court addressed the standards for determining whether a dispute over a federal agency determination fell within the \"very narrow exception,\" Citizens to Preserve Overton Park v. Volpe, 401 U.S. 402, 410, 28 L. Ed. 2d 136, 91 S. Ct. 814 (1971), provided by the Administrative Procedure Act, 5 U.S.C. § 701(a)(2), barring judicial review of \"agency action . . . committed to agency discretion by law.\" Relying on Heckler v. Chaney, 470 U.S. 821, 830, 84 L. Ed. 2d 714, 105 S. Ct. 1649 (1985), for the proposition that \"review is not to be had if the statute is drawn so that a court would have no meaningful standard against which to judge the agency's exercise of discretion,\" the Webster court reaffirmed the requirement that evaluation under § 701(a)(2) requires \"careful examination of the statute on which the claim of agency illegality is based.\" 486 U.S. at 600.\n\nThe basic grant of statutory authority to conduct the census is plainly drawn in discretionary terms. Section 141(a) of Title 13 vests discretion in the Secretary of Commerce to take the census \"in such form and content as he may determine.\" Standing alone, this is a statutory grant which \"fairly exudes deference,\" Webster v. Doe, 486 U.S. at 600, to the Secretary. But it is not the only statute providing governing law. Section 141(b) imposes on the Secretary a duty to perform a \"tabulation of the total population by states . . . as required for the apportionment of Representatives in Congress among the several states.\" The purpose of that statutory duty is to permit the President to meet his statutory obligation under 2 U.S.C. § 2(a) of transmitting \"to the Congress a statement showing the whole number of persons in each state.\" Id. (emphasis supplied). Thus the discretion exercised by the Secretary, at least with respect to the apportionment counts, is cabined by a duty to take a census which produces a tabulation providing the whole number of persons in each state. Moreover, the basic statutory structure governing the Secretary's apportionment census counts has been refined further by the \"usual residence\" policy that has governed census determinations since the First Census Act.\n\nViewed from a pragmatic perspective, see generally Levin, Understanding Unreviewability in Administrative Law, 74 Minn. L.Rev. 689 (1990), we find nothing in the Secretary's functional responsibilities with respect to the census to suggest that Congress intended his exercise of discretion to be immune from judicial review. Rather, the relevant pragmatic considerations support judicial review for arbitrariness, capriciousness, and abuse of discretion. The core purpose of the census is to provide a reliable and unmanipulated calculation for the allocation of House seats and for access to other government perquisites and benefits. The consequence of the census can be profoundly influential in the balance of advantage among competing partisan and parochial interests. It is especially appropriate to have some review by the courts, as the disinterested branch of government, in order to insure a neutral process and safeguard the interests of the potentially disadvantaged in the conduct of the census. There are no unusually sensitive considerations in the subject matter--such as considerations of national security or foreign affairs--which could be compromised by judicial review. Nor have the defendants even attempted to demonstrate how traditional judicial review of the Secretary's administrative action might limit his effectiveness in discharging his role in respect to the census. The defendants have failed to meet their burden of adducing \"clear and convincing evidence\" to show a basis to restrict access to judicial review. Abbott Laboratories v. Gardner, 387 U.S. 136, 140-41, 18 L. Ed. 2d 681, 87 S. Ct. 1507 (1967) (citations omitted).\n\nWe find that the language and overall architecture of the statutory scheme for the census, as it governs apportionment counts, provides a basis for principled judicial review. The relevant texts and administrative tradition provide a judicially manageable body of law to apply. The case law in census disputes during the past quarter century reflects the development of a common law of judicial review of agency action with respect to the census, cf. Webster v. Doe, 486 U.S. at 608-10 (Scalia, J., dissenting), in which the standard of review traditionally employed by courts in their review of agency action has been adopted. Accordingly, we are satisfied that § 701(a)(2) does not bar review of the Secretary's decision here. We turn to a consideration of the arbitrary and capricious standard set forth in § 706(2)(A).\n\n2. The Applicability of Section 706(2)(A)\n\nCertain basic principles governing application of this standard bear emphasis. \"The scope of review under the 'arbitrary and capricious standard' is narrow and a court is not to substitute its judgment for that of the agency.\" Motor Vehicle Mfrs. Ass'n v. State Farm Mutual Ins. Co., 463 U.S. 29, 43, 77 L. Ed. 2d 443, 103 S. Ct. 2856 (1983). Moreover, \"the Secretary's decision is entitled to a presumption of regularity . . . . But that presumption is not to shield his action from a thorough, probing, in-depth review.\" Citizens to Preserve Overton Park, Inc. v. Volpe, 401 U.S. 402, 415, 28 L. Ed. 2d 136, 91 S. Ct. 814 (1971) (citations omitted).\n\nThe Supreme Court has long recognized that \"'[a] settled course of behavior embodies the agency's informed judgment that, by pursuing that course, it will carry out the policies committed to it by Congress. There is, then, at least a presumption that those policies will be carried out best if the settled rule is adhered to.'\" Motor Vehicle Mfrs. Ass'n, 463 U.S. at 41-42, (quoting Atchison, T. \u0026 S.F.R. Co. v. Wichita Bd. of Trade, 412 U.S. 800, 807-08, 37 L. Ed. 2d 350, 93 S. Ct. 2367 (1973)). Consequently, \"an agency interpretation of a relevant provision which conflicts with the agency's earlier interpretation is 'entitled to considerably less deference' than a consistently held agency view.\" I.N.S. v. Cardoza-Fonseca, 480 U.S. 421, 446, 94 L. Ed. 2d 434 1, 107 S. Ct. 1207 n.30 (1987) (quoting Watt v. Alaska, 451 U.S. 259, 273, 68 L. Ed. 2d 80, 101 S. Ct. 1673 (1981)). See also Wilcox v. Ives, 864 F.2d 915, 925 (1st Cir. 1988) (\"This inconsistency [of the agency's views] detracts considerably from the force of the Secretary's present view.\") (citation omitted); Mayburg v. Secretary of Health \u0026 Human Services, 740 F.2d 100, 106 (1st Cir. 1984) (\"An interpretation that has proved to be administratively workable because it is consistent and longstanding is typically more persuasive.\").\n\nThe plaintiffs contend that the Census Bureau's reversal of its historic practice with respect to overseas federal personnel was arbitrary and capricious for three reasons: a) the Secretary relied upon inappropriate factors; b) the Secretary relied upon invalid data; and c) the Secretary failed to articulate a rational connection between the facts known and the policy he chose.\n\n(a) - Reliance Upon Improper Factors - There is no question that agency action is arbitrary and capricious if an agency considers factors which Congress did not intend it to consider. Motor Vehicle Mfrs. Ass'n, 463 U.S. at 43. The plaintiffs contend that the Secretary considered inappropriate \"political\" factors--what he adjudged to be the \"growing bipartisan concern of the Congress\"--to change the census practices with respect to overseas personnel counts. For their part, the defendants refer to this factor, somewhat disingenuously, as \"legislative history,\" even though no formal legislative action ensued. We find the parties' respective advocatory labels of the \"growing bipartisan concern of the Congress\" regarding overseas personnel counts to be less than helpful for analysis.\n\nIn the largest--and distinctly non-pejorative--sense, the expressions of congressional concern were, of course, \"political.\" Various members of Congress, and in particular members of the House oversight committee, sought to encourage a change in policy. Their arguments--essentially that it is unfair in creating apportionment counts to ignore persons working overseas for the United States Government--address legitimate policy concerns. This is, after all, an area in which the Constitution, by providing that the census enumeration \"shall be made . . . in such manner as [Congress] shall by law direct,\" U.S. Const. art. I, § 2, cl.3, has granted Congress virtually plenary control over census procedures and policies. It would be altogether inappropriate--and obviously politically foolish--for the Secretary to remain oblivious to statements of congressional concern about policy determinations delegated to him by Congress. Evaluation of the policy views of members of Congress responsible for and interested in census practices is a wholly appropriate aspect of the administrative process and cannot be termed arbitrary and capricious.\n\nOn the other hand, the views of various members of Congress, however responsible for census oversight or interested in census practice, cannot be treated as dispositive unless and until those views are embodied in a formal action by Congress itself. The Supreme Court has warned against being too \"quick to infer a congressional mandate\" from what it characterized as \"inchoate legislative action.\" Motor Vehicle Mfrs. Ass'n, 463 U.S. at 45. Moreover, if the expressions of individual members' views appeared to be related to some partisan or parochial positions, a court would be justified in discounting such \"political\" factors when proffered in support of administrative decision making. Where, as here, however, the expressions of concern were concededly bipartisan and reflected a desire to have the census reflect the voting franchise rights of Americans serving their government overseas, we find no grounds to disregard the \"political\" policies advocated. Indeed, we believe that it would be arbitrary and capricious for the Secretary under these circumstances to blind himself to open, considered and reasoned expressions of individual and collective concern by members of Congress even if such expressions did not rise to the level of legislative enactments.\n\n(b) - Reliance Upon Invalid Data - The point of difficulty with the Secretary's determination to reverse the overseas census policy is with the factual foundation. An agency decision may be found arbitrary and capricious if it is based upon invalid data. City of Stoughton v. United States Envtl. Protection Agency, 858 F.2d 747, 750 (D.C. Cir. 1988). The two page decision memorandum approved by the Secretary stated that a \"significant\" reason for reversing Census Bureau policy was that the Department of Defense would be conducting a census of its employees concurrently with the April 1990 national census. Indeed, this was the only factual basis ever articulated for the change. The Defense Department census was expected to generate the kind of reliable information about the home states of personnel that had not been available for previous census counts. The importance of the Defense Department's census undertaking for the Secretary's decision was underscored by the statement in the Secretary's decision memorandum that \"if other Federal agencies had a means of providing to us timely and acceptable counts of overseas employees, we would include them as well.\"\n\nIf the Secretary's decision-making were complete when he adopted the two-page decision memorandum in July 1989, we would not be prepared to say that his decision was arbitrary and capricious. The prospect of better data could support his decision. But events rendered that decision obsolete.\n\nAs it turned out, the Defense Department subsequently decided for budgetary reasons that it would not undertake its promised census count, and the express factual premise upon which the Secretary had changed the overseas federal employees apportionment policy evaporated. There is no evidence that the Census Bureau considered reverting to its prior policy of not apportioning the overseas employees to particular states. Instead, responding to what appear to have been inertial forces which did not permit even thinking about turning back once the policy reversal had been announced, the Census Bureau ultimately came to rely for the 1990 census on precisely the same data that it had consistently found to be too unreliable to apportion overseas federal employees.\n\nThe Census Bureau's traditional unwillingness to rely upon this data was well founded. As Congress had discovered, a service member's designation of \"home of record\" could be a place where that person had never lived or where that person had lived long ago at the time of enlistment, but to which there was no intention of returning. Furthermore, a Defense Department employee could also choose to designate as \"home of record\" a state to which that employee had no ties, but which either imposed no state income tax or exempted service members from that tax. Thus, the agency's \"home of record\" documentation was suspect.\n\nThere is no showing in the Administrative Record that any of the deficiencies in the \"home of record\" information had been remedied since the 1970 census. Nowhere in the Administrative Record is there any basis for modifying the conclusions that reliance on \"home of record\" information would be \"arbitrary,\" in the words of the Census Bureau's 1987 Policy Paper for the 1990 census, \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\" or that the information failed to meet any \"reasonable test to validity for apportionment purposes,\" in the words of the Defense Department's spokesperson in 1989 testimony before Congress. \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\" Such information cannot provide a valid factual basis for the apportionment of overseas federal personnel among the states. And lacking a valid factual basis, the critical link between the facts found and the policy choice made was necessarily broken before the Secretary produced his official apportionment court for use in allocating seats in the United States House of Representatives among the states.\n\n(c) - Rational Connection Between Facts and Policy - An agency action may be found arbitrary and capricious if the agency fails to articulate a satisfactory explanation for its action, including a \"'rational connection between the facts found and the choice made.'\" Motor Vehicle Mfrs. Ass'n., 463 U.S. at 43 (citations omitted). In this connection, of course, we recognize that the administrative agency responsible for the census must be \"afforded wide latitude to select its methods, techniques and by those means to arrive at its own result.\" City of Philadelphia, 503 F. Supp. at 677. Yet, no matter how wide the latitude, there was no rational connection between the choice ultimately made and the facts actually found here.\n\nOf the justifications offered for the Secretary's policy of reversal, all turned on the enhanced validity of the overseas census information to be used in the 1990 apportionment enumerations. The Defense Department had announced a special enumeration procedure and the Secretary announced reliance on it in his Decision Memorandum. The 1969 opinion letter of the Assistant Attorney General was premised upon the assumption that the Director's decision for the 1970 census to include overseas federal personnel in the apportionment count was reached after the \"difficulties in securing reliable information\" had been overcome. The experience with the 1970 census and thereafter demonstrated this assumption was unfounded. The Secretary, nevertheless, chose to use the demonstrably suspect \"home of record\" information for the 1990 apportionment count after the Defense Department's enumeration was abandoned.\n\nAt oral argument, counsel for the defendants contended that the Secretary, once having made the policy choice on the basis that the home of record information would not be used, was somehow committed to using that information when the underlying factual assumption became obsolete. Whatever may be the validity of such an argument when a complex set of interlocking events and circumstances renders reevaluation of the policy choice impracticable, that is not a compelling argument here. The Secretary was faced with the simple decision whether or not to include overseas federal personnel population counts in the apportionment statement to be submitted to Congress. The decision not to do so--the only decision which could have been rational under these circumstances--required nothing more than subtracting the arbitrary overseas counts from statements of state populations previously developed or declining to add the arbitrary overseas counts to the regular apportionment counts. In either case, this was simple arithmetic which could be performed instantaneously. Inertia cannot supply the necessary rationality to permit concededly invalid data to be incorporated in the apportionment counts. The decision ultimately to include the overseas census counts in the apportionment census lacks any rational connection between facts found and choice made and is thus arbitrary and capricious and an abuse of discretion in violation of the Administrative Procedure Act.\n\nIn reaching this conclusion, we do not mean to suggest that the Secretary could not, on a proper record, choose to change his policies with respect to the counting of overseas personnel. We recognize the broad discretion which the Secretary has in this regard under the Constitution and the relevant statutes. There would appear to be nothing inherently unconstitutional in a properly supported decision to include overseas federal employees in apportionment counts. We are consequently skeptical of the plaintiffs' contention that by apportioning overseas federal employees to particular states, the Census Bureau has violated Section 2 of the Fourteenth Amendment, which requires the Bureau to count \"the whole number of persons in each State\" (emphasis supplied).\n\nThe plaintiffs argue that, by definition, persons posted abroad at the time of the 1990 census were not in any state, and thus should not be included in the apportionment count. The contention that the language of the Fourteenth Amendment should be applied literally (i.e., that apportionment should only be based on a person's actual physical presence in a state on census day) finds no support in the case law. Courts have interpreted the \"in each state\" language of the Fourteenth Amendment to mean actual inhabitants of a state, that is, persons with some relation to the state--not simply those physically in the state on census day.\n\nIn Wesberry, the Supreme Court held the delegates at the Constitutional convention intended that the number of congressional seats \"assigned to each State should be determined solely by the number of the State's inhabitants.\" 376 U.S. at 13. Similarly, as we have noted, in Borough of Bethel Park, where the court considered the plaintiff's claim that overseas federal personnel should be apportioned to particular localities, \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\" the court concluded that there was \"no indication that the members of the Constitutional Convention had in mind any specific criteria by which persons were to be deemed residents of one state rather than another. It is most likely that [the Framers] thought in terms of an average inhabitant.\" 319 F. Supp. at 974. Allocation of what the Bethel Park court referred to as the \"fringe\" populations has long been considered a discretionary decision open to revision as time unfolded and circumstances developed. The Attorney General's 1949 opinion noted that, \"the statutes governing the decennial censuses have uniformly left the actual administration of a great number of necessary details to the judgment and discretion of the Director of the Census.\" The flexibility of the \"usual residence\" concept as applied by the Census Bureau over the years, see, e.g., note 24 supra, demonstrates the broad discretion the Bureau has traditionally enjoyed to interpret what the phrase \"in each state\" means. Contrary to the plaintiffs' contentions, the historical practice of the Census Bureau does not support application of the \"in each state\" language literally. Thus, we do not find persuasive plaintiffs' argument that the Secretary's overseas census decision was unconstitutional on its face. \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\"\n\nBut the question presented by the arbitrary and capricious and abuse of discretion standard is not whether the Secretary has discretionary power to make properly supported policy determinations. Rather it is whether that undoubted broad discretion has been exercised properly. Confronted with an administrative record that shows no rational connection between the validity of the data upon which the Secretary relied and the decision he made to count overseas federal personnel, we have no choice but to find that the Secretary's exercise of discretion to include overseas federal personnel in the 1990 apportionment count was arbitrary and capricious, and an abuse of discretion.\n\nE. THE REMEDY\n\nWe are intensely aware that the practical process of reapportionment following the 1990 census has been going on for over a year and that certain states--including Washington State, which the parties have stipulated will lose a congressional seat certified to it as the result of a determination that the overseas census count was invalid--have even completed their redistricting. We also recognize the potential likelihood of appeal of this decision.\n\nFashioning an equitable remedy in this setting to permit an orderly and timely electoral process will impose obligations on the Commonwealth of Massachusetts. As a matter of equity, unless Massachusetts is prepared to meet those obligations promptly, the status quo should not be disrupted. Thus, in order to insure that the consequences of our decision are not unduly disruptive, we will condition any affirmative remedy upon action of plaintiff Commonwealth of Massachusetts. We will require the Commonwealth of Massachusetts to submit on or before March 30, 1992, a certification affirming that there has been prepared a fully approved eleven House seat reapportionment plan for Massachusetts based upon a 1990 census state population count which excludes overseas federal employees. \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\" If the Commonwealth of Massachusetts fails to submit such a certification, no injunctive remedy will be afforded. Assuming such a certification is submitted, however, the Executive Branch defendants will be obligated to submit to defendant Anderson by March 31, 1992, a statement showing the number of Representatives to which each state would be entitled under the 1990 census, without inclusion of the overseas census counts in the apportionment count. The defendant Anderson then shall be obligated to send to the executives of the respective states on or before April 10 a recertification of entitlements to seats in the House of Representatives, \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\" in accordance with the recalculated apportionment statement prepared by the Executive Branch defendants.\n\nIV\n\nFor the reasons set forth more fully above, we hereby ALLOW defendants' motion for summary judgment as to the apportionment claim and ALLOW plaintiffs' motion for summary judgment as to the overseas census claim grounded upon a violation of the Administrative Procedure Act. A set of final decrees and orders reflecting this judgment shall issue.\n\nDOUGLAS P. WOODLOCK\n\nUNITED STATES DISTRICT JUDGE\n\nFINAL DECREES AND ORDERS\n\nFebruary 20, 1992\n\nIn accordance with the Memorandum issued this day, it is hereby ORDERED, ADJUDGED and DECREED:\n\n1. That 2 U.S.C. § 2(a)(a), insofar as it requires apportionment of seats in the House of Representatives among the states by the method known as equal proportions, is not in violation of the United States Constitution;\n\n2. That the administrative practice of the Executive Branch Defendants in counting overseas federal employees in the 1990 census for the purpose of apportioning seats in the United States House of Representatives among the states was arbitrary and capricious and an abuse of discretion in violation of the Administrative Procedure Act, 5 U.S.C. § 706(2)(A), and that consequently the use of the overseas census counts by the defendants in the certification of state entitlements to seats in the House of Representatives was improper;\n\n3. That the Executive Branch Defendants shall submit to defendant Anderson on or before March 31, 1992, a statement showing the number of Representatives to which each state would be entitled as a result of the 1990 decennial census under 2 U.S.C. § 2(a)(a), without inclusion of the overseas census counts in the apportionment count;\n\n4. That defendant Anderson, as he is the Clerk of the United States House of Representatives, shall on or before April 10, 1992, send the executive of each state a recertification of the number of Representatives to which such state is entitled in accordance with paragraph 3 of this Order;\n\n5. That the plaintiff Commonwealth of Massachusetts shall, on or before March 30, 1992, submit a certification to be docketed in this action affirming that there has been prepared a plan--adopted by the General Court of the Commonwealth and approved by the Governor--for the redistricting of eleven Congressional seats in Massachusetts, in accordance with the 1990 decennial census, without inclusion of the overseas census counts;\n\n6. That the failure of the Commonwealth of Massachusetts to certify the adoption and approval of the plan called for by paragraph 5 of this Order on or before March 30, 1992 will relieve the defendants of their obligations under paragraphs 3 and 4 of this Order.\n\nHugh H. Bownes\n\nSenior United States Circuit Judge\n\nFrancis J. Boyle\n\nUnited State District Judge\n\nDouglas P. Woodlock\n\nUnited States District Judge\n\n\u003cspan class=\"fn\"\u003e1. Under 13 U.S.C. § 141, the defendant Robert Mosbacher, as Secretary of the United States Department of Commerce, was charged with the task of conducting the 1990 Census and reporting the \"total population by States.\" The Secretary is responsible for the administration of the Commerce Department; the defendant Michael Darby, the Commerce Department's Undersecretary for Economic Affairs, is responsible for overseeing the Bureau of the Census; and the defendant Barbara Bryant is the Director of the Bureau of the Census. Under 2 U.S.C. § 2a(a), the defendant President Bush was charged with the task of transmitting to Congress a statement of the whole number of persons in each state as ascertained under the Census together with a statement of the number of members of the House of Representatives to which each state is entitled. This he did on January 3, 1991. Under 2 U.S.C. § 2a(b), the defendant Donnald K. Anderson, as Clerk of the United States House of Representatives, was obligated to send the executive of each state a certificate setting forth the number of Representatives to which that state is entitled based on the President's statement. The defendant Anderson did so on January 16, 1991. The defendants other than Anderson, styling themselves the \"Executive Branch Defendants,\" have conducted the defense in this litigation. Anderson has stipulated that he will be bound by the judgment entered. The defendants as a group will be referred to in this opinion collectively as the \"defendants,\" without differentiation as to their respective executive or legislative offices.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. We recognize that commentators have suggested the right to a three-judge court is waivable and that, in the absence of a request for a three-judge court by the parties, there is no obligation to convene one. 17 Wright, Miller \u0026 Cooper, Federal Practice and Procedure § 4235, at 610-12 (1988); Williams, The New Three-Judge Courts of Reapportionment and Continuing Problems of Three Judge-Court Procedure, 65 Geo. L.J. 971, 975 \u0026 n. 14 (1977). This suggestion carries with it the correlative proposition that the propriety of a three-judge court is not a jurisdictional matter. As attractive as is the proposition that the complexities of the law of three-judge district courts can be ignored if the parties do not raise the issue, we can find nothing in the statute or the case law governing such courts that would support it. The commentators' views appear to be a hopeful assertion that courts by imaginative interpretation should be able to find a way to adopt a better policy. See, e.g., 17 Wright, Miller \u0026 Cooper, § 4235 at 611 (\"there is now new statutory language with enough inconsistency in it to justify\" new interpretation that three-judge court is not jurisdictional); Williams, supra, at 975 n. 14 (\"Two old Supreme Court cases preclude waivability of section 2284. They should be overruled.\") We are not as free as the commentators to enact our policy preferences.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. See, e.g., City of New York v. United States Dep't of Commerce, 739 F. Supp. 761 (E.D.N.Y 1990); City of Willacoochee v. Baldrige, 556 F. Supp. 551 (S.D.Ga. 1983); City of Philadelphia v. Klutznick, 503 F. Supp. 663 (E.D.Pa. 1980); West End Neighborhood Corp. v. Stans, 312 F. Supp. 1066 (D.D.C. 1970). But see Black Political Task Force v. Connolly, 679 F. Supp. 109 (D. Mass. 1988) (three-judge court treating validity of state census methodology in context of challenge to state legislative reapportionment dispute without addressing jurisdictional issue).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Ancillary jurisdiction is an amorphous doctrine which permits a district court with proper jurisdiction over a given claim to resolve related matters over which the court could not assert an independent basis for jurisdiction. The Supreme Court has declined to decide whether there exists any substantive distinction between ancillary and pendent jurisdiction. See 13 Wright, Miller \u0026 Cooper, Federal Practice and Procedure § 3523 at 96 (1988). Other commentators suggest that pendent jurisdiction is merely a subset of ancillary jurisdiction. E. Chemerinsky, Federal Jurisdiction § 5.4.1 at 276 (1989). In any event, as noted, the new statute renders the distinction meaningless.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Section 1367 reads: (c) The district courts may decline to exercise supplemental jurisdiction over a claim under subsection (a) if - (1) the claim raises a novel or complex issue of state law, (2) the claim substantially predominates over the claim or claims over which the district court has original jurisdiction, (3) the district court has dismissed all claims over which it has original jurisdiction, (4) in exceptional circumstances, there are other compelling reasons for declining jurisdiction.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Because the author of this opinion is the single district judge to whom this case was initially assigned, this opinion stands as certification that the author has individually arrived at the conclusions expressed collectively in the opinion and the judgment of this three-judge court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. As a specific and subsidiary ground for their standing defense, the defendants contend that Commonwealth of Massachusetts cannot maintain this litigation in its own name. We reject this ground. The interest of the Commonwealth as a state--and the injury it sustains by a diminution in the strength of its Electoral College delegations--are evident in the text of the Constitution, which provides that \"Each State shall appoint [its Electors], in such manner as the Legislature thereof may direct . . . .\" U.S. Const. art. II, § 1, cl. 2 (emphasis supplied). As Chief Justice Fuller observed a century ago, \"the appointment and mode of appointment of electors belong exclusively to the States under the Constitution of the United States.\" McPherson v. Blacker, 146 U.S. 1, 35, 36 L. Ed. 869, 13 S. Ct. 3 (1892). Consequently, we decline to follow Ridge v. Verity, 715 F. Supp. 1308, 1321 (W.D.Pa. 1989).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Indeed, although styled as a standing objection, an inconsistency in defendants' position suggests that they are simply seeking to have this court address the overseas census claims first before moving on, if necessary, to the apportionment claim. This is the only explanation for the defendants' decision to press the standing issue against the apportionment claim and not against the overseas census claims. A truly consistent--if, nevertheless, plainly untenable--position would be to contend that because both the apportionment and the overseas census claims established separate causes of redressable injury, there is standing to pursue neither. Such a foolish consistency would serve, of course, only to underscore the Catch-22 quality of the defendants' standing argument.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. We note that the Supreme Court has placed the Montana litigation on an expedited schedule, with argument set for the February sitting. Montana v. United States Dep't of Commerce, 116 L. Ed. 2d 747, 60 U.S.L.W. 3435, 112 S. Ct. 656 (U.S. Dec. 16, 1991) (No. 91-860).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. We take no position whether the circumstance that adverse states may be indispensable parties to a reapportionment suit challenging the actions of federal defendants may itself be a sufficient condition for the invocation of the Supreme Court's original and exclusive jurisdiction for suits between states under 28 U.S.C. § 1251(a) or, for that matter, the nonexclusive jurisdiction for suits between states and the United States under 28 U.S.C. § 1251(b)(2). The Supreme Court has developed \"occasionally restrictive rules of justiciability and high standards of legal and factual persuasion,\" 17 Wright, Miller \u0026 Cooper, Federal Practice and Procedure § 4045, at 194 (1988), to limit extensive deployment of its original jurisdiction. The Court has not yet been afforded the opportunity to consider whether its original jurisdiction must or should be exercised over a reapportionment suit.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. We recognize in this connection the intellectual conundrum framed by Judge Edwards: If the political question doctrine is to have any integrity as a constraint upon judicial review, its invocation must arise from an analysis of the Constitution that stands apart from any conclusion of the merits of the particular claim presented. Nixon v. United States, 290 App. D.C. 420, 938 F.2d 239, 257 (D.C.Cir. 1991) (Edwards, J., concurring in the judgment and dissenting in part), reh. denied, 1991 U.S. App. LEXIS 25391 (D.C.Cir. 1991), petition for cert. filed 60 U.S.L.W. 3376 (U.S. Nov. 4, 1991) (No. 91-740). Nevertheless, in order to address the political question doctrine in a particular case it is necessary to evaluate the merits of the claim presented. This necessity, of course, may be viewed as reflecting adversely upon the independent integrity of the political question doctrine as a constraint upon judicial review.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The defendants have chosen in this litigation to raise the political question doctrine only as to the apportionment claim. Despite the recent observation of the City of New York court that the defendants \"must be admired for their tenacity\" in repeatedly--if unsuccessfully--resurrecting the political question issue in that census litigation, City of New York v. United States Dep't of Commerce, No. 88-CV3474, slip op. at 2 (E.D.N.Y. Sept. 19, 1992), and the defendants' success on the question in census litigation before another court, Tucker v. United States Dep't of Commerce, 135 F.R.D. 175 (N.D.Ill. 1991), appeal pending, No. 91-2051 (7th Cir.), the defendants have not chosen to raise the political question issue as to the overseas census claims before us.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The history presented in this section is drawn from the Stipulation of Facts filed by the parties, from the initial affidavits of the parties' respective experts, Dr. H. Peyton Young (for plaintiffs) and Dr. Lawrence R. Ernst (for defendants), and from a book coauthored by Dr. Young: M. L. Balinski \u0026 H. P. Young, Fair Representation - Meeting The Ideal of One Man, One Vote (1982).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The 1911 apportionment legislation actually fixed House membership at 433 seats but it also provided that the Territories of Arizona and New Mexico would be entitled to one House seat each if they became states before the next census. Arizona and New Mexico became states in 1912 and the House size has remained 435 seats ever since except for a temporary increase of two seats to 437 in 1959 when Alaska and Hawaii became states. In the reapportionment following the 1960 census the House size reverted to 435 seats.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. The panel did not consider the greatest fractions (Vinton) method because the population paradox it could create was considered unacceptable.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. See M. Morse, J. von Neumann \u0026 L. P. Eisenhart, \"Report to the President of the National Academy of Sciences,\" May 28, 1948 at 1 (mimeograph).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Id. at 6-7.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. H.R. Rep. No. 1314, 91st Cong., 2d Sess. 1 (1971).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. See Census Activities and the Decennial Census: Hearings on H.R. 1990 Before the Subcommittee on Census and Population of the House Committee on Post Office and Civil Service, 97th Cong., 1st Sess. 1-2 (1981) (statement of Rep. Robert Garcia).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. It is not entirely clear why Justice Black, writing for the Wesberry court, chose not to reach the argument that violations of the \"one person, one vote\" principle in congressional apportionment constituted an equal protection violation. 376 U.S. at 8 n.10. The intrastate congressional apportionment at issue in Wesberry was clearly state action subject to the Fourteenth Amendment. Nevertheless, it implicated equal protection principles in a federal setting. The suggestion has been made that Justice Black was less than comfortable jurisprudentially with the effective reverse incorporation of the equal protection language of the Fourteenth Amendment in the Fifth Amendment due process clause undertaken by Bolling v. Sharpe, 347 U.S. 197 (1954), in order to reach discrimination by Congress. See generally, Calabresi, Foreword: Antidiscrimination and Constitutional Accountability (What the Bork-Brennan Debate Ignores) 105 Harv. L. Rev. 80, 132 n. 169 (1991). The use of Article I, Section 2 as the basis for the \"one person, one vote\" principle for congressional, as opposed to state legislative, apportionment, makes it possible to avoid such jurisprudential discomfort.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Congress deliberately abandoned in 1929 its previous statutory directives that the States create congressional districts \"containing as nearly as practicable an equal number of inhabitants.\" Wood v. Broom, 287 U.S. 1, 7, 77 L. Ed. 131, 53 S. Ct. 1 (1933). Given the lack of Congressional interest in enforcing this obligation, the Supreme Court in Wesberry v. Sanders reinvigorated the principle.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. M.L. Balinski \u0026 H. P. Young, Evaluation of Apportionment Methods 9 (Sept. 30, 1984) (Library of Congress Contract No. CRS 84-15).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. The history presented in this section is drawn from the Stipulation of Facts filed by the parties, the Administrative Record of the Secretary's decision, and the various supporting exhibits submitted by the parties.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Military personnel are not the only class of persons presenting the problem of how to account in the census for people actually living on the date of the census in places other than what might be considered their domicile or legal residence. Census administrators have developed various methods for dealing with the subclasses of persons presenting the problem. These methods have reflected contemporary societal views about what location should be designated as the \"usual residence\" for such a person and the administrative practicability and accuracy of making a count of a member of the subclass at a particular location. Among the subclasses receiving distinctive and sometimes evolving treatment are: Boarding Students - For the 1900 and all subsequent censuses, boarding school students have been counted at their parent's residence even if they were living and sleeping at school on the census day. The same was true of college students until the 1950 census and thereafter when, in apparent recognition of a college student's greater degree of emancipation, the residence rules were modified to count college students at their schools, if they were there rather than at the families' homes on census day. Other Americans Living Overseas - American citizens not employed by the federal government living overseas as of the census date have not been included in the apportionment counts for congressional seats. In 1830 and 1840 and in every census since 1900, however, the Census Bureau has, however, made an effort to obtain an administrative count of such persons for other than apportionment purposes. Crews of Merchant Vessels - Traditionally, the crew of United States ocean-going, coastal and Great Lakes vessels have been counted at the port at which the ship was berthed on census day. If their vessel was not berthed, but was in United States territorial waters, the crew would be counted at the port of destination so long as that port was inside United States territory. If the vessel was in territorial waters, but headed overseas, it would be counted at the vessel's home port. If the vessel was not in territorial waters, the crew was not counted. The Census Bureau has recognized that the crews of merchant vessels are very transient. Some have no home other than the ship on which they work; others maintain a home on shore which they consider their usual residence. For the 1990 census, the Census Bureau made an effort to count crew members at what the crew members themselves considered to be their usual residence, whether on ship or on shore.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. This treatment of the military was consistent with the political accommodations which governed the constitutional choices shaping the apportionment provisions of Article I, Section 2. Choosing whom to count for purposes of apportionment was the major issue during the nation's two fundamental constitutional drafting periods: the framing of the initial document in 1787 and the consideration of amendments following the Civil War. The Great Compromise, which resulted in the approval of the Constitution by the delegates to the Constitutional Convention in 1787, involved the decision to count all persons inhabiting the individual states, whether male or female, franchised or disenfranchised, with a special provision for counting slaves as 3/5ths of a person, so as not to provide the South with too great an electoral advantage for the persons it would not free. Following the Civil War, the Congress, in framing the Reconstruction amendments to the Constitution, again considered who should be counted for apportionment purposes. Proposals to base \"representation upon the number of legal voters . . . encountered strong opposition from New England's Representatives. New England, which restricted aliens from voting, imposed educational requirements in granting suffrage, and had a disproportionately large number of women (who were universally excluded from voting at the time) due to an extensive emigration of her males to the West, felt that it had much to lose from a voters' basis of representation.\" Zuckerman, A Consideration of the History and Present Status of Section 2 of the Fourteenth Amendment, 30 Ford. L. Rev. 93, 95 (1961). The Reconstruction Congress, after providing that newly-freed slaves would be fully counted, continued to treat the apportionment population as the inhabitants of the states, irrespective of whether they were voters or citizens.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. The 1900 census, occurring while the nation was concerned about Americans serving abroad as a result of the Spanish American War, presents something of an anomaly because it appears that the instructions for enumerators permitted double counting. Thus, overseas federal personnel were counted at their posts but the enumerators were also instructed that if an overseas federal employee was a member of a family within a state, the employee should be reported as resident in that state.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. The letter expressing this view, which was primarily directed to proposed legislation seeking to eliminate illegal aliens from the apportionment counts, betrays a certain lack of institutional memory in the Justice and Commerce Departments. The Acting Assistant Attorney General reported that \"the Department of Commerce advises that the Census Bureau has never counted for apportionment purposes . . . military personnel . . . stationed abroad.\" Apparently the Justice and Commerce Departments had forgotten that the Census Bureau had done precisely that eighteen years earlier upon the advice of another Assistant Attorney General.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Administrative Record at 224.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Administrative Record at 578, Census Equity Act: Hearings on H.R. 2661 Before the Subcomm. on Census and Population of the House Comm. on Post Office and Civil Service, 101st Cong., 1st Sess. 64 (1989) (Statement of Deputy Assistant Secretary Berteau).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. The plaintiffs in that case did not challenge the Census Bureau's decision to apportion overseas federal employees to particular states.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. Nor do we find the decision to be in violation of the Census Act itself. Section 141 of Title 13 states that the Secretary of Commerce shall take a decennial census of the population \"in such form and content as he may determine.\" Thus, the statute gives the Secretary broad discretion to determine how the census will be carried out, discretion which mirrors the broad mandate given to Congress by the Apportionment Clause. The plaintiffs do not dispute that the Census Bureau has the discretion to determine how to conduct the census. They contend, however, that the Census Act \"severely circumscribes\" the Bureau's discretion as to who shall be counted for purposes of apportioning seats in Congress. This is a distinction without any purpose, for in determining how the census is to be carried out, the Bureau necessarily must determine who shall be counted, i.e., the \"content\" of the census. The policy decision to apportion overseas federal employees is well within the discretion afforded the Census Bureau under the Census Act, assuming, of course, the exercise of that discretion is not -- as we have found it was here -- arbitrary and capricious or abused.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. We emphasize that we are entering our final order resolving the dispute between these parties. We do not purport to exercise any continuing jurisdiction over the substance of any eleven seat plan which is the subject of the certification called for in paragraph 5 of the Final Decrees and Orders we are issuing. We note that there is presently pending before a separate three-judge panel of this court a case concerning the approval of a ten House seat by the Commonwealth of Massachusetts. Massachusetts Republican State Committee v. Connolly, Civil Action No. 92-10205-H. Assignment of a case putting in question the substance of any plan certified under paragraph 5 will hereafter be undertaken in accordance with the Local Rules of the District of Massachusetts. See generally Rule 40.1(A)(3) \u0026 (E).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. We understand from the parties' stipulation that this recertification as a practical matter will affect only the states of Massachusetts and Washington. Because Washington State, as the result of the decision of the Montana court, has since October 18, 1991 faced the prospect of reducing its congressional delegation to eight seats, the potential for reapportionment arising from our judgment in this litigation should pose no additional practical difficulties for her in terms of contingency planning.\u003c/span\u003e\n\n",
    "body_length": 150330,
    "citedas": [
      "785 F. Supp. 230"
    ],
    "attorneys": "Edward P. Liebensperger, Special Assistant Attorney General with whom John P. Driscoll and Neil P. Motenko, Special Assistant Attorneys General, and Nutter, McClennen \u0026 Fish, were on the briefs for the Plaintiffs, arguing the apportionment claim. , Dwight Golann, Assistant Attorney General, Chief, Government Bureau, with whom William P. Lee and Steve Berenson, Assistant Attorneys General, were on the briefs for the Plaintiffs, arguing the overseas census claim. , Mark H. Murphy, Attorney, Civil Division, Department of Justice, with whom Stuart M. Gerson, Assistant Attorney General and Sandra M. Schraibman, Attorney, Civil Division, and Wayne A. Budd, United States Attorney, and Judith S. Yogman, Associate United States Attorney, were on the briefs for the Defendants. , Kenneth O. Eikenberry, Attorney General, and James M. Johnson, Special Assistant Attorney General, on the brief for The State of Washington, amicus curiae. Before Bownes, Senior Circuit Judge, Boyle, District Judge, Woodlock, District Judge",
    "category": [
      "124",
      "251"
    ],
    "judges": "WOODLOCK, District Judge",
    "citation_count": 0
  }
}
