{
  "id": "1qAAR2YBTlTomsSB_dy1",
  "document": {
    "title": "United California Bank v. Prudential Insurance Co.",
    "full_title": "UNITED CALIFORNIA BANK, A CALIFORNIA CORPORATION CROSS-APPELLANT v. THE PRUDENTIAL INSURANCE COMPANY OF AMERICA, A NEW JERSEY CORPORATION CROSS-APPELLEE; NAMETCO, AN ARIZONA CORPORATION, HRP HOTEL COMPANY, AN ARIZONA LIMITED PARTNERSHIP, THE PARTNERS OF WHICH ARE SAM SHAPIRO, BARRY SHAPIRO, LAWRENCE J. SHAPIRO, MICHAEL HASKES, BEN KLIMIST, JOSEPH H. FILNER AND NAMETCO CORPORATION CROSS-APPELLANTS V. THE PRUDENTIAL INSURANCE COMPANY OF AMERICA, A NEW JERSEY CORPORATION CROSS-APPELLEE",
    "jurisdiction": "Court of Appeals of Arizona",
    "date": "1983-09-01T00:00:00.000Z",
    "docket": "Nos. 1 CA-CIV 5135, 1 CA-CIV 5495",
    "body": "TABLE OF CONTENTS\n\npage\n\nI. Introduction 246\n\nII. Facts 246\n\nA. The Background of the Hotel 246\n\nB. The Loan Transaction 247\n\nC. The Trial Court Proceedings 252\n\nPhase I 252\n\nPhase II 255\n\nPhase III 255\n\nPhase IV 255\n\nD. The Appeal 255\n\nIII. Prudential's Claim to an In-Fact First\n\nLien 256\n\nA. Introductory Statement 256\n\nB. The Loan Application and the Com-\n\nmitment Letter: Incorporation or\n\nNot 257\n\nC. Partial Summary Judgment or Trial\n\non the Merits: Both 261\n\nD. The Phase I Trial 262\n\nThe Five-Party Agreement 266\n\nThe Deed of Trust and Other Collat-\n\neral Loan Documents 268\n\nModern Mortgage Law and Practice 270\n\nConclusion 272\n\nE. Ejusdem Generis 273\n\nF. Marketable Title as an Implied Obli-\n\ngation 274\n\nG. A.R.S. § 20-1591(2) and A.R.S. § 20-\n\n1565(B) 275\n\nH. Conclusion 276\n\nIV. Anticipatory Repudiation 277\n\nV. Funding into a Default and Insolvency 289\n\nVI. Attorney-Client Privilege 292\n\nVII. Measure of Damages 295\n\nA. Introductory Statement 295\n\nB. The Evidence Supports the Trial\n\nCourt's Findings 298\n\nPrudential's In-House Appraisals 300\n\nOwner's Opinion of Value 302\n\nRemarks of the Trial Judge 305\n\nC. The Claimed Interest Deduction 308\n\nVIII. The Cross-Appeals 309\n\nA. Prejudgment Interest 309\n\nB. Increase in Interest Rate 310\n\nIX. Conclusion 310\n\nOPINION\n\nI. INTRODUCTION\n\nThis appeal requires us to review the trial court's interpretation of agreements between Prudential Insurance Company of America (Prudential), United California Bank (UCB), and HRP Hotel Company (HRP). Prudential and UCB are both commercial lenders. UCB in this case was the interim construction lender to HRP, then owner-developer of the Hyatt Regency Hotel (Hotel), a high-rise hotel planned for downtown Phoenix. Prudential was the intended permanent or \"take-out\" lender on the Hotel. Prudential ultimately refused to fund the permanent loan and UCB and HRP sued, seeking relief on the issue of Prudential's obligation to fund the $25,500,000 loan.\n\nThe legal and factual issues were decided on a number of motions for partial summary judgment, several weeks of hearings, and on two separate trials to the court and one trial to the jury over a period of eight weeks. The various claims consumed 76 days of hearings and trial. During the trial proceedings hundreds upon hundreds of exhibits were marked for identification and many were admitted in evidence. Thousands of pages of testimony were taken on deposition and at trial. Pleadings, motions, memoranda, and other documents, usually with more exhibits attached, many of which had been produced and reproduced before, were filed in vast numbers.\n\nThe parties took diametrically opposed views as to the law applicable and what the evidence shows. Consequently it has been necessary to devote an inordinate amount of time examining the transcripts of testimony and exhibits and in researching the law. Prudential states in its opening brief: \"This case is bulkier than it is difficult.\" It is both bulky and difficult. HRP states in its answering brief: \"This litigation has been protracted and hard fought at every turn.\" This is a gross understatement. The advocacy has been intense; the quantity of work excellent. For the sake of clarity and space we have attempted to limit ourselves to the facts and proceedings pertinent to a disposition of the case. However, we may not have been totally successful in this endeavor.\n\nLiability was found against Prudential and damages awarded HRP in the amount of $10,494,000, representing HRP's loss of equity in the Hotel. The court also awarded HRP attorneys' fees in the amount of $863,250. UCB was awarded nominal damages of one dollar, plus attorneys' fees totaling $163,550. Pursuant to an agreement executed by UCB and HRP during the pendency of the case in the trial court, UCB is entitled to approximately one half of HRP's damages. Prudential has appealed the judgment entered in the trial court. We affirm.\n\nII. FACTS\n\nA. The Background of the Hotel\n\nSam Shapiro, after arriving in Phoenix in 1937, was involved in various business enterprises. In the late 1960's Mr. Shapiro planned the construction and development of a high-rise luxury hotel in downtown Phoenix. HRP, an Arizona limited partnership, was formed by Mr. Shapiro to carry out the plan.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e In 1970, HRP purchased the site of the Hotel for $1,975,000. It was a parcel of unimproved real estate across the street from the Phoenix Civic Plaza. Mr.\n\nShapiro then engaged Laventhol \u0026 Horwath to study the feasibility of the project, Charles Luckman Associates to design the Hotel, Chanen Construction Company to build it, and the Hyatt Hotels Corporation to manage and operate it.\n\nB. The Loan Transaction\n\nIn September 1973, Prudential's Phoenix office prepared and presented to HRP a printed \"Loan Application\" (loan application) form for a long-term $24,500,000 loan to be secured by the proposed Hotel. The original applicant for the Prudential loan was National Properties, which for purposes of clarity will be referred to as HRP, the authorized nominee of Prudential's commitment. The standard two-page loan application has attached to it five typewritten pages, each entitled at the top in printed text \"Application Rider\" containing 34 typed \"Conditions\" (conditions). The loan application form contained a space for information on the applicant's \"Present First Mortgage\" and immediately below it a space for information on the applicant's \"Other Financing.\" No information was set forth. In small print, just above the signature line, the standardized form said:\n\nI agree to: (1) give a first mortgage; (2) pay all legal and title and closing expenses including cost of an engineer's survey; (3) furnish and maintain fire and extended coverage insurance. My title and all title, mortgage and closing documents must be satisfactory to Prudential.\n\nA number of items were left blank on the form, including the only other reference to a \"first mortgage,\" the standard question as to the particulars of the applicant's \"present first mortgage,\" a question inapplicable to HRP's application for a loan on the Hotel which had not yet been constructed.\n\nOn September 21, 1973, after discussion and negotiation of the terms, HRP returned to Prudential the executed loan application and rider setting forth the conditions, with a check for $61,250 as payment of the required service charge and a $490,000 letter of credit as a non-refundable standby fee. \"S. Shapiro\" signed the loan application on behalf of HRP. One of the last items completed on the loan application shows that a Mr. Smith indicated \"commitment recommended\" by putting an \"x\" in a box. Other boxes, which were not completed, were provided below that recommendation for further processing by Prudential.\n\nOn October 25, 1973, Prudential extended to HRP a permanent loan commitment for $24,500,000\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e by \"an offer to make a mortgage loan to you\" letter (commitment letter), signed by its Associate General Manager, to which the original application rider, with some conditions modified, was attached. The two-page loan application itself was not attached. The commitment letter states:\n\nRe: Application No. 2 167 536\n\nGentlemen:\n\nPursuant to an authorization by this Company on October 23, 1973, we hereby offer to make a mortgage loan to you, as applicant, on the following terms and conditions:\n\nApplicant: National Properties, or\n\nNominee\n\nSecurity: 100 North Second Street,\n\nPhoenix, Arizona\n\nAmount of Loan: $24,500,000\n\nInterest Rate: 9 1/2%\n\nTerm: 360 Months\n\nPayments: $206,045 on account of\n\ninterest and principal.\n\nPrepayment Privilege: Pursuant to Attached\n\nRider\n\nThis offer is subject to Conditions # 1 through # 34 as set forth in the attached application riders submitted to Prudential with your Application for Mortgage Loan dated September 21, 1973 which are made a part of this offer.\n\nThis offer to make a mortgage loan is personal to applicant and is not assignable or transferable without the written consent of Prudential. If this offer is\n\nnot accepted and returned to Prudential within 10 days from the date hereof, at Prudential's option, this offer shall be null and void and of no further force and effect.\n\nSincerely,\n\nTHE PRUDENTIAL INSURANCE COMPANY OF AMERICA\n\nBy Mark F. Smith\n\nMark F. Smith\n\nAssociate General Manager, REI\n\nThe acceptance was provided by Prudential and completed by HRP:\n\nThis offer to make a mortgage loan and all terms and conditions thereof are accepted this 31st day of October, 1973.\n\nNATIONAL PROPERTIES\n\nBy S. Shapiro\n\nAmong the 34 conditions set forth in the application rider attached to Prudential's commitment letter were the following:\n\n2. The lien of the Deed of Trust shall be insured by an ALTA policy of title insurance, with ALTA endorsement number 3-R and 5, in an amount not less than the amount of the loan, issued by a title company approved by Prudential, insuring the deed of trust as a first encumbrance without exception, unless that exception is specifically approved by Prudential.\n\n12. At the time of disbursement of the loan, the security shall not be encumbered by secondary or subordinate liens given to secure additional financing, unless approved by Prudential.\n\nNeither the commitment letter nor any amendment to it provided for a \"first mortgage\" or referred in specific terms to any priority that Prudential's deed of trust was to receive. Negotiations preceded the loan application and continued thereafter. The commitment letter conditions contained material changes from those attached to the loan application. Condition 33 to the loan application which required Prudential to participate with the Valley National Bank in the construction loan was deleted. Condition 33 to the commitment letter required HRP \"and equity investors acceptable to Prudential\" to invest $8,500,000 in \"developing and operating\" the Hotel. Terms of the \"Prepayment Privilege\" were also substantially modified.\n\nOn February 19, 1975, Prudential and HRP modified \"Prudential's offer to make a mortgage loan dated October 25, 1973,\" by deleting conditions 6 and 9 and substituting therefor:\n\n6. Prudential shall be furnished with a satisfactory affidavit that no chattel mortgage, conditional bill of sale, security agreement, financing statement, lease agreement or other title retention agreement, except as provided or permitted under Condition No. 9, has been made or executed with respect to any fixture or furnishing attached to or used in conjunction with any portion of the security.\n\n9. (a) Prudential shall have a valid first lien on and security interest in all furnishings, fixtures and equipment owned by applicant, located on the security and used in conjunction with the improvements thereon, and applicant shall provide Prudential with satisfactory fire insurance thereon. Prior to disbursement, applicant shall provide Prudential with a then current inventory of said furnishings, fixtures and equipment and satisfactory evidence that the same have been paid for in full and that there are no liens existing against the same. In the event title to all such items is not vested in applicant at closing, the security interest shall attach to each such item upon subsequent acquisition of title by applicant.\n\n(b) Applicant may, however, lease certain enumerated furniture and equipment in an amount not to exceed the initial total cost of $2,000,000 for a term of ten (10) years. The lease shall provide that if the lessee be in default under the lease, Prudential at its option may cure the default or purchase the equipment. Prudential's Deed of Trust shall provide that a default under the lease shall constitute a default under the Deed of Trust.\n\n(c) Applicant shall apply the proceeds from the sale, as it occurs, of each individual share of the limited partnership interest in the ownership of the hotel, so as to prepay the lease obligation of $2,000,000, enumerated in Condition No. 9(b).\n\nPrudential's commitment letter required HRP to begin construction within six months (condition 18) and in fact construction commenced in December, 1973.\n\nIn many real estate developments, financing is accomplished in two steps -- a short-term construction loan and a long-term permanent loan. In this case, however, financing became a three-step process because HRP, as owner-developer, began construction with its own funds before obtaining interim construction financing. A.R.S. § 33-992 provides that mechanics' and materialmen's liens will relate back to the date construction commences rather than to the time of actual filing and will, therefore, have automatic priority over a subsequently recorded deed of trust. The \"broken priority\" which resulted from HRP's commencement of construction before recordation of any encumbrances securing either an interim or permanent loan, was known to Prudential at the time construction commenced.\n\nBy early 1975, HRP had substantially completed 20 stories of the superstructure, after spending in excess of $6,000,000 of its own funds in construction costs. HRP then approached UCB for a construction loan on the project and negotiations ensued among HRP, UCB and Prudential, culminating in what became known as the Five-Party Agreement (agreement) executed May 2, 1975.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Under this agreement, UCB agreed to provide the needed construction financing and Prudential agreed to permit the assignment of its loan proceeds to UCB upon compliance by HRP with its obligations as defined by the agreement. The agreement defined those obligations in the following terms:\n\nPrudential has issued to National Properties, a partnership [HRP], a mortgage loan commitment evidenced by a letter [commitment letter] dated October 25, 1973, as amended by letters, respectively dated October 29, 1973, October 16, 1974, February 19, 1975, and March 4, 1975, from Prudential to National [HRP], copies of which are attached hereto as Exhibit C and made a part hereof by this reference (hereinafter called \"the Commitment\"), for a permanent loan in the principal sum of $25,500,000.00 . . . to be secured by a valid Trust Deed on the Hotel Property, including improvements being erected and to be erected thereon, a valid first lien and security interest in the rights and leasehold estates of HRP with respect to the Parking Facility, and the other collateral security referred to or described in the Commitment.\n\nThe agreement referred to and had attached to it as Exhibit C the commitment letter (including the 34 conditions) and all amendments to it, which were \"made a part hereof by this reference.\" Further exhibits attached to the Five-Party Agreement are: A, the legal description of the real property on which the Hotel is situated; B, the legal description of the real property on which the parking garage is located; D, the letter from Prudential to HRP by which Prudential consented to HRP's designation as nominee of National Properties pursuant to the commitment letter; E, a loan agreement between HRP and Nametco Corp. regarding construction of the Hotel; and F, an acknowledgement by Prudential identifying the commitment letter and each amendment to it by date as \"the 'Commitment'\" and setting forth those conditions which had been wholly or partially satisfied or waived. For instance, Prudential acknowledged that amended condition 9(c) of the commitment letter quoted above had been waived. Except for the reference in the commitment letter to the loan application which has been previously quoted, there was no reference to the loan application in the agreement and it was not attached\n\neither as an exhibit or as an exhibit to an exhibit.\n\nDuring the negotiations of the Five-Party Agreement, all parties were aware that construction had commenced prior to recording an instrument securing either the interim or permanent loan and that as a result any mechanics' and materialmen's liens filed as to the construction would have priority as a matter of law over any subsequently recorded encumbrance.\n\nBecause of the broken priority, UCB took steps to assure both itself and Prudential that acceptable title companies would insure the positions of UCB and Prudential as first lien positions despite the broken priority. After receiving an indemnity agreement from the general partner of HRP, Arizona Title Insurance and Trust Company (Arizona Title) agreed to issue policies insuring UCB and Prudential against any mechanics' and materialmen's lien which would have statutory priority over their lenders' liens. Prudential and UCB also required that the policies be reinsured by a group of substantial title insurance companies.\n\nBy letter of May 1, 1975, Prudential preapproved a specimen form of title insurance policy. The letter indicated that the approved policy would satisfy condition 2.\n\nYou are hereby advised that the issuance to us [Prudential] of a legally effective policy in the form and content attached hereto will satisfy Condition No. 2 of our Commitment [letter] . . . .\n\nPrudential also notified Arizona Title that it could disburse the proceeds of its loan once Arizona Title had issued to Prudential the title policy in the same form and content as the specimen which it had approved.\n\nHRP paid the title insurance carriers the premiums necessary to purchase identical title insurance policies insuring both the interim and the permanent loans, including the agreement to insure over subsequently filed mechanics' and materialmen's liens. The premiums were paid in 1975, before the interim loan closed, and after the title policy and reinsurance agreements had been preapproved by Prudential.\n\nContemporaneously with the execution of the Five-Party Agreement, HRP executed in favor of Prudential a number of collateral loan documents, including a deed of trust which stated:\n\nTrustor [HRP] warrants that the title to all property conveyed by this Deed of Trust [the Hotel] is clear, free, and unencumbered.\n\nOthers of the collateral loan documents indicated that Prudential \"issued . . . its written commitment, dated October 25, 1973, pursuant to which [HRP] . . . agreed to make . . . a loan secured by a first deed of trust.\" These documents included an Assignment of Management Agreement, acceptance of assignment, assignment and security agreement, and others. The collateral loan documents were deposited in escrow with Arizona Title to be dated and recorded or distributed on closing of the permanent loan by Prudential.\n\nOn the date of execution of the Five-Party Agreement, May 2, 1975, and in reliance upon Prudential's commitment, UCB and HRP entered into and executed a construction loan agreement for $25,500,000 evidenced by a promissory note secured by a deed of trust which was \"to be insured as a first lien upon the real property described in said deed of trust . . . .\" Prudential was not a party to and is not bound by this construction loan agreement. Nor does Prudential claim to be a beneficiary of this agreement. In this construction loan agreement HRP agreed:\n\nTo furnish to Lender [UCB] upon recordation of the Deed of Trust and prior to any disbursement hereunder, a title insurance policy in such form, and by such company or companies, and with such reinsurance provisions as Lender may require, ensuring said Deed of Trust to be a first lien on said real property, subject only to such exceptions as Lender may approve.\n\nBorrower [HRP] shall give immediate notice to Lender [UCB] of any recorded mechanics' or materialmen's liens affecting the real property encumbered by the aforementioned Deed of Trust and upon\n\ndemand by Lender [UCB], Borrower [HRP] shall cause such lien to be discharged pursuant to the procedure set forth in Arizona Revised Statutes § 33-1004 or otherwise, and failure of Borrower [HRP] to effect the discharge of such lien within five (5) days from the date of such demand shall at the sole option of Lender [UCB], constitute a default hereunder.\n\nUCB further provided for discharge of any liens resulting from HRP contesting any bills for labor or material. The construction loan agreement further stated:\n\nBorrower [HRP] may contest any bill for labor material which it believes in good faith to be improper or unjustified; provided, however, that in the event any lien is filed with respect thereto Borrower [HRP] shall notify Lender [UCB] of such lien, and upon demand by Lender [UCB], shall cause such lien to be discharged by bond or otherwise . . . .\n\nBoth before and after the execution of the Five-Party Agreement, Barry Shapiro of HRP described the Prudential permanent loan as a \"first mortgage loan\" in soliciting financing.\n\nIn January 1976 the Hotel opened for business. However, because of disputes between the general contractor, the subcontractors, and HRP, substantial numbers and amounts of mechanics' and materialmen's liens were filed against the Hotel in February 1976. By the time the statutory period for filing all such liens had expired, the total amount of liens approximated $7,000,000. The lien total after elimination of multiple filings, however, was approximately $2,900,000.\n\nHRP, for its part, was unwilling to remove the liens by bonding because liens in the amount of $7,000,000 would require a bond of $10,000,000 despite the fact that the unduplicated lien total was less than $3,000,000.\n\nUCB's position was that HRP was obligated under the construction loan agreement either to provide a bond or make other appropriate arrangements or to pay off the lien claims in order to allow transfer of the loan to Prudential. UCB stated to HRP:\n\nWe wish to remind you of your obligation to complete the project free of liens by March 31, 1976 in order to permit funding of Prudential's loan by that date. Considering your indicated intent to dispute final billings with several sub-contractors and the contractor, your ability to cover potential liens with bonds will be important to avoid default.\n\nOn November 8, 1976, representatives from HRP, UCB and Prudential met in Prudential's home office in Newark, New Jersey, to discuss what remained to be done to satisfy the commitment letter which was going to expire the following month. Prudential took the position at this meeting and ten days later in a letter that it was entitled to a \"first mortgage\" under the loan application, and that the loan application was incorporated by reference into the commitment letter. Prudential indicated that it was not going to fund the permanent loan until it received an in-fact first lien, which would have required that all mechanics' and materialmen's liens be paid or otherwise satisfied before the loan could close.\n\nConstruction of the Hotel was nearly completed and virtually the entire amount of the construction loan, $25,500,000, had been funded by UCB. HRP had invested almost $10,000,000 in the Hotel. As a result of the meeting in Newark, Prudential agreed to extend the deadline for closing the permanent loan until June 30, 1977.\n\nOn February 8, 1977, HRP and UCB delivered to Prudential evidence of satisfaction of the terms of the commitment letter. This was rejected on the ground that it failed to comply with the terms of the commitment; Prudential refused to fund the permanent loan.\n\nUCB filed a declaratory judgment action against Prudential the following week, seeking a declaration that Prudential's commitment letter conditions had been met and that Prudential was therefore obligated to fund the permanent loan. HRP later\n\njoined in the action. A final tender of compliance was made on June 30, 1977, and again Prudential refused to fund based in part on the presence of mechanics' liens. The Prudential permanent loan was not closed.\n\nFinally, on January 18, 1978, UCB completed foreclosure on the deed of trust securing its construction loan and became the owner of the Hotel. HRP lost the Hotel.\n\nThe litigation, which had already been initiated, proceeded to trial in due course and results in this appeal.\n\nC. The Trial Court Proceedings\n\nThe trial court entered judgment on August 29, 1979, in favor of UCB and HRP following protracted trial proceedings.\n\nThe threshold and related issues before the trial court were: (1) Whether the loan application of September 21, 1973, which refers to a \"first mortgage,\" was incorporated by reference into the commitment letter of October 25, 1973; and (2) whether Prudential was entitled to an in-fact first lien on the Hotel by the terms of the commitment letter, as opposed to an insured first lien. The first issue was decided by the trial court as a matter of law, in the first instance, on partial summary judgment before trial. The second issue was tried to the court sitting without a jury in \"Phase I\" of the trial. Because there were numerous hearings and four separate trials, the trial court and the parties adopted the practice of referring to the separate trials as phases.\n\nOn the first issue of whether the loan application was incorporated into the commitment letter by reference, the court ruled as a matter of law that the commitment letter was unambiguous and that it did not incorporate the loan application. There were motions pending at that time focusing on the issue of whether Prudential was entitled to an actual first lien or only to a policy of title insurance insuring a first-lien position. The trial court denied the motions on November 4, 1977, but granted partial summary judgment in determining that \"the [loan] application is not incorporated by reference by the commitment letter issued by Prudential.\"\n\nThe parties on appeal have taken diametrically opposed views of whether the trial court determined that the loan application was not incorporated in the commitment letter as a matter of law on partial summary judgment, or as a matter of fact after trial to the court. HRP and UCB take the position that this issue was tried to the court. Prudential adheres to the position that it was determined by the court on partial summary judgment. We shall set forth in detail the position that Prudential took after the trial court ruled that the loan application was not incorporated by reference by the commitment letter and before the trial of Phase I through the entry by the court of findings of fact and conclusions of law regarding that phase.\n\nPhase I. In a lengthy trial memorandum for Phase I submitted by Prudential on December 9, 1977, it summarized its position as follows:\n\nPrudential's position in this court is that the promise in the original loan application to give a first mortgage coupled with the surrounding circumstances and the express language in numerous [collateral loan] documents executed on May 2, 1975 [the same date as the Five-Party Agreement] are the basis for Prudential's right to an actual first mortgage. Condition 2 to the Commitment [letter] simply evidences and reinforces that underlying right to an actual first deed of trust. In other words, the borrower first agreed to give Prudential a first mortgage and second to insure that first mortgage as being of first priority with a title insurance policy which the borrower obtains.\n\nThe rhetorical question which must be put to UCB and to HRP [regarding Condition 9] is just how was Prudential to have a valid first lien on the fixtures (i.e. part of the real estate) and not have a valid first lien on the structure and the\n\nground? They argue for an absurd, indeed impossible interpretation.\n\nIn the joint pretrial statement, which all of the parties filed on the same date as Prudential's trial memorandum, Prudential listed as contested issues of fact that it deemed material the following:\n\n(1) The Prudential loan commitment [letter] of October 25, 1973, incorporated the terms of the National Properties [HRP] loan application (a) by reference, (b) by implication or (c) by practice and usage.\n\n(2) At the time the permanent loan commitment [letter] was entered into and at all times thereafter both Prudential and National Properties and its successor [HRP] understood and intended that Prudential was entitled to receive as a condition of funding the permanent loan an actual first mortgage lien encumbrance on the property.\n\n(8) All of the parties understood and intended that the use of the phrase \"first mortgage\" as it appeared in the loan application meant an actual first mortgage lien encumbrance on the real property and that Prudential was entitled to an actual first mortgage lien encumbrance on the real property as a condition of funding.\n\nPrudential clearly asserted a right to trial on the issue of incorporation by reference notwithstanding the earlier ruling by the court.\n\nA five-day trial to the court commenced on December 13, 1977, in which the issues were stated by the court to be limited to whether Prudential was entitled to an in-fact first lien or an insured first lien under the commitment letter, specifically under conditions 2 and 9.\n\nHowever, immediately before the trial, the court ruled on the record as a matter of law \"that Condition 2 of the Commitment [letter] is clear, standing alone and by itself without reference to anything else, and requires only an insured first position as opposed to an actual first position.\"\n\nThe questions regarding the incorporation of the loan application into the commitment letter and the effect of condition 2 had ostensibly been decided by the court's rulings before trial. Although the Phase I trial was supposed to be limited to the remaining question of whether condition 9 entitled Prudential to an in-fact first lien on the Hotel, the trial court, at the behest of Prudential and over objection by UCB and HRP, admitted the loan application in evidence. The commitment letter, the Five-Party Agreement, the collateral loan agreements, and numerous other exhibits were also admitted in evidence. The witnesses were examined regarding the loan application, their understanding of its relationship to the commitment letter and the other agreements, their understanding of the \"first mortgage\" provision, their understanding of conditions 2 and 9, and, in sum, the surrounding circumstances and negotiations regarding the whole transaction.\n\nOn January 10, 1978, after the trial, Prudential submitted proposed findings of fact and conclusions of law which, if adopted by the trial court, would have found as a matter of law and as a matter of fact from the evidence presented during Phase I that the loan application provision referring to a \"first mortgage\" should be read into the commitment letter and, along with conditions 2 and 9, among others, require that HRP provide Prudential with an in-fact-first lien. The proposal included:\n\n11. With respect to (a) the September 21, 1973 loan application which was signed by National [HRP] (and the agreement or promise contained therein of National to give a first mortgage to Prudential); (b) the October 12, 1973 signed application riders; and (c) the October 25, 1973 offer-to-loan [commitment] letter and its annexed application riders; they need not all be physically annexed or attached one to the other to be integrated or incorporated by reference. A sufficient connection between the papers is established simply by a reference in them to the same subject matter or transaction.\n\nThe trial court rejected Prudential's proposed findings and conclusions.\n\nOn January 12, 1978, Prudential filed a motion for judgment and indicated:\n\nNo matter how one slices the loaf, Prudential's entitlement or non-entitlement to an actual first mortgage lien is not and cannot be dependent solely upon Conditions 2 or 9 nor was the recent trial restricted to that narrow, isolated and meaningless determination. The contents of the September 21, 1973 loan application and the written [collateral loan] agreements reached by the parties on or about May 2, 1975, are relevant, significant and dispositive and cannot be ignored. The Court, to do its job properly, must look at all those matters in order to determine whether Prudential was entitled to an actual first lien . . . .\n\nTo conclude Phase I of the trial, the court entered formal findings and conclusions on March 24, 1978, pursuant to Rule 52, Rules of Civil Procedure. Specifically:\n\n8. The printed form of [loan] application as completed and signed by National [HRP] on September 21, 1973 was not incorporated by reference in or made a part of the contract [commitment letter] dated October 25, 1973.\n\nThe court also found: The commitment letter was \"clear and unambiguous with respect to Prudential's claimed entitlement to a first lien in fact on the realty instead of only a deed of trust insured as a first lien.\" The commitment letter entitled Prudential only to a deed of trust insured as a first encumbrance and no provision of the commitment letter gave Prudential a right to an in-fact first lien on the Hotel. On or before May 2, 1975, the date of execution of the Five-Party Agreement, Prudential knew that priority had been broken and that any mechanics' or materialmen's liens filed against the Hotel which remained unresolved would have priority over any deed of trust that would be filed then or thereafter, since construction of the Hotel had begun before any deed of trust or other security agreement was recorded by HRP in favor of UCB or Prudential. The collateral loan documents executed concurrently with the Five-Party Agreement \"were not intended to and did not create any additional conditions precedent to Prudential's obligation to fund its permanent loan commitment.\" Prudential agreed in the Five-Party Agreement to fund the permanent loan within 15 days after compliance with the conditions of the commitment letter. In so doing, Prudential was required under the terms of the agreement to fund its loan before the end of the statutory period for filing of liens and thus demonstrated its willingness to rely upon title insurance to protect its position.\n\nThe court found in the alternative that had Prudential's commitment letter not been clear and unambiguous it would nevertheless construe any ambiguity against Prudential as the drafter of the commitment letter.\n\nThe court again found that Prudential was not entitled, as it had argued, to an in-fact first lien by virtue of condition 2 of the commitment letter, but only to a deed of trust insured by a title insurance policy as a first encumbrance. Prudential had also argued that it was entitled to an actual first lien on the real property pursuant to condition 9 of the commitment letter. The court found that the provisions of that condition related only to personal and not real property.\n\nIn sum, the court found that the existence of mechanics' and materialmen's liens did not affect Prudential's obligation to fund its permanent loan.\n\nThereafter, Prudential filed a petition for special action in the Supreme Court of Arizona (No. 13810-SA) requesting the Court to take jurisdiction and direct the trial court to enter a declaratory judgment that Prudential was entitled to a \"first mortgage\n\nlien position\" as a condition of its permanent loan. The Supreme Court declined to accept jurisdiction.\n\nPhase II. The issues of liability were tried to a jury in a lengthy trial which resulted in verdicts on May 23, 1979, in favor of HRP and UCB following the court's rulings that (1) Prudential's demand for an in-fact first lien was an anticipatory breach of the contract; (2) HRP's continued performance did not constitute a waiver of the anticipatory breach; (3) HRP need only demonstrate that it had the ability to perform the conditions of the contract rather than prove actual performance; and (4) HRP's prospective inability to perform because of insolvency could not be claimed by Prudential as a defense to an action for anticipatory breach.\n\nPhase III. The issues relating to HRP's damages were tried to the court sitting without a jury. The court found HRP's damages to be its loss of equity in the Hotel, totalling $10,494,000.\n\nPhase IV. The final phase of the trial was decided on partial summary judgment in which the court awarded UCB nominal damages of $1.00 plus costs and certain attorneys' fees.\n\nD. The Appeal.\n\nPrudential filed a printed appellant's opening brief containing 46 pages. A maximum of 50 pages is permitted by rule 14(b), Rules of Civil Appellate Procedure. HRP and UCB, through their master settlement agreement executed during the pendency of the case in the trial court, had joined forces and shared a joint interest in the common pursuit of the same claims against Prudential. In an act of legerdemain HRP and UCB filed separate appellee's answering briefs, each printed, and each almost 50 pages long (not including their separate cross-appellants' opening briefs). HRP and UCB divided the issues raised by Prudential between them and each addressed only those separate issues. HRP and UCB then provided in their separate briefs that they were \"adopting by reference\" each other's briefs. HRP and UCB have effectively filed one joint brief under two covers which is twice the length of that permitted by rule 14(b) and twice the length of that permitted to and filed by Prudential. See rules 8(b) and 13(f) regarding a joint brief.\n\nPrudential refers to this tactic as \"cutesiness.\" However, Prudential did not object or file a motion to strike the briefs. The court was not aware of this maneuver until preparation for oral argument was well underway. This court specifically disapproves of two parties who have a joint interest in the appeal splitting issues which are applicable to both between themselves and filing separate briefs each in the maximum number of pages permitted. An appropriate order of this court should first have been sought before these appellees' briefs were filed.\n\nPrudential appeals from the judgment in favor of UCB and HRP. No separate issue is raised, however, regarding the award of attorneys' fees.\n\nPrudential has raised five particular questions. However, numerous facets of each question were presented to and considered by the court. Although they are not specifically designated, they have been disposed of by our discussion of the legal principles in this decision. The claims made by Prudential are that: (1) The trial court erroneously determined that it was not entitled to an in-fact first lien on the Hotel but only to a deed of trust insured as a first lien; (2) the trial court erroneously ruled that Prudential's insistence on an in-fact first lien on the Hotel was an anticipatory breach of the contract; (3) the trial court erroneously ruled that Prudential must fund the loan even if it was \"funding into a default\" and even if HRP was insolvent; (4) the trial court committed reversible error in the trial to the jury when it permitted questioning of Prudential's witnesses to which Prudential invoked the attorney-client privilege; and (5) the trial court applied an incorrect measure of damages to determine Prudential's liability. We will address the issues in that order.\n\nUCB and HRP have also filed cross-appeals and a separate appeal which are largely conditional upon a ruling by this court reversing the judgment below. The only unconditional issue raised on the HRP cross-appeal is HRP's entitlement to pre-judgment interest.\n\nIII. PRUDENTIAL'S CLAIM TO AN IN-FACT FIRST LIEN\n\nA. Introductory Statement\n\nWe begin with the proposition that \"[I]n the transactions of business life, sanity of end and aim is at least a presumption, albeit subject to be rebutted.\" Outlet Embroidery Co. v. Derwent Mills, Ltd., 254 N.Y. 179, 183, 172 N.E. 462, 463 (1930). Prudential argues on appeal that no reasonable and prudent lender would have committed to lend $25,500,000 without what it terms the \"rock hard security\" of an \"in-fact first lien.\" The trial court, however, determined that the contract, which consisted of a commitment letter, the attached application rider containing specific conditions, and a number of amendments, did not include the initial loan application form and its \"first mortgage\" provision. For the purpose of this opinion, we are assuming that \"first mortgage\" is synonymous with an in-fact first lien.\n\nIn finding that the commitment letter dated October 25, 1973, constituted a fully integrated contract as between Prudential and HRP, the court also found that the collateral loan documents executed at the time of the Five-Party Agreement dated May 2, 1975, were not intended to and did not create additional conditions precedent to Prudential's obligation to fund the permanent loan. It further found that Prudential's claim to an in-fact first lien was unsupported by any conditions of the commitment letter or the record in Phase I and found Prudential's refusal to fund the loan was therefore an anticipatory breach of the contract.\n\nThe threshold issue with which we are presented in this appeal is the question of whether Prudential was entitled to require that the property be free of liens in addition to compliance with the conditions of the commitment letter at the time of closing the permanent loan, or if it was, as UCB and HRP contend, only entitled under the commitment letter to a policy of title insurance insuring its deed of trust as a valid first lien on the property.\n\nAt the outset, we must determine whether the words which appear in the commitment letter operate to incorporate by reference the two-page form loan application itself. If the commitment letter does not incorporate the loan application by reference, as found by the trial court, this court must determine the character of the Phase I trial. If the incorporation by reference issue was tried to the court, the question is then whether the trial court's holding that Prudential was entitled under the commitment letter only to a deed of trust insured as a first lien was supported by the evidence on the record.\n\nWhatever Prudential's position as to the effect of condition 2 at trial,\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e its position on appeal is clear.\n\nNobody ever contended that the language of Condition 2 (the requirement of a title insurance policy) was what required\n\nan actual first encumbrance. It was the Application's promise to \"give a first mortgage\" which required one. All Condition 2 required was a title insurance policy. The letter of May 1, 1975, from a Prudential representative said that Condition 2's requirement of a title insurance policy would be satisfied by a certain policy. It would.\n\nPrudential has never contended and does not say now that Condition 2 required anything beyond what Condition 2 purports to require. Prudential does not rest its claim of a right to insist on a first lien position on Condition 2 at all.\n\nWhatever Prudential's position as to the effect of condition 9 and the other conditions regarding a first lien at trial,\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Prudential's position on appeal is clear:\n\nNo Condition from 1 through 34 expressly promised to give a first mortgage on the property.\n\nIn this appeal, the linchpin of Prudential's argument is that the \"first mortgage provision in the loan application was incorporated by reference in the loan commitment.\" Prudential states in its brief:\n\nHRP's promise to \"give a first mortgage\" was incorporated by reference in the loan commitment [letter]. The parties expressed their understanding that this was one of the terms of the agreement in collateral documents they signed. HRP told others it was bound to give Prudential a \"first mortgage\" and UCB confirmed HRP's duty to complete the project free of liens in order to permit funding of the Prudential loan. It was only when HRP met obstacles to its giving a first lien that plaintiffs below [HRP and UCB] began casting about for a way to evade the agreement. As a matter of law, the court below erred in reading out of the contract a key promise which was part of it from the beginning.\n\nPrudential takes the position on appeal that \"this is . . . a plain incorporation by reference case,\" and that the language in the commitment letter is clear and unambiguous in incorporating not only the application riders but also the loan application itself. Prudential does not take the position that the language of incorporation is ambiguous and that therefore a trier of fact should determine the intent of the parties. Its position is that the trial court erred in determining that the language in the commitment letter did not incorporate the terms of the loan application and that therefore the judgment should be reversed and the trial court directed to enter judgment for Prudential.\n\nB. The Loan Application and the Commitment Letter: Incorporation or Not.\n\nIt is fundamental that the interpretation of a contract is a question of law or, at most, a mixed question of law and fact, neither of which is binding on this court on review. Schuldes v. Wubbolding, 15 Ariz. App. 527, 489 P.2d 1229 (1971); Guirey Srnka \u0026 Arnold, Architects v. City of Phoenix, 9 Ariz. App. 70, 449 P.2d 306 (1969); Bowen v. Watz, 5 Ariz. App. 519, 428 P.2d 694 (1967).\n\nThe language relevant to our primary determination of whether Prudential's commitment letter of October 25, 1973, is ambiguous is as follows:\n\nThis offer is subject to Conditions # 1 through # 34 as set forth in the attached application riders submitted to Prudential with your Application for Mortgage Loan dated September 21, 1973 which are made a part of this offer.\n\nThe trial court ruled on partial summary judgment prior to trial that the above language was not ambiguous and that the commitment letter did not, as a matter of\n\nlaw, incorporate the loan application by reference.\n\nThe commitment letter does not state \"this offer is subject to the loan application, dated September 21, 1973, including conditions # 1 through # 34 as set forth in the application rider, which is made a part of this offer.\" The commitment letter is specifically drawn to include by reference the application rider which sets forth the conditions and to refer to the loan application only for the purpose of identifying the application rider. The conditions attached to the loan application are made a part of the commitment letter; the loan application is not. Prudential, in its opening brief, described clearly the distinction which the trial court made between the loan application and the loan commitment.\n\nNo Condition from 1 through 34 expressly promised to give a first mortgage on the property. [Loan] [a]pplication No. 2 167 536, however, did. The trial court construed the commitment letter to include conditions # 1 through # 34, but to exclude the Application . . . .\n\nExactly. We agree with the trial court that the commitment letter is clear and unambiguous and does not incorporate the loan application by reference.\n\nIf the meaning of a contract can be determined from the four corners of the document and cannot reasonably be construed in more than one sense, extraneous documents are irrelevant and the court must give effect to the language of the agreement. See Associated Students of University of Arizona v. Arizona Board of Regents, 120 Ariz. 100, 584 P.2d 564 (App.1978), cert. denied, 440 U.S. 913, 99 S.Ct. 1226, 59 L.Ed.2d 462 (1979); Hofmann Co. v. Meisner, 17 Ariz. App. 263, 497 P.2d 83 (1972). The mere fact that the parties disagree as to the meaning of language contained in the agreement is not sufficient to create an ambiguity. Giovanelli v. First Federal Savings and Loan Ass'n, 120 Ariz. 577, 587 P.2d 763 (App.1978). Associated Students, supra.\n\nIn interpreting the language of the commitment letter, we are guided by the primary rules of interpretation as set forth in the Restatement:\n\nThe standard of interpretation of an integration, except where it produces an ambiguous result, or is excluded by a rule of law establishing a definite meaning, is the meaning that would be attached to the integration by a reasonably intelligent person acquainted with all operative usages and knowing all the circumstances prior to and contemporaneous with the making of the integration, other than oral statements by the parties of what they intended it to mean.\n\n1 Restatement of Contracts § 230 at 310 (1932). See also Arizona Land Title \u0026 Trust Co. v. Safeway Stores, Inc., 6 Ariz. App. 52, 429 P.2d 686 (1967). Only when the meaning of the contract remains uncertain after application of the primary standards of interpretation cited above may the court apply the rule of construction that ambiguity of language is to be construed against the drafter of the contract. See Phelps Dodge Corp. v. Brown, 112 Ariz. 179, 540 P.2d 651 (1975); Polk v. Koerner, 111 Ariz. 493, 533 P.2d 660 (1975); 1 Restatement of Contracts § 236(d) at 328 (1932).\n\nAlthough neither physical attachment nor specific language is necessary to incorporate a document by reference, the incorporating instrument must clearly evidence an intent that the writing be made part of the contract. See Industrial Commission v. Arizona Power Co., 37 Ariz. 425, 295 P. 305 (1931); Beedy v. San Mateo Hotel Co., 27 Cal.App. 653, 150 P. 810 (1915); 17A C.J.S. Contracts § 299 at 136 (1963). When the question of whether another paper or term has been incorporated by reference depends on \"the exercise of speculation, surmise and conjecture\" the court will refuse to rewrite the contract. Home Insurance Co. v. Lomax, 17 Ariz. App. 520, 524, 498 P.2d 594, 598 (1972). See also Federal Ins. Co. v. P.A.T. Homes, Inc., 113 Ariz. 136, 547 P.2d 1050 (1976).\n\nIn ascertaining the parties' intent, the court will look to the plain meaning of the words as viewed in the context of the contract as a whole.\n\nA judicial interpretation of a contract does not reach a point where the meaning of some clause can be said to be in doubt upon merely arriving at a conclusion that such clause may, as an abstract proposition, be given either of two meanings. A clause in a contract, if taken by itself, often admits of two meanings, when from the whole contract there is no reasonable doubt as to the sense in which the parties use it.\n\nClimate Control, Inc. v. Hill, 86 Ariz. 180, 188, 342 P.2d 854, 859 (1959), appeal dismissed, 364 U.S. 409, 81 S.Ct. 180, 5 L.Ed.2d 185 (1960).\n\nPrudential relies on two cases, each of which construed identical language contained in a state-issued workmen's compensation policy. \"[T]he rate or rates of premium for this policy shall be subject to the experience rating plan of The Industrial Commission of Arizona . . . .\" Industrial Commission v. Arizona Power Co., 37 Ariz. at 428, 295 P. at 306; Climate Control, Inc. v. Hill, supra. The Supreme Court found in each case that the language was sufficient to incorporate the provisions of the experience rating plan, citing the rule in its most general form that \"[i]f one writing refers to another, the intention of the parties is to be gathered from the two instruments.\" Industrial Commission v. Arizona Power Co., 37 Ariz. at 431, 295 P. at 307. The court used similarly broad language in Climate Control Inc. v. Hill for the same general proposition that \"[m]atters contained in other writings which are referred to are to be regarded as part of the contract and properly to be considered in the interpretation of the contract.\" 86 Ariz. at 188, 342 P.2d at 859.\n\nNeither Arizona Power nor Climate Control, however, stands for the proposition that reference to a document for any purpose is sufficient to incorporate the document by reference into the contract: A reference made for a particular purpose, which purpose is clear from the contract, will operate to incorporate the document only for that particular purpose.\n\nIn Short v. Van Dyke, 50 Minn. 286, 52 N.W. 643 (1892), the Minnesota Supreme Court rejected the argument that a list of land endorsed on the contract was thereby incorporated by reference. The court held:\n\nIn a written contract, a reference to another writing, if the reference be such as to show that it is made for the purpose of making such writing a part of the contract, is to be taken as a part of it just as though its contents had been repeated in the contract. But if the reference be made for a particular purpose, expressed in the contract, it becomes part of it only for that purpose.\n\n50 Minn. at 289, 52 N.W. at 644 (emphasis added).\n\nA reference to an earlier document for descriptive purposes will not operate to make the earlier document a part of the later agreement. In Frierson v. International Agricultural Corp., 24 Tenn.App. 616, 148 S.W.2d 27 (1940) the parties had executed separate contracts at different times, all of which dealt with the same subject matter. In answer to the argument that the later contract's references to the former agreements operated to incorporate the former provisions into the latter, the court held:\n\nA reference to a former paper for descriptive purposes is in no sense a readoption of the former provisions; and it certainly cannot have the effect of importing into a new contract the conditions and limitations of the former agreement . . . . We are of [the] opinion that this limited reference is of moment in determining the question as to whether the provisions of the old contract were to be kept alive. If such was the understanding of the parties, why was there not inserted a specific provision to that effect? Whether a later contract is to be deemed an independent one or to become incorporated with or correlated to the old agreement is to be determined by the\n\nintention of the parties as expressed in the later agreement.\n\n24 Tenn.App. at 629, 148 S.W.2d at 35.\n\nIn this case the language of the October commitment letter does not clearly and unequivocally evidence an intent that the September loan application be made part of the contract. The reference to the loan application is, to the contrary, clearly descriptive in nature, serving only to identify the \"conditions . . . set forth in the attached application riders . . . which are made a part of this offer,\" which conditions had been modified and were physically attached to the commitment letter. The absence of a physical attachment is not dispositive of the issue of incorporation where the reference to the other writing clearly evidences an intent that it be made a part of the contract. Industrial Commission v. Arizona Power Co., supra. The language of the commitment letter in this case, however, does not clearly evidence such an intent and the absence of a physical attachment of the loan application is consistent with the plain meaning of the words used and with the conclusion that the parties intended the reference for descriptive purposes only.\n\nPrudential urges adoption of the rule that any reference to a former writing for any purpose operates perforce to adopt the former writing as part of the later agreement. As support for its proposition Prudential cites Crabtree v. Elizabeth Arden Sales Corp., 305 N.Y. 48, 110 N.E.2d 551 (1953) as holding that the mere reference in one document to another acts to create one contract whenever both involve the same general subject matter. Crabtree is a statute of frauds case. As UCB correctly points out, the court adopted a more liberal incorporation test to avoid the risk that valid agreements may not be enforced because of technical non-compliance with the writing requirement of the statute. We are not faced with such a concern in this case.\n\nThat the loan application was not incorporated into the commitment letter is a conclusion made even more compelling in light of the fact that the commitment letter's \"attached application riders\" were not the same riders originally attached to the loan application form itself. The conditions attached to the loan application were substantially changed and then attached to the commitment letter. The conclusion is more compelling that the reference to the \"attached application riders\" with reference to the loan application was simply for historical purposes just as the reference to the \"application No. 2 167 536\" would refer to the prior history of the transaction out of which the commitment letter arose.\n\nAlthough Prudential argues that the loan application is incorporated in the commitment letter, the only provision in the loan application that it seeks to incorporate is the \"first mortgage\" clause. Prudential does not argue that there is any other material provision or information which the commitment letter lacks which is provided by the loan application.\n\nOf course, even if Prudential were able to demonstrate that the incorporation clause of the commitment letter which it drafted is ambiguous, such a demonstration would be self-defeating because ambiguities will be construed against the drafter. See, e.g., Covington v. Basich Bros. Construction Co., 72 Ariz. 280, 233 P.2d 837 (1951); Equitable Life \u0026 Casualty Ins. Co. v. Rutledge, 9 Ariz. App. 551, 454 P.2d 869 (1969). This is particularly true when a party is attempting to impose an obligation on another where otherwise such an obligation would not exist. See Galbraith v. Johnston, 92 Ariz. 77, 373 P.2d 587 (1962); Morgan v. Firestone Tire \u0026 Rubber Co., 68 Idaho 506, 201 P.2d 976, 983 (1948). Additionally, any ambiguity in the documents is subject to a factual determination concerning the intent of the parties and is to be resolved conclusively by the trier of fact which, in this case, was the trial court.\n\nWhere a party claims that his own ambiguous language constitutes a condition precedent to his performance, he is not entitled to such a favorable construction unless it is established that the parties\n\nintended to create a condition at the time of contracting.\n\nSouth Division Credit Union v. Deluxe Motors, Inc., 42 Ill.App.3d 219, 222, 355 N.E.2d 715, 718-19 (1976). See also, Cuna Mutual Ins. Soc'y v. Dominguez, 9 Ariz. App. 172, 450 P.2d 413 (1969) (loan contract).\n\nWe conclude that the trial court properly determined on partial summary judgment that the \"incorporation clause\" in the commitment letter is not ambiguous and that it did not incorporate the loan application.\n\nC. Partial Summary Judgment or Trial on the Merits: Both\n\nThe object of all rules of interpretation is to arrive at the intention of the parties as expressed in the contract. Phelps Dodge Corp. v. Brown, 112 Ariz. 179, 540 P.2d 651 (1975). While the primary purpose of any judicial interpretation of a contract is to ascertain the parties' intentions, it is the duty of the trial court in the first instance to determine if the parties intended the writing to be a complete and accurate integration of the terms of their agreement. See Nashem v. Jacobson, 6 Wash.App. 363, 492 P.2d 1043 (1972). A presumption exists that a contract complete on its face integrates the final intention of the parties, but the presumption does not apply when the writing is ambiguous or uncertain. 2 Restatement (Second) of Contracts § 214 (1981); 17 Am.Jur.2d Contracts § 260 at 664 (1964).\n\nThe trial court in this instance ruled on partial summary judgment that the language of Prudential's commitment letter was not ambiguous and that it did not incorporate the loan application by reference. Despite this ruling, however, the trial court subsequently allowed Prudential to introduce into evidence the loan application and testimony as to the meaning of the phrase \"first mortgage\" as contained in the loan application.\n\nPrudential contends now on appeal that the court's ruling on the incorporation issue was strictly one of law following motions for summary judgment; HRP and UCB take the contrary position that the matter was litigated and determined after full trial to the court. We must therefore resolve the dispute. See Southwest Forest Industries, Inc. v. Westinghouse Electric Corp., 422 F.2d 1013, 1015 (9th Cir.), cert. denied, 400 U.S. 902, 91 S.Ct. 138, 27 L.Ed.2d 138 (1970). The posture of the case as it is before us on appeal supports both positions. The trial record reflects some confusion as to what issues were supposed to be tried but no confusion as to what issues were in fact tried. At the beginning of Phase I, the trial court stated:\n\nNow, it's my understanding that we are here today to try two issues which center around Condition Two and Condition Nine of the Commitment [letter] issued October 25, 1973. We are not here to determine, if I understand correctly, whether or not there has been a compliance for those two conditions but simply what the two conditions require . . . .\n\nThe judge then went on to make a summary disposition of one of those issues:\n\nI am prepared to so rule at this time that Condition Two of the Commitment is clear, standing alone by itself without reference to anything else -- without reference to necessarily what might or might not be incorporated in by implication, by law, that the paragraph two standing alone by itself is clear and unambiguous on its face and requires only an insured first position as opposed to an actual first position.\n\nFollowing several days of testimony on not only condition 9 but also on the issues previously decided as matters of law -- condition 2 and the role played by the loan application in the transaction -- the trial judge expressed concern that his earlier ruling on condition 2 at the beginning of the trial may have been premature:\n\nI want to say one thing on the record . . . . As to the prematurity of my ruling at the commencement of the case, that the condition is, in and of itself, clearly ambiguous [sic], that is a ruling I would not have made by any stretch of the imagination if we were dealing with a\n\nnormal case. We had at least, I expect, at least a minimum of an hour, close to an hour and a half in argument in chambers off the record, and it was my understanding that both sides were urging me to make that ruling. That's the only reason. It is not something that is the prime reason. But I was under the impression that all three parties in this lawsuit wanted me to rule that it was ambiguous, or it was not ambiguous, before the testimony came in. And I therefore ruled, in my opinion, it was unambiguous.\n\nThe dispute as to whether the incorporation issue was decided on partial summary judgment or was in fact litigated and determined after trial to the court in Phase I could have significance with regard to our standard of review on this issue if it was determined only on partial summary judgment.\n\nThe record reflects that the trial court, despite its prior ruling on partial summary judgment that the loan application and its \"first mortgage\" provision had not been incorporated into the commitment letter, allowed the introduction of evidence at trial on the meaning of the phrase \"first mortgage\" as contained in the loan application and on the role played by the loan application in the whole transaction. In going beyond the four corners of the commitment letter, the court heard testimony on commercial lending practices and the course of dealing between and among the parties. The trial court considered the context and surrounding circumstances of the whole transaction from the time of the loan application through the sale of the Hotel. See Smith v. Melson, Inc., 135 Ariz. 119, 659 P.2d 1264 (1983). Prudential does not assert that there is any evidence not already in the record of Phase I that could be produced at a new trial which would influence the outcome of Phase I. Following Phase I, the court found that under all of the facts and circumstances, Prudential was not entitled to an in-fact first lien and that the parties did not intend that the loan application be part of the commitment letter.\n\nThe trial court first ruled on the issue of incorporation as a matter of partial summary judgment. Then, at the behest of Prudential, and over the objection of HRP and UCB, the trial court in Phase I heard testimony and received exhibits relating to the issues raised by Prudential in its trial memorandum and the pretrial statement. See the summary of Phase I in the description of the trial court proceedings. After the conclusion of the Phase I trial, Prudential in its findings and conclusions and in its motion for judgment sought to have the court rule that the loan application was incorporated in the commitment letter. The trial court found against Prudential. On appeal Prudential takes the position that the trial court ruled on the incorporation issue only as a matter of partial summary judgment. We do not agree with that interpretation of the record and therefore proceed to review the Phase I trial. Since we affirm both the granting of the partial summary judgment and the findings and conclusions that the loan application was not incorporated in the commitment letter, any issue as to the standard of review applicable to summary judgment is moot.\n\nD. The Phase I Trial\n\nAs a result of the Phase I trial, the trial court entered the following findings of fact and conclusions of law:\n\nFINDINGS OF FACT\n\n5. The Prudential Insurance Company of America (hereinafter referred to as \"Prudential\") issued to National [HRP] a permanent loan commitment evidenced by an offer-to-loan [commitment] letter dated October 25, 1973. That commitment [letter] had attached thereto thirty-four (34) conditions.\n\n6. Prudential's offer-to-loan [commitment] letter to National Properties of October 25, 1973, was accepted in writing by National Properties on October 31, 1973.\n\n. . . .\n\n11. Work commenced on the construction of the Hyatt Regency Phoenix Hotel in December of 1973 and at that time no interim construction financing had been obtained and no interim construction or permanent mortgage had been recorded.\n\n12. The Prudential commitment letter of October 25, 1973 . . . was drafted by Prudential.\n\n13. The commitment letter . . . is clear and unambiguous with respect to Prudential's claimed entitlement to a first lien in fact on the realty instead of only a Deed of Trust insured as a first lien.\n\n(a) By virtue of [the commitment letter] . . ., Prudential is only entitled to receive a Deed of Trust insured as a first encumbrance.\n\n(b) Condition 2 . . . is clear and unambiguous on its face and requires only that Prudential receive the defined ALTA title insurance policy insuring the Deed of Trust as a first encumbrance.\n\n(c) No other provision of [the commitment letter] . . . provides that Prudential is entitled to receive a first lien in fact on the realty.\n\n(f) Taking into account that FF \u0026 E [furniture, fixtures and equipment] is a term of art, Condition 9 . . . is clear and unambiguous and refers only to personal property and not to real property.\n\n(g) Alternatively, even if the loan commitment letter . . . could be argued to contain an ambiguity, it was drafted by Prudential and must be construed against Prudential with respect to any such claimed ambiguity.\n\n16. On May 1, 1975, Robert Wheeler, authorized to and acting for and on behalf of Prudential, stated in writing . . . that the issuance to Prudential of a legally effective ALTA title insurance policy would satisfy Condition 2 of Prudential's commitment letter of October 25, 1973.\n\n17. Prudential represented in writing [in the Five-Party Agreement] on May 2, 1975, that Prudential's commitment [letter] of October 25, 1973 remained in full force and effect.\n\n22. On or before May 2, 1975, Prudential knew that construction of the Hyatt Regency Phoenix Hotel had commenced and that priority had been broken, and that any mechanics or materialmen's liens filed against the project would be prior to any deed of trust then or thereafter recorded.\n\n24. The Prudential-HRP [collateral] loan documents executed on or about May 2, 1975 were not intended to and did not create any additional conditions precedent to Prudential's obligation to fund its permanent loan commitment.\n\nConclusionS OF LAW\n\n2. The Prudential commitment letter of October 25, 1973 . . . which was accepted by National on October 31, 1973 constitutes a fully integrated contract between those parties.\n\n3. Prudential's commitment letter of October 25, 1973 . . . is clear and unambiguous and as a matter of law requires that National Properties or its nominee [HRP] provide Prudential only with a Deed of Trust insured by a policy of title insurance as a first encumbrance and not in fact a first encumbrance on the real property which serves as security for Prudential's loan.\n\n4. Even if Prudential's commitment letter of October 25, 1973 . . . were not clear and unambiguous, it was drafted by Prudential and any ambiguity contained therein must be construed against Prudential.\n\n8. The printed form of [loan] application as completed and signed by National [HRP] on September 21, 1973 was not incorporated by reference in or made a\n\npart of the contract [commitment letter] dated October 25, 1973.\n\n12. The existence of mechanics and materialmen's liens do not affect Prudential's obligation to fund its permanent loan commitment.\n\nThe scope of our review is limited by rule 52(a), Rules of Civil Procedure.\n\nFindings of fact shall not be set aside unless clearly erroneous, and due regard shall be given to the opportunity of the trial court to judge the credibility of witnesses.\n\nWith regard to the court's rulings on issues litigated during trial to the court in Phase I, the Arizona Supreme Court has defined the standard of appellate review as follows:\n\nNo principles are better settled in Arizona than, first, that the duty of a reviewing court begins and ends with the inquiry whether the trial court had before it evidence which might reasonably support its action viewed in the light most favorable to sustaining the findings, and, second, that the reviewing court will not weigh conflicting evidence on appeal.\n\nO'Hair v. O'Hair, 109 Ariz. 236, 240, 508 P.2d 66, 70 (1973).\n\nThe relevant facts which have not already been set forth are as follows:\n\nThe record supports the conclusion that there was no discussion between Prudential and HRP regarding the \"first mortgage\" provision before Mr. Sam Shapiro signed the loan application, and there was no discussion regarding that provision before Prudential submitted the commitment letter to Mr. Shapiro which he signed. Mr. Shapiro read the loan application before he signed it and expected to give a \"first mortgage.\" There were no discussions regarding whether the language of incorporation in the commitment letter included the loan application as opposed to the application riders.\n\nMr. Barry Shapiro testified that on behalf of HRP he described the Prudential permanent loan as a \"first mortgage loan\" in soliciting financing. This had been done both before and after the execution of the Five-Party Agreement. His explanation was that the description \"first mortgage\" simply distinguished that mortgage from a second mortgage or a third mortgage. The credibility and weight of such testimony is for the trial court to evaluate. Lehman v. Whitehead, 1 Ariz. App. 355, 403 P.2d 8 (1965).\n\nIt is fundamental that if the language of a contract is susceptible to more than one reasonable interpretation, the circumstances existing at the time of contracting must be considered by the court in ascertaining the meaning of the contract. Sam Levitz Furniture Co. v. Safeway Stores, Inc., 105 Ariz. 329, 464 P.2d 612 (1970); Rental Development Corp. v. Rubenstein Constr. Co., 96 Ariz. 133, 393 P.2d 144 (1964), and that a contract should be construed in a manner so as to be reasonable and probable under those circumstances. Ball v. Stokely Foods, Inc., 37 Wash.2d 79, 221 P.2d 832, 835 (1950).\n\nThe circumstances which existed at the time of the execution of the commitment letter by Prudential and HRP indicate that it represented the agreement between them. We are not faced with a claim by Prudential that the commitment letter should be reformed to include the loan application or the \"first mortgage\" provision. Further, the circumstances which existed at the time of execution of the Five-Party Agreement, particularly the visible commencement of construction, were such that UCB would not have made an interim construction loan in reliance on a permanent loan commitment which, as a condition of funding, required an in-fact first lien, as opposed to an insured first lien. As Kratovil and Werner note:\n\nIt is obvious that if visible construction actually begins before the mortgage is recorded or becomes a lien, some or probably all of the mechanics' liens will be prior and superior to the mortgage.\n\nR. Kratovil \u0026 R. Werner, Modern Mortgage Law and Practice § 25.27(b) at 394\n\n(2nd ed. 1981). Under these circumstances, if Prudential had insisted on an in-fact first lien its permanent loan \"commitment\" would have been more illusory than real, inasmuch as the filing of any mechanics' or materialmen's liens, a likely prospect, would have allowed Prudential to walk away from the project.\n\nPrudential surrendered any such possible argument when it entered into the Five-Party Agreement and gave UCB the assurances which it did. The rational interpretation of the contract is that Prudential was to be provided with a valid deed of trust insured by Arizona Title and the reinsurers as a first lien. The evidence showed that Prudential was relying on this reinsured title insurance to protect its position, and that it would have received everything for which it bargained if it had deposited the loan proceeds in escrow as required by the parties' escrow instructions.\n\nIn Crone v. Amado, 69 Ariz. 389, 214 P.2d 518 (1950), the Arizona Supreme Court concluded that the parties' written construction contract was ambiguous and that it could look to the surrounding circumstances for aid in determining the parties' intent concerning whether the subject contract was on a cost plus or on a fixed price basis. The court considered the following circumstances to be relevant: (a) neither of the parties to the agreement had seen any of the plans or specifications at the time the agreement was signed; (b) no survey had been made regarding the proposed building site; (c) building materials were scarce at the time, and the building materials available were being rationed under OPA regulations. In light of those circumstances, the court concluded:\n\nIt does not seem plausible that any contractor in this situation would agree to build a building for a fixed price. A contract must be deemed to have been made with reference to the state of things existing at the time it was made. . . There was no intimation that it was not a cost-plus job until the defendants ran out of funds.\n\n69 Ariz. at 397, 398, 214 P.2d at 523, 524 (emphasis added). See also Smith v. Melson, Inc., 135 Ariz. 119, 659 P.2d 1264 (1983).\n\nThe developers in Crone gave no intimation that they believed the contract was on a fixed price basis until they ran out of funds. Similarly, at no time during the negotiations of the Five-Party Agreement did Prudential even suggest that it believed an in-fact first lien was required. Indeed, it was only after significant economic changes affecting commercial lending had occurred, after substantial mechanics' liens had been filed against the Hotel, and after the project had been completed and Prudential was being called upon to honor its loan commitment, that Prudential adopted such a position.\n\nPrudential argues that the requirement to \"give a first mortgage\" was so critical and so standard a provision that it hardly need be mentioned, since it is inconceivable that a lender would lend $25,000,000 without requiring an actual first lien. The evidence adduced at trial was to the contrary: Title insurance insuring a deed of trust as a first lien without encumbrance combined with Prudential's prohibition against secondary financing is a recognized method of protection utilized by lenders such as Prudential in situations such as this. In other words, the agreement to \"give a first mortgage\" did not \"evaporate.\" \"First mortgage\" must be read in the context of the loan application as a whole. When read in context, first mortgage acquires meaning: In the bald, simplistic terms of Prudential's standard printed form application, without going beyond the four corners of that document, \"first mortgage\" means everything and nothing. In the context of the conditions which define and qualify it, however, its meaning becomes clear; i.e., that the parties intended that Prudential would have an insured first lien. The essential terms regarding security were contained in conditions 2 and 12 attached to the loan application. Conditions 2 and 12, in the same language, are set forth in the conditions attached to the commitment letter. The \"first mortgage\" referred to in the\n\nloan application is particularized in condition 2 which is then incorporated bodily in the commitment letter.\n\nThis meaning is consistent with the acts and conduct of the parties up until the time the dispute first arose over the funding of the permanent loan on November 8, 1976.\n\nThe construction or interpretation given to the agreement as evidenced by the acts and conduct of the parties with knowledge of the terms and prior to any controversy as to meaning arises is entitled to great weight and when reasonable will be adopted and enforced by the court. See Associated Students, supra; Rose v. Chrysler Motors Corp., 212 Cal.App.2d 755, 28 Cal.Rptr. 185, 99 A.L.R.2d 1411 (1963). The acts of the parties themselves, before disputes arise, are the best evidence of the meaning of doubtful contractual terms. See Associated Students, supra; Brown v. Cowden Livestock Co., 187 F.2d 1015 (9th Cir.1951). This principle of practical construction applies only to acts performed before any dispute arises. Warner Constr. Corp. v. City of Los Angeles, 2 Cal.3d 285, 85 Cal.Rptr. 444, 466 P.2d 996 (1970).\n\nThe undisputed facts of the instant case demonstrate the minor nature of the role played by the September 1973 loan application in the transaction between the time of the October 1973 commitment letter and the time when litigation appeared imminent in November 1976. The only references to a \"first mortgage\" made by any of the parties were contained in letters sent by Barry Shapiro to potential investors in the Hotel. The letters which described Prudential's interest in the Hotel as a \"first mortgage,\" are significant only insofar as they indicate the parties' intent that Prudential have a secured interest. The letters do not, however, indicate the parties' intended definition of \"first mortgage.\"\n\nThe record shows that with the exception of the Shapiro letters' reference to a \"first mortgage,\" the first mention of the loan application occurred over three years after the commitment letter was executed and approximately one month prior to the original funding deadline of December 31, 1976, when Prudential, on November 8, 1976, asserted that the original loan application was part of the commitment letter. This appears to be the earliest date when Prudential claimed a right to an in-fact first lien. Until that date, Prudential's own Phoenix counsel, who had been heavily involved in the transaction, had never seen the loan application and found it necessary to request that his client furnish him with a copy. Thomas J. Reilly, Esq., one of the attorneys for HRP who had withdrawn because of a conflict of interest, testified that in February or March, 1976, he inquired of Lyman A. Manser, Esq., a partner in Lewis and Roca and the attorney representing Prudential, to confirm the position of Prudential with respect to liens and was informed that Prudential was not requiring a lien-free project.\n\nPrudential quotes from a letter written by Mr. Robert Fiddaman, Senior Vice President of UCB, to HRP to support its position. However, on its face, Mr. Fiddaman's letter relates to the terms and conditions of the interim construction loan agreement between HRP and UCB to which Prudential was not a party. UCB's construction loan agreement did require that HRP complete construction free of liens. However, Mr. Fiddaman testified that UCB puts such a provision in its interim construction loan agreement for reasons which are peculiar to interim, not permanent loans. Of course, neither this agreement between HRP and UCB nor Mr. Fiddaman's letter could serve to add a new condition to Prudential's commitment letter. The trial court, sitting as a trier of fact, heard all of the evidence on this issue and the court's findings are, once again, supported by the evidence.\n\nThe Five Party Agreement. The instruments relevant to our determination of what constituted the integration as between HRP and Prudential and UCB and Prudential are the loan application, the commitment letter with application rider containing the conditions, and the Five-Party Agreement with its attached exhibits.\n\nThe rider to the loan application containing the conditions, as modified, was attached to the commitment letter executed by Prudential and HRP in October, 1973. The loan application itself was not. The commitment letter is on its face an integrated contract.\n\nThe commitment letter with its rider setting forth the conditions was attached to the Five-Party Agreement later executed by HRP, UCB and Prudential in May 1975. The Five-Party Agreement is on its face an integrated contract. Section 1.3 of the Recitals specifically defines Prudential's \"commitment\" as those documents attached to the Five-Party Agreement as Exhibit C.\n\nPrudential has issued to National Properties, a partnership [HRP], a mortgage loan commitment evidenced by a letter dated October 25, 1973, as amended by letters, respectively dated October 29, 1973, October 16, 1974, February 19, 1975, and March 4, 1975, from Prudential to National, copies of which are attached hereto as Exhibit C and made a part hereof by this reference (hereinafter called \"the Commitment\"), for a permanent loan in the principal sum of $25,500,000 . . . .\"\n\nThe loan application is neither mentioned in the Five-Party Agreement nor attached to it. The same section 1.3 further defines the security for the permanent loan:\n\nWhen Prudential, HRP and UCB refer to a lien on other than realty, they refer to a \" first lien\"; when they refer to the lien on the realty, they do not.\n\nThere is a purposive parallel use of language in the commitment letter and the Five-Party Agreement which supports the conclusion that an in-fact first lien on the Hotel was not intended. Condition 2 of the commitment letter states \"the lien of the deed of trust shall be insured . . .,\" and section 1.3 of the Five-Party Agreement indicates that Prudential's permanent loan was \"to be secured by a valid Trust Deed on the Hotel Property . . . .\"\n\nOn the other hand, condition 9(a) of the commitment letter provides that \"Prudential shall have a valid first lien on and security interest in all furnishings, fixtures and equipment owned by applicant [HRP] . . .,\" and section 1.3 of the Five-Party Agreement further indicates that the permanent loan was to be secured additionally by \"a valid first lien and security interest in the rights and leasehold estates of HRP with respect to the Parking Facility, and the other collateral security referred to or described in the Commitment.\" (Emphasis added in both quotations.)\n\nBoth the commitment letter and the Five-Party Agreement refer to the security on realty as being a deed of trust or trust deed without any indication of priority while the same documents refer to Prudential's security interest in other property as a \"valid first lien.\"\n\nIn section 1.5 of the Recitals, Prudential acknowledges that UCB was issuing its own commitment to lend the sum of $25,500,000 in reliance upon \"the Commitment.\" Section 5.3 of the \"General Provisions\" of the Agreement provided that Prudential's only obligation was \"to make the Permanent Loan to HRP pursuant to the Commitment.\"\n\nThe parties' intention was also evidenced by the fact that, when Prudential confirmed the terms of its commitment at the time of the Five-Party Agreement, the application riders were attached to the Agreement as part of Exhibit C. The form loan application was not attached. Moreover, the parties expressly agreed that the documents comprising \"the commitment\" were attached to the Five-Party Agreement as Exhibit C. The failure to attach the loan application to either the commitment letter or to the Five-Party Agreement reinforces\n\nthe conclusion that it was not intended that the loan application would become part of the commitment. The trial court's finding was supported by the evidence.\n\nWhile the parties recognize that physical attachment is not necessary if the document to be incorporated is clearly and unambiguously incorporated by reference, there was no such clear and unambiguous incorporation by reference in this case. It is a basic rule of contract construction that to incorporate by reference:\n\n[T]he reference must be clear and unequivocal and must be called to the attention of the other party, he must consent thereto, and the terms of the incorporated document must be known or easily available to the contracting parties . . . .\n\n17A C.J.S. Contracts § 299 at 136 (1963) (emphasis added). Mere reference to a document for descriptive purposes does not operate as an incorporation of the document into a contract. Frierson v. International Agricultural Corp., 24 Tenn.App. 616, 629, 148 S.W.2d 27, 35 (1940).\n\nWhile it is not necessary that a contract state specifically that another writing is \"incorporated by this reference herein,\" the context in which the reference is made must make clear that the writing is part of the contract. The court in Arizona Power concluded that the \"subject to\" reference to the plan was sufficient to incorporate it and that the plan did not have to be set out in full in the contract. The distinction between the clear and unequivocal reference to the Rating Plan as a critical component of the policy before the court in Arizona Power and the passing reference to the loan application in Prudential's letter is apparent. The conclusion that the parties did not intend that the loan application be a part of the commitment is further evidenced by the fact that in the Five-Party Agreement they specifically identified those writings which were part of the commitment and did not include the loan application.\n\nThe defendant in Arizona Power also urged the court to consider letters between it and the Industrial Commission, discussing insurance coverage, in interpreting the terms of the insurance policy. The court dismissed this argument stating: \"'All prior negotiations, proposals and conversations are considered waived or merged in this written contract. And no rule is better settled than that parol evidence is inadmissible to vary or control the plain and unambiguous terms of a written contract . . .'\" 37 Ariz. at 436, 295 P. at 309. In this case, the loan application was a part of prior negotiations, and it cannot be used to vary the terms of the commitment letter issued subsequently, and as specifically defined in the Five-Party Agreement.\n\nAll prior negotiations between the parties, as well as drafts of their proposed agreement, are inadmissible under the parol evidence rule. Arizona Power, supra. In fact, specific objections based upon the parol evidence rule were made at the trial court level.\n\nThe Deed of Trust and Other Collateral Loan Documents. Prudential also contends that it was entitled to an in-fact first lien based on the deed of trust and other collateral documents which Prudential was to have received upon funding of the loan. The trial court found, after Phase I of the trial, that the parties did not intend these documents to create any additional conditions precedent to Prudential's obligation to fund the loan.\n\nThe commitment letter itself and the Five-Party Agreement clearly evidenced the parties' intent that Prudential's obligation to fund the permanent loan was governed by the terms of the commitment letter, and that the agreement would not be construed to modify the commitment letter. The agreement provides in part:\n\n5.2 The agreements contained herein are for the benefit of UCB and Prudential, and are not intended, and shall not be construed, to relieve either NAMETCO, HRP or National of any duties or obligations under the Construction Loan Agreement [between UCB and HRP] or under the Commitment [letter].\n\n5.4 Any provision of this Agreement which is, could, or may be, construed to alter or to vary the terms of the Commitment [letter] shall not, and is not intended to, relieve HRP or National of any duties or obligations under the Commitment [letter].\n\nPrudential also contends that the collateral loan documents it preapproved contemporaneously with the execution of the Five-Party Agreement are also to be construed as part of the integrated contract consisting of the loan application, commitment letter, and Five-Party Agreement.\n\nIn section 1.5 of the recitals in the agreement, Prudential acknowledged that UCB was issuing its own commitment for its construction loan of $25,500,000 in reliance upon \"the Commitment.\" Section 5.3 of the \"General Provisions\" of the agreement provided that Prudential's only obligation was \"to make the Permanent Loan to HRP pursuant to the Commitment.\"\n\nThe collateral loan documents upon which Prudential also relies in claiming an in-fact first lien were the documents which Prudential and HRP preapproved at the execution of the Five-Party Agreement in May, 1975, but were not included among those exhibits attached to the agreement. The documents included a deed of trust and a number of assignment and management agreements. The deed of trust, as we have already indicated, contained standard printed language stating that:\n\nTrustor warrants that title to all property conveyed by this Deed of Trust is clear, free and unencumbered and Trustor shall forever warrant and defend the same unto Beneficiary, its successors and assigns, against all claims whatsoever except those matters shown on Schedule A.\n\nPrudential relies on this and similar language contained in the other loan documents providing that Prudential's loan would be secured by a \"first deed of trust\" for its contention that it was entitled to an in-fact first lien. It is well established that a covenant of warranty of title is merely compensatory in nature and is a promise that the covenantor will compensate the beneficiary for any defects in the property interest conveyed:\n\nUnder a covenant for warranty, the covenantor agrees to compensate his grantee for any loss which he may sustain by virtue of a failure of the title which the deed purports to convey . . . .\n\nThe protection afforded by this covenant is against future losses.\n\n6 A Powell on Real Property § 899 at 81.131-81.133 (1982). As HRP and UCB correctly argue, the warranty of title served only to provide Prudential with an additional measure of protection in the event of a breach of the warranty. Under the warranty, Prudential contracted for its remedy that HRP would \"forever warrant and defend the same unto Beneficiary . . . against all claims whatsoever except those matters shown on Schedule A.\" Schedule A did not include mechanics' or materialmen's liens and therefore Prudential was entitled to have HRP defend it against any such liens.\n\nPrudential's primary contention, that the term \"first deed of trust\" means an actual rather than an insured first deed of trust and that this constituted a condition precedent to funding the loan, finds no support in the terms of the relevant documents, the evidence on the record, or in the law.\n\nThe deed of trust itself moreover specifically contemplated the existence of statutory encumbrances such as mechanics' and materialmen's liens and provided for its remedy; i.e., that HRP would remove any such encumbrances. As set forth in the deed of trust, HRP agreed: \"(1) to pay . . . (b) all other charges and encumbrances which now are or shall hereafter be or appear to be a lien prior to the lien of this Deed of Trust.\"\n\nThe express terms of the deed of trust further provide for the remedy available to Prudential if any action was pending at the time of closing which could affect the trust property or title, such actions including those arising out of the filing of mechanics'\n\nor materialmen's liens. The deed of trust provides:\n\nThat if, during the existence of these trusts, there be commenced or pending any action or proceeding affecting the Trust Property, or the title thereto, or if any adverse claim for or against the Trust Property be made, Trustee or Beneficiary, or both, may appear in said action or proceeding and retain counsel therein and defend the same, or otherwise take such action therein as they or either of them may deem advisable, and may settle or compromise the same or the said adverse claim; and in that behalf, and for any of the said purposes, may pay and expend such sums of money as they, or either of them may deem to be necessary.\n\n(Emphasis added.)\n\nAssuming that additional protection was afforded Prudential by the warranty of title, Prudential did not thereby acquire a property interest greater than that required under the terms of the commitment letter and Five-Party Agreement. The Supreme Court of Texas described the nature of the warranty:\n\n\"[T]he nature and purpose of such a covenant is for the indemnity of the purchaser against the loss or injury he may sustain by a failure or defect in the vendor's title . . . The warranty does not constitute a part of the conveyance nor strengthen or enlarge the title conveyed.\"\n\nGibson v. Turner, 156 Tex. 289, 300, 294 S.W.2d 781, 787 (1956). See Morgan v. Reese, 99 Ohio App. 473, 479, 134 N.E.2d 581, 585 (1954); 20 Am.Jur.2d, Covenants, Conditions and Restrictions § 50 at 621 (1965).\n\nSince the deed of trust would only become operative at the time of closing, at which time the trust would come into \"existence,\" it was specifically contemplated by paragraph 5 that at the time of such closing there might be \"pending\" an action or proceeding affecting the trust property or the title thereto. In other words, the possibility of pending actions, such as those arising out of mechanics' or materialmen's liens, was provided for by the express provisions of the deed of trust. Prudential's argument that its deed of trust and other collateral loan documents are inconsistent with the possible existence of mechanics' and materialmen's liens at the time of funding does not find support in the law and is contrary to other portions of the deed of trust. In any event, the trial court's finding that the collateral loan documents were not intended to create additional conditions to Prudential's obligation to fund its permanent loan was supported by the weight of the evidence.\n\nIn this case, the collateral loan documents were relevant only in the sense that they were preapproved by Prudential, and Prudential was therefore obligated to accept them in that form at the time of closing. We find that these documents do not alter or add to the commitment letter or the Five-Party Agreement. If there is any conflict, it could hardly be utilized to superimpose additional conditions to Prudential's obligation to fund. The conditions to Prudential's obligation to fund were specifically set forth in the commitment letter and identified in Exhibit C and treated in Exhibit F to the Five-Party Agreement. The finding by the trial court that the parties did not intend to create any additional conditions to Prudential's takeout obligation is consistent with the terms of the relevant documents and the weight of the evidence. Cuna Mutual Ins. Soc'y v. Dominguez, supra. Finally, the trial court heard evidence on the issue and, based upon the documents and testimony presented, the court found as a fact that the parties did not intend the collateral loan documents to create any additional conditions to Prudential's obligation to fund its permanent loan commitment.\n\nModern Mortgage Law and Practice. The conditions to the commitment letter contained materially different terms than those attached to the loan application. Under general contract principles, the commitment letter must be viewed as a counteroffer.\n\nThe common law rules require that the acceptance [of an offer] be on virtually the exact terms as the offer, and any attempt to accept on terms materially different from the original offer constitutes a counter-offer, which rejects the offer. A counter-offer can become the basis of a contract if it is accepted by the person who made the original offer. Clark v. Compania Ganadera de Cananea, S.A., 94 Ariz. 391, 385 P.2d 691 (1963).\n\nF. Slavin \u0026 D. Burton, Arizona Construction Law, 4 (3d ed. 1982).\n\nPrudential contends, however, that commercial lending practices require that the loan application be construed as part of the commitment letter relying on Georgia State Sav. Ass'n v. Elias, 192 Okl. 227, 135 P.2d 36 (1943). In Georgia State, a borrower submitted an application for a loan to build a general purpose business building to be leased as a grocery store, but instead built a movie theater, despite the fact the lender's offer letter expressly required that the lender give its approval to all plans and specifications. The nub of the case is that the application limited the use to which the borrowed funds could be put, the commitment did not. The court held:\n\n192 Okl. at 230, 135 P.2d at 39-40. In the present case, HRP signed Prudential's preprinted form loan application, with the then proposed conditions for a permanent loan attached. Subsequently, the borrower and Prudential engaged in extended negotiations, and the conditions were substantially modified. Prudential then took the revised conditions and appended them to its offer to loan commitment letter. Prudential's offer was accepted by the borrower, thereby consummating the contract.\n\nIf there was any doubt that HRP and Prudential did not intend the original loan application to become part of the permanent loan commitment, it was removed by the specific representations made by Prudential in the Five-Party Agreement defining the documents which made up its commitment.\n\nThe result in Georgia State is consistent with the older view that the application and commitment together constitute the contract. This analysis has been described by the commentators as follows:\n\nTechnically, the application is an offer by the mortgagor to accept a mortgage loan on the terms specified in the application. The commitment is an acceptance of the offer . . . . Under basic contract law the acceptance of an offer creates a contract. If the letter of commitment makes any changes in the terms, it is technically a counter-offer, which legally is a rejection of the offer. There is no contract unless the landowner agrees to the new terms, which he may do by writing the word accepted and his signature on the mortgagee's letter of commitment. Since the application and commitment define the terms on which the loan is to be made and constitute a contract . . . the application should state the terms in detail . . .\n\nR. Kratovil \u0026 R. Werner, Modern Mortgage Law and Practice § 4.01 at 57-58 (2d ed. 1981) (emphasis in original); see also R. Kratovil, Modern Mortgage Law and Practice § 46 (1972) (the first and second editions as to matters quoted in this opinion are to the same effect) and P.L.I., Real Estate Financing, Business and Legal Considerations §§ 4.2, 4.3 and 4.5 (1970).\n\nAs Kratovil and Werner and other commentators have noted, however, in modern mortgage practice the application has diminished\n\nin importance. In current practice, it is the commitment which is treated as the contract between the lender and the borrower. The application is merely a preliminary source of information for the lender in assessing the property for purposes of deciding if it is a viable loan.\n\nAfter looking over the situation, the lender decides the terms upon which the loan will be made. Those terms are set forth in the commitment. This document often varies so greatly from the application that it is obviously a counteroffer, which the mortgagor can accept or reject.\n\nKratovil \u0026 Werner, supra § 4.02 at 58. See generally, P.L.I., Real Estate Financing, Business and Legal Considerations, supra.\n\nKratovil and Werner describe the legal status of the loan application as follows:\n\nLoan application -- legal status. Ordinarily an application for a loan is thought of as an offer. The commitment is either an acceptance of the offer or a counteroffer. . . . However, on construction loans the application is so skimpy it is difficult to regard it as a legal offer. An offer is made with the understanding that the offeree's consent will conclude the bargain. . . . Moreover, both application and commitment must be complete and certain to be capable of enforcement. . . . Hence the application must be regarded as a \"feeler,\" which is designed to elicit an offer (commitment) from the lender. . . .\n\nSo an application for a loan, while in form an offer, is in practice a sales presentation, and is accompanied by documents of a legal or non-legal character. . . .\n\nKratovil \u0026 Werner, supra § 25.05 at 361-62 (emphasis in original, citations omitted).\n\nThe loan transaction between HRP and Prudential generally fits the description by Kratovil. The two-page September loan application form was signed by HRP only. Page 2 of the printed loan application form contains blanks where information is to be supplied, not by HRP, but by Prudential's appraisers and real estate investment office to set forth an opinion of value and a recommendation as to whether a commitment should issue. The conditions set forth in the October commitment letter are substantially different from those set forth in the loan application. The loan application simply does not provide for any signature line which would evidence acceptance of the application by Prudential. On the other hand, the commitment letter which by its terms is an \"offer to make a mortgage loan\" provided for an acceptance by National Properties (HRP) on page 2 as follows:\n\nThis offer to make a mortgage loan and all terms and conditions thereof are accepted this 31st day of October, 1973.\n\nNATIONAL PROPERTIES\n\nBy: S. Shapiro\n\nThe effect of the commitment letter was to make an independent offer to loan constituting a counteroffer to HRP which contained substantially different terms and was a rejection of the offer contained in the loan application. 1 Restatement (Second) of Contracts § 39(1), Comment a (1981). It did not accept an existing offer. The context and circumstances do not indicate a basis for concluding that the loan application survived the execution of the commitment letter. The loan application was, at most, part of the preliminary negotiations between HRP and Prudential.\n\nConclusion. Our review of the record leads us to conclude that the trial\n\ncourt's findings are supported by the evidence.\n\nE. Ejusdem Generis\n\nWhere the contract contains both general and specific provisions relating to the same matter, the specific and more exact terms are given greater weight than the general language. See 2 Restatement (Second) of Contracts § 203(c) at 93 (1981); 3 Corbin on Contracts § 547 at 176 (1960). The rule in its most restrictive form is that the specific provisions qualify the meaning of the general provisions. 17 Am.Jur.2d Contracts § 270 at 677 (1964). Corbin applies the rule more sweepingly.\n\nIf the apparent inconsistency is between a clause that is general and broadly inclusive in character and one that is more limited and specific in its coverage, the latter should generally be held to operate as a modification and pro tanto nullification of the former.\n\n3 Corbin on Contracts, § 547 at 176; Waterway Terminals Co. v. P.S. Lord Mechanical Contractors, 242 Or. 1, 406 P.2d 556, 13 A.L.R.3d 1 (1965). See also Brady v. Black Mountain Investment Co., 105 Ariz. 87, 459 P.2d 712 (1969).\n\nThe rule of \"ejusdem generis\" is a rule of interpretation which applies where general words in a contract are followed by enumerated specific terms involving the same subject matter. Under this rule of interpretation the meaning of the general terms is presumed to be limited to the enumerated specific terms and to include only those things of the same nature as those specifically enumerated unless a clear manifestation of a contrary intent is apparent. See, Droz v. Paul Revere Life Ins. Co., 1 Ariz. App. 581, 405 P.2d 833 (1965); Deuel v. McCollum, 1 Ariz. App. 188, 400 P.2d 859 (1965); State Farm Fire \u0026 Casualty Co. v. Rowland, 111 Ga.App. 743, 143 S.E.2d 193 (1965); A-1 Sandblasting and Steamcleaning Co. v. Baiden, 53 Or.App. 890, 632 P.2d 1377 (1981) aff'd 293 Or. 17, 643 P.2d 1260 (1982). See also City of San Antonio v. Heath and Stich, Inc., 567 S.W.2d 56 (Tex.Civ.App.1978).\n\nThe specific terms in this case appear in the conditions contained in the loan application rider. These conditions define and clarify the three broad provisions printed in small type on the loan application which state:\n\nI agree to:\n\n(1) give a first mortgage;\n\n(2) pay all legal and title and closing expenses including cost of an engineer's survey;\n\n(3) furnish and maintain fire and extended coverage insurance.\n\nMy title and all title, mortgage and closing documents must be satisfactory to the Prudential.\n\nThe second general provision of the loan application, the agreement to \"pay all legal and title and closing expenses . . .\" is spelled out in more detail in conditions 1 and 11:\n\n1. . . . [A]pplicant shall pay all escrow, recording and title charges, incurred in connection with the disbursement of the loan.\n\n11. When and if deemed advisable by Prudential, applicant shall pay all fees and expenses of special counsel selected and employed by Prudential in connection with closing of the loan and rendering any opinions required in connection with the loan.\n\nThe third general provision of the application, to \"furnish and maintain fire and extended coverage insurance\" is defined by conditions 7 and 9:\n\n7. Fire and extended coverage insurance in an amount not less than $24,500,000, or full insurable value, whichever is less, written with companies satisfactory to Prudential and citing its interest, shall be deposited with Prudential. If the policy contains a co-insurance clause, the amount of insurance must conform to the stated percentage of full insurable value.\n\n9. Prudential shall have a valid first lien on and security interest in all furnishings, fixtures and equipment owned by\n\napplicant, located on the security and used in conjunction with the improvements thereon, and applicant shall provide Prudential with satisfactory fire insurance thereon.\n\nThe final sentence of the loan application provision, that \"my title and all title, mortgage and closing documents must be satisfactory to the Prudential,\" is again more fully and specifically set forth in conditions which refer to a variety of these \"documents\": Conditions 1, 5, 8, 13, 16, 17, 20, 23, 32 and 33.\n\nThe first provision, to \"give a first mortgage,\" states in bare general terms the requirements Prudential defined in the rider to the loan application as a requirement that HRP provide a deed of trust insured as a first encumbrance without exception and the concomitant prohibition against secondary financing, as contained in conditions 2 and 12:\n\n2. The lien of the Deed of Trust shall be insured by an ALTA policy of title insurance with LTAA Endorsement No. 3R and 5, in an amount not less than the amount of the loan issued by a title company approved by Prudential, insuring the Deed of Trust as a first encumbrance without exception, unless said exception is specifically approved by Prudential.\n\n12. At the time of disbursement of the loan, the security shall not be encumbered by secondary or subordinate liens given to secure additional financing, unless approved by Prudential.\n\nThese two conditions are reiterated in the same language in the rider attached to the commitment letter.\n\nPrudential's use of the broad term \"first mortgage\" in the printed loan application form, rather than deed of trust as used in condition 2 indicates that the requirement of \"a first mortgage\" was, like the other printed provisions, a general term expanded and clarified in the conditions. The choice of the term \"first mortgage\" is so general as to be at best inaccurate to describe the transaction between the parties, which was permanent financing to be secured by a deed of trust. Although Prudential argues that the differences between the two devices are trivial technicalities and that the two can be used interchangeably, we note that the conditions attached to the loan application and commitment letter were expressed quite precisely in defining the rights and responsibilities of Prudential and HRP.\n\nWe find that the general terms of the printed loan application form were given definition by the more specific language of the commitment letter and those conditions which it specifically incorporated into that offer; i.e., conditions 1 through 34, and the amendments. The specific language contained in the 34 numbered conditions is further controlling under the rule of contract interpretation that specific typewritten provisions will control general language set forth in standardized printed terms. 2 Restatement (Second) of Contracts § 203(d), comment f (1981); Deuel v. McCollum, supra.\n\nWe conclude that the loan application provision to \"give a first mortgage\" was a general provision which was qualified by the specific terms contained in conditions 2 and 12.\n\nF. Marketable Title as an Implied Obligation\n\nIn its opening brief, Prudential discusses at length the distinctions between insurable title and marketable title and the disadvantages of an insured title only. No one at the trial court level argued that insurable title and marketable title are synonymous. Nor did the trial court hold that they are. The trial court found that Prudential bargained for \"insurable title,\" not \"marketable title.\"\n\nReferring to the finding of the trial court and the position of HRP and UCB that Prudential had agreed to accept an insured first lien rather than an in-fact first lien, Prudential asserts in its opening brief that \"It seems unlikely that any insurance lender ever acted that way; certainly this one did not.\" This claim is not supported by\n\nthe record and it is contradicted by Prudential's own practice as admitted to by Prudential's 40-year employee who signed the commitment letter on its behalf. Mr. Mark Smith, Associate General Manager of real estate investments for Prudential, testified that it is not uncommon for Prudential to make a loan in which a broken priority exists, in which event Prudential relied on title insurance to protect its position:\n\nQ Has Prudential in your experience ever closed a permanent loan at a time when there were mechanic's liens on the property which resulted during the course of construction?\n\nA Yes.\n\nQ Do you recall any specific instance of that?\n\nA I can't recite any specific case, but it's not an isolated situation.\n\nQ And you would then expect the title company to cover that problem for you.\n\nA We wouldn't close the loan if the title company didn't give us the protection.\n\nQ You would insist you have a clean policy.\n\nA That's right.\n\nQ And if you had that, you could go ahead and close?\n\nA That's right.\n\nMoreover, the testimony at trial revealed that insuring over broken priorities was not novel for the title companies providing the reinsurance required by Prudential and that there was an established custom and practice in the lending industry with respect to the use of title insurance to protect the position of lenders in a broken priority context. In this case, Prudential's commitment letter called for an insured first lien and Prudential confirmed the nature of its commitment when UCB was induced to make an interim loan to complete construction of the Hotel.\n\nPrudential further argues that it was entitled, \"as a matter of law,\" to something more than an insured first lien, citing Sabin v. Rauch, 75 Ariz. 275, 255 P.2d 206 (1953), and other authority. Sabin, however, has no application to the facts of this case, because first, it relates to a contract for the sale of realty, and second, it stands, at most, for the proposition that where the parties to a sale express no contrary intention, there is an implied obligation to deliver marketable title. Here, there is no sale of the Hotel to Prudential and, even if there had been, Prudential contracted for and agreed to accept an insured first position. Prudential would have received exactly what it bargained for if it had proceeded to fund the loan. To alter the commitment letter and the Five-Party Agreement by adding another condition would work a substantial injustice on HRP and UCB who relied upon those agreements by investing and loaning millions of dollars in connection with the Hotel project.\n\nG. A.R.S. § 20-1591(2) and A.R.S. § 20-1565(B).\n\nPrudential suggests that its agreement to accept title insurance and Arizona Title's willingness to provide such insurance were illegal. Prudential states:\n\nA.R.S. § 20-1591(2) requires that title insurance policies \"specifically exclude\" from coverage ascertainable title defects, such as the existing recorded mechanics' liens in this case. As to \"insuring over\" these known and existing liens, A.R.S. § 20-1565(B) expressly prohibits a title insurer from \"guaranteeing the payment of . . . obligations.\" The issuance of the title policy \"insuring over\" the existing mechanics' liens would constitute precisely such an illegal guarantee.\n\nPrudential appears to argue that the statute prevents a title insurer from insuring against certain types of title risks and that an insured should not be able to take advantage of title policy coverage against risks that the insurance company either failed to ascertain or deliberately chose to insure. This contention is not supported by the statutory provision upon which Prudential relies.\n\nWhile A.R.S. § 20-1591\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e has not been construed by our courts, the obvious purpose of the provision is to ensure that title insurers utilize policy forms approved by the director of insurance. Specifically excluded from the definition of \"[f]orms of title policies and other contracts of insurance\" which must be preapproved are the following: (1) reinsurance contracts, (2) schedules or endorsements affirmatively insuring or excepting from coverage particular risks related to actual titles and (3) schedules or endorsements excepting from coverage title risks imposed by affirmative acts or omissions of individual insurance applicants. In short, the statute is concerned only with the requirement that certain title policy forms be preapproved by the Director of Insurance. It does not require title insurers to obtain state approval of particular coverages in individual policies. Neither does it prohibit issuance of title insurance for particular risks. Whether a title risk should be insured in a given case is a question of business judgment, not one of law.\n\nPrudential suggests that A.R.S. § 20-1591(2) should be read to bar a title insurer from covering risks which could be ascertained in a given case. Even in the abstract, such a reading would make no sense. It would, for example, prohibit a title insurer from insuring against ascertainable risks that were negligently overlooked in the title search. In other words, Prudential's reading of the statute would prevent title insurers from covering the very kinds of risks purchasers of title insurance seek to insure against.\n\nPrudential's reliance on A.R.S. § 20-1565(B)\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e is also misplaced. Based on this statute, Prudential argues that it is illegal for a title insurer to cover the risk of mechanics' liens. Not only does this contention fly in the face of common practice by title insurers and permanent lenders, it finds no basis in the statute itself. The statute is concerned with the scope of services a title insurer may render. Subsection A indicates that the scope is expansive; a title insurer generally may engage in any business not inconsistent with the title insurance business. Subsection B, however, imposes one restriction on the scope of such business. It prevents a title insurer from guaranteeing the payment \"of the principal or the interest of bonds or other obligations.\" There is a great difference between insuring title and guaranteeing debt repayment. A title insurer can insure titles, including liens, but cannot guarantee the payment of debts.\n\nH. Conclusion\n\nWe conclude that the trial court correctly granted partial summary judgment in determining\n\nthat there was no incorporation. We also find that the findings of fact made by the trial court as a result of Phase I were supported by substantial evidence and were not clearly erroneous. Rule 52(a), Rules of Civil Procedure; Lewis v. Midway Lumber, Inc., 114 Ariz. 426, 561 P.2d 750 (App.1977).\n\nIV. ANTICIPATORY REPUDIATION\n\nThe insistence by one party upon terms not contained in a contract constitutes an anticipatory repudiation. In Phase I, the trial court had correctly ruled that the commitment letter and the Five-Party Agreement entitled Prudential to an insured first position on the Hotel realty but not to the in-fact first lien Prudential insisted upon. Phase II presented the question of whether the borrower had complied with the other 34 conditions of the commitment letter. The trial court ruled in Phase II, in partial summary judgment, that Prudential's insistence on an actual first lien was, as a matter of law, an anticipatory breach of contract.\n\nGenerally, a contract cannot be breached until the date the duty of performance arrives. However, if one party unequivocably indicates he will not perform when the date arrives, an anticipatory breach is committed.\n\nIn order to find a breach of contract, there must be a positive and unequivocal manifestation on the part of the repudiating party that he will not render the required performance when it is due . . . . A statement by a party to a contract merely implying that he will not perform is not the equivalent of a positive and unequivocal refusal to perform.\n\nMcMahon v. Fiberglass Fabricators, Inc., 17 Ariz. App. 190, 192, 496 P.2d 616, 618 (1972).\n\nPrudential argues that even if its interpretation of the contract was wrong, this does not operate to make Prudential's interpretation an anticipatory breach of contract. It argues that \"[a]n honest dispute over a party's rights under a contract is not an anticipatory repudiation.\"\n\nAnticipatory repudiation has been recognized in Arizona and other jurisdictions as a species of breach of contract. Diamos v. Hirsch, 91 Ariz. 304, 372 P.2d 76 (1962); see generally 4 Corbin on Contracts § 973 (1951); 11 Williston on Contracts § 1323 (3d ed. 1968).\n\nOur Supreme Court in Diamos stated:\n\nWe have recognized that an action may be maintained for breach of contract based upon the anticipatory repudiation by one of the parties to the contract . . . . It is well established that in order to constitute an anticipatory breach of contract there must be a positive and unequivocal manifestation on the part of the party allegedly repudiating that he will not render the promised performance when the time fixed for it in the contract arrives.\n\n91 Ariz. at 307, 372 P.2d at 78.\n\nIn support of its position Prudential relies on New York Life Ins. Co. v. Viglas, 297 U.S. 672, 56 S.Ct. 615, 80 L.Ed. 971 (1936). Prudential quotes Justice Cardozo as follows:\n\nThere is nothing to show that the insurer was not acting in good faith in giving notice of its contention that the disability was over. If it made a mistake, there was a breach of a provision of the policy with liability for any damages appropriate thereto. We do not pause at the moment to fix the proper measure. Enough in this connection that at that stage of the transaction there had been no renunciation or abandonment of the contract as a whole.\n\n297 U.S. at 676-77, 56 S.Ct. at 616. However, that case is distinguishable on its facts. In Viglas an insured claiming a \"total disability for life\" sued his insurer for future disability payments as well as for payments past due. After an initial period in which disability payments had been paid pursuant to the insurance contract, the insurer discontinued payments. While agreeing that under the facts as pleaded the insured stated a claim against the insurer for breach of contract to pay\n\nfor past due disability, the Supreme Court found no renunciation of the total contract because the insurer did not take the position that it would never pay for disability, but was merely following a policy procedure of discontinuing payments and awaiting proof of continuing disability. Had the insurer, New York Life, unequivocally refused to perform for all future time except on terms not contained in the contract, a different case would have been presented. Nothing in Viglas suggests that refusal to render performance in the future except on terms that go beyond the contract is not an anticipatory repudiation or that it should be treated differently from other varieties of anticipatory breach.\n\nPrudential also relies on American Continental Life Ins. Co. v. Ranier Construction Co., 125 Ariz. 53, 607 P.2d 372 (1980). American refused to make the final payment under a construction contract consisting of 10 percent retention and the last progress payment claiming that Ranier had failed to construct the building in a workmanlike manner and in accordance with plans and specifications. American justified its refusal on the ground that Ranier had failed to meet a condition precedent to the right to final payment because it failed to procure from the architect a final certificate of payment as provided in the contract. There were disputes between the parties as to what remained to be done and the court determined that American's refusal to make the final payment was not a denial on its part to pay under any circumstances. The court determined that the presentation by Ranier of a final certificate payment was a condition precedent to payment, which was provided for in the contract. American did not insist upon something it had no right to insist upon under the terms of the contract, but simply demanded compliance with the terms of the contract. The court appropriately rejected the theory that American had repudiated the contract. 125 Ariz. at 56, 607 P.2d at 375, n. 6.\n\nPrudential, by insisting as early as November 1976 and thereafter upon a first lien it had no right to claim, and by refusing to perform on any other basis, declared that it would not perform its obligations set forth in the commitment letter and the Five-Party Agreement. This was an anticipatory repudiation within the language of Diamos.\n\nWhether a party repudiates its contract obligations on the basis of an alleged \"contract interpretation\" or for some other reason is legally irrelevant; one party's \"insistence upon terms which are not contained in a contract constitutes an anticipatory repudiation thereof.\" REA Express, Inc. v. Interway Corp. 538 F.2d 953, 955 (2d Cir.1976) (repudiation based upon party's interpretation of \"conditions precedent\" in contract); Neal-Cooper Grain Co. v. Texas Gulf Sulphur Co., 508 F.2d 283 (7th Cir.1974); Menako v. Kassien, 265 Wis. 269, 61 N.W.2d 332 (1953).\n\nThe Restatement, Corbin and Williston -- the three leading authorities on American contract law -- unanimously endorse the position that an anticipatory repudiation may be based upon an erroneous contract interpretation just as it may be based upon a refusal to perform for any other reason. The Restatement is particularly significant since our Supreme Court \"has consistently held that it will generally follow the Restatement of Law unless a different rule has been pronounced by the court in prior decisions or by legislative enactment.\" Irwin v. Murphey, 81 Ariz. 148, 152, 302 P.2d 534, 537 (1956). In Arizona no different rule has been pronounced. The Restatement provides:\n\nGenerally, a party acts at his peril if, insisting on what he mistakenly believes to be his rights, he refuses to perform his duty. His statement is a repudiation if the threatened breach would, without more, have given the injured party a claim for damages for total breach.\n\n2 Restatement (Second) of Contracts § 250, comment d, at 274-75 (1981). Illustration 9 amplifies the comment with an example showing that a statement by a party to a contract that he will perform only in accordance with his own erroneous\n\ninterpretation of that contract is a repudiation. See also 4 Corbin § 973 at 910; 11 Williston § 1323 at 136-38. None of these treatises advocates adopting an exception to the anticipatory repudiation rule for a \"good faith,\" but erroneous, interpretation of contract. Whatever the breaching party's \"state of mind,\" the impact on the innocent party, who also presumably acted in good faith, is the same -- he faces total loss of the repudiator's performance, to which the contract entitled him. In fairness, the adverse effects of a dispute over the meaning of a contract shall be borne by the mistaken party, even if acting in good faith, and not by the party insisting upon proper performance.\n\nConcededly, a mere disagreement over the terms of a contract is not itself an anticipatory repudiation, nor is a mere offer to perform on terms other than those contained in the agreement, at least if the offer is made in good faith. 4 Corbin on Contracts § 973 at 911 (1951). Otherwise, contracting parties would be constantly appearing in court with anticipatory repudiation claims. However, if one party clearly insists upon a performance to which he is not entitled, that is a repudiation.\n\nFrom at least November 8, 1976, through June 1977, Prudential unequivocally refused to make a permanent loan without first securing an in-fact first lien. Prudential did not merely suggest or offer to perform on the basis of an actual first encumbrance; rather, it made absolutely clear that it would not perform without such an in-fact first lien. As Corbin expresses it:\n\nIf one party to a contract, either wilfully or by mistake, demands of the other a performance to which he has no right under the contract and states definitely that, unless his demand is complied with, he will not render his promised performance, an anticipatory breach has been committed. Such a repudiation is conditional in character, it is true; but the condition is a performance to which the repudiator has no right . . . .\n\nWhere the two contracting parties differ as to the interpretation of the contract or as to its legal effects, an offer to perform in accordance with his own interpretation made by one of the parties is not in itself an anticipatory breach. In order to constitute such a breach, the offer must be accompanied by a clear manifestation of intention not to perform in accordance with any other interpretation.\n\n4 Corbin on Contracts § 973 at 910-11 (1951).\n\nThe rationale of all these authorities is that a repudiation based upon a reading of a contract is not fundamentally different from any other repudiation. The non-breaching party is confronted with a refusal to abide by the terms of the contract between the parties. If that refusal, however clothed, occurs prior to the time for the repudiator's performance, it constitutes an anticipatory repudiation.\n\nIn essence, Prudential has asked this court to engraft a vague fault principle onto one branch of settled contract doctrine. If a \"good faith\" contract interpretation is made as a defense to a claim of breach by anticipatory repudiation, then it should also be a defense where the repudiating party believes wrongly but in \"good faith\" that there is no contract at all or that the contract has been terminated, modified, or rescinded. Viewed from the perspective of either the breaching or non-breaching party, there is no significant difference between such cases and a repudiation based upon an asserted \"interpretation\" of a contract. In all such situations, the repudiation may rest upon the breaching party's \"good faith\" understanding of his agreement, or lack of one, with the non-breaching party. That, standing alone, does not alter the fact that the latter has been deprived of the benefit of his bargain.\n\nMoreover, if \"good faith\" is a defense to an anticipatory repudiation claim, the same reasoning would compel adoption of such a defense for all claims of breach of contract. Anticipatory repudiation is nothing more than a species of contract breach in which the offending party states \"that he will not render the promised performance\n\nwhen the time fixed for it in the contract arrives.\" Diamos v. Hirsch, 91 Ariz. 304, 307, 372 P.2d 76, 78 (1962). The logical extension of Prudential's position is that all contract breaches should be subject to a good faith defense. Needless to say, this would fundamentally alter the law of contracts and create endless confusion.\n\nThe trial court correctly applied the doctrine of breach by anticipatory repudiation to the facts of this case.\n\nThe trial court correctly granted summary judgment finding an anticipatory repudiation because Prudential conceded it had demanded an in-fact first lien. Prudential has assumed the unvarying position in the trial court and on appeal that from at least November 1976 through June 1977 it refused to fund the permanent loan on the Hotel without an actual first lien. Having ruled that a demand for -- and unequivocal insistence upon -- an in-fact first lien would as a matter of law constitute an anticipatory repudiation, the trial court correctly granted partial summary judgment on that issue because there was no factual dispute concerning the matter.\n\nPrudential quotes Pacific Coast Engineering Co. v. Merritt-Chapman \u0026 Scott Corp., 411 F.2d 889 (9th Cir.1969), for the proposition that a party's mere offer to perform in accordance with its interpretation of a contract is not necessarily a repudiation if the offer appears to be made in the good faith belief that it is correct. Prudential did not simply offer to perform its loan commitment if HRP would provide a first encumbrance; Prudential demanded an in-fact first lien and insisted that it would not fund the loan without one. Thus, at the Newark meeting on November 8, 1976, with HRP and UCB representatives, Prudential took the position that there would be no loan without a first lien. That was reiterated in a subsequent letter to HRP. Prudential's vice president stated that from November 1976 through June 1977 Prudential continuously insisted upon a first lien. In fact, Prudential did not fund the permanent loan because it did not get an in-fact first lien.\n\nSummary judgment is an appropriate vehicle for resolving disputes over the legal meaning or effect of facts or conduct not in dispute. Morrell v. St. Luke's Medical Center, 27 Ariz. App. 486, 556 P.2d 334 (1976). In opposing HRP's motion for partial summary judgment on anticipatory repudiation, Prudential did not, as required by rule 56(e), Rules of Civil Procedure, submit any affidavit showing a factual dispute over whether Prudential had unequivocally demanded an in-fact first lien. Prudential argues that the doctrine of anticipatory repudiation is inapplicable where the repudiation is based on an interpretation of contract -- even if the party insists upon that interpretation and refuses to perform without it. Since Prudential failed to contravene the conceded fact that it demanded a first lien as a condition of its own performance, the trial court properly rendered summary judgment on that issue. Mobile Home Estates, Inc. v. Levitt Mobile Home Systems, Inc., 118 Ariz. 219, 575 P.2d 1245 (1978).\n\nPrudential's claim of waiver has been expressly rejected by the Arizona Supreme Court. An original feature of the English doctrine of anticipatory repudiation, still followed in England and Georgia, is that a party continuing performance in the face of an anticipatory repudiation thereby waives the breach and can only sue on a subsequent breach, if any, occurring at the time when performance is due. 4 Corbin on Contracts § 981 (1951). Because the non-breaching party treats the contract as remaining in effect despite the repudiation, the theory is that the parties cannot hereafter take a contrary position.\n\nPrudential relies on Concrete Materials of Georgia, Inc. v. Smith \u0026 Plaster Co., 127 Ga.App. 817, 825, 195 S.E.2d 219, 225 (1973), in which the court said:\n\n[W]here, in a continuing contract, one side refuses to perform, the other may accept the tender of the breach of contract, refuse to perform further and sue for damages, but if he does not do so the contract continues in effect as to the obligations of both parties.\n\nPrudential also relies upon the following Arizona cases to support the position adopted in Georgia: Weatherford v. Adams, 31 Ariz. 187, 251 P. 453 (1926); Hunter Contracting Co. v. Sanner Contracting Co., 16 Ariz. App. 239, 492 P.2d 735 (1972); Mackey v. Philzona Petroleum Co., 90 Ariz. 272, 367 P.2d 632 (1961), vacated, 93 Ariz. 87, 378 P.2d 906 (1963). However, these Arizona cases do not involve anticipatory repudiation. The cases involved breaches of contract. Weatherford involves a straightforward breach of contract. Hunter Contracting involves \"a material breach in a partially performed construction contract\" not an anticipatory repudiation. In the Mackey case our Supreme Court implied that even where a party might have lost his right of rescission, he \"may have a claim for some relief even if he cannot rescind.\" 90 Ariz. at 275, 367 P.2d at 634-35.\n\nThe modern rule, followed in Arizona and most other jurisdictions, is that an innocent party, confronted with an anticipatory repudiation, may continue to treat the contract as operable and urge performance by the repudiating party without waiving any right to sue for that repudiation. Kammert Brothers Enterprises, Inc. v. Tanque Verde Plaza Co., 102 Ariz. 301, 428 P.2d 678 (1967). See generally 1 Restatement of Contracts § 280 (1932); 4 Corbin § 981 at 938-39; 11 Williston § 1334 at 178-79. The basis for the American rule is cogently set forth by our supreme court in Kammert Brothers:\n\nThe seller claims there can be no anticipatory repudiation here since the buyer failed to immediately treat the repudiation as a breach and bring suit. We believe that it is not necessary to say that a breach is not an anticipatory breach until it has been accepted as such by the injured party. A party that has received a definite repudiation by the other party to the contract should not be penalized for his efforts to make the other party live up to his end of the bargain, and can cease urging performance and bring suit for the breach at any time before the other party retracts his repudiation.\n\n102 Ariz. at 306-07, 428 P.2d at 683-84. Commenting upon modern cases such as Kammert Brothers, Corbin writes:\n\nIn a number of well-considered recent cases, this doctrine that an anticipatory repudiation is not a breach until it is accepted as such by the injured party has been repudiated. Their reasoning is convincing and they should now be accepted as having established the law. In repeating the older forms of statement, the courts did not sufficiently analyze a complex situation and give due consideration to its separate aspects. In the first place, the repudiator has a power of retraction as long as there has been no substantial change of position by the injured party; and the latter's continuing to urge performance may be properly held to keep this power of retraction alive. A notice of retraction, seasonably given, nullifies the effect of the anticipatory repudiation; and an offer to perform, before any change of position by the injured party, is operative as a retraction. Some of the cases in which the older language is repeated can be supported on this ground.\n\n4 Corbin on Contracts § 981. The Restatement of Contracts further supports the modern rule:\n\nManifestation by the injured party of a purpose to allow or to require performance by the promisor in spite of repudiation by him, does not nullify its effect as a breach or prevent it from excusing performance of conditions and from discharging the duty to render a return performance.\n\n1 Restatement of Contracts § 320 at 482 (1932). See also Utex Exploration Co. v. Garwood, 246 F.2d 547 (10th Cir.1957); French v. Nabob Silver-Lead Co., 82 Idaho 120, 350 P.2d 206 (1960).\n\nPrudential attempts to distinguish this case from Kammert Brothers by asserting that HRP \"waived\" its anticipatory repudiation claim because, subsequent to Prudential's repudiation, it not only urged\n\nPrudential to perform but also made efforts of its own to fulfill the conditions of the commitment letter. This is a distinction without a difference. In the case of an outstanding loan commitment to be performed subject to certain conditions by the borrower, there is no better way for a borrower, confronted by his lender's anticipatory repudiation, to \"urge performance\" than to demonstrate his own willingness to perform the conditions of the loan commitment. This is the strongest sort of \"effort [by the borrower] to make the other party live up to his end of the bargain,\" within the meaning of Kammert Brothers.\n\nIn Highlands Plaza, Inc. v. Viking Inv. Corp., 72 Wash.2d 865, 435 P.2d 669 (1967), a defendant seller of realty anticipatorily repudiated its contract with the plaintiff purchaser by demanding that the deal close before performance was actually due. The purchaser tendered an arguably defective performance, which the seller later urged as a defense in an action by the purchaser based upon anticipatory breach. The Washington Supreme Court summarily rejected the seller's position:\n\nIt is further the rule that, where such a breach [anticipatory repudiation] occurs, no tender of performance by the promisee (appellant) is necessary to his right to recovery against the promisor who has breached the contract. See 5 S. Williston on Contracts § 699 (3rd ed.). Therefore, appellant's defective tender of performance (if, in fact, it was defective, a question we do not reach on this appeal) is of no consequence.\n\n435 P.2d at 677.\n\nBy continuing its efforts to perform according to the terms of the commitment letter, HRP, in the words of Kammert Brothers did nothing more than endeavor to make Prudential live up to its end of the bargain. That HRP failed in its endeavor to induce Prudential to perform should not be held a waiver of an anticipatory repudiation claim that would have been preserved had HRP done nothing at all except to sit on its hands and urge Prudential to fund without an in-fact first lien. Even assuming that HRP made an incomplete tender of performance on February 8, 1977, that does not demonstrate that HRP or UCB lacked the ability to make a proper tender several days later or at some other time in February, when, under the trial court's instructions, the jury could find that HRP and UCB were able to perform. Since Prudential's promise to fund remained in effect throughout that month and through June 30, HRP and UCB were entitled to prove that they could have fulfilled the conditions of the commitment letter and Five-Party Agreement at any time during that period. All parties were permitted to, and did, put before the jury evidence concerning HRP's February 8 tender as probative of whether HRP and UCB had the ability to perform at any time during that month.\n\nPrudential's proposed rule -- testing the innocent party's right to prevail by his actual tender -- would be contrary to Kammert Brothers in yet another respect. It would penalize the innocent party by imposing upon him a stricter standard of proof (actual tender) than would apply had that party treated the repudiation as ending the contract and brought suit (ability to tender). This would be a penalty for keeping the contract open, which Kammert Brothers prohibits.\n\nPrudential asserts that HRP's acceptance of the six-month extension offer was a waiver of any right to sue for anticipatory repudiation during that period. Alternatively, it contends that the commitment letter expired on December 31, 1976, before HRP was able to comply with all of the loan conditions. We reject Prudential's contention that, if acceptance of the extension was not a waiver of Prudential's anticipatory repudiation, \"the court should have treated the contract as terminated as of the date of the repudiation.\" Prudential does not explain how HRP's refusal to waive its position on the in-fact first lien versus the insured first lien issue terminated the contract or the extension. Notwithstanding HRP's announced position, Prudential granted the extension, and HRP and UCB\n\nrelied on it. See 1 Restatement of Contracts §§ 45, 90 (1932). Moreover, an extension agreement requires no consideration to make it binding upon Prudential. For those reasons, the commitment letter was extended by the terms of the extension letter to June 30, 1977, and did not expire at the end of 1976 or terminate on the date of the anticipatory repudiation.\n\nPrudential wrongfully insisted upon an in-fact first lien from at least November 1976 through June 1977 and was therefore in a continuing breach throughout that period and, in particular, during February 1977, when HRP and UCB proved their ability to perform. Thus, even if HRP waived the initial November 1976 breach, it did not thereby waive the continuing breach thereafter.\n\nFor a waiver, there must be the relinquishment of a known right of conduct which would warrant an inference of an intentional relinquishment. American Continental Life Ins. Co. v. Ranier Constr. Co., 125 Ariz. 53, 55, 607 P.2d 372, 374 (1980). Far from relinquishing a known right, HRP expressly notified Prudential that by accepting the extension it did not acquiesce in the view that Prudential was entitled to an in-fact first lien. This was not a relinquishment; it was the preservation of a right.\n\nPrudential suggests that enforcement of the extension agreement would be unfair because the purpose of the extension was to permit HRP to discharge the mechanics' liens and provide Prudential with an actual first lien position. There is no language in the extension which supports the assertion that the discharge of the liens was the only purpose of the extension. The parties recognized the existence of a critical dispute on the in-fact first lien question. The extension did nothing more than provide HRP with additional time to perform its obligations as defined by the commitment letter and the Five-Party Agreement. In reliance upon the extension, HRP made an intensive investment of additional time, effort, and capital in the project.\n\nPrudential implies that, even if there was no waiver, HRP somehow acted unfairly by accepting an extension and at the same time maintaining its position on the first lien issue. HRP faced a dilemma in the closing months of 1976. Prudential had breached the commitment letter. One possible course of action for HRP was to treat the contract as terminated and file suit for anticipatory breach. But HRP then ran the risk that UCB, as the interim lender, would foreclose on its mortgage and HRP would lose the Hotel. In an effort to preserve its investment, HRP accepted the extension and UCB agreed to postpone its threatened foreclosure in reliance upon the extension. By securing additional time both HRP and UCB were able to entertain the hope that Prudential might, in the end, honor the commitment letter by funding the loan and accepting an insured first position. However, Prudential did not relent. HRP did not act unfairly.\n\nThe record supports the jury's verdict in Phase II that HRP and UCB had the ability to comply with the conditions of the commitment letter and the Five-Party Agreement. An anticipatory repudiation is a breach of contract giving rise to a claim for damages and also excusing the necessity for the non-breaching party to tender performance. Kammert Brothers Enterprises, Inc. v. Tanque Verde Plaza Co., 102 Ariz. 301, 428 P.2d 678 (1967); 2 Restatement (Second) of Contracts § 277 (1981); 4 Corbin on Contracts § 977 (1951). A repudiating party is not entitled to demand performance from the innocent party or use the latter's failure to tender as a defense to the claimant. Stated another way, tender is excused where a party indicates it will not be accepted because the law does not require the nonbreaching party to do a futile or useless act. Kammert Brothers, supra, 102 Ariz. at 306, 428 P.2d at 683; Lee v. Nichols, 81 Ariz. 106, 301 P.2d 1022 (1956). Thus, to recover damages for anticipatory breach, the injured party need only show that he had the ability to perform his own obligations\n\nunder the agreement. Woliansky v. Miller, 135 Ariz. 444, 661 P.2d 1145 (App.1983).\n\nPrudential states:\n\nPlaintiffs [HRP and UCB] did not dispute that, in order for them to recover because of Prudential's refusal to perform in response to their February, 1977 \"tender,\" it was necessary for HRP to make a valid tender first, i.e., have and demonstrate a present ability to perform all conditions of the loan commitment if Prudential would fund the loan. A diversity case coming from Arizona on the point is Monroe Street Properties, Inc. v. Carpenter, 407 F.2d 379 (9th Cir.1969); see also Huszar v. Certified Realty Co., 266 Or. 614, 512 P.2d 982 (1973). But at best, HRP had and demonstrated only conditional and tentative ability to perform, and as a matter of law that was not sufficient.\n\nThe \"present ability to perform,\" which HRP agrees it had to prove, is not the same as a \"tender of performance\"; if it were, there would be no substance to the rule that an anticipatory repudiation excuses the non-breaching party from having to perform in order to establish either a breach of contract or its right to recover damages. Monroe Street Properties, which Prudential cites, does not involve an anticipatory repudiation; it involves the adequacy of an actual tender of performance. The Huszar case also involves actual performance.\n\nPrudential's position is that plaintiffs, HRP and UCB, failed to put before the jury legally sufficient evidence to justify the jury's finding that plaintiffs had the ability in February 1977 to perform their obligations under the commitment letter and the Five-Party Agreement. We note at the outset that no general complaint is made that the evidence was insufficient to justify the verdict. Rather, Prudential makes the much narrower claim that the case of HRP and UCB must fail because, when proof of ability to perform requires a showing that some party other than HRP and UCB would render part or all of the needed performance, proof is insufficient as a matter of law unless they can show a legally \"binding and enforceable commitment\" from that third party to render the necessary performance. The assertion is then made that Prudential was entitled to a directed verdict at the end of HRP and UCB's liability case because they did not prove the existence of enforceable agreements for (1) provision of title insurance, (2) payment under certain collateral agreements involving the operation of the Hotel, and (3) payment of HRP's obligations to UCB.\n\nPrudential's position is incorrect for two independent reasons. First, it is based on the erroneous premise that HRP and UCB needed proof of third-party agreements. They did not. Second, the rule for which Prudential contends has no application to an anticipatory repudiation case.\n\nUnder the commitment letter, HRP and UCB were not required to procure agreements with third parties before the time at which Prudential was obligated to place the loan proceeds in escrow. To appreciate Prudential's argument, it is necessary to refer to the structure of the various agreements. Under the commitment letter and the Five-Party Agreement, Prudential was obligated to place the amount of its permanent loan, $25,500,000, in escrow with Arizona Title if, at any time during the period when the commitment letter was outstanding, either HRP or UCB satisfied certain conditions of the commitment letter as issued in 1973 and reaffirmed in the agreement. It must also be remembered that under the agreement, UCB had a right independent of HRP to satisfy the conditions of the commitment letter and require that Prudential deposit the loan funds in escrow. The trial court so instructed the jury. Once Prudential deposited its funds, Arizona Title was obligated to release the funds to UCB, but if, and only if, certain other conditions were met. Prudential never deposited the loan funds in escrow and hence the time for performance of these conditions subsequent never arrived. This agreed-upon order\n\nof performance is important. Prudential cannot be heard to complain that HRP and UCB failed to prove they had consummated arrangements to perform those conditions when, on account of Prudential's own breach, the duty to satisfy those conditions never matured.\n\nWe turn first to the question of when Prudential was entitled to receive a title insurance policy. Condition 2 of the commitment letter required HRP and UCB to provide Prudential with a title policy insuring Prudential's secured interest in the Hotel as a first encumbrance. However, under the escrow instructions to Arizona Title, as interpreted by the trial court in a ruling unchallenged on appeal, HRP and UCB's obligation to secure a title policy did not arise until after Prudential deposited the loan proceeds in escrow. The escrow instructions state in relevant part:\n\nAt such time as Prudential, pursuant to the commitment [letter] and the terms and conditions of the Five-Party Agreement referred to in paragraph 17 of Schedule A may be required to fund the Loan, the proceeds of the Loan will be deposited by Prudential, in escrow, with you [Arizona Title]. At such time as you have issued to prudential an ALTA Title Insurance Policy, in the amount of the Loan, with ALTA Endorsements Nos. 3R, 5, 7 and 7, and with a Reinsurance Agreement, all in the same form and content as the specimen which has been approved by Prudential's letter to you dated May 1, 1975, and have duly completed, recorded and filed the documents described in Schedule A, as therein directed, and are in a position to deliver to us those documents specified in Schedule A for delivery to us at the closing, you are authorized to apply and to disburse the proceeds of the loan as follows: . . . .\n\nBefore the Phase II trial, pursuant to HRP's motion for partial summary judgment, the trial court found, with regard to the order of performance that:\n\nThe Commitment [letter], the escrow instructions and the five-party agreement are clear and unambiguous. In sum and substance Prudential agreed that at such time as it was required to fund the loan that Prudential would deposit the loan proceeds in escrow and that at such time as the subject preapproved policy had issued (and the requirements of Schedule A to the escrow instructions had been complied with) the escrow agent was authorized to \"apply and disburse the proceeds of the loan\" according to the escrow instructions. Had the title company, acting as escrow agent, been unable to issue the subject pre-approved title policy, it would not have been authorized to disburse the loan proceeds. While this may have involved a substantial financial risk, that is what Prudential, according to the documentation before the court, had agreed to.\n\nThe escrow instructions are the only loan documents prescribing an order for performance on the title insurance issue. Since those instructions were clear and unambiguous, the trial court properly ruled as a matter of law that the duty to provide a title policy did not arise until after Prudential placed the loan proceeds in escrow. See Shattuck v. Precision-Toyota, Inc., 115 Ariz. 586, 566 P.2d 1332 (1977).\n\nGiven the order of performance fixed by the agreement among the parties, the trial court correctly held that HRP and UCB need not prove the existence of a \"binding and enforceable\" agreement requiring Arizona Title to issue a policy but only, as the jury was instructed, that \"the title policy would have issued if Prudential had deposited the loan proceeds in escrow.\" This instruction followed by necessity from the trial court's construction of the loan documents which is not challenged here. Since Prudential's duty of performance (depositing the loan funds in escrow) came first but Prudential did not perform, HRP and UCB's duty of performance never arose, and they cannot now be required to demonstrate as a condition of their recovery a performance they were never obligated to make. In traditional contract terms, Prudential's\n\nperformance was a condition precedent to plaintiffs' duty to procure a title insurance policy. 1 Restatement of Contracts § 250(a) (1932). On the contrary, at most they needed to prove only what they did prove -- that a title policy would have issued had Prudential funded the loan.\n\nThe evidence in Phase II was more than sufficient for the jury to conclude that a title policy would have issued. At the time of the Five-Party Agreement, Prudential preapproved the form and substance of Arizona Title's policy and the attached reinsurance agreements. At the same time, Arizona Title, along with its parent First American Title and other reinsurers, issued the interim policy and reinsurance to UCB. HRP not only paid Arizona Title for the UCB interim policy but also prepaid the premium for the permanent policy and reinsurance for Prudential. In February 1977, in response to Prudential's request for written assurances, a vice president of Arizona Title confirmed in writing that the company, in conjunction with its reinsurers, would issue \"a policy to the Prudential Life Insurance Company insuring that its mortgage is a first lien . . . .\" This same letter was read over the telephone to Prudential's real estate officer in Newark by First American Title's Senior Vice President and General Counsel, and the Prudential officer indicated satisfaction with it. Two real estate loan closing experts who testified for HRP and UCB stated that Prudential was unreasonable in refusing to accept this February 1977 letter from Arizona Title as adequate assurance that a title policy would in fact issue. Also probative of HRP and UCB's ability to procure a policy is the fact that in March 1977 Arizona Title made an even more formal commitment, when Prudential for the first time demanded such a document, and in June 1977 reiterated its willingness to issue the pre-approved policy in whatever form Prudential desired.\n\nIn addition, a representative of First American Title and Arizona Title testified unequivocally that they were ready, willing, and able to issue the title policy in February 1977 and to obtain the reinsurance agreements pre-approved by Prudential from the other reinsurers with indemnities, if necessary, from First American. If one or more of the other reinsurers proved unwilling, he could have obtained reasonable substitutes as permitted by the loan agreement. Representatives of four of the reinsurers testified that their companies would have reinsured, some with and some without indemnities. By stipulation, Prudential agreed that the testimony of the other four reinsurers would be to the same effect. The two largest reinsurers, Lawyers Title and TICOR, confirmed that, had some reinsurers backed out, they would have taken up any slack. Moreover, Prudential's own representatives involved in the loan transaction stated they believed that Arizona Title and the reinsurers would in fact issue the pre-approved policy.\n\nA jury's verdict ought not be set aside except for the most cogent reasons. Young Candy \u0026 Tobacco Co. v. Montoya, 91 Ariz. 363, 370, 372 P.2d 703, 707 (1962). This is so because the correctness and truth of disputed facts are peculiarly within the province of the jury. Burns v. Wheeler, 103 Ariz. 525, 528, 446 P.2d 925, 928 (1968); Harris v. Murch, 18 Ariz. App. 466, 503 P.2d 821 (1972). Here, the evidence that a title policy would have issued was unequivocal and uncontradicted by any significant evidence presented by Prudential. But even assuming there was conflicting evidence, the reviewing court will not substitute its judgment as to credibility of witnesses and weight of evidence for that of the jury. Burns v. Wheeler, supra; Leone v. Precision Plumbing \u0026 Heating of Southern Ariz., Inc., 121 Ariz. 514, 591 P.2d 1002 (App.1979). Rather, a verdict based upon conflicting evidence is binding upon the appellate court, Tom Reed Gold Mines Co. v. Brady, 58 Ariz. 44, 117 P.2d 484 (1941), so long as there is substantial evidence to support it. Leone v. Precision Plumbing, supra. The evidence presented in the trial court of HRP\n\nand UCB's ability to obtain a title policy more than meets the sufficiency test.\n\nAnother issue at trial was whether HRP and UCB had the ability at the time of closing to resolve certain disputed claims involving collateral agreements related to the operation of the Hotel.\n\nPrudential presented evidence that HRP and UCB needed to raise $850,000-$1,200,000 to bring various contracts current. HRP and UCB asserted that the amount in issue was $460,000. The trial court instructed the jury that HRP and UCB needed to prove that either of them had the ability to pay these obligations at the time of closing if Prudential had deposited the permanent loan funds in escrow. Prudential again urges that HRP and UCB's proof was legally insufficient because they did not show the existence of binding and enforceable agreements with third parties to provide the necessary funds. First, as with title insurance, the duty to make these payments never arose because Prudential refused to fund; therefore, proof of a binding commitment was unnecessary. Second, HRP and UCB themselves testified they could have made the necessary payments to close the loan. In other words, no third-party agreements were required.\n\nThe evidence was disputed but was nevertheless sufficient for the jury to conclude that UCB itself had the ability to make these payments. The weight to be given conflicting evidence is for the trier of fact, not a reviewing court. Lehman v. Whitehead, 1 Ariz. App. 355, 403 P.2d 8 (1965). Under the court's instructions, if UCB did have the ability both UCB and HRP were entitled to recover. Thus, even assuming the trial court's ruling on the \"binding and enforceable agreement\" issue was incorrect, the judgment must be affirmed because there was sufficient evidence upon which the jury could have based its verdict. In Land-Air, Inc. v. Parker, 103 Ariz. 1, 2, 435 P.2d 838, 840 (1967), the Arizona Supreme Court reaffirmed the settled principle of appellate review that a trial court's judgment must be affirmed when the reviewing court \"'can on any reasonable view of the evidence deduce therefrom facts which, on any theory of the law, would sustain the judgment.'\"\n\nEvidence also showed that HRP had the necessary funds available to it. Sam Shapiro, managing general partner of HRP, testified that if necessary he could have obtained $850,000 or more from National Metals, a subsidiary of Nametco, also a general partner and a company wholly owned by Mr. Shapiro. He testified that for the first nine months of 1976 National Metals had a net profit of $1,800,000, only $600,000 of which was committed to payment of loans; and that during the entire period from 1975 through mid-1979 National Metals never made less than $1,000,000 net profit per year.\n\nPrudential's objection is that National Metals never made a binding commitment to provide the funds. This ignores the fact that Sam Shapiro owned and was chief executive officer of National Metals, which at Mr. Shapiro's direction had already loaned HRP more than $5,000,000 in 1975 and 1976. National Metals was wholly owned by Nametco, a general partner of HRP. Nametco, in turn, was owned by Sam Shapiro, 50 percent in his own right and 50 percent as trustee under his wife's will. To argue that HRP cannot recover because, viewed retrospectively, Sam Shapiro failed to obtain a \"commitment\" from National Metals exalts form over substance by erecting an artificial proof barrier with no foundation in common sense.\n\nPrudential also contends that the financial condition of National Metals is irrelevant, citing Sargent v. Wekenman, 374 S.W.2d 635 (Mo.App.1964), a brokerage commission case holding the financial condition of the sole stockholders of a company inadmissible to show that the company itself was sufficiently solvent to perform its lease obligations. In Wekenman there was no testimony that the stockholders would have provided funds to the company. Here, Mr. Shapiro testified that National Metals, which he controlled, would have provided the necessary financial assistance.\n\nHRP and UCB submitted other persuasive proof on the issue of their ability to raise up to $850,000 to close the loan. No agreement was ever executed to borrow the funds and none was necessary until Prudential indicated a willingness to fund, which it refused to do.\n\nPrudential also claims on appeal that HRP's ability to remove its indebtedness to UCB for interest and costs associated with the interim loan was also an issue. Prudential did not plead this matter; nor did it otherwise preserve the claim for appeal. It is now too late to litigate that issue. Jennings v. Roberts Scott \u0026 Co., 113 Ariz. 57, 546 P.2d 343 (1976). In any event, Robert Fiddaman, vice president of UCB, testified that UCB had agreed to remove its encumbrance on the Hotel if it received the loan proceeds from Prudential, notwithstanding that the loan proceeds would not make UCB whole.\n\nThe evidence adduced in the trial court was more than sufficient for the jury to conclude that UCB and HRP had the ability to perform their obligations pursuant to the disputed conditions of the commitment letter.\n\nProof of a binding and enforceable agreement with a third party is unnecessary and inappropriate in an anticipatory repudiation case. Prudential asserts that when proof of ability depends upon some performance by an independent party, such as a loan from UCB or Valley National Bank, there must be evidence that the third party made an enforceable commitment to render the performance. Without evidence of a consummated agreement, Prudential contends, proof of ability is insufficient as a matter of law. HRP and UCB presented substantial evidence of their own ability to fulfill the conditions of the commitment letter even without assistance from an unrelated third party, and, for that reason, even if Prudential is correct, there was sufficient evidence to support the judgment.\n\nThe brokerage commission cases on which Prudential relies do not involve anticipatory repudiations. Their only relation to the instant situation is the fact that they discuss the term \"ready, willing and able\" -- not, however, as that term is actually applied when there is an anticipatory breach excusing any tender of performance but when an actual tender of performance is in issue. In the typical case, a real estate broker produces for a seller of real estate a buyer who is supposedly \"ready, willing and able\" to consummate an agreement on the seller's terms. However, the seller finds the buyer unacceptable because he does not have the entire purchase price in hand and his assurance that he will obtain a loan from an independent party is unaccompanied by a firm commitment to make the loan. The broker thereafter sues for his commission, claiming he produced a \"ready, willing and able\" purchaser. In these circumstances, some courts hold that buyer's tender is inadequate without an enforceable loan contract. E.g., Winkelman v. Allen, 214 Kan. 22, 519 P.2d 1377 (1974); Shell Oil Co. v. Kapler, 235 Minn. 292, 50 N.W.2d 707 (1951). However, other courts decline to erect this automatic and formalistic barrier to recovery and hold that the question is whether, under all the evidence, the buyer adequately demonstrated his ability to perform. E.g., Pellaton v. Brunski, 69 Cal.App. 301, 231 P. 583 (1924); Epstein v. Bossard, 206 Misc. 48, 131 N.Y.S.2d 709 (1954), aff'd 286 App.Div. 920, 143 N.Y.S.2d 659 (1955); Globerman v. Lederer, 281 App.Div. 39, 117 N.Y.S.2d 549 (1952).\n\nWe do not need to choose between these competing lines of cases because they do not involve anticipatory breach. The demonstrated financial ability of the prospective purchasers is a critical element in the broker commission cases because, unlike the non-breaching party to an anticipatory repudiation case, the purchaser must make an actual tender of performance to the seller. An anticipatory repudiation, on the other hand, relieves the non-breaching party of the duty to tender performance or to demonstrate to the repudiating party its ability to perform. In addition to proving the repudiation, the non-breaching party\n\nneed only show \"that he would have been ready and willing to have performed the contract, if the repudiation had not occurred.\" Petersen v. Wellsville City, 14 F.2d 38, 39 (8th Cir.1926). Accord United States Overseas Airlines, Inc. v. Compania Aerea, 246 F.2d 951 (2d Cir.), cert. denied, 355 U.S. 893, 78 S.Ct. 266, 2 L.Ed.2d 191 (1957); Lagerloef Trading Co. v. American Paper Products Co., 291 F. 947 (7th Cir.1923).\n\nIn effect, Prudential would have HRP and UCB prove that they actually concluded their preparations for performance at the time when performance would have been due, had Prudential not repudiated. That is not the law. Because of Prudential's breach, HRP and UCB had no obligation to go to the substantial expense of concluding preparations or to tender performance. All HRP and UCB needed to do was demonstrate to the jury that they had the ability to fulfill their commitment letter obligations in February 1977. This they proved to the jury's satisfaction.\n\nThere is no reason to reject the jury's verdict and the judgment.\n\nV. FUNDING INTO A DEFAULT AND INSOLVENCY\n\nPrudential states that it should not be required to fund into a default and argues as follows:\n\nThe pre-approved Deed of Trust HRP was to give Prudential when the permanent loan closed included an express warranty that HRP \"warrants that the title to all property conveyed by this Deed of Trust is clear, free and unencumbered.\" . . . Yet, because HRP had not removed the mechanics' liens when the loan was tendered to Prudential in February, 1977, had Prudential closed the loan and taken the Deed of Trust, those liens would have remained of record, and prior in right. Thus, the closing of the Prudential loan would have resulted in an instant default. Prudential was not required to fund into a default.\n\nSince Prudential's funding of the loan would have had the instant effect of HRP's breaching the warranty in the Deed of Trust against encumbrances, Prudential was, as a matter of law, excused from funding into that default. The trial court erred in ruling otherwise.\n\nThis court has already determined that Prudential was not entitled to an in-fact first lien under the terms of the collateral loan documents, which include the deed of trust. See Section III D, supra.\n\nPrudential's argument ignores the facts that the commitment letter and the Five-Party Agreement require an insured first lien and not lien-free completion of the Hotel, that HRP and UCB went to elaborate lengths to assure title insurance protection against any such liens, and that UCB loaned the sum of $25,500,000 in reliance upon Prudential's express promise that it would take out UCB if the conditions of the commitment letter were satisfied.\n\nThe record fully supports the trial court's finding of fact at the conclusion of Phase I that the \"Prudential-HRP [collateral] loan documents executed on or about May 2, 1975, were not intended to and did not create any additional conditions precedent to Prudential's obligation to fund its permanent loan commitment.\" Since Prudential, HRP and UCB had specifically fixed the conditions to Prudential's obligation to fund the permanent loan, this court cannot add a condition that would change the nature of the transaction and the risks assumed by HRP and UCB. Stearns-Roger Corp. v. Hartford Accident \u0026 Indemnity Co., 117 Ariz. 162, 571 P.2d 659 (1977).\n\nPrudential pleaded as an affirmative defense that it had no obligation to fund HRP because HRP was insolvent. (HRP denied this allegation.) The trial court struck the defense. There was no \"insolvency clause\" in the commitment letter or the Five-Party Agreement dealing with insolvency, bankruptcy, or material adverse change in the financial condition of the borrower, HRP. It is Prudential's position that the continued solvency of HRP is\n\na \"constructive condition\" which is not dependent on the existence of an \"insolvency clause\" in the commitment letter.\n\nIn its reply brief, Prudential particularizes its insolvency argument:\n\n[T]he defense raised by Prudential . . . was not that the hotel was \"nonviable,\" but rather was a much more encompassing defense: that the borrower's insolvency would prevent repayment of the loan installments during the \"start-up\", the period before the hotel might support debt service. Prudential's defense, which it was prevented from asserting, was that HRP's insolvency during this start-up period would prevent HRP from repaying the Prudential loan installments in the interim, default and foreclosure would result and therefore the hotel would never get to the point of possible \"viability.\"\n\nPrudential relies on 1 Restatement of Contracts § 287 (1932); Arizona Title Ins. \u0026 Trust Co. v. O'Malley Lumber Co., 14 Ariz. App. 486, 484 P.2d 639 (1971); and Leiter v. Eltinge, 246 Cal.App.2d 306, 54 Cal.Rptr. 703 (1966).\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nThe Restatement is of interest in resolving this issue but is not determinative. It provides in relevant part:\n\n§ 287. PROSPECTIVE INABILITY CAUSED BY INSOLVENCY.\n\n(1) In promises for an agreed exchange a promisor need not perform at the time fixed for performance of his promise if performance of the exchange is uncertain because the other party is insolvent, . . . unless performance of the exchange is . . . made reasonably certain by security . . . .\n\n(2) A person is insolvent within the meaning of the Restatement of this Subject when he is unable to pay his debts as they mature.\n\n1 Restatement of Contracts § 287 (1932).\n\nWe believe that the Restatement has a narrower application than Prudential would give it. In the context of this case, the \"agreed exchange\" is the satisfaction of the conditions of the loan commitment by HRP in exchange for the funding of the permanent loan by Prudential. The trial jury in Phase II determined that HRP could have satisfied the conditions of the commitment letter. We do not deem it a defense to Prudential that it could prove that after the loan was funded and Prudential had the agreed security, HRP may not have been able to make payment of the necessary loan instalments. In that event, Prudential would have recourse against the security. That, presumably, is why the security was required. It should be remembered that Prudential's loan to HRP was to be on a non-recourse basis and there was no personal liability. Even if we were to interpret the \"agreed exchange\" to include the future payment of the loan installments, § 287 provides that Prudential would be required to fund the permanent loan if the payment of the loan instalments is \"made reasonably certain by security.\" Again, security is exactly what the conditions of the commitment letter provided and the jury determined that HRP and UCB had the ability to comply with those conditions.\n\nIn Arizona Title the development company had contract commitments from the contractors to perform construction work. During the period of performance the contractors inquired of Arizona Title, as disbursing escrow agent, to determine the financial status of the development company, which was in fact insolvent, and Arizona Title told them that money was either on hand or would be available to pay them for their labor and materials. The contractors continued to furnish labor to be performed and materials, relying on the representation by Arizona Title, and they were not paid. Arizona Title took the position that in continuing to furnish labor and materials the contractors were not induced to do anything by Arizona Title's misrepresentation because they were already contractually bound to continue performance. This court\n\nconcluded that because of the development company's insolvency, the contractors would not have been required to continue furnishing labor and materials. 1 Restatement of Contracts § 287 (1932). Therefore, the title company's misrepresentation that the contractors would be paid was actionable and it was no defense for Arizona Title that the contractors continued performance pursuant to their commitments to the developer in reliance on the misrepresentation.\n\nThe Leiter case is also distinguishable. It was a land sales case in which the court stated the general rule that \"the delivery of the deed and the payment of the purchase price are concurrent and dependent conditions.\" 246 Cal.App.2d at 316, 54 Cal.Rptr. at 709. The court then pointed out that the plaintiff-seller never had title to the property in question and concluded that the \"defendant's duty to perform [by paying for the property] is excused where it appears plaintiff will not be able to render his performance [by delivering the necessary deed] at the agreed-upon time due to impossibility, insolvency, manifest inability to perform, or similar cause.\" 246 Cal.App.2d at 317, 54 Cal.Rptr. at 710. Of course, the defendant in Leiter would have had just as good a defense if plaintiff had been insolvent and could not deliver the deed as he had under the facts of the case where the plaintiff did not have title. Here, HRP and UCB did have the ability to comply with the conditions of the commitment letter and close the loan transaction. Whether HRP could later make payments on the note is irrelevant to the question of whether Prudential had the duty to fund the permanent loan.\n\nIt should not be forgotten that Prudential and HRP are not the only parties to this litigation. UCB was induced to make an interim construction loan in reliance on Prudential's commitment to provide permanent financing for the Hotel. Under the terms of the commitment letter, HRP was not only required to pay interest to Prudential, Prudential also shared in the profits from the Hotel one third of gross annual income after various deductions. In the Five-Party Agreement, the parties expressly agreed that the only conditions to Prudential's obligation to fund the permanent loan of $25,500,000 were set forth in the commitment letter which was attached to the Five-Party Agreement as exhibit C. Once these conditions were satisfied, the risk of HRP's non-payment shifted from UCB to Prudential. The future solvency of HRP was a foreseeable risk which Prudential assumed when it issued the commitment letter to HRP. Its commitment letter was later reaffirmed in the Five-Party Agreement involving UCB. This court cannot insert a \"constructive condition\" in the agreements between the parties which materially changes the obligations of the parties. Shattuck v. Precision-Toyota, Inc., 115 Ariz. 586, 566 P.2d 1332 (1977). This principle has been clearly stated in a recent law review article:\n\n[S]ince the lender has made a promise to lend, and has accepted consideration for that promise, it should not be allowed to avoid performance simply because that promise, in retrospect, was improvidently made. Although the consequences of loaning on a project of questionable viability are potentially disastrous, the interest of the construction lender and other third parties who relied on the permanent lender's promise are at least equal to the permanent lender's interest in avoiding those consequences. Because the permanent lender knows that all parties involved will rely on his promise to lend, specific enforcement of that promise presents no undue hardship when it appears that the risk realized was one assumed by the permanent lender, since he is only being compelled to do that which he promised to do.\n\nMehr \u0026 Kilgore, Enforcement of the Real Estate Loan Commitment: Improvement of the Borrower's Remedies, 24 Wayne L.Rev. 1011, 1042 (1978); see also, First Nat. State Bank v. Commonwealth Federal Savings and Loan Ass'n, 455 F.Supp. 464 (D.N.J.1978), aff'd., 610 F.2d 164 (3d Cir.1979); Groot, Specific Performance of\n\nContracts to Provide Permanent Financing, 60 Cornell L.Rev. 718 (1975).\n\nPrudential's argument that the alleged insolvency of HRP discharged Prudential's funding obligation ignores this court's holding in Cuna Mutual Ins. Soc'y v. Dominguez, 9 Ariz. App. 172, 450 P.2d 413 (1969). In Cuna, a credit union had agreed to loan Mr. and Mrs. Dominguez the sum of $4,114.00 for the purchase of certain property, which sum was to be paid by the credit union directly to the sellers of the property. Mr. Dominguez died before $3,500.00 of the loan proceeds were disbursed, and the credit union then refused to pay over the balance to the sellers. The court affirmed the trial court's finding that the credit union remained obligated to disburse the loan proceeds.\n\n[W]e point up the peculiar nature of this contract to lend money. This agreement was for a loan in the single amount of $4,114 for the singular purpose of financing the purchase of a home. The loan contract was executed concurrently with, and for the purpose of financing, a land purchase contract. Its purpose was well-known to the credit union.\n\nThere is no express contingency in this contract that the loan would not be made if one of the borrowers should die before the full amount of the loan was disbursed. Nor is there a showing of a constructive condition to this effect. See Restatement of Contracts § 253. The law does not lightly construe conditions into contracts that the parties have made for themselves.\n\n9 Ariz. App. at 175, 177, 450 P.2d at 416, 418.\n\nJust as Mr. Dominguez's death was irrelevant to the credit union's duty to fund its loan, HRP's alleged insolvency was irrelevant to Prudential's obligation to fund the permanent loan. Just as it would have frustrated the parties' intention for the court to have added a constructive condition to Cuna, the addition of a \"constructive condition\" such as that for which Prudential argues would completely frustrate the intention of the parties and would reallocate a risk which Prudential knowingly assumed when it committed to provide permanent financing for the Hotel.\n\nVI. ATTORNEY-CLIENT PRIVILEGE\n\nThe jury trial in Phase II took six weeks. HRP and UCB presented evidence first. During the presentation of its case, Prudential called as a witness Lyman A. Manser, a partner in Lewis and Roca, the law firm which represented Prudential in dealing with HRP and UCB both during the trial and for a substantial period before. Prudential also called as witnesses Robert Wheeler and Kenneth Jackson, Wheeler being house counsel for Prudential, and Jackson, a company official. During the two days when these three witnesses testified, Prudential objected to questions and invoked the attorney-client privilege some twenty-odd times in the presence of the jury. The trial court sustained Prudential's objections each time. A.R.S. § 12-2234; 1 M. Udall \u0026 J. Livermore, Arizona Practice: Law of Evidence § 74 (2d ed. 1982).\n\nPrudential claims that the trial court committed prejudicial error by \"forcing\" Prudential repeatedly to invoke the attorney-client privilege before the jury. Prudential does not particularize its claim of error beyond alleging general prejudice and giving citations of the record where the privilege was claimed. Prudential does not allege that it was prejudiced by the contents of any particular question. The trial judge had admonished the attorneys for HRP and UCB not to cross-examine Mr. Manser and the other Prudential witnesses with leading questions regarding purported communications between Prudential and its attorneys. The admonition appears to have been honored.\n\nMessrs. Manser, Wheeler and Jackson testified about their communications with HRP and UCB. On cross-examination, they were asked about conversations they had with other representatives of Prudential and the attorney-client privilege was invoked and the objections sustained. For\n\ninstance, Mr. Manser was asked if there was a meeting of Prudential people in Newark, New Jersey, on November 8, 1976, before they met with representatives of HRP and UCB. He indicated that there was such a meeting. When asked whether they discussed the status of loan conditions at that meeting, the attorney-client privilege was invoked and sustained. Mr. Manser was then asked whether, when he acted as spokesman for Prudential at the Newark meeting with HRP and UCB, he was acting with the consent and at the request of Prudential in doing so. Again, the privilege was invoked and sustained.\n\nAt the end of the jury trial, the trial court rejected proffered jury instructions both by HRP and UCB and by Prudential on the attorney-client issue. HRP and UCB urged an instruction permitting the jury to draw an adverse inference from a claim of privilege, and Prudential countered with a proposed instruction cautioning that no adverse inference could be drawn. The court was dissatisfied with both instructions and ultimately chose to give no instruction at all on the subject. None of the parties made any reference in closing argument to invocation of the privilege.\n\nThis claim of privilege at trial had been anticipated. Sometime before trial, HRP and UCB had been advised that Mr. Manser would be presented as a witness at the jury trial. Based on their claim that Prudential, during the deposition of Mr. Manser, invoked the attorney-client privilege more than 100 times, HRP and UCB initiated a series of pre-trial motions to prohibit Messrs. Manser and Wheeler from testifying at all or to disqualify Lewis and Roca from representing Prudential. HRP and UCB alternatively sought a ruling from the trial court that in the event Prudential presented Messrs. Manser and Wheeler as witnesses, it should be deemed to have waived the attorney-client privilege. The trial court denied the motions made by HRP and UCB and ruled that Prudential could call its attorneys as witnesses without waiving the attorney-client privilege in advance. The trial court also ruled that HRP and UCB could ask questions on cross-examination which would lead to the invocation of the attorney-client privilege.\n\nIn proceedings held out of the presence of the jury immediately before the cross-examination of Mr. Manser, Prudential indicated equivocation as to whether it intended to invoke the attorney-client privilege.\n\nMR. IRISH: I think that you are also saying, Judge, . . . you will permit them [HRP and UCB] to ask questions which will require us [Prudential] to invoke the attorney-client privilege if we intend to assert it.\n\nThe trial court had ruled before trial that Prudential witnesses who had declined to answer a question during discovery based on the claim of attorney-client privilege could not be examined directly or indirectly by Prudential \"relative to the specific subject matter of that question\"; but, on cross-examination by other parties, Prudential could \"waive the privilege and permit the witness to answer the question,\" in which case the witness could be fully examined by all parties as to that \"specific subject matter.\" See Buzard v. Griffin, 89 Ariz. 42, 358 P.2d 155 (1960).\n\nThe trial court ruled that HRP and UCB could ask questions to which Prudential might claim the privilege.\n\n[THE COURT]: . . . [I]f they can't get the evidence in, I think the jury has a right to know why they can't get the evidence in.\n\nThis ruling was only fair. However, we must determine whether it was error and prejudicial.\n\nIn its opening brief, Prudential cited two cases in support of its position. State v. Holsinger, 124 Ariz. 18, 601 P.2d 1054 (1979), and Vilardi v. Vilardi, 200 Misc. 1043, 107 N.Y.S.2d 342 (1951).\n\nHolsinger is distinguishable. It was a criminal case in which the defendant took the stand in her own defense and was questioned by the prosecutor about her conversations with her attorney regarding the case the state had against her. The defense attorney and then the defendant\n\nherself were required to invoke the attorney-client privilege. Holsinger stands for the proposition that when a defendant takes the stand in a criminal case to testify in his own behalf, it is improper to ask him about conversations between the defendant and his attorney.\n\nHowever, quite a different case is presented where in a civil case a party calls his own attorneys to the stand to present substantial evidence on that party's own behalf. Prudential attempted to have the trial court thwart HRP and UCB from asking questions before the jury to which it might object and claim the attorney-client privilege. At least some of the questions appeared to be ones that would have presented themselves to jurors hearing the case and most if not all would have been asked by any competent attorney. There is no reason that the jury should be deluded into thinking that counsel for HRP and UCB had simply forgotten to address appropriate questions to material witnesses. Prudential had a valid privilege it could call upon in refusing to answer questions and there is no reason why, under the circumstances of this case, the privilege should not have been invoked before the jury.\n\nIn Vilardi the husband sought an annulment from his wife on the ground that she was in fact sterile at the time of their marriage and fraudulently represented to him that she was able to bear children. On the trial of the annulment action, the husband in his case in chief called the wife to the stand as his witness and cross-examined her as to certain hospital treatment and diagnosis. The wife answered without objection from her attorney. However, when the husband offered in evidence the hospital records, the wife's claim of physician-patient privilege was asserted and the court would not admit them in evidence. The husband asserted the exclusion of the hospital records as his principal basis for requesting a new trial since the verdict had been in favor of the wife. The trial court in denying the motion for new trial concluded that the wife in testifying on cross-examination regarding her medical treatment had not waived her physician-patient privilege and therefore could invoke it in objecting to the admission of the medical records. The trial judge further indicated that if the wife had testified in her own behalf with respect to her medical treatment, then she might have been deemed to have waived the privilege. Vilardi stands for the proposition that a party cannot call an opposing party to the stand and, by attempting to elicit testimony with respect to otherwise privileged matter, force the opposing party to either waive the privilege or assert the privilege before the jury. That did not occur here.\n\nThe trial court has broad discretion in ruling on a claim of attorney-client privilege where, as here, a party calls his own attorney as a material witness to communications with the other parties and then claims the privilege as to communications with the client regarding the same subject matter. We find no error by the trial court in permitting HRP and UCB to ask questions of Prudential's attorneys called by Prudential as witnesses regarding their communications with other Prudential representatives where the jury might well have had the same questions in mind. Since the claim of privilege was not only not emphasized in closing argument but not even mentioned, we conclude that the claims of privilege made during two days of the six-week trial as to questions of arguable relevance did not prejudice Prudential. Prejudice cannot be presumed from this record.\n\nThe trial court instructed the jury on how it was to consider objections made by parties which were sustained by the court.\n\nYou must find the facts from the evidence. The evidence which you are to consider consists of testimony of witnesses and exhibits. At times I decided whether testimony and exhibits should be admitted. When an objection to a lawyer's question was sustained, you are to disregard the question, and you are not to guess what the answer to the question might have been. When testimony was ordered stricken from the\n\ncourt record, you are not to consider that testimony as evidence. Do not concern yourselves with the reasons for these decisions. Admission of evidence in court is governed by rules of law.\n\nWe have no reason to believe that the jury did not follow this instruction.\n\nIn its answering brief, UCB asserts that UCB and HRP, in putting on their cases in chief at trial, \"inevitably\" referred to Messrs. Manser and Wheeler \"continuously\" in testimony and exhibits because they were actively involved in HRP's efforts to obtain funding of the permanent loan. UCB argues that when Prudential presented its case it was \"obvious\" that the jury expected these two attorneys for Prudential to take the stand to tell Prudential's side of the story, but unbeknownst to the jury, they would only be told part of the story because of the claim of privilege.\n\nPrudential in its reply brief complains that Messrs. Manser and Wheeler were \"inevitably\" and \"continuously\" named only because this \"was caused by appellees' counsel themselves. On not less than 173 occasions during the plaintiffs' case in chief, plaintiffs' counsel interjected and emphasized Manser's and Wheeler's names and roles in the decision-making process.\"\n\nWe have reviewed the references to Messrs. Manser and Wheeler which are contained in 18 volumes of transcript involving some 1,124 pages of testimony during the 13 particular trial days involved. The names of Messrs. Manser and Wheeler came up in questions by various attorneys for HRP and UCB and again in answers by various witnesses. The issues involved during the examinations appear to have been foundational to show what people were present during certain meetings and transactions, who made particular statements, who was present, and to whom statements were addressed. There are references to Messrs. Manser and Wheeler in exhibits which were referred to in the transcripts. We have reviewed the particular references cited by Prudential and find no prejudice. We find no support for the claim by Prudential that counsel for HRP and UCB caused the names of Messrs. Manser and Wheeler to be mentioned, \"with the predetermined intent of setting up this very argument.\"\n\nAssuming the trial court committed error in permitting HRP and UCB to ask questions before the jury to which Prudential claimed the attorney-client privilege, it is harmless error. We find that had this not occurred there is no reasonable probability that the verdict might have been different. State v. Dutton, 83 Ariz. 193, 200, 318 P.2d 667, 671 (1957).\n\nThe judgment will not be reversed where there is harmless error since during the jury trial it appears that substantial justice was done. Ariz. Const. art. 6, § 27; Webb v. Hardin, 53 Ariz. 310, 313, 89 P.2d 30, 31 (1939). Prejudice will not be presumed but must appear from the record. State v. Whitman, 91 Ariz. 120, 127, 370 P.2d 273, 278 (1962); Phoenix Western Holding Corp. v. Gleeson, 18 Ariz. App. 60, 65, 500 P.2d 320, 325 (1972); Kerley Chemical Corp. v. Producers Cotton Oil Co., 2 Ariz. App. 56, 58, 406 P.2d 258, 260 (1965).\n\nWe find no reason to reverse the jury's verdict and the judgment.\n\nVII. MEASURE OF DAMAGES\n\nA. Introductory Statement\n\nThe trial to the court regarding damages in Phase III took the better part of two weeks. The trial court ruled that HRP was entitled to recover as damages its \"loss of equity\" in the Hotel; that is, the difference between the Hotel's fair market value on the date of the foreclosure sale, January 18, 1978, and the encumbrances against the Hotel at that time. Prudential does not quarrel with this legal yardstick. The traditional measure of damages for breach of a contract to loan money is the additional interest required for a replacement loan. See Higgins v. Arizona Savings and Loan Ass'n, 90 Ariz. 55, 365 P.2d 476 (1961); Shurtleff v. Occidental Building \u0026 Loan Ass'n, 105 Neb. 557, 181\n\nN.W. 374 (1921); 1 Restatement of Contracts § 343 (1932).\n\nHowever, this measure has been broadened to include loss of equity if the breach of the loan agreement caused the borrower to lose ownership of its assets. See F.B. Collins Inv. Co. v. Sallas, 260 S.W. 261 (Tex.Civ.App.1924); St. Paul at Chase Corp. v. Manufacturers Life Ins. Co., 262 Md. 192, 278 A.2d 12, cert. denied 404 U.S. 857, 92 S.Ct. 104, 30 L.Ed.2d 98 (1971); Stanish v. Polish Roman Catholic Union, 484 F.2d 713 (7th Cir.1973).\n\nThe Sallas case sets forth the measure:\n\nIt is the landowner's interest in the land, represented by the value of his equity, that he would be entitled to as compensation. For legally the value of the equity is his only \"actual loss.\" The value of the equity is not measured, as a matter of law, by the amount of the purchase price paid in cash for the land in the first instance. The value of this equity must appear and be established at the time the title is lost. For the value of the equity at the time the title is lost may or may not be the same as at the time of the original purchase by the landowner. The market value of land rises and decreases, according to conditions and circumstances. If the market value of land goes below the original purchase price paid, the value of the equity would consequently be less. And, on the other hand, the value of the equity would be greater if the market value of the land should be greater than the original purchase price paid. In either event the landowner could recover the value of his equity, and no more.\n\n260 S.W. at 265. Although Sallas dealt with the \"purchase price\" of the property in question, \"original cost\" can be substituted for it for our analysis. Our Supreme Court has indicated that original cost may be considered by the trier of fact to determine market value.\n\nOriginal cost is admissible in evidence, but is never controlling . . . . In short, \"original cost\" and \"present value\" are not equivalent terms.\n\nCity of Phoenix v. Consolidated Water Co., 101 Ariz. 43, 47, 415 P.2d 866, 870 (1966). The same can be said of \"replacement cost.\" Cf. Grossman v. Westmoreland II Investors, 123 Ariz. 223, 599 P.2d 179 (1979).\n\nThe trial court ruled that the fair market value of the Hotel in January 1978 was $35,994,000. Since the loan to be funded by Prudential was in the amount of $25,500,000, the trial court concluded that the loss of equity sustained by HRP was in the amount of $10,494,000.\n\nPrudential claims on appeal that the trial court erred (1) in determining the fair market value of the Hotel and (2) in refusing to subtract UCB's cost, interest and fee liens from fair market value.\n\nPrudential contends that the evidence presented by HRP during Phase III was insufficient to justify the $10,494,000 award. Prudential further argues that, even if the evidence was sufficient, the trial court \"miscalculated\" damages, thus entitling Prudential to a new trial. However, there is substantial evidence supporting the trial court's resolution of the damages issue.\n\nHRP originally based its damages claim for loss of the Hotel on three theories of recovery: (1) lost profits; (2) reliance damages; and (3) market value. Rejecting the first two as a matter of law, the trial court confined Phase III to proof by HRP of its lost equity, which the trial court correctly defined as the market value of the Hotel on the date of foreclosure less expenses saved by reason of the foreclosure. To establish the market value of the Hotel, HRP introduced evidence of its investment in the project, the cost of replacing the Hotel, and the value of the Hotel based upon projected future income. At the end of the Phase III trial, the trial court entered the following findings of fact and conclusions of law, which are critical to our review of the damages award:\n\nFINDINGS OF FACT\n\n1. The Court adopts the uncontested facts which the parties agree are material\n\nfor the purposes of Phase III as set forth in the Joint Pre-Trial Statement for Phase III.\n\n2. Unless there is a significant reason to differentiate, all of the plaintiffs herein will generally be referred to as HRP.\n\n3. HRP purchased the subject real property upon which the hotel was ultimately constructed in 1972 from Arizona Public Service for $1,975,000, and in addition paid off an existing mortgage of approximately $100,000. In addition, it was necessary for HRP to acquire an alley which bisected the subject real property at a cost of $31,700, for a total acquisition price in excess of $2,000,000.\n\n4. The subject real property is one square block in the center of downtown Phoenix, Arizona, which square block consists of approximately 90,000 square feet and is bound by First Street, Second Street, Adams and Monroe.\n\n5. The hotel which was constructed on the subject real property is a first class, modern, high-rise 734 room structure (711 keys). The hotel is convention oriented and is immediately adjacent to the Phoenix Civic Plaza.\n\n6. The total costs of construction of the hotel, not including the land acquisition costs, exceeded $35,500,000. In addition, HRP incurred other miscellaneous expenses, including attorneys' fees, which would to a greater or lesser degree be incurred by the developer of any large project.\n\n7. In January 1978 when UCB foreclosed its deed of trust and HRP lost the hotel, the fair market value of the hotel was $35,994,000.\n\n8. At the time the commitment was issued and at the time the 5-Party Agreement was entered into, it was foreseeable and within the contemplation of the parties that if Prudential failed to fund the permanent loan, under the circumstances that existed in this case, an alternate source of financing could not be obtained and HRP would lose the hotel.\n\n9. HRP's equity in the hotel is $10,494,000 ($35,994,000 -- $25,500,000). The Court in arriving at the equity figure declines to deduct the amount of interest due UCB and the amount of mechanics' liens.\n\nConclusionS OF LAW\n\n1. \"The measure of damages for a breach of a contract to lend money is usually . . . the difference between the contract interest rate and the increased interest rate the borrower is obliged to pay in procuring a new loan. There are certain exceptions to this rule, one of which is that, where it appears that the specific purpose for which the loan was made was communicated to the lender at the time the contract was entered into, and where it further appears that the borrower has suffered special damages by the breach, which were pleaded and proved, the damages recoverable are such as may fairly and reasonably be supposed to have been in the contemplation of the parties at the time of making the contract, as the probable result of a breach of it.\" Higgins v. Arizona Savings and Loan Association, 90 Ariz. 55 at 63, 356 [365] P.2d 476. See also Restatement of Contracts, Sec. 343.\n\n2. \"The better rule and the one generally followed is that for breach of a contract to lend money the borrower can get judgment for damages measured by his resulting injury so far as the defendant had reason to foresee such injury when the contract was made. This is the rule applicable to contracts in general, and a lender of money should be subject to it like other contractors.\" Corbin, Sec. 1078 at page 447.\n\n3. \"For breach of a contract to loan money for the purpose of discharging encumbrances upon real estate, the loss occasioned by foreclosure of the liens may not be recovered, where there is nothing to show that the money could not have been procured in the normal money market in time to prevent the loss.\" 36 A.L.R. at 1417.\n\n4. \". . . losses incurred by foreclosure may be recovered, where they were in\n\ncontemplation of the parties at the time the contract was made.\" 36 A.L.R. at 1430.\n\n5. \"It is the landowner's interest in the land, represented by the value of his equity, that he would be entitled to as compensation. For legally the value of the equity is his only 'actual loss.'\" St. Paul at Chase Corp. v. Manufacturers Life Ins. Co., 278 A.2d 12 at 35, 262 Md. 192 (1971).\n\n6. \"The familiar aim of compensatory contract damages the computation of which is hardly an exact science (citation omitted), is to yield the net amount of the losses caused and the gains prevented by the breach of contract.\" A.R.A. Manufacturing Co. v. Pierce, 86 Ariz. 136, 341 P.2d 928, 932 (1959).\n\nThe issue before this court is not whether the trial court made some arithmetical or conceptual miscalculation not apparent on the face of these findings, it is whether there is record support for the findings. Rule 52(a) of the Rules of Civil Procedure provides in pertinent part that \"[f]indings of fact shall not be set aside unless clearly erroneous, and due regard shall be given to the opportunity of the trial court to judge the credibility of witnesses.\" This standard has been interpreted by the Arizona Supreme Court as requiring the reviewing court to accept the facts as found by the trial judge where there is any reasonable evidence supporting them. Matter of Appeal in Pima County, Adoption of B-6355, 118 Ariz. 111, 115, 575 P.2d 310, 314, cert. denied sub. nom. Clark v. Curran, 439 U.S. 848, 99 S.Ct. 149, 58 L.Ed.2d 150 (1978); Grant v. White, 103 Ariz. 257, 258, 439 P.2d 828, 829 (1968). Thus the evidence must be considered in the strongest manner in favor of HRP and UCB and in support of the court's findings. Holaway v. Realty Associates, 90 Ariz. 289, 367 P.2d 643 (1961); Bohmfalk v. Vaughan, 89 Ariz. 33, 357 P.2d 617 (1960), and the trial court must be affirmed if, on a reasonable view of the evidence, facts can be found which would sustain the judgment on any theory of law. Land-Air, Inc. v. Parker, 103 Ariz. 1, 2, 435 P.2d 838, 840 (1967).\n\nThe evidence in the record of market value is sufficient to require affirmance under these standards.\n\nB. The Evidence Supports the Trial Court's Findings.\n\nReplacement Cost. HRP submitted evidence that its investment in and the replacement cost of the Hotel was $46,842,497. Replacement cost is one of three generally accepted methods of determining market value. Grossman v. Westmoreland II Investors, 123 Ariz. 223, 599 P.2d 179 (1979). See generally E. Friedman, Encyclopedia of Real Estate Appraising 9-10 (3d ed. 1978) and S. Rushmore, The Valuation of Hotels and Motels at 55-56 (1978). The other two are the income and market approaches. Grossman, supra, 123 Ariz. at 224, 599 P.2d at 180. While each of these methods may be appropriate in particular circumstances, alone or in combination, replacement cost \"may yield the most accurate estimate of value\" where, as here, the comparable sales or other market data are of limited value and the income approach is difficult to apply because the business is relatively new. Friedman, supra, at 65, 68, 639.\n\nPrudential contends that replacement cost is an improper method of valuing income-producing property. For this proposition, it cites Department of Revenue v. Transamerica Title Insurance Co., 117 Ariz. 26, 570 P.2d 797 (App.1977), decided by Division Two of this court.\n\nThe issue in the Transamerica case was whether an assessor's determination of market value, based on reproduction costs alone, could be upheld when the only testimony at trial indicated that knowledgeable buyers of the type of property under consideration rely solely on the income approach. Given that testimony, this court found the value based on replacement cost was unacceptable because it was not founded on concrete testimony that this was a useful appraisal method for that property.\n\nPrudential presented as its valuation witness John T. Hansen, M.A.I. Mr. Hansen\n\nsubmitted his written appraisal report of the Hotel on June 7, 1979, less than two weeks before the Phase III trial began. In his written report he ignored the cost approach. Mr. Hansen based his report on the income and market approaches. In trial testimony, Mr. Hansen indicated that the cost approach was \"virtually irrelevant,\" \"I gave it very little consideration,\" and when asked if he ruled out replacement cost as useless, he indicated \"I wouldn't say it was useless. But, I didn't get into it, really.\" He did not look at the plans and specifications of the Hotel. Mr. Hansen did not testify that a consideration of the cost approach would not provide the trial court with relevant evidence of market value. Mr. Hansen concluded in his written appraisal report that the Hotel as of January 19, 1978, had a market value of $23,000,000, almost $13,000,000 less than the $35,994,000 found by the trial court to be the market value of the Hotel.\n\nMr. Hansen testified that information on the cost to build the Hotel was not really useful to him because it became obvious that the operations of the Hotel did not justify the great amount of money that had been spent in building it. He indicated that the Hotel suffered from an extreme amount of functional obsolescence, even though it was almost brand new, because of its location. It was his opinion that if the same amount of money and resources had been spent on a similar resort hotel in Scottsdale, northeast Phoenix, or Paradise Valley, it probably would have done extremely well and there would not have been such a high degree of obsolescence.\n\nThe evidence did not show that owners or buyers of luxury hotel property comparable to the Hyatt Regency Phoenix rely solely upon the income approach, or the market approach. Nor does it show that they reject considerations of reproduction costs. For those reasons, Transamerica does not provide authority to exclude evidence of reproduction cost. Moreover, Prudential's own representatives testified that replacement cost is a common method used in estimating market value. Prudential's own appraisals of the Hotel are based in part upon cost of replacement.\n\nHRP's proof of replacement cost came through testimony of Charles D. Raines, a civil engineer who served as Mardian Construction Company's project manager on the Adams Hotel, which was built across the street from the Hyatt and at approximately the same time the Hotel was constructed. Using actual construction cost figures and applying a standard industry inflation factor for the increased cost of labor and materials, Mr. Raines estimated replacement costs as of January 1978 at $46,842,497, or more than $11,000,000 higher than the market value as of the same date determined by the trial court.\n\nThe construction cost figures Mr. Raines used as the basis of his calculations came from the testimony of Sam Shapiro during Phase III that the cost of building the Hotel during the period from 1974 to 1976 was approximately $39,000,000, of which some $13,500,000 was HRP's investment and the remainder the interim loan from UCB. The accuracy of Mr. Shapiro's figures was confirmed by the testimony of Merle Bird, a Price-Waterhouse audit partner, who had reviewed and summarized the books and records of HRP with respect to construction-related receipts and disbursements. Neither Mr. Shapiro's nor Mr. Bird's testimony regarding actual cost was disputed. Nor did Prudential offer any evidence of its own in Phase III to demonstrate that Mr. Raines' replacement cost estimate of $46,842,497 was in any way inaccurate.\n\nHowever, Prudential asserts that Mr. Raines' testimony was \"meaningless\" because in estimating the cost of replacement he made no \"deduction for depreciation.\" Prudential cites no cases and offers no support in the evidence for the proposition that a deduction for depreciation is required in estimating the replacement cost of a new luxury hotel or that the failure to make such a deduction precludes the admissibility of that evidence, rather than affecting its weight. We believe the omission is entitled to very little weight. Mr. Raines\n\nwas estimating the cost of replacing in January 1978 a hotel for which a permanent certificate of occupancy was issued only 14 months earlier and which had been occupied for only two years. Given the admittedly first-class permanent nature of the structure and appurtenances, the trial court could well have concluded that depreciation did not significantly affect the determination of replacement cost value.\n\nUnder the facts of this case, we agree with Prudential's statement that \"cost alone (either actual or replacement) may not support the trial court's findings of fair market value.\" We need not agree with HRP's assertion that \"Mr. Raines' estimate of a replacement cost of $46,842,497 was more than sufficient evidence to sustain the trial court's award -- without regard to any other evidence of damages presented at the trial below.\" The evidence of replacement cost is just that, evidence which is relevant to a determination of market value. Rule 401, Rules of Evidence. When, as here, the cost approach, income approach and market approach can be used, all three methods of estimating market value should be used to reach that determination. The different appraisal approaches may result in different estimates which must ultimately be correlated by the witnesses qualified to give those opinions, and ultimately by the trier of fact.\n\nIn this case, although Mr. Hansen did not use the cost approach, his market and income analysis led to widely differing conclusions which had to be correlated. For instance, in utilizing the market approach, he considered both the gross rent multiplier and per unit calculation and arrived at figures of $24,300,000 and $20,300,000 respectively. In considering the income approach, he used two methods of analysis reaching conclusions of $21,650,000 and $18,550,000 respectively. After correlation, his final opinion of market value is $23,000,000.\n\nThe record does not support the conclusion that the trial court adopted the reproduction cost of the Hotel as the basis for its finding of market value. The record supports the conclusion that the trial judge had before it reproduction cost evidence, market evidence, and income evidence from which it could find market value. The fact that Mr. Hansen, in using different methods to estimate market value, reaches dramatically different results does not preclude any of those methods or the resulting estimates from being considered as relevant evidence of market value. In the same vein, the reproduction cost of the Hotel should not be excluded from consideration as relevant evidence of the market value of the Hotel.\n\nWe conclude that the evidence of reproduction cost was properly received to be considered with other evidence of market value.\n\nPrudential's In-House Appraisals. HRP also presented evidence of the value of the Hotel based upon the income approach including four pre-litigation appraisals of market value prepared by Prudential's own in-house experts using both the income and the replacement cost methods of appraisal.\n\nThese appraisals are relevant for several reasons. First, they establish that Prudential relied upon both replacement and income methods as reasonable bases for estimating fair market value. Moreover, the appraisals themselves are probative because they were prepared by Prudential's in-house experts before this lawsuit and at a time when Prudential's incentive, as permanent lender, was to estimate conservatively the value of the security for its permanent loan. Prudential's policy, which it specifically applied in the case of the Hotel, was to loan no more than 75 percent of the value of the underlying security. Although Prudential dismisses the four appraisals as \"projections\" which reflect \"lender optimism,\" the appraisals are evidence of value for the Hotel which are from $7,000,000 to $10,000,000 higher than the $35,994,000 determined by the trial court. The appraisals were as follows:\n\n1. In September 1973, when Prudential was evaluating the loan commitment, Jack Condrey, Prudential's Phoenix Production\n\nOffice Manager and Senior M.A.I. Appraiser, and Mark Jorgensen, also a Prudential appraiser, appraised the then-value of the proposed Hotel at $32,675,000. The annual consumer price index inflation rate for the period 1973 to 1978 was approximately 6 percent. Mr. Raines testified that during the same period Phoenix construction costs rose nearly 50 percent. Applying the modest inflation rate indicated by the CPI, the value of the Hotel in January 1978, when foreclosure occurred, would have been $44,550,000.\n\n2. In May 1974, while the Hotel was under construction, Condrey and Jorgensen reappraised it, this time fixing a market value of $34,660,000. Projected through the CPI to January 1978, the market value would be $42,600,000.\n\n3. A third appraisal prepared by Condrey and Jorgensen, this one in April 1974, fixed the then-market value of Prudential's security at $36,430,000. Using the CPI, the value in January 1978 would be $44,770,000.\n\n4. Condrey's and Jorgensen's final appraisal in August 1975, less than six months before the Hotel opened, put the value at $36,812,000. Using the CPI, the market value at foreclosure would be $45,240,000.\n\nIn addition, sometime between November 1976 and June of 1977, after the Hotel was open for business and Prudential was being asked to fund the permanent loan, Charles Blenkhorn, manager of Prudential's Phoenix Production Office, stated he estimated the value of the Hotel at between $36,000,000 and $40,000,000. This statement was made in the context of considering whether Prudential should fund the permanent loan. Mr. Blenkhorn was of the opinion that Prudential should fund with the expectation that HRP would default and, in that event, acquire for $25,500,000 an asset worth, in his estimation, up to $40,000,000.\n\nThe appraisals are relevant evidence supporting the damage award made by the trial court. The fact that Prudential's trial expert, Mr. Hansen, made a less favorable appraisal of market value may be conflicting evidence but it does not render the evidence involving the four appraisals less than sufficient to support the court's damage award.\n\nIt is difficult to find valuation evidence exactly corresponding with the valuation date used in any given case. In Altschul v. Salt River Project, 14 Ariz. App. 306, 483 P.2d 47 (1971), a condemnation case, this court upheld the admission of evidence of a seven-year-old purchase of the subject property, stating that \"the lapse of time between purchase and taking goes to the weight to be attached to the purchase price, and not to its admissibility.\" 14 Ariz. App. at 308, 483 P.2d at 49.\n\nPrudential's in-house appraisals occurred during the five years preceding January 1978. In making his income approach analysis, Mr. Hansen utilized the actual income figures for 1976-78 in his 1979 report and testimony. He further projected income from the operation of the Hotel for the years 1979-83. He considered 1983 to be \"the optimum year.\" Mr. Hansen concluded that the Hotel \"as opposed to a mature hotel, will continue to improve probably for several more years [after 1978], and then it's going to hit a point [1983] that it will do as good as it will do.\" In considering the appraisals of the Hotel made by Prudential before the valuation date, the actual cost of the Hotel, and the projections of income after the date of value, we can secure some guidance from Grossman as to valuing new and mature income-producing properties:\n\nIn Maricopa County, the initial valuation of a new shopping center is done by the cost method. The third method, the income approach, is frequently used after a shopping center has been in operation long enough to make this method feasible.\n\nGrossman v. Westmoreland II Investors, 123 Ariz. at 224, 599 P.2d at 180. In this case where the Hotel was in transition from new to mature, it was no less appropriate to admit as evidence appraisals before the date of value than it was to admit\n\nestimates of income after that date. All of this evidence was submitted to the trial court sitting without a jury and the trial court can be presumed to have accorded the evidence its proper weight.\n\nWhere there is conflicting evidence as to disputed facts or the reasonable inferences to be drawn from those facts, this court has held it will not substitute its opinions for the findings of the trial court. Johnson v. Orcutt, 92 Ariz. 295, 376 P.2d 557 (1962); Van Emden v. Becker, 6 Ariz. App. 274, 431 P.2d 915 (1967). This rule is founded upon the theory that the trial court, having seen and heard the witnesses and the evidence, is in a better position to determine credibility and weight than the appellate court. Cavazos v. Holmes Tuttle Broadway Ford, Inc., 104 Ariz. 540, 543, 456 P.2d 910, 913 (1969). For this reason, where there is conflict in the evidence, the lower court's findings will be accepted. Id.\n\nOwner's Opinion of Value. Prudential strenuously contends that Sam Shapiro improperly opined as to the value of the Hyatt Regency Phoenix and that the trial court's award cannot be sustained on the basis of such testimony. This position is contradicted by a long and unbroken line of Arizona cases recognizing the right of an owner to give his opinion of the value of his property. Atkinson v. Marquart, 112 Ariz. 304, 541 P.2d 556 (1975); Acheson v. Shafter, 107 Ariz. 576, 490 P.2d 832 (1971); Board of Regents v. Cannon, 86 Ariz. 176, 342 P.2d 207 (1959); Jowdy v. Guerin, 10 Ariz. App. 205, 457 P.2d 745 (1969); City of Tucson v. LaForge, 8 Ariz. App. 413, 446 P.2d 692 (1968); State ex rel. Herman v. Lopez, 8 Ariz. App. 61, 442 P.2d 884 (1968); Schatt-Ajax Industries v. Churchill, 3 Ariz. App. 34, 411 P.2d 457 (1966).\n\nMr. Shapiro was HRP's lead witness in both Phases II and III of the trial. He testified and was cross-examined at great length about his involvement in the development and construction of the Hotel. Mr. Shapiro testified that he was the general partner of HRP principally responsible for planning and construction. Mr. Shapiro's involvement in the Hotel was much more extensive than the title \"general partner\" might in and of itself convey. It was Mr. Shapiro who conceived the plan to build a luxury hotel in downtown Phoenix. He had previously been intimately involved with other major downtown Phoenix real estate projects and was involved at every significant step in carrying out the complex Hotel undertaking. He purchased the land in 1970 and participated in negotiations for interim and permanent financing on the project. His group hired consultants to study the feasibility of the project and engaged the architect who designed the building and the construction company that built it. Mr. Shapiro selected the Hyatt Corporation to manage the Hotel and, in the process of making that selection, he investigated Hyatt hotels in other cities. When construction commenced, he was responsible for paying all bills incurred in erecting the 734-room structure.\n\nBased on this personal knowledge, Mr. Shapiro estimated the value of the Hyatt at $43,800,000 as of January 1978. This estimate was based upon the amount of money HRP had invested in the project plus UCB's interim loan, adjusted by an appreciation figure based upon the Consumer Price Index. He also took into account other factors, such as the anticipated increase in Hotel income, the location of the Hotel, including its proximity to the convention center and airport, and the growth of the Phoenix area. He did not put a monetary value on these factors.\n\nPrudential argues that Mr. Shapiro's opinion was nevertheless inadmissible because (1) he was not an \"owner\" within the meaning of the rule; (2) the owner-opinion rule has been overturned by rules 602 and 701, Rules of Evidence; and, (3) Mr. Shapiro lacked actual knowledge about the value of the Hotel. Each of these contentions will be dealt with in turn.\n\n(1) Prudential asserts that a shareholder or officer of a corporation is not an \"owner\" for the purposes of testifying as to value. However, Mr. Shapiro was a general partner in HRP in his own right and he was an officer, director and shareholder\n\nof Nametco, one of the general partners in HRP. The Arizona Supreme Court has held that a non-expert officer, director, and shareholder of a corporation may testify as to the valuation of corporate property. In Atkinson v. Marquart, 112 Ariz. 304, 307, 541 P.2d 556, 559 (1975), the court stated:\n\nThe sole evidence presented on the valuation of the corporation's loss of good will was by appellee Marquart. As an officer, director, and shareholder of the corporation Marquart could be considered an owner. It is well established that an owner may estimate the value of his real or personal property whether he qualified as an expert or not. Acheson v. Shafter, 107 Ariz. 576, 490 P.2d 832 (1971). The fact that an owner may not be an expert goes to the weight of the testimony and not the competency. Jowdy v. Guerin, 10 Ariz. App. 205, 457 P.2d 745 (1969).\n\nAccord, Denver Urban Renewal Authority v. Berglund-Cherne Co., 193 Colo. 562, 568 P.2d 478 (1977) (officer and majority stockholder was competent to testify as owner to value of property).\n\nPrudential seeks to diminish Atkinson's significance by observing that the Arizona Supreme Court failed to cite any authority for the proposition that an officer, director, or shareholder is considered an owner and by noting that the issue was not briefed. However, the Supreme Court's finding that an officer, director, or shareholder of a corporation could be considered an \"owner\" is crucial to and part of the court's holding, because, were it otherwise, Marquart would not have been deemed an \"owner,\" the evidence of valuation given by him would have been inadmissible, and the judgment could not have been sustained.\n\nPrudential further attempts to distinguish Atkinson because it involved valuation of goodwill rather than real property. However, this ignores the court's very language in Atkinson that an owner is always entitled to \"estimate the value of his real or personal property whether qualified as an expert or not.\" Moreover, to permit an owner to value corporate goodwill -- inherently a more subjective and elusive concept than the value of tangible assets -- a fortiori establishes the propriety of Mr. Shapiro's testimony as to the value of the Hotel.\n\nFinally, in Prudential's view, Atkinson rests upon the fact that the corporate officer was familiar with the business, whereas here, Prudential claims, Sam Shapiro had no knowledge of the Hotel's \"fair market value.\" But replacement cost, which in turn is based upon the cost of construction, is evidence of fair market value, and Mr. Shapiro testified in detail and on personal knowledge about the cost of building the Hotel, as well as its prospects as a successful business enterprise in a rapidly growing metropolitan area. Nothing in the owner-opinion rules requires that the owner be an expert appraiser or acquainted with the technique of the income approach to valuing hotel property used in expert appraisals. Mr. Shapiro was familiar with what it would cost to replace the Hotel, and also with the future prospects of such an establishment. That familiarity was more than sufficient to meet any personal knowledge requirement set by the Atkinson case.\n\n(2) Prudential argues that rules 602 and 701, Rules of Evidence, have overruled Atkinson v. Marquart. Rule 602 provides that a witness may not testify to a matter unless evidence is introduced that the witness has personal knowledge of the matter. Evidence to prove personal knowledge may consist of the testimony of the witness. Rule 701 provides as follows:\n\nIf the witness is not testifying as an expert, his testimony in the form of opinions or inferences is limited to those opinions or inferences which are (a) rationally based on the perception of the witness and (b) helpful to a clear understanding of his testimony or the determination of a fact in issue.\n\nReading rules 602 and 701 together and noting that a witness' opinions must be supported by personal knowledge, Prudential asserts that: \"There is no evidence whatever that Sam Shapiro had any direct personal knowledge as to the market value\n\nof the Hyatt Regency Phoenix.\" On the contrary, the record reflects that Mr. Shapiro had personal knowledge concerning the cost and future prospects of the Hyatt Regency, and his opinion as to value is permitted by the rules. That testimony was based upon personal knowledge (Rule 602), was rationally based upon his perception of the facts, and was helpful in the determination of the value issue (Rule 701). The trial court had to determine the weight to give to Mr. Shapiro's testimony.\n\nAs a managing general partner of HRP, Mr. Shapiro had personal knowledge of the quality, cost, and condition of the Hotel. From this familiarity, based upon personal knowledge, the law presumes that the owner of the property has an idea of its value. M. Udall, Arizona Law of Evidence § 120 (1960).\n\n[I]t is well established law that an owner of property is always competent to testify as to its value . . . Any explanation of how he arrived at that value goes to the weight of his evidence.\n\nBoard of Regents v. Cannon, 86 Ariz. 176, 178, 342 P.2d 207, 209 (1959).\n\nThe Arizona cases uniformly confirm that the valuation process is not solely the province of expert witnesses. An owner of property has, by definition, knowledge of the components of value that are useful in ascertaining value, and an owner, no less than an \"expert,\" can base his opinion of value on that knowledge. The adoption of the Rules of Evidence has not changed this rule. See 1 M. Udall \u0026 J. Livermore, Arizona Practice: Law of Evidence § 21 at 25-27 (2d ed. 1982).\n\n(3) Prudential's final argument focuses upon the doctrine that \"where the owner has no knowledge of the value about which he expresses an opinion, the presumption arising from ownership is overcome and the opinion may be inadmissible.\" M. Udall, Arizona Law of Evidence § 120 at 258 (1960). Prudential then asserts that Mr. Shapiro's opinion of value -- based upon personal knowledge of construction costs and the overall enterprise -- was not his own opinion at all but someone else's. There is no support in the record for this assertion. Mr. Shapiro stated how he arrived at his opinion on value:\n\nQ Mr. Shapiro would you tell the Court and counsel how you arrived at a value of $43,800,000?\n\nA I took the $13,500,000 that we put in it, added to that the $25,500,000 that we borrowed from UCB, and added to that the appreciation and value based upon the CPI of 6 percent and came up with that figure, $43,800,000.\n\nQ When you refer to CPI, are you referring to the Consumer Price Index?\n\nA Yes.\n\nQ You used the figure of appreciation of 6 percent a year?\n\nA Six percent, yes.\n\nQ For two years?\n\nA Two years.\n\nQ And that is how you arrived at the value?\n\nA Yes.\n\nMr. Shapiro identified this as his own opinion. There is no evidence from cross-examination of Mr. Shapiro or elsewhere in the record that the estimate of value was not his own.\n\nAtkinson v. Marquart, 112 Ariz. 304, 541 P.2d 556 (1975), provides that a damage award may be based on an owner's opinion of value standing alone. Mr. Shapiro's opinion that the Hotel property was worth $43,800,000 was thus evidence of value to support the trial court's more modest finding, and affirmance of the judgment based upon that finding.\n\nIn summary, HRP placed before the trial court three separate and independent theories with evidence to support them on which a damage award higher than the one determined by the court could properly have been based. Evidence on one of these theories, replacement cost, was essentially uncontradicted. The mere fact that the Hotel's market value could not be calculated with precision is not a ground for objection since damages are\n\noften difficult to calculate. If the plaintiff has suffered some injury:\n\n[A] more liberal rule should be applied in allowing the court or jury to determine the amount of the damage than should be applied in weighing evidence on the question of whether or not the acts complained of will result in any damage at all to the party upon whom rests the burden of proof.\n\nJacob v. Miner, 67 Ariz. 109, 116, 191 P.2d 734, 738-39 (1948).\n\nNor does the fact that a reviewing court cannot determine the precise formula used by a trial court in arriving at the amount of damages justify reversal if there is competent evidence to support the amount of the actual award. Grummel v. Hollenstein, 90 Ariz. 356, 360, 367 P.2d 960, 963 (1962). This is so because the amount of an award for damages is a question peculiarly within the province of the trier of fact. Acheson v. Shafter, 107 Ariz. 576, 490 P.2d 832 (1971), especially where there has been an expert testimony on the issue of damages. See Harris Cattle Co. v. Paradise Motors, Inc., 104 Ariz. 66, 69, 448 P.2d 866, 869 (1968).\n\nSince there is substantial evidence from which reasonable people could have found for HRP in the amount in question, the trial court's judgment must be affirmed. Circle K Corp. v. Rosenthal, 118 Ariz. 63, 69, 574 P.2d 856, 862 (App.1977); Fousel v. Ted Walker Mobile Homes, Inc., 124 Ariz. 126, 130, 602 P.2d 507, 511 (App.1979); United Security Corp. v. Anderson Aviation Sales Co., Inc., 23 Ariz. App. 273, 532 P.2d 545 (1975).\n\nRemarks of the Trial Judge. The main thrust of Prudential's argument on damages is directed not to the sufficiency of evidence, which we have determined is adequate to support the judgment, but to a claim that Prudential is entitled to a new trial on damages because the trial court used an \"improper\" method of calculating damages. This attack does not rely upon the judgment or the trial court's findings of fact and conclusions of law but upon remarks made by the trial judge during the hearing on a number of post-trial motions, some two months after the trial court had made its findings of fact including the determination of damages.\n\nThe remarks as quoted by all parties are:\n\nMR. IRISH [for Prudential]: Judge, before we go on, you did make a comment a moment ago about the mathematics you were talking about. I don't wish to be sandbagged on appeal by the other side suggesting I didn't take you up on your proposal because I'm not sure that I agree that you are entitled to play with the math as you may have done it. So I think maybe to make it clear on the record, tell us how you did it.\n\nTHE COURT: I would be happy to.\n\nAgain, accepting my finding of fact number 5, without going back now and reviewing Hansen's testimony, I'm not sure what rate -- what else do you call it? The gross rent multiplier rate, I'm not sure without looking back all through his testimony. He testified gross room revenue times 3, 4 or 5, hotel management is very important. He used a 4.5 gross room multiplier, 3 to 5, I think that's what he testified to, that he used a gross room multiplier of 4.5 in arriving at his conclusions. I felt under the circumstances that accepting his testimony that 5 was the maximum you would use, this hotel was entitled to that, the use of the figure 5. I further felt that it was inappropriate under the testimony -- I probably won't get to everything I took into consideration here, but this is the bottom line.\n\nThe testimony was that it was going to take some period of time for this hotel to get through the, what is called the initial shakedown period; is that what it was called -- to arrive at its potential. I felt the willing seller and willing buyer would look at that potential. And that a willing seller would not sell something that had the potential it appears that this hotel had, for the value he arrived at and the manner he arrived at it.\n\nAnd I felt a willing buyer would be willing to pay a somewhat higher figure\n\nbecause of the potential of the hotel than he would if this is it, it's final, it's finished and this is the way it is going to be here on and forever.\n\nIf you look at page 50 of Mr. Hansen's report -- and I'm getting there too quickly.\n\nPage 27 of his report, he shows the optimum year to be 1983, and shows, according to my mathematics, you can extend it out, the cap rate -- or, I keep calling it the gross room multiplier, by $37,938,960. I rounded that to $37,939,000. I deducted therefrom, according to Mr. Hansen's calculations on page 50 of his report the figure $1,945,000 which appeared appropriate to me. And following his mathematics was the less present worth of the furniture, fixtures and equipment payments, and arrived at the figure of $35,994,000. That's my mathematics. That's how it was reached.\n\nI felt the hotel, being what it was, a first class operation, that it was entitled to the maximum gross room multiplier, whatever gross rent multiplier, I felt that a willing seller again would not sell for what he, using Hansen's figures, and a willing buyer would be willing to pay an increase of what the hotel might be worth, isolated on that particular date because of the potential of the hotel. And that's how the figure came up.\n\nMR. IRISH: Thank you.\n\nMR. MEYERS [for HRP]: Your Honor, I think if it does, and the court has been explicit in responding to Mr. Irish, we would not want the record to reflect that what Your Honor has stated today with respect to how the value was arrived at are all of the factors that you considered.\n\nTHE COURT: They are not. They are not. But that's the final bottom line figure. I've got figures here that you can see for yourself. The figuring I had done, using different -- everything, and I was consistently coming up with a figure in that general category, using all my different calculations from the testimony. But that's how the final figure was arrived at.\n\nI've got figures in here, here's one, $39,280,000, $37 million some odd, and some other figure, $38 million some odd. Another figure, $37 million some odd. There is one that's $41,241,000. The figures are all coming up consistently in that general area. That's how I calculated the final actual figure.\n\nMR. MEYERS: Your Honor, we think the record should reflect that the court did not mean to imply that it did not consider all of the evidence on value, and in fact the other evidence of Prudential's appraisals and replacement costs and the testimony of Mr. Shapiro in fact --\n\nTHE COURT: All these other figures, that's what everything is based on, counsel, all the evidence. I was figuring and calculating so much that I even wore out the batteries on my calculator and I had to buy new batteries. The figures were all coming up in the -- the majority of figures were coming up in the general vicinity based on all the evidence. And to arrive at the final figure, I'm not just pulling a figure out of the air, that was the actual math that I followed to arrive at the final figure.\n\nPrudential in its brief claims that this method of calculation used by the trial court was erroneous:\n\nThe court erred by marrying the gross rent multiplier technique with the capitalization of future income method; the court did not utilize Hansen's extension to 1981. Rather, with no evidence base whatsoever, it applied a gross rent multiplier to the 1983 projected per room income, not to current income . . . . The obvious fallacy in the court's approach is that capitalization of future income accounts for the need to discount future income to present value. A gross rent multiplier assumes application to present income, however, and therefore there is no need to discount. In effect, the court determined the value of the hotel in 1983.\n\nPrudential is correct. However, it is evident that the court's brief remarks did not reflect the full scope and extent of its\n\nreasoning on the damages issue, nor were they so intended. On the contrary, the substance of the court's official rulings is contained in the findings of fact and conclusions of law. Nothing in these findings or conclusions, and nothing in the judgment, ties the court's ultimate determination of value exclusively to that particular methodology.\n\nIt is critical at the outset to make clear just what the judge below said -- and did not say. The court's remarks plainly show that in fact not one but a number of alternative approaches were used to determine market value.\n\nThe first fact to be noted is that the trial court used its determination of market value on several estimates derived from all the evidence in the case. He did not determine value solely or even principally by use of the \"gross rent multiplier\" technique. The trial judge carefully stated that he made at least five other estimates of value ranging between $37,000,000 and $41,000,000. These figures are in the same neighborhood with the evidence admitted during trial.\n\nThe trial court did not explain the exact process by which it had derived each of the five estimates. But the court certainly had no obligation to do so. The judge's remarks are incomplete in the sense they do not make explicit all the assumptions and formulae he used in making his numerous estimates of value. But the fact that a reviewing court cannot determine the precise formula the trier of fact used in assessing damages does not justify reversal if there is competent evidence to support the actual award. Grummel v. Hollenstein, 90 Ariz. 356, 367 P.2d 960 (1962).\n\nA consistent line of Arizona Supreme Court cases establishes that a litigant may appeal from a judgment, but not from separate remarks or statements of a trial judge outside the judgment or formal findings, and may not assign the remarks or statements as error:\n\nAt the outset it is well to determine on what record the validity of the judgment in question is to be decided. Plaintiff Schwartz bases several assignments of error, and much of his argument, upon loose statements appearing in a \"Memorandum Opinion\" -- which was the medium used by the trial judge in announcing his decision -- rather than attacking specific findings of fact or conclusions of law made by the trial court at the time judgment was entered. The law is settled in this jurisdiction that a memorandum opinion of the trial judge cannot form the basis of an assignment of error . . . . We shall therefore ignore any assignments, or arguments, predicated upon statements appearing only in the memorandum opinion.\n\nSchwartz v. Schwerin, 85 Ariz. 242, 245, 336 P.2d 144, 146 (1959). The court in Schwartz invoked Robinson v. Herring, 75 Ariz. 166, 168, 253 P.2d 347, 349 (1953), which holds that memorandum opinions are \"no part of the record on appeal and therefore cannot form the basis for error\"; and Ollason v. Glasscock, 26 Ariz. 193, 199, 224 P. 284, 286 (1924), where the Supreme Court summarily dismissed assignments of error \"predicated upon the expressions of the trial court in its written opinion,\" saying that \"such opinion does not properly constitute any part of the record on appeal, and is in no sense an order from which an appeal will lie.\"\n\nIf, as Schwartz and its predecessors teach, a memorandum opinion may not be assigned as error, a fortiori, a trial court's spontaneous and incomplete remarks taken down by the court reporter may not be so assigned when made at a hearing conducted more than 60 days after completing the deliberative process by which he arrived at his decision, and where the trial judge summarized in part but one of the methods he used for analyzing value. He did not purport to explain his actual deliberative process at all. He did no more than advert to this and other methods and figures he also used in making his final decision on market value. The issue is not whether the value established in the trial court's findings could have been based on an improper method of calculation. Rather, under\n\nSchwartz and its predecessors, the issue is whether credible evidence in the record supports that finding.\n\nA trial judge's ruminations on the record, even when incorrect, are an insufficient ground on appeal to set aside the judgment entered in the trial court where there is sufficient evidence in the record to support the findings of fact and the judgment. Appeals lie from findings of fact, conclusions of law, and judgments, not from ruminations of the trial judge.\n\nC. The Claimed Interest Deduction.\n\nIn its opening brief, Prudential argues that the trial court erred in refusing to subtract UCB cost, interest and fee liens from fair market value in addition to the principal amount of the UCB loan, $25,500,000. Prudential asserts that the rest of the lien foreclosed in January 1978 at the sale in the amount of $5,286,898 should be further deducted. In its reply brief, Prudential appears to have reduced its claim by asserting that it is entitled to deduct the interest on the loan which had accrued up to the time of foreclosure in the amount of $3,712,500. It maintains that pursuant to the UCB construction loan documents, the accrued interest is part of the construction loan and was secured by the lien of that construction mortgage. Its position is that \"[t]his interest charge, accruing because of HRP's default, was as much a part of the loan as the portion of the $25.5 million that was sell-cannibalizing interest. It should also have been deducted in arriving at net damages.\"\n\nPrudential's sole authority is F.B. Collins Inv. Co. v. Sallas, 260 S.W. 261 (Tex.Civ.App.1924):\n\n[T]he measure of liability is the difference in the lien indebtedness, principal and interest and the value of the land at the time it is lost by reason of foreclosure of such lien.\n\n260 S.W. at 265.\n\nPrudential misconstrues the law of contract damages. The Supreme Court of Arizona has held:\n\nThe familiar aim of compensatory contract damages, the computation of which is hardly an exact science, . . . is to yield the net amount of the losses caused and the gains prevented by the breach of contract, . . .\n\nA.R.A. Mfg. Co. v. Pierce, 86 Ariz. 136, 141, 341 P.2d 928, 932 (1959). The court in A.R.A. adopted § 329 of the Restatement:\n\n§ 329. Compensatory Damages for Substantial Injury.\n\nWhere a right of action for breach exists, compensatory damages will be given for the net amount of the losses caused and gains prevented by the defendant's breach, in excess of savings made possible, if established in accordance with the rules stated in §§ 330-346.\n\nRestatement of Contracts § 329 at 503-04 (1932).\n\nThe value of HRP's lost equity was easily determined once the value of the Hotel was determined. In order to place HRP in the position it would have been in had Prudential funded the permanent loan and the Hotel then sold at its fair value, HRP had to be awarded the value of the Hotel as found by the Court, reduced by the full amount of all expenses and obligations that were saved or prevented by the breach. See A.R.A. Mfg., supra.\n\nThe situation in this case is quite straightforward in terms of these rules. What HRP lost in January 1978 as a result of Prudential's failure to fund was the Hotel. The market value of the Hotel, in light of the Court's Phase III rulings, established the outside limit of \"the losses caused and the gains prevented by [Prudential's] breach of contract.\" In accordance with A.R.A. Mfg. and the Restatement, HRP's damages can then be reached by deducting from that market value the savings to HRP caused by Prudential's failure to fund the permanent loan.\n\nThe only \"savings\" that occurred by reason of Prudential's failure to fund was the elimination of HRP's $25,500,000 loan indebtedness to UCB as a result of UCB's foreclosure. This was the sum that HRP then owed UCB, and would have owed Prudential\n\nhad the permanent loan funded. Because the result of Prudential's breach was a foreclosure proceeding that eliminated HRP's obligation on the $25,500,000 interim loan from UCB, this was a $25,500,000 savings that must be deducted from the value of the Hotel as of January 1978.\n\nThe unpaid UCB interest claim is an altogether different matter. HRP was not spared payment of this claim as a result of Prudential's breach. HRP contracted with UCB to satisfy the unpaid interim interest obligation on the construction loan by assigning a one-half interest in HRP's recovery in this lawsuit out of any damages awarded up to $10,000,000 -- in other words, to satisfy the UCB interest claim, HRP will realize a recovery of only $.50 on every dollar of any recovery up to $10,000,000. This interest indebtedness was not subtracted from HRP's recovery. This determination by the trial court was correct because Prudential's breach of contract did not save HRP from that obligation.\n\nIn support of its position, Prudential cites F.B. Collins Inv. Co. v. Sallas, supra, which does indeed hold that interest on lien indebtedness must be subtracted from the value of the land only because the breach of contract resulted in a discharge of the interest obligation. No discharge occurred here and by a parity of reasoning the opposite rule applies. Research has disclosed no case law holding that interest on a lien indebtedness, undischarged by a contract breach, should be deducted together with the lien amount from the market value of property lost on account of that breach. Such a rule makes no sense and would defeat in an entirely arbitrary fashion the purpose of awarding contract damages in the first place. Indeed, in this case it would result in a penalty to HRP, the injured party, by requiring it to pay the UCB interest obligation twice, once to UCB, and in a windfall to Prudential, the breaching party, in a like amount.\n\nVIII. THE CROSS-APPEALS\n\nUCB has cross-appealed and raises a number of issues alleging that the trial court erred in dismissing certain of its claims for failure to state a claim, in dismissing claims sounding in tort for breach of the implied duty of good faith and fair dealing, in dismissing UCB's fourth claim for relief for punitive damages, in dismissing UCB's claim for interference with contractual relations, and claims relating to the measure of damages awarded to it.\n\nThe cross-appeal is conditional in nature. If this court reversed in whole or in part the judgment, UCB put forward the issues on cross-appeal for review. If this court affirmed the judgment, UCB agrees to forego its cross-appeal. Since we have affirmed the judgment of the trial court, we deem UCB's cross-appeal as withdrawn.\n\nHRP in its cross-appeal raises six separate issues, five of which are wholly conditional in nature. It claims that the trial court erred in excluding evidence regarding lost profits, in excluding evidence relating to reliance damages, in excluding testimony by two of HRP's expert witnesses which the trial court concluded had not been appropriately disclosed pursuant to rule 26(e), Rules of Civil Procedure, in holding that Prudential had not waived the attorney-client privilege during the trial proceedings, and in determining that HRP's fraud claims did not state a claim for relief.\n\nThis cross-appeal is conditional in nature. If this court reversed in whole or in part the judgment, HRP put forward the issues on cross-appeal for review. If this court affirmed the judgment, HRP agrees to forego its cross-appeal. Since we have affirmed the judgment of the trial court, we deem HRP's cross-appeal as withdrawn.\n\nHRP, however, does raise one issue without condition.\n\nA. Prejudgment Interest.\n\nThe formal judgment entered on August 29, 1979, awards HRP the sum of $10,494,000. The trial court refused, however, to award HRP interest on this sum from the date of UCB's foreclosure of its deed of trust on January 18, 1978, to the date of the entry of the judgment. Rather, interest\n\non the total judgment runs only from the date of its entry.\n\nHRP acknowledges that the amount was unliquidated and that if the unliquidated damages rule applies, it is not entitled to prejudgment interest. However, it contends that this limitation has been eroded in various areas and should now be abandoned in contract.\n\nAlthough HRP makes persuasive arguments, it is clear that prejudgment interest is not permitted in Arizona on unliquidated amounts. Schwartz v. Schwerin, 85 Ariz. 242, 249-50, 336 P.2d 144, 148-49 (1959); Fogleman v. Peruvian Associates, 127 Ariz. 504, 622 P.2d 63 (App.1980).\n\nThe judgment of the trial court denying HRP prejudgment interest is affirmed.\n\nB. Increase in Interest Rate.\n\nThe judgment in favor of HRP and UCB was entered by the trial court on August 29, 1979. It provided for interest at the rate of six percent. Prudential filed its notice of appeal on September 25, 1979. On December 14, 1979, the Governor approved an amendment to A.R.S. § 44-1201(A) to increase the interest for a \"legal indebtedness\" from six to ten percent per annum.\n\nThis \"second\" appeal, 1 CA-CIV 5459, which has been consolidated with 1 CA-CIV 5135, arises because of that amendment.\n\nHRP and UCB sought leave from this court to file a rule 60 motion in the Superior Court to modify the judgment. This court granted the motion and revested jurisdiction in the Superior Court for the limited purpose of allowing HRP and UCB to file their motion to modify judgment. The motion to increase interest after the effective date of the amended statute was made in the trial court which was denied by formal written order. This separate appeal resulted. The issue was exhaustively briefed by HRP and Prudential.\n\nAfter the briefs were filed, the Supreme Court decided McBride v. Superior Court, 130 Ariz. 193, 635 P.2d 178 (1981), which disposes of this issue. The Supreme Court indicated:\n\nWe believe that interest upon a judgment is a statutory and not a contractual obligation, and when the interest rate was changed by statute, the rate of interest on the judgment was also changed.\n\nThe defendant [sic] is entitled to 6% interest from the date of the judgment until 14 December 1979 and 10% interest thereafter. We hold that when the statute was changed, the legal rate of interest also changed, and that the interest rate stated in the judgment by statute is, absent specific agreement to the contrary, subject to later modification by statute.\n\n130 Ariz. at 194, 635 P.2d at 179. We have not been informed that there has been any agreement by the parties to the contrary. Therefore, the judgment has been modified by operation of law to include the amendment by statute.\n\nIX. CONCLUSION\n\nThis was a protracted and hard-fought trial. Some 20 months transpired from the date opening statements were given in Phase I until the final post-trial motions were decided. The trial and hearing transcripts cover 110 volumes, and innumerable exhibits.\n\nThe record before this court abundantly documents that the trial court demonstrated great patience and provided a fair trial to the parties, without the commission of error justifying reversal and retrial.\n\nThe judgment is affirmed.\n\n\u003cspan class=\"fn\"\u003e1. The investment group making up HRP consisted of Sam Shapiro, Barry Shapiro, Esq., Lawrence J. Shapiro, M.D., Michael J. Haskes, Ben Klimist, Joseph H. Filner, Southwestern Alloys Corp., and Nametco Corp.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The original loan amount was later increased to $25,500,000 by an amendment to the commitment letter.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The additional two parties to the agreement are Nametco Corp. and National Properties which, along with HRP Hotel Company, are referred to jointly as HRP.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Mr. George Bremer, a 30-year employee of Prudential and its general investment manager, who was responsible for negotiating the loan with HRP, testified: Q There is nothing about condition 2 that is confusing or unclear to you, is there? A No. . . . . Q . . . Is it your understanding condition 2 required title insurance? A Yes, sir. . . . . Q BY MR. GORDON: What does the condition relate to besides title insurance, if anything? . . . . THE WITNESS: It is my opinion that condition number 2 requires a first lien or an unencumbered lien on the real estate. With further reference to condition 2, one of the attorneys for Prudential later indicated in argument \"I wish I didn't have the Wheeler letter [of May 1, 1975] to deal with, because it says it [the policy approved by Prudential] meets condition 2 . . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. In argument during Phase I, counsel for Prudential took the following position regarding condition 9: We are not asking for title insurance on fixtures [pursuant to condition 9]. We are asking for the letter of what that thing says, a valid first lien on fixtures, and there was no way it could be delivered, because there were mechanics' liens on the fixtures.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. § 20-1591. Forms of policies and other contracts of title insurance. Every title insurer shall file with the director all forms of title policies and other contracts of title insurance before the same shall be issued. Any such filing may be made by a title insurance rating organization in behalf of all of its members or subscribers. In no event shall any title insurer issue any such form of policy or contract until thirty days after it shall have been filed with the director unless it shall have received earlier approval by the director. Unless the director shall disapprove a form of title policy or contract of title insurance within thirty days from the date of its filing, such filing shall be deemed to have been approved. Forms of title policies and other contracts of insurance, as used in this section, shall specifically exclude: 1. Reinsurance contracts or agreements, 2. All specific defects in title that may be ascertained from an examination of the risk and excepted in such reports, binders or policies together with any affirmative assurance of the title insurer with respect to such defects whether given by endorsement or otherwise, and 3. Such further exceptions from coverage by reason of limitations upon the examination of the risk imposed by an applicant for insurance or through failure of an applicant for insurance to provide the date requisite to a judgment of insurability.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. § 20-1565. Additional powers A. A title insurer may provide any other services reasonably related to the land title business and may engage in any other business not inconsistent with the business of issuing title insurance policies which may be authorized by its corporate charter, but only if such services and businesses are not prohibited to it by this title. B. Neither a title insurer nor a title insurance agent shall engage in the business of guaranteeing the payment of the principal or the interest of bonds or other obligations.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The answering brief by UCB, which is joined in by HRP, does not refer at all to the Restatement or the Leiter case and refers to Arizona Title only in a footnote comment.\u003c/span\u003e\n\n",
    "body_length": 255482,
    "citedas": [
      "681 P.2d 390",
      "140 Ariz. 238"
    ],
    "attorneys": "Lewis \u0026 Roca by John P. Frank, Douglas L. Irish and Andrew S. Gordon, Phoenix, for The Prudential Ins. Co. of America. Martori, Meyer, Hendricks \u0026 Victor by Edwin F. Hendricks, Andrew D. Hurwitz, James E. Scarboro and Randall C. Nelson, Law Offices of Donald D. Meyers, Phoenix, for Nametco, HRP Hotel Co., Sam Shapiro, Barry Shapiro, Lawrence J. Shapiro, Michael Haskes, Ben Klimist and Joseph H. Filner. Streich, Lang, Weeks \u0026 Cardon by Dan M. Durrant, William S. Hawgood, II, and Louis A. Stahl, Phoenix, for United California Bank.",
    "category": [
      "213"
    ],
    "judges": "Corcoran, Judge. Ogg, P.J., and Froeb, J., concur.",
    "citation_count": 97
  }
}
