{
  "id": "3ITQPmYBTlTomsSBNnim",
  "document": {
    "title": "In re Asbestos Litigation",
    "full_title": "IN RE ASBESTOS LITIGATION; JAMES FLANAGAN; DAVID H. MIDDLETON; KENNETH SMITH; EDEE COCHRAN; ESTEBAN YANEZ ORTIZ; JOHN R. ALLGOOD; HENRY WILLIAM EVERS; LESTER EUGENE TAYLOR; PLANT INSULATION COMPANY; SAFETY NATIONAL CASUALTY CORPORATION VERSUS GERALD AHEARN; JAMES MCADAMS DENNIS; CHARLES W. JEEP; JAMES DRAKE; JAMES ELLISON; ROLAND DEARBORN; JUDITH DEARBORN; KERWIN BUTCHER; DIR., WORKERS COMP., DIRECTOR, OFFICE OF WORKERS' COMPENSATION PROGRAMS, U.S. DEPT. OF LABOR; PAUL COCHRAN; IDA BECK; MARION BEHEE; LONGSHORE INTERVENOR; WILLIAM JAMES MITCHELL; FIBREBOARD CORPORATION; BETHLEHEM STEEL CORPORATION; CONTINENTAL CASUALTY COMPANY; PACIFIC INDEMNITY; FRANCIS MCGOVERN; OWENS-ILLINOIS, INC; PENN MUTUAL LIFE INSURANCE COMPANY; COLUMBIA CASUALTY COMPANY; CNA CASUALTY COMPANY OF CALIFORNIA; CELOTEX CORP., DANIEL HERMAN RUDD, JR., ON BEHALF OF THEMSELVES AND OTHERS SIMILARLY SITUATED; BEVERLY WHITE, ON BEHALF OF THEMSELVES AND OTHERS SIMATED; JOHN HANSEL, ON BEHALF OF THEMSELVES AND OTHERS SIMILARLY SITUATED; .",
    "jurisdiction": "Fifth Circuit",
    "date": "1996-07-26T00:00:00.000Z",
    "docket": "Nos. 95-40635 \u0026 95-40694",
    "body": "DAVIS, Circuit Judge:\n\nIn this consolidated appeal, we consider a number of challenges to the district court's approval of a class settlement of future asbestos victims with Fibreboard along with several related settlements. For the reasons that follow, we affirm the district court's judgment.\n\nI. BACKGROUND\n\nA. Procedural and Factual History\n\nFibreboard, primarily engaged in the timber business, also manufactured asbestos-containing products from 1920 until 1971. By the late 1980's, asbestos-related personal injury and death claims against Fibreboard numbered in the tens of thousands. At that time Fibreboard had approximately $100 million in hard insurance assets available to pay these claims. It also had disputed coverage claims against two of its insurers, Continental Casualty Company and Pacific Indemnity. These coverage claims ultimately played a key role in the class settlement.\n\nContinental issued a general liability policy to Fibreboard in 1957 which remained in force for two years. Although the policy had no aggregate limit, it had a per-occurrence limit of $1 million and a per-person limit of $500,000. Fibreboard contended that Continental's policy replaced a similar Pacific policy with a per-claim limit of $500,000 but no aggregate limit.\n\nFibreboard contended that these two policies provided coverage to Fibreboard for thousands of claimants. This argument rested on Fibreboard's \"continuous trigger\" theory which maintained that the policies covered Fibreboard if the claimant had been exposed to asbestos at any time before or during the time the policies were in force, provided the claimant at some time was exposed to Fibreboard's asbestos product.\n\nIn 1979, Fibreboard and other insureds filed a massive multi-party insurance coverage case in California state court against a number of insurers, including Pacific and Continental. Following years of litigation, including a trial extending over four years, Fibreboard prevailed in the trial court. In its 1990 opinion, the trial court accepted Fibreboard's continuous trigger theory as well as Fibreboard's argument that the insurer was required to pay the full cost of defense for each claim covered.\n\nThe insurers appealed to a California intermediate appellate court. Argument was held in August 1993 while the settling parties in this case were attempting to reach a final agreement.\n\nBy 1988, Fibreboard had largely exhausted its coverage from insurers other than Pacific and Continental. It was unable to pay asbestos judgments and settlements as they occurred and also pay the continuing mounting defense costs. After the trial court in the coverage case issued several rulings in favor of Fibreboard, Fibreboard was able to develop a \"structured settlement\" program where payments to settle claims were deferred until resolution of the coverage case. Under this plan, most plaintiffs agreed to accept 40% cash up front with the balance due upon resolution of the coverage dispute. Additionally, Fibreboard agreed not to dissipate its assets and, in effect, to give the company to the plaintiffs if it lost its coverage case.\n\nBy mid-1990, Fibreboard's defense costs and settlement payments had mounted and Fibreboard looked for additional insurance resources. It proposed to both Continental and Pacific that they negotiate a complete settlement of its coverage claims. Continental declined to negotiate. Pacific, however, negotiated with Fibreboard and ultimately agreed to a settlement, \"the Pacific Agreement.\" By this settlement, which was subject to a number of contingencies, Pacific's coverage was made available for claimants exposed to Fibreboard's asbestos products after 1959. The Pacific Agreement also purported to extinguish Continental's right to seek contribution from Pacific. Continental challenged this agreement in the District Court for the Eastern District of Texas in April 1993.\n\nEven with the Pacific Agreement, Fibreboard faced acute problems with increased large-scale asbestos litigation. In early 1991 it proposed an \"assignment settlement\" plan to plaintiffs' counsel. Unlike the earlier program, this plan allowed asbestos claimants to settle their claims against Fibreboard for an agreed sum, receive no cash up front but rather receive an assignment of Fibreboard's rights (to the extent of the settlement) against Continental. Fibreboard agreed to pay the settlement sum if the court ultimately exonerated Continental. Under this plan, the settlement was also contingent upon Fibreboard obtaining court orders validating its right to make an assignment in the face of an insurance policy provision barring Fibreboard from settling claims without Continental's consent. Plaintiffs' counsel recognized the risk that their clients would never receive the agreed-upon settlements under the assignment plan and pressed for higher settlement amounts for accepting this risk. Fibreboard, using Continental dollars, was willing to pay more. As a result, the average per-case settlement amount under the assignment plan more than doubled the average amount of the earlier structured settlements. Continental strongly disputed Fibreboard's right to make these assignments. This dispute led to further costly litigation.\n\nIn June 1992, a California trial court in Andrus v. Fibreboard\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e ruled in favor of Fibreboard and upheld Fibreboard's right to make the assignment settlements. The California intermediate appellate court denied writs, relegating Continental to review under the ordinary appellate process.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nIn 1990 and 1991 Fibreboard broached the subject of a global settlement with Ron Motley, Joe Rice, Steven Kazan and Harry Wartnick, all of whom were leading plaintiffs' asbestos counsel. Fibreboard proposed to use an assignment plan to accomplish the global settlement. Fibreboard sought to structure the settlement so that claimants would look only to its insurance assets if it won the coverage case and Fibreboard would give the company to claimants if it lost the coverage case. As Fibreboard's counsel later admitted at the fairness hearing, this approach was designed in part to \"bring the [asbestos] litigation closer to Continental; it was important that Continental feel as threatened as Fibreboard did.\"\n\nFibreboard was not successful in negotiating a global settlement with plaintiffs' counsel. Fibreboard and the Ness Motley firm did, however, agree to settle at least 20,000 present asbestos claims with the possibility of expanding that number to a higher figure. Fibreboard again agreed to assign rights under the Continental policy instead of paying cash to fund this settlement. The higher settlement amounts necessary to accomplish these assignment settlements caused a further inflation of settlement values. With the Conclusion of this Ness Motley settlement agreement, Fibreboard had entered into $943 million in assignment settlements during 1992 and had deferred settlement obligations at the end of that year aggregating over $1.2 billion, a sum that greatly exceeded its net worth.\n\nAs called for under this latest settlement, Fibreboard brought suit in the Eastern District of Texas seeking a determination that the assignment did not violate the Continental policy. Plaintiffs' counsel advised Continental that they had bound themselves contractually with Fibreboard to refrain from negotiating directly with Continental without Fibreboard's consent. Continental knew that Fibreboard and plaintiffs' counsel were actively engaged in negotiating a global settlement to be funded with Continental's money.\n\nThus, at the beginning of 1993, Continental was under intense pressure to join the settlement talks:\n\n* Continental had been unable to obtain immediate review of the California trial court judgment in Andrus approving the unilateral assignment settlements.\n\n* Fibreboard continued to close more and more assignment settlements at amounts Continental considered grossly excessive.\n\n* Fibreboard and plaintiffs' counsel were seriously negotiating a multi-billion dollar settlement which Continental would be called upon to fund. And Continental was barred from the table.\n\n* A new proceeding, in a forum Continental probably considered unfriendly, had been filed seeking validation of Fibreboard's assignment settlements.\n\nIn February 1993, Continental announced that it would seek a global resolution of its asbestos exposure under its Fibreboard policies. With the approval of the parties, Judge Parker named Judge Patrick E. Higginbotham of this court to serve as settlement facilitator.\n\nIn the settlement Discussions with Judge Higginbotham, Continental made it clear from the beginning that it would only entertain a global settlement if the settlement brought \"total peace.\" Continental was unwilling to pay billions in settlement and forego its substantial arguments against coverage without the assurance that it did not face unknown liabilities in the future. Thus, Continental was only interested in exploring a mandatory, non-opt-out settlement. Continental considered that an opt-out class presented it with a number of insurmountable problems:\n\n* Because the deadline for opting out would likely come after a decision in the coverage appeal, plaintiffs would enjoy a one-way option: they could opt out if Continental lost the appeal but remain in if Fibreboard lost.\n\n* Claimants with the most serious injuries were likely to opt out in disproportionate numbers.\n\n* Accurate predictions of Continental's exposure to opt outs were extremely difficult, if not impossible, to make.\n\nSkirmishes between Continental and Fibreboard initially prevented fruitful Discussion. Fibreboard argued that Continental was barred contractually from direct Discussions with plaintiffs' counsel. Fibreboard also threatened to continue its assignment settlements.\n\nWith Judge Higginbotham's help, the parties agreed to put these impediments behind them in an agreement signed on April 9, 1993. Fibreboard agreed to allow Continental a place at the negotiating table and to stop the assignment settlements. Continental agreed to fund 100% of any global settlement (Continental reserved the right to get whatever contribution it could from Pacific) and to use its best efforts to work with Fibreboard to reach a global settlement.\n\nFrom April until July the parties attempted to negotiate a global settlement but these efforts met with little success. For a number of reasons Judge Higginbotham recommended and the parties agreed that they should first attempt to settle the Ness Motley inventory of some 45,000 present claims. On August 5, the parties reached the \"Substitute Ness Motley Agreement\" which was approved by the court on August 9.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nWith the Ness Motley settlement behind them, the parties intensified their efforts to reach a global settlement. The August 27 date for oral argument in the California Court of Appeal in the coverage case injected a sense of urgency into these Discussions. Plaintiffs' counsel realized that if Fibreboard lost the coverage case, Continental's funds, essential to any settlement, would be lost. Fibreboard faced immediate bankruptcy if it lost the coverage case. Continental and Pacific faced staggering liability in an unquantifiable amount if they lost the coverage case. The parties had reason to believe that the California appellate court would render a decision promptly after argument and perhaps give signals at argument on how it would rule. For these reasons all parties were driven to reach a settlement before the California court reached a decision in the coverage case.\n\nAt Judge Higginbotham's request, Judge Parker designated Messrs. Rice, Cox, Kazan, and Wartnick to \"negotiate. the prospect of a Rule 23(b)(1)(B) settlement class composed of future plaintiffs with claims against Fibreboard.\"\n\nA series of intense negotiating sessions followed. The absence of Pacific at the table remained a serious impediment and little progress was made. Over the weekend of August 21-22, faced with an impending trial on Continental's claims to invalidate the Pacific Agreement, Pacific agreed to share responsibility with Continental on a 35.29% to 64.71% ratio. This was the same ratio established by the trial court in the coverage case.\n\nThis proved to be the last impediment to an agreement. Continental and Pacific were now negotiating jointly. By August 23, Continental and Pacific (the Insurers) had offered $1.5 billion and plaintiffs' counsel demanded $1.7 billion. The parties asked Judge Parker to assist in a last-ditch effort to reach agreement before August 27.\n\nJudge Parker and counsel spent the afternoon of August 26 in intensive negotiating sessions in an attempt to resolve the remaining differences between the parties. Late in the afternoon when settlement had not been reached, Judge Parker invited a core group of attorneys to his home outside of Tyler to continue the Discussion. After several hours of negotiations in this more informal setting, Continental agreed to contribute an additional $25,000,000 and Fibreboard agreed to contribute $10,000,000. Plaintiffs' counsel refused at this point to accept the $1.535 billion pot. But later, the key parties, by coincidence, met around midnight at a Tyler coffee shop. Plaintiffs' counsel, at that time, agreed to accept the tendered $1.535 billion global settlement offer.\n\nOn the morning of August 27, plaintiffs' counsel renewed a demand that there be a separate, back-up settlement between Fibreboard and the Insurers for the settlement of the coverage case if, for any reason, a court declined to approve the global settlement. The parties negotiated the entire day on August 27. Near the end of the day a settlement (termed the \"Trilateral Settlement\") among Continental, Pacific and Fibreboard was reached. These negotiations were undoubtedly shortened because the coverage case appeal was argued on the morning of August 27. The negotiating representatives received word after the argument that the court had announced that it intended to decide the case expeditiously.\n\nUpon announcement of the settlement agreement in open court in Tyler on August 27, the parties directed communication to the California Court of Appeal advising the court of the agreement in principle. The parties asked the California court to defer a ruling on the issues relating to Fibreboard's dispute with Continental and Pacific pending completion of the necessary settlement documentation. The California Court of Appeal has continued to withhold a ruling pending final approval of the Trilateral Settlement.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nThe parties then set out to convert the Global and Trilateral Settlements into formal written agreements. They first addressed the Trilateral Settlement. Disputes arose over critical features of this agreement and it was not until October that Continental, Pacific and Fibreboard were able to reduce it to writing.\n\nOn September 9th, the Ahearn class action was commenced by the Global Health Claimant Class against Fibreboard. The Global Health Claimant Class consists of all persons with personal injury claims against Fibreboard for asbestos exposure whose claims had not been brought in a lawsuit, settled or included in a settlement agreement before August 27, 1993. Shortly after Ahearn was filed, Judge Parker entered a number of orders: Continental and Pacific were granted leave to intervene as party defendants; provisional class certification was granted; a TRO against commencement of further separate litigation against Fibreboard by putative class members was entered; and the court appointed as counsel to the plaintiff class, Rice, Cox, Kazan and Wartnick, and appointed Caplin \u0026 Drysdale as counsel to plaintiffs' counsel.\n\nIn October, Judge Parker appointed Professor Eric Green of the Boston University School of Law to serve as guardian ad litem for the class. Judge Parker noted\n\nthat it would be desirable that there be the appointment of [a guardian] ad litem who is fully knowledgeable in asbestos mass tort matters but does not actively represent asbestos claimants. The function of the [guardian] ad litem is to review the settlement from the point of view of members of the class and thereby to afford the class additional assurance that their interest will be adequately protected.\n\nProfessor Green was directed to render a report to the court analyzing the fairness, reasonableness and adequacy of the settlement from the point of view of the members of the provisionally certified Global Health Claimant Class.\n\nPlaintiffs' counsel then turned to documenting the Global Settlement Agreement. The parties did not resolve the hundreds of details necessary to complete this document until December 23. As Judge Parker noted, it was not until that date when the Global Settlement Agreement was signed that it became \"clear that a final agreement would actually be reached.\"\n\nB. Terms of the Settlements\n\n1. The Global Settlement Agreement\n\nThe Global Settlement Agreement provides for the establishment of a trust, funded with $1.535 billion -- the proceeds of the settlement. The trust is charged with administering and paying all of the Global Health Claimant Class members' asbestos-related personal injury and death claims against Fibreboard and the Insurers. Once the global settlement receives judicial approval, and the trust is fully funded, the Class members' claims against Fibreboard and the Insurers will be directed to the trust for processing and payment according to the procedures provided in the trust distribution process. The trust is to be managed by three trustees and subject to the general supervision of the court.\n\nThe Global Settlement Agreement seeks to provide, through the trust, a simple process for injured persons to quickly obtain a fair resolution of their claims and at the same time safeguard their ultimate right to resort to the tort system. The settlement further seeks, through spendthrift provisions, to limit the amount of the trust assets that can be paid out in any given year. This will protect assets so that they will be available to compensate injured class members whose claims develop far in the future. If a shortfall occurs in any year, payments during that year are prioritized so that the sickest claimants are paid first.\n\nUnder the Global Settlement Agreement, a claimant must first seek to settle with the trust after providing requisite information to allow for evaluation of his claim. If no settlement is reached, the claimant will next proceed to mediation to attempt to resolve his differences with the trust. If the mediation fails, the claim will be submitted to arbitration, either binding or non-binding at the claimant's choice. If non-binding arbitration does not result in a resolution of the claim, a Judge or Judge's designee from the Eastern District of Texas will hold a settlement conference. If this does not produce a settlement, the claimant may proceed against the trust in the tort system, complete with a jury trial if requested. The recovery of the claimant in the tort system, however, is subject to a cap of $500,000 per claim and recovery of punitive damages is precluded. Attorneys' fees for claimant's counsel are limited to 25% of the compensation paid to the claimant. Any resulting judgment will be paid out over a period of years depending upon the financial condition of the trust at the time.\n\nAs consideration for their $1.535 billion payment, Fibreboard and the Insurers receive full releases from the Global Health Claimant Class for their asbestos-related claims. Fibreboard and the Insurers also release each other from all claims.\n\n2. The Global Third-Party Claimant Class Settlement\n\nThis settlement is between representatives of Fibreboard's major co-defendants on the one hand and Fibreboard and its Insurers on the other. The settlement preserves credit rights for co-defendant third parties under the law of the forum. Where the claimant liquidates his claim against the trust before proceeding to judgment against the co-defendant third party, the third party receives whatever credit local law allows against the judgment. Any third-party co-defendant who suffers a judgment before the trust settles with the plaintiff and pays a Fibreboard share, succeeds to the plaintiff's rights against the trust, except for exit to the tort system. The Global Third-Party Claimant Class releases Fibreboard and the Insurers as to all third-party claims for contribution and indemnity arising from the claims of Global Health Claimant Class members and agrees that approval of the Global Settlement Agreement will bar and enjoin Global Third-Party Claimant Class members from prosecuting any such claims against Fibreboard or the Insurers. Fibreboard and the Insurers in turn, release the Global Third-Party Claimant Class from any and all contribution and indemnity claims.\n\n3. The Trilateral Settlement Agreement\n\nThe Trilateral Settlement Agreement compromises the longstanding coverage disputes between Fibreboard and the Insurers, Continental and Pacific. This settlement is to remain effective even if the Global Settlement Agreement ultimately fails to obtain judicial approval. With limited exceptions, the Trilateral Settlement fully discharges the Insurers from all of their Fibreboard policy obligations--both personal injury and non-personal injury claims. The Trilateral Settlement is not designed to settle any asbestos claims against Fibreboard. If the global settlement for some reason fails, the asbestos claimants may pursue Fibreboard in the tort system. If the Global Settlement Agreement is not finally approved but the Trilateral Settlement Agreement is, the Insurers will make available to Fibreboard a total of $2 billion to enable Fibreboard to defend and resolve asbestos-related claims filed against it.\n\nC. Notice and Hearing\n\nAfter a comprehensive campaign designed to give notice of the proposed settlements, the district court allowed wide-ranging discovery. The court allowed the Ortiz and Flanagan appellants to intervene to assist in making the record \"relating to the fairness, reasonableness and adequacy of the proposed settlement--to assist the court in its ultimate decision in this case.\"\n\nThereafter the court held a comprehensive eight-day fairness hearing. In addition to issues relating directly to the adequacy of the settlement fund, the court heard expert testimony on the potential outcome of the coverage case appeal. Two experts, retired California Supreme Court Justice Marcus Coffman and Yale Law Professor, George Priest, gave opinions that Fibreboard's trial court victory on coverage would be reversed by the California appellate courts. These witnesses testified that Fibreboard faced a substantial risk that its extensive assignment settlement program constituted a massive breach of the policy.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nFollowing the hearing, the court made detailed findings and concluded that the Global Settlement Agreement was fair, adequate and reasonable to the class and that the requirements for mandatory class certification under Federal Rules of Civil Procedure 23(b)(1)(A), (b)(1)(B) and (b)2 were met.\n\nD. Rudd\n\nAfter the Trilateral Settlement between Fibreboard and the Insurers was reached, the Insurers insisted upon a judicial determination that the settlement was fair, reasonable and non-collusive and operated to terminate any rights claimants might otherwise have against the Insurers arising out of the policies. The Rudd action was filed to accomplish this purpose. The Insurers thus brought a declaratory and injunctive action in the Eastern District of Texas against two mandatory (non-opt-out) defendant classes: (1) the Trilateral Health Claimant Class--substantially the same as the Ahearn futures class, and (2) the Trilateral Third-Party Claimant Class, comprised of third parties with asbestos-related claims against Fibreboard. The district court appointed experienced counsel to represent each class.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e Notice was then given to the classes informing them of the pendency of the action. Broad discovery was conducted and trial was held on February 13, 1995.\n\nFollowing trial, the class representatives and counsel for both of the defendant classes advised the district court that they had concluded that it was in the best interest of these classes to consent to the relief the Insurers were seeking. Counsel filed position papers explaining their reasons. Notice of the class representatives' consent to the terms of the Trilateral Settlement was sent to the members of the two classes. Following a fairness hearing, the district court issued findings of fact and Conclusions of law approving the classes' consent and certifying both classes as mandatory non-opt-out defendant classes pursuant to Rules 23(b)(l)(A), (b)(1)(B) and (b)(2) of the Federal Rules of Civil Procedure. Only two individuals represented by Leonard C. Jaques, Esq., challenge the district court's orders in this appeal. No member of the Trilateral Third-Party Claimant Class and none of the other intervening parties in Ahearn have lodged objections to Rudd.\n\nII. AHEARN\n\nAppellants challenge Ahearn on a number of grounds which we consider below. The Ortiz intervenors are members of the Global Health Claimant Class who challenge certification of the class and the approval of the settlement. The Flanagan intervenors, also members of the Global Health Claimant Class, challenge certification in Ahearn and raise several objections specific to Rudd. We will refer to both groups of appellants collectively as \"the intervenors.\"\n\nA. Rule 23(a)\n\nRule 23(a) lists four prerequisites to a class action:(1)numerosity, (2)commonality, (3)typicality and (4)adequacy of representation. The district court found that all four of these prerequisites were satisfied. The intervenors do not dispute the district court's finding of numerosity, but argue that the Global Health Claimant Class meets none of the other prerequisites to a class action.\n\nThe intervenors argue that the district court erred by considering the circumstances surrounding the settlement and the evidence adduced at the fairness hearing in making findings under Rule 23(a). This argument is contrary to Fifth Circuit precedent and would require a court to ignore important and relevant information that sits squarely in front of it when deciding whether to certify a settlement class. In In re Corrugated Container Antitrust Litigation (Container I), we held that the district court should consider the settlement in deciding whether the settlement class satisfied the prerequisites of Rule 23. 643 F.2d 195, 211 (5th Cir.), aff'd, 659 F.2d 1322 (5th Cir. 1981), cert. denied, 456 U.S. 998, and cert. denied, 456 U.S. 1012 (1982). We rejected a challenge to the district court's finding that the class was adequately represented as required by 23(a)(4) and found that the terms of the settlement were vitally important to the determination that certification was appropriate. Id.\n\nMost circuits to decide the issue have held that courts should consider the settlement in determining whether Rule 23 prerequisites are satisfied. See Malchman v. Davis, 761 F.2d 893, 900 (2d Cir. 1985)(certification appropriate because \"the interests of the broadened class in the settlement were commonly held\")(emphasis added); White v. National Football League, 41 F.3d 402, 408 (8th Cir. 1994) cert. denied 132 L. Ed. 2d 821, 115 S. Ct. 2569 (1995) (\"adequacy of class representation. is ultimately determined by the settlement itself\"); In re Dennis Greenman Securities Litigation, 829 F.2d 1539, 1543 (11th Cir. 1987)(\"in assessing the propriety of class certification, the courts evaluate the negotiation process and the settlement itself\"); In re A.H. Robins Co., Inc., 880 F.2d 709, 740 (4th Cir.) cert. denied, 493 U.S. 959, 107 L. Ed. 2d 362, 110 S. Ct. 376 (1989) (\"if not a ground for certification per se, certainly settlement should be a factor, and an important factor to be considered when determining certification\"). Only the Third Circuit has refused to look at settlements before it when deciding class certification issues and even that court admits that taking the settlement into account may be \"the better policy.\" Georgine v. Amchem Products, Inc., 1996 WL 242442 at * 1 (3d Cir. May 10, 1996). The rule that a court should consider a proposed settlement, if one is before it, when deciding certification issues makes good sense. Settlements and the events leading up to them add a great deal of information to the court's inquiry and will often expose diverging interests or common issues that were not evident or clear from the complaint. See Herbert Newberg \u0026 Alba Conte, 2 Newberg on Class Actions ยง 11.28 at 11-58 (3d ed. 1992) (in settlement class context, common issues arise from the settlement itself).\n\nWe are bound to follow Container I 's holding that the district court can and should look at the terms of a settlement in front of it as part of its certification inquiry. We would adopt this rule even if we were not bound by precedent because it enhances the ability of district courts to make informed certification decisions.\n\n1. Commonality and typicality\n\nThe district court, in its findings of fact, found that the entire Global Health Claimant Class had the following issues in common:\n\n(i) avoiding the potentially disastrous results of a loss by Fibreboard in the Coverage Case appeal; (ii) maximizing the total settlement contribution from Fibreboard and the Insurers; (iii) streamlining the procedures for the filing, processing and resolution of claims, and thereby reducing transactions costs and delays in compensation; (iv) minimizing the percentage of their compensation diverted from them to pay attorneys' fees; and (v) adopting procedures that provide for payments to claimants in an equitable manner.\n\nThe intervenors do not disagree that the settlement class holds these issues in common. Instead, they argue that these issues do not support a finding of commonality because they are derived from the settlement rather than from the Ahearn complaint. As we noted above, this argument has no merit and is foreclosed by our holding in Container I. Because the evidence is overwhelming that the class holds the above issues in common under the settlement (even the intervenors concede this point), we agree with the district court that the Ahearn action and the Global Settlement Agreement presented it with questions of law and fact common to the entire Global Health Claimant Class.\n\nTypicality focuses on the similarity between the named plaintiffs' legal and remedial theories and the legal and remedial theories of those whom they purport to represent. Jenkins v. Raymark Indus. Inc., 782 F.2d 468, 472 (5th Cir. 1986). The district court found that the legal and remedial theories of the representative plaintiffs were typical of the class because all members of the Global Health Claimant Class presented claims based on exposure to Fibreboard asbestos. The district court also found that the named plaintiffs' interests in maximizing recovery for the class and eliminating the risk posed by the insurance coverage litigation were identical to interests held by all members of the class.\n\nThe intervenors do not argue that the named plaintiffs' claims rest on theories different from those of the other class members. Instead, in their attempt to show that the class is too diverse to meet the typicality requirement, they point to individual issues such as varying family situations, separate histories of cigarette smoking, differences in medical expenses and differences in state law. These differences will certainly result in significant differences in the amount of damages that each claimant recovers but do not affect the settlement in the least. The Global Settlement Agreement does not award damages to individual victims:\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e it provides money and an equitable distribution process to pay victims.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nThe central remedial and legal theory of each of the named plaintiffs, that Fibreboard is liable in tort for damages incurred due to exposure to Fibreboard asbestos, is typical of the entire class. Even the definition of the class makes this clear.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Further, the issues that brought the named plaintiffs to settle Ahearn are the same issues that the district court found common to the entire class. The named plaintiffs settled Ahearn because of their desire to avoid the risks of insurance coverage litigation and to insure that money remains available to pay their claims when they make it through the settlement and/or trial process to final judgment. These same concerns affect each member of the Global Health Claimant Class. We are satisfied that the district court did not abuse its discretion by finding that the issues of law and fact faced by the named plaintiffs were typical of the Global Health Claimant Class.\n\n2. Adequacy of representation\n\nThe intervenors argue that the district court should not have certified the Global Health Claimant Class because of impermissible conflicts of interests by class counsel.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Rule 23(a)(4) states that a class action may be maintained only if \"the representative parties will fairly and adequately protect the interests of the class.\" This requirement for fair and adequate representation encompasses both class representatives and class counsel. North American Acceptance Corp. v. Arnall, Golden, \u0026 Gregory, 593 F.2d 642, 644 n.4 (5th Cir. 1979). However, \"just what measure of representation is adequate is a question of fact that depends on each peculiar set of circumstances.\" Guerine v. J.\u0026 W. Investment, Inc., 544 F.2d 863, 864 (5th Cir. 1977), citing Johnson v. Georgia Highway Express Inc., 417 F.2d 1122 (5th Cir. 1969). The district court has the continuing duty to see that the class is adequately represented. Guerine, 544 F.2d at 864.\n\nA district court may not certify a class without concluding that class counsel are \"'qualified, experienced, and generally able to conduct the proposed litigation.' Obviously, an attorney who should be disqualified because of a conflict of interest will not meet this requirement.\" North Amer. Acceptance, 593 F.2d at 644 (quoting Johnson v. Georgia Hwy. Express, Inc., 417 F.2d 1122, 1125 (5th Cir. 1969)).\n\nIn August 1993, the district court, on the recommendation of Judge Higginbotham, formally appointed four counsel (Messrs. Rice, Cox, Kazan, and Wartnick) to represent the Global Health Claimant Class. Messrs. Rice and Cox are partners with the Ness Motley firm, one of the leading U.S. firms representing asbestos claimants. Ness Motley has been engaged in litigation with Fibreboard since 1990. Mr. Kazan is a partner with Kazan, McClain, Edises, \u0026 Simon. He has handled asbestos-related cases for about twenty years. Mr. Wartnick is a member of the law firm of Wartnick, Chaber, Harowitz, Smith \u0026 Tigerman. His practice has been devoted to representing asbestos claimants since 1981. In addition to their experience in asbestos litigation generally, Messrs. Kazan and Wartnick were Fibreboard's chief litigation adversaries on the West Coast, where Fibreboard is located. The appointed class counsel retained the firm of Caplin \u0026 Drysdale to advise them in areas outside their own expertise.\n\nThe district court found that these counsel are \"prominent attorneys, highly respected for their knowledge, experience, skill and special competence in the field of asbestos litigation\" and that they provided \"adequate, professional and ethical representation\" to the class.\n\nThe intervenors do not question the skill, competence or experience of class counsel, but instead argue the existence of impermissible conflicts that prevented them from adequately representing the class. Both sides agree that in determining the existence of a conflict, we look to the ABA Model Rules of Professional Conduct for guidance. Rule 1.7 states:\n\n(b) A lawyer shall not represent a client if the representation of that client may be materially limited by the lawyer's responsibilities to another client or to a third person, or by the lawyer's own interests, unless:\n\n(1) the lawyer reasonably believes the representation will not be adversely affected; and\n\n(2) the client consents after consultation. When representation of multiple clients in a single matter is undertaken, the consultation shall include explanation of the implications of the common representation and the advantages and risks involved.\n\nModel Rules of Professional Conduct, Rule 1.7(b).\n\nAt the fairness hearing, the intervenors and the settling parties each called a legal ethics expert to express an opinion on whether class counsel had conflicts.\n\nThe intervenors offered Professor John Leubsdorf, a law professor at Rutgers University Law School who has taught courses in civil procedure and legal responsibility. The district court qualified Professor Leubsdorf as an expert on issues of legal ethics and professional responsibility but found him lacking in practical experience in mass tort litigation.\n\nThe settling parties called Professor Geoffrey Hazard, a law professor at the University of Pennsylvania Law School and a recognized scholar in the field of legal ethics and professional responsibility. Professor Hazard was a member of the Rand Civil Justice Institute advisory council for studies concerning asbestos litigation and a reporter to the commission responsible for the preparation of the ABA Model Rules of Professional Conduct. Moreover, Professor Hazard has previously testified in asbestos cases and has extensive experience as a consultant in this type litigation.\n\nAfter hearing the testimony of both the legal experts and the negotiators, the district court credited Professor Hazard's testimony as \"consistent with existing federal legal principles and the underlying facts of this case.\" The court found that Professor Leubsdorf's testimony in a number of areas was either not supported by the factual record or contrary to settled federal law. Also, the district court felt that Professor Leubsdorf's Conclusions and recommendations often were speculative and impractical because of his insufficient experience in mass torts and asbestos litigation. The record amply supports these findings.\n\nThe intervenors argue that class counsel for the Global Health Claimant Class had impermissible conflicts due to concurrent representation both (1) of present asbestos claimants and the Class of future claimants and (2) of purported conflicting subgroups within the class.\n\na. Alleged conflict between present claimants and the class\n\nThe intervenors contend that class counsel by simultaneously representing both present claimants and the class of future claimants represented clients who were directly competing for Fibreboard's limited resources. The district court found that during the negotiations no conflict existed that materially limited counsel's responsibilities to the future claimant class.\n\nIn analyzing whether a conflict existed, both Professor Hazard and the guardian ad litem appointed for the futures class, Professor Eric D. Green, divided the three-year negotiations period into smaller discrete time periods: (1) Early 1991 through April 9, 1993; (2) April 9, 1993, through August 9, 1993; (3) August 9, 1993, through August 27, 1993; (4) August 27, 1993, through October 12, 1993; and (5) October 12, 1993, through December 23, 1993.\n\n(i) Early 1991 through late March 1993\n\nMost of the settlement Discussions until late March, 1993 were between only Fibreboard and class counsel. The Insurers did not participate. These exploratory Discussions focused on a possible settlement with both present and future claimants combined in an opt-out class. Fibreboard was still seeking to settle by assigning its insurance rights to the class. During this time, Fibreboard continued to settle various law firms' \"inventories\" of present claims, including claims with the law firms of the four class counsel. Again, Fibreboard accomplished these settlements by assigning its insurance rights against Continental and Pacific; thus, these settlements were contingent on a favorable decision for Fibreboard in the California coverage case.\n\nDuring this period, Fibreboard executed the initial Ness Motley agreement which settled approximately 20,000 inventory claims with the Ness Motley firm. This agreement required Fibreboard to obtain Continental's consent to this assignment of insurance rights or to seek a court order approving the assignment. In January 1993, Fibreboard filed suit against Continental in the Eastern District of Texas to obtain the court order.\n\nProfessor Hazard testified that during this time period no conflict existed between the present and future claimants because all Discussions of a global settlement included both groups and both groups shared the risk of losing the coverage case. If coverage was found and if assignment was not a breach of contract, then the insurance policies of Continental and Pacific offered potentially unlimited coverage.\n\n(ii) April 1993 through August 9, 1993\n\nIn March 1993 Continental joined the negotiations and Judge Parker appointed Judge Higginbotham as a settlement facilitator. In an April 9, 1993 agreement, Fibreboard agreed to stop executing assignment settlements and Continental agreed to work toward a global settlement of all present and future claimants, including both pre- and post-1959 exposed claimants. But Continental insisted that the settlement be a mandatory, non-opt-out class and that Pacific contribute to the total settlement fund. Class counsel began to consider a mandatory class, but only if the settlement proceeds were adequate to insure fair restitution to present and future claimants and if a back-end opt-out provision was included. During this period, Continental filed suit in the Eastern District of Texas against both Pacific and Fibreboard seeking a declaration that the Pacific Agreement did not impair Continental's contribution rights against Pacific.\n\nFibreboard, now joined by Continental, continued negotiations on inventory claims. Specifically, Fibreboard and Continental began negotiations with the Ness Motley firm on a revised Ness Motley agreement. The parties succeeded in reaching the Substitute Ness Motley Agreement on August 5, 1993. Generally, Continental agreed to a higher-than-average value per claim with one-half due at closing and the remainder contingent on the outcome of the coverage case or on the existence of a settlement. Other inventory settlements were modeled after the Substitute Ness Motley Agreement.\n\nNow that Fibreboard's suit against Continental concerning the initial Ness Motley agreement was settled, Continental sought an immediate trial of its suit against Fibreboard and Pacific. Continental's primary objective was to motivate Pacific to join the global settlement negotiations.\n\nThe intervenors argue that an impermissible conflict existed because the Ness Motley counsel were simultaneously negotiating for both present claimants (the inventory claims) and the class of future claimants. Professor Hazard testified that the present and future claimants were not competing for the same funds. At this stage of the negotiations, counsel were concentrating on the settlement of their inventory of present claims. It is true that they were also discussing a global settlement, but these Discussions were in the preliminary exploratory stage. Certainly, at this time, counsel had no well-formed notions of how much Continental was willing to pay to settle the future claims.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e For this reason, Professor Hazard explained that each attorney in good faith was attempting to obtain the maximum dollar amounts for present claimants he represented, as well as for the future claimants. Counsel certainly knew in a general way that there was a sum beyond which Continental would not pay. But because they did not know that limit, they did not know that this limit would be less than an amount they were willing to accept in settlement for both classes of claimants.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e As the district court found, the Substitute Ness Motley Agreement likely aided the global settlement by increasing the average value per claim. We are persuaded that the record supports the district court's Conclusion that class counsel vigorously represented both the present claimants and their future claimant clients against the same defendant.\n\n(iii) August 9, 1993, through August 27, 1993\n\nOn August 9, 1993, on the recommendation of Judge Higginbotham, the district court appointed Messrs. Rice, Cox, Kazan, and Wartnick to negotiate the prospect of a settlement class composed of future claimants. The court knew that this settlement would have to be reached before the decision in the coverage case, which was expected on August 27, 1993. The court felt compelled due to this severe deadline and to the complexity of the issues to appoint only highly competent and experienced attorneys who understood asbestos litigation. Professor Leubsdorf testified that the court should have required all class counsel to settle their present claims for cash or should have appointed other counsel. The district court did not err in concluding that this suggestion was impractical and would have seriously impeded any settlement.\n\nFrom August 9, 1993, to August 27, 1993, appointed counsel negotiated a global settlement. On August 22, 1993, Continental and Pacific reached an agreement to settle their dispute, vastly improving the odds of a global settlement. The district court found that all negotiations during this time were vigorous, contentious, and at arm's length. Professors Hazard and Green both testified that the future claimants were not impaired by counsel's representation of present claimants during this period. Indeed, they found that the present claimants had a substantial interest in a global settlement because such a settlement would secure their contingent back-end payments under the Substitute Ness Motley Agreement. Class counsel were also aware that any class settlement must be approved by the court and would face meticulous scrutiny. Thus, the present and future claimants had two common interests in reaching a settlement. First, they both wanted to avoid the risk of Fibreboard losing the coverage case. Second, they both wanted a diligently negotiated settlement: the future claimants wanted the settlement that yielded them maximum dollar recovery; the present claimants wanted a settlement that would withstand intense judicial scrutiny.\n\n(iv) August 27, 1993, through October 12, 1993\n\nFrom August 27, 1993, after announcing the Global Settlement Agreement in principle in open court, until October 12, 1993, when the Trilateral Settlement Agreement was reached, class counsel conducted no negotiations on the terms of the Global Settlement Agreement. On October 12, 1993, the district court appointed Professor Green as the guardian ad litem of the futures class.\n\n(v) October 12, 1993, through December 23, 1993\n\nFrom October 12 to December 23, 1993, when the Global Settlement Agreement was executed, the settling parties negotiated the specific terms of the agreement. By this time, the Trilateral Settlement Agreement had already been executed and would have triggered the back-end payments for the present clients in the Ness Motley or similar agreements even if the global settlement failed. Thus, the present clients' settlement was secured and they no longer had an interest in a global settlement. The record supports the district court's finding that the negotiations during this period were vigorous and that the class was adequately represented.\n\nThus, the district court considered the intervenors' conflicts argument for the entire time the settlement negotiations were underway and found that, at no time, did a material limitation on the representation of the class by class counsel exist due to concurrent representation of present and future claimants. The court did not err in reaching this Conclusion.\n\nb. The alleged intraclass conflicts\n\nOn appeal, the intervenors assert only two claims of intraclass conflict: (1) interests of class members who presently have an asbestos-related illness (the \"near\" futures) and members whose illness will not be apparent for many years (the \"far\" futures); and (2) interests of class members exposed pre-1959 and members having only post-1959 exposure.\n\nWhether a conflict exists is governed by Rule 1.7(b) as discussed above. Not every intraclass conflict, however, will preclude approval of the settlement for inadequate representation. See Container I, 643 F.2d at 207-08.\n\nThe district court found that neither subclasses nor separate negotiating attorneys were required because no material intraclass conflict existed. The court found the common interests far outweighed any divergent interests the intraclass groups might have. The court enumerated those common interests as follows: avoiding the catastrophic results of a loss by Fibreboard in the coverage case appeal; maximizing the total settlement contribution from Fibreboard and the Insurers; streamlining the procedures for the filing, processing, and resolution of claims, thereby reducing transaction costs and delays in compensation; minimizing the percentage of their compensation diverted from the fund to pay attorney's fees; and adopting procedures that provide for payments to claimants in an equitable manner.\n\nIntervenors suggest two intraclass conflicts. First, they argue that the \"near\" futures would prefer a settlement agreement that places no limits on the amount an individual may recover because these claimants do not anticipate that Fibreboard's assets will be depleted before their claims mature. The \"far\" futures, on the other hand, would prefer to limit individual claims to conserve funds so that resources will be available to pay for their future illnesses.\n\nProfessors Hazard and Green found no conflict between these two groups that would materially impair the performance of class counsel. Specifically, each found that the common interest in avoiding a lack of coverage vastly overwhelmed any differences between these groups. The \"near\" futures have no assurance that they would fare better in the absence of the Global Settlement Agreement. These claimants would face the risk that Fibreboard would live up to its pledge to actively defend any claims and delay any recovery. These claimants would also face the risk of attrition of available funds from increased legal fees. Under the Global Settlement Agreement the entire class is benefited by the greater likelihood that funds will be available to compensate both \"near\" and \"far\" future claimants under a less complicated system.\n\nThe intervenors rely on In re Joint Eastern \u0026 Southern District Asbestos Litigation (Findley), 982 F.2d 721 (2d Cir. 1992) to support requiring subclasses for the \"near\" and \"far\" futures. In a settlement trying to save the Manville Trust from insolvency, the Second Circuit held that subclasses were required for a Rule 23(b)(1)(B) non-opt-out class because of clear conflicts between class members. More particularly, the Second Circuit did require subclasses for groups comparable to our \"near\" futures and \"far\" futures. But the terms of the Manville Trust required that Conclusion: significantly, the Second Circuit opinion makes it clear that a \"near\" future claimant was assured of recovery under the Manville Trust instrument if the claim was filed before the Trust ran out of money because the Trust operated on a strict order-of-filing priority. The settlement abandoned this priority to the prejudice of the near futures. Counsel, in negotiating such a settlement, had a clear conflict between the \"near\" futures whose recovery rights were secure and the \"far\" futures who had no such security. As explained above, our \"near\" future claimants without the Global Settlement Agreement are not assured of a priority payment and have no assurance that funds will be available or when funds can be obtained if they are required to litigate with Fibreboard.\n\nNext, intervenors argue that counsel could not represent claimants who were exposed before 1959 and after 1959 in negotiating a global settlement. They contend that this conflict exists because a pre-1959 exposure claimant's case has a higher settlement value than a post-1959 exposure claimant's. This is premised on the argument that pre-1959 claimants have a greater likelihood of available insurance coverage because both Continental and Pacific insurance policies covered only pre-1959 asbestos exposure. The Intervenors recognize that the Pacific Agreement gave Fibreboard $330 million to use in post-1959 claims. They argue however that Continental affords potential unlimited fund coverage to the pre-1959 claimants.\n\nProfessors Hazard and Green both found no substantial conflict between pre- and post-1959 claimants. Both pre- and post-1959 claimants share the common class interests recited above. Neither the Substitute Ness Motley Agreement, the Trilateral Settlement Agreement, nor the Global Settlement Agreement distinguish between these two groups of claimants in any way. To distinguish between the two groups in the Global Settlement Agreement was impractical because the class had no chance of persuading Fibreboard to agree to a settlement that did not address the claims by both groups. Also, to maintain the distinction in the Global Settlement Agreement would have undermined the attempts to provide maximum compensation and an efficient, streamlined process to claimants.\n\nThe district court made the following findings of fact: (1) all negotiations were vigorous and at arm's length, often conducted under the auspices of Judge Higginbotham; (2) common interests within the class overwhelmed minimal conflicts; (3) the settlement treated all class members the same; and (4) the Global Settlement Agreement was fair and reasonable, a finding that the intervenors have not appealed. The independent guardian ad litem also found that class counsel had no conflicts and that the Global Settlement Agreement was fair and reasonable and was the best alternative available. The district court did not abuse its discretion in finding that the class was adequately represented and that subclasses were not required.\n\nB. Certification Under 23(b)(1)(B)\n\nWe turn next to the intervenors' challenge to class certification under 23(b)(1)(B).\n\nRule 23(b) states that where the prerequisites of 23(a) are met, a class action may be maintained if\n\n(1) the prosecution of separate actions by or against individual members of the class would create a risk of\n\n.\n\n(B) adjudications with respect to individual members of the class which would as a practical matter be dispositive of the interests of the other members not parties to the adjudications or substantially impair or impede their ability to protect their interests.\n\nFed.R.Civ.P. 23(b).\n\nThe district court found that the prosecution of separate actions by members of the Global Health Claimant Class would substantially impair or impede the ability of other members of the class to receive full payment for their injuries from Fibreboard's limited assets. This finding has strong support in the record and is not clearly erroneous. The district court heard expert testimony on the probable number, mix and timing of future asbestos personal injury claims against Fibreboard, the anticipated costs of defense relating to such claims, and the present value of Fibreboard's non-insurance assets. The experts agreed that Fibreboard faced enormous liability and defense costs that would likely equal or exceed the amount of damages paid out. More importantly, these experts testified that even under the Trilateral Settlement Agreement where Fibreboard is given $2 billion in insurance money to add to its own value of approximately $235 million, Fibreboard would be unable to pay all the valid claims against it within five to nine years. The district court credited the testimony of these experts and found that Fibreboard is a limited fund.\n\n1. Rule 23(b)(1)(B) and the Bankruptcy Code\n\nThe intervenors argue that if the reason Fibreboard is a limited fund is because it will become insolvent before it pays all claims, then the Global Settlement Agreement is an impermissible attempt to circumvent bankruptcy proceedings and bankruptcy's absolute priority rule.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e This argument fails to consider (1) decisions of other courts which have certified 23(b)(1)(B) classes because the claims of the class would bankrupt the defendant, (2) the significance of Fibreboard's settlement with its insurers in driving the Global Settlement Agreement, (3) the plain meaning of Rule 23, and (4) the nonexclusivity of the Bankruptcy Code and its inferiority to a 23(b)(1)(B) class action in the instant case.\n\nOther courts have uniformly found that, in appropriate and limited circumstances, potential or probable insolvency of a defendant can create a limited fund appropriate for adjudication under Rule 23(b)(1)(B). The Second Circuit, in In re Joint Eastern and Southern District Asbestos Litigation (Findley), upheld the district court's Conclusion that the likely insolvency of the Manville Trust rendered it a limited fund and qualified it for treatment under Rule 23(b)(1)(B). 982 F.2d 721, 739 (2d Cir. 1992) (cited with approval in In re Joint Eastern and Southern District Asbestos Litigation (Findley), 1996 WL 76145 at * 12-13 (2d Cir. 1996)). In In re the Drexel Burnham Lambert Group, Inc., 960 F.2d 285 (2d. Cir. 1992), the Second Circuit approved a 23(b)(1)(B) class action on the ground that individual litigation would reduce the recovery for all plaintiffs from Drexel's limited assets. Id. at 292. See also, In re Joint Eastern and Southern District Asbestos Litigation (Eagle-Picher Industries), 134 F.R.D. 32, 34 (E. \u0026 S.D. N.Y. 1990); Coburn v. 4-R Corporation, 77 F.R.D. 43 (E.D. Ky. 1977).\n\nIn fact, even courts that have refused to certify 23(b)(1)(B) classes have done so on the ground that the parties seeking class certification have failed to present sufficient evidence that the assets of the defendant are insufficient to pay the claims against it. See In re Temple, 851 F.2d 1269, 1272 (11th Cir. 1988); In re School Asbestos Litigation, 789 F.2d 996, 999 (3d Cir. 1986); In re Bendectin Products Liability Litigation, 749 F.2d 300, 305-06 (6th Cir. 1984); In re Northern District of California Dalkon Shield IUD Products Liability Litigation, 693 F.2d 847, 852 (9th Cir. 1982); Green v. Occidental Petroleum Co., 541 F.2d 1335, 1340 n. 9 (9th Cir. 1976); In re \"Agent Orange\" Product Liability Litigation, 100 F.R.D. 718 (E.D. N.Y. 1983); Payton v. Abbott Labs, 83 F.R.D. 382, 389 (D. Mass. 1979).\n\nIn support of their claim that any 23(b)(1)(B) limited-fund action based on a defendant's insolvency is an improper circumvention of the Bankruptcy Code, the intervenors can rely only on dicta from In re Joint Eastern and Southern District Asbestos Litigation (Keene), 14 F.3d 726 (2d Cir. 1993).\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e The intervenors' Conclusion is contrary to the overwhelming majority of court decisions on this issue, ignores crucial facts in both Ahearn and Keene and reads Keene in a way that creates an intra-circuit split in the Second Circuit.\n\nAhearn 's Global Settlement Agreement was undisputedly driven by insurance coverage litigation between Fibreboard and its insurers which created a serious risk for all parties to the agreement. The Global Health Claimant Class and Fibreboard faced the real possibility that Fibreboard would be insolvent simply on the basis of claims already settled. The Insurers, on the other hand, faced the possibility of vitally unlimited liability for damage caused by Fibreboard asbestos. This pressure, felt by all parties to the global settlement, is what finally brought them together on the eve of the coverage case appeal. The unique risks posed by the coverage cases distinguish Ahearn from a blatant attempt to circumvent the Bankruptcy Code such as occurred in Keene.\n\nThe facts of Keene further distinguish it from our case. First, an already weak Keene attempted to avoid impending bankruptcy by asking the court to coerce its tort victims to settle claims in a court where no claims were filed against Keene. Second, Keene attempted to utilize the 23(b)(1)(B) injunction to halt pending actions in other courts. Third, and most importantly, Keene's complaint was dismissed on the ground that it failed to present the court with any case or controversy because it requested only that the court compel all plaintiffs in suits against Keene to appear and negotiate.\n\nAhearn by comparison, presents us with claims against a healthy company for personal injuries and a proposed settlement of those claims. Ahearn presents no danger that Fibreboard may simply be abusing this proceeding to delay other actions or to improve its negotiating position with present claimants because it only enjoins future proceedings, not those already pending. We agree with the Keene court that under the facts presented to it, a 23(b)(1)(B) action was not appropriate. We also agree that, in the vast majority of cases, the Bankruptcy Code should govern the distribution of an insolvent entity's assets. However, where concerns such as the risk of an adverse judgment in the coverage litigation support an early resolution of the claims against an entity and all parties can benefit from a settlement under Rule 23(b)(1)(B), we see no legal or policy reason to deny the parties this benefit. The essential basis of any settlement is to avoid the uncertainty, risks, and expense of ongoing litigation. In our case, the risks facing Fibreboard, the Insurers, and the health claimants as a result of the California coverage litigation were real and enormous. Holding that the bankruptcy laws require the parties to wait until catastrophe befalls one or more of them as a result of the California litigation would be a denial of Justice to the parties before us and unwarranted by the law.\n\nThe intervenors' argument that all 23(b)(1)(B) limited-fund actions based on the insolvency of the defendant are improper ignores the special circumstances presented by Ahearn and certifications by other courts. In light of the Findley and Drexel decisions, also from the Second Circuit, which allow 23(b)(1)(B) actions where the defendant's insolvency creates a limited fund, we decline to read Keene so broadly as to bar all such 23(b)(1)(B) settlements.\n\nThe plain meaning of Rule 23 also supports a finding that the insolvency of a defendant can support a 23(b)(1)(B) class action. The rule clearly does not distinguish between limited funds which assume insolvency of the defendant and limited funds such as proceeds of an insurance policy which constitute the entire fund from which plaintiffs may recover. It allows class actions whenever \"the prosecution of separate actions by or against individual members of the class would create a risk of.(B) adjudications with respect to individual members of the class which would as a practical matter. substantially impair or impede their ability to protect their interests.\" Fed. R. Civ. P. 23(b)(1). Insolvency of the defendant undoubtedly impairs the ability of latecomers to receive full payment for their claims and was explicitly considered by the Advisory Committee in proposing the rule in its current form. In its Note to the 1966 Amendment to Rule 23, the Advisory Committee concludes that a limited-fund class action is appropriate in actions by creditors \"when the debtor's assets are insufficient to pay all creditors' claims.\" Fed.R.Civ.P. advisory committee's note. This explicit reference to use of a 23(b)(1)(B) action when the debtor is insolvent offers further support for the proposition that insolvency is an appropriate basis for a limited-fund class action.\n\nFurther, the express language of the Rule compels a flexible construction. Rule 23(b)(1)(B) authorizes class certification where there is a \"risk\" that separate adjudications \"as a practical matter\" would \"substantially impair or impede\" the interests of the class. The rule does not require proof to a certainty that the defendant faces insolvency.\n\nThe Bankruptcy Code allows courts to dismiss or suspend bankruptcy proceedings where superior alternatives to the code are available. See 11 U.S.C. ยง 305(a)(1). This concession to the possibility of other proceedings to distribute an insolvent debtor's assets reveals that Congress understood that, at least some of the time, the terms and principles of the Bankruptcy Code would be circumvented by debtors and creditors who found superior methods of asset distribution. See also H.R. Rep. No. 95-595, 95th Cong., 1st Sess. 325 (1977); S.Rep. No. 95-989, 95th Cong., 2d Sess. 35 (1978).\n\nAhearn presented the district court with a superior alternative to the Bankruptcy Code and did so long before any bankruptcy court would have had jurisdiction over Fibreboard's assets. Indeed, one of the most important facts of this case is that, in spite of the threat posed by future personal injury litigation, Fibreboard is currently solvent and healthy. In the short term, no trade or tort creditor has the ability or the incentive to force Fibreboard into a Chapter 11 reorganization. It is also clear that shareholders and management, who stand to lose equity and/or employment if Fibreboard enters bankruptcy proceedings, will refuse to file a voluntary petition at least until the coverage dispute is resolved against it. That, of course, would be too late for the Global Health Claimant Class.\n\nEven in the unlikely event that Fibreboard could be persuaded to file a voluntary bankruptcy petition, the Global Health Claimant Class would be worse off than it is under the Global Settlement Agreement. Under the Bankruptcy Code, representation for the class may not be available at all and courts that have allowed representation of future tort claimants have left them in an uncertain position that falls short of full \"creditor\" status.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e Additionally, full-blown bankruptcy proceedings would bring in all of Fibreboard's other creditors and impose large transactions costs on Fibreboard that, ultimately, would come out of any distribution. See Edward I. Altman, A Further Empirical Investigation of the Bankruptcy Cost Question, 39 J. Fin. 1067, 1077 (1984). In stark contrast to the uncertain and weak position afforded future tort claimants under the Bankruptcy Code, the plaintiff class and its representatives in Ahearn had center stage and ran no risk of encountering a cram-down reorganization approved only by trade creditors and rammed through over the objections of class representatives.\n\nTo the extent intervenors are arguing that certification is improper because Fibreboard fares better under the class action settlement than under a bankruptcy proceeding, we find their focus misplaced. The inquiry instead should be whether the class is better served by avoiding impairment of their interests. Fibreboard is clearly acting in its own interest in consummating the Global Settlement Agreement and thereby avoiding future insolvency. But the Global Settlement Agreement also serves the interests of the Global Health Claimant Class. Early settlement allows the class to recover far more as a group than it could if it was forced to wait until Fibreboard enters bankruptcy on its own and encounters the high transaction costs of insolvency. See Mark J. Roe, Bankruptcy and Mass Tort, 84 Colum. L. Rev. 846, 851-64, 905-17 (1984) (advocating early reorganizations because they avoid the waste of insolvency and distribute more to victims, but noting that no one with the ability to push the mass tortfeasor into an early reorganization has the incentive to do so). Precisely because it avoids the enormous transactions costs of litigation and insolvency, the Global Settlement Agreement can offer a deal from which all parties gain. Members of the Global Health Claimant Class receive more money in payment for their injuries and Fibreboard's shareholders keep their stake in a viable entity. The only loser under the Global Settlement Agreement is the asbestos litigation industry.\n\nFor all of these reasons, we find that the district court's decision to certify Ahearn as a 23(b)(1)(B) class action is an appropriate interpretation of Rule 23 that does not conflict with the Bankruptcy Code and upholds the principles of equity and fairness.\n\n2.\n\nJurisdictional and due process considerations in 23(b)(1)(b) class actions\n\nThe intervenors next argue that the district court cannot exercise jurisdiction over class members who do not have minimum contacts with the Eastern District of Texas and that due process requires that Global Health Claimant Class members be allowed to opt out of the class. Both of these arguments are based on language from the Supreme Court decision Phillips Petroleum Co. v. Shutts, 472 U.S. 797, 86 L. Ed. 2d 628, 105 S. Ct. 2965 (1985). In Shutts, the Supreme Court held that a Kansas state court could bind absent plaintiff members of the class in a \"common question\" class action brought under a state rule virtually identical to 23(b)(3) only if the plaintiffs were provided with \"minimal procedural due process protection,\" including the right to opt out. Id. at 811-12. However, the Court specifically limited its holding to\n\nclass actions which seek to bind known plaintiffs concerning claims wholly or predominantly for money judgments. We intimate no view concerning other types of class actions such as those seeking equitable relief.\n\nId at 811 n.3 (emphasis added).\n\nThe limitation of Shutts to claims of known plaintiffs that are predominantly for money damages forecloses application of its holding to 23(b)(1)(B) actions which have always been equitable and often involve unknown plaintiffs. See Newberg \u0026 Conte, 1 Newberg on Class Actions ยง 1.18.\n\nClass actions date back to the English common law where chancery courts used bills of peace to bind entire classes. Chafee, Bills of Peace with Multiple Parties, 45 Harv. L. Rev. 1297 (1932). The traditional limited-fund class action is an equitable and unitary Disposition of a fund too small to satisfy all claims. See Fed. R. Civ. P. 23 advisory committee's note. Unitary adjudication of a limited fund is crucial because allowing plaintiffs to sue individually would make the litigation \"an unseemly race to the courtroom door with monetary prizes for a few winners and worthless judgments for the rest.\" Coburn v. 4-R Corp., 77 F.R.D. 43, 45 (E.D. Ky. 1977). Limited-fund class actions effect a pro-rata reduction of all claims in order to treat all claimants fairly. Thus, they sound in equity even though the relief they provide necessarily affects the amount of money damages that claimants can ultimately receive. In re Joint Eastern \u0026 Southern Dist. Asbestos Litigation (Findley), 1996 WL 76145 at * 11 (2d Cir. 1996); Newberg and Conte, 1 Newberg on Class Actions ยง 1.18.\n\nDue process standards for suits seeking equitable relief are set forth in Hansberry v. Lee, 311 U.S. 32, 85 L. Ed. 22, 61 S. Ct. 115 (1940) where the Supreme Court stated:\n\nthis Court is justified in saying that there has been a failure of due process only in those cases where it cannot be said that the procedure adopted, fairly insures the protection of the interests of absent parties who are to be bound by it.\n\nId. at 42. See also Shutts, 472 U.S. at 808 (citing Hansberry in its description of due process requirements for traditional class actions). The rule that adequate representation is all that due process requires for the traditional mandatory class action in equity was not challenged by Shutts. Subsequent decisions have made it clear that, consistent with due process, absent parties can be bound by a judgment where they were adequately represented in a prior action. Martin v. Wilks, 490 U.S. 755, 762 n. 2, 104 L. Ed. 2d 835, 109 S. Ct. 2180 (citing Hansberry and Fed R. Civ. P. 23).\n\nActions under Rule 23(b)(1)(B) are precisely the type of limited circumstances noted by Martin where \"equitable circumstances dictate the need for a unitary adjudication regardless of the individual consent of the parties affected.\" Newberg and Conte, 1 Newberg on Class Actions ยง 1.22 at 1-51. As a result, due process requires only that all parties bound by the Global Settlement Agreement were adequately represented. We have already concluded that they were.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nThe intervenors object that some members of the class may not have minimum contacts with the Eastern District of Texas and have not otherwise consented to the district court's jurisdiction. They also claim that the Global Settlement Agreement is without authority to release future claims that have not yet accrued. These objections again ignore the equitable nature of this action.\n\nDue process requires adequate representation in a 23(b)(1)(B) case but, as Shutts expressly cautioned, minimum contacts or consent to jurisdiction are not necessary in equitable class actions. Newberg and Conte, 1 Newberg on Class Actions, ยง 1.20 (\"Minimum Contacts Jurisdiction Not Required for Members of Equitable Class Suits\") and ยง 1.21 (\"Opt-Out Rights or Implied Consent of Members Not Required for Jurisdictional Due Process in Equitable Class Suits\"). It is also well settled that a unitary adjudication of a limited fund binds future, contingent, and unknown claimants who, by definition, could not give consent to jurisdiction. Mullane v. Central Hanover Bank \u0026 Trust Co., 339 U.S. 306, 94 L. Ed. 865, 70 S. Ct. 652 (1950).\n\nRule 23(b)(1)(B) actions closely resemble actions for interpleader, or for the accounting of a trustee. See Mullane, 339 U.S. at 311-13; In re Joint Eastern and Southern Dist. Asbestos Litigation (Findley), 878 F. Supp. 473, 478, 562 (E.\u0026 S.D.N.Y. 1995); In re Joint Eastern and Southern Dist. Asbestos Litigation (Eagle-Picher), 134 F.R.D. 32, 38 (E.\u0026 S.D.N.Y. 1990). Cf. In re Federal Skywalk Cases, 680 F.2d 1175, 1182-83 (8th Cir. 1982). This is because all claimants will recover from the fund or not at all. This view of a limited-fund class action as similar to an action in rem makes particular sense because, although limited-fund actions often involve unknown or unavailable claimants who cannot expressly consent to jurisdiction, the court in such an action has before it for Disposition all the assets in which class members could claim an interest. See e.g., In re the Drexel Burnham Lambert Group, Inc., 960 F.2d 285, 292 (2d Cir. 1992); In re Joint Eastern and Southern Dist. Asbestos Litigation (Eagle-Picher), 134 F.R.D. 32, 38 (E.\u0026 S.D. N.Y. 1990); Coburn v. 4-R Corp., 77 F.R.D. 43 (E.D. Ky. 1977). The court can appropriately adjudicate all claims against the fund because of its jurisdiction over the fund and the fact that all potential claimants are adequately represented before it. Smith v. Swormstedt, 57 U.S. (16 Howard) 288, 302, 14 L. Ed. 942 (1853).\n\nFinally, the intervenors complain that the Global Settlement Agreement purports to release claims which do not present \"a case or controversy.\" This misconstrues the nature of the settlement which does not purport to make any determination of the validity or amount of individual personal injury claims against Fibreboard. What the settlement does is address the immediate and important controversy of whether future claimants will be able to receive compensation for their injuries before Fibreboard runs out of money. It resolves this controversy by settling the insurance coverage litigation, capping the amount recovered by individual plaintiffs at $500,000, prohibiting punitive damage awards, and limiting the amount that the Global Trust can pay out in any given year. These provisions are designed to ensure that latecomers do not find their claims impaired because the winners of the race to the courthouse have claimed all of Fiberboard's assets in the early rounds of individual litigation. The argument that plaintiffs who have already been exposed to asbestos have no justiciable interest in ensuring that funds remain available to compensate them when they contract asbestos-related diseases is not supportable and has been widely rejected. See In re Johns-Manville Corp., 36 Bankr. 743, 749 (S.D. Bankr. N.Y. 1984); Carlough v. Amchem Products, Inc., 10 F.3d 189, 196 n. 4 (3d Cir. 1993). The intervenors' objection is meritless.\n\nThe district court properly found that Fibreboard is a limited fund which will be depleted to the detriment of latecomers if claims are litigated on an individual basis. Due process requires that class members in Ahearn, an equitable class action for a pro-rata distribution of a limited fund, receive adequate representation by class representatives with similar interests. The district court did not abuse its discretion in finding that these requirements were met and certifying this suit as a Rule 23(b)(1)(B) class action.\n\nC. Other Objections\n\n1. \"Friendly\" suit\n\nThe intervenors assert that Ahearn was a collusive or \"friendly\" suit in contravention of the \"case or controversy\" requirement of Article III in the Constitution. Specifically, the intervenors allege that (1) there was no real conflict between the parties because the complaint and settlement were filed the same day and class representatives never intended to litigate the claims alleged in the complaint, and (2) the defendants handpicked the plaintiffs' attorneys. These arguments fail because they conflict with relevant caselaw and do not address the district court's findings of fact regarding the non-collusive nature of the settlement negotiations. The intervenors also ignore the adversarial positions which the parties occupied before settlement negotiations and the positions to which they will return if the settlement is not approved.\n\nA \"case or controversy\" under Article III requires that the parties be truly adverse. United States v. Johnson, 319 U.S. 302, 87 L. Ed. 1413, 63 S. Ct. 1075 (1943). This requires a continuing controversy, Preiser v. Newkirk, 422 U.S. 395, 401, 45 L. Ed. 2d 272, 95 S. Ct. 2330 (1975), and an \"honest and actual antagonistic assertion of rights.\" Johnson 319 U.S. at 305 (quoting Chicago \u0026 Grand Trunk Ry. Co. v. Wellman, 143 U.S. 339, 345, 36 L. Ed. 176, 12 S. Ct. 400 (1892)).\n\nThe parties in Ahearn filed their proposed settlement agreement on the same day as the plaintiff class filed its complaint so they clearly did not intend to litigate the complaint. However, this does not change the adversarial nature of the disputes which the settlement resolves and does not contradict the district court's finding that settlement negotiations were heated, difficult and conducted at arm's length. The intervenors are apparently asking us to hold that the suit is either moot or collusive simply because it was filed at the same time as a settlement requiring court approval. Neither of these Conclusions is supportable.\n\nThe Supreme Court has stated that the existence of a proposed settlement does not render an action moot where judicial approval of the settlement is required before the settlement will bind the parties. Havens Realty Corp. v. Coleman, 455 U.S. 363, 371 n. 10, 71 L. Ed. 2d 214, 102 S. Ct. 1114 (1982). Ahearn was a class action that could not be settled without court approval so the parties' agreement to settle the case did not make it moot.\n\nThe other finding suggested by the intervenors, that the suit is collusive simply because the parties have resolved their differences and seek only the judicial approval required by Rule 23(e), is equally unsupportable and has also been rejected. See Carlough v. Amchem Products, 10 F.3d 189, 201 (3d. Cir. 1993) (adopting the reasoning of the district court's October 6, 1993 opinion in Carlough v. Amchem Products, Inc., 834 F. Supp. 1437, 1465 (E.D. Penn. 1993)); In re Joint Eastern and Southern District Asbestos Litigation (Findley), 982 F.2d 721, 728 (2d Cir. 1992) (complaint and settlement filed the same day); SEC v. Randolph, 736 F.2d 525 (9th Cir. 1984) (controversy exists even though settlement and complaint were filed the same day).\n\nThe district court found that the Ahearn complaint and proposed settlement were not collusive. The intervenors' assertions to the contrary have no support in the record. The district court found that the negotiation process was slow, contentious and fraught with disagreements on serious issues. Its exhaustive findings of fact detail the parties' initial positions and their slow movement toward a settlement that offers a fair compromise of their various claims.\n\nThe complaint that Fibreboard handpicked the plaintiffs' attorneys is equally without merit and tells only part of the story. The record shows that Fibreboard did approach the attorneys to negotiate a global settlement but the intervenors fail to include important details such as (1) the plaintiffs' lawyers involved in the negotiations have extensive experience in asbestos litigation, and (2) the district court found that the plaintiffs' lawyers vigorously represented their clients' position. We have already concluded that the Global Health Claimant Class was adequately represented by qualified attorneys. The fact that Fibreboard initiated negotiations with a group of highly experienced, top-notch plaintiffs' attorneys in order to craft a global settlement suggests that Fibreboard wanted a fair settlement that a court was likely to approve.\n\n2. Recusal of Judge Parker\n\nThe Flanagan intervenors appeal from Judge Steger's order in the district court denying their motion to recuse Judge Parker. They argue that Judge Parker should not have mediated the settlement and then conducted a fairness hearing on the same settlement. We review Judge Steger's decision for abuse of discretion. In re Hipp, 5 F.3d 109, 116 (5th Cir. 1993).\n\nA Judge must disqualify himself under ยง 455 if his impartiality \"might reasonably be questioned.\" 28 U.S.C. ยง 455. The standard for determining impartiality depends on the source of the Judge's alleged prejudice. To the extent that a Judge has become biased due to facts he has learned during a judicial proceeding, he must recuse himself only if fair judgment would be impossible. Liteky v. United States, 510 U.S. 540, 127 L. Ed. 2d 474, 114 S. Ct. 1147, 1157 (1994). If the alleged partiality stems from a source other than a judicial proceeding, a Judge must recuse himself if \"a reasonable and objective person, knowing all of the facts, would harbor doubts concerning the Judge's partiality.\" United States v. Jordan, 49 F.3d 152, 155 (5th Cir. 1995).\n\nJudge Parker's role in the negotiating process was insubstantial and stemmed from three cases filed in his court. His actions were limited to appointing Judge Patrick E. Higginbotham of this court as a settlement facilitator, appointing class counsel for the Global Health Claimant Class at the recommendation of Judge Higginbotham, receiving regular reports of the negotiations and mediating the global settlement negotiations personally for part of one evening. After the parties agreed to a settlement, Judge Parker held an extensive fairness hearing and appointed an independent guardian ad litem to report on the fairness of the settlement to the futures class.\n\nJudge Steger found that \"on the basis of the entire record and taking all of Mr. Jaques' allegations as true,. no reasonable person would conclude that Judge Parker is biased and no reasonable person would harbor doubts about his impartiality.\"\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e Our review of the record confirms that Judge Parker carefully avoided any appearance of impropriety. The district court did not abuse its discretion in denying the motion to recuse.\n\n3. Plant Insulation Company\n\nPlant Insulation Company, a member of the Global Third-Party Claimant Class, argues that its due process rights were violated because it was not allowed to opt out of that class. Plant did not attempt to intervene in the proceeding before the district court so it has no standing to appeal the district court's ruling. The Fifth Circuit has held that \"non-named class members do not have standing to appeal the final judgment in a class action.\" Walker v. City of Mesquite, 858 F.2d 1071, 1073, 1074 (5th Cir. 1988). As a result, \"we have no jurisdiction to consider an appeal by a class member who has not attempted to intervene as a named party.\" Loran v. Furr's/Bishop's Inc., 988 F.2d 554 (5th Cir. 1993). See also, Edwards v. City of Houston, 1996 WL 115638 (5th Cir. April 1, 1996)(en banc)(unions had no standing to appeal the court's final judgment because they never became named parties or intervenors in the suit). Accordingly we dismiss Plant's appeal for lack of standing.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\n4. Other objections of the Flanagan intervenors\n\nThe Flanagan intervenors raise several more objections common to Ahearn and Rudd. They argue that merchant mariners are differently situated from other members of the Global Health Claimant Class because of differences between admiralty law and the tort law of some states. This argument ignores the fact that the Global Settlement Agreement allows claimants the same rights they would receive in the tort system (limiting only the amount of total damages and punitive damages). Admiralty law will provide the backdrop for any maritime plaintiff's settlement because that law will govern the trials of maritime plaintiffs who choose the back-end opt-out provision.\n\nFinally, the Flanagan intervenors claim that the district court improperly used defendant classes. They argue that defendant classes are only appropriate in cases where defendants are guilty of egregious misconduct. This argument has no support in the language of Rule 23 and is contrary to a wide range of cases where courts have certified defendant classes without requiring a \"widespread pattern of wrongful conduct.\" See e.g., Blake v. Arnett, 663 F.2d 906, 911-13 (9th Cir. 1981) (defendant class of Yurok Indians on counterclaims seeking declaration eliminating alleged Indian treaty rights in land held by lumber and mining company); Board of Regents of University of Nebraska v. Dawes, 522 F.2d 380, 381 (8th Cir. 1975) cert. denied, 424 U.S. 914, 47 L. Ed. 2d 318, 96 S. Ct. 1112 (1976)(defendant class of employees allegedly discriminated against by plaintiffs); Garneau v. City of Seattle, 897 F. Supp. 1318, 1320 (W.D. Wa. 1995)(defendant class of low-income tenants seeking relocation assistance from plaintiffs); Houston Chapter of the Int'l Ass'n of Black Professional Firefighters v. Houston, 1991 WL 340296, at * 3, * 28 (S.D. Tex. May 3, 1991) (defendant class of present and future non-black, non-Hispanic firefighters who will be eligible for certain ranks in the Houston Fire Department).\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nIII. RUDD\n\nIn addition to the claims addressed above, the Flanagan intervenors make several objections specific only to Rudd.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nA. Fibreboard as an Indispensable Party\n\nThe Flanagan intervenors argue that the Rudd action must be dismissed for lack of an indispensable party, Fibreboard.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e Although they failed to raise this issue in the district court, we may still consider it on appeal. United States v. Sabine Shell, Inc., 674 F.2d 480, 482 (5th Cir. 1982). However, \"failure to raise the issue of joinder until this appeal mitigates against a finding in their favor.\" Id. at 483. We agree with the Ninth Circuit that \"when the judgment appealed from does not in a practical sense prejudicially affect the interests of the absent parties, and those who are parties have failed to object to non-joinder in the trial court, the reviewing court will not dismiss an otherwise valid judgment.\" Sierra Club v. Hathaway, 579 F.2d 1162, 1166 (9th Cir. 1978), cited with approval in McCulloch v. Glasgow, 620 F.2d 47, 51 (5th Cir. 1980). See also Judwin Properties Inc. v. United States Fire Insurance Co., 973 F.2d 432, 434 (5th Cir. 1992) and Sabine Shell, 674 F.2d at 483.\n\nBoth the Trilateral Health Claimant Class and the Trilateral Third-Party Claimant Class agreed to a consent judgment sought by the Insurers declaring approval of the Trilateral Settlement Agreement and the release of the Insurers. Because Fibreboard has already consented to entry of a similar release of the Insurers in Ahearn, the Rudd judgment does not prejudicially affect Fibreboard. Thus, Rudd should not be dismissed for want of an indispensable party.\n\nB. Justiciability of the Rudd Claim\n\nThe Flanagan intervenors argue that the Rudd complaint fails to state a cause of action or a \"case or controversy.\" The Insurers in Rudd seek declaratory and injunctive relief determining that (1) the Trilateral Settlement Agreement is fair, reasonable, and negotiated at arm's length in good faith; (2) the defendant classes approve of the Trilateral Settlement Agreement and the release of the Insurers; and (3) the defendant classes be enjoined from asserting future claims against the Insurers.\n\nThe Declaratory Judgment Act does not expand the jurisdiction of the federal courts. See Skelly Oil Co. v. Phillips Petroleum Co., 339 U.S. 667, 671-72, 94 L. Ed. 1194, 70 S. Ct. 876 (1950). Similarly, it does not create substantive rights; it is only a procedural device that enhances the remedies available in the adjudication of a case or controversy. See Aetna Life Ins. Co. v. Haworth, 300 U.S. 227, 240, 81 L. Ed. 617, 57 S. Ct. 461 (1937).\n\nA justiciable case or controversy exists as long as the court's ruling will affect \"tangible legal rights.\" ASARCO, Inc. v. Kadish, 490 U.S. 605, 619, 104 L. Ed. 2d 696, 109 S. Ct. 2037 (1989). In Maryland Casualty Co. v. Pacific Coal \u0026 Oil Co., 312 U.S. 270, 61 S. Ct. 510, 85 L. Ed. 826 (1941), the Supreme Court stated that \"basically, the question in each case is whether the facts alleged, under all the circumstances, show that there is a substantial controversy, between parties having adverse legal interests, of sufficient immediacy and reality to warrant the issuance of a declaratory judgment.\" Id. at 273, 61 S. Ct. at 512.\n\nIn Rudd, the Insurers seek a declaratory judgment that because the Trilateral Settlement Agreement is fair and negotiated in good faith, it cuts off all rights of both Trilateral Health Claimants and Trilateral Third-party Claimants to payments under the policies. The Insurers were justifiably concerned that after they spend $2 billion on the Trilateral Settlement with Fibreboard, the settlement could be challenged by asbestos victims and third-party claimants, particularly if Fibreboard becomes insolvent. The Insurers in Rudd sought to cut off this potential challenge by obtaining the declaratory and injunctive relief described above.\n\nMany states recognize that a tort victim injured during the policy period has sufficient legal interest in that policy to attack subsequent changes that affect the right to recover -- i.e., reformation, cancellation, or settlement of the policy. See, e.g., Maryland Casualty Co., 312 U.S. at 273-74 (a tort victim has a potential financial interest in the injurer's insurance policy, and the impairment of this interest is an injury that will support standing under Article III); Bankers Trust Co. v. Old Republic Insurance Co, 959 F.2d 677, 682 (7th Cir. 1992) (\"the victim of an insured's tort, even though he is not a third-party beneficiary of his injurer's insurance policy, has a legally protected interest in that policy before he has reduced his tort claim to judgment\"). Some states even require the injured party to be included in any negotiations of policy changes that will affect their rights. See e.g., Smith \u0026 Wesson v. Birmingham Fire Ins. Co., 123 A.D.2d 135, 510 N.Y.S.2d 606, 608 (N.Y.A.D. 1987); Maryland Cas. Co. v. Wilson, 6 Ariz. App. 470, 433 P.2d 650, 652 (Ariz. App. 1967); Shapiro v. Republic Indem. Co., 52 Cal. 2d 437, 341 P.2d 289, 291 (Cal. 1959); Womack v. Allstate Ins. Co., 156 Tex. 467, 296 S.W.2d 233, 236 (Tex. 1956). Thus, the Insurers faced a substantial threat of collateral attacks from members of both the Trilateral Health Claimant Class and the Trilateral Third-party Claimant Class asserting that the Trilateral Settlement was unfair or fraudulent. A true controversy existed.\n\nThe Flanagan intervenors also argue that the Trilateral Settlement Agreement is effective only if the Ahearn settlement is rejected. Flanagan argues that this continguency precludes a finding that Rudd is an adjudication of a \"present right upon established facts.\" Brown \u0026 Root, Inc. v. Big Rock Corp., 383 F.2d 662, 665 (5th Cir. 1967).\n\nThe Trilateral Settlement Agreement contains provisions that become operative regardless of whether the Global Settlement Agreement is ultimately approved or disapproved; for example, the parties agree in the Trilateral Settlement Agreement to compromise all Fibreboard's claims under the insurance policies not previously released, including claims for property damages. The Global Settlement Agreement only refers to personal injury claims filed against Fibreboard after August 27, 1993. Therefore, the effectiveness of the Trilateral Settlement Agreement is not wholly contingent on the outcome in Ahearn.\n\nMoreover, the case would be ripe even if the effectiveness of the Trilateral Settlement Agreement were wholly contingent upon the disapproval of the Global Settlement Agreement. In Chevron U.S.A., Inc. v. Traillour Oil Co., 987 F.2d 1138 (5th Cir. 1993), we found a case would be ripe for adjudication notwithstanding the existence of some contingency to the claim if either (1) there is \"a substantial possibility\" that the contingency will occur, or (2) the only questions being presented \"are purely legal ones.\" Id. at 1154. We found judicial resolution of contingent claims is consistent with the purpose of the Declaratory Judgment Act which is \"to settle actual controversies before they ripen into violations of law or breach of some contractual duty.\" Id. (quoting Hardware Mutual Casualty Co. v. Schantz, 178 F.2d 779, 780 (5th Cir. 1949)).\n\nIn Rudd, the contingency that the global settlement might not receive court approval or might be successfully attacked was a substantial possibility; the global settlement was an innovative approach to unique circumstances. The parties to Ahearn had no assurance that a court would accept this settlement which is the reason the Ahearn plaintiffs insisted on a back-up agreement to settle the coverage issue. Thus, we agree with the district court that the Rudd complaint presented a justiciable claim.\n\nConclusion\n\nAlthough appellants' arguments challenging the approval of the global settlement are not insubstantial, on the unique facts presented here they do not carry the day. The global settlement was driven by insurance coverage litigation between Fibreboard and the Insurers which would have been catastrophic for whomever was on the losing side. None of the parties was prepared to take the enormous risk inherent in that litigation. The global settlement offers all sides the best solution possible by eliminating costly disputes between Fibreboard, its insurers, and asbestos claimants and ensuring an equitable distribution to asbestos claimants. The $1.5 billion global settlement was a major accomplishment by all parties concerned and no one seriously challenges its adequacy or the desirability of avoiding another bankruptcy of a vigorous American company.\n\nFor the reasons stated above, we conclude that in this case none of the legal impediments argued by appellants precluded the district court from approving the global or trilateral settlements. Both settlements were legally sound resolutions of serious disagreements. The judgment of the district court is\n\nAFFIRMED.\n\nDisposition\n\nAFFIRMED.\n\nJERRY E. SMITH, Circuit Judge, Dissenting:\n\nI. Introduction.\n\nThe district court and the majority undoubtedly are driven by a commendable desire to resolve voluminous personal injury claims against an otherwise strong American company and to ensure an orderly transfer of funds from the company's insurers to its victims. In order to accomplish this result, however, they have extinguished claims over which they have no jurisdiction and deprived thousands of asbestos victims of basic constitutional rights. The result is the first no-opt-out, mass-tort, settlement-only, futures-only class action ever attempted or approved.\n\nIronically, the willingness to jettison centuries-old legal precepts hurts the very victims they intend to help: The settlement forces asbestos victims to surrender their claims in exchange for a meager $10 million of Fibreboard's $225-250 million net worth. They also benefit from Fibreboard's settlement with its insurers, but Fibreboard and the insurers had powerful incentives to settle that dispute by themselves; in fact, they did so for $2 billion.\n\nThere was no need even to involve the class in those negotiations, much less to sacrifice its interests. \"Thus, the class members appear to have traded Fibreboard's liability for nothing to which they did not already have a right.\"\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nOn the other hand, the district court and the majority have bailed Fibreboard's shareholders out of a mammoth liability and awarded $43.7 million to class counsel. This suit was supposedly brought on behalf of Fibreboard's victims, but of the four entities directly affected by the settlement Fibreboard, class attorneys, courts, and asbestos victims the victims were the only entity absent from the bargaining table. Perhaps for that reason, they also were the only losers.\n\nHow could well-intentioned Judges sanction indeed, compel such an untoward result? Apparently this is simply a case of Judges both trial and appellate trying too hard to solve the vexing problems posed by unending asbestos litigation. Having certified at least two other high-profile asbestos class actions,\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e then-Chief District Judge Parker was acutely aware of the problems posed by asbestos litigation. In the end, he appears to have become too close to both the overall problem and the instant settlement to continue to act in a judicial capacity in this case.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e When Fibreboard and class counsel announced at a court hearing that they had reached a settlement, Chief Judge Parker referred to \"extensive negotiations between counsel that the Court has participated in.\" Also at that time, and long before the fairness hearing, he said, \"We will trust in the scholarship, the good judgment and common sense of the . . . courts of appeal in the event this comes to their attention.\" In short, Chief Judge Parker tried his best to solve a perplexing problem, and it is our task to figure out whether that solution is legally sustainable.\n\nThere are two primary problems: (1) Fibreboard, class counsel, and Fibreboard's other creditors have combined to profit at the expense of absent class members; and (2) this case is an affront to the integrity of the judicial system. As we observed when reversing Chief Judge Parker's certification of another class action against Fibreboard: \"The Judicial Branch can offer the trial of lawsuits. It has no power or competence to do more.\" Fibreboard, 893 F.2d at 712.\n\nA. Importance and Uniqueness.\n\nThis case is extraordinarily important. Prior to the filing of this suit, no one had ever attempted a no-opt-out, mass-tort, settlement-only, futures-only class action. Ever since the district court's certification order, however, corporate America has been \"anxiously awaiting\" a decision in this case. Richard B. Schmitt, The Deal Makers: Some Firms Embrace the Widely Dreaded Class-Action Lawsuit, WALL ST. J., July 18, 1996, at A1. The majority's unequivocal approval of Fibreboard's litigation strategy undoubtedly will lead \"other financially threatened companies throughout the nation [to] utilize it as a road map for sheltering their assets and improperly restricting the rights of their present and future victims.\" Amicus Br. of Trial Lawyers for Public Justice at 2-3.\n\nThus, the majority's reliance upon the \"unique facts\" of this case, see maj. op. at 66, is ironic: The unique fact of the insurance dispute is simply irrelevant, and the other unique facts a corporate defendant's hand-picking class counsel, cutting a side deal, reaching a \"global settlement\" affecting only \"future\" plaintiffs, and choosing a sympathetic Judge to approve the settlement likely will become far too common now that the majority has approved of them. \"What was meant to provide a remedy for those who would otherwise lack one, enabling them to pool their voices and finances, will become a device to take away remedies from those who could otherwise invoke them.\" John Leubsdorf, Co-Opting the Class Action, 80 CORNELL L. REV. 1222, 1223 (1995).\n\nB. The Need for Procedural Protections.\n\nTwo primary errors led the district court and the majority astray. These are, first, underestimating the importance of jurisdictional and procedural protections for absent class members, and second, departing from the judiciary's exclusive area of authority and competence the resolution of lawsuits.\n\nWe must keep in mind that it was the defendant Fibreboardwho selected the class that was to \"sue\" it and the class action lawyers who were to do the dirty work. Fibreboard hand-picked a class that was uniquely vulnerable to exploitation, class counsel who were widely reported to have sold out a similar class, and a court with a reputation for favoring a global settlement. Class counsel then cut a side deal with Fibreboard before agreeing to the class settlement, and the district Judge presided at the fairness hearing on the very settlement he had helped to craft.\n\nThe settlement extinguishes claims of people over whom we lack jurisdiction, some of whom have not yet been injured and others of whom have not even been born. It also prevents such future claimants from opting out, because of a supposed need to divide a limited fund among a large number of claimants, but it grants automatic opt-outs to all those who already had filed suit. Coincidentally or not, this gerrymandered class definition includes those most vulnerable to abuse while excluding those most likely to intervene, to monitor class counsel, and to oppose the settlement.\n\nIt is fair to question for whom class counsel really worked. Fibreboard picked them, the district court approved them, the insurers paid them, and in exchange, they bailed out Fibreboard's shareholders and relieved district courts of potentially thousands of cases at the expense of the absent asbestos victims whom class counsel purportedly represent.\n\nIf all that was at stake for individual class members was some nominal compensation for having been charged an extra five cents on a bag of potato chips, one might not be too concerned with how the courts enforced class counsel's duties to these people. But often much more is at stake, such as whether a plaintiff will recover for a fatal illness caused by a defective product, and if so, how much. Today, such a person may have her rights adjudicated by a court without actual notice of the action and before she even knows she has been injured. Fantastic as this may seem . . ., it is true.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nBut it need not be. Even rudimentary constitutional protections such as according absent class members adequate representation and adjudicating only their presently-existing, legally cognizable injuries would have prevented Fibreboard from perpetuating this unfortunate miscarriage of Justice.\n\nC. Legislated Tort Reform.\n\nThe district court legislated a bold and novel tort reform proposal thinly disguised as the settlement of a lawsuit. Of course, there never was a lawsuit: Fibreboard and its hand-picked class counsel agreed to file a suit only if they already had settled it. Thus, Chief Judge Parker began his opinion by stating, \"This action was filed to obtain judicial approval of a class settlement.\" Ahearn v. Fibreboard Corp., 162 F.R.D. 505, 507 (E.D. Tex. 1995).\n\nThe class complaint alleges exposure-only claims for which the settlement provides no compensation. Class counsel even conceded that, as a matter of practice, they do not pursue such claims on behalf of their own clients; instead, they wait and file suit after a plaintiff actually has suffered an injury. The only reason to include those claims in the complaint was to manufacture jurisdiction over class members who have not yet manifested symptoms of asbestosis or otherwise suffered a legally cognizable injury. Even that attempt to trump up jurisdiction should fail, however, as many states do not recognize an exposure-only cause of action.\n\nMoreover, the settlement does not resolve the rights of individual class members. The only genuinely judicial aspect of approving the settlement is the release of Fibreboard from liability to the class, or more specifically, the transfer, from Fibreboard's shareholders to its victims, of the risk that Fibreboard's insurance assets are inadequate.\n\nThe remainder of the settlement is purely legislative: Class members' causes of action are repealed in favor of the equivalent of a workers' compensation regime.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e The Association of Trial Lawyers of America summed up this point nicely in an amicus brief opposing the settlement: \"The alchemy of the [instant] settlement . . . had the effect of transforming the common law damage claims of asbestos victims, which were clearly safeguarded by the right to trial by jury, into administrative claims without that right.\" Amicus br. at 9.\n\nEven if exchanging state tort law for this private, alternative dispute resolution mechanism were the boon to class members that the majority holds it out to be and I doubt that it is, see infra part IX such a policy decision is \"better addressed to the representative branches Congress and the State Legislature.\" Fibreboard, 893 F.2d at 712. In addition, Fibreboard hardly deserves more than $200 million for drafting the legislation.\n\n\"Traditional ways of proceeding reflect far more than habit.\" Fibreboard, 893 F.2d at 710. As Judges are trained and equipped to adjudicate, not legislate, it is understandable that the courts have fallen prey to powerful special interest groups a wealthy defendant and the class action bar and unwittingly disserved the very victims the courts were intended to help.\n\nD. Constructive Bankruptcy.\n\nNor does Fibreboard's \"constructive bankruptcy\" justify abridgment of absent class members' substantive state law rights. In bankruptcy, the claims of all of Fibreboard's creditors, not just its \"future\" personal injury victims, would be crammed-down. Permitting Fibreboard to effect a reorganization bankruptcy proceeding in the guise of a futures-only class action circumvents the detailed protections of the Bankruptcy Code for the express purpose of imposing the entire cost of the bailout on Fibreboard's most vulnerable creditors, to the betterment of its shareholders.\n\nThe Second Circuit decertified a similar settlement class for precisely that reason:\n\nEvasion of bankruptcy is . . . not without costs or other perils. . . . Class members in cases such as this would have no say in the conduct of the court-appointed class representatives and, unlike creditors in bankruptcy, are not able to vote on a settlement. For them, it would be \"cram-down\" from start to finish.\n\nKeene Corp. v. Fiorelli (In re Joint E. \u0026 S. Dist. Asbestos Litig.), 14 F.3d 726, 732 (2d Cir. 1993) (citation omitted). The amicus brief of the Trial Lawyers for Public Justice puts the point more forcefully: \"Instead of protecting class members from the risk that their ability to obtain relief from Fibreboard will be 'substantially impaired,' certification of the proposed settlement class here ensures that the class members' ability to obtain relief from Fibreboard will be totally eliminated.\" Amicus br. at 6.\n\nE. Creating a Circuit Split.\n\nOur sister circuits have rejected all other actions that came even close to attempting what Fibreboard has done here. The Ninth Circuit has squarely held that opt-out rights are available in all class actions seeking predominantly monetary damages, regardless of the subsection under which they were certified. See Brown v. Ticor Title Ins. Co., 982 F.2d 386, 392 (9th Cir. 1992), cert. dismissed, 511 U.S. 117 (1994). Two other circuits appear to agree with the Ninth, and none has expressly disagreed. See infra note 16. Without even citing that authority, however, the majority arbitrarily limits opt-out rights to actions certified under FED. R. CIV. P. 23(b)(3), see maj. op. at 50 n.16, exalting an irrelevant technicality over the underlying reality and creating a circuit split in the process.\n\nEarlier this year, the Third Circuit firmly held that class counsel cannot adequately represent both extant and latent claimants in a futures-only asbestos class action. Georgine v. Amchem Prods., 83 F.3d 610, 630-31 (3d Cir. 1996). The court explained that while extant claimants those who have already incurred injuries desire immediate, unlimited recovery from the trust, latent claimants those who have yet to suffer an injury desire that recovery be capped or delayed to ensure that extant claimants will not deplete the fund. Id.\n\nThe majority mentions Georgine only in a brief footnote, distinguishing it on the ground that the Georgine settlement provides a detailed claims resolution schedule, while the Ahearn settlement does not. See maj. op. at 23 n.8. Class counsel still served conflicting interests, however, and postponing some distributional issues until after certification and appeal hardly makes them disappear. The majority may prefer the devil it does not know to the devil it does, but I am loath to make that decision for an entire class of people who are not even aware that we are \"adjudicating\" their rights.\n\nOn the other hand, the majority is correct that Keene is easy to distinguish, for the defendant in that action was forthright: Instead of retaining plaintiffs' counsel and having them file a complaint asserting claims they had no intention of pursuing (as occurred here), the asbestos manufacturer asked the court to oversee the negotiation of a settlement. See Keene, 14 F.3d at 728-29. The Second Circuit dismissed the action, finding that \"it is a self-evident evasion\" of the Bankruptcy Code, \"the exclusive legal system established by Congress for debtors to seek relief.\" Id. at 732. Future defendants presumably will draw one of two Conclusions: Involve the court as little as possible in settlement class actions, or file in the Fifth Circuit.\n\nIn sum, the settlement fails either a customary legal analysis or a common-sense smell test. I respectfully but vehemently Dissent from all but part III of the majority opinion.\n\nII. Facts and Procedural History.\n\nThough the background to this case is somewhat complicated, the key facts are hard to overlook. Fibreboard approached four plaintiffs' lawyers, including Ron Motley and Joe Rice, and suggested that they negotiate a \"global settlement\" of all of Fibreboard's asbestos liabilities. The negotiations initially failed, perhaps because of the massive scope of the undertaking.\n\nFibreboard then adopted a risky strategy of assigning claims against its insurers in settlement of individual suits. The danger was that these settlements arguably violated the insurance policies. Fortunately for Fibreboard, a California court approved the deals.\n\nThen something odd happened: Fibreboard settled a large number of cases with Ness Motley and Rice's law firm by assigning insurance assets, and brought an action in the Eastern District of Texas seeking approval of the settlement. Why would Fibreboard, a California company, roll the dice in Texas when it had already won in California? Because something important had happened in Pennsylvania.\n\nThe Judicial Panel on Multidistrict Litigation had transferred all pending asbestos cases not yet on trial to a district court in Pennsylvania. See Georgine v. Amchem Prods., 83 F.3d 610, 619 (3d Cir. 1996). Then-Chief Judge Robert Parker of the Eastern District of Texas wrote a letter to the transferee Judge, telling him that he (the Pennsylvania Judge) was \"the Eisenhower of this D-Day operation\" and encouraging him to prod the parties to a global settlement. See Coffee, supra note 1, at 1390.\n\nWhen the plaintiffs' steering committee rejected such a proposal, twenty defendants approached a minority faction of the committee Motley and Gene Locksand reached a global settlement with them. See id. at 1391-92, 1457 . Actually, they made a series of deals: a class action settlement for future asbestos victim claimants and separate settlements for the lawyers' pre-existing, individual clients.\n\nThe separate settlements were significantly more lucrative than the class one. See id. at 1392-93; Koniak, Feasting, supra note 4, at 1052. In fact, Motley received fifty percent more for his own clients than he did for those in the class. See Coffee, supra note 1, at 1397; Koniak, Feasting, supra note 4, at 1067. The Third Circuit rejected the settlement, finding that class counsel including Motleywere hopelessly conflicted. See Georgine, 83 F.3d at 630-31.\n\nAs the Georgine negotiations concluded, Fibreboard and Ness Motley settled a number of cases and, as noted above, filed an action in Chief Judge Parker's court. Fibreboard thereby secured class counsel with a track record of making global settlements and a Judge with a demonstrated commitment to them.\n\nFollowing the Georgine pattern, class negotiations reached an impasse over the future of Ness Motley's remaining cases against Fibreboard. The court-appointed \"Settlement Facilitator,\" Judge Patrick Higginbotham, then suggested that they settle those cases before attempting further negotiation of a global settlement. After concluding the Ness Motley deal which settled the individual claims for higher-than-average amounts, contingent upon successful completion of a global settlement Fibreboard and class counsel resumed negotiation of such a settlement.\n\nAs those negotiations drew to a close, Chief Judge Parker intervened, taking counsel to his house for a final mediation session. It appears that he was successful, for defense counsel eventually increased their offer to an amount that class counsel later accepted.\n\nClass counsel then filed a complaint in Chief Judge Parker's court, along with motions to certify the class and approve the settlement. The Judge certified the class and found that the settlement was fair.\n\nAnd Fibreboard's stock soared.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\n\nIII. The Forest for the Trees.\n\nThe majority commits two fundamental errors: first, treating justiciability, due process rights, and certification criteria as mere annoyances to be brushed aside in pursuit of what it believes to be the greater good; and second, failing to assess the aggregate effect of its restrictions on asbestos victims' due process rights.\n\nJusticiability and certification requirements are indispensable in any class action. Justiciability looks, among other things, to whether a person has suffered a legally cognizable injury. If an individual has not been legally injured, it is unlikely that he would receive notice of the action or realize that he is a member of the class. Even if he became aware of the action's potential effect on his legal rights, he would likely remain apathetic: Any effect on him is remote in time and contingent on the future development of a disease or other damage or injury. Thus, such class members are especially vulnerable to abuse by class counsel.\n\nSimilarly, certification criteria such as commonality, typicality, and adequacy of representation ensure that representative litigation is truly representative. If class counsel stand to gain from selling out the class or from benefiting one subgroup of claimants over another, some or all class members are deprived of a meaningful opportunity to be heard one of the most fundamental of all due process rights.\n\nThe majority addresses each class protection device in isolation, always finding that the protection does not apply because of a legal rule developed in a different context or an historical analogy that fails to recognize the novelty of this action. Such tunnel vision obscures the fact that while a particular protection might not always be necessary, some combination of protections is. When courts remove all meaningful safeguards as the majority does here class members suffer dramatically.\n\nA. The Danger Inherent in Representative Litigation.\n\n\"It is a principle of general application in Anglo-American jurisprudence that one is not bound by a judgment in personam in a litigation in which he is not designated as a party . . . .\" Hansberry v. Lee, 311 U.S. 32, 40, 85 L. Ed. 22, 61 S. Ct. 115 (1940). This \"deep-rooted historic tradition that everyone should have his own day in court,\" 18 CHARLES A. WRIGHT ET AL., FEDERAL PRACTICE AND PROCEDURE (hereinafter \"WRIGHT \u0026 MILLER\") ยง 4449, at 417 (1981), creates the core of due process: the rights to notice, to control one's own case, and to an opportunity to be heard.\n\nThe class action device is an equitable exception to this bedrock principle. See Hansberry, 311 U.S. at 41. Not surprisingly, such a \"fundamental departure from the traditional pattern in Anglo-American litigation generates a host of problems.\" Mars Steel Corp. v. Continental Ill. Nat'l Bank \u0026 Trust Co., 834 F.2d 677, 678 (7th Cir. 1987). More bluntly, \"class actions are extraordinary proceedings with extraordinary potential for abuse.\" General Motors Corp. v. Bloyed, 916 S.W.2d 949, 953 (Tex. 1996).\n\nAccordingly, the Constitution's guarantee of due process requires us to use this joinder device carefully: In exchange for losing the right to prosecute his own action, a class member must receive a variety of substitute protections. See Phillips Petroleum Co. v. Shutts, 472 U.S. 797, 811-12, 86 L. Ed. 2d 628, 105 S. Ct. 2965 (1985); Hansberry, 311 U.S. at 45. Though the Supreme Court has largely refrained from determining the scope of those protections, its scant jurisprudence establishes two related principles: First, the extent to which due process requires procedural protections necessarily depends upon the extent to which class members' interests are infringed;\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e and second, we must meet new uses of the device with new protections.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\nIn short, the safeguards required by due process necessarily differ according to the type of action, and when confronted with a new animal, we must analyze those safeguards anew. Reliance on strained analogies to inapposite traditional actions leaves us in what one commentator has aptly labeled a \"due process quandary.\"\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e Thus the irony: The majority eviscerates well-established due process protections because of the \"unique facts\" of the case, see maj. op. at 66, but fails to recognize that those novel facts may actually call for enhanced, not lessened, protections for vulnerable asbestos victims.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\n\nB. Vulnerability of the Class.\n\nThis case is indeed such a new animal. The district court certified a class\n\n(1) including people who have not yet been injured or do not yet know that they have been injured;\n\n(2) excluding all present claimants;\n\n(3) for settlement purposes only;\n\n(4) in a mandatory action seeking predominately monetary damages.\n\nCertification of futures-only actions creates a massive potential for abuse. Many putative future claimants have manifested no symptoms and do not even know they were exposed. Others are the future spouses and children of asbestos victims, most of whom either do not exist or could not possibly know that they are class members. Thus, the due process standbys notice and an opportunity to be heard are meaningless to countless future claimants.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\n\nMoreover, future claimants are, by definition, persons who have not yet developed a sufficient interest in their claims to file suit; thus, they are likely to be passive and particularly vulnerable to exploitation.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e Finally, courts have a rotten track record with futures-only actions: Of the two largest such actions, one is Georgine, and the other settlement fell apart because the parties radically underestimated the number of claimants. See Coffee, supra note 1, at 1417-18 (discussing failure of Dow Corning settlement).\n\nThese concerns are mitigated somewhat by the breadth of the \"futures\" class. Some members are presently injured and aware of their injuries, and some have even spoken with lawyers. While most of these claimants might not have retained counsel for the sole purpose of intervening, some might have, and others at least might have chosen to opt out, had that protection not been removed as well.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e Of course, any such intervenors protect only their own interests, which differ dramatically from those of class members who are not presently injured. See infra part VI.A.2. Thus, futures-only classes are still highly vulnerable to abuse.\n\nThis case also presents a radical extension of the mandatory class action. The class complaint seeks, and the settlement provides, predominately monetary relief. While historically we have permitted mandatory actions when a class sought to litigate joint rights regarding a common fund, the only common fund in this case is the settlement proceeds. To the extent that there is a limited fund, it is a contrived one, created by the litigation and settlement strategies of Fibreboard and its insurers. See infra note 17.\n\nThe concept of a futures-only mandatory action is also self-contradictory. If we must bind victims in the class in order to protect their rights and ensure an equitable distribution, then we must bind all such victims, not just some. Limiting the class to future claimants grants the equivalent of an automatic opt-out to present claimants, and there is simply no principled way of distinguishing the one group from the other.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\n\nArbitrariness in the class definition might not present a problem by itself, but future claimants, unlike present claimants, are particularly vulnerable. Exclusion of all present claimants has the effect (if not the purpose) of excluding all those who are likely to receive notice, monitor the class action, and oppose the class attorneys' conflicts and other inadequacies.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e\n\nFinally, this is a settlement class action. Permitting such actions creates an unparalleled opportunity for collusion between defendants and class counsel, as both stand to gain from negotiating a deal providing generous fees for counsel and meager recovery for the class. See In re Gen. Motors Corp. Pick-Up Truck Fuel Tank Prods. Liab. Litig., 55 F.3d 768, 788 (3d Cir.), cert. denied, 133 L. Ed. 2d 45, 116 S. Ct. 88 (1995); Crampton, supra note 4, at 826-27. Moreover, a defendant may pick his opposing counsel and then negotiate with absolutely nothing to lose from walking away from the deal; class counsel, on the other hand, work pro bono unless they consent to a settlement.\n\nIf nothing else, use of a mandatory settlement action with an automatic opt-out for all those likely to intervene, and no opt-out for anyone else, raises a red flag. To the best of my knowledge, no one has ever attempted to do such a thing before: Even the now-discredited Georgine settlement permitted opt-outs.\n\nC. Diminished Protection for the Class.\n\nA novel action laden with such an extreme potential for abuse certainly demands a close look, but the majority accepts the settling parties' distortion of that background reality and actually ratchets down the degree of protection accorded absent class members.\n\nThe Ahearn settlement is really two agreements: one between Fibreboard and the insurers to settle their policy disputes for $1.525 billion, and another between the futures class and Fibreboard to limit the class's recovery to insurance proceeds plus $10 million of Fibreboard's $225-250 million net worth. Fibreboard and the insurers did not need class proceedings to reach the first agreement. Avoiding an all-or-nothing judgment in the California coverage litigation gave them a powerful incentive to settle, regardless of whether they could extinguish future claims at the same time. As the majority observes, \" None of the parties was prepared to take the enormous risk inherent in that litigation.\" Maj. op. at 66 (emphasis added). In fact, Fibreboard and the insurers did reach such a settlement. See maj. op. part III (unanimously approving that agreement).\n\nWith that cloak removed, the second half of the Ahearn settlement is wholly baseless. The class members surrendered their claims against Fibreboard, submitted to an arbitration procedure, and agreed to a total cap on damages, individual caps on damages, an absolute ban on punitive damages, and other restrictive provisions. In exchange, Fibreboard gave the class a mere $10 million less than five percent of its net worth. Fibreboard sought certification based upon a constructive bankruptcy theory, but it walked away with barely a scratch. Not surprisingly, Fibreboard's stock skyrocketed when the settlement was announced. See Coffee, supra note 1, at 1402 \u0026 n.232.\n\nEven accepting the settling parties' mischaracterization of the settlement does little to justify certification, however, for traditional class protections still prevent it.\n\nIV. Due Process and the Right To Opt Out.\n\nThe majority's treatment of opt-out rights is a paradigmatic example of its erroneous reasoning. Though the Court plainly held in Phillips Petroleum Co. v. Shutts, 472 U.S. 797, 812, 86 L. Ed. 2d 628, 105 S. Ct. 2965 (1985), that class members have a right to opt out of actions (such as this) seeking primarily monetary relief, the majority refuses to recognize that right, on the ground that it was not historically available in traditional \"common fund\" litigation.\n\nThe majority's holding that all rule 23(b)(1) class actions are immune from Shutts is in direct conflict with the holding of a sister circuit.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e Moreover, this case presents anything but a traditional common fund,\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e and the majority's attempt to analogize it to an action to settle a trust is entirely unjustified: Far from adjudicating equitable rights in a preexisting fund, the settlement creates a common fund by extinguishing personal rights of action. In short, the majority rationalizes its evisceration of a right that we have already recognized with a call to historical rigidity.\n\nA. Basic Requirements of the Shutts Case.\n\nShutts could not be more unambiguous:\n\nWe hold that due process requires at a minimum that an absent plaintiff be provided with an opportunity to remove himself from the class by executing and returning an \"opt out\" or \"request for exclusion\" form to the court.\n\n472 U.S. at 812 (citations and footnotes omitted). The Court, however, specifically limited its holding to claims \"for money damages or similar relief at law,\" as opposed to actions seeking \"equitable relief.\"\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e Thus, Shutts teaches that in an action seeking money damages, an absent plaintiff is entitled to the right to opt out.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e\n\nFollowing Shutts, a mandatory class action is viable in two cases: (1) where the court has jurisdiction over all the plaintiffs or (2) where the plaintiffs seek equitable relief. Unlike the majority, I believe that whether a class action seeks equitable relief or money damages can be determined only by focusing on the underlying remedy the plaintiffs seek. See, e.g., Findley I, 982 F.2d at 735 (affirming certification of a mandatory class action but noting that it would violate due process if the request for relief were for money damages rather than division of a trust).\n\nIf one focuses on the plaintiffs' remedy, the Ahearn class cannot be characterized as one \"seeking equitable relief.\" The complaint alleges only personal causes of action against Fibreboard for money damages.\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e The prayer for relief seeks general and special compensatory damages, punitive damages, costs of the suit, appropriate declarations and orders, and other relief as may be deemed just and proper. These remedies represent paradigmatic legal remedies.\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e 1 DAN B. DOBBS, DOBBS LAW OF REMEDIES (hereinafter \"LAW OF REMEDIES\") ยงยง 3.1-3.2 (2d ed. 1993). The majority, maj. op. at 23, agrees: \"The central remedial and legal theory of each of the named plaintiffs [is] that Fibreboard is liable in tort for damages incurred due to exposure to Fibreboard asbestos.\"\n\nB. The Majority's Circumvention of Shutts.\n\nThe majority circumvents Shutts by calling Ahearn an equitable action.\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e Instead of focusing on the plaintiffs' remedies, the majority characterizes the action based on which subsection of rule 23 the court invoked to certify the class. From the historical fact that rule 23(b)(1)(B) originated in courts of equity, the majority concludes that all actions certified under rule 23(b)(1)(B) are equitable and thus immune from Shutts.\n\n1. Conflict with Other Circuits.\n\nThe majority's holding is in direct conflict with decisions of the Third and Ninth Circuits. See Brown ; In re Real Estate Title. The Ninth Circuit has directly held that Shutts applies to rule 23(b)(1)-(b)(2) actions when the plaintiffs' underlying claims are for money damages. Brown, 982 F.2d at 392. The Third Circuit also has recognized that a mandatory class action does not have a res judicata effect on absent class members when the underlying claims are for money damages and the court did not have personal jurisdiction over the plaintiffs. In re Real Estate Title, 869 F.2d at 768-69. The majority fails to discuss either case.\n\nBoth cases arose out of the same antitrust class action. See Brown, 982 F.2d at 388-89. The original class complaint sought money damages and injunctive relief and was certified under rule 23(b)(1) \u0026 (b)(2). In re Real Estate Title, 869 F.2d at 760, 763. The action settled on terms favorable to the defendant, and a number of absent plaintiffs were left without a settlement check.\n\nThe first case challenging the no-opt-out class action arose by way of injunction in the Third Circuit. Following settlement of the class action, a number of absent plaintiffs filed a new suit against the same defendants for the same activity. The defendants asked the district court that heard the original class action to enjoin the Arizona state court suit. In re Real Estate, 869 F.2d at 762. The district court granted the injunction, but the Third Circuit reversed, classifying the original class action as a hybrid suit seeking both money damages and equitable relief. Id. at 768-69. The court applied Shutts and held that the district court did not have personal jurisdiction over the absent plaintiffs in the original action and that it would violate due process for the court to enjoin a collateral attack on the class action. Id.\n\nThe other shoe dropped in a subsequent action filed in federal court in Arizona. The defendants raised a res judicata defense to the plaintiffs' claim, pointing to the class action settlement. The Ninth Circuit rejected the defendants' arguments, holding that the class action did not have a res judicata effect on absent plaintiffs over whom the district court in the original class action did not have personal jurisdiction. Brown, 982 F.2d at 392. The court relied on Shutts and held that the absent plaintiffs' money damage claims could not be foreclosed by a rule 23(b)(1) class action, because the action did not include a right to opt out. Id.\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e\n\n2. Conflict with Shutts.\n\nThe majority's approach to classifying this action is also fundamentally at odds with the approach used by the Shutts Court. The exception in Shutts is for actions seeking \"equitable relief,\" not for class actions that have their origins in equity.\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e The Court explicitly recognized that class actions originated as an equitable joinder device, and all class actions are \"equitable\" in that limited sense. Shutts, 472 U.S. at 808. See also Hansberry v. Lee, 311 U.S. 32, 41, 85 L. Ed. 22, 61 S. Ct. 115 (1940) (\"The class suit was an invention of equity. . . .\"); 7A WRIGHT \u0026 MILLER ยง 1751, at 7. Despite that fact, the Court classified the action in Shutts as one for money damages. 472 U.S. at 811.\n\nThe only possible Conclusion that can be drawn from the Court's reasoning is that the distinction between damage remedies and equitable remedies turns on what remedies the plaintiff seeks, not on his choice of joinder devices. To hold otherwise, as the majority does in this case, would create an internal inconsistency in Shutts : If the origin of the class action is determinative of the classification of an action, then every class action, including the one in Shutts, would be an equitable action.\n\n3. Misunderstanding Equitable Remedies.\n\nThe majority's assertion that rule 23(b)(1)(B) actions are unique in that they involve only equitable claims is based on an apparent misunderstanding of \"equitable remedies\" and the history of the class action. Prior to the merger of law and equity, the majority would have been correct in classifying all rule 23(b)(1)(B) class actions (or more appropriately their historical antecedents) as equitable actions, but for reasons different from those the majority offers.\n\nBefore law and equity were merged, every class action would have been equitable, as the class action was a procedural device that was available only in courts of equity.\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e As a result, every class action aggregated claims seeking equitable remedies or applying equitable substantive law. The fact that the device was once used exclusively by equity courts does not foreclose the possibility, however, that the device currently is used in conjunction with legal remedies.\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e\n\nEven the majority's own authorities recognize that class actions are now used to aggregate both legal and equitable claims. See 1 NEWBERG ON CLASS ACTIONS ยง 1.18, at 1-46 (recognizing that suits certified under rule 23(b)(1) \"predominately (but not exclusively) involve suits seeking equitable relief\"). When Professor Newberg posits that Shutts will not apply to classic limited fund cases, he does so because those cases aggregate equitable claims, not because the device had its origins in equity.\n\nIt is unlikely that Shutts will be construed to change the highly focused nature of the equitable relief addressed in these limited fund class actions by requiring opt-out rights which might serve to frustrate the equitable ends of these suits. There are other types of equitable class actions, such as suits to declare a dividend or suits for injunctive relief against a defendant who has acted generally against a class, which similarly . . . will not be challenged.\n\nId. ยง 1.21, at 1-49 (emphasis added, footnotes omitted).\n\n4. Formalistic Distinctions.\n\nThe majority's unyielding mantra that rule 23(b)(1) actions are equitable actions makes due process turn on an untenable formalistic distinction between rule 23(b)(1) and rule 23(b)(3), whereunder class actions under rule 23(b)(3) are subject to Shutts, and those certified under rule 23(b)(1) are not. The distinction finds no support in Shutts, which involved a state equivalent of rule 23(b)(3) and not the federal rule itself. The Court's analysis, which centered on the need to protect an absent plaintiff from the inherent dangers of representative actions, did not focus on what type of class action was involved, for relying on such a distinction ignores the fact that many class actions can be certified under more than one subsection of rule 23. 1 NEWBERG ON CLASS ACTIONS ยง 4.01, at 4-4 through 4-5; 3B J.W. MOORE ET AL., MOORE'S FEDERAL PRACTICE P 23.31[3], at 236-37 (2d ed. 1995); 7A WRIGHT \u0026 MILLER ยง 1772, at 425. In fact, a vast majority of classes that meet the requirements of rule 23(b)(1)(B) inevitably will satisfy the rule 23(b)(3) requirements. 1 NEWBERG ON CLASS ACTIONS ยง 4.01, at 4-5. Due process does not turn on such formalistic distinctions.\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e\n\nC. The Distinction Between Law and Equity.\n\nThe majority's argument that applying Shutts to rule 23(b)(1) would render all mandatory class actions unconstitutional, is also premised on a faulty understanding of the distinction between law and equity. See maj. op. at 50 n.16. What the majority fails to acknowledge is that the distinction between money damages and equitable remedies preserves mandatory class actions in the vast majority of cases, including traditional common fund cases from equity. See NEWBERG ON CLASS ACTIONS ยง 1.18, at 1-46 (recognizing that the majority of actions that meet the requirements of rule 23(b)(1) seek equitable relief). The only cases affected by Shutts are modern cases, such as Ahearn, that fall within the broad scope of the rule but do not involve a true common fund.\n\nTake for example Smith v. Swormstedt, 57 U.S. 288, 14 L. Ed. 942 (1853), and Hartford Life Ins. Co. v. Ibs, 237 U.S. 662, 59 L. Ed. 1165, 35 S. Ct. 692 (1914), two cases that represent the paradigmatic mandatory class action. Both survive Shutts because neither involved money damages. In Smith, the class representatives filed a bill in chancery for the division of a trust, a traditional equitable remedy.\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e 57 U.S. at 312. See 1 LAW OF REMEDIES ยง 2.3(1), at 75. In Ibs, the mandatory class action at issue also involved distributions from a trust.\u003cspan class=\"fnref\"\u003e50\u003c/span\u003e 237 U.S. at 671. Although both actions resulted in a distribution of money, neither involved a legal claim for money damages. See 1 LAW OF REMEDIES ยง 3.1 (discussing money awards available in equity, but distinguishing between money damages and equitable remedies that award money).\n\nThe difference between legal and equitable actions, while subtle, is important. In an equitable action such as an action by the beneficiary of a trust, a plaintiff's pro rata rights to the trust corpus are already established. Whether the action proceeds individually or as a class action is irrelevant to absent plaintiffs, because in both cases their rights in the corpus of the trust will be affected. See In Re Joint E. \u0026 S. Dist. Asbestos Litig. (\"Findley II\"), 878 F. Supp. 473, 530-33 (E. \u0026 S.D.N.Y. 1995) (explaining why the already severe limitations on a trust beneficiary mean that a representative action will do little to diminish a beneficiary's rights). In fact, in some cases the class device enhances an absent plaintiff's rights by providing him a voice; the classic limited fund is such a case. The same is not true in a case for money damages.\n\nThe decision to proceed individually or as a class makes all the difference in a case for money damages, because only in a class action are a plaintiff's rights controlled by another party. The most obvious consequence of such control is that class representatives may settle to the detriment of absent class members in order to benefit themselves. The inherent risk of such a result is exactly what drove the Court to adopt due process protections in such cases. See Shutts, 472 U.S. at 809-11.\n\nD. Unconstitutional Use of the Federal Rules.\n\nFinally, the majority's reliance on the strong presumption of constitutionality that the Federal Rules of Civil Procedure receive is misplaced. The novelty in this case is not the insistence on opt-out rights but on the extension of class actions, particularly rule 23(b)(1)(B) class actions, to mass torts and the expansion of rule (b)(1)(B) to \"constructive bankruptcy.\" Such a use of the federal rules is novel, and in particular the rise of mass torts was unforeseen by the drafters of the rule. Castano v. American Tobacco Co., 84 F.3d 734, 746 \u0026 n.23 (5th Cir. 1996).\n\nThe majority's attempt to hide behind the traditional acceptance of mandatory class actions is unavailing in this extension of rule 23(b)(1), for the presumption of constitutionality enjoyed by the Federal Rules of Civil Procedure disappears when the rules are applied in a way unanticipated by their drafters. See 19 WRIGHT \u0026 MILLER ยง 4509. In short, while this action falls within the broad scope of rule 23(b)(1)(B), that fact does not immunize it from due process protections, including opt-out rights.\u003cspan class=\"fnref\"\u003e51\u003c/span\u003e\n\nV. Commonality and Typicality.\n\nThe majority is correct that our precedents preclude us from decertifying the class for lack of commonality and typicality. The majority's Discussion of these criteria is misleading, however, and its readiness to skip over the protections without considering the consequences is yet another manifestation of its tunnel vision.\n\nA. Circuit Precedent.\n\nLong before defense attorneys even dreamed of mandatory, mass-tort, futures-only class actions, we held that \"tentative or temporary settlement classes are favored when there is little or no likelihood of abuse, and the settlement is fair and reasonable and under the scrutiny of the trial Judge.\" Meat Price Investigators Ass'n v. Iowa Beef Processors (In re Beef Indus. Antitrust Litig.), 607 F.2d 167, 174 (5th Cir. 1979), cert. denied, 452 U.S. 905, 69 L. Ed. 2d 405, 101 S. Ct. 3029 (1981). We even went so far as to \"agree\" with Professor Newberg that parties may \"compromise their differences, including class action issues, through this means.\" Id. at 177-78 (quoting 3 NEWBERG ON CLASS ACTIONS ยง 5570c, at 476). We took Beef Industry to its logical Conclusion two years later, finding that evaluation of the fairness of a settlement entails a consideration of \"the strength of plaintiffs' case on the merits,\" including \"the risks of class decertification.\" Adams Extract Co. v. Pleasure Hours, Inc. (In re Corrugated Container Antitrust Litig.), 643 F.2d 195, 216 (5th Cir. Apr. 1981).\n\nNote the bizarre effect of these opinions: Certification criteria are designed in part to protect the class against inadequate representatives, but Beef Industry permits those very representatives to compromise the requirements. Corrugated Container compounds the effect by holding that certification criteria are part of the merits of a class action. Thus, when it is less likely that certification is proper, and therefore more likely that an individual plaintiff has a right to prosecute his own action, a smaller settlement is necessary to extinguish that right.\n\nThe majority is more subtle, finding that all class members have a common interest in reaching a settlement that includes certain terms. See maj. op. at 21. Even so, a generalized common interest is not a \"question[] of law or fact common to the class.\" FED. R. CIV. P. 23(a)(2) (emphasis added).\n\nSimilarly, the majority finds that the legal and remedial theories of the class representatives are typical of those of the class because all class members (1) claim that \"Fibreboard is liable in tort for damages incurred due to exposure to Fibreboard asbestos\" and (2) possess a common interest in settling for a large amount. See maj. op. at 23-24. Once again, the latter category of \"interests\" has nothing to do with the underlying legal theories.\n\nThe majority's characterization of the plaintiffs' claims is also true only at an extreme level of generality. If a man raped a woman in California and exposed himself to another in Texas, both women might claim that he is \"liable in tort for damages incurred due to [sexual misconduct],\" but no one would seriously claim that the legal theory of battery is similar to that for, say, intentional infliction of emotional distress.\n\nNor have the settling parties even attempted to bootstrap themselves into typicality by crafting a settlement that postpones resolution of non-typical issues. The settlement's prohibition on punitive damages affects plaintiffs from different states differently; its caps on individual recovery discriminate against the most seriously injured class members; and its spendthrift provisions alter the distribution of funds between extant and latent claimants. Thus, the settling parties have negotiated an alteration of the class members' substantive rights vis-a-vis one another. In short, the majority dutifully follows our precedent by treating commonality and typicality as mere procedural obstacles to be cleared out of the way.\n\nB. Problems with Circuit Precedent.\n\nThree factors make our duty to follow Beef Industry and Corrugated Container a regrettable one. First, rule 23(a) has a purpose: to protect the due process rights of absent class members.\u003cspan class=\"fnref\"\u003e52\u003c/span\u003e Compliance with the rule might prevent us from lumping people with divergent interests into a single class, but the rule is meant to do just that.\u003cspan class=\"fnref\"\u003e53\u003c/span\u003e\n\nSecond, the difficulty inherent in assessing the substantive fairness of a settlement makes prophylactic procedural protections crucial to the protection of absent plaintiffs.\u003cspan class=\"fnref\"\u003e54\u003c/span\u003e The range of \"fair\" settlements is wide in any case,\u003cspan class=\"fnref\"\u003e55\u003c/span\u003e and settlement classes present unique opportunities for collusion between class counsel and defendants.\u003cspan class=\"fnref\"\u003e56\u003c/span\u003e Once the machinery of a settlement class action is set in motion, the judiciary has a very hard time controlling it; thus, it is critical that we craft that machinery well.\n\nFinally, the majority once again fails to consider the interaction of these due process protections with the others it denies. Professor Newberg, the primary proponent of settlement classes, justified relaxing the rule 23(a) criteria by looking to other protections, most notably opt-out rights, to protect the class. See 2 NEWBERG ON CLASS ACTIONS ยง 11.28, at 60-61. Similarly, the Beef Industry court observed that opt-out rights would help \"offset\" the loss of other protections. See 607 F.2d at 175. Thus, relaxing rule 23(a) criteria and denying opt-out rights make for a lethal combination.\u003cspan class=\"fnref\"\u003e57\u003c/span\u003e\n\nVI. Inadequate Representation.\n\nThat leaves two significant due process requirements, the first of which is adequate representation. Instead of vigorously enforcing this requirement, however, the majority lets it slide as well.\n\nA. Standard of Review.\n\nIn ordinary litigation, a plaintiff does not need the court to ensure that his attorneys are performing adequately; he can monitor and control them himself. In class litigation, however, class members have no practical control over their attorney.\u003cspan class=\"fnref\"\u003e58\u003c/span\u003e Their only remedy against shoddy representation is to opt out of the class, but the district court denied them even that protection. Having left class members defenseless against their own counsel, the court's duty to ensure adequate representation became all the more critical. Rule 23(a)(4) prohibits a court from certifying a class without first ascertaining that it will receive adequate representation. Rule 23's concerns are not merely prudential, but constitutional: Due process demands that class members receive adequate representation before they are bound by a judgment.\u003cspan class=\"fnref\"\u003e59\u003c/span\u003e An attorney who labors under a conflict of interest cannot satisfy the requirements of rule 23(a)(4).\u003cspan class=\"fnref\"\u003e60\u003c/span\u003e\n\nWe must not confuse rule 23(a)(4) with rule 23(e), which scrutinizes only the substantive fairness of a settlement.\u003cspan class=\"fnref\"\u003e61\u003c/span\u003e Rule 23(a)(4) guarantees due process, and a substantively adequate result cannot cure procedural inJustice.\u003cspan class=\"fnref\"\u003e62\u003c/span\u003e\n\nMore importantly, substantive adequacy does not necessarily mean that a settlement is truly fair; an attorney who negotiated an adequate settlement might have negotiated a better one but for a conflict of interest.\u003cspan class=\"fnref\"\u003e63\u003c/span\u003e Indeed, it would be odd if rule 23(a)(4) did require a court to examine the terms of a settlement; rule 23(a)(4) is a certification requirement, and certification usually precedes settlement. Rules 23(a)(4) and 23(e) are complements, not substitutes; a court applies rule 23(a)(4) before certification to insure procedural fairness and rule 23(e) after settlement to guarantee substantive adequacy.\n\nWe apply a mixed standard of review to a district court's determination that a conflict of interest does not exist. The existence of a particular set of circumstances is a factual determination that we review for clear error. Whether those circumstances amount to a conflict of interest is a legal question that we review de novo. FDIC v. United States Fire Ins. Co., 50 F.3d 1304, 1311 (5th Cir. 1995) (\"we interpret the controlling ethical norms governing professional conduct as we would any other source of law\") (quoting Dresser, 972 F.2d at 543); see also id. (stating that \"we will perform a 'careful examination,' or de novo review, of the district court's application of the relevant rules of attorney conduct\"). No factual dispute exists in this case, and therefore we must review the district court's decisions de novo.\n\nB. Class Counsel's Financial Conflict.\n\nNess Motley represented the class during settlement negotiations despite a financial interest in reaching a settlement that diverged from the class's interest. A divergent financial interest is a paradigmatic conflict of interest, yet the majority refuses to concede that this conflict may have denied the class adequate representation.\n\nThe conflict stemmed from Ness Motley's simultaneous representation of both the class and individual plaintiffs who were also suing Fibreboard. While the class settlement negotiations were proceeding, Fibreboard and Ness Motley agreed to settle all of Ness Motley's pre-existing individual lawsuits for a higher-than-average amount. That settlement was partly contingent, however, on Ness Motley and Fibreboard's settling the class claims.\n\nIf the class did not settle its claims, Fibreboard would still pay half of the individual plaintiffs' settlement, but they would receive the entire settlement if the class settled.\u003cspan class=\"fnref\"\u003e64\u003c/span\u003e Because Ness Motley represented the individual plaintiffs, but not the class, on a contingency basis, it had a financial interest in settling the class claims on any terms whatsoever, even if those terms were unfavorable to the class.\n\nThe majority dismisses this conflict by pretending that Ness Motley, the individual plaintiffs, and the class had similar interests in reaching a class settlement. This is simply wrong.\n\nNess Motley and the individual plaintiffs had a financial interest in seeing the class settle on any terms. In contrast, the class desired a settlement only if it was more lucrative than the alternative awaiting the outcome of the coverage case. The expected value of that alternative was significant. If the California Supreme Court affirmed the two lower courts that had ruled favorably for the class, the class would enjoy a practically unlimited compensation fund. Accordingly, it is easy to imagine a proposed settlement beneficial to Ness Motley and the individual plaintiffs but unfavorable to the class.\n\nThe district court never should have allowed Ness Motley to represent the class. Rule 23(a)(4) simply does not permit an attorney to represent a class if he suffers from a conflict of interest. It does not matter whether Ness Motley negotiated a favorable settlement; rule 23(a)(4)'s concerns are procedural, not substantive. Even if, arguendo, the settlement was favorable, an unconflicted attorney might have negotiated a better one. Fibreboard's attorneys knew that Ness Motley had an interest in settling on any terms, and they undoubtedly converted this knowledge into negotiating leverage.\n\nThe conflict of interest in this case was direct and egregious. But I would go a step further and prohibit class counsel from ever simultaneously representing individual plaintiffs in cases such as this, as there is too great an opportunity for corruption.\n\nConsider the different fee structures a plaintiffs' attorney faces in class and individual litigation. As class counsel, he will be compensated under the lodestar formula,\u003cspan class=\"fnref\"\u003e65\u003c/span\u003e leaving him no financial stake in the settlement. When representing an individual plaintiff, he will receive a contingency fee, vesting him with a significant financial stake in the outcome of the litigation.\n\nA shrewd but unethical attorney will accept a significantly smaller settlement in a class action in exchange for a more modest increase in an individual settlement. And even an attorney who would refuse such an outright bribe might be tempted to make concessions during the class negotiations, hoping to develop goodwill that will pay dividends when negotiating over the individual lawsuits.\n\nThis is not simply a theoretical problem. Consider the Georgine case, in which Ness Motley also simultaneously represented the class and individual plaintiffs. While negotiating the class settlement, Ness Motley and the Georgine defendants settled the individual claims for a total of about $138 million. Koniak, Feasting, supra note 4, at 1067. Under the terms of the class settlement, on the other hand, the individual plaintiffs would have been entitled to a maximum of about $90 million. Id.\n\nAt the least, in Georgine Ness Motley treated the individual plaintiffs preferentially. At worst, Ness Motley obtained a concession from the defendants at the expense of the class. In either case, it acted improperly and to the detriment of the class, and it is to prevent such behavior that I would prohibit simultaneous representation altogether.\u003cspan class=\"fnref\"\u003e66\u003c/span\u003e\n\nC. The Conflict Between Extant and Latent Claimants.\n\nAnother conflict of interest arose from the class attorneys' simultaneous representation of both class members with extant claims and those with latent claims.\u003cspan class=\"fnref\"\u003e67\u003c/span\u003e Because they may seek recovery from the settlement fund immediately, extant claimants would profit from high ceilings on recovery or none at all, as there was little danger that the fund would be depleted before it paid their claims. Latent claimants, on the other hand, cannot seek recovery until some triggering event occurs.\u003cspan class=\"fnref\"\u003e68\u003c/span\u003e Because they may be unable to file a claim for a number of years, they would benefit from damage caps low enough to ensure that the settlement fund will not dry up before it pays their claim.\n\nThe majority fails to recognize this obvious conflict of interest. In fact, it makes no mention of the Third Circuit's holding in Georgine that an impermissible conflict of interest occurs whenever extant and latent claimants are represented by the same attorney.\u003cspan class=\"fnref\"\u003e69\u003c/span\u003e Georgine 's analysis is worth quoting at length:\n\nThe most salient conflict in this class action is between the presently injured and futures plaintiffs. As rational actors, those who are not yet injured would want reduced current payouts (through caps on compensation awards and limits on the number of claims that can be paid each year). The futures plaintiffs should also be interested in protection against inflation, in not having preset limits on how many cases can be handled, and in limiting the ability of defendant companies to exit the settlement. Moreover, in terms of the structure of the alternative dispute resolution mechanism established by the settlement, they should desire causation provisions that can keep pace with changing science and medicine, rather than freezing in place the science of 1993. Finally, because of the difficulty of forecasting what their futures hold, they would probably desire delayed opt out like the one employed in Bowling v. Pfizer, Inc., 143 F.R.D. 141, 150 (S.D. Ohio 1992) (heart valve settlement allows claimants who ultimately experience heart valve fracture to reject guaranteed compensation and sue for damages at that time).\n\nIn contrast, those who are currently injured would rationally want to maximize current payouts. Furthermore, currently injured plaintiffs would care little about inflation-protection. The delayed opt out desired by futures plaintiffs would also be of little interest to the presently injured; indeed, their interests are against such an opt out as the more people locked into the settlement, the more likely it is to survive. In sum, presently injured class representatives cannot adequately represent the futures plaintiffs' interests and vice versa.\n\nGeorgine, 83 F.3d at 630-31 (emphasis added).\n\nThe majority's only explanation for its decision is that the district court's determination that a conflict did not exist was supported by the testimony of the settling parties' expert, Geoffrey Hazard, and the district court's own expert, Eric Green. That explanation is hardly compelling.\n\nThe district court's determination that the facts before it did not amount to a conflict of interest was not a finding of fact to which we should defer. Instead, it is a Conclusion of law, see United States Fire Ins. Co., 50 F.3d at 1311 (holding that we review de novo a district court's application of ethical norms governing attorney conduct), and it is not enough simply to note that two hand-picked law professors one chosen by the settling parties and the other by the district court had the same opinion of the law as did that court.\n\nNor is the reasoning behind the legal opinions of Professors Hazard and Green persuasive. According to the majority, both concluded that a conflict did not exist, essentially because both extant and latent claimants would be better off with a settlement than without one. If that was their reasoning, they asked the wrong question.\n\nEven if there was no conflict between extant and latent claimants as to whether a settlement was a good idea, there was undeniably a conflict between the two groups over the terms of the settlement. It may well have been appropriate for the same attorneys to represent extant and latent claimants when negotiating with the defendants over the total amount of the settlement. Once the parties agreed to an amount, however, the interests of extant and latent claimants diverged, and they should have been represented by different attorneys for determination of the terms under which the settlement would be distributed to the class.\n\nD. The Conflict Between Pre- and Post-1959 Victims.\n\nThe global settlement achieved a massive redistribution of wealth. Before the settlement, persons who had been exposed to asbestos before 1959 had far more valuable claims than those who had been exposed after 1959. Fibreboard's insurance policies had expired in 1959, so pre-1959 claimants could seek damages from an insured Fibreboard, with virtually unlimited assets, while post-1959 claimants could only hope to recover from the non-insurance assets of Fibreboard, which amounted to very little. As late as 1993, the settlement value of a pre-1959 claim was three times that of a post-1959 claim.\u003cspan class=\"fnref\"\u003e70\u003c/span\u003e The global settlement, however, eliminated the privileged status of pre-1959 claimants and placed them on equal footing with their post-1959 counterparts.\n\nBecause the settlement deprived pre-1959 claimants of a substantial right, they were entitled to separate representation. The majority contends that the class as a whole benefited by sacrificing the special rights of pre-1959 claimants, and I emphatically agree. That is precisely the problem: It was in the best interest of one part of the class to give up something that belonged to another part of the class, and that created a conflict of interest.\n\nUnitary class counsel was bound to consider the interests of the class as a whole, and those interests required giving up the rights of pre-1959 claimants. But the rights of pre-1959 victims were theirs alone, and they were entitled to counsel who would not relinquish those rights unless it was in their own best interest. Only separate counsel, representing pre-1959 claimants alone, could have done so.\n\nNor am I persuaded by the majority's contention that Fibreboard would never have negotiated separately with pre-1959 claimants and that unitary representation maximized the value of the settlement. So long as the class was negotiating with Fibreboard over the total value of the settlement, there was no need for separate representation, as pre- and post-1959 claimants had the same interest in obtaining as large a settlement as possible. It was only after the parties had agreed on the total amount of the settlement and had begun to bargain over how it should be divided among the class that pre-1959 claimants needed separate representation. There is no reason to suppose this would have any effect on Fibreboard's willingness to make concessions; it was interested only in the total amount of the settlement, not the allocation of the settlement within the class.\n\nVII. Impartial Judging.\n\nThe second due process requirement that the majority fails to enforce is impartial judging. \"A fair trial in a fair tribunal is a basic requirement of due process.\" In re Murchison, 349 U.S. 133, 136, 99 L. Ed. 942, 75 S. Ct. 623 (1955). Thus, a litigant is entitled to try his case before a Judge who is free of any personal stake in the outcome. Tumey v. Ohio, 273 U.S. 510, 47 S. Ct. 437, 71 L. Ed. 749 (1927).\n\nThis protection is vitally important in a mandatory class action, for the Judge is the only person able to protect class members from an unjust settlement. The class members themselves cannot reject the settlement, and they cannot even reject certification by opting out of the class. They can only present their objections at the fairness hearing and hope the Judge will reject the settlement as inadequate. If the Judge himself is biased in favor of an unfair settlement, then the class has no protection against it.\n\nThe intervenors raise serious questions regarding Chief Judge Parker's ability to conduct an impartial fairness hearing.\u003cspan class=\"fnref\"\u003e71\u003c/span\u003e He had mediated the settlement negotiations, undoubtedly urging the parties to settle on terms he believed to be fair, before the case was even filed. In his lengthy opinion approving the settlement, he referred to his \"assistance in the Discussions\" leading to final agreement. 162 F.R.D. at 516.\n\nHaving helped to craft the settlement, Chief Judge Parker had a personal stake in finding it to be fair: A determination that the settlement was unfair would imply that he had acted unfairly in helping to craft it. In light of these facts, a person might reasonably conclude that Chief Judge Parker, despite his dedicated and painstaking efforts, probably developed a natural bias in favor of his own work.\u003cspan class=\"fnref\"\u003e72\u003c/span\u003e\n\nThe majority concludes that the Judge need not have been recused from the fairness hearing, because the settlement negotiations he mediated were a judicial proceeding. I am not so certain. I agree that we are governed by Liteky v. United States, 510 U.S. 540, 127 L. Ed. 2d 474, 114 S. Ct. 1147 (1994), and that if the settlement negotiations were a judicial proceeding, recusal was not required. I also agree that if the negotiations were a judicial proceeding, we must make a case-specific determination: A Judge may become so involved in settlement negotiations as to warrant recusal even though the negotiations were judicial proceedings. See id. at 1157 (noting that recusal may be warranted where bias stems from a judicial source if it amounts to \"a deep-seated favoritism or antagonism that would make fair judgment impossible\"). As the majority points out, Chief Judge Parker's involvement in this case was not substantial, and recusal is therefore not required unless the settlement negotiations were extrajudicial proceedings.\n\nI part ways with the majority, however, when it comes to deciding whether the settlement negotiations the Judge mediated were judicial proceedings. The majority concludes that they were, though its only explanation is to state that \"Judge Parker's role in the negotiation process . . . stemmed from three cases filed in his court [i.e., the assignment litigation].\" I agree that if the negotiations were a legitimate part of the proceedings in the assignment litigation, they were judicial proceedings. Chief Judge Parker's judicial authority was limited to the assignment litigation, however, and I do not believe that he could conduct judicial proceedings with respect to Ahearn simply because it was somehow related to the assignment litigation.\n\nRemember that the parties had not even filed Ahearn yet. Thus, any time the Judge spent mediating that dispute as opposed to the insurance cases filed in his court was community service, not judging.\u003cspan class=\"fnref\"\u003e73\u003c/span\u003e\n\nThe rules of civil procedure allow Judges to participate in settlement conferences. See FED. R. CIV. P. 16(5) (allowing courts to schedule conference \"facilitating the settlement of the case\"). Rule 16 settlement conferences are judicial proceedings and generally are not an adequate basis for recusal. Cf. Liteky, 114 S. Ct. at 1157 (noting that judicial proceedings \"can only in the rarest circumstances\" form an adequate basis for recusal). The question is whether Chief Judge Parker mediated the settlement negotiations in the course of a rule 16 conference.\n\nIf the settlement negotiations he mediated were chiefly negotiations over the assignment litigation, and settling Ahearn was incidental to settling the assignment litigation, the negotiations probably amounted to a rule 16 conference. If, on the other hand, the primary object of the negotiations was to settle Ahearn, the negotiations do not fall within the bounds of rule 16. That rule allows Judges to schedule conferences only to settle \"the case,\" which surely must mean the case filed and pending before the Judge. Rule 16 cannot permit a Judge to order settlement conferences over cases that are not before him that would be an exercise of power the Constitution does not permit. See U.S. CONST. art. III, ยง 2 (limiting judicial power to actual cases or controversies).\n\nFederal courts are not roving engines of Justice careening about the land in search of wrongs to right. Rather, federal courts were designed to be much like all other courts: passive entities resolving only the quarrels which are properly put before them by interested parties and which are within the competence of courts in a tripartite system of constitutional government.\n\nHaitian Refugee Ctr. v. Civiletti, 503 F. Supp. 442, 461 (S.D. Fla. 1980), modified, 676 F.2d 1023 (5th Cir. Unit B 1982).\n\nI seriously doubt that Chief Judge Parker was conducting settlement negotiations over the assignment litigation and only incidentally settled Ahearn along the way. If so, this is one of the more amazing examples of a tail wagging a dog. I recognize, however, that the content and nature of the settlement negotiations the Judge mediated present a question of fact, and I therefore would remand to the district court for findings in this regard.\n\nVIII. Article III Justiciability.\n\nFinally, the majority simply fails to consider a number of difficult justiciability issues. While questions of Article III standing and variances in state law may seem somewhat rarefied, it is important to remember the central purpose of jurisdictional requirements to keep us in our place. The constitutionally assigned task of the federal judiciary is to resolve cases and controversies that Congress and the Constitution have authorized us to adjudicate. When we depart from that role by considering generalized grievances or private dispute resolution mechanisms, we quickly find ourselves acting more as legislative policymakers than as Judges.\n\nFailure to honor standing requirements, in particular, can result in devastating consequences for those we intend to help. As standing turns in large part on whether an individual has suffered an injury-in-fact, those who lack standing may be unaware that our legislative dalliances eventually will affect them; thus, they are unlikely to speak up for themselves.\n\nThis case presents a particularly egregious example, for the parties and the district court gerrymandered the class to exclude all those who were sufficiently concerned with their injuries to have filed suit. Thus, the class consists largely of people who are unlikely to monitor class counsel's performance or challenge the settlement. In a Justice system that depends on robust adversarial presentations, that dynamic leaves the judiciary ill-equipped to evaluate the procedural and substantive fairness of the negotiations and eventual settlement.\n\nThis case shatters the constitutional limits placed on the authority of the federal courts by Article III, Section 2 of the United States Constitution. We are obligated to consider these issues, sua sponte if necessary, to assure ourselves that the district court properly exercised jurisdiction.\u003cspan class=\"fnref\"\u003e74\u003c/span\u003e It is fairly obvious that here, the district court exceeded its jurisdiction in approving the class action settlement.\n\nA. The Causes of Action.\n\nThe class action complaint alleges only personal causes of action against Fibreboard for money damages.\u003cspan class=\"fnref\"\u003e75\u003c/span\u003e The majority agrees: \"The central remedial and legal theory of each of the named plaintiffs [is] that Fibreboard is liable in tort for damages incurred due to exposure to Fibreboard asbestos.\" Maj. Op. at 23.\u003cspan class=\"fnref\"\u003e76\u003c/span\u003e The district court also recognized that the complaint alleges in personam claims.\u003cspan class=\"fnref\"\u003e77\u003c/span\u003e Thus, Ahearn is a case admittedly an extraordinary one involving multiple, in personam, state-law causes of action aggregated by means of rule 23, the federal class action device.\n\nB. The Basis for Subject-Matter Jurisdiction.\n\nThe majority does not discuss the basis for subject-matter jurisdiction. The plaintiffs and the defendants, in their joint appellate brief, assert that federal jurisdiction was available under 28 U.S.C. ยง 1332 (diversity) and 28 U.S.C. ยง 1335 (interpleader). The district court's published opinion relies on diversity alone as a basis for federal jurisdiction. See Ahearn v. Fibreboard Corp., 162 F.R.D. 505, 522 (E.D. Tex. 1995). In supplemental Conclusions of law filed on the same day, however, the district court claimed that federal jurisdiction also is proper under the interpleader jurisdiction statute.\n\nDiversity of citizenship was an arguable basis for subject-matter jurisdiction. Statutory interpleader jurisdiction is not available here, because there is no res or common fund. See Wausau Ins. Cos. v. Gifford, 954 F.2d 1098, 1100-01 (5th Cir. 1992).\u003cspan class=\"fnref\"\u003e78\u003c/span\u003e Even if interpleader jurisdiction were present, the weighty Article III justiciability issues would still exist.\n\nThese Article III issues arise out of the application of Erie R.R. v. Tompkins, 304 U.S. 64, 82 L. Ed. 1188, 58 S. Ct. 817 (1938), to this multi-state class action. As in cases brought under the ordinary diversity jurisdiction statute, cases brought under statutory interpleader are governed by state substantive law, pursuant to the mandate of Erie. Thus, Erie applies to this class action regardless of whether federal jurisdiction is proper under ordinary diversity, interpleader, or both.\u003cspan class=\"fnref\"\u003e79\u003c/span\u003e\n\nC. Rule 23(e) Approval and Article III.\n\nFederal Rule of Civil Procedure 23(e),\u003cspan class=\"fnref\"\u003e80\u003c/span\u003e which requires that the dismissal or compromise of a class action be approved by a district court, triggers the inquiry into federal jurisdiction. The act of approving or disapproving a class action settlement is an exercise of judicial power by a district court.\u003cspan class=\"fnref\"\u003e81\u003c/span\u003e\n\nUnlike a private settlement in an ordinary case, a class action settlement requires that a federal district court affirmatively exercise its adjudicative authority. Thus, a judicially approved federal class action settlement is a \"judgment.\"\u003cspan class=\"fnref\"\u003e82\u003c/span\u003e The underlying authority to enter such a judgment is, of course, expressly circumscribed by Article III, which limits the judicial power to \"cases\" and \"controversies.\" U.S. CONST. art. III, ยง 2.\n\nIn approving the class action settlement, the district court purported to release i.e., extinguish all claims by class members based on Fibreboard's liability for its asbestos products. See Ahearn, 162 F.R.D. at 517 (stating that Fibreboard and the insurers would receive \"total peace\" in return for providing the global settlement monies). Because the court was exercising its Article III judicial power, it did not have the authority to release claims that did not constitute a valid case or controversy at the time it gave its approval.\n\nThere are cases either holding or suggesting that in a settlement, courts may release claims that they would lack \"jurisdiction\" to try. See, e.g., Adams Extract Co. v. Pleasure House, Inc. (In re Corrugated Container Antitrust Litig.), 643 F.2d 195, 221 \u0026 nn.39-40 (5th Cir. Apr. 1981); Epstein v. MCA, Inc., 50 F.3d 644, 661-64 (9th Cir. 1995), rev'd on other grounds sub nom, Matsushita Elec. Indus. Co. v. Epstein, 134 L. Ed. 2d 6, 116 S. Ct. 873 (1996); Matsushita, 116 S. Ct. at 877, 879-90. All of these cases, however, refer to dimensions of jurisdiction other than the case-or-controversy requirement. For example, many of them involved federal courts' approving the release of state-law claims, or state courts approving the release of exclusively federal claims. See, e.g., Corrugated Container, 643 F.2d at 221 \u0026 nn.39-40; Epstein, 50 F.3d at 661-64; Matsushita, 116 S. Ct. at 877. None of these cases has advanced the radical proposition that a federal court, in approving a class action settlement i.e., in the exercise of its Article III jurisdiction can release claims not presenting a case or controversy.\n\nFurthermore, courts often have used the \"common nucleus of operative facts\" test to determine whether unpled claims can be released. See, e.g., Class Plaintiffs v. City of Seattle, 955 F.2d 1268, 1288 (9th Cir.), cert. denied, 506 U.S. 953, 121 L. Ed. 2d 333, 113 S. Ct. 408 (1992); Nottingham Partners v. Trans-Lux Corp., 925 F.2d 29, 34 (1st Cir. 1991). This test is used for determining whether a court may exercise supplemental jurisdiction, and a federal court may exercise supplemental jurisdiction only over claims that are part of the same Article III case or controversy. See 28 U.S.C. ยง 1367(a) (1994); United Mine Workers v. Gibbs, 383 U.S. 715, 725, 16 L. Ed. 2d 218, 86 S. Ct. 1130 (1966).\n\nThus, the release-of-claims cases assume that the released claims are justiciable cases or controversies. Those cases do not challenge the key Conclusion that a portion of a settlement is void if it purports to release non-justiciable claims.\n\nD. The Class.\n\nThe plaintiff class of natural persons certified in this case the Global Health Claimant Classis indeed sweeping.\u003cspan class=\"fnref\"\u003e83\u003c/span\u003e By its terms, the class definition includes, inter alia, the following categories of persons:\n\n(1) future children of persons exposed to asbestos (\"future children\");\u003cspan class=\"fnref\"\u003e84\u003c/span\u003e\n\n(2) future spouses of persons exposed to asbestos (\"future spouses\");\u003cspan class=\"fnref\"\u003e85\u003c/span\u003e and\n\n(3) persons who have been exposed to asbestos, who have not manifested an asbestos-related disease, and who had not filed or had dismissed a lawsuit by August 27, 1993 (\"exposure-only\" claimants).\n\nNo person included in the first two categories meets the irreducible constitutional minimum of standing for any claim. Furthermore, some of the persons in the third category lack standing with respect to some or all of their claims. Thus, several of the claims asserted by these categories of persons present no justiciable case or controversy, and the district court therefore erred in deciding to hear them.\n\nThe future children, for example, include \"persons\" who had not been conceived at the time the complaint was filed.\u003cspan class=\"fnref\"\u003e86\u003c/span\u003e Common sense alone dictates the Conclusion that non-existent persons cannot have standing to assert in personam causes of action for money damages. In more formal terms, these unconceived plaintiffs cannot prove injury-in-fact and thus cannot establish standing to assert their in personam tort claims. Cf. Lujan v. Defenders of Wildlife, 504 U.S. 555, 560, 119 L. Ed. 2d 351, 112 S. Ct. 2130 (1992) (defining injury-in-fact).\n\nSimilarly, future spouses--who may or may not already be born--are, by definition, not yet married to the exposed persons. Common sense once again dictates the Conclusion that these persons--who have not been exposed to asbestos themselves--have not yet been injured in fact because they currently have no relation to exposed persons.\n\nImagine, for example, the absurd hypothetical of a \"person\" from each of the first two categories filing individual lawsuits today in federal court, i.e., without resort to rule 23. I do not doubt that any federal court would dismiss their claims immediately for want of justiciability. We must not allow the aggregation of individual claims through the class action device to divert our attention from such a fatal defect.\u003cspan class=\"fnref\"\u003e87\u003c/span\u003e\n\nAside from these glaring defects, a more subtle problem exists with respect to the third category of persons that I defined above, i.e., the exposure-only claimants. Properly addressing the problem, however, requires a review of certain fundamental principles of Article III jurisdiction and their application to diversity cases.\n\nE. Standing.\n\n1. Standing in Relation to Causes of Action.\n\nIt is impossible to analyze standing without reference to a cause of action: \"Standing is gauged by the specific common-law, statutory or constitutional claims that a party presents.\"\u003cspan class=\"fnref\"\u003e88\u003c/span\u003e Suppose, for example, that a public employer has discriminated against an applicant for employment on the basis of race. Undoubtedly, such an allegation of injury would meet Article III's standing requirements for, e.g., a Fourteenth Amendment equal protection claim.\n\nNevertheless, that injury may not serve as the predicate for standing to assert any conceivable cause of action. For example, such an injury does not operate to confer standing on the applicant for a violation of the right to be free from unreasonable searches and seizures under the Fourth Amendment. For while he could show injury-in-fact with respect to his equal protection rights, he cannot show injury-in-fact with respect to his rights under the Fourth Amendment. See Lewis v. Casey, 135 L. Ed. 2d 606, 64 U.S.L.W. 4587, 4591 n.6, 116 S. Ct. 2174, No. 94-1511, 1996 WL 340797, at * 8 n.6 (U.S. June 24, 1996).\u003cspan class=\"fnref\"\u003e89\u003c/span\u003e\n\nThus, standing analysis assumes, at a minimum, that the plaintiff has alleged a cause of action created to vindicate a legally protected interest. The cause of action alleged serves as a necessary frame of reference for the standing inquiry hence the Court's explicit connection of standing and causes of action in International Primate Protection League v. Administrators of Tulane Educ. Fund, 500 U.S. 72, 114 L. Ed. 2d 134, 111 S. Ct. 1700 (1991):\n\nStanding does not refer simply to a party's capacity to appear in court. Rather, standing is gauged by the specific common-law, statutory or constitutional claims that a party presents. \"Typically, . . . the standing inquiry requires careful judicial examination of a complaint's allegations to ascertain whether the particular plaintiff is entitled to an adjudication of the particular claims asserted.\"\u003cspan class=\"fnref\"\u003e90\u003c/span\u003e\n\nIn other words, standing analysis does not operate in a vacuum: The allegation of a cause of action frames the inquiry. See Catholic Social Serv. v. Shalala, 304 U.S. App. D.C. 258, 12 F.3d 1123, 1125 (D.C. Cir. 1994).\u003cspan class=\"fnref\"\u003e91\u003c/span\u003e\n\nIn diversity cases, pursuant to the Erie doctrine, state law defines the substantive causes of action. In an ordinary case, we rarely have to confront the interaction between Erie and federal standing analysis. Regardless of what else one can say about Ahearn, however, no one can fairly accuse it of being an ordinary case.\n\n2. Injury-in-Fact.\n\nIn Lujan v. Defenders of Wildlife, the Supreme Court set out the test for Article III standing as follows:\n\nOver the years, our cases have established that the irreducible constitutional minimum of standing contains three elements: First, the plaintiff must have suffered an \"injury in fact\" an invasion of a legally protected interest which is (a) concrete and particularized; and (b) \"actual or imminent, not 'conjectural or hypothetical.'\" Second, there must be a causal connection between the injury and the conduct complained of the injury has to be \"fairly . . . traceable to the challenged action of the defendant, and not . . . the result [of] the independent action of some third party not before the court.\" Third, it must be \"likely,\" as opposed to merely \"speculative,\" that the injury will be \"redressed by a favorable decision.\"\n\n504 U.S. at 560-61 (footnote and citations omitted). For the purposes of this case, we need focus only on the first prong of this standard: injury-in-fact.\n\nThe Lujan injury-in-fact test consists of two sections:\n\n(1) the \"invasion of a legally protected interest\"; and\n\n(2) the criteria of\n\n(a) concreteness and particularity; and\n\n(b) actuality or imminence.\n\nThe failure of a plaintiff fully to meet the requirements of both sections constitutes the failure to establish the irreducible constitutional minimum of standing.\n\nThus, to survive the Article III inquiry, a plaintiff must make-- inter alia --a showing that he had a legally protected interest that has been invaded. The failure to make such showing would be fatal to his attempt to establish Article III standing.\n\n3. Effect of State Law.\n\nThe second part of the Lujan injury-in-fact test is governed purely by federal law (even in diversity cases), for no pronouncement of state law can affect a federal court's determination of whether an invasion of a legally protected interest is, e.g., sufficiently concrete and particularized to satisfy Article III. Similarly, no decision of state law can affect a federal court's determination of whether such an invasion is sufficiently actual or imminent to satisfy Article III.\n\nIn diversity cases, however, the first part of the Lujan injury-in-fact test is not completely independent of state law. The concept of \"invasion of a legally protected interest\" immediately invites the question of who or what protects the interest. In an ordinary, non-diversity case, federal law is the source of substantive rights and of causes of action designed to vindicate those rights. In diversity cases, it is state law that creates legally protected interests and provides causes of action to vindicate them.\n\nThis Conclusion cannot be avoided by chanting the mantra that federal law cannot depend on state law. Under Erie, the judgment of a federal court depends on state substantive law in a diversity case. The definition of a legally protected interest as well as the provision of a cause of action to vindicate that interest is a matter of substantive law.\u003cspan class=\"fnref\"\u003e92\u003c/span\u003e If the federal injury-in-fact test articulated in Lujan depends on the definition of a legally protected interest and it does then the outcome of that federal inquiry depends in part on how state law defines that interest.\n\nMoreover, when a state has declined to create a given cause of action, it has decided not to accord legal protection to a particular interest. Therefore, if a given exposure-only cause of action embraced in the settlement is not founded on a substantive right,\u003cspan class=\"fnref\"\u003e93\u003c/span\u003e it is impossible for a person asserting that claim to prove injury-in-fact. This is so because the injury-in-fact test requires proof of the invasion of a legally protected interest. See Lujan, 504 U.S. at 560; cf. International Primate, 500 U.S. at 77 (stating that substantive claim is a predicate for standing analysis).\u003cspan class=\"fnref\"\u003e94\u003c/span\u003e\n\n4. Choice of Law Analysis.\n\nThe causes of action alleged in Ahearn are state-law causes of action brought on the basis of diversity jurisdiction. Standing must be measured by the cause of action pled, see International Primate, 500 U.S. at 77; therefore, the standing of the exposure-only plaintiffs must be gauged by the causes of action they assert.\n\nAll of the exposure-only claimants have a common predicate for their causes of action: Their claims, by definition, are based on mere exposure to asbestos, not on an extant injury caused by exposure to asbestos. The states vary, however, in the degree to which they recognize a cause of action predicated on exposure alone, i.e., they vary in the degree to which they legally protect an interest in being free from exposure to asbestos.\n\nIn Pennsylvania, for example, \"asymptomatic pleural thickening is not a compensable injury which gives rise to a cause of action.\" Simmons v. Pacor, Inc., 674 A.2d 232, 237 (Pa. 1996). Pennsylvania does not recognize, in the absence of manifest injury, a legally protected interest either in (1) being free from the increased risk of cancer because of exposure to asbestos or in (2) being free from present emotional distress resulting from exposure to asbestos (i.e., distress caused by the fear of contracting cancer). See id. at 237-38.\u003cspan class=\"fnref\"\u003e95\u003c/span\u003e Consequently, because Pennsylvania does not legally protect those interests, a plaintiff asserting such causes of action could not possibly establish injury-in-fact under the standing test announced in Lujan i.e., he cannot demonstrate the invasion of a legally protected interest.\n\nStates other than Pennsylvania also have declined to recognize all of the exposure-only causes of action embraced in the instant global settlement.\u003cspan class=\"fnref\"\u003e96\u003c/span\u003e Such unauthorized claims are not founded upon legally protected interests. Thus, because those claims cannot properly be before an Article III court, they cannot be extinguished by the Ahearn global settlement. Therefore, because the global settlement purports to extinguish those claims, reversal or vacatur is required.\n\nIt was necessary to conduct a choice of law analysis to determine the answer to the threshold question of standing in this case. More specifically, the district court should have conducted the choice of law analysis to determine whether every class member alleged the invasion of a legally protected interest per the Lujan injury-in-fact test with respect to each claim they asserted. The failure to do so resulted in the district court's exercising its powers over claims not presenting a case or controversy, i.e., in the absence of Article III jurisdiction.\u003cspan class=\"fnref\"\u003e97\u003c/span\u003e\n\nF. Erie, Diversity, and Article III.\n\nThe majority's failure to raise and address the Article III issues is directly contrary to Guaranty Trust Co. v. York, 326 U.S. 99, 89 L. Ed. 2079, 65 S. Ct. 1464 (1945), and Angel v. Bullington, 330 U.S. 183, 91 L. Ed. 832, 67 S. Ct. 657 (1947). In Guaranty Trust, the Court faced the question of whether a state statute of limitations barring a class action was to be applied by a federal court sitting in diversity. See Guaranty Trust, 326 U.S. at 100-01. The Court expressly stated that Erie implicates the jurisdiction of Article III courts: \"Our starting point must be the policy of federal jurisdiction which Erie R. Co. v. Tompkins embodies.\" Id. at 101 (citation omitted).\n\nRecognizing that the Erie doctrine \"inevitably\" applies to suits in equity, the Court framed the issue presented as follows:\n\nIs the outlawry, according to State law, of a claim created by the States a matter of \"substantive rights\" to be respected by a federal court of equity when that court's jurisdiction is dependent on the fact that there is a State-created right, or is such statute of \"a mere remedial character\" which a federal court may disregard?\n\nId. at 107-08 (citation omitted) (emphasis added). Thus, the Court explicitly recognized that the viability of a state-law cause of action was an essential predicate of diversity jurisdiction.\n\nThe Court's holding in Guaranty Trust was unambiguous:\n\nPlainly enough, a statute that would completely bar recovery in a suit if brought in a State court bears on a State-created right vitally and not merely formally or negligibly. As to consequences that so intimately affect recovery or non-recovery a federal court in a diversity case should follow State law.\n\nId. at 110. Thus, a state's decision to limit the life of a state-created cause of action must be respected by federal courts sitting in diversity. It is equally plain indeed, it follows a fortiori --that when a state has declined to give life to a cause of action at all, federal courts sitting in diversity also must refuse to entertain that cause of action.\n\nIn fact, we have interpreted a decision of the Supreme Court as specifically stating that federal courts sitting in diversity must not entertain diversity actions that are unavailable under state law. See Kuchenig v. California Co., 350 F.2d 551, 556 (5th Cir. 1965) (interpreting Angel), cert. denied, 382 U.S. 985, 15 L. Ed. 2d 473, 86 S. Ct. 561 (1966). In deciding whether indispensability of a party was a matter governed by state or federal law in a diversity case, we applied an analysis in Kuchenig that closely parallels appropriate the Erie /standing analysis in Ahearn.\n\nWe first noted that \"every court that has dealt with that issue at all seems to have treated it, appropriately in our view, as a run-of-the-mine [sic] Erie problem, requiring the usual balancing of substantive and procedural elements.\" Kuchenig, 350 F.2d at 555. We stated further:\n\nIndispensability, while not properly regarded as a jurisdictional issue, is closely related to jurisdiction, and may act to defeat diversity jurisdiction. . . . Rules of joinder depend on the substantive rights and liabilities of the parties, present and absent. In diversity actions, these substantive rights and liabilities are creatures of state law.\n\nId. at 555-56 (footnotes and citations omitted, emphasis added). We thus recognized an inevitable relationship, in diversity cases, between state substantive law and federal jurisdiction. We also noted that this relationship was not confrontational, but symbiotic: \"Professor [Charles Alan] Wright characterizes the conflict in these cases as 'more apparent than real': state law determines the interests of the parties; federal law determines whether these state-created rights render a missing person indispensable.\" Id. at 556.\u003cspan class=\"fnref\"\u003e98\u003c/span\u003e\n\nThis approach to indispensability of a party--a matter \"closely related to jurisdiction\" that \"may act to defeat diversity jurisdiction,\" id. at 555--parallels the approach I have applied above in relation to standing. State law determines the substantive rights and interests of the exposure-only claimants. When a state has conferred a substantive right, federal law determines whether persons asserting such a right meet Article III requirements.\n\nWhen a state has not conferred such a right, it is not within the power of a federal court to entertain that action in diversity. See id. at 556. The district court's diversity jurisdiction in this multi-state class action depended on the existence of state-created causes of action. See Guaranty Trust, 326 U.S. at 107-08 (stating that a federal court's diversity jurisdiction is \"dependent on the fact that there is a State-created right\"). In order to determine whether it had jurisdiction over all of the claims released in the class action settlement, the district court had to conduct a choice of law inquiry to determine which states' laws applied to which causes of action. Any claims not authorized by state law should have been explicitly excised from the settlement. The adjudication by the district court of those claims violated Article III limits on that court's jurisdiction.\n\nUnder these circumstances, we have no discretion: We must reverse or vacate the judgment approving the class action settlement. In reviewing the approval of a class action settlement, we may not modify the terms of the settlement but must approve or disapprove it in its entirety. Cotton v. Hinton, 559 F.2d 1326, 1331-32 (5th Cir. 1977).\n\nThe reason for this rule is straightforward: Class action settlements often include delicate compromises, the disruption of which would lead one or more of the parties to reconsider the wisdom of the settlement. Therefore, if an appellate court negates part of a class action settlement, e.g., because of justiciability problems it would have to vacate or reverse and remand for further proceedings. It could not simply excise the objectionable portion of the settlement and uphold the remainder as a viable settlement. See id.\n\nIX. Summary and Conclusion.\n\nUnencumbered by legislative safeguards and shedding nearly every judicial protection, the district court enacted a novel, untested tort reform package. As a result, Fibreboard's victims find themselves guinea pigs in a dubious (and legally unfounded) experiment.\n\nThe only protection accorded the class was a rule 23(e) fairness hearing. The district court also appointed a guardian ad litem to represent absent class members, but he did so only after class and defense counsel had completed the settlement. Thus, class members received absolutely no structural or procedural protections; instead, they had to rely on an after-the-fact review of the settlement's substance.\n\nThe district court and the guardian ad litem undertook that task diligently, but an after-the-fact substantive review is far too little, far too late. The court cannot conduct a trial in order to avoid one; nor can it turn back the clock and appoint different counsel to renegotiate the settlement fairly. Thus, the extent to which class counsel's numerous conflicts and Fibreboard's stacking of the deck actually affected the final settlement is unknowable. As Fibreboard entered the negotiations in constructive bankruptcy and left with more than ninety-five percent of its assets intact, however, there is reason to be skeptical.\n\nThe effect of replacing the tort system with an administrative processing center is equally hard to ascertain, for Judges lack legislative fact-finding and investigative capabilities. If the trust proves to be funded adequately and managed fairly, it might process claims more efficiently than the courts, reducing transaction costs and providing plaintiffs with faster and more reliable recovery. As such a reduction in transaction costs would generate a surplus for Fibreboard and the class, Fibreboard might deserve to walk away with over $200 million in remaining assets.\n\nOn the other hand, the trust might attempt to impose arbitrary limits similar to those of the Georgine trust and stonewall plaintiffs' counsel who protest, forcing them to endure a tedious series of procedural delays before their clients finally receive a day in court. The trust might also be inadequately funded, as was the Dow Corning settlement, leaving plaintiffs scraping for what little they can get while bureaucrats struggle to hold on to their jobs.\n\nIn short, we simply do not know what the courts have wrought. What we do know is that this \"reform\" involves denial of established constitutional rights; relaxation of already lax ethical rules; extinguishing of claims that we have no power to adjudicate, much less abolish; and a significant likelihood of collusion between the defendant and the class counsel.\n\nI respectfully Dissent from the majority's refusal to reverse--or veto--certification of this no-opt-out, mass-tort, settlement-only, futures-only class action.\n\n\u003cspan class=\"fn\"\u003e1. No. 614747-3 (Alameda Cty. Sup. Ct. June 1, 1992) reversed by Fibreboard Corp. v. Continental Casualty Co., No. A059716 (Cal. App., October 19, 1994).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The trial court's decision in Andrus was reversed by the California appellate court in October 1994 after the Global Settlement Agreement was reached but before the fairness hearing was held.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. In the Substitute Ness Motley Agreement, Continental agreed to pay a higher-than-average value per claim with one-half due at closing and the remainder contingent on the outcome of the coverage case or on the existence of a settlement. This agreement was used as a model to settle inventory claims of other law firms.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. After oral argument, the court granted a motion to sever issues unique to Fibreboard, Pacific and Continental in order to facilitate the Trilateral Settlement. Its decision regarding the claims of other participants in the case is Armstrong World Industries, Inc. v. Aetna Casualty \u0026 Surety Co. et al., 1996 WL 209536 (Cal.App. April 30, 1996).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. See Discussion of Andrus at note 2 and accompanying text.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Class counsel for the Trilateral Health Claimant Class was James E. Coleman, Jr., of the law firm Carrington, Coleman, Sloman \u0026 Blumenthal, L.L.P. Class counsel for the Trilateral Third-Party Claimant Class were the same attorneys that represented the Global Third-Party Claimant Class.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Determinations of individual damage awards will be made by the trust and the plaintiff's attorney in settlement negotiations or in a full trial on the merits. The back-end opt out provision will force the trust and plaintiffs to consider state law and individual circumstances, such as smoking history, when negotiating damages because the alternative to agreement is a full trial by jury under relevant state law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. This is in stark contrast to the Georgine case where the settlement attempted to award damages to class members based on the severity of their injuries alone. 1996 WL 242442 (3d Cir. 1996). We would likely agree with the Third Circuit that a class action requesting individual damages for members of a global class of asbestos claimants would not satisfy the typicality requirements due to the huge number of individuals and their varying medical expenses, smoking histories, and family situations. In Ahearn, only commonly held questions regarding insurance coverage for the class' injuries and establishment of an equitable distribution process to insure that all class members receive compensation were decided. As a result, this settlement is unaffected by the typicality and commonality problems cited in Georgine.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The Global Health Claimant Class consists of persons who have been exposed \"to asbestos or to asbestos-containing products for which Fibreboard may bear legal liability.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Intervenors do not challenge the adequacy of representation of class representatives so we do not consider this issue.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. As Professor Hazard testified: Q. Well, to your knowledge, did the reality ever occur here to the plaintiff's lawyers that there would not be enough money to pay all future claimants? A. They confronted a situation in which there was an external event creating a severe risk that that could happen. If Fibreboard won the coverage litigation without qualification as to the extent of the coverage, then there was enough money to the extent of the insurance company's resources, which I take it for practical purposes [sic] without limit; that is they would have to charge present policyholders to pay the money, but presumably if they stayed in the business they could do that.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Professor Hazard discussed the difference between the real-world concept of conflict of interest with the imaginary concept of a reserve price: Q. That's your opinion, whether or not there's an ethical violation depends upon the reasonableness of the settlement? Is that right? A. It depends -- I think the Judge said-- I think I heard him to say the circumstances. That is, the conflict of interest is a real-world concept, not a theoretical concept. Therefore, one has to consider the real-world circumstances. Economists do a lot of thinking about -how shall we say -- the potential of reality. A reserve price in the context of real-world negotiation is an imaginary number. The person who offers the money finally doesn't know what he is going to offer until he offers it. He may have the clearest idea, the firmest opinion, the strongest wish, and yet you can have a settlement or there will be a few bucks more. How do you possibly reconcile the notion that he had a firm, irreducible, unremovable, firm reserve price with the fact that he settled for a little bit more? It's because you're talking about different kinds of things.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The absolute priority rule requires that more senior creditors (such as tort creditors) be paid in full before junior claimants (such as shareholders) receive any distribution from an insolvent company.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Notwithstanding the Keene court's gratuitous Discussion of its concerns about use of a class action to circumvent bankruptcy laws, the court's holding is that the case was properly dismissed because the plaintiff-manufacturer had no cognizable claim against the defendant class members. Keene, 14 F.3d at 733.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. See In re Amatex, 755 F.2d 1034, 1042 (3d. Cir. 1985); In re Johns-Manville Corp., 36 Bankr. 743 (Bankr. S.D.N.Y. 1984); In re UNR Indus., 29 Bankr. 741, 745 n.4 (Bankr. N.D. Ill. 1983). The inability or refusal of the bankruptcy courts to place Global Health Claimant Class members on equal footing with other creditors of Fibreboard and the indeterminance of the \"party in interest\" categorization that the class would receive if its claims were cognizable at all in bankruptcy have been widely criticized. See e.g. Anne Hardiman, Toxic Torts and Chapter 11 Reorganization: The Problem of Future Claims, 38 Vand. L.Rev. 1369, 1395-96 (October 1985); Kevin H. Hudson, Catch-23(b)(1)(B): The Dilemma of Using the Mandatory Class Action to Resolve the Problem of the Mass Tort Case, 40 Emory L. J. 665, 693-95 (Spring 1991).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Opt-out class actions were unheard of before the 1966 amendments to the Federal Rules of Civil Procedure created the Rule 23(b)(3) opt-out class action. The intervenors would have us read Shutts to mean that all class actions involving money claims under Rule 23(b)(1) or (2) are unconstitutional. If the Supreme Court had intended to so hold, it surely would have been more explicit given the ancient history of the mandatory class action, over a hundred years of precedent upholding the constitutionality of such classes, the relatively recent development of the \"opt-out\" class action, and the strong presumption that the Federal Rules of Civil Procedure are constitutional.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. The district court also rejected the intervenors' motion under 28 U.S.C. ยง 144. This statute requires that a party submit an affidavit alleging facts that, if true, would convince a reasonable person that bias exists. However, \"[a] court may not grant relief under ยง 144 if a party's counsel instead of the party executes an affidavit alleging personal bias or prejudice.\" Pomeroy v. Merritt Plaza Nursing Home, Inc., 760 F.2d 654, 658-59 (5th Cir. 1985)(citations omitted). The only affidavit before the district court was submitted by counsel for the Flanagan intervenors, Leonard Jacques, and therefore did not qualify for relief under ยง 144. The district court's error in considering the recusal motion under ยง 144 was harmless in any event because the court properly concluded that even if the facts in the affidavit were assumed true, a reasonable person would find that no bias exists.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Two other would-be appellants also lack standing under this rule. However, we need not dismiss their appeals for lack of standing because they are dismissed on other grounds. On March 25, 1996, Jeffrey Mack Chapin filed notices of appeal complaining of orders entered in Ahearn and Rudd. These notices of appeal which were consolidated into Ahearn and Rudd were untimely and are therefore dismissed. Kenneth Smith has also filed notices of appeal complaining of the orders in Ahearn and Rudd. Smith's notices of appeal have also been consolidated into Ahearn and Rudd and are dismissed due to Smith's failure to pay the docketing fee and failure to file an appellate brief.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The Flanagan intervenors also argue that claims which Fiberboard already knew about (those of Mr. Jaques' clients) cannot be \"future claims\" simply because they were not filed before the settlement was reached. This objection is asserted without any basis in law and fails to explain how claims which have not yet been filed could be anything other than \"future claims\" in the eyes of a court. The Flanagan intervenors also claim that they are appealing the judgment entered in Ahearn which approves the Trilateral Settlement Agreement as a fair settlement of the coverage litigation between Fibreboard and the Insurers. However, Flanagan failed to raise this issue in his initial brief and has not demonstrated that he has standing to challenge this judgment. On appeal, this court will not reach issues not raised in the initial brief. United Paperworkers Intern. U. v. Champion Intern., 908 F.2d 1252, 1255 (5th Cir. 1990). Additionally, Flanagan has failed to demonstrate (or make any argument) that he is a proper party to appeal the judgment approving the fairness of the settlement of the coverage litigation between Fibreboard and the Insurers. See Rohm \u0026 Hass Tex. v. Ortiz Bros. Insulation, 32 F.3d 205 (5th Cir. 1994).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. The Flanagan intervenors argue that Rudd was inappropriately certified as a 23(b)(1)(B) class. We do not consider the merits of this argument because the district court found, and we agree, that the defendant class in Rudd could also be certified under 23(b)(2). None of the intervenors appeals the propriety of certification under this provision.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Rule 19(b) requires a district court deciding the question of indispensability to consider: first, to what extent a judgment rendered in the person's absence might be prejudicial to the person or those already parties; second, the extent to which, by protective provisions in the judgment, by the shaping of relief, or other measures, the prejudice can be lessened or avoided; third, whether a judgment rendered in the person's absence will be adequate; fourth, whether the plaintiff will have an adequate remedy if the action is dismissed for nonjoinder. Fed. Rule Civ. Proc. 19(b).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. HERBERT NEWBERG \u0026 ALBA CONTE, NEWBERG ON CLASS ACTIONS (hereinafter \"NEWBERG ON CLASS ACTIONS\") ยง 4.09, at 4-32 through 4-33 (3d ed. 1992). The language of rule 23(b)(1)(B) is broad enough to encompass more than the traditional common fund, id. at 4-31, and the fact that an action meets the requirements of rule 23(b)(1)(B) does not necessarily transform it into one for the division of a fund. This case deviates from the traditional common fund in a number of ways. First, there is no fund to speak of. The insurance proceeds are not common or limited, but are simply all that the defendants are willing to provide to the settlement. A settlement offer is far from \"a fixed asset . . . in which all class members have a preexisting interest.\" The fact that Fibreboard's asbestos liabilities are greater than its assets is also insufficient to create a common fund, even though it is sufficient to meet the requirements of rule (b)(1)(B). See Arthur R. Miller \u0026 David Crump, Jurisdiction and Choice of Law in Multistate Class Actions after Phillips Petroleum Co. v. Shutts, 96 YALE L.J. 1, 42 (1986) (describing the \"constructive bankruptcy\" theory for certifying mass torts under rule (b)(1)(B)). See also Marcus , supra note 4, at 877-81 (suggesting that a common fund theory does not work for mass torts). Second, the plaintiffs do not have a preexisting interest in Fibreboard's assets; the purpose of the suit is to establish those rights and not to divide preexisting rights. 39 472 U.S. at 811 \u0026 n.3 (\"Our holding today is limited to those class actions which seek to bind known plaintiffs concerning claims wholly or predominately for money judgments. We intimate no view concerning other types of class actions, such as those seeking equitable relief.\"). 40 Although Shutts involved a state court action, the consensus view is that it applies to federal class actions as well. See Matsushita Elec. Indus. Co. v. Epstein, 134 L. Ed. 2d 6, 116 S. Ct. 873, 888 (1996) (Ginsburg, J., Concurring in part and Dissenting in part) (\"In [ Shutts ], this Court listed minimal procedural due process requirements a class action money judgment must meet if it is to bind absentees; those requirements include notice, an opportunity to be heard, a right to opt out, and adequate representation.\"); Carlough v. Amchem Prods., Inc., 10 F.3d 189, 198-99 (3d Cir. 1993); Brown, 982 F.2d at 392; In re Drexel Burnham Lambert Group, Inc., 960 F.2d 285, 292 (2d Cir. 1992) (dictum), cert. dismissed, 506 U.S. 1088 (1993); In re Real Estate Title, 869 F.2d at 766 n.6. See also Miller \u0026 Crump, supra note 17, at 29-31. 41 The specific counts in the complaint are (1) negligent failure to warn; (2) strict product liability; (3) breach of express and implied warranty; (4) concert of action and conspiracy; and (5) \"all other viable claims.\" The last count consists of every \"claim or cause of action\" that the plaintiffs can assert against Fibreboard. 42 See also Marcus, supra note 4, at 888 (\"The limited fund concept should rarely, if ever, be available in mass tort litigation. Even if it can be sustained in some instances, there is no denying that the claims asserted are for compensatory damages, and there is arguably a constitutional right to opt out.\"). 43 See maj. op. at 48 (\"The limitation of Shutts to claims of unknown plaintiffs that are predominantly for money damages forecloses application of its holding to 23(b)(1)(B) actions which have always been equitable and often involve unknown plaintiffs.\"). The majority also intimates that Shutts does not apply to rule 23(b)(1)(B) actions because the absent plaintiffs are unknown. See maj. op. at 48. The unknown-plaintiff exception in Shutts does not apply to this case, however. The court lacks personal jurisdiction over a large number of known plaintiffs who have manifested injuries but failed to file suit before the class action was filed. Moreover, a large number of the exposure-only plaintiffs are known. For example, shipyard workers who have not yet manifested any sign of disease could easily be identified and notified of the settlement. They then could decide whether to opt out. If they did, their individual and derivative wrongful death claims no longer would be part of the settlement. 44 The court also held that the absent plaintiffs' claims for injunctive relief were barred by res judicata because the class action could bind absent plaintiffs on their claims for equitable relief. Brown, 982 F.2d at 392. 45 It is notable that the Shutts Court used the phrase \"equitable relief.\" Shutts, 472 U.S. at 812 n.3. Equity courts were distinguished from law courts in that their substantive rules, procedures, and remedies differed from law courts. 1 LAW OF REMEDIES ยง 2.6(3) at 154-55. As one commentator pointed out, procedure \"will seldom if ever form a basis for distinguishing law from equity\" where the distinction matters. Id. at 155 n.1. The question then becomes whether the class action is an equitable remedy or an equitable procedural device. I discuss why the rationale of Shutts supports that latter interpretation at infra part IV.B.3. Further support for the obvious proposition that the class action is a procedural tool comes from the fact that it has never been treated as a \"remedy.\" See 1 LAW OF REMEDIES ยงยง 1.1-1.6 (listing all remedies available at law and equity). 46 The class action originated in courts of equity as a procedural joinder device. See generally 1 LAW OF REMEDIES ยง 1.1, at 1-2 (distinguishing procedural law, substantive law, and remedial law); id. ยง 2.1(1), at 57 (noting that differing procedures were available in equity and legal courts). 47 In similar situations, where an equitable procedural device has been extended to actions at law, courts have used at least two distinct tests for determining equitable status. The first test focuses on the remedy: If the claim seeks a coercive remedy, it is deemed equitable. The second test characterizes a claim as equitable if the plaintiff seeks to enforce a right that was originally created in the equity courts, or a right that was traditionally decided according to equitable principles. 1 LAW OF REMEDIES ยง 2.6(3), at 154-55. 48 Browning-Ferris Indus., Inc. v. Kelco Disposal, Inc., 492 U.S. 257, 299, 106 L. Ed. 2d 219, 109 S. Ct. 2909 (1989) (O'Connor, J., Concurring in part and Dissenting in part) (stating that \"the applicability of a provision of the Constitution has never depended on the vagaries of state or federal law\"); Escobedo v. Illinois, 378 U.S. 478, 486, 12 L. Ed. 2d 977, 84 S. Ct. 1758 (1964) (declining to \"exalt form over substance\" in determining the temporal scope of Sixth Amendment protections); Crowell v. Benson, 285 U.S. 22, 53, 76 L. Ed. 598, 52 S. Ct. 285 (1932) (opining that \"regard must be had, . . . in . . . cases where constitutional limits are invoked, not to mere matters of form but to the substance of what is required\"); Chicago, Burlington \u0026 Quincy R.R. v. Chicago, 166 U.S. 226, 235, 41 L. Ed. 979, 17 S. Ct. 581 (1897) (\"In determining what is due process of law regard must be had to substance, not to form.\"). 49 The suit was over proceeds from a book fund maintained by the Methodist Episcopal Church. Smith, 57 U.S. at 303. The fund was established for the care of traveling preachers. Id. When the church divided over slavery, both sides agreed to split church property based upon a prearranged formula. Id. at 305. The traveling preachers from the south sued the northern church because it refused to relinquish that portion of the fund that belonged to the southern church. Id. 50 Ibs involved a suit, for money damages, by a participant in a mortuary fund in state court. The question was whether a prior mandatory class action would have a res judicata effect on the plaintiff. The class action was against an insurance company and sought to compel the company to make distributions from a trust. The court held that the action against the trust must be given res judicata effect in the later proceeding. 51 The appellees argue that even if due process requires an opt-out right, the settlement's \"back-end\" exit satisfies due process. Even if a \"back-end\" exit could serve as a proxy for an opt-out provision a suggestion made only by the Fourth Circuitthe procedure provided in Ahearn falls far short of satisfying due process. See, e.g., In re A.H. Robins Co., 880 F.2d 709, 745 (4th Cir.) (finding that a \"back-end\" exit right provides \"everything that an express opt-out provision could give a class member if such right is required under due process\"), cert. denied, 493 U.S. 959, 107 L. Ed. 2d 362, 110 S. Ct. 376 (1989). In A.H. Robins, the court could determine with confidence that the \"back-end\" exit provided absent plaintiffs with the same rights they would have in an opt-out class action. The class action involved a trust established during a chapter 11 bankruptcy. A.H. Robins, 880 F.2d at 717. An absent class member could seek a jury trial if the alternative dispute resolution provided for by the trust did not settle the plaintiff's claim in a satisfactory fashion. Id. at 722. Liability, causation, and damages would be submitted to the jury. Id. Punitive damages were disallowed, but a plaintiff seeking a jury trial would be entitled to an amount from the trust in lieu of the punitive damage award. Id. The exit mechanism left absent plaintiffs a right to a jury trial on precisely those issues on which they had a right to a jury trial before certification. Id. at 744 (\"The Plan gives every such class member the right to have her claim settled in a trial with all the procedural rights normally attaching to a jury trial. That is everything that an express opt-out provision could give a class member if such right is required under due process.\"). The \"back-end\" exit in this case fails to provide absent plaintiffs with a right substantially equivalent to a jury trial. The exit is nothing more than window dressing. While it allows claimants to settle disputes in front of a jury, it limits all damages to $500,000. By contrast, some plaintiffs have been able to recover several million dollars from asbestos defendants at trial. See, e.g., Mechanic's Family Awarded $14 Million in Auto Brake Asbestos Case, WEST'S LEGAL NEWS, June 20, 1996, at 1996 WL 339400 (discussing asbestos verdict for two plaintiffs); Asbestos Litigation Damages, CHI. DAILY LAW BULLETIN, June 13, 1995, at 1 (discussing $12 million verdict); Notable Verdicts, NAT'L LAW JOURNAL, Apr. 15, 1996, at A15 (discussing $2.2 million jury verdict); Reviewing Verdicts for Excessiveness, NEW YORK L.J., Apr. 10, 1996, at 1 (discussing verdicts of $64.6 million for four plaintiffs); $18 Million Verdict for Asbestos Claims, NEW YORK L.J., Feb. 15, 1996, at 2 (discussing verdict for five plaintiffs). Such a severe limitation on a party's ability to prove and try damages deprives him of an essential element of a jury trial. I certainly cannot say that a procedure that caps a plaintiff's damages gives him \"everything that an express opt-out provision could give a class member.\" A. H. Robins, 880 F.2d at 744. 52 See In re Gen. Motors Corp. Pick-Up Truck Fuel Tank Prods. Liab. Litig., 55 F.3d 768, 796 (3d Cir.), cert. denied, 133 L. Ed. 2d 45, 116 S. Ct. 88 (1995); 1 NEWBERG ON CLASS ACTIONS ยง 1.13, at 37-38. 53 See Marcus, supra note 4, at 899-90 (criticizing Ahearn settlement). 54 See Mars Steel Corp. v. Continental Ill. Nat'l Bank \u0026 Trust Co., 834 F.2d 677, 683 (7th Cir. 1987) (\"The agency problems which [class] actions create require that the district Judge be vigilant in protecting the procedural rights of class members.\"); cf. 7B WRIGHT \u0026 MILLER ยง 1785, at 103 (\"A formal class certification determination plays an important role in assuring adequate protection to the absent class members.\"). 55 See Koniak, Looking Glass, supra note 4, at 18 (\"A poisoned or tainted pudding may taste okay, if not delicious.\"). 56 See supra page 20; General Motors, 55 F.3d at 788; Coffee, supra note 1, at 1378-82. 57 While I would follow Beef Industry and Corrugated Container reluctantly, the majority actually embraces them on the ground that settlement negotiations generate information. See maj. op. at 20-21. While it is hard to argue in favor of ignoring information, settlement negotiations generate little information regarding commonality and typicality, and it is the majority that ignores any such information. First, no competent counsel would enter negotiations without first divining his clients' legal theories and the questions of law or fact underlying them. Thus, \"the process of negotiation does not reveal anything about commonality and typicality.\" General Motors, 55 F.3d at 796. Second, this justification for relaxing the requirements is inconsistent with the majority's application of them. To the extent that diverging interests emerge in negotiations, those interests militate against mass certification, as they indicate that class counsel negotiated the settlement while suffering from a conflict. The majority relies upon the existence of information in relaxing the criteria, but ignores that information when applying them. Finally, the majority's emphasis on information is ironic. Conventional wisdom posits that early settlement decreases the amount of information available to counsel and the court. See, e.g., MANUAL FOR COMPLEX LITIGATION 3D ยง 30.45, at 243 (1995). 58 In theory, the class representative should control the attorney. In practice, class counsel often selects the class representative and is likely to pick one who is passive. Cf. In re Dresser Indus., 972 F.2d 540, 545 n.11 (5th Cir. 1992) (noting consent of client in a class action is of \"limited utility\" as a safeguard against conflicts of interest). 59 See Woolen v. Surtran Taxicabs, 684 F.2d 324, 332 (5th Cir. 1982) (\"The adequacy of representation in Rule 23(a)(4) is that essential to due process under Hansberry v. Lee [, 311 U.S. 32, 85 L. Ed. 22, 61 S. Ct. 115 (1940),] before absent class members can be bound.\"); Gonzales v. Cassidy, 474 F.2d 67, 75 (5th Cir. 1973) (\"The judgment in a class action will bind only those members of the class whose interests have been adequately represented by existing parties to the litigation.\") (quoting Sam Fox Publishing Co. v. United States, 366 U.S. 683, 691, 6 L. Ed. 2d 604, 81 S. Ct. 1309 (1961)). 60 See North Am. Acceptance Corp. v. Arnall, Golden \u0026 Gregory, 593 F.2d 642, 644 n.4 (5th Cir.) (reasoning that attorney's conflict of interest could prevent class certification under rule 23 because of \"the important role the attorney plays in protecting the interests of the class\"), cert. denied, 444 U.S. 956 (1979); see also In re Fine Paper Antitrust Litig., 617 F.2d 22, 27 (3d Cir. 1980) (concluding that attorneys with conflict of interest do not meet the adequate representation requirement of rule 23(a)(4)). 61 See In re Agent Orange Prod. Liab. Litig., 818 F.2d 216, 224 (2d Cir.) (\"We also reject the district court's finding that its authority to approve settlement offers under Fed. R. Civ. P. 23(e) acts to limit the threat to the class from a potential conflict of interest.\"), cert. denied, 484 U.S. 926 (1987). 62 Due process must mean something other than that the result is just, otherwise some lynchings would be consistent with due process. A 'fairness' hearing that appraises a settlement made outside the court's presence only as to the substantive fairness of the terms provides no more process than would be provided by a post-lynching hearing that assessed whether the dead guy really did commit the crime. Koniak, Feasting, supra note 4, at 1123. 63 See Corrugated Container, 643 F.2d at 211 n.25 (\"We hasten to add that the adequacy of settlement terms cannot ordinarily redeem a settlement that was bargained by a party in a conflict position.\"). The court, to be sure, will not approve a settlement if it is unfair, but \"fairness\" may be found anywhere within a broad range of lower and upper limits. No one can tell whether a compromise found to be \"fair\" might not have been \"fairer\" had the negotiating [attorney] possessed better information or been animated by undivided loyalty to the cause of the class. The court can reject a settlement that is inadequate; it cannot undertake the partisan task of bargaining for better terms. The integrity of the negotiating process is, therefore, important. Haudek, The Settlement and Approval of Stockholders' Actions--Part II: The Settlement, 23 SW. L.J. 765, 771-72 (1969), quoted in In re General Motors Corp. Engine Interchange Litig., 594 F.2d 1106, 1125 n.24 (7th Cir.), cert. denied, 444 U.S. 870, 62 L. Ed. 2d 95, 100 S. Ct. 146, and cert. denied, 444 U.S. 870, 62 L. Ed. 2d 95, 100 S. Ct. 146 (1979). 64 The individual plaintiffs also would receive the entire settlement if Fibreboard won the coverage case. 65 Under the lodestar formula, a court determines a class attorney's compensation by multiplying the number of hours he has spent on the litigation by an appropriate hourly wage. While the court may determine the hourly wage in part by looking to how favorable a settlement the attorney negotiated, the number of hours the attorney has worked is usually the chief determinant of his total compensation. See Jonathan R. Macey \u0026 Geoffrey P. Miller, The Plaintiffs' Attorney's Role in Class Action and Derivative Litigation: Economic Analysis and Recommendations for Reform, 58 U. CHI. L. REV. 1, 50 (1991). 66 See Koniak, supra note 4, for a more extensive Discussion of the perils of simultaneous representation. 67 The majority misleadingly labels these groups as \"near\" and \"far\" futures, which suggests that the difference between these groups is simply one of degree. In fact, there is a difference in kind. All of the extant claimants, or \"'near' futures,\" may file claims as soon as approval of the settlement is final. But none of the \"'far' futures\" may file suit until some triggering event occurs, and they have no way of knowing when, or even whether, that event will occur. 68 State law determines exactly what is the necessary triggering event. Some states permit exposure-only victims to seek recovery, while others require that a claimant develop some illness from his exposure before permitting him to recover. One group of latent claimants, of course, are the future family members of asbestos victims: future spouses and unborn or even unconceived children. For this group, the necessary triggering event is marriage or birth. 69 The majority does distinguish the case before us from In re Joint E. \u0026 S. Dist. Asbestos Litig., 982 F.2d 721 (2d Cir. 1992), on the ground that certain members of the class in that case had rights under a trust agreement to have their claims paid first, while there is nothing akin to a trust agreement in Ahearn. But Georgine also lacked anything similar to a trust agreement, so the distinction does not explain the majority's failure to distinguish Ahearn from Georgine. 70 Fibreboard's pre-1959 claims settled for an average of $12,000 in 1993, while its post-1959 claims settled for only $4,000. See GAF, Fibreboard, Pfizer Report Decline in Asbestos Cases, MEALEY'S LITIG. REP., June 2, 1995, at 20. In 1994, the discrepancy almost disappeared, with pre-1959 claims settling for $8,000 and post-1959 claims settling for $7,000. Id. As the asbestos world became aware that the expected settlement in Ahearn would not differentiate between pre- and post-1959 claimants, the settlement values of those claims naturally moved toward a common figure. 71 It is well settled that impartiality can reasonably be questioned even where there is no actual bias. See In re Faulkner, 856 F.2d 716, 721 (5th Cir. 1988) (per curiam). 72 For similar reasons, Congress in 1978 limited the administrative duties of bankruptcy Judges. Under the old Bankruptcy Act, bankruptcy Judges (then called referees) had been actively involved in the day-to-day affairs of bankruptcy reorganizations. Congress found this objectionable.: \"No matter how fair a bankruptcy Judge is, his statutory duties give him a certain bias in a case, and the bankruptcy court as a result has been viewed by many as an unfair forum.\" H.R. REP. NO. 595, 95th Cong., 1st Sess. 88 (1978), reprinted in 1978 U.S.C.C.A.N. at 6050. Congress went on to note that \"deeper problems arise because of the inconsistency between the judicial and administrative roles of the bankruptcy Judges. The inconsistency compromises his impartiality as an arbiter of bankruptcy disputes.\" Id. at 89, reprinted in U.S.C.C.A.N. at 6050. To rectify this problem, Congress limited the role of bankruptcy Judges as administrators and mediators. See, e.g., 11 U.S.C. ยง 341(c) (1994) (\"The court may not preside at, and may not attend, any meeting under this section including any final meeting of creditors.\"). 73 Certainly there can be no criticism of Judge Higginbotham's role. From the start, he served only as a mediator, not a Judge. In facilitating agreement, he did precisely what a mediator is supposed to do. 74 The Third Circuit pretermitted the jurisdictional issues raised in a nearly identical case because its decision to decertify the class disposed of the case in favor of the intervenors. See Georgine v. Amchem Prods., Inc., 83 F.3d 610, 617, 623 (3d Cir. 1996). Even in that case, one Judge wrote separately to emphasize, inter alia, that the jurisdictional issues should have been reached. See id. at 635-38 (Wellford, J., Concurring). The majority's decision to affirm certification in this case, however, obligates it to address sua sponte if necessary the troubling jurisdictional problems raised by the district court's approval of the settlement. Nevertheless, the majority has failed even to raise these issues, let alone consider them. 75 The counts alleged are (1) negligent failure to warn; (2) strict product liability; (3) breach of express and implied warranty; (4) concert of action and conspiracy; and (5) \"all other viable claims.\" This last count consists of every \"claim or cause of action\" that the plaintiffs can assert \"against Fibreboard.\" 76 The majority also states that \" Ahearn . . . presents us with claims against a healthy company for personal injuries and a proposed settlement of those claims.\" Maj. op. at 42-43. 77 The district court actually stated that \"[the] claims were, prior to the settlement, in personam in character.\" This statement implies that, in the court's view, the settlement transformed the claims into something other than in personam claims. 78 In Wausau, we were faced with \"six insurance funds encompassing different periods during a four-year span.\" 954 F.2d at 1101. Furthermore, the legitimacy of the claims against each fund was not established. Id. Cautioning that \"interpleader is not designed to solve all problems associated with multiparty litigation,\" id. (citing State Farm Fire \u0026 Casualty Co. v. Tashire, 386 U.S. 523, 535, 18 L. Ed. 2d 270, 87 S. Ct. 1199 (1967)), we held: \"Because the present case involves six separate funds and because it is unclear whether there are legitimate claims against each fund, we conclude that an identifiable fund as required for interpleader actions is not involved.\" Id. In Ahearn, we are again faced with multiple funds the policies issued by the two insurers, Continental and Pacificand the legitimacy of the liabilities against the policies is not well-established i.e., the validity of all the class members' claims against Fibreboard has not yet been decided. Moreover, because of the potentially limitless liability under these comprehensive general liability policies, the ultimate scope of coverage cannot be determined until damages are awarded on each successful claim. The terms of the policies in Wausau at least limited coverage to a specific dollar amount; thus, the total possible liability was easily defined. Yet even there we held that interpleader jurisdiction was unavailable. It follows a fortiori from Wausau that such jurisdiction does not exist in Ahearn. 79 See Griffin v. McCoach, 313 U.S. 498, 503, 85 L. Ed. 1481, 61 S. Ct. 1023 (1941) (applying Erie and Klaxon Co. v. Stentor Elec. Mfg. Co., 313 U.S. 487, 503-04, 85 L. Ed. 1477, 61 S. Ct. 1020 (1941) to federal statutory interpleader case); Perkins State Bank v. Connolly, 632 F.2d 1306, 1311 (5th Cir. 1980) (stating that, with limited exceptions, \"substantive state rules of decision generally govern federal interpleader proceedings\"); Bluff Creek Oil Co. v. Green, 257 F.2d 83, 85 (5th Cir. 1958) (applying Erie after characterizing ยง 1335 interpleader action as \"just another diversity suit\"); Williams v. McFerrin, 242 F.2d 53, 55 (5th Cir. 1957) (applying Louisiana conflict of laws principles to case, per Klaxon, because \"interpleader comes under the diversity jurisdiction of the federal courts\"); Whirlpool Corp. v. Ritter, 929 F.2d 1318, 1320-21 (8th Cir. 1991) (stating in dictum that Klaxon applies to suits brought under ยง 1335 \"because the federal interpleader statute is merely a special brand of diversity jurisdiction\") (citing Griffin, 313 U.S. at 503, and Williams, 242 F.2d at 55); 7 WRIGHT \u0026 MILLER ยง 1713 (1986) (stating that the Erie doctrine applies fully in both FED. R. CIV. P. 22 and ยง 1335 interpleader actions) (noting exceptions for certain procedural, remedial, and administrative matters e.g., pleading rules, the availability of injunctive relief, and attorneys' fees). 80 This provision reads: \"A class action shall not be dismissed or compromised without the approval of the court, and notice of the proposed dismissal or compromise shall be given to all members of the class in such manner as the court directs.\" FED. R. CIV. P. 23(e). 81 Epstein v. MCA, Inc., 50 F.3d 644, 667 (9th Cir. 1995), rev'd on other grounds sub nom. Matsushita Elec. Indus. Co. v. Epstein, 134 L. Ed. 2d 6, 116 S. Ct. 873 (1996); see Evans v. Jeff D., 475 U.S. 717, 726-727, 89 L. Ed. 2d 747, 106 S. Ct. 1531 (1986) (referring to district court's rule 23(e) \"power to approve or reject a [class action] settlement\"); see also In re General Motors Corp. Pick-Up Truck Fuel Tank Prods. Liab. Litig., 55 F.3d 768, 793 (3d Cir.) (\"A judicially supervised and approved class action settlement, like a judicially supervised trial, is a means of hearing and determining judicially, in other words 'adjudicating,' the value of claims arising from a mass tort.\") (quoting with approval Roger H. Trangsrud, Joinder Alternatives in Mass Tort Litigation, 70 CORNELL L. REV. 779, 835 (1985) (footnote omitted)), cert. denied, 116 S. Ct. 88 (1995). 82 See Purcell v. BankAtlantic Fin. Corp., 85 F.3d 1508, 1511 (11th Cir. 1996) (referring to \"judgment\" approving class action settlement); White v. National Football League, 836 F. Supp. 1508, 1510-11 (D. Minn. 1993) (describing and entering \"judgment\" approving class action settlement), aff'd, 41 F.3d 402, 406-07 (8th Cir. 1994) (referring to \"judgment decree\" and \"consent judgment\" approving class action settlement), cert. denied, 132 L. Ed. 2d 821, 115 S. Ct. 2569, and cert. denied, 132 L. Ed. 2d 821, 115 S. Ct. 2569 (1995); cf. Matsushita, 116 S. Ct. at 877-78 (treating class action settlement approved by state court as a state court judgment). 83 The precise class definition is as follows: (a) All persons (or their legal representatives) who prior to August 27, 1993 were exposed, directly or indirectly (including but not limited to exposure through the exposure of a spouse, household member or any other person), to asbestos or to asbestos-containing products for which Fibreboard may bear legal liability and who have not, before August 27, 1993, (i) filed a lawsuit for any asbestos related personal injury, or damage, or death arising from such exposure in any court against Fibreboard or persons or entities for whose actions or omissions Fibreboard bears legal liability; or (ii) settled a claim for any asbestos-related personal injury, or damage, or death arising from such exposure with Fibreboard or with persons or entities for whose actions or omissions Fibreboard bears legal liability; (b) All persons (or their legal representatives) exposed to asbestos or to asbestos-containing products, directly or indirectly (including but not limited to exposure through the exposure of a spouse, household member or any other person), who dismissed an action prior to August 27, 1993 without prejudice against Fibreboard, and who retain the right to sue Fibreboard upon development of a nonmalignant disease process or a malignancy; provided, however, that the Settlement Class does not include persons who filed and, for cash payment or some other negotiated value, dismissed claims against Fibreboard, and whose only retained right is to sue Fibreboard upon development of an asbestos-related malignancy; and (c) All past, present and future spouses, parents, children and other relatives (or their legal representatives) of the class members described in paragraph (a) and (b) above, except for any such person who has, before August 27, 1993, (i) filed a lawsuit for the asbestos-related personal injury, or damage, or death of a class member described in paragraph (a) or (b) above in any court against Fibreboard (or against entities for whose actions or omissions Fibreboard bears legal liability), or (ii) settled a claim for the asbestos-related personal injury, or damage, or death of a class member described in (a) or (b) above with Fibreboard (or with entities for whose actions or omissions Fibreboard bears legal liability). 84 The future children purportedly bring \"indirect\" claims e.g., claims for wrongful death derived from the exposure to asbestos of the persons who will become their parents. Some states treat these claims as non-derivative. See Hogan v. Dow Chem. Co. (In re \"Agent Orange\" Prod. Liab. Litig.), 818 F.2d 201, 203 (2d Cir. 1987), cert. denied, 484 U.S. 1004 (1988). Most of these claims are also unripe because the person exposed to asbestos the future parent of the future child is still alive. 85 The future spouses also purportedly bring indirect claims, e.g., loss of consortium. Again, some jurisdictions treat these claims as non-derivative. See Hogan, 818 F.2d at 203. 86 For simplicity, I restrict my analysis to persons not yet conceived. 87 The rule 23(b)(3) class in the Agent Orange case was carefully defined to avoid future children and future spouses. The class definition read as follows: Those persons who were in the United States, New Zealand or Australian Armed Forces at any time from 1961 to 1972 who were injured while in or near Vietnam by exposure to Agent Orange or other phenoxy herbicides. . . . The class also includes spouses, parents, and children of the veterans born before January 1, 1984, directly or derivatively injured as a result of the exposure. Ivy v. Diamond Shamrock Chems. Co. (In re \"Agent Orange\" Prod. Liab. Litig.), 996 F.2d 1425, 1429 (2d Cir. 1993) (quoting In re \"Agent Orange\" Prod. Liab. Litig. MDL No. 381, 100 F.R.D. 718, 729 (E.D.N.Y. 1983), aff'd, 818 F.2d 145 (2d Cir. 1987), cert. denied, 484 U.S. 1004 (1988)), cert. denied, 114 S. Ct. 1125, and cert. denied, 114 S. Ct. 1126 (1994). This definition restricted the class to past and present spouses and already-born children, thus avoiding the jurisdictional anomalies presented by future spouses and future children. The appellees would have us believe that the federal courts routinely certify classes including future claimants; the authorities they cite belie that claim, however. In United States Parole Comm'n v. Geraghty, 445 U.S. 388, 393, 63 L. Ed. 2d 479, 100 S. Ct. 1202 (1980), the class definition did include future claimants, but the district court had declined to certify the class; as a result, the Court never had occasion to consider the standing issues raised by the inclusion of such persons. Likewise, the district court in Comer v. Cisneros, 37 F.3d 775, 780, 796 (2d Cir. 1994), had declined to certify a class including future claimants. Thus, the holding in Comer was merely that the purported class representatives who were present claimants had standing, not that the future claimants did. Finally, McArthur v. Scott, 113 U.S. 340, 28 L. Ed. 1015, 5 S. Ct. 652 (1885), simply has nothing to do with this mass toxic tort class action. The portion of McArthur relied upon by the appellees discusses trusts and estates, as do the cases cited therein. See id. at 401-02. 88 International Primate Protection League v. Administrators of Tulane Educ. Fund, 500 U.S. 72, 77, 114 L. Ed. 2d 134, 111 S. Ct. 1700 (1991); see Catholic Social Serv. v. Shalala, 304 U.S. App. D.C. 258, 12 F.3d 1123, 1125 (D.C. Cir. 1994) (\"[A] plaintiff's standing must be analyzed with reference to the particular claim made.\"); see also Financial Insts. Retirement Fund v. Office of Thrift Supervision, 964 F.2d 142, 146 (2d Cir. 1992) (quoting International Primate, 500 U.S. at 77). In Louisiana Landmarks Soc'y v. City of New Orleans, 85 F.3d 1119, 1122 n.3 (5th Cir. 1996), we stated that \"standing is a concept distinct from the concept of private rights of action.\" The appellee in that case had failed to brief the implied cause of action issue raised by the appellants, asserting that the appellants had waived a \"standing\" argument in the district court. We expressed our puzzlement with the appellee's waiver argument by noting that standing and implied rights of action are not equivalent concepts and that, moreover, standing can never be waived, because it is jurisdictional. See id. Thus, Landmarks should not be read as implying that standing is unrelated to the causes of action alleged. 89 The Court made this point explicitly: Standing is not dispensed in gross. If the right to complain of one administrative deficiency automatically conferred the right to complain of all administrative deficiencies, any citizen aggrieved in one respect could bring the whole structure of state administration before the courts for review. That is of course not the law. As we have said, \"nor does a plaintiff who has been subject to injurious conduct of one kind possess by virtue of that injury the necessary stake in litigating conduct of another kind, although similar, to which he has not been subject.\" Blum v. Yaretsky, 457 U.S. 991, 999, 73 L. Ed. 2d 534, 102 S. Ct. 2777 (1982). Casey, 64 U.S.L.W. at 4591 n.6 (parallel citations omitted). 90 500 U.S. at 77 (quoting Allen v. Wright, 468 U.S. 737, 752, 82 L. Ed. 2d 556, 104 S. Ct. 3315 (1984)) (emphasis in original); see Catholic Social Serv., 12 F.3d at 1125; Howe v. Ellenbecker, 8 F.3d 1258, 1261 (8th Cir. 1993), cert. denied, 128 L. Ed. 2d 49, 114 S. Ct. 1373 (1994); Financial Insts., 964 F.2d at 146-47; see also United Food \u0026 Commercial Workers Int'l Union, Local 751 v. Brown Group, Inc., 50 F.3d 1426, 1428-29 (8th Cir. 1995), rev'd on other grounds, 134 L. Ed. 2d 758, 116 S. Ct. 1529 (1996); cf. Idaho Conservation League v. Mumma, 956 F.2d 1508, 1514 (9th Cir. 1992) (\"Where . . . Congress is the source of the purportedly violated legal obligation, we look to the statute to define the injury.\") (quoting International Primate, 500 U.S. at 77). 91 I do not suggest that we look to the merits of the cause of action or determine whether the cause of action is valid (in the sense of determining whether the plaintiff ultimately would win). Rather, we must examine the pleadings to determine what cause of action the plaintiff has alleged and whether his allegations of injury, in the context of that cause of action, satisfy Article III standards. 92 In a recent case interpreting the Warsaw Convention, the Supreme Court had occasion to consider whether the question of who may bring suit is substantive or procedural. See Zicherman v. Korean Air Lines Co., 133 L. Ed. 2d 596, 116 S. Ct. 629, 634 (1996). The Court was interpreting Article 24 of the Convention, which leaves to domestic law the issues of who is entitled to sue and what types of damages they may recover. See id. at 633-34. The Court concluded: The most natural reading of [Article 24] is that, in an action brought under Article 17, the law of the Convention does not affect the substantive questions of who may bring suit and what they may be compensated for . . . . It does not seem to us that the question of who is entitled to a damages award is procedural. Id. at 634 (emphasis added). Thus, the question of who may bring suit is a question answered by substantive law in a diversity case, state substantive law. This is not to say that standing in federal court is purely an issue of state law in a diversity case; rather, the role of state law is to identify, within federal constitutional limits, the persons who have legally protected interests and what those interests are. 93 This is equivalent to saying that the law of the relevant state (determined through a choice of law analysis) does not authorize that exposure-only cause of action. 94 Cases that opine in broad language that state law cannot affect the diversity jurisdiction of the federal courts are inapposite. Cf., e.g., Begay v. Kerr-McGee Corp., 682 F.2d 1311, 1315 (9th Cir. 1982). In Begay, the court did opine that state law cannot create or enlarge federal jurisdiction, but that statement must be viewed in context. The Begay court faced a state statute that granted a substantive right and then purported to state that the sole remedy for violation of the right was an administrative claim over which a state commission had exclusive jurisdiction. The court responded that a state law, having conferred a substantive right, cannot determine whether a federal court sitting in diversity has jurisdiction over a claim based on that right. See id. at 1315-17. Rather, the proper inquiry in such a case is whether the complaint stated a claim upon which relief could be granted. See id. at 1315, 1317, 1320. This analysis does not apply to the Article III justiciability issues raised in Ahearn. The existence vel non of a cause of action is a factor that the Supreme Court has incorporated into the Article III standing inquiry. See Lujan, 504 U.S. at 560. Reinforcing this approach is the unambiguous recognition by the Court that we are to measure standing according to the particular common-law, statutory, or constitutional claim asserted. See International Primate, 500 U.S. at 77. Thus, in diversity cases, whether a state-law cause of action exists at all is a jurisdictional issue insofar as it relates to standing and injury-in-fact, not an issue of whether a claim for relief has been stated. 95 Despite this unambiguous holding, the Supreme Court of Pennsylvania has allowed plaintiffs to recover medical monitoring costs for exposure to asbestos. See Simmons, 674 A.2d at 239-40. The court stated that such costs were properly awarded for meritorious exposure-only cases but that damages for increased risk and fear of cancer were not authorized. See id. at 239-40. There are two ways to analyze the phenomenon of exposure-only causes of action. First is the monolithic view i.e., that there is only a single cause of action based on exposure to asbestos, for which there are multiple remedies (some of which may not be available). Second is the \"polylithic\" view (for lack of a better word), that there are multiple causes of action for exposure to asbestos (some of which may not be available) i.e., there is one cause of action for increased risk of cancer, one cause of action for medical monitoring costs, etc. It is largely irrelevant which of these two models is more elegant from a conceptual standpoint. What is important indeed, determinative for our inquiry is which of the two each state has adopted. Pennsylvania's high court unambiguously has held that Pennsylvania law supports no cause of action for increased risk of cancer or for present emotional distress arising from the fear of cancer. Thus, the court's statement about medical monitoring damages is best viewed as the authorization of a distinct cause of action for medical monitoring expenses. Reading the opinion otherwise would defy its plain language regarding Pennsylvania's nonrecognition of increased risk and emotional distress causes of action. 96 See, e.g., Burns v. Jaquays Mining Corp., 156 Ariz. 375, 752 P.2d 28, 29-31 (Ariz. Ct. App. 1987) (holding that subclinical asbestos-related injury is not sufficient to support cause of action), review dismissed, 781 P.2d 1373 (Ariz. 1989); DeStories v. City of Phoenix, 154 Ariz. 604, 744 P.2d 705, 707-11 (Ariz. Ct. App. 1987) (same); Mergenthaler v. Asbestos Corp. of Am., 480 A.2d 647, 651 (Del. 1984) (holding that present physical injury caused by exposure to asbestos is \"essential element\" of claims for mental anguish and medical monitoring costs); Capital Holding Corp. v. Bailey, 873 S.W.2d 187, 192 (Ky. 1994) (requiring manifestation of asbestos-caused injury before recognizing existence of cause of action for negligence based on exposure to asbestos); Larson v. Johns-Manville Sales Corp., 427 Mich. 301, 399 N.W.2d 1, 2 (Mich. 1986) (holding that cause of action for asbestosis accrues upon discovery of disease, not at time of exposure to asbestos); Locke v. Johns-Manville Corp., 221 Va. 951, 275 S.E.2d 900, 904-06 (Va. 1981) (holding that injury does not occur upon exposure to asbestos, but rather upon development of disease). 97 The appellees cite a legion of cases indiscriminately and in most cases without sufficient analysis for the proposition that the exposure-only claims present a case or controversy. These cases, for one reason or another, are insufficient to overcome the force of Lujan and International Primate. For example, the appellees cite Duke Power Co. v. Carolina Envtl. Study Group, Inc., 438 U.S. 59, 57 L. Ed. 2d 595, 98 S. Ct. 2620 (1978), as an example of a case where the Supreme Court found exposure to a harmful substance a sufficient injury-in-fact for standing purposes. The plaintiffs sought a declaratory judgment that a federal statute capping liability for nuclear accidents had violated their constitutional rights. See id. at 67. Three Justices wrote separate concurrences expressing their Conclusions that the dispute in that case was not within the district court's jurisdiction. See id. at 94-103 (concurring opinions of Justice Stewart, then-Justice Rehnquist, and Justice Stevens). The majority's standing analysis appeared to focus on environmental and aesthetic injuries unconnected to the claims asserted by the plaintiffs, which were claims for violations of the Due Process and Takings Clauses of the Fifth Amendment. Compare id. at 69 (claims alleged in complaint) with id. at 72-74 (injuries alleged in complaint). That methodology analyzing injury unanchored by the substantive claim asserted is no longer available to us in light of Lujan and International Primate. In fact, the analysis advanced by the Duke Power majority is logically inconsistent with the Supreme Court's modern standing framework, embodied primarily in Lujan and enhanced by the unanimous directive in International Primate. Given that irreconcilable inconsistency, we have no choice but to follow the Court's more recent pronouncements. Helling v. McKinney, 509 U.S. 25, 28, 125 L. Ed. 2d 22, 113 S. Ct. 2475 (1993)a case not cited by the appellees is not on point, because the plaintiff alleged present injuries based on exposure to an alleged toxin (second-hand tobacco smoke). See also Georgine, 83 F.3d at 636 (Wellford, J., Concurring). As a result, the Supreme Court never reached the issue of standing based on mere exposure to a toxin. In Agent Orange, the Second Circuit did not mention either Lujan or International Primate in stating that the exposure-only plaintiffs had sustained an \"'injury in fact.'\" See Agent Orange, 996 F.2d at 1434 (relying only on Duke Power). Although I admire the Second Circuit's handling of the massive Agent Orange litigation, I must respectfully disagree with its analysis that exposure-only claimants in that litigation met Article III's requirements. Other than Duke Power, the court appeared to rely only on cases involving the interpretation of the term \"injury\" in insurance policies. See id. These cases, however, are not authoritative with respect to the manner in which \"injury-in-fact\" is defined for Article III purposes. But see id. The Supreme Court's recent guidance in Lujan, on the other hand, is dispositive of that definitional issue. The appellees cite several bankruptcy cases to support their exposure-only theory, e.g., In re UNR Indus., 20 F.3d 766, 770-71 (7th Cir.), cert. denied, 130 L. Ed. 2d 416, 115 S. Ct. 509 (1994); Findley v. Blinken (In re Joint E. \u0026 S. Dist. Asbestos Litig.), 129 Bankr. 710, 834-37 (E.\u0026 S.D.N.Y. and Bankr. S.D.N.Y. 1991), vacated, 982 F.2d 721 (2d Cir. 1992), modified on reh'g, 993 F.2d 7 (2d Cir. 1993); Lindsey v. Dow Corning Corp. (In re Silicone Gel Breast Implant Prods. Liab. Litig. (MDL 926)), No. CV 92-P-10000-S, Civ. A. No. CV94-P-11558-S, 1994 WL 114580, at * 1 (N.D. Ala. Apr. 1, 1994). On its face Article III does not apply to bankruptcy courts, which are Article I courts. See Rohm \u0026 Hass Texas, Inc. v. Ortiz Bros. Insulation, Inc., 32 F.3d 205, 210 n.18 (5th Cir. 1994). Because of the statutory scheme requiring that matters be referred to bankruptcy courts by district courts, however, the jurisdiction of the bankruptcy courts may be limited by Article III. See, e.g., In re Interpictures, Inc., 86 Bankr. 24, 28-29 (Bankr. E.D.N.Y. 1988); John T. Cross, Congressional Power to Extend Federal Jurisdiction to Disputes Outside Article III: A Critical Analysis from the Perspective of Bankruptcy, 87 NW U. L. REV. 1188, 1197-98 (1988). If Article III does not apply to bankruptcy courts, the cited cases are plainly distinguishable. If it does apply, the reasoning of those cases is erroneous. The two district court cases do not cite to Lujan or International Primate. The Seventh Circuit's decision in UNR does cite to the former, but only in a Conclusionary fashion and without any in-depth analysis. 98 Critically, we modified Professor Wright's apparent conflict formulation in one critical respect: \"This short-hand formulation must at least be qualified insofar as it leaves room for a federal court to run afoul of Angel v. Bullington by entertaining diversity actions unavailable under state law.\" Id. (citation omitted). Professor Wright had acknowledged this limitation, referring to a prominent district Judge's articulation of it: \"'Judge Wyzanski carefully points out the limitation that if, as a matter of substantive law, a state does not recognize that a plaintiff has a particular right of action unless he joins with him certain others, then the federal court in a diversity action is precluded from giving a plaintiff who fails to join those others an opportunity to proceed as though alone he had a substantive right.'\" Id. (quoting 2 BARRON \u0026 HOLTZOFF, FEDERAL PRACTICE AND PROCEDURE ยง 511 (1964 pocket part) (Wright ed. 1961)).\u003c/span\u003e\n\n",
    "body_length": 255003,
    "citedas": [
      "90 F.3d 963"
    ],
    "attorneys": "For JAMES FLANAGAN, DAVID H MIDDLETON, Appellants: Leonard C Jaques, Jaques Admiralty Law Firm, Detroit, MI. Michael J Connor, The Jaques Admiralty Law Firm, Detroit, MI. For GERALD AHEARN, JAMES ELLISON, (95-40635), Appellees: Elihu Inselbuch, Caplin \u0026 Drysdale, New York, NY. Harry Fred Wartnick, San Francisco, CA. Charles Sanders McNew, Caplin \u0026 Drysdale, Chartered, New York, NY. Steven Kazan, Kazen, McClain, Edises, Simon \u0026 Abrams, Oakland, CA. Joseph F Rice, Ness, Motley, Loadholt, Richardson \u0026 Poole, Charleston, SC. Peter Van Lockwood, Caplin \u0026 Drysdale, Chartered, Washington, DC. Joseph B Cox, Jr, Cox \u0026 Cox, Sullivan's Island, SC. For JAMES MCADAMS DENNIS, CHARLES W JEEP, (95-40635), Appellees: Elihu Inselbuch, Caplin \u0026 Drysdale, New York, NY. Harry Fred Wartnick, San Francisco, CA. Charles Sanders McNew, Caplin \u0026 Drysdale, Chartered, New York, NY. Eric D Green, Endispute, Boston, MA. Steven Kazan, Kazen, McClain, Edises, Simon \u0026 Abrams, Oakland, CA. Joseph F Rice, Ness, Motley, Loadholt, Richardson \u0026 Poole, Charleston, SC. Peter Van Lockwood, Caplin \u0026 Drysdale, Chartered, Washington, DC. Joseph B Cox, Jr, Cox \u0026 Cox, Sullivan's Island, SC. For JUANITA DRAKE, (95-40635), Appellee: Bruce L Ahnfeldt, Napa, CA. For ROLAND DEARBORN, JUDITH DEARBORN, KERWIN BUTCHER, LONGSHORE INTERVENOR, (95-40635), Appellees: Clinton A Krislov, Krislov \u0026 Associates, Chicago, IL. Ronald W Lupton, Stinson, Lupton and Weiss, Bath, ME. For DIR, WORKERS COMP., Director, Office of Workers' Compensation Programs, US Dept of Labor, (95-40635), Appellee: Michael Scott Hertzig, Wahington, DC. For PAUL COCHRAN, IDA BECK, MARION BEHEE, (95-40635), Appellees: Frederick M Baron, Dallas, TX. For WILLIAM JAMES MITCHELL, (95-40635), Appellee: Elihu Inselbuch, Caplin \u0026 Drysdale, New York, NY. Steven Kazan, Kazen, McClain, Edises, Simon \u0026 Abrams, Oakland, CA. For FIBREBOARD CORPORATION, (95-40635), Appellee: Kelly C Wooster, Stephen M. Snyder, San Francisco, CA. William R Irwin, James L Miller, Brobeck, Phleger \u0026 Harrison, San Francisco, CA. For CONTINENTAL CASUALTY COMPANY, Appellee: Herbert Maurice Wachtell, Meyer G Koplow, Wachtell, Lipton, Rosen \u0026 Katz, New York, NY. Billy Glynn Parker, Ireland, Carroll and Kelley, Tyler, TX. Donald T Ramsey, David M Rice, Rodney L Eshelman, Carroll, Burdick \u0026 McDonough, San Francisco, CA. For PACIFIC INDEMNITY, (95-40635), Appellee: Paul J Bschorr, Richard B Sypher, c/o Dewey Ballantine, New York, NY. Dewey Ballantine, Dewey Ballantine, New York, NY. For OWENS-ILLINOIS INC, (95-40635), Appellee: Richard L Josephson, Baker and Botts, Houston, TX. Robert B Shaw, Nelson Mullins Riley \u0026 Scarborough, L.L.P., Columbia, SC. For PENN MUTUAL LIFE INSURANCE COMPANY, (95-40635), Appellee: Gary A Bresee, Barger and Wolen, San Francisco, CA. For COLUMBIA CASUALTY COMPANY, CNA CAUALTY COMPANY OF CALIFORNIA, (95-40635), Appellees: Herbert Maurice Wachtell, Meyer G Koplow, Wachtell, Lipton, Rosen \u0026 Katz, New York, NY. Stuart Philip Ross, Ross, Dixon and Masback, Washington, DC. Donald T Ramsey, David M Rice, Rodney L Eshelman, Carroll, Burdick \u0026 McDonough, San Francisco, CA. For CELOTEX CORP, (95-40635), Appellee: Charles P Schropp, Schropp, Buell \u0026 Elligett, Tampa, FL. For TRIAL LAWYERS FOR PUBLIC JUSTICE, (95-40635), Amicus Curiae: Arthur H. Bryant, Anne W. Bloom, Trial Lawyers for Public Justice, Washington, DC. For ASSOCIATION OF TRIAL LAWYERS OF AMERICA, (95-40635), Amicus Curiae: Jeffrey Robert White, Pamela A Liapakis, Associated Trial Lawyers of America, Washington, DC. For AMERICAN INSURANCE ASSOCIATION, (95-04635), Amicus Curiae: Craig A Berrington, David F Snyder, James L Kimble, American Insurance Association, Washington, DC. For ASBESTOS VICTIMS OF AMERICA, (95-04635), Amicus Curiae: Scott McCullen Baldwin, Baldwin \u0026 Baldwin, Marshall, TX. For CNA CASUALTY COMPANY OF CALIFORNIA, COLUMBIA CASUALTY COMPANY, (95-40694), Appellees: Herbert Maurice Wachtell, Meyer G Koplow, Wachtell, Lipton, Rosen \u0026 Katz, New York, NY. Billy Glynn Parker, Ireland, Carroll and Kelley, Tyler, TX. Donald T Ramsey, David M Rice, Rodney L Eshelman, Carroll, Burdick \u0026 McDonough, San Francisco, CA. For PACIFIC INDEMNITY, COMPANY, (95-40694), Paul J Bschorr, Richard B Sypher, c/o Dewey Ballantine, New York, NY. Billy Glynn Parker, (See above). For DANIEL HERMAN RUDD, JR, on behalf of themselves and others similarly situated, BEVERLY WHITE, on behalf of themselves and others similarly situated, JOHN HANSEL, on behalf of themselves and others similarly situated, (95-40694), Appellees: James E Coleman, Jr, Diane M Sumoski, John Andrew Martin, Carrington, Coleman, Sloman \u0026 Blumenthal, Dallas, TX. For OWENS-ILLINOIS INC, on behalf of itself and others similary situated, (95-40694), Appellee: Richard L josephson, Baker and Botts, Houston, TX. Robert B Shaw, Nelson Mullins Riley \u0026 Scarborough, L.L.P., Columbia, SC. ROBERT L SHAW, (95-40694), Appellee, Pro se, Westmoreland, KS. For PENN MUTUAL LIFE INSURANCE COMPANY, (95-40694), Appellee: J Russell Stedman, Barger and Wolen, San Francisco, CA. For FIBREBOARD CORPORATION, (95-40694), Appellee: Kelly C Wooster, Stephen M. Snyder, San Francisco, CA. William R Irwin, James L Miller, Brobeck, Phleger \u0026 Harrison, San Francisco, CA. For ESTABAN YANEZ ORTIZ, EDEE COCHRAN, LESTER EUGENE TAYLOR, JOHN R ALLGOOD, HENRY WILLIAM EVERS, (95-40694), Amicus Curiae: Frederick M Baron, Dallas, TX. Sidney Katherine Powell, S Ann Saucer, Powell \u0026 Associates, Dallas, TX. For TRIAL LAWYERS FOR PUBLIC JUSTICE, (95-40694), Amicus Curiae: Arthur H. Bryant, Trial Lawyers for Public Justice, Washington, DC. Anne W Bloom, Trial Justice for Public Justice, Washington, DC. For ASSOCIATION OF TRIAL LAWYERS OF AMERICA, (95-40694), Amicus Curiae: Jeffrey Robert White, Associated Trial Lawyers of America, Washington, DC. For AMERICAN INSURANCE ASSOCIATION, (95-40694), Amicus Curiae: James L Kimble, American Insurance Association, Washington, DC. For ASBESTOS VICTIMS OF AMERICA, (95-40694), Amicus Curiae: Scott McCullen Baldwin, Baldwin \u0026 Baldwin, Marshall, TX.",
    "category": [
      "184"
    ],
    "judges": "Before Reavley, Davis and Smith, Circuit Judges. Jerry E. Smith, Circuit Judge, Dissenting.",
    "citation_count": 36
  }
}
