{
  "id": "8KFOR2YBTlTomsSBh87h",
  "document": {
    "title": "Brosnahan v. Brown",
    "full_title": "JAMES J. BROSNAHAN ET AL. v. EDMUND G. BROWN, JR., AS GOVERNOR, ETC., ET AL.",
    "jurisdiction": "California Supreme Court",
    "date": "1982-09-02T00:00:00.000Z",
    "docket": "S.F. No. 24441",
    "body": "We consider multiple constitutional challenges to an initiative measure which was adopted by the voters of this state at the June 1982 Primary Election. Designated on the ballot as Proposition 8 and commonly known as \"The Victims' Bill of Rights,\" this initiative incorporated several constitutional and statutory provisions which were directed, in the words of the measure's preamble, towards \"ensuring a bill of rights for victims of crime, including safeguards in the criminal justice system to fully protect those rights . . . .\" (Cal. Const., art. I, § 28, subd. (a).)\n\nPetitioners are three taxpayers and voters who assert various constitutional defects in the manner Proposition 8 was submitted to the voters, and who object to the expenditure of public funds to implement it. Respondents are certain public officials and courts charged with the responsibility of implementing, enforcing or applying the new measure.\n\nIn an earlier, related proceeding, we ordered the measure to be placed on the primary election ballot, reserving for our further consideration the substantive issues herein presented pending the outcome of the\n\nelection. (Brosnahan v. Eu (1982) 31 Cal. 3d 1, 4 [181 Cal. Rptr. 100, 641 P.2d 200].) The present petition, seeking writs of mandate or prohibition, was originally filed in the Court of Appeal. On motion of respondent Attorney General, we transferred the cause to this court. (Rule 20, Cal. Rules of Court.) It is uniformly agreed that the issues are of great public importance and should be resolved promptly. Accordingly, under well settled principles, it is appropriate that we exercise our original jurisdiction. (See Amador Valley Joint Union High Sch. Dist. v. State Bd. of Equalization (1978) 22 Cal. 3d 208, 219 [149 Cal. Rptr. 239, 583 P.2d 1281] [hereafter Amador ]; Clean Air Constituency v. California State Air Resources Bd. (1974) 11 Cal. 3d 801, 808-809 [114 Cal. Rptr. 577, 523 P.2d 617].)\n\nOur inquiry here is limited, framed in the following manner by the petition itself: \"This petition for extraordinary relief attacks neither the merits nor the wisdom of the [initiative's] multiple proposals. Petitioners challenge only the manner in which those proposals were submitted to the voters . . . .\" At this time we neither consider nor anticipate possible attacks, constitutional or otherwise, which in the future may be directed at the various substantive changes effected by Proposition 8. As in Amador, we examine here \"only those principal, fundamental challenges to the validity of [Prop. 8] as a whole . . . . 'Analysis of the problems which may arise respecting the interpretation or application of particular provisions of the act should be deferred for future cases in which those provisions are more directly challenged.' [Citation.]\" (Amador, 22 Cal. 3d at p. 219.) We will conclude that, notwithstanding the existence of some unresolved uncertainties, as to which we reserve judgment, the initiative measure under scrutiny here survives each of petitioners' four constitutional objections.\n\nPreliminarily, we stress that \"it is a fundamental precept of our law that, although the legislative power under our constitutional framework is firmly vested in the Legislature, ' the people reserve to themselves the powers of initiative and referendum.' (Cal. Const., art. IV, § 1.) It follows from this that, '\"[the] power of initiative must be liberally construed. . . to promote the democratic process.\"' [Citations.]\" (Amador at pp. 219-220, italics added.) Indeed, as we so very recently acknowledged in Amador, it is our solemn duty jealously to guard the sovereign people's initiative power, \"it being one of the most precious rights of our democratic process.\" (Id., at p. 248.) Consistent with prior precedent, we are required to resolve any reasonable doubts in favor of the exercise of this precious right. (Ibid.)\n\nBearing in mind these fundamental principles, we next summarize the basic provisions of Proposition 8. As in Amador, we caution that our summary description and interpretation of the measure by no means preclude subsequent challenges to the legality of its provisions, apart from the specific constitutional issues resolved herein. (Id., at p. 220.)\n\nI. Summary of Proposition 8\n\nAs previously noted, the measure denominated \"The Victims' Bill of Rights,\" accomplishes several changes in the criminal justice system in this state for the purpose of protecting or promoting the rights of victims of crime. Thus, section 28 is added to article I of the California Constitution, section 12 of article I (relating to the right to bail) is repealed, and certain additions are made to the Penal and Welfare and Institutions Codes. The primary changes or additions are as follows:\n\na. Preamble; Victims' Rights and Public Safety\n\nSection 28, subdivision (a), is added to article I of the state Constitution expressing a \"grave statewide concern\" to enact \"safeguards in the criminal justice system\" for the protection of victims of crime. The preamble recites generally that the rights of victims include, among others, the right to restitution for financial losses, and the expectation that felons will be \"appropriately detained in custody, tried by the courts, and sufficiently punished so that public safety is protected and encouraged . . . .\" In addition, the provision states that \"[such] public safety extends to public . . . school campuses, where students and staff have the right to be safe and secure in their persons.\" The preamble concludes by observing that \"broad reforms in the procedural treatment of accused persons and the disposition and sentencing of convicted persons are necessary and proper as deterrents to criminal behavior and to serious disruption of people's lives.\"\n\nb. Restitution\n\nSection 28, subdivision (b), is added to the Constitution to assure generally that persons who \"suffer losses as a result of criminal activity shall have the right to restitution\" from the persons convicted of those crimes. \"Restitution shall be ordered . . . in every case, . . . unless compelling and extraordinary reasons exist to the contrary.\"\n\nc. Safe Schools\n\nSection 28, subdivision (c), declares the \"inalienable right\" of public school students and staff \"to attend campuses which are safe, secure and peaceful.\"\n\nd. Truth-in-evidence\n\nSection 28, subdivision (d), provides that (except as provided by statutes enacted by a two-thirds vote of both houses of the Legislature) \"relevant evidence shall not be excluded in any criminal proceeding . . . .\" The provision applies equally to juvenile criminal proceedings, but does not affect \"any existing statutory rule of evidence relating to privilege or hearsay, or Evidence Code, Sections 352, 782 or 1103,\" or rights of the press.\n\ne. Bail\n\nSection 28, subdivision (e), relates to bail and replaces repealed section 12 of article I. The new provision requires that \"primary consideration\" be given to \"public safety,\" and authorizes the judge or magistrate to consider \"the protection of the public, the seriousness of the offense charged, the previous criminal record of the defendant, and the probability of his or her appearing at the trial or hearing\" in ruling on bail matters. In addition, the provision forbids release on one's \"own recognizance\" of a person charged with any \"serious felony\" (see Pen. Code, § 1192.7, subd. (c)). (As noted below, all or part of subd. (e) may not have taken effect because of the passage of a competing measure (Prop. 4) by a larger vote.)\n\nf. Prior Convictions\n\nSection 28, subdivision (f), permits the unlimited use in a criminal proceeding of \"any prior felony conviction\" for impeachment or sentence enhancement, and requires proof thereof \"in open court\" when the prior conviction is an element of any felony offense.\n\ng. Diminished Capacity; Insanity\n\nThe addition of section 25 to the Penal Code abolishes the defense of diminished capacity (subd. (a)); places upon the defendant who pleads insanity the burden of proving his or her incapability of \"knowing or\n\nunderstanding the nature and quality of his or her act and of distinguishing right from wrong at the time of the commission of the offense\" (subd. (b)); and permits consideration of evidence of diminished capacity or mental disorder \"only at the time of sentencing or other disposition or commitment\" (subd. (c)).\n\nh. Habitual Criminals\n\nSection 667 is added to the Penal Code to require that persons convicted of a \"serious felony\" receive a sentence enhancement of five years for each prior conviction of such a felony \"on charges brought and tried separately. The terms of the present offense and each enhancement shall run consecutively.\" (Subd. (a).)\n\ni. Victim's Statements\n\nNew sections 1191.1 and 3043 in the Penal Code, and section 1767 in the Welfare and Institutions Code, permit the victim of any crime or the next of kin the right to prior notice of, and to attend, all sentencing proceedings (subd. (a)), or parole eligibility or parole setting hearings in criminal (subd. (b)) or Youth Authority (subd. (c)) proceedings. The victim or next of kin may appear and \"express his or her views concerning the crime and the person responsible.\" The sentencing or parole authority shall consider these views in making its decision and shall state \"whether the person would pose a threat to public safety\" if granted probation or released on parole.\n\nj. Plea Bargaining\n\nSection 1192.7 is added to the Penal Code to prohibit plea bargaining if the indictment or information charges \"any serious felony\" or any offense of driving while intoxicated, \"unless there is insufficient evidence to prove the people's case, or testimony of a material witness cannot be obtained, or a reduction or dismissal would not result in a substantial change in sentence.\" (Subd. (a).) Subdivision (c) contains a list of the various offenses deemed to be \"serious felonies.\"\n\nk. Sentencing to Youth Authority\n\nThe addition of section 1732.5 to the Welfare and Institutions Code provides that no person convicted of murder, rape or other \"serious felony\"\n\ncommitted when he or she was 18 years or older shall be committed to Youth Authority.\n\nl. Mentally Disordered Sex Offenders\n\nNew section 6331 of the Welfare and Institutions Code renders \"inoperative\" the article dealing with mentally disordered sex offenders (MDSOs). (As this article was repealed in 1981, the initiative does not appear to accomplish any change in the law.)\n\nm. Severability\n\nSection 10 of the initiative recites that if any section or clause thereof is held invalid, such invalidity shall not affect any remaining provisions which can be given effect without the invalid provision.\n\nn. Amendments\n\nA two-thirds vote of both houses of the Legislature is required to amend most of the statutory provisions adopted by Proposition 8.\n\nHaving summarized its principal elements, we examine petitioners' four challenges to the validity of Proposition 8.\n\nII. The Single Subject Rule\n\nOur Constitution provides that \"An initiative measure embracing more than one subject may not be submitted to the electors or have any effect.\" (Art. II, § 8, subd. (d).) In determining whether a measure \"[embraces] more than one subject,\" we have previously held that \"an initiative measure does not violate the single-subject requirement if, despite its varied collateral effects, all of its parts are 'reasonably germane ' to each other,\" and to the general purpose or object of the initiative. (Amador, 22 Cal. 3d at p. 230, italics added; see Fair Political Practices Com. v. Superior Court (1979) 25 Cal. 3d 33, 38-39 [157 Cal. Rptr. 855, 599 P.2d 46] [hereafter FPPC ]; Perry v. Jordan (1949) 34 Cal. 2d 87, 90-92 [207 P.2d 47].)\n\nIn Amador, for example, we upheld a four-pronged taxation measure which limited real property tax rates and assessments and restricted state and local taxes, on the ground that such restrictions were reasonably germane to the general subject of property tax relief. (22 Cal. 3d at\n\np. 231.) Even more recently in FPPC, we rejected a single-subject challenge to a lengthy political reform measure which contained the following multiple complex features: (1) establishment of a fair political practices commission; (2) creation of disclosure requirements for candidates' financial supporters; (3) limitation on campaign spending; (4) regulation of lobbyist activities; (5) enactment of conflict of interest rules; (6) adoption of rules relating to voter pamphlet summaries of arguments; (7) location of the ballot position of candidates; and (8) specification of auditing and penalty procedures to aid in the act's enforcement. (See 25 Cal. 3d at p. 37.)\n\nIn FPPC, we reemphasized that the single subject rule is to be \"construed liberally,\" and that \"Numerous provisions, having one general object, if fairly indicated in the title, may be united in one act.\" (Id., at p. 38, italics added.) In amplification, we used this language in FPPC in describing the overriding principle which controls our disposition of the single-subject attack against Proposition 8: \" Consistent with our duty to uphold the people's right to initiative process, we adhere to the reasonably germane test and, in doing so, find that the measure before us complies with the one subject requirement . . . . In keeping with the policy favoring the initiative, the voters may not be limited to brief general statements but may deal comprehensively and in detail with an area of law.\" (25 Cal. 3d at p. 41, italics added.)\n\nOur own precedent is both venerable and current. While FPPC is only three years old, its underlying thesis was enunciated by us fifty years ago. In FPPC we cited with approval Evans v. Superior Court (1932) 215 Cal. 58, 61-62 [8 P.2d 467]. Evans is most instructive. We there upheld the adoption, in a single act, of extensive probate legislation consisting of one thousand and seven hundred sections covering a wide spectrum of topics within the general \"area\" of \"probate law,\" which sections previously were contained in part in several codes and statutes. This \"one general object\" included such disparate subjects as the essential elements of wills, the rights of succession, the details of the administration and distribution of decedents' estates, and the procedures, duties, and rights of guardianships of the persons and estates of minors and incompetents. (215 Cal. at p. 61.) Despite the extremely broad sweep of this legislation, we concluded that all of these matters were \"reasonably germane\" to the general object of the legislation and did not embrace more than a single subject. Expanding on this concept, in Evans, we said \"The legislature may insert in a single act all legislation germane to the general subject as expressed in its title and within\n\nthe field of legislation suggested thereby. [Citation.] Provisions which are logically germane to the title of the act and are included within its scope may be united. The general purpose of a statute being declared, the details provided for its accomplishment will be regarded as necessary incidents. [Citations.] . . . A provision which conduces to the act, or which is auxiliary to and promotive of its main purpose, or has a necessary and natural connection with such purpose is germane within the rule. [Citation.]\" (Pp. 62-63.)\n\nOn the basis of the foregoing authorities, it is readily apparent that Proposition 8 meets the \"reasonably germane\" standard. Each of its several facets bears a common concern, \"general object\" or \"general subject,\" promoting the rights of actual or potential crime victims. As explained in the initiative's preamble, the 10 sections were designed to strengthen procedural and substantive safeguards for victims in our criminal justice system. These changes were aimed at achieving more severe punishment for, and more effective deterrence of, criminal acts, protecting the public from the premature release into society of criminal offenders, providing safety from crime to a particularly vulnerable group of victims, namely school pupils and staff, and assuring restitution for the victims of criminal acts.\n\nJust as Evans, Amador and FPPC upheld broad and multifaceted \"reform\" measures pertaining to the subjects of probate, property taxation, and politics, respectively, Proposition 8 constitutes a reform aimed at certain features of the criminal justice system to protect and enhance the rights of crime victims. This goal is the readily discernible common thread which unites all of the initiative's provisions in advancing its common purpose.\n\nFocusing on the initiative's \"safe schools\" provision, petitioners contend that it concerns an entirely unrelated matter, isolated from criminal behavior, and therefore embraces a separate subject. Petitioners argue specifically that the right to safe schools is an undefined, amorphous concept which could encompass such diverse hazards as acts of nature, acts of war, environmental risks, or building code violations. A careful look at the preamble of Proposition 8 refutes this contention. New article I, section 28, subdivision (a), of the Constitution recites that the enactment of laws \"ensuring a bill of rights for victims of crime, including safeguards in the criminal justice system. . . is a matter of grave statewide concern. The rights of victims pervade the criminal justice system,\" and include not only reimbursement for losses\n\nfrom \" criminal acts\" but also the expectation that \"persons who commit felonious acts\" shall be detained, tried and punished \"so that the public safety is protected.\" (Italics added.) The preamble then continues, \" Such public safety extends to public . . . school campuses, where students and staff have the right to be safe and secure in their persons.\" The preamble further concludes that \"broad reforms . . . are necessary and proper as deterrents to criminal behavior.\" (Italics added.) Clearly, the right to safety encompassed within article I, section 28, subdivision (c), was intended to be, is aimed at, and is limited to, the single subject of safety from criminal behavior.\n\nWe are reinforced in our conclusion that Proposition 8 embraces a single subject by observing that the measure appears to reflect public dissatisfaction with several prior judicial decisions in the area of criminal law. As explained in the ballot argument favoring Proposition 8, \"This proposition will overcome some of the adverse decisions by our higher courts,\" which had created \"additional rights for the criminally accused and placed more restrictions on law enforcement officers.\" (Ballot Pamp., Proposed Amends. to Cal. Const. with arguments to voters, Prim. Elec. (Jun. 8, 1982), argument in favor of Prop. 8, p. 34.) While we might disagree with both the accuracy of this premise and the overall wisdom of the initiative measure, nonetheless, it is not our function to pass judgment on the propriety or soundness of Proposition 8. In our democratic society in the absence of some compelling, overriding constitutional imperative, we should not prohibit the sovereign people from either expressing or implementing their own will on matters of such direct and immediate importance to them as their own perceived safety. (See Amador, pp. 228-229.)\n\nPetitioners, however, would engraft upon the \"reasonably germane\" test of Evans, Amador and FPPC a further requirement that the several provisions of an initiative measure must be \"interdependent.\" Petitioners argue that, unlike the \"interlocking\" relationship of the various elements of the tax reform measure upheld in Amador (see 22 Cal. 3d at p. 231), Proposition 8 contains disparate provisions covering a variety of \"unrelated\" matters such as school safety, restitution, bail, diminished capacity, and the like.\n\nNo preceding case has ever suggested that such interdependence is a constitutional prerequisite. In Evans, for example, we carefully explained that \"Numerous provisions, having one general object, if fairly indicated in the title, may be unified in one act. Provisions governing\n\nprojects so related and interdependent as to constitute a single scheme may be properly included within a single act. [Citation.] The legislature may insert in a single act all legislation germane to the general subject as expressed in its title and within the field of legislation suggested thereby. [Citation.]\" (215 Cal. at pp. 62-63, italics added.)\n\nIn context, it is obvious that Evans ' reference to interdependence merely illustrated one type of multifaceted legislation which would meet the single subject test. Significantly, as noted, in Evans we upheld extensive probate legislation concerning such diverse and unrelated topics as the rights of intestate succession, the powers of guardians over the persons and estates of incompetent persons, and the sale and leasing of estate property, on the express ground that all of these provisions \"have one general object.\" (P. 65.)\n\nMoreover, in Amador, while acknowledging that the provisions of the tax measure under scrutiny were \"interdependent\" and \"interlocking\" (22 Cal. 3d at p. 231), we did not suggest that any such relationship was essential to the measure's validity. Indeed, immediately preceding the foregoing observation, we had stated that the property tax initiative satisfied both the traditional reasonably germane test and the so-called \"functional relationship\" test which was proposed in the dissent in Schmitz v. Younger (1978) 21 Cal. 3d 90, 97-100 [145 Cal. Rptr. 517, 577 P.2d 652] (dis. opn. by Manuel, J.). (See 22 Cal. 3d at p. 230.) Thus, petitioners' assumption that Amador requires that an initiative's several provisions be \"interdependent\" is incorrect.\n\nFinally, as previously indicated, in FPPC we upheld a comprehensive political reform package despite the lack of any apparent \"interdependence\" of many of its varied provisions. Thus, for example, the section of the initiative denying an incumbent a favored position on the ballot (Gov. Code, § 89000) clearly did not \"interlock\" with the separate provisions mandating every administrative agency to adopt a conflict of interest code (id., §§ 87300-87312). Similarly, and quite obviously, neither of the foregoing portions of the initiative was in any sense in a \"dependent\" relationship with another section of the initiative which established that \"the election precinct of a person signing a statewide petition shall not be required to appear on the petition when it is filed with the county clerk\" (id., § 85203). Each of these diverse provisions, while generally related to a political reform program, clearly would not have satisfied a strict \"interdependence\" test.\n\nPetitioners, sensing the evident inconsistency between FPPC and their own present position, characterize the FPPC lead opinion as a mere \"plurality\" opinion entitled to little weight. Yet six of the seven justices in that case voted to sustain the multifaceted provisions of the Fair Political Practices Act against a single-subject attack. It was only Justice Manuel who dissented on this point. His observations regarding the act's multifarious character and his conceptual differences with his six colleagues are very revealing for, in his view: \"The regulation of the election process, no matter how broadly defined, has little to do with the regulation of the day-to-day activities of lobbyists. The adoption of codes governing conflicts of interest in all state agencies . . . is yet another matter. Although each of these might conceivably form a part of a unified legislative program directed toward the policy objective of 'political reform,' each concerns an entirely different and discrete subject.\" (25 Cal. 3d at p. 57; italics in original.)\n\nIf Justice Manuel's characterization of the Fair Political Practices Act is accurate, and if we are to follow our own precedent, our holding in FPPC necessarily controls the disposition of the present case, for on their face the various provisions of Proposition 8 certainly are no less germane, interdependent or interrelated than the provisions of the statute which we so recently sustained in FPPC against a similar single-subject attack.\n\nPetitioners argue that because Proposition 8 is designed to protect the rights of potential as well as actual victims of crime, its objective somehow thereby becomes too broad. Yet surely the Fair Political Practices Act which we readily upheld in FPPC was subject to the same criticism, for it too was aimed at protecting the general citizenry in their role as potential victims of political corruption. Obviously, the fact that a multifaceted measure seeks to protect the general public from harm (whether from present or future criminal acts, political corruption or excessive taxation) presents no constitutional impediment to its validity.\n\nPetitioners speculate that the multiplicity of Proposition 8's provisions enhanced the danger of election \"logrolling,\" whereby certain groupings of voters, each constituting numerically a minority, but in aggregate a majority, may approve a measure which lacks genuine popular support in order to secure the benefit of one favored but isolated and severable provision. Yet, as we emphasized in FPPC, such a risk \"is inherent in any initiative containing more than one sentence or even an\n\n'and' in a single sentence unless the provisions are redundant . . . . [ para. ] The enactment of laws whether by the Legislature or by the voters in the last analysis always presents the issue whether on balance the proposed act's benefits exceed its shortcomings.\" (25 Cal. 3d at p. 42.) Indeed, almost all laws whether enacted by a legislature or adopted directly by the people through an initiative contain both benefits and burdens. The decision to enact laws, whether directly by the people or through their representatives, involves the weighing of pros and cons. The resolution of few public issues is free from this balancing process and exercise of choices.\n\nAs in FPPC, so in Amador we rejected the contention that the single-subject rule requires a showing that each one of a measure's several provisions was capable of gaining voter approval independently of the other provisions. We expressed our conclusion that \"Aside from the obvious difficulty of ever establishing satisfactorily such 'independent voter approval,' this standard would defeat many legitimate enactments containing isolated, arguably 'unpopular,' provisions reasonably deemed necessary to the integrated functioning of the enactment as a whole. We avoid an overly strict judicial application of the single-subject requirement, for to do so could well frustrate legitimate efforts by the people to accomplish integrated reform measures.\" (Amador, 22 Cal. 3d at p. 232.)\n\nOne commentator, examining the purpose of the rule within this context, has noted that \"The one-subject rule . . . attacks log-rolling by striking down unnatural combinations of provisions in acts -- those dealing with more than one subject -- on the theory that the best explanation for the unnatural combination is a tactical one -- log-rolling.\" (Ruud, \" No Law Shall Embrace More Than One Subject \" (1958) 42 Minn.L.Rev. 389, 408.) It is highly unlikely that Proposition 8 was the product of any logrolling whatever, because it contains no \"unnatural combination\" of provisions on unrelated subjects which might suggest an inordinate vote-getting scheme on behalf of the proponents. All of the provisions are designed to protect victims of crime and partake of a common consistent theme, namely, to strengthen or tighten the laws in aid of crime's victims. The measure is singularly unsusceptible to such \"logrolling\" criticism.\n\nFinally, petitioners insist that the complexity of Proposition 8 may have led to confusion or deception among voters, who were assertedly uninformed regarding the contents of the measure. Yet, as was the case\n\nin both Amador and FPPC, Proposition 8 received widespread publicity. Newspaper, radio and television editorials focused on its provisions, and extensive public debate involving candidates, letters to the editor, etc., described the pros and cons of the measure. In addition, before the election each voter received a pamphlet containing (1) the title and summary prepared by the Attorney General, (2) a detailed analysis of the measure by the Legislative Analyst, and (3) a complete \"Text of the Proposed Law.\" This text contained the entirety of the 10 sections of the Victims' Bill of Rights and included in \"strikeout type\" the text of former article I, section 12, of the Constitution. Each voter also was given written arguments in favor of Proposition 8 and rebuttal thereto, and written arguments against Proposition 8 and rebuttal thereto. (See Amador, 22 Cal. 3d at pp. 231, 243-244; FPPC, 25 Cal. 3d at p. 42.)\n\nMoreover, as we stated in FPPC in disposing of an identical contention that the measure was too complicated, \"Our society being complex, the rules governing it whether adopted by legislation or initiative will necessarily be complex. Unless we are to repudiate or cripple use of the initiative, risk of confusion must be borne.\" (Ibid.)\n\nPetitioners' entire argument that, in approving Proposition 8, the voters must have been misled or confused is based upon the improbable assumption that the people did not know what they were doing. It is equally arguable that, faced with startling crime statistics and frustrated by the perceived inability of the criminal justice system to protect them, the people knew exactly what they were doing. In any event, we should not lightly presume that the voters did not know what they were about in approving Proposition 8. Rather, in accordance with our tradition, \" we ordinarily should assume that the voters who approved a constitutional amendment '. . . have voted intelligently upon an amendment to their organic law, the whole text of which was supplied each of them prior to the election and which they must be assumed to have duly considered.'\" (Amador, supra, at pp. 243-244, italics added; see Wright v. Jordan (1923) 192 Cal. 704, 713 [221 P. 915].)\n\nThere are those rare occasions similar to that which prompted the people's adoption of the single-subject initiative rule in 1948 (Cal. Const., art. II, § 8, subd. (d)) in which our intervention is justified. The proposed initiative may be so all encompassing, so multifaceted as to demand a conclusion of unconstitutionality. We faced such a measure in McFadden v. Jordan (1948) 32 Cal. 2d 330 [196 P.2d 787], in which\n\n21,000 words were proposed to be added to 15 of the 25 constitutional articles. This initiative dealt with such widely disparate subjects as gambling, civic centers, mining, fishing, city budgets, liquor control, senate reapportionment, and oleomargarine. We concluded that the measure constituted an improper revision of our constitutional scheme. In McFadden, we likewise could not fairly and reasonably have decided that any single subject was served by such a grabbag of social, political, economic and administrative enactments. Proposition 8 is manifestly not such a measure.\n\nFor all of the foregoing reasons, we conclude that Proposition 8 does not violate the single-subject requirement of article II, section 8, subdivision (d), of the California Constitution.\n\nWe do not suggest, of course, that initiative proponents are given blank checks to draft measures containing unduly diverse or extensive provisions bearing no reasonable relationship to each other or to the general object which is sought to be promoted. The single-subject rule indeed is a constitutional safeguard adopted to protect against multifaceted measures of undue scope. For example, the rule obviously forbids joining disparate provisions which appear germane only to topics of excessive generality such as \"government\" or \"public welfare.\" In the present case, however, we merely respect this court's liberal interpretative tradition, notably expressed in Evans, Amador, and FPPC, of sustaining statutes and initiatives which fairly disclose a reasonable and common sense relationship among their various components in furtherance of a common purpose.\n\nIII. Validity of Statutory Amendments\n\nPetitioners contend that the proponents of Proposition 8 failed in several particulars to comply with the constitutionally mandated procedure for amending statutes. Article II, section 8, subdivision (b), of the state Constitution requires that the initiative measure petition set forth \"the text of the proposed statute or amendment to the Constitution . . . .\" It is uncontradicted that the proponents of the measure complied with this provision. Petitioners rely, however, upon article IV, section 9, which provides that \"A statute shall embrace but one subject, which shall be expressed in its title. If a statute embraces a subject not expressed in its title, only the part not expressed is void. A statute may not be amended by reference to its title. A section of a statute may not be amended unless the section is re-enacted as amended.\" (See also Elec. Code,\n\n§§ 3571, 3572; Gov. Code, §§ 88000, 88002, requiring that the ballot pamphlets disclose the text of any existing statutory provisions sought to be repealed or amended.)\n\nThe foregoing provision, containing a \"single subject\" rule applicable to statutes, also forbids amending a statute \"by reference to its title\" and \"unless the section is re-enacted as amended.\" Petitioners assume that this language \"requires that if a statute is to be altered, the language of the statute must be fully set forth together with the changes proposed. Reference to sections, title or codes is not sufficient.\" According to petitioners, Proposition 8 violated this requirement by failing to describe or identify (1) the provisions in the Welfare and Institutions Code rendered \"inoperative\" by the adoption of section 6331 of the code (dealing with the commitment of mentally disordered sex offenders); (2) the language of article I, section 12, of the Constitution (pertaining to right to bail) repealed by section 2 of Proposition 8; and (3) the provisions of the Evidence Code (and other codes) amended or repealed by the adoption of article I, section 28, subdivision (d), of the Constitution (forbidding the exclusion of \"relevant evidence\"). Petitioners list 26 statutory provisions which they suggest were \" sub silentio amended to be inapplicable in criminal trials.\"\n\na. Repeal of MDSO Statute\n\nAs previously noted, Proposition 8 added section 6331 to the Welfare and Institutions Code. The section declares \"inoperative\" the \"article\" within which section 6331 is contained, but fails to identify the text of that article. As we have explained, however, the entire article dealing with MDSOs was repealed in 1981 (Stats. 1981, ch. 928, § 2) and the Legislative Analyst observed in the voters' pamphlet that new section 6331 is superfluous and \"has no effect.\" (Ballot Pamp., supra, p. 55.) Assuming that this conclusion is correct, the section being a nullity, any procedural defect in adopting that section must be deemed harmless, especially in view of the severability clause (§ 10) in Proposition 8.\n\nb. Bail Amendment\n\nProposition 8 added a new provision to the Constitution regarding the right to release on bail or on one's own recognizance. (Cal. Const., art. I, § 28, subd. (e).) The previous bail provision (art. I, § 12) was repealed. Petitioners contend that the initiative measure was defective\n\nin failing to set out in full the text of the repealed provision. Several reasons persuade us otherwise.\n\nFirst, nothing in article IV, section 9, requiring reenactment of statutes, purports to affect constitutional amendments such as those before us; by its terms this provision refers to the amendment of a \"statute.\"\n\nNext, we observe that the voters' pamphlet for the June 1982 primary contained a \"Text of Proposed Law\" which set forth the entire text of former article I, section 12, in \"strikeout type,\" indicating that this provision would be \"deleted\" by Proposition 8. We may fairly assume that the voters duly considered the text set forth in the voters' pamphlet prior to casting their vote. (Amador, 22 Cal. 3d at pp. 231, 243-244.)\n\nFinally, as previously noted, it may be that a substantial part of the bail provisions of Proposition 8 never took effect. We are advised that Proposition 4 on the June 1982 ballot received a greater number of votes than Proposition 8, in which event Proposition 4 would prevail as to those matters inconsistent with the latter measure. (See Cal. Const., art. XVIII, § 4.) Accordingly, any procedural defect in adopting the bail provisions of Proposition 8 would be harmless to a large extent and would not affect the remaining, severable provisions of the measure.\n\nc. Repeal of Statutes by Implication\n\nPetitioners contend that Proposition 8 is void to the extent that it amends or repeals by implication various statutory provisions not identified (by section number, title or text) in the measure. In advancing this argument petitioners point to new article I, section 28, subdivision (d), of the Constitution, which provides that, with the exception of the several statutory exceptions specified therein, \"relevant evidence shall not be excluded in any criminal proceeding . . . .\"\n\nInitially, we question whether the provisions of article IV, section 9, of the state Constitution apply to constitutional amendments (such as new art. I, § 28) which have the effect of amending or repealing statutes. The purpose of these procedural limitations was described by us in People v. Western Fruit Growers (1943) 22 Cal. 2d 494, 500-501 [140 P.2d 13]: \"In the absence of such a provision [forbidding amendment of a statute 'by reference to its title' and requiring 're-enactment' as amended] legislative bodies commonly amended an act or a section of\n\nit by directing the insertion, omission or substitution of certain words, or by adding a provision, without setting out the entire context of the section as amended. [Citations.] The objection to this method of amendment was the uncertainty and difficulty of correctly reading the original section as later changed. [ para. ] To avoid the mischief inherent in the mechanics of this legislative process, the People of California imposed certain requirements upon the Legislature, but the provision should be reasonably construed and limited in its application to the specific evil which it was designed to remedy. It is not to be technically measured, nor used as a weapon for striking down legislation which may not reasonably be said to have been enacted contrary to the specified method. [Citations.]\" (Italics added; see also Scott A. v. Superior Court (1972) 27 Cal. App. 3d 292, 294-295 [103 Cal. Rptr. 683]; Estate of Henry (1941) 64 Cal. App. 2d 76, 82 [148 P.2d 396].)\n\nIn Wallace v. Zinman (1927) 200 Cal. 585, 590-591 [254 P. 946, 62 A.L.R. 1341], the court held that the subject/title requirements of the predecessor (art. IV, § 24) to the provision under scrutiny here applied to both legislative and initiative measures. The measure in Wallace, however, was not a constitutional amendment which, as we recognized in that case, \"need not conform\" to the provisions of former section 24. (Id., at p. 593.)\n\nFurthermore, we expressly held more recently that this same predecessor provision was inapplicable to constitutional amendments which were adopted by initiative. (Prince v. City \u0026 County of S.F. (1957) 48 Cal. 2d 472, 475 [311 P.2d 544].) As we stated in Prince, \"Article IV of the Constitution deals with the 'Legislative Department' and section 24 is intended to be and has been limited to legislative enactments under the Constitution. [Citations.]\" Therefore, because the \"truth-in-evidence\" provision of Proposition 8 is contained in a constitutional amendment (art. I, § 28, subd. (d)), that provision is not governed by the requirements of article IV, section 9.\n\nMoreover, even were we to assume that the provisions of article IV, section 9, controlled constitutional amendments which themselves \"amend\" a statute, Proposition 8 did not amend any statute or section of a statute within the meaning of that provision. The measure added new sections to the Penal Code and the Welfare and Institutions Code, and may also have repealed or modified by implication only preexisting statutory provisions. Article IV, section 9, was not intended to apply in such a situation. (Harris v. Fitting (1937) 9 Cal. 2d 117, 120 [69 P.2d\n\n833]; Evans v. Superior Court, supra, 215 Cal. 58, 65-66; Matter of Coburn (1913) 165 Cal. 202, 211 [131 P. 352]; Hellman v. Shoulters (1896) 114 Cal. 136, 151-153 [44 P. 915, 45 P. 1057]; Spencer v. G.A. MacDonald Constr. Co. (1976) 63 Cal. App. 3d 836, 850 [134 Cal. Rptr. 78]; Estate of Henry, supra, 64 Cal. App. 2d 76, 82; cf. Scott v. Superior Court, supra, 27 Cal. App. 3d 292, 294-295 [invalid statutory attempt to amend \"any provision of law\" specifying 21 years as the age of majority].)\n\nEvans, again, is illustrative. As we have previously noted, the Legislature adopted the Probate Code (Stats. 1931, ch. 281, p. 587) in a single enactment consisting of approximately 1,700 different sections. After rejecting a \"single subject\" challenge, we considered whether the act was void for failure to \"publish at length\" any prior acts or sections \"on the ground that they were revised or amended.\" (P. 65.) We held that the enactment was \"a new and original piece of legislation. Its terms are not revisory or amendatory of any former act. Consequently, the provisions of the Constitution requiring that revised or amended laws shall be 'published at length as revised or amended' does not apply, even though the provisions of the Probate Code may be inconsistent with existing statutes. . . . While the act does not expressly refer to other acts and repeal them in terms, it does repeal them by necessary implication. [Citation.] . . . [ The ] section (sec. 24, art. IV) ' does not apply to amendments by implication.' [Citation.]\" (215 Cal. at pp. 65-66, italics added.)\n\nIt may be true, as petitioners state, that Proposition 8 has amended or repealed, by implication, various statutory provisions not specified in the text of that measure. Yet as we pointed out long ago in Hellman, supra, \"To say that every statute which thus affects the operation of another is therefore an amendment of it would introduce into the law an element of uncertainty which no one can estimate. It is impossible for the wisest legislator to know in advance how every statute proposed would affect the operation of existing laws.\" (114 Cal. at p. 152, italics added.) Similarly, it would have been wholly unrealistic to require the proponents of Proposition 8 to anticipate and specify in advance every change in existing statutory provisions which could be expected to result from the adoption of that measure.\n\nWe conclude that Proposition 8 did not violate article IV, section 9, of the California Constitution.\n\nIV. Effect on Essential Governmental Functions\n\nPetitioners' third challenge is that Proposition 8 is invalid as an impermissible impairment of \"essential government functions.\" They rely on cases which hold as a general proposition that \"The initiative . . . is not applicable where 'the inevitable effect would be greatly to impair or wholly destroy the efficacy of some other governmental power, the practical application of which is essential . . . .' [Citations.]\" (Simpson v. Hite (1950) 36 Cal. 2d 125, 134 [222 P.2d 225], italics added; see Birkenfeld v. City of Berkeley (1976) 17 Cal. 3d 129, 143, 144 [130 Cal. Rptr. 465, 550 P.2d 1001] [mere \"speculative consequences\" are insufficient].) We assume, for purposes of discussion, that the principles of these cases (which involve local initiative or referendum measures) are equally applicable to measures of statewide application.\n\nPetitioners conjure several supposed consequences of Proposition 8 which \"will severely impair the functioning of the courts, the Department of Corrections and the public school system.\" As will appear, however, none of these consequences is as inevitable as petitioners suggest. Indeed, we may assume that the courts and other agencies, interpreting and applying the various provisions of Proposition 8, will approach their task with a view toward preserving, rather than destroying, the essential functions of government.\n\nFirst, petitioners predict that the measure's restrictions upon plea bargaining will have a \"most damaging effect\" upon already crowded court calendars. Even assuming that this prediction is accurate, we cannot accept petitioners' underlying premise that an initiative measure which, as a collateral effect, may aggravate court congestion is void under the Simpson principle. In Simpson we examined an initiative measure which would have directly prevented a local board of supervisors from designating a site for court buildings. We stressed that, among other adverse effects, such an initiative \"could interfere with the functioning of the courts by depriving them of the quarters which the supervisors were bound to, and in good faith sought to, furnish.\" (36 Cal. 2d at p. 133; see also Geiger v. Board of Supervisors (1957) 48 Cal. 2d 832, 839 [313 P.2d 545] [referendum inapplicable to repeal local sales and use tax]; Chase v. Kalber (1915) 28 Cal. App. 561, 569-570 [153 P. 397] [referendum inapplicable to repeal street improvement ordinance].) No such constricting effect on court operations is herein presented. While plea bargaining may well be a useful device in reducing\n\ncourt congestion, unlike a courthouse it is really not an essential prerequisite to the administration of justice. Moreover, any effect upon the criminal justice system from restrictions upon plea bargaining would be largely speculative and would not appear on the face of Proposition 8. That measure's conditional prohibition against plea bargaining appears to apply only to the postindictment or postinformation stage, and only with respect to \"serious felonies\" as defined therein. Bargaining may continue with respect to lesser offenses. Moreover, even as to serious felonies, bargaining may proceed if material witnesses or evidence become unavailable, or if the plea would not substantially reduce the expected sentence. Finally, the Legislature by a two-thirds vote may restore plea bargaining in all cases.\n\nFor similar reasons, we reject petitioners' assertion that a \"breakdown of the justice system\" will inevitably result from (1) giving crime victims an opportunity to appear in both felony and misdemeanor cases, and (2) imposing greater punishment on defendants whose multiple offenses are tried separately. Assuming arguendo that petitioners' characterization of the legal effect of Proposition 8 is correct in these respects, any supposed \"breakdown\" is wholly speculative. Unlike petitioners, we cannot presume that most crime victims will accept the opportunity (and accompanying embarrassment and inconvenience) of testifying at misdemeanor trials, or that most prosecutors will forego the obvious concrete advantages of consolidated trials in the hope of securing an aggravated term for \"habitual\" offenders.\n\nPetitioners next predict that Proposition 8's more severe sentencing provisions will increase California's prison population to an extent exceeding the state budget for prison expenditures. Again, the point is entirely conjectural; one might as readily argue that the measure will deter persons who otherwise might resort to crime, thereby reducing the prison population. Either contention involves pure guesswork and, in any event, we find no authority for the proposition that an initiative measure may be declared invalid solely by reason of the high financial cost of implementing it.\n\nFinally, petitioners assert that Proposition 8's creation of a \"right of safety\" for students and staff of public schools \"might very well herald the end of public education as we know it.\" Petitioners suggest that enforcement of the right of safety might entail substantial increased expenditures for school security guards, safety devices, and payments of tort damages and legal fees at the cost of books, equipment, and more\n\ntraditional operational and maintenance expenses. Yet the implementation of comparably broad constitutional rights, such as the right to pursue and obtain \"safety\" (Cal. Const., art. I, § 1) has not produced any such financial ruin. In any event, we need not speculate on these matters for, as we have indicated, the mere possibility that implementation of Proposition 8 might entail substantial additional public funding is not a proper ground for invalidating the measure.\n\nWe conclude that Proposition 8 does not on its face constitute an undue impairment of essential governmental functions under the Simpson rule.\n\nV. Constitutional Revision or Amendment\n\nPetitioner's final argument is that Proposition 8 is such a \"drastic and far-reaching\" measure as to constitute a \"revision\" of the state Constitution rather than a mere \"amendment\" thereof. Faced with an identical argument in Amador, we acknowledged, \"although the voters may accomplish an amendment by the initiative process, a constitutional revision may be adopted only after the convening of a constitutional convention and popular ratification or by legislative submission to the people.\" (22 Cal. 3d at p. 221; see Cal. Const., art. XVIII.)\n\nIn evaluating this contention, we employ a dual analysis, examining both the quantitative and qualitative effects of Proposition 8 upon our constitutional scheme. (Amador, 22 Cal. 3d at p. 223.)\n\nOn its face, the measure has a limited quantitative effect, repealing only one constitutional section (art. I, § 12, right to bail), and adding another (art. I, § 28, right to restitution, safe schools, truth-in-evidence, bail and use of prior convictions). We are satisfied that such a change is not \"so extensive . . . as to change directly the 'substantial entirety' of the Constitution by the deletion or alteration of numerous existing provisions . . . .\" (Ibid.; see Livermore v. Waite (1894) 102 Cal. 113, 118-119 [36 P. 424].)\n\nFrom a qualitative point of view, while Proposition 8 does accomplish substantial changes in our criminal justice system, even in combination these changes fall considerably short of constituting \"such far reaching changes in the nature of our basic governmental plan as to amount to a revision . . . .\" (Amador, 22 Cal. 3d at p. 223, italics added; see McFadden v. Jordan, supra, 32 Cal. 2d 330, 348.)\n\nIn urging that Proposition 8 effects a constitutional revision petitioners envision two significant consequences from the measure's limitation upon plea bargaining and its creation of a right to safe schools: (1) the inability of the judiciary to perform its constitutional duty to decide cases, particularly civil cases; and (2) the abridgement of the constitutional right to public education. As we have already indicated, however, petitioners' forecast of judicial and educational chaos is exaggerated and wholly conjectural, based primarily upon essentially unpredictable fiscal or budgetary constraints. In Amador, we discounted similar dire predictions that the adoption of article XIII A of the state Constitution (Prop. 13 on the June 1978 primary ballot) would result in a loss of \"home rule\" and the conversion of our governmental framework from \"republican\" to \"democratic\" in form. (22 Cal. 3d at p. 224.) We observed that \"nothing on the face of the article\" compels such results (p. 225), nor confirms that the article \"necessarily and inevitably\" will produce those feared results (p. 226).\n\nIt is further suggested that because of its reference to various sections of the Evidence Code and Penal Code, Proposition 8 thereby somehow delegates to the Legislature the power to make future constitutional amendments merely by amending the provisions of those statutes.\n\nNo such amendments have as yet taken place, of course, and the propriety or validity of any such amendment poses questions which are not presently before us. Moreover, no authority is cited for the proposition that the Constitution may not incorporate by reference the terms of an existing statute, or authorize the Legislature to define terms or modify rules upon which constitutional provisions are based. A random inspection of the Constitution readily reveals the fallacy of these arguments. There is ample contrary precedent. (As to the first proposition, see, e.g., art. IV, § 28, subd. (a); art. XIX, §§ 7, 9, and as to the second, see, e.g., art. II, § 3; art. XII, § 3; art. XIII, § 3 subd. (k).)\n\nFor the above reasons, nothing contained in Proposition 8 necessarily or inevitably will alter the basic governmental framework set forth in our Constitution. It follows that Proposition 8 did not accomplish a \"revision\" of the Constitution within the meaning of article XVIII.\n\nVI. Conclusion\n\nIn Associated Home Builders, etc., Inc. v. City of Livermore (1976) 18 Cal. 3d 582, 591 [135 Cal. Rptr. 41, 557 P.2d 473, 92 A.L.R.3d\n\n1038], Justice Tobriner, referring to the law creating the initiative and referendum procedures, said: \"Drafted in light of the theory that all power of government ultimately resides in the people, the amendment speaks of the initiative and referendum, not as a right granted the people, but as a power reserved by them. Declaring it 'the duty of the court to jealously guard this right of the people' [citation], the courts have described the initiative and referendum as articulating 'one of the most precious rights of our democratic process' [citation]. '[It] has long been our judicial policy to apply a liberal construction to this power wherever it is challenged in order that the right be not improperly annulled. If doubts can reasonably be resolved in favor of the use of this reserve power, courts will preserve it.' [Citations.]\" (Ibid., fns. omitted.)\n\nConsistent with our firmly established precedent, we have jealously guarded this precious right, giving the initiative's terms a liberal construction, and resolving reasonable doubts in favor of the people's exercise of their reserved power. We conclude that Proposition 8 survives each of the four constitutional challenges raised by petitioners.\n\nThe alternative writ previously issued is discharged and the peremptory writ is denied.\n\nAppendix\n\n[See Criminal Justice -- Initiative Statutes and Constitutional Amendment in Original]\n\nText of Proposed Law\n\nThis initiative measure is submitted to the people in accordance with the provisions of Article II, Section 8 of the Constitution.\n\nThis initiative measure expressly repeals and adds existing provisions of the Constitution, and adds provisions to the Penal Code and the Welfare and Institutions Code; therefore, provisions proposed to be deleted are printed in and new provisions proposed to be added are printed in italic type to indicate that they are new.\n\nPROPOSED LAW\n\nSEC. 1. This amendment shall be known as \"The Victims' Bill of Rights\".\n\nSEC. 2. Section 12 of Article I of the Constitution is repealed.\n\nSEC. 3. Section 28 is added to Article I of the Constitution, to read:\n\nSEC. 28. (a) The People of the State of California find and declare that the enactment of comprehensive provisions and laws ensuring a bill of rights for victims of crime, including safeguards in the criminal justice system to fully protect those rights, is a matter of grave statewide concern.\n\nThe rights of victims pervade the criminal justice system, encompassing not only the right to restitution from the wrongdoers for financial losses suffered as a result of criminal acts, but also the more basic expectation that persons who commit felonious acts causing injury to innocent victims will be appropriately detained in custody, tried by the courts, and sufficiently punished so that the public safety is protected and encouraged as a goal of highest importance.\n\nSuch public safety extends to public primary, elementary, junior high, and senior high school campuses, where students and staff have the right to be safe and secure in their persons.\n\nTo accomplish these goals, broad reforms in the procedural treatment of accused persons and the disposition and sentencing of convicted persons are necessary and proper as deterrents to criminal behavior and to serious disruption of people's lives.\n\n(b) Restitution. It is the unequivocal intention of the People of the State of California that all persons who suffer losses as a result of criminal activity shall have the right to restitution from the persons convicted of the crimes for losses they suffer.\n\nRestitution shall be ordered from the convicted persons in every case, regardless of the sentence or disposition imposed, in which a crime victim suffers a loss, unless compelling and extraordinary reasons exist to the contrary. The Legislature shall adopt provisions to implement this section during the calendar year following adoption of this section.\n\n(c) Right to Safe Schools. All students and staff of public primary, elementary, junior high and senior high schools have the inalienable right to attend campuses which are safe, secure and peaceful.\n\n(d) Right to Truth-in-Evidence. Except as provided by statute hereafter enacted by a two-thirds vote of the membership in each house of the Legislature, relevant evidence shall not be excluded in any criminal proceeding, including pretrial and post conviction motions and hearings, or in any trial or hearing of a juvenile for a criminal offense, whether heard in juvenile or adult court. Nothing in this section shall affect any existing statutory rule of evidence relating to privilege or hearsay, or Evidence Code, Sections 352, 782 or 1103. Nothing in this section shall affect any existing statutory or constitutional right of the press.\n\n(e) Public Safety Bail. A person may be released on bail by sufficient sureties, except for capital crimes when the facts are evident or the presumption great. Excessive bail may not be required. In setting, reducing or denying bail, the judge or magistrate shall take into consideration the protection of the public, the seriousness of the offense charged, the previous criminal record of the defendant, and the probability of his or her appearing at the trial or hearing of the case. Public safety shall be the primary consideration.\n\nA person may be released on his or her own recognizance in the court's discretion, subject to the same factors considered in setting bail. However, no person charged with the commission of any serious felony shall be released on his or her own recognizance.\n\nBefore any person arrested for a serious felony may be released on bail, a hearing may be held before the magistrate or judge, and the prosecuting attorney shall be given notice and reasonable opportunity to be heard on the matter.\n\nWhen a judge or magistrate grants or denies bail or release on a person's own recognizance, the reasons for that decision shall be stated in the record and included in the court's minutes.\n\n(f) Use of Prior Convictions. Any prior felony conviction of any person in any criminal proceeding, whether adult or juvenile, shall subsequently be used without limitation for purposes of impeachment or enhancement of sentence in any criminal proceeding. When a prior felony conviction is an element of any felony offense, it shall be proven to the trier of fact in open court.\n\n(g) As used in this article, the term \"serious felony\" is any crime defined in Penal Code, Section 1192.7 (c).\n\nSEC. 4. Diminished Capacity; Insanity. Section 25 is added to the Penal Code, to read:\n\n25. (a) The defense of diminished capacity is hereby abolished. In a criminal action, as well as any juvenile court proceeding, evidence concerning an accused person's intoxication, trauma, mental illness, disease, or defect shall not be admissible to show or negate capacity to form the particular purpose, intent, motive, malice afore-thought, knowledge, or other mental state required for the commission of the crime charged.\n\n(b) In any criminal proceeding, including any juvenile court proceeding, in which a plea of not guilty by reason of insanity is entered, this defense shall be found by the trier of fact only when the accused person proves by a preponderance of the evidence that he or she was incapable of knowing or understanding the nature and quality of his or her act and of distinguishing right from wrong at the time of the commission of the offense.\n\n(c) Notwithstanding the foregoing, evidence of diminished capacity or of a mental disorder may be considered by the court only at the time of sentencing or other disposition or commitment.\n\n(d) The provisions of this section shall not be amended by the Legislature except by statute passed in each house by rollcall vote entered in the journal, two-thirds of the membership concurring, or by a statute that becomes effective only when approved by the electors.\n\nSEC. 5. Habitual Criminals. Section 667 is added to the Penal Code, to read:\n\n667. (a) Any person convicted of a serious felony who previously has been convicted of a serious felony in this state or of any offense committed in another jurisdiction which includes all of the element of any serious felony, shall receive, in addition to the sentence imposed by the court for the present offense, a five-year enhancement for each such prior conviction on charges brought and tried separately. The terms of the present offense and each enhancement shall run consecutively.\n\n(b) This section shall not be applied when the punishment imposed under other provisions of law would result in a longer term of imprisonment. There is no requirement of prior incarceration or commitment for this section to apply.\n\n(c) The Legislature may increase the length of the enhancement of sentence provided in this section by a statue passed by majority vote of each house thereof.\n\n(d) As used in this section \"serious felony\" means a serious felony listed in subdivision (c) of Section 1192.7.\n\n(e) The provisions of this section shall not be amended by the Legislature except by statute passed in each house by rollcall vote entered in the journal, two-thirds of the membership concurring or by a statute that becomes effective only when approved by the electors.\n\nSEC. 6. Victim's Statements; Public Safety Determination.\n\n(a) Section 1191.1 is added to the Penal Code, to read:\n\n1191.1 The victim of any crime, or the next of kin of the victim if the victim has died, has the right to attend all sentencing proceedings under this chapter and shall be given adequate notice by the probation officer of all sentencing proceedings concerning the person who committed the crime.\n\nThe victim or next of kin has the right to appear, personally or by counsel, at the sentencing proceeding and to reasonably express his or her views concerning the crime, the person responsible, and the need for restitution. The court in imposing sentence shall consider\n\nthe statements of victims and next of kin made pursuant to this section and shall state on the record its conclusion concerning whether the person would pose a threat to public safety if granted probation.\n\nThe provisions of this section shall not be amended by the Legislature except by statute passed in each house by rollcall vote entered in the journal, two-thirds of the membership concurring, or by a statute that becomes effective only when approved by the electors.\n\n(b) Section 3043 is added to the Penal Code, to read:\n\n3043. Upon request, notice of any hearing to review or consider the parole eligibility or the setting of a parole date for any prisoner in a state prison shall be sent by the Board of Prison Terms at least 30 days before the hearing to any victim of a crime committed by the prisoner, or to next of kin of the victim if the victim has died. The requesting party shall keep the board apprised of his or her current mailing address.\n\nThe victim or next of kin has the right to appear, personally or by counsel, at the hearing and to adequately and reasonably express his or her views concerning the crime and the person responsible. The board, in deciding whether to release the person on parole, shall consider the statements of victims and next of kin made pursuant to this section and shall include in its report a statement of whether the person would pose a threat to public safety if released on parole.\n\nThe provisions of this section shall not be amended by the Legislature except by statute passed in each house by rollcall vote entered in the journal, two-thirds of the membership concurring, or by a statute that becomes effective only when approved by the electors.\n\n(c) Section 1767 is added to the Welfare and Institutions Code, to read:\n\n1767 Upon request, written notice of any hearing to consider the release on parole of any person under the control of the Youth Authority for the commission of a crime or committed to the authority as a person described in Section 602 shall be sent by the Youthful Offender Parole Board at least 30 days before the hearing to any victim of a crime committed by the person, or to the next of kin of the victim if the victim has died. The requesting party shall keep the board apprised of his or her current mailing address.\n\nThe victim or next of kin has the right to appear, personally, or by counsel, at the hearing and to adequately and reasonably express his or her views concerning the crime and the person responsible. The board, in deciding whether to release the person on parole, shall consider the statements of victims and next of kin made pursuant to this section and shall include in its report a statement of whether the person would pose a threat to public safety if released on parole. The provisions of this section shall not be amended by the Legislature except by statute passed in each house by rollcall vote entered in the journal, two-thirds of the membership concurring, or by a statute that becomes effective only when approved by the electors.\n\nSEC. 7. Limitation of Plea Bargaining. Section 1192.7 is added to the Penal Code, to read:\n\n1192.7 (a) Plea bargaining in any case in which the indictment or information charges any serious felony or any offense of driving while under the influence of alcohol, drugs, narcotics, or any other intoxicating substance, or any combination thereof, is prohibited, unless there is insufficient evidence to prove the people's case, or testimony of a material witness cannot be obtained, or a reduction or dismissal would not result in a substantial change in sentence.\n\n(b) As used in this section \"plea bargaining\" means any bargaining, negotiation, or discussion between a criminal defendant, or his or her counsel, and a prosecuting attorney or judge, whereby the defendant agrees to plead guilty or nolo contendere, in exchange for any promises, commitments, concessions, assurances, or consideration by the prosecuting attorney or judge relating to any charge against the defendant or to the sentencing of the defendant.\n\n(c) As used in this section \"serious felony\" means any of the following:\n\n(1) Murder or voluntary manslaughter; (2) mayhem; (3) rape; (4) sodomy by force, violence, duress, menace, or threat of great bodily harm; (5) oral copulation by force, violence, duress, menance, or threat of great bodily harm; (6) lewd acts on a child under the age of 14 years; (7) any felony punishable by death or imprisonment in the state prison for life; (8) any other felony in which the defendant inflicts great bodily injury on any person, other than an accomplice, or any felony i which the defendant uses a firearm; (9) attempted murder; (10) assault with intent to commit rape or robbery; (11) assault with a deadly weapon or instrument on a peace officer; (12) assault by a life prisoner on a noninmate; (13) assault with a deadly weapon by an inmate; (14) arson; (15) exploding a destructive device or any explosive with intent to injure; (16) exploding a destructive device or any explosive causing great bodily injury; (17) exploding a destructive device or any explosive with intent to murder; (18) burglary of a residence; (19) robbery; (20) kidnapping; (21) taking of a hostage by an inmate of a state prison; (22) attempt to commit a felony punishable by death or imprisonment in the state prison for life; (23) any felony in which the defendant personally used a dangerous or deadly weapon; (24) selling, furnishing, administering or providing heroin, cocaine, or phencyclidine (PCP) to a minor, (25) any attempt to commit a crime listed in this subdivision other than an assault.\n\n(d) The provisions of this section shall not be amended by the Legislature except by statute passed in each house by rollcall vote entered in the journal, two-thirds of the membership concurring, or by a statute that becomes effective only when approved by the electors.\n\nSEC. 8. Sentencing. Section 1732.5 is added to the Welfare and Institutions Code, to read:\n\n1732.5 Notwithstanding any other provision of law, no person convicted of murder, rape or any other serious felony, as defined in Section 1192.7 of the Penal Code, committed when he or she was 18 years of age or older shall be committed to Youth Authority.\n\nThe provisions of this section shall not be amended by the Legislature except by statute passed in each house by rollcall vote entered in the journal, two-thirds of the membership concurring, or by a statute that becomes effective only when approved by the electors.\n\nSEC. 9. Mentally Disordered Sex Offenders. Section 6331 is added to the Welfare and Institutions Code, to read:\n\n6331. This article shall become inoperative the day after the election at which the electors adopt this section, except that the article shall continue to apply in all respects to those already committed under its provisions.\n\nThe provisions of this section shall not be amended by the Legislature except by statute passed in each house by rollcall vote entered in the journal, two-thirds of the membership concurring, or by a statute that becomes effective only when approved by the electors.\n\nSEC. 10. If any section, party, clause, or phrase of this measure or the application thereof to any person or circumstances is held invalid, such invalidity shall not affect other provisions or applications of the measure which can be given effect without the invalid provision or application, and to this end the provisions of this measure are severable.\n\nCriminal Justice -- Initiative Statutes and Constitutional Amendment\n\nOfficial Title and Summary Prepared by the Attorney General\n\nCRIMINAL JUSTICE. INITIATIVE STATUTES AND CONSTITUTIONAL AMENDMENT. Amends Constitution and endacts several statutes concerning procedural treatment, sentencing, release, and other matters for accused and convicted persons. Includes provisions regarding restitution to victims from persons convicted of crimes, right to safe schools, exclusion of relevant evidence, bail, use of prior felony convictions for impeachment purposes or sentence enhancement, abolishing defense of diminished capacity, use of evidence regarding mental disorder, proof of insanity, notification and appearance of victims at sentencing and parole hearings, restricting plea bargaining, Youth Authority commitments, and other matters. Summary of Legislative Analyst's estimate of net state and local government fiscal impact: As the fiscal effect would depend on many factors that cannot be predicted, the net fiscal effect of this measure cannot be determined with any degree of certainty. However, approval of the measure would result in major state and local costs. The measure could: increase local administration costs; increase state administrative costs; increase claims against the state and local governments relating to enforcement of the right to safe schools; increase school security costs to provide safe schools; increase cost of operating county jails by increasing jail populations; increase court costs; and increase the cost of operating the state's prison system by increasing the prison population (estimated to be about $47 million increased annaul prison operating costs and $280 million prison construction costs based on various assumptions).\n\nAnalysis by the Legislative Analyst\n\nBackground:\n\nThe California criminal justice system is governed by the State Constitution, by statutes enacted by the Legislature and the people, and by court rulings.\n\nUnder the criminal justice system, persons convicted of misdemeanors may be fined or sentenced to a county jail term, or both. Those convicted of felonies may be fined in some cases, sentenced to state prison, or (if they were under 21 years of age at the time they were apprehended) committed to the Youth Authority, or both fined and imprisoned. For some crimes, a person may receive \"probation\" in lieu of a prison sentence or a fine.\n\nProposal:\n\nThis initiative proposes many changes in the State Constitution and statutory law that would alter criminal justice procedures and punishments and constitutional rights. The major changes are summarized below.\n\nRestitution. Under existing law, victims of crime are not automatically entitled to receive \"restitution\" from the person convicted of the crime. (Restitution would involve, for example, replacement of stolen or damaged property, or reimbursement for costs that the victim incurred as a result of the crime.) In some cases, however, the courts release a convicted person on probation, on the condition that restitution be provided to the victim or victims.\n\nThis measure would grant crime victims who suffer losses a constitutional right to receive restitution. Except in unusual cases, convicted persons would be required to make restitution to all of their victims who suffer losses. The extent to which restitution would be made would depend on how many convicted persons have or acquire sufficient assets to make restitution.\n\nThe Legislature would be responsible for adopting laws to implement this section of the measure.\n\nSafe Schools. The Constitution currently provides that all people have the alienable right of \"pursuing and obtaining safety, happiness, and privacy.\" In addition, statutory law prohibits various acts upon school ground which disturb the peace of students or staff, or which discrupt the peaceful conduct of school activities. This measure would add a section to the State Constitution declaring that students and staff of public elementary and secondary schools have the \"inalienable right to attend campuses which are safe, secure, and peaceful.\"\n\nEvidence. Under current law, certain evidence is not permitted to be presented in a criminal trial or hearing. For example, evidence obtained through unlawful eavesdropping or wiretapping, or through unlawful searches of persons or property, cannot be used in court. This measure generally would allow most relevant evidence to be presented in criminal cases, subject to such exceptions as the Legislature may in the future enact by a two-thirds vote. The measure could not affect federal restrictions on the use of evidence.\n\nBail. Under the State Constitution and statutory law, the courts generally must release on bail all persons accused of committing a crime, while they await trial. The courts may deny bail only for those who are accused of felonies punishable by death if the court determines that the proof of guilt is evident or the presumption of guilt is great.\n\nIn fixing the amount of bail, courts are required by statute to consider the seriousness of the offense with which the person is charged, the defendant's previous criminal record and the probability that the defendant will appear at the trial or hearings of the case. The State Constitution prohibits courts from setting \"excessive\" bail.\n\nThe courts also may allow those accused of committing\n\na crime to be released without bail upon their written promise to appear in court when required. The failure to appear in court as promised can result in additional criminal charges being filed against the accused.\n\nCourt decisions have held that the purpose of bail is to assure that the defendant will appear in court to stand trial, rather than to protect the public's safety.\n\nThis measure would amend the State Constitution to give the courts discretion in deciding whether to grant bail. It would, however, continue the prohibition on bail in felony cases punishable by death when the proof of guilt is evident or the presumption of guilt is great.\n\nIn addition, the measure would add to the State Constitution a provision requiring the court -- in fixing, reducing, or denying bail or permitting release without bail -- to consider the same factors that they now are required by statute to consider in fixing the amount of bail. It would also make protection of the public's safety the primary consideration in bail determinations. Moreover, the measure would prohibit the courts from releasing without bail persons charged with certain felonies.\n\nFinally, the measure would require the court to state for the record its reasons for deciding to (a) grant or deny bail or (b) release an accused person without bail.\n\nPrior Convictions. The measure would amend the State Constitution to require that information about prior felony convictions be used without limitation to discredit the testimony of a witness, including that of a defendant. Under current law, such information may be used only under limited circumstances.\n\nLonger Prison Terms. Under existing law, a prison sentence can be increased from what it otherwise would be by from one to ten years, depending on the crime, if the convicted person has served prior prison terms, and a life sentence can be given to certain repeat offenders. Convictions resulting in probation or commitment to the Youth Authority generally are not considered for the purpose of increasing sentences, and there are certain limitations on the overall length of sentences.\n\nThis measure includes two provisions that would increase prison sentences for persons convicted of specified felonies. First, upon a second or subsequent conviction for one of these felonies, the defendant could receive, on top of his or her sentence, an additional five-year prison term for each such prior conviction, regardless of the sentence imposed for the prior conviction. This provision would not apply in cases where other provisions of law would result in even longer prison terms. Second, any prior felony conviction could be used without limitation in calculating longer prison terms.\n\nDefenses of Diminished Capacity and Insansity. The measure would prohibit the use of evidence concerning a defendant's intoxication, trauma, mental illness, disease, or defect for the purpose of proving or contesting whether a defendant had a certain state of mind in connection with the commission of a crime. Legislation enacted in 1981 significantly limited use of this type of evidence.\n\nThis measure would provide that in order to be found not guilty by reason of insanity a defendant must prove that he or she (1) was incapable of knowing or understanding the nature and quality of his or her actions and (2) was incapable of distinquishing right from wrong at the time of the crime. The provisions could increase the difficulty of proving that a person is not guilty by reason of insanity.\n\nIf this measure is approved, evidence of diminished mental capacity or a mental disorder could be considered at the time of sentencing.\n\nVictim Statements. Under existing law, statements of victims or next of kin are requested for various reports which are submitted to the court. In many cases, parole boards are not required to notify victims or next of kin about hearings.\n\nThis measure would require that the victims of any crimes, or the next of kin of the victims if the victims have died, be notified of (1) the sentencing hearing and (2) any parole hearing (if they so request) involving persons sentenced to state prison or the Youth Authority. During the hearings, the victim, next of kin, or his or her attorney would have the right to make statements to the court or hearing board. In addition, this measure would require the court or hearing board to state whether the convicted person would pose a threat to public safety if he or she were released on probation or parole.\n\nPlea Bargaining. The measure would place restrictions on plea bargaining in cases involving specified felonies and offenses of driving while under the influence of an intoxicating substance. \"Plea bargaining\" is a term used to describe situations in which the defendant agrees to plead guilty in exchange for a reduced charge or sentence.\n\nExclusion of Certain Persons from Sentencing to the Youth Authority. Under current law, persons who commit certain sex crimes at the age of 18 year or older and some other youthful offenders are not sent to the Youth Authority. This measure would prohibit sending to the Youth Authority persons who were 18 years of\n\nage or older at the time they committed murder, rape, or other specified felonies. As a result, they would be sentenced to state prison or local jails, or receive probation.\n\nMentally Disordered Sex Offenders. This measure contains a provision which would have changed the law concerning the treatment of certain sex offenders. However, legislation enacted in 1981 achieved the same purpose. Consequently, this provison has no effect.\n\nFiscal Effect:\n\nThe net fiscal effect of this measure cannot be determined with any degree of certainty. This is because the fiscal effect would depend on many factors that cannot be predicted. Specifically, it would depend on:\n\n* how various provisions are implemented by the Legislature, local governments, and school districts,\n\n* how rights established by the measure are enforced by the courts,\n\n* how many persons are incarcerated in state prison or detained in county jails for longer periods of time,\n\n* how the various provisions affect criminal behavior (that is, to what extent the measure has a deterrent effect), and\n\n* how the criminal justice system reacts to the measure.\n\nWe conclude, however, that approval of the measure would result in major state and local costs. This is because the measure, taken as a whole, could:\n\n* increase local administration costs (for example, there would be a cost to implement the restitution procedures and to notify victims of sentencing hearings),\n\n* increase state administrative costs (for example, there would be a cost to notify victims of parole hearings),\n\n* increase claims against the state and local governments relating to enforcement of the right to safe schools,\n\n* increase school security costs to provide safe schools,\n\n* increase the cost of operating county jails by increasing the jail populations (for example, more persons accused of crimes could be denied bail in order to assure public safety and more persons could be detained in jail while awaiting trial due to the elimination of plea bargaining),\n\n* increase court costs (for example, costs could increase due to more extensive bail hearings and the elimination of plea bargaining), and\n\n* increase the cost of operating the state's prison system by increasing the prison population (for example, by increasing terms for certain repeat offenders). Based on various assumptions, the Department of Corrections estimates that the provisions that would result in longer prison terms for repeat offenders would lengthen the terms of at least 1,200 persons each year. The department states that this estimate may be low for several reasons. In addition, the measure's impact on conviction and sentencing trends and patterns cannot be predicted. As a result of these uncertainties, we cannot estimate how many persons would serve longer prison term if this measure is approved. If, however, 1,200 persons per year were to receive the new sentences instead of the sentences provided under current law, annual state prison operating costs would increase by about $47 million (in 1982-83 prices) to construct facilities to house these additional prisoners. The construction cost estimate assumes that existing standards for prisons would be followed when the new facilities were constructed, and that the custody levels (for example, maximum security) required for the additional inmates would match current housing patterns. To the extent that some of the additional prisoners could be housed by crowding existing facilities, both the estimated operating and construction costs could be reduced.\n\nArguments in Favor of Proposition 8\n\nIt is time for the people to take decisive action against violent crime. For too long our courts and the professional politicians in Sacramento have demonstrated more concern with the rights of criminals than with the rights of innocent victims. This trend must be reversed. By voting \"yes\" on the Victims' Bill of Rights you will restore balance to the rules governing the use of evidence against criminals, you will limit the ability of violent criminals to hide behind the insanity defense, and you will give us a tool to stop extremely dangerous offenders from being released on bail to commit more violent crimes. Your action is as vital and necessary today as it was in 1978 when I urged Californians to take property taxes into their own hands and pass Proposition 13. If you believe as I do that the first responsibility of our criminal justice system is to protect the innocent, then I urge you to vote \"yes\" on Proposition 8.\n\nMIKE CURB, Lieutenant Governor\n\nCrime has increased to an absolutely intolerable level.\n\nWhile criminals murder, rape, rob and steal, victims must install new locks, bolts, bars and alarm systems in their homes and businesses. Many buy tear gas and guns for self-protection. FREE PEOPLE SHOULD NOT HAVE TO LIVE IN FEAR.\n\nYet, higher courts of this state have created additional rights for the criminally accused and placed more restrictions on law enforcement officers. This proposition will overcome some of the adverse decisions by our higher courts.\n\nTHIS MEASURE CREATES RIGHTS FOR THE VICTIMS OF VIOLENT CRIMES. It enacts new laws that those of us in law enforcement have sought from the Legislature without success.\n\nWhile there are more people going to state prison than there were three year ago, only 5.5 percent of those persons arrested for felonies are sent to state prison. Of those convicted of felonies, one-third go to state prison and the remaining two-thirds are back in the community in a relatively short period of time.\n\nTHERE IS ABSOLUTELY NO QUESTION THAT THE PASSAGE OF THIS PROPOSITION WILL RESULT IN MORE CRIMINAL CONVICTIONS, MORE CRIMINALS BEING SENTENCED TO STATE PRISON, AND MORE PROTECTION FOR THE LAW-ABIDING CITIZENRY.\n\nIF YOU FAVOR INCREASED PUBLIC SAFETY, VOTE YES ON PROPOSITION 8.\n\nGEORGE DEUKMEJIAN, Attorney General\n\nWhy is it that the Legislature doesn't start getting serious about a problem until we, the people, go out and qualify an initiative?\n\nFour years ago it was Proposition 13, which I coauthored, to cut skyrocketing property taxes.\n\nA year later we had to go to the initiative process to place a lid on government spending. That effort, the Gann Spending Limitation Initiative, was carried with a landslide 75 percent of the vote.\n\nToday it is the forgotten victims of violent crimes that the Legislature has so callously ignored. Again, it is up to the prople to bring about reasonable and meaningful reform.\n\nYour \"YES\" vote on Proposition 8 will restore victims' rights and help bring violent crime under control.\n\nPAUL GANN, Proponent, Victims' Bill of Rights\n\nRebuttal to Argument in Favor of Proposition 8\n\nWHY DON'T THE POLITICIANS SUPPORTING PROPOSITION 8 TELL YOU WHAT IT REALLY DOES? Look closely at their arguments. They are simply political slogans and anticrime propaganda.\n\nEvery responsible citizen opposes crime, but we should also be very HESITANT to make RADICAL changes in our Constitution.\n\nYet Proposition 8 does just that . . . it needlessly reduces your personal liberties . . . and clearly harms true efforts to fight crime.\n\nCONSIDER THESE EFFECTS OF PROPOSITION 8:\n\nTakes away everyone's right to bail. (Compare Proposition 4, which targets only violent felons).\n\nAllows strip searches of minor traffic offenders.\n\nCondones the use of wiretapping and seizure of your telephone and credit records without a warrant.\n\nPermits spying on you in a public restroom.\n\nEither Proposition 8 takes away your rights, or it is unconstitutional . . . in which case valid criminal convictions will be thrown out.\n\nThe other reason they say nothing specific is that MUCH OF PROPOSITION 8 IS ALREADY LAW. These laws:\n\nSend mentally disordered sex offenders to prison.\n\nEliminate the diminished capacity defense.\n\nProvide life sentences for habitual criminals.\n\nGuarantee victim input.\n\nPlace controls on plea bargaining.\n\nRestrict bail for violent felons (Proposition 4).\n\nProposition 8 will undermine these new laws by imposing its confusing language on top of clear, well-thought-out reforms.\n\nProposition 8 is the kind of abuse of the initiative process by political candidates which should be condemned. If you care about your privacy . . . and especially if you care about effective, responsible law enforcement . . . VOTE NO ON PROPOSITION 8.\n\nRICHARD L. GILBERT; District Attorney, Yolo County\n\nSTANLEY M. RODEN; District Attorney, Santa Barbara County\n\nTERRY GOGGIN; Member of the Assembly, 66th District Chairman, Committee on Criminal Justice\n\nArgument Against Proposition 8\n\nYou're afraid of crime -- and you have the right to be.\n\nIf Proposition 8 would end crime, we would be the first to urge you to vote for it.\n\nBut Proposition 8 is a hoax . . . there is no other way to describe it.\n\nSome ambitious politicians may think this ill-conceived measure helps them. It will certainly help keep an army of appellate lawyers fully employed.\n\nBut it will not reduce crime, help victims, or get dangerous criminals off the streets.\n\nAs professionals, charged with the responsibility of controlling crime and prosecuting criminals . . . we ask YOU to PLEASE VOTE NO on PROPOSITION 8.\n\nProposition 8 is so badly written mangles nearly every aspect of the criminal justice system it touches.\n\nREAD the PROBLEMS it will cause:\n\nUNCONSTITUTIONAL INITIATIVE TAKES CONVICTED KILLERS OFF DEATH ROW\n\nEven some of Proposition 8's supporters agree it may be unconstitutional. But unconstitutional laws cause sentences to be overturned. Thirty convicted killers were recently taken off death row because of one unconstitutional line in the 1978 Death Penalty Initiative.\n\nCONVICTING PEOPLE LIKE THE \"FREEWAY KILLER\" NEARLY IMPOSSIBLE\n\nProposition 8 seeks to stop plea bargaining. Its wording, however, would take away law enforcement's ability to negotiate with criminals to get them to testify against each other . . . This is how the \"Freeway Killer\" was convicted. It is how law enforcement fights organized crime and gang violence.\n\nFREES DEFENSE LAWYERS TO SMEAR POLICE WHO TESTIFY IN COURT\n\nUnder current law, a defense lawyer cannot attack the character of a police witness. If Proposition 8 passes he could.\n\nREQUIRES MILLIONS OF DOLLARS IN NEW COURT PROCEDURES -- BUT NO MONEY TO PAY FOR THEM\n\nLook at the cost of Proposition 8 at the top of this measure.\n\nWhy is it so expensive?\n\nA major share is for extra court hearings and elaborate new red tape in every criminal case -- most of which are misdemeanors. This will require more courts, judges, clerks, and probation officers.\n\nProposition 8 does not provide one cent to pay for these things.\n\nCOURTS IN CHARGE OF PUBLIC SCHOOLS\n\nNobody knows what the so-called \"safe schools\" section means. The likely result of this provision is constant court battles over compliance. This will no doubt lead to judges running some of our schools. It also could give children the constitutional right to refuse to attend school.\n\nVICTIM RESTITUTION -- A MEANINGLESS PROMISE\n\nWhat good is a right to restitution when so many victims are harmed by criminals who can't pay? (Ever been hit by an uninsured motorist?) Besides, victims already have the right to collect from criminals who can pay.\n\nPROPOSITION 8 -- A POLITICAL PLOY\n\nAs professionals, we know our criminal justice system needs carefully written, tough, constitutional laws and procedures.\n\nProposition 8 is none of these. It makes it harder to convict criminals, will lead to endless appeals, and will create chaos in the legal system.\n\nIt may be good politics, but it is bad law.\n\nPLEASE, VOTE NO ON PROPOSITION 8.\n\nRICHARD L. GILBERT; District Attorney, Yolo County\n\nSTANLEY M. RODEN; District Attorney, Santa Barbara County\n\nTERRY GOGGIN; Member of the Assembly, 66th District Chairman, Committee on Criminal Justice\n\nRebuttal to Argument Against Proposition 8\n\nLAW ENFORCEMENT SUPPORTS PROPOSITION 8\n\nProposition 8 has been endorsed by more than 250 police chiefs, sheriffs and district attorneys. It has the support of more than 30,000 rank-and-file police officers.\n\nSenior Assistant Attorney General George Nicholson, a chief architect of the Victims' Bill of Rights and a former murder prosecutor, has called Proposition 8 \"the most effective anticrime program ever proposed to help the forgotten victims of crime.\"\n\nANTICRIME LEGISLATIVE LEADERS SUPPORT PROPOSITION 8\n\nProposition 8 coauthor Assemblywoman Carol Hallett says, \"A generation of victims have been ignored by our Legislature, thanks to the Assembly Criminal Justice Committee. Proposition 8 takes the handcuffs off the police and puts them on the criminals, where they belong.\"\n\nTHE PEOPLE SUPPORT PROPOSITION 8\n\nThroughout California, hundreds of thousands of your fellow citizens carried and signed petitions to place this vital initiative on the ballot. Many of these people have lost family members or are themselves victims of crime.\n\nBut they are not only victims of crime, they are victims of our criminal justice system -- the liberal reformers, lenient judges and behavior modification do-gooders who release hardened criminals again and again to victimize the innocent.\n\nIt's time to restore justice to the system.\n\nVOTE YES FOR VICTIM'S RIGHTS.\n\nVOTE YES ON PROPOSITION 8\n\nPAUL GANN; Proponent, Victims' Bill of Rights\n\nDisposition\n\nThe alternative writ previously issued is discharged and the peremptory writ is denied.\n\nBIRD, C.J. I respectfully dissent. Today, a bare majority of this court obliterates one section of the state Constitution by effectively repealing the single-subject rule. It then proceeds to wink at other violations of the Constitution, thereby setting dangerous precedents and giving future draftsmen of initiative measures the message that they may proceed unrestrained by the Constitution.\n\nI.\n\nPetitioners challenge the validity of Proposition 8, the \"Victims' Bill of Rights\" initiative, submitted to the voters on June 8, 1982. This court must decide whether the draftsmen of the initiative (1) violated the Constitution's single-subject rule (Cal. Const., art II, § 8, subd. (d)); (2) failed to disclose on the face of the initiative the full purpose and effect of its provisions in violation of article IV, section 9; or (3) illegally revised the Constitution (see art. XVIII, §§ 1-3).\n\nAfter this court declined to consider the constitutional validity of Proposition 8 before the primary election, the Secretary of State placed the measure on the June ballot. (See Brosnahan v. Eu (1982) 31 Cal. 3d 1, 4 [181 Cal. Rptr. 100, 641 P.2d 200].) The initiative was approved by 56 percent of the voters.\n\nThe day after the primary election, three taxpayers filed a petition for writ of mandate and/or prohibition in the Court of Appeal, challenging the constitutionality of Proposition 8. On June 14th, the Attorney General petitioned this court to transfer the cause from the Court of Appeal. His petition was granted, the cause was transferred, and an alternative writ of prohibition was issued. Directly thereafter, the case was set for oral argument.\n\nThe issues presented are of great public importance, and the parties have properly invoked the exercise of this court's original jurisdiction. (See Amador Valley Joint Union High Sch. Dist. v. State Bd. of Equalization (1978) 22 Cal. 3d 208, 219 [149 Cal. Rptr. 239, 583 P.2d 1281] [hereafter Amador Valley ].)\n\nThis court must decide whether the \"multifarious\" provisions of Proposition 8 violate the people's mandate as set forth in the California Constitution that no initiative may contain more than a single subject.\n\nThe initiative contains a plethora of provisions.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e The first section labels the proposal the \"Victims' Bill of Rights.\" The next two amend the California Constitution, the first by repealing section 12 of article I,\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e and the second by adding a new section 28 to article I.\n\nThe new section 28 provides that (1) \"all persons who suffer losses\" as a result of crime have the right to restitution from those convicted of the crimes (subd. (b)); (2) students and staff of public schools have \"the inalienable right\" to attend \"safe, secure and peaceful\" campuses (subd. (c)); (3) with certain exceptions, \"relevant evidence shall not be excluded in any criminal proceeding\" (subd. (d)); (4) the constitutional right to bail is curtailed (subd. (e)); and (5) all prior felony convictions,\n\n\"whether adult or juvenile,\" shall be used for impeachment or sentence enhancement in subsequent criminal proceedings (subd. (f)).\n\nThe next six sections of the initiative add five new statutes to the Penal Code and three to the Welfare and Institutions Code.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e These sections purport to (1) prohibit the introduction of evidence concerning the lack of capacity to form the requisite mental state in a criminal trial (§ 4); (2) redefine the defense of not guilty by reason of insanity (ibid.); (3) provide a five-year sentence enhancement for each separate prior conviction of a \"serious felony\" (§ 5); (4) permit victims of crime, or next of kin of deceased victims, to attend sentencing and parole hearings in order to state their views, and require the court or parole board to consider such statements (§ 6); (5) require the court or the parole board to consider public safety before granting probation or parole (ibid.); (6) strictly limit plea bargaining in any case where an information or indictment charges a \"serious felony\" or certain other crimes (§ 7); (7) prevent the commitment to the Youth Authority of anyone convicted of a \"serious felony\" committed when the person was 18 years of age or older (§ 8); and (8) repeal those provisions of the Welfare and Institutions Code governing mentally disordered sex offenders (§ 9).\n\nArticle II, section 8, subdivision (d) of the California Constitution mandates that \"An initiative measure embracing more than one subject may not be submitted to the electors or have any effect.\"\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e This single-subject limitation on initiative measures was adopted by a 2-1 margin at the 1948 general election.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nA similar limitation on the Legislature, requiring that statutes embrace but a single subject, has been a feature of our state Constitution since 1849. (See current art. IV, § 9.)\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e California is not unique in that\n\nregard, for similar provisions are found in the constitutions of most states. (See Ruud, \" No Law Shall Embrace More Than One Subject \" (1958) 42 Minn.L.Rev. 389, 389.)\n\nIn California, the legislative single-subject rule has long been interpreted as requiring that all the provisions of a legislative enactment be \"interdependent\" and \"'reasonably germane' to each other.\" (See, e.g., Amador Valley, supra, 22 Cal. 3d at p. 230; Evans v. Superior Court (1932) 215 Cal. 58, 62 [8 P.2d 467], and cases cited; Ex parte Liddell (1892) 93 Cal. 633, 637-638 [29 P. 251].) \"Provisions governing projects so related and interdependent as to constitute a single scheme may be properly included within a single act. . . . A provision which . . . is auxiliary to and promotive of [the act's] main purpose, or has a necessary and natural connection with such purpose is germane within the rule.\" (Evans, supra, 215 Cal. at pp. 62-63, italics added.)\n\nThis standard has frequently been applied to legislative enactments. (See, e.g., Metropolitan Water Dist. v. Marquardt (1963) 59 Cal. 2d 159, 172-173 [28 Cal. Rptr. 724, 379 P.2d 28]; Barber v. Galloway (1924) 195 Cal. 1, 12-13 [231 P. 34]; see also Tarpey v. McClure (1923) 190 Cal. 593, 597 [213 P. 983] [examining whether the provisions of an act were \"legitimately and intimately connected one with another\"]; Robinson v. Kerrigan (1907) 151 Cal. 40, 51 [90 P. 129] [considering whether provisions were \"necessary to make [an act] effective and symmetrical\" or \"reasonably necessary as means for attaining the object of the act\"]; Ex parte Liddell, supra, 93 Cal. at pp. 637-638.)\n\nThe important concerns underlying the legislative single-subject limitation were noted by this court in 1881. \"'The practice . . . of comprising in one bill subjects of a diverse and antagonistic nature, in order to combine in its support members who were in favor of particular measures, but neither of which could command the requisite majority on its own merits, was found to be not [only] a corruptive influence in the Legislature itself, but destructive of the best interests of the State.'\" (People v. Parks (1881) 58 Cal. 624, 640.)\n\nThe initiative and referendum provisions of our state Constitution were adopted in 1911. At that time, no specific provision of the Constitution limited initiatives to a single subject. However, the policies underlying the legislative single-subject requirement apply with equal, if not greater, force to initiative measures.\n\nLegislative enactments usually are adopted only after a lengthy process of public hearings, numerous readings and votes by each house of the Legislature. In addition, the Governor has the opportunity to review each enactment. (See Note, The California Initiative Process: A Suggestion for Reform (1975) 48 So.Cal.L.Rev. 922, 931-932 [hereafter, The California Initiative Process ].)\n\nBy contrast, initiatives are drafted only by their proponents, so there is usually no independent review by anyone else. There are no public hearings. The draftsmen so monopolize the process that they completely control who is given the opportunity to comment on or criticize the proposal before it appears on the ballot.\n\nThis private process can and does have some detrimental consequences. The voters have no opportunity to propose amendments or revisions. (Compare art. XVIII, § 1 [legislatively proposed constitutional amendment or revision may be amended even after the initial approval by the Legislature if the people have not yet voted on the proposal].) \"[The] only expression left to all other interested parties who are not proponents is the 'yes' or 'no' vote they cast.\" (The California Initiative Process, supra, 48 So.Cal.L.Rev. at p. 933; Taschner v. City Council (1973) 31 Cal. App. 3d 48, 64 [107 Cal. Rptr. 214].)\n\nSince the only people who have input into the drafting of the measure are its proponents, there is no opportunity for compromise or negotiation. \"The result of this inflexibility is that more often than not a proposed initiative represents the most extreme form of law which is considered politically expedient.\" (Schmitz v. Younger (1978) 21 Cal. 3d 90, 99 [145 Cal. Rptr. 517, 577 P.2d 652] (dis. opn. of Manuel, J.).)\n\nFinally, the initiative process renders it difficult for the individual voter to become fully informed about any particular proposal. \"Voters have neither the time nor the resources to mount an in depth investigation of a proposed initiative.\" (Ibid.; see also The California Initiative Process, supra, 48 So.Cal.L.Rev. at pp. 934-939.)\n\n\"'The majority of qualified electors are so much interested in managing their own affairs that they have no time carefully to consider measures affecting the general public. A great number of voters undoubtedly have a superficial knowledge of proposed laws to be voted upon, which is derived from newspaper comments or from conversation with their associates. . . . [The] assertion may safely be ventured that it is\n\nonly the few persons who earnestly favor or zealously oppose the passage of a proposed law, initiated by petition, who have attentively studied its contents and know how it will probably affect their private interests. The greater number of voters do not possess this information . . . .'\" (Wallace v. Zinman (1927) 200 Cal. 585, 592 [254 P. 946, 62 A.L.R. 1341].)\n\nAs a direct result of these concerns, the Legislature placed on the general election ballot in 1948 a constitutional amendment to provide that initiative measures be limited to one subject. The ballot pamphlet argument in support of this measure noted the dangers of voter confusion and lack of information inherent in the initiative process.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e That statement informed the voters that the adoption of a single-subject restriction in the Constitution would help ensure that the electorate would have an opportunity to fully analyze and evaluate an initiative measure. (Ballot Pamp., Gen. Elec. (Nov. 2, 1948) pp. 8-9.)\n\nThe ballot pamphlet statement further emphasized the risk that a multi-subject initiative might mislead the electorate as to the true import of the measure. This, in turn, would lead the voters to adopt an initiative because they favored some of its provisions, without realizing the effect of other, less-publicized sections.\n\n\"Today, any proposition may be submitted to the voters by initiative and it may contain any number of subjects. By this device a proposition may contain 20 good features, but have one bad one secreted among the 20 good ones. The busy voter does not have the time to devote to the study of long, wordy, propositions and must rely upon such sketchy information as may be received through the press, radio or picked up in general conversation. If improper emphasis is placed upon one feature and the remaining features ignored, or if there is a failure to study the entire proposed amendment, the voter may be misled as to the over-all effect of the proposed amendment. [ para. ] [ The single-subject rule ] entirely eliminates the possibility of such confusion inasmuch as it will limit each proposed amendment to one subject and one subject only.\" (Ballot Pamp., Gen. Elec. (Nov. 2, 1948) pp. 8-9, italics added.)\n\nThe single-subject amendment may have been spurred by the initiative measure analyzed in McFadden v. Jordan (1948) 32 Cal. 2d 330\n\n[196 P.2d 787]. (See Amador Valley, supra, 22 Cal. 3d at p. 229.) In McFadden, this court invalidated an initiative proposal on the ground that it represented a revision of the Constitution, not an amendment. (See post, part II.) The court stressed the dangers inherent in a proposal containing \"multifarious\" provisions. \"It does not give the people an opportunity to express approval or disapproval severally as to each major change suggested; rather does it, apparently, have the purpose of aggregating for the measure the favorable votes from electors of many suasions who, wanting strongly enough any one or more propositions offered, might grasp at that which they want, tacitly accepting the remainder. Minorities favoring each proposition severally might, thus aggregated, adopt all.\" (McFadden, supra, 32 Cal. 2d at p. 346.)\n\nThese statements reflect the separate dangers posed by an initiative which contains multiple subjects. First, there is a risk that voters will be unaware of the contents of an initiative's disparate provisions. Second, there is a danger that an initiative will pass not because a majority of the voters favor any or all of its provisions, but because minorities who advocate some of its parts will aggregate their votes, giving it a false majority. Finally, the combination of numerous subjects in one initiative deprives the voters of their right to vote independently on the merits of each separate proposal. Voters who favor some of a measure's provisions must choose to vote for all or none.\n\nThe single-subject rule, adopted by the electorate in 1948, addresses all of these problems. The requirement that an initiative embrace but one subject narrows the breadth of the issues which a voter must examine and evaluate. It enables the voter to obtain a clear idea of the contents of an initiative from a quick survey of its general provisions. In addition, a voter's freedom of choice is protected by preventing initiative sponsors from forcing the electorate to vote for undesired provisions in order to enact favored sections.\n\nThus, the draftsmen of an initiative measure are required to submit their proposal in a form which enables the voters to make intelligent, informed and discriminating choices. By adopting a constitutional amendment which minimizes the potential for deception, fraud, forced compromises and false majorities, the people of this state have indicated a clear desire to protect themselves from the dangers posed by multi-subject initiatives.\n\nThe single-subject rule does not limit the initiative power of the people, but rather it requires that drafters of initiative measures state their proposals in a way which permits intelligent and informed choices, free from deception and forced compromises. It serves, therefore, to preserve the integrity of the initiative process and not to limit the power of the people.\n\nShortly after the single-subject rule for initiatives was adopted, this court was called upon to interpret the requirement in Perry v. Jordan (1949) 34 Cal. 2d 87 [207 P.2d 47]. The initiative challenged in that case sought to repeal an article of the Constitution concerning aid to the aged and blind. The court found that the article attacked by the initiative constituted but one subject. That article covered the level of aid, eligibility requirements, and the machinery necessary to administer the aid program. The court held that these provisions were \"'so related and interdependent as to constitute a single scheme,'\" and, therefore, did not violate the single-subject rule. (Id., at pp. 92-93, quoting Evans v. Superior Court, supra, 215 Cal. at p. 62.)\n\nRecently, this court unanimously reaffirmed the standards set forth in Perry and Evans. The court held that compliance with the single-subject rule requires that an initiative's provisions be \" reasonably interrelated and interdependent, forming an interlocking 'package ' . . . .\" (Amador Valley, supra, 22 Cal. 3d at p. 231, italics added.)\n\nThe decision in Amador Valley emphasized the importance of the relationship among an initiative's separate features. In rejecting a single-subject attack on an initiative that added article XIII A to the Constitution, this court did not rely on the fact that the initiative's provisions fell within the general concept \"taxation.\" Rather, the court examined the interrelationship among the initiative's four provisions.\n\nThe first two provisions specifically limited property taxes. The third and fourth limited the method by which other state and local taxes could be altered. Petitioners in Amador Valley argued that the provisions regarding state and local taxation did not involve the same subject as those regarding property taxes. The court, however, concluded that the limits on nonproperty taxes were necessary to effectuate the property tax relief which was the central subject of the initiative. \"[Any] tax savings resulting from the operation of sections 1 and 2 could be withdrawn or depleted by additional or increased state or local levies of\n\nother than property taxes . . . .\" (Id., at p. 231.) Therefore, all four of the initiative's sections were necessary to the success of its scheme.\n\nIndeed, interdependence of that initiative's provisions was the precise basis on which this court carefully distinguished the decision of the Arizona Supreme Court in Kerby v. Luhrs (1934) 44 Ariz. 208 [36 P.2d 549, 94 A.L.R. 1502]. The Arizona case held that an initiative which proposed a new tax on copper production, a new method of evaluating public utility property, and a new state tax commission, violated the single-subject requirement of the Arizona Constitution.\n\nThis court observed that although the provisions at issue in the Arizona case all dealt with \"taxation,\" they were not \"interdependent\" or \"[interlocking].\" Any of the provisions in Kerby \"singly, could have been adopted 'without the slightest need of adopting' the others.\" (Amador Valley, supra, 22 Cal. 3d at p. 232.) By contrast, \"the four elements [of the initiative measure in Amador Valley ] not only pertain to the general subject of taxation, but also are reasonably interdependent and functionally related to each other. . . . Each of the four basic elements of [the initiative] was designed to interlock with the others to assure an effective tax relief program.\" (Ibid., italics added.)\n\nRespondents are incorrect when they argue that the requirement that an initiative's provisions be \"reasonably interrelated and interdependent\" was abandoned in Fair Political Practices Com. v. Superior Court (1979) 25 Cal. 3d 33, 37-43 [157 Cal. Rptr. 855, 599 P.2d 46]. The plurality opinion in that case does not support respondent's position. First, only three justices joined the lead opinion. Neither the analysis nor the language employed in that opinion constitutes binding precedent, since it did not represent a majority view of this court. (Del Mar Water, etc. Co. v. Eshleman (1914) 167 Cal. 666, 682 [140 P. 591].)\n\nIn addition, although the plurality opinion purported to rely on the \"reasonably germane\" standard, it curiously failed to apply this court's longstanding interpretation of that term as requiring interdependence of all the provisions of an initiative. (See Evans v. Superior Court, supra, 215 Cal. at pp. 62-63.) Respondents stretch both law and logic when they argue that three justices of this court overruled a long line of cases sub silentio.\n\nFinally, nothing in the result of Fair Political Practices Com. indicates that the \"interdependence\" test has been discarded. As former Justice Tobriner noted in his concurrence, the initiative at issue in that case satisfied even the stricter requirement that its provisions \"'must be functionally related in furtherance of a common underlying purpose.'\" (Fair Political Practices Com., supra, 25 Cal. 3d at p. 50, quoting Schmitz v. Younger, supra, 21 Cal. 3d at pp. 99-100 (dis. opn. of Manuel, J.). (See discussion post, at p. 277.)\n\nThe single-subject rule thus requires that the separate provisions of an initiative submitted to the voters not only \"pertain\" to the same subject, but also be \"'reasonably germane' to each other.\" (Amador Valley, supra, 22 Cal. 3d at p. 230.) The various parts must \"interlock\" so as to form a cohesive program aimed at the specific purpose of the initiative. (Ibid.) Evaluated in light of this standard, Proposition 8 does not meet the single-subject requirement of our state Constitution.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nThe multiple provisions of Proposition 8 are much broader than the initiative's self-proclaimed title or the official title prepared for the ballot pamphlet by the Attorney General. The proposition denominated itself the \"Victims' Bill of Rights,\" while the Attorney General called it the \"Criminal Justice\" initiative. Both of these appellations are deceptive.\n\nInitially, only two aspects of the initiative relate directly to victims -- restitution and victims' statements at sentencing and parole hearings. The numerous sections of the initiative revising criminal procedures may have an incidental effect on the victims of crime, but some may actually harm victims rather than protect them.\n\nFor instance, the constitutional amendment providing that all relevant evidence is admissible in criminal proceedings appears to eliminate statutory protections for victims of crime, such as the Evidence Code provision authorizing a court to bar public release of a rape victim's\n\naddress and telephone number. (See Evid. Code, § 352.1.) Indeed, the California State Coalition of Rape Crisis Centers, appearing as amicus curiae in support of petitioners, argues forcefully that Proposition 8 seriously weakens legal protections for rape victims. The Coalition claims that the potential now exists for the victim again to become the \"second defendant\" at a rape trial.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nThe \"Truth-in-Evidence\" provision also curtails other rights presently enjoyed by our citizens. It appears to authorize the admission of evidence of a victim's past conduct or character that might otherwise have been excluded. (See, e.g., Evid. Code, §§ 786, 787, 1101, 1104; Gov. Code, § 7489.)\n\nConsider also the limitation on plea bargaining which may pose a serious problem for some victims. Many victims of crime -- particularly young children and victims of sexual assaults -- do not want to be forced to relive their ordeal on the witness stand at a trial. They may prefer that the charges against their assailants be settled before trial by means of a reasonable plea bargain, to avoid the agony of testifying at public trial. However, in many situations Proposition 8 bars the court and the prosecutor from considering a negotiated settlement to protect the victim. Clearly, in many of its most important provisions the proposition is not a \"Victims' Bill of Rights\" at all.\n\nThe voters were misled by the titles proposed by the draftsmen and the Attorney General. The section of the initiative creating a right to \"safe, secure and peaceful\" schools is not encompassed within either of the titles set forth in the ballot pamphlet. The right to personal safety, security and peace is not limited to safety from criminal violence. The initiative purports to grant to students and staff a right to protection from every danger that might threaten their safety, security or peace. This undefined right could encompass such diverse hazards as acts of nature, acts of war, environmental risks, building code violations, disruptive noises, disease and pestilence, and even psychological or emotional threats, as well as crime. The right to protection from noise or fire is not the same subject as \"victims' rights\" or \"criminal justice.\"\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nIn an effort to find a formula which covers all the varied provisions of Proposition 8, the Attorney General is forced to propose a single subject that is broader than the titles presented to the voters. Apparently, he has abandoned the proponents' earlier argument in Brosnahan v. Eu, supra, 31 Cal. 3d 1, that the single subject of this initiative is \"public safety.\" He now claims that victims' rights must be interpreted more broadly to include \"potential\" as well as actual victims of crime. Thus, he contends that the entire proposition falls within a single subject which he defines as \"reform of the criminal justice system as it relates to the actual and potential victims of crime.\"\n\nThe initial flaw in this argument is that it does not explain the relevance of the provision guaranteeing \"safe, secure and peaceful\" schools. That provision is not limited to protecting persons from crime.\n\nThe Attorney General's argument has additional shortcomings. The fact that he must transform the \"Victims' Bill of Rights\" into the \"Victims' and Potential Victims' Bill of Rights\" in an attempt to encompass all of its provisions within a \"single subject\" illustrates a fatal problem with this initiative. As used by the Attorney General, \"potential victims\" of crime includes all of us in virtually every aspect of our lives. If this court were to accept such an expansive definition of a single subject, initiatives could embrace hundreds of unconnected statutes, countless rules of court and volumes of judicial decisions, as well as completely alter the complex interrelationships of our society.\n\nThe single-subject rule would be rendered meaningless if it could be complied with simply by devising some general concept expansive enough to encompass all of an initiative's provisions. If the requirement of the rule could be so easily met, any initiative could be upheld by finding that all of its provisions fell within some catchall subject such as \"the general welfare\" or \"the citizenry.\"\n\nAs Justice Mosk noted in Brosnahan v. Eu, supra, \"The constitutional requirement is not satisfied by attaching a broad label to a measure and then claiming that its provisions are encompassed under that wide umbrella. Otherwise, initiatives which refer to 'property' or 'women' or\n\n'public welfare' or the 'pursuit of happiness' could also be held to constitute one subject, no matter how diverse their terms.\" (31 Cal. 3d at p. 11 (conc. and dis. opn.); see also Fair Political Practices Com. v. Superior Court, supra, 25 Cal. 3d at p. 57 (dis. opn. of Manuel, J.) [\"The single subject rule . . . is not concerned with umbrellas; it is concerned with subjects.\"].)\n\nThe Attorney General is correct in noting that this court has upheld measures addressing subjects as broad as \"probate\" (Evans v. Superior Court, supra, 215 Cal. 58), \"water resources\" (Metropolitan Water Dist. v. Marquardt, supra, 59 Cal. 2d 159), and \"real property tax relief\" (Amador Valley, supra, 22 Cal. 3d 208). However, these \"single subjects\" differ in two crucial respects from the subject proposed by the Attorney General in this case.\n\nFirst, each of the subjects upheld in Evans, Metropolitan Water Dist. and Amador Valley is focused on a well-defined aspect of our society. None is as broad or as amorphous as \"potential victims.\"\n\nEqually important, the statutes and initiatives upheld in those cases passed constitutional muster because their provisions were all interrelated. Where the subject of a proposal encompasses multiple provisions, the measure will satisfy the requirements of the single-subject rule only if those provisions interrelate so as to form a unitary whole. This court has consistently held that the \"reasonably germane\" standard of the single-subject rule demands that the provisions of an act or initiative be \"so related and interdependent as to constitute a single scheme . . . .\" (Evans v. Superior Court, supra, 215 Cal. at p. 62; Amador Valley, supra, 22 Cal. 3d at p. 230; Metropolitan Water Dist. v. Marquardt, supra, 59 Cal. 2d at p. 173.)\n\nThe rule articulated in these cases controls here. Any single provision of Proposition 8 \"could have been adopted 'without the slightest need of adopting' the others.\" (Amador Valley, supra, 22 Cal. 3d at p. 232, quoting Kerby v. Luhrs, supra, 36 P.2d at p. 554.) Even if a given provision of Proposition 8 may be said to interlock with another, the remainder are completely independent and unnecessary to the effective implementation of that interlocking area.\n\nThe provision creating a right to safe schools is the most striking example of this independence. None of the other provisions of this initiative are even remotely connected to implementing that right.\n\nJustice Mosk stated it well. \"Although the measure piously declares that safe schools are a right, it does not contain one provision referring to schools. A voter or the signer of a petition would reasonably expect that a lengthy amendment which states in one of its first paragraphs that 'students and staff have the right to be safe and secure in their persons' on campus would contain some reference to and propose some protection of that right in its substantive provisions. . . . [This] expectation is not fulfilled.\" (Brosnahan v. Eu, supra, 31 Cal. 3d at pp. 11-12 (conc. and dis. opn. of Mosk, J.).)\n\nFurther, under a faithful interpretation of the single-subject rule, the remaining provisions of Proposition 8 clearly \"[embrace] more than one subject.\" The measure is replete with proposals for important policy changes, many of which are enormously complex. This aggregation into one initiative measure of so many far-reaching, yet unrelated, proposals sharply conflicts with the fundamental concerns underlying the single-subject rule.\n\nThe \"Truth-in-Evidence\" provision presents a striking illustration of the multiplicity of subjects contained in Proposition 8. That section undertakes a major revision of a complicated area of the law. It appears in effect to amend dozens of sections of the Evidence Code and overturn numerous judicial decisions.\n\nThe constitutional and practical ramifications of these changes are startling. Every criminal proceeding in the state would be affected, and each trial will have its own ad hoc rules of evidence. Yet, this wholesale revision of our state's rules of evidence was insinuated into an initiative containing such other controversial and disparate subjects as bail and own-recognizance release, the insanity defense, plea bargaining, juvenile justice, and the laws governing mentally disordered sex offenders.\n\nThe consequences of the proposition's limitation on plea bargaining could be even greater than those resulting from the changes wrought by the \"Truth-in-Evidence\" section. Over 95 percent of the criminal convictions in California have heretofore been reached through plea bargains. (Cal. Dept. of Justice, Crime \u0026 Delinquency in Cal. (1981) p. 48.) The voters were not informed of the possible effect of a wholesale ban in the superior court on a practice so integral to the present criminal justice system. As a result, they were never given the opportunity to weigh the possible high price they might have to pay for a vast increase in the number of criminal trials. They were never made aware\n\nof the potential impact of this provision on the large backlog of civil cases awaiting trial. Once again, these important policy considerations were buried amongst the mass of unrelated subjects contained in Proposition 8. As a result, the people were denied their right to consider and vote selectively on the merits of this provision.\n\nAlso, consider the provision of the initiative which purports to mandate the use of all prior felony convictions, \"adult or juvenile,\" for impeachment and sentence enhancement. With these few words, juvenile court adjudications may have been transformed into the equivalent of adult convictions. Such a change represents a fundamental alteration of the policies which have long required a distinction between the treatment of juvenile and adult offenders. Yet, the voters were forced to pass judgment on this major change as only one small portion of an all-or-nothing package involving many unrelated but equally basic changes.\n\nOther provisions of the initiative also demonstrate that Proposition 8 confronted the voters with an unconstitutional grouping of unconnected subjects. For example, the right to restitution is not related to the rules of evidence, bail release or the use of prior convictions. The provisions governing diminished capacity and insanity, while arguably related to each other, are not interdependent with the provisions governing victims' statements at sentencing and parole hearings or with the limitations on commitments to the Youth Authority.\n\nLegislative developments at the time Proposition 8 was drafted and petitions circulated provide further evidence of the independence of the measure's provisions. During that period a substantial number of bills were before the Legislature relating to portions of Proposition 8. According to amicus Pacific Legal Foundation, there were more than a dozen such bills, each \"closely related\" to one of eleven \"provisions\" of the initiative measure.\n\nSignificantly, each of these bills concerned but one field of legislation and pertained to only one of the provisions of Proposition 8. None had a scope even remotely resembling that of the initiative. By contrast, the draftsmen of this initiative sought to collect and combine into one package all of the diverse legislative fields addressed by all these individual bills.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nThe narrow focus of the bills before the Legislature suggests that it viewed each of them as an independent subject properly submitted as a separate proposal. Certainly, the single-subject rule applies with no less force to the draftsmen of initiatives than to legislators. The sheer number and diversity of legislative bills sought to be wedged without interlock into one initiative is further evidence that the measure embraced more than one subject.\n\nThe Attorney General points to the result in Fair Political Practices Com. v. Superior Court, supra, 25 Cal. 3d 33 to support his claim that Proposition 8 embraces but one subject. His reliance on that case is misplaced. The Fair Political Practices initiative concerned a comprehensive attempt to lessen the influence of wealth on California government and elections. There, the court apparently felt that each of its provisions was necessary to achieving that goal, by preventing the mere shift of wealth from one sphere of political influence to another. The provisions were also linked by common means of enforcement. Moreover, unlike Proposition 8, none of the provisions contradicted the initiative's general purpose, and none was unrelated to the common goal.\n\nFinally, the general subject of the initiative, the corruptive influence of money in politics, was specifically addressed by a constitutional provision which reserves to the people the right to act by initiative to protect themselves against such corruption. Article IV, section 5 of the Constitution provides in pertinent part, \"The Legislature shall enact laws to prohibit members of the Legislature from engaging in activities or having interests which conflict with the proper discharge of their duties and responsibilities; provided that the people reserve to themselves the power to implement this requirement pursuant to Section 22 of this article [now art. II, § 8, defining the initiative power].\"\n\nEach of these factors distinguishes the Fair Political Practices initiative from Proposition 8, and highlights the drafting deficiencies which render Proposition 8 constitutionally invalid.\n\nNot only does Proposition 8 violate the terms of the single-subject rule as set forth in the case law, it also flouts the policy concerns underlying the voters' enactment of the rule in the first place.\n\nBy lumping so many fundamental changes into one measure, the initiative effectively deprived the voters of their opportunity to consider and pass on the merits of the individual proposals. Each of these provisions created a different and distinct alteration of our constitutional or statutory framework. As a whole they did not present a coherent, interlocking program. Yet the electorate was forced to vote either \"yes\" or \"no\" on a single initiative containing this wide a variety of controversial and complex proposals.\n\nThe disparate votes on Proposition 8 and Proposition 4, a bail reform initiative on the same ballot, provide a vivid illustration of the dilemma Proposition 8 created for the voters of the state. Proposition 4 passed with over 82 percent of the electorate voting in its favor. Proposition 8 received only 56 percent of the votes cast. These figures seem to indicate that over 25 percent of the voters favored bail reform but nevertheless voted against Proposition 8 because they opposed other provisions included in the measure. Here is yet another graphic example that the voters of California were deprived of their constitutionally protected right to be able to evaluate independently each proposal of an initiative.\n\nIn essence, the draftsmen confronted the voters with a Hobson's choice, an electoral contract of adhesion. Had the separate provisions of the initiative been interdependent, it might have been reasonable to ask the electorate to vote on the entire initiative as a package. Since they were independent, encompassing a wide variety of disparate and conflicting concepts, the voters were deprived of their constitutional right to consider the proposals individually and to evaluate each in a more discriminating fashion.\n\nThe \"multifarious\" nature of this initiative created an additional problem. When the voters of California went to the polls on June 8, 1982, it is unlikely they were fully aware of all of the provisions of Proposition 8.\n\nCan anyone seriously argue that the voters knew that Proposition 8 would (1) abolish the protection previously afforded to victims of sex crimes regarding the \"[exclusion] from evidence [of their] current address and telephone number\" (Evid. Code, § 352.1); (2) permit testimony from those children and mentally incompetent persons who are \"incapable of understanding the duty . . . to tell the truth\" (id., § 701, subd. (b)); (3) authorize witnesses to testify to matters about which they have no personal knowledge (id., § 702); (4) repeal the rule that\n\n\"[evidence] of his religious belief or lack thereof is inadmissible to attack or support the credibility of a witness\" (id., § 789); (5) permit opinion testimony by non-expert witnesses (id., § 800); and (6) authorize the trial court to exclude certain relevant evidence (id., § 352)?\n\nThose voters who relied on section 1 of the initiative may well have assumed that they were voting for a \"Victims' Bill of Rights\" without realizing that they were also adopting a new provision guaranteeing \"safe, secure and peaceful\" schools (for which they might have to pay a steep price) and substantially revising pretrial detention practices, rules of criminal evidence, criminal procedure, sentencing, and juvenile law. Similarly, those who relied on the accuracy of the title, \"Criminal Justice\" initiative, may well have been unaware of the provision affecting schools.\n\nThe risk that the electorate was unaware of many of Proposition 8's provisions was aggravated by the numerous inconsistencies among the initiative's various sections. The most glaring example is the contrast between the proposition's self-proclaimed title, the \"Victims' Bill of Rights,\" and the fact that many provisions of the initiative may actually be harmful to victims of crime.\n\nAdditional examples abound. For instance, while one section states that generally, \"relevant evidence shall not be excluded in any criminal proceeding,\" another section specifically requires the exclusion of evidence of lack of capacity to form a specified mental intent. (Compare Prop. 8, § 3, new art. I, § 28, subd. (d) with Prop. 8, § 4, new Pen. Code, § 25, subd. (a).) Yet another section appears to require the admission of certain irrelevant evidence -- all prior felony convictions, whether or not relevant to credibility. (Prop. 8, § 3, new art. I, § 28, subd. (f).)\n\nThe initiative presented the additional danger of \"logrolling\" -- aggregating the votes of those who favored parts of it into a majority for the whole, even though it was possible that some or all of its provisions were not supported by a majority of voters. Thus, those who favored better protection for victims of crime may not have favored a wholesale repeal of the state's Evidence Code, which may allow victims of crime to be subjected to searing cross-examination concerning their private lives. In like manner, those who wanted to ban plea bargaining may not have wanted to pay the high price in taxes necessary to ensure that schools are safe and secure from acts of nature or of man.\n\nBy placing these separate and quite disparate provisions in one initiative, the draftsmen of Proposition 8 deprived the voters of this state of an opportunity to analyze and vote on these provisions selectively. The people of California enacted the single-subject rule to prevent initiative draftsmen from unfairly foisting upon them just such misleading groupings of unrelated provisions.\n\nIn a final, overarching attack on petitioners' claim that the single-subject rule has been violated, the Attorney General claims that a \"strict\" interpretation of the rule violates precedent. However, he overlooks the fact that the standard applied here is the same as that applied in Amador Valley. In turn, Amador Valley described that standard as the \"primary lesson\" of another case which involved an initiative measure and was decided 30 years earlier. (22 Cal. 3d at p. 230, referring to Perry v. Jordan, supra, 34 Cal. 2d 87.) Even prior to Perry, it had long been established that the provisions of a single act should be \"so related and interdependent as to constitute a single scheme.\" (Evans v. Superior Court, supra, 215 Cal. at p. 62.)\n\nThe single-subject rule does not prevent the submission to the voters of comprehensive programs of reform. Rather, it merely limits the form in which such programs may be presented. If proposed constitutional or statutory changes embrace more than one subject, they must be presented to the voters in more than one initiative. The proposed provisions of an initiative must be \"'reasonably germane' to each other,\" creating a coherent, interdependent scheme. (Amador Valley, supra, 22 Cal. 3d at p. 230.)\n\nThe single-subject requirement thus operates not as a limit on the people's reserved power to legislate by initiative, but as a limit on the draftsmen of initiative measures. The rule demands that initiative proposals be presented to the voters in a format that ensures the integrity of the cherished initiative process.\n\nThe Constitution permits the drafters of initiative measures to draw up their proposals without any input -- direct or indirect -- from the people. Thus, it is logical that the draftsmen are constitutionally required to submit initiatives to the electorate in coherent, single-subject packages, so that voters are able to make rational decisions that accurately and completely reflect their wishes. Just as consumers demand the right to buy what they want, the voters of this state have demanded that initiative sponsors give them the right to vote for the proposals they favor.\n\nThey have refused to be forced to accept unrelated provisions wrapped in deceptive packaging.\n\nInitiatives which embrace more than one subject weaken rather than strengthen a citizen's right to vote. They threaten to undermine the integrity and strength of the whole initiative process. If the voters are confused or misled, or if they vote for or against a proposal because they favor or oppose one or two of its provisions, the initiative process has not served to implement the will of the people. Rather, it has sanctioned a warped expression of the wishes of some of those people, while thwarting the will of the majority. Only through careful adherence to the objective constitutional regulations governing the initiative process can the true purposes of the right to the initiative be realized. Bending those rules weakens the process, thereby diminishing the people's control over their government.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nII.\n\nIn addition to the constitutional challenge based on the single-subject rule of article II, section 8, subdivision (d), there are other challenges to the presentation and enactment of Proposition 8. These include (1) whether the draftsmen failed to disclose on the face of this initiative the full purpose and effect of its provisions, in violation of article IV, section 9 and (2) whether they revised the Constitution, rather than amended it, thus running afoul of article XVIII, which limits the use of the initiative process to constitutional amendments. These issues are treated in order.\n\nFailure to Disclose Full Purpose and Effect\n\nPetitioners contend that the draftsmen of Proposition 8 failed to \"disclose on [the] face [of the initiative] the full purpose and effect of its provisions,\" as required by article IV, section 9.\n\nTheir arguments are founded upon the last two sentences of that section. These sentences set forth a pair of rules: (1) \"A statute may not be amended by reference to its title\"; and (2) \"A section of a statute may not be amended unless the section is re-enacted as amended.\"\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e Petitioners allege that the first rule was violated by that portion of Proposition 8 which repealed the law relating to mentally disordered sex offenders (M.D.S.O.). (Prop. 8, § 9.) They further contend that the \"Truth-in-Evidence\" provision amended by implication nearly all of the Evidence Code. Since none of the Evidence Code was \"re-enacted as amended,\" they contend a violation of the second rule resulted.\n\nThe first of these arguments lacks merit. The attempt by the draftsmen of Proposition 8 to repeal the M.D.S.O. laws was mooted by legislative enactment in 1981. The voters were twice informed of this fact in the ballot pamphlet. (Ballot Pamp., Primary Elec. (June 8, 1982), analysis by Legislative Analyst, p. 55, and rebuttal to argument in favor of Prop. 8, p. 34.) Indeed, the voters were explicitly advised that the initiative measure's attempt to repeal the M.D.S.O. laws \"has no effect.\" (Id., at p. 55.) It would be too severe a rule to hold that the entire proposition should be invalidated for such a technical violation of the prohibition against repeal by reference to a law's title. In all probability, no voter confusion was caused by this violation.\n\nPetitioners' second contention -- that numerous statutes relating to the admissibility of evidence were implicitly amended without being \"re-enacted as amended\" -- poses a more difficult question. The purpose of such a constitutional provision is clear. \"It is to compel [a proposed law] to disclose on its face something of its purpose and effect . . . .\" (Myers v. Stringham (1925) 195 Cal. 672, 675 [235 P. 448]; see also Brosnahan v. Eu, supra, 31 Cal. 3d at p. 12 (conc. and dis. opn. of Mosk, J.).)\n\nThere is no case which directly decides whether amendments proposed by statewide initiative are subject to the constitutional requirement of article IV, section 9, regarding reenactment of amended\n\nstatutes.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e However, in Myers v. Stringham, supra, 195 Cal. 672, a substantially similar requirement in a city charter was held to apply to an attempt to amend a city ordinance by the initiative process.\n\nNo reason has been suggested why a statewide initiative should be treated differently from a local initiative or a legislatively enacted statutory amendment in this regard. The purpose of the requirement is equally applicable to statewide initiatives. An amendment by initiative should \"disclose on its face something of its purpose and effect . . . .\" (See Myers, supra, 195 Cal. at p. 675.) Indeed, that purpose would seem to be even more important in the context of initiatives since they are frequently drafted by \"a small group of people\" (Wallace, supra, 200 Cal. at p. 592), without the opportunity for inquiry, explanation, and critical analysis that is available for amendments considered by the Legislature.\n\nIt is true that the requirement for reenactment of amended statutes is found in article IV, which deals with \"Legislative\" matters. However, this fact does not justify the conclusion that the application of the requirement is limited to amendments passed by the Legislature, since the initiative power reserved to the people is itself a reserved legislative power. (See art. IV, § 1.) As this court has noted on several occasions, \"'By the enactment of initiative and referendum laws the people have simply . . . reserved to themselves the right to exercise a part of their inherent legislative power.'\" (Hays v. Wood, supra, 25 Cal. 3d at p. 786,\n\nfn. 3, quoting Dwyer v. City Council (1927) 200 Cal. 505, 513 [253 P. 932], italics added in Hays.)\n\nThat the effect of Proposition 8 was to alter a substantial number of statutes is undeniable. Petitioners list more than two dozen statutes the provisions of which have, by necessary implication, been amended by the \"Truth-in-Evidence\" provision alone. (Prop. 8, § 3; see also ante, at pp. 278-279.) None of these statutes was set forth or reenacted in the initiative measure. Nor were they detailed in the analysis or the arguments in favor of the proposition. Thus, the voters could not have had a realistic idea as to the scope of the statutory changes which would result from the enactment of the measure.\n\nFurther, the voters could not possibly have known what existing evidentiary provisions were being preserved. As presented to the electorate, the initiative mandated that \"relevant evidence shall not be excluded in any criminal proceeding.\" However, it also provided exceptions to this rule for \"any existing statutory rule of evidence relating to privilege or hearsay, or Evidence Code, Sections 352, 782 or 1103.\"\n\nNowhere were the people even given a hint as to what these exceptions to the relevant evidence rule entailed. Such information was not contained within the four corners of the proposition. Sections 352, 782, and 1103 of the Evidence Code were neither set forth in the initiative, nor were their contents alluded to in the ballot pamphlet. The same is true for the \"existing statutory [rules] of evidence relating to privilege or hearsay\" and for the rules governing the press.\n\nThus, not only was the electorate unable to determine what statutes were being altered, it also could not determine what statutes were not being changed. In short, the voters had no way of knowing what the law relating to admissibility of evidence would be following the enactment of Proposition 8.\n\nRespondents cite cases which hold that article IV, section 9 does not apply to \"independent\" enactments which amend existing statutes \"by implication,\" rather than by explicit terms. (See Evans v. Superior Court, supra, 215 Cal. at pp. 65-66; Hellman v. Shoulters (1896) 114 Cal. 136, 150-153 [44 P. 915, 45 P. 1057].) One such case, Hellman, involved a purported amendment to the \"Vrooman Act of 1885,\" which set forth certain procedures for the enactment of local ordinances for street improvements. In 1891, the Legislature adopted an act which\n\nprofessed to \"amend\" the Vrooman Act by \"adding thereto an additional part,\" providing for an alternative street ordinance procedure. This court held that since the 1891 act added \"new sections which leave in full operation all the language of the [existing law] which it purports to amend,\" there was no \"amendment\" of that law within the meaning of former article IV, section 24 (now § 9). (114 Cal. at p. 151, italics added.)\n\nFurther, even if the 1891 act were viewed as amending the Vrooman Act, it would amend \"only by implication.\" (Id., at p. 152.) Former article IV, section 24 \"does not apply to amendments by implication,\" the court concluded. (Id., at p. 153.) \"To say that every statute which [by implication] affects the operation of another is therefore an amendment of it would introduce into the law an element of uncertainty which no one can estimate. It is impossible for the wisest legislator to know in advance how every statute proposed would affect the operation of existing laws. . . . 'The mischief designed to be remedied was the enactment of statutes in terms so blind that . . . the public, from the difficulty of making the necessary examination and comparison, failed to become appraised of the changes made in the laws. . . . But an act complete in itself is not within the mischief designed to be remedied by this provision, and cannot be held to be prohibited by it without violating its plain intent.'\" (Id., at pp. 152-153, italics added.)\n\nThe Hellman discussion of amendments by implication was picked up in Evans, supra, 215 Cal. 58. Under attack in Evans was the initial codification by the Legislature of the Probate Code. This court noted that some provisions of the new Code were inconsistent with existing statutes, but held nevertheless that compliance with the requirement that amended statutes be reenacted was not necessary. The Constitution, it was reasoned, \"'does not apply to an independent act' [nor] '. . . to amendments by implication.'\" (Id., at pp. 65-66, quoting Pennie v. Reis (1889) 80 Cal. 266, 269 [22 P. 176], and Hellman, supra, 114 Cal. at p. 153.)\n\nThe holdings of both Hellman and Evans involved amendatory laws enacted by the Legislature. They did not involve amendments adopted through the initiative process. Sound reasons exist for treating initiative amendments with even more care.\n\nIt is the very essence of the legislative process to deal with and become immersed in laws, existing and proposed. A legislator's\n\nprofessional life is one of passing and amending laws. This daily involvement with the law, combined with ready access to extensive professional research staffs and legal libraries, creates an expertise in the Legislature that is impossible to duplicate, or even approximate, among the electorate at large.\n\nAs the late Justice Wiley Manuel noted, \"Voters have neither the time nor the resources to mount an in depth investigation of a proposed initiative.\" (Schmitz v. Younger, supra, 21 Cal. 3d at p. 99 (dis. opn.); see also Wallace, supra, 200 Cal. at pp. 592-593.) This is not true of legislators. Thus, it makes eminently good sense to attribute to legislators knowledge of the primary purpose and effects of a proposed statutory amendment, even if not explicitly set forth. However, the same cannot be said for the voting public.\n\nFurther, the problems posed by Proposition 8 far exceed those addressed in Hellman or Evans. Unlike the amendatory enactments in Hellman and Evans, the initiative measure now before this court is not \"complete in itself.\" It is not a wholly \"independent act.\" This is immediately apparent from the fact that the voters could not have determined -- either from the initiative measure itself or from the official ballot pamphlet -- \"what the effect of its adoption would be . . . .\" (See Myers, supra, 195 Cal. at p. 675.)\n\nAll that the voters would have been able to ascertain, without spending tedious hours in a law library, was that the initiative measure would create both a rule admitting relevant evidence and several exceptions of undisclosed magnitude. In the language of Hellman, Proposition 8 fails to inform the voter \"of the changes made in the laws.\"\n\nIn this regard, the present case is similar to Myers v. Stringham, supra, 195 Cal. 672. (See Brosnahan v. Eu, supra, 31 Cal. 3d at pp. 12-13 (conc. and dis. opn. of Mosk, J.).) In Myers, a proposed local initiative measure sought to amend a city's general zoning ordinance by (1) adding a new subsection, describing the boundaries of a plot of land and (2) repealing another subsection, identified only by number. The city charter contained a provision regarding reenactment of amended laws which closely resembled the corresponding portion of former article IV, section 24.\n\nThis court found that the initiative measure violated the charter requirement. \"The purpose of the charter provision is plain. It is to\n\ncompel an ordinance to disclose on its face something of its purpose and effect as a legislative enactment. The wisdom of the requirement is at once apparent from an inspection of the proposed ordinance. The new subsection sought to be added to the section by amendment is no more than a description of certain real property. It does not purport to disclose what the effect of its adoption would be either on the status of the particular property described or on its relation to the general zoning classifications in the city. Considered in and by itself it is unintelligible and meaningless. It cannot be determined from its inspection what is sought to be accomplished.\" (195 Cal. at p. 675.)\n\nLike the initiative in Myers, the \"Truth-in-Evidence\" provision of Proposition 8 does not \"disclose on its face something of its purpose and effect.\" It gives the voters little inkling as to what changes are being made in the current law. The provision purports to impose new rules of evidence throughout the criminal justice system of this state. The voters, when called upon to approve or reject the initiative, could not determine the meaning of those new rules no matter how extensive their inspection of the measure or the ballot pamphlet. They were informed only as to the section numbers, not the content of the statutes being incorporated into the Constitution.\n\nIn short, the draftsmen of Proposition 8 failed to disclose to the people the purpose and effect of its provisions. As a result, they violated the constitutional standard set forth in article IV, section 9.\n\nThere is an additional defect of the measure which has apparently escaped the notice of the draftsmen of the initiative as well as those who challenged the measure's validity. The draftsmen of Proposition 8 sought to use this one initiative measure to make changes in both our Constitution and our codified laws. Such a combination of statutory and constitutional alterations is unusual.\n\nTo our knowledge, only once in this state's long history has an attempt been made to join both statutory and constitutional changes in a single initiative. Although this court upheld that initiative against a one-subject attack in Perry v. Jordan, supra, 34 Cal. 2d 87, the court did not consider the propriety of combining statutory and constitutional changes in a single initiative. Indeed, the court did not appear to recognize that the initiative before it contained proposals for statutory change.\n\nPerry preceded by nearly two decades the most recent comprehensive revision of our Constitution in 1966. That revision clearly sought to perpetuate the distinction between the use of the initiative process to effect constitutional change and its use to bring about statutory changes. (See, e.g., Cal. Const. Revision Com., Proposed Revision of Cal. Const. (1966) pp. 43-44; see also Wallace v. Zinman, supra, 200 Cal. at p. 593 [\"Throughout section 1 of article IV of the constitution [predecessor to current art. II, §§ 8-11, and art. IV, § 1] a distinct line of demarcation is kept between a law or an act and a constitutional amendment.\"].) Subdivision (b) of section 8 of article II states that \"[an] initiative measure may be proposed by presenting to the Secretary of State a petition that sets forth the text of the proposed statute or amendment to the Constitution . . . .\" (Italics added.) The use of the disjunctive is indicative of this differentiation.\n\nUnfortunately, the majority ignores the issue of combining statutory and constitutional changes in a single initiative, giving no guidance to drafters of future initiatives other than a green light to go and violate the Constitution with impunity.\n\nRevision or Amendment\n\nThe subject of \"Amending and Revising the Constitution\" is covered by article XVIII of our Constitution. Pursuant to its terms, the Legislature may propose \"an amendment or revision of the Constitution,\" while an initiative may be used to \"amend the Constitution.\" (Art. XVIII, §§ 1, 3; see also art. II, § 8, subd. (a) [\"The initiative is the power of the electors to propose statutes and amendments to the Constitution and to adopt or reject them\"].)\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nThe courts have long been aware of the \"fundamental distinction\" between a constitutional revision and a constitutional amendment. (See Amador Valley, supra, 22 Cal. 3d at p. 222; see also Livermore v. Waite (1894) 102 Cal. 113, 117-119 [36 P. 424].) Thus, it is firmly established that the initiative process may be used to amend our Constitution, but not to revise it. (Amador Valley, supra, 22 Cal. 3d at p. 221; McFaddeh v. Jordan, supra, 32 Cal. 2d at pp. 331-334.)\n\nAlthough a precise line of demarcation between amendment and revision may be difficult to draw, this court outlined the distinction in general terms nearly 90 years ago. \"The very term 'constitution' implies an instrument of a permanent and abiding nature, and the provisions contained therein for its revision indicate the will of the people that the underlying principles upon which it rests, as well as the substantial entirety of the instrument, shall be of a like permanent and abiding nature. On the other hand, the significance of the term 'amendment' implies such an addition or change within the lines of the original instrument as will effect an improvement, or better carry out the purpose for which it was framed.\" (Livermore, supra, 102 Cal. at pp. 118-119.)\n\nIn 1948, this court struck down as a \"revision\" an initiative proposal that would have effected \"extensive alterations in the basic plan and substance of our present Constitution . . . .\" (McFadden, supra, 32 Cal. 2d at p. 347.) The initiative challenged in McFadden would have added 21,000 words to the Constitution and would have repealed or substantially altered 15 of its 25 articles.\n\nIncluded within the \"vast sweep\" of the measure were matters \"from gamblers to ministers; from mines to civic centers; from fish to oleomargarine; from state courts to city budgets; from liquor control to senate reapportionment . . . .\" (Id., at p. 349.) This court seemed most troubled by the initiative's creation of a new commission, whose virtually unfettered exercise of far-reaching powers would have placed it \"substantially beyond the system of checks and balances which heretofore has characterized our governmental plan.\" (Id., at p. 348.)\n\nRecently, this court spoke to the issue as it applied to the enactment by initiative of article XIII A. (Amador Valley, supra, 22 Cal. 3d 208.) A dual test, \"quantitative and qualitative in nature,\" was applied. \"[An] enactment which is so extensive in its provisions as to change directly the 'substantial entirety' of the Constitution by the deletion or alteration of numerous existing provisions may well constitute a revision thereof. However, even a relatively simple enactment may accomplish such far reaching changes in the nature of our basic governmental plan as to amount to a revision also. In illustration, the parties herein appear to agree that an enactment which purported to vest all judicial power in the Legislature would amount to a revision without regard either to the length or complexity of the measure or the number of existing articles or sections affected by such change.\" (Id., at p. 223.)\n\nPetitioners in Amador Valley challenged the initiative tax relief measure on the ground, inter alia, that it had the qualitative effect of impairing the established principle of \"home rule.\" (22 Cal. 3d at p. 224.) This loss of home rule was claimed to be a consequence of (1) restrictions which article XIII A placed on local government's power to tax and (2) the resulting need to look to the state Legislature for a substantial portion of funds for local purposes. In rejecting this argument, the court found that the \"probable effects [of the initiative measure] are not as fundamentally disruptive as petitioners suggest\" and that the initiative would not \" necessarily and inevitably \" result in the loss of home rule. (Id., at pp. 224, 226.)\n\nUnder the particular theories advanced by the petitioners, it would appear that the \"Victims' Bill of Rights\" does not amount to a constitutional revision. Considering the measure's quantitative effect, it bears noting that less than half of the measure purports to change the content of the Constitution. The remainder of the proposition alters statutes, and by its very terms, the prohibition of revision by initiative applies to constitutional, not statutory, changes.\n\nOnly sections 2 and 3 of the initiative purport to directly alter the Constitution itself. They repeal one section of article I and add another. The net effect is the addition of about 660 words to our Constitution. This may be more words than were added by Proposition 13 (400 words), but in purely quantitative terms, it cannot be said to be so substantial as to amount to a revision of a document that already contains 21 articles, 277 sections, and approximately 35,000 words.\n\nPetitioners' primary contention is that Proposition 8 fails the qualitative test of Amador Valley and McFadden. They argue that the measure accomplishes \"far reaching changes in the nature of our basic governmental plan,\" by altering our court system and our system of public education. (See Amador Valley, supra, 22 Cal. 3d at p. 223.)\n\nSections of Proposition 8 do make significant substantive changes across an extensive range of subjects, but these changes relate primarily to matters which previously had been covered by statute and were not a part of the Constitution. For example, the so-called \"Truth-in-Evidence\" provision would appear to alter by implication many of this state's evidentiary rules. (See Prop. 8, § 3, subd. (d).) However, most of these rules are statutory or have been developed over the years in the common law. Since petitioners have not argued that Proposition 8's\n\nchanges with respect to constitutionally based rules of evidence are a revision of the Constitution, that issue is not considered here.\n\nPetitioners contend that Proposition 8 will prevent the judiciary from processing civil cases, in violation of article VI, section 1. That section vests the \"judicial power of this State . . . in the Supreme Court, courts of appeal, superior courts, municipal courts, and justice courts.\" The argument is advanced that Proposition 8 will create such an enormous backlog of criminal cases that \"for all practical purposes, . . . the judiciary [will be precluded] from performing their [ sic ] constitutional obligation to decide . . . civil matters.\"\n\nThis backlog of criminal cases will be caused, it is said, by the enactment of the Penal Code provisions which (1) limit plea bargaining (Pen. Code, § 1192.7; Prop. 8, § 7), (2) require that victims have the opportunity to attend sentencing proceedings in misdemeanor cases (Pen. Code, § 1191.1; Prop. 8, § 6, subd. (a)), and (3) enable prosecutors to obtain longer sentences for defendants by bringing and trying charges separately (Pen. Code, § 667; Prop. 8, § 5).\n\nPetitioners also foresee serious consequences for our system of public education as a result of the provisions in Proposition 8 regarding the right to \"safe, secure and peaceful\" schools. (Art. I, § 28, subds. (a), (c); Prop. 8, § 3.) They argue that with budgets already trimmed, \"the schools will have little choice but to curtail instruction\" in order to comply with the newly imposed duty to provide \"safe, secure and peaceful\" campuses. This contraction of educational services would amount to a substantial impairment of the fundamental constitutional right to education, they contend. (See art. IX, § 1; Serrano v. Priest (1971) 5 Cal. 3d 584, 608-609 [96 Cal. Rptr. 601, 487 P.2d 1241].)\n\nThese predictions may well be accurate, but they do not justify the legal conclusion that Proposition 8 amounts to a constitutional revision, rather than an amendment, under the present state of the case law. (See Amador Valley, supra, 22 Cal. 3d at pp. 223-224.)\n\nMoreover, each argument is premised on assumptions concerning matters that are outside the four corners of the initiative measure itself, i.e., that there will be insufficient resources to cope with the changes mandated therein. No hard facts have been produced. This court has been and should continue to be reluctant to declare an initiative measure to be a revision based solely on speculation as to its fiscal effect.\n\nInitiative measures frequently have an impact on the public fisc, and hence on matters of constitutional concern. (Cf. Birkenfeld v. City of Berkeley (1976) 17 Cal. 3d 129, 144 [130 Cal. Rptr. 465, 550 P.2d 1001].) If that reason alone were sufficient to deem a measure to be a revision -- and forbidden by article XVIII -- then the power to improve our laws through the initiative process would be stringently curtailed.\n\nThere is, however, a serious problem presented by the manner in which the draftsmen of Proposition 8 attempted to alter the Constitution. Article XVIII sets forth the exclusive means by which the California Constitution may be amended or revised. The sine qua non of these provisions is that the voice of the citizens must be heard. Regardless of how the process is initiated, every constitutional amendment or revision must be submitted to a vote of the people.\n\nProposition 8 created a new section of the Constitution which contains direct reference to a specific statutory provision of the Penal Code. Subdivision (e) of section 28 of article I forbids release on his or her own recognizance of any person charged with the commission of any \"serious felony,\" as defined in subdivision (g). In turn, subdivision (g) defines that term solely by reference to the list of \"serious felonies\" found in Penal Code section 1192.7, subdivision (c). In this manner the contents of this statute are imported into the Constitution.\n\nStatutes, of course, may generally be amended by the Legislature without the necessity of referral to, and approval by, the people. However, the Constitution has established special rules for amending statutes (like § 1192.7) that are created by the initiative process. (See art. II, § 10, subd. (c).) When amending this type of statute, the Legislature must seek the people's approval unless the measure initially passed by the voters specifically authorized amendment without the need for such approval.\n\nThat is precisely the situation in the present case. The draftsmen of Proposition 8 explicitly provided a mechanism by which the Legislature, by a two-thirds vote and without the people's participation, can amend section 1192.7 and its list of enumerated \"serious felonies\" (Pen. Code, § 1192.7, subd. (d)). Such an arrangement ostensibly may be in keeping with the requirements of subdivision (c) of section 10 of article II. However, due to the unusual manner in which the draftsmen have linked statute to Constitution, legislative amendments to section 1192.7 would affect far more than the statutory law of this state. They would\n\nalter the Constitution itself by changing the scope of the constitutional provisions into which they had previously been incorporated.\n\nThe flaw in this scheme is evident. It deprives the people of this state of their paramount role in approving or rejecting changes in their Constitution. In effect, it revises the Constitution by creating a method by which that document may be altered without the participation of the electors. As such, it represents an attempt by the draftsmen to fundamentally reorder the distribution of power between the Legislature and the citizens of this state.\n\nIt could be argued that if rules of statutory construction were applied to the context of the Constitution, the constitutionality of incorporating the specified Penal Code provision into section 28 might be upheld. It has been held that \"where a statute adopts by specific reference the provisions of another statute, regulation, or ordinance, such provisions are incorporated in the form in which they exist at the time of the reference and not as subsequently modified . . . . [Citations omitted.]\" (Palermo v. Stockton Theatres, Inc. (1948) 32 Cal. 2d 53, 58-59 [195 P.2d 1], italics added.) It might be argued that this statutory rule should apply to a constitutional amendment. (Cf. State School Bldg. Fin. Com. v. Betts (1963) 216 Cal. App. 2d 685, 692 [31 Cal. Rptr. 258].)\n\nSubdivisions (e) and (g) of section 28 thus would be read as having incorporated the specified code provisions \"in the form in which they [existed]\" at the time of the passage of Proposition 8. Subsequent legislative modifications of these provisions would be ignored. As such, it would be contended that section 28 would not amount to a revision of the Constitution because future legislative amendment of Penal Code section 1192.7 would have no effect on subdivisions (e) and (g) of that provision.\n\nThis interpretation, however, ignores the fact that the draftsmen of Proposition 8 created a scheme expressly authorizing the Legislature, acting alone, to alter the provisions of Penal Code section 1192.7.\n\nBy incorporating the provisions of Penal Code section 1192.7, subdivision (c) into the Constitution and by providing in subdivision (d) of that section a mechanism for legislative amendment of the provisions of subdivision (c), the draftsmen clearly intended to empower the Legislature\n\nto modify the Constitution without ever referring such action to the electorate for approval.\n\nIn the face of such explicit evidence of the draftsmen's intent, the rule enunciated in Palermo is not applicable. Statutory construction is an effective means by which courts may resolve ambiguities created by the wording or grammatical construction of statutes. Here, however, there is no ambiguity. The rules of construction will not save a measure which is clearly and unambiguously unconstitutional, one which impermissibly reallocates power from the people of this state to the Legislature.\n\nThe draftsmen of Proposition 8 created a mechanism by which the Legislature can transmute a statutory modification into a constitutional amendment.\n\nWith one wave of the wand, this act of electoral alchemy revised the Constitution by devising a means of altering that document without the citizens' participation. Such a change, which strikes at the very essence of our form of government and the power of the people, violates article XVIII's prohibition against constitutional revision by initiative.\n\nIII.\n\nConclusion\n\nThe wisdom of the policies which the draftsmen of Proposition 8 sought to implement is not at issue in this case. I take no position on those policies for that is for the people to decide.\n\nI have great respect for the will of the people. The sovereign power is theirs, and they have chosen to express that power through the Constitution which they, in their wisdom, saw fit to establish. Respect for the Constitution is the truest measure of a justice's respect for the people. The Constitution speaks for the people, and as long as its voice remains strong, the voice of the people will not be muffled.\n\nI would give voice to the provisions the people have placed in their Constitution to ensure that initiative measures truly express their will. The Constitution sets forth the basic requirements for drafting a proper initiative measure. These requirements are simple and straightforward. They are there to protect the people, not from themselves but from unskilled,\n\ncareless, or guileful draftsmen. When those rules are violated, this court must not look the other way, however easy and popular such a course of conduct might be at a given moment.\n\nThe majority opinion implies that the passage of a proposition somehow creates a conclusive presumption in favor of its constitutionality. Such a view sadly mistakes the role of this court. It is not our duty to certify the results of elections; that is the role of the Secretary of State. It is our duty to let the Constitution speak for the people so that their will may be given its fullest and truest expression.\n\nWhat is essentially at issue here is the improper manner in which the draftsmen of Proposition 8 used the initiative process to achieve their goals.\n\nThe people of this state have no voice -- either directly through the exercise of their franchise or indirectly through their elected representatives -- in the formulation or drafting of proposals presented to them by initiative. Thus, the people have seen fit to establish specific constitutional safeguards to ensure that when initiatives are submitted to them, the outcome will be \"the expression of the true will of the people.\" (See Canon v. Justice Court (1964) 61 Cal. 2d 446, 453 [39 Cal. Rptr. 228, 393 P.2d 428], italics added.)\n\nThe people have entrusted to the courts the responsibility for preserving the integrity of the initiative process. In exercising that responsibility, this court must ensure that no initiative is enacted by means of the creation of false majorities, the presentation of deceptive or misleading proposals, or the imposition of forced electoral compromises.\n\nProposition 8, as drafted and presented to the voters of this state in June of 1982, violated virtually every one of these fundamental rules with its \"multifarious\" provisions.\n\nThe draftsmen presented the voters with a false bill of goods. They called the initiative the \"Victims' Bill of Rights\" when in truth the victims of crime lost many rights. Rape victims are just one graphic example of the draftsmen's deceptive packaging of this initiative. In fact, the draftsmen of Proposition 8 have allowed victims of crime themselves to be placed on trial. Under Proposition 8, basic protections that previously limited the scope of cross-examination of crime victims were repealed.\n\nThe single-subject rule is the constitutional equivalent of a truth-in-advertising requirement for the draftsmen of initiatives. When the contents of the package are disguised by its wrapping, the people are denied the Constitution's protection. That is exactly what happened here.\n\nBy presenting the voters with an all-or-nothing choice involving a large number of disparate and complex matters, the draftsmen of this initiative violated the single-subject rule of article II, section 8, subdivision (d).\n\nMoreover, by failing to inform the voters either about the changes they were making in the current law of this state or about the scope of the law they sought to impose in the future, the draftsmen violated the constitutional requirement of full disclosure found in article IV, section 9.\n\nFinally, by depriving the people of this state of their paramount role in approving or rejecting changes in their Constitution and by impermissibly transferring power from the people to the Legislature, the draftsmen of Proposition 8 have attempted to alter the fundamental distribution of power between the people and their elected representatives. They have thereby violated the prohibition against constitutional revision by initiative.\n\nOur constitutional duty as the highest court in this state is to reassert the people's quintessential role in the initiative process and to reaffirm the vitality of the constitutional safeguards designed to protect the integrity of that process. Sadly, a majority of this court has today turned its back on fulfilling that difficult but essential obligation.\n\nThe late commentator Elmer Davis once remarked that \"the republic was not established by cowards, and cowards will not preserve us.\" His words apply equally well to the Constitution.\n\nMOSK, J. I dissent.\n\nA bare majority of this court have rejected fundamentals of constitutional law that have consistently guided this state in the conduct of its affairs. In lieu of those basic principles, four justices now declare that initiative promoters may obtain signatures for any proposal, however radical in concept and effect, and if they can persuade 51 percent of\n\nthose who vote at an ensuing election to say \"aye,\" the measure becomes law regardless of how patently it may offend constitutional limitations.\n\nThe new rule is that the fleeting whims of public opinion and prejudice are controlling over specific constitutional provisions. This seriously denigrates the Constitution as the foundation upon which our governmental structure is based.\n\nJames Madison, in the Federalist Papers (No. LXXVIII), wrote, inter alia, \"The interpretation of the laws is the proper and peculiar province of the courts. A constitution is, in fact, and must be regarded by the judges, as a fundamental law. It, therefore, belongs to them to ascertain its meaning, as well as the meaning of any particular act proceeding from the legislative body [or the people acting in a legislative capacity].\"\n\nCrime is indeed a serious problem of society. But it must be approached with determination and intelligence, not by destruction of the values that have made this the greatest nation on earth. A thoughtful political observer (Tom Wicker in the New York Times) has written: \"It is a good thing that neither the Bill of Rights nor the Magna Carta is the pending business of [legislative bodies] these days. . . . [In] the present mood of political panic and myopia, it would undoubtedly be voted down as a needless restraint in the war on crime.\" In the same vein, Chief Justice Warren spoke about \"straws in the wind\" that worried him, and \"which cause some thoughtful people to ask whether ratification of the Bill of Rights could be obtained today if we were faced squarely with the issue.\" (Katcher, Earl Warren (1967) p. 332.)\n\nIt is not unduly dramatic to suggest that proponents of this initiative have yielded to \"panic and myopia\" in what they describe as a \"war on crime.\" In submitting to the same fears, four justices by a stroke of their pen have obliterated a section of the California Constitution in deference to what they charitably describe as \"the extremely broad sweep of this legislation.\"\n\nArticle II, section 8, subdivision (d), is now virtually a dead letter. If an initiative that adds seven separate subdivisions to the Constitution, repeals one section of the Constitution, adds five new sections to the Penal Code and three more sections to the Welfare and Institutions Code, can be held to contain \"one subject,\" then any combination of topics under\n\nthe rubric of \"general welfare\" or \"pursuit of happiness\" can be deemed one subject. If the 12 separate subjects enumerated by the Attorney General in his ballot title of the measure can be determined to be merely one subject, then Orwellian logic has become the current mode of constitutional interpretation.\n\nIn sum, I adhere to the views on the one-subject rule expressed in my dissent in Brosnahan v. Eu (1982) 31 Cal. 3d 1, 5-14 [181 Cal. Rptr. 100, 641 P.2d 200]. I conclude that Proposition 8 fails to meet the provisions of article II, section 8, subdivision (d), of the Constitution under either the \"reasonably germane\" test of Evans v. Superior Court (1932) 215 Cal. 58 [8 P.2d 46], or the \"functionally related\" test proposed by the late Justice Manuel in Schmitz v. Younger (1978) 21 Cal. 3d 90 [145 Cal. Rptr. 517, 577 P.2d 652] and endorsed by this court in Amador Valley Joint Union High School Dist. v. State Bd. of Equalization (1978) 22 Cal. 3d 208 [149 Cal. Rptr. 239, 583 P.2d 1281].\n\nConstitutional principles, wrote Chief Justice Warren, \"are the rules of government.\" (Trop v. Dulles (1957) 356 U.S. 86, 103 [2 L.Ed.2d 630, 644, 78 S.Ct. 590].) And, added Justice Jackson, \"the great purposes of the Constitution do not depend on the approval or convenience of those they restrain.\" (Everson v. Bd. of Education (1947) 330 U.S. 1, 28 [91 L.Ed. 711, 729-730, 67 S.Ct. 504, 168 A.L.R. 1392].) Chief Justice Wright also said it well: \"A democratic government must do more than serve the immediate needs of a majority of its constituency -- it must respect the 'enduring general values' of the society. Somehow, a democracy must tenaciously cling to its long-term concepts of justice regardless of the vacillating feelings experienced by a majority of the electorate.\" (Wright, The Role of Judiciary (1972) 60 Cal.L.Rev. 1262, 1267.)\n\nThe Goddess of Justice is wearing a black arm-band today, as she weeps for the Constitution of California.\n\n\u003cspan class=\"fn\"\u003e1. See appendix for the full text of the initiative.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Section 12 of article I provided, \"A person shall be released on bail by sufficient sureties, except for capital crimes when the facts are evident or the presumption great. Excessive bail may not be required. [ para. ] A person may be released on his or her own recognizance in the court's discretion.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Proposition 8 declares that a new section 1767 \"is added to the Welfare and Institutions Code.\" However, two statutes with that identical section number already exist. (See Stats. 1981, ch. 588, § 2, No. 5 Deering's Adv. Legis. Service, p. 174, and Stats. 1981, ch. 591, § 1, No. 5 Deering's Adv. Legis. Service, p. 179.) How the new section is intended to interrelate with the preexisting statutes is not addressed in the initiative measure.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. All constitutional references are to the California Constitution unless otherwise noted.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Initially adopted as article IV, section 1c, the provision was renumbered article IV, section 22 in 1966. In 1976, it was placed in section 8 of article II as subdivision (d).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The legislative single-subject rule was initially a feature of article IV, section 25 of the Constitution of 1849. When a new Constitution was adopted in 1879, the rule was shifted to article IV, section 24, where it remained until the 1966 constitutional revision relocated it to its present position.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Initiative ballot pamphlet arguments are the equivalent of the legislative history of a legislative enactment. (People v. Knowles (1950) 35 Cal. 2d 175, 182 [217 P.2d 1]; see also Carter v. Seaboard Finance Co. (1949) 33 Cal. 2d 564, 580-581 [203 P.2d 758].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Some members of the court have suggested that the single-subject limitation applicable to initiatives (see art. II, § 8) imposes a stricter standard than that applicable to legislative enactments (see art. IV, § 9). (See dis. opn. of Manuel, J., in Schmitz v. Younger, supra, 21 Cal. 3d at pp. 98-100; conc. opn. of Tobriner, J., in Fair Political Practices Com. v. Superior Court, supra, 25 Cal. 3d at p. 50; see also conc. and dis. opn. of Mosk, J., in Brosnahan v. Eu, supra, 31 Cal. 3d at p. 9, fn. 3. But see plurality opinion in Fair Political Practices Com., supra, at pp. 40-42.) This question need not be addressed here since the initiative so clearly violates both standards.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Further, rape crisis counselors have submitted affidavits asserting that they know of rape victims who, before Proposition 8 was enacted, intended to testify against their assailants, but who now have decided not to bring charges against alleged rapists because of the passage of Proposition 8.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The Attorney General argues that this section of the initiative is intended only to guarantee protection from crime in the schools, and that, therefore, it protects \"potential\" victims. However, the language of the proposition is not so limited. It affords students and staff an \"inalienable right\" to \"safe, secure and peaceful\" schools. There is no indication that this broadly worded right was intended to protect against only one particular danger.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. It is interesting to note that the Legislature has provided further indication that it considered the changes attempted by Proposition 8 to be distinctly separate subjects. Thus, the Legislature placed on the June ballot Proposition 4, dealing with bail, and by separate enactment scuttled the Mentally Disordered Sex Offenders program. (See Stats. 1981, ch. 928, § 2, No. 6 Deering's Adv. Legis. Service, p. 586.) Clearly, these were not deemed to be interdependent or part of a single subject.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. It is said that one picture is worth more than ten thousand words. The following is ample proof of that adage. DOUBLE CLICK TO VIEW ILLUSTRATION\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Although certain constitutional amendments were adopted in 1966 \"for purposes of clarity,\" in fact they introduced a degree of ambiguity into section 9. (Cal. Const. Revision Com., Proposed Revision of Cal. Const. (1966) p. 34.) Section 9 consists of four sentences, each purportedly concerning \"[statutes].\" However, as is immediately apparent from both context and history, the word \"statute\" as used in the first two sentences means something quite different from the word as employed in the final sentences. The opening sentences use \"statute\" to signify a proposed law or bill; in the last sentences, the word refers to an already enacted law. Divided for clarity into separate sentences, section 9 provides in full as follows: (1) \"A statute shall embrace but one subject, which shall be expressed in its title.\" (2) \"If a statute embraces a subject not expressed in its title, only the part not expressed is void.\" (3) \"A statute may not be amended by reference to its title.\" (4) \"A section of a statute may not be amended unless the section is re-enacted as amended.\" A law, once enacted, is not required to have a title. Even a cursory glance through our codes indicates that our codified laws only occasionally have titles. However, a legislative bill must have a title, since \"[no] bill may be passed [by the Legislature] unless it is read by title on 3 days in each house . . . .\" (Art. IV, § 8, subd. (b), italics added.) Clearly then, the first two sentences of section 9 apply to proposed legislation, not to enacted laws. On the other hand, it would be meaningless to say that a legislative bill \"may not be amended by reference to its title\" and \"may not be amended unless [a] section [of the bill] is re-enacted as amended.\" These provisions manifestly were intended to apply to laws already on the books. That this interpretation is the correct one is confirmed by the history of section 9. Prior to the 1966 amendment, its provisions were found in article IV, section 24. That section did not contain the word \"statute\" at all. In its first two sentences, it used the word \"act,\" obviously referring to a legislative act or bill. (Legislative bills were formerly titled \"an act appropriating the sum of . . .\" or \"an act to amend an act entitled . . . .\") In the predecessors to what are now the last two sentences of section 9, former section 24 employed the words \"law\" and \"act . . . or section,\" clearly referring to already enacted provisions. The 1966 constitutional amendment replaced both \"act\" and \"law\" with \"statute.\" The change was not intended to be substantive, but merely \"for purposes of clarity.\" Unfortunately, by using one word to cover two different concepts, the 1966 amendment may have created more confusion than clarity.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. In Wallace v. Zinman, supra, 200 Cal. 585, this court held that some provisions of article IV, section 24 (the predecessor to current § 9) do apply to initiative measures. At issue in Wallace was the requirement that the initiative's subject \"shall be expressed in its title.\" (See sentence (1) of current § 9, ante, fn. 13.) Subsequently, this court held to the contrary in Prince v. City \u0026 County of S.F. (1957) 48 Cal. 2d 472, 475 [311 P.2d 544]. However, Prince failed even to mention Wallace and, in support of its conclusion, cited two prior cases which had nothing whatsoever to do with initiative measures. The United States Supreme Court granted certiorari in Prince and reversed the judgment of this court on grounds which reduced to dictum Prince's discussion of article IV, section 24. (See Speiser v. Randall (1958) 357 U.S. 513 [2 L.Ed.2d 1460, 78 S.Ct. 1332].) Wallace and Prince have each been cited once on this point since they were handed down. (See Hays v. Wood (1979) 25 Cal. 3d 772, 786, fn. 3 [160 Cal. Rptr. 102, 603 P.2d 19] [citing Wallace ]; Morris v. Priest (1971) 14 Cal. App. 3d 621, 624 [92 Cal. Rptr. 476] [citing Prince ].) It is not necessary in the present case to resolve the conflict between Wallace and Prince. As previously noted, the requirement of reenactment of amended \"statutes\" imposes restrictions on amending laws already enacted. (Ante, fn. 13.) Both Wallace and Prince dealt with the provisions of article IV, section 24 relating to the titles of proposed laws, a subject not involved in the case at bench.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Section 2 of article XVIII also permits a revision to be proposed to the electorate by a constitutional convention. Such a convention is called only after the Legislature, by a two-thirds vote, \"[submits] at a general election the question whether to call a convention to revise the Constitution\" and a majority of voters approve. (Art. XVIII, § 2.)\u003c/span\u003e\n\n",
    "body_length": 188364,
    "citedas": [
      "32 Cal. 3d 236",
      "651 P.2d 274",
      "186 Cal. Rptr. 30"
    ],
    "attorneys": "Ephraim Margolin, Michael Rothschild, Laurance Smith, Brent Barnhart, Friedman, Sloan \u0026 Ross, Stanley J. Friedman, Lawrence A. Gibbs, Morrison \u0026 Foerster, James J. Brosnahan, Linda E. Shostak, Andrew E. Monach, Christina Hall, Orrick, Herrington \u0026 Sutcliffe and Steven A. Brick for Petitioners. McCutchen, Doyle, Brown \u0026 Enersen, Richard C. Brautigam, Nanci G. Clinch, Marjorie C. Swartz, Judith Allen, Joseph J. Bell, Bonnie C. Maly, Fred Okrand, Carol Sobel, Margaret C. Crosby, Alan L. Schlosser, Amitai Schwartz, Herbert M. Rosenthal, Truitt A. Richey, Jr., Quin Denvir, State Public Defender, Charles M. Sevilla, Chief Deputy State Public Defender, Michael Millman, Deputy State Public Defender, John Gardenal and Arne Werchick as Amici Curiae on behalf of Petitioners. George Deukmejian, Attorney General, Robert H. Philibosian, Chief Assistant Attorney General, Richard D. Martland, Assistant Attorney General, Paul H. Dobson and Nelson P. Kempsky, Deputy Attorneys General, Anthony L. Miller, Richard B. Maness, William P. Yee, John J. Meehan, District Attorney, Thomas J. Orloff and William M. Baldwin, Assistant District Attorneys, for Respondents. Dobbs \u0026 Nielsen, James R. Parrinello, John E. Mueller, Marguerite Mary Leoni, John H. Hodgson II, Charles H. Bell, Jr., Ronald A. Zumbrun, John H. Findley, Joseph E. Maloney, George Nicholson, John T. Doolittle, Patrick Nolan, John K. Van de Kamp, District Attorney (Los Angeles), Harry B. Sondheim, Suzanne Person and Roderick W. Leonard, Deputy District Attorneys, Albert M. Leddy, District Attorney (Kern), Margaret E. Spencer and Francine J. Lane, Deputy District Attorneys, as Amici Curiae on behalf of Respondents.",
    "category": [
      "243",
      "75"
    ],
    "judges": "Opinion by Richardson, J., with Newman, Kaus and Reynoso, JJ., concurring. Separate dissenting opinion by Bird, C. J. Separate dissenting opinion by Mosk, J., with Broussard, J., concurring.",
    "citation_count": 3
  }
}
