{
  "id": "E6FdR2YBTlTomsSBtvx5",
  "document": {
    "title": "Wilson v. Eu",
    "full_title": "PETE WILSON, INDIVIDUALLY AND AS GOVERNOR, ETC. v. MARCH FONG EU, AS SECRETARY OF STATE, ETC., ET AL. ; ASSEMBLY OF THE STATE OF CALIFORNIA ET AL., REAL PARTIES IN INTEREST. PART I OF II",
    "jurisdiction": "California Supreme Court",
    "date": "1992-01-27T00:00:00.000Z",
    "docket": "No. S022835",
    "body": "In these mandate proceedings, we are called on to resolve the impasse created by the failure of the Legislature and Governor to adopt congressional, legislative and State Board of Equalization reapportionment plans in time for the forthcoming 1992 Primary and General Elections. (See Cal. Const., art. XXI, § 1.)\n\nOn September 23, 1991, Governor Wilson vetoed the plans submitted to him by the Legislature. On that same day, an attempted override of the\n\nvetoes failed, and the Legislature recessed for the remainder of the year. On September 25, 1991, because we lacked assurance that reapportionment plans would be validly enacted in time for the 1992 elections, this court exercised its original jurisdiction by ordering issuance of an alternative writ of mandate contemplating the drafting and adoption by this court of suitable reapportionment plans. (Wilson v. Eu (1991) 54 Cal. 3d 471 [286 Cal. Rptr. 280, 816 P.2d 1306] [hereafter Wilson I ].)\n\nIn Wilson I, we indicated it was \"appropriate that we appoint three Special Masters to hold public hearings to permit the presentation of evidence and argument with respect to proposed plans of reapportionment. [Citation.]\" (54 Cal. 3d at p. 473.) We made clear, however, that the Legislature and Governor were not foreclosed from enacting valid reapportionment statutes if they could succeed in doing so. As we stated, \"we urge the Legislature and the Governor, in the exercise of their 'shared legislative power' [citation] to enact reapportionment plans in time for the 1992 elections, and thus to render unnecessary the use of any plans this court may adopt. [Citations.] But because the impasse may continue indefinitely, because '\"it is our duty to insure the electorate equal protection of the laws\" [citation]' ..., and because California is entitled to seven additional congressional seats based on the 1990 census, we must proceed forthwith to draft such plans. [Citation.]\" (; see also at p. 474 [\"If at any time during these proceedings congressional and legislative reapportionment plans are validly enacted, this court will entertain an application to dismiss these proceedings.\"].)\n\nOn September 26, 1991, pursuant to the foregoing order in Wilson I (supra, 54 Cal. 3d 471), we appointed the Honorable George A. Brown, retired Presiding Justice of the Court of Appeal, Fifth Appellate District, the Honorable Rafael H. Galceran, retired Judge of the Los Angeles County Superior Court, and the Honorable Thomas Kongsgaard, retired Judge of the Napa County Superior Court, as Special Masters on Reapportionment (hereafter Masters), and we designated Justice Brown as Presiding Master.\n\nWilson I directed the Masters to commence public hearings within 30 days of their appointment, and to present their recommendations to this court no later than November 29, 1991. (54 Cal. 3d at p. 474.) We also called for a 30-day period of briefing and public comment following the filing of the Masters' recommendations ().\n\nOn October 23, 1991, we filed a further memorandum order approving a procedure proposed by respondent Secretary of State for the timely implementation of reapportionment plans consistent with the timetable we outlined in Wilson I, in a manner that would avoid postponing or possibly\n\nbifurcating the June 2, 1992, Primary Election. (Wilson v. Eu (1991) 54 Cal. 3d 546, 548-550 [286 Cal. Rptr. 625, 817 P.2d 890] [hereafter Wilson II ].) This procedure involved an initial, \"preliminary\" reliance by the counties and the United States Department of Justice on the Masters' recommended but unapproved plans, and a postponement or readjustment of various election deadlines. Thus, Wilson II approved postponing commencement of the period for gathering signatures in lieu of filing fees from December 27, 1991, to the filing date of our opinion herein ( at p. 549), and likewise approved directing county officials that the first day for circulating \"in lieu\" petitions, for filing declarations of intent for legislative office, and for filing declarations of candidacy and nomination papers for legislative and congressional seats, will be February 10, 1992 ( at p. 550; see also Assembly v. Deukmejian (1982) 30 Cal. 3d 638, 658, 678-679 [180 Cal. Rptr. 297, 639 P.2d 939] [approving similar readjustments of election deadlines and procedures]; Legislature v. Reinecke (1973) 10 Cal. 3d 396, 406-407 [110 Cal. Rptr. 718, 516 P.2d 6] [same]).\n\nIn addition, Wilson II approved the Secretary of State's proposal to \"direct that nomination papers be filed by each candidate 'provisionally,' subject to the submission of sufficient signatures by March 6 [, 1992], the close of the nomination period. In addition, candidates submitting in lieu signatures will have until March 16 to make up any deficiencies arising from invalid signatures. The number of needed signatures 'would be reduced proportionately to the number of days by which the circulation period was abbreviated due to the adjustment of these dates.'\" (54 Cal. 3d at p. 550.)\n\nThe Masters immediately undertook their assigned task and, on November 29, 1991, following six days of public hearings in Sacramento, San Francisco, San Diego, and Los Angeles, they filed their comprehensive Report and Recommendations (hereafter the Report) with this court, which Report (except for appendices containing maps and census tracts) is set forth as an appendix to this opinion. The Report includes plans for reapportioning legislative districts for both houses of the Legislature, congressional districts, and State Board of Equalization districts. (See Cal. Const., art. XXI, § 1.) These plans are set forth in Appendices One and Three to the Report which, as corrected by the Masters for clerical errors, are on file with the clerk of this court.\n\nAs we indicated in Wilson I, supra, 54 Cal. 3d at page 473, the Masters were directed to be \"guided by\" various standards and criteria, including the applicable provisions of the federal Voting Rights Act of 1965, as amended (42 U.S.C. § 1971 et seq.), the provisions of article XXI, section 1, of the state Constitution, and the criteria developed by an earlier panel of\n\nspecial masters for the reapportionment plans adopted by the court in 1973 (see Legislature v. Reinecke, supra, 10 Cal. 3d at pp. 402, 410-414).\n\nThe state constitutional standards for forming the new districts include (1) consecutively numbered single-member districts, (2) \"reasonably equal\" populations among districts of the same type, (3) contiguous districts, and (4) \"respect\" for the \"geographical integrity of any city, county, or city and county, or of any geographical region\" to the extent possible without violating the other standards. (Cal. Const., art. XXI, § 1, adopted in 1980.)\n\nThe criteria followed by the special masters in 1973 overlap the 1980 state constitutional standards to a large extent. We observe that none of the parties or amici curiae has suggested that any of these 1973 criteria were abrogated by the state constitutional standards. These 1973 criteria include (1) equality of population, (2) contiguity and compactness of districts, (3) respect for county and city boundaries, (4) preservation of the integrity of the state's geographical regions, (5) consideration of the \"community of interests\" of each area, (6) formation of state senatorial districts from adjacent assembly districts (\"nesting\"), and use of assembly district boundaries in drawing congressional district boundaries, and (7) reliance on the current census and on undivided census tracts. (See Legislature v. Reinecke, supra, 10 Cal. 3d at p. 402.)\n\nAs the Report explains, the Masters reviewed the evidence and arguments of the parties and other interested persons presented to them. They devoted intense efforts to comply with the federal Voting Rights Act. They considered and applied the other designated criteria governing reapportionment, and excluded such political factors as the potential effects on incumbents or the major political parties. We next review some of the highlights of their Report.\n\nA. Voting Rights Act --The Report discusses at length the Masters' close attention to the provisions of the Voting Rights Act, observing that in view of present uncertainties concerning the scope and intent of the act, the Masters \"endeavored to draw boundaries that will withstand section 2 [Voting Rights Act, 42 U.S.C. § 1973] challenges under any foreseeable combination of factual circumstances and legal rulings.\" (Report, p. 745, infra.) Their efforts, in this regard, were in part stimulated by the need to provide new districts for the forthcoming June Primary Election. In that connection, the Secretary of State in a brief filed herein urged the Masters to give the Voting Rights Act \"the highest possible consideration in order to minimize the risk of challenge and resulting delay.\"\n\nInitially, the Masters attempted to reasonably accommodate the interests of every \"functionally, geographically compact\" minority group of sufficient\n\nvoting strength to constitute a majority in a single-member district. (Report, p. 749, ; see Thornburg v. Gingles (1986) 478 U.S. 30, 50 [92 L.Ed.2d 25, 46, 106 S.Ct. 2752]; Dillard v. Baldwin County Bd. of Educ. (M.D.Ala. 1988) 686 F.Supp. 1459, 1465-1466 [stressing functional aspect of geographical compactness criterion].) In this opinion, in describing California's three major minority groups, we will employ an abbreviated version of the designations used by the 1990 United States Census, namely, Black, Hispanic Origin (hereafter Hispanic) and Asian or Pacific Islander (hereafter Asian).\n\nAs explained by the Masters, the functional aspect of geographical compactness takes into account the presence or absence of a sense of community made possible by open lines of access and communication. (Report, pp. 749-750, 763, infra.) We approve the Masters' use of such an approach in determining the compactness of a particular minority group for purposes of assuring its protection under the Voting Rights Act. As we shall see (pt. B.2., post), the Masters employed a similar functional approach in applying the \"compactness,\" \"geographical integrity,\" and related criteria for designing voting districts.\n\nAdditionally, and in a commendable abundance of caution, the Masters (1) endeavored to protect the combined voting strength of two or more minority groups in areas containing substantial numbers of such groups (Report, p. 751, ; see Campos v. City of Baytown, Tex. (5th Cir. 1988) 840 F.2d 1240, 1244 [Blacks and Hispanics treated as one minority group]), and (2) recognized the propriety of forming minority influence districts to maximize the voting potential of geographically compact minority groups of appreciable size (Report, pp. 751- 753, ; see Chisom v. Roemer (1991) 501 U.S. , , fn. 24 [115 L.Ed.2d 348, 364, 111 S.Ct. 2354, 2365]; Armour v. State of Ohio (N.D.Ohio 1991) 775 F.Supp. 1044, 1051- 1052), even though the individual minority groups involved in categories (1) or (2) were of insufficient size to constitute a majority in their voting districts.\n\nThus, within the limits of reasonable geographical compactness, the Masters consistently attempted to draw voting district lines in such a manner as to maximize the opportunities for meaningful minority participation in California elections. As the Report explains, the Masters' proposed districts avoided both unnecessary fragmentation of relevant minority groups into two or more districts and undue overconcentration of such groups in a single district (\"packing\"). (See Report, pp. 748-749, infra.) To minimize Voting Rights Act challenges based on failure to acknowledge a particular geographically compact minority group, the Masters declined to narrow the size of any minority group through application of voter registration statistics (see\n\nDickinson v. Indiana State Election Bd. (7th Cir. 1991) 933 F.2d 497, 503) or citizenship statistics (but see Romero v. City of Pomona (9th Cir. 1989) 883 F.2d 1418, 1425), although persons who had not yet attained voting age were excluded from their calculations in this regard (see at pp. 1425-1426). (Report, pp. 749-751, infra.)\n\nThe Report further details the \"special steps\" taken to assure such compliance with respect to the four California counties (Kings, Merced, Monterey and Yuba) subject to the \"preclearance\" provisions of section 5 of the Voting Rights Act (42 U.S.C. § 1973c), which require advance approval by federal authorities of redistricting plans for counties in which fewer than half the residents of voting age were registered to vote, or voted, in certain specified presidential elections. (Report, pp. 769-770, involving fn. 35, infra.) Although the Masters' plans have not yet received official preclearance from the federal government, we are confident their plans meet all applicable Voting Rights Act requirements.\n\nThe Dissent herein believes the Masters' attempts to maximize the interests of geographically compact minority groups to ensure compliance with the Voting Rights Act, may represent an unlawful use of \"racial quotas.\" (Dis. opn., post, p. 735.) In that regard, the Dissent complains the Masters' congressional plan \"destroyed four existing districts in [western] Los Angeles County and cast four experienced incumbent members of Congress into one district, the new 29th Congressional District.\" (Post, p. 738.)\n\nWe first observe that no party or amicus curiae, including the Democratic Congressional Delegation, has objected to the Masters' plan on this basis. The issue was neither briefed nor argued by anyone, including the four supposedly affected incumbents mentioned by the Dissent. Indeed, without exception, each of the 22 plans submitted by the parties and amici curiae includes elements aimed at deliberately increasing minority representation in this state.\n\nIt is true the new congressional districts in Los Angeles are not identical to the current districts, nor could they be in view of differing rates of population growth in many areas of the state. Under the Masters' plan, the western part of Los Angeles County (even though it had little population growth, unlike the eastern portion which had substantial growth in Asian and Hispanic population) still has four congressional districts that substantially overlap the current districts, and that have no incumbent other than the four members referred to by the Dissent. The new districts may or may not be drawn in a manner preferred by these incumbents, but contrary to the Dissent, the Masters' plan has not deprived them of districts in which to run.\n\nIn any event, the Masters' efforts to comply with the Voting Rights Act appear to fall well within the guidelines announced by the United States Supreme Court. (See, e.g., United Jewish Organizations v. Carey (1977) 430 U.S. 144 [51 L.Ed.2d 229, 97 S.Ct. 996] [rejecting challenge by Hasidic Jews objecting to redistricting efforts favoring Blacks].) The United Jewish Organizations case has been cited with approval in several subsequent decisions by the high court. (E.g., Metro Broadcasting v. FCC (1990) 497 U.S. 547, [111 L.Ed.2d 445, 475, 110 S.Ct. 2997] [opn. by Brennan, J.]; Richmond v. J. A. Croson Co. (1989) 488 U.S. 469, 559 [102 L.Ed.2d 854, 924-925, 109 S.Ct. 706] [dis. opn. by Marshall, J.]; Wygant v. Jackson Board of Education (1986) 476 U.S. 267, 291 [90 L.Ed.2d 260, 279-280, 106 S.Ct. 1842] [conc. opn. of O'Connor, J.]; Fullilove v. Klutznick (1980) 448 U.S. 448, 483 [65 L.Ed.2d 902, 927, 100 S.Ct. 2758] [opn. by Burger, C. J.], 497-498 [65 L.Ed.2d at pp. 936-937] [conc. opn. by Powell, J.]; University of California Regents v. Bakke (1978) 438 U.S. 265, 287 [57 L.Ed.2d 750, 769, 98 S.Ct. 2733] [opn. of Powell, J.], 355, and fn. 29 [57 L.Ed.2d at pp. 811-812] [conc. \u0026 dis. opn. of Brennan, White, Marshall and Blackmun, JJ.], 399 [57 L.Ed.2d at p. 839] [conc. opn. of Marshall, J.]; see also Garza v. County of Los Angeles (9th Cir. 1990) 918 F.2d 763, 776 [rejecting claim that deliberate creation of Hispanic majority voting district in California constituted improper \"reverse discrimination\"].)\n\nAs stated by the Ninth Circuit Court of Appeals in Garza v. County of Los Angeles, supra, 918 F.2d at page 776, \"The deliberate construction of minority controlled voting districts is exactly what the Voting Rights Act authorizes. Such districting, whether worked by a court or by a political entity in the first instance, does not violate the constitution. United Jewish Organizations v. Carey [, supra, ] 430 U.S. 144 ....\"\n\nB. Additional Criteria -- The Report carefully explains in what manner the Masters' recommended plans meet the additional reapportionment standards and criteria previously described. We briefly discuss these criteria, as follows:\n\n1. Equality of Population --As indicated in Appendix Two to the Report, the Masters' plans disclose a reasonable equality of population for the various voting districts created, including nearly absolute equality for the new congressional districts. (See Karcher v. Daggett (1983) 462 U.S. 725, 740-741 [77 L.Ed.2d 133, 147, 103 S.Ct. 2653] [population deviations for congressional districts must be justified by some \"legitimate state objective\" such as compactness or respect for municipal boundaries]; Kirkpatrick v. Preisler (1969) 394 U.S. 526, 530-531 [22 L.Ed.2d 519, 524-525, 89 S.Ct. 1225] [rejecting \"de minimis\" approach]; Wesberry v. Sanders (1964) 376\n\nU.S. 1, 7-8 [11 L.Ed.2d 481, 486-487, 84 S.Ct. 526] [requiring absolute equality \"as nearly as is practicable\"].)\n\nAs the Report observes, population equality must be deemed the primary reapportionment criterion, being mandated by the provisions of the federal Constitution. (Report, p. 761, infra.) Under the Masters' plans, each legislative district will vary by less than 1 percent from \"ideal\" equality (id., p. 770, ), while each congressional district will vary by less than 0.25 percent (id., p. 788, ). We find these minor deviations are amply justified by \"legitimate state objectives,\" namely, the need to form reasonably compact districts, to use census tracts rather than blocks in forming districts (one of the 1973 reapportionment criteria outlined in Legislature v. Reinecke, supra, 10 Cal. 3d at p. 402), and to comply with the Voting Rights Act. (Report, pp. 753-757, infra.) Indeed, the Masters' 1 percent variation limit for the Legislature is identical to the standard approved in Ater v. Keisling (1991) 312 Ore. 207 [819 P.2d 296], relied on by the Dissent herein.\n\nThe Dissent assumes that the high court's decision in Karcher v. Daggett, supra, 462 U.S. 725, requires absolute equality of districts, subject only to \"the limitations inherent in available computer technology ....\" (Dis. opn., post, p. 731.) The Dissent also adopts the argument of some members of the California Democratic Congressional Delegation that the Masters should have achieved closer population equality by dividing or \"splitting\" census tracts into individual census blocks, and allocating such blocks in an appropriate manner.\n\nAs the Dissent concedes, Karcher v. Daggett, supra, 462 U.S. 725, at pages 740-741 [77 L.Ed.2d 133 at pages 146-147], expressly recognizes that deviations from absolute equality may be justified by \"legitimate state objectives,\" and the Masters' consistent use of undivided census tracts constitutes such a legitimate objective. As the Report explains, census tracts ordinarily range from 2,000 to 6,000 persons deemed \"homogeneous as to social characteristics,\" and are bounded by \"prominent natural or manmade geographical features.\" (Report, p. 756, infra.) Census blocks, on the other hand, are actual city or suburban blocks; \"[t]he approximately 6,000 census tracts in California are made up of about 400,000 blocks.\" ()\n\nThe Report relates in detail the Masters' reasons for refusing to split census tracts, including the need to maintain geographical integrity, preserve communities of interest, and assure \"[w]idespread participation in the redistricting process\" by minority groups and others lacking the funds or equipment needed to perform more exact calculations. (Report, pp. 756-757,\n\ninfra.) Although the Dissent herein argues that the Report \"does not demonstrate how the advocacy ability of organizations representing such groups would be weakened by a division based on census blocks rather than tracts\" (dis. opn., post, p. 734), at oral argument various representatives of minority groups confirmed that they had insufficient resources to submit plans based on census blocks or to monitor the accuracy or validity of plans based on census blocks that were submitted by others. Thus, both the Mexican-American Legal Defense and Educational Fund and the Asian Pacific American Coalition indicated that the use of census blocks would adversely affect their ability to participate on a relatively equal basis in the reapportionment process.\n\nFor all the foregoing reasons, we believe the validity of the Masters' position is amply demonstrated. We find the Masters' rationale for using undivided census tracts to be both legitimate and compelling. Accordingly, we concur in the Masters' analysis of the issue.\n\n2. Contiguity, Compactness, Geographical Integrity and Community of Interest --The Report and appended maps disclose that the Masters carefully factored into their plans the additional criteria of contiguity and compactness of districts, and respect for geographical integrity and community of interests. (Report, pp. 758-763, infra.) For example, the Masters properly assumed that the state Constitution's reference to \"geographical regions\" (Cal. Const., art. XXI, § 1) referred to \"the major geographic regions of the state\" (i.e., significant mountain ranges, valleys, coastal and desert areas), and constructed the new districts accordingly. (Report, p. 762, infra.) The Report explains in what manner these additional criteria interrelate to promote effective, functional voting districts. We endorse the Masters' thesis that in designing districts, \"Compactness does not refer to geometric shapes but to the ability of citizens to relate to each other and their representatives and to the ability of representatives to relate effectively to their constituency. Further, it speaks to relationships that are facilitated by shared interests and by membership in a political community, including a county or city.\" (Ibid., fns. omitted.)\n\n3. Political Parties and Incumbent Status --In drawing voting district lines, the Masters expressly declined to consider the effects of reapportionment on political parties or incumbents. (Report, pp. 794-796, infra.) As the Report explains, such considerations were not among the criteria specified by this court in Wilson I (supra, 54 Cal. 3d 471), and are not included in the state Constitution as appropriate reapportionment criteria. (See also Legislature v. Reinecke, supra, 10 Cal. 3d at pp. 402-403.) The Masters' plans quite properly were intended to be politically nonpartisan and \"incumbent neutral.\" (Report, p. 796, infra.) Indeed, the parties and amici curiae uniformly\n\nconfirmed at oral argument that the process employed by the Masters was entirely free of political bias or intent. Only the Dissent herein has called in question the \"objectivity\" of the Masters and their distinguished staff. (See dis. opn., post, p. 738.) We discuss the matter of political neutrality further in part E.6. hereof, in connection with our analysis of the objections filed by the California Assembly.\n\nC. Other Plans Rejected --Additionally, the Masters have explained in detail in their Report why they could not recommend to the court any of the 22 statewide reapportionment plans presented to them during the course of these proceedings, including plans separately submitted by some members of the Democratic Congressional Delegation, the Assembly, the Assembly Republican Caucus, the Senate, the Governor, a special commission appointed by the Governor, and various minority or political organizations. As the Report observes, some of these plans were drafted with \"calculated partisan political consequences\" that rendered them of doubtful value to the Masters' nonpartisan efforts. (Report, p. 765, infra.) Others were deemed unacceptable because of possible noncompliance with the Voting Rights Act or apparent inattention to the criteria of contiguity, compactness and geographical integrity. (Id., pp. 764-768.) No point would be served by commenting further on the various rejected plans. It is sufficient to say that in our view none of these plans presents an acceptable substitute for those drafted by the Masters.\n\nD. Drafting Choices and Techniques --The Masters described at length the methods by which they drafted their own plans, setting forth to the extent feasible the specific reasons underlying their choices of district lines, and translating their Conclusions into legal descriptions of congressional, legislative and State Board of Equalization districts. (Report, pp. 768-794, infra.) The attached Report and its appendices speak for themselves, and we will not attempt to describe their specific contents here, except as indicated in our Discussion of various objections to the Masters' plans.\n\nE. Subsequent Objections --After the Report was presented to the court, the parties, amici curiae and other interested persons were given the opportunity to file with us briefs, letters or other communications, either objecting to or supporting the Masters' plans, in part or in whole. Many of the objections concerned the way in which the Masters resolved supposed conflicts among the various criteria in drawing district lines. Although we are not bound by the Masters' resolution of these conflicts, we have concluded that, with a minor exception discussed below, we should overrule these objections and approve the districts drawn by them. The recommended districts appear to reflect reasonable applications of the various applicable criteria.\n\nIt would be impracticable to review and discuss each specific objection lodged with us; some of these objections narrowly focus on one or two census tracts within a proposed district. Nonetheless, we offer a few observations regarding the broader objections raised by the parties, and by minority groups asserting alleged Voting Rights Act violations.\n\n1. Objections by The Mexican-American Legal Defense and Educational Fund (MALDEF)\n\na. Hispanic Districts in Los Angeles\n\nMALDEF complains that the Masters' plans failed to provide adequate numbers of Hispanic districts in Los Angeles. Yet for central and eastern Los Angeles County, the Masters' plans create six \"majority\" Hispanic assembly districts, three such senate districts, and four such congressional districts. (These figures are consistent with those that would result from the plans proposed by MALDEF.) Other new districts likewise include substantial numbers of Hispanics.\n\nThe focus of MALDEF's criticism is on Assembly Districts 45 and 46, Senate District 22, and Congressional District 30, all located in downtown Los Angeles and the Westlake area immediately to the west. Each of these districts contains more than 60 percent Hispanic population (and more than 84 percent total minority population). Unlike MALDEF's proposed plans, the Masters' plans also attempt to accommodate and maximize Asian interests in the area. At oral argument, Asian representatives praised the Masters' configuration of Senate District 22 and Congressional District 30, and objected to Assembly Districts 45 and 46 only because the Masters split the Asian population in the Westlake area. As the Masters explain in their Report (pp. 776-777, ), this split, and indeed the formation of each of these challenged districts, represent a compromise of the various minority interests in the area.\n\nb. Hispanic Assembly Districts in San Joaquin Valley\n\nMALDEF also contends the Masters should have adopted proposed plans for forming an assembly district in southern San Joaquin Valley that would have been 60 percent Hispanic by population. According to MALDEF, the Masters' two proposed districts (Assem. Dists. 30 and 31) contain an insufficient number of Hispanics.\n\nAs the Masters' Report explains (Report, pp. 774-775, ), the challenged districts were in fact constructed to \"maximize the [Hispanic] presence\" in the San Joaquin Valley, and thereby assure preclearance under\n\nsection 5 of the Voting Rights Act. (Report, p. 774, infra.) Thus, Assembly District 30 (which contains Kings County, a section 5 preclearance county) is comprised of 49.5 percent Hispanic population (and a 60 percent combined minority population), while Assembly District 31 is comprised of 52.2 percent Hispanic population (and a combined minority population of nearly 69 percent). (Id., p. 775.) By \"nesting\" the two districts, the Masters were able to produce a senate district (Sen. Dist. 16) of nearly 51 percent Hispanic population. (Id., p. 775.)\n\nThe changes proposed by MALDEF would unnecessarily divide Kern County, would risk possible challenge under section 5 of the Voting Rights Act (42 U.S.C. § 1973c) by reducing the minority percentage of the new district that includes Kings County, and would conflict with the position of the Kern County Latino Coalition, which endorses the Masters' plans in this area.\n\nc. Failure to Combine Separated Hispanic Populations\n\nMALDEF complains that the Masters' plans failed in several instances to combine into a single voting district certain separated Hispanic populations. As we previously explained, the Masters properly assumed that the Voting Rights Act would not require combining minority populations that are not \"functionally, geographically compact.\" (Thornburg v. Gingles, supra, 478 U.S. 30, 50 [92 L.Ed.2d 25, 46].) For example, the Masters were unwilling to form a district requested by MALDEF linking Hispanic populations in Santa Barbara and Oxnard by means of a narrow connecting corridor around Ventura along a mountain range separating Ventura and Ojai. (See Report, p. 778, infra.) The Masters have proposed several combinations of separated Hispanic populations where to do so would not conflict with the other reapportionment criteria, such as compactness, contiguity, and community of interests.\n\n2. Objections of Asian Pacific American Coalition\n\nRepresentatives of Asian voters (hereafter the Coalition) complain that new Assembly Districts 12 and 13, by failing to join \"Chinatown\" with the Richmond and the Sunset districts of San Francisco, divide the city's Asian population, thereby depriving Asians (who comprise approximately 29 percent of the city's population) of an opportunity to elect a legislative representative.\n\nThe Masters' Report noted the problem (pp. 771, ), but observed that San Francisco's Asian population is not concentrated in a single area, being\n\ndispersed throughout the city. Among other considerations outlined in the Report, the Masters were understandably \"unwilling to extend a long arm a block or so wide for the several miles between the Richmond district and 'Chinatown' ... in order to bring these two areas into the same district ....\" (Id., p. 771, infra, fn. 44.) Such a misshapen district seemingly would violate the \"compactness\" criterion, and is not required by the Voting Rights Act. As previously noted, the act applies only to \"functionally, geographically compact\" minority groups.\n\nSignificantly, the Masters' proposed district, combining the Richmond and Sunset districts of the city, and some southern fringe areas thereof, with the northern part of neighboring Daly City, contains approximately the same Asian population as the one considered by the Masters that included the Richmond-Sunset-Chinatown areas, with the added advantage of being \"nested,\" for purposes of forming a senate district, with an adjacent assembly district having a substantial Asian population. (Report, p. 771.)\n\nAdditionally, the Coalition complains that the Masters' plans failed to link Asian populations within Oakland, within San Jose, and within two areas of Los Angeles County. The Masters found, however, that Voting Rights Act considerations affecting Blacks and Hispanics in those areas necessitated the lines which were drawn. With respect to the area around Torrance, however, a minor change has been suggested by the Coalition (and supported in principle by the National Association for the Advancement of Colored People). This change, which we adopt, involves a modification of Assembly Districts 51 and 53 (and thus Senate Districts 25 and 28), that will substantially increase Asian population percentages in Assembly District 53, as requested by the Coalition and also will eliminate a split of Torrance city boundaries, without significantly affecting Black or Hispanic opportunities in those two districts, and without exceeding the 1 percent district population deviation adhered to by the Masters.\n\nTherefore, we adopt the following change to the Masters' plans set forth in their Report: Los Angeles County Census Tracts 2753.11, 2753.12, 2755, 2756, 2764, 2765 and 2770 are hereby included in Assembly District 51, and Census Tracts 6500.01, 6500.02, 6501.01, 6501.02, 6502 and 6503 are hereby included in Assembly District 53.\n\n3. Objections of National Association for the Advancement of Colored People (NAACP) and Congress of Racial Equality (CORE)\n\nRepresentatives of NAACP and CORE indicated no objection to the Masters' proposed congressional districts, but they suggested some changes\n\nto Senate Districts 25 and 28, and to the four assembly districts (Assem. Dists. 51, 52, 53 and 55) nested within them, to maximize Black opportunities for representation in the area.\n\nThe proposed changes would increase the number of Blacks in Assembly Districts 51 and 52 and decrease the number of Blacks in Assembly District 55. The net effect of this change would be to render it unlikely that a fifth Black member of the Assembly would be elected from south central Los Angeles County, but it would bolster the probability of retaining four Black members of the Assembly in the area throughout the decade. Although NAACP and CORE may have valid tactical reasons for seeking only four Black majority districts in the area, we believe that the Masters' decision to maximize the number of such districts was a reasonable one that was entirely consistent with the Voting Rights Act, particularly in light of the fact there are currently five Black Assembly members from this area. We also appreciate the difficulties inherent in the task of attempting to steer a middle course between unnecessary dilution of minority voters among too many districts, and overconcentration or \"packing\" minority voters into too few such districts. (See ante, p. 715.)\n\nWe also note that the relatively minor changes we have made in the Masters' proposed Assembly Districts 51 and 53, as previously discussed (ante, p. 723), constitute part of the changes sought by NAACP and CORE.\n\n4. Objections of California Democratic Congressional Delegation (DCD)\n\nDCD's brief is a copy of a brief it filed in federal district court asking that court to assume jurisdiction over the reapportionment issue. DCD raises two primary objections to the Masters' congressional plan: (1) its asserted failure to achieve sufficiently close population equality between the various proposed congressional districts, and (2) its asserted noncompliance with the Voting Rights Act.\n\nThe population equality issue is discussed at length in the Report (pp. 753-757, ). Although DCD has offered plans that assertedly have only a slight deviation from \"perfect\" equality, the federal cases allow deviations as great as or greater than those in the Masters' plans, if supported by a \"legitimate state objective.\" (See Karcher v. Daggett, supra, 462 U.S. at pp. 740-741 [77 L.Ed.2d at p. 147].) As previously indicated, the benefits of using undivided census tracts, namely, to maintain reasonable geographical integrity, preserve communities of interest, and assure full participation by minority groups in the reapportionment process, amply constitute such justification.\n\nThe Dissent herein suggests that one of DCD's proposed plans would be preferable because of the small population variance. We observe, however, that the Masters specifically found DCD's plans to be violative of article XXI of the state Constitution and its requirements of contiguity and respect for \"geographical integrity\" of county boundaries and geographical regions. (Report, pp. 766-767, infra.) Our review of the maps of DCD's submission confirms numerous instances of such violations, supporting the Masters' finding in that regard. Contrary to the assumption of the Dissent herein, these violations cannot be fairly characterized as \"trivial\" in nature (dis. opn., post, p. 735), and the DCD's proposed plans would not constitute an acceptable alternative under any circumstances. Therefore, we endorse the Masters' foregoing finding and also approve in principle the Masters' concept of functional contiguity and compactness (see Report, pp. 759-763, ).\n\nAs for asserted Voting Rights Act violations, none of DCD's claims appears meritorious. First, DCD assumes the Masters' plans are \"retrogressive\" in one respect, by making it more difficult for an incumbent Hispanic congressman (Roybal) to gain reelection in his new district (Cong. Dist. 30).\n\nAlthough DCD focuses narrowly on Congressional District 30, the Masters in fact created two Hispanic majority districts in the area now represented by Representative Roybal, and while DCD contends that the Hispanic voter registration in Congressional District 30 is somewhat lower than the Hispanic voter registration in Representative Roybal's current district, under the DCD's voter registration data the Hispanic voter registration in Congressional District 33 is considerably higher than in Representative Roybal's current district. (Significantly, the DCD presented no Hispanic voter registration statistics to the Masters, seemingly indicating DCD's initial view that such statistics were irrelevant.) Under these circumstances, no improper retrogression appears.\n\nDCD also argues that new Congressional District 32 was drawn to include substantial areas with White voters, thereby hindering Black voters from electing a representative in that area. Our review of the plans indicates the new district will have a Black population of 40.3 percent (a figure close to that in DCD's proposed district, and one that is nearly twice the percentage of Whites therein), offering Black voters a reasonable opportunity to elect a representative. Moreover, the Masters' inclusion of the White areas in question evidently was a consequence of their efforts to further benefit Black voters in two neighboring districts (Cong. Dists. 35 and 37). We think it significant that NAACP and CORE affirmatively support the Masters' proposed congressional districts, including Congressional District 32.\n\nFinally, DCD asserts that in drawing Congressional District 52, the Masters should have combined the Hispanic population in Imperial County with\n\nthe Hispanic population in Coachella Valley. Yet the Masters' proposal is nearly identical in this respect to one proposed by DCD to the Masters, and represented to them as \"faithfully complying\" with the Voting Rights Act. In any event, the Masters deemed the two Hispanic areas not sufficiently geographically compact, being separated by many miles. Significantly, MALDEF has not complained to us of the alignment that the Masters propose.\n\n5. Objections of the California Senate\n\nThe Senate's objections center around supposed Voting Rights Act violations in the Masters' plans for senate districts. Several objections repeat charges made by MALDEF or the Coalition, and were previously discussed herein. Another objection concerns the Masters' decision to include San Luis Obispo County (mostly White voters) in a district that also includes Santa Barbara County and the northern part of Ventura County. The Senate had proposed excluding San Luis Obispo and including Oxnard, to increase minority population for the district. But sustaining the Senate's objection would necessitate combining San Luis Obispo County with either Monterey County to the north, or with part of heavily Hispanic San Joaquin Valley to the east. Monterey County is subject to section 5 preclearance under the Voting Rights Act (42 U.S.C. § 1973c). In the plan presented by the Senate to the Masters, San Luis Obispo County was in fact combined with parts of the San Joaquin Valley, and included Kings County, which is also subject to section 5 preclearance. Thus, the Masters' decision was influenced in part by the necessity of ensuring that preclearance areas were likewise not linked with heavily White areas. The Masters' choice was a reasonable one under the circumstances.\n\nThe Senate complains that two Black senate districts were not better equalized, resulting in one district (Sen. Dist. 25) having less than 40 percent Black population. Yet Senate District 25 is composed of more than 35 percent Blacks, a figure represented by Black groups as sufficient for a \"majority minority\" Black district. Additionally, this new district has a combined minority population in excess of 85 percent. We approve the Masters' decision.\n\nFinally, the Senate objects to the \"splitting\" of the heavily Hispanic City of Santa Ana in Orange County. The Masters' plan does split the city, but in a manner that enhances Hispanic population in the resulting senate and assembly districts. Again, MALDEF has not complained to us of the Masters' choice, and we endorse it here.\n\n6. Objections of the California Assembly\n\nThe Assembly's primary objection to the Masters' plans is their asserted failure to achieve a \"politically fair\" reapportionment. The Assembly predicts substantial election gains by the Republican Party as a direct result of the new district lines. According to the Assembly, political \"fairness\" could best be achieved by adopting the plans drafted by them, and vetoed by the Governor.\n\nAs we have previously indicated, we unqualifiedly approve the Masters' decision to devote their attention exclusively to the standards and criteria established by the Voting Rights Act, the state Constitution, and our prior opinion in Legislature v. Reinecke, supra, 10 Cal. 3d 396, 402-403.\n\nIn any event, the Assembly's major premise of political unfairness is subject to substantial question, being based on a dubious analogy to the results of the 1990 gubernatorial election, and on voter registration statistics of similarly doubtful utility. \"Political fairness,\" as the term is used by the Assembly, is based on an appraisal of a political party's chances in future elections. Yet predictions of future election contests are quite obviously speculative and imprecise, involving the weighing of countless variables. We think redistricting plans that comply with the federal Voting Rights Act and follow the various state standards and criteria outlined above, rather than seek to maintain the status quo or preserve or enhance the political power of any party, will necessarily produce plans at least as \"fair,\" politically or otherwise, as vetoed ones that \"are at best truncated products of the legislative process.\" (Legislature v. Reinecke (1972) 6 Cal. 3d 595, 602 [99 Cal. Rptr. 481, 492 P.2d 385].)\n\nThe Assembly additionally suggests some \"minor changes\" in the Masters' plans that assertedly would avoid certain \"splits\" of city boundaries necessitated by the Masters' use of undivided census tract data. (See Report, pp. 754-757, infra.) We decline the Assembly's offer, which would require us to deviate from the Masters' express policy to avoid splitting census tracts. (One of these \"minor\" changes proposed by the Assembly, and supported by the Dissent herein, involves removing a slight division of the boundaries of Vallejo and Fairfield, necessitated by the Masters' use of undivided census tracts. We reject this proposed change because it likewise would involve splitting census tracts.)\n\n7. Objections of the State Board of Equalization (Board)\n\nThe Board's primary argument is that the Masters' plan does not adequately protect minority interests in the area of proposed Board District 4\n\nby creating a minority influence district of sufficient strength. The Board suggests that an Asian incumbent Board member (Fong, a Republican) may be unable to prevail in this new district. Yet the Masters' proposed district has a majority of combined minorities, and indeed a higher percentage of minorities than the Board's proposal.\n\nAlthough the Board criticizes the Masters' plan for failing to construct the district so as to exclude the residence of another incumbent member (who is White), the Masters followed a consistent policy of not considering the residences of incumbents in drawing district lines, and we do not believe that policy violates the Voting Rights Act, particularly in these circumstances.\n\nFinally, the Masters noted that the Board's proposed plan would split three counties, whereas the Masters' plan splits only one. (Report, p. 794, infra.)\n\n8. Other Objections\n\nMost of the other objections filed with us involve requests to modify individual districts to benefit particular groups, incumbents or candidates. Both policy and practical considerations inhibit us from granting these requests.\n\nFor example, over the objection of the Dissent herein, we have denied several requests to renumber senate districts for the apparent benefit of incumbents whose chances of reelection presumably would be improved or terms of office lengthened as a result of the requested changes. (Even-numbered senate districts are not scheduled for election until 1994, whereas odd- numbered districts are scheduled for 1992.) Contrary to the Dissent's assumption, such accommodations involve more than \"simply\" renumbering a few districts. The effects of granting these requests, to which we have received strong opposition, are far reaching, favoring incumbent legislators at the expense of their challengers, and partially disenfranchising substantial numbers of \"odd-numbered district\" voters who otherwise would be entitled to vote for senatorial offices in 1992. Granting these requests would be wholly out of place in \"incumbent neutral\" redistricting plans.\n\nAs for individual requests to modify particular district lines, our language in Legislature v. Reinecke, supra, 10 Cal. 3d at page 403, seems pertinent here: \"Any attempts that we might now make to redraw the specific district lines to achieve possibly more reasonable results would run the serious risk of creating undesirable side effects which we could not foresee and which adversely affected parties could not call to our attention in time for corrections to be made. Moreover, that risk would necessarily be magnified by the\n\nfact that we are not in as advantageous a position as the Masters were in to assess the impact of possible alternatives.\"\n\nF. Conclusion -- The Masters, their staff and their consultants conducted an intensive study of this matter, attempting to adhere, to the greatest extent possible, to the Voting Rights Act and the other reapportionment standards and criteria specified by this court in Wilson I, supra, 54 Cal. 3d 471. Although the Masters were not previously aware of the specific objections that have been made in this court to their plans, they were fully cognizant of similar objections made to the various plans submitted by the Legislature, the Governor, and the independent commission appointed by the Governor.\n\nIn performing their task, the Masters and their staff developed an expertise in the art of reapportionment that is reflected in the plans they have recommended to us. We specifically endorse the Masters' analyses and recommendations regarding the proper weight and application of the various reapportionment criteria. Although we likewise approve the Masters' interpretation and application of the Voting Rights Act, we acknowledge that any questions arising thereunder are essentially ones of federal law, and that any definitive answers to these complex questions ultimately must be provided by the United States Supreme Court. We are satisfied that, by reason of the Masters' successful efforts to maximize the actual and potential voting strength of all geographically compact minority groups of significant voting age population, a federal Voting Rights Act challenge would lack merit.\n\nIn short, we have examined the Masters' plans in light of the applicable criteria and the various objections thereto, and we conclude that in each case, with minor modifications previously discussed, the lines drawn represent reasonable applications of the recommended criteria. Accordingly, except as set forth ante, at page 723 hereof, we accept and adopt each of those plans.\n\nAs indicated in Wilson II, supra, 54 Cal. 3d at pages 548-550, respondent Secretary of State has urged us to announce our plans for reapportionment no later than January 28, 1992, in order to avoid the expense and confusion arising from a possible delay in holding the primary election. For that reason, and consistent with prior precedent, we have made our decision adopting the Masters' plans final forthwith. (See Assembly v. Deukmejian, supra, 30 Cal. 3d at p. 679; Legislature v. Reinecke, supra, 10 Cal. 3d at p. 407.)\n\nWe accept the Masters' recommendation to release to the University of California Institute of Governmental Studies in Berkeley, for safe storage, cataloging, and use by the public and scholars, all pertinent materials heretofore lodged with the Masters.\n\nAs in Legislature v. Reinecke, supra, 10 Cal. 3d at page 407, we have no reason to believe any of the parties to these proceedings will fail to accede to our holding herein, and accordingly no purpose is served by issuing a writ of mandate. The alternative writ of mandate heretofore issued is discharged, and the petition for writ of mandate denied. Each party will bear its own costs.\n\nOur judgment is final forthwith.\n\nPanelli, J., Kennard, J., Arabian, J., Baxter, J., and George, J., concurred.\n\nDisposition\n\nAs in Legislature v. Reinecke, supra, 10 Cal. 3d at page 407, we have no reason to believe any of the parties to these proceedings will fail to accede to our holding herein, and accordingly no purpose is served by issuing a writ of mandate. The alternative writ of mandate heretofore issued is discharged, and the petition for writ of mandate denied. Each party will bear its own costs.\n\nI Dissent. The court should forthrightly reject the fatally flawed proposal of the masters.\n\nI.\n\nIn Karcher v. Daggett (1983) 462 U.S. 725, 732 [77 L.Ed.2d 133, 142, 103 S.Ct. 2653] (hereafter Karcher), the United States Supreme Court declared, \"As between two standards--equality or something less than equality--only the former reflects the aspirations of Art. I, § 2\" of the federal Constitution.\n\nNevertheless, the masters here rejected a reapportionment plan submitted by a congressional delegation that achieved almost perfect population equality in congressional districts--remarkably, a deviation of no more than 9 persons from the ideal population of 572,308. Instead, the masters opted for their own plan, which proposes a deviation 310 times larger, i.e., 2,797 persons.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nIt belabors the obvious to point out that a deviation of 9 is substantially closer to the equality required by Karcher than 2,797.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nEven larger maximum deviations mark the masters' scheme for assembly and senatorial districts. Their assembly districts vary by approximately 6,715 persons and their state senate districts vary by approximately 7,440 persons.\n\nMy colleagues accept the foregoing malapportionment without serious question--more, I hope, out of expediency than conviction. Unfortunately the result will haunt the people of California for a decade.\n\nAs will appear, the rationale of the masters for rejecting a plan that has a deviation of only 9 persons per congressional district and proposing a plan that permits a deviation approximately 310 times larger is related to the distinction between using census blocks and census tracts. Using census blocks, declare the masters, is expensive and time-consuming, thus compelling some groups to rely on less precise methods.\n\nWith due respect to the masters' intent, I find that to be a lame excuse for rejecting the one plan that achieves equality of representation for the next decade. Methods of reapportioning have improved over the years, primarily because of the development of technology. That every citizen or group may not yet have easy access to the latest technology does not justify ignoring its benefits. If every advance in science had been rejected until it was universally available, we would still be writing with quill pens.\n\nII.\n\nWith regard to the drawing of congressional district lines, I conclude that the majority reach an unconstitutional result and therefore Dissent on that point. I begin with a constitutional analysis of the question before us, and then apply it to the process of redistricting the masters undertook.\n\nA.\n\nWhether the standard to be applied to the apportionment of districts among federal representatives is grounded in article I, section 2, of the United States Constitution (Karcher, supra, 462 U.S. 725) or in the equal protection clause thereof ( at pp. 747, 762 [77 L.Ed.2d at pp. 152- 153, 162] [conc. opn. by Stevens, J.]), we must apply the standard the federal high court set forth in that case.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nThe Karcher court reiterated the rule that article I, section 2, of the federal Constitution \" 'permits only the limited population variances which are unavoidable despite a good-faith effort to achieve absolute equality, or for which justification is shown.' \" (462 U.S. at p. 730 [77 L.Ed.2d at p. 140], italics added.) It is fair to read Karcher as requiring that only the limitations inherent in available computer technology may stand between a constitutional requirement of absolute equality--that is, zero deviation from district to district--and whatever small number approaching zero current technology may afford. ( at pp. 732-733 [77 L.Ed.2d at pp. 141-142].)\n\nCertain state interests may, however, justify slight departures from the constitutional mandate of absolute equality. The Karcher court established a\n\ntwo-part test: \"First, the court must consider whether the population differences among districts could have been reduced or eliminated altogether by a good-faith effort to draw districts of equal population. Parties challenging apportionment legislation must bear the burden of proof on this issue, and if they fail to show that the differences could have been avoided the apportionment scheme must be upheld. If, however, the plaintiffs can establish that the population differences were not the result of a good-faith effort to achieve equality, the State must bear the burden of proving that each significant variance between districts was necessary to achieve some legitimate goal.\" (462 U.S. at pp. 730-731 [77 L.Ed.2d at pp. 140-141], italics added.) Such legitimate goals include but are not limited to \"making districts compact, respecting municipal boundaries, preserving the cores of prior districts, and avoiding contests between incumbent Representatives. ... The State must, however, show with some specificity that a particular objective required the specific deviations in its plan, rather than simply relying on general assertions. The showing required to justify population deviations is flexible, depending on the size of the deviations, the importance of the State's interests, the consistency with which the plan as a whole reflects those interests, and the availability of alternatives that might substantially vindicate those interests yet approximate population equality more closely.\" ( at pp. 740-741 [77 L.Ed.2d at p. 147].)\n\nJustice Stevens's Concurring opinion in Karcher adopted a somewhat different approach: if \"the plan embodies deviations from population equality that have not been justified by any neutral state objective, it cannot stand.\" (462 U.S. at p. 765 [77 L.Ed.2d at p. 164], italics added.)\n\nB.\n\nThe masters' Report does not set forth any criterion that, under the language of the majority opinion in Karcher, supra, 462 U.S. 725, or that of Justice Stevens, justifies the masters' departure from the constitutional requirement of exact equality to the extent technologically possible.\n\nThe masters' Report concedes that the deviation in the size of the populations of the least and most populous congressional districts is 0.49 percent, whereas an alternative plan would permit a deviation of only 9 persons, or \"almost perfect population equality.\" (Report, p. 755, infra.) The Report declares in conclusory fashion that the greater deviation meets the requirements of the federal Constitution as elucidated in recent United States Supreme Court decisions. The majority in turn draw on the Report to conclude, without substantial Discussion, that the federal cases do not require closer equality and \"allow deviations as great as or greater than those in the\n\nMasters' plans, if supported by a 'legitimate state objective.' \" (Maj. opn., ante, p. 724.)\n\nI submit that the devil lies in the details of the majority's analysis. The majority appear to concede that because the reapportionment plan the court approves today violates the constitutional mandate of absolute equality, \"the State must bear the burden of proving that each significant variance between districts was necessary to achieve some legitimate goal.\" (Karcher, supra, 462 U.S. at p. 731 [77 L.Ed.2d at p. 141].) None of the justifications advanced by the majority in their ratification of the report, however, withstands scrutiny under the tests advanced by Karcher.\n\nThe Report's justification for inexactitude is founded on a \"policy\" (Report, p. 756, ) of utilizing census tracts rather than census blocks as the smallest indivisible units. \"The plans submitted to us with near-zero population deviations are based on census 'blocks' instead of tracts. Formulating districts on a block basis is enormously expensive. ... The approximately 6,000 census tracts in California are made up of about 400,000 blocks. The cost of [computer hardware], software, and experts to deal efficiently with this greater amount of data is exponentially higher than a comparable system in which the bulk of the redistricting work is done by census tracts. Indeed, the cost would be prohibitive for any private person or group having resources short of those available to the Legislature.\" (Ibid., fn. omitted.) \"The Assembly, our staff [were] told, uses a mainframe computer at the California Institute of Technology. It has, we are sure, enormous capabilities ....\" (, p. 756, infra, fn. 15.)\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nThe Report's footnote 15 conjures up a vision of white-coated scientists earnestly hovering about the whirling tape drives of a massive mainframe computer in a dimly lit room. But I remain unawed. As early as 1982, when computer technology was many orders of magnitude less advanced, and less powerful per dollar spent, than it is today,\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e a three-Judge panel criticized an Ohio reapportionment plan's reliance on the use of census tracts rather than census blocks. (Flanagan v. Gillmor (S.D.Ohio 1982) 561 F.Supp. 36, 42,\n\naffd. sub nom. Flanagan v. Brandon (1984) 467 U.S. 1223 [81 L.Ed.2d 869, 104 S.Ct. 2672] (mem. opn.).)\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nLast year, as explained in Ater v. Keisling (1991) 312 Ore. 207 [819 P.2d 296], the Oregon Secretary of State, adopting a guideline to \"Aim for the ideal of zero population variance\" along with seven other goals similar to the masters' here, apparently had no financial or significant technological difficulty using Oregon's 108,000 census blocks--fully one-quarter as many as California's, in a state with far fewer financial resources than our own--at public hearings and as \"building blocks\" for his reapportionment plan. (819 P.2d at pp. 301-302, 304.)\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e In light of Flanagan, Ater, and the United States Constitution's mandate to achieve absolute equality to the extent technologically possible (Karcher, supra, 462 U.S. at pp. 732-733 [77 L.Ed.2d at p. 142]), I cannot accept the Report's claim of technological and financial limitations as constitutionally valid criteria for deviating from the equality requirement.\n\nSecond, the Report also asserts that \"the result of insisting on an exactitude that requires formulation of districts by census blocks, instead of tracts, would be to limit the ability of many groups, including those representing minority voters, to participate meaningfully in the reapportionment process by presenting alternate redistricting plans ....\" (Report, p. 757, infra.)\n\nI agree that the right of minority and other groups to participate in the reapportionment process is important. But the Report does not demonstrate how the advocacy ability of organizations representing such groups would be weakened by a division based on census blocks rather than tracts. The Report's statement that a block-based reapportionment will disadvantage groups with fewer resources is mere speculation, and is belied by Ater v. Keisling, supra, 819 P.2d 296. In Ater, groups of two, six, and twenty\n\nindividuals were able to complain of unfairness or error in the census-block-based 1991 Oregon reapportionment process. (See at pp. 302, 305.) There is no evidence that a census- block-based reapportionment plan in California would permit any less citizen input than one based on tracts, and the Oregon experience demonstrates the contrary.\n\nThe Report's third justification for the constitutionally suspect use of census tracts is that such tracts are \" 'homogeneous as to social characteristics and ... use prominent natural or manmade geographical features as boundaries.' \" (Report, p. 756, infra.) But if blocks are subdivisions of tracts , these qualities logically inhere even more strongly in the blocks than in the tracts. I suspect most people know, and have more in common with, more persons in their own block than in places many blocks away that happen to be in their tract.\n\nIn sum, the Report demonstrates no legitimate ground for departing from the United States Supreme Court's mandate that California realign its congressional districts with the least deviation in population equality that is technologically possible. Thus I conclude that the majority's ratification of the Report achieves an unconstitutional result.\n\nIII.\n\nNo plan, however devised, is perfect. There may be other problems with the proposal of the congressional delegation. If so, any such weaknesses should have been considered on the merits. The masters did raise a few such points, but the defects were trivial when compared with the desirability of achieving equality of representation.\n\nThe masters, although undoubtedly acting in good faith, basically misconstrued their mission. Under California precedent and the federal Voting Rights Act of 1965, as amended (42 U.S.C. § 1971 et seq.), their function was to draw geographical lines in such a manner as to prevent a discriminatory voting pattern against any or all minority groups. Unfortunately in some significant instances the masters apparently believed they could perform their duty only by the affirmative use of racial quotas.\n\nThe Voting Rights Act provided nothing new for California. We have consistently prohibited discrimination. (See, e.g., People v. Wheeler (1978) 22 Cal. 3d 258 [148 Cal. Rptr. 890, 583 P.2d 748].) However, racial quotas have been declared improper in California (Bakke v. Regents of University of California (1976) 18 Cal. 3d 34 [132 Cal. Rptr. 680, 553 P.2d 1152]) and by the United States Supreme Court (University of California Regents v. Bakke\n\n(1978) 438 U.S. 265 [57 L.Ed.2d 750, 98 S.Ct. 2733]). While most cases have dealt with education and employment, there is no authority for the use of racial quotas in reapportionment.\n\nThe masters referred over and over to the federal Voting Rights Act of 1965, as amended (42 U.S.C. § 1971 et seq.). That legislative enactment was obviously aimed at states, mainly in the South, that sought directly or indirectly to disenfranchise minorities or to curtail their potential political influence. It is obvious that such an enactment was unnecessary for California, and in some respects it may be counterproductive.\n\nAs the United States Supreme Court declared in Gaffney v. Cummings (1973) 412 U.S. 735, 754 [37 L.Ed.2d 298, 312, 93 S.Ct. 2321], the basic test is whether \"racial or political groups have been fenced out of the political process ....\"\n\nThe masters and the majority opinion refer to Thornburg v. Gingles (1986) 478 U.S. 30 [92 L.Ed.2d 25, 106 S.Ct. 2752]. Of course I am in general agreement with the analysis of Justice Brennan for the court in that case, and particularly with his reliance not only on the text of the Voting Rights Act but also on the Senate Judiciary Committee report that accompanied the measure as it was considered by Congress. As explained in the court's opinion, the report elaborated on seven circumstances that might be probative of violations of the Voting Rights Act ( at pp. 36-37 [92 L.Ed.2d at p. 38]). On consideration, however, I do not believe that any one of those seven categories is applicable to California.\n\nWe need not be reminded of California's traditional acceptance in the political arena, in modern times, of all persons regardless of ethnicity. That has been evident not only in the voting process, but also in candidacies and election to high office. Without preferential entitlement, this state elected an Asian as a United States Senator. A Black was elected Lieutenant Governor. An Asian has been elected and consistently reelected as Secretary of State. Asians, Blacks and Hispanics have been elected to Congress. Blacks and Asians have been elected mayors of our largest cities. Many minorities have been elected to both houses of the state Legislature, including a Black as Speaker of the Assembly, and innumerable others have been elected to local boards of supervisors, city councils and judicial offices.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nAll this confirms that California--while not achieving perfection--has demonstrated maturity in matters of ethnicity in elections without the need\n\nfor racial quotas, preferences or special entitlements. Indeed, to inflict racial quotas on our state today is not merely unnecessary, it is demeaning. What is perhaps worse, quotas are likely to set the outer limits of racial accomplishment.\n\nQuota has become a pejorative term, and the masters would probably deny they intended to invoke it. But their own Report, in respect to Los Angeles, the state's most populous county, inadvertently reveals their curious apportioning technique. In a classic example of the tail wagging the dog, the masters described their process: \"Having first constructed Latino and African-American congressional and state legislative districts, which occupied a considerable part of the middle of the south-central and eastern parts of the county, the remainder of the districts allocated to Los Angeles County had to be constructed around the periphery; in some instances they became rather elongated.\" (Report, pp. 769-770, , italics added, fns. omitted.) In short, the masters satisfied the minority-based quota of congressional districts first, and only thereafter relegated to the majority whatever odd-shaped area was left over.\n\nOverlooked in all this was the admonition of Justice Stevens in Karcher, supra, 462 U.S. at page 748 [77 L.Ed.2d at page 153]: if the rules \"serve no purpose other than to favor one segment--whether racial, ethnic, religious, economic, or political ... they violate the constitutional guarantee of equal protection.\"\n\nAlthough Chief Justice Burger wrote as a Dissenter in United Jewish Organizations v. Carey (1977) 430 U.S. 144, 186-187 [51 L.Ed.2d 229, 259, 97 S.Ct. 996], his thoughtful opinion in that case deserves our consideration: \"The result reached by the Court today in the name of the Voting Rights Act is ironic. The use of a mathematical formula tends to sustain the existence of ghettos by promoting the notion that political clout is to be gained or maintained by marshaling particular racial, ethnic, or religious groups in enclaves. It suggests to the voter that only a candidate of the same race, religion, or ethnic origin can properly represent that voter's interests, and that such candidate can be elected only from a district with a sufficient minority concentration. ... The notion that Americans vote in firm blocs has been repudiated in the election of minority members as mayors and legislators in numerous American cities and districts overwhelmingly white. Since I cannot square the mechanical racial gerrymandering in this case with the mandate of the Constitution, I respectfully Dissent ....\"\n\nAs long ago as 1882, courts made it clear that reapportionment must be objectively undertaken. \"Questions of religion, politics, or nativity should\n\nnot be considered in the formation and alteration\" of districts, wrote the Wisconsin Supreme Court in State v. Whitford (1882) 54 Wis. 150 [11 N.W. 424, 427]. The Supreme Court of Nebraska cited Black's Law Dictionary (4th ed.) at page 816, for the basic proposition that gerrymandering is a \" 'name given to the process of dividing a state or other territory into the authorized civil or political divisions, but with such a geographical arrangement as to accomplish a sinister or unlawful purpose ....' \" (Nickel v. School Board of Axtell (1953) 157 Neb. 813 [61 N.W.2d 566, 570].)\n\nThe term \"gerrymandering\" has generally been applied to the creation of new districts. In this instance California is entitled to a number of new congressional seats. Yet the masters, instead of deftly adding districts to those in existence, destroyed four existing districts in Los Angeles County and cast four experienced incumbent members of Congress into one district, the new 29th Congressional District. That all four members were Democrats arouses understandable suspicion as to objectivity. Certainly it has a \"most dramatic impact ... on Los Angeles' Westside.\" (L. A. Times (Jan. 3, 1992) p. B3.)\n\nIf adding districts in an unfair manner is deemed gerrymandering, what we have here--eliminating four districts in an unfair manner--may be deemed reverse gerrymandering. It is equally unacceptable. As noted above, it is also clearly in violation of two of the Supreme Court's declared goals for fair reapportionment: \"preserving the cores of prior districts, and avoiding contests between incumbent Representatives.\" (Karcher, supra, 462 U.S. at p. 740 [77 L.Ed.2d at p. 147].)\n\nThe only explanation of the majority is disingenuous: there were no formal objections filed on this basis. (Maj. opn., ante, p. 716.) They obviously misinterpret our duty: it is not to abjectly accept an unsupportable recommendation if not formally opposed. Our responsibility is to examine every aspect of the masters' report and approve it, modify it or reject it--even if not a single objection had been filed.\n\nIt may be inevitable that after a decennial reapportionment occasionally two incumbent legislators will find themselves in the same reconstructed district. But never in the history of California--or in any other state of which I am aware--have four members of Congress been reapportioned into the same district. If California had lost congressional seats as a result of the census perhaps some strained rationalization for this outcome could be conceived. But we gained seats. The masters' distorted result is thus indefensible.\n\nIV.\n\nHow arbitrarily--or expediently--the majority have rubber- stamped the scheme submitted by the masters is illustrated by their refusal to accommodate several legislators who requested, not that district lines be significantly altered, but that some districts merely be given different numbers. To simply renumber Senate Districts 16 and 17, 20 and 23, 27 and 30, would not seem to be a problem of major proportion. Indeed, as the Republican Senate Floor Leader has pointed out, the changes would probably result in avoiding costly special elections in two districts. I would have granted the requests.\n\nI would add one additional correction. To comply with the constitutional mandate that city boundaries be respected when possible (Cal. Const., art. XXI, § 1, subd. (e)), I believe we are compelled to grant the request of the cities of Vallejo and Fairfield to render the boundaries of proposed Assembly Districts 7 and 8 and Senate Districts 2 and 4 coterminous with the cities of Vallejo and Fairfield. (See City of Vallejo Res. No. 91-796 (Dec. 17, 1991) and City of Fairfield Res. No. 91-343 (Dec. 17, 1991), both unanimously adopted.) The masters' recommended plan would place 4.65 percent of the residents of Fairfield in Assembly District 7 and Senate District 2, and 5.04 percent of the residents of Vallejo in Assembly District 8 and Senate District 4. This unnecessary line-drawing will deny those residents placement in the same legislative districts as their fellow citizens. The court could make the requested changes by moving two census tracts from proposed Assembly District 7 to Assembly District 8, and by moving part of two census tracts from proposed Assembly District 8 to Assembly District 7.\n\nV.\n\nSince I am Dissenting, I need not suggest a precise order. However, I believe we have several options. (1) We can undertake appropriate changes in the masters' plan and do so promptly; (2) we can remand the matter to the masters for reconsideration and a new plan and, if necessary, order postponement of the date now set for filing and even delay the primary election itself; (3) we can remand the entire issue of reapportionment to the Legislature, where it belongs. The latter option would require use of existing assembly and senate districts for the 1992 election, and adoption of the masters' flawed plan for congressional districts only for 1992 in order to obtain the benefit of the state's added representation. There may be other possibilities or variations of the foregoing.\n\nVI.\n\nApparently what goes around comes around. In 1982 I joined Justice Richardson in Dissenting from a reapportionment opinion that unfairly benefited Democrats. (Assembly v. Deukmejian (1982) 30 Cal. 3d 638, 693 [180\n\nCal. Rptr. 297, 639 P.2d 939] (conc. \u0026 dis. opn. by Mosk, J.).) Now 10 years later, I must Dissent from a result that unfairly benefits Republicans. My observations a decade ago seem prescient:\n\n\"One need not be a cynic to detect the hypocrisy in the political gamesmanship known as reapportionment. Whichever party is in power immediately following the decennial census inevitably undertakes the task with a view to its self-preservation, and the opposition cries foul. The reality is that neither party has a monopoly on virtue. As a result, every 10 years hereafter we may be compelled to endure a gubernatorial veto ... and to that extent the legislative and political processes of this state will become periodically impotent.\n\n\"At present the courts can do little to prevent this decennial debacle. Justice Frankfurter clearly saw the issue and the restricted role of the judiciary nearly four decades ago. In Colegrove v. Green (1946) 328 U.S. 549, 554 [90 L.Ed. 1432, 1435, 66 S.Ct. 1198], he observed that 'The one stark fact that emerges from a study of the history of ... apportionment is its embroilment in politics, in the sense of party contests and party interests.' He concluded (328 U.S. at p. 556 [90 L.Ed. at p. 1436]) that ' Courts ought not to enter this political thicket. The remedy for unfairness in districting is to secure State legislatures that will apportion properly .... The Constitution has left the performance of many duties in our governmental scheme to depend on the fidelity of the executive and legislative action and, ultimately, on the vigilance of the people in exercising their political rights.'\n\n\"Although it is not the responsibility of the judiciary to solve this essentially political problem, I cannot resist suggesting that a better solution to achieving equitable reapportionment must be found if the people of California are to be served effectively. What that solution should be is beyond my ken. But the wrenching experiences of 1971 and 1981 [and now 1991] indicate the people and their representatives should tarry no longer in seeking an answer.\" (30 Cal. 3d at pp. 693-694, italics added.)\n\nI hope we do not have to wait until 2001.\n\nAPPENDIX id Recommendations of Special Masters on Reapportionment\n\nI. Introduction\n\nA. Procedural History\n\nThe Special Masters (Masters) appointed by the court in this case were directed as follows:\n\n\"In light of the acknowledged necessity of affording all interested parties an opportunity to be heard in such matters [i.e., the process of redistricting], it is appropriate that we appoint three Special Masters to hold public hearings to permit the presentation of evidence and argument with respect to proposed plans of reapportionment. (See Legislature v. Reinecke (1973) 9 Cal. 3d 166, 167 [107 Cal. Rptr. 18, 507 P.2d 626] [ Reinecke III ].) We will expeditiously select and appoint these Masters, and they will be guided by the procedures and criteria developed by an earlier panel of Masters for the reapportionment plans adopted by this court in 1973 (see [ Legislature v. Reinecke (1973)] 10 Cal. 3d [396,] 402, 410- 414 [110 Cal. Rptr. 718, 516 P.2d 6] [ Reinecke IV ]), as well as by the provisions of article XXI, section 1 of the state Constitution.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003ea In addition, the Masters will consider the application of federal law, including the Voting Rights Act [of 1965] (42 U.S.C. § 1971 et seq.).\n\n\"Following the hearings, the Masters will file their report and recommendations for possible adoption of reapportionment plans which will provide for 52 single-member congressional districts, 40 single-member Senate districts, 80 single-member Assembly districts, and 4 State Board of Equalization districts. The Masters shall set forth the criteria underlying the plans they recommend for adoption and the reasons for their recommendations.\" (Wilson v. Eu (1991) 54 Cal. 3d 471, 473 [286 Cal. Rptr. 280, 816 P.2d 1306].)\n\nUpon appointment, the Masters held organizational meetings and, with court approval, employed a staff and retained consultants to assist in their work.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003ea Rules to govern the conduct of the public hearings and the submission of oral and written presentations were adopted. Hearings were scheduled in Sacramento, Los Angeles, San Diego and San Francisco, and written\n\nnotice of the hearings was given the parties to the actions and to others. A press release giving the times, places and purposes of the hearings was distributed statewide to the wire services, the major newspapers, and radio and television stations.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003ea\n\nThereafter, public hearings were held in the various cities, as scheduled, at which oral presentations were made.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003ea Participating in one or more of the hearings were counsel for the parties or for other persons, organizations or political subdivisions, and individuals appearing on their own behalf or as representatives of groups, organizations, cities and counties. Exhibits used in support of those presentations were appropriately marked and made a part of the record. In addition to these materials, the Masters reviewed excerpts of transcripts of 12 public hearings held by the Senate from December 1990 to September 1991 on the subject of Senate and congressional redistricting.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003ea\n\nIn our deliberations, we have been fully aware of the written presentation submitted by the Secretary of State, dated October 18, 1991, stressing the importance of timely action by the Masters. We especially note her statement on page 5, as follows:\n\n\"[I]t is absolutely essential that federal constitutional and federal Voting Rights Act requirements receive the highest possible consideration in order to minimize the risk of challenge and resulting delay. In terms of drawing lines, any doubts with respect to compliance with constitutional and federal law should be resolved in favor of that alternative most likely to avoid a challenge. ...\n\n\"To the extent it is possible to comply with the criteria requiring that census tracts be used, that districts be contiguous and compact, that they respect city and county boundaries, that they recognize geographic regions, and that they combine Assembly districts to comprise State Senate districts, it will facilitate implementation. However, these must yield to considerations of appropriate population parities and Voting Rights Act requirements which cannot be compromised for any reason.\"\n\nWe believe that, to the maximum extent possible, we have addressed the Secretary of State's concerns.\n\nThe oral and written presentations covered a wide range of subjects. Twenty-two statewide plans were submitted (including three for the State Board of\n\nEqualization). Much of the testimony in support of a particular plan was designed to demonstrate why that plan was superior to other plans, almost all of which were the subject of criticism by one or more participants.\n\nBoth written and oral presentations concerned interpretations of the Voting Rights Act of 1965 (42 U.S.C. § 1971 et seq.), with each of the parties contending that its plan was fully consistent with the act, as interpreted in various court opinions. The interaction between the act, state constitutional provisions, and the Reinecke IV requirements were discussed variously and at length.\n\nSeveral witnesses (primarily those representing the Latino Coalition) urged the Masters to adjust the census figures underlying the redistricting to offset the alleged undercount of certain minority groups; in each case, the parties were advised that, while we understood the nature of the request, we had no authority to make such an adjustment. Since we are under the court's direction to follow the Reinecke IV guidelines, we are required to use the latest decennial census. (See Reinecke IV, supra, 10 Cal. 3d at p. 413; see also Karcher v. Daggett (1983) 462 U.S. 725, 738 [77 L.Ed.2d 133, 145, 103 S.Ct. 2653] (Karcher) [\"the census count represents the 'best population data available' \"].)\n\nFinally, a number of interested parties, some representing organizations or communities, others speaking as individuals, addressed such issues as the desirability of respecting a particular county line, the proper grouping within a district of neighboring cities or counties, or the particular needs for representation of a minority group. We were uniformly impressed by the sense of responsibility and goodwill exhibited by these witnesses and their belief that the Masters would attempt to address their concerns, fairly and equitably. This we have attempted to do.\n\nB. Conclusions and Recommendations\n\nWe conclude that we should not accept any of the plans submitted by the various legislative bodies, by the Governor, or by others. Instead, we recommend that the court adopt the plans that we have formulated. In this report, we review in some detail the criteria that the court directed us to follow and how they interact. Second, we briefly explain why we rejected the plans submitted to us. Third, we describe the process by which we constructed the plans that we have submitted to the court. Finally, we describe the districts that we recommend.\n\nII. Review of Criteria\n\nA. Introduction\n\nIn its order establishing the process which has led to this report, the California Supreme Court directed that we be \"guided by the procedures and criteria [contained in Reinecke IV ] as well as by the provisions of article XXI, section 1 of the state Constitution. In addition, the Masters will consider the application of federal law, including the Voting Rights Act. ...\" (Wilson v. Eu, supra, 54 Cal. 3d at p. 473.) The interaction of this act with the previous criteria has added considerable complexity to the redistricting process, as we discuss below.\n\nBefore dealing with these interrelated criteria, it is necessary to acknowledge that the overriding criterion we must follow is the federal constitutional requirement of population equality as established in Reynolds v. Sims (1964) 377 U.S. 533 [12 L.Ed.2d 506, 84 S.Ct. 1362] (state legislative districts) and Kirkpatrick v. Preisler (1969) 394 U.S. 526 [22 L.Ed.2d 519, 89 S.Ct. 1225] (congressional districts). Technical issues concerning the degree of equality required are discussed at a later section of this report.\n\nB. Voting Rights Act\n\n1. Overview\n\nThe primary purpose of the Voting Rights Act of 1965 (42 U.S.C. § 1971 et seq.) (the Act) is to protect the right to vote as guaranteed by the Fourteenth and Fifteenth Amendments.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003ea As amended in 1970, 1975, and 1982, the Act prohibits states and their political subdivisions from denying or abridging citizens' rights to vote \"on account of race or color\" (§ 2(a), 5; 42 U.S.C. § 1973(a), 1973c) or membership in a \"language minority group\" (§ 4(f)(2); 42 U.S.C. § 1973b(f)(2)). As valid federal legislation (see Katzenbach v. Morgan (1966) 384 U.S. 641, 648-651 [16 L.Ed.2d 828, 834-835, 86 S.Ct. 1717]), the Act is the \"supreme law of the land\" (U.S. Const., art. VI, § 2) and supersedes any conflicting state laws or constitutional provisions.\n\nTwo sections of the Act directly affect our task, but in different ways. Section 2, as amended in 1982, has two subsections. Subsection (a) is a substantive prohibition of any voting procedure that \"results in\" denial or abridgement of a racial or lingual minority's voting rights \"as provided in subsection (b).\" Subsection (b) states that a violation of subsection (a) is established by a showing, \"based on the totality of circumstances,\" that\n\nmembers of a protected class have less than an equal opportunity \"to participate in the political process and to elect representatives of their choice.\" The section expressly disavows establishing any right of proportional representation but permits consideration of the extent of minority candidates' success in getting elected.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003ea\n\nSection 2 has been the basis for scores of lawsuits, typically prosecuted in federal court by members of protected groups, claiming that methods of electing candidates to office, such as the demarcation of legislative district boundaries, unlawfully dilute minority votes. Though most of these suits are directed at voting procedures in Southern states, a substantial number have arisen in Northern or Western states, including California. (E.g., Garza v. County of Los Angeles (9th Cir. 1990) 918 F.2d 763; Romero v. City of Pomona (9th Cir. 1989) 883 F.2d 1418; Gomez v. City of Watsonville (9th Cir. 1988) 863 F.2d 1407.)\n\nIn preparing our redistricting plans, we determined that it is important to eliminate, or at least minimize, any possibility of their being challenged under section 2. The ultimate success of any such challenge would depend not only on the composition of the new districts themselves but also on evidence, not now before us, of historic voting patterns or socioeconomic data, and probably also on resolution of open legal questions concerning interpretation or application of the Act. Rather than speculating on such evidence, or attempting to resolve all such legal issues, we have endeavored to draw boundaries that will withstand section 2 challenges under any foreseeable combination of factual circumstances and legal rulings.\n\nThe other relevant section of the Act is section 5 (42 U.S.C. § 1973c). It applies only to states or counties in which fewer than half of the residents of voting age were registered to vote, or voted, in the Presidential Elections\n\nof 1964, 1968, or 1972. (See § 4(b); 42 U.S.C. § 1973b(b) [voting registration determined by Director of the Census].) The section requires that any redistricting or other change of voting procedures in those jurisdictions be cleared in advance either by the federal district court in Washington, D.C., or by the United States Attorney General. The usual practice is to submit a proposed change to the Civil Rights Division of the Department of Justice, after which the Attorney General has 60 days in which to interpose an objection.\n\nFour California counties--Kings, Merced, Monterey, and Yuba--are covered by section 5. All have relatively small populations that include the assigned personnel of large military bases, who are unlikely to register to vote. Because objection by the Attorney General could result in costly delays in the electoral process, we have taken special steps (which we shall describe) to avoid any possibility of disapproval with respect to the covered counties.\n\nDepartment of Justice regulations explain that a change affecting voting is subject to disapproval under section 5 \"if it will lead to a retrogression in the position of members of a racial or language minority group (i.e., will make members of such a group worse off than they had been before the change) with respect to their opportunity to exercise the electoral franchise effectively,\" citing Beer v. United States (1976) 425 U.S. 130 [47 L.Ed.2d 629, 96 S.Ct. 1357] (see also Lockhart v. United States (1983) 460 U.S. 125 [74 L.Ed.2d 863, 103 S.Ct. 998]). (28 C.F.R. § 51.54(a) (1991).) Particular attention is paid to whether the proposed change would comply with section 2. (28 C.F.R. § 51.55 (1991).) Thus, with respect to the four counties covered by section 5, our obligations are to avoid any worsening of the voting positions of racial or language minorities and to comply with section 2 itself.\n\n2. Guidelines in Thornburg v. Gingles\n\nThe leading United States Supreme Court decision construing section 2 is Thornburg v. Gingles (1986) 478 U.S. 30 [92 L.Ed.2d 25, 106 S.Ct. 2752] (Thornburg), where the court upheld an African- American voter challenge to five multimember districts, from each of which the voters were to elect three to eight members of the North Carolina Legislature. The court pointed out that the 1982 amendment to section 2, newly prohibiting any voting procedure that \"results\" in abridgement of voting rights, \"was largely a response to this court's plurality opinion in Mobile v. Bolden, 446 U.S. 55 (1980), which had declared that, in order to establish a violation either of § 2 or of the Fourteenth or Fifteenth Amendments, minority voters must prove that a contested mechanism was intentionally adopted or maintained by state officials for a discriminatory purpose\" (478 U.S. at p. 35 [92 L.Ed.2d at p. 37], italics added).\n\nReferring to section 2(b)'s requirement that proof of a violation be \"based on the totality of circumstances,\" the court quoted, from a Senate Judiciary Committee Report approving the amendment, a list of \"typical factors\" that might be probative.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003ea These factors were derived principally from two cases arising in Texas and Louisiana respectively (Thornburg, supra, 478 U.S. at p. 37, fn. 4 [92 L.Ed.2d at p. 38]) and pertain largely to historical aspects of discrimination and racial polarization. \"The Report stresses,\" says the court, \"that this list of typical factors is neither comprehensive nor exclusive,\" and that \" 'the question whether the political processes are \"equally open\" depends upon a searching practical evaluation of the \"past and present reality\" ' [citation] and on a 'functional' view of the political process. [Citation.]\" ( at p. 45 [92 L.Ed.2d at p. 43].)\n\nThe court then turned to the African-American plaintiffs' claim that the use of \"multimember, rather than single-member, districts in the contested jurisdictions diluted their votes by submerging them in a white majority, thus impairing their ability to elect representatives of their choice.\" (Thornburg, supra, 478 U.S. at p. 46 [92 L.Ed.2d at p. 44], fns. omitted.) The court listed three \"necessary preconditions\" to the sustaining of such a claim:\n\n\"First, the minority group must be able to demonstrate that it is sufficiently large and geographically compact to constitute a majority in a single-member\n\ndistrict.\" (Thornburg, supra, 478 U.S. at p. 50 [92 L.Ed.2d at p. 46], italics added.)\n\n\"Second, the minority group must be able to show that it is politically cohesive. \" (Thornburg, supra, 478 U.S. at p. 51 [92 L.Ed.2d at p. 47], italics added.)\n\n\"Third, the minority must be able to demonstrate that the white majority votes sufficiently as a bloc to enable it ... usually to defeat the minority's preferred candidate.\" (Thornburg, supra, 478 U.S. at p. 51 [92 L.Ed.2d at p. 47].)\n\nDespite the court's formal reservation of the question whether these prerequisites are \"fully pertinent\" to a claim of vote dilution caused by \"the splitting of a large and geographically cohesive minority between two or more multimember or single-member districts\" (Thornburg, supra, 478 U.S. at pp. 46-47, fn. 12 [92 L.Ed.2d at p. 44]; cf. at p. 50, fn. 16 [92 L.Ed.2d at p. 46]), lower courts have assumed their applicability to claims of vote dilution by single-member districts (see Jeffers v. Clinton (E.D.Ark. 1989) 730 F.Supp. 196, 205; Neal v. Coleburn (E.D.Va. 1988) 689 F.Supp. 1426, 1435), and we likewise assume their applicability to the single-member districts that we propose.\n\nWe can avoid section 2 challenges to our new districts by eliminating the possibility of a minority group's proving any one of the three Thornburg prerequisites. The information from which our districts are drawn is furnished by the 1990 federal census, which tells us, as to each census tract, the total number of persons together with the numbers in particular categories of age, race, and Latino origin.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e From that data, we can Judge whether minority groups are \"sufficiently large and geographically compact\" to satisfy the first Thornburg prerequisite. The second and third prerequisites, however, depend on what analyses of election results would show about a minority's political cohesiveness and about White majority bloc voting. In this area, the federal census is of little help.\n\nWe have therefore drawn district lines so as to avoid either (1) unnecessary fragmentation of any sufficiently large, geographically compact protected minority group\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e into two or more districts, or (2) overconcentration of such a group in a single district. By thus preventing the dilution of the votes of any minority group that could qualify under the first Thornburg\n\nprerequisite, we can eliminate the possibility of section 2 challenges regardless of whether a group could fulfill the second or third prerequisite. Accordingly, we turn to an examination of the first prerequisite.\n\na. Geographic Compactness\n\nWe examine first the requirement that the minority be \"geographically compact\" (Thornburg, supra, 478 U.S. at p. 50 [92 L.Ed.2d at p. 46]). There is little case law interpreting this phrase. We believe that the key to its meaning lies in the view, expressed in Thornburg, that Congress intended the determination of a section 2 violation to \" 'depend[] upon a searching practical evaluation of the \"past and present reality\" ... and on a \"functional\" view of the political process\" (478 U.S. at p. 45 [92 L.Ed.2d at p. 43], quoting from the Senate report).\n\nThe court in Dillard v. Baldwin County Bd. of Educ. (M.D.Ala. 1988) 686 F.Supp. 1459, seized upon this passage from Thornburg in holding that the prerequisite of geographical compactness was met by a minority group who lived within an irregular strip of land, just inland from Mobile Bay, which appears to be approximately 20 miles long and, at some points, less than a mile wide. As the Dillard court explained, \"[t]he degree of geographical symmetry or attractiveness is ... a desirable consideration for districting, but only to the extent it aids or facilitates the political process .... [P] ... For example, a district would not be sufficiently compact if it was so spread out that there was no sense of community, that is, if its members and its representatives could not effectively and efficiently stay in touch with each other; or if it was so convoluted that there was no sense of community, that is, if its members and its representative could not easily tell who actually lived in the district. ... [B]ecause compactness is a functional concept, the number and kinds of factors a court should consider may vary with each case, depending on the local geographical, political, and socio-economic characteristics of the jurisdiction being sued.\" ( at p. 1466.)\n\nWe fully agree with this functional view of geographical compactness. Accordingly, in the context of statewide redistricting in California, particularly in rural areas where considerations of communication and access are of considerable importance, section 2 need not control formulation of plans where minority voters are not, functionally, geographically compact.\n\nb. Size of Minority Group\n\nUnder Thornburg 's first prerequisite, the minority group complaining of vote dilution must be not only \"geographically compact\" but also \"sufficiently large ... to constitute a majority in a single-member district\"\n\n(Thornburg, supra, 438 U.S. at p. 50 [92 L.Ed.2d at p. 46]). The \"majority\" referred to has been widely interpreted to mean a majority of persons of voting age, rather than a majority of the entire population. (Dickinson v. Indiana State Elections Bd. (7th Cir. 1991) 933 F.2d 497, 503 (Dickinson); Romero v. City of Pomona, supra, 883 F.2d 1418, 1425; Solomon v. Liberty County, Florida (11th Cir. 1990) 899 F.2d 1012, 1018 [rehg. en banc] (Solomon); McDaniels v. Mehfoud (E.D.Va. 1988) 702 F.Supp. 588, 592 (McDaniels).) That interpretation is consistent with Thornburg 's repeated references to \"minority voters\" (e.g., 478 U.S. at p. 50, fn. 17 [92 L.Ed.2d at pp. 46-47]) and appears correct.\n\nA majority of registered voters, on the other hand, is not a prerequisite to a section 2 claim. (Dickinson, supra, 933 F.2d at p. 503; Solomon, supra, 899 F.2d 1012; McDaniels, supra, 702 F.Supp. at p. 592.) As pointed out at an earlier stage of the Solomon case: \"Minority voter registration figures are inherently unreliable measures in vote dilution cases because the very lack of minority political power responsible for the bringing of the section 2 action also may act to depress voter registration.\" (Solomon v. Liberty County, Fla. (11th Cir. 1988) 865 F.2d 1566, 1574 [vacated on grant of rehg. en banc].) But though not part of any threshold requirement, voter registration or turnout may be considered in fashioning a remedy that will enhance the minority group's opportunity to elect the candidate of its choice. (Dickinson, supra, 933 F.2d at p. 503.) However, we would note that there are difficulties in developing reliable minority registration data.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nAt least one court has considered not only age but citizenship in determining whether the minority group would constitute a majority of eligible voters within a district. (See Romero v. City of Pomona, supra, 883 F.2d 1418, 1425.) For several reasons we have assumed that citizenship would not be a factor in determining fulfillment of Thornburg 's first prerequisite. Since an application for naturalization resembles voter registration in that both require individual initiative, lack of citizenship is arguably more akin to nonregistration than to underage as a measure of ineligibility to vote. Moreover, rejection of the dubious citizenship test theoretically results in conferring Thornburg standing on more minority groups than if the test were\n\naccepted. Thus, district lines based on such rejection will more effectively preclude possibilities of section 2 claims.\n\nThough we have not relied on voter registration or citizenship statistics in determining what groups are entitled to voter protection under Thornburg, we have occasionally considered such data in determining how best to divide up a minority group which cannot be accommodated in a single district in a way that will maximize the group's voting potential.\n\nc. Political Cohesiveness; Multiple Minorities\n\nThe second Thornburg prerequisite to a section 2 claim is that the minority group seeking protection show that it is \"politically cohesive.\" (Thornburg, supra, 478 U.S. at p. 51 [92 L.Ed.2d at p. 47].) In an abundance of caution we are assuming, as already explained, the political cohesiveness of any single minority group that meets the first prerequisite, i.e., that it is sufficiently large and geographically compact. The question of cohesiveness also arises, however, where two or three minority groups claim that together they could constitute the geographically compact majority of a district even though none is large enough to qualify separately. If the groups are politically cohesive, i.e., if they vote the same way, they are likely to be treated as a combined single group so long as the combined group fulfills the other Thornburg prerequisites. (Campos v. City of Baytown, Tex. (5th Cir. 1988) 840 F.2d 1240, 1244 [African-Americans and Hispanics treated as one minority group if cohesive as a whole]; see Romero v. City of Pomona, supra, 883 F.2d 1418, 1426-1427 [African-Americans and Latinos not combined because found not to be politically cohesive].)\n\nAccordingly, in areas containing substantial numbers of more than one of the state's principal minority groups (African-American, Asian, and Latino) of which two or three combined, but no one group alone, would be large and compact enough to qualify under Thornburg, we have assumed political cohesiveness and endeavored to protect the combined group's voting potential in accordance with section 2.\n\nd. Minority Influence Claims\n\nA footnote in Thornburg warned that the court there had \"no occasion to consider whether § 2 permits, and if it does, what standards should pertain to, a claim brought by a minority group that is not sufficiently large and compact to constitute a majority in a single-member district, alleging that the use of a multimember district impairs its ability to influence elections.\" (478 U.S. at pp. 46-47, fn. 12 [92 L.Ed.2d at p. 44], italics in original.) Disregarding this suggestion that section 2 might require less than intradistrict\n\nmajority status for protection of a minority voter group, some courts have insisted on the majority requirement of the first Thornburg prerequisite as a \"brightline test\" that should be adhered to in \"the interests of clarity and uniformity.\" (McNeil v. Springfield Park Dist. (7th Cir. 1988) 851 F.2d 937, 944; accord, Brewer v. Ham (5th Cir. 1989) 876 F.2d 448, 455-456; Skorepa v. City of Chula Vista (S.D.Cal. 1989) 723 F.Supp. 1384, 1391; see Garza v. County of Los Angeles, supra, 918 F.2d 763, 770, fn. 2; Karlan, Undoing the Right Thing: Single-Member Offices and the Voting Rights Act (1991) 77 Va.L.Rev. 1, 31-32.)\n\nThe high court's recent decision in Chisom v. Roemer (1991) 501 U.S. [115 L.Ed.2d 348, 111 S.Ct. 2354], however, contains a stronger recognition of the possibility of an \"influence\" vote- dilution claim by a minority voter group too small to constitute an intradistrict majority. In Chisom, the court sustained the right to challenge elections of state Judges under section 2. The majority opinion, joined in by six Justices, reasoned that the right to an equal opportunity \" 'to participate in the political process and to elect representatives of their choice' \" (§ 2(b); 42 U.S.C. § 1973(b)) is a unitary right, and that Judges are \"representatives\" within the meaning of section 2(b). (501 U.S. at p. [115 L.Ed.2d at p. 364, 111 S.Ct. at p. 2365], italics added by the court.)\n\nThe Chisom Dissent argues that Judges are not \"representatives\" and that section 2(b) confers two separate rights. Otherwise, says the Dissent, \"minorities who form such a small part of the electorate in a particular jurisdiction that they could on no conceivable basis 'elect representatives of their choice' would be entirely without section 2 protection.\" (Chisom v. Roemer, supra, 501 U.S. at p. [115 L.Ed.2d at p. 372, 111 S.Ct. at p. 2371] (dis. opn. of Scalia, J.).) The majority replies in a footnote: \"The Dissent argues that our literal reading of the word 'and' [in section 2(b)] leads to the Conclusion that a small minority has no protection against infringements of its right 'to participate in the political process' because it will always lack the numbers necessary 'to elect its candidate,' post, at [page] [115 L.Ed.2d at page 372, 111 S.Ct. at page 2371]. This argument, however rests on the erroneous assumption that a small group of voters can never influence the outcome of an election.\" ( at p. , fn. 24 [115 L.Ed.2d at p. 364, 111 S.Ct. at p. 2365.)\n\nIn Armour v. State of Ohio (N.D.Ohio 1991) 775 F.Supp. 1044, the majority of a three-Judge district court (28 U.S.C. § 2284), over a vigorous Dissent, sustained a section 2 claim that the boundary between two single-member districts for election to the lower house of the Ohio Legislature diluted the vote of the plaintiff minority group regardless of whether the group would be large enough to form a majority in either district. In reaching this result, the majority relied on the foregoing footnotes in Thornburg and Chisom.\n\nWithout undertaking a definitive resolution of the validity of section 2 \"influence\" claims, we recognize that their legal grounding is sufficiently strong to call for our using every reasonable effort to avoid their being asserted against our redistricting proposals. Accordingly, we have aimed to maximize the voting potential of a geographically compact minority group of any appreciable size even where it would not constitute a majority in the particular district.\n\nC. Population Equality\n\nAs noted at the outset of our report, the United States Supreme Court has required population equality of electoral districts as a matter of constitutional law. Separate tests are set out for state legislative districts and congressional districts.\n\n1. State Legislative Districts\n\nThe United States Supreme Court has allowed substantial leeway in population equality as to state legislative districts. In Gaffney v. Cummings (1973) 412 U.S. 735 [37 L.Ed.2d 298, 93 S.Ct. 2321], a total variation of 7.83 percent (in districts for the Connecticut Legislature) was held constitutional on its face, with no need for state justification. When substantial justification is shown, the Supreme Court has allowed even greater variation. (See, e.g. Mahon v. Howell (1972) 410 U.S. 315 [35 L.Ed.2d 320, 93 S.Ct. 979].)\n\nAside from the federal constitutional limitations, Article XXI requires that \"the population of all districts of a particular type shall be reasonably equal.\" This section, enacted after Reinecke IV, has been interpreted by the Attorney General of California as incorporating the more restrictive population requirements contained in Reinecke IV that the \"population of senate and assembly districts should be within 1 percent of the ideal except in unusual circumstances, and in no event should a deviation greater than 2 percent be permitted.\" (Reinecke IV, supra, 10 Cal. 3d at p. 411; see 64 Ops.Cal.Atty.Gen. 597, 613-615 (1981).) Since we have been directed by the Supreme Court to follow the Reinecke IV criteria, we have no occasion to determine whether this higher standard is also required by Article XXI.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\n2. Congressional Districts\n\nThe federal constitutional standard for population equality among a state's congressional districts is far stricter than that applicable to districts for electing a state legislature. The populations of congressional districts must be equal \"as nearly as is practicable.\" (Wesberry v. Sanders (1964) 376 U.S. 1, 7-8 [11 L.Ed.2d 481, 486, 84 S.Ct. 526].) That \"standard requires that the State make a good faith effort to achieve precise mathematical equality. [Citation.] Unless population variances among congressional districts are shown to have resulted despite such effort, the State must justify each variance, no matter how small.\" (Kirkpatrick v. Preisler, supra, 394 U.S. 526, 530-531 [22 L.Ed.2d at pp. 524-525].) In Kirkpatrick, the high court invalidated an apportionment of Missouri's congressional districts with a maximum deviation of 5.97 percent.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e The court rejected Missouri's attempted justifications as being ad hoc and \"haphazard,\" and not applied in a systematic, uniform manner throughout the state. ( at p. 535 [22 L.Ed.2d at p. 527].)\n\nIn Karcher, supra, 462 U.S. 725, these principles were the basis for invalidating New Jersey congressional districts with a maximum deviation of 0.6984 percent. The court first held, principally because of evidence of other plans with lower deviations, that the districts \"did not come as nearly as practicable to population equality,\" and therefore, \"the burden shifted to the State to prove that the population deviations in its plan were necessary to achieve some legitimate state objective.\" ( at p. 740 [77 L.Ed.2d at p. 147].)\n\nThe court described how the state's shifted burden could be met. \"Any number of consistently applied legislative policies might justify some variance, including, for instance, making the districts compact, respecting municipal boundaries, preserving the cores of prior districts, and avoiding contests between incumbent Representatives. As long as the criteria are nondiscriminatory [citation], these are all legitimate objectives that on a proper showing could justify minor population deviations. See, e.g., West\n\nVirginia Civil Liberties Union v. Rockefeller, 336 F.Supp 395, 398-400 (S.D.W.Va. 1972) (approving plan with .78 maximum deviation as justified by compactness provision in State Constitution).\" (Karcher, supra, 462 U.S. at pp. 740-741 [77 L.Ed.2d at p. 147].)\n\nThe court stressed the necessity for specificity and consistency: \"The State must ... show with some specificity that a particular objective required the specific deviations in its plan, rather than simply relying on general assertions. The showing required to justify population variations is flexible, depending on the size of the deviations, the importance of the State's interests, the consistency with which the plan as a whole reflects those interests, and the availability of alternatives that might substantially vindicate those interests yet approximate population equality more closely.\" (Karcher, supra, 462 U.S. at p. 741 [77 L.Ed.2d at p. 147].)\n\nNew Jersey's attempted justification of the challenged redistricting was held clearly inadequate. The only justification seriously advanced was preservation of minority voting strength, but that explanation applied to only two of the state's fourteen districts and could not justify the deviations of others. (Karcher, supra, 462 U.S. at pp. 742-745 [77 L.Ed.2d at pp. 148-151].)\n\nWe are satisfied that our proposed congressional districts comply with these Karcher guidelines. Our maximum deviation is only 0.49 percent, compared with almost 0.70 percent in Karcher itself, and 0.78 percent in the West Virginia reapportionment case that Karcher describes as \"justified by compactness provision in [the] State Constitution\" (462 U.S. at p. 741 [77 L.Ed.2d at p. 147]). All of our proposed districts are fully, specifically, and consistently justified by the state policies expressed in the California Constitution (art. XXI) and in Reinecke IV, supra, 10 Cal. 3d 402, 410-414, or by the overriding federal policies implemented by sections 2 and 5 of the Voting Rights Act. We note Karcher 's examples of possible nondiscriminatory state justifications, \"for instance, making districts compact [and] respecting municipal boundaries\" (462 U.S. at p. 740 [77 L.Ed.2d at p. 147]) reflect our own Reinecke IV criteria (10 Cal. 3d at pp. 411-412).\n\nThe Democratic Congressional Delegation contends that their plan should be chosen over any rival plan because it achieves almost perfect population equality (a deviation of no more than 9 persons from the ideal district population of 572,308). We reject that contention. As Justice Stevens, who joined in the majority Karcher opinion, observed in his separate Concurring opinion in that case, \"the goal of perfect population equality is an inadequate method of judging the constitutionality of an apportionment plan.\" (Karcher, supra, 462 U.S. at p. 750 [77 L.Ed.2d at p. 155] (conc. opn. of Stevens, J.).)\n\nKarcher clearly permits the congressional districts that we propose, with a maximum deviation of less than 0.5 percent and specifically justified by legitimate, consistently applied state and federal policies.\n\nMoreover, there is an affirmative policy reason for not insisting on virtually exact equality. The districts that we recommend are composed of entire census tracts. These tracts normally range from 2,000 to 6,000 persons in size and, as explained in Reinecke IV, \"an effort has been made by the Census Bureau to make them homogeneous as to social characteristics and to use prominent natural or manmade geographical features as boundaries. Thus, following, rather than disregarding, census tracts will aid in establishing natural, well defined legislative districts and will aid in obtaining valid pertinent socioeconomic data about such districts.\" (Reinecke IV, supra, 10 Cal. 3d at p. 413, fns. omitted.)\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nThe plans submitted to us with near-zero population deviations are based on census \"blocks\" instead of tracts. Formulating districts on a block basis is enormously expensive. A block, as used by the Census Bureau, is just that--a block in a city or suburb. The approximately 6,000 census tracts in California are made up of about 400,000 blocks. The cost of computers, software, and experts to deal efficiently with this greater amount of data is exponentially higher than a comparable system in which the bulk of the redistricting work is done by census tracts. Indeed, the cost would be prohibitive for any private person or group having resources short of those available to the Legislature.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nThus, the result of insisting on an exactitude that requires formulation of districts by census blocks, instead of tracts, would be to limit the ability of many groups, including those representing minority voters, to participate meaningfully in the reapportionment process by presenting alternate redistricting plans, such as the one offered to us by the Mexican- American Legal Defense and Education Fund (hereafter MALDEF). Such limitation on community participation would undercut our duty to \" 'afford all interested parties the opportunity to be heard' \" so that \" '[t]he court [will] be fully informed with respect to all of the possible criteria that might be adopted for reapportionment and with respect to all of the specific implementations of such criteria that might be ordered into effect.' ([ Legislature v. Reinecke (1972)] 6 Cal. 3d [595,] 601-602.)\" (Reinecke III, supra, 9 Cal. 3d at p. 167, cited in Wilson v. Eu, supra, 54 Cal. 3d 471, 473, as the basis for the court's direction that we hold public hearings.) This policy of maximum community input for any court-ordered plan, followed in 1973 as well as in 1991, clearly justifies, under Karcher, supra, 462 U.S. 725, the minor deviations necessary to enable redistricting to be done on a reasonably exact census tract basis instead of a census block basis that would be prohibitively expensive for most interested persons and groups.\n\nWidespread participation in the redistricting process is also an important policy to be furthered under the Act. The United States Attorney General has recognized this in the regulations for preclearance under section 5. Among the factors the Attorney General considers in determining whether to preclear a voting procedural change, such as redistricting, are the \"extent to which the jurisdiction afforded members of racial and language minority groups an opportunity to participate in the decision to make the change\" (28 C.F.R. § 51.57(c)) and the \"extent to which the jurisdiction took the concerns of members of racial and language minority groups into account in making the change\" (28 C.F.R. § 51.57(d)). The participation called for by these provisions should not be restricted for those unable to afford the enormous cost of unnecessarily exact redistricting.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nD. The State Constitution, Reinecke IV, and the Act\n\nUnder the supremacy clause of the United States Constitution (art. VI, § 2), the Act (supra, 42 U.S.C. § 1471 et seq.) takes precedence over any state guidelines with which the Act conflicts. In the absence of such a conflict, however, the directions given to the Masters require that, to the\n\nextent possible, we \"be guided by ... the provisions of article XXI, section 1 of the state Constitution\" and the guidelines of Reinecke IV. (Wilson v. Eu, supra, 54 Cal. 3d at p. 473.)\n\nThese three sets of requirements constitute the foundation on which the redistricting plan is built. We have previously described the Act, the federal imperative. Here, we discuss the commands of the state, as expressed in the Constitution and by our Supreme Court, and their interrelationship with overriding national policy. Further, while the state criteria which we are directed to follow come from two sources--Article XXI of the Constitution and Reinecke IV, supra, 10 Cal. 3d 396, several of the Reinecke IV criteria, on close examination, simply express in different words the basic criteria contained in Article XXI.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\n1. State Constitutional Requirements\n\nArticle XXI, section 1, an amendment to the state Constitution adopted by the people as Proposition 6 in June 1980, requires that each member of the Senate, the Assembly, Congress, and the State Board of Equalization be elected from a single-member district (Art. XXI, subd. (a)), that districts of each type be numbered consecutively from the northern boundary of the state to the southern boundary (Art. XXI, subd. (d)), and that the population of all districts of a particular type \"be reasonably equal\" (Art. XXI, subd. (b)). The first two of these provisions require no further Discussion. We have previously dealt with the federal constitutional requirements of population equality.\n\nThe remaining two requirements of California's Article XXI are central to our redistricting responsibility and require further Discussion:\n\n\"(c) Every district shall be contiguous.\"\n\n\"(e) The geographical integrity of any city, county, or city and county, or of any geographical region shall be respected to the extent possible without violating the requirements of any other subdivision of this section [i.e., contiguity and population equality].\"\n\nTo determine more specifically what was intended by these two provisions, we turn to the Ballot Pamphlet analysis and arguments to the voters for the Primary Election of June 3, 1980. Such material is often relied upon in construing constitutional provisions. (See Delaney v. Superior Court\n\n(1990) 50 Cal. 3d 785, 802-803 [268 Cal. Rptr. 753, 789 P.2d 934] [ballot arguments are accepted sources from which to ascertain voters intent and intent of voters governs interpretation of constitutional provisions enacted by them]); White v. Davis (1975) 13 Cal. 3d 757, 775 [120 Cal. Rptr. 94, 533 P.2d 222] [ballot argument identifies the principal \"mischiefs\" at which the constitutional amendment is directed].)\n\na. Contiguity\n\nThe Legislative Analyst's analysis of Proposition 6, by which Article XXI was adopted, described the measure as providing that \"[a]ll districts shall be adjoining.\" The ballot argument in favor of Proposition 6 added: \" Contiguous districts. Proposition 6 would require that districts be composed of adjacent territory and not widely separated areas. It would also help deter odd-shaped districts which join distant communities only by corridors along beaches, highways and waterways.\" (Ballot Pamp., Proposed Amends. to Cal. Const. with arguments to voters, Primary Elec. (June 3, 1980).)\n\nb. Geographical Integrity\n\nThe Legislative Analyst's Analysis stated that the measure provided that \"[w]here possible, the geographical region of a city or county shall not be divided among different districts.\" The ballot argument favoring the proposition stated: \"[Proposition 6] requires preservation of the integrity of cities, counties, and geographic regions. ... [P]roposition 6 would reduce abuses by requiring the Legislature to follow these rules: Respect city and county boundaries. This rule would prevent the irrational division of cities for purely partisan purposes. It would help protect minority communities from being carved up just to dilute their votes. And it would help maintain local control by giving cities and counties effective representation in the Legislature.\" (Ballot Pamp. analysis of Prop. 6 by Legis. Analyst as presented to voters, Primary Elec. (June 3, 1980), italics in original.)\n\nThe ballot arguments opposing the proposition asked, \"Why is not 'geographic regions' defined?\" and questioned whether the provision concerning the geographic integrity of city and county boundaries would \"water down\" the provision concerning \"equal population\": \"[W]ill protecting the integrity of cities and counties elasticize the meaning of 'reasonably equal'?\" (Ballot Pamp., Proposed Amends. to Cal. Const. with arguments to voters, Primary Elec. (June 3, 1980).) The proponents responded: \"City and county boundaries can be ignored only if necessary to comply with the equal population requirement. That is how Proposition 6 will prevent cities and minority communities from being arbitrarily divided to gain partisan advantage or to draw 'safe' districts for incumbents.\" ()\n\n2. The Reinecke IV Requirements\n\nAs noted, the Masters have also been instructed by the Supreme Court to consider the following criteria used by the Special Masters and accepted by the court in 1973:\n\n\"1. As required by the federal Constitution, the districts in each plan should be numerically equal in population as nearly as practicable, with strict equality in the case of congressional districts [citation] .... The population of senate and assembly districts should be within 1 percent of the ideal except in unusual circumstances, and in no event should a deviation greater than 2 percent be permitted.\n\n\". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n\n\"2. The territory included within a district should be contiguous and compact, taking into account the availability and facility of transportation and communication between the people in a proposed district, between the people and candidates in the district, and between the people and their elected representatives.\n\n\"3. Counties and cities within a proposed district should be maintained intact, insofar as practicable. [Citations.]\n\n\"4. The integrity of California's basic geographical regions (coastal, mountain, desert, central valley and intermediate valley regions), should be preserved insofar as practicable.\n\n\"5. The social and economic interests common to the population of an area which are probable subjects of legislative action, generally termed a 'community of interests' [citation] should be considered in determining whether the area should be included within or excluded from a proposed district in order that all of the citizens of the district might be represented reasonably, fairly and effectively. Examples of such interests, among others, are those common to an urban area, a rural area, an industrial area or an agricultural area, and those common to areas in which people share similar living standards, use the same transportation facilities, have similar work opportunities, or have access to the same media of communication relevant to the election process.\n\n\" ... It is clear that in many situations county and city boundaries define political, economic and social boundaries of population groups. Furthermore, organizations with legitimate political concerns are constituted\n\nalong political subdivision lines. Therefore, unnecessary division of counties and cities in reapportionment districting should be avoided.\" (Reinecke IV, supra, 10 Cal. 3d at pp. 411-412, fn. omitted.)\n\n\"As to all of the recommended criteria, their applicability, priority and scope, other than population equality, depend on circumstances indigenous to the area under consideration. To the extent required by the federal Constitution, population equality controls.\" (Reinecke IV, supra, 10 Cal. 3d at p. 414.)\n\n3. Interrelationships Between Article XXI and Reinecke IV Criteria\n\nArticle XXI, adopted in 1980, the Reinecke IV (supra, 10 Cal. 3d 396) guidelines employed by the Masters and adopted by the Supreme Court in 1973, and the imperatives of the Act are clearly complementary. Here we group the state requirements and guidelines together for comment, followed by a Discussion of their relationship to the Act.\n\na. Population Equality\n\nThe requirements of the United States Constitution as interpreted by the United States Supreme Court are, of course, controlling, and we have discussed these requirements above.\n\nb. Contiguity, Geographic Integrity, Community of Interest and Compactness\n\nThese four criteria all are addressed to the same goal, the creation of legislative districts that are effective, both for the represented and the representative. The constitutional requirement of \"contiguity\" is not an abstract or geometric technical phrase. It assumes meaning when seen in combination with concepts of \"regional integrity\" and \"community of interest.\" Thus, in the ballot argument concerning \"contiguous districts,\" the proponents talked of \"adjacent territory and not widely separated areas\" and the \"preservation of the integrity of geographic regions.\" The argument criticized \"odd-shaped districts\" connected only by \"corridors along beaches, highways and waterways.\" In more detail, the Special Masters in 1973 recommended the preservation of the \"integrity of California's basic regions (coastal, mountain, desert, central valley and intermediate valley regions) ....\" (Reinecke IV, supra, 10 Cal. 3d at p. 412.) \"The territory included within a district should be contiguous and compact, taking into account the availability of transportation and communication.\" ( at p. 411.) In addition, \"social and economic interests common to the population of an area,\" e.g., \"an urban area, a rural area, an industrial area or an agricultural area,\" ( at p. 412) should be considered.\n\nFrom this we conclude that districts should be contained, insofar as possible, wholly within one of the major geographic regions of the state. While \"geographic regions\" is not further defined in the Constitution, the acceptance by the Supreme Court of the Special Masters' definition is compelling. We believe, at a minimum, this requires recognition of the division between Northern and Southern California by the Tehachapi Mountains and of such major regions as the San Joaquin and Sacramento Valleys, the coastal areas of Northern and Central California, and the Mojave and other desert areas east of the Sierra Nevada and north of the San Gabriel Mountains.\n\nc. City and County Boundaries and Community of Interest\n\nSimilarly, the state Constitution's inclusion of the \"geographical integrity of any city, county, or city and county\" is paralleled by the 1973 Special Masters' finding that \"in many situations county and city boundaries define political, economic and social boundaries of population groups.\" (Reinecke IV, supra, 10 Cal. 3d at p. 412.) In the context of both Article XXI and Reinecke IV this means that districts must have some reasonable \"functional\" compactness, in the sense that we have discussed above in our analysis of Thornburg and the Act. Compactness does not refer to geometric shapes but to the ability of citizens to relate to each other and their representatives and to the ability of representatives to relate effectively to their constituency. Further, it speaks to relationships that are facilitated by shared interests and by membership in a political community, including a county\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e or city.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nThere is one possible conflict between the Act and Article XXI involving cities: where a geographically compact minority group is located partly\n\nwithin and partly without a city. (The southern part of Sacramento is an example.) In some areas of California city annexations are a common occurrence; thus it is possible that minority areas remain divided either by intent or by effect, thus indirectly diluting the vote of the affected minority groups. In areas where such a situation exists, and where a minority influence district could be created, we have given precedence to keeping geographically compact minority groups together rather than maintain city boundaries.\n\n4. Interrelationships Between State Criteria and the Act\n\nWe find no conflict between the Act and the above state criteria. Indeed, quite the contrary. As has already been noted, the Act protects only \"geographically compact\" minority groups. The major divisions of the state as we have defined them above divide no such minority groups. (The boundary mountain ranges, for example, are virtually unpopulated areas with few roads crossing them; 50 to 100 miles separates populated areas on either side of these ranges.) Similarly, the values expressed in the concept of contiguity, community of interest, and respect for local government boundaries--the concept of \"functional compactness\"--is completely consistent with the concept of \"geographically compact\" minority districts. Indeed, use of these criteria reinforces the Act's guarantee to minority groups to have an equal opportunity \"to participate in the political process\" (§ 2(b); 42 U.S.C. § 1973(b)). As suggested above, political effectiveness can be enhanced by membership and participation in community affairs: candidates for public office can be recruited and nurtured, local media may be better utilized (including the foreign language press), grassroots organizing and campaigning are more viable. As suggested in the June 1980 ballot arguments in favor of Article XXI, use of these criteria can avoid the creation of \"districts that are confusing, unfair and unrepresentative.\"\n\nIn sum, we find the criteria underlying the drawing of district boundaries, i.e., criteria found in the federal and state constitutions, in the Act, and in the decision of the California Supreme Court in Reinecke IV, supra, 10 Cal. 3d 396, not only reconcilable, but compatible. The criteria have guided our deliberations and informed our decisions.\n\nE. Combining Assembly Districts to Form Senate Districts\n\nAnother criterion from Reinecke IV is as follows:\n\n\"6. State senatorial districts should be formed by combining adjacent assembly districts, and to the degree practicable, assembly districts should be\n\nused as congressional district boundaries.\" (Reinecke IV, supra, 10 Cal. 3d at p. 412.)\n\n\"The resulting legislative districts [which pair assembly districts to form senate districts] will be more comprehensible to the electorate and the task of administering elections would be considerably simplified, thus saving money and ensuring greater accuracy.\" (Reinecke IV, supra, 10 Cal. 3d at p. 413.)\n\nWe find these Conclusions as persuasive in 1991 as our predecessors did in 1973. Further, the concept of \"nesting\" adjacent assembly districts to form senatorial districts has not posed any Voting Rights Act problem. While we can imagine circumstances in which this might occur, in our plans it did not. We have so drawn the senatorial districts.\n\nIII. Why We Reject Other Plans\n\nComplete plans for each legislative body were submitted by seven different participants: the Independent Panel on Redistricting (established by the Governor); the Governor (containing modifications in certain areas of the Independent Panel submission); MALDEF; the Minority (Republican) Caucus of the Assembly for the Assembly, the Senate, and the Democratic Congressional Delegation; and the legislative bodies themselves for their respective houses (the Assembly and Senate as parties and the Democratic Congressional Delegation as to congressional plans.) In the case of both the Assembly and the Congress, three plans were submitted. Thus, we received 22 statewide plans in all, including 3 for the State Board of Equalization that are treated separately below. As previously noted, we do not recommend any of them for adoption.\n\nWe discuss briefly our reasons below. First, however, proponents urge that special deference be given to the various plans passed by the Legislature but vetoed by the Governor. It is true that some federal cases have given special credence to this argument in the context of federal judicial deference to state policy (see, e.g. Upham v. Seamon (1982) 456 U.S. 37 [71 L.Ed.2d 725, 102 S.Ct. 1518]; McGhee v. Granville County, N.C. (4th Cir. 1988) 860 F.2d 110, 115); but see, e.g., Garza v. County of Los Angeles, supra, 918 F.2d 763, 776, taking a contrary position). However, our Supreme Court rejected this position in Legislature v. Reinecke (1972) 6 Cal. 3d 595 [99 Cal. Rptr. 481, 492 P.2d 385] (Reinecke I), refusing to give deference to \"plans that are at best truncated products of the legislative process\" (6 Cal. 3d at p. 602). Thus,\n\npursuant to controlling state law, we have evaluated the legislative submissions in the same manner as other submissions.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nThe Assembly passed three plans, each vetoed by the Governor, and submitted all three plans for our consideration. The Speaker of the Assembly made a presentation at our hearings and candidly explained that the reason for having three plans was that two of them represented an effort to obtain either a legislative compromise (an attempt to get certain Republican members of the Assembly to join in a veto override) or a gubernatorial compromise (an attempt to get the Governor to sign rather than veto one of the plans). We appreciated the candor and understand the dynamics of political compromise (albeit unsuccessful in this instance). However, the submission of three plans, each with calculated partisan political consequences (the details of which are unknown) creates a severe dilemma for us. We have no principled way to choose between the plans, especially knowing that we would be endorsing an unknown but intended political consequence by the choice we make. For this reason alone we would feel compelled to reject the plans.\n\nHowever, there is a stronger reason for rejecting the plans. We are charged with evaluating plans on the standards of the Act, the requirements of Article XXI of the state Constitution, and the criteria in Reinecke IV, supra, 10 Cal. 3d 396. As to the Act, we have not analyzed the Assembly plans in sufficient detail to conclude whether or not they comply.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e (Other parties have criticized the plans as being, at best, a minimal compliance with the spirit of the Act.)\n\nWhatever the case, we do not believe the plans submitted comply with the Article XXI and Reinecke IV (supra, 10 Cal. 3d 396) requirements of the integrity of geographic regions or contiguity as we interpret them.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e Even a glance at the maps shows many misshapen districts which bypass contiguous populated territory to join distant areas of population together--in some instances without adequate roads or other means of communication. In many instances these districts are in areas where the Act has no practical impact,\n\nand no reasons are offered to explain the necessity of such departures from the Article XXI or Reinecke IV criteria.\n\nTwo specific examples of the violation of Article XXI will suffice. In what the Assembly refers to as \"Plan A,\" District 15 ranges from eastern San Joaquin County and, bypassing Stockton, crosses through a narrow roadless section in the Sacramento River Delta region and over Mount Diablo to take in Walnut Creek and Orinda, just to the east of Oakland. In what is referred to as \"Plan B,\" District 5 consists of the northern part of Sacramento County, Placer County and the Lake Tahoe basin. It then goes down the east side of the Sierra Nevada and crosses into Madera County over the crest of the Sierra Nevada where no road exists. The populated area of Madera County is approximately 130 miles south of the other populated areas of the district.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nIn the absence of a cogent explanation of the necessity for formation of these particular districts, we believe they are contrary to the constitutional requirements of Article XXI. We would be unable to recommend plans containing them under any circumstances.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nThe submission of the Democratic Congressional Delegation suffers the same defects as do the plans submitted by the Assembly. First, three different plans, each with intended partisan consequences, were passed by the Legislature but vetoed by the Governor. All three were submitted to us leading to the same problem described above in connection with the Assembly plans. Second, the violations of Article XXI are even more egregious than those of the Assembly plans. One example will suffice. One congressional district (Dist. 21, \"Plan B\") starts, as best we could tell,\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e somewhere north of Salinas, makes its way circuitously to the northern fringes of the City of Ventura, then crosses into the San Joaquin Valley to take in part of Bakersfield, and finally comes to rest in the Mojave Desert at the San Bernardino\n\nCounty line. Thus, one district takes in parts of almost every major geographical region of the state without even a hint of justification offered.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nThe submission of the Senate, a bipartisan effort, was closer to being acceptable than either the Assembly or congressional submissions.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e We ultimately rejected the plan for several reasons, including but not limited to problems with whether the configurations were suitable for \"nesting;\" the peculiar configuration of several districts, such as Senate-proposed District 2 in the Sonoma and Solano County area. We also have a different assessment as to whether Senate-proposed Districts 9 and 12 complied sufficiently with the Act.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e Even though we did not adopt the Senate plan, a number of districts proposed by us are similar, at least in broad outline, to those proposed by the Senate.\n\nWe also conclude that we cannot accept plans submitted by others. The Governor's Independent Commission plan has much to recommend it, and several members of the commission are known to us as being fair-minded and public- spirited citizens who would try to do the best job possible without political favoritism. We would have been tempted to accept the plans submitted by the commission if we did not feel that the plans were inadequate in the treatment of minority communities. This aspect of the commission plans was the subject of substantial criticism by minority groups and by representatives of both the Democratic and Republican parties. The Governor's amendments attempted to correct these problems (and constituted, in our view, a tacit admission of the problem), but fell short of what we felt was appropriate.\n\nThe MALDEF plans also have attractive elements, and we used some of the specific treatments of areas as a guide to our own construction of\n\ndistricts.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e We disagree, ultimately, as to the extent to which Article XXI could be ignored in the quest to build minority districts (such as crossing mountain ranges in order to obtain additional minority population) and felt that the treatment of nonminority areas in their plans was not well thought out.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nFinally, the Assembly Minority Caucus submitted a complete plan for each legislative body. Both the written and oral presentations were clear and were persuasive as to the merits of the plans. However, problems existed with the details of a number of the districts proposed. Since the plans were submitted to us late in the process and had not received any public comment, we were concerned that they might have political consequences unknown to us which we would not detect without the input of other interested parties. So, in the end, we felt it more appropriate to develop our own plans.\n\nIV. The Process Used in Drawing Plans\n\nOur first step, for both congressional and state legislative districts, was to divide the state into three major geographic regions. The first division was between Northern and Southern California. Our second division was between a coastal and an interior region in Northern California. For both congressional and legislative districts the precise division chosen was designed to produce a whole number of congressional or senate districts. The division between Northern and Southern California for Congress was possible using whole counties. By including Kern County in Northern California\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e and Inyo and San Luis Obispo counties in Southern California,\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e it was possible to assign precisely 21 congressional districts to Northern California and 31 to Southern California. The division for legislative districts was similar. However, because the population required for 16 Senate districts was slightly less than that required for 21 congressional districts, Kern County\n\nwas divided by a line through the Tehachapi Mountains.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e With the exception of Solano County the division of the coastal and interior regions of Northern California was done along county lines, which follow the coastal mountain ranges. Without part of Solano County, the other coastal counties do not have quite enough population to form 12 congressional districts or 9 senate districts. Thus, Solano County, which geographically is partly in the coastal region and partly in the interior, was divided to obtain the requisite population.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\n\nOnce the major geographic regions were determined, further division of each region into actual districts proceeded generally in the following manner. First, districts in areas containing sufficient numbers of geographically compact minority populations were drawn to maximize their \"ability to elect representatives of their choice.\" (Thornburg, supra, 478 U.S. 30 at p. 42 [92 L.Ed.2d 25 at p. 41]).\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e Then, the remaining areas were drawn, starting from the borders of each region so as to respect the geographical integrity of counties and cities\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e and in a manner which provided \"functional\" contiguity.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e Generally speaking, we found that proceeding in this order presented no difficulties. Perhaps the major exception occurred in the urban part of Los Angeles County. Having first constructed Latino and African-American congressional and state legislative districts,\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e which occupied a considerable part of the middle of the south-central and eastern parts of the county, the remainder of the districts allocated to Los Angeles County had to be\n\nconstructed around the periphery; in some instances they became rather elongated.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e\n\nA particular problem exists with Kings, Merced and Monterey Counties because of the requirement of preclearance by the United States Attorney General under section 5 of the Act.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e As we recited in our procedural history, we are acutely aware that very little time will occur between the consideration by the Supreme Court of our recommendations and the 1992 Primary and General Elections; any delay in implementation of plans for districts would not only be very costly but would also be disruptive of the representative process in the state. In order to make it more likely that these districts would not be challenged by the United States Attorney General, we constructed districts in these areas that require preclearance on the basis of a more expansive interpretation of the Act, which required more subordination of California law than would otherwise have been the case.\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e\n\nV. Plans Recommended for Adoption\n\nA. Assembly Plan\n\n1. In General\n\nEvery assembly district in the state consists of entire census tracts and each district varies by less than 1 percent from the ideal size of 372,000 persons. A computer-generated map showing the various districts proposed by us is set out as part of Appendix One of our report. The population of each proposed district is set out in Appendix Two. A listing of the census tracts contained in each proposed district is set out in Appendix Three.\n\n2. North Coastal Region Districts\n\nThe North Coastal Region is entitled to 18 assembly districts.\n\nDistricts 1, 6 and 7 constitute the area north of the Golden Gate and the Carquinez Strait. District 1 consists of the territory known as the Redwood\n\nEmpire, including all of Del Norte, Humboldt, Mendocino and Lake Counties and Sonoma County north of Santa Rosa, the most rural area of the county. District 6 consists of all of Marin County and the adjacent semisuburban areas of Petaluma and Rohnert Park in Sonoma County. District 7 includes Santa Rosa and the town of Sonoma, all of Napa County and Vallejo, immediately to the south. Vallejo is the part of Solano County included within the North Coastal Region. Overall, the division of this area is quite similar to that which was recommended by the 1973 Special Masters.\n\nDistricts 12 and 13 constitute all of San Francisco and a very small part of adjacent San Mateo County needed to achieve population equality. We spent considerable time considering how to divide San Francisco so as to protect minority influence in the resulting districts. San Francisco has a large Asian community and smaller Latino and African-American communities. However, the populations of minorities are not concentrated in a single area.\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e We considered two main alternatives for creating an Asian influence district, one connecting \"Chinatown\" with Asian areas in the Sunset and Richmond districts and part of the southern fringe of the city; and the other, which we finally adopted as District 12, did not include \"Chinatown\" but did include more of the southern fringe and a small part of heavily Asian Daly City. Both had about the same percentage of Asians, and approximately the same amount of Asian registration.\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e The one we chose, however, was more suited for pairing (for purposes of creating a senate district) with the neighboring assembly district in San Mateo County which also has a substantial number of Asians.\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e District 13, the other San Francisco district, includes most of the Latino and African-American population of the city and is almost 51 percent minority in population.\n\nDistricts 14 and 16 encompass the substantial African-American population in Alameda and Contra Costa Counties adjacent to the eastern shore of San Francisco Bay. District 16 includes much of Oakland plus the City of Alameda. It has long had an African-American member of the Assembly, has 35.7 percent African-American population and has a substantial Latino and\n\nAsian population as well. As a result it has over 66 percent minority population. District 14 consists of Richmond, San Pablo and El Cerrito in Contra Costa County and Berkeley, Albany and some of the northern part of Oakland. It is 29.1 percent African-American (and is over 52 percent in total minority population) in an area where African-American candidates have often done well.\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e A number of residents of Richmond expressed concern about the possibility of being linked with Oakland because they have competing ports and thus may have a legislator with divided loyalties. We acknowledge this concern, but believe the recommended district is, nevertheless, preferable. Maritime concerns are largely a matter of federal law, and we have kept Richmond in a congressional district separate from Oakland. Further, the Contra Costa part of this district is substantially more populous than the part of Oakland included within it. The current assembly districts (and those proposed by the Assembly) divide this African-American population between two districts and no African-American has ever been elected from either. Thus, in view of the requirements of the Act we believe that the only proper solution is to keep this African-American population intact within one district.\n\nDistricts 11, 15, 18 and 20 encompass the remainder of the counties of Alameda and Contra Costa. District 11 lies on or near San Pablo Bay, Carquinez Strait or Suisun Bay from Pinole to Antioch. The largest city is Concord. This area is functionally compact and has many industries related to the bordering bays. District 15 includes the interior parts of Contra Costa and Alameda Counties (i.e., the area located east of the East Bay Hills) including Lafayette, Walnut Creek, San Ramon, Dublin and Livermore. The areas are linked by the Interstate 680 freeway. Pleasanton had to be divided, however, because of population equality reasons.\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e District 18 consists of San Leandro, Hayward, Union City and part of Pleasanton, all in Alameda County. District 20 includes Fremont in Alameda County and Milpitas and part of San Jose adjacent to it in Santa Clara County. Both the Alameda County and Santa Clara County parts of the district have a substantial Asian population, 14.5 percent for the district as a whole.\n\nDistricts 19, 21, 22, 23 and 24 are located in San Mateo and Santa Clara Counties. District 19 is the part of San Mateo County immediately south of\n\nSan Francisco, including most of Daly City, all of South San Francisco, San Bruno, Millbrae, Burlingame, Hillsborough and the City of San Mateo and part of Foster City. The northern part of the district has a substantial Asian population, so that the district is 20.9 percent Asian. District 21 includes the southern part of San Mateo County (including Belmont, Redwood City and Menlo Park) and part of Santa Clara County (including Palo Alto and Los Altos.) District 22 consists mainly of Mountain View, Sunnyvale and Santa Clara, plus part of western San Jose; District 24 includes Cupertino, Saratoga, Los Gatos, Campbell and the southern part of San Jose. District 23 includes the most Latino parts of central and eastern San Jose, is 43.5 percent Latino and, because of a large Asian presence and some African- American presence, is 69 percent non-White.\n\nDistricts 27 and 28 are located, primarily, in the Monterey and Santa Cruz County area. This is one of the places where, because of section 5 preclearance concerns,\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e we did not follow our original districting concepts. But for the need for absolute certainty for preclearance approval without delay, we would not have divided Monterey County--because it is close to the ideal population of an assembly district. However, currently it is divided in the Assembly, being joined with Merced County. (The Merced County part of the current district actually \"dilutes\" the Latino population of the district, and is located in another geographic region of the state.) Even so, keeping Monterey County intact might be considered a \"retrogression\" in Latino representation, since the resulting district would have a smaller percentage of Latinos than the current district. So we divided Monterey County into Latino and non-Latino parts, creating District 28 as a Latino influence district by joining the Latino parts with San Benito County, the Watsonville area of Santa Cruz County and the somewhat Latino part of southern Santa Clara County. The resulting Latino population is almost 46 percent (and the total minority population is over 56 percent). The Latino population is higher than the existing district. We were also aided in making this decision by the fact that District 27, which includes the remaining parts of Monterey and Santa Cruz Counties, resembles, in its populated area, a district created by the Special Masters in 1973. (District 27 appears to be very elongated, but it includes the extremely sparsely populated Big Sur coastline of southern Monterey County for which the main access is the scenic highway, Route 1, leading south from Carmel.)\n\n3. North Interior Region Districts\n\nThe North Interior Region is entitled to 14 Assembly districts.\n\nDistricts 2, 3, 4 and 8 are primarily rural districts. District 2 includes much of the Sacramento Valley agricultural region, including Shasta, Tehama,\n\nGlenn, Colusa and Sutter Counties, extending from Redding to near Sacramento. Though long and narrow, like the valley it encompasses, it is centered on Interstate 5. Two nonagricultural counties are also included, Siskiyou and Trinity Counties. Siskiyou is also located on Interstate 5 and Trinity is reached, primarily, from Redding. Small parts of Butte County (the area around Gridley) and Yolo County (the area around Knights Landing), both of which are wholly agricultural, have been included solely because of the population equality requirement. District 3 includes six northern mountain counties (Modoc, Lassen, Plumas, Sierra, Nevada and Yuba), plus most of Butte County, which is partly mountain and partly valley in orientation. District 4 is made up of six whole counties located in the Mother Lode region of the Sierra Nevada: Placer, El Dorado, Amador, Calaveras, Alpine and Mono Counties. District 8 includes Solano County (less Vallejo, which was included in the North Coastal Region), almost all of Yolo County and the delta region of Sacramento County, a sparsely populated rural region adjacent to eastern Solano and southern Yolo County.\n\nDistricts 5, 9, 10 and 17 encompass the urban areas of Sacramento and Stockton. District 5 contains most of the unincorporated northern part of Sacramento County. District 9 includes the bulk of the City of Sacramento. Based strictly on population, the city could constitute a separate assembly district. However, in the south-central area of Sacramento there is a significant geographically compact minority population which is partly within and partly without the city. By including this within District 9, it was possible to create a district which is just over 50 percent in minority population. In view of the obligations we faced under the Act, we thought it preferable to do this rather than follow the city lines strictly. District 10 consists of the rest of Sacramento County and the northern part of San Joaquin County, including Lodi. District 17 includes almost all of the rest of San Joaquin County including the City of Stockton.\n\nDistricts 26, 30 and 31 are the product of our efforts to maximize the Latino presence in districts of the San Joaquin Valley in order to assure (insofar as we are able) preclearance by the Attorney General under section 5 of the Act. The construction of two districts, 30 and 31, was driven by the fact that Kings County was covered by the Act. We started by trying to capture all significant enclaves of minority (primarily Latino) population in Kern, Tulare and Fresno Counties, and eventually used some heavily Latino areas in Madera County for this purpose. One of the resulting districts, District 30, covers the rather sparsely populated, but heavily Latino, area of the southwestern part of the San Joaquin Valley. It is rather elongated, but it is centered on Interstate 5, a modern and as yet uncrowded freeway which facilitates communication. It has a \"hook\" at the southern end which reaches\n\ninto (and divides) Bakersfield so as to add the minority parts of the city to the district. The result is an assembly district with 49.5 percent Latino population and 60 percent overall minority population. District 30 includes all of Kings County (which, because it is covered by section 5, is what triggered the special effort in connection with this district) as well as parts of Fresno and Kern counties and a small part of Madera County. District 31 includes parts of only two counties, Fresno County including the southern part of the City of Fresno and western Tulare County. On the map it appears quite oddly shaped but it is more compact in a functional sense than District 30 and its shape was dictated by the geography of the Latino population. It does, however, divide the cities of Fresno, Visalia and Tulare in order to maximize the Latino presence in the district. The result is an assembly district with 52.2 percent Latino population, and almost 69 percent overall minority population. This district was created for purposes of \"nesting\" with District 30, thus producing a senate district of almost 51 percent Latino population which includes Kings County.\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e District 26 includes all of Merced County and the most Latino parts of Stanislaus County (which required the division of Modesto). The district has a Latino population approximately 1 percent lower than that of Merced County itself. The only way to increase the Latino population of this district by use of Latinos within the same geographically compact area would be to use some of the Latino population used to build the high percentages we achieved in Districts 30 and 31, which would have an overall dilution effect, which we think is undesirable as well as violative of the spirit of the Act.\n\nDistricts 25, 29 and 32 are made up of the remainder of the San Joaquin Valley after creating Districts 26, 30 and 31 so as to maximize Latino population. District 25 has two major population centers, part of Modesto to the north, and the City of Madera and a small part of Fresno to the south. District 29 includes much of Fresno and most of Visalia, about 30 miles to the south. District 32 includes several Tulare County cities, including Exeter, Porterville and much of the City of Tulare, plus most of Bakersfield in Kern County.\n\n4. Southern California Region Districts\n\nThe Southern California Region is entitled to 48 assembly districts. Our approach, after creating minority districts in Los Angeles County, was to\n\ntreat San Luis Obispo, Santa Barbara, Ventura and Los Angeles Counties as a subunit entitled to slightly over 27 districts, and then include the small remainder of Los Angeles County with San Bernardino County. (Los Angeles County, thus, has no more divisions than absolutely necessary.) We also made an effort to keep the Mojave and other desert areas east of the Sierra Nevada intact because, in our view, it constitutes one of the major geographic regions of the state. Since we started with constructing minority districts in Los Angeles County, we will describe these first.\n\nDistricts 45, 46, 49, 50, 57 and 58 are Latino majority districts. We started both by tracing a line around census tracts with majority or near majority Latino population and by mapping out what areas were covered by Latino districts created by the various plans submitted to us. To a remarkable degree, these coincided and each showed it was possible to create six assembly districts with majority Latino populations. Based on this preliminary research we set about constructing these districts. We were also requested to take into account significant Asian populations in part of this overall area, and we endeavored to do so. District 57 which is located in the eastern San Gabriel Valley includes the cities of Azusa, Baldwin Park, El Monte and La Puente. It is 63.5 percent Latino in population (and 78 percent in overall minority population) and, based on the registration figures provided us, appears to have over 40 percent Latino registration. District 58 includes Montebello, Pico Rivera, Norwalk and the western part of Whittier. It is 62 percent Latino and almost 72 percent in total minorities and also apparently has well over 40 percent in Latino registration. District 49, centered on Monterey Park, Alhambra, San Gabriel and Rosemead, has only 55 percent Latino population, but the Latino registration appears to be over 44 percent. The district also has a large Asian presence--over 28 percent--and both Latino and Asian groups requested that this district include the four cities that form its basis. Districts 45 and 46 are based on the downtown and eastern parts of the City of Los Angeles. District 45 has 63 percent Latino population and District 46 has over 70 percent Latino population. The registration figures provided us show only about 35 percent Latino registration in each. However both districts have a large Asian presence--18 percent for District 45 and 14 percent for District 46 and the combined Asian and Latino registration in both exceeds 42 percent. District 45 is, overall, 84 percent minority and District 46 is over 91 percent minority. Initially, because of a request from Asian representatives we constructed District 45 to include most of the Asian population which is now split between the districts. (This population is located in the Westlake region just west of downtown Los Angeles in the western parts of both districts.) However, in this configuration, because of very low registration by both Latinos and Asians in this area, this appeared to dilute the voting strength of the Latinos\n\nin the district without creating a significant influence district for Asians.\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e For this reason we reconfigured the district to its present form. The sixth Latino district is District 50. This is composed almost entirely of small cities southeast of downtown Los Angeles, including Huntington Park, South Gate, Maywood and Bell Gardens. It has a Latino population of over 88 percent and an apparent Latino registration of approximately 55 percent. We were concerned that we had inadvertently packed Latino population in this district, but discovered that most other plans submitted to us had somewhat similar percentages for a district encompassing this area--MALDEF's plan, for example, had over 84 percent Latino population. A Latino delegation from the area had also urged us to create a district based on these cities. We explored whether there were any feasible methods to substantially reduce the concentration of Latinos, and ultimately concluded that none existed.\u003cspan class=\"fnref\"\u003e50\u003c/span\u003e\n\nDistricts 47, 48, 51, 52 and 55 are African-American majority districts. In this instance we accepted the definitions offered by almost every participant at our hearings who addressed the point,\u003cspan class=\"fnref\"\u003e51\u003c/span\u003e that an effective African-American majority is in the range of 35 percent to 40 percent of the total population. Our initial step was the same as for Latino districts, to map out the areas of African-American concentrations in south-central Los Angeles. While the areas of such concentration are obvious from an inspection of a map, the total population of African-Americans in the area is not enough to provide an effective majority for five assembly districts, which is the number of African-American members of the Assembly currently representing the area.\u003cspan class=\"fnref\"\u003e52\u003c/span\u003e All but one of the African-American districts created by us actually have more Latinos than African-Americans, although the apparent Latino registration in these areas is abysmally low.\u003cspan class=\"fnref\"\u003e53\u003c/span\u003e District 47 includes Culver City and the Crenshaw area of Los Angeles, and it is 40.5 percent African-American\n\nand over 70 percent minority in composition. District 48, almost entirely in the City of Los Angeles, includes the Exposition Park area south to the north border of Watts. It is over 46 percent African-American and, because of a huge, but, as noted, mostly nonvoting Latino population of 52 percent, the district is 98 percent minority. District 51 is centered on Inglewood and includes the city of Hawthorne as well as parts of south-central Los Angeles. It is 36.3 percent African-American and, overall, over 77 percent minority. District 52 is centered on Watts and the north part of Compton, and includes the cities of Gardena and Lynwood. It is also 36.3 percent African-American and 48.5 percent Latino, though the Latino registration is apparently only 11 percent of the total registration. The district is over 90 percent minority. The final African-American district is District 55, which includes the southern part of Compton, the City of Carson, the Wilmington area of Los Angeles and part of western Long Beach. Although it is 80 percent minority in composition, it is only 23.3 percent African-American. Despite this fact, however, the current representative of this area is African-American. When we first outlined the districts in the African-American area, this district had an even lower African-American population although it was close to 80 percent minority and included almost 20 percent Asians.\u003cspan class=\"fnref\"\u003e54\u003c/span\u003e In order to maintain the African-American basis for representation, we decided to recast District 55 by dividing the city of Compton in order to bring the number of African-Americans in the district up to the percentage of the existing district, although it brought both Districts 51 and 52 down to near the minimum that we felt necessary for an African-American majority district. The recommended District 55 is 17 percent Asian and over 40 percent Latino.\n\nDistricts 33, 35 and 37 are located in the counties northwest of Los Angeles. District 33 includes all of San Luis Obispo County and most of the populated area of Santa Barbara County north of the Santa Ynez Mountains, including Santa Maria and Lompoc. District 35 includes the remainder of Santa Barbara County (including the City of Santa Barbara) and the north and western parts of Ventura County (including the cities of Ventura, Ojai and Santa Paula.)\u003cspan class=\"fnref\"\u003e55\u003c/span\u003e District 37 includes most of the rest of Ventura County, including Oxnard, Camarillo and Thousand Oaks.\n\nDistricts 34 and 36 are located almost entirely in the Mojave and other desert areas east of the Sierra Nevada and north of the San Gabriel Mountains. District 34 includes Inyo County and the desert part of Kern County assigned to the Southern California Region as well as most of the desert part of San Bernardino County, including Barstow and Victorville. District 36 includes the Los Angeles part of the Mojave Desert, the Antelope Valley, including Palmdale and Lancaster. It also includes most of the City of Santa Clarita, north of the San Fernando Valley.\n\nDistricts 38, 39, 40, 41 and 43 are located in and adjacent to the San Fernando Valley. District 38 includes Simi Valley from Ventura County and the Castaic area north of the valley as well as the Chatsworth and Northridge areas in the northwest part of the valley. District 39 was designed to include the minority population of the northeastern part of the valley. It has over 62 percent Latino population (and over 75 percent overall minority population) though apparently Latinos constitute only 25 percent of the registered voters. District 40 includes Studio City, North Hollywood and Van Nuys and has the second highest percentage of Latinos (just under 30 percent) and total minorities (almost 42 percent) in the valley. District 41 includes the Woodland Hills area of the southwest part of the valley as well as Malibu, Calabasas, Pacific Palisades and Santa Monica. District 43 includes Burbank in the southeast corner of the valley, but is made up primarily of Glendale and the Griffith Park and Los Feliz areas near central Los Angeles.\n\nDistrict 42 includes Beverly Hills and the Hollywood, Westwood and Hancock Park areas of Los Angeles. It is bounded on the east and south by the Latino and African-American districts described above.\n\nDistricts 53, 54 and 56 are nonminority districts located in the southwest part of Los Angeles County. District 53 consists of coastal cities extending from the Venice area of Los Angeles through Torrance. (One tract of Rolling Hills Estates was included in this district to achieve population balance.) District 54 also is coastal, including the Palos Verdes Peninsula, San Pedro and the coastal section of Long Beach. District 56 includes Lakewood, part of North Long Beach, Cerritos, Bellflower and Downey.\n\nDistricts 44, 59 and 60 are located in the north and east parts of urban Los Angeles County. District 44 includes Pasadena, La Canada, and the Sunland-Tujunga area of the City of Los Angeles. District 59 includes Monrovia, San\n\nDimas, Covina and Claremont as well as part of Pomona.\u003cspan class=\"fnref\"\u003e56\u003c/span\u003e It is somewhat divided in effect because Azusa, which is a partial barrier between Monrovia and San Dimas, is part of a previously constructed Latino district. District 60 contains the remaining parts of Los Angeles County. It is centered in the east on West Covina and Diamond Bar, but it also includes La Mirada and part of Whittier. As explained earlier, its elongated shape is because the previously created Latino districts lie close to the Los Angeles County border.\n\nDistricts 61, 62, 63 and 65 are located wholly or primarily in San Bernardino County. Districts 61 and 62 were designed to concentrate minority areas in San Bernardino County into these two districts. As a result, District 61, which includes the more Latino part of Pomona from Los Angeles County and extends eastward through most of Ontario, is almost 55 percent minority, of whom almost 42 percent are Latino. District 62, extending from the edge of Ontario and including the parts of the City of San Bernardino\u003cspan class=\"fnref\"\u003e57\u003c/span\u003e that have minority concentrations, is over 56 percent in minority population including 39 percent Latinos and 12 percent African-Americans. The district also includes Colton, Rialto and Fontana. District 63 includes the areas to the north and east of Districts 61 and 62 which lie south of the San Gabriel Mountains and which have fewer minorities. This district includes Loma Linda, Upland and the nonminority parts of the City of San Bernardino. District 65 includes Redlands, Yucaipa, Big Bear and Twenty-Nine Palms in San Bernardino County and Moreno Valley, Hemet and San Jacinto in Riverside County to the south of Redlands and Yucaipa.\n\nDistricts 64, 66 and 80 are located wholly or primarily in Riverside County. District 64 includes all of the City of Riverside and adjacent Norco and about half of the City of Corona, which had to be split in order to obtain population equality. District 66 includes the rest of western Riverside County not included in Districts 65 or 64, including the remainder of Corona and all of Lake Elsinore and Temecula, plus a small part of San Diego County in the Fallbrook and Mount Palomar areas just to the south of Temecula. District 80 includes all of eastern Riverside County, including Beaumont, Banning, Palm Springs, Indio and Blythe as well as all of the County of Imperial. Combining Imperial County with the eastern part of Riverside County resulted in a district which is almost 46 percent Latino and almost 51 percent in total minority population.\n\nDistricts 67, 68, 69, 70, 71, 72 and 73 are all Orange County districts. The first district constructed by us was District 69, in order to maximize the\n\nLatino population. It includes most of Santa Ana and the more Latino parts of Garden Grove and central Anaheim. The result is a district which is 64.6 percent Latino and over 76 percent in total minority representation. (The Latino registration, however, appears to be under 25 percent.) The second district constructed was District 68, which was designed to include as many of the remaining concentrations of minorities (mainly Asian) in Orange County. This district includes the remainder of Garden Grove, the western part of Anaheim,\u003cspan class=\"fnref\"\u003e58\u003c/span\u003e and almost all of Buena Park. It is almost 17 percent Asian in population and, overall, is 42 percent minority in population. The remaining districts were constructed so as to be as compact as possible and to minimize the division of cities. District 67 includes the north coastal part of Orange County including Los Alamitos, Huntington Beach and Costa Mesa. District 70 includes the central coastal part of the county including Newport Beach, Laguna Beach and Irvine. District 72 includes the north interior part of the county, including Fullerton, La Habra and Yorba Linda. District 71 includes the south interior part of Orange County, including the City of Orange, Tustin and the eastern part of Anaheim. Finally, District 73 includes San Clemente, San Juan Capistrano and Mission Viejo in southern Orange County, and because additional population was needed, it also includes Camp Pendleton, Oceanside and a small part of Carlsbad (needed to equalize population) from northern San Diego County.\n\nDistricts 74, 75, 76, 77, 78 and 79 are all located entirely within San Diego County. We started with District 79 and centered it on the areas of greatest Latino and African-American concentrations. The district encompasses all of National City, about half of Chula Vista and the southernmost parts of the City of San Diego. The resulting district is over 76 percent in total minority population, with the Latino population at 49.3 percent, the African-American population at 16 percent and the Asian population at 11.2 percent. (The district resembles very closely one suggested by MALDEF in the plan submitted by that organization.) District 77 was the next to be constructed and it includes the remainder of Chula Vista, part of the City of San Diego and the inland cities of Lemon Grove, La Mesa and El Cajon just east of the City of San Diego. This district has the second greatest concentration of minorities in San Diego County at 34.7 percent. District 78 is coastal in orientation and extends from Imperial Beach in the south through Coronado and reaches the La Jolla area of the City of San Diego to the north. It also includes the Mission Bay area of the city. The district is quite elongated in the south, but this was due to our decision not to dilute the minority\n\npercentage in adjacent District 79 by including predominately nonminority Imperial Beach and Coronado in that district. The district is well served by freeways and the Coronado Bridge, the main access to Coronado, is wholly within the district. District 76 lies wholly within the City of San Diego and includes most of its northern interior area, from Mission Valley to the south almost to Rancho Bernardo in the north. District 75 includes all of eastern San Diego County including mountain and desert areas (such as Ramona and Borrego Springs) but its main population centers are Santee, Poway and the most northerly reaches of the City of San Diego. The final district to be described, District 74 (which, along with District 73, was actually the last district that we constructed), contains the northern San Diego cities of Escondido, Vista and San Marcos and the small north county beach cities such as Encinitas and Solana Beach. It also includes most of the City of Carlsbad, which, as noted before, had to be split to equalize population.\n\nB. Senate Plan\n\n1. In General\n\nEvery senate district in the state consists of entire census tracts and each district varies by less than one percent from the ideal size of 744,000 persons. A computer generated map showing the various districts proposed by us is set out as part of Appendix One of our report. The population of each proposed district is set out in Appendix Two. Since senate districts are made up of assembly districts, the listing of the census tracts contained in each proposed district can be obtained by reference to the census tracts for the constituent assembly districts in Appendix Three.\n\nThe order from the Supreme Court, in instructing us to follow the criteria set forth in Reinecke IV, required us to join adjacent assembly districts in creating senate districts, a practice now known as \"nesting.\" Because we are also required to comply with the Act, we would be excused from this requirement if to do so would require us to violate the Act. However, we did not find any conflict between the Act and the nesting that we propose, and so our plan consists of fully nested senate districts. We designed assembly districts in part to allow for easy and appropriate nesting and since our assembly districts have already been described in some detail, we shall be more brief in the following descriptions. Since our senate districts differ in substantial ways from the existing senate districts, and population changes since 1980 have, in effect, moved entire senate districts from one area to another (e.g., from central Los Angeles to more southerly reaches of the\n\nstate) it is impossible to provide a numbering scheme which closely parallels the existing districts.\u003cspan class=\"fnref\"\u003e59\u003c/span\u003e We have tried to assign the numbers rationally.\u003cspan class=\"fnref\"\u003e60\u003c/span\u003e\n\n2. North Coastal Region Districts\n\nThe north coastal region has 18 assembly districts, hence is entitled to 9 senate districts.\n\nSenate District 2 : Assembly Districts 1 and 7. This is located in the same general area of the current Senate District 2, and extends from Del Norte County on the north through Vallejo in the south. Since there are only three assembly districts north of the Golden Gate and the Carquinez Strait, one of them had to be joined with an assembly district to the south. The only two possible combinations were to join Santa Rosa and Napa to northern Contra Costa County or Marin and southern Sonoma Counties to San Francisco. We chose the latter as being preferable.\n\nSenate District 3 : Assembly Districts 6 and 13. This also is located in the same general area as the current Senate District 3. It does divide San Francisco and includes all of Marin County and some of Sonoma County. We did have, however, requests submitted to us supporting such a division of San Francisco.\n\nSenate District 8 : Assembly Districts 12 and 19. This includes the remainder of San Francisco and is similar to the current Senate District 8. It also allows a substantial Asian community in San Mateo County to be included with the bulk of the San Francisco Asian community.\n\nSenate District 7 : Assembly Districts 11 and 15. This includes most of Contra Costa County as does the present Senate District 7.\n\nSenate District 9 : Assembly Districts 14 and 16. This includes most of the geographically compact African-American population of the East Bay and creates a district which is 32.4 percent African-American and almost 60 percent minority in population. It is both a functionally compact district and complies with the Act. The Senate has suggested that putting as many as 30 percent African-Americans in a single district may constitute \"packing,\" but this is contrary to testimony of many African-American representatives who\n\nappeared before us suggesting that an effective African-American majority district should have, at minimum, close to 35 percent African-American population. We also note that there has never been an African-American heretofore elected to the Senate from any area included in our proposed district.\n\nSenate District 10 : Assembly Districts 18 and 20. This area contains most of the area along the eastern shore of San Francisco Bay south of Oakland.\n\nSenate District 11 : Assembly Districts 21 and 24. This resembles the current Senate District 11, and consists of the southern part of San Mateo County and the more southeasterly part of the Santa Clara Valley.\n\nSenate District 13 : Assembly Districts 22 and 23. This district has a minority population of over 50 percent, composed mainly of Latinos and Asians. It covers the northern part of Santa Clara County.\n\nSenate District 15 : Assembly Districts 27 and 28. This district reunites previously divided Monterey and Santa Cruz Counties and resembles the current Senate District 17.\n\n3. North Interior Region Districts\n\nThe North Interior Region has 14 assembly districts, hence is entitled to 7 senate districts.\n\nSenate District 1 : Assembly Districts 3 and 4. This district includes the Mother Lode counties and other mountain counties.\n\nSenate District 4 : Assembly Districts 2 and 8. This district includes almost all of the agricultural parts of the Sacramento Valley. It makes whole Yolo County, which had been divided for population equality reasons in formation of the constituent assembly districts.\n\nSenate District 6 : Assembly Districts 5 and 9. This district is located wholly within Sacramento County.\n\nSenate District 5 : Assembly Districts 10 and 17. This district includes the southern part of Sacramento County and almost the whole of San Joaquin County.\n\nSenate District 12 : Assembly Districts 25 and 26. This district reunites Stanislaus County and the City of Modesto. It includes the more northerly parts of the San Joaquin Valley.\n\nSenate District 14 : Assembly Districts 29 and 32. This district consists of the \"non-Latino\" assembly districts in the southern part of the San Joaquin Valley.\n\nSenate District 16 : Assembly Districts 30 and 31. As noted earlier, these assembly districts were drawn so that, when paired, they would produce a senate district which is 50.8 percent Latino in population and has a total minority population of 64 percent.\n\n4. Southern California Region Districts\n\nSince Southern California has 48 assembly districts, it is entitled to 24 senate districts.\n\nSenate District 17 : Assembly Districts 34 and 36. This district combines the two assembly districts located in the Mojave and other desert regions east of the Sierra Nevada into a senate district, thus preserving the integrity of this geographic region.\n\nSenate District 18 : Assembly Districts 33 and 35. This district includes Santa Luis Obispo, Santa Barbara and the western part of Ventura County.\n\nSenate District 19 : Assembly Districts 37 and 38. This district includes the eastern part of Ventura County and an adjacent part of the northwest sector of the San Fernando Valley in Los Angeles.\n\nSenate District 20 : Assembly Districts 39 and 40. This district combines the two assembly districts in the San Fernando Valley with the greatest number of minorities, the result being a senate district with a 46 percent Latino population and a 58 percent total minority population.\n\nSenate District 21 : Assembly Districts 43 and 44. This district includes the suburbs of Glendale and Pasadena to the north and northeast of the City of Los Angeles.\n\nSenate District 22 : Assembly Districts 45 and 46. This district is centered on downtown Los Angeles and the eastern part of the city. It is heavily Latino and has a substantial Asian presence as well.\n\nSenate District 23 : Assembly Districts 41 and 42. This district includes the Hancock Park and Westwood areas of the City of Los Angeles as well as Beverly Hills, Santa Monica and the Malibu area.\n\nSenate District 24 : Assembly Districts 49 and 57. This district includes much of the San Gabriel Valley and is a Latino majority district.\n\nSenate District 25 : Assembly Districts 51 and 52. This is an African-American majority district centered on Inglewood, Watts and the north part of Compton.\n\nSenate District 26 : Assembly Districts 47 and 48. This is the second African-American majority district in Los Angeles County. It includes the Crenshaw and Exposition Park areas of the City of Los Angeles as well as Culver City.\n\nSenate District 27 : Assembly Districts 54 and 56. This district includes the Palos Verdes Peninsula, Lakewood, Downey and most of Long Beach.\n\nSenate District 28 : Assembly Districts 53 and 55. This district includes much of the area bordering on Santa Monica Bay including most of Torrance and the area inland from Torrance including Carson and part of Compton.\n\nSenate District 29 : Assembly Districts 59 and 60. This is the easternmost senate district in Los Angeles County and the problems involved in constructing the constituent assembly districts described earlier are magnified by the combination of the two into this senate district. Even though somewhat oddly shaped, virtually all of the population is located within 10 miles of West Covina (the central point in the district) and it is well served by freeways.\n\nSenate District 30 : Assembly Districts 50 and 58. This district is the third Latino majority senate district and it is located in the area southeast of downtown Los Angeles and includes Huntington Park, Montebello and Norwalk.\n\nSenate District 31 : Assembly Districts 63 and 65. This district combines the two assembly districts in San Bernardino County with the smallest minority populations.\n\nSenate District 32 : Assembly Districts 61 and 62. This district combines the two assembly districts in San Bernardino County with the largest minority populations. The resulting senate district is just over 40 percent Latino and over 55 percent in total minority population. The new district is similar to the current Senate District 34.\n\nSenate District 33 : Assembly Districts 71 and 72. This district includes most of interior Orange County.\n\nSenate District 34 : Assembly Districts 68 and 69. This district combines the two assembly districts in Orange County with the largest minority\n\npopulation. The resulting senate district is almost 44 percent Latino and almost 60 percent in total minority population because of a substantial Asian presence.\n\nSenate District 35 : Assembly Districts 67 and 70. This district includes most of coastal Orange County.\n\nSenate District 36 : Assembly Districts 64 and 66. This district includes the westernmost part of Riverside County.\n\nSenate District 37 : Assembly Districts 75 and 80. This district includes the most rural part of San Diego County, all of Imperial County and eastern Riverside County. Several persons who appeared before us urged us to consider combining Imperial County with the Latino part of San Diego in legislative districts, and MALDEF and the Senate both combine these areas in the senate districts that they recommend.\u003cspan class=\"fnref\"\u003e61\u003c/span\u003e We considered this alternative (which in our planning would have to be done by combining a somewhat redrawn Assembly District 79 with Assembly District 80) but ultimately rejected the concept. Though there are a large number of Latinos in both San Diego and Imperial Counties, they are widely separated and do not constitute a single geographically compact minority group. Further, the interests of urban Latinos may well be different than those in agricultural Imperial County. Finally, to connect them with anything but a narrow corridor\u003cspan class=\"fnref\"\u003e62\u003c/span\u003e along the border in southern San Diego County would dilute the existing minority population in our proposed Assembly District 79.\n\nSenate District 38 : Assembly Districts 73 and 74. This district includes the northern part of San Diego and the southernmost part of Orange County. It reunites Carlsbad, which was split in the underlying assembly districts for population equality reasons.\n\nSenate District 39 : Assembly Districts 76 and 78. This district combines the two assembly districts in southern San Diego County with the smallest minority populations.\n\nSenate District 40 : Assembly Districts 77 and 79. This district combines the two assembly districts in southern San Diego County with the largest minority populations. Though the resulting district is only 32 percent Latino, it is 55 percent in overall minority population due to a substantial Asian and some African-American population. The district also reunites Chula Vista.\n\nC. Congressional Plan\n\n1. In General\n\nEvery congressional district in the state consists of entire census tracts, and each district varies by no more than 0.25 percent from the ideal size of 572,308 persons. A computer generated map showing the various districts proposed by us is set out as part of Appendix One of our report. The population of each proposed district is set out in Appendix Two. A listing of the census tracts contained in each proposed district is set out in Appendix Three.\n\n2. Northern Coastal Region Districts\n\nThe Northern Coastal Region is entitled to 12 congressional districts.\n\nDistricts 1 and 6 are in the northernmost part of this region. District 1 includes all of Del Norte, Humboldt, Mendocino, Lake and Napa Counties, Geyserville and Healdsburg in Sonoma County and Fairfield and part of Vacaville in Solano County.\u003cspan class=\"fnref\"\u003e63\u003c/span\u003e This area is mostly rural with some suburban areas in the southern part of the district. District 6 includes most of Sonoma County and all of Marin County. It is primarily suburban.\n\nDistricts 8, 12 and 14 : These districts occupy the San Francisco Peninsula. District 8 constitutes most of San Francisco and is almost 56 percent minority in population. District 12 includes the southwest corner of San Francisco and northern San Mateo County. A small part of Belmont on the southern edge of the district had to be cut in order to achieve the necessary population balance. District 14 includes the remainder of San Mateo County and a compact area of northwest Santa Clara County including the cities of Palo Alto, Mountain View, Sunnyvale and Cupertino.\n\nDistricts 7, 9, 10 and 13 are located in the East Bay. District 7 includes Richmond and the Contra Costa cities on or near San Pablo Bay, the Carquinez Strait or Suisun Bay, including Pittsburg and Concord. The\n\ndistrict also includes Vallejo and Benecia on the northern side of the Carquinez Strait. Since significant numbers of African- Americans live in Richmond, San Pablo, Vallejo and Pittsburg, the district has a 16.6 percent African-American population and a total minority population of 44 percent. In this congressional district we were able to honor the request of a number of citizens that Richmond not be included in a district that also included Oakland. District 9 includes all of north Alameda County, including Berkeley and all but four census tracts of Oakland. It has an African-American population of 31.9 percent (and an overall minority population of 58.9 percent) and, in our view, it is an effective African-American majority district. District 10 includes all of Contra Costa and Alameda Counties east of the East Bay Hills plus the unincorporated Castro Valley area west of the hills, which had to be included for population equality reasons. District 13 includes all of Alameda County along the shore of San Francisco Bay south of Oakland including San Leandro, Hayward and Fremont. It also has part of Milpitas in an adjacent part of Santa Clara County which was necessary to add for population equality reasons.\n\nDistricts 15, 16 and 17 constitute the southernmost part of this region. District 15 includes the central part of Santa Clara County including the cities of Santa Clara, Los Gatos, Saratoga, Campbell and much of eastern and southern San Jose. It also includes some of northern Santa Cruz County, including Scotts Valley, an outpost of \"Silicon Valley.\" District 16 includes all of the eastern part of San Jose and the southern part of the county. It includes most of the Latino population and much of the Asian population of the area. As a result it is almost 37 percent Latino and over 62 percent total minority in population. District 17 includes all of Monterey and San Benito Counties and most of Santa Cruz County. It is very similar to the current congressional district in the area.\n\n3. North Interior Region Districts\n\nThe North Interior Region is entitled to nine congressional districts.\n\nDistricts 2, 3 and 4 include the northern agricultural region and most of the mountain areas of the region. District 2 includes all of the rural mountain counties of Trinity, Siskiyou, Shasta, Modoc, Lassen, Plumas, Sierra, Yuba and Nevada Counties, and all but two census tracts of Butte County. (The division of Butte was necessary for population equality reasons.) District 3 includes all of the Sacramento Valley counties of Tehama, Glenn, Colusa, Sutter, and Yolo and the eastern part of Solano County including Dixon and\n\npart of Vacaville.\u003cspan class=\"fnref\"\u003e64\u003c/span\u003e It also includes part of suburban Sacramento County north of the City of Sacramento. District 4 includes the \"Mother Lode\" counties of Placer, El Dorado, Amador, Calaveras and Tuolumne and the mountain counties of Alpine and Mono. It also includes the northeastern corner of Sacramento County, including the City of Folsom.\n\nDistricts 5, 11 and 18 are located in the middle of the Central Valley. District 5 is entirely urban, and includes the City of Sacramento. District 11 includes the southern and eastern parts of Sacramento County and all but two census tracts of San Joaquin County. District 18 includes all of Stanislaus and Merced Counties and small parts of adjacent San Joaquin, Madera and Fresno Counties necessary to achieve population balance.\n\nDistricts 19, 20 and 21 are located in the southern part of the San Joaquin Valley. As with Assembly districts 30 and 31, because of the need to obtain preclearance from the Attorney General without any delay whatsoever, the first step in constructing districts was an attempt to construct a district which would include Kings County and would have the maximum feasible Latino population. Again, because of the circumstances we modified what we ordinarily would have considered controlling state law criteria. The result was District 20, which divides Fresno, Visalia, Tulare and Bakersfield (the latter by a \"hook\" encircling the city to the south and then the east.) However, we achieved a district with 55.4 Latino population and an overall minority population of over 67 percent. Districts 19 and 21 include the territory of the region remaining from constructing District 20.\n\n4. Southern California Region Districts\n\nSouthern California is entitled to 31 congressional districts. Because we started with minority districts in Los Angeles County, we will begin our descriptions with them.\n\nDistricts 30, 31, 33 and 34 were designed to be majority Latino districts. District 30 is entirely within the City of Los Angeles, extending from the northeastern border through downtown and into the Westlake district. It has 61.5 percent Latino population and an additional 19.8 percent Asian population. (The total minority population is 84.8 percent.) The Latino registration is, apparently, 34 percent and the Asian registration is an additional 7 percent. District 31 is 58.5 percent Latino and an additional 22.1 percent Asian. It includes the area from Alhambra and Monterey Park on the west through El Monte to Azusa on the east. The Latino registration is apparently\n\nover 41 percent. District 33 includes part of downtown Los Angeles and the many small communities to the southeast, such as Huntington Park, Maywood and South Gate. The Latino population is almost 84 percent of the district and over 48 percent of the registered voters. District 34 includes Montebello, Pico Rivera, Norwalk, La Puente and part of Whittier. It is over 62 percent Latino in population and over 43 percent Latino in registration.\n\nDistricts 32, 35 and 37 were designed to be effective majority African-American districts. District 32, including the Crenshaw and Exposition Park areas of Los Angeles as well as Culver City, is 40.3 percent African-American. District 35, which includes Inglewood and Hawthorne as well as part of south-central Los Angeles, is 42.7 percent African-American. District 37, which includes Watts and Compton as well as Carson, the Wilmington area of Los Angeles and part of downtown Long Beach, is 33.6 percent African-American (and has a total minority population of 88 percent). The largest minority in the district is Latino at 45 percent, but Latinos constitute only 13 percent of the registered voters.\n\nDistricts 22 and 23 are located northwest of Los Angeles County. District 22 includes all of San Luis Obispo County and almost all of Santa Barbara County. (Carpinteria, at the extreme southeast part of the county, had to be combined with Ventura County because of the strict population guidelines for congressional districts.) District 23 includes all of Ventura County except for most of Thousand Oaks. (One census tract had to be severed from Thousand Oaks to achieve population equality.)\n\nDistricts 24, 25 and 26 include the San Fernando Valley and the Antelope Valley in the Los Angeles part of the Mojave Desert Region. District 24 includes Thousand Oaks in Ventura County, the Malibu and Calabasas areas of western Los Angeles County, and the southwestern part of the San Fernando Valley. District 25 includes all of Antelope Valley (Palmdale and Lancaster) and the new city of Santa Clarita north of the San Fernando Valley. (The area north of the San Fernando Valley constitutes about two-thirds of the district's population. The remainder of the population comes from the Chatsworth and Northridge areas in the northwestern part of the San Fernando Valley.) District 26 encompasses the heavily Latino areas of northeast San Fernando Valley. The district is 52.7 percent Latino and, overall, almost 66 percent minority.\n\nDistricts 27, 28, 29, 36 and 38 are the remaining districts in Los Angeles that fit around the periphery of the Latino and African-American majority districts heretofore described. District 27 is directly north of downtown Los Angeles and includes the suburbs of Burbank, Glendale and Pasadena.\n\nDistrict 28 includes the northern parts of the San Gabriel and Pomona Valleys and like Assembly District 59, of which it is an enlarged version, it is somewhat divided by Azusa, which is part of a previously created Latino majority district. This district includes Arcadia, Monrovia, San Dimas, Claremont, Covina, West Covina and part of Pomona. District 29 includes Beverly Hills and Santa Monica, and the westside of the City of Los Angeles (including Hancock Park and Westwood and both slopes of the Hollywood Hills and the Santa Monica Mountains). District 36 encompasses the various cities of the southern stretch of Santa Monica Bay, from Venice and Westchester in the City of Los Angeles through the Palos Verdes Peninsula. Its eastern side is defined by the African-American majority districts previously described. District 38 is the last whole district located in Los Angeles County. It includes most of Long Beach and Lakewood and all of Bellflower, Paramount and Downey.\n\nDistricts 39 and 41 include the parts of Los Angeles County not included in other districts lying wholly within the county. This population constitutes about two-thirds of a district in population, but because of the boundaries of the Latino majority districts, the population is within a narrow strip running from Hawaiian Gardens to the southwest to Pomona at the northeast. While it would be technically possible to include all of this area in a single district with Orange County (thus bringing the number of divisions of Los Angeles County down to the bare minimum) this population was divided between two more functionally compact districts created in Orange and San Bernardino Counties. (This also has the effect of avoiding an additional division of Riverside County.) District 39 includes Cerritos, La Mirada, La Habra Heights and part of Whittier from Los Angeles County and Rossmoor, Cypress, Buena Park, Fullerton, Brea and La Habra from Orange County. District 41 includes Diamond Bar and part of Pomona from Los Angeles County, Upland, Montclair, Chino and part of Ontario from San Bernardino County and Yorba Linda and a small part of Anaheim from the northeast corner of Orange County. Because of a concentration of African- Americans in Pomona, and a significant number of Asians, especially in Diamond Bar, as well as a substantial number of Latinos, the district is 48 percent minority.\n\nDistricts 40 and 42 include all of San Bernardino County not included in District 41. District 40 includes all of the desert areas located in San Bernardino County and all of Inyo County. This constitutes about two-thirds of the population of the district. The remainder of the population is in the mountains--Big Bear and Arrowhead--and in Redlands, Loma Linda and Yucaipa, all in San Bernardino County. District 42 includes most of the City of San Bernardino, all of Colton, Rialto, Fontana and Rancho Cucamonga, and part of Ontario. The district has a total minority population of over 49 percent.\n\nDistricts 43 and 44 constitute all of Riverside County except for Temecula, which is attached to neighboring San Diego County. District 43 includes the western part of the county, including Riverside, Corona and Lake Elsinore. It also includes part of Perris, which had to be divided to achieve population equality. District 44 includes all of the eastern part of the county, from Moreno Valley and part of Perris on the west to Blythe on the eastern border.\n\nDistricts 45, 46 and 47 constitute the central part of Orange County. District 46 was constructed first to maximize the minority population. The district includes most of Santa Ana, all of Garden Grove and the central part of Anaheim. The resulting total minority population is over 64 percent, including 50 percent Latino and almost 12 percent Asian. District 45 contains the north coastal part of Orange County, including Seal Beach, Stanton, Huntington Beach, Fountain Valley, Costa Mesa and part of Newport Beach. District 47 contains much of interior Orange County and part of the central coast of the county, and includes Orange, Tustin, Irvine, Laguna Beach, and part of Newport Beach. It also includes a small part of Mission Viejo which was necessary to achieve population equality.\n\nDistricts 48, 49, 50, 51 and 52 are partly or wholly within San Diego County. District 48 includes southern Orange County, including most of Mission Viejo, and all of San Juan Capistrano and San Clemente. It includes the cities of Oceanside and Vista as well as the Camp Pendleton, Fallbrook and Mount Palomar areas of northern San Diego County. It also includes a small part of Carlsbad needed to achieve population parity. Finally, it includes Temecula, which is in Riverside County just north of Fallbrook. District 50 was the first district designed in San Diego County and it is an expanded version of Assembly District 79, designed to include as many Latinos and other minorities as possible in southern San Diego. The resulting minority population figures are 40.8 percent Latino, 13.7 percent African-American, 13.7 percent Asian and a total minority population of 69 percent. District 49 is an expanded version of Assembly District 78 running along the coast from Imperial Beach and Coronado to the north of the La Jolla area but taking in a larger part of the northern interior part of the City of San Diego. District 51 includes most of the north central area of San Diego County, including Escondido, San Marcos, the far northern reaches of the City of San Diego and beach communities such as Encinitas and Leucadia. Finally, District 52 includes the cities of La Mesa, El Cajon and Santee, which are inland from the City of San Diego, as well as most of rural interior San Diego County. It also includes all of Imperial County.\n\nD. State Board of Equalization Plan\n\nThe State Board of Equalization consists of four districts for the state, the ideal population of each of which is 7,440,005 persons. We received three plans\n\nfor this board: one from the Governor's Independent Commission, one from the Assembly Republican Caucus and one from the State Board of Equalization itself. The Commission and Caucus plans each nested 10 Senate districts to form each State Board of Equalization district. The State Board of Equalization criticized these plans because they cut county lines unnecessarily and ignored the administrative districts of the board. Since the board has many administrative, adjudicatory and regulatory responsibilities (unlike the Legislature), observing county lines and administrative districts is important. The board submitted a plan which divided only three counties and three administrative districts.\n\nWe agree with the rationale of the State Board of Equalization but found that we could draw a plan which also divided only three out of the eleven administrative districts but which divided only one county.\u003cspan class=\"fnref\"\u003e65\u003c/span\u003e Further, our plan creates a minority influence district in Los Angeles County. The maximum population deviation in our plan is less than 1 percent. A computer-generated map showing the various districts proposed by us is set out as part of Appendix One of our report. The population of each proposed district is set out in Appendix Two. A listing of the counties, and for Los Angeles County, the census tracts contained in Districts 2 and 3, are set out in Appendix Three.\n\nTherefore, we recommend the plan we devised for the State Board of Equalization.\u003cspan class=\"fnref\"\u003e66\u003c/span\u003e\n\nVI. Other Considerations\n\nA. \"Political Fairness\" and Incumbent Status\n\nBriefs presented to us have raised the issue of \"political fairness,\" i.e., the drawing of district lines so as not to advantage one political party or the other. While it has been understood and accepted that we would not employ\n\npartisan data in the drawing of district lines, it has been suggested that after drawing district boundaries we should apply a political test reviewing the proposed districts in terms of their current partisan registration or a previous statewide election.\n\nWe have not done so, for three reasons. First, we note that our instructions from the Supreme Court make no reference to evaluating districts in terms of partisan political criteria, such as determining the \"safeness\" or \"competitiveness\" of a particular district. Indeed, the court has made clear that redistricting involves \"peculiarly political questions that are not appropriate for this court to decide.\" (Silver v. Brown (1965) 63 Cal. 2d 270, 280 [46 Cal. Rptr. 308, 405 P.2d 132].) We agree. We are here, not as a matter of choice, but because the court--confronted by an impasse between the Legislature and the Governor--has instructed us to recommend a districting plan.\n\nSecond, even if we had wished to do so, the time constraints under which we have been required to operate would have precluded the development of a political litmus test in which we would have confidence. The days of analysis required to conduct such a test and to make adjustments would have made it impossible to meet an already difficult deadline.\n\nFinally, the various \"fairness\" tests suggested to us, which are based on past political history, offer incomplete and often conflicting guidelines as to future electoral behavior. We conclude that the complexity and dramatically changing demographic and social environment of California preclude the use of simple formulae. Instead, an analysis of \"political fairness\" in California in the 1990's will include recognition of the duplication and \"deadwood\" in the registration rolls; the change in the composition of two-party registration (i.e., the relative decline in the share of registered Democrats) and the resulting change in the nature of the vote-registration ratio;\u003cspan class=\"fnref\"\u003e67\u003c/span\u003e the increase in third-party and decline-to-state registrants, now well over 10 percent of the total; the critical decline in voter participation; the vastly different vote-registration ratios of incumbents compared with contestants in open districts; the impact of candidate personality, policy issues, and campaign finance; the potential political mobilization of millions of unregistered citizens and the prospect of citizenship for large numbers of permanent resident aliens; and, last but not least, term limits.\n\nWe leave this analysis to others better able and more highly motivated to do so, underscoring again that we did not use political data in the drawing of district lines.\n\nNor have we drawn boundaries on the basis of their impact on incumbents. In 1973, in responding to the contention that the Special Masters should have accepted the existing relationship between incumbents and their constituencies as an additional criterion, the Supreme Court stated:\n\n\"We agree that there are values in maintaining such relationships and also in making it possible for competent incumbents to seek reelection without being placed in unduly disadvantageous positions. We agree with the Masters, however, that these values should not be pursued by designing district boundaries to promote the reelection of incumbents. Except in those relatively rare cases where population shifts are so extensive that it would be difficult or impossible for particular incumbents to be reelected even under a proincumbent districting plan, incumbent-neutral districting will not preclude each incumbent from seeking reelection in a new district that will contain a substantial part of his former constituency. Moreover, each incumbent will retain the advantage of running as a sitting congressman or state legislator, as the case may be. To go further and to give incumbents the additional advantage of districting designed to preserve the status quo would be unfair both to nonincumbent candidates and to the electors of the new districts who wished to support such candidates.\" (Reinecke IV, supra, 10 Cal. 3d at p. 402).\n\nIn 1973, the Special Masters had observed that there would be instances in which it would be necessary for some incumbents \"to change their residences if they wish to seek reelection in the areas encompassed within their former districts.\" (Reinecke IV, supra, 10 Cal. 3d at p. 446.) Unquestionably this will also be true in 1992, under this or any other plan. We note, however, that there is no longer a durational residence requirement within a district as a condition of candidacy for state legislative office and, indeed, that members of Congress need only reside within the state. Moreover, while some plans submitted to us were criticized because they often placed two or more incumbent legislators in the same district, none of the information presented to us by any participant included the residential status of existing officeholders. Thus, we have no way of knowing to what degree our plans have this effect. This plan, then, is \"incumbent neutral.\"\n\nB. Final Disposition of Materials\n\nA request has been received from the University of California Institute of Governmental Studies in Berkeley that its facilities be used as a depository of all material lodged with the Masters, with the understanding that the materials received will be safely stored, catalogued and made available for public and scholarly use. It is recommended, when the judgment in this\n\naction becomes final, that pertinent materials that have been lodged with the Masters be released to the Institute of Governmental Studies for storing and use as requested, upon the conditions noted. We note that the court approved a similar recommendation in 1973.\n\nRespectfully submitted November 29, 1991\n\nGeorge A. Brown, Presiding Master\n\nRafael H. Galceran, Special Master\n\nThomas Kongsgaard, Special Master\n\nAppendices One and Three to the Report and Recommendations of the Special Masters, setting forth plans for reapportioning legislative, congressional and State Board of Equalization districts, and as corrected by the Masters for clerical errors, are on file with the Clerk of the Supreme Court.\n\nAppendix Two to the Report follows:\n\nAPPENDIX TWO\n\nPOPULATION STATISTICS BY DISTICT\n\nASSEMBLY STATISTICS PAGES 798 THROUGH 805\n\nSENATE STATISTICS PAGES 806 THROUGH 809\n\nCONGRESSIONAL STATISTICS PAGES 810 THROUGH 815\n\nBOARD OF EQUALIZATION STATISTICS PAGE 815\n\nCalifornia Assembly District Population Totals\n\nIdeally 372,000 per district\n\nTotal Latino Afr. Am Asian NL White Non White Dev.\n\nAssembly District 1\n\n371,929 31,757 3,927 5,522 317,933 53,996 -0.02\n\nAssembly District 2\n\n371,384 38,408 3,589 10,613 310,039 61,345 -0.17\n\nAssembly District 3\n\n369,692 25,793 6,891 10,314 319,812 49,880 -0.62\n\nAssembly District 4\n\n371,897 28,082 3,554 6,459 329,172 42,725 -0.03\n\nAssembly District 5\n\n375,099 27,045 17,002 14,195 313,260 61,839 0.83\n\nAssembly District 6\n\n372,511 32,254 10,829 13,772 314,151 58,360 0.14\n\nAssembly District 7\n\n371,413 42,845 26,557 29,712 269,678 101,735 -0.16\n\nAssembly District 8\n\n373,328 61,989 26,196 30,057 252,899 120,429 0.36\n\nAssembly District 9\n\n375,288 67,083 62,626 56,959 185,971 189,317 0.88\n\nAssembly District 10\n\n375,363 42,329 17,425 24,261 288,403 86,960 0.90\n\nAssembly District 11\n\n374,135 49,646 21,747 36,494 263,830 110,305 0.57\n\nAssembly District 12\n\n373,814 49,613 29,555 134,047 159,730 214,084 0.49\n\nAssembly District 13\n\n373,494 57,329 51,255 80,643 183,638 189,856 0.40\n\nAssembly District 14\n\n374,409 39,339 109,014 46,493 178,827 195,582 0.65\n\nAssembly District 15\n\n372,051 27,537 6,885 21,745 314,127 57,924 0.01\n\nAssembly District 16\n\n370,199 53,843 130,943 61,392 124,653 245,546 -0.48\n\nAssembly District 17\n\n375,544 92,681 25,424 51,867 204,165 171,379 0.95\n\nAssembly District 18\n\n369,038 70,144 26,901 53,702 216,554 152,484 -0.80\n\nAssembly District 19\n\n371,800 63,026 15,350 77,710 214,297 157,503 -0.05\n\nAssembly District 20\n\n371,930 58,361 15,674 87,731 208,218 163,712 -0.02\n\nAssembly District 21\n\n369,007 51,001 21,235 32,775 263,171 105,836 -0.80\n\nAssembly District 22\n\n369,460 50,967 12,358 58,766 246,070 123,390 -0.68\n\nAssembly District 23\n\n369,533 160,578 22,238 71,686 114,032 255,501 -0.66\n\nAssembly District 24\n\n375,029 35,723 7,443 42,483 287,778 87,251 0.81\n\nAssembly District 25\n\n374,562 66,323 7,965 12,332 283,193 91,369 0.69\n\nAssembly District 26\n\n373,571 114,110 13,449 24,668 218,460 155,111 0.42\n\nAssembly District 27\n\n368,829 48,140 19,220 21,456 278,185 90,644 -0.85\n\nAssembly District 28\n\n373,436 170,915 10,226 27,949 162,338 211,098 0.39\n\nAssembly District 29\n\n372,877 74,805 9,656 20,989 263,881 108,996 0.24\n\nAssembly District 30\n\n370,999 183,654 23,868 12,434 148,404 222,595 -0.27\n\nAssembly District 31\n\n372,229 194,218 24,030 35,822 115,947 256,282 0.06\n\nAssembly District 32\n\n370,853 75,233 12,344 10,076 267,965 102,888 -0.31\n\nAssembly District 33\n\n373,715 78,492 12,402 12,930 268,824 104,891 0.46\n\nAssembly District 34\n\n372,115 59,621 20,476 8,432 278,196 93,919 0.03\n\nAssembly District 35\n\n369,411 87,385 5,505 10,962 263,256 106,155 -0.70\n\nAssembly District 36\n\n370,469 59,862 17,758 13,124 277,254 93,215 -0.41\n\nAssembly District 37\n\n369,829 114,922 11,950 22,478 219,231 150,598 -0.58\n\nAssembly District 38\n\n372,809 60,638 10,856 33,013 267,639 105,170 0.22\n\nAssembly District 39\n\n370,433 230,431 24,694 23,072 92,032 278,401 -0.42\n\nAssembly District 40\n\n372,858 110,827 15,772 28,219 217,209 155,649 0.23\n\nAssembly District 41\n\n371,739 36,022 8,720 21,450 304,583 67,156 -0.07\n\nAssembly District 42\n\n371,055 37,538 12,373 27,566 292,786 78,269 -0.25\n\nAssembly District 43\n\n373,916 93,465 8,479 43,855 227,063 146,853 0.52\n\nAssembly District 44\n\n374,210 71,522 44,431 40,720 217,738 156,472 0.59\n\nAssembly District 45\n\n370,001 233,707 8,922 67,770 58,853 311,148 -0.54\n\nAssembly District 46\n\n371,632 261,285 26,763 53,235 31,630 340,002 -0.10\n\nAssembly District 47\n\n373,032 84,803 150,891 30,244 110,881 262,151 0.28\n\nAssembly District 48\n\n373,964 194,457 172,670 8,982 9,003 364,961 0.53\n\nAssembly District 49\n\n371,807 204,924 5,345 105,031 55,610 316,197 -0.05\n\nAssembly District 50\n\n370,129 328,006 8,265 3,519 29,727 340,402 -0.50\n\nAssembly District 51\n\n373,842 130,038 135,664 27,288 83,955 289,887 0.50\n\nAssembly District 52\n\n371,191 179,949 134,585 25,785 35,859 335,332 -0.22\n\nAssembly District 53\n\n369,086 46,443 9,947 38,136 273,206 95,880 -0.78\n\nAssembly District 54\n\n374,401 69,983 22,146 33,404 247,421 126,980 0.65\n\nAssembly District 55\n\n369,417 150,105 86,017 62,697 70,784 298,633 -0.69\n\nAssembly District 56\n\n374,029 83,247 24,793 55,934 208,264 165,765 0.55\n\nAssembly District 57\n\n370,957 235,636 9,274 44,321 80,994 289,963 -0.28\n\nAssembly District 58\n\n373,487 232,676 5,990 27,901 105,360 268,127 0.40\n\nAssembly District 59\n\n373,571 78,345 21,131 33,129 240,041 133,530 0.42\n\nAssembly District 60\n\n370,140 112,348 21,065 62,641 173,322 196,818 -0.50\n\nAssembly District 61\n\n373,445 155,748 31,235 18,070 168,325 205,120 0.39\n\nAssembly District 62\n\n372,499 145,745 47,132 16,270 161,893 210,606 0.13\n\nAssembly District 63\n\n371,695 68,096 26,012 17,042 258,659 113,036 -0.08\n\nAssembly District 64\n\n370,571 99,743 24,717 16,108 228,103 142,468 -0.38\n\nAssembly District 65\n\n370,152 63,238 23,735 12,195 267,944 102,208 -0.50\n\nAssembly District 66\n\n373,206 74,892 12,449 9,209 273,217 99,989 0.32\n\nAssembly District 67\n\n372,615 40,162 4,711 40,285 285,545 87,070 0.17\n\nAssembly District 68\n\n72,536 86,218 7,891 62,498 214,336 158,200 0.14\n\nAssembly District 69\n\n371,511 240,052 8,857 34,019 88,375 283,136 -0.13\n\nAssembly District 70\n\n372,364 45,357 7,235 32,906 285,973 86,391 0.10\n\nAssembly District 71\n\n369,506 54,237 6,134 27,739 280,154 89,352 -0.67\n\nAssembly District 72\n\n369,506 77,000 6,204 34,633 250,331 119,175 -0.67\n\nAssembly District 73\n\n371,638 61,920 18,946 18,030 271,305 100,333 -0.10\n\nAssembly District 74\n\n372,683 71,643 6,317 12,837 280,689 91,994 0.18\n\nAssembly District 75\n\n371,292 34,816 6,455 21,967 305,671 65,621 -0.19\n\nAssembly District 76\n\n371,046 47,875 28,715 44,054 249,134 121,912 -0.26\n\nAssembly District 77\n\n370,125 67,210 23,403 36,115 241,763 128,362 -0.50\n\nAssembly District 78\n\n372,414 49,571 16,498 18,114 286,564 85,850 0.11\n\nAssembly District 79\n\n372,092 183,309 59,564 41,353 89,101 282,991 0.02\n\nAssembly District 80\n\n371,177 169,658 10,331 5,947 182,542 188,635 -0.22\n\nCalifornia Assembly District Ethnic Statistics\n\nRegistration and Over Age 18 Counts\n\nTotal Reg Lat. Asian Pop +18 Afram +18 Lat +18 Asian +18\n\nReg. Reg\n\nAssembly District 1\n\n26,973 9,571 1,440 281,535 2,853 19,935 3,544\n\nAssembly District 2\n\n177,042 8,724 1,553 270,884 2,371 22,569 6,485\n\nAssembly District 3\n\n195,168 8,281 1,434 279,560 5,025 16,403 5,700\n\nAssembly District 4\n\n205,884 10,536 1,890 278,756 2,892 18,695 4,634\n\nAssembly District 5\n\n202,736 10,593 2,304 278,491 11,979 18,061 9,741\n\nAssembly District 6\n\n215,784 9,412 2,858 292,475 8,353 22,990 10,189\n\nAssembly District 7\n\n196,233 13,009 1,874 280,526 17,540 27,821 20,106\n\nAssembly District 8\n\n172,990 16,320 3,524 273,980 18,524 40,346 21,781\n\nAssembly District 9\n\n189,697 23,117 9,583 272,098 40,054 42,331 36,732\n\nAssembly District 10\n\n203,997 14,155 4,131 282,092 11,364 27,097 17,280\n\nAssembly District 11\n\n197,189 18,083 3,773 275,689 14,103 32,322 25,131\n\nAssembly District 12\n\n198,646 19,416 21,108 304,897 21,855 37,069 104,088\n\nAssembly District 13\n\n219,155 16,702 11,279 320,667 38,967 43,793 64,811\n\nAssembly District 14\n\n227,573 12,805 9,650 299,595 79,448 27,598 36,859\n\nAssembly District 15\n\n224,046 11,320 4,742 283,664 5,488 18,724 15,306\n\nAssembly District 16\n\n175,880 12,346 6,840 276,344 90,984 35,762 43,308\n\nAssembly District 17\n\n153,094 24,736 3,239 260,833 16,410 59,097 29,748\n\nAssembly District 18\n\n173,465 25,107 4,978 280,608 18,127 47,619 38,567\n\nAssembly District 19\n\n178,996 18,423 7,263 291,729 11,369 44,278 56,918\n\nAssembly District 20\n\n167,507 22,027 8,686 275,886 10,983 39,702 63,023\n\nAssembly District 21\n\n209,963 10,331 6,998 292,694 15,247 34,264 24,870\n\nAssembly District 22\n\n189,144 17,610 8,841 299,458 9,177 37,168 44,960\n\nAssembly District 23\n\n128,470 37,174 5,099 266,115 15,625 104,564 50,299\n\nAssembly District 24\n\n217,311 15,995 8,882 286,059 4,928 24,184 29,636\n\nAssembly District 25\n\n174,032 16,755 1,850 270,219 5,620 40,324 7,490\n\nAssembly District 26\n\n134,545 21,827 1,464 252,314 9,008 67,073 12,582\n\nAssembly District 27\n\n194,516 12,907 3,113 285,365 13,482 31,933 15,845\n\nAssembly District 28\n\n141,476 34,098 3,552 258,435 7,466 104,668 19,907\n\nAssembly District 29\n\n187,953 22,881 2,802 270,718 6,047 46,291 12,635\n\nAssembly District 30\n\n117,130 33,485 1,158 246,981 16,518 109,750 8,374\n\nAssembly District 31\n\n123,254 42,481 2,461 240,543 15,050 115,382 18,115\n\nAssembly District 32\n\n188,758 22,007 1,555 260,684 7,041 43,708 6,358\n\nAssembly District 33\n\n177,452 16,556 1,971 280,998 9,194 50,201 9,690\n\nAssembly District 34\n\n133,355 11,230 1,002 261,393 13,614 35,840 5,769\n\nAssembly District 35\n\n194,907 19,860 2,595 291,090 4,050 59,146 8,728\n\nAssembly District 36\n\n158,998 10,248 1,772 257,019 11,287 36,491 8,995\n\nAssembly District 37\n\n160,862 22,610 2,778 267,827 8,242 72,805 15,949\n\nAssembly District 38\n\n181,247 12,175 4,947 283,825 8,585 42,766 23,630\n\nAssembly District 39\n\n96,969 24,679 1,950 255,140 16,667 144,552 17,149\n\nAssembly District 40\n\n148,624 9,803 3,067 292,409 11,472 75,238 21,257\n\nAssembly District 41\n\n222,605 7,086 4,865 301,726 6,570 26,146 16,276\n\nAssembly District 42\n\n210,491 6,898 5,767 328,840 10,837 30,599 23,765\n\nAssembly District 43\n\n148,349 13,413 5,068 297,935 6,692 66,693 33,436\n\nAssembly District 44\n\n193,431 13,607 7,316 287,915 31,426 48,257 29,801\n\nAssembly District 45\n\n83,311 30,055 5,627 264,594 6,682 155,133 50,665\n\nAssembly District 46\n\n52,773 18,452 3,942 274,448 23,001 179,311 43,542\n\nAssembly District 47\n\n180,985 8,248 6,681 292,273 114,964 57,505 25,014\n\nAssembly District 48\n\n115,094 6,726 1,607 249,866 122,933 118,336 7,392\n\nAssembly District 49\n\n113,996 50,364 14,746 270,943 4,256 137,930 79,622\n\nAssembly District 50\n\n61,406 33,960 539 238,181 5,741 203,654 2,616\n\nAssembly District 51\n\n137,618 11,345 4,718 266,606 95,967 82,370 20,433\n\nAssembly District 52\n\n122,351 13,690 5,380 242,937 89,822 105,639 20,202\n\nAssembly District 53\n\n211,573 12,306 8,297 306,065 7,535 34,200 29,051\n\nAssembly District 54\n\n195,359 14,427 5,305 298,347 15,988 47,107 23,741\n\nAssembly District 55\n\n125,128 20,552 4,144 251,177 58,076 92,007 41,891\n\nAssembly District 56\n\n171,458 20,360 7,036 278,072 15,928 55,176 39,320\n\nAssembly District 57\n\n106,149 42,722 4,553 252,661 6,017 148,237 31,962\n\nAssembly District 58\n\n140,877 61,774 4,255 263,314 3,743 152,251 20,662\n\nAssembly District 59\n\n181,988 17,741 4,313 279,388 13,929 51,052 23,312\n\nAssembly District 60\n\n161,680 29,293 6,675 267,845 14,046 72,929 43,985\n\nAssembly District 61\n\n125,057 24,813 1,420 255,235 21,312 97,299 11,995\n\nAssembly District 62\n\n149,823 33,382 1,352 246,486 28,831 85,980 10,801\n\nAssembly District 63\n\n180,711 18,947 2,061 263,151 16,209 41,772 11,822\n\nAssembly District 64\n\n156,013 20,410 1,787 262,056 17,056 61,861 11,404\n\nAssembly District 65\n\n169,557 14,064 1,334 265,298 14,937 37,395 7,937\n\nAssembly District 66\n\n163,977 13,717 1,277 270,673 8,301 46,322 6,351\n\nAssembly District 67\n\n202,176 13,460 7,797 292,180 3,261 28,348 29,030\n\nAssembly District 68\n\n152,485 16,488 6,823 278,753 5,285 57,324 43,846\n\nAssembly District 69\n\n82,642 20,521 3,508 256,402 6,323 153,623 23,257\n\nAssembly District 70\n\n197,998 9,715 5,666 300,986 5,169 32,122 24,532\n\nAssembly District 71\n\n176,174 12,498 4,678 276,462 4,365 37,129 19,802\n\nAssembly District 72\n\n171,944 15,936 5,216 277,057 4,246 51,416 24,425\n\nAssembly District 73\n\n165,808 10,665 2,443 284,107 13,049 41,026 12,830\n\nAssembly District 74\n\n188,024 11,412 2,375 283,117 4,201 47,029 9,294\n\nAssembly District 75\n\n191,484 10,392 2,200 271,207 4,481 22,857 15,262\n\nAssembly District 76\n\n197,867 14,921 4,025 291,075 19,248 33,256 31,130\n\nAssembly District 77\n\n174,890 19,133 1,751 272,641 15,062 43,001 24,808\n\nAssembly District 78\n\n212,602 14,013 2,782 319,015 14,284 36,864 13,990\n\nAssembly District 79\n\n120,647 32,082 1,416 254,916 40,112 113,465 28,547\n\nAssembly District 80\n\n135,897 28,408 1,093 269,737 7,182 103,692 4,296\n\nCalifornia Senate District Population Totals\n\nIdeally 744,000 per district\n\nTotal Latino Afr. Am Asian NL White Non White Lev.\n\nSenate District 1\n\n741,589 53,875 10,445 16,773 648,984 92,605 -0.32\n\nSenate District 2\n\n743,342 74,602 30,484 35,234 587,611 155,731 -0.09\n\nSenate District 3\n\n746,005 89,583 62,084 94,415 497,789 248,216 0.27\n\nSenate District 4\n\n744,712 100,397 29,785 40,670 562,938 181,774 0.10\n\nSenate District 5\n\n750,907 135,010 42,849 76,128 492,568 258,339 0.93\n\nSenate District 6\n\n750,387 94,128 79,628 71,154 499,231 251,156 0.86\n\nSenate District 7\n\n746,186 77,183 28,632 58,239 577,957 168,229 0.29\n\nSenate District 8\n\n745,614 112,639 44,905 211,757 374,027 371,587 0.22\n\nSenate District 9\n\n744,608 93,182 239,957 107,885 303,480 441,128 0.08\n\nSenate District 10\n\n740,968 128,505 42,575 141,433 424,772 316,196 -0.41\n\nSenate District 11\n\n744,036 86,724 28,678 75,258 550,949 193,087 0.00\n\nSenate District 12\n\n748,133 180,433 21,414 37,000 501,653 246,480 0.56\n\nSenate District 13\n\n738,993 211,545 34,596 130,452 360,102 378,891 -0.67\n\nSenate District 14\n\n743,730 150,038 22,000 31,065 531,846 211,884 -0.04\n\nSenate District 15\n\n742,265 219,055 29,446 49,405 440,523 301,742 -0.23\n\nSenate District 16\n\n743,228 377,872 47,898 48,256 264,351 478,877 -0.10\n\nSenate District 17\n\n742,584 119,483 38,234 21,556 555,450 187,134 -0.19\n\nSenate District 18\n\n743,126 165,877 17,907 23,892 532,080 211,046 -0.12\n\nSenate District 19\n\n742,638 175,560 22,806 55,491 486,870 255,768 -0.18\n\nSenate District 20\n\n743,291 341,258 40,466 51,291 309,241 434,050 -0.10\n\nSenate District 21\n\n748,126 164,987 52,910 84,575 444,801 303,325 0.55\n\nSenate District 22\n\n741,633 494,992 35,685 121,005 90,483 651,150 -0.32\n\nSenate District 23\n\n742,794 73,560 21,093 49,016 597,369 145,425 -0.16\n\nSenate District 24\n\n742,764 440,560 14,619 149,352 136,604 606,160 -0.17\n\nSenate District 25\n\n745,033 309,987 270,249 53,073 119,814 625,219 0.14\n\nSenate District 26\n\n746,996 279,260 323,561 39,226 119,884 627,112 0.40\n\nSenate District 27\n\n748,430 153,230 46,939 89,338 455,685 292,745 0.60\n\nSenate District 28\n\n738,503 196,548 95,964 100,833 343,990 394,513 -0.74\n\nSenate District 29\n\n743,711 190,693 42,196 95,770 413,363 330,348 -0.04\n\nSenate District 30\n\n743,616 560,682 14,255 31,420 135,087 608,529 -0.05\n\nSenate District 31\n\n741,847 131,334 49,747 29,237 526,603 215,244 -0.29\n\nSenate District 32\n\n745,944 301,493 78,367 34,340 330,218 415,726 0.26\n\nSenate District 33\n\n739,012 131,237 12,338 62,372 530,485 208,527 -0.67\n\nSenate District 34\n\n744,047 326,270 16,748 96,517 302,711 441,336 0.01\n\nSenate District 35\n\n744,979 85,519 11,946 73,191 571,518 173,461 0.13\n\nSenate District 36\n\n743,777 174,635 37,166 25,317 501,320 242,457 -0.03\n\nSenate District 37\n\n742,469 204,474 16,786 27,914 488,213 254,256 -0.21\n\nSenate District 38\n\n744,321 133,563 25,263 30,867 551,994 192,327 0.04\n\nSenate District 39\n\n743,460 97,446 45,213 62,168 535,698 207,762 -0.07\n\nSenate District 40\n\n742,217 250,519 82,967 77,468 330,864 411,353 -0.24\n\nCalifornia Senate District Ethnic Statistics\n\nRegistration and Over Age 18 Counts\n\nTotal Reg Lat. Asian Pop +18 Afram +18 Lat +18 Asian +18\n\nReg. Reg\n\nSenate District 1\n\n401,052 18,817 3,324 558,316 7,917 35,098 10,334\n\nSenate District 2\n\n403,206 22,580 3,314 562,061 20,393 47,756 23,650\n\nSenate District 3\n\n434,939 26,114 14,137 613,142 47,320 66,783 75,000\n\nSenate District 4\n\n350,032 25,044 5,077 544,864 20,895 62,915 28,266\n\nSenate District 5\n\n357,091 38,891 7,370 542,925 27,774 86,194 47,028\n\nSenate District 6\n\n392,433 33,710 11,887 550,589 52,033 60,392 46,473\n\nSenate District 7\n\n421,235 29,403 8,515 559,353 19,591 51,046 40,437\n\nSenate District 8\n\n377,642 37,839 28,371 596,626 33,224 81,347 161,006\n\nSenate District 9\n\n403,453 25,151 16,490 575,939 170,432 63,360 80,167\n\nSenate District 10\n\n340,972 47,134 13,664 556,494 29,110 87,321 101,590\n\nSenate District 11\n\n427,274 26,326 15,880 578,753 20,175 58,448 54,506\n\nSenate District 12\n\n308,577 38,582 3,314 522,533 14,628 107,397 20,072\n\nSenate District 13\n\n317,614 54,784 13,940 565,573 24,802 141,732 95,259\n\nSenate District 14\n\n376,711 44,888 4,357 531,402 13,088 89,999 18,993\n\nSenate District 15\n\n335,992 47,005 6,665 543,800 20,948 136,601 35,752\n\nSenate District 16\n\n240,384 75,966 3,619 487,524 31,568 225,132 26,489\n\nSenate District 17\n\n292,353 21,478 2,774 518,412 24,901 72,331 14,764\n\nSenate District 18\n\n372,359 36,416 4,566 572,088 13,244 109,347 18,418\n\nSenate District 19\n\n342,109 34,785 7,725 551,652 16,827 115,571 39,579\n\nSenate District 20\n\n245,593 34,482 5,017 547,549 28,139 219,790 38,406\n\nSenate District 21\n\n341,780 27,020 12,384 585,850 38,118 114,950 63,237\n\nSenate District 22\n\n136,084 48,507 9,569 539,042 29,683 334,444 94,207\n\nSenate District 23\n\n433,096 13,984 10,632 630,566 17,407 56,745 40,041\n\nSenate District 24\n\n220,145 93,086 19,299 523,604 10,273 286,167 111,584\n\nSenate District 25\n\n259,969 25,035 10,098 509,543 185,789 188,009 40,635\n\nSenate District 26\n\n296,079 14,974 8,288 542,139 237,897 175,841 32,406\n\nSenate District 27\n\n366,817 34,787 12,341 576,419 31,916 102,283 63,061\n\nSenate District 28\n\n336,701 32,858 12,441 557,242 65,611 126,207 70,942\n\nSenate District 29\n\n343,668 47,034 10,988 547,233 27,975 123,981 67,297\n\nSenate District 30\n\n202,283 95,734 4,794 501,495 9,484 355,905 23,278\n\nSenate District 31\n\n350,268 33,011 3,395 528,449 31,146 79,167 19,759\n\nSenate District 32\n\n274,880 58,195 2,772 501,721 50,143 183,279 22,796\n\nSenate District 33\n\n348,118 28,434 9,894 553,519 8,611 88,545 44,227\n\nSenate District 34\n\n235,127 37,009 10,331 535,155 11,608 210,947 67,103\n\nSenate District 35\n\n400,174 23,175 13,463 593,166 8,430 60,470 53,562\n\nSenate District 36\n\n319,990 34,127 3,064 532,729 25,357 108,183 17,755\n\nSenate District 37\n\n327,381 38,800 3,293 540,944 11,663 126,549 19,558\n\nSenate District 38\n\n353,832 22,077 4,818 567,224 17,250 88,055 22,124\n\nSenate District 39\n\n410,469 28,934 6,807 610,090 33,532 70,120 45,120\n\nSenate District 40\n\n295,537 51,215 3,167 527,557 55,174 156,466 53,355\n\nCalifornia Congressional District Population Totals\n\nIdeally 572,308 per district\n\nTotal Latino Afr. Am Asian NL White Non White Dev.\n\nCongressional District 1\n\n573,082 64,233 22,602 19,368 453,852 119,230 0.14\n\nCongressional District 2\n\n573,322 34,425 8,716 13,374 503,940 69,382 0.18\n\nCongressional District 3\n\n571,374 81,213 18,339 29,923 435,047 136,327 -0.16\n\nCongressional District 4\n\n571,033 42,424 10,059 11,490 500,266 70,767 -0.22\n\nCongressional District 5\n\n573,684 84,426 73,567 72,556 339,053 234,631 0.24\n\nCongressional District 6\n\n571,227 51,030 13,480 18,737 484,457 86,770 -0.19\n\nCongressional District 7\n\n572,773 76,154 95,091 78,045 320,911 251,862 0.08\n\nCongressional District 8\n\n573,247 89,908 73,310 155,049 254,082 319,165 0.16\n\nCongressional District 9\n\n573,458 68,775 182,159 86,860 235,876 337,582 0.20\n\nCongressional District 10\n\n572,008 49,985 13,220 35,055 470,726 101,282 -0.05\n\nCongressional District 11\n\n571,772 120,755 33,137 61,598 353,145 218,627 -0.09\n\nCongressional District 12\n\n571,535 81,606 23,649 142,724 321,493 250,042 -0.14\n\nCongressional District 13\n\n572,441 105,225 42,228 106,135 316,076 256,365 0.02\n\nCongressional District 14\n\n571,131 77,305 28,237 67,787 396,388 174,743 -0.21\n\nCongressional District 15\n\n572,485 61,884 12,957 62,685 432,424 140,061 0.03\n\nCongressional District 16\n\n571,551 210,463 29,659 115,010 214,524 357,027 -0.13\n\nCongressional District 17\n\n570,981 180,572 25,342 32,785 329,202 241,779 -0.23\n\nCongressional District 18\n\n571,393 148,329 16,206 32,428 369,618 201,775 -0.16\n\nCongressional District 19\n\n573,043 135,408 18,859 40,188 372,590 200,453 0.13\n\nCongressional District 20\n\n573,282 317,372 36,933 28,854 186,817 386,465 0.17\n\nCongressional District 21\n\n571,300 115,954 23,106 16,963 408,083 163,217 -0.18\n\nCongressional District 22\n\n572,891 122,020 16,024 20,506 412,264 160,627 0.10\n\nCongressional District 23\n\n571,483 171,722 14,432 27,879 354,503 216,980 -0.14\n\nCongressional District 24\n\n572,563 77,221 11,845 35,967 445,775 126,788 0.04\n\nCongressional District 25\n\n573,105 94,172 25,724 35,825 415,113 157,992 0.14\n\nCongressional District 26\n\n571,523 301,153 35,611 38,802 195,476 376,047 -0.14\n\nCongressional District 27\n\n572,594 118,124 47,493 58,128 348,340 224,254 0.05\n\nCongressional District 28\n\n572,927 138,271 32,778 72,027 328,592 244,335 0.11\n\nCongressional District 29\n\n571,566 75,315 19,931 42,395 432,808 138,758 -0.13\n\nCongressional District 30\n\n572,538 351,876 20,039 113,306 87,154 485,384 0.04\n\nCongressional District 31\n\n572,643 335,086 9,561 126,555 100,162 472,481 0.06\n\nCongressional District 32\n\n572,595 173,076 230,872 42,124 134,859 437,736 0.05\n\nCongressional District 33\n\n570,943 477,975 25,473 21,471 46,077 524,866 -0.24\n\nCongressional District 34\n\n573,047 357,143 11,060 49,765 153,071 419,976 0.13\n\nCongressional District 35\n\n570,882 246,201 243,848 31,636 59,301 511,581 -0.25\n\nCongressional District 36\n\n573,663 85,277 18,392 69,992 397,921 175,742 0.24\n\nCongressional District 37\n\n572,049 258,278 192,420 57,701 68,776 503,273 -0.05\n\nCongressional District 38\n\n572,657 146,899 44,337 49,445 329,425 243,232 0.06\n\nCongressional District 39\n\n573,574 130,920 15,095 76,326 349,012 224,562 0.22\n\nCongressional District 40\n\n573,625 92,180 31,210 18,761 424,898 148,727 0.23\n\nCongressional District 41\n\n572,663 180,331 39,205 55,455 297,235 275,428 0.06\n\nCongressional District 42\n\n571,844 196,418 63,239 21,029 288,786 283,058 -0.08\n\nCongressional District 43\n\n571,231 142,785 33,851 22,950 368,880 202,351 -0.19\n\nCongressional District 44\n\n571,583 160,696 29,354 14,710 363,149 208,434 -0.13\n\nCongressional District 45\n\n570,874 84,684 7,110 60,804 415,747 155,127 -0.25\n\nCongressional District 46\n\n571,380 285,529 14,226 67,064 203,547 367,833 -0.16\n\nCongressional District 47\n\n571,518 74,700 10,495 53,516 431,187 140,331 -0.14\n\nCongressional District 48\n\n572,928 98,746 23,164 24,292 422,849 150,079 0.11\n\nCongressional District 49\n\n573,362 73,210 30,408 35,587 431,605 141,757 0.18\n\nCongressional District 50\n\n573,463 232,660 82,735 78,321 180,793 392,670 0.20\n\nCongressional District 51\n\n572,982 78,053 10,225 44,937 437,767 135,215 0.12\n\nCongressional District 52\n\n573,203 129,771 17,788 15,463 405,484 167,719 0.16\n\nCalifornia Congressional District Ethnic Statistics\n\nRegistration and Over Age 18 Counts\n\nTotal Reg Lat. Asian Pop +18 Afram +18 Lat +18 Asian +18\n\nReg. Reg\n\nCongressional District 1\n\n295,660 17,009 2,461 429,278 16,096 41,489 13,200\n\nCongressional District 2\n\n296,735 12,048 2,049 429,948 6,196 21,461 7,270\n\nCongressional District 3\n\n282,885 20,335 4,506 419,841 12,189 50,288 21,532\n\nCongressional District 4\n\n308,982 15,606 2,979 429,072 8,569 29,162 8,113\n\nCongressional District 5\n\n304,964 30,792 12,140 423,955 47,263 53,736 47,903\n\nCongressional District 6\n\n332,146 15,070 3,839 445,354 9,985 35,260 13,530\n\nCongressional District 7\n\n286,816 25,487 6,858 422,385 64,137 49,480 53,615\n\nCongressional District 8\n\n318,814 28,482 21,918 481,672 55,042 67,878 122,930\n\nCongressional District 9\n\n312,732 18,710 13,395 447,880 130,415 47,601 65,112\n\nCongressional District 10\n\n335,211 21,156 6,852 432,270 9,516 33,635 24,706\n\nCongressional District 11\n\n252,292 32,203 5,046 406,626 21,587 76,929 36,696\n\nCongressional District 12\n\n291,956 26,823 18,681 456,025 17,763 58,422 106,840\n\nCongressional District 13\n\n262,242 37,572 9,795 427,508 28,903 70,661 75,883\n\nCongressional District 14\n\n313,406 18,414 12,743 456,764 20,457 53,572 51,268\n\nCongressional District 15\n\n320,275 26,041 11,271 445,309 9,102 43,241 45,803\n\nCongressional District 16\n\n217,333 53,066 9,820 410,427 20,755 136,640 81,056\n\nCongressional District 17\n\n251,239 35,266 4,399 421,327 18,252 112,549 24,281\n\nCongressional District 18\n\n225,679 30,198 2,338 392,845 10,666 87,434 17,191\n\nCongressional District 19\n\n270,410 38,187 4,164 407,087 11,600 82,765 21,919\n\nCongressional District 20\n\n180,251 62,057 2,748 375,548 24,855 189,433 17,448\n\nCongressional District 21\n\n252,617 28,944 2,159 400,998 14,728 68,185 10,433\n\nCongressional District 22\n\n286,872 26,271 3,692 444,324 11,987 80,741 16,004\n\nCongressional District 23\n\n250,935 35,609 3,578 414,018 9,841 109,207 19,720\n\nCongressional District 24\n\n299,987 12,222 6,000 451,308 8,640 54,176 26,435\n\nCongressional District 25\n\n261,168 15,865 5,317 416,210 17,873 61,706 25,347\n\nCongressional District 26\n\n169,648 30,347 3,590 411,107 24,566 192,380 29,051\n\nCongressional District 27\n\n268,686 19,520 8,959 445,859 33,747 81,755 43,001\n\nCongressional District 28\n\n265,748 33,039 8,119 424,677 21,745 90,141 50,653\n\nCongressional District 29\n\n319,228 12,229 8,967 496,808 16,963 58,161 35,979\n\nCongressional District 30\n\n123,486 41,940 8,658 416,394 15,734 237,363 86,782\n\nCongressional District 31\n\n160,800 66,763 16,200 404,599 6,861 217,073 95,194\n\nCongressional District 32\n\n251,965 13,575 9,035 435,630 173,376 114,674 34,930\n\nCongressional District 33\n\n86,991 41,947 2,303 385,295 20,881 305,284 17,757\n\nCongressional District 34\n\n211,008 91,420 7,357 403,428 7,161 233,833 36,369\n\nCongressional District 35\n\n190,925 13,793 6,109 390,123 171,493 149,843 24,628\n\nCongressional District 36\n\n313,526 21,327 14,485 462,635 13,496 60,328 52,227\n\nCongressional District 37\n\n196,694 26,783 4,243 376,039 128,485 153,189 39,460\n\nCongressional District 38\n\n255,124 24,199 4,712 436,115 29,694 95,259 33,765\n\nCongressional District 39\n\n267,248 32,124 11,134 430,906 10,183 87,258 54,079\n\nCongressional District 40\n\n252,110 21,847 2,168 410,173 20,054 55,562 12,996\n\nCongressional District 41\n\n223,837 34,145 6,046 400,965 26,697 114,210 38,009\n\nCongressional District 42\n\n241,961 45,414 2,060 382,911 38,714 116,620 14,002\n\nCongressional District 43\n\n250,671 30,180 2,650 402,537 23,303 88,421 16,102\n\nCongressional District 44\n\n241,154 27,952 1,745 419,652 18,594 97,434 9,764\n\nCongressional District 45\n\n288,133 19,481 10,184 450,858 5,040 58,836 43,728\n\nCongressional District 46\n\n161,403 28,381 7,030 406,555 9,959 183,828 46,547\n\nCongressional District 47\n\n299,157 18,300 9,388 442,228 7,445 51,753 38,699\n\nCongressional District 48\n\n239,599 15,339 3,290 428,231 15,850 64,121 17,335\n\nCongressional District 49\n\n326,041 21,714 4,769 480,983 23,589 53,726 26,758\n\nCongressional District 50\n\n207,907 45,565 2,732 399,797 55,109 145,247 53,220\n\nCongressional District 51\n\n300,171 18,010 4,914 432,769 7,134 52,286 31,786\n\nCongressional District 52\n\n268,591 28,624 2,249 418,029 11,786 80,637 11,180\n\nCALIFORNIA BOARD OF EQUALIZATION DISTRICT POPULATIONS\n\nBd. of Equalization District 1\n\nTotal Pop. African Am. Latino Asian\n\nCount 1,721 1,721 1,721\n\nSum 7,456,333 572,388 1,192,553 944,250\n\nBd. of Equalization District 2\n\nTotal Pop. African Am. Latino Asian\n\nCount 1,432 1,432 1,432\n\nSum 7,492,803 390,762 1,731,716 400,144\n\nBd. of Equalization District 3\n\nTotal Pop. African Am. Latino Asian\n\nCount 1,330 1,330 1,330\n\nSum 7,408,847 356,745 1,733,241 631,144\n\nBd. of Equalization District 4\n\nTotal Pop. African Am. Latino Asian\n\nCount 1,375 1,375 1,375\n\nSum 7.402.038 888,906 3,030,428 734,815\n\nTotals:\n\nCount 5,858 5,858 5,858\n\nSum 29,760,021 2,208,801 7,687,938 2,710,353\n\n\u003cspan class=\"fn\"\u003e1. The majority rely on the masters' Report and Recommendations (hereafter Report) (appen., ) at page 788, which reflects a population deviation of 0.25 percent from the norm in congressional districts. (Maj. opn., ante, p. 718.) The more relevant figure, however, is the maximum total deviation--that is, the sum of the absolute values of the two greatest deviations from the ideal--which, as the masters observe at page 755 of their report, is 0.49 percent.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. At oral argument it was suggested that the number 9 in this calculation is not static because in time it would be changed by births, deaths, and people moving into and out of districts. Obviously that is true of all the district figures offered. We can consider only the numbers in existence as of this date.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Karcher reviewed a legislative reapportionment, but I discern no reason to distinguish the case on that basis.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The Assembly joins in complaining that the masters' census-tract-based plan creates districts of more unequal population and splits more cities than its proposal. There is merit in its views.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. \"[I]n the mid '60s, access to 250,000 bytes of storage seemed like a huge resource. Today, most desk-top PCs out perform the old 360, and contain several times more memory, for a fraction of the cost. ... [P] Today, workstations ... are benchmarking for selected tasks and scalar operations at 50 to 60 percent of the Cray-1 [supercomputer], at costs of $20,000 to $30,000. [P] For 30 years, and over four decades, relentless ten-fold [computer] price declines have occurred every seven years. Everything in the computer world today suggests that these curves will at least continue, if not accelerate. Therefore, strategies for the '90s must consider the technical and competitive impact associated with the tremendous computer capacity accessible by virtually every professional.\" (Hadley \u0026 Laidley, Integrated Computing (May 1991) World Oil, p. 109.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The Flanagan court stated: \"Plaintiffs also introduced evidence that the unit of measurement employed by those responsible for drawing the lines influenced efforts to achieve the ideal. ... By utilizing census blocks, a greater degree of mathematical precision was possible. ... In spite of the relative precision of the census block unit the plan as enacted primarily employed the use of census tracts. In support of this choice, defendants offered testimony that the risk of error in population calculations is increased by use of census blocks. While it may be true that this risk is enhanced by the use of census blocks, the Court finds no evidence of record that this potential for error could not have been compensated for by more precise methods of review. Moreover, as revealed by the testimony of the Senate Clerk ..., census blocks were utilized in some instances.\" (561 F.Supp. at p. 42, fn. omitted.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. When the will exists to do it, extraordinarily precise realignments can be performed. (See, e.g., Linder v. Keisling (1991) 312 Ore. 316 [821 P.2d 1089] [Oregon Secretary of State enlisted aid of United States Census Bureau to bisect census block \"so as not to include persons on both sides of Forest Park within a single census block\"].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. I recognize that many persons in racial or ethnic groups have varying ways of designating themselves and their race or ethnicity. For convenience in this opinion I use the designations employed by the United States Census Bureau. 1a Hereinafter referred to as Article XXI. 2a Paul L. McKaskle, professor of law at the University of San Francisco, who had served in the same capacity in 1973, was retained as director and chief counsel. Eugene C. Lee, professor emeritus of political science at the University of California at Berkeley; Rich Langree, a Supreme Court staff attorney with extensive computer data processing experience; and Guy B. Colburn, a retired Supreme Court staff attorney, were retained as consultants; other staff included Rebecca Sullivan, Chang Morozumi, and Erica Drewes. 3a Declarations respecting the service of notice and furnishing the press release will be lodged with the court. 4a Transcripts of all hearings will be lodged with the court. 5a These exhibits and all written presentations will be filed and become a part of the record. 6a All section references are to the Act unless otherwise indicated. 7a Section 2 provides: \"(a) No voting qualification or prerequisite to voting or standard, practice, or procedure shall be imposed or applied by any State or political subdivision in a manner which results in a denial or abridgement of the right of any citizen of the United States to vote on account of race or color, or in contravention of the guarantees set forth in section 4(f)(2) [regarding language minority groups], as provided in subsection (b). \"(b) A violation of subsection (a) is established if, based on the totality of circumstances, it is shown that the political processes leading to nomination or election in the State or political subdivision are not equally open to participation by members of a class of citizens protected by subsection (a) in that its members have less opportunity than other members of the electorate to participate in the political process and to elect representatives of their choice. The extent to which members of a protected class have been elected to office in the State or political subdivision is one circumstance which may be considered: Provided, That nothing in this section establishes a right to have members of a protected class elected in numbers equal to their proportion in the population.\" 8a The factors quoted by the court are as follows (478 U.S. at pp. 36-37 [92 L.Ed.2d at pp. 37-38]): \" '1. the extent of any history of official discrimination in the state or political subdivision that touched the right of the members of the minority group to register, to vote, or otherwise to participate in the democratic process; \" '2. the extent to which voting in the elections of the state or political subdivision is racially polarized; \" '3. the extent to which the state or political subdivision has used unusually large election districts, majority vote requirements, anti-single shot provisions, or other voting practices or procedures that may enhance the opportunity for discrimination against the minority group; \" '4. if there is a candidate slating process, whether the members of the minority group have been denied access to that process; \" '5. the extent to which members of the minority group in the state or political subdivision bear the effects of discrimination in such areas as education, employment and health, which hinder their ability to participate effectively in the political process; \" '6. whether political campaigns have been characterized by overt or subtle racial appeals; \" '7. the extent to which members of the minority group have been elected to public office in the jurisdiction. \" 'Additional factors that in some cases have had probative value as part of plaintiffs' evidence to establish a violation are: \" 'whether there is a significant lack of responsiveness on the part of elected officials to the particularized needs of the members of the minority group. \" 'whether the policy underlying the state or political subdivision's use of such voting qualification, prerequisite to voting, or standard, practice or procedure is tenuous.' \"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. We use the word Latino to describe what the Census Bureau refers to as Hispanic.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Throughout this report, the term minority, unless otherwise qualified, refers to \"protected minority.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Latino registration data are based on an analysis by private organizations of the number of persons with Hispanic surnames on the registration rolls. This is both underinclusive and overinclusive because of intermarriage between Latinos and non-Latinos and, also, the number of \"Hispanic\" names in the Filipino population, part of the Asian minority. In contrast, the data on Latino population comes directly from the Bureau of the Census. Second, data separately presented to us by the Assembly and the Senate, purportedly concerning the same area, varied markedly, and, in some instances, dramatically, undermining our confidence in the accuracy of the data. We have serious reservations as to how much reliance we can place on data of uncertain provenance.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The Assembly has suggested that, perhaps, even a stricter standard of population equality should be considered because of the advent of extremely sophisticated computers allowing population divisions at the level of a single block. We find no support for this proposition for reasons which will be discussed in connection with congressional population equality, post. We do note, however, that a principal consultant relied upon by the Assembly, Professor Bruce Cain, has elsewhere criticized even the Reinecke IV limits on population variance (plus or minus 2 percent) as being too strict: \"[P]opulation equality is such a crude way of equalizing voters that an obsession with very small population deviations seems rather silly.\" (Cain, The Reapportionment Puzzle (1984) p. 59.) Similarly, Bernard Grofman, a consultant to the California Congressional Delegation, in recommending a relaxation of exact population requirements, has argued that Supreme Court rulings in this area are \"unduly mechanistic.\" (Grofman, Voting Rights, Voting Wrongs: the Legacy of Baker v. Carr (1990) p. 34.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. To calculate \"maximum deviation,\" we begin with the population that each district would have if the districts were absolutely equal. The maximum deviation is the percentage of that theoretical population represented by the difference between the actual populations of the largest and the smallest district.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. To develop this point further, we note that the most common human-made feature used as a boundary is a major thoroughfare. Such arterials impede development of neighborhood ties across them. (One reason is that ties are often forged by adults who first become acquainted because their children are playmates, and for safety reasons, children are often not permitted to cross arterials, at least when young.) Dividing census tracts unnecessarily is, thus, somewhat more likely to make it more difficult for neighbors to organize around or communicate about a shared concern with respect to their legislative representatives. We do not mean to suggest that census tracts are sacrosanct, but only that they are rational building blocks for districting.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. The Assembly, our staff was told, uses a mainframe computer at the California Institute of Technology. It has, we are sure, enormous capabilities, including vast data banks as to how small areas (such as a city block) vote, not only as to candidates, national and local, but even as to ballot initiatives such as Proposition 13. But its operation requires an advanced knowledge of technical computer language. The Assembly has had ample time--perhaps a decade--to perfect its system at a cost which must run into millions of dollars. We, of course, had less than two months to set up a computer system and to evaluate other plans or produce our own. Most of the computer-related time we spent was in getting the data properly into our computer. Further, much of this time was getting block data (as contrasted with census tract data) into the machines. Then we discovered that a manipulation which would take a minute or less at the census tract level might take an hour at the block level. If we were to try to verify the accuracy of the assembly or congressional plan population statistics, it would have taken days of computer time, and we would have been able to do little else.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Our Conclusion as to cost of using block data reflects the present state of the art as we understand it. Future technological change could warrant a different result.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Two of the Reinecke IV criteria, use of census tracts and \"nesting\" (i.e. the combining of assembly seats to form senate districts) have no relation to Article XXI and are discussed elsewhere.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. We think it is of some significance that many of the Latino Coalition appearances at our hearing were representing coalition committees of one or another county--e.g. Stanislaus County. (Examples of this sort could be multiplied endlessly.) It underscores that county lines have significance in terms of political organization and activities, the values that Article XXI is designed to protect.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. We must note that in connection with city boundaries a problem that faced the Special Masters in 1973 still exists today. As reported in Reinecke IV (10 Cal. 3d at pp. 413-414): \"Some cities have exceedingly irregular boundaries with an odd assortment of 'fingers' and 'peninsulas' jutting out from the basic part of the city. In many such cases, the boundaries as of the date of the census do not reflect the present boundaries or what they are likely to be during the balance of the decade. Often census tract boundaries do not correspond exactly with the boundaries of such cities.\" In a footnote, the 1973 Special Masters noted that: \"[i]n many instances, a single census tract has small portions of two cities in it.\" ( at p. 414, fn. 9.) Our solution has been the same as the 1973 Special Masters: \"In such instances, census tract boundaries which preserve the bulk of the city in one district have been followed even though it resulted in trimming off small peninsulas or other such extensions of territory.\" ( at p. 414.) In this way, we have preserved the geographical integrity of various cities, although we have not always followed the literal boundaries as they existed in 1988, which we understand to be the boundaries used by the Census Bureau in computing populations.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Even if we were to give special consideration to the product of the truncated legislative process, the flaws, discussed below, are so substantial that we would still be required to reject the plans.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. As explained in our analysis of the Act, there are many unanswered questions as to how the Act applies to the situation with which we are dealing. We do not believe it would be useful to deal with the Assembly plans in detail with respect to the Act, because we have even more substantial problems with their compliance with the other criteria we are required to follow.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. The districts created by these plans would also be particularly unsuitable as a basis for nesting in the formation of senate districts, an additional Reinecke IV guideline.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. We also note that Madera County is 34.5 percent Latino, and has neighboring counties similarly populated with Latinos. However, the populated areas approximately 130 miles to the north with which Madera is joined have almost no minority populations.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. As noted, these are only two of many examples. Cogent justification of many other districts with similar bizarre configurations in these plans would be necessary before we would be able to recommend them.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. We use the phrase \"as best as we could tell\" because the maps accompanying the congressional plans were extraordinarily difficult to read and set out each district separately without showing the interrelation between districts. Moreover the submission was made at the last possible moment, so that we had very little time to examine the plans before the public hearings. (Our rules urged that submissions be made as soon as possible.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. We stress, as with the Assembly plans, the example described is merely one of many examples of districts which do not comply with Article XXI, for which noncompliance no justification has been offered.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. The presentation was also much clearer than, for example, that of the Democratic Congressional Delegation and included maps that showed, plainly, the interrelationship of the districts proposed by them.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Our differences as to the Senate's proposed District 9 are obvious by examining how we treated the same area in our recommended plan. In the case of the Senate's proposed District 12, though the Senate stressed its desire to comply with the Act, it started the district in Stanislaus County (presumably because the present incumbent of District 12 lives there). Since Stanislaus County--as well as Merced County immediately to the south--has relatively few Latinos compared to areas further to the south, the Senate could not construct a senate district which even came close to a majority seat in Latino population. In contrast, we centered our district in the San Joaquin Valley on areas with more Latino population and, thus, were able to construct a district that had over 50 percent Latino population.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Our Assembly District 79 is almost the same as the one proposed by MALDEF.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. We do not mean this as a criticism of the motives of MALDEF in submitting complete statewide plans. Since the entire focus of the MALDEF effort was on creation of Latino districts, it is not surprising that its districting in nonminority areas has the flavor of being an afterthought.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. Kern County is split by the Tehachapis and part of the county is in the Mojave Desert. However, over 80 percent of the population of the county is in the San Joaquin Valley.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. The transportation links of sparsely populated Inyo County are almost entirely to the south, and it is part of the desert regions east of the Sierra Nevada. San Luis Obispo County is midway between Los Angeles and San Francisco and could be classified either as a Northern or Southern California county. However, the bulk of its population is in the south part of the county, and a wide area of the northern part of the county and the adjacent part of southern Monterey County is very lightly populated. (San Luis Obispo is also part of the Los Angeles-based Second District of the Court of Appeal.) Since inclusion of the county in Southern California allowed a precise division of population for districting purposes, we believe this classification is justified.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Although a county was divided, a major geographical region--the Mojave Desert area--was left intact. Thus, this division complies equally well with the requirements of Article XXI.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. Solano County is adjacent to the Sacramento River where the river breaks through the Coastal Range and empties into San Francisco Bay. The division of Solano County was somewhat different for congressional and legislative districts because of differing population balance requirements. For legislative districts, the division was to include only the Vallejo area in the coastal region, which is the most natural division of the county. Because somewhat more population was required in the coastal region for congressional purposes, it was necessary to include Fairfield and part of Vacaville in this region.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. This included the special steps we took with respect to counties covered by section 5 of the Act which we describe shortly.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. As discussed elsewhere, we preserved cities, to the degree feasible, by use of census tracts that constituted the core of each city. But in a number of instances this meant a small deviation from the city lines, at least as they existed in 1988. In Los Angeles County, in addition to following city boundaries to the degree feasible, we used the boundaries of the statistical areas prepared by the Los Angeles County Regional Planning Commission as a guide to divisions within the City of Los Angeles and for groupings of smaller cities into districts.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. See our previous Discussion of this requirement of Article XXI. In Southern California, we also tried to protect the integrity of the desert regions east of the Sierra Nevada.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. A total of seven congressional seats and eleven assembly seats was constructed in this minority area.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. Our proposed Assembly District 60, part of which is squeezed between Latino Assembly District 58 and the Orange County border, is an example where we could not avoid this effect.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. A fourth county subject to preclearance is Yuba County located in the Sacramento Valley and the foothills of the Sierra. Yuba is the smallest of the counties subject to preclearance and, like the other counties, is the site of a large military installation--Beale Air Force Base. Yuba County has very few protected minorities, far fewer than the state average. The same is true of the counties that surround it. Therefore, we could do nothing with respect to Yuba County so as to better comply with the Act.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. These districts will be more particularly described in a subsequent section.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. Further, to the degree that we could determine, the level of registration for Asians, the largest single minority, is extremely low. Finally, although \"non-Latino\" whites constitute a minority of the population of the city, they are disproportionally represented in the over-18 population and also do appear to be registered in disproportionate numbers.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. District 12 as we constitute it has 35.9 percent Asians and 57.3 percent total minorities.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. We were unwilling to extend a long arm a block or so wide for the several miles between the Richmond district and \"Chinatown\" (as did the Senate) in order to bring these two areas into the same district since it would be contrary to Article XXI. Further, \"Chinatown\" appears to have by far the lowest ratio of Asian registration to Asian population of any Asian area in the city.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. Berkeley, the city in the proposed district which has the smallest percentage of African-Americans, has had two African-American mayors in recent years, and the member of the board of supervisors for the area which encompasses the Alameda County part of the district is currently an African-American.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. Pleasanton, Foster City and Daly City are the only cities in the North Coastal Region under the size of an assembly district which have been split in a substantial manner, each because of the population equality standard we have been directed to follow. (Oakland is precisely the size of an assembly district, but it entirely surrounds Piedmont, and thus has to be split. Further, it functionally--though not literally--encompasses the City of Alameda, making it substantially larger than a single assembly district.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. See text Discussion accompanying footnote 41, ante.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. While several plans submitted to us include one assembly district of over 50 percent wholly within the San Joaquin Valley, none included two near this percentage, and none had a senate seat with such a high percentage. We must note, however, that based on registration information provided us (but of uncertain reliability) none of these districts, including ours, has a Latino registration high enough to constitute a Latino majority seat.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. We were able to consolidate this Asian population in a single congressional district, however.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. The problem with trying to reduce the Latino population in the district by inclusion of non-Latino areas (such as part of Downey to the east) is that the Latino rate of registration is so low. With only 11 percent of the population, non-Latinos in the district as presently proposed constitute over 44 percent of the registered voters; including non-Latino areas to reduce the population down to, say, 80 percent would probably reduce the number of Latinos actually registered to under 30 percent, thus making the district in effect only a Latino influence district, not a Latino majority district.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. These included Speaker of the Assembly Brown, who is African-American, and several African-American legislators representing current districts in the area.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. The African-American population in Los Angeles has not kept pace with the overall growth of the county, especially the Latino population, much of which appears to be settling in areas currently occupied by African-Americans. Thus it is difficult to provide districts meeting current population requirements which have the same percentage of African-Americans as existed in the districts created in 1982.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. For example, 52 percent of District 48 is Latino (compared to 46 percent African- Americans) but the Latino registration is apparently less than 6 percent.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. Asian representatives at our hearings had requested an assembly seat in this area which maximized the Asian presence and our initial district was designed, in part, to accommodate this request.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. In this region we were urged by several appearances at our hearings to link the cities of Guadalupe, Santa Barbara and Oxnard in one assembly district because each had a substantial Latino population. (Only the very small city of Guadalupe has, however, a Latino majority.) We have not done so, however, because the Latinos in these three cities do not constitute a geographically compact minority population. Guadalupe is 70 miles northwest of Santa Barbara and Oxnard is 40 miles to the southeast of Santa Barbara and there are significant nonminority populations in between. (Lompoc and Santa Maria are between Guadalupe and Santa Barbara and the City of Ventura is between Oxnard and Santa Barbara.) It would be impossible to unite the three cities (or even just Santa Barbara and Oxnard, the largest two) without bypassing other significant populations, which would be, in our view, a violation of Article XXI.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. The remainder of Pomona, the more heavily minority part, is included in a minority influence district in western San Bernardino County.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57. San Bernardino had to be split for population reasons in any event, so we included the parts of the city which would maximize minority presence in District 62.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58. Anaheim, because it is long and narrow and extends across much of Orange County, ended up being split four ways in our assembly plan. We regretted this, but could not figure any way to avoid this without substantially reducing the Latino presence in District 69. We note that the 1973 Special Masters also split Anaheim three ways.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59. The number assigned to a senate district is important because it determines in which year the election is to be held for the seat. Odd numbered seats are up for reelection in 1992.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e60. We note that in 1973 the only changes made by the Supreme Court to the Senate Plan submitted by our predecessors in this process was to switch numbers for two pairs of senate districts. (Reinecke IV, supra, 10 Cal. 3d at p. 404, fn. 2.) Thus, it is possible for the court to correct this aspect of our plan if we have made a significant error with respect to numbering.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e61. We were also urged to keep the Mexican border area in one legislative district because there are common problems all along the border. We are not convinced that a single district along the border is the proper solution to this issue. Such problems affect a zone extending well into California, and a legislator does not have to represent the territory literally adjacent to the border to be responsive to such problems. Further, it would probably be more useful to have more than one legislator who is responsive to such problems, which would call for two or more districts to be located on or near the border. (For example, in one hearing we were urged to make sure that the timber growing areas of the state were not represented by just one legislator because having two or more legislators concerned about timber matters would ultimately be more useful to that activity.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e62. A narrow corridor for the purpose of connecting distant populations would, in our view, violate Article XXI.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e63. As noted earlier, the division of Vacaville was necessary to achieve the necessary population balance between the North Coastal Region and the North Interior Region.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e64. This is the part of Solano County left when the rest of the county was assigned to the North Coastal Region.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e65. Los Angeles County includes well over one-fourth the population of the state, thus it must be divided in any case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e66. District One consists of Del Norte, Siskiyou, Modoc, Humboldt, Trinity, Shasta, Lassen, Tehama, Mendocino, Glenn, Lake, Colusa, Sutter, Sonoma, Napa, Yolo, Solano, Marin, Contra Costa, San Francisco, Alameda, San Mateo, Santa Clara, Santa Cruz, San Benito and Monterey Counties. District Two consists of the counties of Plumas, Butte, Yuba, Sierra, Nevada, Placer, El Dorado, Sacramento, Amador, Alpine, San Joaquin, Calaveras, Tuolumne, Stanislaus, Mariposa, Mono, Merced, Madera, Fresno, Inyo, Kings, Tulare, San Luis Obispo, Kern, San Bernardino, Santa Barbara, Ventura and the Antelope Valley in northern Los Angeles County. District Three consists of Orange, Riverside, San Diego, Imperial Counties and the southeast part of Los Angeles County, including Long Beach and Torrance and other nearby cities. No cities were divided. District Four consists of the remainder of Los Angeles County.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e67. By vote-registration ratio, we mean the number of votes obtained by a candidate of a particular party (e.g., Democratic) as a ratio to the number of voters registered to that party in the district.\u003c/span\u003e\n\n",
    "body_length": 270373,
    "citedas": [
      "4 Cal. Rptr. 2d 379",
      "1 Cal. 4th 707",
      "823 P.2d 545"
    ],
    "attorneys": "Gibson, Dunn \u0026 Crutcher, Robert E. Cooper, Theodore B. Olson and Daniel M. Kolkey for Petitioner. Louise H. Renne, City Attorney, Dennis Aftergut, Burk E. Deleventhal, Randy Riddle, Deputy City Attorneys, De Witt W. Clinton, County Counsel, Halvor B. Melon, Deputy County Counsel, Anthony L. Miller, Richard S. Nishite and Oliver S. Cox for Respondents. Remcho, Johansen \u0026 Purcell, Joseph Remcho, Robin B. Johansen, Lowell Finley, Charles C. Marson, Christensen, White, Miller, Fink \u0026 Jacobs, Andrew M. White, Joseph B. Marks, Nielsen, Merksamer, Hodgson, Parrinello \u0026 Mueller, James R. Parrinello, Marguerite Mary Leoni, Irell \u0026 Manella, Jonathan H. Steinberg, Donna R. Hecht, David I. Gindler, Browne \u0026 Woods, Allan Browne, Benjamin D. Scheibe, Robert B. Broadbelt, Michael J. Olecki and Bion Gregory for Real Parties in Interest. Daniel E. Lungren, Attorney General, Manuel A. Romero, Denise M. Hulett, Vibiana Andrade, Joaquin G. Avila, William R. Tamayo, Doreena P. Wong, Angelo N. Ancheta, Kathryn K. Imahara and Robin S. Toma as Amici Curiae.",
    "category": [
      "242",
      "75"
    ],
    "judges": "Opinion by Lucas, C. J., with Panelli, Kennard, Arabian, Baxter and George, JJ., Concurring. Separate Dissenting opinion by Mosk, J.",
    "citation_count": 0
  }
}
