{
  "id": "nIjpP2YBTlTomsSB2U03",
  "document": {
    "title": "Gubiensio-Ortiz v. Kanahele",
    "full_title": "JOSE GUBIENSIO-ORTIZ -APPELLANT, v. AL KANAHELE, WARDEN, METROPOLITAN CORRECTIONAL CENTER, SAN DIEGO, CALIFORNIA -APPELLEE. UNITED STATES OF AMERICA V. RAUL CHAVEZ-SANCHEZ",
    "jurisdiction": "Ninth Circuit",
    "date": "1988-08-23T00:00:00.000Z",
    "docket": "Nos. 88-5848, 88-5109",
    "body": "KOZINSKI, Circuit Judge.\n\nWe consider the constitutionality of the Sentencing Reform Act of 1984 (SRA), Pub. L. No. 98-473, tit. II, ch. II, 98 Stat. 1987 (codified as amended at 18 U.S.C. §§ 3551-3742 and 28 U.S.C. §§ 991-998).\n\nFacts\n\nA. In 1984, Congress consummated a decade-long effort to revolutionize federal sentencing law by creating the United States Sentencing Commission as \"an independent commission in the judicial branch of the United States.\" 28 U.S.C. § 991(a) (Supp. IV 1986). Congress charged the Commission with eliminating unwarranted sentencing disparities among \"defendants with similar records who have been found guilty of similar criminal conduct while maintaining sufficient flexibility to permit individualized sentences.\" 28 U.S.C. § 991(b)(1)(B) (Supp. IV 1986). In an effort to establish this more determinate system of sentencing, the Act introduces three major changes from prior law: (1) It authorizes the Commission to promulgate \"guidelines . . . for use of a sentencing court in determining the sentence to be imposed in a criminal case,\" along with policy statements to facilitate implementation of the guidelines, 28 U.S.C. § 994(a) (Supp. IV 1986); (2) it prospectively abolishes parole, see SRA § 235(b), 98 Stat. at 2032-33; and (3) it substantially curtails the availability to prisoners of credits toward their sentence for good time served, 18 U.S.C. § 3624(b) (Supp. IV 1986).\n\nThe Commission was given considerable guidance as to the promulgation of the guidelines. Congress specified, for example, that the guidelines be in the form of a matrix with one axis describing the characteristics of the offense and the other the offender's character and criminal history. The Commission was directed to establish a maximum \"sentencing range\" of six months or 25 percent of the minimum sentence, whichever is greater, for \"each category of offense involving each category of defendant.\" 28 U.S.C. § 994(a)(1), (b) (Supp. IV 1986). To guide the Commission in filling out the matrix, Congress listed seven offense characteristics and eleven offender characteristics, but left it to the Commission to determine their relevance, if any. See 28 U.S.C. § 994(c)-(e) (Supp. IV 1986). Congress also directed the Commission to construct the sentencing matrix in light of four overarching considerations: deterrence, public protection, rehabilitation and just punishment. 28 U.S.C. § 991(b)(1)(A), (2) (Supp. IV 1986); 18 U.S.C. § 3553(a)(2) (Supp. IV 1986). Finally, Congress provided that the race, sex, national origin, creed and socioeconomic status of the offender should not be part of the sentencing matrix. 28 U.S.C. § 994(d) (Supp. IV 1986).\n\nThe guidelines are binding, not merely hortatory. In imposing sentence, judges may deviate from the matrix only if there are aggravating or mitigating factors that the Commission did not adequately consider in formatting the guidelines and if they state their reasons on the record. 18 U.S.C. § 3553(b), (c)(2) (Supp. IV 1986). Both the defendant and the government may appeal sentencing decisions on the ground that they are inconsistent with the guidelines. 18 U.S.C. § 3742 (Supp. IV 1986). The Commission is empowered to monitor the operation of the guidelines and supplement or amend them, and intends to do so extensively. 28 U.S.C. §§ 994(o)-(r), 995(a) (Supp. IV 1986); see U.S. Sentencing Commission, Preliminary Observations of the Commission on Commissioner Robinson's Dissent 4, 6-7 (May 1, 1987).\n\nUnder the Act, the President appoints the Commission's seven members, including its chairman, subject to Senate confirmation. 28 U.S.C. § 991(a). The Act provides that three of the members must be federal judges whom the President may select after considering a list of six submitted by the Judicial Conference of the United States, and who may serve without resigning from the bench. Id. ; 28 U.S.C. § 992(c) (Supp. IV 1986). In addition, the Attorney General may appoint a representative to serve as an ex officio, nonvoting member of the Commission; during the Commission's first term, the Chairman of the United States Parole Commission or his designee serves as a second ex officio, nonvoting member. 28 U.S.C. § 991(a); SRA § 235(a)(5), 98 Stat. at 2033. Commissioners, whose initial terms vary, may be reappointed by the President to serve two full six-year terms. 28 U.S.C. § 992(a)-(b) (Supp. IV 1986). The President may remove Commission members \"for neglect of duty or malfeasance in office or for other good cause.\" 28 U.S.C. 991(a).\n\nThe President proceeded to appoint the seven Commissioners, including three sitting federal judges. To chair the Commission he chose Judge William W. Wilkins, then of the District Court for the District of South Carolina and later elevated to the Court of Appeals for the Fourth Circuit. Joining Judge Wilkins were Judge Stephen Breyer of the Court of Appeals for the First Circuit and Senior Judge George MacKinnon of the Court of Appeals for the District of Columbia Circuit. By a vote of six to one, with all three judges in the majority, the Commission adopted guidelines grouping offenses into 43 categories, and defendants into six categories. As provided by the Act, the guidelines were submitted to Congress. SRA § 235(a)(1)(B)(ii)(I), 98 Stat. at 2032. Congress having taken no action for six months, the guidelines became effective as to crimes committed on or after November 1, 1987. SRA § 235(a)(1)(B)(ii)(III), 98 Stat. at 2032.\n\nB. Jose Gubiensio-Ortiz was charged with aiding and abetting the illegal entry of an alien. 18 U.S.C. § 2 (1982); 8 U.S.C. § 1325 (Supp. IV 1986). The crime was committed on January 26, 1988. Gubiensio pleaded guilty two days later and was sentenced to six months in prison. On March 18, 1988, Gubiensio filed a petition for habeas corpus challenging the Bureau of Prisons' refusal to award him good time credits under 18 U.S.C. §§ 4161-4162 (1982), which sections were repealed when the guidelines went into effect. Gubiensio argued that he was entitled to good time credits because the Act unconstitutional and therefore did not effectively repeal the prior law. The petition was heard by District Judge Brewster, who had previously ruled that the guidelines were unconstitutional. See United States v. Arnold, 678 F. Supp. 1463, 1466-72 (S.D. Cal. 1988). In Gubiensio's case, Judge Brewster ruled that while the Act was unconstitutional insofar as it authorized the guidelines, the provisions pertaining to good time credits were severable. He therefore denied the petition.\n\nRaul Chavez-Sanchez was indicted on five counts of transportation of illegal aliens, 8 U.S.C. § 1324(a)(1)(B) (Supp. IV 1986), illegal entry into the United States, 8 U.S.C. § 1325 (Supp. IV 1986), and making false statements to a federal officer, 18 U.S.C. § 1001 (1982). Because the crimes were committed on or about November 19, 1987, Chavez was similarly subject to the Act. Chavez pleaded guilty to illegal entry before District Judge Irving, who subsequently declared the Act unconstitutional, incorporating Judge Brewster's opinion in Arnold. Chavez was sentenced to 18 months in prison and a $50 fine in accordance with pre-SRA law. While the sentence exceeded the maximum permitted under the applicable guideline, the court did not impose a period of supervised release following imprisonment as the guideline would have required.\n\nGubiensio appeals in No. 88-5848 the denial of his petition for habeas corpus on the basis that the good time credits provision of the SRA is not severable. The United States appeals in No. 88-5109 on the ground that Chavez's sentence was imposed \"in violation of law\" or \"as a result of an incorrect application of the sentencing guidelines.\" 18 U.S.C. § 3742(b)(1)-(2) (Supp. IV 1986). We expedited the appeals in both cases and consolidated them for decision.\n\nContentions of the Parties and Amicus Curiae\n\nBefore us are not only the United States and the criminal defendants but also the United States Sentencing Commission as amicus curiae. Each of the parties approaches the problem from a somewhat different perspective and together they have done a remarkably competent and thorough job of briefing all aspects of this difficult case.\n\nGubiensio and Chavez make a series of arguments in support of their claim that the Act is unconstitutional. Most fundamentally, they contend that Congress may not delegate so broadly its power to fix the punishments for crimes against the United States. Defendants are also much troubled by the nature and makeup of the Commission. They contend that the Commission is a judicial body, and argue that Congress may not delegate to the judiciary the authority to issue binding substantive regulations. Furthermore, allowing the President to make appointments from among officers of the judicial branch and then remove those officers violates the separation of powers doctrine. Gubiensio alone argues that once the Act is struck down, the good time credits provision cannot be saved by severance from the statutory scheme of which it is an integral part.\n\nThe United States agrees that the Commission is performing executive functions that may not properly be assigned to a body within the judicial branch. The government argues that we should construe the Act as constitutional by holding that the Commission is in fact within the executive branch. If we deem the Act unconstitutional because of the makeup of the Commission, the United States argues that the provisions with respect to good time credits operate independently and should be saved.\n\nAmicus urges us not to get entangled in metaphysical disputes about where precisely the Commission resides within our tripartite government. It urges us to take a sensible approach, unencumbered by formalistic hairsplitting. In the Commission's view, what Congress has done makes common sense which goes a long way toward making constitutional sense. If we are nevertheless troubled about the nature of the Commission, amicus suggests that we treat it as something akin to an independent regulatory agency, not unlike the Federal Trade Commission or the Securities and Exchange Commission. Amicus takes no sides in the dispute between Gubiensio and the government on the question of the severability of the good time credits provision.\n\nDiscussion\n\nI\n\nBefore turning to the merits, we first consider our jurisdiction to hear these appeals. While we generally have jurisdiction over appeals from final orders of the district courts, we do not have jurisdiction \"where a direct review may be had in the Supreme Court.\" 28 U.S.C. § 1291 (1982). Congress has provided that \"any party may appeal to the Supreme Court from an interlocutory or final judgment, decree of order of any court of the United States . . . holding an Act of Congress unconstitutional in any civil action, suit, or proceeding to which the United States . . . or any officer or employee thereof, as such officer or employee, is a party.\" 28 U.S.C. § 1252 (1982). The Supreme Court has held that section 1252 is mandatory and that the courts of appeals may not exercise jurisdiction in cases covered by it. Donovan v. Richland County Ass'n for Retarded Citizens, 454 U.S. 389, 390, 70 L. Ed. 2d 570, 102 S. Ct. 713 (1982) (per curiam); see also United States v. Henderson, 844 F.2d 685, 687 (9th Cir. 1988), petition for rehearing filed (June 10, 1988).\n\nIn Chavez's criminal case, the district court struck down the guidelines as unconstitutional. Because section 1252 provides for direct appeal to the Supreme Court only in civil cases, it does not, by its terms, apply to the government's appeal in the criminal action.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Gubiensio, on the other hand, appeals from the denial of habeas corpus. It is well established that such an appeal constitutes a \"civil action, suit or proceeding\" within the meaning of section 1252. Parker v. Levy, 417 U.S. 733, 742 \u0026 n.10, 41 L. Ed. 2d 439, 94 S. Ct. 2547 (1974); Reid v. Covert, 351 U.S. 487, 489, 100 L. Ed. 1352, 76 S. Ct. 880 (1956), rev'd on other grounds on reh'g, 354 U.S. 1, 77 S. Ct. 1222, 1 L. Ed. 2d 1148 (1957); see Henderson, 844 F.2d at 687-88 (section 1252 applies \"to nominally civil actions attacking the constitutionality of criminal prosecutions or convictions\").\n\nNonetheless, section 1252 does not divest us of jurisdiction over Gubiensio's case. His appeal presents only the issue of severability, \"a question of legislative intent,\" not the implied judgment that the guidelines are unconstitutional. Alaska Airlines, Inc. v. Brock, 480 U.S. 678, 107 S. Ct. 1476, 1480 n.5, 94 L. Ed. 2d 661 (1987). Direct appeal to the Supreme Court does not lie where the \"party does not contest the holding of statutory unconstitutionality, and seek= review only of another portion of the court's judgment.\" Heckler v. Edwards, 465 U.S. 870, 885, 79 L. Ed. 2d 878, 104 S. Ct. 1532 (1984). \"Edwards teaches that the decisions Congress targeted for appeal under § 1252 were those which involved the exercise of judicial power to impair the enforcement of an Act of Congress on constitutional grounds, and that it was the constitutional question that Congress wished [the] Court to decide.\" Walters v. National Ass'n of Radiation Survivors, 473 U.S. 305, 318, 87 L. Ed. 2d 220, 105 S. Ct. 3180 (1985).\n\nThe district court in Gubiensio applied the Act's good time credit provisions as written by Congress. Its earlier ruling in Arnold that the Act was unconstitutional affected the court's analysis but not the final outcome; the court would have reached precisely the same result had it determined that the Act was entirely constitutional. We therefore have jurisdiction over the appeals in both of these cases.\n\nII\n\nWe start by observing that the Act creates a statutory scheme that differs in material respects from anything that has gone before in our two centuries of constitutional history: The Commission is a body that must include three sitting federal judges, yet it is given very broad powers to issue binding regulations affecting the personal liberty of tens of thousands of individuals convicted of federal crimes each year; the President, head of the executive branch, may remove or reappoint all commissioners, including the judges; the Attorney General, an officer of the executive branch, or his delegate, serves on the Commission in a nonvoting capacity. The Act thus calls for an unprecedented sharing of power among the three branches of our government. This is not necessarily bad. It is the great strength of our Constitution that it allows the political branches of government considerable leeway in adapting to new problems or circumstances.\n\nAt the same time, however, novel arrangements, particularly those that call for the exercise of unprecedented powers by officers of one or more branches, deserve very careful scrutiny. In departing from the tried and true, Congress has occasionally crossed the line between the permissible and the impermissible. See, e.g., Bowsher v. Synar, 478 U.S. 714, 106 S. Ct. 3181, 92 L. Ed. 2d 583 (1986) (congressional removal of officer performing executive functions); INS v. Chadha, 462 U.S. 919, 77 L. Ed. 2d 317, 103 S. Ct. 2764 (1983) (legislative veto); Northern Pipeline Constr. Co. v. Marathon Pipe Line Co., 458 U.S. 50, 73 L. Ed. 2d 598, 102 S. Ct. 2858 (1982) (assignment of Article III judicial power to non-Article III judges); Buckley v. Valeo, 424 U.S. 1, 46 L. Ed. 2d 659, 96 S. Ct. 612 (1976) (congressional appointment of Federal Election Commissioners).\n\nThe test is not whether the arrangement is wise or efficient, nor even whether it makes particular sense to us; those are all questions to be resolved by the political branches when they bring the law into being. We must consider only whether the structure created by the Act upsets the balance of power established by the Constitution among the legislative, executive and judicial branches of government. Specifically, we must determine whether the arrangement impermissibly grants one branch the authority to exercise powers properly belonging to another branch, Youngstown Sheet \u0026 Tube Co. v. Sawyer, 343 U.S. 579, 587-89, 96 L. Ed. 1153, 72 S. Ct. 863 (1952); Chadha, 462 U.S. at 963 (Powell, J., concurring), or whether it \"prevents [the affected branch] from accomplishing its constitutionally assigned functions\" in the absence of \"an overriding need to promote objectives within the constitutional authority of Congress.\" Nixon v. Administrator of Gen. Servs., 433 U.S. 425, 443, 97 S. Ct. 2777, 53 L. Ed. 2d 867 (1977).\n\nIt is to this inquiry we now turn. We begin our analysis by considering whether federal judges serving as commissioners may constitutionally perform the rulemaking functions Congress has assigned to them. See Part II.A., at 13-35 infra. We then consider whether the Act's requirement that judges serve on the Commission impermissibly interferes with the central function of the judiciary, resolving cases and controversies. See Part II.B., at 36-50 infra. Finally, we consider whether the provisions pertaining to good time credits are severable from the rest of the statutory scheme. See Part III, at 51-56 infra.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nA. ASSIGNMENT OF IMPERMISSIBLE FUNCTIONS\n\nThe Constitution grants the federal judiciary only \"the judicial Power of the United States,\" and restricts its exercise to \"Cases\" or \"Controversies.\" U.S. Const. art. III, §§ 1, 2; see Morrison v. Olson, 487 U.S. 654, 108 S. Ct. 2597, 2611-12, 101 L. Ed. 2d 569 (1988); Muskrat v. United States, 219 U.S. 346, 356, 55 L. Ed. 246, 31 S. Ct. 250 (1911). The Supreme Court has consequently defined the judiciary's purpose in terms of \"the duty of interpreting and applying [laws] in cases properly brought before the courts,\" Massachusetts v. Mellon, 262 U.S. 447, 488, 67 L. Ed. 1078, 43 S. Ct. 597 (1923), and \"the right to determine actual controversies arising between adverse litigants, duly instituted in courts of proper jurisdiction,\" Muskrat, 219 U.S. at 361.\n\nThe case or controversy requirement \"defines the 'role assigned to the judiciary in a tripartite allocation of power to assure that the federal courts will not intrude into areas committed to the other branches of government.'\" United States Parole Comm'n v. Geraghty, 445 U.S. 388, 396, 63 L. Ed. 2d 479, 100 S. Ct. 1202 (1980) (quoting Flast v. Cohen, 392 U.S. 83, 95, 20 L. Ed. 2d 947, 88 S. Ct. 1942 (1968)); see also Allen v. Wright, 468 U.S. 737, 750, 82 L. Ed. 2d 556, 104 S. Ct. 3315 (1984) (case or controversy requirement \"defines with respect to the Judicial Branch the idea of separation of powers on which the Federal Government is founded\"). Therefore, \"[a]s a general rule, [the Court has] broadly stated that 'executive or administrative duties of a nonjudicial nature may not be imposed on judges holding office under Art. III of the Constitution.'\" Morrison v. Olson, 487 U.S. 654, 108 S. Ct. 2597, 2612, 101 L. Ed. 2d 569 (1988) (quoting Buckley v. Valeo, 424 U.S. 1, 123, 46 L. Ed. 2d 659, 96 S. Ct. 612 (1976) (citing United States v. Ferreira, 54 U.S. (13 How.) 40, 14 L. Ed. 42 (1852); Hayburn's Case, 2 U.S. (2 Dall.) 409, 1 L. Ed. 436 (1792))); see also Glidden Co. v. Zdanok, 370 U.S. 530, 579-83, 8 L. Ed. 2d 671, 82 S. Ct. 1459 (1962) (plurality opinion of Harlan, J.) (congressional reference jurisdiction); United Steelworkers of Am. v. United States, 361 U.S. 39, 43, 80 S. Ct. 1, 4 L. Ed. 2d 12 (1959) (per curiam); Federal Radio Comm'n v. General Electric Co., 281 U.S. 464, 469, 74 L. Ed. 969, 50 S. Ct. 389 (1930) (refusing to \"exercise or participate in the exercise of functions which are essentially legislative or administrative\"); Keller v. Potomac Elec. Power Co., 261 U.S. 428, 444, 67 L. Ed. 731, 43 S. Ct. 445 (1923) (refusing to review administrative ratemaking determinations because Congress could not confer on the Supreme Court \"legislative or administrative jurisdiction . . . either directly or by appeal\"). As the Court recently reiterated, this \"broad prohibition . . . maintain[s] the separation between the judiciary and the other branches of the Federal Government by ensuring that judges do not encroach upon executive or legislative authority or undertake tasks that are more properly accomplished by those branches.\" Morrison, 108 S. Ct. at 2613. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nIt is true that federal judges have occasionally been granted authority over matters that are not strictly cases or controversies. Nonetheless, the exceptions, and there are few, have heretofore been carefully circumscribed; they generally involve matters directly affecting the efficient performance of judicial functions. See Chandler v. Judicial Council of the Tenth Circuit, 398 U.S. 74, 84-85, 26 L. Ed. 2d 100, 90 S. Ct. 1648 (1970) (dicta); id. at 111 (Harlan, J., concurring) (\"reasonably ancillary to the primary, dispute-deciding function of the courts\"); see generally Note, Constitutional Infirmities, 96 Yale L.J. at 1380-81 \u0026 n.135. For example, the Judicial Conference of the United States is charged with \"promot[ing] uniformity of management procedures and the expeditious conduct of court business,\" in part by \"study[ing] . . . the operation and effect of the general rules of practice and procedure\" and recommending changes \"to promote simplicity in procedure, fairness in administration, the just determination of litigation, and the elimination of unjustifiable expense and delay.\" 28 U.S.C. § 331 (1982 \u0026 Supp. IV 1986); see also id. §§ 332-333 (1982 \u0026 Supp. IV 1986) (circuit judicial councils and conferences); id. §§ 620-628 (1982 \u0026 Supp. IV 1986) (establishing Federal Judicial Center to study improvements in judicial administration). Similarly, the Administrative Office of the United States Courts, overseen by the Chief Justice, handles the administrative and personnel matters of the courts, matters essential to the effective and efficient operation of the judicial system. See id. § 604 (1982 \u0026 Supp. IV 1986).\n\nAside from these ministerial duties, the judiciary has been given authority to police itself and those who appear before it. See In re Certain Complaints Under Investigation (Williams v. Mercer), 783 F.2d 1488, 1505 (11th Cir.) (upholding statute authorizing judicial council to investigate improper conduct by federal judges as conferring duties \"ancillary to the administration of the courts\"), cert. denied, 477 U.S. 904, 106 S. Ct. 3273, 91 L. Ed. 2d 563 (1986); 28 U.S.C. §§ 372 (1982 \u0026 Supp. IV 1986). But see Hastings v. Judicial Conference of the United States, 248 U.S. App. D.C. 180, 770 F.2d 1093, 1105-09 (D.C. Cir. 1985) (Edwards, J., concurring) (expressing doubts as to the constitutionality of judicial council because \"the judiciary's inherent powers of self-regulation do not extend beyond purely administrative details\"), cert. denied, 477 U.S. 904, 91 L. Ed. 2d 562, 106 S. Ct. 3272 (1986). Similarly, the district courts' inherent authority to appoint special prosecutors in cases of contempt has been upheld on the ground that \" the ability to punish disobedience to judicial orders is regarded as essential in ensuring that the Judiciary has a means to vindicate its own authority without complete dependence on other branches.\" Young v. United States ex rel. Vuitton et Fils S.A., 481 U.S. 787, 107 S. Ct. 2124, 2131, 95 L. Ed. 2d 740 (1987); see also Gompers v. Bucks Stove \u0026 Range Co., 221 U.S. 418, 450, 55 L. Ed. 797, 31 S. Ct. 492 (1911) (\"the power of courts to punish for contempts is a necessary and integral part of the independence of the judiciary, and is absolutely essential to the performance of the duties imposed on them by law\"). In sum, members of the judicial branch may undertake administrative duties relating to \"matters affecting the management and reputation of the judiciary itself.\" In re Certain Complaints, 783 F.2d at 1504.\n\nFinally, the judiciary has been granted authority to promulgate rules of procedure for the conduct of business within the courts. See 28 U.S.C. § 2071 (1982). This authority has traditionally been limited so that the rules promulgated govern only matters related to litigation, not \"the primary conduct and affairs of . . . citizens.\" Hanna v. Plumer, 380 U.S. 460, 476, 14 L. Ed. 2d 8, 85 S. Ct. 1136 (1965) (Harlan, J., concurring). For example, Congress limited the Supreme Court's power to promulgate rules of civil and appellate procedure to \"the forms of process, writs, pleadings, and motions, and the practice and procedure of the . . . courts.\" 28 U.S.C. § 2072 (1982); see also 18 U.S.C. §§ 3771-3772 (1982 \u0026 Supp. IV 1986) (authorizing \"rules of pleading, practice, and procedure\" for criminal cases). Congress further provided that \"such rules shall not abridge, enlarge or modify any substantive right.\" 28 U.S.C. § 2072. In Sibbach v. Wilson \u0026 Co., 312 U.S. 1, 85 L. Ed. 479, 61 S. Ct. 422 (1941), the Court upheld various federal rules issued pursuant to the Rules Enabling Act, noting that the delegation of powers was \"purposely restricted . . . to matters of pleading and court practice and procedure\" in order to protect the authority of the states to \"declare the substantive . . . law.\" Id. at 10. The Court concluded: \"The test must be whether a rule really regulates procedure, -- the judicial process for enforcing rights and duties recognized by substantive law and for justly administering remedy and redress for disregard or infraction of them.\" Id. at 14. While the decision in Sibbach rested primarily on statutory grounds, it nonetheless demarcates the traditional limits of congressional delegation to the judiciary: It has never before been thought appropriate to grant judges the power to issue substantive rules.\n\nThe distinction between rules of procedure and substantive regulations affecting primary conduct is illustrated by the adoption of the Federal Rules of Evidence. After the Supreme Court promulgated evidence rules in 1972, it submitted them to Congress pursuant to 28 U.S.C. § 2072, where substantial controversy arose over the rules pertaining to privileges. Unlike other rules of evidence, rules of privilege \"are not designed or intended to facilitate the fact-finding process or to safeguard its integrity,\" but rather are intended to further public policies and protect primary conduct extrinsic to the judicial process. McCormick on Evidence § 72, at 171 (3d ed. 1984). During the congressional debates over the rules, some legislators \"pointed out that the rules of privilege were not simply lawyers' technicalities, but affected the rights of individual citizens.\" 23 C. Wright \u0026 K. Graham, Federal Practice and Procedure § 5421, at 653 (1980).\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Others suggested that rules of privilege may in fact be substantive, and therefore beyond the rulemaking power of the courts.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nCongress eventually deleted the Supreme Court's proposed rules and substituted current Rule 501, under which privileges are governed either by common law principles or by state law. It then took the further step of permanently constraining judicial authority in this area by providing that, while the Supreme Court may generally amend the Federal Rules of Evidence subject only to a legislative veto, \"any . . . amendment creating, abolishing, or modifying a privilege shall have no force or effect unless it shall be approved by act of Congress.\" 28 U.S.C. § 2076 (1982). This provision was added to the House bill by an amendment introduced by Representative Holtzman, who argued that because rules of privilege \"involve extraordinarily important social objectives\" and \"are truly legislative in nature,\" 120 Cong. Rec. 2391 (1974), judicial promulgation of such rules was unconstitutional: \"The Supreme Court is not given the power under Article III of the Constitution to legislate rules on substantive matters. It can pass such judgments only in the context of a particular case or controversy.\" H.R. Rep. No. 650, 93d Cong., lst Sess. (1973), reprinted in 1974 U.S. Code Cong. \u0026 Admin. News 7075, 7098. This episode does not, of course, establish that Congress is precluded from delegating substantive rulemaking authority to the courts. It does demonstrate, however, a strong tradition of separating the judiciary from substantive rulemaking.\n\nThe Commission does not seriously dispute these propositions. In fact, it concedes that \"Congress could not delegate to a group of judges the task of promulgating binding antitrust guidelines through rulemaking.\" Amicus Brief at 38. Nevertheless, it argues that the sentencing guidelines are a proper exercise of judicial power, being mere procedural rules (like the rules of civil and criminal procedure) and not substantive regulations. We cannot agree. As the Supreme Court noted in Gore v. United States, 357 U.S. 386, 393, 2 L. Ed. 2d 1405, 78 S. Ct. 1280 (1958), such matters as \"the proper apportionment of punishment . . . are peculiarly questions of legislative policy.\" In passing the Act, Congress has effectively delegated that legislative policymaking function to the Commission. While the line between substance and procedure is fine and not easily discernible in close cases, this is not a close case. Reason and authority point squarely to the conclusion that the Commission is assigned the function of promulgating substantive rules and policies governing primary conduct and having the force and effect of law, tasks that only the legislative or executive branches, not the judicial branch, may constitutionally perform.\n\nWe note first that the term \"guidelines\" is something of a misnomer. The Commission's work is not intended merely to inform or advise judges as to how they should go about deciding what punishment to impose. Cf. 28 U.S.C. § 334 (1982) (authorizing institutes and joint councils under the Judicial Conference to study and formulate standards and objectives for sentencing). Rather, the guidelines set relatively narrow ranges for the imposition of punishment on any particular offender for any particular offense, reflecting the substantive policy choices made by the Commission. If the district judge errs in the application of the matrix, he is subject to reversal on appeal, see, e.g., United States v. King, 849 F.2d 1259, slip op. 8333, 8337 (9th Cir. 1987) (vacating sentence on basis of guideline's \"clear statutory language\"); even if he applies the matrix correctly but wants to impose a sentence outside the recommended sentencing range, he may do so only for narrowly specified reasons that he must document on the record.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e See 18 U.S.C. § 3553(b) (permitting departure from guidelines only where Commission did not adequately consider particular factor); U.S. Sentencing Commission, Guidelines Manual 1.6 (Oct. 1987) (Commission may prevent use of factor as ground for departure by specifying that Commission had adequately considered it) [hereinafter Sentencing Guidelines Manual]; cf. Miller v. Florida, 482 U.S. 423, 107 S. Ct. 2446, 2453, 96 L. Ed. 2d 351 (1987) (rejecting argument that similar state guidelines \"simply provide flexible 'guideposts' for use in the exercise of discretion\" because \"they create a high hurdle that must be cleared before discretion can be exercised\").\n\nThe substantive and policy-oriented nature of the Commission's mission is reflected in its statutory mandate, which is to develop guidelines that will\n\nprovide certainty and fairness in meeting the purposes of sentencing, avoiding unwarranted sentencing disparities among defendants with similar records who have been found guilty of similar criminal conduct while maintaining sufficient flexibility to permit individualized sentences when warranted by mitigating or aggravating factors not taken into account in the establishment of the general sentencing practices.\n\n28 U.S.C. § 991(b)(1)(B) (emphasis added). Congress also directed the Commission to construct the guidelines so as to promote deterrence, public protection, rehabilitation and just punishment. 28 U.S.C. § 991(b)(1)(A); 18 U.S.C. § 3553(a)(2). In implementing these statutory directives, the Commission had to make a variety of complex determinations that required the exercise of important policy judgments. What, for example, separates unwarranted sentencing disparities from ones that are warranted? What factors are relevant in determining whether the records of two individuals with wholly different backgrounds are similar or dissimilar for purposes of sentencing? What is the proper balance between deterrence and rehabilitation? Most fundamentally, how does one determine whether vastly different criminal conduct is similar or dissimilar for purposes of the punishment to be imposed?\n\nThese questions do, of course, have to be answered by any rational sentencing scheme. But, in answering them, the Commission must draw upon judgments reflecting philosophies of criminal justice; it must make decisions, independent of particular cases, about the relative importance of such considerations as the \"circumstances under which the offense was committed,\" the \"community view of the gravity of the offense,\" and the \"deterrent effect a particular sentence may have on the commission of the offense by others.\" 28 U.S.C. § 994(c)(2), (4), (6) (Supp. IV 1986). These are substantive decisions, fundamentally different from those governing the time for filing responsive pleadings or the extent of allowable discovery.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nTrue to its mission, the Commission proceeded to draw precisely the type of fine distinctions Congress entrusted to it. Thus, the guidelines provide equivalent punishments for such disparate offenses as shipping 50 weapons to a prohibited person and embezzling $150 from an employee pension plan; reckless homicide and transmitting wagering information; abusive sexual contact that puts a child in fear and unlawfully entering or remaining in the United States; drug trafficking and violation of the Wild Free-Roaming Horses and Burros Act; aggravated assault and smuggling $11,000 worth of fish. Dissenting View of Commissioner Paul H. Robinson on the Promulgation of Sentencing Guidelines by the United States Sentencing Commission 6-7 \u0026 n. 27 (May 1, 1987).\n\nNor were the Commission's judgments limited to individualized decisions as to particular crimes. It made the policy judgment that the sentencing range for such white-collar crimes as public corruption, tax evasion and antitrust violations needed to be increased because it deemed these offenses more serious than judges seemed to have found them when imposing individual sentences. See, e.g., Sentencing Guidelines Manual at 2.31 (Oct. 1987) (\"current sentencing practices do not adequately reflect the seriousness of public corruption offenses\"). In making this judgment, the Commission was perforce implementing its own understanding of public mores and values. See id. at 1.4 (decisions were \"policy-oriented departures\" from previous practice).\n\nThe Commission was also charged with making fundamental choices about the nature of penalties. For example, while Congress set outer limits on the length of probation, it delegated to the Commission the authority to decide when and where probation would be allowed. The Commission ultimately cut back sharply on the availability of probation, believing that more convicted criminals should serve some prison time. See id. at 1.8-1.9. Similarly, it decided that all non-indigent defendants must pay fines in the amounts provided by the schedule it promulgated. See Sentencing Guidelines Manual at 5.18 (Jan. 15, 1988) (§ 5E4.2(a)); see also U.S. Sentencing Commission, Preliminary Draft of Sentencing Guidelines 157-61 (Sept. 1986) (discussing debate over approach to fines).\n\nPerhaps the most striking example of a policy choice made by the Commission was its decision to abstain from promulgating guidelines for the imposition of the death penalty for capital crimes. Since Furman v. Georgia, 408 U.S. 238, 33 L. Ed. 2d 346, 92 S. Ct. 2726 (1972), the absence of adequate statutory standards has been thought to preclude the imposition of the death penalty for federal crimes even though various federal statutes still provide for such punishment. See, e.g., United States v. Harper, 729 F.2d 1216 (9th Cir. 1984) (Espionage Act). For many years, Congress has wrestled with the problem of whether and how to reinstate capital punishment, reaching consensus only as to two offenses. See 10 U.S.C. § 906a (Supp. IV 1986) (espionage by military personnel); 49 U.S.C.A. § 1472(i)(1)(B), (n)(1)(B) (West Supp. 1988) (aircraft piracy). Against this background, the Justice Department advised the Commission that it had the authority to establish guidelines and procedures for imposing the death penalty for a broad range of criminal offenses, and encouraged the Commission to do so. See Memorandum from Charles J. Cooper, Assistant Attorney General, Office of Legal Counsel, to Judge William W. Wilkins, Jr., Chairman of the U.S. Sentencing Commission, at 26-29 (Jan. 8, 1987) (Excerpt of Clerk's Record (ER) at 64-67); New York Times, Feb. 18, 1987, at A17 col. 1, (remarks of Assistant Attorney General William Weld). Members of Congress expressed contrary views. See, e.g., Washington Post, Mar. 11, 1987, at A17 (\"Senate Judiciary Committee Chairman Joseph R. Biden Jr. . . . warned last week that the commission would be 'dead' if it voted to revive the death penalty\"); New York Times, Feb. 18, 1987, at A17 col. 1, (remarks of Senator Kennedy that it was \"contemptible\" for the Justice Department to encourage the Commission \"to slip the death penalty through the back door\").\n\nBy a 4-3 vote, the Commission decided not to include the death penalty in its guidelines, apparently because it feared that public controversy over the death penalty might lead Congress to block implementation of the guidelines. Judge Wilkins was quite candid as to his reasons: \"I strongly support capital punishment, but I also recognize political realities.\" National Law Journal, Mar. 23, 1987, at 5; see also id. (comment of Judge MacKinnon that \"[i]t is an inopportune time politically\" to consider the death penalty). The controversy attracted substantial public attention, as it well should have, given the sensitive nature of the subject matter and the strong public sentiments aroused by the death penalty issue. Caught between executive and legislative branches at loggerheads over the subject, the Commission declined to exercise part of its authority in order to safeguard the major portion of its work. There is nothing inherently wrong with this, of course; it is an entirely understandable response to political pressures by a political body. But it vividly points up that the Commission's work was indeed substantive and political, not procedural and impartial.\n\nThe Commission argues that the types of choices the Commission must make are no different from those made by the judiciary in promulgating rules of procedure because the guidelines limit only the discretion of judges in passing sentence; they affect the conduct of individuals in the real world only peripherally and indirectly. This is far too myopic a view. What happens in litigation may occasionally have an incidental effect on primary conduct. Yet we can say with some assurance that people would not change their day-to-day behavior if the time to respond to motions under Fed. R. App. P. 27(a) were ten days rather than seven, or if pleadings had to be filed on paper 14 inches long rather than 11.\n\nThe sentencing guidelines are quite different. Across-the-board increases in the quantum of punishment imposed for certain categories of crime will very likely diminish the propensity of people to engage in that or closely related conduct. Thus, increasing the punishment for tax evasion will, presumably, deter tax evasion and make more cautious those individuals who are wont to cut corners in preparing their returns. That, of course, was the assumption that animated the Commission in increasing penalties for this and other white-collar crimes. See Sentencing Guidelines Manual at 1.9 (Oct. 1987) (\"the Commission's view is that the definite prospect of prison . . . will act as a significant deterrent to many of these crimes\"). It seems inconsistent for the Commission now to claim that the guidelines have no effect on the real world because they govern only the actions of judges and have little or no effect on primary conduct.\n\nIn addition to common sense and observation of the Commission's actual conduct, we find support for our conclusion that the sentencing guidelines are substantive in Miller v. Florida, 482 U.S. 423, 107 S. Ct. 2446, 96 L. Ed. 2d 351 (1987). Petitioner there challenged a revision to a state law remarkably similar to the Commission's sentencing guidelines on the ground that the revision violated the ex post facto clause. While not changing the statutory range of permissible punishments for any crime, the revised Florida guidelines increased the presumptive sentence range for the crime of which Miller was convicted. Id. at 2452. In determining the applicability of the ex post facto clause, the Court in Miller had to first decide whether the guidelines were merely procedural, in which case the clause would not apply, or substantive, in which case it would. See id. at 2452-53. Even though the Florida scheme permitted sentencing judges to depart from the guidelines if they found by clear and convincing evidence that the guideline sentences were inappropriate, the Court had no difficulty concluding that the change in sentencing law was substantive. The Court noted that \"although the distinction between substance and procedure might sometimes prove elusive, here the change at issue appears to have little about it that could be deemed procedural. . . . The amendment was intended to, and did, increase the 'quantum of punishment' for [certain] crimes.\" Id. at 2453. Precisely the same can be said about the Commission's guidelines. See p. 24 supra.\n\nThe Commission has emphasized how efficient and sensible it was for Congress to bypass the cumbersome legislative process and entrust the power to set sentencing guidelines to an independent body within the judicial branch, staffed in part by federal judges who have expertise in matters involving criminal punishment. But \"'convenience and efficiency are not the primary objectives -- or the hallmarks -- of democratic government.'\" Bowsher, 106 S. Ct. at 3194 (quoting Chadha, 462 U.S. at 944). Rather, convenience is the hallmark of consolidated power. Because it is more easily abused, such power poses a greater threat to liberty, here the liberty of thousands of individuals who will face substantially longer sentences under the guidelines.\n\nSeparation of powers, the architectonic principle of our federal government, provides \"structural protections against abuse of power\" that operate automatically and without regard to whether particular officials may actually abuse the power entrusted to them. Bowsher, 106 S. Ct. at 3191. Earlier this Term the Supreme Court reminded us that assigning a court impermissible powers in a quest for efficiency \"might in another context be a bureaucratic success story, but it would be one that would have serious constitutional ramifications\" and would \"risk[] the transgression of the constitutional limitations of Article III.\" Morrison v. Olson, 108 S. Ct. at 2615.\n\nThe Court's approach in Morrison is highly instructive. In that case, the Court considered the constitutionality of a law that authorized court appointment of an independent counsel to investigate and prosecute certain officials of the executive branch. In upholding the law, the Court relied principally on a specific constitutional provision authorizing courts to exercise such powers, namely the appointments clause of Article II. See U.S. Const. art. II, § 2, cl. 2 (\"Congress may by Law vest the Appointment of such inferior Officers, as they think proper, . . . in the Courts of Law\"). While the Court held that the appointments clause empowered Congress to give the special division \"some discretion in defining the nature and scope of the appointed official's authority,\" 108 S. Ct. at 2612, it carefully tailored this ancillary discretion in light of Article III's case or controversy requirement:\n\nWe do not think that Congress may give the Division unlimited discretion to determine the independent counsel's jurisdiction. In order for the Division's definition of the counsel's jurisdiction to be truly 'incidental' to its power to appoint, the jurisdiction that the court decides upon must be demonstrably related to the factual circumstances that gave rise to the Attorney General ' s investigation and request for the appointment of the independent counsel in the particular case.\n\nId. at 2613 (emphasis original). Thus, even where the function in question was expressly authorized by the Constitution, the Court was careful to explain that it could not be exercised in a way that would upset the constitutional balance of power.\n\nMorrison also approved the court's exercise of various ancillary powers that could not \"be said to derive from the Division's Appointments Clause authority.\" Id. The Court reasoned, however, that the particular powers vested did not \"impermissibly trespass upon the authority of the Executive Branch\": Some were \"passive,\" such as the duty to receive reports unaccompanied by the power to act on them; others were \"essentially ministerial,\" not involving the power to supervise the independent counsel in the exercise of her authority. Id. The Court concluded that the powers vested were not inherently executive, but rather were \"directly analogous to functions that federal judges perform in other contexts, such as deciding whether to allow disclosure of matters occurring before the grand jury, deciding to extend a grand jury investigation, or awarding attorney's fees.\" Id. at 2614 (citations omitted). We can draw no similar analogy in our case; Article III simply does not grant the judicial branch or the judges who comprise it any substantive rulemaking power.\n\nThe Morrison Court was troubled by the vesting in the judiciary of the power to terminate the office of independent counsel. In order to avoid \"a sufficient threat of judicial intrusion into matters that are more properly within the Executive's authority\" that would render the statute constitutionally infirm, the Court construed the statute so as to confine the termination power to a ministerial task that did not convey any true administrative control or executive authority. Id. at 2614-15. By contrast, as more fully discussed above, we view the functions entrusted to the Commission as quintessentially political in nature, requiring substantive, policy decisions that are intended to affect all future federal criminal defendants -- a far cry from Article III's limited grant of judicial power to decide cases and controversies.\n\nThe government and the Commission would allay our constitutional concerns by suggesting that we recharacterize the Commission as part of the executive branch or as akin to an independent regulatory agency. We doubt that it would be possible to so construe the Act, in light of Congress's clearly expressed intent to locate the Commission in the judicial branch. 28 U.S.C. § 991(a). In any event, this is a quibble without constitutional significance. When it comes to separation of powers, as with modern architecture, form follows function. See Bowsher, 106 S. Ct. at 3188-89, 3191-92; Chadha, 462 U.S. at 953 n. 16; Glidden, 370 U.S. at 582-83 (opinion of Harlan, J.); Ameron, Inc. v. United States Army Corps of Eng'rs, 787 F.2d 875, 883 (3d Cir.) (\"instead of 'decision by label,' we must focus on function and reality\"), aff'd as modified, 809 F.2d 979 (3d Cir. 1986), cert. granted, 485 U.S. 958, 108 S. Ct. 1218, 99 L. Ed. 2d 419 (1988).\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e The Commission is constitutionally infirm not merely because it resides in the judicial branch, but, independently, because its principal officers include federal judges, while its function is political and not judicial in nature.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e We cannot improve on the blunt eloquence of defendants: \"The doctrine of separation of powers . . . appl[ies] to people, not just to entities, and under our system it is the function of judges to decide the law, not to write it, regardless of where they are located in a government organizational chart and regardless of whether they are wearing their robes.\" Brief of Appellant Gubiensio-Ortiz and Appellee Chavez at 56.\n\nIn a similar vein, the Justice Department argues that when judges serve outside of the judiciary, as in an executive or independent agency, they do not serve in their capacity as judges, and are therefore not subject to the usual constitutional limitations. Even if this argument were persuasive where judges serve voluntarily, it loses its force entirely where Congress sets aside seats on a commission and requires the President to fill them with federal judges. See In re President's Comm'n on Organized Crime Subpoena of Scarfo, 783 F.2d 370, 376 \u0026 n. 3 (3d Cir. 1986) (upholding voluntary judicial service but suggesting that judicial service on the Sentencing Commission raises a more serious question). That judges are exercising the Commission's regulatory powers is no accident; non-judges would not be qualified to serve in those posts. Congress has assigned executive power to judges, even if they do not exercise that power as a court. The label applied cannot mask the reality that judicial officers are required by law to exercise both the judicial and executive power of the United States, thereby undermining the actual and perceived independence of the judiciary.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e See pp. 40-44 infra.\n\nWe take it as self-evident that Congress could not reserve key positions in the executive branch, such as attorney general, secretary of defense or secretary of state, to be filled only by federal judges. Equally unconstitutional would be a provision reserving one seat on the Securities and Exchange Commission or the Federal Trade Commission to a sitting federal judge. Nor, it seems to us, could Congress circumvent the prohibition against advisory opinions by appointing a commission -- consisting of federal judges or justices -- to advise it on the constitutionality of proposed legislation.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Any such legislative manipulation would, without doubt, be struck down in the name of substance over form. Similarly, the constitutionality of a congressional delegation of broad executive or legislative powers to Article III judges cannot turn on whether they are addressed as \"Your Honor\" or \"Commissioner.\"\n\nB. INTERFERENCE WITH FUNCTION\n\nWe consider next whether the Act is also constitutionally infirm because it works a substantial and unjustified interference with the operation of the judicial branch and its officers. See Nixon v. Administrator of Gen. Servs., 433 U.S. 425, 443, 97 S. Ct. 2777, 53 L. Ed. 2d 867 (1977). Interference by one branch with the operation of another branch need not be immediate and direct in order to be unconstitutional; subtle, indirect or even potential interference may be enough. Thus, in Bowsher v. Synar the Court held that a statutory provision permitting the Comptroller General to perform certain executive functions was invalid because the Comptroller General was subject to removal by Congress for \"permanent disability; inefficiency; neglect of duty; malfeasance; or a felony or conduct involving moral turpitude.\" 31 U.S.C. § 703(e)(1)(b) (1982) (sub-section numbers omitted). That the congressional removal power was closely circumscribed and, as a matter of historical fact, had remained moribund, did not impress the Court. See Bowsher, 106 S. Ct. at 3189 n. 5, 3190-91; id. at 3213 (White, J., dissenting) (\"of the six Comptrollers who have served since 1921, none has been threatened with, much less subjected to, removal\"). The Court deemed sufficient that there was the potential for interference.\n\nSimilarly, in Nixon v. Fitzgerald, 457 U.S. 731, 73 L. Ed. 2d 349, 102 S. Ct. 2690 (1982), the Court held that the President cannot be held liable in damages for actions he has taken in his official capacity. The Court reasoned that mere \"cognizance of this personal vulnerability frequently could distract a President from his public duties, to the detriment of not only the President and his office but also the Nation that the Presidency was designed to serve.\" Id. at 753. The potential for liability, the Court said, unconstitutionally interfered with the President's authority and function, and a court could therefore not assert jurisdiction over the action. Id. at 754.\n\nWith these principles in mind, we consider first whether the Act materially interferes with the function of the judiciary and, next, whether any such interference is justified by an \"overriding need\" to promote constitutionally authorized congressional objectives. Nixon v. Administrator of Gen. Servs., 433 U.S. at 443.\n\n1. At first blush, the Act appears to interfere little with the operation of the judiciary: The judicial ranks are diminished by only three members, and even those will not always serve on a full-time basis;\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e application of the guidelines by other federal judges is not fundamentally different from application of other types of regulations. On closer inspection, however, we find that service by federal judges on the Sentencing Commission has significant collateral effects on the operation of the judicial branch, effects that may not be lightly ignored.\n\nBecause judges must act -- and be perceived to act -- with complete impartiality in carrying out their responsibilities, the Constitution creates a wall of separation between the judiciary and the other branches; that wall is only seldom breached. Thus, the President appoints judges with the advice and consent of the Senate, but once those judges are appointed they may be removed only by impeachment. Judicial salaries may not be lowered in order to keep the political branches from influencing, or appearing to influence, judges in the performance of their assigned functions. While the political branches retain authority to limit the jurisdiction of the federal courts and control the budget of the judiciary, judges are, by and large, left alone to perform their constitutionally assigned task of deciding cases and controversies. Most federal judges pass their judicial careers without once confronting officers of the political branches, except, of course, as litigants. And properly so: It would be wholly incompatible with the concept of an independent judiciary for federal judges to maintain a continuous involvement with the political branches of government.\n\nBy requiring that three seats on the Commission be filled by federal judges, the Act forces a continuous and fairly significant entanglement between the judicial and executive branches of government. Since the commissioners have staggered terms, the President will have the responsibility of appointing, or reappointing, judicial members of the Commission every two years.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e Appointment, or reappointment, to the Commission could be perceived as a reward to judges for service particularly pleasing to the President. While we are confident that no federal judge would be swayed by such considerations, the tens of thousands of persons who litigate against the government in civil and criminal cases may legitimately be apprehensive about the fact that the President is able to dispense plums among the federal judges who will decide their cases. As the Eleventh Circuit noted in holding judicial service on a different presidential commission unconstitutional, \"'the need to preserve integrity is more than just a matter of judges satisfying themselves that the environment in which they work is sufficiently free of interference to enable them to administer the law honorably and efficiently. Litigants and our citizenry in general must also be satisfied.'\" In re Application of President's Comm'n on Organized Crime Subpoena of Scaduto, 763 F.2d at 1197-98 (11th Cir. 1985) (quoting Hobson v. Hansen, 265 F. Supp. 902, 931 (D.D.C. 1967) (Wright, J., dissenting)).\n\nMoreover, while serving on the Sentencing Commission, judges are required to deal with the political branches on a continuing basis. The Attorney General or his designee serves as an ex officio member; the Department of Justice carefully monitors the work of the Commission and provides continuous input. See, e.g., p. 26 supra. During the Commission's first term, the Chairman of the Parole Commission or his designee, also an executive-branch official, serves ex officio. Congress performs its oversight, informally while the Commission is deliberating, see p. 26 supra, and formally when it reviews the guidelines in deciding whether to block or modify them during the six-month review period. SRA § 235(a)(1)(B)(ii)(III), 98 Stat. at 2032. The three judges on the Commission are in the vortex of this activity.\n\nNor is it without significance that the President may remove Commission members \"for neglect of duty or malfeasance in office or for other good cause shown.\" 28 U.S.C. § 991(a). This is an extremely nebulous standard that gives the President virtually unfettered discretion to remove Commissioners. Cf. Bowsher, 106 S. Ct. at 3190 (similar clause authorizing removal by Congress was \"very broad and, as interpreted by Congress, could sustain removal of a Comptroller General for any number of actual or perceived transgressions of the legislative will\"). He might do so, for example, because he is displeased with the way a member has voted with respect to a particularly controversial issue, such as the death penalty, or, conceivably, because he is dissatisfied with the judge's ruling in a particular case.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e The possibility of such removal, as well as the other political realities, has the serious potential for influencing the votes of commissioners. This is as it should be for, as a political body performing a political function, the Commission ought to be responsive to political realities.\n\nBut the presence of three federal judges gives the Commission the luster of judicial impartiality; it suggests an objectivity and neutrality not normally associated with agencies in the political branches.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e Congress's formal designation of the Commission as \"an independent commission in the judicial branch,\" 28 U.S.C. § 991(a), enhances that aura of objectivity. Cf. H.R. Rep. No. 1017, 98th Cong., 2d Sess. 95 (1984) (recommending Judicial Conference promulgation of sentencing guidelines because Conference would \"remain[] independent of contemporary political currents\").\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e In effect, then, a series of political and policy decisions have been given a judicial imprimatur; they have been ratified by the reputation and prestige of the judiciary. And herein lies the rub: While the judges retain their judicial aura, they are in fact appointed through the political process, reviewable by political means and performing political functions.\n\nThis is not, in our view, a trivial matter. Judicial prestige is not an unlimited resource; it is a fragile and finite one, easily damaged or exhausted. \"Public confidence in the judiciary is indispensable to the operation of the rule of law; yet this quality is placed in risk whenever judges step outside the courtroom into the vortex of political activity. Judges should be saved 'from the entanglements, at times the partisan suspicions, so often the result of other and conflicting duties.'\" Hobsen v. Hansen, 265 F. Supp. at 923 (Wright, J., dissenting) (quoting In re Richardson, 247 N.Y. 401, 420, 160 N.E. 655, 661 (1928) (Cardozo, C.J.)).\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e As the Senate Judiciary Committee once concluded, \"it is not conducive to an independent judiciary or in keeping with public respect for the impartial dispensation of justice to place judges in a position where they may feel the pressure or influence of the executive branch.\" S. Exec. Rep. No. 7, 80th Cong., 1st Sess. 3 (1947), quoted in Note, Extrajudicial Activity, 22 Stan. L. Rev. at 604 n. 122.\n\nConcern with the entanglement of the judicial and executive power of the United States is no passing phenomenon: The Framers themselves feared consolidation of such authority in the hands of individuals. Madison, quoting Montesquieu, warned that \"'were the power of judging joined with the legislative, the life and liberty of the subject would be exposed to arbitrary control, for the judge would then be the legislator. Were it joined to the executive power, the judge might behave with all the violence of an oppressor.'\" The Federalist No. 47, at 303 (Mentor ed. 1961) (emphasis original). Hamilton reiterated that \"liberty . . . would have everything to fear from [the judiciary's] union with either of the other departments.\" The Federalist No. 78, at 466; see Note, Constitutional Infirmities, 96 Yale L.J. at 1383-84.\n\nThe aura of judicial impartiality must be conserved for the judiciary's core function, the resolution of cases or controversies. Because \"confidence in the disinterestedness of [its] judicatory functions\" is central to the judiciary's effectiveness, judges must remain free of external influences, and thereby be allowed to act and be perceived as acting in a neutral and impartial manner. Frankfurter, Advisory Opinions, in 1 Encyclopedia of the Social Sciences 475, 478 (1930). For this reason, political involvement by judges is severely limited.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e By requiring judicial service on the Commission, as well as by placing the Commission in the judicial branch, the Act breaches the wall of separation between the judiciary and the two political branches. It thereby threatens to squander the precious aura of judicial impartiality, to the ultimate detriment of the judiciary and the society it serves.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\n2. Having concluded that judicial service on the Sentencing Commission and placement of the Commission in the judicial branch have the potential of \"prevent[ing] the [judiciary] from accomplishing its constitutionally assigned functions,\" we next consider \"whether that impact is justified by an overriding need to promote objectives within the constitutional authority of Congress.\" Nixon v. Administrator of Gen. Servs., 433 U.S. at 443.\n\nCongress's admirable objective was to secure the contributions of individuals with expertise in sentencing and judicial administration. Congress, however, need not have required the service of sitting judges. For example, it might have called for the appointment of persons having had judicial experience, such as former or retired judges. Indeed, on several occasions, retired Justices have served in executive positions, some having left the bench to do so in order to avoid any conflict with their judicial duties.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nMoreover, Congress could well have relied on less intrusive means, such as informal input from the judiciary. Indeed, the Commission circulated the preliminary draft of the guidelines to every member of the federal judiciary, actively encouraged comments and sponsored regional hearings to receive such input. It may well be that the Commission would not have enjoyed the full-time service of Judges MacKinnon, Breyer and Wilkins. But as Chief Justice Hughes once noted, \"no man is as essential to his country's well being as is the unstained integrity of the courts.\" 1 M. Pusey, Charles Evans Hughes 300 (1951).\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nWe are not unmindful of the sporadic practice, dating from the dawn of the Republic, of having judicial officers serve in nonjudicial capacities.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e It is questionable whether the frequency of a practice can insulate it from constitutional challenge. See Chadha, 462 U.S. at 944; Glennon, The Use of Custom in Resolving Separation of Powers Disputes, 64 B.U.L. Rev. 109, 121 (1984). In any event, such service has been the rare exception, not the rule; it is a practice that has ever been highly controversial.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e Many respected jurists refused to serve, precisely because of these concerns.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e Others served only reluctantly,\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e and still others served and then regretted it.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e Indeed, the Chief Justice raised the issue when faced with the obligation to nominate judges for service on the Commission. See Letter from Chief Justice Warren E. Burger to President Ronald W. Reagan (Dec. 13, 1984) (ER at 38) (\"there is a serious question of the constitutionality of an Article III judge in active service undertaking a 'full-time' Executive Branch appointment to an independent commission\").\n\nUntil quite recently, these instances of judicial service were not challenged, and indeed were probably unchallengeable for lack of anyone with standing to do so. In two recent cases where such judicial service has been challenged, courts have come to opposite conclusions. Compare In re President's Comm'n on Organized Crime (Subpoena of Scarfo), 783 F.2d 370 (3d Cir. 1986) (allowing judicial service) with In re Application of President's Comm'n on Organized Crime (Subpoena of Scaduto), 763 F.2d 1191 (11th Cir. 1985) (judicial service unconstitutional because it impairs function of judiciary).\n\nIn any event, we need not completely disown our tradition of extrajudicial service by judicial officers to conclude that the judicial entanglement with the political branches is unconstitutional here. Distinctive in the Sentencing Reform Act is the requirement that judges serve as members of the Commission. This requirement of judicial participation greatly heightens the dangers we perceive. In the first place, placement of the Commission in the judicial branch as well as continuous and mandatory judicial participation gives the Commission a far more pronounced judicial aura than occasional appointment of a judge to a commission at the President's pleasure.\n\nMoreover, we cannot view the Sentencing Commission in isolation; the principle it establishes is hard to contain. Legislators interested in bringing judicial expertise to bear on a variety of problems may be tempted to place judges on any number of commissions. It would be difficult to say that service by three judges on single commission is permissible but service by many judges on dozens of commissions is not. Yet, it would surely change the public perception of the judicial branch if large numbers of judges devoted a substantial portion of their skills and talents to political endeavors. See also note 21 supra. We can prevent undue entanglement by the judiciary in the operation of the political branches only by adopting a clear-cut, prophylactic rule: Congress may not, under our system of separated powers, require judges to serve on bodies that make political decisions.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\n\nIII\n\nHaving found the provisions of the Sentencing Reform Act establishing the Sentencing Commission and authorizing the promulgation of the guidelines to be unconstitutional, we must now decide whether the provisions of the Act substantially curtailing good time credits are severable, or whether they must be invalidated as well.\n\nPrior to November 1, 1987, federal law provided for a complex system of meritorious and industrial good time credits. Meritorious good time credits of up to five days for each month served could be awarded prisoners whose sentences ranged from six months to a year; at the far end, ten days a month could be awarded to prisoners sentenced to ten years or more. 18 U.S.C. § 4161 (1982). In addition, industrial credits of up to three days a month could be awarded for the first year, and five days a month for succeeding years. 18 U.S.C. § 4162 (1982).\n\nThe Sentencing Reform Act repealed these provisions, providing for a maximum good time credit of 54 days a year after the first year of imprisonment, and eliminating credits altogether for sentences of one year or less. 18 U.S.C. § 3624(b) (Supp. IV 1986). Faithful to the Act, the Bureau of Prisons denied Gubiensio, who is serving a six-month sentence, any good time credits. He now seeks restoration of the credits he would have earned under pre-SRA law.\n\nAs the Supreme Court stated last Term,\n\nthe standard for determining the severability of an unconstitutional provision is well established: \"'Unless it is evident that the Legislature would not have enacted those provisions which are within its power, independently of that which is not, the invalid part may be dropped if what is left is fully operative as a law.'\" Buckley v. Valeo, 424 U.S. 1, 108, 46 L. Ed. 2d 659, 96 S. Ct. 612 (1976) (per curiam), quoting Champlin Refining Co. v. Corporation Comm'n of Oklahoma, 286 U.S. 210, 234, 76 L. Ed. 1062, 52 S. Ct. 559 (1932).\n\nAlaska Airlines, Inc. v. Brock, 480 U.S. 678, 107 S. Ct. 1476, 1480, 94 L. Ed. 2d 661 (1987). The lodestar of severability is legislative intent. Regan v. Time, Inc., 468 U.S. 641, 653, 82 L. Ed. 2d 487, 104 S. Ct. 3262 (1984) (plurality opinion). The \"relevant inquiry in evaluating severability is whether the statute will function in a manner consistent with the intent of Congress.\" Alaska Airlines, 107 S. Ct. at 1481 (emphasis original).\n\nA.\n\nOur point of departure is the language of the statute. The Act does not contain any severability clause. Although the absence of such a clause does not raise a presumption of nonseverability, see Alaska Airlines, 107 S. Ct. at 1481, it does suggest that Congress intended to have the various components of the sentencing reform package operate together or not at all.\n\nThe statutory scheme supports this inference. Congress specified that the abolition of parole and new good time rules would apply only to sentences imposed under the guidelines. 18 U.S.C. §§ 3551, 3558, 3624 (Supp. IV 1986). As the Senate Report noted, \"the sentencing guidelines system will not replace the current law provisions relating to the imposition of sentence, the determination of a prison release date, and the calculation of good time allowance\" until the guidelines \"replace the existing sentencing system.\" S. Rep. No. 225, at 188-89, 1984 U.S. Code Cong. \u0026 Admin. News at 3371-72. Moreover, when it became clear that the guidelines would not be completed by the originally scheduled effective date, Congress delayed implementation of the good time and parole provisions until the guidelines were completed. See Sentencing Reform Amendments Act of 1985, Pub. L. No. 99-217, §§ 2, 4, 99 Stat. 1728 (1985).\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e Congressional efforts to dovetail the reforms pertaining to good time credits and parole with the implementation of the guidelines are a compelling indication that the pre-SRA parole and good time credit provisions were not meant to apply to sentences imposed under the Act.\n\nWe find further support for our interpretation of congressional intent in the legislative history of the Act. Congress's overriding goal was to eliminate the gross disparities in sentencing resulting from the great discretion it had previously accorded to judges, the Bureau of Prisons and the Parole Commission, which often worked at cross purposes in determining an individual prisoner's actual term of incarceration. Congress therefore sought to implement a \"comprehensive plan\" to eliminate excess discretion on all three levels, so that \"[a] sentence imposed by a judge . . . will represent the actual period of time that the defendant will spend in prison, except that a prisoner, after serving one year of his term of imprisonment, may receive credit . . . toward service of his sentence if he satisfactorily complies with the institution's rules.\" S. Rep. No. 225, at 46, 115, 1984 U.S. Code Cong. \u0026 Admin. News at 3229, 3298. Congress having chosen a \"comprehensive\" approach to making sentencing more determinate, we will not sever companion sections of the guidelines system that would introduce piecemeal reforms.\n\nB. The government argues that even if Congress did not intend the guidelines to be severable in 1984, it changed its mind when it amended the Act in 1987. As originally passed, the Act required guidelines for all offenses, see 28 U.S.C. § 994 (Supp. III 1985), and the Sentencing Commission promulgated guidelines for many petty offenses. It became apparent, however, that no purpose would be served by developing guidelines for offenses carrying maximum sentences of six months or less, because the Act required that there be at least a six-month difference between the maximum and minimum permissible sentences for each offense. As a result, Congress eliminated the requirement that the Commission promulgate guidelines for such petty offenses, and provided that for this limited category of crimes sentencing courts need neither follow any specific guideline nor consult guidelines for similar offenses. Sentencing Act of 1987, Pub. L. No. 100-182, § 16, 101 Stat. 1266, 1269; see 28 U.S.C.A. § 994(w) (West Supp. 1988); 18 U.S.C.A. § 3553(b) (West Supp. 1988). Accordingly, effective January 15, 1988, the Sentencing Commission amended Guideline § 2Ll.2, which covers illegal entry into the United States, to make it inapplicable to first offenses. Sentencing Guidelines Manual at 2.102 (Jan. 15, 1988). There was therefore no guideline covering the crime for which Gubiensio was convicted.\n\nIt is not entirely clear what inference the government would have us draw from Congress's limited fine-tuning of the Act in 1987. It is quite a stretch to view the 1987 amendments as making any general statement on the relationship between good time credits and the guidelines; indeed, the amendments had nothing to do with the credit provisions. The government's argument seeks to prove too much on the basis of too little. We reject it.\n\nConclusion\n\nThe judgment of the district court in No. 88-5109 holding the sentencing guidelines unconstitutional is AFFIRMED. The judgment of the district court in No. 88-5848 denying the petition for habeas corpus is REVERSED and the case is remanded for proceedings consistent with this opinion.\n\nOrder FILED SEPTEMBER 8, 1988\n\nThe government's application for a stay of this court's decision is denied.*fn*\n\nWIGGINS, Circuit Judge, dissenting.\n\nI dissent because I believe that the Sentencing Guidelines withstand all constitutional challenges. I also believe that if the Guidelines are found unconstitutional, the \"good time\" credit provisions are severable from the infirm sections of the Sentencing Reform Act.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nThis is a case about power: the power and authority the Constitution grants to our three branches of government. I agree that any question of the Sentencing Commission's placement in the judicial branch must recognize function over form. But a functional approach to a separation of powers inquiry demands a determination whether an allocation of authority to one branch compromises the constitutionally mandated role of all the branches. The majority is content, I believe, with finding that the participation of three article III judges on the Commission compromises their status as federal judges, and thus renders the Commission's work infirm. For reasons explained below, I reject this conclusion. More importantly, I believe that it answers the wrong question in the wrong order. While the majority exalts function, they have forgotten form, that is, the essential structure of a separation of powers analysis.\n\nThe inquiry I adopt is straight-forward. First, I ask what power is being assigned by Congress in the Sentencing Reform Act (the \"Act\"), and whether the power is properly within Congress' domain. I believe that the power to prescribe sentences for violations of the laws of the United States is assuredly within the congressional mandate. Next, I determine whether Congress properly gave the power to another entity, the Sentencing Commission (the \"Commission\"), irrespective of that entity's particular placement in the scheme of government. This is the issue of delegation. I believe that Congress properly delegated the job of devising determinate sentencing guidelines to the Commission.\n\nThese questions are significant because they provide answers that directly inform the next inquiry: whether the Commission was properly placed in the judicial branch. I begin with the essential premise that the Constitution itself requires that we presume Congress' allocation of power to another branch is lawful. The Framers would not have permitted the powers of the federal government, limited as they were, to go unexercised for lack of an authority to assign them, where necessary. That authority is vested in Congress. There are, however, limits to that prerogative, and limits to our deferrence of Congress' authority to allocate.\n\nThe first limit is that Congress may not assign a power it had no right to exercise itself, such as one granted to the states, or to the people in the form of an essential guaranty or freedom. This is nothing more than a restatement of the first question: whether sentencing is properly within Congress' domain. Next, I ask whether another explicit constitutional provision demands an alternate allocation, that is, whether the constitution itself has removed certain discretion from Congress to assign functions to another branch. I believe there is no such alternate allocation in this case. Finally, I consider whether the allocation of power constitutes a genuine threat to the ability of any branch to carry out its constitutionally assigned duties. I will consider, in turn, the impact of the Commission's placement in the judicial branch on Congress, the Executive, and the judiciary itself. I believe that no branch's work is compromised by the Act and that Congress' decision satisfies every step of this most demanding, yet sensible, inquiry.\n\nA. Congressional Power to Issue Mandatory Sentencing Guidelines\n\nBefore one can determine whether any delegation to the Commission was proper, it must be decided whether it was in Congress' power to issue mandatory sentencing guidelines. It is an article of faith that Congress does indeed have power to establish, if it so desires, mandatory and precise sentences for crimes. See Ex Parte United States, 242 U.S. 27, 42, 37 S. Ct. 72, 61 L. Ed. 129 (1916) (it is indisputable \"that the authority to define and fix the punishment for crime is legislative and includes the right in advance to bring within judicial discretion, for the purpose of executing the statute, elements of consideration which would be otherwise beyond the scope of judicial authority, and that the right to relieve from the punishment, fixed by law and ascertained according to the methods by it provided, belongs to the executive department.\"); United States v. Wiltberger, 18 U.S. (5 Wheat.) 76, 95, 5 L. Ed. 37 (1820). Indeed, judges in the early days of the Republic had no broad-ranging authority to define varying sentences. United States v. Grayson, 438 U.S. 41, 45, 57 L. Ed. 2d 582, 98 S. Ct. 2610 (1978). The practice of Congress prescribing wide sentence ranges, with judges setting precise sentences, evolved later.\n\nConsequently, there is no due process right to individualized sentencing. The Supreme Court has held that \"the prevailing practice of individualizing sentencing determinations generally reflects simply enlightened policy rather than a constitutional imperative\" in non-death penalty cases. Woodson v. North Carolina, 428 U.S. 280, 304, 49 L. Ed. 2d 944, 96 S. Ct. 2978 (1976). Courts that have considered due process challenges to mandatory sentence statutes have uniformly rejected them. See Spencer v. Texas, 385 U.S. 554, 559-60, 17 L. Ed. 2d 606, 87 S. Ct. 648 (1967) (upholding recidivist mandatory sentencing); United States v. Smith, 818 F.2d 687, 691 (9th Cir. 1987). It was, therefore, completely within Congress' power to establish mandatory sentencing guidelines.\n\nB. Proper Delegation to the Commission\n\nHaving established that Congress had the power to issue mandatory sentencing guidelines, it must be determined whether Congress properly delegated these duties to the Commission.\n\n1. The Test of Nondelegability\n\nArticle I of the Constitution provides that \"all legislative powers . . . shall be vested in the Congress of the United States.\" U.S. Const. art. I, § 1. The nondelegation doctrine embodies the notion that the \"formulation of policy is a legislature's primary responsibility, entrusted to it by the electorate. . . .\" United States v. Robel, 389 U.S. 258, 276, 19 L. Ed. 2d 508, 88 S. Ct. 419 (1967) (Brennan, J., concurring). As the Supreme Court stated in Field v. Clark, 143 U.S. 649, 36 L. Ed. 294, 12 S. Ct. 495 (1892), \"that Congress cannot delegate legislative power to the President is a principle universally recognized as vital to the integrity and maintenance of the system of government ordained by the Constitution.\" Id. at 692.\n\nWhether a congressional delegation violates this doctrine does not, however, depend on whether the power delegated falls within the \"core functions\" of the legislature. This per se theory of nondelegability derives from Chief Justice Marshall's dictum in Wayman v. Southard, 23 U.S. (10 Wheat.) 1, 6 L. Ed. 253 (1825) that\n\nthe line has not been exactly drawn which separates those important subjects, which must be entirely regulated by the legislature itself, from those of less interest, in which a general provision may be made, and power given to those who are to act under such general provisions, to fill up the details.\n\nId. at 43. This \"core functions\" argument has, however, been repudiated in later Supreme Court jurisprudence. See Lichter v. United States, 334 U.S. 742, 778, 92 L. Ed. 1694, 68 S. Ct. 1294 (1948) (\"A constitutional power implies a power of delegation of authority under it sufficient to effect its purposes.\"). Moreover, judicial adoption of a \"core functions\" analysis would \"be effectively standardless.\" Synar v. United States, 626 F. Supp. 1374, 1385 (D.D.C.), aff'd sub nom. Bowsher v. Synar, 478 U.S. 714, 106 S. Ct. 3181, 92 L. Ed. 2d 583 (1986). And even if a \"core functions\" analysis were adopted in this case, it is doubtful whether the determination of criminal penalties and sentencing would be a core legislative function. See, e.g., United States v. Grimaud, 220 U.S. 506, 55 L. Ed. 563, 31 S. Ct. 480 (1911) (upholding delegation to Secretary of Agriculture to regulate use of forests with criminal sanctions); United States v. Daniel, 813 F.2d 661, 662-63 (5th Cir. 1987) (upholding scheduling of controlled substances); United States v. Davis, 564 F.2d 840, 843-44 (9th Cir. 1977), cert. denied, 434 U.S. 1015, 54 L. Ed. 2d 760, 98 S. Ct. 733 (1978) (same).\n\nNor is it a requisite for proper delegation that it be supported by some rigorous \"principle of necessity.\" Although the Supreme Court has occasionally recognized the \"necessity\" for a delegation, see e.g., Buttfield v. Stranahan, 192 U.S. 470, 496, 48 L. Ed. 525, 24 S. Ct. 349 (1904), it is doubtful whether that word means anything more than the word \"necessary\" in the \"necessary and proper\" clause of the Constitution. U.S. Const. art. I, § 8, cl. 18; see McCulloch v. Maryland, 17 U.S. (4 Wheat.) 316, 413-15, 4 L. Ed. 579 (1819) (rejecting theory that \"necessary and proper\" means \"absolute physical necessity\"). In any case, while \"necessity\" has been noted by the Supreme Court in upholding a delegation, \"lack of necessity\" has never been invoked to strike one down. This per se theory of nondelegation must also fail.\n\nThese per se theories of nondelegability aside, the classic exposition of the doctrine was in J.W. Hampton, Jr. \u0026 Co. v. United States, 276 U.S. 394, 72 L. Ed. 624, 48 S. Ct. 348 (1928), where Chief Justice Taft wrote that so long as Congress \"lay[s] down by legislative act an intelligible principle to which the person or body authorized to [exercise delegated authority] is directed to conform, such legislative action is not a forbidden delegation of legislative power.\" Id. at 409. Under this test, only two statutes have been declared unconstitutional by reason of undue delegation. Both involved portions of the controversial National Industrial Recovery Act of 1933. See A.L.A. Schechter Poultry Corp. v. United States, 295 U.S. 495, 79 L. Ed. 1570, 55 S. Ct. 837 (1935) (invalidating a statute that permitted members of an industry to propose, and the President to approve, \"codes of fair competition\" where Congress had neglected to define \"fair competition\"); Panama Refining Co. v. Ryan, 293 U.S. 388, 79 L. Ed. 446, 55 S. Ct. 241 (1935) (invalidating statute which failed to set forth any policy or rules to guide state officials in their determination of what production or shipping of petroleum products should be permitted). In the fifty years since these two cases, courts have always rejected delegation challenges. See Synar, 626 F. Supp. at 1383 n. 9 (citing all recent cases where delegation challenges have been rejected).\n\n2. Applying the Test\n\nWhen the J.W. Hampton test for nondelegability is applied to the mandate given to the Sentencing Commission, it is manifest that Congress offered an \"intelligible principle\" and substantial guidance for its work.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Indeed, compared with the numerous other very broad legislative delegations that have withstood judicial scrutiny, the provisions in the Sentencing Reform Act appear almost constricting. See e.g., Lichter, 334 U.S. at 785-86 (delegating enactment of standards \"permitting recovery of excessive profits\"); Federal Power Comm'n v. Hope Natural Gas Co., 320 U.S. 591, 600, 88 L. Ed. 333, 64 S. Ct. 281 (1944) (permitting Commission to fix \"just and reasonable\" rates for natural gas); National Broadcasting Co. v. United States, 319 U.S. 190, 225-26, 87 L. Ed. 1344, 63 S. Ct. 997 (1943) (permitting licensing of radio communications \"as public interest, convenience, or necessity [requires]\"); see also 28 U.S.C. § 994(b)(1) (requiring that Commission's sentencing guidelines be consistent with Criminal Code).\n\nDefendants maintain, however, that the mandatory character of the guidelines compel a finding of nondelegability. See Comment, The Constitutional Infirmities of the United States Sentencing Commission, 96 Yale L.J. 1363, 1375 (1987) (\"Only if the standards for departure [from the guidelines] and appellate review are stretched to make the guidelines into presumptive recommendations can the nondelegation challenge be met.\") [hereinafter \"Yale Comment\"]. Whether the guidelines are mandatory has no effect on Congress' delegation. Congress often delegates authority for mandatory laws and regulations. See National Cable Television Ass'n v. United States, 415 U.S. 336, 342, 39 L. Ed. 2d 370, 94 S. Ct. 1146 (1974). Defendants also suggest that Congress left too many policy determinations to the Commission. These included whether a conviction-based or real offense system would be used to determine the seriousness of the offense, the weight given to the seven relevant factors concerning the character of the offense, whether a fine should be imposed and probation allowed, whether confinement could be served other than in a prison, and whether plea bargaining should be permitted in the future. Most importantly, the Commission was required to decide the absolute base level for each crime, which reflected not only the Commissioners' belief of the seriousness of the offense, but also established the lowest end of the sentencing parameters. Finally, it was left to the Commission to decide whether to establish sentencing procedures that would permit the reinstatement of the death penalty. See Furman v. Georgia, 408 U.S. 238, 33 L. Ed. 2d 346, 92 S. Ct. 2726 (1972) (absence of adequate statutory standards precluded the imposition of the death penalty provisions that remained in the Federal Criminal Code). Obviously, defendants do not challenge whether the Commission made the right choices concerning these policy questions. Instead, they argue that because these decisions were left to the discretion of the Commission it violated the delegation doctrine.\n\nIt is true, as the district court noted, that \"defendants point out several areas where Congress could have given more guidance to the Commission than it did. That is not the test, however.\" Arnold, 678 F. Supp. at 1468. \"It is not necessary that Congress supply . . . a specific formula . . . in a field where flexibility and the adaptation of the congressional policy to infinitely variable conditions constitute the essence of the program.\" Lichter, 334 U.S. at 785. On balance, I believe that Congress provided substantial and detailed guidance for the Commission. Congress specified that a double-matrix system be used, 28 U.S.C. § 994(b)(1), and detailed the factors to be considered in sentencing. Id. §§ 994(c), (d). Congress required that the Commission establish policies and practices that conformed with the purposes of sentencing, including deterrence, public protection, rehabilitation, and punishment commensurate with the seriousness of the crime. Id. § 991(b)(1)(A); 18 U.S.C. § 3553(a)(2). Congress demanded the imposition of maximum or substantial terms for specified defendants and offenses, 28 U.S.C. § 994(h), (i), while also requiring the Commission to take care not to increase prison over-crowding. Id. § 994(g). The guidance given to the Commission by Congress satisfies the requirements of the delegation doctrine. The Sentencing Reform Act did not constitute an invalid delegation of legislative power.\n\nC. Separation of Powers Violations\n\nThe district court held that the placement of the Sentencing Commission in the judicial branch violated the separation of powers doctrine. The majority agrees with this conclusion. To consider this challenge a court must decide whether that placement created a genuine threat to the ability of any branch of the government to carry out its constitutionally assigned duties.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nIt is \"a general rule inherent in the American constitutional system, that, unless otherwise expressly provided or incidental to the powers conferred, the legislature cannot exercise either executive or judicial power; the executive cannot exercise either legislative or judicial power; the judiciary cannot exercise either executive or legislative power.\" Springer v. Government of the Philippine Islands, 277 U.S. 189, 201-02, 72 L. Ed. 845, 48 S. Ct. 480 (1928). This does not mean, of course, that the three branches of government are hermetically sealed. Buckley v. Valeo, 424 U.S. 1, 121, 46 L. Ed. 2d 659, 96 S. Ct. 612 (1976). The declared purpose of separating and dividing the powers of government was to \"diffus[e] power the better to secure liberty.\" Youngstown Sheet \u0026 Tube Co. v. Sawyer, 343 U.S. 579, 635, 96 L. Ed. 1153, 72 S. Ct. 863 (1952) (Jackson, J., concurring) (echoing the famous warning of Montesquieu in Esprit de Lois, quoted by James Madison in The Federalist No. 47, that \"'there can be no liberty, where the legislative and executive powers are united in the same person, or body of magistrates' . . .\" (The Federalist No. 47, at 325 (J. Cooke ed. 1961))).\n\nI believe that the essential question for consideration here is whether Congress' decision to assign the Commission as an independent agency within the judicial branch compromises the constitutionally mandated functions, prerogatives, and roles of the legislature, the executive, or the judiciary itself. We should be mindful, of course, that congressional enactments are presumed constitutional. McCulloch v. Maryland, 17 U.S. (4 Wheat.) 316, 4 L. Ed. 579 (1819). In addition, the Constitution itself affords the Congress the power to make the necessary allocation of authority needed to effectuate the powers of the federal government. The Constitution provides that Congress shall \"make all Laws which shall be necessary and proper for carrying into Execution the foregoing Powers, and all other Powers vested by this Constitution in the Government of the United States, or in any Department or Officer thereof.\" U.S. Const. art. I, § 8, cl. 18; see generally, Van Alstyne, The Role of Congress in Determining Incidental Powers of the President and of the Federal Courts: A Comment on the Horizontal Effect of the Sweeping Clause, 36 Ohio St. L.J. 788 (1975). This means that Congress has the power to determine what is \"necessary and proper\" for carrying out its own functions, Ex Parte Curtis, 106 U.S. 371, 372, 27 L. Ed. 232, 1 S. Ct. 381 (1882), as well as for executing the duties of the other branches of government. See, e.g., Fong Yue Ting v. United States, 149 U.S. 698, 37 L. Ed. 905, 13 S. Ct. 1016 (1893) (Congress has power to prescribe rules of evidence in federal courts); Bank of United States v. Halstead, 23 U.S. (10 Wheat.) 51, 6 L. Ed. 264 (1825) (Congress may legislate form and effect of executions on judgments recovered in federal courts).\n\nThe provision of the necessary and proper clause which grants to Congress the power to allocate functions among all the branches of government demands that any separation of powers challenge be viewed in a pragmatic and realistic way. See CFTC v. Schor, 478 U.S. 833, 106 S. Ct. 3245, 3261, 92 L. Ed. 2d 675 (1986). Once again, the approach I adopt here is to determine first if any federalism concern is raised by the placement of the Commission in the judicial branch. Next I ascertain if the congressional allocation of authority directly contradicts any other constitutional provision which demands an alternate allocation. Finally, if these two per se tests do not yield a result, a court must see that Congress' proposed allocation of power does not interfere with the constitutionally-assigned duties of the branches.\n\n1. Per Se Limitations on Congress' Power to Allocate Functions.\n\nThere are limits on Congress' power to assign the duties of operating the federal government to its respective branches. These limits inform a separation of powers analysis. The first is that any allocation by Congress of authority must be within the bounds of the powers assigned to the federal government. Northern Secur. Co. v. United States, 193 U.S. 197, 48 L. Ed. 679, 24 S. Ct. 436 (1904). This threshold concern is not raised by the placement of the Sentencing Commission within the judicial branch, because, as noted above, supra A, Congress has the power to issue sentencing guidelines.\n\nSecondly, in exercising its power to allocate functions to the branches, Congress may not derogate another constitutional provision that demands a particular allocation of power. Such provisions include grants of individual liberties that may not be disturbed by legislation,\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e and those that establish the mechanisms for making law (including prohibitions on certain forms of legislation).\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e The defendants and the government argue that the very terms of the President's grant of power in the Constitution is such an alternative constitutional allocation of power that would render the placement of the Commission in the judicial branch invalid. I disagree, and, apparently by its silence, so does the majority. The Constitution's statement that \"the executive power shall be vested in a President of the United States of America,\" art. II, § 1, assuredly did more than \"merely nam[e] the department;\" it was also a grant of power to that branch. Myers v. United States, 272 U.S. 52, 151, 71 L. Ed. 160, 47 S. Ct. 21 (1926) (subsequently overruled on other grounds). Part of this grant of power is, of course, that the President shall \"take Care that the Laws be faithfully executed.\" U.S. Const. art. II, § 3.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nThe President's power to enforce the laws cannot, in this case, provide a ground for a per se violation of separation of powers. Because criminal sentencing has been historically considered to be within the purview of all three branches, Geraghty v. United States Parole Comm'n, 719 F.2d 1199, 1211 (3d Cir. 1983), cert. denied, 465 U.S. 1103, 80 L. Ed. 2d 133, 104 S. Ct. 1602 (1984), assigning the Commission to the judicial branch cannot, on its face, be deemed a violation of an explicit constitutional mandate to the contrary. Only where the President has exclusive authority to enforce the laws can the constitutional grant of executive power be invoked as a per se basis for a separation of powers violation.\n\n2. Impact Analysis\n\nThe final and decisive element in a separation of powers analysis, once federalism concerns and per se violations are considered, is the question first posed: does assignment of the Commission to the judicial branch constitute a genuine threat to the ability of any branch of the government to carry out its constitutionally assigned duties. This is not a per se inquiry. An allocation of power by Congress may not contravene another explicit allocation provided by the Constitution. Furthermore, an allocation of power may not so diminish (or so expand) the relative powers of one branch so as to render that branch unable to carry out its function or interfere with the prerogatives of another branch. See Miller, Independent Agencies, 1986 Sup. Ct. Rev. 41, 52-53 (this pragmatic approach \"tends to view the separation of powers as a practical approach to government such that the division of powers between the branches, and the system of checks and balances by which those powers are related to one another, can stand considerable stretching in order to accommodate the changing needs of a modern society\"). That is the question I consider now in reference to the Sentencing Commission's placement in the judicial branch. I consider, in turn, the impact of this placement on the Congress, the Presidency, and the judiciary itself.\n\na. The Congress\n\nAn excessive delegation of power by Congress would definitionally constitute an adverse impact on its constitutionally assigned role to make law. U.S. Const. art. I, § 1; Field v. Clark, 143 U.S. at 692. Because Congress had the power to issue sentencing guidelines and there was no excessive delegation in this instance, Congress' power is neither diminished nor expanded by the assignment of the Commission to the judicial branch.\n\nb. The Executive\n\nThe defendants and the government argue that it is an untoward violation of Presidential prerogative to allow the Sentencing Commission, while a part of the judicial branch, to engage in an executive function. While I have rejected the per se form of this argument, I must now consider the proposition that placement of the Commission in the judicial branch compromises the executive's prerogative to see that the laws are enforced.\n\nThe majority opinion and I agree that the basic test for the Commission's placement in the national government is whether its duties are either executive or judicial in character. The parties contend that executing the law by implementing, outside a case or controversy context, the sentencing policy considerations directed by Congress is an executive, and not a judicial, function. In Bowsher v. Synar, the Supreme Court said that \"interpreting a law enacted by Congress to implement the legislative mandate is the very essence of 'execution' of the law.\" 106 S. Ct. at 3192. When the executive carries out a \"delegation\" from Congress, this activity is nothing more than exercise of an Article II executive function. Chadha, 462 U.S. at 953 n. 16. While the judiciary may engage in \"rulemaking\" of a procedural character, Sibbach v. Wilson \u0026 Co., 312 U.S. 1, 10, 85 L. Ed. 479, 61 S. Ct. 422 (1941) (rejecting challenge to the Federal Rules of Civil Procedure which did not \"abridge, enlarge, nor modify substantive rights\"); 28 U.S.C. § 2072 (Rules Enabling Act), and may discharge non-judicial functions in managing the business of the judiciary, Chandler v. Judicial Council of the Tenth Circuit, 398 U.S. 74, 85, 26 L. Ed. 2d 100, 90 S. Ct. 1648 (1970), and may even engage in a limited type of prosecutorial authority to vindicate its own integrity through exercise of the criminal contempt power, Young v. United States ex rel. Vuitton et Fils S.A., 481 U.S. 787, 107 S. Ct. 2124, 95 L. Ed. 2d 740 (1987), judges may not engage in substantive law-making. See United States v. Hudson and Goodwin, 11 U.S. (7 Cranch) 32, 34, 3 L. Ed. 259 (1812) (distinguishing power to affix punishment to a crime, which is outside judicial authority, from power to take actions necessary for punishing contempt).\n\nI concur with all of these principles. Nevertheless, I believe that promulgating sentencing guidelines is fully consistent with the judicial mission. Once again, it is plain that various aspects of criminal sentencing have been shared by the three branches. Geraghty, 719 F.2d at 1211. These allocations of authority have changed over time. Grayson, 438 U.S. at 45. Congress' most recent action in creating a Sentencing Commission and giving it authority to promulgate guidelines is just the latest instance of change. The executive's interest in pronouncing guidelines is not absolute or vested. Congress may have previously granted to the President that authority, but Congress has the unquestioned power to withdraw it, as it has now.\n\nMoreover, I reject the argument that the guidelines are more \"substantive\" than \"procedural\" and that, therefore, they must be left to executive implementation. These arguments smack of the same complaints against the Federal Rules of Civil Procedure when they were promulgated, complaints that were silenced by the Supreme Court's decision in Sibbach, 312 U.S. at 9-10. I believe that sentencing rule-making is closely tied to \"the judicial process for . . . . administering remedy and redress.\" Id. at 14. The majority opinion discusses at some length the example of Congress' refusal to grant the courts the power to establish testimonial privileges by rule-making. Their discussion misses the point. The real issue raised by that analogy is whether Congress itself had the power to establish the law of privilege. It plainly did, just as it has the power to fashion sentencing guidelines. The only difference in these two instances is that in the case of privileges Congress declined to allocate the power of rule-making to the judicial branch, whereas with the sentencing guidelines they did.\n\nThe defendants claim also that the guidelines are mandatory. That is true. The guidelines do limit sentencing judge's discretion, but by no means completely. District judges will still have the power to make the essential determinations necessary for calculating the appropriate sentencing matrixes and can, in certain limited circumstances, alter the result when other factors are implicated which the guidelines had not contemplated. Guidelines, 1.6-1.8. Characterizing the guidelines as \"mandatory\" misses the point. So are the Federal Rules of Civil and Criminal Procedure. No one today suggests for that reason they are unconstitutional.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nAs discussed above, defendants have no right, in non-capital cases, to individualized sentencing. A decision that Congress had the power, on its own, to issue the guidelines answers the contention that some constitutional right is compromised by the guidelines. Congress did not erode the executive's function in enforcing the law by assigning the Commission to the judicial branch.\n\nc. The Judiciary\n\nTwo concerns are raised by the Commission being placed in the judicial branch. The first is that such placement violates the implicit \"case or controversy\" limitation on judicial authority. Such violation would mean the judiciary's power would be unduly expanded if it were given non-judicial functions. Secondly, the majority argues that the required service of three Article III judges on the Commission diminishes the effectiveness of the judiciary and raises the spectre of real or perceived conflicts of interest. As an adjunct to that last contention it is argued that the President's power to remove the Commissioners for cause also compromises the judiciary's constitutionally-mandated functions. I will review each of these constitutional arguments in turn.\n\ni. The \"Case or Controversy\" Limit on Judicial Power\n\nThe majority claims that it offends separation of powers doctrine for the Commission to be located in the judicial branch. This conclusion transcends mere separation of powers doctrine, and goes to the mandate that the judicial power of the United States shall extend only to \"cases\" and \"controversies.\" U.S. Const. art. III, § 2, cl. 1; Allen v. Wright, 468 U.S. 737, 750, 82 L. Ed. 2d 556, 104 S. Ct. 3315 (1984) (\"The 'case or controversy' requirement defines with respect to the judicial branch the idea of separation of powers on which the Federal Government is founded.\"); United States Parole Comm'n v. Geraghty, 445 U.S. 388, 396, 63 L. Ed. 2d 479, 100 S. Ct. 1202 (1980) (case or controversy requirement \"defines the 'role assigned to the judiciary in a tripartite allocation of power to assure that the federal courts will not intrude into areas committed to the other branches of government'\") (quoting Flast v. Cohen, 392 U.S. 83, 95, 20 L. Ed. 2d 947, 88 S. Ct. 1942 (1968)).\n\nThese general concerns of \"case or controversy\" take on greater meaning when they are translated into the prohibition of issuing advisory opinions and ensuring that judicial decisions are not reviewed by the executive or Congress. The doctrine that bars the judiciary from rendering advisory opinions has a long and distinguished constitutional history. 13 C. Wright, A. Miller \u0026 E. Cooper, Federal Practice and Procedure : Jurisdiction 2d § 3529.1, at 293-96 (1984); see also U.S. Const. art. II, § 2, cl. 1 (allowing President to secure written opinions of the \"principal officer in each of the executive Departments,\" but not mentioning advice from judges). The demand that judicial decisions be final, and not be subject to revision by Congress or the President, is rooted in much the same concern. 13 Wright, Miller \u0026 Cooper at 302-04 (discussing Hayburn's Case, 2 U.S. (2 Dall.) 409 (1792), where this principle was first established). The essence of the rule is that Congress may not require courts to render decisions that will be subject to legislative revision. See Chicago \u0026 So. Air Lines v. Waterman S.S. Corp., 333 U.S. 103, 113-14, 92 L. Ed. 568, 68 S. Ct. 431 (1948); United States v. Ferreira, 54 U.S. (13 How.) 40, 14 L. Ed. 42 (1852).\n\nI do not believe that the Commission's activities violate the prohibition against executive or legislative review of judicial decisions. The prohibition only requires that judicial decisions be final. The Commission issues no such decisions. It only promulgates rules. Likewise, none of the duties assigned to the Commission has any aspect of advisory jurisdiction. The Commission's power to \"give due consideration to any petition filed by a defendant requesting modification of the guidelines utilized in the sentencing of such defendant,\" 28 U.S.C. § 994(s), its power to monitor the performance of the guidelines and issue instructions to probation officers and others enforcing them, id. § 995(a)(9), (10), and making \"recommendations to Congress concerning modification or enactment of statutes relating to sentencing, penal, and correctional matters,\" id. § 995(a)(20), do not purport to give it the ability to decide an individual's sentencing. That is left to the district courts.\n\nThe Commission may exist within the judicial branch and still not engage in \"judicial\" functions of a \"case or controversy\" character. I have no doubt the work of the Commission is in aid of that function. Other, arguably less \"judicial,\" functions have been assigned to courts of law and have withstood constitutional challenge. See Rice v. Ames, 180 U.S. 371, 45 L. Ed. 577, 21 S. Ct. 406 (1901) (upholding court appointment of commissioners to handle extradition matters); Ex parte Siebold, 100 U.S. 371, 397-98, 25 L. Ed. 717 (1879) (upholding statute which permitted circuit courts to appoint election supervisors); see also Morrison v. Olson, 56 U.S.L.W. at 22 \u0026 22 n. 20 (detailing other non-adversarial functions courts may exercise); Keller v. Potomac Elec. Power Co., 261 U.S. 428, 442-43, 67 L. Ed. 731, 43 S. Ct. 445 (1923) (ruling that Congress' power to exercise exclusive legislation over District of Columbia permitted it to assign district courts the responsibility to oversee Public Utilities Commission). The test is whether an assignment of authority to the judicial branch presents an \"incongruity in the duty required as to excuse the courts from its performance, or to render their acts void.\" Siebold, 100 U.S. at 398; see also Morrison v. Olson, 56 U.S.L.W. at 4841 (holding that special court's appointment of independent prosecutor not incongruous); Hobson v. Hansen, 265 F. Supp. 902, 914 (D.D.C. 1967) (\"The limitation which is referred to in Siebold is not an affirmative requirement that the duty . . . be related to the administration of justice. It is a negative requirement that the duty may not have 'such incongruity' with the judicial function as would void the power sought to be conferred.\") (upholding power of district court to appoint members of D.C. school board). I believe the Sentencing Commission exercises duties in \"aid of\" the judiciary's primary function to decide \"cases or controversies.\" It does not itself decide \"cases or controversies.\"\n\nThat there are men and women serving on the Commission who are not Article III judges is entirely consistent with the above observation. In the performance of its duties, the Commission is not carrying out \"case or controversy\" duties; accordingly, its work is not limited to Article III judges. See Northern Pipeline Co. v. Marathon Pipe Line Co., 458 U.S. 50, 58-59, 73 L. Ed. 2d 598, 102 S. Ct. 2858 (1982) (plurality opinion) (\"The judicial power of the United States must be exercised by courts having attributes prescribed in Art. III.\"). The attributes referred to by the Court in Northern Pipeline are obviously judicial life tenure and salary guarantees. U.S. Const. art. III, § 1. Other judicial committees and organizations, including the Judicial Conferences and the Administrative Office of the United States Courts, have members or personnel who are not Article III judges. See, e.g., 28 U.S.C. § 601 (director and deputy director of Administrative Office is appointed and subject to removal by the Supreme Court); id. § 332(e) (office of Circuit Executives). These non-Article III members of judicial committees have never been challenged.\n\nThe reason is clear. There is no requirement that the judiciary engage only in the strictly judicial functions of deciding \"cases or controversies.\" It may also exercise functions in aid of deciding \"cases or controversies.\" Issuing sentencing guidelines is such a function. A non-judicial agency within the judicial branch need not be staffed exclusively with Article III judges. The placement of the Commission in the judicial branch did not unduly expand the constitutional mandate of the judiciary.\n\nii. Article III Judges as Commissioners and the President's Removal Power\n\nThe participation of three Article III judges is mandated by the Act. 28 U.S.C. § 991(a). Those federal judges who serve on the Commission need not resign their appointments. Id. § 992(c). Those circuit judges serving on the Commission (either active or senior) earn no additional salary. A district judge (either active or senior) serving on the Commission would earn the salary granted to a circuit judge. Id.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Commissioners serve full time for the first six years after the sentencing guidelines go into effect. Id.; see also S. Rep. No. 225, 98th Cong., 1st Sess. 160, 1984 U.S. Code Cong. \u0026 Admin. News at 3343 (\"Because of the complex nature of the functions of the Commission, and in order to avoid potential schedule conflicts for the members, the voting members' positions are full-time for the first several years even if the member is a Federal judge.\").\n\nThe question, then, is whether Article III judges, sitting in their individual capacities, may serve on the Commission. There is no question, of course, that those judges do not sit as judges. See United States v. Ferreira, 54 U.S. (13 How.) 40, 14 L. Ed. 42 (1852); Hayburn's Case, 2 U.S. (2 Dall.) 409, 1 L. Ed. 436 (1792). First, one needs to consider whether there is a constitutional bar to an Article III judge sitting on an entity like the Sentencing Commission. For reasons elaborated below, I believe there is not. I then turn to consider whether the presence of three Article III judges either impairs the functions of the judiciary as a whole, or acts unduly to extend the power of those individuals.\n\n(a). The Constitution, Cases, and Custom\n\nThe government argues that the text of the Constitution and an unbroken practice of 200 years' duration establish that there is no prohibition against judges serving voluntarily, and in their personal capacities, in non-judicial roles within the executive branch. I agree that there is no bar to that practice. But I also believe that it is not so unchallenged a custom as automatically to validate, without further consideration, the service of judges on the Sentencing Commission.\n\nThe government argues that the strongest evidence of the Framers' intent is that while the Constitution expressly forbids members of the Legislative Branch from simultaneously holding offices under the United States, art. I, § 6, cl. 2, there is no similar bar on judges. See Slonim, Extrajudicial Activities and the Principle of Separation of Powers, 49 Conn. B.J. 391, 396-401 (for original intent of Incompatability Clause). The government also argues that this omission is particularly instructive since an Incompatibility Clause applicable to the judiciary was specifically suggested at the Constitutional Convention, but was not adopted. 2 M. Farrand, Records of The Federal Convention of 1787, at 341-42 (1911); see also Wheeler, Extrajudicial Activities of the Early Supreme Court, 1973 Sup. Ct. Rev. 123, 129 (noting that constitutional amendment to the same effect was proposed in 1800, and, yet again in 1804, to no avail). Nevertheless, the failure of this proposal, the reasons for which are now lost to history, cannot provide affirmative constitutional warrant for the exercise of extra-judicial duties. See United States v. Nixon, 418 U.S. 683, 705-06 n.16, 41 L. Ed. 2d 1039, 94 S. Ct. 3090 (1974). Moreover, the Constitutional Convention's rejection of proposals for a Council of Revision and a Council of State, upon which judges would have both served, is indicative of the opposite intent of the Framers. See 1 M. Farrand at 21 (for proposal on Council of Revision); 2 id. at 335 (for the proposal on the Council of State); id. at 75 (statement of Eldridge Gerry that both bodies would have established \"an improper coalition between the Executive and Judiciary\"); see also C.E. Hughes, The Supreme Court of the United States 27 (1928) (rejection of Council of Revision permitted the Supreme Court to withstand attack that could have been destructive of its authority); Lerner, The Supreme Court as Republican Schoolmaster, 1967 Sup. Ct. Rev. 127, 174-77 (Council of State and Council of Revision rejected for \"sake of securing the proper separation of powers\").\n\nThe constitutional text and the records of the Constitutional Convention are, if anything, inconclusive on the question of whether judges can serve in their individual capacities on executive organs. The government also places extensive reliance on the decision in Hayburn's Case, 2 U.S. (2 Dall.) 409, 1 L. Ed. 436 (1792), which they cite for the proposition that judicial officers may voluntarily accept appointment as Commissioners to perform duties not judicial in nature. This reliance is misplaced. Hayburn's Case arose when Congress, in an act of March 23, 1792, 1 Stat. 243, required the circuit courts to examine the nature of wounds incurred by veterans in the Revolutionary War and to recommend a pension that would be \"just.\" If the Secretary of War suspected error, however, he could reverse the judge's recommendations. Id. Five Justices of the Supreme Court, sitting as circuit justices, refused to make these pension determinations. Hayburn's Case, 2 U.S. (2 Dall.) at 410 n.(a) (for the decisions of the circuit courts for the districts of New York, Pennsylvania, and North Carolina). A motion for mandamus was brought to the Supreme Court to compel the circuit judges to consider those claims. The case before the Supreme Court was, however, dismissed when Congress provided for an alternative way for the claims of pensioners to be considered. Id. at 409-10. Of the three circuit courts which passed on the issue, all agreed that it was improper for the judges, sitting as a court, to render recommendations concerning pensions. Id. at 410 n. (a). The circuits split, however, on the issue of whether the judges, sitting in their personal capacity, could act as Commissioners. Id. (circuit court for the district of New York (Jay, C.J., Cushing, J., Duane, D.J.) so ruling; circuit court for the district of North Carolina (Iredell, J., Sitgreaves, D.J.) confessing \"grave doubts on this head\").\n\nThe issue of whether judges could act in their individual capacities as pension commissioners was, however, decided in an unpublished decision of the Supreme Court in United States v. Todd (U.S. Feb. 17, 1794), synopsized at 54 U.S. (13 How.) 51, 14 L. Ed. 42 (1851) (there was, apparently, no official reporter at the time the Todd decision was rendered and the Court in Ferreira provided \"the substance of the decision . . . in order that it may not be overlooked, if similar questions should hereafter arise\"). The Court in Todd decided unanimously \"that the power given in the Act of 1792 to the Circuit Court as a court, could not be construed to give it to the judges out of court as commissioners.\" Id. at 52. This holding of the Supreme Court was noted in subsequent cases. See In re Sanborn, 148 U.S. 222, 224, 37 L. Ed. 429, 13 S. Ct. 577 (1893); Florida v. Georgia, 58 U.S. (17 How.) 478, 505, 15 L. Ed. 181 (1854). Justice Iredell, who apparently convinced Chief Justice Jay and Justice Cushing of the correctness of his position that judges could not serve in this individual capacity, earlier wrote \"if therefore it appeared to me that this question could by any possibility come before me as Judge . . . I ought not to exercise the authority.\" J. Iredell, Reasons for Acting as a Commissioner on the Invalid Act (Oct. 1792), quoted in Comment, 96 Yale L.J. at 1379 n. 124.\n\nThe clear implication is, therefore, that the possibility of judges serving as Commissioners in quasi-judicial roles was questioned by the Supreme Court as early as 1794.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e The government correctly notes, however, that there has been a long history of judges serving in executive capacities.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Nevertheless, the practice of judges performing extra-judicial activities is not nearly as unbroken and systematic as the government might suggest. In fact, there have been many instances where the practice has come under intense criticism, not only by judges themselves but by other officials and commentators. See Yale Comment at 1382-83; Mason, Extra-Judicial Work for Judges: The Views of Chief Justice Stone, 67 Harv. L. Rev. 193 (1953); Comment, Separation of Powers and Judicial Service on Presidential Commissions, 53 U. Chi. L. Rev. 993, 998-99 (1986) (noting instances where judges have refused such service). One commentator has suggested that\n\nThe only significant difference between assigning a duty to a judge as an individual and as a member of the court is that as an individual she will be acting outside the judiciary. But by rendering constitutional otherwise unconstitutional behavior if performed in another branch of government, this principle would sacrifice both individual judicial independence and the interest of the judiciary as a whole in the control of its members.\n\nYale Comment at 1383-84. The lengthy custom that the government cites for permitting judges to sit in executive capacities has never been judicially approved. See In re President's Commission on Organized Crime (\"Scaduto \"), 763 F.2d 1191, 1202 (11th Cir. 1985) (Roney, J., concurring). It is, furthermore, questionable whether a long-standing custom can insulate a practice from constitutional challenge. See Chadha, 462 U.S. at 942 n. 13, 944 (\"Our inquiry is sharpened rather than blunted by the fact that congressional veto provisions are appearing with increasing frequency in statutes which delegate authority to executive and independent agencies. . . .\"); Youngstown Sheet \u0026 Tube, 343 U.S. at 610-11 (Frankfurter, J., concurring) (for a practice to be deemed custom it must be \"long pursued\" and \"never before questioned\"); Glennon, The Use of Custom in Resolving Separation of Powers Disputes, 64 B.U.L. Rev. 109, 121 (1984) (relying on custom \"equates what is with what ought to be in regards patterns of practice as principles of law\").\n\n(b). Substantive Tests\n\nPlainly, there is no rule that either accepts or precludes extra-judicial activities. The question becomes whether a judge who serves on an executive commission impairs the functions of the judicial branch or is an untoward expansion of power for the judiciary. The general principle that one branch may not act so as to impair the function of another branch has traditionally been the basis of the Supreme Court's separation of powers analysis. United States v. Klein, 80 U.S. (13 Wall.) 128, 146-48, 20 L. Ed. 519 (1872). In Nixon v. Administrator of General Servs., 433 U.S. 425, 97 S. Ct. 2777, 53 L. Ed. 2d 867 (1977), the issue was \"the extent to which [the challenged statute] prevents the [particular] Branch from accomplishing its constitutionally assigned functions.\" Id. at 443; see also Morrison v. Olson, 56 U.S.L.W. at 3841-42. If a judicial function is, indeed, impaired then that impact must be justified by an overriding need to promote objectives within the constitutional authority of the acting Branch. Id. This concern that extra-judicial service not impair the functions of the judiciary is also reflected in the Code of Conduct for United States Judges, Canon 5, comment G, where it is provided that\n\nA judge should not accept appointment to a governmental committee, commission, or other position that is concerned with issues of . . . policy on matters other than the improvement of the law, the legal system, or the administration of justice, unless appointment of a judge is required by ACt of Congress. A judge should not, in any event, accept such an appointment if the judge's governmental duties would interfere with the performance of judicial duties or tend to undermine the public confidence in the integrity, impartiality, or independence of the judiciary.\n\nId. (adopted by the Judicial Conference of the United States).\n\nI do not believe that participation by a judge on the Sentencing Commission seriously impairs any of the functions of the judicial branch. The defendants argue that the judiciary loses the services of three judges. There is no doubt in the Act and its legislative history that a judge's duties on the Commission would come first. S. Rep. No. 225, 98th Cong. 1st Sess. 160 n. 385, 1984 U.S. Code \u0026 Admin. News 3343 n. 385 (\"The judicial and other members may complete work on cases in progress if they are so far involved that it is impractical for the work to be turned over to another person. Of course, if the work was such that there was a potential conflict of interest or appearance of such a conflict, the work would have to be turned over to someone else.\"); cf. Wheeler, 1973 Sup. Ct. Rev. at 142-43 (describing occasion when Chief Justice Jay declined to attend a meeting of The Sinking Fund Commission since it would interfere with his duties as circuit justice). The systemic impact on the judiciary of three judges not sitting is, nevertheless, minimal.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e The judges serving on the Commission made a voluntary choice to assume their duties as Commissioners. By allowing for the service of three judges, Congress authorized that choice.\n\nNor do I credit the argument that by giving the President the power to appoint judges as Commissioners, he has been given the power, in effect, to change the assignment of judges, a power that has been traditionally reserved to the judiciary itself. See F. Frankfurter \u0026 J. Landis, The Business of the Supreme Court 242 (1928) (\"The judiciary, like most other political institutions, must be directed. But it must be self-directed.\"); Shartel, Federal Judges -- Appointment, Supervision and Removal - -Some Possibilities Under the Constitution, 28 Mich. L. Rev. 870, 873 n. 8, 882 n.31 (1930) (arguing that statute authorizing President to deprive a judge of his seniority in rank within the judiciary would be unconstitutional); cf. Chandler, 398 U.S. 74, 26 L. Ed. 2d 100, 90 S. Ct. 1648 (suggesting that it is solely within the province of a circuit judicial council to divert cases from the docket of a district judge). After all, no judge is serving involuntarily on the Commission. None was nominated by the Judicial Conference, nor appointed by the President, without the individual's consent.\n\nNor do I consider the President's power to remove the Commissioners for cause, 28 U.S.C. § 991(a), to interfere with the judiciary's proper functioning. The majority opinion relies on language in Bowsher v. Synar, 478 U.S. 714, 106 S. Ct. 3181, 92 L. Ed. 2d 583 (1986), wherein the Supreme Court held that Congress could not retain the power to remove the Comptroller General if that officer was performing executive functions under the Gramm-Rudman-Hollings Deficit Reduction measure. The majority argues by analogy that the President cannot remove members of the Commission if they are performing judicial functions. The fact is, however, that they are not performing judicial functions within the \"case or controversy\" limitation of the Constitution. That the President can remove individuals as Commissioners in no way affects the performance of their judicial duties, because they can never have their salaries diminished or be removed as judges, save by impeachment. The President is free to remove other officers of the United States whose functions, although in aid of the judiciary, are not constitutionally assigned to it. See McAllister v. United States, 141 U.S. 174, 185, 35 L. Ed. 693, 11 S. Ct. 949 (1891) (President may remove for good cause judges who serve on article I courts). The majority seems to forget that the members of the Commission obviously must be accountable to some branch. For them to be free from removal on any ground by any official in any branch of the government, other than through impeachment, would itself run afoul of the appointments clause. See U.S. Const. art. II, § 2, cl. 2; Myers, 272 U.S. at 161 (\"the power to remove . . . is an incident of the power to appoint.\"). While some argue that it may have been preferable to vest removal power in a judicial officer, such as the Chief Justice, it was not a violation of separation of powers principles to allow the President the right of removing Commissioners with cause. See Wiener v. United States, 357 U.S. 349, 353, 2 L. Ed. 2d 1377, 78 S. Ct. 1275 (1958) (permitting the President to remove for cause members of the War Claims Commission).\n\nFinally, there is no danger that service on the Sentencing Commission by judges will threaten judicial impartiality. Cf. Scaduto, 763 F.2d at 1196-97 (expressing fear that judges might favor particular government action recommended by a commission on which they or other federal judges serve). It is undoubtably true that in construing or applying the guidelines, federal judges are unlikely to be impressed, or even minimally affected, by the fact that other judges serve on the Sentencing Commission. See United States v. Chambless, 680 F. Supp. 793, 800 (E.D. La. 1988) (dismissing the idea of undue influence as \"patently meritless\").\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nEven if a court were to find that the mandatory assignment of three Article III judges to the Commission impairs the functions of the judiciary, it would also have to consider whether that impact is justified by an overriding need of the legislature to promote its objectives. Nixon, 433 U.S. at 443. Obviously, the purpose of placing judges on the Commission was to add substantial expertise to its very important work. See also Duplantier v. United States, 606 F.2d 654, 668 (5th Cir. 1979) (in challenge to requirement that federal judges disclose their personal financial interests the court held that the \"intrusion upon the constitutionally assigned functions of the judiciary . . . is justified by the promotion of important [congressional] objectives\"), cert. denied, 449 U.S. 1076, 66 L. Ed. 2d 798, 101 S. Ct. 854 (1981). This was an important congressional objective.\n\nCongress had a difficult choice to make when it considered the placement of the Commission. The legislative history reveals that this allocation was seriously debated by the Congress. The Senate Judiciary Committee concluded that the Commission \"would be in the judicial branch.\" S. Rep. No. 225, 98th Cong., 1st Sess. 63, reprinted at 1984 U.S. Code Cong. \u0026 Admin. News 3182, 3246. The Report also stated that the Committee had acted to ensure the role of all three Branches, \"rather than only the Judicial Branch,\" in the selection of the members of the Sentencing Commission, and it then observed that the bill \"does assure the judiciary a role in the selection of the members and does place the Commission in the judicial branch.\" Id. at 64, 1984 U.S. Code Cong. \u0026 Admin. News at 3247. The strongest statement of congressional intent was made later in the Report: \"Placement of the Commission in the judicial branch is based upon the Committee's strong feeling that, even under this legislation, sentencing should remain primarily a judicial function.\" Id. at 159, 1984 U.S. Code Cong. \u0026 Admin. News at 3342; see also id. at 163, 1984 U.S. Code Cong. \u0026 Admin. News at 3346 (where the Committee stated that it was appropriate for federal judges to serve on the Commission without having to resign their judicial positions, because \"the judge will remain in the judicial branch and will be engaged in activities closely related to traditional judicial activities\").\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nAfter examining all of the excellently presented arguments made challenging the constitutionality of the sentencing guidelines, I conclude that the Congress acted within its power in creating a Sentencing Commission that included three judges among its members and placing that Commission within the judicial branch. I do not express a view on the wisdom of every detail of Congress' judgment. I am concerned here only with constitutional power: from whence it is derived, how it is allocated, and the manner it is exercised. The difficulty faced by Congress in addressing the real problems of unacceptable sentencing disparities is well-documented. It is unthinkable that the Constitution forbids a rational plan to reduce such disparities.\n\nD. Severability of \"Good Time\" Credit Provisions\n\nI also dissent from the majority's decision that the \"good time\" credit provisions, provided by the Sentencing Reform Act, 18 U.S.C. § 3624(b), cannot be severed and are likewise invalid. I believe that even if the guideline provisions are invalid, they can be severed from the \"good time\" provisions of the Act.\n\nPrior to November 1, 1987, the effective date of the guidelines, 18 U.S.C. §§ 4161, 4162, provided a complex system of meritorious and industrial \"good time\" credits. Five days a month meritorious \"good time\" could be awarded prisoners whose sentences ranged from six months to a year, while ten days a month could be awarded to prisoners sentenced to ten years or more. In addition, industrial \"good time\" could be awarded up to three days a month for the first year, and five days a month thereafter. The Sentencing Reform Act repealed these provisions and replaced them with a new \"good time\" section, which provided that no \"good time\" credit for sentences of one year or less could be awarded. 18 U.S.C. § 3624(b). Gubiensio-Ortiz, who was sentenced to a six-month term, desires that his \"good time\" credits be restored to him. This court was asked whether, in the absence of a general severability provision in the Act, Congress intended that its changes to the \"good time\" credit system could be carried out even if the mandate of the Sentencing Commission and its guidelines were subsequently found to be unconstitutional. See Alaska Airlines, Inc. v. Brock, 480 U.S. 678, 107 S. Ct. 1476, 1481, 94 L. Ed. 2d 661 (1987) (the \"relevant inquiry in evaluating severability is whether the statute will function in a manner consistent with the intent of Congress\") (original emphasis); Regan v. Time, Inc., 468 U.S. 641, 653, 82 L. Ed. 2d 487, 104 S. Ct. 3262 (1984) (plurality) (whether \"an unconstitutional provision is severable from the remainder of the statute in which it appears is largely a question of legislative intent\").\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nAt the time the Sentencing Reform Act was adopted it seems clear that Congress would not have enacted the new \"good time\" provisions without the sentencing guidelines. The statute provides that the abolition of the new \"good time\" rules will apply only to those sentences that are imposed under the sentencing guidelines system. 18 U.S.C. §§ 3551, 3558 \u0026 3624. Moreover, the effective dates of the various provisions of the Act confirm that Congress intended that the guidelines, the abolition of parole, and the new \"good time\" rules would operate as a package. The contemporary legislative history makes clear that this package was designed to ensure that \"the sentencing guidelines system will not replace the current law provisions relating to the imposition of sentence, the determination of a prison release date, and the calculation of good time allowances\" until the guidelines \"replace the existing sentencing system.\" S. Rep. 225, 98th Cong. 1st Sess. 188-89, reprinted at 1984 U.S. Code Cong. \u0026 Admin. News 3371-72. Accordingly, the Act retained parole and \"good time\" provisions \"to deal with sentences imposed under current sentencing practices.\" Id. It seems clear that at the time the Act was adopted, Congress did not contemplate that the new \"good time\" provisions would enter into force until the sentencing guidelines did.\n\nNevertheless, the congressional intent on this issue later changed. As originally enacted, 28 U.S.C. § 994 made no distinction as to guidelines for petty offenses, and thus, the Sentencing Commission had promulgated guidelines for many of these. However, it quickly became apparent that it made little sense to have guidelines for petty offenses where the guidelines range was the same as the maximum range, that is, six months or less. Accordingly, on December 7, 1987, 37 days after the guidelines became effective, the President signed the Sentencing Act of 1987, Pub. L. No. 182, 100th Cong., 1st Sess., 101 Stat. 1266, 1269. Section 16 of that Act amended 28 U.S.C. § 994(w) and 18 U.S.C. § 3553(b), to make clear that Congress did not require guidelines for petty offenses. The effect of these amendments was to authorize the Commission to promulgate no guidelines for petty offenses, and to permit the courts to impose sentences for non-guideline petty offenses without regard to the guidelines for similar offenses. Accordingly, the Sentencing Commission amended Guideline § 2L1.2, which applies to illegal entry into the United States in violation of 8 U.S.C. § 1325, the crime for which Gubiensio-Ortiz was convicted. The amendment provided that \"first offenses under [this section] are petty offenses for which no guideline has been promulgated.\"\n\nI believe the December 1987 amendments enacted by Congress were intended to make clear that the Sentencing Commission was free to sever or exempt petty offenses, such as petitioner's, from the guidelines. Congress has thus expressed its intent that sentences in petty offense cases need have nothing to do with the new guidelines. It seems clear that Congress would still have applied the new \"good time\" rules to petty offenses because it has already contemplated that the new \"good time\" rules will be applied to petty offenses which now fall outside of the guidelines. I would credit Congress' manifestation of changed intent, and rule that the \"good time\" provisions of the Sentencing Reform Act, which deny any credits to a prisoner serving less than six months, can be severed from that part of the Act creating the Commission and the guidelines.\n\nConclusionS\n\nThe Sentencing Reform Act does not offend the Constitution. No branch of government has been negatively affected by the allocation of power made by it. I would hold that the Sentencing Commission was constitutionally charged, staffed, and placed in the judicial branch. Its guidelines are constitutional. Even if the guidelines are invalid, the \"good time\" provisions can be severed.\n\nIt has been noted recently that some separation of powers cases appear before our courts as sheep and some appear as wolves. Morrison v. Olson, 56 U.S.L.W. at 4847 (Scalia, J., dissenting). This case can be characterized as a wolf. Unfortunately, the majority treated it as a sheep: gingerly, without cunning, and without foresight. As a result, it devoured a part of our separation of powers jurisprudence. In an effort to avoid that unseemly fate, I respectfully dissent.\n\n\u003cspan class=\"fn\"\u003e1. The government appealed under 18 U.S.C. § 3742(b), which was enacted as part of the Sentencing Reform Act. This provision arguably may not provide jurisdiction over an appeal from the district court's determination that the guidelines were unconstitutional, as that determination could not be accurately characterized either as \"in violation of law,\" id. § 3742(b)(1), or as an \"incorrect application\" of the guidelines, id. § 3742(b)(2). Moreover, if we hold the Act to be unconstitutional, we will necessarily invalidate section 3742 as well. Regardless of the coverage or fate of section 3742, we have jurisdiction over the constitutional issue and the challenge to the allegedly illegal sentencing order under 28 U.S.C. § 1291. See United States v. Hetrick, 644 F.2d 752, 754-55 (9th Cir. 1980).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Because we resolve the case on other grounds, we need not address the argument that the delegation of authority to the Commission may have been too broad.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The sharing of executive and legislative powers between Congress and the President is far more readily countenanced than assignment of either of those powers to the judiciary. In part this is because the line dividing legislative and executive functions is blurred. See Youngstown Sheet \u0026 Tube Co. v. Sawyer, 343 U.S. at 637 (Jackson, J., concurring) (\"there is a zone of twilight in which [the President] and Congress may have concurrent authority, or in which its distribution is uncertain . . . . In this area, any actual test of power is likely to depend on the imperatives of events and contemporary imponderables rather than on abstract theories of law\") (footnote omitted). As well, Congress and the President participate in the enactment of legislation, thereby assenting, on behalf of their respective branches, to any transfer of powers between them. See Nixon v. Administrator of Gen Servs., 433 U.S. 425, 441, 97 S. Ct. 2777, 53 L. Ed. 2d 867 (1977) (\"the Executive Branch became a party to the Act's regulation when President Ford signed the Act into law\"). The judicial function, on the other hand, is far more distinct, as judges have no role in the passage of legislation; indeed, the Framers rejected a proposal to give judges an executive role. See Note, The Constitutional Infirmities of the United States Sentencing Commission, 96 Yale L.J. 1363, 1378-79 (1987) (discussing constitutional convention's rejection of proposed Council of Revision and Council of State whose membership would include judges) [hereinafter Note, Constitutional Infirmities ].\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. See 119 Cong. Rec. 7642, 7643 (1973) (remarks of Representative Rodino) (\"some of the rules will have a major impact on the day-to-day activities of millions of people who never become involved in litigation\"); id. at 7646 (remarks of Representative Hungate) (\" t he fundamental rights and human relationships which will be affected by the rules, both in and out of the courts, require that the rules be permitted to become effective only if, when, and to the extent they are affirmatively approved by the Congress\"); id. at 7648 (remarks of Representative Holtzman) (the rules \"do not deal with abstruse legal technicalities. They seek to resolve social issues over which there is now vast national debate\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. See 119 Cong. Rec. at 7644 (1973) (remarks of Representative Smith); id. at 7647 (remarks of Representative Hutchison); id. at 7648 (remarks of Representative Holtzman).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The Senate rejected a proposed amendment that would have permitted the court to impose a sentence outside the guidelines even if the Commission had considered and rejected the particular aggravating or mitigating factor. See S. Rep. No. 225, 98th Cong., 2d Sess. 179, reprinted in 1984 U.S. Code Cong. \u0026 Admin. News 3182, 3262.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The Justice Department and the Sentencing Commission suggest that Congress has long delegated such decisions to the judiciary in the form of the broad sentencing discretion exercised by individual judges in particular cases. This argument deserves scant attention because it confuses adjudication and rulemaking. \"'A judicial inquiry investigates, declares and enforces liabilities as they stand on present or past facts and under laws supposed already to exist. That is its purpose and end. Legislation on the other hand looks to the future and changes existing conditions by making a new rule to be applied thereafter to all or some part of those subject to its power.'\" Keller v. Potomac Elec. Power Co., 261 U.S. 428, 440, 67 L. Ed. 731, 43 S. Ct. 445 (1923) (quoting Prentis v. Atlantic Coast Line Co., 211 U.S. 210, 226, 53 L. Ed. 150, 29 S. Ct. 67 (1908)). Under the pre-SRA system, district judges had the authority to make retail decisions; they could not, however, issue wholesale determinations that would bind other judges in the federal system. The Framers made this very distinction when they vested the judicial power to decide cases in one branch and the legislative power in another. Cf. Standard Oil Co. v. United States, 221 U.S. 1, 69-70, 55 L. Ed. 619, 31 S. Ct. 502 (1911) (court does not exercise legislative power by applying \"generic statutory provision\" to particular practices).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. It is unnecessary to decide whether the Commission's function is legislative or executive because \"it is easier to determine that a government function is nonjudicial than to state with certainty that the function is executive or legislative. Because any nonjudicial government function is likely to involve some executive or legislative aspects, judges should not exercise such functions even when it cannot be definitely stated that the functions are either executive or legislative.\" Comment, Separation of Powers and Judicial Service on Presidential Commissions, 53 U. Chi. L. Rev. 993, 1007-08 n. 80 (1986) [hereinafter Comment, Judicial Service ].\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The designation of the Commission as part of the judicial branch does, of course, affect the applicability of various statutory provisions, such as the Freedom of Information Act, 5 U.S.C. § 552(f) (Supp. IV 1986), the Privacy Act, 5 U.S.C. § 552a(a)(1) (Supp. IV 1986), and the Government in the Sunshine Act, 5 U.S.C. § 552b(a)(1) (Supp. IV 1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. We recognize that there is some dicta in support of the proposition that Congress may assign duties to judges individually that it may not assign to \"courts.\" See United States v. Ferreira, 54 U.S. (13 How.) 40, 49-51, 14 L. Ed. 42 (1852) (Taney, C.J.) (discussing Hayburn's Case, 2 U.S. (2 Dall.) 409, 1 L. Ed. 436 (1792)). While we ordinarily give great weight to Supreme Court dicta, the significance of the dicta in Ferreira must be viewed with particular skepticism. First, the Court did not purport to state its own view, but construed what much earlier justices had said in the circuit court advisory opinions quoted in Hayburn's Case. Second, it is not clear to us that Ferreira's observation that \"there seem[ed] to be no doubt, at that time,\" that judges could exercise executive powers qua commissioners is accurate. See Hayburn's Case, 2 U.S. at 411 n. (a) (Letter from Justices Wilson and Blair and District Judge Sitgreaves to President Washington, April 18, 1792, opining that nonjudicial powers could not be conferred on the courts, without commenting on question of judges acting as commissioners). In any event, Ferreira's unexplained and formalistic distinction between judges qua judges and judges qua courts is inconsistent with the Supreme Court's focus in recent cases on the substance of power and who exercises it. See Buckley v. Valeo, 424 U.S. at 123; pp. 32-33 supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The questionable value of imputing talismanic significance to the term \"court\" is highlighted by the congressional scheme for appointment of independent counsel under the Ethics in Government Act of 1978, 28 U.S.C.A. §§ 591-599 (West Supp. 1988). The Constitution authorizes Congress to vest in \"the Courts of Law\" the power to appoint inferior officers. U.S. Const. art. II, § 2, cl. 2. Congress therefore created a \"division\" of the Court of Appeals for the District of Columbia Circuit that decides no cases or controversies, and gave it the authority to appoint independent counsel. See 28 U.S.C.A. §§ 49, 593 (West Supp. 1988). We cannot imagine that it would matter whether Congress called its creation a \"division\" rather than a \"commission\"; it would still be a body comprising three judges exercising statutorily conferred powers. See Note, Constitutional Infirmities, 96 Yale L.J. at 1383-84 n. 148.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. While the Chairman's position will remain full time, the other Commissioners will only serve full time during the six years following the effective date of the guidelines. 28 U.S.C. § 992(c).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. While all three judicial members of the Commission were appointed by the President on October 17, 1985, Judge Breyer's term expires on October 31, 1989, Judge MacKinnon's on October 31, 1991, and Judge Wilkins' on October 31, 1993.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. As Bowsher teaches, it matters not that the President has never exercised that power and probably never will. What counts is that the removal power exists and could be exercised. See Bowsher, 106 S. Ct. at 3190-91.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. We note that the sentencing guidelines were approved by all three judicial members, a fact that was not irrelevant when Congress decided not to supersede the guidelines legislatively. Conversely, had some or all of the judges dissented from the adoption of the sentencing guidelines, the status of the Commission's work would no doubt have been greatly undermined, rendering it far more vulnerable to reversal by the political branches.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. As noted by one commentator, judicial \"participation in policymaking . . . accords the political decision of an administrative. agency a presumptive legality that it might not otherwise merit.\" Note, Constitutional Infirmities, 96 Yale L.J. at 1384-85.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. See also McKay, The Judiciary and Nonjudicial Activities, 35 Law \u0026 Contemp. Probs. 9, 25 (1970) (\"participation [in commissions concerned with highly visible and sensitive issues] by members of the judiciary is less likely to settle a troublesome public issue than to lend credence to the all-too-common charge that the courts are part of the political process\"). One commentator has documented the historical consequences of extrajudicial service: There are numerous indications that extra-judicial activities have adversely affected the Court's independence, strength and decisional quality. The Senate Judiciary Committee believed in 1947 that performance of administrative functions by Justices lessened the independence of the Court; in 1969, Congress, inspired by examples of nonjudicial conduct, . . . threatened impeachment and considered bills restricting permissible activities of the Justices. Diminished Court prestige because of extra-judicial actions has been noted by newspapers and commentators. Reduced prestige results in reduced public attachment to the Court and thus a reduced public willingness to accept its decisions. Finally, commentators have impugned the quality of Court performance, suggesting that workload constraints diminish the quality of decisions and opinions. Note, Extrajudicial Activity of Supreme Court Justices, 22 Stan. L. Rev. 587, 604-05 (1970) (footnotes omitted) [hereinafter Note, Extrajudicial Activity ].\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. See, e.g., Code of Judicial Conduct for United States Judges Canon 7, 2 Guide to Judiciary Policies and Procedures I-57 (Sept. 1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Chief Justice Stone made this point eloquently in declining President Roosevelt's request that he lead a wartime commission to investigate rubber production: A judge, and especially the Chief Justice, cannot engage in political debate or make public defense of his acts. When his action is judicial he may always rely upon the support of the defined record upon which his action is based and of the opinion in which he and his associates unite as stating the ground of decision. But when he participates in the action of the executive or legislative departments of government he is without those supports. He exposes himself to attack and indeed invites it, which because of his peculiar situation inevitably impairs his value as a judge and the appropriate influence of his office. Letter to President Franklin Roosevelt (July 20, 1942), quoted in Mason, Extra-Judicial Work for Judges: The View of Chief Justice Stone, 67 Harv. L. Rev. 193, 203-04 (1953). Even the Chief Justice's refusal to serve put him at odds with the President and made him the subject of public commentary, albeit in this case approving. See id. at 205 (\"newspapers praised Stone's 'blunt' refusal\"). The federal judiciary suffered from such political immersion when five Supreme Court Justices served on the Electoral Commission of 1877, which resolved disputes over the certification of electors in the 1876 presidential contest between Rutherford B. Hayes and Samuel J. Tilden. The commission, with each of the Justices voting along party lines, ultimately voted 8-7 in Hayes' favor, \"provoking charges of fraud and public censure of the Justices involved.\" Note, Extrajudicial Activity, 22 Stan. L. Rev. at 592.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. For example, Justice Stewart served on the President's Commission on Organized Crime after retiring from the Court. Scarfo, 783 F.2d at 371. Justice Byrnes resigned to assist President Roosevelt with domestic affairs, and Justice Goldberg left the bench to become Ambassador to the United Nations. McKay, 35 Law \u0026 Contemp. Probs. at 13, 34. Justice Brandeis offered several times to resign in order to undertake emergency duties for President Wilson during World War I. Note, Extrajudicial Activity, 22 Stan. L. Rev. at 593 n. 43.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Service on the Commission by three sitting federal judges raises yet another concern: There is reason to doubt whether these judges will ever be able to sit in a case involving the application of the sentencing guidelines. As will be recalled, district judges may impose sentences outside the guidelines if, and only if, they find that the case presents \"an aggravating or mitigating circumstance . . . that was not adequately taken into consideration by the Sentencing Commission in formulating the guidelines.\" 18 U.S.C. § 3553(b) (emphasis added). A district judge may therefore have to determine whether the Sentencing Commission has done an inadequate job in promulgating the guidelines, as would an appellate court reviewing that decision. It is not at all clear that judges who participated in the Commission's work could undertake that type of review; while there might be no actual conflict, the party seeking imposition of a sentence outside the guidelines might reasonably feel that there is an appearance of partiality when a judge has to determine whether the commission on which he served did or did not do an adequate job. The possibility therefore exists that the three judges now serving on the Commission, as well as the other federal judges who will follow them, may be permanently disqualified from sitting on the tens of thousands of criminal cases that pass through the federal courts each year. History teaches that the potential for serious conflicts of interest plaguing judges who undertake executive responsibilities is no phantom of idle speculation. One such conflict was narrowly averted when Chief Justice Fuller declined President McKinley's offer of a position on the Spanish-American War Peace Commission. See note 24 infra. As it turned out, the Treaty of Peace later came before the Court in a series of decisions known as The Insular Cases. E.g., De Lima v. Bidwell, 182 U.S. 1, 45 L. Ed. 1041, 21 S. Ct. 743 (1901); Dooley v. United States, 182 U.S. 222, 45 L. Ed. 1074, 21 S. Ct. 762 (1901); Armstrong v. United States, 182 U.S. 243, 45 L. Ed. 1086, 21 S. Ct. 827 (1901); Downes v. Bidwell, 182 U.S. 244, 45 L. Ed. 1088, 21 S. Ct. 770 (1901); see McKay, 35 Law \u0026 Contemp. Probs. at 31.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. The Third Circuit listed a number of these instances in Scarfo : John Jay served simultaneously as the first Chief Justice and Ambassador to England in 1794. A successor, Chief Justice Oliver Ellsworth was Minister to France during his term on the Court. John Marshall for a brief period was both Chief Justice and Secretary of State. Five Justices served on the Election Commission in 1877 that resolved the bitterly contested presidential election that year. A number of Justices have served on boards of arbitration to resolve boundary disputes and other claims with several countries as well as various tribunals which devoted their attention to other governmental problems outside the courts. In more recent times, Justice Owen Roberts served on the Commission to investigate the disaster at Pearl Harbor. Justice Robert Jackson was a prosecutor at the Nuremberg war crimes trial, and Chief Justice Earl Warren presided over the Commission investigating the assassination of President Kennedy. 783 F.2d at 377. For a more extensive survey, see McKay, 35 Law \u0026 Contemp. Probs. at 27-36 (appendix).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. As early as 1794, the nomination of Chief Justice Jay to be Ambassador to Great Britain met with opposition on separation of powers grounds. A resolution was offered in the Senate that \"to permit Judges of the Supreme Court to hold at the same time any other office of employment emanating from and holden at the pleasure of the Executive is contrary to the spirit of the Constitution, and as tending to expose them to the influence of the Executive, is mischievous and impolitic.\" See 1 C. Warren, The Supreme Court in United States History 119 (1926).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. See note 19 supra. In addition to declining a position on the rubber commission, Chief Justice Stone refused to serve as chairman of the United States War Ballot Commission because of the risk that such service would interfere with his judicial responsibilities: I regard the performance of such a function as incompatible with obligations which I assumed with the office of Chief Justice, and as likely to impair my usefulness in that office. It is enough to say, without more, which might be said, that action taken by the Chief Justice in connection with the administration of the proposed legislation might become subject to review in the Court over which he presides and that it might have political implications and political consequences which should be wholly dissociated from the duties of the judicial office. Letter to Senator Arthur H. Vandenburg (Nov. 22, 1943), reprinted in 89 Cong. Rec. 9791 (1943). Similarly, Chief Justice Fuller refused to serve on the Spanish-American War Peace Commission because \"the Chief Justice should not participate in public affairs.\" W. King, Melville Weston Fuller, Chief Justice of the United States 246-47 (1950).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Chief Justice Warren originally declined to serve on the Warren Commission because of concerns about the propriety of judicial service in such a capacity. See E. Warren, The Memoirs of Earl Warren 356 (1977).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Justice Roberts had second thoughts about having served on two \"commissions to do work not strictly of a judicial nature,\" later observing that \"I do not think it was good for my position as a justice, nor do I think it was a good thing for the Court.\" Roberts, Now Is the Time: Fortifying the Supreme Court's Independence, 35 A.B.A.J. 1, 2 (1949). He noted that during his service as Chairman of the German-American Mixed Claims Commission he had been accused of \"bias and unfairness,\" and had been subject to congressional scrutiny in participating in the commission to investigate the events at Pearl Harbor, where \"there might have been rather an unfortunate reflection on the justice who was a member of that commission.\" Id. He concluded generally that for any federal judge \"to take part in administrative work . . . is a bad thing for the courts, and . . . not a good thing for the standing of the judges.\" Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Congress has imposed other nonjudicial duties on federal judges. For example, the Chief Justice is ex officio a Regent of the Smithsonian Institution, 20 U.S.C. § 42 (1982), and a trustee of certain subsidiary bodies, 20 U.S.C. §§ 72, 76cc(b) (1982) (National Gallery of Art and Hirshhorn Museum), and he or his designee also serves on the Commission on the Bicentennial of the Constitution. Pub. L. No. 98-101, § 4(a)(2), 97 Stat. 719 (1983). Moreover, he is required to appoint representatives of the judicial branch to various other commissions that are not formally part of the judicial branch. See 2 U.S.C. § 352 (1982 \u0026 Supp. IV 1986) (Commission on Executive, Legislative and Judicial Salaries); 44 U.S.C. § 2501 (Supp. III 1985) (National Historical Publications and Records Commission). While the latter group arguably falls under the exception for judicial administration, see pp. 15-16 supra, the former group, even though they are largely ceremonial, may be constitutionally suspect. See Bowsher, 106 S. Ct. at 3199 n. 10 (Stevens, J., concurring in the judgment) (assignment of Smithsonian Regent duties to Chief Justice is de minimis violation of separation of powers). These assignments of nonjudicial duties may be far less damaging to the separation of powers than the Sentencing Commission, however, because they entail no legislative or executive functions, and are principally ceremonial. See Comment, Judicial Service, 53 U. Chi. L. Rev. at 1015 (\"judicial independence is in the greatest danger when the purpose of the commission is enactment-intensive or the subject-matter is controversial and likely to be reviewed in the courts\"); cf. ABA Code of Judicial Conduct Canon 5(G) (1972) (allowing judges to represent government \"on ceremonial occasions or in connection with historical, educational, and cultural activities\" but not on other executive commissions). The Justice Department points out that a proposal was made at the constitutional convention to include a judicial analog to the incompatibility clause, U.S. Const. art. I, § 6, cl. 2 (barring officers of the United States from concurrently serving in Congress), that would have barred judges from holding any other office. The proposal was referred to the Committee of Detail and was never reported out or voted upon. See Slonim, Extrajudicial Activities and the Principle of the Separation of Powers, 49 Conn. B.J. 391, 401 (1975); Wheeler, Extrajudicial Activities of the Early Supreme Court, 1973 S. Ct. Rev. 123, 127 \u0026 n. 21. But the absence of such a clause is hardly conclusive. Cf. United States v. Nixon, 418 U.S. 683, 705-06 n. 16, 41 L. Ed. 2d 1039, 94 S. Ct. 3090 (1974) (absence of analog on executive privilege to speech and debate clause \"is not dispositive\"). That the Framers were particularly concerned about the risk of the executive corrupting and coopting legislators, see Slonim, 49 Conn. B.J. at 397-401, does not mean that judicial service outside of the judiciary is completely unconstrained by the doctrine of the separation of the powers. It may mean, for example, that voluntary service in certain ceremonial or advisory capacities is permissible. But mandatory judicial service on a quasi-legislative commission exercising broad rulemaking powers strikes at the very heart of the separation of power doctrine.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. By contrast, other parts of the criminal law reform package, such as the repeal of the Federal Youth Corrections Act, 18 U.S.C. 5005-5026 (1982), were made effective immediately, and were not tied in to the adoption of the sentencing guidelines. See SRA § 235(a)(1)(A), 98 Stat. at 2031.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e* Judge Wiggins did not participate in the consideration of this application.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. I concur with the majority's decision that we have jurisdiction over both of these appeals.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The provision that the guidelines remain before Congress for 180 days before they take effect, 28 U.S.C. § 994(p), does not mean that they are immune from nondelegability analysis. Congressional oversight does not turn administratively promulgated rules into legislation or cure a delegation that is too broad. See Consumer Energy Council v. FERC, 218 U.S. App. D.C. 34, 673 F.2d 425, 467 \u0026 n. 172 (D.C. Cir. 1982), aff'd sub. nom. Process Gas Consumers Group v. Consumer Energy Council, 463 U.S. 1216, 77 L. Ed. 2d 1402, 103 S. Ct. 3556 (1984). It is also irrelevant for nondelegation analysis that the Commission is assigned to a particular branch of government. See National Cable Television Ass'n v. United States, 415 U.S. 336, 341-42, 39 L. Ed. 2d 370, 94 S. Ct. 1146 (1974). The question of the Commission's placement in the judiciary is reserved for the separation of powers discussion below.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The government and the defendants agree that the Commission was improperly placed in the judicial branch. The Sentencing Commission, appearing amicus curiae, vigorously disputes this claim. Counsel for the government also argued that this court, if it found the Commission improperly placed in the judicial branch, could relocate it to the executive branch without recourse to further congressional action. I agree with the majority opinion that were the Commission unconstitutional, a court could not, without congressional intervention, transfer it to another branch.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. See O'Donoghue v. United States, 289 U.S. 516, 545, 77 L. Ed. 1356, 53 S. Ct. 740 (1933) (\"Subject to the guaranties of personal liberties in the amendments and in the original Constitution\" Congress had power to vest authority in District of Columbia courts).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Such provisions include the appointments clause, art. II, § 2, cl. 2; Morrison v. Olson, 487 U.S. 654, 56 U.S.L.W. 4835, 101 L. Ed. 2d 569, 108 S. Ct. 2597 (U.S. June 29, 1988) (rejecting argument that this provision precluded appointment of independent prosecutor under Ethics in Government Act); the presentment clause, art. I, § 7, cl. 2; Immigration \u0026 Naturalization Serv. v. Chadha, 462 U.S. 919, 77 L. Ed. 2d 317, 103 S. Ct. 2764 (1983) (ruling legislature veto unconstitutional), and the bill of attainder and ex post facto clause, art. I, § 9, cl. 3; Buckley v. Valeo, 424 U.S. 1, 46 L. Ed. 2d 659, 96 S. Ct. 612 (1976).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Having the laws executed by one authority was deemed by the Framers to be \"a leading character in the definition of good government.\" The Federalist No. 70, at 423-24 (Hamilton) (\"this unity may be destroyed . . . by vesting it ostensibly in one man, subject in whole or in part to the control and cooperation of others\"); see also Sierra Club v. Costle, 211 U.S. App. D.C. 336, 657 F.2d 298, 405 (D.C. Cir. 1981).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The majority confidently cites Miller v. Florida, 482 U.S. 423, 107 S. Ct. 2446, 96 L. Ed. 2d 351 (1987), for the proposition that sentencing guidelines are more substantive than procedural. Id. at 2453. I find that case inapposite, even though Florida's sentencing guidelines, at issue in that case, id. at 2448-49, are markedly similar to the federal guidelines. The issue in that case was, however, whether petitioner was subject to ex post facto legislation by being sentenced under Florida's new guidelines which were adopted after he committed his crime. The Supreme Court ruled that this was a violation of the ex post facto clause. Id. at 2454; see also U.S. Const. art. I, § 10, cl. 1. Florida's new sentencing guidelines substantively altered Miller's protected expectations. But that is not the problem in our case. Nor can it ever be an issue since the federal guidelines apply only to those crimes committed after their effective date, November 1, 1987. In other words, ours is not a case where the congressional allocation of power conflicted with a contrary constitutional allocation of power, such as one barring ex post facto laws.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. There has been some dispute, in the case of a district judge serving on the Commission, whether the additional compensation would be expressed as a salary increase or as a stipend. The Department of Justice introduced legislation to clarify this matter in 1986. See Yale Comment, 96 Yale L.J. at 1366 n. 33; see also 22 Op. Att'y Gen. 184 (1898) (judges can receive stipend for extrajudicial service). Judge Wilkins, the Commission's chairman, was a district judge at the time of his appointment. He was later elevated to the court of appeals.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. To the extent the government relies on Ferreira, 54 U.S. at 50-51, that case does not treat the issue of whether a judge may act in the personal capacity of a commissioner. It only decides that no appeal may be taken from a decision issued by a commissioner. Id. at 47.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Some of the judges who participated in Hayburn's Case and the Todd decision were among those so active. John Jay served simultaneously as the first Chief Justice and Ambassador to England in 1794. A successor, Chief Justice Oliver Ellsworth was Minister to France during his term on the Court. John Marshall for a brief period was both Chief Justice and Secretary of State. See In re President's Commission on Organized Crime (\"Scarfo\"), 783 F.2d 370, 377 (3d Cir. 1986) (for additional instances of judges serving in executive roles); Wheeler, 1973 Sup. Ct. Rev. at 132-35 (same).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Currently, only two of the three judges serving on the Commission are active judges. This particular form of impairment could be completely discounted if all of the judges serving on the Commission were senior status.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The majority seems to place some emphasis on the problem of judges having to recuse themselves in criminal cases involving the guidelines, and that there will be an appearance of impropriety of judges reviewing the work of other judges. Arnold, 678 F. Supp. at 1472. This fear of wholesale recusals is unfounded. Just because, for example, judges participated in the drafting of the Federal Rules of Procedure did not mean that they would be disqualified from deciding cases challenging or construing those Rules. See Mississippi Publishing Corp. v. Murphree, 326 U.S. § 438, 444 (1946).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. It should also be noted, however, that Congress rejected proposals to place authority to promulgate guidelines under the complete control of the judiciary. See S. 1182, 98th Cong., 1st Sess. (1983) (proposing committee on sentencing guidelines within Judicial Conference of United States, whose members would be appointed and removable by Judicial Conference.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. It should be emphasized that the only question on appeal presented here is whether the \"good time\" provisions of the Sentencing Reform Act are severable. The Act also abolished parole. Nevertheless, whether the parole provisions of the Act are severable should not be at issue before this court.\u003c/span\u003e\n\n",
    "body_length": 169966,
    "citedas": [
      "857 F.2d 1245"
    ],
    "attorneys": "Alan B. Morrison, Public Citizen Litigation Group, Washington, D.C., and Judy Clarke, Federal Defenders of San Diego, Inc., San Diego, California, for the petitioner-appellant in No. 88-5848 and the defendant-appellee in No. 88-5109. Douglas Letter and Gregory C. Sisk, United States Department of Justice, Washington, D.C., for the respondent-appellee in no. 88-5848 and the plaintiff-appellant in No. 88-5109. Paul M. Bator, Mayer, Brown \u0026 Platt, Chicago, Illinois; and John R. Steer, General Counsel, United States Sentencing Commission, Washington, D.C., for the United States Sentencing Commission as amicus curiae.",
    "category": [
      "251",
      "36",
      "75"
    ],
    "judges": "Wiggins, Brunetti and Kozinski, Circuit Judges.",
    "citation_count": 76
  }
}
