{
  "id": "yIkeQGYBTlTomsSBGQLN",
  "document": {
    "title": "United States v. Kincade",
    "full_title": "UNITED STATES OF AMERICA v. THOMAS CAMERON KINCADE .",
    "jurisdiction": "Ninth Circuit",
    "date": "2004-08-18T00:00:00.000Z",
    "docket": "No. 02-50380",
    "body": "FOR PUBLICATION\n\nArgued and Submitted March 23, 2004-San Francisco, California\n\nOpinion by Judge O'Scannlain; Concurrence by Judge Gould; Dissent by Judge Reinhardt; Dissent by Judge Kozinski; Dissent by Judge Hawkins\n\nOPINION\n\nWe must decide whether the Fourth Amendment permits compulsory DNA profiling of certain conditionally-released federal offenders in the absence of individualized suspicion that they have committed additional crimes.\n\nI.\n\nA.\n\nPursuant to the DNA Analysis Backlog Elimination Act of 2000 (\"DNA Act\"), Pub. L. No. 106-546, 114 Stat. 2726 (2000), individuals who have been convicted of certain federal crimes\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e and who are incarcerated, or on parole, probation, or supervised release\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e must provide federal authorities with \"a tissue, fluid, or other bodily sample . . . on which a[n] . . . analysis of th[at sample's] deoxyribonucleic acid (DNA) identification information\" can be performed. 42 U.S.C. §§ 14135a(c)(1)-(2); id. at §§ 14135a(a)(1)-(2). Because the Federal Bureau of Investigation (\"the Bureau\") considers DNA information derived from blood samples to be more reliable than that obtained from other sources (in part because blood is easier to test and to preserve than hair, saliva, or skin cells), Bureau guidelines require those in federal custody and subject to the DNA Act (\"qualified federal offenders\") to submit to compulsory blood sampling. See Nancy Beatty Gregoire, Federal Probation Joins the World of DNA Collection, 66 Fed. Probation 30, 31 (2002). Failure \"to cooperate in the collection of that sample [is] . . . a class A misdemeanor,\" punishable by up to one year's imprisonment and a fine of as much as $100,000. 42 U.S.C. § 14135a(a)(5); 18 U.S.C. §§ 3571 \u0026 3581.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nOnce collected by a phlebotomist, qualified federal offenders' blood samples are turned over to the Bureau for DNA analysis-the identification and recording of an individual's \"genetic fingerprint.\"\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Through the use of short tandem repeat technology (\"STR\"), the Bureau analyzes the presence of various alleles\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e located at 13 markers (or loci) on DNA present in the specimen. These STR loci are each found on so-called \"junk DNA\"-that is, non-genic stretches of DNA not presently recognized as being responsible for trait coding\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e -and \"were purposely selected because they are not associated with any known physical or medical characteristics.\" H.R. Rep. No. 106-900(I) at *27. Because there are observed group variances in the representation of various alleles at the STR loci, however, DNA profiles derived by STR may yield probabilistic evidence of the contributor's race or sex. Future of Forensic DNA Testing 35, 39-42.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Even so, DNA profiles generated by STR are highly individuated: Due to the substantial number of alleles present at each of the 13 STR loci (between 7 and 20, see Future of Forensic DNA Testing 41) and widespread variances in their representation among human beings, the chance that two randomly selected individuals will share the same profile are infinitesimal-as are the chances that a person randomly selected from the population at large will present the same DNA profile as that drawn from crime-scene evidence. See Future of Forensic DNA Testing 19-22, 39-42.\n\nOnce STR has been used to produce an individual's DNA profile, the resulting record\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e is loaded into the Bureau's Combined DNA Index System (\"CODIS\")-a massive centrally-managed database linking DNA profiles culled from federal, state, and territorial DNA collection programs, as well as profiles drawn from crime-scene evidence, unidentified remains, and genetic samples voluntarily provided by relatives of missing persons. 42 U.S.C. §§ 14132(a)-(b).\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e As of March 2004, CODIS contained DNA profiles drawn from 1,641,076 offenders and 78,475 crime scenes. Fed. Bureau of Investigation,\n\nNDIS Statistics, available at http://www.fbi.gov/hq/lab/ codis/clickmap.htm (last visited May 11, 2004). Of those profiles, 298,767 offender records and 10,270 forensic samples originated in the states comprising the Ninth Circuit. See id.\n\nCODIS can be used in two different ways. First, law enforcement can match one forensic crime scene sample to another forensic crime scene sample, thereby allowing officers to connect unsolved crimes through a common perpetrator. Second, and of perhaps greater significance, CODIS enables officials to match evidence obtained at the scene of a crime to a particular offender's profile. In this latter capacity, CODIS serves as a potent tool for monitoring the criminal activity of known offenders. Through March 2004, Bureau data indicated that CODIS has aided some 16,160 investigations nationwide-1,710 within the Ninth Circuit. Fed. Bureau of Investigation, Investigations Aided, available at http://www.fbi.gov/hq/lab/codis/aidedmap.htm (last visited May 11, 2004).\n\nB.\n\nOn July 20, 1993, driven by escalating personal and financial troubles, decorated Navy seaman Thomas Cameron Kincade robbed a bank using a firearm in violation of 18 U.S.C. §§ 2113(a) \u0026 (d) and 18 U.S.C. § 924(c)(1). He soon pleaded guilty to those charges and was sentenced to 97 months' imprisonment, followed by three years' supervised release. Among others, terms of his release required him to participate in an outpatient substance abuse program; not to commit another federal, state, or local crime; and to follow the instructions of his probation officer.\n\nShortly after his August 2000 release from federal prison, Kincade submitted a urine sample which tested positive for cocaine. A warrant was issued for his arrest in early October, and on November 13, the district court reinstated Kincade's original term of supervision. In April 2001, Kincade admitted relapsing into cocaine abuse and requested placement in a residential drug treatment program. No action was taken on his request, and on May 21 and May 28, 2001, Kincade again submitted cocaine-positive urine samples. As a result, the district court modified the terms of Kincade's supervised release on June 7, 2001 to include treatment in a residential drug program. Thereafter, Kincade appears to have begun making progress in reforming his life.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nOn March 25, 2002, Kincade's probation officer asked him to submit a blood sample pursuant to the DNA Act.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e He refused, eventually explaining that his objections were purely a matter of personal preference-in his words, \"not a religious conviction.\"\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e Kincade's probation officer suggested he contact his attorney for advice, and also explained that if he changed his mind he could submit a blood sample on April 16, 2002. On April 4, 2002, Kincade notified the Probation Office of his intention not to comply and, as promised, he refused to appear for DNA profiling on April 16. On May 7, 2002, Kincade's probation officer again contacted him in an effort to determine whether there was some way they could work through the issue. Kincade indicated that he would comply with the requirements of the DNA Act only if threatened with imposition of a significant term of incarceration. Lacking any alternative, Kincade's probation officer informed the district court that Kincade had refused to submit the blood sample required by the DNA Act. He also recommended revocation of Kincade's supervised release, and reincarceration.\n\nIn briefing to the district court prior to a scheduled revocation hearing, Kincade challenged the constitutionality of the DNA Act on grounds that it violated the Ex Post Facto Clause, the Fourth Amendment, and separation of powers principles embodied in Article III and the Due Process Clause.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nOn July 15, 2002, Kincade appeared at a revocation hearing before U.S. District Judge Dickran Tevrizian. After stating on the record that he was inclined to hold the DNA Act constitutional, Judge Tevrizian offered Kincade another opportunity to submit to DNA profiling in lieu of proceeding with the revocation hearing. Kincade consulted with counsel, who quickly informed the court that Kincade had again declined to reconsider his refusal to submit to DNA profiling.\n\nFollowing argument, Judge Tevrizian rejected Kincade's constitutional challenges to the DNA Act. Concluding that Kincade had violated the terms of his supervised release by refusing to follow his Probation officer's lawful instruction to provide a blood sample, Judge Tevrizian sentenced Kincade to four months' imprisonment and two years' supervised release. Judge Tevrizian immediately stayed Kincade's sentence of imprisonment, and we expedited review of his appeal. On April 14, 2003-while this appeal was pending, and while Kincade was serving his additional supervised release-Kincade again tested positive for drug use. Consequently, Judge Tevrizian lifted his stay of Kincade's sentence and, once in custody, Kincade finally was forced to submit to DNA profiling. He persists in his challenge to the Act.\n\nII.\n\nWhile \"[i]t would be foolish to contend that the degree of privacy secured to citizens by the Fourth Amendment has been entirely unaffected by the advance of technology,\" Kyllo v. United States, 533 U.S. 27, 33-34 (2001), we begin-as always-with first principles.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nA.\n\n[1] Pursuant to the Fourth Amendment, \"[t]he right of the people to be secure in their persons, houses, papers, and effects, against unreasonable searches and seizures, shall not be violated, and no Warrants shall issue, but upon probable cause, supported by Oath or affirmation, and particularly describing the place to be searched, and the persons or things to be seized.\" U.S. Const. amend. IV. \"The touchstone of our analysis under the Fourth Amendment is always 'the reasonableness in all the circumstances of the particular governmental invasion of a citizen's personal security.' \" Pennsylvania v. Mimms, 434 U.S. 106, 108-09 (1977) (quoting Terry v. Ohio, 392 U.S. 1, 19 (1968)).\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nOrdinarily, the reasonableness of a search depends on governmental compliance with the Warrant Clause, which requires authorities to demonstrate probable cause to a neutral magistrate and thereby convince him to provide formal authorization to proceed with a search by issuance of a particularized warrant. United States v. United States Dist. Ct., 407 U.S. 297, 315-16 (1972); see also Groh v. Ramirez, 540 U.S. __, __, 124 S. Ct. 1284, 1290-91 (2004). However, the general rule of the Warrant Clause is not unyielding. Under a variety of conditions, law enforcement may execute a search without first complying with its dictates. For instance, police may execute warrantless searches incident to a lawful arrest: It is reasonable for authorities to search an arrestee for weapons that might threaten their safety, or for evidence which might be destroyed. See, e.g., Chimel v. California, 395 U.S. 752, 762-63 (1969); see also Thornton v. United States, 541 U.S. __, 124 S. Ct. 2127, 2132 (2004). And even outside the context of a lawful arrest supported by probable cause, officers are likewise authorized to conduct a warrantless protective pat-down of individuals they encounter in the field so long as their concerns are justified by reasonable suspicion of possible danger. See, e.g., Terry, 392 U.S. at 27.\n\n[2] The Court has also sanctioned several general search regimes that are free from the usual warrant-and-probable cause requirements. Though not necessarily mutually-exclusive, three categories of searches help organize the jurisprudence. The first can be called \"exempted areas.\" Included here are searches conducted at the border,\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e in prisons,\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e and at airports and entrances to government buildings.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nThe second category is typically labeled \"administrative\" searches, though it has not always been given that label.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e This class includes inspections of closely-regulated businesses, see, e.g., Burger, 482 U.S. at 702-04 (\"[W]here the privacy interests of the owner are weakened and the government interests in regulating particular businesses are concomitantly heightened, a warrantless inspection of commercial premises may well be reasonable within the meaning of the Fourth Amendment.\"); United States v. Biswell, 406 U.S. 311, 317 (1972), and extends to other routine regulatory investigations. See, e.g., Camara v. Mun. Ct. of S.F., 387 U.S. 523, 535-539 (1967) (authorizing municipal \"area inspections\" designed to monitor compliance with building safety codes).\n\n[3] A final category of suspicionless searches is referred to as \"special needs,\" and in recent years, the Court has devoted increasing attention to the development of the accompanying analytical doctrine. See Illinois v. Lidster, 540 U.S. __, 124 S. Ct. 885 (2004) (upholding a highway checkpoint designed to enable police to question citizens about a recent crime); Bd. of Educ. v. Earls, 536 U.S. 822 (2002) (upholding a program that subjected all students participating in extracurricular activities to submit to random, suspicionless drug testing); Ferguson v. City of Charleston, 532 U.S. 67 (2001) (invalidating a public hospital's non-consensual drug testing of maternity patients); Edmond, 531 U.S. at 48 (invalidating a roadside checkpoint designed to discover and interdict illegal drugs); Vernonia Sch. Dist. 47J v. Acton, 515 U.S. 646 (1995) (upholding a program subjecting student athletes to random, suspicionless drug testing); see also Nat'l Treasury Employees Union v. Von Raab, 489 U.S. 656 (1989) (upholding suspicionless drug testing of certain U.S. Customs officials); Skinner, 489 U.S. at 634 (upholding compulsory blood and urine tests of railroad employees involved in certain train accidents); Griffin, 483 U.S. at 879-80 (upholding a warrantless search of a probationer's residence).\n\n[4] For the most part, these cases involve searches conducted for important non-law enforcement purposes in contexts where adherence to the warrant-and-probable cause requirement would be impracticable. Thus, the Court explained in New Jersey v. T.L.O. that \"preservation of order and a proper educational environment requires close supervision of schoolchildren, as well as the enforcement of rules against conduct that would be perfectly permissible if undertaken by an adult.\" 469 U.S. at 339. At the same time, the Court explained, the warrant and probable cause requirements are ill-suited to the pressing needs of public schools. Id. at 339-40. The Justices therefore found \"that the school setting requires some easing of the restrictions to which searches by public authorities are ordinarily subject,\" and held that \"legality of a search of a student should depend simply on the reasonableness, under all the circumstances, of the search.\" Id. at 340-41. As Justice Blackmun described the Court's rationale in his concurring opinion, it was the school environ-ment's \"special needs, beyond the normal need for law enforcement, [that] ma[d]e the warrant and probable-cause requirement impracticable.\"Id. at 351 (Blackmun, J., concurring).\n\n1.\n\nAlmost as soon as the \"special needs\" rationale was articulated, however, the Court applied special needs analysis in what seemed-at least on the surface-to be a clear law enforcement context. At issue in Griffin was a warrantless search of a probationer's home, instigated and carried out under the direction of law enforcement officials acting with what appeared to be pure law enforcement motives. The facts of the search are particularly illuminating. In early 1983, a detective in the Beloit, Wisconsin police department contacted Griffin's probation officer's supervisor with information that Griffin might have weapons in his apartment. Unable to secure the cooperation of Griffin's own probation officer in the execution of a search, the supervisor enlisted another probation officer for assistance and promptly accompanied three plainclothes policemen to Griffin's apartment. The ensuing search uncovered a weapon, Griffin, 483 U.S. at 871, and Griffin was arrested and charged with possession of a firearm by a felon. He eventually moved to suppress the evidence uncovered during the warrantless search of his residence. Id. at 872.\n\nOn eventual appeal to the Supreme Court, the Justices explained:\n\nA State's operation of a probation system, like its operation of a school, government office or prison, or its supervision of a regulated industry, likewise presents 'special needs' beyond normal law enforcement that may justify departures from the usual warrant and probable-cause requirements. Probation, like incarceration, is a form of criminal sanction imposed by a court upon an offender after verdict, finding, or plea of guilty. . . . [I]t is always true of probationers (as we have said it to be true of parolees) that they do not enjoy the absolute liberty to which every citizen is entitled, but only conditional liberty properly dependent on observance of special probation restrictions. These restrictions are meant to assure that the probation serves as a period of genuine rehabilitation and that the community is not harmed by the probationer's being at large. These same goals require and justify the exercise of supervision to assure that the restrictions are in fact observed.\n\nId. at 873-75 (citations, quotations, and alterations omitted). Carefully noting that these \"special needs\"-operation of a system of conditional release characterized by close supervision of convicted offenders-did not operate wholly to eliminate the Fourth Amendment rights of those subject to its strictures, the Court observed that the probation context nonetheless necessitated a relaxation of the usual warrant-and-probable cause requirement. Id. at 876-79.\n\nIn such circumstances it is both unrealistic and destructive of the whole object of the continuing probation relationship to insist upon the same degree of demonstrable reliability of particular items of supporting data, and upon the same degree of certainty of violation, as is required in other contexts. In some cases-especially those involving drugs or illegal weapons-the probation agency must be able to act based upon a lesser degree of certainty than the Fourth Amendment would otherwise require in order to intervene before a probationer does damage to himself or society.\n\nId. at 879. Thus, the Court concluded, the Constitution permits the execution of probation and parole searches based on no more than reasonable suspicion-even where the search at issue is triggered by law enforcement information and motivated by apparent law enforcement purposes. Id. at 880.\n\n2.\n\n[5] Notwithstanding Griffin's apparent focus on the crucial law enforcement goals of probation and parole,\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e however, the Court's more recent \"special needs\" cases have emphasized the absence of any law enforcement motive underlying the challenged search and seizure. Two cases are particularly noteworthy. In Edmond, the Court addressed whether the Indianapolis, Indiana police department lawfully could operate a program of random vehicle checkpoints in an effort to interdict illegal drugs. Under the program, officers randomly would stop passing vehicles at several locations throughout the city. Once a vehicle was detained, officers would request its driver's license and registration, conduct a non-invasive visual inspection of the car's interior, and lead a narcotics-detention dog around the vehicle's exterior. Edmond, 531 U.S. at 35. During the program's operation, police temporarily detained more than 1100 vehicles and arrested approximately 100 individuals (approximately half for drug violations and half for other offenses). Two of the detained motorists eventually sued, alleging that such suspicionless law enforcement detentions violated the Fourth Amendment.\n\nSiding with the motorists, the Court explained that it had never approved a checkpoint program \"whose primary purpose was to detect evidence of ordinary criminal wrongdoing.\" Id. at 38. To reach that conclusion, the Court had to distinguish two precedents: United States v. Martinez-Fuerte, 428 U.S. 543 (1976), which upheld suspicionless border checkpoints designed to intercept illegal aliens, and Mich. Dep't of State Police v. Sitz, 496 U.S. 444 (1990), which upheld suspicionless roadside sobriety checkpoints. To do so, the Court explained that the former was justified by a unique government interest in border control, id. at 37-39, 41, and the latter by \"the type of immediate, vehicle-bound threat to life and limb\" posed by drunk drivers. Id. at 39, 43. In contrast, Indianapolis's program was justified \"only by the generalized and ever-present possibility that interrogation and inspection may reveal that any given motorist has committed some crime.\" Id. at 44. In such circumstances, the Court flatly \"decline[d] to suspend the usual requirement of individualized suspicion.\" Id.\n\n3.\n\nEdmond's emphasis on the non-law enforcement focus of sustainable suspicionless searches was soon strengthened in Ferguson. There, the Court addressed whether a public hospital lawfully could share pregnant women's positive drug tests with law enforcement in an effort to help solve the epidemic of \"crack babies.\" Ten mothers arrested because of the hospital's collaboration with the police eventually sued the hospital and the City of Charleston, South Carolina, alleging that the Fourth Amendment forbids suspicionless drug screening of their urine for law enforcement purposes. Ferguson, 532 U.S. at 71-73.\n\nAs in Edmond, the Court again sided with the plaintiffs. It began by observing that the infringement occasioned by the hospital's sharing private medical data with law enforcement constituted a far more egregious intrusion into patients' privacy rights than the suspicionless urinalyses upheld in the Court's prior drug testing cases:\n\nIn the previous four cases, there was no misunderstanding about the purpose of the test or the potential use of the test results, and there were protections against the dissemination of the results to third parties. The use of an adverse test result to disqualify one from eligibility for a particular benefit, such as a promotion or an opportunity to participate in an extracurricular activity, involves a less serious intrusion on privacy than the unauthorized dissemination of such results to third parties. The reasonable expectation of privacy enjoyed by the typical patient undergoing diagnostic tests in a hospital is that the results of those tests will not be shared with non-medical personnel without her consent. In none of our prior cases was there any intrusion upon that kind of expectation.\n\nId. at 78.\n\nCrucially, the Court continued, the hospital's program also had purposes clearly distinguishable from those of the Court's other urinalysis cases:\n\nIn each of those earlier cases, the 'special need' that was advanced as a justification for the absence of a warrant or individualized suspicion was one divorced from the State's general interest in law enforcement. . . . In this case, however, the central and indispensable feature of the policy from its inception was the use of law enforcement to coerce the patients into substance abuse treatment.\n\nId. At bottom, because \"the immediate objective of the searches was to generate evidence for law enforcement purposes,\" id. at 83 (emphasis in original),\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e and in light of \"the extensive involvement of law enforcement officials at every stage of the policy,\" id. at 84, the Court concluded that \"this case simply does not fit within the closely guarded category of 'special needs.' \" Id.\n\n4.\n\nWhile these recent cases may seem to be moving toward requiring that any search conducted primarily for law enforcement purposes must be accompanied by at least some quantum of individualized suspicion, the Court signaled the existence of possible limitations in United States v. Knights, 534 U.S. 112 (2001). At issue there was a warrantless search of a probationer long suspected of having committed crimes targeting Pacific Gas \u0026 Electric (\"PG\u0026E\") facilities. Shortly after Knights was placed on probation for an unrelated drug offense, an arson targeting a PG\u0026E electrical transformer caused approximately $1.5 million in damage. Id. at 114-15.\n\nOn a hunch that Knights may have been involved (some prior crimes against PG\u0026E had coincided with Knights's court appearances), a sheriff's deputy established surveillance of Knights's apartment. In the wee hours, he observed Knights's suspected accomplice leave the apartment carrying three cylindrical items-potential pipe bombs-toward a nearby waterway. Shortly thereafter, the deputy heard three splashes, and watched Knights's compatriot return empty-handed to the residence before driving away. Id. at 115. The deputy followed, and after seeing the suspected accomplice park nearby, approached his vehicle-observing \"a Molotov cocktail and explosive materials, a gasoline can, and two brass padlocks that fit the description of those removed from the PG\u0026E transformer vault.\" Id.\n\nAware that conditions of Knights's probation required him to submit to warrantless, suspicionless searches of his person and residence at any time, the deputy promptly executed a warrantless search of Knights's home. In the process, he uncovered \"a detonation cord, ammunition, liquid chemicals, instruction manuals on chemistry and electrical circuitry, bolt cutters, telephone pole-climbing spurs, drug paraphernalia, and a brass padlock stamped 'PG\u0026E.' \" Id. Knights soon was arrested and charged, and he ultimately sought to suppress the evidence obtained during the deputy's search. Id. at 116.\n\nCharacterizing Griffin as having sanctioned only purely probationary searches undertaken with non-law enforcement motivations, Knights argued that the search of his residence was impermissible because it had been motivated solely by law enforcement objectives and was executed entirely by law enforcement officials. The Court, however, cursorily rejected his argument:\n\nThis dubious logic-that an opinion upholding the constitutionality of a particular search implicitly holds unconstitutional any search that is not like it- runs contrary to Griffin's express statement that its 'special needs' holding made it 'unnecessary to consider whether' warrantless searches of probationers were otherwise reasonable within the meaning of the Fourth Amendment.\n\nId. at 117-18 (quoting Griffin, 483 U.S. at 880). Rather than analyze the warrantless search of Knights's apartment within the special needs framework, the Court instead opted to \"consider th[e] question [left open by Griffin] in assessing the constitutionality of the search of Knights's apartment.\" Id. at 118.\n\nTo do so, it turned to the traditional totality of the circumstances test-balancing the invasion of Knights's interest in privacy against the State's interest in searching his home without a warrant supported by probable cause. Of central importance to our decision today, the Court explained that \"Knights's status as a probationer subject to a search condition informs both sides of that balance.\" Id. at 119. With regard to Knights's interest in privacy, the Court observed:\n\nInherent in the very nature of probation is that probationers do not enjoy the absolute liberty to which every citizen is entitled. Just as other punishments for criminal convictions curtail an offender's freedoms, a court granting probation may impose reasonable conditions that deprive the offender of some freedoms enjoyed by law-abiding citizens. The judge who sentenced Knights to probation determined that it was necessary to condition the probation on Knights's acceptance of the search provision. It was reasonable to conclude that the search condition would further the two primary goals of probationrehabilitation and protecting society from future criminal violations. The probation order clearly expressed the search condition and Knights was unambiguously informed of it. The probation condition thus significantly diminished Knights's reasonable expectation of privacy.\n\nId. at 119-20 (citations and quotations omitted).\n\nAssessing the government's interest in applying the search condition to Knights, the Court similarly explained:\n\n[T]he very assumption of the institution of probation is that the probationer is more likely than the ordinary citizen to violate the law. The recidivism rate of probationers is significantly higher than the general crime rate. And probationers have even more of an incentive to conceal their criminal activities and quickly dispose of incriminating evidence than the ordinary criminal because probationers are aware that they may be subject to supervision and face revocation of probation, and possible incarceration.\n\nThe State has a dual concern with a probationer. On the one hand is the hope that he will successfully . . . be integrated back into the community. On the other is the concern, quite justified, that he will be more likely to engage in criminal conduct than an ordinary member of the community. The . . . [State's] interest in apprehending violators of the criminal law, thereby protecting potential victims of criminal enterprise, may therefore justifiably focus on probationers in a way that it does not on the ordinary citizen.\n\nId. at 120-21. As a result, the Court held, the government needs \"no more than reasonable suspicion to conduct a search of [a] probationer's house.\" Id. at 121.\n\n5.\n\nHaving thus upheld a warrantless probation search designed purely to further law enforcement purposes, and having done so wholly outside the confines of special needs analysis, Knights suggests something of a departure from Edmond and Ferguson (and to a more limited extent Griffin). After all, each of those cases had assessed warrantless searches under a special needs rubric that demands some underlying motivation apart from the government's general interest in law enforcement. Yet even beyond declining to apply such analysis, Knights almost wholly ignored the Court's previous decisions in Edmond and Ferguson.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nOne possible distinction between Knights, on one hand, and Edmond and Ferguson, on the other, suggests a possible reconciliation: The search conducted in Knights was supported by reasonable suspicion, while the Court's most recent special needs cases have focused on suspicionless searches and seizures, such as the DNA profiling at issue here. See, e.g., Lidster, 540 U.S. at __, 124 S. Ct. at 889; Ferguson, 532 U.S. at 76-77; Edmond, 531 U.S. at 37-38. One might therefore be tempted to conclude that the quantum of suspicion supporting the search of Knights's apartment was what pushed the Court beyond special needs analysis. See, e.g., post at 11510-11.\n\nWe do not think so. The Court has long understood special needs analysis to be triggered not by a complete absence of suspicion, but by a departure from the Fourth Amendment's warrant-and-probable cause requirements. In Griffin, after all, the search upheld by the Court under special needs analysis was also supported by \"reasonable grounds,\" 483 U.S. at 875-76, and Justice Scalia opened the analysis of his opinion for the Court by observing:\n\nAlthough we usually require that a search be undertaken only pursuant to a warrant (and thus supported by probable cause, as the Constitution says warrants must be), we have permitted exceptions when \"special needs, beyond the normal need for law enforcement, make the warrant and probable-cause requirement impracticable.\"\n\nId. at 873 (quoting T.L.O., 469 U.S. at 351 (Blackmun, J., concurring)); see also Von Raab, 489 U.S. at 666 (noting that the special needs present in that case \"justify departure from the ordinary warrant and probable-cause requirements\"); Skinner, 489 U.S. at 619 (\"Except in certain well-defined circumstances, a search or seizure in such a case is not reasonable unless it is accomplished pursuant to a judicial warrant issued upon probable cause. We have recognized exceptions to this rule, however, \"when special needs, beyond the normal need for law enforcement, make the warrant and probable-cause requirement impracticable.\" When faced with such special needs, we have not hesitated to balance the governmental and privacy interests to assess the practicality of the warrant and probable-cause requirements in the particular context.\") (quoting Griffin, 483 U.S. at 873) (citations and additional internal quotation omitted); T.L.O., 469 U.S. at 340-42 \u0026 n.8 (describing the special needs justifying a departure from the warrant-and-probable cause standard in schools and expressly declining to \"decide whether individualized suspicion is an essential element of the reasonableness standard we adopt for searches by school authorities.\").\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\n[6] Moreover, Knights made clear the Court was not prepared to draw the line at a reasonable suspicion threshold-at least not when it comes to conditional releasees. To the contrary, it expressly left unresolved the question whether special needs analysis controlled suspicionless searches of probationers at all:\n\nWe do not decide whether the probation condition so diminished, or completely eliminated, Knights's reasonable expectation of privacy . . . that a search by a law enforcement officer without any individualized suspicion would have satisfied the reasonableness requirement of the Fourth Amendment. The terms of the probation condition permit such a search, but we need not address the constitutionality of a suspicionless search because the search in this case was supported by reasonable suspicion.\n\nId. at 120 n.6. The only rational interpretation of Knights's express reservation is that-without regard to the Court's prior decisions in Edmond and Ferguson-it remains entirely an open question whether suspicionless searches of conditional releasees pass constitutional muster when such searches are conducted for law enforcement purposes.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nB.\n\n[7] We are not the first court called upon to address this unresolvedissue. Confronted with challenges to the federal DNA Act and its statelaw analogues, our sister circuits and peers in the states havedivided in their analytical approaches -both before and after theSupreme Court's recent special needs decisions. On one hand, theSecond, Seventh, and Tenth Circuits, along with a variety of federaldistrict courts and at least two state Supreme Courts, have upheld DNAcollection statutes under a special needs analysis (though not alwaysruling out the possibility that the totality of the circumstancesmight validate the search absent some special need). See Green v.Berge, 354 F.3d 675, 679 (7th Cir. 2004); United States v. Kimler, 335F.3d 1132, 1146 (10th Cir. 2003); Roe v. Marcotte, 193 F.3d 72, 79-82(2d Cir. 1999); Vore v. U.S. Dep't of Justice, 281 F. Supp. 2d 1129,1133-35 (D. Ariz. 2003); Miller v. U.S. Parole Comm'n, 259 F. Supp. 2d1166, 1175-78 (D. Kan. 2003); United States v. Sczubelek, 255 F. Supp.2d 315, 319-23 (D. Del. 2003); United States v. Reynard, 220 F. Supp.2d 1142, 1165-69 (S.D. Cal. 2002); State v. Martinez, 78 P.3d 769,771-75 (Kan. 2003); State v. Olivas, 856 P.2d 1076, 1085-86 (Wash.1993); State v. Steele, 802 N.E.2d 1127, 1132-37 (Ohio Ct. App. 2003);In re D.L.C., 124 S.W.3d 354, 370-73 (Tex. App. 2003); State v. Surge,__ P.3d __, __, 2004 WL 1551561, *7 (Wash. Ct. App. July 12, 2004).\n\n[8] By contrast, the Fourth and Fifth Circuits, a Seventh Circuit Judge, numerous federal district courts, and a variety of state courts have approved compulsory DNA profiling under a traditional assessment of reasonableness gauged by the totality of the circumstances. See Green, 354 F.3d at 680-81 (Easterbrook, J., concurring); Groceman v. U.S. Dep't of Justice, 354 F.3d 411, 413-14 (5th Cir. 2004) (per curiam); Velasquez v. Woods, 329 F.3d 420, 421 (5th Cir. 2003) (per curiam); Jones v. Murray, 962 F.2d 302, 306-07 (4th Cir. 1992); Nicholas v. Goord, No. 01Civ.7891, 2004 WL 1432533, *2-*6 (S.D.N.Y. Jun 24, 2004); United States v. Stegman, 295 F. Supp. 2d 542, 548-50 (D. Md. 2003); Padgett v. Ferrero, 294 F. Supp. 2d 1338, 1343-44 (N.D. Ga. 2003); United States v. Meier, No. CR97-72HA, 2002 U.S. Dist. LEXIS 25755 (D. Or. 2002); United States v. Lujan, No. CR98-480-02HA, 2002 U.S. Dist. LEXIS 25754 (D. Or. 2002); Shelton v. Gudmanson, 934 F. Supp. 1048 (W.D. Wis. 1996); Kruger v. Erickson, 875 F. Supp. 583 (D. Minn. 1995); Vanderlinden v. Kansas, 874 F. Supp. 1210 (D. Kan. 1995); Sanders v. Coman, 864 F. Supp. 496 (E.D.N.C. 1994); Ryncarz v. Eikenberry, 824 F. Supp. 1493 (E.D. Wash. 1993); Landry v. Attorney General, 429 Mass. 336, 343-48 (1999); Gaines v. State, 998 P.2d 166, 171-73 (Nev. 2000); Johnson v. Commonwealth, 529 S.E.2d 769, 779 (Va. 2000); Doles v. States, 994 P.2d 315, 317-20 (Wyo. 1999); In re Maricopa County Juvenile Actions, 930 P.2d 496, 500-01 (Ariz. Ct. App. 1996); People v. Adams, 9 Cal. Rptr. 3d 170, 180-84 (Cal. Ct. App. 2004); L.S. v. State, 805 So. 2d 1004, 1006-07 (Fl. Dist. Ct. App. 2001); People v. Calahan, 649 N.E.2d 588, 591-92 (Ill. App. Ct. 1995); Cooper v. Gammon, 943 S.W.2d 699, 704-05 (Mo. Ct. App. 1997); Surge, __ P.3d at __, 2004 WL 1551561, *7 (Wash. Ct. App. July 12, 2004); cf. also United States v. Lifshitz, 363 F.3d 158, 164 \u0026 165 (2d Cir. 2004), as amended, 369 F.3d 173, 180 \u0026 181 (explaining that Knights \"[d]ispens[ed] with [the Court's] previous distinction between searches undertaken for probationary and for investigative purposes, and, with that distinction, the 'special needs' justification articulated in Griffin for reducing the level of suspicion required for probationary searches,\" and concluding that \"[p]robationary searches-whether for law enforcement or probationary purposes-are acceptable under Knights if based upon reasonable suspicion (or potentially a lesser standard)\").\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\n[9] Finally, we observe that our own 1995 decision in Rise v. Oregon, 59 F.3d 1556 (9th Cir. 1995), upheld the constitutionality of a state DNA collection statute by applying a pure totality of the circumstances analysis. Our resolution of the methodological question, left open by Knights, therefore squarely implicates the legitimacy of our own precedent and its method.\n\nIII.\n\nWhile not precluding the possibility that the federal DNA Act could satisfy a special needs analysis, we today reaffirm the continuing vitality of Rise-and hold that its reliance on a totality of the circumstances analysis to uphold compulsory DNA profiling of convicted offenders both comports with the Supreme Court's recent precedents and resolves this appeal in concert with the requirements of the Fourth Amendment.\n\nA.\n\n[10] As we have stressed, neither Edmond nor Ferguson condemns suspicionless searches of conditional releasees in the absence of a demonstrable \"special need\" apart from law enforcement. Indeed, Ferguson explicitly distinguished itself from cases addressing the constitutionality of parole and probation searches-thus recognizing a constitutionally significant distinction between searches of conditional releasees and searches of the general public, and laying the framework for a jurisprudentially sound analytic division between these two classes of suspicionless searches. See Ferguson, 532 U.S. at 79 n.15 (\"[W]e agree with petitioners that Griffin is properly read as limited by the fact that probationers have a lesser expectation of privacy than the public at large.\") (citing Griffin, 483 U.S. at 874-75).\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e And Knights, of course, affirmed the post-Edmond, post-Ferguson possibility that conditional releasees' diminished expectations of privacy may be sufficient to justify the judicial assessment of a parole or probation search's reasonableness outside the strictures of special needs analysis. Knights, 524 U.S. 117-18, 119-20 \u0026 n.6.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\n\n[11] Of course, the mere possibility that suspicionless searches of conditional releasees may be sustainable under a pure totality of the circumstances analysis is insufficient to establish that such searches actually are sustainable under such analysis. We begin our resolution of the issue by taking note of the well-established principle that parolees and other conditional releasees are not entitled to the full panoply of rights and protections possessed by the general public. Quite to the contrary, the Court has recognized that \"those who have suffered a lawful conviction\" are properly subject to a \"broad range of [restrictions] that might infringe constitutional rights in free society,\" McKune v. Lile, 536 U.S. 24, 36 (2002),\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e in no small part due to the extraordinary rate of recidivism among offenders. See, e.g., Pa. Bd. of Prob. \u0026 Parole v. Scott, 524 U.S. 357, 365 (1998); Knights, 534 U.S. at 120; Griffin, 483 U.S. at 875; Crawford, 372 F.3d at 1069-71 (Trott, J., concurring); see also Ewing v. California, 538 U.S. 11, 25-27 (2003); Parke v. Raley, 506 U.S. 20, 27 (1992) (\"States have a valid interest in deterring and segregating habitual criminals.\"). Thus, conditional releasees may claim \"only . . . conditional liberty properly dependent on observance of special parole restrictions\" that extend \"substantially beyond the ordinary restrictions imposed by law on an individual citizen.\" Morrissey, 408 U.S. at 478 \u0026 480 (1972); Scott, 524 U.S. at 365 (\"[T]he State accords a limited degree of freedom in return for the parolee's assurance that he will comply with the often strict terms and conditions of his release. In most cases, the State is willing to extend parole only because it is able to condition it upon compliance with certain requirements.\").\n\nThese restrictions generally \"are meant to assure that the [conditional release term] serves as a period of genuine rehabilitation and that the community is not harmed by the [releasee]'s being at large. These same goals require and justify the exercise of supervision to assure that the restrictions are in fact observed.\" Griffin, 483 U.S. at 875 (internal citations omitted). And whether they are initially legitimated as furthering a \"special need,\" id. at 873-74, or recognized merely as serving the government's \" 'overwhelming interest' in ensuring that a [releasee] complies with those requirements and is returned to prison if he fails to do so,\" Scott, 524 U.S. at 365 (quoting Morrissey, 408 U.S. at 477), once such strictures are imposed and clearly noticed, they dramatically alter the relationship between the releasee and the government. For at bottom, they render all kinds of individual choices- choices that otherwise would be privately considered, privately determined, and privately undertaken-matters of legitimate government concern and investigation. As we recognized nearly thirty years ago:\n\nThe purposes of the parole system give the parole authorities a special and unique interest in invading the privacy of parolees under their supervision. In order to fulfill his dual responsibilities for helping the parolee to reintegrate into society and evaluating his progress, and for preventing possible further antisocial or criminal conduct by the parolee, it is essential that the parole officer have a thorough understanding of the parolee and his environment, including his personal habits, his relationships with other persons, and what he is doing, both at home and outside it. It is equally important that this information be kept up to date. . . . Many of the[ accompanying] restrictions relate to matters which the [releasee] might otherwise be entitled to preserve as private.\n\nLatta v. Fitzharris, 521 F.2d 246, 249 (9th Cir. 1975) (en banc) (plurality opinion).\n\nThese transformative changes wrought by a lawful conviction and accompanying term of conditional release are well-recognized by the Supreme Court, which often has noted that conditional releasees enjoy severely constricted expectations of privacy relative to the general citizenry-and that the government has a far more substantial interest in invading their privacy than it does in interfering with the liberty of law-abiding citizens. See, e.g., Knights, 534 U.S. at 119-20; Ferguson, 532 U.S. at 79 n.15; Griffin, 483 U.S. at 874-75; see also Crawford, 372 F.3d at 1071 (Trott, J., concurring) (\"Parolees . . . are a discrete group that are a demonstrable menace to the safety of the communities into which they are discharged. Parolees have demonstrated by their adjudicated criminal conduct a capacity and willingness to commit crimes serious enough to deprive them of liberty. They have not yet finished serving their sentences in connection with which they do not enjoy a presumption of innocence. Moreover, their collective behavior while on parole demonstrates the truth of the axiom that past behavior is the best predictor of future behavior.\").\n\n[12] We believe that such a severe and fundamental disruption in the relationship between the offender and society, along with the government's concomitantly greater interest in closely monitoring and supervising conditional releasees, is in turn sufficient to sustain suspicionless searches of his person and property even in the absence of some non-law enforcement \"special need\"-at least where such searches meet the Fourth Amendment touchstone of reasonableness as gauged by the totality of the circumstances.\n\nLet us be clear: Our holding in no way intimates that conditional releasees' diminished expectations of privacy serve to extinguish their ability to invoke the protections of the Fourth Amendment's guarantee against unreasonable searches and seizures. Where a given search or class of searches cannot satisfy the traditional totality of the circumstances test, a conditional releasee may lay claim to constitutional relief-just like any other citizen. Further, and without regard to the outcome of any such analysis, we reiterate Judge Trott's recent observation that conditional releasees likewise \"retain[ ] a right of privacy against government searches and seizures that are arbitrary, a right of privacy against searches and seizures that are capricious, and a right of privacy against searches and seizures that are harassing.\" Crawford, 372 F.3d at 1072 (Trott, J., concurring); cf. Skinner, 489 U.S. at 621-22 (noting that \"[a]n essential purpose of a warrant requirement is to protect privacy interests by assuring citizens subject to a search or seizure that such intrusions are not the random or arbitrary acts of government agents,\" and explaining that no warrant was required in the case at bar in part due to \"the standardized nature of the tests and the minimal discretion vested in those charged with administering the[m]\").\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e These safeguards amply shelter the conditional releasee's residual expectation of, and entitlement to, privacy.\n\nWe also wish to emphasize the limited nature of our holding. With its alarmist tone and obligatory reference to George Orwell's 1984, Judge Reinhardt's dissent repeatedly asserts that our decision renders every person in America subject to DNA sampling for CODIS purposes, including \"attendees of public high schools or universities, persons seeking to obtain drivers' licenses, applicants for federal employment, or persons requiring any form of federal identification, and those who desire to travel by airplane,\" post at 11480-81, \"political opponents,\" \"disfavored minorities,\" post at 11487,\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e \"all newborns,\" post at 11489, \"passengers of vehicles,\" \"arrestees,\" post at 11515-no, really, \"the entire population.\" Post at 11489. Nothing could be further from the truth-and we respectfully suggest that our dissenting colleague ought to recognize the obvious and significant distinction between the DNA profiling of law-abiding citizens who are passing through some transient status (e.g., newborns, students, passengers in a car or on a plane) and lawfully adjudicated criminals whose proven conduct substantially heightens the government's interest in monitoring them and quite properly carries lasting consequences that simply do not attach from the simple fact of having been born, or going to public school, or riding in a car. See also Green, 354 F.3d at 679-81 (Easter-brook, J., concurring).\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\n\nB.\n\n[13] With this framework in mind, we can now appraise the reasonableness of the federal DNA Act's compulsory DNA profiling of qualified federal offenders. In evaluating the totality of the circumstances, we must balance the degree to which DNA profiling interferes with the privacy interests of qualified federal offenders against the significance of the public interests served by such profiling. See Brown v. Texas, 443 U.S. 47, 50-51 (1979).\n\n1.\n\n[14] As we have recognized, supra at 11439 n.15, compulsory blood tests implicate the individual's interest in bodily integrity-\"a cherished value of our society.\" Schmerber v. California, 384 U.S. 757, 772 (1966). Nonetheless, it is firmly established that \"the intrusion occasioned by a blood test is not significant, since such 'tests are a commonplace in these days of periodic physical examinations and experience with them teaches that the quantity of blood extracted is minimal, and that for most people the procedure involves virtually no risk, trauma, or pain.' \" Skinner, 489 U.S. at 625 (quoting Schmerber, 384 U.S. at 771); see also Winston, 470 U.S. at 762 (observing \"society's judgment that blood tests do not constitute an unduly extensive imposition on an individual's personal privacy and bodily integrity\"); Yin v. California, 95 F.3d 864, 870 (9th Cir. 1996) (Reinhardt, J.) (\"In today's world, a medical examination that does not include either a blood test or urinalysis would be unusual.\"). Indeed, the Supreme Court observed nearly 50 years ago that \"[t]he blood test procedure has become routine in our everyday life. It is a ritual for those going into the military service as well as those applying for marriage licenses. Many colleges require such tests before permitting entrance and literally millions of us have voluntarily gone through the same . . . routine in becoming blood donors.\" Breithaupt v. Abram, 352 U.S. 432, 436 (1957). For parolees and supervised releasees especially -individuals who while in custody have been lawfully subject to much more severe intrusions of their corporeal privacy than a sterile blood draw conducted by a trained medical professional, and who therefore leave prison with substantially reduced sensitivities to such exposure-the DNA Act's compelled breach of their bodily integrity is all the less offensive. See Bell v. Wolfish, 441 U.S. 520, 558-60 \u0026 n. 39 (1979) (upholding suspicionless body cavity searches of inmates during which male inmates \"must lift [their] genitals and bend over to spread [their] buttocks for visual inspection [and wherein t]he vaginal and anal cavities of female inmates also are visually inspected\").\n\n[15] At the same time, the DNA profile derived from the defendant's blood sample establishes only a record of the defendant's identity-otherwise personal information in which the qualified offender can claim no right of privacy once lawfully convicted of a qualifying offense (indeed, once lawfully arrested and booked into state custody). For, as we recognized in Rise, \"[o]nce a person is convicted of one of the felonies included as predicate offenses under [the DNA Act], his identity has become a matter of state interest and he has lost any legitimate expectation of privacy in the identifying information derived from blood sampling.\" 59 F.3d at 1560; see also Groceman, 354 F.3d at 413-14; Jones, 962 F.2d at 306-07.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\n\nBoth Kincade and his supporting amici passionately protest that because the government does not destroy blood samples drawn for DNA profiling and because such samples therefore conceivably could be mined for more private information or otherwise misused in the future, any presently legitimate generation of DNA profiles is irretrievably tainted by the prospect of far more consequential future invasions of personal privacy.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e Judge Reinhardt's dissent likewise maintains that in light of the \"nightmarish\" possibilities CODIS portends, post at 11493, we must act immediately to halt the program- before the wolf enters the fold, rather than after. Post at 11481.\n\n[16] The concerns raised by amici and by Judge Reinhardt in his dissent are indeed weighty ones, and we do not dismiss them lightly. But beyond the fact that the DNA Act itself provides protections against such misuse,\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e our job is limited to resolving the constitutionality of the program before us, as it is designed and as it has been implemented.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e In our system of government, courts base decisions not on dramatic Hollywood fantasies, cf. post at 11493, but on concretely particularized facts developed in the cauldron of the adversary process and reduced to an assessable record. If, as Kincade's aligned amici and Judge Reinhardt's dissent insist, and when, some future program permits the parade of horribles the DNA Act's opponents fear-unregulated disclosure of CODIS profiles to private parties, genetic discrimination, state-sponsored eugenics, and (whatever it means) the use of CODIS somehow \"quite literally, to eliminate political opposition,\" post at 11487-we have every confidence that courts will respond appropriately. As currently structured and implemented, however, the DNA Act's compulsory profiling of qualified federal offenders can only be described as minimally invasive-both in terms of the bodily intrusion it occasions, and the information it lawfully produces.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e\n\n2.\n\n[17] In contrast, the interests furthered by the federal DNA Act are undeniably compelling. By establishing a means of identification that can be used to link conditional releasees to crimes committed while they are at large, compulsory DNA profiling serves society's \" 'overwhelming interest' in ensuring that a parolee complies with th[ ]e requirements [of his release] and is returned to prison if he fails to do so.\" Scott, 524 U.S. at 365 (quoting Morrissey, 408 U.S. at 483). The deterrent effect of such profiling,\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e see, e.g., Roe, 193 F.3d at 79; Rise, 59 F.3d at 1561 \u0026 n.4; Jones, 962 F.2d at 311, similarly fosters society's enormous interest in reducing recidivism. As Judge Trott highlighted in his Crawford concurrence, rates of re-arrest among parolees and probationers are astounding, 372 F.3d at 1069-70 (Trott, J., concurring); the Supreme Court, too, has frequently stressed the pressing need to reduce recidivism among the offender population. See, e.g., Ewing, 538 U.S. at 25-27; Smith v. Doe, 538 U.S. 84, 103 (2003); McKune, 536 U.S. at 32-33; Knights, 534 U.S. at 120; Griffin, 483 U.S. at 875, 876, 878, 880. Finally, by contributing to the solution of past crimes, DNA profiling of qualified federal offenders helps bring closure to countless victims of crime who long have languished in the knowledge that perpetrators remain at large. Together, the weight of these interests is monumental.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e\n\nThese interests also are intimately related to the core purposes of conditional release: rehabilitating convicted offenders and sheltering society from future victimization. See Knights, 534 U.S. at 119; Scott, 524 U.S. at 365; Griffin, 483 U.S. at 875 \u0026 880; see also United States v. Jackson, 189 F.3d 820, 824 (9th Cir. 1999). As a deterrent, DNA profiling can help to steer conditional releasees toward law-abiding lives as productive members of our society, fostering the rehabilitative goal of our systems of conditional release. Such profiling likewise helps protect the society into which offenders are conditionally released by reducing crime attributable to the operation of limited release programs like probation and parole. Rise, 59 F.3d at 1561. And by laying a foundation for solving those crimes that are not successfully deterred by the collection of DNA profiles, the DNA Act both provides a means to monitor such individuals' compliance with the terms of their release-see supra at 11432-33 n.3-and helps minimize the pain and suffering recidivist offenders sow in our communities.\n\n3.\n\n[18] In light of conditional releasees' substantially diminished expectations of privacy, the minimal intrusion occasioned by blood sampling, and the overwhelming societal interests so clearly furthered by the collection of DNA information from convicted offenders, we must conclude that compulsory DNA profiling of qualified federal offenders is reasonable under the totality of the circumstances.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e There-fore, we today realign ourselves with every other state and federal appellate court to have considered these issues- squarely holding that the DNA Act satisfies the requirements of the Fourth Amendment.\n\nIV.\n\n[19] Because compulsory DNA profiling conducted pursuant to the federal DNA Act would have occasioned no violation of Kincade's Fourth Amendment rights, the judgment and accompanying sentence of the district court are\n\nAFFIRMED.\n\nGOULD, Circuit Judge, concurring:\n\nI agree with the majority that Thomas Kincade's conviction should be affirmed. I write separately because I believe that we should affirm under a \"special needs\" theory rather than the totality of the circumstances theory. I further pose a caveat on the limits of what we can properly decide today.\n\nI.\n\nThe majority affirms based on extension of United States v. Knights, 534 U.S. 112 (2001), and does not reach the issue whether the Supreme Court's \"special needs\" doctrine sustains the search. I would affirm based on the \"special needs\" of monitoring convicts on supervised release and deterring their possible recidivism. Each method of analysis has support in Supreme Court doctrine and support from our sister circuits. But in my view it would be better to follow the special needs approach because with it extant precedents control. Griffin v. Wisconsin, 483 U.S. 868 (1987), held that state parolees may be subject to a warrantless search based on a special needs theory. Ferguson v. City of Charleston, 532 U.S. 67, 81 n.15 (2001) harmonized Griffin in the context of a suspicionless search. Thus the Supreme Court has shown that the special needs doctrine permits the search in this case.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e\n\nThe deterrent felt by a person on supervised release who must participate in the DNA program and the CODIS database serves the special needs of a supervised release system. Stated succinctly, the DNA program is likely to deter future crime of the supervised releasee because it increases the chance that a person on supervised release will be caught if he or she commits a new crime. Stated another way, the Supreme Court's reluctance to apply special needs analysis to endorse warrantless searches aimed at general law enforcement cautions against applying this doctrine to general law enforcement aimed at past crime. It does not mean that special needs analysis cannot be applied to DNA collection from those on supervised release with the purposes to deter future crime, to give a tool to avoid consecutive or repetitive crime on supervised release, and, when such crime occurs, to let law enforcement act to return the releasee to prison custody as soon as practicable. These goals lie at the heart of supervised release, which properly aims at reintegration of the releasee through deterrence. This special need of supervised release looks forward to crime in the future while the felon is on supervised release; any use of the CODIS database to solve past crimes is incidental to the special and forward-looking penalogical need that justifies the program.\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e That such deterrence is a special need permitting suspicionless searches of parolees has been cogently advanced by Judge Trott in his concurring opinion in United States v. Crawford, 372 F.3d 1048, 1066-1077 (9th Cir. 2004) (Trott, J., concurring). As applied in the context of DNA extraction, this theory of special need has been adopted by three of our sister circuits. See Green v. Berge, 354 F.3d 675, 679 (7th Cir. 2004); United States v. Kimler, 335 F.3d 1132, 1146 (10th Cir. 2003); Roe v. Marcotte, 193 F.3d 72, 79-82 (2d Cir. 1999); see also Opinion of Judge O'Scannlain at 11455-56 (listing other courts that have reached this conclusion).\n\nFinding these authorities most persuasive, I reach the same conclusion as the majority, and I concur in the judgment.\n\nII.\n\nI also write to emphasize what we do not decide today. Thomas Kincade is now on supervised release, and was in that status when his DNA was demanded. While he is on supervised release, there is a special need to have his DNA extracted and stored in the CODIS database. This serves the penalogical purpose of deterring him from committing a new crime while on supervised release, and of course it will also aid in catching him if he does so notwithstanding. What we do not have before us is a petitioner who has fully paid his or her debt to society, who has completely served his or her term, and who has left the penal system. In that case, the special need that I identify to maintain the DNA is gone, but the record of the felon's DNA in the CODIS database is not. Once those previously on supervised release have wholly cleared their debt to society, the question may be raised, \"Should the CODIS entry be erased?\" Although it might seem counter-intuitive to law enforcement that a record once gleaned might be lost, there is a substantial privacy interest at stake.\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e In a proper case where this issue is presented, we would presumably need to weigh society's benefit from retention of the DNA records of a felon against that person's right, in a classical sense, to privacy. See generally Samuel Warren \u0026 Louis Brandeis, The Right to Privacy, 4 Harv. L. Rev. 193 (1890). In our age in which databases can be \"mined\" in a millisecond using super-fast computers, in which extensive information can, or potentially could, be gleaned from DNA (even the \"junk\" DNA currently used), and in which this data can easily be stored and shared by governments and private parties worldwide, the threat of a loss of privacy is real, even if we cannot yet discern the full scope of the problem. A related concern was voiced more than two decades ago, long before the advent of DNA profiling. See generally Arthur R. Miller, The Assault on Privacy 24-54 (1971). With monumental increases in technologies, Professor Miller's alarm about technology's assault on privacy must be seriously pondered. A nice question, if and when properly presented, would be whether DNA samples, though lawfully obtained from a felon on supervised release, may properly be retained by the government after the felon has finished his or her term and has paid his or her debt to society.\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e Once the special need for the DNA sample has gone, does the government have sufficient reason to retain the sample in order to overcome the felon's privacy interest? Kincade's case does not call upon us to answer this question. I express no view on the question of the future retention of a felon's DNA after supervised release is terminated, nor do I understand the majority opinion to express any view on this question.\n\nREINHARDT, Circuit Judge, with whom PREGERSON, KOZINSKI, and WARDLAW, Circuit Judges, join, dissenting:\n\n\"They that can give up essential liberty to obtain a little safety deserve neither liberty nor safety.\" BENJAMIN FRANKLIN, HISTORICAL Review of PENNSYLVANIA (1759).\n\nToday this court approves the latest installment in the federal government's effort to construct a comprehensive national database into which basic information concerning American citizens will be entered and stored for the rest of their lives - although no majority exists with respect to the legal justification for this conclusion.\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e My colleagues claim to authorize merely the \"compulsory DNA profiling of certain conditionally-released federal offenders,\" as authorized by the DNA Analysis Backlog Elimination Act of 2000 (\"DNA Act\"), Pub. L. No. 106-546, 114 Stat. 2726 (2000). We would be lucky indeed if it were possible to so limit the effect of their opinions. For, under the rationales they espouse, especially the plurality's, all Americans will be at risk, sooner rather than later, of having our DNA samples permanently placed on file in federal cyberspace, and perhaps even worse, of being subjected to various other governmental programs providing for suspicionless searches conducted for law enforcement purposes.\n\nNeither Supreme Court precedent nor any established rule of Fourth Amendment law supports today's plurality or concurring opinion. Never has the Court approved of a search like the one we confront today: a programmatic search designed to produce and maintain evidence relating to ordinary criminal wrongdoing, yet conducted without any level of individualized suspicion. Never has the Court approved of the government's construction of a permanent governmental database built from general suspicionless searches and designed for use in the investigation and prosecution of criminal offenses.\n\nThe approval of such a program carries with it all of the dangers inherent in allowing the government to collect and store information about its citizens in a centralized place. J. Edgar Hoover terrorized leaders of the civil rights movement by exploiting the information he collected in his files. Our government's surveillance and shameful harassment of suspected communists and alleged communist-sympathizers in the middle of the twentieth century depended largely on the centralization of information collected about countless numbers of non-communist members of our citizenry - often by means that violated the Fourth Amendment. The same was true of the Palmer Raids a few decades earlier and of our roundup of Japanese Americans and their placement in internment camps during World War Two. See generally Daniel J. Solove, Digital Dossiers and the Dissipation of Fourth Amendment Privacy, 75 S. Cal. L. Rev. 1083 (2002).\n\nEven governments with benign intentions have proven unable to regulate or use wisely vast stores of information they collect regarding their citizens. The problem with allowing the government to collect and maintain private information about the intimate details of our lives is that the bureaucracy most often in charge of the information \"is poorly regulated and susceptible to abuse. This [ ] has profound social effects because it alters the balance of power between the government and the people, exposing individuals to a series of harms, increasing their vulnerability and decreasing the degree of power that they exercise over their lives.\" Id. at 1105. To allow such information to be collected through the compulsory extraction of blood from the bodies of non-consenting Americans runs contrary to the values on which this country was founded. My colleagues who endorse the judgment do so despite the fact that the search regime they approve, and the manner in which they approve it, encourages the very centralization of government authority that has repeatedly resulted in the sacrifice of our liberties in the name of law enforcement. Proper attention to constitutional doctrine and history would have led to a contrary result.\n\nTo justify the suspicionless searches authorized by the DNA Act, the plurality sweeps away the traditional Fourth Amendment requirement that law enforcement officials conduct searches only when predicated on some level of suspicion that the individual being searched has committed a crime. In place of this time-honored principle, the plurality has employed an opaque \"totality of the circumstances\" test. See ante at 11457. It should come as no shock that under this malleable standard, my colleagues have concluded that the forcible extraction of blood samples from probationers and parolees, and the permanent maintenance of profiles constructed from those samples in a federal databank, is constitutionally reasonable. The \"totality\" of the circumstances relied upon by the plurality is as follows: Those who commit crimes have reduced expectations of privacy, ante at 11462-63, and, because the forcible extraction of blood is a constitutionally insignificant invasion of privacy, ante at 11465-66, and the weight of the government interest in DNA profiling \"is monumental,\" ante at 11469, suspicionless searches are constitutionally reasonable.\n\nUnder the test the plurality employs, any person who experiences a reduction in his expectation of privacy would be susceptible to having his blood sample extracted and included in CODIS - attendees of public high schools or universities, persons seeking to obtain drivers' licenses, applicants for federal employment, or persons requiring any form of federal identification, and those who desire to travel by airplane, to name just a few. Already, all members of the Armed Forces must submit to the involuntary extraction of blood for the purpose of providing DNA samples. Indeed, given the \"monu-mental\" government interest and the \"insignificant\" invasion of privacy described by the plurality, it is difficult to imagine that the balancing of interests it then performs would not justify the government's including data regarding all Americans in the system regardless of the level of the expectation of privacy they might possess. This is not what the Framers of our Constitution intended.\n\nThe sixth vote for the judgment is based on a narrower and far different legal theory - the more respectable \"special needs\" doctrine. Unfortunately, my respected colleague who opts for the special needs standard obliterates the distinction between law enforcement and non-law enforcement purposes and in so doing undermines the protections the Fourth Amendment is designed to afford, almost to the same extent as those in the plurality.\n\nThomas Jefferson once warned that \"[t]he time to guard against corruption and tyranny is before they shall have gotten hold of us. It is better to keep the wolf out of the fold, than to trust to drawing his teeth and talons after he shall have entered.\" THOMAS JEFFERSON, NOTES ON THE STATE OF VIRGINIA 121 (William Peden ed., 1955). The plurality has failed to heed this warning, and instead opens the door to multifarious law enforcement programs involving suspicionless searches by employing a legal standard that imposes no significant limits on arbitrary and invasive government actions; in effect, the plurality simply asks us to trust those in power. The rationale employed in the concurring opinion, while more obedient to traditional legal concepts, would in the end likely result in a similar elimination of constitutional restraints on the excessive exercise of governmental power. Because I cannot join in my colleagues' willingness to accept so dangerous and drastic a limitation on our individual liberties, I respectfully dissent.\n\nI. The Scope of the DNA Act and the Combined DNA Index System\n\nThe federal program which for all practical purposes is approved today is not nearly as limited as the one initially enacted by Congress. The federal DNA database at issue in this litigation, the Combined DNA Index System (\"CODIS\"),\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e contains more information about vastly more individuals than it did when it was first created. A brief examination of the origins and development of CODIS helps demonstrate why further limitless expansion of the scope and reach of this nationwide database is inevitable, and helps explain why I find it so unlikely that today's decision is good for \"this day and train only.\" Smith v. Allwright, 321 U.S. 649, 669 (1944) (Roberts, J., dissenting).\n\nA. The Expansion of CODIS\n\nEven a brief glance at the manner in which the federal government has developed and expanded CODIS makes plain that the scope of the system is broad and that future growth is inevitable. CODIS began in 1990 as a pilot program serving just 14 state and local laboratories. See CODIS Mission Statement and Background. Its enlargement began shortly thereafter and has not stopped since. Congress made CODIS a program with nationwide reach in the 1994 Violent Crime Control and Law Enforcement Act, which authorized the FBI to create a national database of DNA samples collected from crime scenes and crime victims, convicted offenders, and unidentified human remains. See DNA Analysis Backlog Elimination Act of 2000, H.R. Rep. No. 106-900 (I), at 8 [hereinafter DNA Act House Report]. It was not until passage of the Anti-Terrorism and Effective Death Penalty Act (\"AEDPA\"), Pub. L. 104-132, 110 Stat. 1214 (1996), however, that Congress authorized the FBI to \"expand CODIS to include federal crimes.\" DNA Act House Report, at 8. Despite this legislation, the Department of Justice concluded that Congress had not yet provided the executive branch with sufficient legal authority to collect DNA samples from federal offenders. Consequently, Congress enacted the DNA Act of 2000, which states that \"the probation office responsible for the supervision under Federal law of an individual on probation, parole, or supervised release shall collect a DNA sample from each individual who is, or has been, convicted of a qualifying Federal offense.\" 42 U.S.C. § 14135a(a)(2).\n\nThe DNA Act requires samples\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e from all individuals who have been convicted of \"certain federal crimes.\" See ante, at 11431 \u0026 n.1. And, as the plurality rightly notes, the DNA Act of 2000 contained a narrow list of qualifying offenses, including crimes such as arson, voluntary manslaughter, and murder. What the plurality and concurring opinion fail to mention, however, is that the most recent list of qualifying offenses, contained at 28 C.F.R. § 28.2, includes a laundry list of federal crimes that is vastly more expansive than the list approved by the 2000 DNA Act.\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e\n\nThe current list of qualifying crimes is so broad and eclectic that it is difficult to name, absent an intimate familiarity with the intricacies of the federal criminal code, any discernible categories of criminal activities that remain beyond the reach of the DNA Act. The list of qualifying offenses includes crimes compiled from more than 200 separate sections of the United States Code, resulting in countless possible permutations of qualifying crimes. For example, one's DNA could be stored on file with the federal government forever upon a conviction for \"willfully injure[ing] or commit[ting] any depredation against any property of the United States,\" such as spray painting graffiti on a government building or tearing apart a $1 bill in protest against a perceived arbitrary governmental policy. See 18 U.S.C. § 1361. Similarly, an individual might have a DNA sample forcibly taken if he interferes with a mailman in the course of his duties, or forcibly opposes a federal employee on account of his performance of official duties. See 18 U.S.C. § 111(a)(1) (making it illegal for any person to, inter alia, oppose or interfere with any officer or employee of the United States \"while engaged in or on account of the performance of official duties\"); see also 18 U.S.C. § 2116 (criminalizing the interference with any postal clerk in the discharge of his duties in connection with a postal car or steamboat). If an owner of a boat destroys his vessel in order to obtain an insurance payment, he may be forced to provide a DNA sample, see 18 U.S.C. § 2272, and any non-owner of a boat who \"maliciously cuts, spoils, or destroys any cordage, cable, buoys, buoy rope, head fast, or other fast, fixed to the anchor or moorings belonging to any vessel\" will suffer a similar fate, 18 U.S.C. § 2276; cf. 18 U.S.C. § 2281 (criminalizing violence against maritime fixed platforms).\n\nIf the above examples do not sufficiently demonstrate that the federal government has not simply chosen to collect DNA samples from the most hardened criminals or most likely recidivists, consider the following non-exhaustive sample of enumerated crimes listed at 28 C.F.R. § 28.2: resisting arrest, 18 U.S.C. § 2231; various forms of \"civil disorder,\" 18 U.S.C. § 231; participation, promotion, or incitement of a riot, 18 U.S.C. § 2101; advocating the overthrow of the United States government, 18 U.S.C. § 2385; interference with access to reproductive health service facilities, 18 U.S.C. § 248; interference with an aviation flight crew member or flight attendant, 49 U.S.C. § 46504; interference with or intimidation of federal meat, poultry, or poultry products inspectors, 21 U.S.C. § 461(c), 675; the harming of any animal used by law enforcement officials, 18 U.S.C. § 1368; the receipt of kick-backs from public works employees, 18 U.S.C. § 874; personal theft and robbery, 18 U.S.C. §§ 2111-12; conspiracies \"to threaten, or intimidate any person,\" 18 U.S.C. § 241; interference with the right to vote, 18 U.S.C. § 594; attempts to intimidate or command any employee of the federal government to engage or not engage in political activity, 18 U.S.C. § 610; various forms of extortion and \"mailing threatening communications,\" and \"making extortionate extensions of credit\" or collecting extensions of credit by \"extortionate means,\" 18 U.S.C. §§ 875-78, 892, 894; being a felon - or a member of the Armed Forces who has been dishonorably discharged - in possession of a firearm, 18 U.S.C. § 922(g); computer fraud, 18 U.S.C. § 1030; attempted manslaughter, 18 U.S.C. § 1113; incest committed by an Indian in Indian country, 18 U.S.C. § 1153; the use of a hazardous or injurious device on federal land or an Indian reservation, 18 U.S.C. § 1864; tampering with a witness, 18 U.S.C. § 1512; piracy under the law of nations, 18 U.S.C. § 1651; the obstruction or delay of the movement of any article or commodity in commerce, 18 U.S.C. § 1951; various racketeering crimes, 18 U.S.C. §§ 1952(a)(2), 1958-59, 1962; breaking and entering into a post office, 18 U.S.C. § 2115; cruelty to seamen on a vessel in the jurisdiction of the United States, 18 U.S.C. § 2191; \"Shanghaiing sailors\" by force or threat, 18 U.S.C. § 2194; misuse of a vessel by a person in command of the vessel within the territorial waters of the United States, 18 U.S.C. § 2274; tampering with, or breaking and entering into, another person's vessel, 18 U.S.C. §§ 2275-76; destruction or removal of property to prevent seizure, 18 U.S.C. § 2232(a); any action designed to impair a federal court's continuing in rem jurisdiction over a particular property, 18 U.S.C. § 2232(b); production of sexually explicit depictions of minors, 18 U.S.C. § 2260; the transfer of any obscene material to a minor, 18 U.S.C. § 1470; interstate stalking or violation of a protective order, 18 U.S.C. §§ 2261A, 2262; persuading or enticing any individual to travel across state lines to engage in prostitution, 18 U.S.C. § 2422; importation of any alien to the United States for any immoral purpose, 8 U.S.C. § 1328; and the removal or alteration of the serial number on a firearm, or the receipt of a firearm with a removed or altered serial number, 26 U.S.C. § 5861. The Act even applies to several sections of the federal criminal code that have long been repealed. See, e.g., 18 U.S.C. §§ 2031, 2032. And, in case the provided list is insufficient, the DNA Act is also triggered by the catchall \"attempt or conspiracy\" provision, which covers \"[a]ny offense that is an attempt or conspiracy to commit any of the foregoing offenses.\" 28 C.F.R. § 28.2(I).\n\nThe power to assemble a permanent national DNA database of all offenders who have committed any of the crimes listed above has catastrophic potential. If placed in the hands of an administration that chooses to \"exalt order at the cost of liberty,\" Whitney v. California, 274 U.S. 357, 374 (1927) (Brandeis, J., dissenting), the database could be used to repress dissent or, quite literally, to eliminate political opposition. Many of the qualifying offenses in the DNA Act are crimes that involve conduct closely related to the exercise of First Amendment rights to free speech and assembly, such as incitement, civil disorder, and the various forms of \"interference\" crimes listed above. Other offenses are so vaguely or broadly described that they cover almost any conduct that can be described as unlawful. Even if the list of qualifying offenses in the DNA Act remains static, future governments might use the Act's already wide reach to monitor, intimidate, and incarcerate political opponents and disfavored minorities.\n\nGiving us a concrete sense of how broad the reach of the current Act is, the plurality opinion notes that CODIS currently contains over 1.6 million DNA profiles drawn from offenders. But that population is certain to rise even without statutory assistance. With nearly 6.9 million individuals under some form of correctional supervision in recent years, see Lauren E. Glaze \u0026 Seri Palla, U.S. Dep't of Justice, Bureau of Justice Statistics, Probation and Parole in the United States, 2003, available at http://www.ojp.usdoj.gov/bjs/pub/pdf/ ppus03.p df, CODIS has the immediate potential for exponential growth. It is no secret, incidentally, that minorities are disproportionately represented in this population and that many whites receive no sentence at all when they commit offenses for which blacks or Hispanics receive prison time or probation. See generally MARC MAUER, RACE TO INCARCERATE (1999).\n\nCODIS' potential for expansion, however, is not limited to the population of convicted federal offenders. Even before passage of the 2000 DNA Act, all fifty states had adopted some form of legislation mandating the collection of DNA samples for inclusion in CODIS. See Nancy Beatty Gregoire, Federal Probation Joins the World of DNA Collection, 66 FED. PROBATION 30, 30 (2002). Today, Mississippi is the only state that does not provide its DNA profiles for inclusion in the national database, NDIS, via CODIS. See Federal Bureau of Investigation, NDIS Participants, available at http://www.fbi.gov/hq/lab/codis/partstates.htm (last visited June 20, 2004). The FBI has noted approvingly that the states are \"rapidly expanding the scope and size of their CODIS databases\" and has stated its hope that \"eventually, all 50 states will include all felony offenses\" in their lists of qualifying crimes. Federal Bureau of Investigation, The FBI's Combined DNA Index System Program: A Federal/State Partnership Fighting Violent Crime, available at http://www.fbi.gov/hq/lab/codis/ brochure.pdf (last visited June 20, 2004).\n\nRecent legislation in several states has authorized the federal government to store and access DNA profiles of individuals who have been convicted of run-of-the-mill non-violent crimes such as felonious possession of food stamps, see Br. of Amicus Curiae Public Defender Service for the District of Columbia [hereinafter: PDS Brief], at 6 (citing Ala. Code §§ 36-18-24, 13A-9-91 (2003)). CODIS also contains profiles of individuals who have been convicted of no crime whatsoever but have merely had the misfortune of being arrested in Louisiana, Texas, or Virginia. See id. at 7 (citing LA. REV. STAT. ANN. § 15:609(A) (West Supp. 2003); TEX. GOV'T CODE ANN. § 411.1471(a)(2) (West 2003); Va. St. § 19.2-310.2:1 (2003)). California will likely be next in this group - a popular and well-funded ballot initiative is on the November ballot that would expand the State's collection of DNA samples to include arrestees. See John Wildermuth, Proposition to Take DNA at Arrest Stirs Privacy Fears, S.F. CHRON., June 12, 2004, at A1. California's propositions frequently are emulated by other less imaginative jurisdictions.\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e If the expansion of the DNA Act's reach continues to follow its current trajectory, it will not be long before CODIS includes DNA profiles from misdemeanants, arrestees, and other suspected criminals throughout the nation. See Mark Hansen, DNA Dragnet, ABA JOURNAL, May 2004, at 43 (noting that Congress is soon likely to approve legislation authorizing DNA profiling of juvenile offenders and adult arrestees). And, once that step is made, there will undoubtedly be pressure to expand the database even further to include profiles of individuals who wish to obtain drivers licenses\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e or federal passports, applicants for federal jobs or admission to public universities, children who attend public elementary or secondary schools, all newborns, and ultimately, under the rationale adopted by the plurality, the entire population.\u003cspan class=\"fnref\"\u003e50\u003c/span\u003e The increasing use of DNA \"dragnets,\" in which police officers encourage all individuals in a particular community to provide DNA samples to local law enforcement officials in order to assist an ongoing criminal investigation despite the absence of any individualized suspicion, serves as a concrete example of the type of practices which may shortly become commonplace unless the gradual erosion of Fourth Amendment protections now set in place is reversed. See id. at 42-43 (noting that DNA dragnets have become increasingly common since the early 1990s and questioning the efficacy of these suspicionless searches). Unfortunately, given the plurality's ill-considered holding that the government interest is \"monumental\" and the infringement on privacy rights is minimal, that erosion is simply the beginning, not the end.\n\nB. Junk DNA and the Potential for Expansion\n\nCODIS's potential to expand is not confined to its likely future inclusion of more and more categories of persons to be subjected to DNA profiling. The system also has the ability to identify an increasing amount of information about each of its profiled subjects as our understanding of DNA continues to develop at lightning speed. The plurality is correct that the DNA profiles currently on file in CODIS are based on analyses of \"junk DNA.\" See ante at 11433-34. It takes comfort in the fact that scientists have long assumed that junk DNA is \"non-genic,\" that junk DNA samples taken contain only an identifying \"fingerprint,\" and nothing else. Id. That understanding of junk DNA has been disputed for some time. See Justin Gillis, Genetic Code of Mouse Published; Comparison With Human Genome Indicates \"Junk DNA\" May Be Vital, WASH. POST, Dec. 5, 2002, at A1 (noting that studies in 2002 revealed that junk DNA contains valuable information about how the body uses genes and that the \"instruction set [contained within junk DNA] is at least as big as the gene set, and probably bigger\"). Moreover, new discoveries are being made by the day that challenge the core assumption underlying junk DNA's name - regions of DNA previously thought to be \"junk DNA\" may be genic after all. See Clive Cookson, Regulatory Genes Found in \"Junk DNA\", FIN. TIMES, June 4, 2004, at 11; Function Found for Junk DNA, L.A. TIMES, June 5, 2003, at A14.\n\nThe fact that scientists currently lack the capacity to comprehend the full significance of the data stored within junk DNA samples is irrelevant. As Judge Gould notes in his concurrence, CODIS retains individual DNA profiles forever - even if convicted offenders have completed their debt to society. See Gould concurrence, at 11474. Moreover, the FBI encourages all laboratories to retain portions of the evidence samples they collect, see Federal Bureau of Investigation, Standards for Forensic DNA Testing Labs, at ¶ 7.2, available at http:/www.fbi. gov/hq/lab/codis/forensic.htm, affording the federal government the opportunity to re-test and re-analyze a virtually limitless number of samples as science progresses. See also PDS Brief, at 10 (\"The Act also neither requires, nor even recommends, destruction of samples after analysis.\"). Thus, as Judge Gould perceptibly observes, \"DNA stores and reveals massive amounts of personal, private data . . . and the advance of science promises to make stored DNA only more revealing in time.\" See Gould concurrence, at 11474 n.3.\n\nWhat type of information might the government eventually be able to extract from samples of junk DNA? Even today, as the plurality admits, \"DNA profiles derived by STR may yield probabilistic evidence of the contributor's race or sex.\" Ante at 11434. Yet that seems to be a dramatic understatement. The DNA \"fingerprint\" entered into CODIS likely has the potential to reveal information about an individual's \"genetic defects, predispositions to diseases, and perhaps even sexual orientation.\" See Harold J. Krent, Of Diaries and Data Banks: Use Restrictions Under the Fourth Amendment, 74 Tex. L. Rev. 49, 95-96 (1995) (cited in Br. of Amicus Curiae Protection \u0026 Advocacy, Inc., at 6 [hereinafter Protection \u0026 Advocacy Br.]). DNA analysis can reveal the presence of traits for thousands of known diseases, and countless numbers of diseases which are currently unknown. Protection \u0026 Advocacy Br., at 6. More ominously, some have predicted that the DNA profiles entered into CODIS will someday be able to predict the likelihood that a given individual will engage in certain types of criminal, or non-criminal but perhaps socially disfavored, behavior. Id. at 7-8 (citing studies raising the specter that DNA profiles might be used to study the links between particular genes and the propensity for social deviance).\n\nTo say that CODIS profiles might actually be used for such purposes is hardly far-fetched. A report by the Office of Technology Assessment [hereinafter: OTA] of the U.S. Congress has warned that the \"possibility exists to test DNA acquired specifically for identification purposes for disease information in a database,\" and worse, that \"[t]his option may become more attractive over time, especially as the number and types of probes for genetic orders increase.\" OTA, Genetic Witness: Forensic Uses of DNA Tests, July 1990, at 10 (cited in Protection \u0026 Advocacy Br. at 12-13). The pressures will only increase as CODIS produces more \"hits,\" linking unsolved crime scene evidence to newly entered DNA profiles. The permanent maintenance of this type of information about untold millions of Americans, if not indeed about all of our citizens, affords the government monumental powers to intrude into the core of those intimate concerns which lie at the heart of the right to privacy.\n\nIt is true, as some of my colleagues argue, that today we are confronted only with the question of the constitutionality of the program before us. Yet the current CODIS database, when it is compared to its modest beginnings, represents an\n\nalarming trend whereby the privacy and dignity of our citizens [are] being whittled away by [ ] imperceptible steps. Taken individually, each step may be of little consequence. But when viewed as a whole, there begins to emerge a society quite unlike any we have seen - a society in which government may intrude into the secret regions of man's life at will.\n\nOsborn v. United States, 385 U.S. 323, 343 (1966) (Douglas, J., dissenting). And when such a policy's constitutionality is determined merely by whether it seems reasonable under the \"totality of the circumstances,\" we all have reason to fear that the nightmarish worlds depicted in films such as Minority Report and Gattaca will become realities. This is especially the case given the potentially endless duration of our current \"war on terror,\" in the course of which we have already seen that war-time government seeks rapidly to expand its law enforcement powers and to increase its authority to take action against its citizens free from the ordinary rigors of judicial supervision. See, e.g., The Uniting and Strengthening America by Providing Appropriate Tools Required to Intercept and Obstruct Terrorism (USA-PATRIOT) Act, Pub. L. No. 107-56, 115 Stat. 272, §§ 206 (roving wiretaps), 215 (library records searches), 213 (\"sneak and peak\" searches) (2001). In such times, the pressures to expand CODIS further than ever before are certain to increase.\n\nII. The Reasonableness of the Search\n\nThe Fourth Amendment provides that \"[t]he right of the people to be secure in their persons, houses, papers, and effects, against unreasonable searches and seizures, shall not be violated, and no Warrants shall issue, but upon probable cause, supported by Oath or affirmation, and particularly describing the place to be searched, and the persons or things to be seized.\" U.S. CONST. amend. IV. \"The basic purpose of this Amendment, as recognized in countless decisions of this Court, is to safeguard the privacy and security of individuals against arbitrary invasions by governmental officials. The Fourth Amendment thus gives concrete expression to a right of the people which is basic to a free society.\" Camara v. Mun. Court of City and County of San Francisco, 387 U.S. 523, 528 (1967) (internal quotation marks omitted). To serve these purposes, the Constitution generally requires that searches be supported by probable cause and be approved prior to execution by a warrant issued by an impartial magistrate.\n\nA. The Constitution Requires Individualized Suspicion for Law Enforcement Searches\n\nThe Fourth Amendment's requirement that searches be supported by reasonable and particularized suspicion and a warrant is deeply rooted in our history. The historical background of that amendment demonstrates that our Framers' were steadfastly committed to the ideal that general warrants and searches conducted in the absence of reasonable and particular suspicion were intolerable in a democratic society. See Henry v. United States, 361 U.S. 98, 100 (1959). As the Henry Court noted,\n\nThe general warrant, in which the name of the person to be arrested was left blank, and the writs of assistance, against which James Otis inveighed, both perpetuated the oppressive practice of allowing the police to arrest and search on suspicion. Police control took the place of judicial control, since no showing of \"probable cause\" before a magistrate was required. The Virginia Declaration of Rights, adopted June 12, 1776, rebelled against that practice: \"That general warrants, whereby any officer or messenger may be commanded to search suspected places without evidence of a fact committed, or to seize any person or persons not named, or whose offence is not particularly described and supported by evidence, are grievous and oppressive, and ought not to be granted.\" The Maryland Declaration of Rights (1776), Art. XXIII, was equally emphatic.\n\nThat philosophy later was reflected in the Fourth Amendment. And as the early American decisions both before and immediately after its adoption show, common rumor or report, suspicion, or even \"strong reason to suspect\" was not adequate to support a warrant for arrest.\n\nId. at 100-102 (internal footnotes and citations omitted). \"[T]he particular way the Framers chose to curb the abuses of general warrants - and by implication, all general searches - was . . . to retain the individualized suspicion requirement contained in the typical general warrant, but to make that requirement meaningful and enforceable, for instance, by raising the required level of individualized suspicion to objective probable cause.\" Vernonia Sch. Dist. 47J v. Acton, 515 U.S. 646, 670 (1995) (O'Connor, J., dissenting) (emphasis in original).\n\nIn particular, the Framers feared blanket searches, whereby law enforcement officials would go door-to-door to conduct searches of every house in an area, regardless of suspicion. See id. (noting that the Framers may have considered blanket \"area searches\" even \"more worrisome than the typical general search\"). They knew that the use of suspicionless blanket searches and seizures for investigatory purposes would \"subject unlimited numbers of innocent persons to the harassment and ignominy incident to involuntary detention.\" Davis v. Mississippi, 394 U.S. 721, 726 (1969). It is plain that \"the Fourth Amendment was meant to prevent [such] wholesale intrusions upon the personal security of our citizenry.\" Id.\n\nFourth Amendment jurisprudence has evolved considerably over the years. The Court has recognized, for example, a number of reasonable departures from the warrant requirement and in some instance has relaxed the level of suspicion required before a law enforcement official may conduct a search. See, e.g., Terry v. Ohio, 392 U.S. 1, 24-25 (1968) (upholding \"stop and frisk\" searches upon reasonable suspicion as a general exception to the warrant requirement); Chimel v. California, 395 U.S. 752, 762 (1969) (upholding searches conducted incident to arrest as a general exception to the warrant requirement). The Court has even approved certain limited categories of non-law enforcement searches conducted in the absence of any suspicion at all. See, e.g., United States v. Ramsey, 431 U.S. 606, 616 (1977) (upholding suspicionless border searches \"pursuant to the longstanding right of the sovereign to protect itself by stopping and examining persons and property crossing into this country\"); New York v. Burger, 482 U.S. 691, 702 (1987) (upholding warrantless inspections of closely-regulated businesses as a special need beyond the need for normal law enforcement); Treasury Employees v. Von Raab, 489 U.S. 656 (1989) (upholding suspicionless drug testing of high-risk United States customs officials as a special need beyond the need for normal law enforcement); Chandler v. Miller, 520 U.S. 305, 323 (1997) (affirming, without deciding explicitly, the constitutionality of blanket suspicionless searches at airports and entrances to federal buildings when such searches are carefully calibrated to meet a \"substantial and real\" risk to public safety).\u003cspan class=\"fnref\"\u003e51\u003c/span\u003e However, the existence of the Warrant Clause in the Fourth Amendment demonstrates beyond doubt that there are some categories of searches \"for which individualized suspicion is nonnegotiable.\" Vernonia, 515 U.S. at 673 (O'Connor, J., dissenting). And whether one attempts to manufacture neat categories with clever names, see ante, at 11455-57, or groups them all into one large category of cases involving \"special needs,\"\u003cspan class=\"fnref\"\u003e52\u003c/span\u003e see Burger, 482 U.S. at 702, the overriding lesson is clear: when the government wishes to search individuals in order to obtain evidence of ordinary criminal wrongdoing, some level of individualized suspicion is required.\u003cspan class=\"fnref\"\u003e53\u003c/span\u003e\n\nB. The Special Needs Doctrine\n\nNever once in over two hundred years of history has the Supreme Court approved of a suspicionless search designed to produce ordinary evidence of criminal wrongdoing for use by the police.\u003cspan class=\"fnref\"\u003e54\u003c/span\u003e The constitutional tradition described in Henry has been reaffirmed over time, most prominently in recent years by the majority opinion in Indianapolis v. Edmond, 531 U.S. 32 (2000). In Edmond, the Court explained that\n\nA search or seizure is ordinarily unreasonable in the absence of individualized suspicion of wrongdoing. While such suspicion is not an \"irreducible\" component of reasonableness, we have recognized only limited circumstances in which the usual rule does not apply. For example, we have upheld certain regimes of suspicionless searches where the program was designed to serve special needs, beyond the normal need for law enforcement.\n\nId. at 37 (emphasis added); see also Vernonia, 515 U.S. at 671 (O'Connor, J., dissenting) (\"The view that mass, suspicionless searches, however evenhanded, are generally unreasonable remains inviolate in the criminal law enforcement context.\"). Edmond held that the only recognized exception to the general rule that searches be based on some type of individualized suspicion is when the search is justified by \"special needs, beyond the normal need for law enforcement,\" that render inoperative the Framers' historic mistrust of excessive power in the hands of the police. Edmond, 531 U.S. at 37. Therefore, no programmatic suspicionless search is reasonable unless the special need is \"divorced from the State's general interest in law enforcement.\" Ferguson v. City of Charleston, 532 U.S. 67, 79 (2001) (holding unconstitutional a state hospital program that tested pregnant women for drug use and then made available to the police the results of the tests on the grounds that the \"immediate objective of the [suspicionless] searches was to generate evidence for law enforcement purposes\").\n\nAlthough the \"general interest in law enforcement\" does not refer to every law enforcement objective, see, e.g., Illinois v. Lidster, 124 S.Ct. 885, 889 (2004) (upholding a suspicionless traffic stop under the special needs doctrine when the searches were designed to elicit information not about the occupants of the vehicle, \"but other individuals\"), valid special needs, as the Court most recently explained in Lidster, may not include efforts to obtain information related to possible crimes that the searched individual may have committed. See 124 S.Ct. at 889. Further support for this principle comes from the cases involving school drug testing. In those cases, the Court has drawn a clear distinction between searches conducted for the purpose of solving and/or punishing crime and those searches conducted without the involvement of punitive consequences or law enforcement officials. See, e.g., Bd. of Educ. v. Earls, 536 U.S. 822, 833 (2002) (emphasizing that \"the test results are not turned over to any law enforcement authority\"); see also Vernonia, 515 U.S. at 658 n.2 (stressing that the \"search here is undertaken for prophylactic and distinctly non-punitive purposes\") (emphasis added); Von Raab, 489 U.S. at 666 (noting that test results \"may not be used in a criminal prosecution of the employee without the employ-ee's consent\").\n\nIn short, the Court has never, ever, upheld a regime of suspicionless searches based on the government's desire to pursue ordinary law enforcement objectives. See Edmond, 531 U.S. at 41 (noting that the Court had \"never approved [a general program of suspicionless seizures] whose primary purpose was to detect evidence of ordinary criminal wrongdoing\"); see also Vernonia, 515 U.S. at 658; Von Raab, 489 U.S. at 679; Skinner, 489 U.S. at 620-621. To the contrary, the Court explicitly disapproved such searches in Edmond and explained that permitting suspicionless searches to be justified by \"the general interest in crime control\" would allow such intrusions to become \"a routine part of American life.\" 531 U.S. at 42.\u003cspan class=\"fnref\"\u003e55\u003c/span\u003e\n\nWhen we are evaluating the reasonableness of a suspicionless search, conducted pursuant to a programmatic search regime, \"we consider all the available evidence in order to determine the relevant primary purpose.\" Ferguson, 532 U.S. at 81. No matter what the \"ultimate goal\" of the statute itself may be, the question we ask is whether \"the immediate objective of the searches was to generate evidence for law enforcement purposes.\" Id. at 83 (emphasis in original).\u003cspan class=\"fnref\"\u003e56\u003c/span\u003e If so, the search is unconstitutional. See id. at 86; see also Lidster, 124 S.Ct. at 890.\n\nThe unequivocal purpose of the searches performed pursuant to the DNA Act is to generate the sort of ordinary investigatory evidence used by law enforcement officials for everyday law enforcement purposes. The government maintained from the outset of this litigation that the purpose of the searches authorized by the DNA Act is to \"help law enforcement solve unresolved and future cases.\"\u003cspan class=\"fnref\"\u003e57\u003c/span\u003e Moreover, it is plain that in passing the DNA Act, Congress's primary concern was the swift and accurate solution and prosecution of crimes as a general matter. The legislative history is littered with approving references to DNA evidence's ability to solve past and future crimes and thereby assist prosecutions. See, e.g., DNA Act House Report, at 8-11, 23-27, 32-36 (2000). For example, the Department of Justice argued to Congress that \"one of the underlying concepts behind CODIS is to create a database of convicted offender profiles and use it to solve crimes for which there are no suspects.\" Id. at 27. Members of Congress made similar arguments. See 146 CONG. REC. S11645-02, at S11647 (daily ed. Dec. 6, 2000) (arguing that the purpose of adding DNA profiles into CODIS is to \"solve crimes and prevent further crimes\") (statement of Sen. Leahy); 146 CONG. REC. H8572-02, at H8575-6 (daily ed. Oct. 2, 2000) (statement of Rep. Canady) (\"The purpose of [CODIS] is to match DNA samples from crime scenes where there are no suspects with the DNA of convicted offenders. Clearly, the more samples we have in the system, the greater the likelihood we will come up with matches and solve cases.\").\u003cspan class=\"fnref\"\u003e58\u003c/span\u003e\n\nThere can be no question that the government's primary purpose in conducting searches pursuant to the DNA Act is to generate evidence capable of assisting ordinary law enforcement investigations. The searches are designed to reveal at some point in time whether the individuals whose blood samples are involuntarily extracted have \"committed some crime.\" Lidster, 124 S.Ct. at 889. This is the paradigmatic search condemned by the special needs doctrine.\n\nSome, including the Government and Judge Gould in his concurring opinion, maintain that the DNA Act serves a constitutionally valid \"special need\" because the Fourth Amendment intrusion serves the state's need to supervise its conditional releasees. In Griffin v. Wisconsin, 483 U.S. 868 (1987), the Court held constitutionally reasonable the search of a probationer conducted pursuant to a Wisconsin probation regulation that permitted probation officers to conduct warrantless searches of probationers' homes so long as \" 'reasonable grounds' to believe the presence of contraband\" supported the search. Id. at 870-71. The regulation was not made a special condition of Griffin's probation, but instead applied to all probationers statewide. The Court held that the operation of the probation system presented a \"special need\" beyond that of normal law enforcement - the state's need to \"exercise [ ] supervision to assure that [probation] restrictions are in fact observed.\" Id. at 875; see id. (holding that probation is \"a 'special need' of the State, permitting a degree of impingement upon privacy that would not be constitutional if applied to the public at large\").\n\nFor several reasons, Griffin does not support the validation of the search regime prescribed by the DNA Act. First and foremost, as I have already explained, the primary purpose of the DNA Act is to collect information for ordinary law enforcement purposes - to help law enforcement authorities determine whether specific individuals have committed particular crimes. It is not to assist in the supervision of releasees, the purpose the Griffin Court identified.\u003cspan class=\"fnref\"\u003e59\u003c/span\u003e\n\nSecond, although Griffin involved probationers, one of the classes of persons covered by the DNA Act, the similarities end there. Unlike in Griffin, the DNA Act involves surveil-lance that extends far beyond conditional releasees' periods of supervision. Contrary to the plurality's suggestion, the government's alleged interest in Griffin supervision - was not, according to the Court, a \"clear law enforcement\" objective. See ante, at 11443. Instead, the purpose of the search regime in Griffin was to facilitate the supervision of probationers during the finite term of their probation period; certainly, it was not to produce unbounded evidence of past or future crimes for inclusion in a permanent governmental database. Griffin explained its departure from the warrant and probable cause requirement by referring repeatedly to the special supervisory interests at the heart of the probation system.\n\nA warrant requirement would interfere to an appreciable degree with the probation system, setting up a magistrate rather than the probation officer as the judge of how close a supervision the probationer requires. Moreover, the delay inherent in obtaining a warrant would make it more difficult for probation officials to respond quickly to evidence of misconduct, and would reduce the deterrent effect that the possibility of expeditious searches would otherwise create. . . . Although a probation officer is not an impartial magistrate, neither is he the police officer who normally conducts searches against the ordinary citizen. . . . In such a setting, we think it reasonable to dispense with the warrant requirement.\n\n483 U.S. at 876 -77.\n\nBy contrast, the purpose of the DNA Act is to obtain material for inclusion in a permanent databank to help solve crimes that may have been committed prior to the individual's term of supervised released but, most often, will be committed at some time after his term of supervision is complete.\u003cspan class=\"fnref\"\u003e60\u003c/span\u003e\n\nAlthough probation officers are forced to collect the blood samples under the Act, they are required immediately thereafter to turn them over to the FBI for analysis, permanent storage in CODIS, and future use by law enforcement officials for law enforcement purposes. See 42 U.S.C.A. § 14135a(b). Any use of the DNA samples to solve crimes committed during the period of supervised release is thus incidental to the primary purpose of the Act. And, under the special needs doctrine, it does not matter that an ancillary benefit of the Act may be to make the task of supervising conditional releasees somewhat easier. Even the presence of a \"benign\" motive cannot \"justify a departure from Fourth Amendment protections, given the pervasive involvement of law enforcement\" interests. Fergu-son, 532 U.S. at 84-85 \u0026 n.22.\n\nThird, CODIS is not limited to or even designed primarily to cover federal probationers or parolees. By the terms of the DNA Act, CODIS covers all persons convicted of the Act's qualifying offenses regardless of whether they are incarcerated in penal institutions or placed on supervised release. The overwhelming majority of individuals convicted of federal offenses are not sentenced to probation; they are sentenced to prison, where, under the Act, the compulsory extraction of blood samples occurs.\u003cspan class=\"fnref\"\u003e61\u003c/span\u003e See generally U.S. Dep't of Justice Bureau of Justice Statistics, Compendium of Federal Justice Statistics, 2001, available at http://www.ojp.usdoj.gov/bjs/ pub/pdf/cfjs0105.pdf (last visited July 7, 2004) (noting that in 2000-2001, 74.5% of convicted offenders were sentenced to prison while only 17.5% were sentenced to probation).\u003cspan class=\"fnref\"\u003e62\u003c/span\u003e\n\nCODIS now also includes DNA profiles of members of the armed forces, despite the fact that the army's DNA repository was originally promised to be used only \"for the identification of human remains.\" See Br. of Amicus Curiae Pub. Defender Serv. for the Dist. of Columbia, at 13 (citing 62 Fed. Reg. 51835, 51835 (Oct. 3, 1987)). Thus, the relevance of an individual's conditional release status to the CODIS program is highly attenuated. Only a very small percentage of persons covered by the Act are subjected to compulsory blood extraction while on conditional release, and the use of the information collected is not limited to that period of time. In no way can it fairly be said that, like Griffin, CODIS is a program designed to aid in the supervision of conditional releasees.\n\nLast but not least, the Griffin Court confronted a search regime which required reasonable suspicion before any search could be conducted. See 483 U.S. at 871; see also id. at 880 n.8 (holding that \"the only regulation upon which we rely for our constitutional decision is that which permits a warrantless search on 'reasonable grounds.' \"). The state's supervisory interests, beyond the normal needs of law enforcement, were implicated in Griffin precisely because the searches were designed to check on individual probationers who were suspected of violating the terms of their conditional release. Neither Griffin nor any later precedent supports holding constitutional under the special needs doctrine all state regulations relating to the supervision of probationers and parolees without suspicion and notwithstanding the presence of an ordinary law enforcement purpose as the primary factor underlying the search.\u003cspan class=\"fnref\"\u003e63\u003c/span\u003e\n\nC. Conclusion\n\nThe Fourth Amendment forbids blanket suspicionless searches conducted for ordinary law enforcement purposes. Under the plurality's opinion, the only remaining area of the Fourth Amendment that has been \"nonnegotiable\" would no longer be safe. Like Judge Gould, I believe that the special needs doctrine controls this case. Unlike Judge Gould, however, I would hold that the DNA Act is plainly designed to generate evidence of ordinary criminal wrongdoing, and not to serve a supervisory need, as was the case in Griffin. That is an impermissible purpose under the special needs doctrine. Consequently, I would hold that, under that doctrine, the Act is unconstitutional.\n\nIII. The Totality of the Circumstances Test\n\nThe plurality takes a far more dangerous course than does Judge Gould in his concurrence. The concurrence simply applies, or misapplies, the special needs doctrine. At least under that doctrine, suspicionless searches are carefully scrutinized and held constitutional only when they serve a valid special need apart from law enforcement. The plurality, however, believes that suspicionless searches do not need to be justified on the traditional basis employed by the Supreme Court. Casting aside the Court's established framework for analyzing blanket suspicionless search regimes, the plurality instead employs a malleable and boundless standard - it asks merely whether the search was reasonable considering \"the totality of the circumstances present.\" See, e.g., United States v. Knights, 534 U.S. 112, 121 (2001). The approach chosen by the plurality dispenses with the structural guarantees that have guided Fourth Amendment jurisprudence since the Founding. It eliminates the constitutional guarantee that law enforcement searches will not be conducted in the absence of individualized suspicion and opens the door to all kinds of bureaucratic nationwide governmental programs that disregard the Fourth Amendment rights of our citizens, with the only remaining safeguard being the willingness of the judiciary to weigh properly the relative importance of the general law enforcement interests and the individual's privacy right. As I show infra, and as today's decision demonstrates, that is a thin reed indeed. The plurality's doctrinal decision to apply a totality of the circumstances test to a suspicionless law enforcement search is just as regrettable, and even more reckless, than its pragmatic decision to find constitutional the mass involuntary extraction, collection, and permanent storage of DNA samples in CODIS for future use.\n\nA. Precedent Does Not Support the Totality of the Circumstances Approach\n\nNo Supreme Court case supports the plurality's use of the totality of the circumstances test for suspicionless searches designed to obtain evidence for use against the persons searched in present or future criminal investigations. The Knights decision, the only opinion to which the plurality points, does not support the view that, because the group searched includes conditional releasees, we may simply disregard the principles governing traditional Fourth Amendment law, and conduct law enforcement searches in the absence of individualized suspicion.\u003cspan class=\"fnref\"\u003e64\u003c/span\u003e\n\nKnights upheld a warrantless search of a probationer's home; the defendant's terms of probation included an explicit condition mandating submission to such searches at any given time. 534 U.S. at 116. Knights clearly decided the Fourth Amendment question outside of the \"special needs\" framework. 534 U.S. at 117-18 (stating the question presented as whether warrantless searches of probationers are constitutionally reasonable without reference to the \"special needs\" of the probation system - the question that the Griffin Court found it \"unnecessary to consider\"). The Court distinguished the \"special needs\" line of cases, but it did so cautiously, explaining that its departure from that framework was justified only by the combination of all of the circumstances present. 534 U.S. at 118. The plurality is correct that those circumstances included the reduced expectation of privacy held by Knights on account of the conditions of his probation. But the circumstances also included, as the Court emphasized repeatedly, the fact that the search was supported by reasonable suspicion:\n\nWe hold that the balance of these considerations requires no more than reasonable suspicion to conduct a search of this probationer's house. The degree of individualized suspicion required of a search is a determination of when there is a sufficiently high probability that criminal conduct is occurring to make the intrusion on the individual's privacy interest reasonable. Although the Fourth Amendment ordinarily requires the degree of probability embodied in the term 'probable cause,' a lesser degree satisfies the Constitution when the balance of governmental and private interests makes such a standard reasonable. Those interests warrant a lesser than probable-cause standard here. When an officer has reasonable suspicion that a probationer subject to a search condition is engaged in criminal activity, there is enough likelihood that criminal conduct is occurring that an intrusion on the probationer's significantly diminished privacy interests is reasonable.\n\nThe same circumstances that lead us to conclude that reasonable suspicion is constitutionally sufficient also render a warrant requirement unnecessary.\n\n534 U.S. at 121 (internal citations omitted) (emphasis added); see also id. at 119 n.6 (noting that \"we need not address the constitutionality of a suspicionless search because the search in this case was supported by reasonable suspicion\"); id. at 122 (\"We therefore hold that the warrantless search of Knights, supported by reasonable suspicion and authorized by a condition of probation, was reasonable within the meaning of the Fourth Amendment.\").\n\nThe passage from Knights quoted above strongly suggests that the Court's willingness to ignore the limitations imposed by the special needs doctrine was based largely on the presence of individualized suspicion. I say suggests because the Court never explained its reasons for applying the totality of the circumstances test. The Court said only that \"[w]e need not decide whether Knights' acceptance of the search condition constituted consent in the Schneckloth sense of a complete waiver of his Fourth Amendment rights, however, because we conclude that the search of Knights was reasonable under our general Fourth Amendment approach of 'examining the totality of the circumstances.' \" 534 U.S. at 118 (quoting Ohio v. Robinette, 519 U.S. 33, 39 (1996)).\u003cspan class=\"fnref\"\u003e65\u003c/span\u003e It is important to understand this statement in its proper historical context.\n\nThe \"general Fourth Amendment approach\" described by the Knights plurality refers to those Fourth Amendment cases in which the Court has sought either to determine the minimum level of suspicion required to support a particular type of search or to measure whether the quantum of suspicion officers possessed in a given case was sufficient to meet the requisite level. Indeed, the \"totality of the circumstances\" test was designed to guide the Court in its probable cause and reasonable suspicion determinations. See Illinois v. Gates, 462 U.S. 213, 238 (1983) (explaining that the \"totality of the circumstances analysis [ ] has traditionally informed probable cause determinations\"). The test has never been used, however, to justify suspicionless law enforcement searches. To the contrary, in \"totality of the circumstances\" cases, the presence of some level of suspicion has always been a given and a sine qua non. Cases involving suspicionless programmatic search regimes are not \"general\" Fourth Amendment cases. That is why the plurality cannot cite a single case that has applied the totality of the circumstances test to a regime of suspicionless searches.\n\nDespite this history, and despite the strongly suggestive language in Knights, the plurality implausibly maintains that drawing a line between suspicion-based and suspicionless searches is unnecessary because \"special needs analysis [is] triggered not by a complete absence of suspicion, but by a departure from the Fourth Amendment's warrant-and-probable cause requirements.\" Ante, at 11452. In support of this proposition, the plurality cites Griffin, which applied a \"special needs\" analysis despite the fact that the search of Griffin was supported by reasonable suspicion. Id. The plurality somehow infers from this that the \"totality of the circumstances\" test is not limited to searches based on reasonable suspicion. The plurality's logic is faulty. The fact that a suspicionless search must be justified on the basis of special needs in no way means that a suspicion-supported search cannot be justified on that basis. For instance, if the special need of the state to prevent drunk driving on the highways, see Sitz, 496 U.S. at 451, justifies traffic stops where no individualized suspicion exists, certainly that same need would justify such stops based on a reasonable suspicion that particular drivers were in fact drunk.\u003cspan class=\"fnref\"\u003e66\u003c/span\u003e In any event, the line between suspicionless law enforcement searches and searches based upon reasonable individualized suspicion is as old as the Fourth Amendment and is fundamental to the preservation of the privacy interests which that provision protects.\n\nThe best way to make sense of Knights, in light of Griffin and the Court's \"special needs\" cases, is to recognize that in Knights the Court was free to apply the \"totality of the circumstances\" test because the search was supported by individualized suspicion.\u003cspan class=\"fnref\"\u003e67\u003c/span\u003e True, the Knights Court could just as well have followed Griffin's lead and justified the search on the basis of the state's special need to operate its probation system. However, given the presence of individualized suspicion, either doctrinal approach was appropriate. Because the DNA Act's authorized blanket searches are not supported by any modicum of individualized suspicion, I would hold that the \"special needs\" line of cases controls our analysis of this case, and that the totality of the circumstances test may not be applied.\n\nB. The Dangers of Adopting the Totality of the Circumstances\n\nThe rationale employed by the plurality would set us on a dangerous path. The plurality claims that the totality of the circumstances analysis applies simply because probationers and parolees have reduced expectations of privacy. If that is the case, it is impossible to see why a similar test would not apply in a multitude of other circumstances in which no individualized suspicion exists. I do not mean to suggest that the application of the totality of the circumstances test is dangerous per se. As I have explained, courts have traditionally balanced all of the relevant circumstances when evaluating the sufficiency of an officer's suspicion to search in the absence of a warrant or determining whether reasonable suspicion rather than probable cause is sufficient. The danger in the plurality's approach lies in its willingness to apply the totality of the circumstances test to uphold law enforcement searches where no suspicion at all exists. Under such an approach, all of us would inevitably have our liberty eroded when our privacy interests are balanced against the \"monumental\" interests of law enforcement.\n\nThe plurality's rationale, if employed in future cases, would result in the end of the Fourth Amendment's general requirement that searches be based on individual suspicion. Under the plurality's reasoning, \"the judicial assessment of a parole or probation search's reasonableness outside the strictures of special needs analysis,\" ante at 11458, is justified by the fact that conditional releasees have \"diminished expectations of privacy.\" If reduced expectations of privacy render inapplicable the requirement of individualized suspicion, then suspicionless searches would be valid in many more situations than the plurality would presently be willing to admit.\n\nThe Court has identified countless groups of individuals who have reduced expectations of privacy. Conditional releasees are obviously one such group. See Morrissey v. Brewer, 408 U.S. 471, 478 (1972). But they are not the only one. All students who attend public schools have significantly diminished expectations of privacy, Bd. of Educ. v. Earls, 536 U.S. 822, 830-31 (2002), and students who voluntarily participate in extracurricular activities have even less of an expectation, see id. at 831-32.\u003cspan class=\"fnref\"\u003e68\u003c/span\u003e Drivers and passengers of vehicles have reduced expectations of privacy. See, e.g., Wyoming v. Houghton, 526 U.S. 295, 303 (1999); Pennsylvania v. Labron, 518 U.S. 938, 940 (1996). Arrestees' privacy expectations, too, appear to be significantly reduced. See Chimel v. Califor-nia, 395 U.S. 752, 762-63 (1969). These are but a few examples. Under the analysis engaged in by the plurality, a totality of the circumstances test would apply to any suspicionless search regime involving these groups. Certainly, the totality of the circumstances test would apply when we are forced to review again the DNA Act once it is expanded, as it inevitably will be, to require DNA samples from all arrestees - a particularly frightening prospect when one considers that the Constitution apparently allows police officers to arrest individuals for a nearly limitless range of conduct, including refusing to provide one's name to an inquiring law enforcement official. See Hiibel v. Sixth Judicial Dist. Court of Nevada, ___ U.S. ___, No. 03-5554, 2004 WL 1373207 (June 21, 2004); see also Atwater v. City of Lago Vista, 532 U.S. 318, 354 (2001).\n\nIf the totality of the circumstance test could be used to justify suspicionless law enforcement searches, the Fourth Amendment would be little more than an afterthought as the government seeks to conduct more and more invasive general programs in the name of law enforcement. This would be so even if the searches, at least initially, were confined to persons with reduced expectations of privacy. We have already seen the expansion of CODIS and the DNA Act an expansion that today is authorized by my colleagues under the Fourth Amendment. Even worse, if such expansion is possible with respect to forcible extractions of blood to be included in CODIS, numerous less or equally intrusive methods of evidence collection namely, all ordinary searches and seizures except perhaps for those requiring more extensive bodily invasions - will all be valid when justified by the govern-ment's \"persuasive\" law enforcement objectives - at least for the vast majority of us who at some times or others in our lives have a reduced expectation of privacy. Indeed, in the face of \"monumental\" governmental law enforcement interests, I find it difficult to understand when suspicionless searches would be found to violate the Fourth Amendment.\n\nThe plurality's answer to this is not reassuring: \"Where a given search or class of searches cannot satisfy the traditional totality of the circumstances test, conditional releasees may lay claim to constitutional relief - just like any other citizen.\" Ante, at 11462-63.\u003cspan class=\"fnref\"\u003e69\u003c/span\u003e The problem with my the plurality's view is that under the balancing analysis it has performed, it is difficult to imagine how privacy interests could ever prevail over law enforcement needs.\n\nHere, the plurality proclaims that the search in question consists only of the physical piercing of an individual's skin in order to extract his blood. Despite the obvious privacy intrusions suffered by those whose data are included in a permanent governmental database, with which the government can conduct repeated searches of the individual's genetic profile forever, the plurality concludes that the Fourth Amendment intrusion constitutes an \"insignificant\" invasion of privacy. If the invasion were insignificant, the government would not need to do much to show that its interests made the \"insignificant\" search reasonable. According to the plurality,\n\nIt is no doubt true that conditional releasees retain a right of privacy against arbitrary or harassing searches, just as they retain a right of privacy against government searches based on their race, religion, or ethnicity, or other factors that might violate the Fourteenth Amendment. U.S. CONST. amend. XIV. The problem with the plurality's view, of course, is that the Fourth Amendment prevents searches that are \"unreasonable,\" not simply searches that are arbitrary, capricious, or harassing. U.S. CONST. amend. IV. And while few suspicionless programmatic searches would count as arbitrary or capricious, many may well be constitutionally unreasonable because of the underlying programmatic purpose. See, e.g., Ferguson, 532 U.S. at 81-82. The fact that conditional releasees will retain their basic equal protection and due process rights is no reason to eviscerate the core of traditional Fourth Amendment protections against unreasonable searches and seizures.\n\nThe claim that conditional releasees will somehow be able to file a lawsuit under 28 U.S.C. § 1983 is not credible. Even if the plurality did not assert that there is an \"overwhelming\" and \"monumental\" public interest in completing a comprehensive national DNA database, it is utterly implausible to think that any court would find that a search conducted pursuant to a statute like the DNA Act, or a general traffic regulation such as the ones at issue in Edmond and Lidster, could possibly violate communal standards of \"fair play and decency.\" Ante at 11462-63 \u0026 n.29. Additionally, the availability of a cause of action under § 1983 is not a justification to deny an individual his Fourth Amendment rights. however, society has an \"overwhelming interest\" in ensuring that conditional releasees comply with the terms of their release, an \"enormous interest in reducing recidivism,\" and a substantial interest in contributing to the solution of past offenses in order to bring \"closure to countless victims of crime.\" Ante, at 11468-69. The combined weight of these interests, we are told, is \"monumental.\" Id. at 11469. So, likely, would be the law enforcement interests in any suspicionless search regime.\u003cspan class=\"fnref\"\u003e70\u003c/span\u003e\n\nThe impotence of judicial review under the \"totality of the circumstances\" approach is on full display in the plurality's opinion. The \"balancing of interests\" does not provide much of a balance - to the contrary, any reasonable reading of the plurality's decision reveals that the \"balance\" will always tilt in favor of the government. \"There have been powerful hydraulic pressures throughout our history that bear heavily on the Court to water down constitutional guarantees and give the police the upper hand. That hydraulic pressure has probably never been greater than it is today.\" Terry v. Ohio, 392 U.S. 1, 39 (1968) (Douglas, J., dissenting). The plurality's boundless regime has already buckled under the pressures to strengthen the hand of law enforcement; it will only worsen as the \"war on terror\" demands more. I see no reason to depart from the workable constitutional framework, supported by generations of considered jurisprudence on the matter, for determining when suspicionless programmatic searches are permissible and when they are not. I would limit our inquiry to the special needs test.\n\nC. Even Under the Totality of the Circumstances Test, the Searches Authorized by the DNA Act Are Unreasonable\n\nAlthough the test used by the plurality provides no meaningful guidance, I believe that even under that standard a faithful application of the principles central to the Fourth Amendment would require invalidation of the search regime. Under a balancing test, whether a given search is reasonable turns on several factors - the level of the searched individual's expectation of privacy, the character of the intrusion, and the strength of the government's interests - all of which must be balanced against each other in light of the facts of each case. Balancing those factors, I would hold that the totality of the circumstances makes the searches authorized by the DNA Act unreasonable.\n\n1. The Extent of the Intrusion Caused by the Search\n\nThe intrusion authorized by the DNA Act is significant. As the Supreme Court explained in Skinner v. Ry. Labor Executives' Ass'n, 489 U.S. 602 (1987), \"a compelled intrusion into the body for blood to be analyzed . . . must be deemed a Fourth Amendment search. In light of our society's concern for the security of one's person, it is obvious that this physical intrusion, penetrating beneath the skin, infringes an expectation of privacy that society is prepared to recognize as reasonable.\" Id. at 616 (internal quotation marks omitted); see also Schmerber v. California, 384 U.S. 757, 767 (1966); United States v. Wright, 215 F.3d 1020, 1025 (9th Cir. 2000). Even though the Court has in some cases upheld such searches as constitutional, it has insisted that searches of an individual's body are \"severe, though brief, intrusion[s] upon cherished personal security that [are] subject to constitutional scrutiny.\" Cupp v. Murphy, 412 U.S. 291, 295 (1973).\n\nIt is true that courts have sometimes described the privacy invasion caused by blood tests in less forceful terms. The search in question, however, constitutes far more of an intrusion than the mere insertion of a needle into an individual's body and the consequent extraction of a blood sample.\u003cspan class=\"fnref\"\u003e71\u003c/span\u003e In prior cases dealing with the level of intrusion authorized by the taking of blood samples, courts did not confront a regime in which the samples were turned into profiles capable of being searched time and time again throughout the course of an individual's life. See, e.g., Schmerber, 384 U.S. at 768-69 (describing the blood test as designed to produce evidence of inebriation at the time of the search). The startling advance of technology has magnified the power of the initial search authorized by the DNA Act, such that the invasion of privacy is vastly more significant that we might have previously assumed. Here, the DNA placed in the CODIS database contains sensitive information, and no one can say today what future uses will be made of it once it is entered into governmental files; certainly, today's restrictions provide no guarantees regarding future governmental uses. To reduce the searches authorized by the DNA Act to the physical act of taking blood would be to ignore the \"totality of the circumstances\" surrounding the search and to ignore the manner in which \"the advance of technology\" has affected \"the degree of privacy secured to citizens by the Fourth Amendment.\" Kyllo v. United States, 533 U.S. 27, 33-34 (2001). We cannot ignore technological developments in the Fourth Amendment context, but instead must confront \"what limits there are upon this power of technology to shrink the realm of guaranteed privacy.\" Id. at 34.\n\nI would hold that the invasion of privacy required by the DNA Act is substantial. The Act is unprecedented in its scope and threatens only to expand once we have justified its initial forms. With the substantial nature of the invasion in mind, I turn to the reasonable expectations of privacy held by probationers and parolees.\n\n2. The Expectation of Privacy\n\nIt is by now a banal observation that probationers and parolees have diminished expectations of privacy. See United States v. Knights, 534 U.S. 112, 119 (2001). As Knights explained, probationers' and parolees' expectations of privacy are curtailed, and society may therefore impose \"reasonable conditions that deprive the offender of some freedoms enjoyed by law-abiding citizens.\" Id. at 119 (emphasis added). But the error the plurality makes is treating a reduction of \"some freedoms\" as if it were equivalent to the elimination of all. Despite my colleagues' evident views to the contrary, conditional releasees do retain privacy expectations. All of the authorities cited by the plurality discuss the reduced, not the \"eliminated,\" expectations of privacy conditional releasees have during their period of supervision by the state. See, e.g., id. at 118-19 (emphasizing that the most salient fact in its totality of the circumstances analysis was that Knights was subject to a \"probation search condition\" that \"significantly diminished [his] reasonable expectation of privacy\"); Griffin, 483 U.S. at 874; Latta v. Fitzharris, 521 F.2d 246, 249 (9th Cir. 1975) (en banc) (plurality opinion).\n\nMoreover, the impact of the DNA Act is not limited to persons in a conditional release status. It affects individuals who have completed their period of supervision, as well as some who have never been subject to that status. The data of some arrestees are now included in CODIS and there is little doubt that the collection of data from far more will soon be completed. In any event even probationers and parolees have full expectations of privacy once they have paid their dues to society and have completed their terms of conditional release. The plurality, however, has concluded that \"such a severe and fundamental disruption in the relationship between the offender and society, along with the government's concomitantly greater interest in closely monitoring and supervising conditional releasees, is in turn sufficient to sustain suspicionless searches of his person and property even in the absence of some non-law enforcement 'special need' \" Ante, at 11462-63. In other words, convicted offenders' reduced privacy expectations may last forever.\n\nI respectfully disagree with the plurality's assessment of the privacy expectations held by individuals subjected to searches under the DNA Act. I conclude that despite probationers' and parolees' diminished expectations of privacy, those expectations they retain must be given sufficient weight in the balancing process.\n\n3. The Governmental Interests\n\nI now turn to the government's interests in conducting the searches in question. The plurality has described these interests as \"enormous,\" \"overwhelming,\" and \"monumental.\" Certainly, one would think that such interests involve the prevention of a terrorist act, the defusing of a ticking bomb, the discovery of the missing weapons of mass destruction, or something similarly weighty. Not so. According to the plurality, these words describe the normal, everyday needs of law enforcement - preventing crimes, encouraging rehabilitation, and bringing closure to victims by solving old crimes. I agree that the government has a very strong interest in solving and deterring crime. But I disagree that the interests sought to be advanced by the DNA Act are anything other than the ordinary needs advanced in favor of every program designed to assist crime control. See supra, at 11501-02 (describing the Act's primary purpose).\n\nIn order to make the government's interests appear stronger than they are, the plurality contends that searches pursuant to the Act serve the commendable purpose of ensuring that the innocent will not be wrongly convicted. See ante, at 11469 n. 38. I would certainly hope that the Act would be used for such purposes. Recent experience has shown that DNA evidence can help exonerate the wrongfully convicted,\u003cspan class=\"fnref\"\u003e72\u003c/span\u003e and I would be the first to applaud a statute that helped wrongfully accused or convicted individuals obtain DNA analysis for that worthy purpose.\n\nUnfortunately, that is not the Act we review today. The DNA Act does nothing to assist the wrongfully accused or convicted. The Act provides no option for DNA testing to those who seek to prove their innocence, and no funding to states or localities to help provide DNA sampling when requested by those who contend that were wrongfully arrested or convicted. It simply requires the collection and maintenance of blood samples from those in our society the state believes to be the most likely to commit crimes. It is thus difficult to accept the government's representation of its concerns regarding the innocent.\n\nIt is undoubtedly true that were we to maintain DNA files on all persons living in this country we would make the resolution of criminal investigations easier.\u003cspan class=\"fnref\"\u003e73\u003c/span\u003e The same would be true were we willing to sacrifice all of our interests in privacy and personal liberty. Those who won our independence chose, however, not to follow that course but instead to provide us with the safeguards contained in the Fourth Amendment. We as judges do not have the authority to sacrifice those constitutional protections.\n\nD. Summary\n\nWere we to apply the totality of the circumstances analysis, I would hold that the balance of considerations makes the pro-grammatic suspicionless searches unconstitutionally unreasonable. The invasions of privacy the Act authorizes are substantial; the probationers and parolees subjected to its provisions maintain reasonable expectations of privacy; and the government's interest, while significant, is no stronger than its ordinary interest in investigating and prosecuting crimes. On balance, the government's desire to create a comprehensive DNA databank must give way when weighed against the privacy interests at issue and the extent of the intrusion involved.\n\nWhen democratic values are lost, society often looks back, too late, and says when did this happen - why didn't we understand before it was too late? Today's decision marks one of those turning points - a fatally unwise and unconstitutional surrender to the government of our liberty for the sake of security, and, should the plurality's theory ever become law, the establishment of a doctrine that would leave us without the legal tools to halt further abolition of our privacy rights. The compulsory extraction of blood samples and the maintenance of permanent DNA profiles of American citizens is, unfortunately, the beginning not the end. 1984 arrives twenty years later than predicted.\n\nIV. Conclusion\n\nThomas Cameron Kincade was convicted of committing several crimes. He has paid his debt to society by serving his time for those offenses. His current term of supervised release, which ironically was imposed on him for his refusal to submit a blood sample as required by the DNA Act, will expire shortly after the publication of these opinions on August 24, 2004. At that time, the state will cease to have a supervisory interest over Kincade. Yet Kincade, by the terms of the DNA Act, will effectively be compelled to provide evidence with respect to any and all crimes of which he may be accused for the rest of his life. Every time new evidence is discovered from a crime scene, the government will search Kincade's genetic code to determine whether he has committed the crime - just as the government might search his house for evidence linking him to the crime scene despite the fact that the government may never have cause to suspect him again. Moreover, the maintenance of his DNA will permit a myriad of other known and unknown uses of the samples, by governmental authorities, as technology evolves, in violation of his full future expectation of privacy.\n\nIn truth, the DNA Act was not enacted to meet the supervisory needs of the probation system, and no-one seriously suggests that it was. It was not established to help rehabilitate convicted offenders, and no-one seriously makes that suggestion either. Finally, it was not enacted to deter future criminal activity, and no-one seriously suggests that such is the reason it was adopted. The Act was created to help law enforcement officials solve unsolved crimes. This case is not about supervising a group of individuals with reduced expectations of privacy. It is about whether the government may invade an individual's body and compel him to surrender sensitive information for inclusion in a permanent centralized government database in order to further the state's law enforcement interests.\n\nThe plurality's determination that the government may collect and store this information given the \"totality of the circumstances,\" dismantles the structural protections that lie at the core of the Fourth Amendment. We have always required individual suspicion for searches designed to produce ordinary evidence of criminal wrongdoing. We have never allowed blanket suspicionless searches to be justified by the need to investigate and prosecute more efficiently past and future crimes. My colleagues would abandon the restraints that the special needs doctrine places on the government's ability to conduct blanket searches. In that doctrine's place, they would leave us with nothing more than a boundless test that will inevitably side with the \"monumental\" law enforcement interests at stake and with the empty promise that the state will exercise restraint if the circumstances ever so demand.\n\nIt is always tempting to grant the government more authority to fight crime. We all desire more effective law enforcement, less recidivism, and \"closure\" for victims of heinous crimes. But that desire does not justify eviscerating the structural edifices of the Fourth Amendment those barriers often constitute the only protections against governmental intrusions into the most intimate details of our lives. DNA evidence contains such details. I therefore cannot agree that the Act is constitutional and cannot join in the plurality's enthusiastic approval of the use of suspicionless searches for law enforcement ends. Nor, of course can I join in Judge Gould's paradoxical conclusion that the use by law enforcement officers of compulsorily extracted blood samples as a tool in the investigation of crimes is not for a law enforcement purpose.\n\nThere were valid reasons for the Founders' decision to establish a preference for probable cause in the Fourth Amendment and for the Court's decisions to demand some sort of individualized suspicion to support programmatic searches undertaken for law enforcement purposes. I continue to believe that, in the absence of a constitutional amendment, those reasons should guide our decision. See Terry, 392 U.S. at 38-39 (Douglas, J., dissenting) (\"Perhaps such a step is desirable to cope with modern forms of lawlessness. . . . Until the Fourth Amendment . . . is rewritten, the person and the effects of the individual are beyond the reach of all government agencies until there are reasonable grounds to believe (and probable cause) that a criminal venture has been launched or is about to be launched.\").\n\nFinally, no one should take comfort from the fact that today's decision is well-intentioned - or that it is purportedly limited to convicted offenders. As Justice Brandeis once wrote,\n\nit is also immaterial that the intrusion was in aid of law enforcement. Experience should teach us to be most on our guard to protect liberty when the Government's purposes are beneficent. Men born to freedom are naturally alert to repel invasion of their liberty by evil-minded rulers. The greatest dangers to liberty lurk in insidious encroachment by men of zeal, well-meaning but without understanding.\n\nOlmstead v. United States, 277 U.S. 438, 479 (1928) (Brandeis, J., dissenting). The erosion of conditional releasees' liberty makes us all less free.\n\nPrivacy erodes first at the margins, but once eliminated, its protections are lost for good, and the resultant damage is rarely, if ever, undone. Today, the court has opted for comprehensive DNA profiling of the least protected among us, and in so doing, has jeopardized us all. I respectfully dissent.\n\nKOZINSKI, Circuit Judge, dissenting:\n\nNew technologies test the judicial conscience. On the one hand, they hold out the promise of more effective law enforcement, and the hope that we will be delivered from the scourge of crime. On the other hand, they often achieve these ends by intruding, in ways never before imaginable, into the realms protected by the Fourth Amendment. Which is no doubt why the Supreme Court has told us to be wary of \"this power of technology to shrink the realm of guaranteed privacy.\" Kyllo v. United States, 533 U.S. 27, 34 (2001).\n\nThe heat sensor technology at issue in Kyllo was a promising new tool for law enforcement, except for one small defect: It let the police get information about what was going on inside people's homes-something the Fourth Amendment generally prohibits without a warrant. DNA fingerprinting is another case in point. The good news is that it lets police identify people far more easily than would be possible using retro technology. The bad news is that those people could well be us.\n\nOnce Kincade completes his period of supervised release, he becomes an ordinary citizen just like everyone else. Having paid his debt to society, he recovers his full Fourth Amendment rights, and police have no greater authority to invade his private sphere than anyone else's. The difficult question is whether the government may exploit Kincade's diminished Fourth Amendment rights while he is still a probationer to obtain his DNA signature, so it can use it in investigating thousands of crimes nationwide, past and future, for the rest of Kincade's life. Displaying an exuberant faith in the positive power of technology, the plurality opinion answers this question with a resounding yes, but I remain skeptical. Stripped of its bells and whistles, the plurality's theory seems to be this: We have a pretty good idea that people who have committed crimes in the past are more likely than others to commit crimes in the future. It is thus very, very, very useful for us to get their DNA fingerprints now so we can use them later to investigate crimes.\n\nBut if we accept the legal presumption-not questioned here by anyone-that once Kincade leaves supervised release he will be just like everyone else, authorizing the extraction of his DNA now to help solve crimes later is a huge end run around the Fourth Amendment. Or, to state it in reverse, if the reason for taking Kincade's DNA while he's on supervised release is that it will help solve crimes later, it seems equally justifiable to take his blood after he comes off supervised release. Ex-probationers are just as likely to commit crimes as people now on probation, and including them in the CODIS database would surely help solve even more crimes. Balancing the minor intrusion the plurality sees from the taking of blood-a mere pin-prick-against the \"monumental\" benefits to society, op. at 11469, it is unclear how the balance could be struck any differently as to ex-probationers than as to current ones.\n\nWhich brings us to the people we really need to worry about, namely you and me. If collecting DNA fingerprints can be justified on the basis of the plurality's multi-factor, gestalt high-wire act, then it's hard to see how we can keep the database from expanding to include everybody. Of course, anyone who already has to give up bodily fluids for alcohol or drug testing-airline pilots, high school athletes, customs inspectors and people suspected of driving while intoxicated- would be easy prey under the mushy multi-factor test. But, with only a little waggling, we can shoehorn the rest of us in. As the plurality notes, blood is taken from us from the day we are born pretty much till the day we die, and on many days in between. What exactly happens to that blood after it leaves our veins? Most of us don't know or care, presuming (if we consider it at all) that whatever isn't used for testing is discarded. But what if Congress were to require medical labs to submit the excess blood for DNA fingerprinting so it can be included in CODIS?\n\nApplying the plurality's balancing analysis, I'm hard pressed to see how this would violate anyone's Fourth Amendment rights. The benefits would continue to be huge. The more DNA samples are included in the database, the better off we are: More guilty parties will be found, more innocents will be cleared and more unknown crime victims will be identified. On the other side of the ledger, the costs would be meager. By glomming onto blood already extracted for other purposes, the government would have eliminated what the plurality identifies as the most serious negative factor-the piercing of the skin. Op. at 11465-66. Moreover, it's hard to say that most of us have any expectation as to what happens to our blood once it leaves our veins in the doctor's office; we certainly don't expect it to be returned to us. Arguably, we have no more reasonable expectation of privacy in blood turned over to third parties and abandoned than we do in our trash cans or bank records. See California v. Greenwood, 486 U.S. 35, 39-41 (1988) (no reasonable expectation of privacy in materials left on public street, like garbage); United States v. Miller, 425 U.S. 435, 442-43 (1976) (no reasonable expectation of privacy in material conveyed to third party, like bank records, even if conveyed in confidence and for a limited purpose). And without a reasonable expectation of privacy, there isn't even a \"search\" for Fourth Amendment purposes. Kyllo, 533 U.S. at 31-33. Which is why it is important to recognize that the Fourth Amendment intrusion here is not primarily the taking of the blood, but seizure of the DNA fingerprint and its inclusion in a searchable database.\n\nThe plurality's approach will cut even closer to home as our techniques for extracting DNA improve and identifying information can more easily be obtained from urine and saliva, or from hair follicles inadvertently pulled out during a visit to the barber or hairdresser. As the plurality points out, op. at 11468-69 n.37, we can't go anywhere or do much of anything without leaving a bread-crumb trail of identifying DNA matter. If we have no legitimate expectation of privacy in such bodily material, what possible impediment can there be to having the government collect what we leave behind, extract its DNA signature and enhance CODIS to include everyone? Perhaps my colleagues in the plurality feel comfortable living in a world where the government can keep track of everyone's whereabouts, or perhaps they believe it's inevitable given the dangers of modern life. But I mourn the loss of anonymity such a regime will bring.\n\nThis isn't an issue we can leave for another day. Later, when further expansions of CODIS are proposed, information from the database will have been credited with solving hundreds or thousands of crimes, and we will have become inured to the idea that the government is entitled to hold large databases of DNA fingerprints. This highlights an important aspect of Fourth Amendment opinions: Not only do they reflect today's values by giving effect to people's reasonable expectations of privacy, they also shape future values by changing our experience and altering what we come to expect from our government. A highly expansive opinion like the plurality's, one that draws no hard lines and revels in the boon that new technology will provide to law enforcement, is an engraved invitation to future expansion. And when that inevitable expansion comes, we will look to the regime we approved today as the new baseline and say, this too must be OK because it's just one small step beyond the last thing we approved. See Eugene Volokh, The Mechanisms of the Slippery Slope, 116 Harv. L. Rev. 1026, 1077-1114 (2003). My colleagues in the plurality assure us that, when that day comes, they will stand vigilant and guard the line, but by then the line-never very clear to begin with-will have shifted. The fishbowl will look like home.\n\nAnyone who doubts that CODIS will expand, prodded by the voracious appetite of law enforcement, has only to consider the growth of fingerprint databases. In 1924, when J. Edgar Hoover became head of what was to become the FBI, the Justice Department's fingerprint files contained only prints of those who had at some point passed through the criminal justice system. Hoover, who favored universal fingerprinting, moved to expand the database and aggressively lobbied local law enforcement officials to submit prints to the FBI. He took a further step in 1929 and began fingerprinting all civil servants. The Alien Registration Act, passed in 1940, eventually delivered over a million prints to the FBI. See Simon A. Cole, Suspect Identities: A History of Fingerprinting and Criminal Identification 246-47 (2001). Today, the FBI's Integrated Automated Fingerprint Identification System contains the fingerprints of over 47 million people, including prints \"acquired related to a background check for employment, licensing, and other non-criminal justice purposes\" and \"submitted voluntarily by state, local, and federal law enforcement agencies.\" U.S. Dep't of Justice, Fed. Bureau of Investigation, IAFIS, at http://www.fbi.gov/hq/cjisd/iafis.htm (last visited Aug. 4, 2004). Several states require fingerprints of all drivers' license applicants. See, e.g., Cal. Veh. Code § 12517.3(a)(1); Colo. Rev. Stat. § 42-2-107(2)(a); Tex. Transp. Code § 521.142(b)(1). California all by itself has the prints of over 22 million drivers' license holders on file, see Dep't of Motor Vehicles, Driver Licenses Outstanding by County (2003), at http://www.dmv.ca.gov/about/profile/ dl_outs_by_county .htm, as well as the prints of lawyers, Cal. Bus. \u0026 Prof. Code § 6054, and certain welfare recipients, Cal. Welf. \u0026 Inst. Code § 10830(b)(1). See also Nat'l Conf. of State Legislatures, Biometrics Implementation Legislation by State (2002), at http://www.ncsl.org/programs/esnr/ licenseD.htm. Not all these fingerprint databases are currently in searchable form, but given our improving ability to store biometric identifiers electronically, it's only a matter of time.\n\nBecause the great expansion in fingerprinting came before the modern era of Fourth Amendment jurisprudence ushered in by Katz v. United States, 389 U.S. 347 (1967), it proceeded unchecked by any judicial balancing against the personal right to privacy. As a consequence, we have become accustomed to having our fingerprints on file in some government database. The suggestion that law enforcement agencies, including the FBI, must destroy the fingerprints of those who were wrongfully arrested and booked, and were later released, would today be greeted by reactions ranging from apathy to a disdainful snigger. Why? Because we have come to accept that people-even totally innocent people-have no legitimate expectation of privacy in their fingerprints, and that's that.\n\nJudge Gould commendably recognizes the troubling implications of using Kincade's status today to extract his DNA for use after he ceases to be on supervised release, but leaves for another day whether Kincade might be entitled to have his DNA removed from CODIS once his status changes. Had the government sought to justify the extraction of the DNA as a measure for ensuring Kincade's compliance with the terms of his supervised release, I would be tempted to agree with Judge Gould. But the government did no such thing. Kincade's probation officer did not seek to have Kincade's DNA extracted to better supervise him-blood extraction for DNA typing purposes was not an explicit probation condition, nor was there any showing that the probation officer had determined that extracting Kincade's blood and typing his DNA was necessary or desirable to improve his chances of successfully completing probation. The record clearly shows that the probation officer ordered Kincade to submit a blood sample only to comply with the DNA Act. The government thus seeks to justify the blood extraction precisely so his DNA will be available in the CODIS database for the rest of his life.\n\nThe plurality enthusiastically accepts this justification and thus has already answered the question Judge Gould would keep in reserve. As a practical matter, moreover, the chance that Kincade could have his DNA removed from the CODIS database once he completes his supervised release is about the same as the chance that someone arrested and fingerprinted, but eventually found innocent, could force the FBI to delete his fingerprints from its database, namely nil. While I sympathize with Judge Gould's reluctance to speak on an issue that might be better resolved later, on this record we have no choice: The extraction of Kincade's blood for DNA typing must be justified on the ambitious grounds advanced by the government and accepted by the plurality, or not at all. For the reasons eloquently expressed by Judge Reinhardt in his dissent, and those stated above, I cannot agree that the suspicionless extraction of blood to include Kincade's DNA in the CODIS database can be upheld under the Fourth Amendment. The time to put the cork back in the brass bottle is nowbefore the genie escapes.\n\nHAWKINS, Circuit Judge, dissenting:\n\nWe are asked whether the forced extraction of blood from certain convicted felons, as a condition of supervised release and for the purpose of retention without time limit in a national DNA database, violates the Fourth Amendment. My colleagues have written exhaustively and well on the subject. My purpose is not necessarily to replow their ground, but to set forth my own thoughts on this difficult question.\n\nAsking convicted felons to provide proof of identity, whether by fingerprint or DNA sample, should be viewed, as Judges Gould and Reinhardt both persuasively argue, through the lens of the \"special needs\" doctrine. In the abstract, I have no quarrel with the notion that this could be a reasonable exercise of government power under contemporary Fourth Amendment standards. The forcible extraction of blood, however, not mandated by Congressional command, but by dictates of law enforcement efficiency, is different. Beginning with Schmerber v. California, 384 U.S. 757 (1966), the Supreme Court has recognized that while a lawfully arrested person may have lessened expectations of privacy and be subject to other searches incident to arrest, no one is required to submit to \"intrusions beyond the body's surface\" absent a \"clear indication\" that the desired evidence would be found by such a search. Id. at 769-70; see also Skinner v. Ry. Labor Executives' Ass'n., 489 U.S. 602, 616 (1989) (\"[I]t is obvious that this physical intrusion, penetrating beneath the skin, infringes an expectation of privacy that society is prepared to recognize as reasonable.\"). While convicted felons certainly have lessened expectations of privacy, the legitimate governmental needs identified by the majority and by Judge Gould simply do not, in my view, justify this particular type of intrusive, suspicionless search.\n\nJudge Gould properly questions whether it is reasonable to retain the sample beyond the period of supervised release - in perpetuity, according to this record. I agree with Judge Reinhardt, however, that this case does present that issue. Although Kincade is currently on supervised release, we cannot ignore that the data obtained from him while in that status will be stored and used long beyond that period of time. This use will not serve the special needs identified by Judge Gould, but the \"general interest in law enforcement\" that the Court has held cannot justify suspicionless searches. See, e.g., Ferguson v. City of Charleston, 532 U.S. 67, 79 (2001).\u003cspan class=\"fnref\"\u003e74\u003c/span\u003e\n\nEnforcing the Constitution is neither a popularity contest nor a polling exercise. The Bill of Rights restrains government power and, along with it, law enforcement efficiency. In a world unrestrained by our Fourth Amendment, every citizen, convicted or not, might be forced to supply a DNA sample. More crimes would undoubtedly be solved, just as would be the case if there were no warrant requirement. But that is not the world that Mr. Madison and the First Congress created for us. I sincerely hope that the drastic consequences Judge Reinhardt projects will not come to pass. I do, however, agree that the DNA Act as currently implemented - forcible extraction of blood and retention without limitation - violates the Fourth Amendment. Therefore, I respectfully dissent.\n\n\u003cspan class=\"fn\"\u003e1. As enumerated by the initial terms of the DNA Act, these \"qualifying federal offenses\" included murder, voluntary manslaughter, aggravated assault, sexual abuse, child abuse, kidnapping, robbery, burglary, arson, and any attempt or conspiracy to commit such crimes. See 42 U.S.C. § 14135a(d)(1). With passage of the PATRIOT Act, Pub. L. No. 107-56, § 503, 115 Stat. 272, 364 (2001), acts of terrorism (as defined in 18 U.S.C. 2332b(g)(5)(B)) and additional crimes of violence (as defined in 18 U.S.C. § 16) have been added to the ranks of qualifying federal offenses. See 42 U.S.C. § 14135a(d)(2). A complete list of qualifying federal offenses can be found at 28 C.F.R. § 28.2. Although the federal offender provisions of the DNA Act are most relevant here, we note that the Act reaches beyond the federal arena. Subsidiary provisions provide for collection and storage of DNA information from offenders subject to the jurisdiction of the District of Columbia, 42 U.S.C. § 14135b, and the Armed Forces, 10 U.S.C. § 1565. The Act also appropriates $170 million to support state efforts to collect and to store DNA profiles from state offenders and crime scene evidence. 42 U.S.C. §§ 14135(a) \u0026 (j). Partially as a result, every state in the Union now operates a DNA collection program. A regularly-updated summary of state DNA legislation can be found at .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Federal \"parole\" was largely abolished and replaced with \"supervised release\" by the Sentencing Reform Act of 1984, Pub. L. No. 98-473, § 212(a)(2), 98 Stat. 1837, 1999 (1984). See 18 U.S.C. § 3583; see also Johnson v. United States, 529 U.S. 694, 696-97 (2000) (citing GozlonPeretz v. United States, 498 U.S. 395, 400-01 (1991)). However, because ex post facto concerns would arise if the statutory framework governing supervised release were retroactively applied to persons sentenced under the prior sentencing-and-parole scheme, cf. United States v. Paskow, 11 F.3d 873, 883 (1993), Congress has thrice extended the federal parole system for individuals sentenced for offenses committed before November 1, 1987. See 18 U.S.C. § 3551 note (documenting extensions). The primary difference between these types of conditional release is that the former follows a term of imprisonment rather than shortening one. Our cases have not distinguished between parolees, probationers, and supervised releasees for Fourth Amendment purposes. United States v. Harper, 928 F.2d 894, 896 n.1 (9th Cir. 1991) (Kozinski, J.); see also Griffin v. Wisconsin, 483 U.S. 868, 873-74 (1987); Green v. Berge, 354 F.3d 675, 680 (7th Cir. 2004) (Easterbrook, J., concurring); United States v. Hill, 967 F.2d 902, 909 (3d Cir. 1992); cf. United States v. Woodrup, 86 F.3d 359, 361-62 \u0026 n.4 (4th Cir. 1996) (analogizing parole, probation, and supervised release); United States v. Kills Enemy, 3 F.3d 1201, 1203 (8th Cir. 1993) (treating parole and probation search conditions alike and applying them to pre-sentence release conditions); United States v. Marmolejo, 915 F.2d 981, 982 (5th Cir. 1990) (describing revocations of parole, probation, and supervised release as \"constitutionally indistinguishable\"); but see United States v. Crawford, 372 F.3d 1048, 1076-1077 (9th Cir. 2004) (en banc) (Kleinfeld, J., concurring) (proposing a distinction).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Accordingly, qualified federal offenders on probation or supervised release who refuse to submit to DNA sampling under the Act also breach two mandatory conditions of their probation or parole: that they shall not commit an additional federal, state, or local offense, see 18 U.S.C. §§ 3563(a)(1) \u0026 3583(d); see also U.S.S.G. §§ 5B1.3(a)(1) \u0026 5D1.3(a)(1), and, of course, that they submit to DNA sampling. See 18 U.S.C. §§ 3563(a)(9) \u0026 3583(d); see also U.S.S.G. §§ 5B1.3(a)(10) \u0026 5D1.3(a)(8). In turn, violation of the terms of one's probation or supervised release authorizes the sentencing court to revoke or to extend the conditions of his or her release. See 18 U.S.C. §§ 3564(d)-(e), 3565(a) \u0026 3583(e)(2)-(3).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. While this common figurative phrase conjures a useful image of DNA profiling to the extent that it evokes the biological uniqueness of human beings, it is technically misleading in the present context: DNA profiling for these purposes records non-genic variations coded into the building blocks of life. See Nat'l Comm. for the Future of DNA Evidence, Nat'l Inst. of Justice, U.S. Dep't of Justice, The Future of Forensic DNA Testing 35, Nov. 2000, available at http://www.ncjrs.org/pdffiles1/nij/183697.pdf (last visited May 14, 2004) [hereinafter Future of Forensic DNA Testing].\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The term allele often is used to refer to a genic variant responsible for producing a particular trait. The National Commission on the Future of DNA Evidence provides the following illustrative example: [A] specific allele of a particular gene is responsible for the enzyme that converts the amino acid phenylalanine into tyrosine. When this enzyme is missing or abnormal, the child develops the disease, phenylketonuria, or PKU. The result is severe mental retardation unless the child is treated; happily, with a specific diet the child develops normally. A child will develop PKU only if both representatives of the appropriate chromosome pair carry the abnormal allele. If there is only one PKU allele and the other is normal, the child will be normal; the amount of enzyme produced by a single normal allele is enough. Future of Forensic DNA Testing 11. Because nearly 97 percent of DNA is non-genic, and because those \"regions show the same genetic variability that genes do, in fact usually more[,] . . . the words commonly used for describing genes (e.g., allele . . .) are carried over to [non-genic] DNA regions . . . .\" Id. at 12.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Recent studies have begun to question the notion that junk DNA does not contain useful genetic programming material. W. Wayt Gibbs, The Unseen Genome: Gems Among the Junk, Sci. Am., Nov. 2003, at 29.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. In addition, because DNA characteristics are transmitted inter-generationally, it is \"quite [possible to] identify a person who is a relative of the person contributing the [DNA] sample.\" Id. at 35. Indeed, shortly after this en banc case was taken under submission, police in Grand Rapids, Michigan discovered that DNA evidence taken from a rape kit matched that of an incarcerated prisoner previously convicted of sexual assault-only to discover that the apparent DNA contributor had a twin brother who also was previously convicted of sexual assault and who was present in the area of the rape in question at the time of its commission. Assoc. Press, DNA of Suspect's Twin Key in Rape Case, May 14, 2004. Authorities are currently seeking to determine whether the twins are identical, in which case their DNA would be indistinguishable, or fraternal, in which case police could clear the late-discovered twin. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Beyond the STR-generated DNA profile, CODIS records contain only an identifier for the agency that provided the DNA sample, a specimen identification number, and the name of the personnel associated with the analysis. H.R. Rep. No. 106-900(I) at *27.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Currently, 49 states, the U.S. Army, the Bureau, and Puerto Rico share DNA profiles through CODIS. The lone exception among the states is Mississippi. See Federal Bureau of Investigation, NDIS Participants, available at http://www.fbi.gov/hq/lab/codis/partstates.htm (last visited May 11, 2004). One noteworthy consequence of linking these independently-developed databases is that CODIS currently stores DNA profiles taken from individuals who have been convicted of a substantially broader array of offenses than the qualifying federal offenses enumerated in 42 U.S.C. § 14135a(d) and 28 C.F.R. § 28.2. Indeed, many state programs reach well beyond the federal model-some collecting information from non-violent drug offenders, and others requiring samples from persons convicted of simple misdemeanors. At least three states-Louisiana, Texas, and Virginia-currently collect DNA samples from certain arrestees, and a pending California initiative would require the immediate, prospective collection of DNA information from adults arrested for enumerated felonies, and within five years of enactment, any felony. La. Rev. Stat. § 15:602 (2004); Tex. Gov't Code § 411.1471(a)(2) (2004); Va. Code Ann. § 19.2-310.2:1 (2004); see also State of Cal., Office of the Attorney Gen., Active Measures, available at http://www.caag.state.ca.us/ initiatives/pdf/sa200 3rf0065.pdf (last visited May 11, 2004). In light of these widely varying measures, it is therefore particularly important to observe that we deal here solely with the legality of requiring compulsory DNA profiling of qualified federal offenders on conditional release. We express no opinion on the authority of the federal government or the states to pass less narrowly tailored legislation. Cf. Green, 354 F.3d at 679-81 (Easterbrook, J., concurring) (explaining that the DNA profiling of convicted offenders in custody and on conditional release \"does not present the question whether DNA could be collected forcibly from the general population\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Based on apparent suspicions that he had been involved in illegal activity, Kincade was discharged from the treatment program on October 19, 2001. But subsequent investigation by his probation officer revealed no evidence that Kincade had actually engaged in any illegal conduct, and the district court approved the Officer's recommendation that no action be taken.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Both 18 U.S.C. § 2113 and 18 U.S.C. § 924 are qualifying federal offenses for DNA Act purposes. See C.F.R. § 28.2(a).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Therefore, we need not address the free exercise issues potentially raised by an application of the DNA Act to persons holding sincere religious objections. Likewise, because Kincade makes no such claim-and although the answer seems fairly obvious to us-we need not address whether use of CODIS \"to repress dissent or, quite literally, to eliminate political opposition,\" post at 11487, or \"to monitor, intimidate, and incarcerate political opponents and disfavored minorities,\" post at 11487, would comport with other constitutional limitations on governmental authority, such as the First, Fifth, and Fourteenth Amendments.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. On appeal, Kincade raises only Fourth Amendment objections to the Act.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Our review of a federal statute's constitutionality is de novo. See, e.g., United States v. McCoy, 323 F.3d 1114, 1117 (9th Cir. 2003); United States v. Cortes, 299 F.3d 1030, 1032 (9th Cir. 2002).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. The compulsory extraction of blood for DNA profiling unquestionably implicates the right to personal security embodied in the Fourth Amendment, and thus constitutes a \"search\" within the meaning of the Constitution. See Skinner v. Ry. Labor Executives' Ass'n, 489 U.S. 602, 616 (1987) (\"We have long recognized that a compelled intrusion into the body for blood to be analyzed for alcohol content must be deemed a Fourth Amendment search.\") (quotation omitted); see also Winston v. Lee, 470 U.S. 753, 760 (1985); Schmerber v. California, 384 U.S. 757, 767-68 (1966). Of course, the fact that such extraction constitutes a search is hardly dispositive, as \"the Fourth Amendment does not proscribe all searches and seizures . . . .\" Skinner, 489 U.S. at 619.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. See United States v. Ramsey, 431 U.S. 606, 616 (1977) (\"[S]earches made at the border, pursuant to the longstanding right of the sovereign to protect itself by stopping and examining persons and property crossing into this country, are reasonable simply by virtue of the fact that they occur at the border.\"); see also United States v. Flores-Montano, 540 U.S. __, 124 S. Ct. 1582 (2004); United States v. Montoya de Hernandez, 473 U.S. 531 (1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. See Hudson v. Palmer, 468 U.S. 517, 526 (1983) (\"[S]ociety is not prepared to recognize as legitimate any subjective expectation of privacy that a prisoner might have in his prison cell . . . . [A]ccordingly, the Fourth Amendment proscription against unreasonable searches does not apply within the confines of the prison cell.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. See, e.g., Chandler v. Miller, 520 U.S. 305, 323 (1997) (\"[W]here the risk to public safety is substantial and real, blanket suspicionless searches calibrated to the risk may rank as 'reasonable'-for example, searches now routine at airports and at entrances to courts and other official buildings.\"); see also United States v. Edwards, 498 F.2d 496, 500 (2d Cir. 1974) (\"When the risk is the jeopardy to hundreds of human lives and millions of dollars of property inherent in the pirating or blowing up of a large airplane, the danger alone meets the test of reasonableness, so long as the search is conducted in good faith for the purpose of preventing hijacking or like damage and with reasonable scope and the passenger has been given advance notice of his liability to such a search so that he can avoid it by choosing not to travel by air.\") (quoting United States v. Bell, 464 F.2d 667, 675 (2d Cir. 1972) (Friendly, C.J., concurring)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Compare City of Indianapolis v. Edmond, 531 U.S. 32, 37 (2000) (\"We have also allowed searches for certain administrative purposes without particularized suspicion of misconduct. . . .\"), with New York v. Burger, 482 U.S. 691, 702 (1987) (grouping inspections of closely-regulated businesses with \"other situations of 'special need' \") (quoting New Jersey v. T. L. O., 469 U.S. 325, 353 (1985) (Blackmun, J., concurring)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. At various points, Griffin explained that the focus of conditional release is controlling criminal recidivism-that is, the ordinary commission of ordinary crimes by ordinary criminals. See, e.g., 483 U.S. at 875 (\"[R]estrictions are meant to assure that the probation serves as a period of genuine rehabilitation and that the community is not harmed by the probationer's being at large.\"); id. (\"[M]ore intensive supervision can reduce recidivism . . . .\" ); id. at 876 (\"[T]he delay inherent in obtaining a warrant would make it more difficult for probation officials to respond quickly to evidence of misconduct. . . .\"); id. at 878 (\"[A] probable-cause requirement would reduce the deterrent effect of the supervisory arrangement. The probationer would be assured that so long as his illegal (and perhaps socially dangerous) activities were sufficiently concealed as to give rise to no more than reasonable suspicion, they would go undetected and uncorrected.\"); id. at 880 (\"[T]he probationer is in need of rehabilitation and is more likely than the ordinary citizen to violate the law . . . .\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. In a footnote, the Court explained: \"We italicize those words lest our reasoning be misunderstood. In none of our previous special needs cases have we upheld the collection of evidence for criminal law enforcement purposes. Our essential point is [that] the extensive entanglement of law enforcement cannot be justified by reference to legitimate needs.\" Id. at 83 n.20 (citations omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. As a matter of fact, Knights does not even mention Ferguson, and it references Edmond only once-and purely in passing. Id. at 122.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Judge Reinhardt's dissent claims we confuse the result of a special needs analysis with its trigger: \"The departure from the warrant-and-probable cause regime of the Fourth Amendment is not what triggers a special needs analysis; that departure is the result of a special needs analysis in which the Court finds a valid programmatic purpose to the search regime-a purpose apart from law enforcement needs.\" Post at 11513 n.23. The problem with this view is that courts look for a special need apart from law enforcement needs only after the government has executed some challenged search without first obtaining a warrant supported by probable cause. The Court's resort to special needs analysis in such cases is the product of that failure, and it has applied such analysis even in warrantless search cases where there was reasonable suspicion, like Griffin and T.L.O. Contrary to Judge Reinhardt's charge, this understanding is compatible with the Court's decisions in Maryland v. Buie, 494 U.S. 325 (1990) (\"protective sweeps\"), Chimel, 395 U.S. at 752 (searches incident to arrest), and Terry, 392 U.S. at 1 (pat-down searches). Cf. post at 11513 n.23. As we already have explained, the Court has justified each of those searches with reference to non-law enforcement goals-primarily officer safety. See supra at 11440-42; see also Buie, 494 U.S. at 327 (\"A 'protective sweep' is a quick and limited search of premises, incident to an arrest and conducted to protect the safety of police officers or others.\") (empha sis added). Given its eagerness to eschew \"manufactur[ing] neat categories with clever names,\" post at 11496, and preference for grouping all warrantless searches \"into one large category of cases involving 'special needs,' \" id., it is odd that Judge Reinhardt's dissent does not recognize that these searches-which generally are conducted with some level of suspicion, but ultimately are justified by reference to a non-law enforcement goal-are easily reconciled with our understanding of the special needs doctrine.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. We recently were presented with an opportunity to address the question left open by Knights. At issue in United States v. Crawford, 372 F.3d 1048 (9th Cir. 2004) (en banc), was the constitutionality of a suspicionless search conducted pursuant to a standard California probation and parole term almost identical to the one at issue in Knights. However, we did not resolve whether the search was constitutional. Over the objection of five judges, see id. at 1062 (Trott, J., concurring), we instead \"assume[d] for purposes of our decision, but need[ed] not and d[id] not decide, that the parole search was unlawful,\" id. at 1053 (majority opinion), and resolved the case based solely on an attenuation analysis pursuant to New York v. Harris, 495 U.S. 14 (1990). Id. at 1054-59.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. To our knowledge, only two judges-besides, of course, the majority of the three-judge panel that first heard this case, see United States v. Kincade, 345 F.3d 1095, vacated and reh'g en banc granted, 354 F.3d 1000 (9th Cir. 2003)-have invalidated DNA collection statutes. United States v. Miles, 228 F. Supp. 2d 1130, 1135-40 (E.D. Cal. 2002); Maryland v. Raines, Montgomery County Circuit Court Criminal Case No. 98303 (January 28, 2004), summarily vacated with published opinion to follow, __ A.2d __, 2004 WL 1558114 (Md. July 13, 2004).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. In his Ferguson dissent, Justice Scalia cited Griffin (a decision he authored)-pointedly observing that the search in that case was spurred by information provided to Griffin's probation officer by the police and that the probation officers who conducted the search of Griffin's residence were accompanied by police officers-in support of the proposition that \"special-needs doctrine was developed, and is ordinarily employed, precisely to enable searches by law enforcement officials who, of course, ordinarily have a law enforcement objective.\" 532 U.S. at 100 (Scalia, J., dissenting) (emphasis in original). The Ferguson majority's identification of a constitutionally significant distinction between the expectations of privacy enjoyed by probationers and those of ordinary citizens was thus the crucial feature of its response to Justice Scalia's claim-that the presence of a law enforcement objective is not fatal to a search assessed under a special needs analysis. Compare id. at 79 n.15 with id. at 100-02 (Scalia, J., dissenting). Judge Reinhardt's dissent, post at 11507 n.20, misreads this exchange between the Ferguson majority and dissent-in no small part because it overlooks the facts of Griffin, where (to reiterate), police had initiated contact with the probation office, encouraged probation officers to search Griffin's residence, accompanied them during the search, and processed the evidence produced by the search, where it then was used not merely to revoke Griffin's probation, but was turned over to the district attorney's office in order to prosecute Griffin on new charges. See Griffin, 532 U.S. at 870-72. Perhaps we are missing something, but this seems to be precisely the kind of \"entangl[ing] probation officers with normal law enforcement officers in a collective effort to investigate, solve, and prosecute crimes\" that Judge Reinhardt's dissent claims is forbidden by Ferguson. Post at 11507 n.20. Yet the whole point of Ferguson's having explicitly distinguished Griffin was to harmonize the two cases-not overrule the latter: \"Griffin is properly read as limited . . . .\" Ferguson, 532 U.S. at 79 n.15.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. A substantial portion of Judge Reinhardt's dissent is devoted simply to establishing that the Supreme Court has never expressly authorized suspicionless, arguably law enforcement-oriented searches of conditional releasees. As we have demonstrated, the Court also has expressly declined to condemn such searches. This common occurrence-the Supreme Court's not yet having squarely resolved a legal question-is why we have a case to decide, and we are heartened by Judge Reinhardt's recognition that there is a good reason why we are sitting en banc. To the extent Judge Reinhardt's dissent's refrain of \"never,\" post at 11479, 11497,11499, 11511, 11525, is intended to support its challenge to the DNA Act's constitutionality, we note again that the Supreme Court rejected that peculiar logic in Knights-while reversing, incidentally, a decision Judge Reinhardt had joined, see United States v. Knights, 219 F.3d 1138 (9th Cir. 2000). See supra at 11450-51 (discussing and quoting Knights, 534 U.S. at 117-18). In the spirit of Knights, we note that Judge Reinhardt's suggestion-that the Court's failure as yet explicitly to sanction suspicion-less searches of conditional releasees somehow implicitly holds such searches unconstitutional-is as logically dubious as it is contrary to Knights's express statement that the Court needed \"not decide whether the probation condition so diminished, or completely eliminated, Knights's reasonable expectation of privacy . . . that a search by a law enforcement officer without any individualized suspicion would have satisfied the reasonableness requirement of the Fourth Amendment.\" Id. at 120 n.6.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. In Morrissey v. Brewer, the Supreme Court observed: Typically, parolees are forbidden to use liquor or to have associa tions or correspondence with certain categories of undesirable persons. Typically, also they must seek permission from their parole officers before engaging in specified activities, such as changing employment or living quarters, marrying, acquiring or operating a motor vehicle, traveling outside the community, and incurring substantial indebtedness. Additionally, parolees must regularly report to the parole officer to whom they are assigned and sometimes they must make periodic written reports of their activities. 408 U.S. 471, 478 (1972) (citing Arluke, A Summary of Parole RulesThirteen Years Later, 15 Crime \u0026 Delinq. 267, 272-273 (1969)). More contemporary parole and probation restrictions can be found in U.S.S.G. §§ 5B1.3 \u0026 5D1.3. Beyond these restrictions, parolees and probationers convicted of serious crimes are denied the right to vote by most states. See The Sentencing Project, Felony Disenfranchisement Laws in the United States 1, 3, available at http://www.sentencingproject.org/pdfs/1046.pdf (last visited May 24, 2004) (noting that 31 states deny the franchise to felons on probation and that 35 states deny the franchise to felons on parole). In addition, their Second Amendment rights are severely limited. See, e.g., 18 U.S.C. § 922(g)(1) (\"It shall be unlawful for any person who has been convicted in any court of, a crime punishable by imprisonment for a term exceeding one year . . . to ship or transport in interstate or foreign commerce, or possess in or affecting commerce, any firearm or ammunition; or to receive any firearm or ammunition which has been shipped or transported in interstate or foreign commerce.\") (enumeration omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. We also note, as Judge Trott has, that conditional releasees remain entitled to other basic protections: Should the manner in which such a search or seizure [i]s conducted shock the conscience of our community's sense of decency and fairness, or [be] so brutal and offensive that it d[oes] not comport with traditional ideas of fair play and decency, then the exclusionary rule [and] 28 U.S.C. § 1983 would provide both remedy and redress. Id. at 1072 (quotations and enumeration omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. But see supra at 10 n.9.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. Indeed, our cases already recognize such distinctions. As we noted in Rise: The gathering of fingerprint evidence from \"free persons\" constitutes a sufficiently significant interference with individual expectations of privacy that law enforcement officials are required to demonstrate that they have probable cause, or at least an articulable suspicion, to believe that the person committed a criminal offense and that the fingerprinting will establish or negate the person's connection to the offense. Nevertheless, everyday \"booking\" procedures routinely require even the merely accused to provide fingerprint identification, regardless of whether investigation of the crime involves fingerprint evidence. Thus, in the fingerprinting context, there exists a constitutionally significant distinction between the gathering of fingerprints from free persons to determine their guilt of an unsolved criminal offense and the gathering of fingerprints for identification purposes from persons within the lawful custody of the state. Rise, 59 F.3d at 1559-60 (citations and parentheticals omitted). Of course, the distinction Rise identified is even greater in this case, as the DNA Act implicates only the rights of convicted felons-not \"free persons or even mere arrestees.\" Id. at 1560.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. Kincade's response to this argument-that virtually all free persons have been required to give up evidence of their identity at some point in time, yet may still legitimately claim exemption from compulsory DNA testing-misses the mark. Those who have suffered a lawful conviction lose an interest in their identity to a degree well-recognized as sufficient to entitle the government permanently to maintain a verifiable record of their identity; not merely sporadically to demand its production under independently lawful conditions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Amicus Public Defender for the District of Columbia, for instance, starkly warns that the government's storage of samples allows it to \"retain[ ] the personal medical information of thousands of its citizens, potentially retaining access to those citizens' biological secrets for however long, and to whatever end, state authorities see fit.\" Amicus Protection \u0026 Advocacy, Inc., cautions \"it is inevitable that as technology advances, at some point, [DNA samples] will be used for other purposes without the consent or knowledge of the individual tested.\" And amicus Electronic Privacy Information Center predicts that \"soon, if not already, scientists will request access to what would serve as [a] pre-existing goldmine of DNA data for their research.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. See 42 U.S.C. §§ 14132(b)(3) (strictly limiting the permissible uses of DNA profiles and stored samples) \u0026 14135e (providing criminal penalties for those who improperly disclose or receive DNA profiles or stored samples).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. In particular, we pause to note here that we express no opinion on the legality-constitutional or otherwise-of the so-called \"DNA dragnets\" cited by Kincade, his aligned amici, and Judge Reinhardt's dissent.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. Beyond these factors, we note that conditional releasees are clearly informed of the condition requiring them to submit to compulsory DNA profiling, thus further reducing any expectation of privacy they otherwise may enjoy and further minimizing the intrusiveness of the search. See Knights, 534 U.S. at 119-20 (\"The probation order clearly expressed the search condition and Knights was unambiguously informed of it. The probation condition thus significantly diminished Knights' reasonable expectation of privacy.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. Kincade argues that the deterrent theory of DNA profiling rests on a logical fallacy: that potential criminals will be thinking seriously enough about the implications of DNA profiling for their actions that they might be deterred from committing a crime, but not thinking seriously enough \"to realize that they are safe as long as they avoid leaving DNA evidence at the scene.\" In fact, he claims, the deterrent theory is especially \"far fetched\" because recidivists' knowledge that the authorities have their fingerprints does not seem to deter them from committing additional crimes. The problem with this suggestion is that, unlike fingerprint evidence (which can be effectively masked by wearing gloves), there is no simple way to avoid leaving DNA evidence at the scene of a crime. Just as DNA permeates blood, semen, and saliva, it is recoverable from hair and epidermal cells-which even the most sophisticated criminals cannot help but leave behind. Techniques first developed in Britain have allowed scientists to generate DNA profiles from just 30-50 cells' worth of genetic material, and a new crime lab planned for New York City expects to generate profiles culled from as little as 6 cells' worth of genetic material collected at the scene of nearly every crime committed in the city-including all-too-common non-violent property offenses like home burglaries and auto thefts. See Shaila K. Dewan, As Police Extend Use of DNA, a Smudge Could Trap a Thief, N.Y. Times, May 26, 2004.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. We might further observe that the CODIS database can help absolve the innocent just as easily as it can inculpate the guilty. For while it undoubtedly is true that the wrongly-accused can voluntarily submit to DNA testing should the need arise, use of CODIS promptly clears thousands of potential suspects-thereby preventing them from ever being put in that position, and \"advancing the overwhelming public interest in prosecuting crimes accurately,\" Rise, 59 F.3d at 1561 (emphasis in original), and expeditiously.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. We note that the universal application of DNA profiling to qualified federal offenders precludes any claim that any particular searches carried out pursuant to the Act are arbitrary, capricious, or harassing. See supra at 11462-63; see also Crawford, 372 F.3d at 1072 (Trott, J., concurring). As we recognized in Rise, this is a case in which \"the evenhandedness of [the] statute contributes to its reasonableness,\" 59 F.3d at 1561, \"by ensuring that blood extractions will not be ordered randomly or for illegitimate purposes.\" Id. at 1562.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. In Knights, the Supreme Court left open whether a suspicionless search of a parolee was reasonable under the Fourth Amendment's totality of the circumstances analysis. Knights, 534 U.S. at 120 n.6.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. Judge Reinhardt in dissent at footnote 17 argues that even if deterrence of supervised releasees is the ultimate goal, the immediate objective of the search is to get evidence of past crime. I do not agree. Increasing the likelihood of solving future crime, a key purpose of the DNA Act, serves a deterrence goal at the heart of supervised release. The DNA Act was made applicable to those on supervised release, as opposed to the public at large, demonstrating a Congressional intent to ensure successful rehabilitation through deterrence. I do not grasp at a \"special needs\" straw to justify the search of Kincade; more precisely, I recognize the special need of super vised release that Congress has identified and that the Supreme Court has approved. Judge Reinhardt, with an advocate's flair, reads too much into the point I made, which he quotes, in my article co-authored with Dr. Simon Stern, entitled Catastrophic Threats and the Fourth Amendment, 77 S. Cal. L. Rev. 777, 814 \u0026 n.160 (2004). That article takes a flexible approach to special needs doctrine that I think wholly consistent with my analysis here. While we there noted that the specific deterrence that indirectly arises from the prosecution of an ordinary criminal is not the main aim of a prosecution, our point there has no bearing on determining the controlling purposes of the DNA Act. The DNA Act applies only after a person has been prosecuted. Thus, unlike a prosecution, where the main goal is to vindicate the state's interest in law enforcement, DNA profiling a person on supervised release in my view is best seen as serving a different main goal. That goal, as I see it, is rehabilitation through deterrence. Judge Reinhardt in his dissent also misses the mark in his all-or-nothing approach to the DNA Act in footnote 19. Because circumstances that arise when a releasee has completed supervised release and is no longer in the criminal justice system are not now before us, we cannot definitively discuss the legality of the DNA Act beyond its immediate application to Kincade in the case now presented. Indeed, outside of the First Amendment, we do not lightly entertain facial challenges to Congressional acts. See Yazoo \u0026 Miss. Valley R.R. v. Jackson Vinegar Co., 266 U.S. 217 (1912) (generally precluding consideration of a statute's constitutionality as applied to the facts of other cases); Richard H. Fallon, Jr. et al., Hart and Wechsler's The Federal Courts and the Federal System 180-84 (5th ed. 2003) (noting that the Supreme Court generally refuses to adjudicate facial challenges). The dissent errs by focusing overmuch on facts not here presented.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. Fingerprints, of course, are routinely maintained in law enforcement files once taken, and perhaps this is an arguable analogy for DNA databases. But, unlike fingerprints, DNA stores and reveals massive amounts of personal, private data about that individual, and the advance of science promises to make stored DNA only more revealing in time. Like DNA, a fingerprint identifies a person, but unlike DNA, a fingerprint says nothing about the person's health, their propensity for particular disease, their race and gender characteristics, and perhaps even their propensity for certain conduct.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. A similar issue might be raised by former soldiers who had a DNA sample taken for purposes of \"identification of human remains,\" and who might be concerned to know that these DNA samples, though taken for use in identifying remains of fallen soldiers, now are routinely used in law enforcement investigations. See Patricia A. Ham, An Army of Suspects: The History and Constitutionality of the U.S. Military's DNA Repository and Its Access for Law Enforcement Purposes, 2003-AUG Army Law. 1; 62 Fed. Reg. 51835, 51835 (Oct. 3, 1997). Possibly such a practice is justifiable under a balancing test, but in a proper case the privacy issues will be confronted. I express no view on the proper resolution of this question.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. The plurality consists of five judges, including the author, who have joined Judge O'Scannlain's opinion. They adopt a sweeping totality of the circumstances test, as I will explain, blatantly eviscerating the constitutional requirement of individualized suspicion for law enforcement searches. One judge, Judge Gould concurs on a different basis, making the necessary six votes to affirm. Judge Gould's rationale, the \"special needs\" test, is on its face more limited than the plurality's, but in the end its application here would also have drastic adverse consequences for our Fourth Amendment protections. Five judges, the same number who compose the plurality, dissent. Four of those judges join this opinion, including the author. The fifth, Judge Hawkins, dissents for similar reasons.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. CODIS is a three-tired hierarchical system of information sharing. The FBI's National DNA Index System (NDIS) constitutes the highest level in the CODIS hierarchy, all participating laboratories at the local and state level have access to the NDIS database. All DNA profiles in the CODIS system are collected at the local level (LDIS) before flowing to operative state databases (SDIS). SDIS \"allows laboratories within states to exchange DNA profiles.\" See CODIS Mission Statement and Background, available at http://www.fbi.gov/hq/lab/codis/ program.htm (last visited June 20, 2004) [hereinafter CODIS Mission Statement and Background]. \"The tiered approach allows state and local agencies to operate their databases according to their specific legislative or legal requirements.\" Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. The DNA Act itself defines a DNA sample as \"a tissue, fluid, or other bodily sample of an individual on which a DNA analysis can be carried out.\" 42 U.S.C. § 14135a(c)(1). However, the record in this case reveals, and neither party before us has disputed, that the FBI has required all participating CODIS laboratories to construct DNA profiles by obtaining blood samples.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. This is not to say that the enumerated qualifying crimes are not serious. Indeed, many of the crimes listed at 28 C.F.R. §28.2 are among the most heinous crimes in the federal code. Some of the more severe qualifying crimes include murder, 18 U.S.C. § 1111; sexual abuse and assault, 18 U.S.C. §§ 2241-45; the willful destruction of aircrafts and terrorist attacks, generally, and against mass transportation systems, 18 U.S.C. §§ 32, 1993, 2332f, 2332b; the development, stockpiling, or use of chemical, biological, or nuclear weapons, 18 U.S.C. §§ 175, 229, 831, 2232a; the commission of genocide, 18 U.S.C. § 1091, torture, 18 U.S.C. § 2340A, or other war crimes, 18 U.S.C. § 2441; threats against the President, 18 U.S.C. § 871; and the assassination or attempted assassination of high-level government officials, 18 U.S.C. § 351, 1751.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. California's ballot initiatives have often served as models for other states. Proposition 227, CAL. EDUC. CODE § 300 (1998), to take just one example, which eliminated bilingual education in the state and replaced it with English language immersion courses, almost immediately became a prototype for similar legislation in other states. See generally Charu A. Chandrasekhar, The Bay State Buries Bilingualism: Advocacy Lessons Learned from Bilingual Education's Recent Defeat in Massachusetts, 24 CHICANO-LATINO L. REV. 43 (2003). So too did Proposition 209, the anti-affirmative action measure, and Proposition 13, the tax reduction measure that placed drastic limitations on local governmental taxing powers, especially with regard to property taxes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. Some states have already passed legislation authorizing police to collect blood samples, with or without consent, from any driver reasonably suspected of drunk driving. See Joseph T. Hallinan, Police Draw Blood, Literally, as They Fight to Put a Stop to Intoxicated Drivers, L.A. DAILY, Mar. 24, 2004, at 4 (noting that Alaska, Arizona, Florida, Indiana, Iowa, Michigan, Nevada, and Texas have all passed legislation authorizing forcible extraction of blood samples).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. Some scholars currently advocate extending CODIS to cover the entire population. See, e.g., D.H. Kaye \u0026 Michael E. Smith, DNA Identification Databases: Legality, Legitimacy, and the Case for Population-Wide Coverage, 2003 WIS. L. REV. 413 (2003). As noted supra, at 11481, all members of the Armed Forces are already required to provide DNA samples.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. None of those exceptions serves to justify the present search regime, which, as I describe below, is intended for the primary purpose of assisting in the everyday investigation and prosecution of crimes. See infra, at 11501-03.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. The term \"special needs\" first appeared in Justice Blackmun's concurrence in New Jersey v. T.L.O., 469 U.S. 325 (1985), in which he stated that certain cases would allow for exceptions to the warrant and probable-cause requirements when the balance of governmental and private interests supported such a departure, but that such balancing would be appropriate only \"in those exceptional circumstances in which special needs, beyond the normal need for law enforcement, make the warrant and probable-cause requirement impracticable.\" Id. at 351. On several occasions, the Supreme Court has upheld suspicionless non law enforcement search regimes without using the words \"special needs.\" See, e.g., Hudson v. Palmer, 468 U.S. 517 (1984) (prisons); United States v. Ramsey, 431 U.S. 606 (1977) (border searches); Camara v. Municipal Court of City and County of San Francisco, 387 U.S. 523 (1967) (administrative inspections). But nearly all of those cases pre-dated the Court's first use of the phrase \"special needs.\" See T.L.O., 469 U.S. at 353. Moreover, later Courts have categorized the group of cases involving suspicionless searches and needs beyond the need for normal law enforcement as \"special needs\" cases. See, e.g., Indianapolis v. Edmond, 531 U.S. 32, 37-38 (2000) (explaining that the border search line of cases and the previous traffic stop case, Michigan Dept. of State Police v. Sitz, 496 U.S. 444 (1990), were special needs cases because they involved suspicionless search programs \"whose primary purpose was [not] to detect evidence of ordinary criminal wrongdoing\"); Burger, 482 U.S. at 702 (explaining that the administrative search line of cases falls under situations of \"special need\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. This basic Fourth Amendment tenet was reiterated this term in Hiibel v. Sixth Judicial District Court, 124 S.Ct. 2451 (2004). There, the Court explicitly reaffirmed its holding in Brown v. Texas, 443 U.S. 47, 52 (1979), that it is unconstitutional to require individuals to identify themselves to police officers without reasonable suspicion. Some level of individualized suspicion, therefore, remains the sine qua non of cases involving searches undertaken for law enforcement purposes, even when the only identifying information sought is a person's name.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. I recognize that several Circuits have recently done so in affirming the DNA Act on one theory or another. See ante, at 11455-57. I respectfully disagree with those decisions for the reasons set forth in this dissent.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. For the most part, the Court has required law enforcement officials to have probable cause in order to invade individuals' bodily integrity for the purpose of assisting ordinary criminal investigations. See Cupp v. Murphy, 412 U.S. 291, 295-96 (1973) (holding that police could require a suspect to give scrapings from his fingernails as evidence only because of the \"existence of probable cause\"); Davis v. Mississippi, 394 U.S. 721, 727-28 (1969) (holding that police could not force \"suspects\" to give fingerprints to aid in a criminal investigation absent probable cause).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. The plurality's contention that the purpose of the searches is irrelevant confuses the subjective intent of the individual officer conducting the search, which is irrelevant under Whren v. United States, 517 U.S. 806, 813 (1996), with the objective purpose of the programmatic search regime, which the special needs doctrine requires us to evaluate. See Ferguson, 532 U.S. at 81, 83-84 \u0026 n.20.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57. The government's supplemental en banc brief attempts to recast the purpose of the DNA Act purely in terms of meeting the supervisory needs of the parole and probation systems. See Supplemental En Banc Br. for the United States, at 13-14. This assertion, while clever, is belied by the government's arguments made before the initial panel in this case. The government's contention is even less credible when compared against the express purpose as stated in the legislative history of the DNA Act. Moreover, as I discuss infra, the collection of DNA samples is not a part of the supervisory function of federal or state probation systems, and the Act is not primarily directed at probationers, parolees, or conditional releasees but at all persons convicted of designated crimes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58. The executive branch's interpretation of the DNA Act and CODIS supports the understanding advanced by the legislative history. See, e.g., Dep't of Justice, Using DNA to Solve Cold Cases 4 (July 2002) (stating that the DNA database system is a \"powerful tool for law enforcement\"); Dep't of Justice, No Suspect Casework DNA Backlog Reduction Program (FY 2001), at 1 (August 2001) (\"DNA evidence used in conjunction with the Combined DNA Index System (CODIS) is a powerful investigative tool beginning at the crime scene with the collection of evidence and ending with a judicial conclusion.\"); see also Justice Dep't. Acts to Clear DNA Backlog, MIAMI HERALD, Aug. 2, 2001, at 19A (quoting Attorney General Ashcroft as saying \"DNA technology can operate as a kind of truth machine, ensuring justice by identifying the guilty and clearing the innocent.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59. Claiming that DNA profiles are designed to \"identify\" the releasee, much like fingerprints, is disingenuous. See ante, at 11466. Kincade, for instance, was identified and booked with fingerprints, and his identification was confirmed by a criminal conviction before a court of law, long before his DNA sample was taken. The collection of a DNA sample thus does not \"identify\" a conditional releasee any more than a search of his home does - it merely collects more and more information about that releasee that can be used to investigate unsolved past or future crimes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e60. Judge Gould contends that the DNA Act serves the special needs of a supervised release system simply by deterring future crime. See Gould concurrence, at 11472. That, however, is not the purpose of the Act. See text preceding and following this note; see also Kozinski dissent, at 11534-35. Moreover, even if deterrence were a conscious goal of the CODIS system, the special needs doctrine would not apply. The concurrence confuses an alleged ultimate goal of the programmatic search regime with the \"immediate objective of the search[ ],\" a distinction that \"is critical.\" See Ferguson, 532 U.S. at 82-83 (holding that the relevant consideration is whether the direct and primary purpose of the search is to \"generate evidence for law enforcement purposes\"). The forced extraction of blood is not designed to scare the releasee into avoiding crime - it is designed to permit the construction of a national database aimed at solving past and future crimes. See supra at 11455-57. That an ultimate objective of the Act, the reduction of crime through the incarceration of dangerous criminals or deterrence, is compatible with the goals of the probation system is irrelevant. As Ferguson explained, \"law enforcement involvement always serves some broader social purpose or objective, [and] under respondents' view, virtually any nonconsensual suspicionless search could be immunized under the special needs doctrine by defining the search solely in terms of its ultimate, rather than immediate, purpose. Such an approach is inconsistent with the Fourth Amendment.\" 532 U.S. at 84; see also Ronald M. Gould \u0026 Simon Stern, Catastrophic Threats and the Fourth Amendment, 77 S.C.L.R. 777, 814 n.160 (2004) (\"The indirect interdiction of criminals from committing future crimes is inchoate in each prosecution, but it is not the main point.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e61. Ironically, that is where Kincade's blood sample was eventually extracted. The fact that his incarceration was to be followed by a period of supervised release was irrelevant. The DNA would have been taken in prison and placed permanently in CODIS whether or not a subsequent period of conditional release had been imposed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e62. Judge Gould attempts to limit our inquiry to the sole question whether it is legitimate to take blood from probationers and/or parolees and to disregard the use to which the samples will inevitably be put. That is not the way in which the Court evaluates the programmatic purpose, and thus the constitutionality, of a search regime in special needs cases. We must look directly to the Act and its purpose. See Ferguson, 532 U.S. at 81, 83-84 \u0026 n.20 (examining use to which urine samples were put); see also ante, at 11466-657 (explaining that \"our job is limited to resolving the constitutionality of the program before us, as it is designed and as it has been implemented\"). Moreover, under today's prevailing view, it is highly unrealistic to suggest as Judge Gould does, that individuals whose blood samples are stored in CODIS may be free to sue to destroy their DNA records after the period of their release has expired. Doing so would vitiate the very purpose underlying the adoption of the DNA Act. Furthermore according to the plurality, the Fourth Amendment violation in this case is limited to the extraction of blood. They believe that what is done with that information once it is taken is irrelevant for Fourth Amendment purposes. See ante, at 11466-67. This, of course, is directly contrary to the mode of analysis that Ferguson dictates. In any event, according to the plurality, an individual who has completed his period of supervised release would not be free to show that the DNA Act authorized an unconstitutional \"search\" under its interpretation of the Fourth Amendment. Finally, Judge Gould's approach would allow future courts to justify law enforcement programs under any interest related but subordinate to the primary, traditional, law enforcement need served by the search. Including newborns in CODIS could be justified to serve the weighty needs to help prevent child abductions and assist in paternity determinations, even if the primary purpose were to maintain the newborns' records throughout their lives for use in future criminal investigations. This, too, is directly contrary to Ferguson. 532 U.S. at 84.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e63. The plurality contends that Ferguson interpreted Griffin to mean that the requirements of the special needs doctrine simply do not apply in cases involving searches of probationers and parolees. Ante, at 11457-58 n.26. This reading of Ferguson is plainly incorrect. The Ferguson footnote to which the plurality refers responded to the argument, made in Justice Scalia's dissent, that the special needs doctrine permits suspicionless searches conducted by law enforcement officials for law enforcement objectives. 532 U.S. at 81 n. 15. For support, Justice Scalia cited Griffin. The Ferguson majority responded that \"Griffin does not support the proposition for which the dissent invokes it.\" Id. It explained that the special needs cases have approved suspicionless searches only when \"there was no law enforcement purpose behind the searches . . . and there was little, if any, entanglement with law enforcement.\" Id. Yet this is exactly what the DNA Act contemplates - probation officers are required under the Act to collect DNA samples and immediately turn them over to federal law enforcement officers for analysis, storage in CODIS, and possible use in future criminal prosecutions. See 42 U.S.C.A. § 14135a (b). The DNA Act thus entangles probation officers with normal law enforcement officers in a collective effort to investigate, solve, and prosecute crimes. This is precisely the type of program that Ferguson suggested would violate the Fourth Amendment The plurality, however, asserts that we reach this result by misreading the facts of Griffin. See ante, at 11457-58 n.26. Yet the facts of Griffin clearly reflect that although the search was initiated by a police tip and police officers were physically present at the home being searched, every critical juncture of the search process - from the decision to search to the search itself - was carried out and decided upon entirely by the probation officers and not the police. Indeed, Griffin relied upon the fact that the probation authorities, who \"while assuredly charged with protecting the public interest, [are] also supposed to have in mind the welfare of the probationer,\" id. at 876, were in control of the search rather than the police: \"we deal with a situation in which there is an ongoing supervisory relationship - and one that is not, or at least not entirely, adversarial - between the object of the search and the decisionmaker.\" Id. at 879. Therefore contrary to the plurality's claim, Griffin did not involve, but rather condemned, as Ferguson noted, the entanglement of probation officers with law enforcement objectives.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e64. I recognize that even special needs cases employ a balancing test akin to a \"totality of the circumstances\" approach. But they do so only after the search regime in question has been deemed to be a valid, non-law enforcement search. Compare Ferguson, 532 U.S. at 84 \u0026 n.21 (refusing to apply \"a balancing test to determine Fourth Amendment reasonableness\" because the search was undertaken to generate evidence for use by the police in enforcing general criminal laws); with Lidster, 124 S.Ct. at 889-91 (considering the balance of privacy interests versus governmental needs only after determining that the traffic stop in question \"was not to determine whether [the individuals searched] were committing a crime, but to ask vehicle occupants, as members of the public, for their help\"). Thus, the \"general Fourth Amendment\" approach to reasonableness is something that has been applied in suspicionless search cases only after the Court has determined that the alleged \"special need\" consists of a valid non-law enforcement purpose.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e65. Robinette, of course, is an example of the traditional use of the totality of the circumstances approach. In Robinette, the Court considered whether an officer had probable cause to ask a driver to get out of his car after he had been pulled over for speeding. The question, as in almost all \"general\" Fourth Amendment cases, was whether the officer had sufficient suspicion to justify his subsequent search in the absence of a warrant, not whether he needed to have some level of suspicion. See 519 U.S. at 38-40.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e66. Additionally, it simply cannot be the case that \"special needs\" analysis is \"triggered . . . by a departure from the Fourth Amendment's warrant-and-probable cause requirements.\" Ante, at 11452. If that were the case, special needs analysis would control cases involving protective sweeps, see Maryland v. Buie, 494 U.S. 325 (1990), searches incident to arrest, see Chimel v. California, 395 U.S. 752 (1969), and pat-down searches, Terry v. Ohio, 392 U.S. 1 (1968). The departure from the warrant-and-probable cause regime of the Fourth Amendment is not what triggers a special needs analysis; that departure is the result of a special needs analysis in which the Court finds a valid programmatic purpose to the search regime - a purpose apart from law enforcement needs. Under the plurality's view, the \"trigger\" of the special needs doctrine is the same as the result. A far better explanation, in my view, focuses on the reason why the warrant-and-probable cause regime is not appropriate for determining the constitutional validity of the search in question - the answer, is that the Court has held constitutional search regimes where the lack of any role for individualized suspicion (blanket drug testing of all students, random traffic stops of all drivers, random inspections of closely-regulated businesses) is combined with a valid non-law enforcement purpose.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e67. Whether the state may authorize suspicionless searches of the homes of probationers and parolees remains an unanswered question. See Knights, 534 U.S. at 119 n.6; see also United States v. Crawford, 323 F.3d 700 (9th Cir. 2003) (holding that suspicionless searches of probationers and parolees violates the Fourth Amendment), reh'g granted, vacated by 343 F.3d 961 (9th Cir. 2003); ___ F.3d ___, 2004 WL 1375521 (9th Cir. Jun 21, 2004) (en banc) (assuming over the objection of several concurring judges, but not deciding, that such searches violate the Fourth Amendment, but holding that the evidence challenged was too attenuated to be deemed a product of the search).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e68. The fact that the school search cases, such as Earls and its predecessors, are considered paradigm \"special needs\" cases is further evidence that the level of privacy an individual, or a group of individuals, expects cannot be the deciding factor in whether a totality of the circumstances analysis applies.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e69. The plurality also contends that ample protections for conditional releasees remain in the form of \"a right of privacy against government searches and seizures that are arbitrary, a right of privacy against searches and seizures that are capricious, and a right of privacy against searches and seizures that are harassing.\" Ante, at 11463 (quoting United States v. Crawford, __ F.3d __, __ (9th Cir. 2004) (en banc) (Trott, J., concurring)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e70. The plurality, however, claims that the significant difference between normal citizens and convicted offenders factors heavily in the totality of the circumstances analysis, and therefore that the test is not nearly as expansive as I have claimed. No one should take solace from this assertion. There is no difference in kind, only one of degree, between conditional releasees and the countless other groups of individuals who have been found to possess limited expectations of privacy. And while school children or applicants for federal positions arguably possess more privacy than conditional releasees, the plurality is fundamentally unable to explain how higher expectations of privacy which still fall considerably short of a \"full\" expectation of privacy will be sufficient to trump the awe-inspiring law enforcement interests found by the plurality to be advanced by the DNA Act and, undoubtedly, by other statutes designed to provide law enforcement with more effective modern tools. If the totality of the circumstances test really were the \"traditional\" Fourth Amendment test regardless of the absence of suspicion, and if the special needs doctrine really were made inapplicable when the group targeted by a blanket suspicionless search regime has diminished expectations of privacy, it would be difficult to subject suspicionless searches to serious Fourth Amendment scrutiny in the future.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e71. Certainly, it constitutes far more of an intrusion than merely requiring an individual to identify himself. See Hiibel, 124 S.Ct. 2451, and Brown, 443 U.S. at 52 (requiring reasonable suspicion for such an inquiry).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e72. See Tolbert v. Gomez, 190 F.3d 985, 990 (9th Cir. 1999) (Hawkins, J., concurring) (citing instances in which \"prisoners [were] released when scientific tests show they could not have committed the crime of which they were convicted\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e73. Incidentally, the argument that the reliability of a certain types of evidence justifies a relaxed Fourth Amendment standard has been made before and rejected. See Davis, 394 U.S. at 723-24 (explaining that \"we find no merit in the suggestion . . . that fingerprint evidence, because of its trustworthiness, is not subject to the proscriptions of the\" Fourth Amendment).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e74. While Ferguson and most of the Court's special needs cases have involved the population at large, rather than those on supervised release, I do not believe that distinction carries the day; as Judge Reinhardt notes, the privacy expectations of convicted felons are reduced, not eliminated.\u003c/span\u003e\n\n",
    "body_length": 226159,
    "citedas": [
      "379 F.3d 813",
      "2004 Daily Journal D.A.R. 10,196",
      "4 Cal. Daily Op. Serv. 7542"
    ],
    "attorneys": "Counsel Maria E. Stratton, Monica Knox, and Michael Tanaka, Federal PublicDefender, Los Angeles, California, for the appellant. Debra W. Yang, Steven D. Clymer, Ronald L. Cheng, JacquelineChooljian, John B. Owens, U.S. Attorney's Office, Los Angeles,California, and Jonathan L. Marcus, U.S. Department of Justice,Washington, D.C., for the appellee. Marc Rotenberg and Marcia Hofmann, Electronic Privacy InformationCenter, Washington, D.C., for amicus curiae Electronic InformationPrivacy Center, in support of the appellant. Melinda Bird and Michelle Uzeta, Protection \u0026 Advocacy, Inc., LosAngeles, California, for amicus curiae Protection \u0026 Advocacy,Inc., in support of the appellant. Timothy P. O'Toole, Todd Cox, Alison Flaum, and Jennifer Di Toro,Public Defender Service for the District of Columbia, Washington,D.C., for amicus curiae Public Defender Service for the District ofColumbia, in support of the appellant. Bill Lockyer, Robert R. Anderson, Jo Graves, Gerald A. Engler, GeorgeF. Hindall, III, and Enid A. Camps, California Office of the AttorneyGeneral, San Francisco, California, Gregg D. Renkes, Alaska Departmentof Law, Juneau, Alaska, Mark J. Bennett, Hawaii Department of theAttorney General, Idaho Office of Attorney General, Mike McGrath,Montana Department of Justice, Helena, Montana, Hardy Myers, OregonDepartment of Justice, Salem, Oregon, Christine O. Gregoire,Washington Office of the Attorney General, Olympia, Washington, foramici curiae States of California, Alaska, Hawaii, Idaho, Montana,Oregon, and Washington, in support of the appellee.",
    "category": [
      "36",
      "253",
      "254",
      "75"
    ],
    "judges": "Before: Mary M. Schroeder, Chief Judge, Harry Pregerson,Stephen R. Reinhardt, Alex Kozinski, Diarmuid F. O'Scannlain, MichaelD. Hawkins, Barry G. Silverman, Kim M. Wardlaw, Ronald M.Gould,Richard R. Clifton, and Consuelo M. Callahan,Circuit Judges.",
    "citation_count": 194
  }
}
