{
  "id": "4sSpXmYBTlTomsSBXcqx",
  "document": {
    "title": "Oregon v. Wagner",
    "full_title": "STATE OF OREGON v. JEFFREY SCOTT WAGNER",
    "jurisdiction": "Oregon Supreme Court",
    "date": "1988-02-26T00:00:00.000Z",
    "docket": "SC No. S32635",
    "body": "This is the first case to reach this court under ORS 163.150(6),\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e which provides:\n\n\"The judgment of conviction [of aggravated murder] and sentence of death shall be subject to automatic and direct review by the Supreme Court. The review by the Supreme Court shall have priority over all other cases, and shall be heard in accordance with rules promulgated by the Supreme Court.\"\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nDefendant was charged with aggravated murder in the following indictment:\n\n\"The above-named defendant(s) is (are) accused by the Grand Jury of Linn County, State of Oregon, by this Indictment of the Offense of Aggravated Murder,\n\n\"The said defendant(s) did, in Linn County, State of Oregon, between June 26, 1985, and June 27, 1985, unlawfully and intentionally cause the death of another human being, to-wit: Jeri A. Koenig, a witness in a criminal proceeding, by the strangulation and hitting of Jeri A. Koenig about her head and neck, said murder being related to the performance of Jeri A. Koenig's official duties in the justice system, contrary to the Statutes in such cases made and provided, and against the peace and dignity of the State of Oregon.\"\n\nORS 163.095 defines aggravated murder as follows:\n\n\"As used in ORS 163.105 and this section, 'aggravated murder' means murder as defined in ORS 163.115 which is committed under, or accompanied by, any of the following circumstances:\n\n\"* * *\n\n\"(2)(a) The victim was one of the following and the murder was related to the performance of the victim's official duties in the justice system:\n\n\"* * *\n\n\"(E) A juror or witness in a criminal proceeding[.]\"\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nI.\n\nThe indictment was returned on July 3, 1985, and defendant appeared for arraignment before the court on July 10, 1985, with appointed counsel. He was granted until July 22 to enter a plea. He appeared with counsel on that date and entered a plea of not guilty, reserving the right until September 1 to demur and enter a defense of mental disease. Through counsel defendant did demur to the indictment challenging the validity of ORS 163.105\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e under various provisions of the Constitution of the United States and of the Constitution of Oregon. On January 2, 1986, the trial court overruled the demurrer.\n\nAbout one week later defendant personally moved the court for an order\n\n\"allowing me to represent myself in the above-entitled case. It is my desire that I be the person primarily responsible for conducting my own defense, including jury selection, opening statements, direct and cross-examination of witnesses, and closing argument.\"\n\nDefendant also moved that his then-appointed counsel and another lawyer be allowed to serve as\n\n\" co-counsels for the purpose of answering questions which I may have regarding legal issues, as well as for the purpose of obtaining for me discovery materials necessary for my defense.\" (Emphasis added.)\n\nOn January 14 the trial court heard the motion. Defendant testified to his desire and reasons for wanting to represent himself. The trial court then ruled that it would\n\nappoint another lawyer to confer with defendant about his decision to represent himself and would rule on the motion after that had occurred. On January 17 defendant, in open court and after conferring with another appointed lawyer, repeated his desire to proceed pro se. The court then ruled that it would allow him to do so. The trial court file contains no order allowing defendant to represent himself but does contain an order appointing a second lawyer\n\n\"to assist Jeffrey Scott Wagner in his own defense. Mr. McHill is to provide advice and counsel to the defendant but is not to act as Mr. Wagner's attorney.\"\n\nThat defendant's motion to act as his own counsel was allowed also appears from the fact that he personally filed at least 12 motions, the great majority of which were allowed.\n\nOn February 10, which was the day that trial was to commence, defendant informed the court that he desired to withdraw his plea of not guilty and to enter a plea of guilty to the charge of aggravated murder. A written petition to do so had already been prepared.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e The court then informed defendant that the court would have to ascertain that defendant understood what he was doing and the rights that he would be foregoing. At this point defendant, in open court and in the presence of his two lawyer advisers, signed the prepared petition. The court then pointed out that although the printed form referred to \"talking with your lawyer,\" defendant was not represented. The court asked defendant if he had discussed the matter \"in detail\" with his advisers, and defendant answered that he had done so.\n\nThe court then explained to defendant the various constitutional rights that he would forego by pleading guilty and went on to explain the sentencing proceeding that would occur before a jury. Having satisfied itself that defendant understood what he was doing and that he was acting voluntarily and knowingly, the court once more asked defendant if he still wished to plead guilty, and defendant stated that he did. The court then stated:\n\n\"I do plan to wait until tomorrow morning to provide Mr. Wagner the opportunity to fully review this matter again, so\n\nthat in the event he should change his mind, he would still have that opportunity. So, I am not going to accept his plea until tomorrow morning.\"\n\nOn February 11, in open court, the judge ascertained that defendant had had ample opportunity to consult with \"the individuals you wished to consult with regarding your plea\" and that defendant still desired to plead guilty. Once more the court warned defendant that the penalty would be either death or life imprisonment. The prosecutor then stated to the court what evidence the state would offer to prove the charge. The statement covers 18 pages of transcript. After again inquiring of defendant whether he still wanted to plead guilty and possibly be sentenced to death and receiving an answer in the affirmative, the court accepted the plea of guilty.\n\nORS 163.150(1) provides:\n\n\"Upon a finding that the defendant is guilty of aggravated murder, the court shall conduct a separate sentencing proceeding to determine whether the defendant shall be sentenced to life imprisonment or death. The proceeding shall be conducted in the trial court before the trial jury as soon as practicable. If the defendant has pleaded guilty, the sentencing proceeding shall be conducted before a jury impaneled for that purpose. In the proceeding, evidence may be presented as to any matter that the court deems relevant to sentence; however, neither the state nor the defendant shall be allowed to introduce repetitive evidence that has previously been offered and received during the trial on the issue of guilt. The court shall instruct the jury that all evidence previously offered and received may be considered for purposes of the sentencing hearing. This subsection shall not be construed to authorize the introduction of any evidence secured in violation of the Constitution of the United States or of the State of Oregon. The state and the defendant or the counsel of the defendant shall be permitted to present arguments for or against a sentence of death.\" (Emphasis added.)\n\nPursuant thereto the court and parties proceeded to the selection of a jury. Defendant participated fully in jury selection. Jury voir dire occupied February 11, 12, 13, 14, 18 and 19, and the transcript of voir dire covers six volumes of transcript, being some 1,146 pages. Every juror was asked about the juror's attitude or belief concerning the death penalty and if the juror would be willing to impose the death penalty in this case. A jury was impaneled and sworn.\n\nThe state's case in chief took all of February 20, 21, 24 and 25. On February 26, after the state had rested, defendant waived his right to make an opening statement and, except for evidence developed on cross-examination, presented no evidence and rested. Deputy District Attorney Engdall made the state's opening argument, and after defendant had argued, Deputy District Attorney Houchin made the state's closing argument. The court instructed the jury.\n\nA form of verdict required by ORS 163.150(2) was submitted to the jury. The statute provides:\n\n\"Upon the conclusion of the presentation of the evidence, the court shall submit the following issues to the jury:\n\n\"(a) Whether the conduct of the defendant that caused the death of the deceased was committed deliberately and with the reasonable expectation that death of the deceased or another would result;\n\n\"(b) Whether there is a probability that the defendant would commit criminal acts of violence that would constitute a continuing threat to society. In determining this issue, the court shall instruct the jury to consider any mitigating circumstances offered in evidence, including, but not limited to, the defendant's age, the extent and severity of the defendant's prior criminal conduct and the extent of the mental and emotional pressure under which the defendant was acting at the time the offense was committed; and\n\n\"(c) If raised by the evidence, whether the conduct of the defendant in killing the deceased was unreasonable in response to the provocation, if any, by the deceased.\"\n\nWith respect to the second issue that the statute requires be submitted to the jury, the court instructed as follows:\n\n\"The second question is:\n\n\"Is there a probability that Jeffrey Scott Wagner would commit criminal acts of violence that would constitute a continuing threat to society? In deciding the second question, probability means the occurrence of an event is more likely than not to occur. Here the event is the chance of the defendant committing criminal acts of violence. Probability does not mean that the occurrence of the event is certain.\n\n\"In determining this issue you shall consider any mitigating circumstances received in evidence including, but not limited to, the defendant's age, the extent and severity of the defendant's prior criminal conduct and the extent of the mental and emotional pressure under which the defendant was acting at the time the killing was committed.\n\n\"* * *\n\n\"In considering the issues submitted to you, you are to consider all of the evidence submitted to you in this trial. * * *\n\n\"The burden is upon the State to prove beyond a reasonable doubt the affirmative of each of the issues submitted to you. * * *\"\n\nThe issues were presented to the jury as follows:\n\n\"1. Was the conduct of the defendant, Jeffrey Scott Wagner, that caused the death of the deceased, Jeri A. Koenig, committed deliberately and with the reasonable expectation that death of Jeri A. Koenig would result?\n\n\"2. Is there a probability that the defendant, Jeffrey Scott Wagner, would commit criminal acts of violence that would constitute a continuing threat to society?\n\n\"3. Was the conduct of the defendant, Jeffrey Scott Wagner, in killing the deceased, Jeri A. Koenig, unreasonable in response to the provocation, if any, by the deceased, Jeri A. Koenig?\"\n\nThe jury unanimously answered each question \"yes.\" ORS 163.150(5) provides that if each question is answered affirmatively, the sentence must be death.\n\nThe court set sentencing for two days later and on February 28, 1986, orally pronounced sentence of death. Written sentence of death was made, entered and filed on the same day.\n\nThe case is now before this court on \"automatic and direct review\" pursuant to ORS 163.150(6). In this court, both on brief and oral argument, defendant is represented by the Public Defender. In the brief defendant asks that this court modify the sentence of death to life imprisonment with a 30-year minimum\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e or, alternatively, to vacate defendant's plea of\n\nguilty to capital murder and remand the case with directions to the trial court to appoint counsel to represent defendant. In addition, we have allowed a brief to be filed by amici curiae, American Civil Liberties Union and Oregon Criminal Defense Lawyers Association. That brief supports defendant's position that his conviction should be reversed. The Public Defender subsequently filed a memorandum of additional authorities asking that the sentence be modified as sought in defendant's brief or, alternatively, to vacate the plea of guilty and remand the case for trial.\n\nII.\n\nDefendant claims that the trial court cannot entertain a plea of guilty in a capital case because of Article I, section 11, of the Oregon Constitution, which provides:\n\n\"In all criminal prosecutions, the accused shall have the right to public trial by an impartial jury in the county in which the offense shall have been committed; to be heard by himself and counsel; to demand the nature and cause of the accusation against him, and to have a copy thereof; to meet the witnesses face to face, and to have compulsory process for obtaining witnesses in his favor; provided, however, that any accused person, in other than capital cases, and with the consent of the trial judge, may elect to waive trial by jury and consent to be tried by the judge of the court alone, such election to be in writing; provided, however, that in the circuit court ten members of the jury may render a verdict of guilty or not guilty, save and except a verdict of guilty of first degree murder, which shall be found only by a unanimous verdict, and not otherwise; provided further, that the existing laws and constitutional provisions relative to criminal prosecutions shall be continued and remain in effect as to all prosecutions for crimes committed before the taking effect of this amendment.\" (Emphasis added.)\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nIf that claim is correct, that would dispose of this case. We therefore address that claim first. In his brief defendant argues:\n\n\"Defendant's uncounselled plea of guilty to capital murder and resulting death sentence are void under Article I, Section 11 of Oregon's Constitution providing that an accused may\n\nwaive trial by jury and elect to be tried by the judge 'in other than capital cases.'\"\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nA.\n\nDefendant cites law from six other states in support of this argument. Those states are California, Texas, Louisiana, Washington, North Carolina and New Jersey.\n\nPublic policy of the State of California is reflected in a statute that forbids an uncounselled plea of guilty where the maximum punishment for the crime charged is either death or life imprisonment without possibility of parole:\n\n\"Unless otherwise provided by law every plea must be entered or withdrawn by the defendant himself in open court. No plea of guilty of a felony for which the maximum punishment is death, or life imprisonment without the possibility of parole, shall be received from a defendant who does not appear with counsel, nor shall any such plea be received without the consent of the defendant's counsel. No plea of guilty of a felony for which the maximum punishment is not death or life imprisonment without the possibility of parole shall be accepted from any defendant who does not appear with counsel unless the court shall first fully inform him of his right to counsel and unless the court shall find that the defendant understands his right to counsel and freely waives it and then, only if the defendant has expressly stated in open court, to the court, that he does not wish to be represented by counsel. On application of the defendant at any time before judgment the court may, and in case of a defendant who appeared without counsel at the time of the plea the court must, for a good cause shown, permit the plea of guilty to be withdrawn and a plea of not guilty substituted. Upon indictment or information against a corporation a plea of guilty may be put in by counsel. This section shall be liberally construed to effect these objects and to promote justice.\" (Emphasis added.)\n\nWest's Ann Cal Penal Code § 1018. Oregon has no statute forbidding a plea of guilty in a capital case. Indeed, the plain\n\ntext of ORS 163.150(1) envisions a plea of guilty in a capital case.\n\nTexas public policy is also expressed in statute:\n\n\"The defendant in a criminal prosecution for any offense may waive any rights secured him by law except the right of trial by jury in a capital felony case.\"\n\nVernon's Ann CCP art 1.14(a). In an in banc decision, the Court of Criminal Appeals of Texas considered the effect of the statute on a defendant's claim of error in allowing his plea of guilty before a jury. Defendant there contended that his guilty plea to the jury was the equivalent of a waiver of trial by jury, which was forbidden by article 1.14(a). The court reviewed the history of Texas' statutory scheme and held that criminal procedure statutes that allowed a plea of guilty to a felony before a jury had always been considered to be a jury trial. Earlier cases had held that defendants could plead guilty before a jury and be sentenced to death. Defendant contended, however, that amendment of the procedural code should cause article 1.14(a) to be so interpreted as to forbid a defendant to plead guilty before a jury because such a plea amounted to a waiver of jury trial. The court squarely rejected this contention:\n\n\"Consistent with our prior decisions we hold that a plea of guilty before a jury in a capital case constitutes trial by jury. [Citations omitted]. No waiver of jury trial is involved in the present case.\"\n\nWilliams v. State, 674 SW2d 315, 319 (Tex Cr App 1984).\n\nDefendant here argues that the statute and case law of Texas do not permit waiver of trial by jury in capital cases. This is true only if one accepts the idea that a jury trial occurs where a defendant pleads guilty before the jury. We regard this as an oddity of Texas jurisprudential history. We do not regard the statute or its interpretation as being beneficial to this defendant's claim that his guilty plea was forbidden by the Oregon Constitution.\n\nIn Louisiana the public policy is declared by statute:\n\n\"A court shall not receive an unqualified plea of guilty in a capital case. If a defendant makes such a plea, the court shall order a plea of not guilty entered for him.\"\n\nLSA 2 C Cr P art 557.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Again, there is no such statutory expression of policy by the legislature or the people of Oregon.\n\nDefendant cites a Washington statute:\n\n\"No person informed against or indicted for a crime shall be convicted thereof, unless by admitting the truth of the charge in his plea, by confession in open court, or by the verdict of a jury, accepted and recorded by the court: Provided however, That except in capital cases, where the person informed against or indicted for a crime is represented by counsel, such person may, with the assent of the court, waive trial by jury and submit to trial by the court.\" (Emphasis in original.)\n\nWest's RCWA 10.01.060. In State v. Martin, 94 Wash 2d 1, 614 P2d 164, 166 (1980), the court said:\n\n\"We have never interpreted RCW 10.01.060 to prohibit a defendant charged with a capital offense from pleading guilty. Indeed, the first clause of RCW 10.01.060 supports the rule that a defendant may, in fact, plead guilty. This reasoning is supported by RCW 10.49.010 in effect in 1951 when the second clause of RCW 10.01.060 was adopted. RCW 10.49.010 clearly anticipated guilty pleas by defendants charged with murder. It provided:\n\n\"'if the defendant plead guilty to a charge of murder a jury shall be impaneled to . . . determine the degree of murder and the punishment therefor.'\n\n\"(Italics ours.) See State v. Horner, 21 Wash.2d 278, 150 P.2d 690 (1944).\" (Footnote omitted.)\n\nThe court then held that RCW 10.01.060 \"does not prevent a defendant charged with a capital offense from pleading guilty to the crime with which he or she is charged.\" 614 P2d at 166.\n\nThe court went on to hold that because sentence of death, under other sections of Revised Code of Washington, could only be imposed by the same jury that had decided guilt, the death penalty could not be imposed on a defendant who had pleaded guilty to first degree murder.\n\nThis is not at all the same statutory scheme as exists in this state; ORS 163.150(1) plainly provides for impaneling a jury for the sentencing stage of a conviction on a plea of guilty.\n\nIn North Carolina the court upheld a sentence of life imprisonment found by a jury to be appropriate rather than death in State v. Watkins, 283 NC 17, 194 SE2d 800, cert den 414 U.S. 1000, 94 S Ct 253, 38 L Ed 2d 235 (1973). The trial judge had accepted defendant's plea of guilty to the charge of murder in the first degree after making sure that defendant knew that the jury would proceed to decide whether he should be sentenced to death or life imprisonment. After sentence to life imprisonment, defendant appealed, contending that the trial court had no authority to accept his plea to murder in the first degree. The court noted that there was no statute prohibiting a court from accepting a plea of guilty to a capital crime but that the court was not aware of any case in that state in which a judge had accepted such a plea until this one. It noted that it had long been the public policy of the state stemming from court decision that an accused could not be permitted to plead guilty to a crime for which the penalty could be death. The court stated:\n\n\"Notwithstanding the lack of statutory authority to sustain the rule promulgated by the Court, that an accused will not be permitted to plead guilty to a crime for which the penalty is death, the legislature has not seen fit to change it. It has long since become the public policy of this State. Indeed, one accused of a capital crime may not even waive the finding of a bill of indictment against himself. G.S. § 15-140.1 (1965). The idea that a person should be allowed to decree his own death has been unacceptable, not only to the judiciary, but to the citizens at large. This State has inflicted the supreme penalty only when a jury of twelve has been convinced beyond a reasonable doubt of the guilt of the accused after a trial conducted with all the safeguards appropriate to such a proceeding.\"\n\n194 SE2d at 809-10. The court then noted that in 1953 the legislature had provided that a defendant could plead guilty to\n\na charge of first degree murder if both the court and the state agreed to the plea but only if it were agreed that the punishment to be imposed would be life imprisonment. The court then affirmed the judgment:\n\n\"The jury's verdict gave him the life sentence he had asked for, the minimum punishment for murder in the first degree under the law as it was then thought to be.\"\n\n194 SE2d at 811.\n\nApparently in response to this decision, the North Carolina legislature did see fit to change the public policy created by the courts and enacted in 1977 a statute codified as G.S. 15A-2001, which provides:\n\n\"Any person who has been indicted for an offense punishable by death may enter a plea of guilty at any time after his indictment, and the judge of the superior court having jurisdiction may sentence such person to life imprisonment or to death pursuant to the procedures of G.S. 15A-2000. Before sentencing the defendant, the presiding judge shall impanel a jury for the limited purpose of hearing evidence and determining a sentence recommendation as to the appropriate sentence pursuant to G.S. 15A-2000. The jury's sentence recommendation in cases where the defendant pleads guilty shall be determined under the same procedure of G.S. 15A-2000 applicable to defendants who have been tried and found guilty by a jury.\"\n\nSee State v. Johnson, 298 NC 47, 257 SE2d 597 (1979), explaining the change in public policy.\n\nDefendant here argues that we should follow North Carolina's lead by holding that in the absence of a statute authorizing a guilty plea to a capital charge, a guilty plea should not be permitted. One answer is that there has not been established by the courts of this state a public policy against receiving such pleas. There has been no public policy for the legislature to change, as there was in North Carolina. The only public policy in Oregon is to the contrary as expressed in ORS 163.150(1).\n\nThe other jurisdiction to which defendant has directed our attention on this claim that one cannot plead guilty to a capital crime by reason of Article I, section 11, of the Oregon Constitution is New Jersey. He cites State v. Hightower, 214 NJ Super 43, 518 A2d 482 (1986), a decision of the Appellate Division, in which defendant had been found guilty\n\nby a jury of capital murder. That having occurred, defendant instructed his counsel not to present any mitigating evidence in the sentencing stage because defendant preferred death to life imprisonment. Defendant's counsel appealed, and the court held that despite his client's wishes, counsel could present mitigating evidence in order for the jury to carry out its function of weighing both aggravating and mitigating evidence and in order that the state Supreme Court could carry out its statutory duty to consider the proportionality of a sentence of death when compared to similar cases. This decision has nothing to do with whether one can plead guilty to a capital offense.\n\nWe conclude that there is nothing in the law of those states to support defendant's contention that the Constitution of Oregon forbids a plea of guilty to a capital charge. Indeed, public policy as declared by statute in some of those states expressly permits such pleas.\n\nB.\n\nDefendant's argument that Article I, section 11, of the Oregon Constitution prohibits a guilty plea in a capital case is based on a 1932 amendment to that section. Prior to the 1932 amendment, the section provided:\n\n\"In all criminal prosecutions, the accused shall have the right to public trial by an impartial jury in the county in which the offense shall have been committed; to be heard by himself and counsel; to demand the nature and cause of the accusation against him, and to have a copy thereof; to meet the witnesses face to face, and to have compulsory process for obtaining witnesses in his favor.\"\n\nBy Senate Joint Resolution 4, the 1931 legislature referred to the people a proposed amendment to add to section 11 a proviso:\n\n\"provided, however, that any accused person, in other than capital cases, and with the consent of the trial judge, may elect to waive trial by jury and consent to be tried by the judge of the court alone, such election to be in writing.\"\n\nAt the general election on November 8, 1932, the amendment was adopted. Defendant contends that adoption of this clause abrogated a defendant's power to plead guilty in a capital case. We disagree.\n\nThe general rule is that in the absence of a statute forbidding it one can plead guilty in a capital case. As it was long ago stated:\n\n\"Confessions are divided into two classes, [with reference to their sufficiency in evidence for a conviction,] namely, judicial and extrajudicial. Judicial confessions are those which are made before the magistrate, or in court, in the due course of legal proceedings; and it is essential that they be made of the free will of the party, and with full and perfect knowledge of the nature and consequences of the confession. Of this kind are the preliminary examinations, taken in writing by the magistrate, pursuant to statutes; and the plea of 'guilty' made in open court to an indictment. Either of these is sufficient to found a conviction, even if to be followed by sentence of death, they being deliberately made, under the deepest solemnities, with the advice of counsel, and the protecting caution and oversight of the judge.\" (Footnote omitted.)\n\n1 Greenleaf, Evidence § 216 (16th ed 1899). In State v. Watkins, supra, at 807-08, the court acknowledged the general rule:\n\n\"Undoubtedly, at common law, a defendant of competent understanding, duly enlightened, had the right to plead guilty to a capital crime instead of denying the charge. See Green v. Commonwealth, 94 Mass. (12 Allen) 155 (1866); 31 N.C.L. Rev. 405 (1953). According to Blackstone, upon 'the prisoner's confession of the indictment . . . the court hath nothing to do but award judgment: but it is usually very backward in receiving and recording such confession, out of tenderness to life of the subject; and will generally advise the prisoner to retract it, and plead to the indictment.' 4 Blackstone, Commentaries *324. In noting the reluctance of courts to accept a plea of guilty of a crime for which the penalty is death, Bishop said, 'Thus, where one tendered [this plea] in a capital case, the judges would not accept it till they had explained to him its serious nature, sent him back to his cell for reflection, brought him again into court, had the indictment read to him a second time, and examined witnesses as to his sanity, and whether or not promises of clemency had been made to him . . ., [a]nd in some of the states there are varying statutory and other devices to protect defendants from improvident pleas of guilty.' 2 Bishop, New Criminal Procedure § 795 (2d ed. 1913). See also 1 Greenleaf, Law of Evidence § 216 (16th ed. 1899).\n\n\"In this country today it is generally held that every accused has the right to plead guilty and one may do so even in\n\na capital case unless prohibited by statute. Annot., 6 A.L.R. 694 (1920); 21 Am. Jur. 2d Criminal Law § 484 (1965); 22 C.J.S. Criminal § 422(1), (4) (1961). See also Fed. R. Crim. P. 11, 18 U.S.C.A. Donnelly v. United States, 185 F.2d 559 (10th Cir. 1950); Territory v. Miller, 4 Dak. 173, 29 N.W. 7 (1886).\"\n\nSee also Annotation, \"Pleas of non vult contendere or guilty in capital case,\" 6 ALR 694.\n\nFrom early time to late, Oregon statutes have permitted guilty pleas \"to an indictment.\" General Laws of Oregon, Criminal Code § 132 (Deady 1866): \"There are three kinds of pleas to an indictment; a plea of: 1. Guilty * * *.\" General Laws of Oregon, Criminal Code § 132 (Deady and Lane (1874), is the same. ORS 135.335: \"The kinds of pleas to an indictment * * * are: (a) Guilty * * *.\" There has been no statute during this time that has excepted from those sections a plea of guilty in a capital case.\n\nIn Ex Parte Harrell, 57 Or 95, 110 P 493 (1910), defendant had been indicted for the crime of murder in the first degree, for which the prescribed penalty was death. He pleaded guilty. The court then took testimony to determine the degree of murder, and, finding that it was murder in the first degree, the court sentenced defendant to death. State v. Rathie et al., 101 Or 339, 342, 199 P 169 (1921), notes that a co-defendant of Rathie had pleaded guilty to the indictment charging first degree murder and had been executed.\n\nThose two cases do not discuss whether in Oregon one could plead guilty to a capital crime, but in both instances defendants who did so were executed. We conclude that there was neither common-law nor statutory prohibition of such a plea.\n\nWe come then to this defendant's contention that the 1932 amendment to Article I, section 11, of the Oregon Constitution abrogated the power of a defendant so to plead.\n\nWe commence by determining what the legislature and people sought to accomplish by the 1932 amendment. The text of the amendment does not prohibit a plea of guilty in a capital case; it only provides that if one wishes to be tried on a capital charge the trial must be to a jury. The background of the amendment convinces us that the people did not have in\n\nmind abrogating the statutory and common-law rules that one could plead guilty to any charge.\n\nThe Voters' Pamphlet for \"Constitutional Amendments and Measures to Be Submitted to the Voters of Oregon, General Election, November 8, 1932,\" at page 5, contained this:\n\n\" (On Official Ballot, Nos. 302 and 303)\n\n\" AN AMENDMENT\n\n\"To section 11 of Article I of the constitution of the state of Oregon, to be submitted to the legal electors of the state for their approval or rejection at the regular general election to be held November 8, 1932; proposed by the thirty-sixth legislative assembly by senate joint resolution No. 4, filed in the office of the secretary of state February 24, 1931.\n\n\"The following is the form and numerical designation of the proposed amendment as it will be printed on the official ballot:\n\n\" Constitutional Amendment - Referred to the People by the Legislative Assembly Vote YES or NO\n\n\" AMENDMENT AUTHORIZING CRIMINAL TRIALS WITHOUT JURIES BY CONSENT OF ACCUSED - Purpose: To provide that any accused person in other than capital cases, and with the consent of the trial judge, may choose to relinquish his right of trial by jury and consent to be tried by the judge of the court alone, such election to be in writing.\n\n\"302 Yes. I vote for the amendment.\n\n\"\n\n\"303 No. I vote against the amendment.\n\n\"\n\n\"The following is the 25-word voting machine ballot title of the proposed amendment:\n\n\" AMENDMENT AUTHORIZING CRIMINAL TRIALS WITHOUT JURIES BY CONSENT OF\n\nACCUSED - Purpose: To authorize accused persons except in capital cases to relinquish right of trial by jury by consent of judge, and be tried by judge only.\"\n\nOn page 6 of the pamphlet appeared the only argument concerning the measure, and it was in the affirmative.\n\n\" (On Official Ballot, Nos. 302 and 303)\n\n\" ARGUMENT (Affirmative)\n\n\"Submitted by the joint committee of the senate and house of representatives, thirty-sixth regular session, legislative assembly, in behalf of the Amendment Authorizing Criminal Trials Without Juries by Consent of Accused.\n\n\"The purpose of this proposed constitutional amendment is to permit the accused in criminal cases, with the consent of the trial judge, to waive trial by jury and be tried by judge alone. This would apply to trial of all crimes excepting capital offenses. Although not expressly required by the wording of the amendment, it is nevertheless thought the consent of the district attorney should be obtained as well as that of the judge before whom the case may be tried.\n\n\" Under present requirements of the constitution, jury trial is compulsory in criminal cases. [Emphasis added.] There are many cases that may be tried by judge, and without jury, speedily, economically and fully protecting the right of the accused. The requirement that consent of accused and judge must both be obtained, with the suggestion that the approval of the district attorney be secured also in applying the measure, assure its carefully considered and reasonable use.\n\n\"Similar provisions are effective in many states. Rights of state and accused are fully preserved and the adoption of the amendment should accomplish a substantial saving in the time and expense now incurred in criminal trials. Where adopted its use is general and the percentage of court trials has been large.\n\n\"It should be kept in mind the right to waive trial by jury, provided herein, applies only to criminal cases and requiring consent of accused and trial judge, cannot be used oppressively.\n\n\"The undersigned constitute a committee appointed by the President of the Senate and the Speaker of the House to\n\nprepare this argument. We strongly recommend the enactment of this measure.\n\n\"JAMES W. CRAWFORD, \"State Senator, Portland, Oregon\n\n\"ALLAN A. BYNON,\n\n\"JOHN MANNING, \"State Representatives, Portland, Oregon\"\n\nSenator Crawford had been the sole sponsor of the measure as it was introduced in the legislature.\n\nWe did not attempt extensive research of leading newspapers of the day to seek clues to how editors viewed the ballot measure, but we did check the recommendations on measures made in The Oregonian and in The Statesman.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e On November 7, 1932, in a column entitled \"Recommendations by The Oregonian,\" we found: \"Optional criminal trial by judges. Vote 302 Yes.\" In The Statesman on November 5, 1932, in the space usually reserved for editorials, under a heading \"Recommendations on Measures,\" we found this:\n\n\" Amendment Authorizing Criminal Trials Without Juries by Consent of Accused -\n\n\"This might be dangerous in some large cities where the judiciary is corrupt and under control of gangsters. Fortunately that condition does not prevail in Oregon. The adoption of the amendment may expedite trials and reduce expense. We recommend\n\n\" 302 X Yes.\"\n\nIt seems clear that the sponsor of the measure, the House members who joined him in presenting the Voters' Pamphlet argument and the editors all regarded this amendment as doing nothing more than changing the constitutional rule that a trial on a criminal charge had to be by jury.\n\nWe hold that Article I, section 11, of the Oregon Constitution does not prohibit one accused of aggravated murder from pleading guilty; it does prohibit one so accused\n\nfrom waiving a jury if the accused would be tried on the charge.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nIII.\n\nA substantial portion of the arguments of defendant and amici hinge on the text and alleged effect of Article I, sections 15 and 16, of the Oregon Constitution. The state argues that those sections are totally without application to the issues in this case. Those sections provide:\n\n\" Section 15. Laws for the punishment of crime shall be founded on the principles of reformation, and not of vindictive justice.\n\n\" Section 16. Excessive bail shall not be required, nor excessive fines imposed. Cruel and unusual punishments shall not be inflicted, but all penalties shall be proportioned to the offense. In all criminal cases whatever, the jury shall have the right to determine the law, and the facts under the direction of the Court as to the law, and the right of new trial, as in civil cases.\"\n\nBallot Measures 6 and 7 were proposed by initiative petition to be voted on at the general election on November 6, 1984. Ballot Measure 6 proposed an amendment to the state constitution, which read:\n\n\"Be It Enacted by the People of the State of Oregon:\n\n\" Paragraph 1. The Constitution of the State of Oregon is amended by creating a new section 40 to be added to and made a part of Article I and to read:\n\n\" Section 40. Notwithstanding sections 15 and 16 of this Article, the penalty for aggravated murder as defined by law shall be death upon unanimous affirmative jury findings as\n\nprovided by law and otherwise shall be life imprisonment with minimum sentence as provided by law.\"\n\nThe Attorney General prepared a ballot title for the measure as follows:\n\n\"CONSTITUTIONAL AMENDMENT REQUIRES DEATH OR LIFE IMPRISONMENT FOR AGGRAVATED MURDER\n\n\" Question: Shall the aggravated murder penalty be death upon certain findings by the jury, and be life imprisonment otherwise?\n\n\" Explanation: Amends state constitution. Requires that penalty for aggravated murder be death when a jury makes certain affirmative findings by a unanimous vote. The facts which must be found are to be determined by law. Requires life sentence with a minimum term in all other cases. The minimum term is to be provided by law.\"\n\nThis proposed title was challenged as being insufficient and unfair. We addressed the challenge in Clark v. Paulus, 295 Or 673, 669 P2d 794 (1983), where we summarized the challenge as follows:\n\n\"Petitioner challenges this ballot title as insufficient or unfair for several reasons. He argues that this ballot title fails to state the purpose of the measure, which he contends is to amend Article I, Sections 15 and 16 of the Oregon Constitution. He further argues that when this ballot title is read in conjunction with the companion initiative petition which would amend the statutory law to require a death penalty in some situations, it erroneously implies that the death penalty would be available only for a limited category of serious homicides; that this ballot measure title is sufficiently close to that for the companion statutory measure that it is likely to create confusion; and it fails to warn the voters that the measure might permit modes of execution that are cruel or unusual, or vindictively imposed.\" (Footnote omitted.)\n\n295 Or at 675-76. An intervenor made similar and some other arguments that the proposed ballot title was insufficient and unfair. We held:\n\n\"We agree that the ballot title prepared by the Attorney General is insufficient because it does not disclose the purpose of the measure; that is, exempting the death penalty for aggravated murder from the constitutional guarantees embodied in\n\nArticle I, Sections 15 and 16 of the Oregon Constitution. See Hall v. Paulus, 292 Or 787, 643 P2d 343 (1982).\n\n\"We find the following caption to be fair and sufficient:\n\n\"'EXEMPTS DEATH SENTENCES FROM CONSTITUTIONAL GUARANTEES AGAINST CRUEL, VINDICTIVE PUNISHMENTS'\n\n\"We adopt petitioner's proposed question with one addition:\n\n\"' Question: Shall capital punishment for aggravated murder be exempted from Oregon constitutional prohibitions against cruel, unusual, disproportionate and vindictive punishments?'\n\n\"After considering the explanations offered by the Attorney General, the petitioner, and the intervenor, we find the following, suggested by the intervenor, to be sufficient and fair:\n\n\"'Amends Oregon Constitution. Article I, section 15 requires that the laws for punishment of crime shall be founded on principles of reformation and not vindictive justice; Article I, section 16 prohibits cruel and unusual and disproportionate punishments. The measure would exempt aggravated murder statutes requiring the death penalty on unanimous jury findings from these constitutional guarantees. Where death was not imposed, the penalty would remain as life imprisonment with a mandatory minimum provided by statute.'\n\n\"The entire ballot title will read as follows:\n\n\"'EXEMPTS DEATH SENTENCES FROM CONSTITUTIONAL GUARANTEES AGAINST CRUEL, VINDICTIVE PUNISHMENTS\n\n\"' QUESTION: Shall capital punishment for aggravated murder be exempted from Oregon constitutional prohibitions against cruel, unusual, disproportionate and vindictive punishments?\n\n\"' EXPLANATION: Amends Oregon Constitution. Article I, section 15 requires that the laws for punishment of crime shall be founded on principles of reformation and not vindictive justice; Article I, section 16 prohibits cruel, unusual, and disproportionate punishments. The measure would exempt aggravated murder statutes requiring the death penalty on unanimous jury findings from these constitutional guarantees. Where death was not imposed, the\n\npenalty would remain as life imprisonment with a mandatory minimum provided by statute.'\n\n\"We certify the ballot title as modified to the Secretary of State.\"\n\n295 Or at 677-78.\n\nThe proponents of the initiative measure gathered sufficient signatures to qualify the measure for a place on the ballot, and it was designated \"Measure No. 6.\" Pursuant to former ORS 251.215, a committee was appointed to provide an \"impartial\" explanation of the measure. The Secretary of State appointed two members, one of whom was the counsel for petitioner in Clark v. Paulus, supra. Two of the other members of the committee were chief proponents of the measure, and the fifth member, who was the District Attorney for Multnomah County, was appointed by the first four members. The explanation prepared by this committee was as follows:\n\n\"EXPLANATION\n\n\"The Bill of Rights of the Oregon Constitution contains one section which states that 'Laws for the punishment of crime shall be founded on the principles of reformation, and not of vindictive justice.' Another provision of the Oregon Bill of Rights states that 'Cruel and unusual punishments shall not be inflicted' and prohibits disproportionate punishments.\n\n\"If adopted, Measure No. 6 would amend the Bill of Rights of the Oregon Constitution to do two things. First it would require death as the penalty for aggravated murder if there is a unanimous jury decision to that effect. If the death penalty is not imposed by the jury for aggravated murder, the penalty shall be life imprisonment with a minimum sentence to be set by statute.\n\n\"Second, it would exempt the death penalty from the guarantees in the Oregon Bill of Rights against vindictive justice and against cruel, unusual and disproportionate punishments.\n\n\"'Aggravated murder' is defined by statute and can be changed by the legislature or by a vote of the people.\"\n\nThis explanation appeared in the Voters' Pamphlet for the general election in 1984 immediately following the text of the measure.\n\nThe plain language of Article I, section 40, excludes consideration of Article I, sections 15 and 16. If this were not\n\nenough, the ballot title prepared by this court makes it crystal clear that the operation and effect of section 40 is not to be affected or modified by sections 15 and 16.\n\nWe shall not consider further any argument by defendant or amici that depends on contentions grounded in Article I, sections 15 and 16, of the Oregon Constitution.\n\nIV.\n\nAmici and defendant contend that prior to the enactment of Article I, section 40, all persons convicted of crime in Oregon enjoyed the \"protection\" of Article I, sections 15 and 16, and that section 40 deprives those convicted of aggravated murder of that protection. They argue that this deprivation denies to defendant the equal protection of the laws guaranteed to him by the Fourteenth Amendment to the Constitution of the United States. They argue that a fundamental right of defendant is involved, which they identify as his \"fundamental right to life.\" This being so, they contend, \"strict judicial scrutiny\" is required. On the other hand, the state argues that strict judicial scrutiny is not required and that the test for passing muster under the Equal Protection Clause is whether the section is rationally related to its purpose.\n\nThis question is one of federal law, for which we look to the Supreme Court of the United States for the applicable rules. That court has provided a test to determine when strict scrutiny is required:\n\n\"Texas virtually concedes that its historically rooted dual system of financing education could not withstand the strict judicial scrutiny that this Court has found appropriate in reviewing legislative judgments that interfere with fundamental constitutional rights or that involve suspect classifications. * * *\n\n\"This, then, establishes the framework for our analysis. We must decide, first, whether the Texas system of financing public education operates to the disadvantage of some suspect class or impinges upon a fundamental right explicitly or implicitly protected by the Constitution, thereby requiring strict judicial scrutiny. If so, the judgment of the District Court should be affirmed. If not, the Texas scheme must still be examined to determine whether it rationally furthers some legitimate, articulated state purpose and therefore does not constitute an invidious discrimination in violation of the\n\nEqual Protection Clause of the Fourteenth Amendment.\" (Footnotes omitted. Emphasis added.)\n\nSan Antonio School District v. Rodriguez, 411 U.S. 1, 16-17, 93 S Ct 1278, 36 L Ed 2d 17 (1973).\n\nFollowing the indicated method of analysis, we first note the obvious. Section 40 is not directed at a suspect class. It is not directed to any class characterized by age, gender, color, creed, ethnic consideration or national origin, and it does not serve to deprive anyone of the protection of sections 15 and 16 on any of those bases.\n\nEven if we assume for the sake of argument that the right to life is a fundamental right, that does not satisfy the second inquiry unless that fundamental right is \"explicitly or implicitly protected by the Constitution [of the United States].\" Neither have we been directed to nor do we find any such right protected by that constitution. The text and the case law are to the contrary. The Fifth Amendment to that constitution recognizes that there are \"capital\" crimes, and both the Fifth and the Fourteenth Amendments to that constitution forbid deprivation of life without due process of law. Those proscriptions clearly imply that one may be deprived of life if afforded due process of law. In Jurek v. Texas, 428 U.S. 262, 96 S Ct 2950, 49 L Ed 2d 929 (1976), Gregg v. Georgia, 428 U.S. 153, 96 S Ct 2909, 49 L Ed 2d 859 (1976), and Proffitt v. Florida, 428 U.S. 242, 96 S Ct 2960, 49 L Ed 2d 913 (1976), the Court has made it clear that a state may choose to authorize capital punishment for certain classes of offenses.\n\nIn San Antonio School District v. Rodriguez, supra, the Court, after reviewing a number of its earlier decisions concerning claims of denial of equal protection, came to its holding on this point:\n\n\"The lesson of these cases in addressing the question now before the Court is plain. It is not the province of this Court to create substantive constitutional rights in the name of guaranteeing equal protection of the laws. Thus, the key to discovering whether education is 'fundamental' is not to be found in comparisons of the relative societal significance of education as opposed to subsistence or housing. Nor is it to be found by weighing whether education is as important as the right to travel. Rather, the answer lies in assessing whether there is a right to education explicitly or implicitly guaranteed by the\n\nConstitution. Eisenstadt v. Baird, 405 U.S. 438 (1972);\u003cspan class=\"fnref\"\u003e73\u003c/span\u003e Dunn v. Blumstein, 405 U.S. 330 (1972);\u003cspan class=\"fnref\"\u003e74\u003c/span\u003e Police Dept. of Chicago v. Mosley, 408 U.S. 92 (1972);\u003cspan class=\"fnref\"\u003e75\u003c/span\u003e Skinner v. Oklahoma, 316 U.S. 535 (1942).\u003cspan class=\"fnref\"\u003e76\u003c/span\u003e [Emphasis added.]\n\n411 U.S. at 33-34, 93 S Ct at 1297, 36 L Ed 2d at 43-44.\n\nBy their constitution the people of Oregon could not lessen the protections of the Eighth Amendment to the Constitution of the United States. To the extent, if any, that sections 15 and 16 formerly provided additional protection against the \"cruel and unusual punishments\" proscribed by the Eighth Amendment for murderers, sections 15 and 16 may have reflected rights or interests deemed important to the people of Oregon, but where that protection exceeded that required by the Eighth Amendment, those rights or interests were not fundamental rights under the federal constitution.\n\nBecause section 40 does not operate to the disadvantage of some suspect class and because it does not impinge on a fundamental right \"explicitly or implicitly protected by the Constitution\" of the United States, strict judicial scrutiny is not required.\n\nIt leaves only to consider whether it is rationally related to its purpose. Its obvious purpose is to allow punishment of death for certain unlawful homicides and to prevent review of death penalty statutes under sections 15 and 16. Quite simply, the people of this state decided by more than a 75 percent margin that the guarantees of the Eighth Amendment were sufficient protection for individuals charged with such homicides. Specifying that sections 15 and 16 would not apply to sentencing those convicted of such homicides was a rational way to achieve that purpose.\n\nV.\n\nWe shall now discuss the origin of Oregon's death penalty provisions.\n\nIt is undisputed that ORS 163.150 is modeled on Texas' statutory system, which was enacted in 1973 in response to Furman v. Georgia, 408 U.S. 238, 92 S Ct 2726, 33 L Ed 2d 346 (1972). If it were disputed, a comparison of ORS 163.150 with the Texas statute, Vernon's Ann CCP art 37.071, as enacted in 1973 and as amended in 1981, would soon resolve the dispute. In Jurek v. Texas, supra, defendant was convicted\n\nof murder by choking and strangling his victim and drowning her in the course of \"committing and attempting to commit kidnapping of and forcible rape\" on the 10-year-old victim. He was sentenced to death under the 1973 statute. The Texas Court of Criminal Appeals affirmed, and on certiorari the Supreme Court of the United States decided that the imposition of the sentence of death under the 1973 statutory system did not violate the Eighth and Fourteenth Amendments to the Constitution of the United States.\n\nThe Texas statute made death a possible penalty for \"capital murder,\" which was defined by the penal code as murder with malice aforethought in any of five specific conditions. If one were found guilty of capital murder, the same jury was to address three issues specified in article 37.071(b):\n\n\"(1) whether the conduct of the defendant that caused the death of the deceased was committed deliberately and with the reasonable expectation that the death of the deceased or another would result;\n\n\"(2) whether there is a probability that the defendant would commit criminal acts of violence that would constitute a continuing threat to society; and\n\n\"(3) if raised by the evidence, whether the conduct of the defendant in killing the deceased was unreasonable in response to the provocation, if any, by the deceased.\"\n\nIf the jury returned a unanimous affirmative finding on all three issues, the court was required to sentence the defendant to death. Art 37.071(e). The judgment of conviction and sentence of death were required to be reviewed automatically by the Court of Criminal Appeals in a short period of time not to exceed 90 days after certification of the record. The characterization of the offense as \"capital murder\" as defined by statute was held to be a satisfactory alternative to specification by statute of aggravating factors or circumstances to be considered at the sentencing stage of proceedings. The Texas Court of Criminal Appeals had construed its statute as allowing the jury to consider mitigating circumstances in addressing the second issue. This was sufficient, held the Supreme Court of the United States, to satisfy the Eighth and Fourteenth Amendments. The Court also held that the second issue described in the statute was not so vague as to offend those Amendments, stating:\n\n\"It is, of course, not easy to predict future behavior. The fact that such a determination is difficult, however, does not mean that it cannot be made. Indeed, prediction of future criminal conduct is an essential element in many of the decisions rendered throughout our criminal justice system. The decision whether to admit a defendant to bail, for instance, must often turn on a judge's prediction of the defendant's future conduct. And any sentencing authority must predict a convicted person's probable future conduct when it engages in the process of determining what punishment to impose. For those sentenced to prison, these same predictions must be made by parole authorities. The task that a Texas jury must perform in answering the statutory question in issue is thus basically no different from the task performed countless times each day throughout the American system of criminal justice. What is essential is that the jury have before it all possible relevant information about the individual defendant whose fate it must determine. Texas law clearly assures that all such evidence will be adduced.\" (Footnotes omitted.)\n\n428 U.S. at 274-76. The Court summarized by holding that (1) the definition of capital murder requires that there be at least one statutory aggravating factor in a murder case before a death sentence can be considered; (2) the opportunity to bring before the jury all mitigating circumstances in addressing the second issue ensures that the sentencing jury will have adequate guidance to perform its function; and (3) the providing of prompt judicial review furnishes a means to promote evenhanded, rational and consistent imposition of death sentences.\n\nOregon's statutory system meets the criteria imposed by the Court in Jurek. It narrows the class of persons on whom the death penalty may be imposed by differentiating between aggravated murder and murder, permitting sentence of death only in those more heinous crimes defined as aggravated murder. The aggravating factor is built into the definition of the crime of which a defendant must be convicted before sentence of death may even be considered. ORS 163.095. Having identified one who may be subjected to the death penalty, ORS 163.150 requires the jury to address the same three issues as did the Texas statute and even adopts the Texas court's interpretation of its statute that the jury, in considering the three issues, may hear all relevant mitigating evidence. The Oregon statute also provides for prompt review by the highest state court.\n\nThe holding of the Supreme Court of the United States in Jurek v. Texas, supra, convinces us that the Oregon statutory system is impervious to challenge under the Eighth and Fourteenth Amendments to the Constitution of the United States.\n\nVI.\n\nBoth defendant and amici urge us to apply Article I, section 10, of the Oregon Constitution as a \"due process\" clause. Section 10 provides:\n\n\"No court shall be secret, but justice shall be administered, openly and without purchase, completely and without delay, and every man shall have remedy by due course of law for injury done him in his person, property, or reputation.\"\n\nBoth amici and defendant concede that this would require us to \"rethink\" our most recent decisions in this respect. To construe section 10 as a due process clause would be to undo almost 10 years of this court's insistence that it is not a due process clause. As explained in Justice Linde's concurring opinion in Davidson v. Rogers, 281 Or 219, 222, 574 P2d 624 (1978), the guarantee of remedy by due course of law is a\n\n\"plaintiffs' clause, addressed to securing the right to set the machinery of the law in motion to recover for harm already done to one of the stated kinds of interest, a guarantee that dates by way of the original state constitutions of 1776 back to King John's promise in Magna Charta chapter 40: 'To no one will We sell, to no one will We deny or delay, right or justice.'\"\n\n281 Or at 223. See also Linde, Without \"Due Process\": Unconstitutional Law in Oregon, 49 Or L Rev 125 (1970). See also State v. Hart, 299 Or 128, 140, 699 P2d 1113 (1985), making it clear that this court will not treat \"remedy by due course of law\" as synonymous with \"due process.\"\n\nDefendant adds the contention that\n\n\"this clause [due course of law] applies to his arguments regarding the procedures used to impose the death penalty and the admissibility of evidence during the penalty phase.\"\n\nWe do not understand this to add anything to defendant's specific contentions with respect to those issues, and we answer them elsewhere in this decision.\n\nNeither do the origins of section 10 give a basis for\n\nconsidering that \"justice shall be administered * * * completely\" is the same as a guarantee of due process. Once again, as Judge Linde pointed out in his separate opinion in Davidson v. Rogers, supra, chapter 40 of Magna Carta was not to be confused with chapter 39, which afforded the basis for various constitutional provisions concerning \"law of the land\" and \"due process.\"\n\nWe reject the invitation to construe section 10 as a due process clause.\n\nDefendant argues that the command of section 10 that \"justice shall be administered * * * completely\" is violated by Oregon's death penalty scheme because those words must mean something different from \"remedy by due course of law\" and\n\n\"Ultimately, defendant submits that the death penalty violates this provision because it is incompatible with the concept of complete justice.\"\n\nThe quotation is defendant's entire argument on this point. Section 40 and the statutes to implement it were duly enacted by an overwhelming majority of the people of this state. If defendant received a trial and sentence according to those and other applicable laws, he received \"justice,\" for justice is received if judgment is given according to the law. A law itself may be unjust, as the opponents of capital punishment believe our present law to be, but unjust and injustice are two different things.\n\nAdditionally, section 10 is certainly in the category of a general provision of law, while section 40 and its implementing statutes are specific provisions that should govern over general. The earlier section 10 has no ascendancy over the later section 40.\n\nVII.\n\nDefendant argues that Oregon's death penalty \"scheme\" offends the Constitution of the United States because it fails sufficiently to narrow the class or pool of persons who may be executed for criminal homicide.\n\nA.\n\nDefendant argues that \"[e]veryone convicted for capital murder in this state is eligible to be executed because the\n\n'intentional' and 'deliberate' criteria are synonymous and duplicated in the trial and sentencing phases.\"\n\nThe terms are not synonymous for the purpose of legal analysis. We made that clear in State v. Quinn, 290 Or 383, 623 P2d 630 (1981), in which we held Oregon's former death penalty legislation to be in violation of Article I, section 11, of the Oregon Constitution's guarantee of a jury trial on all elements, including the requisite culpable mental state, of the criminal charge. ORS 163.115 then, as now, defined criminal homicide as murder when it was committed intentionally. Former ORS 163.116 provided for possible imposition of the death penalty if \"the conduct of the defendant that caused the death of the deceased was committed deliberately.\" We held that this required the showing of a different and greater culpable mental state than that of \"intentionally,\" and because former ORS 163.116 delegated this finding to the trial judge the statute was unconstitutional. In order to arrive at that result, we necessarily distinguished deliberate from intentional. We said:\n\n\"The distinction between intentional deliberate murder and intentional nondeliberate murder may often be a fine one on the facts, but the legal distinction is nevertheless a real one of long standing under Oregon law.\"\n\n290 Or at 401. We pointed out that at common law and under earlier Oregon law, dividing first degree murder from second degree murder was done by providing that if intent was accompanied by premeditation and deliberation, the murder was first degree rather than second degree. We held that the trial judge was \"clearly correct\" in holding:\n\n\"'In order to answer the first question, consideration must be given initially to the meaning of the word \"deliberately.\" Is the commission of a homicide deliberately the same as its commission intentionally? If so, the Court is bound to find that this homicide was committed deliberately because the jury has already made that decision when it found specifically that the defendant acted intentionally, and the Oregon Constitution, Article VII, Section 3 prohibits the Court from interfering with this finding of fact by the jury. In my opinion, it is intended by the use of the word deliberately to add another dimension. So in deciding the first issue I am interpreting \"deliberately\" to mean that the defendant must have weighed and considered the question of killing and, having in\n\nmind the consequences, made a rational decision to kill. The duration of time is not the true test but rather the extent of the reflection.'\"\n\n290 Or at 404-05 n 7.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nB.\n\nDefendant next argues that Oregon has made so many murders \"capital murders\" that the pool is not sufficiently narrowed to pass muster under the Eighth Amendment to the Constitution of the United States. He contends that Oregon law may impose the death penalty in \"26 types of killings.\"\n\nORS 163.095 specifies 10 types of aggravated murder. We quote from the state's brief:\n\n\"A defendant commits aggravated murder if: (1) he either pays or receives money to commit the murder, ORS 163.095(1)(a) and (b); (2) he previously has been convicted of what would be either murder or manslaughter in the first degree under Oregon law, ORS 163.095(1)(c); (3) the murder involves multiple victims, ORS 163.095(1)(d); (4) the murder occurred in the course of or as a result of intentional maiming and torture, ORS 163.095(1)(e); (5) he murders persons who are performing official duties in the justice system, ORS 163.095(2)(a); (6) he committed the murder while he was in custody, ORS 163.095(2)(b); (7) he used an explosive to commit the murder, ORS 163.095(2)(c); (8) he personally and intentionally committed the murder during a specified felony, ORS 163.095(2)(d); (9) he committed the murder to conceal a crime, ORS 163.095(2)(e); or (10) he committed the murder while on escape from certain institutions, ORS 163.095(2)(f).\"\n\nDefendant arrives at the number \"26\" by adding the nine types of felony murder specified in ORS 163.115 and the seven categories of victims specified in ORS 163.095(2) to the ten types of aggravated murder contained in ORS 163.095. This is\n\novercounting. For instance, seven of the \"26 types\" could be reduced to one by providing that a murder is aggravated murder if the murder is related to the performance of the victim's official duties in the justice system rather than listing only the seven particular kinds of victims now specified in the statute. The same is true with respect to listing only nine felonies for the purposes of ORS 163.095(2)(d) instead of including all felonies. In each instance the listing narrows rather than expands the pool.\n\nOregon's ten kinds of aggravated murder narrow the pool in the manner approved in Jurek v. Texas, supra, and compares favorably in number with the 10 sentencing aggravating factors of the Georgia statute approved in Gregg v. Georgia, supra, and with the eight sentencing aggravating factors of the Florida statute approved in Proffitt v. Florida, supra.\n\nBecause Oregon's statutory scheme is so like that of Texas, we think it appropriate to quote from Jurek the Court's language concerning narrowing the pool:\n\n\"While Texas has not adopted a list of statutory aggravating circumstances the existence of which can justify the imposition of the death penalty as have Georgia and Florida, its action in narrowing the categories of murders for which a death sentence may ever be imposed serves much the same purpose. See McGautha v. California, 402 U.S. 183, 206 n. 16 (1971); Model Penal Code § 201.6, Comment 3, pp. 71-72 (Tent. Draft No. 9, 1959). In fact, each of the five classes of murders made capital by the Texas statute is encompassed in Georgia and Florida by one or more of their statutory aggravating circumstances. For example, the Texas statute requires the jury at the guilt-determining stage to consider whether the crime was committed in the course of a particular felony, whether it was committed for hire, or whether the defendant was an inmate of a penal institution at the time of its commission. Cf. Gregg v. Georgia, ante, at 165-166, n. 9; Proffitt v. Florida, ante, at 248-249, n. 6. Thus, in essence, the Texas statute requires that the jury find the existence of a statutory aggravating circumstance before the death penalty may be imposed. So far as consideration of aggravating circumstances is concerned, therefore, the principal difference between Texas and the other two States is that the death penalty is an available sentencing option -- even potentially -- for a smaller class of murders in Texas. Otherwise the\n\nstatutes are similar. Each requires the sentencing authority to focus on the particularized nature of the crime.\"\n\n428 U.S. at 270-71, 96 S Ct at 2955, 49 L Ed 2d at 937-38.\n\nWe conclude that Oregon's statutory provisions for narrowing the pool of those on whom the death penalty may possibly be visited if found guilty of aggravated murder meets the requirements of the Supreme Court of the United States in these cases arising out of Texas, Georgia and Florida.\n\nVIII.\n\nBoth defendant and amici challenge the statutory system for determining whether the death penalty shall be imposed on the basis that the terms used are so vague as to offend Article I, section 21, of the Oregon Constitution, which prohibits ex post facto laws. The substance of these challenges is that the statutes delegate to the jury to determine after the fact what conduct may be punished by death. Neither challenge is to the terms of ORS 163.095 and 163.115, which describe the conduct that is defined as aggravated murder. Rather, the challenges are to the second question that is to be presented to the jury under ORS 163.150(2)(b), which is here repeated for the convenience of the reader:\n\n\"Whether there is a probability that the defendant would commit criminal acts of violence that would constitute a continuing threat to society * * *.\"\n\nDefendant's first argument is that criminal laws must be \"sufficiently certain to inform the public of what the legislature intended to prohibit or allow.\" We have no quarrel with that contention; it simply is not applicable to an attack on the sentencing process for conduct condemned in certain terms by the legislature.\n\nDefendant argues that the terms \"probability,\" \"criminal acts of violence\" and \"continuing threat to society\" are terms so vague as to be \"mind-boggling.\" Amici make a similar but more restrained argument.\n\nWe first address the term \"probability.\" It is true that in the mathematical or statistical sense the probability that something may exist may range from zero (impossible) to one (sure). In that sense anything that is possible has a probability of existing that may be expressed as a fraction equal to or less\n\nthan 1/1. There is nothing to indicate that the people in passing this legislation meant to use the word in that sense. In its everyday usage sense, the word means the quality or state of being probable.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e \"Probable\" is defined in Webster's New International Dictionary (2d ed 1961) in this way:\n\n\" 1. Having more evidence for than against; supported by evidence strong enough to establish presumption, but not proof, of its truth; as, to make out a probable case; the hypothesis is probable; a highly probable conclusion.\n\n\" 2. Now Rare. a Capable of being proved. b Plausible; specious. c Establishing a probability; as, probable evidence.\n\n\" 3. Likely to be or become true or real; such as logically or actually may be or may happen; reasonably, but not certainly, to be believed or expected; as, probable events or developments; the probable author of a book; a probable plot or character.\n\n\" 4. Dealing with what is probable; specif., realistic.\n\n\"Our probable novelists of today. A. Symons.\n\n\" Syn. - See LIKELY. Ant. - Unlikely, improbable, doubtful.\"\n\nThe trial judge understood this to be the sense in which the statute employs the word when he instructed the jury as follows:\n\n\"In deciding the second question, probability means the occurrence of an event is more likely than not to occur. Here the event is the chance of the defendant committing criminal acts of violence.\"\n\nWhen the concept of probability is so circumscribed, it is not vulnerable to attack on the basis that it is too vague to pass constitutional muster. As defendant acknowledges:\n\n\"The second question of the death penalty statute in Texas is\n\nidentical to that of our Oregon death penalty statute. Neither the Supreme Court majority nor the majority in Jurek v. State, 522 SW2d 934 (Tex Cr App 1975), had any problem with the suggestion that this question was unconstitutionally vague [but the state court dissents make it clear that the question is unconstitutionally vague.]\"\n\nDefendant quotes at some length from those dissents. We have read them; they argue from the mathematical or statistical concept of probability; we do not agree with them.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nAs to the words \"criminal acts of violence,\" defendant's argument is little more than rhetorical questions:\n\n\"What does this phrase mean? Does it include misdemeanors or psychological violence, such as harassing telephone calls? Shall a jury sentence a person to death because the jury believes that in the future the defendant may punch someone in the nose? Without defining the degree of violence that the jury must consider, the statute leaves the jury free to decide any type of future violence is sufficient to cause a person to die.\"\n\nDefendant follows these questions with citation to an offer of proof in a State of Washington trial court in which a witness (according to defendant, \"one of the leading authorities in the United States\") stated that predictions of violence are problematical absent a specific definition of violence. Defendant's argument that \"any future violence\" and the leading authority's statement about the want of definition are not pertinent to the Oregon statute, for it speaks to \"criminal\" violence; \"any violence\" will not suffice to meet the statute.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nDefendant's attack on \"continuing threat to society\" as being too vague is nothing more than the bald assertion that this kind of prediction is \"incomprehensible,\" apparently because of an excerpt from American Psychiatric Association,\n\nDiagnostic and Statistical Manual of Disorders (3d ed 1980), in which it is asserted that after age 30 (defendant being 26 at time of trial) \"more flagrant\" kinds of criminality \"may\" diminish.\n\nAmici question in what \"society\" the issue operates. They seem to argue that the question is meaningless unless the jury knows whether it is society at large or a part thereof, such as prison, that is to be the setting in which the question is posed. We conclude that the answer is what the statute says, namely \"society,\" no matter whether the universe of that society be great or small.\n\nIX.\n\nDefendant and amici urge that the statutes are vague because the commission of future acts of criminal violence is not susceptible to prediction with any degree of certainty or accuracy. Insofar as this is an attack on whether this can be proven at all, they cite no authority to sustain that claim. As the Supreme Court of the United States said in Jurek , this flies in the face of the fact that judges and parole boards make such predictions every day throughout the land.\n\nTheir true attack is that expert opinion evidence should not be received on this issue because a large majority of psychiatrists and psychologists believe that practitioners in those fields believe such predictions to be faulty at least two-thirds of the time. They cite an array of studies that are not in the record in this case to buttress this claim. There is no testimony in the record that those studies and their conclusions are valid. In answer, the state cites other studies and critiques of those cited by defendant to show that a sizeable body of thought exists among experts that such predictions can be made and that psychiatrists and psychologists are better versed than others in making such predictions.\n\nWe have had this kind of issue arise before. In Bales v. SAIF, 294 Or 224, 656 P2d 300 (1982), we made it clear that a decision as to which of two conflicting schools of medical thought is correct is not a question of law; it is a question of fact to be decided by presenting in proper evidentiary form the various views to the finder of fact. The decision made in that case and on that record is not binding on the courts or the finders of fact in later cases that present the issue. In other\n\nwords, such a decision does not establish a rule of law. We also observed that the opinion of an expert should not necessarily be given less weight by a finder of fact just because the witness espouses the view of a minority of his profession.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e In Bend Millwork v. Department of Revenue, 285 Or 577, 585-87, 592 P2d 986 (1979), we explained, in connection with the use of appraisal manuals that had not been made a part of the record, that a factfinder must discharge his task on the record made in the particular case and that the facts found on the record and evidence in one case do not become a rule of law to be applied in the determination of facts on another record and other evidence.\n\nThe studies and articles about prediction of future dangerousness that defendant would have us consider now were not before the jury in this case and are not in the record before us. It would be pure speculation for us to consider that the studies and the opinions of those who rely on them would be impervious to vitiation by cross-examination or contrary evidence. All we know about this is from the briefs filed in this case, namely, that there is a difference of opinion as to the validity of those studies and the position of the American Psychiatric Association.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nWe decline to hold on this record that ORS 163.150 is\n\nunconstitutionally vague in this respect under either Article I, section 20 or section 21, of the Oregon Constitution. Jurek v. Texas, supra, rejects the contention insofar as the federal constitution is concerned.\n\nX.\n\nDefendant and amici argue that the three issues to be presented to the jury under ORS 163.150(2) make the death penalty mandatory, insulate the jury from making the decision for death or life imprisonment and preclude the jury from considering some mitigating circumstances. Aside from arguments based on Article I, sections 10 and 16, of the Oregon Constitution, which we shall not address for reasons stated supra, defendant and amici apparently rely on Article I, section 20, of the Oregon Constitution, which provides:\n\n\"No law shall be passed granting to any citizen or class of citizens privileges, or immunities, which, upon the same terms, shall not equally belong to all citizens.\"\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nIn this respect all that section 20 demands is that persons within a legislatively-defined class be treated equally. See State v. Clark, 291 Or 231, 240, 630 P2d 810 (1981). The three-issue procedure applies equally to every person within the class of those convicted of aggravated murder. The statute does not apply to anyone unless that person brings himself within the class of aggravated murderers by his own conduct.\n\nA.\n\nAfter the decision in Furman v. Georgia, supra, North Carolina and Louisiana attempted to avoid the randomness there condemned by passing mandatory death penalty statutes. In Woodson v. North Carolina, 428 U.S. 280, 96 S Ct 2978, 49 L Ed 2d 944 (1976), the Supreme Court of the United States rejected this approach because an automatic death sentence precludes deciding whether death is the appropriate penalty for a particular defendant in light of that defendant's character and background and the circumstances of the offense. At the same time, in Jurek v. Texas, supra, the Court held that the three-issue procedure, which Oregon has now adopted,\n\nwas not so vulnerable. The three questions permit the jury to consider, in light of information about the particular defendant and the particular crime, \"not only why a death sentence should be imposed, but also why it should not.\" 428 U.S. at 271, 96 S Ct at 2956, 49 L Ed 2d at 938. ORS 163.150(2) does not run afoul of the federal constitution in this respect.\n\nB.\n\nDefendant argues that a remark by prosecutor Engdall in opening argument to the jury told the jury that it was not responsible for the imposition of the death penalty and thereby insulated the jury from its responsibility in violation of the rule laid down in Caldwell v. Mississippi, 472 U.S. 320, 105 S Ct 2633, 86 L Ed 2d 231 (1985). Because this is not a facial attack on the statute, we shall delay addressing it until we come to specific errors claimed to have occurred on trial of this case.\n\nAmici, noting Caldwell, then argue the effect of Article I, sections 10 and 16, of the Oregon Constitution, which we have decided have no bearing here. The rest of the argument is devoted to criticism of the decision in Jurek, but the Supreme Court of the United States has not overruled that decision, which upheld the procedure now found in Oregon's statute.\n\nThere is certainly nothing on the face of the statute to suggest to the jury that it is not responsible for a decision that the death penalty will be imposed.\n\nC.\n\nDefendant and amici argue that ORS 163.150 does not allow the jury to consider all mitigating evidence. We disagree. There are three questions to be answered by the jury in resolving the three issues identified in ORS 163.150(1)(b). The statute commands:\n\n\"In the [sentencing] proceeding, evidence may be presented as to any matter that the court deems relevant to sentence; * * *.\"\n\nORS 163.150(1)(a). Even if the statute were silent, obviously, either defendant or the state would have the right to introduce any evidence relevant to the resolution of all or any of the three questions which frame the jury's resolution of the three issues. We construe the statute to mean that a defendant shall\n\nbe permitted to introduce any competent evidence relevant to mitigation on any of the three issues.\n\nThe statute before the Supreme Court of the United States in Jurek v. Texas, supra, was Vernon's Ann CCP art. 37.071(b)(2), which provided for submission to the jury of the issue\n\n\"whether there is a probability that the defendant would commit criminal acts of violence that would constitute a continuing threat to society; * * *.\"\n\nThe Court noted that the state court had interpreted its statute to allow for the presentation of any mitigating evidence a defendant desired to present. In light of that interpretation, the Court upheld the constitutionality of the Texas scheme of capital punishment.\n\nExactly what the court held may be open to differing interpretations. In Jurek v. State, 522 SW2d 934 (Tex Cr App 1975), the part of the opinion concerning jury discretion in resolving the issues presented by the Texas scheme was as follows:\n\n\"We reject appellant's contention that Article 37.071(b), supra, is too vague to provide adequate guidance to the jury. The fact that an exhaustive and precise list of factors is not specifically included does not indicate that the jury is without adequate guidelines. We are inclined to believe that the factors which determine whether the sentence of death is an appropriate penalty in a particular case are too complex to be compressed within the limits of a simple formula. However, there are some factors which are readily apparent and are viable factors for the jury's consideration. In determining the likelihood that the defendant would be a continuing threat to society, the jury could consider whether the defendant had a significant criminal record. It could consider the range and severity of his prior criminal conduct. It could further look to the age of the defendant and whether or not at the time of the commission of the offense he was acting under duress or under the domination of another. It could also consider whether the defendant was under an extreme form of mental or emotional pressure, something less, perhaps, than insanity, but more than the emotions of the average man, however inflamed, could withstand.\" (Footnote omitted.)\n\nId. at 939-40. The second question to be presented to the jury\n\nunder the Texas scheme was the same as that presented to the jury as the second question under ORS 163.150(1)(b)(B).\n\nIn Jurek v. Texas, supra, the Court stated that by that language the Texas court had \"indicated\" that it would interpret this second question so as to allow a defendant to bring to the jury's attention whatever mitigating circumstances a defendant might be able to show. In a footnote the Court noted that the Texas court had not yet construed the first and third questions and therefore had not determined whether or not the jury's consideration of those questions would properly include consideration of mitigating circumstances. In affirming the state court's decision, therefore, the Supreme Court of the United States had before it only a statute that had been construed to allow consideration of mitigating circumstances with respect to the second question. This would seem, at first blush, at least, to be a holding that the Texas statute passed constitutional muster under the Eighth and Fourteenth Amendments if the jury were allowed to consider mitigating circumstances in answering the second question.\n\nOn the other hand, some language of the Court may be interpreted to require, as a predicate for constitutionality, that the jury is to consider mitigating circumstances with respect to all three questions. The Court stated:\n\n\"Thus, the constitutionality of the Texas procedures turns on whether the enumerated questions allow consideration of particularized mitigating factors.\"\n\nIn the same footnote the Supreme Court noted that the first and third questions in \"at least some situations\" could comprehend such an inquiry. 428 U.S. at 272, 96 S Ct at 2956, 49 L Ed 2d at 938.\n\nDefendant argues that the decision in Lockett v. Ohio, 438 U.S. 586, 98 S Ct 2954, 57 L Ed 2d 973 (1978), is in conflict with Jurek. The Court in Lockett concluded that under the Ohio statute, once a defendant was found guilty of aggravated murder with at least one specified aggravating circumstance,\n\n\"the death penalty must be imposed unless, considering 'the nature and circumstances of the offense and the history, character, and condition of the offender,' the sentencing judge determines that at least one of the following mitigating circumstances is established by a preponderance of the evidence:\n\n\"'(1) The victim of the offense induced or facilitated it.\n\n\"'(2) It is unlikely that the offense would have been committed, but for the fact that the offender was under duress, coercion, or strong provocation.\n\n\"'(3) The offense was primarily the product of the offender's psychosis or mental deficiency, though such condition is insufficient to establish the defense of insanity.'\"\n\n438 U.S. at 607, 98 S Ct at 2966, 57 L Ed 2d at 991-92. The Court held that the three listed mitigating circumstances that could be considered by the sentencer were so limited as to make the Ohio statute incompatible with the Eighth and Fourteenth Amendments to the Constitution of the United States.\n\n\"To meet constitutional requirements, a death penalty statute must not preclude consideration of relevant mitigating factors.\"\n\n438 U.S. at 608, 98 S Ct at 2967, 57 L Ed 2d at 992.\n\nThe difference between the Texas and Ohio statutory schemes is obvious. To the argument that the decision in Lockett overrules that in Jurek, we answer that the Supreme Court of the United States did not believe that is so. In plain words the Court was at pains to state that proposition:\n\n\"The Ohio death penalty statute does not permit the type of individualized consideration of mitigating factors we now hold to be required by the Eighth and Fourteenth Amendments in capital cases. Its constitutional infirmities can best be understood by comparing it with the statutes upheld in Gregg, Proffitt, and Jurek.\n\n\"In upholding the Georgia statute in Gregg, Justices Stewart, Powell, and Stevens noted that the statute permitted the jury 'to consider any aggravating or mitigating circumstances,' see Gregg, 428 U.S., at 206[, 49 L Ed 2d 859, 96 S Ct 2909,] and that the Georgia Supreme Court had approved 'open and far-ranging argument' in presentence hearings, id., at 203[, 49 L Ed 2d 859, 96 S Ct 2909]. Although the Florida statute approved in Proffitt contained a list of mitigating factors, six Members of this Court assumed, in approving the statute, that the range of mitigating factors listed in the statute was not exclusive. Jurek involved a Texas statute which made no explicit reference to mitigating factors. 428 U.S., at\n\n272[, 49 L Ed 2d 929, 96 S Ct 2950]. Rather, the jury was required to answer three questions in the sentencing process, the second of which was 'whether there is a probability that the defendant would commit criminal acts of violence that would constitute a continuing threat to society.' Tex Code Crim Proc, Art 37.071(b) (Supp 1975-1976); see 428 U.S., at 269[, 49 L Ed 2d 929, 96 S Ct 2950]. The statute survived the petitioner's Eighth and Fourteenth Amendment attack because three Justices concluded that the Texas Court of Criminal Appeals had broadly interpreted the second question -- despite its facial narrowness -- so as to permit the sentencer to consider 'whatever mitigating circumstances' the defendant might be able to show. Id., at 272-273[, 49 L Ed 2d 929, 96 S Ct 2950] (opinion of Stewart, Powell, and Stevens, JJ.), citing and quoting, Jurek v. State, 522 SW2d 934, 939-940 (Tex Crim App 1975). None of the statutes we sustained in Gregg and the companion cases clearly operated at that time to prevent the sentencer from considering any aspect of the defendant's character and record or any circumstances of his offense as an independently mitigating factor.\n\n\"In this regard the statute now before us is significantly different.\" (Emphasis added. Footnote omitted.)\n\n438 U.S. at 606-07, 98 S Ct at 2965-66, 57 L Ed 2d at 990-91.\n\nUnder ORS 163.150(1), the jury may consider all mitigating factors or circumstances that are shown by the evidence. The statute does not offend the Eighth and Fourteenth Amendments to the Constitution of the United States under either Jurek or Lockett.\n\nD.\n\nThe dissents cite Eddings v. Oklahoma, 455 U.S. 104, 102 S Ct 869, 71 L Ed 2d 1 (1982), as vitiating the decision in Jurek as we here construe that decision. In Eddings, the Court had before it a statute that had been construed by the state court as excluding consideration of the defendant's \"turbulent family history,\" \"beatings by a harsh father,\" and \"severe emotional problems\" connected with having \"been raised in a neglectful, even violent family background.\" Despite the fact that certain commentators cited in Justice Linde's dissent in this case question the continued vitality of Jurek because of Eddings, we find nothing to indicate that the Supreme Court of the United States is in agreement with those commentators.\n\nWe do not construe our statute to exclude evidence of the kind of factors mentioned in Eddings.\n\nThe dissents quote from Skipper v. South Carolina, 476 U.S. 1, 106 S Ct 1669, 90 L Ed 2d 1 (1986). The quoted language does no more than to rule that a defendant must be allowed to show as a mitigating factor any aspect of his character or record and any of the circumstances of the offense that the defendant proffers as a basis for a sentence less than death. In other words, the sentencer must be allowed to consider any relevant mitigating evidence. That is what our statute allows.\n\nThe dissents cite Hitchcock v. Dugger, 481 U.S. 393, 107 S Ct 1821, 95 L Ed 2d 347 (1987). In that case, arising under Florida law, the trial judge instructed the jury not to consider evidence of mitigating circumstances not specifically enumerated in the Florida statute. The respondent asserted that the Florida Supreme Court had, in a decision postdating the petitioner's conviction, held that the sentencer was not limited to consideration of the statutory mitigating circumstances. The Court held that because the record disclosed that the trial judge in the case before the Court had assumed the statute limited the evidence that could be received and had so limited it, the petitioner was entitled to a new resentencing proceeding or a lesser sentence.\n\nWe discover nothing in Hitchcock that is in conflict with the decision in Jurek or that would apply to the Oregon scheme.\n\nThe dissents also cite Sumner v. Shuman, 483 U.S. , 107 S Ct 2716, 97 L Ed 2d 56 (1987). Justice Linde cites the case \"to show the decisive point that the sentencer must not merely admit evidence but consider 'non statutory mitigating circumstances.'\" We have no quarrel with that rule, and we conclude the Oregon scheme is not to the contrary. We read the decision as not even impliedly criticizing the decision in Jurek. In fact, the Court impliedly reaffirmed that decision. Language throughout the decision attests to the fact that the Court, as distinguished from commentators, does not view the holding in Jurek as being questionable:\n\n\"The Court's opinions in 1976 addressing the constitutionality of five post- Furman state statutes did much to clarify what standards must be met to render a capital-punishment\n\nstatute facially constitutional. In explaining why the guided-discretion statutes of Georgia, Florida, and Texas were facially valid, but the mandatory statutes of North Carolina and Louisiana were not, the Court relied to a significant degree on the unique nature of the death penalty and the heightened reliability demanded by the Eighth Amendment in the determination whether the death penalty is appropriate in a particular case. See Gregg v. Georgia, 428 U.S., at 189-195, 49 L Ed 2d 850, 96 S Ct 2909 (opinion of STEWART, POWELL and STEVENS, JJ.); Proffitt v. Florida, 428 U.S. 242, 252-253, 49 L Ed 2d 913, 96 S Ct 2960 (same); Jurek v. Texas, 428 U.S. 262, 271-272, 49 L Ed 2d 929, 96 S Ct 2950 (same); Woodson v. North Carolina, 428 U.S., at 303-305, 49 L Ed 2d 944, 96 S Ct 2978 (plurality opinion); Roberts (Stanislaus) v. Louisiana, 428 U.S., at 333-335, 49 L Ed 2d 974, 96 S Ct 3001 (plurality opinion). The principal opinions in these cases established that in capital cases, 'it is constitutionally required that the sentencing authority have information sufficient to enable it to consider the character and individual circumstances of a defendant prior to imposition of a death sentence.' Gregg v. Georgia, 428 U.S., at 189, n. 38, 49 L Ed 2d 859, 96 S Ct 2909 (emphasis added); see also, e.g., Woodson v. North Carolina, 428 U.S., at 304, 49 L Ed 2d 944, 96 S Ct 2978.\"\n\n483 U.S. at , 107 S Ct at 2720, 97 L Ed 2d at 63.\n\n\"It is important to examine once again the establishment of the individualized capital-sentencing doctrine in this Court's opinions issued in 1976 and the development of that doctrine in the ensuing decade, before determining whether an exception is justified in the present case. In each of the five death-penalty cases decided in 1976, the Court's judgment rested on a joint opinion of Justices STEWART, POWELL and STEVENS. Those five opinions, reflecting the views of the only Members of the Court to vote in support of all five judgments, drew a critical line between post- Furman statutes that could survive constitutional scrutiny and those that could not. In the three cases upholding the guided-discretion statutes, the opinions emphasized the fact that those capital schemes permitted the sentencing authority to consider relevant mitigating circumstances pertaining to the offense and a range of factors about the defendant as an individual. See Gregg v. Georgia, 428 U.S., at 197, 206, 49 L Ed 2d 859, 96 S Ct 2909; Proffitt v. Florida, 428 U.S., at 251-252, 49 L Ed 2d 913, 96 S Ct 2960; Jurek v. Texas, 428 U.S., at 270-271, 49 L Ed 2d\n\n929, 96 S Ct 2950. In the two cases striking down as unconstitutional mandatory capital-sentencing statutes, the opinions stressed that one of the fatal flaws in those sentencing procedures was their failure to permit presentation of mitigating circumstances for the consideration of the sentencing authority. See Woodson v. North Carolina, 428 U.S., at 303-305, 49 L Ed 2d 944, 96 S Ct 2978; Roberts (Stanislaus) v. Louisiana, 428 U.S., at 333-334, 49 L Ed 2d 974, 96 S Ct 3001.\"\n\n483 U.S. at , 107 S Ct at 2721, 97 L Ed 2d at 64.\n\n\"The constitutional mandate of individualized determinations in capital-sentencing proceedings continued to guide this Court's review of capital-punishment statutes in the ensuing decade. It led the Court to invalidate another aspect of Louisiana's mandatory statute the following year. See Roberts (Harry) v. Louisiana, 431 U.S. 633, 637, 52 L Ed 2d 637, 97 S Ct 1993, 5 Ohio Ops 3d 252 (1977) (per curiam). It also has had a significant impact on our decisions in cases where the sentencing authority's consideration of mitigating circumstances had been restrained in some manner. Beginning with Lockett v. Ohio, 438 U.S. 586, 57 L Ed 2d 973, 98 S Ct 2954, 9 Ohio Ops 3d 26 (1978), a plurality of the Court recognized that in order to give meaning to the individualized-sentencing requirement in capital cases, the sentencing authority must be permitted to consider ' as a mitigating factor, any aspect of a defendant's character or record and any of the circumstances of the offense.' Id., at 604 (emphasis in original). In Eddings v. Oklahoma, 455 U.S. 104, 71 L Ed 2d 1, 102 S Ct 869 (1982), a majority of the Court accepted the Lockett plurality's approach. Not only did the Eighth Amendment require that capital-sentencing schemes permit the defendant to present any relevant mitigating evidence, but ' Lockett requires the sentencer to listen' to that evidence. Id., at 115, n. 10, 71 L Ed 2d 1, 102 S Ct 869. Finally, earlier this Term, in Hitchcock v. Dugger, 481 U.S. 393, 95 L Ed 2d 347, 107 S Ct 1821 (1987), the Court, by a unanimous vote, invalidated a death sentence because 'the advisory jury was instructed not to consider, and the sentencing judge refused to consider, evidence of nonstatutory mitigating circumstances.' Id., at (slip op. 6), 95 L Ed 2d 347, 107 S Ct 1821. We unequivocally relied on the rulings in Lockett v. Ohio, and Eddings v. Oklahoma, that the Eighth and Fourteenth Amendments require that the sentencing authority be permitted to consider any relevant mitigating evidence before imposing a death sentence. 481 U.S., at and , 95 L Ed 2d 347, 107 S Ct 1821.\" (Footnote omitted.)\n\n483 U.S. at , 107 S Ct at 2722-23, 97 L Ed 2d at 65-66. We see this very recent language as affirming the holdings of Gregg, Proffitt and Jurek.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nIn Adams v. Texas, 448 U.S. 38, 46, 100 S Ct 2521, 2527, 65 L Ed 2d 581, 590 (1980), the Court stated what it thought to be the effect of Jurek on the role of the jury in answering the statutory questions:\n\n\" [J]urors in Texas must determine whether the evidence presented by the State convinces them beyond reasonable doubt that each of the three questions put to them must be answered in the affirmative. In doing so, they must consider both aggravating and mitigating circumstances, whether appearing in the evidence presented at the trial on guilt or innocence or during the sentencing proceedings. Jurors will characteristically know that affirmative answers to the questions will result in the automatic imposition of the death penalty, Hovila v. State, 532 S.W.2d 293, 294 (Tex Crim. App. 1975), and each of the jurors whose exclusion is challenged by petitioner was so informed. In essence, Texas juries must be allowed to consider 'on the basis of all relevant evidence not only why a death sentence should be imposed, but also why it should not be imposed.' Jurek v. Texas, 428 U.S. 262, 271 (1976) (opinion of STEWART, POWELL, and STEVENS, JJ.). This process is not an exact science, and the jurors under the Texas bifurcated procedure unavoidably exercise a range of judgment and discretion while remaining true to their instructions and their oaths.\" (Emphasis added.)\n\nJustice White delivered the opinion of the Court and was joined by Justices Brennan, Stewart, Blackmun, Powell and Stevens. The lone dissenter, Justice Rehnquist, did not disapprove of this language; indeed, he reaffirmed his belief in the decision in Jurek. 448 U.S. at 53-54, 100 S Ct at 2530-31, 65 L Ed 2d at 594-95.\n\nIn a case decided January 13, 1988, the Supreme Court of the United States has again affirmed its conclusion that the three questions presented to the jury by the Texas\n\nstatute in Jurek, as interpreted by the Court and by the state court, sufficiently provided for the guided discretion of the jury. The case is Lowenfield v. Phelps, U.S. , 108 S Ct 546, 98 L Ed 2d 568 (1988). In this federal habeas corpus case, among other things, the petitioner (defendant in the underlying criminal case) argued that the Louisiana statute failed sufficiently to narrow the pool of potential recipients of the death penalty. The Supreme Court of the United States said:\n\n\"The use of 'aggravating circumstances' is not an end in itself, but a means of genuinely narrowing the class of death-eligible persons and thereby channeling the jury's discretion. We see no reason why this narrowing function may not be performed by jury findings at either the sentencing phase of the trial or the guilt phase. Our opinion in Jurek v. Texas, 428 U.S. 262 (1976), establishes this point. The Jurek Court upheld the Texas death penalty statute, which, like the Louisiana statute, narrowly defined the categories of murders for which a death sentence could be imposed. If the jury found the defendant guilty of such a murder, it was required to impose death so long as it found beyond a reasonable doubt that the defendant's acts were deliberate, the defendant would probably constitute a continuing threat to society, and, if raised by the evidence, the defendant's acts were an unreasonable response to the victim's provocation. Id., at 269. We concluded that the latter three elements allowed the jury to consider the mitigating aspects of the crime and the unique characteristics of the perpetrator, and therefore sufficiently provided for jury discretion. Id., at 271-274.\" (Emphasis added.)\n\nU.S. at , 108 S Ct at 554, 98 L Ed 2d at 581.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e Although two members of the Court dissented from this part of the opinion and specifically discussed Jurek with respect to the pool-narrowing aspect of that decision, even the dissenters did not question the language we have underlined from the majority opinion in Lowenfield. Indeed, the dissenters quoted from Adams v. Texas, supra, 448 U.S. at 46, 100 S Ct at 2527, 65 L Ed 2d at 590, the following passage:\n\n\" (In answering the three sentencing questions affirmatively,\n\njurors in Texas 'must consider both aggravating and mitigating circumstances, whether appearing in the evidence presented at the trial on guilt or innocence or during the sentencing proceedings.')\" (Emphasis added.)\n\nU.S. at n 4, 108 S Ct at 560 n 4, 98 L Ed 2d at 589 n 4.\n\nOur review of these post- Jurek opinions leads us to the conclusion that the Supreme Court of the United States will uphold a scheme such as that presented in Jurek if the sentencer is allowed to consider all competent evidence relevant to any of the three questions presented. ORS 163.150(1) specifically provides for the introduction of any evidence relevant to the three questions, and, as we have noted above, even if the statute did not do so, relevant and competent evidence is admissible on any issue presented to the trier of fact.\n\nE.\n\nIt is argued that ORS 163.150(1)(b)(B) and the trial court's instructions pursuant thereto to the jury prohibited the jury from considering mitigating factors with respect to all three questions. It will be recalled that the statute provides:\n\n\"In determining this issue [probability that defendant would commit criminal acts of violence that would constitute a continuing threat to society] the court shall instruct the jury to consider any mitigating circumstances offered in evidence, including, but not limited to, the defendant's age, the extent and severity of the defendant's prior criminal conduct and the extent of the mental and emotional pressure under which the defendant was acting at the time the offense was committed; * * *.\"\n\nPursuant to the statute, the trial court instructed the jury:\n\n\"In determining this issue [probability that defendant would commit criminal acts of violence that would constitute a continuing threat to society] you shall consider any mitigating circumstances received in evidence including, but not limited to, the defendant's age, the extent and severity of the defendant's prior criminal conduct and the extent of the mental and emotional pressure under which the defendant was acting at the time the killing was committed.\"\n\nNothing in either the statute or the instruction forbade the jury from considering mitigating circumstances in the jury's consideration of the other two questions. Indeed, the court's\n\ninstructions commanded the jury to consider all of the evidence in performing its task:\n\n\"In deciding the issues before you, you are to consider all the evidence that you find worthy of belief. It is your duty to weigh the evidence calmly and dispassionately and to decide this case upon its merits. * * *\n\n\"* * *\n\n\"You have the sole responsibility to determine what testimony or portions of testimony, you will or will not rely upon in reaching your verdict.\"\n\nWe consider that it would be the better practice for the trial court to instruct the jury with particularity that it is to consider mitigating evidence with respect to arriving at its answer to all three questions, but that does not mean that there was error committed in this trial for failure to do so. There was no request for such an instruction. A search of the record does not reveal any evidence that would tend to show mitigation with respect to answering the first and third questions. A court is not required to give abstract instructions.\n\nNothing in the Oregon statute or in the trial of this case prevented consideration of any mitigating circumstances or factors with respect to any of the three questions.\n\nXI.\n\nDefendant and amici assert that Oregon's death penalty scheme is unconstitutional in light of Article VII (Amended), section 3, of the Oregon Constitution because this court has construed that section to apply to criminal actions and, therefore, there can be no meaningful appellate review of a jury's decision to impose the death penalty. That section was proposed by initiative petition and adopted by vote of the people in 1910. It originally provided:\n\n\"In actions at law, where the value in controversy shall exceed twenty dollars, the right of trial by jury shall be preserved, and no fact tried by a jury shall be otherwise re-examined in any court of this state, unless the court can affirmatively say there is no evidence to support the verdict. * * *\"\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nAt the time of that political action by the people, Oregon law provided:\n\n\"The proceedings by which a person is tried and punished for the commission of a crime is known in this Code as a criminal action.\"\n\nLord's Oregon Laws § 1374. That had been the statutory law from the outset of statehood.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nIn an early case, this court construed the term \"action at law\" as used in a part of the Code of Criminal Procedure concerning gambling offenses to include proceedings initiated by indictment:\n\n\"We think the counsel may have misapprehended the meaning of this section, and thought that the words 'action at law' meant civil action at law, but such is not the necessary signification of these words. A proceeding by indictment is an action at law.\"\n\nState of Oregon v. Carr, 6 Or 134, 136 (1876). State v. Evans, 98 Or 214, 192 P 1062, 193 P 927 (1920), however, held that Article VII (Amended), section 3, did not apply to a criminal action because although it was an action at law (citing State of Oregon v. Carr, supra), it was not an action where the value in controversy exceeded $20. The court arrived at this holding by reasoning that \"no value can be placed on a man's liberty.\" 98 Or at 223. We question the application of that reasoning as did this court in State v. Burke et al., 126 Or 651, 669, 269 P 869, 270 P 756 (1928), where this court said:\n\n\"The fundamental law of this state provides:\n\n\"'The right of trial by jury shall be preserved, and no fact tried by a jury shall be otherwise re-examined in any court of this state unless the court can affirmatively say there is no evidence to support the verdict.' Or. Const., Art. VII, § 3c.\n\n\"That command is plain in statement, and definite and certain in meaning, and applies alike to criminal and civil causes: State v. Friddles, 62 Or. 209 (123 Pac. 904); State v. Hardin, 63 Or. 305 (127 Pac. 789); State v. Hill, 63 Or. 451\n\n(128 Pac. 444); State v. Russell, 64 Or. 247 (129 Pac. 1051); State v. McPherson, 69 Or. 381 (138 Pac. 1076); State v. Catholic, 75 Or. 367 (147 Pac. 372, Ann. Cas. 1917B, 913); State v. Morris, 83 Or. 429 (163 Pac. 567); State v. Ragan, 123 Or. 521 (262 Pac. 954). The contrary holding, as set out in the case of State v. Evans, 98 Or. 214 (192 Pac. 1062, 193 Pac. 927), is not, in the opinion of this court, the better view.\"\n\nState v. Cahill, 208 Or 538, 293 P2d 169, 298 P2d 214 (1956), also stands for the proposition that section 3 is applicable to criminal actions.\n\nDefendant argues that unless we overrule those cases by holding that section 3 does not apply to criminal cases, we shall not be able to afford meaningful judicial review as required by the federal constitution, i.e., we shall not be able \"to prevent or correct injustice resulting from mistakes by juries.\" These arguments assume that the judicial review mandated by the decisions of the Supreme Court of the United States requires that appellate courts have power to review and do review the facts necessarily found by juries in convicting and sentencing. In other words, they argue that we should review de novo, or anew, on the record, as if this were a proceeding in equity. Nothing has been cited to us nor do we find any authority for that argument. We conclude from the decisions of the Supreme Court that our review must be to determine whether there was evidence from which the jury could have found affirmative answers to all three questions and whether the jury acted according to the law.\n\nDefendant argues that ORS 138.050 requires that we conduct substantive sentence review. An argument might have been made to that effect prior to 1985 amendments when the statute provided for sentence review and directed appellate courts to consider the \"nature and background of the offender or the facts and circumstances of the offense.\" The 1985 amendments deleted that language, however, and the statute now provides:\n\n\"If in the judgment of the appellate court the punishment imposed does not exceed the maximum sentence allowable by law or is unconstitutionally cruel and unusual, the appellate court shall direct the court from which the appeal is taken to impose the punishment which should be administered.\"\n\nEssentially, that is the review that we have undertaken in this case as circumscribed by Article I, section 40, of the Oregon Constitution and the Eighth Amendment as interpreted by the Supreme Court of the United States.\n\nAmici argue that ORS 163.150(6), providing for automatic and direct review by this court, overrides ORS 138.050 and requires substantive review. We have found nothing in the text of ORS 163.150 or its legislative history to suggest that the scope of our review reaches to substituting our perception of the effect of the evidence for that of the jury.\n\nDefendant has presented a compilation of results in earlier Oregon death penalty cases. We accept that compilation at face value, but those cases did not arise under this or similar statutes. Insofar as they show that governors commuted some death sentences, that is irrelevant to the constitutional arguments now before us. As the Supreme Court of the United States lately observed:\n\n\"On the other hand, absent a showing that the Georgia capital punishment system operates in an arbitrary and capricious manner, McCleskey cannot prove a constitutional violation by demonstrating that other defendants who may be similarly situated did not receive the death penalty. In Gregg, the Court confronted the argument that 'the opportunities for discretionary action that are inherent in the processing of any murder case under Georgia law,' Gregg v. Georgia, supra, 428 U.S., at 199, 96 S.Ct., at 2937, 49 L Ed 2d 859, specifically the opportunities for discretionary leniency, rendered the capital sentences imposed arbitrary and capricious. We rejected this contention:\n\n\"'The existence of these discretionary stages is not determinative of the issues before us. At each of these stages an actor in the criminal justice system makes a decision which may remove a defendant from consideration as a candidate for the death penalty. Furman, in contrast, dealt with the decision to impose the death sentence on a specific individual who had been convicted of a capital offense. Nothing in any of our cases suggests that the decision to afford an individual defendant mercy violates the Constitution. Furman held only that, in order to minimize the risk that the death penalty would be imposed on a capriciously selected group of offenders, the decision to impose it had to be guided by standards so that the sentencing authority would focus on the particularized circumstances of the crime and the defendant.' Ibid.\n\n\"Because McCleskey's sentence was imposed under Georgia sentencing procedures that focus discretion 'on the particularized nature of the crime and the particularized characteristics of the individual defendant,' id., at 206, 96 S.Ct., at 2940, 49 L Ed 2d 859, we lawfully may presume that McCleskey's death sentence was not 'wantonly and freakishly' imposed, id., at 207, 96 S.Ct., at 2941, 49 L Ed 2d 859, and thus that the sentence is not disproportionate within any recognized meaning under the Eighth Amendment.\" (Footnote omitted.)\n\nMcCleskey v. Kemp, 481 U.S. 279, , 107 S Ct 1756, 1774-75, 95 L Ed 2d 262, 288-89 (1987).\n\nDefendant further argues that constitutionally required, meaningful appellate review is not possible for us because ORS 163.150 does not require written findings by the jury on aggravation. As noted several times above, Oregon's statute considers aggravation initially in defining the crime for which the death penalty is even a possibility. The jury's answer in writing to the three questions presented under ORS 163.150(2) implicitly have been held sufficient in this respect by the decision in Jurek.\n\nXII.\n\nWe shall now consider specific claims of error that defendant asserts with respect to the proceeding in this case.\n\nA.\n\nDefendant argues that the indictment failed to allege facts that would give him notice that the death penalty would be sought and the \"particular evidence of aggravating factors.\" Amici urge that the indictment is insufficient in failing to allege in the language of ORS 163.150(2)(a) that defendant \"deliberately\" caused the death of the victim.\n\nORS 132.550(7) provides:\n\n\"The indictment shall contain substantially the following:\n\n\"* * *\n\n\"(7) A statement of the acts constituting the offense in ordinary and concise language, without repetition, and in such manner as to enable a person of common understanding to know what is intended;\"\n\nThe offense with which this defendant is charged is aggravated murder as defined in ORS 163.095(2)(a)(E), which is set forth at the outset of this opinion. The ultimate facts that make up that offense are clearly alleged in the indictment. To be guilty of aggravated murder one does not need to act \"deliberately.\" If one is guilty of aggravated murder but the jury does not unanimously find that the perpetrator acted deliberately, the guilty one is not sentenced to death but is yet guilty of aggravated murder. There is no requirement of pleading an indictment that requires the indictment to set forth possible penalties that the law may fix for guilt on a particular charge.\n\nB.\n\nDefendant contends that the lower court erred in failing, sua sponte, to excuse for cause juror Watson, whom defendant had chosen not to challenge or excuse. We set forth those parts of voir dire examination of Watson that the parties claim to be pertinent:\n\nBy defendant:\n\n\"Q. Do you believe any religious or moral beliefs would prevent you from voting in the death penalty in any case?\n\n\"A. No, I voted for to put the death penalty on the ballot.\n\n\"Q. Did you vote in the November, '84 election that reinstated the death penalty?\n\n\"A. Yes, I did.\n\n\"Q. Which way did you vote on that?\n\n\"A. I voted for it.\n\n\"Q. Would you explain to me what basis of information you used to formulate that answer?\n\n\"A. Well, it just seems to me like there is people out there killing people all the time and they are not doing nothing to them. They slap their hands and 10, 12 years, they are out and doing it again.\n\n\"Q. Some people believe in this issue, and I'll ask you: Do you believe in the issue an eye for an eye and a tooth for a tooth?\n\n\"A. You bet I do.\n\n\"Q. Do you favor the death penalty for aggravated murder?\n\n\"A. As far as I'm concerned, somebody takes somebody's life, that's murder. That should be a death penalty.\n\n\"Q. Do you believe that if the District Attorney was seeking the death penalty, that the person would probably deserve it? Do you believe if the District Attorney was seeking the death penalty on a certain person, that that person probably deserves it?\n\n\"A. If he was guilty, yes.\n\n\"Q. Do you believe that every person convicted of murder should be sentenced to death?\n\n\"A. If they were guilty, if they killed somebody, I think they should be, yes.\n\n\"Q. What do you think the death penalty accomplishes for society?\n\n\"A. Well, some of these days maybe people will wake up and just stop this killing people and getting their hands slapped, getting throwed in prison for a few years and doing it over.\n\n\"Q. In your last jury duty, do you recall the verdict that was reached in that jury?\n\n\"A. Guilty.\n\n\"* * *\n\n\"Q. If the Court instructs you contrary to what you feel the laws to be, will you follow the Court's instructions anyway?\n\n\"A. If they what now?\n\n\"Q. If the Court instructs you contrary to what you feel the law to be, will you follow the Court's instructions anyway?\n\n\"A. You mean if I don't think that's -- what they say is right?\n\n\"Q. Let's say you have an opinion on what the law is.\n\n\"A. Okay.\n\n\"Q. But the Judge, the Court instructs you contrary to that belief; would you follow the Court's instructions anyway?\n\n\"A. Yeah, I believe so.\n\n\"Q. Do you realize that your decision could veto any possibility of a death sentence because it has to be unanimous?\n\n\"A. Ah-huh.\n\n\"Q. Do you think that criminal defendants should have to prove that they are innocent?\n\n\"A. Well, yes, I do.\n\n\"Q. Do you feel that the fact that I pled guilty may have any influence on the outcome of your decision?\n\n\"A. Well, like I said awhile ago, guilty is guilty.\n\n\"Q. Do you feel it is better to let some guilty people go free rather than risk convicting an innocent person?\n\n\"A. Well, if they are convicted and they are guilty --\n\n\"* * *\n\n\"Q. Are you aware of the seriousness of this trial?\n\n\"A. Yes, it is either life or death, I assume.\n\n\"Q. Do you feel having to make that type of decision will have an effect on your psychological -- any psychological effect on you with having to make a decision like that?\n\n\"A. Nope.\n\n\"Q. Would you allow fear of criticism to influence your verdict?\n\n\"A. Nope.\n\n\"Q. Do you agree or disagree that the rights of criminals are better protected than the rights of victims?\n\n\"A. Well, it seems like here lately that that's the way it's been working.\n\n\"Q. How do you feel about that?\n\n\"A. Well, it seems like criminals have more rights than we do sometimes.\n\n\"Q. How does that make you feel when you think about it?\n\n\"A. I don't really like it.\n\n\"* * *\n\n\"Q. Will the fact that there may be gruesome descriptions, pictures or testimony of this crime affect your ability to be fair and impartial?\n\n\"A. No.\n\n\"* * *\n\n\"Q. I'd like you to take as much time on this next question to give me an answer. I'm going to give you a choice of\n\nfour answers. Would you say that you favor the death penalty a little, some, a lot, or you are totally for it?\n\n\"A. I'm totally for it.\n\n\" MR. WAGNER: Pass for cause.\" (Emphasis added.)\n\nBy prosecutor:\n\n\"Q. As you know, in most cases, and the one case that you've already had experience as a juror, the jury usually determines guilt or innocence in a case. The Court has already told all the jurors that guilt has been determined; the defendant pled guilty to aggravated murder of Jeri Koenig. He admitted that he killed her, and how he killed her, admitted the killing was done by strangulation and assault causing her death, and that she was a witness in another case at the time. So, that's been established, and the jury won't have to worry about that, won't even have to discuss it, probably shouldn't discuss it except as it relates to answering some of these questions, and that was where it should come up. Do you have any disagreement, Mr. Watson, with Oregon's two part statute for aggravated murder, that now since you don't have to do the first part, the jury would do the second part which determines what the ultimate sentence will be?\n\n\"A. Well, I just kind of think that murder is murder. You kill somebody, you kill them.\"\n\nDefendant and the state each cite many cases from other forums to us in which prospective jurors were or were not excused for particular answers given in death penalty cases on voir dire. We think little is to be gained by going through those authorities one by one, for case matching is of little assistance in this area. The general rule for testing error in this respect is quite simple. The issue is whether the prospective juror's views would prevent or substantially impair the performance of the duties of the person if selected as a juror. See, e.g., Lockett v. Ohio, supra, 438 U.S. at 596-97, 98 S Ct at 2960, 57 L Ed 2d at 984-85.\n\nIt is fair to say that Watson strongly favored the death penalty. At no time, however, did he say that he would be unable to set aside his personal feelings; he did not say that his belief in the imposition of the death penalty would cause him to disobey the court's instructions on the law. In fact, when asked directly by defendant if the court should instruct contrary to Watson's belief, if he would follow the court's\n\ninstructions \"anyway,\" Watson answered that he believed that he would.\n\nThe voir dire of Watson does not establish that his views favoring the death penalty would prevent or substantially impair the performance of his duties as a juror.\n\nIf it is defendant's contention that a juror who generally favors the death penalty, as a matter of law, must be excused, we reject the contention. \"A man who opposes the death penalty, no less than one who favors it, can make the discretionary judgment entrusted to him by the state and can thus obey the oath he takes as a juror.\" Witherspoon v. Illinois, 391 U.S. 510, 519, 88 S Ct 1770, 1775, 20 L Ed 2d 776, 783 (1968). In State v. Leland, 190 Or 598, 227 P2d 785 (1951), defendant argued that excluding jurors who were opposed to capital punishment resulted in a harsh and vindictive jury rather than the impartial jury to which defendant was entitled by Article I, section 11, of the Oregon Constitution. This court said:\n\n\"The constitutional point rests upon the false premise that a person who believes in capital punishment, or at least one who has no conscientious scruples against it, is apt to be unfair and vindictive. This is practically an indictment of the people of Oregon, for it is by their will that capital punishment is authorized in this state.\"\n\n190 Or at 625.\n\nDuring voir dire defendant was assisted by two experienced lawyers as legal advisers. He challenged jurors for cause when he believed it necessary.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e He exercised 11 of his\n\npermitted 12 peremptory challenges. On several occasions he was granted recesses to confer with his legal advisers concerning challenges both for cause and peremptory challenges.\n\nDefendant passed this juror for cause, and, although he did not exhaust his number of peremptory challenges, he did not use one on Watson. We have no way of looking into defendant's mind to determine on a cold typewritten record why defendant chose not to challenge him. Perhaps something in Watson's facial expression, tone of voice or body language caused him to be a juror acceptable to defendant. There is certainly nothing revealed in the transcript of voir dire to mandate that this court reverse the trial judge for failure, on his own motion, to excuse Watson for cause.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nC.\n\nDefendant contends that the court should have excluded the opinion evidence of John Cochran, a forensic clinic psychologist, who opined that it was more likely than not that defendant would in the future commit criminal acts of violence that would constitute a continuing threat to society. As noted above where we first discussed this issue, defendant's argument rests on the proposition that such evidence is incompetent and cannot be received. The basis for this contention is that there are a large number of studies that have caused some, or even a majority of, mental health practitioners to believe that the prediction cannot be made at all and that psychiatrists and psychologists are no better able to make it than a lay person if it can be made.\n\nAs we have already noted, the persons who conducted those studies and those who relied on them in writing the articles cited by defendant were not here available for cross-examination to test the validity of their views. Because there was no objection or challenge to the testimony of witness Cochran below on this or any other basis, there was no need or occasion for the state to produce evidence from those who\n\nbelieve that the studies and conclusions cited by defendant are flawed.\n\nThere is no error apparent on the face of the record in this respect.\n\nD.\n\nDefendant contends that the trial court erred in admitting evidence of defendant's previous bad character, acts and criminal conduct that did not result in convictions. This evidence came in without objection, but even if it had been admitted over objection, our reaction would be the same. The evidence of these bad acts was not received for the purpose of impeachment of defendant. When evidence of a defendant's bad acts is sought to be introduced to blacken a defendant's character, we do not allow it under Oregon Evidence Code as a general rule because it does not tend to prove or disprove any fact in issue. In considering question number 2 under ORS 163.150(2)(b), however, such evidence is relevant. It is the kind of evidence on which logical human beings, every day in our society and criminal justice system, make predictions about what a person is most apt to do in the future.\n\nDefendant did not challenge the truth or accuracy of the information which the jury received and considered on this issue.\n\nThere was no error in this respect.\n\nE.\n\nDefendant urges that the state's evidence failed to prove beyond a reasonable doubt that he had a propensity to commit violent criminal acts which would manifest itself in that way in the future.\n\nNothing is to be gained by quoting or paraphrasing the evidence in this respect. There is a surfeit, a plethora, a veritable supersaturation of evidence from which a jury could conclude that the answer to the second question should be in the affirmative. Our task is not to conduct review of facts anew on the record; if it were, we would be convinced, as was the jury, beyond all reasonable doubt that the second question should be answered affirmatively.\n\nF.\n\nDefendant contends that the trial court erred in failing on its own motion to clarify which prosecutor was right with respect to certain matters in opening argument as contrasted with closing argument.\n\nIn opening argument, Deputy District Attorney Engdall stated to the jury:\n\n\"You realize now, of course, that your purpose here is not to decide the penalty. As strange as that sounds, technically you do not vote for life in prison or the sentence of death. You confine your deliberation and your attention to answering the three questions; questions that we have talked about during the early part of this proceeding. The Court will further instruct you, again, as to what those questions are and will define certain terms found within those questions.\n\n\"* * *\n\n\"You have a duty to decide three critical issues based upon the facts and the evidence and the law. Fair trial is mandated. As we know, our justice system is our heritage of freedom; must be honored and must be held sacred. You are not to decide whether the Defendant should live or die; it's already been decided, in fact, by the statute. You must only answer the three questions. You are not the executioner, but you are integral in the most important part of the judicial system to insure fairness in this process. And, in fact, you are a part of society's own and last resort of self-defense.\"\n\nIn closing argument, Deputy District Attorney Houchin told the jury:\n\n\"I believe to a person -- those of you on this jury indicated that you will abide by your oath as jurors. To a person, you agreed that those are questions that factually can be answered, and agreed that you would do your best and participate in the process of answering those questions. You all know the results of your answer, and it's not easy. That jury room is going to be tense; it's going to be somber, as well it should, because you're being asked to do something that is very difficult for us to do. In fact, you're being asked to make factual decisions. And I believe that we have, through the evidence and through the witnesses, given you sufficient basis to make those answers. I trust that you will have no problems answering each of those questions yes, because my client, the State of Oregon, believes that yes answers are the only logical answers based on the evidence.\n\n\"You each agreed that you would not, if that is your opinion, change your answers solely because you know that three answers of yes means this Defendant will be given a death penalty. And I'm sure that each of you will adhere to your sworn duty and not make a false answer to avoid that. You are the people who will determine what the level of justice is in this case. That may sound trite, but that's your job. You are the conscience of Linn County of the State of Oregon in this sentencing proceeding. You will determine whose life is more valuable; Jeri Koenig's and the rest of us, those of us in society whatever that society may be, or this Defendant's.\"\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nAssuming, without deciding, that there is a conflict between what each prosecutor told the jury, we do not find that it called for the trial court to interpose itself to correct Mr. Engdall's remarks.\n\nActually, although they were a bit unfortunately phrased, Mr. Engdall's remarks were not inaccurate. The jury did not \"technically\" vote for death or life imprisonment. It did only vote how to answer three specific questions. The jury was well aware from what had transpired over the course of several days, commencing with voir dire, that it was the jury that would be deciding whether sentence of death or life imprisonment was to be imposed.\n\nAt any rate, Mr. Houchin's remarks, the last thing the jury heard before the court's charge, made it abundantly clear that by its answers the jury would be deciding the sentence to be imposed. This jury was not insulated from knowing the result of its decision in the manner condemned in Caldwell v. Mississippi, supra. To suggest that on the record in this case the jurors did not know the consequences of their answers is at least to deny reality if not an insult to the intelligence of the jurors.\n\nXIII.\n\nIn this court defendant contends that he manipulated the system to commit suicide and that the State of Oregon cannot be made a partner to that course of action. This argument is not supported by the record.\n\nFollowing the murder, defendant stole the victim's\n\nmotor vehicle and was apprehended in San Francisco when he drove the vehicle the wrong way on a one-way street. His escape was thus thwarted.\n\nAfter arrest he had counsel appointed to defend him. When arraigned he sought and received permission for extra time to test the sufficiency of the indictment. His counsel filed a demurrer on his behalf and therein challenged the constitutionality of the death penalty statute on many separate grounds, which have been addressed in this opinion.\n\nAfter he was allowed to proceed without counsel, other than in an advisory capacity, he filed and argued several pretrial motions. For instance, he filed motions for private pretrial interviews with witnesses, for payment of expert witness fees, for disclosure of grand jury testimony, for a telephone to be installed in his cell to facilitate his preparation for trial, for return of property that had been seized from him and to be allowed 24 instead of 12 peremptory challenges. He successfully opposed the state's motion that he be shackled during trial, although he conceded during argument that he was a \"violent\" person. He also successfully obtained a stipulation by the state that limited what the jury would be allowed to hear as to the details of his assault on the infant child of the victim.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nNot only did defendant ask literally hundreds of questions on jury voir dire, but during the sentencing trial, defendant vigorously and effectively cross-examined the state's witnesses. His cross-examination at times elicited testimony that was favorable to him. He successfully impeached a witness with a written document. He made objections to evidence, and some were sustained. Some of those successful objections were for hearsay and some for relevancy. His native intelligence and the advice of his lawyer advisers were artfully employed to challenge the picture of him which the state sought to paint.\n\nIn his argument to the jury, he did not ask to be executed. He urged the jury not to return affirmative findings\n\nto the three questions to be submitted to the jury. He emphasized the state's burden of proof and argued that the burden had not been met. He argued that the \"bad acts\" and \"bad conduct\" on his part during his teen years was nothing more than what the average child goes through. As to his hundred or so fights in prison and in jail, he argued that those are tough environments that demand that kind of conduct to survive.\n\nHe argued that the state had failed to prove the answer to the third question concerning provocation by the victim. He argued that she was a bad person because of her conduct and unfaithfulness to him and that she deserved what she got. He concluded his argument as follows:\n\n\"All these little things that really, really are piddly, the Prosecution has tried to build up, blow out of proportion, make you believe that I deserve the death penalty and that there is no hope for me.\n\n\"He describes all the things that I have taken from these women that he has spoken of, but those are the things that he spoke of and were the only things I ever asked for.\n\n\"Again, I want to tell you that the Prosecution, Mr. Engdall and Mr. Houchin -- well, when I came into this -- in the Voir Dire, I was worried. They seemed very intelligent -- seemed. But then after I seen the first day of trial I just sat back; I didn't even have to really cross-examine. It was so sloppy; very poorly put together. The examples they gave were sour. I was shocked. I was also disappointed. I thought I would have a challenge. But as it stands, I didn't even have to put on a defense.\n\n\"And like now, you know, I don't want to waste any more of your valuable time.\"\n\nAssuming, arguendo, that it is within our province to find facts as to this issue, we find that defendant was not attempting to manipulate the system so as to cause the state to assist him in committing suicide.\n\nFinally, on this issue we agree with the state's summation in its brief in this court:\n\n\"There is a more fundamental reason why the death sentence should not be reversed, even if brought about by defendant's deliberate design. The people of Oregon (by their enactment of Measures 6 and 7); this court (by its cases upholding death sentences in the past); the courts of the\n\nUnited States; and the legislatures of this and other states, have all concluded that death is appropriate for certain people. Defendant is one of them. There is no reason, and defendant asserts none, why he should not be allowed to agree with that judgment. If a defendant rationally concluded that he had killed deliberately, that his act was unreasonable in response to any provocation, that there was a probability that he would commit criminal acts of violence in the future, and that he deserved the death penalty, he should be permitted to take that position at the penalty trial. The state does not concede that defendant did so, but even if he had, he would have been entitled to do so. To prohibit such a choice as a matter of law does not comport with the personal autonomy and human dignity which is due any criminal defendant, even in a capital case.\n\n\"D. ' Suicide' is not the same thing as lawful execution.\n\n\"Even if it can be said that defendant tried to 'use the system' to achieve his own death, defendant's appellate argument misconceives the nature of the end result. Suicide and lawful execution are different. An accused's execution pursuant to law represents imposition of a sanction by society, after the appropriate criteria have been satisfied through proper legal proceedings. In contrast, suicide is an act of self-destruction committed by an individual -- for private reasons, and against (at least historically) the moral laws of society. Whether a defendant in a capital case eagerly seeks the death penalty, acquiesces, or resists it to his last breath, the final decision is never his. Defendant's equation of a lawfully imposed sentence of death with 'suicide' trivializes this state's solemn decision to adopt the death penalty for aggravated murder. The argument, stripped of its rhetorical overlay, is nothing less than an attack on the moral and constitutional permissibility of the death penalty itself -- an attack that already has failed in the courts and in our society. See Or Const, Art I, § 40; State v. Quinn, supra, 290 Or at 399-407 (history of death penalty in Oregon); Gregg v. Georgia, supra (death penalty is not cruel or unusual punishment if imposed by properly drawn and applied statutes).\"\n\nIf a defendant, counseled or uncounseled, could intentionally so irritate the jury as to cause it to return affirmative answers to the three questions, thereby requiring sentence of death, and then successfully contend on appeal that he manipulated the system so as to make the state his partner in suicide, the way would be clear for every person convicted of aggravated murder to avoid the penalty of death. We repeat\n\nthat we do not find that this defendant did so manipulate the system, but we believe the observation made in the preceding sentence to have validity.\n\nConclusion\n\nThe Oregon Constitution and the statutory law provide for a possible penalty of death for certain carefully defined aggravated murders; the constitution and statutes do not mandate death for such murderers. The statutes do not offend the Oregon Constitution; rather, they provide the operative vehicle by which the purpose of the constitutional provision, Article I, section 40, may be attained. So long as Jurek v. Texas, supra, remains the law, the Oregon constitutional and statutory \"scheme\" for sometimes imposing the death penalty does not offend the Constitution of the United States.\n\nDefendant made a solemn choice not to contest his guilt of the crime charged in the indictment only after the trial court went to extraordinary lengths to ensure that he realized the nature of his decision and the two possible results that must flow from that decision.\n\nInsofar as any claim of error here concerning the trial of the sentencing portion of the proceedings below may be concerned, defendant had a fair trial. Although his defense was not ultimately successful, it was vigorous and not completely lacking in skill.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\n\nThe judgment of conviction and sentence of death imposed by the trial court are affirmed on this review.\n\nAPPENDIX A\n\nIN THE CIRCUIT COURT OF THE STATE OF OREGON FOR THE COUNTY OF LINN\n\nSTATE OF OREGON, Plaintiff, vs JEFFREY Scott WAGNER Defendant,\n\nCASE NO. 8506-1212\n\nD.A. NO.\n\nPETITION TO ENTER PLEA OF GUILTY [X] NO CONTEST [ ]\n\nThe defendant represents to the Court:\n\n1. I wish to plead GUILTY [X] NO CONTEST [ ] to the charge(x) of AGGRAVATED MURDER, alleged to have been committed on or about June 26, 1925.\n\n2. I told my lawyer all the facts and circumstances known to me about such charge(s), and believe he is fully informed. My lawyer has counselled and advised with me on the nature of each charge; or any lesser included charges; and on the possible defenses that I might have in this case.\n\n3. I understand that I may plead \"Not Guilty\", in which event the Constitution guarantees me (a) the right to a speedy and public trial by jury, (b) the right to see and question, in open court, all witnesses called to testify against me, (c) the right to use the process of the Court to compel the production of any evidence, including the attendance of any witnesses in my favor, and (d) the right to have the assistance of a lawyer at all times, and (e) also the right to take the witness stand at my sole option; and, if I do not take the witness stand, I understand the jury will be told that this may not be held against me. The jury will also be told I am to be presumed innocent, and the State must prove such charge(s) beyond a reasonable doubt.\n\n4. I also understand that if I plead \"GUILTY\" [X], \"NO CONTEST\" [ ], the Court may impose the same punishment as if I had plead \"Not Guilty\", stood trial, and been convicted.\n\n5. I know that if I plead \"GUILTY\" [X] \"NO CONTEST\" [ ], to this charge, (these charges), the maximum possible sentence is life imprisonment and/or death. I know also that the sentence is up to the Court only, and no agreement between me, my attorney, or the District Attorney is binding upon the Court.\n\n6. I have [X] have not [ ] been convicted of one or more felonies in the past, as follows: Burglary in the 2nd Degree Wilful Failure to Return to Place of Confinement.\n\n7. I am [X] am not [ ] presently on probation or parole. I understand that by pleading guilty [X] No Contest [ ] in this case this may cause revocation of my probation or parole, and that this could result in a sentence of 10 years in that case. I further understand that if my parole or probation is revoked, any sentence in that case may be consecutive to or in addition to any sentence in this case. [ILLEGIBLE LINE].\n\n7a. I understand that if I am not a citizen of the United States, conviction of a crime may result, under the laws of the United States, in deportation, exclusion from admission to the United States or denial of naturalization.\n\n8. I am 25 years of age. I have gone to school up to and including 9th grade + GED. My physical and mental health is presently satisfactory, and I am not under any medication or drugs.\n\n9. I declare that no officer or agent of any branch of government (Federal, State, of local) has made any promise or threat, or any suggestion of any kind to me, (or) within my knowledge to anyone else), nor do I expect that I will receive a lighter sentence, or probation, or any other form of leniency if I plead \"GUILTY\" [X] \"NO CONTEST\" [ ]\n\n10. I believe that my lawyer has done all that anyone could do to counsel and assist me. I AM SATISFIED WITH THE ADVICE AND HELP HE HAS GIVEN ME: I recognize that if I have been told by my lawyer or anyone else that I might receive A life sentence, this is merely a prediction, and is not binding on the Court.\n\n11. I plead \"GUILTY\" [X] \"NO CONTEST\", [ ] and request the Court to accept my plea of \"GUILTY\" [X] \"NO CONTEST\" [ ] on the basis that I am guilty, and make such plea voluntarily, and with full understanding of my rights, and the possible consequences that may follow.\n\n12. (If this is a plea to District Attorney's Information) My written Waiver of Indictment is attached hereto. I realize that I have a Constitutional right to have the evidence against me submitted to a Grand Jury, and that it could refuse to return any charge against me, or could elect to return a lesser charge.\n\n13. I further state that I wish to waive the reading of the Indictment or Information in open Court.\n\nSigned by me in the presence of my attorney this 10th day of February, 1986.\n\n[ILLEGIBLE WORD], Defendant\n\nMy address is LINN County Jail and my phone number is 967-3901.\n\nDisposition\n\nThe judgment of conviction and sentence of death by the trial court are affirmed.\n\nLINDE, J., dissenting.\n\nThe judgment in this case directs Oregon's public officials to put to death a defendant who discharged his lawyers, insisted on pleading guilty to a capital offense, and failed to make a serious or plausible challenge to the propriety of his death sentence. The proceeding as a whole fell far short of the kind of capital trial anticipated when Oregon's voters were asked to reinstate a death penalty in this state. It also fell short of standards set by the United States Supreme Court. There is serious doubt that the 1984 death penalty measure, which exacerbated the flaws in its already questionable Texas model, can meet federal standards.\n\nUnder the Supreme Court's standards, the sentencing authority, either the judge or a jury, must be able to reject the death penalty even when its legal basis is proved, if the sentencer concludes that additional facts militate against a death sentence in the particular case. The 1984 measure allows neither the jury nor the judge that authority. Neither the judge nor the jury actually is asked to decide for or against the penalty, as the law is written. The jury only answers three specified questions of past or predicted facts. It cannot legally respond to mitigating considerations that do not relate to those three questions.\n\nOregon and federal law both recognize that extraordinary procedural standards must be met if public officials are to take a person's life, even a murderer's. Oregon's complex definition of aggravated murder and the issues involved in the 1984 death penalty scheme make it impossible to meet these standards unless a skilled advocate tests the prosecution's case, even when the accused makes his own defense. The standards certainly were not met here.\n\nI believe this dissent demonstrates the reasons why this death sentence should not stand. The case should be remanded for a proper trial, unless the state, through its prosecutor, chooses to accede to the Public Defender's proposal to impose a sentence of life imprisonment with a minimum of 30 years before defendant may be considered for parole. ORS 163.105(1).\n\nI. ACCURACY STANDARDS IN CAPITAL CASES\n\nThe death penalty measure that was put on the ballot\n\nby initiative and enacted in 1984 may well be impossible to square with requirements under the federal Eighth and Fourteenth Amendments repeatedly stated by the United States Supreme Court. The reasons for this conclusion are spelled out in Part V of this opinion. In the present case, however, there are compelling independent reasons of Oregon law why the proceeding as a whole fell short of those required for a valid death sentence, though a maximum sentence short of death might be affirmed. Because the procedures and indeed the present death penalty scheme are unprecedented in Oregon, it is necessary to state those reasons in detail.\n\nFirst, American law has long recognized the difference between punishment by death and all other punishments and given it important procedural consequences. The fact that defendants \"stood in deadly peril of their lives\" is what more than a half-century ago made an \"effective\" appointment of counsel a matter of federal due process in Powell v. Alabama, 287 U.S. 45, 71, 53 S Ct 55, 77 L Ed 158 (1932), and compare Betts v. Brady, 316 U.S. 455, 464, 62 S Ct 1252, 86 L Ed 1595 (1942). Justice Harlan wrote that capital cases \"stand on quite a different footing than other offenses. * * * I do not concede that whatever process is 'due' an offender faced with a fine or a prison sentence necessarily satisfies the requirements of the Constitution in a capital case,\" the distinction \"being literally that between life and death.\" Reid v. Covert, 354 U.S. 1, 77, 77 S Ct 1222, 1 L Ed 2d 1148 (1957) (Harlan, J., concurring). The passage most often quoted in the Supreme Court's recent death penalty cases is from Woodson v. North Carolina, 428 U.S. 280, 305, 96 S Ct 2978, 49 L Ed 944 (1976):\n\n\"[T]he penalty of death is qualitatively different from a sentence of imprisonment, however long. Death, in its finality, differs more from life imprisonment than a 100-year prison term differs from one of only a year or two. Because of that qualitative difference, there is a corresponding difference in the need for reliability in the determination that death is the appropriate punishment in a specific case.\"\n\nSee also Eddings v. Oklahoma, 455 U.S. 104, 117, 102 S Ct 869, 71 L Ed 2d 1 (1982) (O'Connor, J., concurring).\n\nOregon law also has long imposed stricter safeguards on potential capital cases than on other criminal proceedings.\n\nIn the state's early years, the death penalty here as elsewhere was imposed much like other punishments, regardless whether defendant was represented by counsel or offered any defense. See, e.g., State v. Rathie, 101 Or 339, 199 P 169 (1921), Ex parte Harrell, 57 Or 95, 110 P 493 (1910). Even then, this court recognized that scrupulous adherence to \"the rules and methods which the law has itself provided\" was required \"especially in capital cases.\" State v. Olds, 19 Or 397, 427, 24 P 394, 401 (1890). Later constitutional amendments introduced important differences. Article I, section 11, was amended in 1932 to permit defendants to waive trial by jury and be tried by the judge alone, but capital cases were expressly excluded. A further amendment in 1934 relaxed the existing requirement of a unanimous verdict in criminal cases and authorized ten jurors to render a verdict of guilty or not guilty, but the amendment again excluded verdicts of guilty of first degree murder, which continued to require a unanimous jury verdict.\n\nA final, important difference arises from the adoption of the present death penalty law itself. That is the difference in this court's scope of review of death penalty cases. It, too, finds support in constitutional decisions of the United States Supreme Court.\n\nThis court's duty in a death penalty case is to subject the judgment of conviction and sentence of death to \"automatic and direct review.\" ORS 163.150(1)(f). The death penalty law was not enacted by the Legislative Assembly. It was adopted upon popular initiative, over the deep opposition of a significant minority of Oregon's voters. The assurance that death sentences would receive \"automatic\" review by the state's highest court was part of the proponents' promise to the voters, to those who decided to vote for the measure as well as those who opposed it. November 1984 Voters' Pamphlet at 33.\n\nThis assurance makes a crucial change from the court's responsibility in an ordinary criminal appeal. The court does not meet its responsibility whenever it satisfies itself that it disposes of whatever arguments a defendant presents, as the majority proceeds in this case. The court's responsibility is not merely to the defendant; it is to the law that limits the unique penalty of death.\n\nThe point of \"automatic\" Supreme Court review is\n\nnot to save a defendant the trouble of filing an appeal and, if necessary, a petition for review. The point is not to give a defendant the opportunity to save his life, if he has the desire and the help of competent counsel to do so. An ordinary appeal does that much. Nor is it to prevent a defendant's state-assisted \"suicide.\" The point of assuring that this court must automatically review every death sentence case is to make certain that the death penalty is imposed and executed only by the criteria and within the bounds set by the law itself and by the Oregon and United States Constitutions. The Supreme Court of Pennsylvania relied on that state's similar provision for \"automatic review\" to invalidate a death sentence even when a defendant expressly refused to challenge it, holding that the \"overwhelming public interest\" in insuring that capital punishment comports with constitutional requirements and the \"irrevocable finality\" of the death sentence made review of its validity \"imperative.\" Commonwealth v. McKenna, 476 Pa 428, 440-41, 383 A2d 174, 181 (1978).\n\nAutomatic review under the death penalty measure therefore is not primarily an act of concern for a defendant who may merit little concern and demand none at all. The defendant is not allowed to waive review. It is not sympathy with a killer that explains the vigils outside prisons when the state schedules the execution of one of its people. Because the court's duty is to assure that the state puts no one to death unless the sentence qualifies under all criteria of the law, the court needs a record on which the relevant issues can be determined and, to the extent that they depend on facts, have been properly determined in the circuit court. This cannot be done if a defendant, by refusing counsel or reducing them to the role of \"advisers\" and pleading guilty, eliminates potential legal and factual issues from proper determination by the court or jury. These issues are important to others than the defendant.\n\nTogether, the unique nature of the death penalty, the requirements embodied in the jury trial provisions of Article I, section 11, and the purposes of \"automatic and direct review\" bar execution of the death sentence in this case.\n\nII. COMPLEXITY OF CAPITAL MURDER ISSUES\n\nTo see how a proceeding like that in the present case can frustrate the certainty required for a death sentence, one\n\nmust begin with a careful examination of the death penalty law.\n\nORS 163.150 itself does not define aggravated murder, the crime for which the death penalty is authorized. It prescribes additional procedures and criteria for imposing the death penalty. But ORS 163.150 presupposes that the defendant has committed aggravated murder before the court proceeds to the sentencing proceeding. That supposition will often depend on debatable issues, as the following examples show. They are included here, not because they arise in this case, but because they illustrate why no unrepresented defendant can simply by pleading guilty to aggravated murder provide the predicate for a death sentence with the requisite degree of certainty.\n\nAggravated murder is defined in ORS 163.095 as follows:\n\n\"As used in ORS 163.105 and this section, 'aggravated murder' means murder as defined in ORS 163.115 which is committed under, or accompanied by, any of the following circumstances:\n\n\"(1)(a) The defendant committed the murder pursuant to an agreement that the defendant receive money or other thing of value for committing the murder.\n\n\"(b) The defendant solicited another to commit the murder and paid or agreed to pay the person money or other thing of value for committing the murder.\n\n\"(c) The defendant committed murder after having been convicted previously in any jurisdiction of any homicide, the elements of which constitute the crime of murder as defined in ORS 163.115 or manslaughter in the first degree as defined in ORS 163.118.\n\n\"(d) There was more than one murder victim in the same criminal episode as defined in ORS 131.505.\n\n\"(e) The homicide occurred in the course of or as a result of intentional maiming or torture of the victim.\n\n\"(2)(a) The victim was one of the following and the murder was related to the performance of the victim's official duties in the justice system:\n\n\"(A) A police officer as defined in ORS 181.610(6);\n\n\"(B) A correctional, parole or probation officer or other\n\nperson charged with the duty of custody, control or supervision of convicted persons;\n\n\"(C) A member of the Oregon State Police;\n\n\"(D) A judicial officer as defined in ORS 1.210;\n\n\"(E) A juror or witness in a criminal proceeding;\n\n\"(F) An employe or officer of a court of justice; or\n\n\"(G) A member of the State Board of Parole.\n\n\"(b) The defendant was confined in a state, county or municipal penal or correctional facility or was otherwise in custody when the murder occurred.\n\n\"(c) The defendant committed murder by means of an explosive as defined in ORS 164.055(2)(a).\n\n\"(d) Notwithstanding ORS 163.115(1)(b), the defendant personally and intentionally committed the homicide under the circumstances set forth in 163.115(1)(b).\n\n\"(e) The murder was committed in an effort to conceal the commission of a crime, or to conceal the identity of the perpetrator of a crime.\n\n\"(f) The murder was committed after the defendant had escaped from a state, county or municipal penal or correctional facility and before the defendant had been returned to the custody of the facility.\"\n\nWhether a murder is an \"aggravated\" murder under this statute turns on questions of law as well as on facts, questions that demand professional knowledge of law and professional responsibility for making a proper record.\n\nWhat, for instance, will qualify as a \"thing of value\" for purposes of ORS 163.095(1)(a) and (b)? Cf. State v. Whitley, 295 Or 455, 459, 666 P2d 1340 (1983) (property must be a \"thing of value\" for burning it to be arson).\n\nUnder subsection (1)(c), how closely must the elements of homicide in another jurisdiction, perhaps in another language, correspond to the elements of murder or manslaughter in Oregon?\n\nWhat is \"torture\" within the meaning of subsection (1)(e)? If a defendant had pleaded guilty under this subsection without counsel to raise that question, before this court circumscribed \"torture\" in State v. Cornell/Pinnell, 304 Or 27, 32, 741 P2d 501 (1987), there would be no assurance that the\n\ndefendant facing a death sentence actually had committed aggravated murder.\n\nWhat kind of persons qualify under ORS 163.095(2)(a)(B) as being \"charged with the duty of custody, control or supervision of convicted persons\"? What does the subsection mean by a murder \"related to\" the victim's official duties? In paragraph (E), how far does a \"juror or witness in a criminal proceeding\" include potential jurors and witnesses in anticipated future proceedings, and must this status be known to the murderer? See State v. Maney, 297 Or 620, 626, 688 P2d 63 (1984). In paragraph (F), does an \"officer\" of a court of justice who is not an \"employe\" include, for instance, a prosecutor or other member of the bar? Cf. ORS 9.010(1) (any state bar member is an \"officer of the court\").\n\nDoes \"otherwise confined in custody\" in subsection (2)(b) mean for purposes of aggravated murder and a potential death sentence what it means for warning a person before police questioning, or is it any clearer? Cf. State v. Milligan, 304 Or 659, 748 P2d 130 (1988) (compelled blood samples taken without formal \"arrest\"); State v. Okeke, 304 Or 367, 745 P2d 418 (1987) (excluding evidence seized from person in involuntary confinement at detoxification center); State v. Magee, 304 Or 261, 744 P2d 250 (1987) (person held for questioning in police station). Does \"the perpetrator of a crime\" in subsection (2)(e) include every person potentially punishable for the crime or only the person who committed the decisive act? Cf. ORS 161.150 to 161.175 (\"Parties to crime\").\n\nSome of these questions are difficult, others are easier, and some may never arise in an actual prosecution for aggravated murder. There is no need to answer them in the abstract here. What questions like these show is that neither a circuit court nor this court can assure that a death sentence is not applied beyond its authorized reach when a defendant pleads guilty and does not raise or let counsel raise the legal issues. In the present case, defendant was allowed to pursue a course that prevented the lawyers who were appointed to \"advise\" him from making an effective challenge to the state's proof of aggravated murder. Without a guilty plea, it is not at all certain whether a jury would have been convinced beyond a reasonable doubt that defendant was motivated to kill his lover because he resented her willingness to testify to his\n\nassaulting her child (which is the basis of this aggravated murder charge) rather than out of jealousy or some other psychic drive. He similarly prevented an effective challenge to the death sentence in the sentencing phase, to which I shall return.\n\nIII. CAPITAL CASES UNDER OREGON'S ARTICLE I, SECTION 11\n\nA guilty plea also can leave doubts under the aggravated murder law unresolved when the prosecution excludes the death penalty, but that is not unusual; pleas of guilty to felonies carrying prison sentences often do not accurately match the exact statutory crimes that the defendant in fact has committed. See Rise v. Board of Parole, 304 Or 385, 396, 745 P2d 1210 (1987) (Linde, J., concurring). This tolerance for inaccuracy need not exclude murders defined as \"aggravated\" in ORS 163.095 as long as the death penalty is not an issue. The unique and irreversible nature of that penalty makes error on the side of death intolerable in capital cases.\n\nThe heightened demand for certainty is reflected in at least two provisions. As already stated, the death penalty law demands of courts the assurance that this state's officials not put anyone to death in the name of the people of Oregon beyond the criteria set by the law and by constitutional bounds. Also, Article I, section 11, of the Oregon Constitution makes distinctions between \"capital cases\" and other criminal prosecutions that clearly seek a higher threshold of certainty before a sentence of death may be imposed and executed, certainty sufficient when tested to convince a jury unanimously beyond a reasonable doubt.\n\nArticle I, section 11, provides:\n\n\"In all criminal prosecutions, the accused shall have the right to public trial by an impartial jury in the county in which the offense shall have been committed; to be heard by himself and counsel; to demand the nature and cause of the accusation against him, and to have a copy thereof; to meet the witnesses face to face, and to have compulsory process for obtaining witnesses in his favor; provided, however, that any accused person, in other than capital cases, and with the consent of the trial judge, may elect to waive trial by jury and consent to be tried by the judge of the court alone, such election to be in\n\nwriting; provided, however, that in the circuit court ten members of the jury may render a verdict of guilty or not guilty, save and except a verdict of guilty of first degree murder, which shall be found only by a unanimous verdict, and not otherwise; * * *.\"\n\nThe majority dismisses the exclusion of \"capital cases\" by explaining that the 1932 amendment was designed to allow criminal trials before a court without a jury, which the section previously prevented, and that defendants long had been allowed to plead guilty to capital crimes as to any other crimes. That is a historically correct statement, but it misses the point.\n\nThe question is not why the 1932 amendment allowed defendants to waive a jury and be tried by the judge alone, with the judge's consent. The question is why the amendment for the first time created a distinction and did not allow defendants to do so in \"capital cases.\" The reason could not be to relieve judges of a difficult burden, because the amendment required the judge's consent in any case. Rather, the exclusion of \"capital cases\" points to another concern, to the same concern that explains the exclusion of \"first degree murder\" when the section was again amended in 1934 to allow convictions by less than unanimous jury verdicts. That concern, of course, is to assure the highest degree of certainty by a unanimous jury that every element of a capital crime has been proved beyond a reasonable doubt before a court may order a defendant to be put to death.\n\nThe heightened demand for certainty reflected in the amended Article I, section 11, is frustrated if a defendant can foreclose jury scrutiny of each element of a capital crime simply by pleading guilty. It is no answer that a defendant is free to waive a procedure that is provided for his protection, for the 1932 amendment does not permit the defendant in a capital case to waive a jury and be tried by the court alone. To repeat, more than the defendant's self-interest is at stake.\n\nA number of those states that have the death penalty at all do not allow defendants at will to plead guilty and be sentenced to death. The majority opinion reviews cases cited by the Public Defender and painstakingly distinguishes the laws in those states from Oregon's laws. Those cases and laws indeed differ, but that does not deny their significance for the\n\nissue before us. It was expressed by the Supreme Court of North Carolina as a matter of judicial policy before a statute reversed it:\n\n\"The idea that a person should be allowed to decree his own death has been unacceptable, not only to the judiciary, but to the citizens at large. This State has inflicted the supreme penalty only when a jury of twelve has been convinced beyond a reasonable doubt of the guilt of the accused after a trial conducted with all the safeguards appropriate to such a proceeding.\"\n\nState v. Watkins, 283 NC 17, 30, 194 SE2d 800, 809-10, cert den 414 U.S. 1000 (1973). The same policy is necessarily implied in Article I, section 11. Whatever may have been the early practice, after the 1932 amendment there is no acceptable explanation for an interpretation that would let a defendant circumvent the section's requirement of a unanimous verdict in a capital case by pleading guilty yet not by choosing a trial by the court without a jury. The sensible interpretation is that a defendant cannot circumvent that requirement at all.\n\nIV. ANALYSIS AND RECORD LACKING IN SENTENCING PROCEEDING\n\nThe certainty required for a valid death sentence was similarly frustrated by the manner in which defendant was permitted to conduct the sentencing phase of his case.\n\nLike the aggravated murder law, the death sentence statute, ORS 163.150, bristles with difficulties. Some are pure questions of law; others require an adequate factual record. They obviously were beyond the competence of this or any unrepresented defendant.\n\nThe statute provides that a defendant is to be sentenced to death if the jury affirmatively decides three issues:\n\n\"(A) Whether the conduct of the defendant that caused the death of the deceased was committed deliberately and with the reasonable expectation that death of the deceased or another would result;\n\n\"(B) Whether there is a probability that the defendant would commit criminal acts of violence that would constitute a continuing threat to society. In determining this issue, the court shall instruct the jury to consider any mitigating circumstances offered in evidence, including, but not limited to,\n\nthe defendant's age, the extent and severity of the defendant's prior criminal conduct and the extent of the mental and emotional pressure under which the defendant was acting at the time the offense was committed; and\n\n\"(C) If raised by the evidence, whether the conduct of the defendant in killing the deceased was unreasonable in response to the provocation, if any, by the deceased.\"\n\nORS 163.150(1)(b)(A)-(C). The issues are to be decided on evidence taken at trial and in the sentencing proceeding. ORS 163.150(1)(a).\n\nThe second of these issues poses the greatest problems of law and of fact. The text of paragraph (B) demands careful scrutiny.\n\nThe first sentence calls for the jury to decide \"[w]hether there is a probability that the defendant would commit criminal acts of violence that would constitute a continuing threat to society.\" The majority construes \"probability\" to mean \"more likely than not,\" as did the trial court. It leaves the meaning of the conditional \"would\" rather than the future \"will\" unexplained. \"Would\" if what? But harder problems remain unresolved.\n\nWhat are \"criminal acts of violence\"? Are they limited to bodily violence directed against a person or persons? The court could so limit the statute, but the words do not, and the limitation is not self-evident. Are arson and bombing of buildings acts of violence? Does a person with a propensity to get at his victims by killing or torturing their pets or other animals commit criminal acts of violence?\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nThe statutory test is further qualified. The first sentence of the subsection, quoted again for emphasis, poses the issue \"[w]hether there is a probability that the defendant would commit criminal acts of violence that would constitute a continuing threat to society.\" What do the emphasized words qualify? What must constitute a continuing threat to society, the nature of the anticipated criminal acts of violence, or the degree of their probability?\n\nMoreover, the words make a distinction between\n\nprobable criminal acts of violence that constitute a threat to society and others that do not. The distinction must have meaning; we are not free to treat it as surplusage.\n\n\"In the construction of a statute, the office of the judge is simply to ascertain and declare what is, in terms or in substance, contained therein, not to insert what has been omitted, or to omit what has been inserted; and where there are several provisions or particulars such construction is, if possible, to be adopted as will give effect to all.\"\n\nORS 174.010. See also Portland Adventist Medical Center v. Sheffield, 303 Or 197, 200, 735 P2d 371 (1987). A defendant may not be sentenced to death rather than to prison whenever he or she is likely to engage in future criminal violence against someone or something, but only if this probability (or the violence, whichever the clause means) threatens society. Because the statute precludes treating every probable assault as a threat to society, does it exclude defendants whose violent propensities are narrowly focused on one or a few individuals? The world contains persons who do not willingly assault any human being but war against institutions with dynamite and sabotage, and others who lead highly respectable public lives and privately assault only their wives or their children. Which are and which are not a \"continuing threat to society\"? And do those words exclude probable violence limited to fellow prisoners, who have been \"removed from society\" for its protection? The answer can be crucial in assessing the danger \"to society\" posed by a defendant who is going to prison for a very long time.\n\nOnce again, the present point is not that all these questions eventually need answers. The present point, rather, is that these crucial issues demand analysis and an evidentiary record, both of which are obviously beyond the capacity of an unrepresented defendant. They certainly were neither analyzed nor pursued in the record that led to this defendant's death sentence.\n\nV. NONCOMPLIANCE WITH FEDERAL CONSTITUTIONAL STANDARDS\n\nAs if these problems with ORS 163.150(1)(b)(B) were not bad enough, worse follows. After assigning to the jury the task to determine the \"probability that the defendant would\n\ncommit criminal acts of violence that would constitute a continuing threat to society,\" ORS 163.150(1)(b)(B) continues:\n\n\"* * * In determining this issue, the court shall instruct the jury to consider any mitigating circumstances offered in evidence, including, but not limited to, the defendant's age, the extent and severity of the defendant's prior criminal conduct and the extent of the mental and emotional pressure under which the defendant was acting at the time the offense was committed;\"\n\nThis sentence adds a new and crucial set of issues that no unrepresented defendant can be expected to recognize, let alone deal with. Certainly this defendant could not and did not deal with them. As a consequence, an indispensable element played no role in sentencing defendant to death.\n\nTo see the crucial nature of the \"mitigation\" issues of law and fact, one must review their source.\n\nORS 163.150 (1)(b)(B) plainly (for once) says that the jury shall be instructed to consider the defendant's age, prior criminal conduct, mental or emotional pressure at the time of the crime, and other \"mitigating circumstances offered in evidence\" in determining the probability that the defendant \"would commit criminal acts of violence that would constitute a continuing threat to society.\" Not in determining whether he or she should be put to death, or any other issue. The jury is to consider \"mitigating\" facts only in estimating the defendant's propensity to further dangerous criminal violence.\n\nThe source of the Oregon statute's sentence on mitigating circumstances is found in a decision of the Texas Court of Criminal Appeals in Jurek v. State, 522 SW 2d 934 (1975). That decision sustained a Texas death penalty law which called for the jury to decide the same three issues copied in ORS 163.150(1)(b) without the sentence about mitigating circumstances, and which later was sustained against federal constitutional attack in Jurek v. Texas, 428 U.S. 262, 96 S Ct 2950, 49 L Ed 2d 929 (1976). Although the Texas law did not refer to mitigating circumstances, the Texas court stated that \"in determining the likelihood that the defendant would be a continuing threat to society,\" the jury could consider a defendant's past criminal record, his age, and whether he was acting under another's duress or domination or under extreme mental or emotional pressure. 522 SW 2d at 939-40. When Jurek reached the United States Supreme Court, the lead opinion\n\nquoted this passage from the Texas court's opinion to show that Texas let the jury consider mitigating evidence, as required by other Supreme Court decisions, in answering the second statutory question. Jurek v. Texas, supra, 428 U.S. at 272-73.\n\nThe pitfalls in the Jurek version of the Texas law soon became obvious. Professor Charles Black noted them in a devastating critique of Jurek. Black, Due Process for Death: Jurek v. Texas and Companion Cases, 26 Cath U L Rev 1 (1976). Professor George Dix published two critical analyses of Texas cases tried under that law. Dix, Administration of the Texas Death Penalty Statutes: Constitutional Infirmities Related to the Prediction of Dangerousness, 55 Tex L Rev 1343 (1977); Dix, Constitutional Validity of the Texas Capital Murder Scheme: A Continuing Question, 43 Tex B J 627 (1980). See also Gillers, Deciding Who Dies, 129 U Pa L Rev 1 (1980) at 37-38 n 166. The fallacy of tying \"mitigating circumstances\" to a question about defendant's probable future violence that the jury must answer \"yes\" or \"no\" was not academic logic-chopping; it was demonstrated in practice, and it was no secret.\n\nNevertheless, the sponsors of Oregon death penalty law, despite a previous failure with importing the Texas statute into Oregon, see State v. Quinn, 290 Or 383, 623 P2d 630 (1981), again copied the Texas law and added the mitigating factors of the Texas court's Jurek opinion to the probability-of-continuing-criminal-violence issue defined in ORS 163.150(1)(b)(B), presumably on the theory that this would establish its validity under the United States Constitution. There is no doubt under the Oregon statute that mitigating evidence is expressly tied to the jury's assignment to predict the continuing threat of a defendant's criminal violence. The jury was so instructed in this case.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nThe lead opinion in Jurek v. Texas, however, was signed by only three justices. Its brief treatment of the role of \"mitigating circumstances\" was superseded by later Supreme Court decisions. In striking down an Ohio death penalty law in 1978, Chief Justice Burger wrote:\n\n\"* * * [A] statute that prevents the sentencer in all capital cases from giving independent mitigating weight to aspects of the defendant's character and record and to circumstances of the offense proffered in mitigation creates the risk that the death penalty will be imposed in spite of factors which may call for a less severe penalty. When the choice is between life and death, that risk is unacceptable and incompatible with the commands of the Eighth and Fourteenth Amendments.\"\n\nLockett v. Ohio, 438 U.S. 586, 605, 98 S Ct 2954, 57 L Ed 2d 973 (1978). Even though Ohio had \"liberally construed\" what evidence was admissible on the issue of mitigation, its statute limited a sentencing court to relating the evidence to three statutory mitigating issues in deciding whether a defendant would live or die. The Chief Justice wrote:\n\n\"The limited range of mitigating circumstances which may be considered by the sentencer under the Ohio statute is incompatible with the Eighth and Fourteenth Amendments. To meet constitutional requirements, a death penalty statute must not preclude consideration of relevant mitigating factors.\"\n\nId. at 608. In his review of capital sentencing laws after Lockett, Professor Stephen Gillers concluded that the Lockett rule invalidated the Texas sentencing model and any other scheme that \"channels\" the sentencing body's use of mitigating evidence toward answering prescribed factual questions. Gillers, supra, 129 U Pa L Rev at 31-37. That, of course, is exactly what ORS 163.150(1)(b)(B) does.\n\nIn 1982, the Court adopted the \"rule in Lockett \" as the basis for invalidating an Oklahoma death sentence because the trial court and the appellate court had construed Oklahoma law as excluding consideration of the defendant's \"turbulent family history,\" \"beatings by a harsh father,\" and \"severe emotional disturbance\" connected with having \"been raised in a neglectful, sometimes even violent, family background.\" Eddings v. Oklahoma, 455 U.S. 104, 113-16, 102 S Ct 869, 71 L Ed 2d 1 (1982). The Court did not volunteer exactly what facts must be regarded as \"mitigating\" and what they\n\nmust mitigate, questions that obviously are crucial to the conduct of a death penalty proceeding. But Eddings left no doubt that mitigating circumstances could not be confined to disproving some factual element of a defendant's past or future conduct, as ORS 163.150(1)(b)(B) does. And the kind of facts wrongly excluded from consideration in Eddings are just as likely to have made a defendant predictably more likely to engage in future violent acts.\n\nThe significance of Eddings for the Texas law was apparent. One Texas scholar wrote: \"The Eddings decision raises serious questions about the constitutionality of the Texas capital sentencing procedure.\" Benson, Texas Capital Sentencing Procedure After Eddings: Some Questions Regarding Constitutional Validity, 23 South Tex L J 315 (1982). Although in Lockett the plurality opinion had distinguished the Texas law as three justices in Jurek had understood it from the defects of the Ohio law, \"the rule promulgated in Lockett, as interpreted and applied in Eddings, may signal the end of the Texas scheme.\" Id. at 323 (footnote omitted). Professor Benson concluded: \"In light of Lockett and Eddings it appears that the present Texas statutory scheme for sentencing in capital cases is constitutionally inadequate under the Eighth and Fourteenth Amendments.\" Id. at 331 (footnotes omitted).\n\nLater Supreme Court decisions have repeated the importance of untrammelled consideration of mitigating factors. In Skipper v. South Carolina, 476 U.S. 1, 4, 106 S Ct 1669, 1670-71, 90 L Ed 2d 1, 6 (1986) the Court wrote:\n\n\"There is no disputing that this Court's decision in Eddings requires that in capital cases '\"the sentencer . . . not be precluded from considering, as a mitigating factor, any aspect of a defendant's character or record and any of the circumstances of the offense that the defendant proffers as a basis for a sentence less than death.\"' Eddings, supra, at 110, 71 L Ed 2d 1, 102 S Ct 869 (quoting Lockett, supra, at 604, 57 L Ed 2d 973, 98 S Ct 2954, 9 Ohio Ops 3d 26 (plurality opinion of Burger, C.J.)) (emphasis in original). Equally clear is the corollary rule that the sentencer may not refuse to consider or be precluded from considering 'any relevant mitigating evidence.' 455 U.S., at 114, 71 L Ed 2d 1, 102 S Ct 869. These rules are now well established, and the State does not question them.\"\n\nIn 1987, the Court unanimously reversed a death sentence when the state court had excluded mitigating factors that were not made relevant by Florida law:\n\n\"We think it could not be clearer that the advisory jury was instructed not to consider, and the sentencing judge refused to consider, evidence of nonstatutory mitigating circumstances, and that the proceedings therefore did not comport with the requirements of Skipper v. South Carolina, 476 U.S. 1, 90 L Ed 2d 1, 106 S Ct 1669 (1986), Eddings v. Oklahoma, 455 U.S. 104, 71 L Ed 2d 1, 102 S Ct 869 (1982), and Lockett v. Ohio, 438 U.S. 586, 57 L Ed 2d 973, 98 S Ct 2954, 9 Ohio Ops 3d 26 (1978) (plurality opinion).\"\n\nHitchcock v. Dugger, 481 U.S. 393, 107 S Ct 1821, 1824, 95 L Ed 2d 347, 353 (1987). Later in 1987, the Court again followed these cases to reverse a Nevada death sentence, because the statute allowed no consideration of possible mitigation in sentencing a life-term prison inmate for murder. Again the Court wrote:\n\n\"Although a sentencing authority may decide that a sanction less than death is not appropriate in a particular case, the fundamental respect for humanity underlying the Eighth Amendment requires that the defendant be able to present any relevant mitigating evidence that could justify a lesser sentence.\"\n\nSumner v. Shuman, 483 U.S. , 107 S Ct 2716, 2727, 97 L Ed 2d 56, 71 (1987). And the Court quoted Hitchcock v. Dugger to show the decisive point that the sentencer must not merely admit evidence but consider \"nonstatutory mitigating circumstances.\" Id. at , 107 S Ct at 2722, 97 L Ed 2d at 66. Though these cases involved the laws of different states and distinguishable facts, they leave no doubt of the Court's insistence on broad consideration of individualized mitigating factors.\n\nLockett, Eddings, and their sequels cast serious doubt on the Texas practice, but their significance for ORS 163.150(1)(b)(B) is still more obvious. In Texas \"mitigating circumstances\" are not part of the statute but were judicially attached (however illogically) to the jury's assignment of estimating defendant's future criminal violence. Texas courts might try to undo this connection in an effort to satisfy the misconception of the lead opinion in Jurek v. Texas, although Professors Dix and Benson each concluded that in fact the\n\nTexas courts have not done so. It is difficult if not impossible to insert the broad consideration of \"mitigating aspects of the defendant's character\" and other mitigating circumstances as demanded by \"the rule in Lockett \" even into the Texas statute. But in Oregon, the sponsors of ORS 163.150(1)(b) foreclosed any such judicial manipulation by expressly tying \"mitigating circumstances\" to the second issue that the jury is told to answer \"yes\" or \"no,\" the specific issue of danger to society from a defendant's probable criminal acts of violence. While agreeing with most of Justice Gillette's dissent, 305 Or at 219, I see no room in the statute for a court to instruct the jury to answer different or additional questions. The statute designedly denies both the jury and the court any responsibility for actually choosing the death sentence once the three statutory questions are answered. If \"mitigating circumstances\" in a defendant's background, such as those in Eddings, relate to something other than the prediction of future violence, the statute makes a death sentence mandatory.\n\nThe state's brief distinguishes the particulars of the Ohio statute in Lockett, but of course that does not relate to the Supreme Court's subsequent affirmation and reaffirmation of \"the rule in Lockett \" as a general rule requiring consideration of mitigating aspects in every case. The Department of Justice ultimately does not defend the validity of ORS 163.150(1)(b) as the sponsors wrote it. Its brief only says that this court should find a way to \"construe\" the measure to pass constitutional muster. It offers no suggestions how that should be done, whether by inventing additional issues to be put to the jury different from those specified in the statute, or by what other means. This is not a matter of interpreting the meaning of existing words. It would require radical surgery, \"to insert what has been omitted, and to omit what has been inserted,\" contrary to ORS 174.010. And it would not allow affirmance of the death sentence in this case, in which the trial court quite rightly instructed the jury to consider any mitigating circumstances only in deciding the second statutory question. See note 2, supra.\n\nThe majority believes that it can save the statute by construing it to provide for the introduction and jury consideration of what the majority calls \"mitigating\" evidence on\n\nthe first and third questions as well as the second. The majority opinion sometimes speaks of admitting such evidence and sometimes of telling the jury to consider it, but the terminology is not the important point. Of course defense evidence bearing on all three statutory questions must be admitted, and of course defense counsel and the court will remind jurors to consider it (though again, the procedure in this case failed to assure that either would occur). ORS 163.150(1)(a) expressly requires that much.\n\nThat, however, is not what the Supreme Court's phrase \"mitigating circumstances\" means. If \"mitigating circumstances\" only meant evidence detracting from one of the three statutory criteria, the requirements would be identical if the Supreme Court had never written a word about the death penalty. Rather, the Supreme Court refers to \"mitigating circumstances\" as any circumstances in the individual defendant's case that might legitimately move the sentencing judge or jury to conclude that the defendant should not be put to death despite meeting the other qualifications for a death sentence. The judge or jury must be free to consider whether circumstances other than those relevant to the statutory tests in some degree diminish a defendant's culpability, see, e.g., Tison v. Arizona, 481 U.S. , 107 S Ct 1676, 95 L Ed 2d 127 (1987),\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e or whether even a highly culpable defendant's past background and individual characteristics should count against society's taking his life, as in Eddings v. Oklahoma, supra.\n\nTo all quotations from the Supreme Court's opinions on the mitigation issue, the majority answers only that the Court has not overruled Jurek v. Texas, supra, that the Court\n\nin fact continued to refer to Jurek as recently as this winter in Lowenfield v. Phelps, U.S. , 108 S Ct 546, 98 L Ed 2d 568 (1988). Undeniably the Supreme Court sometimes sounds like a band marching to the beat of more than one drummer; but when this court looks only for citations of Jurek, it is asking the wrong questions, as Justice Gillette's dissenting opinion shows. The passage from Lowenfield emphasized by the majority, for instance, cited Jurek primarily on the question whether a Louisiana death penalty statute adequately narrowed the class of persons eligible for the death penalty by specifying aggravating circumstances, only mentioning in a purely descriptive sentence what the Jurek plurality had \"concluded\" about the discretion allowed under the Texas practice. Id. at , 108 S Ct at 554-55. That was not the issue before the Court. The Court has seen the problem of \"guided discretion\" as one of allocating responsibility to decide between life and death both to legislators and to sentencers. The Louisiana statute in Lowenfield was reviewed to see whether it left the jury too much at large to impose the death penalty, not whether it left discretion not to impose it.\n\nIt is idle to insist that Jurek must be overruled before Oregon's statute can be found to fall short of the Supreme Court's standards. The Court has no occasion to \"overrule\" Jurek until another Texas case appears in a posture unsuitable for a denial of certiorari. The Court's opinions over the years since Jurek have arrived at a rule that the legislature must substantially narrow the class of cases eligible for the death sentence to the worst crimes, and that in this remaining class the sentencing judge or jury also must retain some final degree of discretion, not confined to statutory findings of fact, whether actually to exact that penalty from the individual defendant under the circumstances of the individual case. The measure presented to the voters and adopted in 1984 did not and does not meet this second test.\n\nIt might well be a service to invalidate this statute now. That would give the state an appeal to the Supreme Court or let the sponsors of another death penalty measure start over. This case does not unavoidably require that. In any event, given the well-nigh insuperable problems with ORS 163.150(1)(b) here reviewed, patently this unrepresented defendant could not and did not present the analysis and\n\nevidence needed for the required certainty that a death sentence may validly be imposed and carried out.\n\nVI. PARTICIPATION BY APPOINTED COUNSEL\n\nThe requisite presentation of the analysis and evidence needed for a valid death sentence is not barred by a defendant's rejection of representation by appointed counsel. A defendant cannot be excluded from his own defense. Article I, section 11, of the Oregon Constitution guarantees that \"the accused shall have the right * * * to be heard by himself and counsel * * *.\" The United States Supreme Court has held that the Sixth Amendment recognizes an accused's right to defend himself that the states must respect. Faretta v. California, 422 U.S. 806, 95 S Ct 2525, 45 L Ed 2d 562 (1975). This right of the accused, however, does not prevent the state from taking steps to assure that its laws are correctly applied. Specifically in capital cases, the accused's right to defend himself does not displace a state's determination to impose and carry out a death sentence only if its legal and factual bases have been tested and established beyond a reasonable doubt. That determination and the accused's procedural rights can and must be accommodated.\n\nJudicial opinions have divided on the issue of how this should be done. Faretta itself was not a capital case. It was a prosecution for theft, and the Supreme Court, by a 5-4 majority, held that the California Court of Appeal erred in denying defendant's request to proceed pro se. Moreover, the Faretta court noted that \"a State may -- even over objection by the accused -- appoint a 'standby counsel' to aid the accused if and when the accused requests help, and to be available to represent the accused in the event that termination of the defendant's self-representation is necessary.\" Id. at 835 n 46. Subsequently, the Supreme Court affirmed a defendant's conviction for robbery and life imprisonment as a recidivist over his objection that \"standby counsel\" appointed for him had interfered in his conduct of his own defense. McKaskle v. Wiggins, 465 U.S. 168, 104 S Ct 944, 79 L Ed 2d 122 (1984). Justice O'Connor's majority opinion held that Faretta did not bar unsolicited participation by \"standby counsel,\" but \"standby counsel\" may not interfere over defendant's objection with defendant's own defense, create confusion by \"multiple voices 'for the defense,'\" id. at 177, or \"destroy the jury's perception that the defendant is representing himself.\" Id. at\n\n178. In proceedings outside a jury's presence, a trial court \"must be considered capable of differentiating the claims presented by a pro se defendant from those presented by standby counsel,\" id. at 179, and the court may call on \"standby counsel\" even over objection to guide a defendant through courtroom procedures also in a jury trial. Id. at 184. Justices White, Brennan and Marshall dissented on grounds that the Court's test allowed Wiggins's \"standby counsel\" too much interference in his defense.\n\nAs already noted, these were not capital cases. They did not involve any right to bar or restrict participation of court-appointed counsel in a capital sentencing proceeding, particularly when the correctness of legal and factual bases of a death sentence must be able to withstand \"automatic\" appellate review. In such a case, a recent New Jersey decision reversed a trial court ruling that allowed a defendant to instruct counsel not to present evidence in mitigation of his crime and of the death penalty. Because without such a presentation the jury could not discharge its statutory duty, nor could the New Jersey Supreme Court exercise its mandatory review, the appellate court ordered the trial court to let counsel present mitigating evidence. State v. Hightower, 214 NJ Super 43, 518 A2d 482 (1986). See also People v. Chadd, 28 Cal 3d 739, 621 P2d 837, 170 Cal Rptr 798, cert den 452 U.S. 931 (1981) (sustaining statute denying guilty plea without counsel's consent); Massie v. Sumner, 624 F2d 72 (9th Cir 1980), cert den 449 U.S. 1103 (1981) (sustaining automatic statutory appeal against defendant's objections).\n\nThe same principle applies here. It would be absurd to hold that a state denies a defendant \"life, liberty, or property, without due process of law\" under the Fourteenth Amendment whenever the state insists on assuring itself that it takes his life (or his liberty or property, for that matter) only in strict compliance with law.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e If there is any tension between\n\nthat insistence and a defendant's right to present his own defense, the tension lies in the possibility of confusing a jury by divergent voices \"for the defense,\" McKaskle v. Wiggins, supra. It lies partly in the concept of \"standby counsel,\" which is why the present opinion keeps that phrase in quotation marks. For \"standby counsel\" ordinarily means counsel who have been appointed to offer legal advice to a defendant who rejects legal representation and chooses to conduct his own defense. It ordinarily implies \"standby counsel for the defendant.\" That was the intended role of counsel in this case. If a defendant then rejects the advice and insists on silencing counsel, the conflict of roles discussed in McKaskle v. Wiggins is hard to resolve.\n\nIn such a situation, in a capital case that must withstand the test of automatic review, a court can and should instruct appointed counsel to present the legal arguments, make the motions and objections, and call and examine the witnesses necessary to make the required record, and it should clearly inform the jury that counsel is acting independently of the defendant and is not permitted to prevent the accused from presenting his own defense, even when counsel thinks the attempt misguided or not responsive to the requirements of the law. Of course, since the state already is represented by the prosecutor, the task of appointed counsel in this public capacity would be to assure effective adversary procedure to test the prosecutor's case against both legal and factual requirements. Such a procedure could have gone far toward avoiding many of the flagrant flaws in this death sentence proceeding.\n\nCompetent counsel, for instance, might at least have tried to determine what kind of \"criminal acts of violence that would constitute a continuing threat to society\" are within or outside the scope of ORS 163.150(1)(b)(B), and just how the \"mitigating factors\" required under the Supreme Court's\n\nEddings and Lockett decisions relate to the questions submitted to the jury under ORS 163.150(1)(b). They might have called, examined, and cross-examined expert witnesses on the second statutory question, a question that the majority opinion holds is open to proof in each individual case. They certainly would have challenged the prosecutor's wholly improper and prejudicial peroration, in his closing speech to the jury, in which he called upon the jury to \"determine whose life is more valuable; Jeri Koenig's and the rest of us, those of us in society whatever that society may be, or this Defendant's.\"\n\nThe three issues defined in the death penalty law emphatically do not include whether the victim's life is more valuable than the defendant's. The death penalty law would not permit the jury to engage in such a comparative valuing of lives if a highly respected and \"valuable\" member of society were to murder a penniless criminal, an addicted burglar or a blackmailing prostitute. It equally does not permit it in the more common situation presented in this case. To quote Chief Justice Thayer's criticism in State v. Olds of the district attorney's \"conscience of the community\" speech against that defendant:\n\n\"That he is a gambler and a worthless member of community, may be true; but he is on trial for his life, is within the pale of the law, and the courts can do no less than to require that the law be administered in his case as in all others -- in accordance with its letter and spirit.\"\n\n19 Or at 440, 24 P at 406.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Today's majority opinion agrees,\n\n305 Or at 180 n 25, but does nothing about it. The prosecutor's argument is another error apparent on the face of the present record that the trial court might have found ways to correct if there had been someone other than this self-important but incapable, unrepresented defendant to bring it to the court's attention.\n\nVII. SELECTIVE SUSPENSION OF CONSTITUTIONAL STANDARDS\n\nFrom the beginning of statehood in 1859, two principles of humane penal laws have been enshrined in Oregon's constitution, presumably to place them beyond the reach of legislators and transitory majorities. One principle, guaranteed in Article I, section 15, is that \"[l]aws for the punishment of crime shall be founded on the principles of reformation, and not of vindictive justice.\" The other, in Article I, section 16, provides that \"[c]ruel and unusual punishments shall not be inflicted, but all penalties shall be proportioned to the offense.\" In 1984, Ballot Measure 6 enacted Article I, section 40, of the Oregon Constitution, which provides that the penalty for aggravated murder, as defined by law, shall be death \"[n]otwithstanding sections 15 and 16 of this Article.\"\n\nIf section 40 is valid, its effect is to create two opposing principles of punishment in Oregon's criminal law. The principle of punishment for practically all crimes must be \"reformation,\" not \"vindictive justice.\" Vindictiveness\n\n-- revenge, hatred, revulsion -- may not motivate the punishment for rape, for arson, for robbery, for the most brutal cruelty to women or children. Vindictiveness may not motivate the punishment for killing another person, not even for most murders. But when a murder fits one of the complex definitions of aggravated murder, described in part II of this opinion, the civilizing restraints of sections 15 and 16 are excluded. After 130 years, emotions of vindictiveness and revenge now are declared to be a respectable basis for public administration of Oregon law in some cases but not in others. So are cruel and unusual punishments, but for the safety net provided by the federal Eighth and Fourteenth Amendments. Vindictive and cruel, unusual, or disproportionate punishments are forbidden (absent other aggravating circumstances) when a woman murders her husband or her child, her father or her mother, but such penalties are allowed when she murders both, or when the victim is one of a list of officials, or if the defendant was in custody at the time. The state now may exact cruel or disproportionate vengeance when the victim is any judge or court employee, or an officer of the police and corrections system or a fellow inmate, but not if the defendant instead kills an officer's wife or child, a legislator, an agency official, or a prison employee not charged with the supervision or control of inmates. See ORS 163.095, supra.\n\nThe majority says that this radical difference in the Constitution's penal principles created by the partial suspension of Article I, sections 15 and 16, needs only to be \"rational\" in order to satisfy the Fourteenth Amendment's mandate of equal protection of the laws, because the majority does not perceive a \"fundamental\" interest at stake in the difference, though a defendant's life or death may depend on it. Because, in my opinion, other reasons invalidate the death sentence in the case before us, I do not pursue the equal protection issue at length; but the majority's treatment of the Supreme Court's equal protection jurisprudence is quite inadequate. The majority would have us believe that the Supreme Court would treat a distinction between some offenders that may be subjected t vindictive, cruel, unusual or disproportionate punishments and the majority of offenders who may not be so punished as it would treat a distinction between plastic and paper milk containers. See Minnesota v. Clover Leaf Creamery Co., 449 U.S. 456, 101 S Ct 715, 66 L Ed 2d 659 (1981).\n\nTo use a seemingly farfetched example, a state might make sterilization an available punishment for aggressive robbers and not for cautious nonaggressive burglars, or for burglars of residences and not for robbers of banks, and defend each scheme on some \"rational\" hypothesis that either group poses a greater threat of forced pregnancy to women than the other. Yet this example resembles the statute struck down in Skinner v. Oklahoma, 316 U.S. 535, 62 S Ct 1110, 86 L Ed 1655 (1942), which found a denial of equal protection in a law that provided for the sterilization of persons repeatedly convicted of most felonies involving moral turpitude, such as larceny, but excluded others, such as embezzlement. Skinner appears in the majority's opinion only in a footnote to an unrelated citation. The majority is satisfied not to look far either for support or for refutation of the equal protection claim.\n\nBeyond the challenge to the distinctions made by Oregon's scheme on its face, other issues can be expected to arise whether the scheme is applied equally, or \"upon the same terms,\" Oregon Constitution, Article I, section 20.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e See State v. Freeland, 295 Or 367, 667 P2d 509 (1983) (discretionary decisions in criminal prosecutions must apply defensible criteria). Issues of equal treatment of similar offenders, of course, are hard to brief persuasively in the first death penalty case under the 1984 law. By the time unequal selection of capital cases can be demonstrated, it presumably will be too late for this and several other defendants, whose lives will have been taken in the course of the current experiment with the death penalty.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Other issues also remain unexamined.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nVIII. CONCLUSION\n\nTo summarize:\n\n1. The Supreme Court has said that a death penalty may not be mandatory but must allow the sentencing authority to consider mitigating circumstances. But the 1984 death penalty measure allows neither the jury nor the judge to decide against a death sentence even when there are mitigating facts that would incline them to do so.\n\nThis is because neither the jury nor the judge actually decides for or against a death sentence as such. If the jury\n\nconscientiously decides specified facts -- decides that the defendant acted deliberately and unreasonably in response to any provocation, and that he presents a danger of future crimes of violence -- then the statute makes the death penalty mandatory. The jury, of course, must consider any relevant evidence offered by the defendant to negate one or more of these facts, but that is not \"mitigation.\" Even if the trial court admits evidence that a defendant's acceptance of killing was formed in combat as a soldier or while growing up in the violent streets of public housing projects, that he was brutalized by mistreatment as a child, or in a \"reformatory,\" or as a prisoner of war, the statute does not let a conscientious jury decide that the defendant does not deserve to die.\n\nIf the Supreme Court's opinions mean what they say about leaving room for individualized judgment of mitigating circumstances after the other elements qualifying a case for a potential death sentence are found to exist, as reviewed in Justice Gillette's dissent, then the 1984 measure does not meet federal standards. This court does not have the final word on that federal question. But when the court finds itself as much in doubt as it does in this case, surely we should risk erring on the side of life rather than of death and leave it to the state to appeal to the Supreme Court if it so chooses.\n\n2. The 1984 measure on its face also may violate the Fourteenth Amendment in its selective suspension of the guarantees of the Oregon Constitution against vindictive, cruel, unusual, or disproportionate punishments. In effect, the measure asserts that Oregon wants to maintain for most classes of crimes the humane penal philosophy that has been part of its constitution since 1859 but with respect to other offenders wants to give rein to motives of vindictiveness even to the point where punishment is cruel, unusual, or disproportionate. Harsh as this sounds, legally that is what the measure means.\n\n3. I phrase these federal constitutional points with the conditional words \"if\" and \"may\" because this court would not have to decide them now, although the majority's action puts such a decision squarely up to the United States Supreme Court. Important issues of Oregon law should not be overlooked in the debate over the federal \"mitigation\" issue.\n\nThis particular death sentence should be set aside in any event.\n\nThe procedure by which this case was tried in the circuit court and which the majority now finds acceptable and adequate for review in this court, doubtless was conscientious on the part of the circuit judge and lawyers assigned to advise the defendant. Nevertheless, the procedure was inadequate and a bad precedent for future capital cases.\n\nThe death penalty statute imposes on this court the duty to subject each conviction involving a death sentence to \"automatic and direct review.\" This means review of each element needed for a death sentence, even if it does not require the court to decide anew facts found at trial upon adequate evidence. This court will face many such cases each year, if juries are bound to impose death sentences without mitigation whenever unprovoked deliberateness and dangerous propensities are shown, as the majority thinks is constitutionally permissible.\n\nReview of even one death sentence case is a heavy burden; review of many will be unbearable unless the cases are tried with as much professional skill and care as the legal system can muster. The backlog of appeals in states where the death penalty has existed longer can approach levels where conscientious supreme court judges have little time for the many other important issues demanding their attention. The pressure will mount to deal with death sentence review as with ordinary appeals, to examine a death sentence case only for trial court \"error\" properly objected to, preserved and raised on appeal, and to dismiss more errors as \"harmless,\" as already shown by the majority's treatment of the trial court's failure to correct the prosecutor's final jury argument in this case. See supra, 305 Or at 211. This does not provide the degree of certainty that a death sentence was properly imposed that the provision for Supreme Court review is supposed to assure.\n\nThe demand for certainty has other roots than sympathy for a convicted murderer, as sometimes seems to be thought. The higher statutory and constitutional standards for capital cases also reflect the fact that executions at the hand of a state's public officials implicate the state's citizens in an act that many find morally repugnant. It therefore is not\n\na defendant's privilege to volunteer for conviction of a capital offense and to prevent an adequate test of the prosecution's case for the death sentence, as defendant did in this case. Article I, section 11, of the Oregon Constitution may not prevent a confession to the facts in open court, but I would hold that it prevents a guilty plea when the prosecution seeks the death penalty, as explained in Part III of this opinion. A defendant's right to present his own defense does not deny the state the means to assure that the prosecution's case is tested in a professionally qualified adversary manner. That did not occur here.\n\n4. Other issues remain on which federal caselaw will offer little help. Oregon's Constitution requires that the law be administered \"on equal terms\" in similar cases. This will be a difficult test for Oregon's legal system, given the unpredictable incidence among the counties of the extraordinary costs of a full death penalty trial and the pressures on prosecutors and public defense counsel to negotiate pleas.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Thorough and meticulous recording and comparison of potential as well as actual capital prosecutions cases will be needed to determine whether the constitutional standard is met. This lies beyond the capacity of the state's public defense lawyers. In fact, the state Public Defender already has asked to withdraw as counsel in death penalty cases pending in this court because of inadequate resources to prepare and brief these intensive and extensive proceedings on top of the already vast volume of criminal appeals. Perhaps the price of the death penalty to taxpayers is not widely understood, but high price will not allow unequal administration.\n\nThe death penalty is not just another criminal penalty, as both the opinions of the United States Supreme Court and our own Constitution make clear, and standards adequate for the trial and review of ordinary penalties are not adequate for the death penalty. The exacting standards demanded before the state may take a person's life are hard to maintain and may give way under the pressure of even modest\n\nnumbers of cases. Perhaps those who adopted Oregon's death penalty measure expected its application to be a rare event. But it is reported that nationally about 2000 persons are awaiting execution, including scores in many states comparable to Oregon, and there is no reason to expect this state's share to be less than proportionate.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e At bottom, the question is whether society can keep reassuring itself that it means to use the death penalty only rarely, in exceptional cases and safeguarded by extraordinarily thorough procedures, at a time when the criminal behavior that qualifies as capital offenses tragically has become too common to be called exceptional.\n\nBecause in addition to the doubtful validity of the 1984 death penalty measure itself, the procedure that led to the present sentence of death, and therefore the record and procedure on review, fell short of the standards that this state has set for capital cases, I dissent from the affirmance of this death sentence.\n\nGILLETTE, J., dissenting.\n\nA majority of the court today concludes that defendant received due process of law under the Eighth and Fourteenth Amendments to the Constitution of the United States at his sentencing hearing. In so concluding, the court by interpretation limits the scope of \"mitigating factors\" that may be considered in connection with the three questions put in the sentencing statute to those mitigating factors which have some bearing on the questions. The court further concludes that the jury was correctly instructed with respect to the scope of its authority concerning evidence of mitigating circumstances and, finally, that in any event, no mitigating evidence offered with respect to the defendant or the crime he committed called for any further or different instructions to the jury than those actually given. For the reasons which follow, I respectfully disagree with the court as to all three of the foregoing conclusions and therefore dissent.\n\nI\n\nThe present Oregon death penalty statute, ORS 163.150, is derived from the Texas statute approved in Jurek v. Texas, 428 U.S. 262, 96 S Ct 2950, 49 L Ed 2d 929 (1976).\n\nThat case was one of five decided the same day. (The other four were Gregg v. Georgia, 428 U.S. 153, 96 S Ct 2909, 49 L Ed 2d 859 (1976), Proffitt v. Florida, 428 U.S. 242, 96 S Ct 2960, 49 L Ed 2d 913 (1976), Woodson v. North Carolina, 428 U.S. 280, 96 S Ct 2978, 49 L Ed 2d 944 (1976) and Roberts v. Louisiana, 428 U.S. 325, 96 S Ct 3001, 49 L Ed 2d 974 (1976).) All were cases involving the constitutionality of various death penalty statutes that had been enacted or amended in the wake of the Supreme Court's earlier opinion in Furman v. Georgia, 408 U.S. 238, 92 S Ct 2726, 33 L Ed 2d 346 (1972). Three of the statutes -- those involved in the Georgia, Florida and Texas cases -- were upheld. Two -- those involved in the North Carolina and Louisiana cases -- were struck down. The lead case among those that upheld statutes was Gregg v. Georgia, supra. Jurek v. Texas, supra, the case that dealt with the Texas statute from which the present Oregon statute was adopted, was a relatively short follow-up opinion based on Gregg.\n\nThe Texas statute that was upheld in Jurek v. Texas provided that a person convicted of capital murder could be sentenced to death if a jury impaneled for that purpose affirmatively answered the following three questions:\n\n\"(1) whether the conduct of the defendant that caused the death of the deceased was committed deliberately and with the reasonable expectation that the death of the deceased or another would result;\n\n\"(2) whether there is a probability that the defendant would commit criminal acts of violence that would constitute a continuing threat to society; and\n\n\"(3) if raised by the evidence, whether the conduct of the defendant in killing the deceased was unreasonable in response to the provocation if any, by the deceased.\"\n\nTex. Code Crim. Proc. Ann. art. 37.071(b)(Supp. 1975-1976).\n\nThe Supreme Court found the Texas statute constitutional. It did so, however, only on the understanding that Texas law did not automatically require the imposition of the death penalty on any person convicted of capital murder who fit the three criteria, but rather also permitted the introduction of mitigating evidence during the sentencing phase:\n\n\"Texas law requires that if a defendant has been convicted of a capital offense, the trial court must conduct a separate sentencing proceeding before the same jury that tried the\n\nissue of guilt. Any relevant evidence may be introduced at this proceeding, and both prosecution and defense may present argument for or against the sentence of death.\"\n\nJurek v. Texas, supra, 428 U.S. at 267. As the court further explained, id. at 271:\n\n\"But a sentencing system that allowed the jury to consider only aggravating circumstances would almost certainly fall short of providing the individualized sentencing determination that we today have held in Woodson v. North Carolina, post, at 303-305, to be required by the Eighth and Fourteenth Amendments. For such a system would approach the mandatory laws that we today hold unconstitutional in Woodson and Roberts v. Louisiana, post, p 325 [footnote omitted]. A jury must be allowed to consider on the basis of all relevant evidence not only why a death sentence should be imposed, but also why it should not be imposed.\"\n\nAs already noted, the Texas statute asked three questions of the jury, as does the Oregon statute (with one modification in the Oregon statute which I address later). Concerning the Texas scheme, the Supreme Court concentrated only on the second of the three questions, i.e., the question of the probability that the defendant would commit criminal acts of violence in the future. This focus on the second question cannot be read as indicating that the Texas statute would have been regarded as constitutional if it had affirmatively provided that the question of mitigating factors could only be considered by the jury in connection with the second question, but not in connection with the other two. As the Court said itself, just before discussing the second statutory question, \"[t]hus, the constitutionality of the Texas procedures turns on whether the enumerated questions allow consideration of particularized mitigating factors.\" Id. at 272. (Emphasis supplied.) And, in a footnote at that same page, the Court specifically noted, with respect to this issue:\n\n\"The Texas Court of Criminal Appeals has not yet construed the first and third questions * * *; thus it is as yet undetermined whether or not the jury's consideration of those questions would properly include consideration of mitigating circumstances. In at least some situations the questions could, however, comprehend such an inquiry. For example, the third question asks whether the conduct of the defendant was unreasonable in response to any provocation by the deceased.\n\nThis might be construed to allow the jury to consider circumstances which, though not sufficient as a defense to the crime itself, might nevertheless have enough mitigating force to avoid the death penalty -- a claim, for example, that a woman who hired an assassin to kill her husband was driven to it by his continued cruelty to her. We cannot, however, construe the statute; that power is reserved to the Texas courts.\"\n\nId. at 272 n 7.\n\nFrom the foregoing I conclude that, even had there been no cases following it to further develop the idea,\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Jurek v. Texas stands for the proposition that a statute which narrows the kind of homicides that can be declared capital homicides and which then further narrows the pool of defendants faced with the death penalty by identifying three aggravating factors that the jury must find to be present is constitutional, provided that it is also permissible for the defendant to offer and the jury to consider evidence of any kind that tends to mitigate against an affirmative answer to the three statutory questions. This seems to me to make eminent good sense. There surely are circumstances that would militate against an affirmative finding with respect to the first and third criteria, as well as the second, although the second was the only one discussed in the Jurek opinion. (In addition to the example given by the Supreme Court with respect to the third criterion, it seems obvious that evidence concerning an offender's background and circumstances could show that his mental condition, while not sufficient to constitute a defense under Oregon criminal law, was nonetheless such that a jury might not wish to find that he was guilty of the \"deliberation\" which the jury was required to find in order to give an affirmative answer to the first question.) The majority also seems to concede that Jurek stands at least for this limited proposition. However, the majority refuses to recognize that Jurek and the other cases decided the same day were only the beginning of the Supreme Court odyssey in the area of the death penalty and the scope of jury authority with respect to it.\n\nThe specific Jurek requirement that mitigating factors be considered with respect to the second question in the\n\nTexas statute was written into the second question when Oregon adopted the Texas approach. For some reason, the drafters of the Oregon referendum seem to have concluded that the mitigating factors inquiry was pertinent only with respect to the second of the three questions to be put to the jury. As I think I have already demonstrated, Jurek does not say that. Neither, I think, do cases decided after Jurek imply that this is all that Jurek stands for. About the only argument to the contrary would come from Lockett v. Ohio, 438 U.S. 586, 98 S Ct 2954, 57 L Ed 2d 973 (1978). At one point in that case, the Supreme Court plurality, referring to the Gregg group of cases, had this to say about Jurek:\n\n\"* * * Jurek involved a Texas statute which made no explicit reference to mitigating factors. 428 U.S., at 272. Rather, the jury was required to answer three questions in the sentencing process, the second of which was 'whether there is a probability that the defendant would commit criminal acts of violence that would constitute a continuing threat to society.' * * * The statute survived the petitioner's Eighth and Fourteenth Amendment attack because three Justices concluded that the Texas Court of Criminal Appeals had broadly interpreted the second question -- despite its facial narrowness -- so as to permit the sentencer to consider 'whatever mitigating circumstances' the defendant might be able to show. [Citations omitted.] None of the statutes we sustained in Gregg and the companion cases clearly operated at that time to prevent the sentencer from considering any aspect of the defendant's character and record or any circumstances of his offense as an independently mitigating factor.\"\n\nId. at 606-7. The foregoing is merely a description of the specific issue Jurek addressed. It in no sense intimates that, had the issue been squarely presented, the Court would not have held also that mitigating circumstances had to be considered for any other purpose that might lead the jury to conclude that imposition of the death penalty was inappropriate. Other statements made by the plurality in Lockett (and consistently relied upon in later opinions) lead me to this same conclusion, viz., that mitigating circumstances must be considered by the jury without limitation in order for the statutes to be constitutional:\n\n\"* * * [W]e conclude that the Eighth and Fourteenth Amendments require that the sentencer, in all but the rarest kind of capital case, [footnote omitted] not be precluded from\n\nconsidering, as a mitigating factor, any aspect of a defendant's character or record and any of the circumstances of the offense that the defendant proffers as a basis for a sentence less than death. [Footnote omitted.] * * * [A] statute that prevents the sentencer in all capital cases from giving independent mitigating weight to aspects of the defendant's character and record and to circumstances of the offense proffered in mitigation creates the risk that the death penalty will be imposed in spite of factors which may call for a less severe penalty. * * *\"\n\nId. at 604-5 (emphasis in original).\n\nThese statements by the plurality in Lockett suggested an even broader role for \"mitigating circumstances\" than the role implied in Jurek: \"mitigating circumstances\" included any facts that might lead a jury to conclude that an otherwise death-eligible defendant ought to receive a sentence less than death, and the jury had to be empowered so to conclude. That is, whatever the statutory scheme and whatever the evidence that affirmatively established that a defendant was death-eligible, the jury had to be free to spare the defendant if other evidence satisfied the jury that sparing him would be just.\n\nLater cases absolutely made clear what the plurality opinion Lockett had implied. In each of these later cases, a majority of the full Court joined in adopting the Lockett plurality approach.\n\nThe first of these cases was Eddings v. Oklahoma, 455 U.S. 104, 102 S Ct 869, 71 L Ed 2d 1 (1982). The defendant in Eddings was a 16-year-old youth who, with several companions, ran away from their Missouri homes. Their car subsequently was stopped by an officer of the Oklahoma Highway Patrol. Eddings shot and killed the officer with a shotgun. He was remanded to adult court for trial on a charge of murder in the first degree.\n\nThe Oklahoma statute, Okla. Stat. Ann. tit. 21, § 701.12 (West 1980), included a list of seven aggravating factors to be considered in determining whether or not to impose the death penalty. From among those factors, it was alleged that the murder Eddings committed fit three: it was especially heinous, atrocious or cruel, it was committed for the purpose of avoiding or preventing a lawful arrest and there was a\n\nprobability that the defendant would commit criminal acts of violence that would constitute a continuing threat to society. Okla. Stat. Ann. tit. 21, § 701.12(4), (5) and (7).\n\nIn mitigation, Eddings presented substantial evidence at the hearing that he had led a troubled life. His parents had been divorced when he was quite young. He had lived with his mother until he was 14, during which time he received little or no supervision. The mother was an alcoholic and, possibly, a prostitute. Sent to live with his father at the age of 14, Eddings continued to be out of control. The only form of discipline the father was able to impose was physical punishment. Other evidence indicated that Eddings was emotionally disturbed in general, that his mental and emotional development were several years below his age, that he had a sociopathic antisocial personality and that approximately thirty percent of youths suffering from such a disorder grew out of it as they aged. Other evidence also suggested the possibility of reformation.\n\nAt the conclusion of the evidence, the trial judge (who was the responsible sentencer) weighed the evidence of aggravating and mitigating circumstances. He found that the state had proved the aggravating circumstances. As to the mitigating circumstance, however, the court made it clear that it considered the defendant's youth to be the only pertinent mitigating circumstance and that such a circumstance could not outweigh the aggravating circumstances present. The judge sentenced Eddings to death. The case eventually reached the Supreme Court.\n\nIn its majority opinion, the Supreme Court began by quoting from the plurality opinion in Lockett quoted earlier in this opinion 305 Or at 223-24. The court then summarized the applicable rule as follows:\n\n\"* * * [T]he rule in Lockett followed from the earlier decisions of the Court and from the Court's insistence that capital punishment be imposed fairly, and with reasonable consistency, or not at all. By requiring that the sentencer be permitted to focus 'on the characteristics of the person who committed the crime,' Gregg v. Georgia, supra, at 197, the rule in Lockett recognizes that 'justice * * * requires * * * that there be taken into account the circumstances of the offense together with the character and propensities of the offender.' [Citation omitted.] By holding that the sentencer in capital\n\ncases must be permitted to consider any relevant mitigating factor, the rule in Lockett recognizes that a consistency produced by ignoring individual differences is a false consistency.\"\n\nEddings v. Oklahoma, supra, 455 U.S. at 112.\n\nThe Court then proceeded to apply the rule in Lockett to the case before it. The Court first noted that both the Oklahoma trial judge and the Oklahoma Court of Criminal Appeals had found that no mitigation evidence save that concerning the youth of the defendant was pertinent because no other evidence tended to provide a legal excuse from criminal responsibility. The Court said,\n\n\"We find that the limitations placed by these courts upon the mitigating evidence they would consider violated the rule in Lockett. [Footnote omitted.] Just as the State may not by statute preclude the sentencer from considering any mitigating factor, neither may the sentencer refuse to consider, as a matter of law, any relevant mitigating evidence. In this instance, it was as if the trial judge had instructed a jury to disregard the mitigating evidence Eddings proffered on his behalf. The sentencer, and the Court of Criminal Appeals on review, may determine the weight to be given relevant mitigating evidence. But they may not give it no weight by excluding such evidence from their consideration. [Footnote omitted.]\n\n\"Nor do we doubt that the evidence Eddings offered was relevant mitigating evidence. Eddings was a youth of 16 years at the time of the murder. Evidence of a difficult family history of emotional disturbance is typically introduced by defendants in mitigation. See McGautha v. California, 402 U.S. 183, 187-188, 193, [91 S Ct 1454, 28 L Ed 2d 711] (1971). In some cases, such evidence properly may be given little weight. But when the defendant was 16 years old at the time of the offense there can be no doubt that evidence of a turbulent family history, of beatings by a harsh father, and of severe emotional disturbance is particularly relevant.\"\n\nId. at 113-15. (Emphasis in original.) The foregoing fully illustrated for the first time how widely the net of \"mitigating circumstances\" under the Eighth and Fourteenth Amendments sweeps, in the view of the Supreme Court.\n\nThe next significant case in this line of cases was Skipper v. South Carolina, 476 U.S. 1, 106 S Ct 1669, 90 L Ed 2d\n\n1 (1986). In that case, the defendant had been convicted of capital murder and rape, and sentenced to death. At his sentencing trial, defendant offered but the trial court excluded testimony of jailers and a regular visitor regarding petitioner's good behavior during the seven months he had spent in jail awaiting trial. On appeal, he argued that this evidence was evidence in mitigation of punishment that should have been considered in determining whether he should receive the death penalty.\n\nThe Supreme Court agreed. Speaking for six members of the Court, Justice White wrote,\n\n\"There is no disputing that this Court's decision in Eddings requires that in capital cases, '\"the sentencer * * * not be precluded from considering, as a mitigating factor, any aspect of a defendant's character or record and any of the circumstances of the offense that the defendant proffers as a basis for a sentence less than death.\"' Eddings, supra, 455 U.S., at 110, 102 S Ct, at 874 (quoting Lockett, supra, 438 U.S., at 604, 98 S Ct, at 2964 (plurality opinion of Burger, C.J.)) (emphasis in original). Equally clear is the corollary rule that the sentencer may not refuse to consider or be precluded from considering 'any relevant mitigating evidence' [citation omitted].\"\n\nSkipper v. South Carolina, supra, 476 U.S. at 4. Having restated the pertinent rules, which the court identified as \"well established,\" id., the Court then went on to hold that it was error of constitutional magnitude to exclude the evidence of mitigating circumstances relating to the defendant's behavior during the months he spent in jail awaiting trial. Id. at 4-8. The Court concluded:\n\n\"The exclusion by the state trial court of relevant mitigating evidence impeded the sentencing jury's ability to carry out its task of considering all relevant facets of the character and record of the individual offender. The resulting death sentence cannot stand * * *.\"\n\nId. at 8.\n\nOne year later, a unanimous court reversed yet another death penalty by relying on the Skipper/Eddings/Lockett line of analysis. In that case, Hitchcock v. Dugger, 481 U.S. 393, 107 S Ct 1821, 95 L Ed 2d 347 (1987), the defendant was accused of the strangulation death of a 13-year-old girl.\n\nThroughout a variety of appeals that eventually reached the United States Supreme Court, he argued that the advisory jury and sentencing judge (which was the procedure followed in Florida) improperly had been precluded by law from considering certain evidence of mitigating circumstances that had been introduced. The Court described the evidence offered by the defendant in mitigation:\n\n\"In the sentencing phase of this case, petitioner's counsel introduced before the advisory jury evidence that as a child petitioner had the habit of inhaling gasoline fumes from automobile gas tanks; that he had once passed out after doing so; that thereafter his mind tended to wander; that petitioner had been one of seven children in a poor family that earned its living by picking cotton; that his father had died of cancer; and that petitioner had been a fond and affectionate uncle to the children of one of his brothers. * * * In argument to the advisory jury, petitioner's counsel referred to various considerations, some of which were the subject of factual dispute, making a sentence of death inappropriate: petitioner's youth (he was 20 at the time of the murder), his innocence of significant prior criminal activity or violent behavior, the difficult circumstances of his upbringing, his potential for rehabilitation, and his voluntary surrender to authorities. * * * In contrast, the prosecutor told the jury that it was [to consider only certain statutory mitigating circumstances, and no others and the trial judge reinforced this impression by his instructions] * * *.\"\n\nId. at . A unanimous Court, speaking through Justice Scalia, reversed, stating:\n\n\"We think it could not be clearer that the advisory jury was instructed not to consider, and the sentencing judge refused to consider, evidence of nonstatutory mitigating circumstances, and that the proceedings therefore did not comport with the requirements of Skipper v. South Carolina, 476 U.S. 1, 106 S Ct 1669, 90 L Ed 2d 1 (1986), Eddings v. Oklahoma, 455 U.S. 104, 102 S Ct 869, 71 L Ed 2d 1 (1982), and Lockett v. Ohio, 438 U.S. 586, 98 S Ct 2954, 57 L Ed 2d 973 (1978) (plurality opinion). * * * In the absence of such a showing our cases hold that the exclusion of mitigating evidence of the sort at issue here renders the death sentence invalid. See Skipper, supra (evidence that defendant had adapted well to prison life); Eddings, supra (evidence of 16-year-old defendant's troubled family history and emotional disturbance). * * *.\"\n\nId. at .\n\nThe Supreme Court has thus with increasing clarity established that juries must be permitted to choose a sentence less than death based on any mitigating circumstances, not just those that apply directly to a particular state's statutory criteria for death qualification. This rule has emerged from cases dealing with a wide variety of statutes involving one virtually identical to Oregon's (the Texas statute in Jurek) and one designed in the same mold (the Oklahoma statute in Eddings.)\n\nThe way in which the majority deals with the cases that I have discussed is instructive as to the majority's narrow (and, I think, constitutionally incorrect) reading of those decisions and the requirements of due process.\n\nConcerning Eddings v. Oklahoma, the majority states as follows:\n\n\"* * * In Eddings, the Court had before it a statute that had been construed by the state court as excluding consideration of the defendant's 'turbulent family history,' 'beatings by harsh father,' and 'severe emotional problems' connected with having 'been raised in a neglectful, even violent family background.' Despite the fact that certain commentators cited in Justice Linde's dissent in this case question the continued vitality of Jurek because of Eddings, we find nothing to indicate that the Supreme Court of the United States is in agreement with those commentators.\n\n\"We do not construe our statute to exclude evidence of the kind of factors mentioned in Eddings.\"\n\n305 Or at 160-161.\n\nI respectfully suggest that the foregoing quotation focuses on the wrong questions and, in any event, gives the wrong answer. For me, at least, Eddings should not be viewed as a case questioning the validity of Jurek. I assume, as does the majority, that Jurek is still good law. But Jurek was a case that focused on the constitutional permissibility of a particular statutory method of creating a class of death-eligible defendants. Eddings, on the other hand, was a case that assumed the constitutionally permissible creation of such a class and instead focused on those matters that a jury had to be permitted to consider in determining whether a member of\n\nthat death-eligible class should actually be executed. As to that second question -- the only one with which my dissent is concerned -- the majority will say no more than\n\n\"We consider that it would be the better practice for the trial court to instruct the jury with particularity that it is to consider mitigating evidence with respect to arriving at its answer to all three questions * * *.\"\n\n305 Or at 167.\n\nTo the contrary, as I hope my review of the case law establishes, both the required scope of the jury's consideration of mitigating evidence and its authority pursuant to that consideration are broader than the majority acknowledges. Indeed, one may fairly ask how the majority believes that evidence of a \"turbulent family history,\" \"beatings by a harsh father,\" or having \"been raised in a neglectful, even violent family background\" have anything to do with any of the three questions to be submitted to the jury under Oregon law. I respectfully submit that they do not and, if they do not but are nonetheless admissible under Oregon law (as the majority acknowledges), the jury has to be told something with respect to what it is to do with the information. The only thing it could be told is that it has the constitutional authority to answer one of the three statutory questions \"no\" (in spite of the fact that other evidence would justify a \"yes\" answer) and thereby reprieve a death-eligible defendant from the death penalty he otherwise would receive -- an instruction which would, of course, depart from the statute.\n\nThe majority also dismisses Skipper v. South Carolina, supra:\n\n\"[ Skipper ] does no more than to rule that a defendant must be allowed to show as a mitigating factor any aspect of his character or record and any of the circumstances of the offense that the defendant proffers as a basis for a sentence less than death. In other words, the sentencer must be allowed to consider any relevant mitigating evidence. That is what our statute allows.\"\n\n305 Or at 161.\n\nAgain, other language already quoted from the majority opinion is inconsistent with this statement. Whatever else it does, the majority is obligated to answer this question: if a\n\njury must consider all mitigating evidence, including mitigating evidence that does not bear any apparent relationship to any of the three statutory questions the jury must answer, what is the jury to do with such evidence and what is the range of its authority? It is particularly difficult to understand what the majority means when it refers to evidence \"that the defendant proffers as a basis for a sentence less than death,\" unless it believes the jury has some role to play in addition to answering the three questions.\n\nThe majority also says nothing that explains why Hitchcock v. Dugger, supra, does not require the result for which I argue. The majority simply says, with respect to that case:\n\n\"In that case, arising under Florida law, the trial judge instructed the jury not to consider evidence of mitigating circumstances not specifically enumerated in the Florida statute. The respondent asserted that the Florida Supreme Court had, in a decision postdating the petitioner's conviction, held that the sentencer was not limited to the consideration of the statutory mitigating circumstances. The Court held that because the record disclosed that the trial judge in the case before the Court had assumed the statute limited the evidence that could be received and had so limited it, the petitioner was entitled to a new resentencing proceeding or a lesser sentence.\n\n\"We discover nothing in Hitchcock that is in conflict with the decision in Jurek or that would apply to the Oregon scheme.\"\n\n305 Or at 161.\n\nAgain, inasmuch as the continuing vitality of Jurek is not the crucial point, the majority's comment with respect to that case is of no help. With respect to the balance of the majority's description of Hitchcock, one comes away with the impression that the majority believes that all the Supreme Court did was to rule that the trial judge in that case had somehow made a mistake under Florida law. As my earlier discussion of the case indicates, however, the decision was a constitutional decision holding that the failure of the trial court to permit the jury to consider certain mitigating circumstances not identified as relating to any aggravating circumstance under Florida law was error of constitutional dimension requiring the vacation of a death sentence. Surely,\n\nthat constitutional ruling \"would apply to the Oregon scheme,\" or to the scheme of any other state.\n\nThe majority's insistent focus upon whether or not Jurek has been overruled misses this point, with the result that its construction of the Oregon statutory scheme is at odds with present constitutional rules. In summary, I believe that the majority misunderstands and misapplies the line of cases beginning with Lockett and running through Eddings, Skipper and Dugger. All of those cases, without regard to the kind of statutory scheme with which they deal, require that a jury in a death sentencing proceeding be permitted to hear any mitigating circumstances relating to either the offender or the offense and further be permitted, based upon that evidence, to chose to reprieve an otherwise death-eligible offender from the supreme penalty. The most important part about this rule, as I have described its development, is that it proceeded from a plurality opinion in Lockett to a unanimous opinion in Dugger. Although the Supreme Court has had great difficulty in dealing with other aspects of the death penalty, see, e.g., McCleskey v. Kemp, 481 U.S. 279, 107 S Ct 1756, 95 L Ed 2d 262 (1987) (racially disparate impact of sentences of death) and Lowenfield v. Phelps, U.S. , 108 S Ct 546, 98 L Ed 2d 568 (1988) (degree to which statute defining capital murder sufficiently narrows the pool of death-eligible defendants), it has achieved remarkable unanimity in the development of this part of the death penalty doctrine.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nII\n\nNone of the foregoing necessarily requires holding that the Oregon statutory scheme is unconstitutional on its face. This court could so construe the statute as to permit the admission of all mitigating evidence and to require an instruction to the jury delineating the scope of the jury's authority to reprieve an otherwise death-eligible defendant on the basis of that evidence.\n\nI do not here propose any particular solution. One solution perhaps would be to instruct the jury that, even if it concludes that all three statutory questions should be answered \"yes,\" it nonetheless should answer one of them \"no\" unless it unanimously concludes that the mitigating evidence does not call for a lesser penalty. A second alternative might have the jury answer a fourth, constitutionally-required question after the three statutory ones: After considering all the mitigating evidence, does the jury still unanimously conclude that the prisoner should be put to death, rather than spared? But the majority has offered no suggestion or language that would be consistent both with the statute and with the constitutional requirements.\n\nIt is true, as the majority doubtless recognizes, that to give the statute some construction such as the ones I have described probably would require that the sentence in this case be vacated and the matter be remanded for resentencing. That appears to me to be a small price to pay for establishing a set of statutory and constitutional directives to permit trial courts in the future to conduct constitutionally adequate sentencing proceedings that would avoid future case-by-case evaluations as to which piece of evidence satisfied which statutory and/or constitutional criteria. If the people of this state are to receive reliable enforcement of the death penalty, they deserve to have this aspect of the statutory scheme fully explored and its constitutional limitations declared now.\n\nIII\n\nThe jury instructions pertinent to the three statutory questions and the role of mitigating evidence were so brief that they may be set out here in full:\n\n\"The defendant has been found guilty of aggravated murder. Oregon law provides that the penalty for aggravated murder shall either -- be either death or life imprisonment. You must assume that life imprisonment means imprisonment for the rest of the defendant's life. You are not to consider or discuss any other possible meaning of life imprisonment.\n\n\"You will be given three questions that you must answer either 'yes' or 'no'. Before any question can be answered 'yes', all twelve jurors must agree. If all twelve jurors cannot agree that a question should be answered 'yes', then the question\n\nmust be answered 'no'. In answering the questions your answers must be based only upon the evidence received in this case and upon the instructions which I am now giving you.\n\n\"The first question asked by the law is:\n\n\"Was the conduct of Jeffrey Scott Wagner that caused the death of Jeri Koenig committed deliberately and with the reasonable expectation that the death of Jeri Koenig would result?\n\n\"The word 'deliberately' in this case means the act of mind which examines and considers whether a contemplated act should or should not be done. One acts deliberately when one acts in such a cool mental state, under such circumstances, and for such a period of time as to permit a careful weighing of the proposed decision. The law, however, does not prescribe a particular period of time for deliberation.\n\n\"The second question is:\n\n\"Is there a probability that Jeffrey Scott Wagner would commit criminal acts of violence that would constitute a continuing threat to society? In deciding the second question, probability means the occurrence of an event is more likely than not to occur. Here the event is the chance of the defendant committing criminal acts of violence. Probability does not mean that the occurrence of the event is certain.\n\n\"In determining this issue you shall consider any mitigating circumstances received in evidence including, but not limited to, the defendant's age, the extent and severity of the defendant's prior criminal conduct and the extent of the mental and emotional pressure under which the defendant was acting at the time the killing was committed.\n\n\"The third question asked by the law is:\n\n\"Was the conduct of Jeffrey Scott Wagner in killing Jeri Koenig unreasonable in response to the provocation, if any, by Jeri Koenig?\n\n\"In considering the issues submitted to you, you are to consider all of the evidence submitted to you in this trial. You shall give that evidence such weight as you decide according to the instructions of the court.\n\n\"The burden is upon the State to prove beyond a reasonable doubt the affirmative of each of the issues submitted to you. * * *\"\n\nEven under the majority's construction of the pertinent constitutional requirements, these instructions were\n\ndeficient. The jury was specifically instructed only that it could consider mitigating circumstances with respect to the second question. That is not the law. As the discussion in part I of this dissent shows, the jury must be given far greater latitude in its use of mitigating circumstances. This jury was affirmatively misled as to its authority under the constitution. No sentence of death should be permitted to stand upon jury instructions so woefully inaccurate and incomplete. This defendant has not been accorded a sentencing trial even approaching that required by the Lockett/Eddings/Skipper/Dugger line of cases.\n\nIV\n\nThe majority might argue that, even if my understanding of the constitutional requirements is correct and my criticism of the instructions given to this jury well taken, the evidence in this case is so one-sided and overwhelming that any error committed would be harmless. For the reasons that follow, I do not think that \"harmless error\" satisfactorily disposes of this case.\n\nIn the first place, the concept of \"harmlessness\" is difficult to quantify in the context of Oregon's first death penalty case. When all one knows is that the jury was never correctly advised as to the scope of its authority, any speculation with respect to how a properly-instructed jury would have performed its new and difficult task becomes highly problematical.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nThe second argument to be made is that there is evidence in this record of mitigating circumstances which, however sparse, should have generated appropriate instructions. The evidence shows that this defendant began difficulties with the law at an early age, displayed evidence of mental instability through most of his life, at least twice attempted suicide, may have felt required to turn to violent behavior as a\n\nresponse to institutional settings in which he found himself because of early criminal activity, has made some significant efforts to become and remain employed, has significant artistic ability, is of above average intelligence and is still relatively young. I do not mean to suggest that, were I trying this case, I would find any of the foregoing considerations (whether viewed individually or collectively) as overcoming the state's evidence with respect to each of the three questions or as independent justification for a reprieve from the death penalty. That decision is not my function. It is, instead, the function of an appropriately-instructed jury under the Oregon statutory scheme. No such jury has considered this evidence. One should do so. A second, appropriately-instructed jury might reach the same conclusion as did the jury in this case. However, then and only then will constitutional rules have been observed and any subsequent execution be entitled to that degree of respect which any such profound action should receive in a nation of laws.\n\nFor all of the reasons expressed in this dissenting opinion, I believe that the defendant's sentencing proceeding was constitutionally infirm. Accordingly, I would vacate the sentence of death and remand the case to the trial court for a new sentencing hearing or, at the election of the district attorney, for entry of a new sentence of life imprisonment. Because the majority reaches a contrary conclusion, I respectfully dissent.\n\nOne further point seems to me to be worth making. No one familiar with the degree of conscientious effort applied to this case by every member of this Court could fairly question the sincerity of the views expressed by each of the opinions in this case or by those who adhere to those opinions. However, the fact that judges of reasonable intelligence and integrity can have reached such diametrically opposed views with respect to an issue as crucial as the role mitigating circumstances constitutionally are required to play in sentencing proceedings under statutes like Oregon's demonstrates how desirable it is that the Supreme Court of the United States accept review of this or some similar case. The good faith disagreement that exists in this Court is no small matter; human lives are quite literally at stake. I would hope that that Court, newly blessed with a full complement of justices, would perceive that there is yet work to be done in this area of\n\nconstitutional law and would set about to complete that work forthwith.\n\nI respectfully dissent.\n\n\u003cspan class=\"fn\"\u003e1. All ORS (Oregon Revised Statutes) citations in this opinion are to the statutes prior to amendment by the 1987 legislature. The case was tried in the circuit court and briefed and argued in this court with reference to the statutes as they existed prior to 1987 amendment. The reader is warned that there are changes, but they do not have any effect on this decision.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Although the text of the statute is susceptible to the interpretation that review by the Supreme Court is not mandated, no one has argued that review is not mandatory, and the rule that this court has promulgated assumes that review is mandatory. See ORAP 18.05 entitled \"AUTOMATIC REVIEW IN DEATH SENTENCE CASES.\" ORS 163.150(6) comes from Oregon Laws 1985, chapter 3, section 3(6), which was proposed as Ballot Measure 7, by initiative petition, was enacted by a vote of 893,818 to 295,988 at the general election on November 6, 1984, and became effective December 6, 1984.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. ORS 163.115 provides that criminal homicide constitutes murder when it is committed intentionally or in the commission or attempted commission of certain felonies. This section also provides the penalties that may be imposed for murder; death is not one of those penalties.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. ORS 163.105 provides that aggravated murder is to be punished by death or life imprisonment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. A copy of the petition follows this opinion as Appendix A. The petition is on a printed form with certain additional material supplied by printing with a pen.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. When one convicted of aggravated murder is not sentenced to death, the sentence is life imprisonment with \"a minimum of 30 years without possibility of parole, release or work release or any form of temporary leave or employment at a forest or work camp.\" ORS 163.105(1).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. There is no longer a crime of \"first degree murder\" in this state.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. It may be technically correct that defendant was uncounseled, but as discussed in part I of this opinion, defendant had the advice of lawyers at that stage of the proceedings. It should be noted that defendant's motion was not only that he be allowed to represent himself but that two lawyers be appointed as \"co-counsels.\" Moreover, if a plea of guilty is forbidden by Article I, section 11, of the Oregon Constitution, it would not matter whether defendant was counseled.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The \"Official Revision Comment\" to Article 557 is as follows: \"(a) This article retains from Art. 262 of the 1928 Code of Criminal Procedure the prohibition against receiving a plea of guilty in a capital case. Accord: N.J. Stat. Ann. § 2A:113-3; N.Y. Code of Crim. Proc., § 332. Const. (1921) Art. VII, § 42 authorizes district courts to receive pleas of guilty only in cases less than capital. \"(b) The case of State v. Green, 221 La. 713, 60 So.2d 208 (1952), stated that the fact that the court could not accept an unqualified plea of guilty in a capital case did not mean that the court was required to accept a qualified plea of guilty without capital punishment. Under this article the defendant's plea of 'guilty without capital punishment' is authorized, with consent of the district attorney, in which case it must be accepted by the court. This conforms to the procedure when a defendant pleads guilty to a lesser included offense. See Art. 558.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. In the past we have consulted newspaper editorial comments to seek contemporary understanding of a ballot measure. See, e.g., LaGrande/Astoria v. PERB, 284 Or 173, 182, 586 P2d 765 (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The state has argued cogently that this defendant did not plead guilty to a capital charge but only to a potential capital charge because a jury must still be impaneled for the sentencing proceeding under ORS 163.150(1), and it is entirely possible that the jury may not answer all three questions affirmatively as has occurred already in Oregon under ORS 163.150(2) in other cases of conviction for aggravated murder. A defendant who is determined not to contest the issue of guilt could accomplish his purpose quite easily even were we to hold that Article I, section 11, of the Oregon Constitution prohibits the making or acceptance of a plea of guilty. The defendant could go to trial and as a witness testify that he had done each and every material act charged in the accusatory instrument. Theoretically, the jury could yet find him not guilty, but that result would be exceedingly improbable.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e73. \"In Eisenstadt, the Court struck down a Massachusetts statute that prohibited the distribution of contraceptive devices, finding that the law failed 'to satisfy even the more lenient equal protection standard.' 405 U.S., at 447 n. 7. Nevertheless, in dictum, the Court recited the correct form of equal protection analysis: '[I]f we were to conclude that the Massachusetts statute impinges upon fundamental freedoms under Griswold [ v. Connecticut, 381 U.S. 479 (1965)], the statutory classification would have to be not merely rationally related to a valid public purpose but necessary to the achievement of a compelling state interest.' Ibid. (Emphasis in original).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e74. \" Dunn fully canvasses this Court's voting rights cases and explains that 'this Court has made clear that a citizen has a constitutionally protected right to participate in elections on an equal basis with other citizens in the jurisdiction.' 405 U.S., at 336 (emphasis supplied). The constitutional underpinnings of the right to equal treatment in the voting process can no longer be doubted even though, as the Court noted in Harper v. Virginia Bd. of Elections, 383 U.S., at 665, 'the right to vote in state elections is nowhere expressly mentioned.' See Oregon v. Mitchell, 400 U.S., at 135, 138-144 (DOUGLAS, J.), 229, 241-242 (BRENNAN, WHITE, and MARSHALL, JJ.); Bullock v. Carter, 405 U.S., at 140-144; Kramer v. Union School District, 395 U.S. 621, 625-630 (1969); Williams v. Rhodes, 393 U.S. 23, 29, 30-31 (1968); Reynolds v. Sims, 377 U.S. 533, 554-562 (1964); Gray v. Sanders, 372 U.S. 368, 379-381 (1963).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e75. \"In Mosley, the Court struck down a Chicago antipicketing ordinance that exempted labor picketing from its prohibitions. The ordinance was held invalid under the Equal Protection Clause after subjecting it to careful scrutiny and finding that the ordinance was not narrowly drawn. The stricter standard of review was appropriately applied since the ordinance was one 'affecting First Amendment interests.' 408 U.S., at 101.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e76. \" Skinner applied the standard of close scrutiny to a state law permitting forced sterilization of 'habitual criminals.' Implicit in the Court's opinion is the recognition that the right of procreation is among the rights of personal privacy protected under the Constitution. See Roe v. Wade, 410 U.S. 113, 152 (1973).\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. In the case at bar, the trial court instructed the jury on the meaning of the word \"deliberately\" as used in ORS 163.150(2)(a) as follows: \"The word 'deliberately' in this case means the act of mind which examines and considers whether a contemplated act should or should not be done. One acts deliberately when one acts in such a cool mental state, under such circumstances, and for such a period of time as to permit a careful weighing of the proposed decision. The law, however, does not prescribe a particular period of time for deliberation.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. \"Probability\" in other than the mathematical sense is defined in Webster's New International Dictionary (2d ed 1961): \" 1. Quality or state of being probable; reasonable ground for presuming; true, real, or likely to occur; likelihood; more narrowly, a conclusion that is not proof but follows logically from such evidence as is available; as, reports devoid of all probability; to establish probability of guilt. \"But their notions of probability were radically different from ours. J. A. Froude. \" 2. That which is or appears probable; something probably true or real, or likely to happen; as, his visit is a probability; daily flights are within the probabilities.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Both dissenting judges opined that the vagueness which they found inherent in the statutory text invalidated the statute under due process clause of the Fourteenth Amendment of the Constitution of the United States. The Supreme Court of the United States disagreed. Jurek v. Texas, 428 U.S. 262, 96 S Ct 2950, 49 L Ed 2d 929 (1976).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Defendant also quotes at some length from State v. David, 468 So2d 1126 (La 1984), in which the court held that the aggravating factor that defendant has \"a significant prior history of criminal activity\" was too vague to satisfy the constitution. Whether we would agree or would disagree with that court is beside the point, for that is not the phrase with which we deal under the Oregon statute.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. In Bales v. SAIF, 294 Or 224, 235, 656 P2d 300 (1982), we set forth a footnote that is also pertinent here: \"The medical truth of yesterday may well be the laughing stock of today; today's medical truth may be likewise treated tomorrow. History teaches us that the vast majority of doctors 100 years ago, both in practice and in the universities and hospitals, believed Dr. Ignaz Phillipp Semmelweis not only to be wrong, but probably not completely sane, simply because he insisted that a doctor ought to wash his hands with a watery solution of chloride of lime before delivering a baby if the doctor had just been dissecting a cadaver or engaged in some other activity that had caused the doctor's hands to become unclean. Semmelweis' observations of the high incidence of puerperal fever in mothers whose babies were delivered with the assistance of doctors whose hands and clothing were unclean led him to believe there was a causal connection between the lack of cleanliness and the ensuing fever. See, e.g., 'Immortal Magyar' by Frank G. Slaughter, M.D., 1950. The work of Joseph Lister was eventually to explain why Semmelweis was right, but he was right even when he was a minority of little more than one. In any field of science, today's truth may tomorrow be shown to be false. Consider the history of the views of planetary revolution. Were Johannes Keppler and Galileo, on the one hand, or those who believed the sun revolved around the earth, on the other hand, correct? Who were in the majority, and who in the minority, in that time?\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. We have quite recently spoken to predictability of \"dangerous\" criminal activity. See State v. Huntley, 302 Or 418, 429-431, 730 P2d 1234 (1986). Some of the literature there identified is pertinent here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Although it is not pivotal, we note that Article I, section 20, of the Oregon Constitution, like Article I, section 10, is a general provision, while Article I, section 40, is a special provision.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The Supreme Court of the United States has granted a writ of certiorari in Franklin v. Lynaugh, U.S. , 108 S Ct 221, 98 L Ed 2d 180 (1987). We understand the issue on which the writ was granted is \"whether the jury must be instructed on the effect of mitigating evidence under the Texas capital punishment scheme.\" The answer to that question cannot affect Oregon's scheme, for ORS 163.150(1)(b)(B), as we here construe it, requires such instruction.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. In his dissent, Justice Gillette seems to ignore the text we have just emphasized.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. This section was amended in 1974 to raise the sum of $20 to $200.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. See L. 1864; General Laws of Oregon, ch 1, § 6 (Deady 1845-1864); Hill's Anno Laws § 1205; 1 Codes and Statutes of Oregon, ch II, § 1233 (Bellinger and Cotton 1902), and compare ORS 131.005(6): \"'Criminal action' means an action at law by means of which a person is accused and tried for the commission of an offense.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. We quote from the state's brief the following summary, which we find to be supported by the transcript: \"He challenged juror Sullivan on the grounds that Sullivan would believe an officer's testimony over that of other witnesses. * * * Defendant later exercised a peremptory challenge to remove Sullivan. * * * When juror Milligan revealed that he was awaiting a probation violation hearing for failing to complete sexual abuse counseling, defendant requested and was granted a recess to confer with his legal advisors. * * * Defendant and the state agreed the juror should be excused for cause, and he was. * * * After initially passing juror Almen for cause, defendant challenged him because he knew and would tend to believe witnesses for the state. * * * The state did not oppose defendant's challenge, and the juror was excused. * * * Defendant also challenged for cause alternate juror Sweat, because of his hearing problem. Again the state did not oppose the challenge, and the juror was excused. * * * Defendant challenged juror Abraham for cause, on the grounds that the juror could not be fair because the juror's brother had been murdered. The court granted defendant's challenge. * * * Defendant first passed juror Atkinson for cause, then challenged him on grounds the juror's wrestling coach commitments would interfere with his attention to the case. The court denied the challenge, and defendant challenged the juror peremptorily.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Defendant did not challenge Watson for cause; defendant did not exercise an unused peremptory challenge to remove Watson from deliberation of defendant's fate. For whatever reason he may have then had, defendant did not believe he should exclude or attempt to exclude Watson from the jury. Had the court done so, sua sponte, as defendant now contends the court should have, and had the jury, with Watson not in place, have returned a verdict mandating the death penalty, would defendant not now be arguing that the court erred in excluding Watson from the jury?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. We do not approve the content of the last sentence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. The assault on the child is what led to the prosecution in which the victim was to be a witness. Defendant's killing of the victim, qua witness, was what made his murder of her aggravated murder.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. In his dissent, Justice Linde states: \"defendant was allowed to pursue a course that prevented the lawyers who were appointed to 'advise' him from making an effective challenge to the state's proof of aggravated murder.\" We find nothing in the record to show what challenge defendant's advisers would have made had defendant not pleaded guilty, let alone that it would have been an \"effective\" challenge. 305 Or at 194-95, 752 P2d 1136 at 1185. Justice Linde chides us for our short treatment of Skinner v. Oklahoma, 316 U.S. 535, 62 S Ct 1110, 86 L Ed 1655 (1942). 305 Or at 214, 752 P2d 1136 at 1196. The footnote is not ours but that of the Supreme Court of the United States found in San Antonio School District v. Rodriguez, 411 U.S. 1, 33-34, 93 S Ct 1278, 1297, 36 L Ed 2d 17, 43-44 (1973). That Court's footnote explains that the statute struck down in Skinner implicated a right implicitly found in the Constitution of the United States. The \"right to life\" is not to be found there. In footnote 8, 305 Or at 215, 752 P2d 1136 at 1197, Justice Linde notes the possibility that there is tension between the initiative process by which the people can directly enact legislation and the Constitution of the United States requiring that a republican form of government be maintained. U.S. Const Art IV, § 4. This is not before us.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. See ORS 167.320, which makes criminal \"animal abuse\" by seriously injuring or cruelly killing an animal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The trial judge told the jury: \"The second question is: \"Is there a probability that Jeffrey Scott Wagner would commit criminal acts of violence that would constitute a continuing threat to society? In deciding the second question, probability means the occurrence of an event is more likely than not to occur. Here the event is the chance of the defendant committing criminal acts of violence. Probability does not mean that the occurrence of the event is certain. \"In determining this issue you shall consider any mitigating circumstances received in evidence including, but not limited to, the defendant's age, the extent and severity of the defendant's prior criminal conduct and the extent of the mental and emotional pressure under which the defendant was acting at the time the killing was committed.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The Court said in Tison: \"The heart of the retribution rationale is that a criminal sentence must be directly related to the personal culpability of the criminal offender. While the States generally have wide discretion in deciding how much retribution to exact in a given case, the death penalty, 'unique in its severity and irrevocability,' Gregg v. Georgia, 428 U.S. 153, 187 (1976), requires the State to inquire into the relevant facets of 'the character and record of the individual offender.' Woodson v. North Carolina, 428 U.S. 280, 304 (1976). Thus in Enmund's case, 'the focus [had to] be on his culpability, not on that of those who committed the robbery and shot the victims, for we insist on \"individualized consideration as a constitutional requirement in imposing the death sentence.\"' Enmund v. Florida, 458 U.S. at 798 (quoting Lockett v. Ohio, 438 U.S. 586, 605 (1978) (emphasis in original).\" 107 S Ct at 1683, 95 L Ed 2d at 139.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The Chadd court wrote: \"The Attorney General in effect stands Faretta on its head: from the defendant's conceded right to 'make a defense' in 'an adversary criminal trial,' the Attorney General attempts to infer a defendant's right to make no such defense and to have no such trial, even when his life is at stake. But in capital cases, as noted above, the state has a strong interest in reducing the risk of mistaken judgments. Nothing in Faretta, either expressly or impliedly, deprives the state of the right to conclude that the danger of erroneously imposing a death sentence outweighs the minor infringement of the right of self-representation resulting when defendant's right to plead guilty in capital cases is subjected to the requirement of his counsel's consent. It is significant that the Attorney General is unable to cite any authority, either federal or state, that holds to the contrary.\" People v. Chadd, 28 Cal 3d 739, 751, 621 P2d 837, 844, 170 Cal Rptr 798, 805 (1981) (emphasis in original, footnotes omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Courtroom style was more colorful a century ago. The district attorney argued, in part: \"'Gentlemen, this case is now with you. The people will not be deceived; they cannot be deceived; they know where the right is, and you know where the right is, too. Your know the element [sic] that are to day contesting in this court for supremacy. You know that on the one hand is law and order, and on the other hand is riot and bloodshed and disorder. You know that those two things are trying to gain the supremacy in this county. You know that one or the other will rule. If Charles Olds is allowed to go forth with your verdict registered one iota less than charged in this indictment; if it is said of him that he did not commit deliberate and premeditated murder, the shout will go forth to Spokane, the shout will go forth to these various places that Multnomah county juries will not convict gamblers, when they are clearly proven to be guilty; that Multnomah county juries will not do their duty in this regard, but that they will shirk it.'\" State v. Olds, 19 Or at 435-36, 24 P at 404. In invalidating the submission of a \"victim impact statement\" in a death sentence proceeding, the United States Supreme Court rejected the state's argument that the personal characteristics of the victim and the impact on their family were relevant \"circumstances.\" Booth v. Maryland, U.S., 107 S Ct 2529, 96 L Ed 2d 440 (1987). The Court wrote: \"The focus of a VIS, however, is not on the defendant, but on the character and reputation of the victim and the effect on his family. \"* * * \"Nor is there any justification for permitting such a decision to turn on the perception that the victim was a sterling member of the community rather than someone of questionable character.\" n. 8 U.S. at , 107 S Ct at 2534, 96 L Ed 2d at 449-50. The footnote added: n. 8 \"We are troubled by the implication that defendants whose victims were assets to their community are more deserving of punishment than those whose victims are perceived to be less worthy. Of course, our system of justice does not tolerate such distinctions.\" Id. (citation omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Article I, section 20 of the Constitution of Oregon states: \"No law shall be passed granting to any citizen or class of citizens privileges, or immunities, which, upon the same terms, shall not equally belong to all citizens.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. In our decentralized system of criminal justice, a particular prosecutor's decision to seek the death penalty may be unequally affected by its extraordinary costs in addition to plea bargaining considerations such as a defendant's willingness to plead guilty or to testify against accomplices, even intangibles like the relationship of the victim or the defendant to the community, not to mention turnover in the offices of prosecutor and of governor. See New York Times, November 27, 1986 at A1, col 1, December 9, 1986 at A27, col 1, December 23, 1986 at A17 col 1 (reporting on the commutation by outgoing Governor Anaya of all New Mexico death sentences and the pledge by the incoming governor and other state officials to challenge that action). Although five years ago, Florida's Supreme Court reportedly was spending one-third of its time on death cases, review only of prosecutions that result in a death sentence cannot assure equal treatment with other cases that do not. See Sherrill, Death Row on Trial, New York Times, November 13, 1983, at sec 6, p 80, col 1. As Justice England wrote, \"individuals in Florida may well be executed for crimes similar to those committed by others who have been spared the death penalty. Disparities in sentencing will occur -- despite all the rhetoric about death being different and the courts exercising special scrutiny to prevent arbitrariness -- simply to preserve overriding societal needs.\" Witt v. State, 387 So 2d 922, 932 (Fla 1980) (England, J., concurring). To prepare comparisons of prosecutions of similar offenders committing similar crimes, of whom some are selected for the death penalty and others are not, is possible if sufficiently uniform and detailed records are developed for all potentially eligible prosecutions but probably is beyond the resources of any defendant or of the state Public Defender; yet it is needed. That burden should rest on the Department of Justice, not on a defendant.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Another question that has not been briefed is whether a plebiscite that bypasses the legislature and the governor in order to repeal parts of the Bill of Rights and to impose a penal regime which is morally repugnant to a substantial minority of citizens remains compatible with the state's obligation to maintain a republican form of government, U.S. Const Art IV, § 4, as well as with the original purposes of amended Or Const Art IV, § 1. An initiative measure not only short-circuits the hearings, study, debate and adjustments made in the normal legislative process, see OEA v. Phillips, 302 Or 87, 106-07, 727 P2d 602 (1986) (Linde, J., concurring), it replaces a representative body's resistance to overriding intensely felt minority concerns with a purely majoritarian plebiscite. The question whether republicanism limits this process dropped from sight for lack of judicial opinions after the United States Supreme Court held it beyond the reach of the federal courts in its more generalized form, i.e., whether the existence of a nonrepublican feature would make the entire state government illegitimate, Pacific Telephone Co. v. Oregon, 223 U.S. 118, 32 S Ct 224, 56 L Ed 377 (1912) (challenge to a license tax enacted by an initiative measure). This did not relieve state courts of responsibility under their state constitutions and the Supremacy Clause, U.S. Const, Art VI, to determine whether their governments had acted by institutions or processes that remained \"republican\" within the meaning of the Guarantee Clause, as this court did in Kiernan v. Portland, 57 Or 454, 111 P 379, 112 P 402 (1910) and Kadderly v. Portland, 44 Or 118, 74 P 710, 75 P 222 (1903). See also Van Sickle v. Shanahan, 212 Kan 426, 511 P2d 223 (1973); Kohler v. Tugwell, 292 F Supp 978, 985 (ED La 1968) (Wisdom, J., concurring); see generally, Tribe, American Constitutional Law 98-100 (2d ed. 1987); Heaton, The Guarantee Clause: A Role for the Courts, 16 Cumb L Rev 477 (1985-8); Bonfield, The Guarantee Clause of Article IV, Section 4: A Study in Constitutional Desuetude, 46 Minn L Rev 513 (1962); Wiecek, The Guarantee Clause of the U.S. Constitution (1972).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. A report of the Legislative Fiscal Office following State v. Quinn, supra, estimated that this fairly typical capital case would have cost almost $250,000 in counsel costs alone (in 1980-81 dollars), even assuming that all appeals beyond this court were denied. That does not include all other costs of trial and execution, which greatly increase the total cost.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. See Kaplan, Death in the USA, 10 Nat'l L J 1, 31 (February 15, 1988). 1 As the material that follows demonstrates, there were such cases, including one involving the Texas statute, Adams v. Texas, 448 U.S. 38, 100 S Ct 2521, 65 L Ed 2d 581 (1980). 2 The majority's reliance on certain language from Lowenfield v. Phelps, 305 Or at 165 is untenable. That case had nothing to do with the role of mitigating circumstances. The Court in Lowenfield specifically said it was faced with two issues only: \"[w]hether a sentence of death may validly rest upon a single aggravating circumstance that is a necessary element of the underlying offense of first-degree murder, and whether the judge had coerced the sentence verdicts from the jury.\" U.S. at , 108 S Ct at 550, 98 L Ed 2d 568 (1988). 3 No objection was made to any instructions in this case. Normally, I would regard that as disposing of any concern with respect to the instructions. However, the posture of the present proceedings as the first death penalty case to be tried under the new statutory scheme seems to me to call for us to exercise the widest latitude in defining what a court should instruct the jury and seeing to it that no person goes to his or her death unless a jury was adequately instructed. The dignity of any human life, even that which a state legitimately determines that it is entitled to end, deserves at least this degree of formality and rectitude.\u003c/span\u003e\n\n",
    "body_length": 278413,
    "citedas": [
      "752 P.2d 1136",
      "305 Or. 115"
    ],
    "attorneys": "Gary D. Babcock, Public Defender, Salem, argued the cause for appellant. With him on the brief were David E. Groom and Phillip M. Margolin, Portland, and Lawrence J. Hall, Salem. Jonathan H. Fussner, Assistant Attorney General, argued the cause for respondent. With him on the brief were Dave Frohnmayer, Attorney General, Virginia L. Linder, Solicitor General, and Thomas H. Denney, Terry Ann Leggert and Rives Kistler, Assistant Attorneys General, Salem. Richard A. Cremer, Roseburg, filed an amici curiae brief on behalf of American Civil Liberties Union of Oregon and Oregon Criminal Defense Lawyers Association. With him on the brief were Robert C. Homan, Michael V. Phillips and William L. Tufts, Eugene.",
    "category": [
      "242",
      "36",
      "75"
    ],
    "judges": "In Banc. Lent, J. Linde, J., dissented and filed an opinion. Gillette, J., dissented and filed an opinion in which Linde, J., joined.",
    "citation_count": 8
  }
}
