{
  "id": "GYEcPmYBTlTomsSBVfzU",
  "document": {
    "title": "Equal Employment Opportunity Commission v. American National Bank",
    "full_title": "EQUAL EMPLOYMENT OPPORTUNITY COMMISSION v. AMERICAN NATIONAL BANK ; EQUAL EMPLOYMENT OPPORTUNITY COMMISSION V. AMERICAN NATIONAL BANK .",
    "jurisdiction": "Fourth Circuit",
    "date": "1981-06-26T00:00:00.000Z",
    "docket": "Nos. 79-1533, 79-1725",
    "body": "The Equal Employment Opportunity Commission (EEOC) instituted this action on a complaint charging that defendant American National Bank (ANB or Bank) had engaged in a pattern or practice of racially discriminatory hiring practices from 1969 to 1975, in violation of Title VII of the Civil Rights Act of 1964, 42 U.S.C. ยง 2000e et seq. The district court found that the static work force statistics submitted by the EEOC revealed a continuous underrepresentation of blacks in defendant's work force during the relevant period, both generally and in the specific job categories of officials and managers and of office and clerical personnel, and therefore constituted prima facie proof of a pattern or practice of discrimination. It then held that prima facie case rebutted, however, by ANB's applicant flow data and a standard deviation analysis of the static work force statistics. The court then examined each of ANB's hiring practices that the EEOC had alleged to be discriminatory, and found them to be legitimate business practices and nondiscriminatory in effect, both separately and in combination. Additionally, the court evaluated 31 claimed examples of discrimination in specific hiring decisions, and found that none showed a denial of employment because of race. Concluding that the EEOC had therefore failed to prove a pattern or practice of discrimination, the court dismissed the suit. It then ruled that the EEOC had brought a frivolous claim and pursued it in bad faith, justifying an award of costs and attorneys' fees to defendant. In a later order, the court determined the amount of reasonable attorneys fees to be that submitted by ANB, in the amount of $106,084.75.\n\nWe agree with the district court's ruling that the EEOC's statistical proof made out a prima facie case of discrimination, but, with the exception of one employment category, we conclude that the court erred in holding that defendant's rebuttal evidence was sufficient to overcome the prima facie case. Because the proof of a pattern or practice of discrimination thus stands unrebutted as to all but the one category on a proper legal analysis of the total evidence, we reverse and remand for the determination of appropriate relief.\n\nI\n\nThis case began with a charge of discrimination filed with the EEOC in 1969 by a rejected black applicant, Sandra Holland. Ms. Holland alleged that she had been refused employment at ANB's Suffolk branch. The EEOC conducted an investigation in 1970, and found that Ms. Holland's application at the Suffolk branch could not be located, though it did find an earlier application at the Portsmouth branch. The EEOC issued its formal \"determination\" in March 1974, finding reasonable cause to believe that ANB had engaged in discriminatory hiring practices. The determination discussed hiring figures only for ANB's Suffolk branch, and in a footnote rejected information about the hiring of blacks in ANB's Portsmouth branches as \"irrelevant to employment at its Suffolk branch.\" App. 1523. Conciliation efforts were unsuccessful, and Ms. Holland was issued a right-to-sue notice in August 1974, but declined to file suit. The EEOC then instituted this action in January of 1976, charging a pattern or practice of discrimination in both the Suffolk and Portsmouth branches.\n\nIn August of 1976, the district court granted defendant's motion for summary judgment and dismissed the action for laches. This court vacated and remanded the case, in EEOC v. American National Bank, 574 F.2d 1173 (1978). Applying Occidental Life Insurance Co. v. EEOC, 432 U.S. 355, 97 S. Ct. 2447, 53 L. Ed. 2d 402 (1977), we held the action not barred because no federal statute of limitations applied to suits by the EEOC once jurisdiction over the complaint is properly obtained, and noted that Congress did not intend state statutes of limitation to apply to such suits. Additionally, we held that the EEOC was entitled to bring suit on the broader pattern or practice allegation, founded on its reasonable cause determination and conciliation efforts. Any prejudice to the Bank resulting from the loss of evidence relating to Sandra Holland's charge did not affect its ability to defend the pattern or practice suit. 574 F.2d at 1175-76.\n\nThe case was tried over a four-day period in December 1978. The EEOC presented statistical evidence designed to show gross disparities between ANB's work force and the relevant labor pool of qualified blacks during the period charged. Further evidence was offered to prove ANB's use of subjective selection criteria and other discriminatory hiring practices. Finally, the EEOC presented 52 specific instances of black applicants who were allegedly not hired because of their race. (Thirty-one of these testified at trial).\n\nThe EEOC's statistical evidence, presented in the form of stipulated exhibits, compared on a static basis the racial composition of ANB's work force in its Suffolk and Portsmouth branches from 1968-75 to that of the general available work force in the relevant market areas.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e It then compared the racial composition of specific job categories at both branches officials and managers, office and clerical workers, and service workers with the proportion of qualified blacks in the population, for each category.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e The statistics revealed, as the district court found, that in the Suffolk branches there were no blacks employed as officers or managers during the eight-year period, though blacks comprised 8-10.9% of the qualified labor market. In its twenty clerical positions, ANB-Suffolk employed one black in the years 1970 and 1973, and two in 1971 and 1972. There were no blacks employed in this category during the other relevant years, as compared to a qualified labor market that was 10.3-22.5% black. In the seven ANB-Portsmouth branches, there were no black managers from 1968-1972, and one for each of the remaining three years. The qualified work force during this period was 4.8-6.9% black. In the office and clerical categories at Portsmouth, the Bank's work force was from 0 to 6.5% black from 1968-1974, and 9.3% in 1975, compared with a qualified work force that was 13.9-21.5% black. Only in the service worker category has the percentage of black bank employees been greater than the percentage of blacks in the available service worker force in the relevant labor market area. During the entire period, the service work force in both branches was at least 75%, and often 100% black.\n\nThe evidence as to the Bank's hiring procedures\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e was also stipulated by the parties. Applicants had to appear and submit an application form which would be retained on file and considered for vacancies for up to six months. The application form sought information on the individual's education, work experience, skills, references, desired position and salary, and relatives or friends at the Bank. Before 1973, applicants were required to take the Wonderlic Personnel test; until May 1975, a high school diploma was required for a clerical position. Application forms would be submitted to a designated employee; usually a different official would screen the applications and conduct interviews when a vacancy occurred. Until 1975, when the bank began maintaining records for determining compliance with affirmative action plans, no notation was made of the race of an applicant. There may have been clues, however, in their addresses and educational history.\n\nBank officials testified that when a vacancy developed, they would review the most recent applications first, and usually would not reach applications submitted more than 30 days previously. In a few cases, when they did not find a qualified applicant on file, they would advertise the vacancy. After reviewing applications, officials would select a few applicants to interview. There were no written job descriptions or criteria for hiring. The interviewers, all of whom were white, would evaluate the applicant's ability to communicate, maturity, personality, and physical appearance. The interviewer's decision to accept or reject an applicant was generally controlling. When ANB became particularly interested in hiring an applicant, prior employers were contacted, and character references were sometimes checked. Prior to 1975, ANB occasionally made retail credit checks on final applicants. Nearly half of the hires during this period had listed friends or relatives among bank employees.\n\nAs part of its nonstatistical evidence, the EEOC presented the testimony and written statements of 31 black applicants who had been rejected for positions at ANB. The EEOC stipulated that its case as to individual examples of discrimination would be limited to those 31 applicants who were able to testify. Twenty-one additional applicants were identified by the EEOC as having been discriminated against. Although these particular cases were not submitted to the court on the pattern or practice of discrimination issue, the court considered them in deciding the attorney's fees issue.\n\nThe Bank, in rebuttal, submitted applicant flow data purporting to compare the number of blacks and whites hired with those who submitted an application during 1969-1975.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e These figures revealed that in the Suffolk branches during this time, blacks submitted 25.1% of the applications and represented 17.9% of those hired, while whites submitted 74.9% of the applications and constituted 82.1% of the hires. For the Portsmouth branches, only 1975 data was available. They indicated that blacks constituted 23.3% of the applicants and 11.1% of the hires, while whites were 76.1% of the applicants and 88.9% of the hires. These statistics did not separate the applicants by job category, but combined the service worker hires with the clerical and managerial hires.\n\nBefore ruling on the substantive issues under Title VII, the court considered the preliminary issue whether it had jurisdiction to hear the claims. Although finding that the initial charge by Ms. Holland was valid and the EEOC's broader investigation of the general policies and practices of ANB's Suffolk branches relevant to the initial charge, the court concluded that the activities of the Portsmouth branches were not the subject of the EEOC investigation nor were they included in the reasonable cause determination of March 11, 1974. Consequently, the court ruled that it lacked jurisdiction to hear that part of the case concerning the allegedly discriminatory practices and the individual claims of discriminatory hiring at the Portsmouth branches. Anticipating that the case would be appealed, the court nevertheless included the Portsmouth branches in its analysis of the merits.\n\nAddressing the merits, the court first considered the static work force statistics presented by the EEOC, comparing the percentage of blacks in defendant's work force with the percentage of blacks available in the population, using both general work force and special qualifications work force figures. From each set of figures, the court found that blacks were underrepresented in ANB's work force. Under Hazelwood School District v. United States, 433 U.S. 299, 97 S. Ct. 2736, 53 L. Ed. 2d 768 (1977), the court therefore found that the EEOC had presented prima facie proof by statistical means of a pattern or practice of discrimination at ANB's Suffolk and Portsmouth branches.\n\nThe court then evaluated ANB's rebuttal evidence consisting of its applicant flow data for the charged period, and the EEOC's nonstatistical evidence related to ANB's screening and hiring practices, and the 31 cases of unsuccessful black applicants who testified at trial. The applicant-flow data and a standard deviation analysis of the static work force statistics were found sufficient in combination to rebut the EEOC's prima facie case. Alternatively, though without discussion, the court found that too few hiring decisions were made to justify an interference of discrimination. After an extensive analysis of each of the hiring practices shown by the EEOC, the court concluded that neither separately nor together were these practices discriminatory but rather served legitimate business purposes. Finally, the court found that none of the 31 unsuccessful black applicants were victims of racial discrimination in hiring. On balance, then, the court concluded that the EEOC's statistical evidence of a prima facie case was substantially rebutted. Conceding that ANB's work force was virtually all white prior to 1969 and racially imbalanced from 1969-1975, the court concluded that the imbalance was a product of pre-1969 activities and therefore not violative of Title VII. For reasons that follow, we find error requiring reversal in the court's legal and factual analysis of the evidence.\n\nII\n\nInitially we consider and reject the district court's conclusion that it had no jurisdiction over that part of the suit concerning ANB's Portsmouth branches.\n\nThe 1972 amendments to Title VII gave the EEOC broad enforcement powers. Section 706 enabled the EEOC, after a charge alleging discrimination had been filed with the EEOC and conciliation efforts with the respondent had failed, to bring suit in its own name. 42 U.S.C. ยง 2000e-5(f)(1). Although Congress declined to expand the EEOC's powers to the extent exercised by the NLRB, broad litigation powers were added to preexisting powers to enable the EEOC \"to vindicate the public interest.\" EEOC v. Kimberly-Clark Corp., 511 F.2d 1352, 1361 (6th Cir. 1975). Consistent with this expansion of the EEOC's role to include enforcement as well as conciliation, EEOC v. Cleveland Mills Co., 502 F.2d 153, 155-56 (4th Cir. 1974); EEOC v. Kimberly-Clark Corp., 511 F.2d at 1357, the 1972 amendments were intended to enable the EEOC to correct \"public or \"societal' wrongs, (to be) the public avenger by civil suit of any discrimination uncovered in a valid investigation and subjected to conciliation under the Act.\" EEOC v. General Electric Co., 532 F.2d 359, 373 (4th Cir. 1976). We determined in General Electric that the EEOC had standing, after 1972, to bring suit in its own name on \"discrimination stated in the charge itself or developed in the course of a reasonable investigation of that charge, provided such discrimination was included in the reasonable cause determination of the EEOC and was followed by compliance with the conciliation procedures fixed in the Act.\" Id. at 366 (italics omitted). In giving the EEOC the right to sue in its own name, Congress signalled its desire \"(to eliminate) employment discrimination as a national evil\" rather than provide solely for the redress of private interests. To confine standing of the EEOC to that of an individual complaining party would nullify the legislative intent of the 1972 amendments. Id. at 373.\n\nThe EEOC's new role as an enforcer, however, was not intended to diminish its role as conciliator. Title VII establishes a comprehensive administrative procedure whereby the parties involved, including the EEOC, have the fullest opportunity to resolve charges of discrimination without resorting to the courts. See 42 U.S.C. ยง 2000e-5(b), (f)(1). Before the EEOC may bring a civil action under Title VII against an employer there must be a charge filed with the EEOC, notice of the charge to the employer, investigation by the EEOC, a determination of reasonable cause, and an effort at conciliation. EEOC v. Raymond Metal Products Co., 385 F. Supp. 907, 916 (D.Md.1974), aff'd in relevant part, 530 F.2d 590 (4th Cir. 1976). Two important purposes are served by this preadjudicative administrative procedure: first, the employer is fully notified of the violation alleged by the charging party; and second, the EEOC has the opportunity to consider all the charges and to attempt their resolution through conciliation and voluntary compliance. Id.\n\nThe 1972 amendments, while enlarging the powers of the EEOC to include enforcement, retained the previous emphasis on administrative resolution and conciliation of charges. Interpretations of the 1972 amendments emphasize the sequential nature of the process. \"(E)ach step in the Commission's administrative process is designed to be a prerequisite to the following step and, ultimately, to suit.\" EEOC v. E. I. DuPont de Nemours \u0026 Co., 373 F. Supp. 1321, 1336 (D.Del.1974), aff'd, 516 F.2d 1297 (3d Cir. 1975). Conciliation, the final step in the process, can therefore be regarded as a condition precedent to the EEOC's power to sue. See EEOC v. Allegheny Airlines, 436 F. Supp. 1300 (W.D.Pa.1977), and legislative history of the 1972 amendments quoted therein.\n\nThe law on the question of the permissible scope of a complaint filed by the EEOC pursuant to the 1972 amendments has focused on the role of the EEOC as investigator and the statutory preference for administrative resolution of charges of discrimination. Proper investigation and conciliation of charges are characterized as jurisdictional prerequisites to a suit by the EEOC on a particular claim. But see EEOC v. Westvaco Corp., 372 F. Supp. 985, 991 (D.Md.1974) (EEOC's failure to make a timely reasonable cause determination and to attempt conciliation before filing suit goes to whether a claim has been stated rather than to subject matter jurisdiction.)\n\nThe district court in this case dismissed the EEOC action insofar as it related to the Portsmouth branches of ANB and the individuals allegedly discriminated against at those branches. Characterizing the Portsmouth charges as \"new discrimination\" not included in the original charge by Sandra Holland, the court analyzed whether or not these charges could be included in the EEOC civil complaint under the test set forth in General Electric. Finding that the EEOC investigation and reasonable cause determination concerned only the allegations of discrimination at the Suffolk branches, the court concluded it was without jurisdiction to hear the Portsmouth charges.\n\nWe disagree with the district court's analysis and conclusion on this issue. The question was not whether the court had jurisdiction over \"new\" charges of discrimination brought for the first time by the EEOC in its civil complaint. The crucial issue was instead whether the district court had jurisdiction over the same charges of discrimination against a single defendant, expanded to include the same practices at all its branch offices when the original charge and investigation focused on one city but where there was common ownership and control over branches in both that city and a nearby city, and where the challenged hiring practices for all branches were similar. We conclude that jurisdiction over charges pertaining to all branches of ANB was proper in this case because there was, through the EEOC's investigation and attempted conciliation with regard to Suffolk, adequate notice to the defendant of the practices under investigation and ample opportunity for conciliation concerning those practices. Had the conciliation effort been successful, given the common control over and similar practices at the two cities' branches, whatever changes were to be instituted at the Suffolk branches would no doubt logically and necessarily have been made at the Portsmouth branches as well.\n\nOur resolution of this issue does not disturb the rule announced in General Electric and since adhered to by this court. See EEOC v. Chesapeake \u0026 Ohio Ry., 577 F.2d 229, 231-32 (4th Cir. 1978). As we noted above, completion of the full administrative process is a prerequisite to the EEOC's power to bring suit in its own name. This power of enforcement is bottomed on an administrative scheme giving every employer charged with discrimination under Title VII the opportunity to correct its fault out of court. See Macon v. Bailar, 451 F. Supp. 140, 142 (E.D.Va.1978), citing Alexander v. Gardner-Denver Co., 415 U.S. 36, 44, 94 S. Ct. 1011, 1017, 39 L. Ed. 2d 147 (1974). Consistent with this scheme, we require that a particular charge of discrimination be the subject of the reasonable cause determination and conciliation before being subject to suit by the EEOC. This requirement, for example, protects an employer charged in the reasonable cause determination with race discrimination in hiring against being surprised by a subsequent suit including charges of race discrimination in layoffs or promotion, or sex discrimination. There would have been no prior notice to the employer that practices relating to these charges were suspect nor an opportunity for the employer to remedy the problems out of court.\n\nThis case, however, does not present such a situation. There is but a single charge of race discrimination in hiring. ANB is a single employer with operations at multiple locations, all subject to unified supervision and control and using similar hiring practices. 21 F.E.P. Cases at 1541. But cf. Stastny v. Southern Bell Telephone \u0026 Telegraph Co., 628 F.2d 267 (4th Cir. 1980) (importance of local autonomy and discrete labor pools in adjudicating liability); Hill v. Western Electric Co., 596 F.2d 99 (4th Cir. 1979) (same). Although the notice of the original charge by Sandra Holland was sent to Donald King, Assistant Vice President of ANB Suffolk, the receipt of the notice was acknowledged by Joseph M. Fail, Vice President at the main office in Portsmouth. App. 1518, 1519. Also, the EEOC's notice of failure of the conciliation effort was sent to ANB's attorney, id. at 1526, who presumably represented not only the Suffolk branches but the entire organization. ANB's officers must therefore be charged with full awareness of the charges and the issues to be resolved in conciliation and thus fully aware of the practices challenged by the EEOC.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e There was therefore no possibility for prejudicial surprise of the sort that has properly been held to preclude proof of later added charges in other situations.\n\nWe conclude, therefore, that the district court did have jurisdiction over the Portsmouth claims and should have considered proof related to them.\n\nIII\n\nWe turn now to the district court's analysis on the merits. As indicated in our general summary of the course of proceedings, the district court specifically concluded that, based upon the static work force statistical evidence, there was prima facie proof of a pattern or practice of race discrimination in hiring:\n\n(T)he fact (is) that from 1969 to 1975, blacks were underrepresented in defendant's work force, not only in the work force generally but also in the specific categories of officials and managers and office and clerical personnel. The Court cannot agree with defendant that these comparisons are \"irrelevant.\" Hazelwood School District v. United States, 433 U.S. 299, (97 S. Ct. 2736, 53 L. Ed. 2d 768) 15 F.E.P. Cases 1 (1977), held that comparative statistics showing gross statistical disparities are prima facie proof of a pattern or practice of discrimination. Id. at 308-09 (97 S. Ct. at 2741-42). The Court finds, therefore, that the statistical evidence presented here by the EEOC is prima facie statistical proof of a pattern or practice of discrimination.\n\n21 F.E.P. Cases at 1552 (footnote omitted). The court then concluded, however, after analyzing the defendant's applicant flow data and applying a standard deviation analysis to both the static work force statistics and the applicant flow data, that the inference of a pattern or practice of race discrimination had been neutralized. Id. at 1560. Having thus concluded that the statistically based prima facie case had been effectively rebutted, the court then turned to independent consideration of the EEOC's nonstatistical evidence offered to show a discriminatory pattern or practice. Concluding that this evidence would not support an inference of discrimination, the court was led inexorably to the ultimate conclusion that the EEOC had failed to carry its burden of proof. 21 F.E.P. Cases at 1584.\n\nFor reasons that follow, we conclude that in a number of critical respects the district court's analysis of the evidence was flawed by specific failures correctly to apprehend or to apply controlling legal principles developed by the Supreme Court for analyzing the evidence in this type case. These misapprehensions and misapplications constituted errors of law which invalidate with one exception the court's ultimate conclusion that the EEOC failed to prove the pattern or practice of discrimination as charged and properly under consideration. We further conclude that under a legally correct analysis of the essentially undisputed historical facts in evidence, a prima facie case was established and except with respect to managerial employees in the Suffolk branches not rebutted or avoided, and that in consequence a pattern or practice of racial discrimination in hiring was proved.\n\nSpecifically we find errors of law in the weight apparently assigned by the court to a standard deviation analysis of certain of the statistical evidence; in the significance which the court assigned to ANB's applicant flow statistics as rebutting evidence; and in the way in which the court treated the relationship between the statistical and nonstatistical evidence offered to prove the discriminatory pattern or practice charged. To show why, we briefly summarize the controlling principles for analysis of proof in this case, and then indicate wherein we think the district court so far misapprehended or misapplied these as to make erroneous its ultimate conclusion that the EEOC had failed to prove a pattern or practice of discrimination violative of Title VII.\n\nThe controlling principles are those embodied in the proof scheme developed by the Supreme Court for assessing claims of patterns or practices of disparate treatment, principally in International Brotherhood of Teamsters v. United States, 431 U.S. 324, 97 S. Ct. 1843, 52 L. Ed. 2d 396 (1977) and Hazelwood. While designed merely to provide a \"sensible, orderly way to evaluate the evidence,\" Furnco Construction Corp. v. Waters, 438 U.S. 567, 577, 98 S. Ct. 2943, 2949, 57 L. Ed. 2d 957 (1978), and not intended as an inflexible, rigid framework for all cases, id. at 575, 577, 98 S. Ct. at 2948-49, the basic design of this proof scheme is perfectly and appropriately adaptable to the evidence presented in the instant case.\n\nIn the type case we consider, the ultimate issue is whether an employer regularly and purposefully treats or has treated blacks less favorably than whites and whether this disparate treatment is racially motivated. Teamsters, 431 U.S. at 335, 97 S. Ct. at 1854. The EEOC of course bears the initial burden of making out a prima facie case of discrimination. This prima facie showing may in a proper case be made out by statistics alone, Teamsters, 431 U.S. at 339, 97 S. Ct. at 1856; Hazelwood, 433 U.S. at 307-08, 97 S. Ct. at 2741-42; Barnett v. W. T. Grant Co., 518 F.2d 543, 549 (4th Cir. 1975), or by a cumulation of evidence, including statistics, patterns, practices, general policies, or specific instances of discrimination. See Barnett v. W. T. Grant Co., 518 F.2d at 549; Brown v. Gaston County Dyeing Machine Co., 457 F.2d 1377, 1382 (4th Cir. 1972). If the prima facie case is established by the EEOC's statistical evidence, the employer may nevertheless rebut it, dispelling the inference of a general policy of discrimination, by \"demonstrating that the Government's proof is either inaccurate or insignificant.\" Teamsters, 431 U.S. at 360, 97 S. Ct. at 1867. One way that static work force statistics revealing gross disparities can be shown nevertheless to be \"insignificant\" is by showing that the disparities are mainly attributable to pre-Act rather than to post-Act employment actions. This may be done in two basic ways: by focusing on the static work force statistics and purging them of all pre-Act employment actions so that only post-Act actions remain for assessment; or, more commonly, by focusing on post-Act employment decisions, and showing either that considered alone, they affirmatively reveal nondiscrimination in the post-Act period or that they are insufficient in number to support an ultimate conclusion of a post-Act discriminatory pattern or practice.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e Hazelwood, 433 U.S. at 309, 313, 97 S. Ct. at 2742, 2744.\n\nIn the instant case, the EEOC sought within this scheme of proof to make out a prima facie case by a combination of static work force statistical evidence covering the charge period, evidence of specific hiring practices followed by ANB during that period, and evidence of specific instances of individual discriminatory actions during the period. In attempted rebuttal of the statistical evidence, ANB sought to establish its \"insignificance,\" rather than its \"inaccuracy\" in any computational or objective fact sense. Its chosen means of showing probative insignificance was two-fold: by subjecting it to a standard deviation analysis, to reveal its weakness as proof of a regular operating policy of purposeful discrimination; and by showing, through applicant flow statistical data, that its post-Act decisions were manifestly nondiscriminatory when considered in relation to its hiring opportunities during that period, particularly when subjected to a standard deviation analysis.\n\nIt is with respect to the evidence offered by the parties to support these positions that the district judge committed the specific legal errors of analysis that we now address.\n\nFirst off, the court's analysis reveals a basic misapprehension of the relationship between statistical and nonstatistical evidence offered to establish a prima facie case, of the relationship between these and evidence tending to rebut any prima facie case established, and of the appropriate mode of analysis under the disparate treatment proof scheme. This appears in the following way.\n\nAlthough the court concluded that the EEOC had proved a prima facie case of a pattern of racial discrimination in hiring by ANB between 1969 and 1975, 21 F.E.P. Cases at 1552, it then found that \"(t)he available hiring statistics, (a standard deviation) analysis, the evidence concerning the hiring practices of defendant, and the 31 cases of unsuccessful black applicants who testified at trial substantially outweigh and refute the EEOC's statistical evidence.\" 21 F.E.P. Cases at 1584. At this point the court moved on to an independent evaluation of the EEOC's nonstatistical evidence, finding no suggestion of discrimination in either the hiring practices or in the individual claims of discrimination. In this manner the EEOC's nonstatistical and statistical evidence were required independently to show discrimination sufficient to establish a prima facie case.\n\nWhile, as indicated, the suggested disparate treatment proof scheme is not ironclad and rigid, the mode of analysis used by the district court so completely skews its substantive underpinnings that the resulting conclusion of a failure of proof is simply not supportable. Under a proper analysis, all of the evidence, statistical and nonstatistical, tending to establish a prima facie case should first have been assessed on a cumulative basis. If that assessment showed a prima facie case made out, inquiry should then have turned to whether, by any of the suggested means, the prima facie case the inference of discrimination had been effectively dispelled. Under such an analysis, and with the statistical data correctly assessed, we conclude, for reasons that follow, that on the evidence before the district court, the EEOC with one exception did prove a pattern or practice of discrimination in the respects charged.\n\nA.\n\nWe commence in agreement with the district court's specific conclusion that looking alone to the EEOC's static work force statistics,\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e a prima facie case of discriminatory hiring patterns or practices was made out. As frequently observed by the Supreme Court, and as recognized by the district court, gross statistical disparities in the static work force during the relevant period may alone constitute prima facie proof of the discriminatory practice. Hazelwood, 433 U.S. at 307-08, 97 S. Ct. at 2741-42; see Teamsters, 431 U.S. at 335 n.15, 339 n.20, 97 S. Ct. at 1854 n.15, 1856 n.20; Arlington Heights v. Metropolitan Housing Development Corp., 429 U.S. 252, 265-66, 97 S. Ct. 555, 563, 50 L. Ed. 2d 450 (1976). The evidence supporting this fundamental, threshold conclusion by the district court bears emphasis at this point in view of that court's subsequent conclusion that its inferential force was completely dispelled by other evidence.\n\nThe statistical data in respect of officers and managers, using qualified labor pool figures,\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e showed that in Suffolk there were no black officials or managers during any of the years in question,\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e while the available work force was 8.0-10.9% black. In the office and clerical workers category, during three of the charge years (1969, 1974, 1975) there were no blacks employed in Suffolk in these categories. In two years (1970, 1973), there was one black, and in two years (1971, 1972) there were two. When two blacks were employed, the percentage (10.0-11.1%) is equivalent to the percentage of blacks available in Suffolk (10.3%) but far short of the percentage in Nansemond County (22.5%). Further, for five of seven years, 100% of the service workers in Suffolk were black, compared with 44.8-58.1% in the available work force.\n\nThe Portsmouth figures are equally compelling. For four of seven years there were no black officials and managers; for the remaining three years there was one black employed in that category (2.7-2.8%). The percentage of blacks in the available work force was 4.8-6.9%. In the office and clerical workers category, the percentage of blacks ranged from 0.0-6.5% for six of the years, with a high of 9.3% in 1975, while the available work force was 13.9-21.5% black. As in Suffolk, the service workers were 80.0-100.0% black while the available work force was only 45.3-59.2% black.\n\nThese statistical disparities are substantial, in some cases reaching the \"inexorable zero\" point. Teamsters, 431 U.S. at 342 n.23, 97 S. Ct. at 1858 n.23. They show that blacks were consistently underrepresented in the office and clerical categories in branches in both cities and unrepresented in the officials and managers categories in Suffolk for all years and Portsmouth for four of seven years. The district court's conclusion that, considered alone, they establish a prima facie case is firmly supported by the record.\n\nWe turn now in detail to the process of analysis by which, starting from this point, the district court ultimately determined that this prima facie statistical case was defeated. One neutralizing factor for the district court was the perceived effect of a standard deviation analysis\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e upon this static work force statistical data. In the officer/manager category the court found that the standard deviations always remained less than two, and in the office and clerical employees category, the standard deviations were always less than three for Suffolk and almost always more than three for Portsmouth. This analysis, according to the district court, neutralized the prima facie statistical case in all but the office and clerical workers category for Portsmouth.\n\nWe disagree with this conclusion derived by the district court from its standard deviation analysis for reasons that we think important to spell out. The conclusion was based upon an apparent assumption that if standard deviations reflected in static work force statistics were not \"more than two or three\" the disparities were necessarily shown to be statistically insignificant. 21 F.E.P. Cases at 1558-59. This assumption is simply incorrect for reasons we think it important to develop in order to guard against misuse of this method of analyzing statistical proof and to emphasize its limitations when used by courts in this type case.\n\nThe district court's assumption was presumably drawn from general observations made by the Supreme Court in the course of footnote discussions of standard deviation analysis as a means of testing statistical proof in Castaneda v. Partida, 430 U.S. 482, 496 n.17, 97 S. Ct. 1272, 1281 n.17, 51 L. Ed. 2d 498 (1977) and again in Hazelwood, 433 U.S. at 311 n.17, 97 S. Ct. at 2743 n.17. As briefly explained and applied in those opinions, standard deviation analysis may perform some legitimate service for courts in assessing the statistical significance of data offered to establish (Castaneda ) or rebut (Hazelwood ) a charge of discrimination in composing juries (Castaneda ) or work forces (Hazelwood ). Simply put, it tests the hypothesis that underrepresentation of a protected minority group in any sample made up of a protected and a nonprotected group (binomial distribution) might be attributable to normal fluctuations of chance rather than to discriminatory design. The \"standard deviation\" is the measure of the predictable fluctuation in a random selection process. The difference between actual (\"observed\") numbers of the protected group in such a sample and the number that would be \"expected\" in a perfectly proportional process of selection from the appropriate pool can then be expressed in numbers of standard deviations. In turn, standard deviations can be expressed in terms of the mathematical probability that chance is the cause of the disparities (differences between \"observed numbers and expected values\") measured. As standard deviations increase numerically, the probability of chance as the cause of revealed underrepresentation of course diminishes. To the extent the probability of chance is shown to be quite small, the legal inference of discrimination based upon a rough legal assessment that disparities are manifestly \"gross\" or \"substantial\" is thus \"scientifically\" confirmed.\n\nIt was against this general background that the Supreme Court in Castaneda noted that \"as a general rule ...., if the difference between the expected value and the observed number is greater than two or three standard deviations, then the hypothesis that the (selection process) was random would be suspect to a social scientist.\" 430 U.S. at 497 n.17, 97 S. Ct. at 1281 n.17. The Court then pointed out that the standard deviations revealed in the data before it were so far beyond this \"suspect\" range 29 for one sample, 12 for another that the probability of chance as the explanation was simply infinitesimal: in the convenient mathematical short-forms 1 in 10 140 and 1 in 10 25, respectively. In this context, it is obvious that the Court was merely emphasizing the lack of any theoretical possibility that chance rather than discriminatory design underlay the underrepresentation it was considering.\n\nIf a legal rule of analysis can properly be derived from the Castaneda footnote, it can only be that standard deviations greater than two or three necessarily exclude chance as a cause of underrepresentation. The converse of this that standard deviations of not \"more than two or three\" necessarily exclude discriminatory design as the cause is nowhere implied. Nor could it be, as we shall now attempt to show.\n\nThe Castaneda Court had no need to explore the levels of probability that exist in the range of \"two or three\" standard deviations, being content to note that beyond this range social scientists would find \"suspect\" for scientific purposes the hypothesis of random choice. When this range is explored, however, it appears that well short of three standard deviations the probability levels for chance as explanation have already dropped far below the point at which courts of law concerned with proof by the \"greater weight\" or \"preponderance\" of the evidence would presumably have discarded the hypothesis of chance. Just short of two standard deviations specifically at 1.96 the probability of chance is only 5 in 100; at just over two and one half, it is only 1 in 100; by three it is less than 1 in 100. W. Hays \u0026 R. Winkler, Statistics: Probability, Inference and Decision 218-19, 381-82 (1971). For this reason, authority can be found for the proposition that most social scientists, applying laboratory rigor to rule out chance as even a theoretical possibility rather than the law's rougher gauge of the \"preponderance of the evidence,\" are prepared to discard chance as an hypothesis when its probability level is no more than 5%, i. e. at approximately two standard deviations. Id. at 394.\n\nFrom all this we conclude that courts of law should be extremely cautious in drawing any conclusions from standard deviations in the range of one to three. Above this range, with standard deviations of more than three, the analysis may perhaps safely be used absolutely to exclude chance as a hypothesis, hence absolutely to confirm the legitimacy of an inference of discrimination based upon judicial appraisals that disparities are, to the legally trained eye, \"gross.\" This we conclude is all that the Supreme Court has ever directly approved by its own use of the process.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Within the range of one to three standard deviations, where the probability of chance as explanation for revealed underrepresentation declines precipitately from only 5% at two standard deviations to less than 1% at three, we do not see how a court can properly find the only other hypothesis discrimination dispelled by this analysis alone. On this basis, we conclude that the district court's analysis revealing standard deviations which, as applied to the aggregate of years and work categories involved, lay preponderately within or above this range, could not properly be taken as dispelling the inference of discrimination based upon the disparities in the static work force data. To the extent this was the basis of the district court's finding, we conclude that it was clearly erroneous.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nB.\n\nWe turn now to the district court's assessment of the defendant's applicant flow data\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e offered to rebut the prima facie case of discrimination made out by the static work force statistics. ANB contends that it does so in two approved ways: first, by affirmatively showing that ANB's hiring decisions during the charge periods were not discriminatory; alternatively by demonstrating that the total number of hiring decisions during the period were so few in total number that, without regard to their substance, they could not support any conclusion of a discriminatory pattern or practice underlying them. As earlier noted in this opinion, both of these avenues of rebuttal are open to an employer, and the district court apparently relied upon them as alternative grounds in concluding that the prima facie case had been rebutted. See note 6 supra.\n\nWe address these in reverse order, looking first to the conclusion that the number of hiring decisions was insufficient to support a conclusion of discrimination in their making. Because the prima facie statistical proof of discrimination was keyed to different employment categories based upon qualifications, hence involved different labor pools for base data, analysis of the sufficiency of rebuttal proof in these two respects must similarly be separately assessed.\n\nANB's rebuttal applicant flow evidence showed that in Suffolk ANB hired 35 clerical employees and 2 managers over the seven year period 1969-1975, while in Portsmouth during the single year 1975 it hired a total of 23 clerical employees and 2 managers. 21 F.E.P. Cases at 1556 n.51. These are, in absolute terms, concededly small samples from which to attempt straight comparisons with applicant pools or general labor pools as sources of base data. Samples too small are suspect as a basis upon which to infer any pattern of discrimination in making employment decisions. See Mayor of Philadelphia v. Educational Equality League, 415 U.S. 605, 620, 94 S. Ct. 1323, 1333, 39 L. Ed. 2d 630 (1974). But, aside from the Supreme Court's general observation in Mayor of Philadelphia that on the very special facts there presented \"the District Court's concern for the smallness of the sample presented by the 13-member Panel was also well founded,\" id. at 621, we have no guidance as to how small is too small other than our own best judgment.\n\nThere are two conflicting considerations to be kept in mind in exercising that judgment. The danger of unfairness to the employer in resting inferences of discriminatory employment practices on proof involving small total members of employment decisions is obvious. But there is the countervailing consideration that, given the difficulties of proving discriminatory motive under any circumstances, see Brown v. Gaston County Dyeing Machine Co., 457 F.2d 1377, 1382 (4th Cir. 1972); United States v. Jacksonville Terminal Co., 451 F.2d 418, 442 (5th Cir. 1971), a too ready rejection of claims solely on this account practically precludes proof of discrimination in circumstances involving local employers with relatively small total work forces. Courts have simply to balance the two with an eye to protecting against purely speculative findings of discrimination while not cutting off the claims of some employees simply because of the small overall size of the work forces in which they happen to be employed. See Chicano Police Officer's Ass'n v. Stover, 526 F.2d 431, 439 (10th Cir. 1975). This difficult balancing problem is made even more difficult where, as here, the charged discrimination runs to several categories of differently qualified employees so that, under developed doctrine, proof must be assessed separately as to each. In this situation we think it is entirely proper in gauging the danger of unfair inferences from small numbers in respect of one category to take into account for this limited purpose any patterns inferable from the total range of hiring decisions affecting all categories during a charged period of discrimination.\n\nGuided by these general considerations, we cannot find error in the district court's conclusion that the total number of hiring decisions affecting managers in the Suffolk branches on ANB's undisputed evidence but two over a seven year period was too small fairly to support any inference of a discriminatory pattern of hiring. On this basis we agree that the prima facie case was rebutted with respect to this category of employee notwithstanding the proof pro and con with respect to other categories.\n\nWith respect to the numbers of decisions affecting both managers and office/clerical employees in the Portsmouth branches, we find error in the district court's apparent conclusion that those numbers were also insufficient for inferential purposes. They were limited in ANB's proof to those for just one year, 1975. For reasons more fully developed in our later discussion of the sufficiency of the applicant flow data affirmatively to rebut the prima facie case, we do not consider this omission of proof running to the whole record excusable on ANB's part. Accordingly, we conclude that as to these categories, the prima facie statistical case is not rebutted by this obviously incomplete showing of the total number of hiring decisions made over the charged period.\n\nWith respect to the number of hiring decisions affecting office/clerical positions in Suffolk over the charged period thirty-five on ANB's proof we think it quite sufficient as a basis for inferring the pattern of discrimination prima facie established. Accordingly, we find error in the district court's contrary conclusion as to this category.\n\nMore fundamentally, the district court concluded that ANB's applicant flow data in any event sufficed affirmatively to rebut the statistically based prima facie case by showing that its hiring decisions during the charge period were not discriminatorily motivated. Hazelwood has of course established that a prima facie statistical case can be so rebutted. 433 U.S. at 313, 97 S. Ct. at 2744. Because employment discrimination was not illegal under Title VII until 1965, \"(an) employer who from that date forward made all its employment decisions in a wholly nondiscriminatory way would not violate Title VII even if it had formerly maintained an all-white work force by purposefully excluding Negroes.\" Id. at 309, 97 S. Ct. at 2742. Applicant flow data obviously is adaptable to that end. To be considered for this purpose, however, the particular data offered must be \"sufficiently reliable ... to permit consideration of (an employer's) argument that those data may undercut a statistical analysis dependent upon hirings alone.\" Id. at 313 n.21, 97 S. Ct. at 2744 n.21.\n\nOver the EEOC's objections the district court found ANB's applicant flow data sufficiently reliable to consider in rebuttal of the work force statistics. When the court then assessed the data it concluded that because it did not give rise to an inference of discrimination, it sufficed to rebut the prima facie case made out by the static work force statistics. 21 F.E.P. Cases at 1555-56. We think the district court erred in its conclusion that the data was sufficiently reliable to be considered as rebutting evidence. Its reliability is suspect on three separate bases which in conjunction undercut its probative force for the intended purpose.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nFirst, the applicant flow data for the Portsmouth branches is limited to only one of the charged years, 1975. Applicant flow data limited to one out of seven relevant years cannot be held to rebut a prima facie case based upon gross disparities revealed in static work force statistics over the period. It simply has not that probative force. The district court recognized its unreliability because of incompleteness, but excused the incompleteness because of what it considered the EEOC's bad faith in failing to notify ANB until commencing action that the Portsmouth branches were to be included in the charges.\n\nIn consequence ANB had destroyed its pre-1975 records for Portsmouth, a decision which the district court concluded was reasonable and which accordingly should not be allowed to prejudice ANB in presenting its rebuttal evidence. We find nothing in Title VII, EEOC regulations, or Supreme Court interpretations of Title VII that would operate to relieve employers of the normal consequences of such a deficiency of proof.\n\nThe district court found sufficient excuse by negative implication from the EEOC's requirement that all applications for employment be routinely preserved for six months, and that after a charge has been filed all relevant records be maintained until final disposition. 29 C.F.R. ยง 1602.14(a) (1976). From this the court concluded that ANB was reasonably entitled to decide, after the reasonable cause determination which did not include Portsmouth had been made, that preservation of relevant application forms for those branches were not necessary. 21 F.E.P. Cases at 1555.\n\nLeaving aside all questions of the reasonableness of such a business decision, we disagree with the consequence given it by the district court. The affirmative obligation imposed by ยง 1602.14(a) to preserve records was clearly designed to protect Title VII plaintiffs from an employer's destruction of possibly damaging evidence. This being its purpose, it cannot sensibly be interpreted as being intended also to protect employers against the consequences of their voluntary destruction of such records just because the affirmative obligation to preserve them has expired. So to interpret it would license a self-serving destruction of records by avoiding the normal factual inference of self-serving that arises from the destruction of evidence. This we think could not accord with the broad remedial purposes of Title VII. See EEOC v. Cook Paint \u0026 Varnish Co., 24 F.E.P. Cases 51, 55 (W.D.Mo.1980). Employers have been on notice since the earliest days of Title VII's enforcement of the critical importance of the maintenance of employment records going back at least to the effective date of the Title. In consequence, holding this employer to the normal litigation consequences of a failure to maintain relevant employment records imposes no higher standard than that dictated by sound business judgment in respect of the maintenance of all business records having potential relevance in any of the litigation patterns to which businesses stand constantly exposed.\n\nNext, the data's reliability is open to serious question because it apparently reflected less than half the EEOC contended only 46% of the actual applicants from 1969-1975. The district court dismissed the EEOC's contention of its unreliability on this score, finding that the contention was based upon a confused reference to the proportion of the available applications requested by the EEOC during discovery. 21 F.E.P. Cases at 1554. Whether or not the EEOC confused its references, it seems highly unlikely on the record we review that this data represents substantially all the applicant flow data for the years in question. As the district court noted, the total number of applications reflected in the data offered the court varied widely from year to year, from a low of sixteen in 1972 to a high of ninety-seven in 1974. Id. at 1554 n.42.\n\nFinally, the data considered by the district court included service workers.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e Because 100% of the service workers hired in both Suffolk and Portsmouth were black, including them distorted the picture of minority hiring in the contested categories. If we limit the applicant flow data to office/clerical workers categories, purging the data, as offered, of all officials/managers and service worker hires,\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e it completely fails to dispel the inference of discrimination found by the district court to have been created by the EEOC's statistical proof. In Suffolk, ANB never hired more than one black clerical worker at a time in some years none. The Suffolk samples for each year are concededly small, but the overall results simply confirm rather than dispel the prima facie case based upon static work force statistics: over these years, during which blacks made up 24.8% of the qualified applicant pool, only 14.2% of those hired in these categories were black. In Portsmouth the limited data for 1975, purged of service workers, not only fails to dispel the prima facie case but reinforces it. ANB's seven Portsmouth branches in 1975 hired one black clerical worker 4.3% of its hires out of an applicant pool 23.1% black.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nWe conclude, with respect to the Office/Clerical category in Suffolk and Office/Clerical and Officials/Managers categories in Portsmouth, that the district court erred in ascribing to the defendant's applicant flow data the neutralizing effect reflected in that court's decision. At this stage in its analysis, the district court should instead have concluded, as we now do, that the prima facie case of discrimination for those categories made out on the static work force statistics had not been rebutted by this data.\n\nC.\n\nWe turn next to the way in which the district court assessed the EEOC's nonstatistical evidence of specific hiring practices. Specifically the EEOC alleged and introduced evidence to prove that between 1969 and 1975 ANB failed to use objective, job related standards, used inconsistent standards and perpetuated the predominantly white work force through a preference for friends and relatives of employees and word-of-mouth recruiting (including walk-in hiring), and by maintaining an all-white interviewer staff.\n\nThe district court concluded that all these practices, individually and collectively assessed, were lawful and created no inference of discrimination.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e Specifically, the court concluded that hiring was not conducted primarily through \"word of mouth recruiting\"; that there was no preference for friends or relatives of employees; that most of the hiring standards used, though unwritten, were sufficiently specific and objective, and were consistently applied; that the subjective evaluations of attractiveness, neatness, maturity and personality, and ability to communicate were justified by legitimate and important business considerations and applied in a nondiscriminatory way; and that the use of an all-white interviewing staff had no discriminatory effects. From this the court concluded that the hiring practices evidence actually operated with the applicant flow data and the standard deviation analysis to undercut the statistically based prima facie case, rather than to corroborate or bolster it as intended by the EEOC. In this conclusion we find error of law.\n\nWhile we are not prepared to say that attempted proof of this sort may never, by reason of its intrinsic weakness, have such a negative effect upon a prima facie statistical case, this evidence could not properly be given such an effect. The district court's legal analysis leading to its contrary conclusion is flawed in two ways.\n\nFirst, it failed to assess the evidence in the light of, and colored by, the gross underrepresentation of blacks in ANB's work force already statistically demonstrated to the district court's satisfaction. This was at odds with the teaching of such cases as Barnett v. W.T. Grant Co., 518 F.2d 543 (4th Cir. 1975) and Rock v. Norfolk \u0026 Western Ry., 473 F.2d 1344 (4th Cir. 1973), that where such an imbalance in the work force has been statistically shown, the uses of particular hiring practices are then to be assessed for their tendency to perpetuate that imbalance, an assessment in which they may properly be found to be \"badges of discrimination that serve to corroborate, not to rebut, the racial bias pictured by the statistical pattern of the ... work force.\" Brown v. Gaston County Dyeing Machine Co., 457 F.2d 1377, 1383 (4th Cir. 1972). Here, rather than analyzing the hiring practices on a basis which assessed their tendency to perpetuate an existing condition of underrepresentation, the district court approached them as if no such imbalance existed. Inquiry was confined to specific practices isolated from any inferences of discrimination already established. It was, in effect, as if the EEOC had sought to base its case solely upon the nonstatistical evidence related to hiring practices. The resulting analysis failed properly to take into account the backdrop of existing imbalance against which the practices were carried out and in consequence misapplied controlling legal principles to the evidence.\n\nThis general approach obviously colored the district court's overall analysis of the specific hiring practices challenged by the EEOC. In addition, we think the assessment of certain of the specific practices was further tainted by faulty analysis of the evidence addressed to those practices. To show why, we briefly summarize the pertinent evidence and the district court's assessment.\n\nThe uncontradicted evidence showed that ANB relied almost exclusively upon walk-ins as a primary source of new employees, never advertising a vacancy unless it had exhausted the file without filling the position. Applicants were required to list on their applications friends or relatives employed by the bank. Thirty-two of sixty-five applicants hired in Suffolk from 1969-1975 and in Portsmouth in 1975-49.2% had listed friends or relatives on their applications. Further, the applicants were screened and interviewed by an all-white interviewer staff whose evaluations of their attractiveness and neatness were very important factors in hiring. The EEOC contended that this evidence was probative of one of the traditional \"badges of discrimination\": word-of-mouth recruiting rather than general advertising through established public channels to fill vacancies. Specifically, this was said to be established as the standard hiring practice by the facts that (1) friends and relatives of employees were demonstrably preferred, (2) vacancies were not advertised until after on-file applications were depleted, and (3) no notices of vacancies were posted to employees. The court essentially rejected this evidence as having no probative force. It did not show that word-of-mouth was the primary hiring technique of the defendant because (1) there was no preference for friends or relatives; (2) ANB \"did attempt to \"advertise' itself to qualified minorities outside its work force\";\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e (3) the screening process was not \"tainted with discriminatory intent (nor did it operate) (through word-of-mouth recruitment or preference for friends or relatives of employees, for example) to perpetuate minority representation\"; and (4) the failure to post notices to its employees was not a violation of Title VII because the evidence of discrimination was at best inconclusive. 21 F.E.P. Cases at 1566.\n\nThe court's finding that there was no preference for friends and relatives was crucial to the conclusion that word-of-mouth recruiting was not shown to be the primary means for filling vacancies. The evidence showed that thirty-two of the sixty-five hires 49.2% at Suffolk in 1969-1975 and Portsmouth in 1975 had listed friends or relatives on their applications. From this the court concluded that \"if anything, the ... statistics show(ed) that the listing of friends and relatives was a minor factor; a majority of the hires had no \"contacts' working for defendants.\" Id. at 1565.\n\nWithout ascribing controlling significance to this particular factor in the overall assessment of ANB's hiring practices, we observe that if anything, this data implies that the listing of friends and relatives did indeed tend to perpetuate the underrepresentation of blacks in non-service jobs and their concentration in service jobs.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e Whether this practice was a major factor in hiring or not, its unmistakable tendency to perpetuate the existing racial imbalance in the work force could not properly be dismissed as of no consequence.\n\nIn similar fashion, the district court essentially rejected out of hand any significance for the fact that throughout the charged period, ANB used an all-white interviewing staff. We cannot quarrel with the court's related conclusions that the criteria used for selection were for the most part objective and consistently applied, and that the subjective evaluations of attractiveness and neatness were business-justified. Furthermore, it is clear that the use of an all-white interviewing staff standing alone could not support a determination of liability. Nevertheless, it was error to reject as having no probative force on the issue of discriminatory hiring practices the fact that in a racially imbalanced setting, the staff charged with the duty of evaluating personal characteristics of job applicants was maintained all-white throughout the charged period. See Fisher v. Procter \u0026 Gamble Manufacturing Co., 613 F.2d 527, 545-46 (5th Cir. 1980); Domingo v. New England Fish Co., 445 F. Supp. 421, 16 E.P.D. P 8207 at 5070, 5080 (W.D.Wash.1977).\n\nIn summary, on this aspect of the case we conclude that, rightly assessed, the EEOC's evidence of word-of-mouth recruiting as the primary means used by ANB to fill vacancies, and the use of an all-white interviewing staff to make its subjective hiring evaluations tended to corroborate to some degree at least the prima facie showing of discrimination made by the static work force statistics. The district court's apparent conclusion that it had no such probative force or that its lack of force tended indeed to rebut the prima facie statistical showing reveals a misapprehension or misapplication of controlling principles of law.\n\nD.\n\nWe now briefly consider the district court's analysis of the EEOC's evidence of individual instances of discrimination. As earlier indicated, 31 of 52 black persons identified by the EEOC as victims of individual acts of discrimination in hiring gave testimony, and the district court found on the evidence presented that none was a specific victim of discrimination. In consequence, as with the hiring practice evidence, the district court dismissed this evidence as having no probative force in respect of the pattern or practice issue, or possibly treated it as having a negative impact for that purpose.\n\nBecause we conclude that the EEOC's prima facie case was otherwise established and not rebutted without reference to this evidence, we find it unnecessary to review the district court's findings and conclusions which led to its out of hand rejection. We observe only that the evidence was not offered at this stage to establish entitlement to individual relief, but merely as corroborating or buttressing evidence of a general pattern of racial discrimination in hiring. Assuming for purposes of this appeal that its cumulative impact for this purpose was rightly assessed by the district court as not buttressing the EEOC's other evidence, we hold that neither could its cumulative impact be properly adjudged to rebut the EEOC's case. Given the basis of our disposition, it may simply be set aside as a neutral factor in the overall assessment of the evidence.\n\nE.\n\nLooking now to the whole body of evidence before the district court, we hold, in concluding summary, that (1) the district court correctly determined that the EEOC's static work force statistics established a prima facie case of discriminatory pattern or practice of hiring during the charged period; (2) except with respect to the Officials/Managers category in Suffolk, the district court erred as a matter of law in holding that this prima facie case was rebutted by the combined force of the standard deviation analysis applied to the static work force statistics, the applicant flow data for the charged period as tested by a standard deviation analysis, and the weakness or negative impact of the EEOC's nonstatistical evidence of hiring practices and individual instances of discrimination. Analyzed free of the identified errors of misapprehension and misapplication of controlling legal principle, we conclude that the evidence before the district court established a prima facie case based upon the statistically revealed gross disparities in the work force; that this was buttressed to some degree by evidence of hiring practices which tended to perpetuate the undisputed racial imbalance; and that this prima facie case except in one respect was never rebutted by legally sufficient evidence.\n\nAccordingly, we hold that, except in respect of the one category of officials/managers in the Suffolk branches, the total evidence established the existence of a discriminatory pattern or practice of hiring in violation of Title VII that requires remand for the determination of appropriate relief.\n\nIV\n\nUpon remand the EEOC is entitled to an injunctive decree appropriately shaped to remedy the consequences of the discriminatory hiring policy we find conclusively established upon the record, and to further proceedings in which individual persons claiming to have suffered the consequences of that pattern or practice during the charged period may have their individual claims adjudicated. In these Stage II proceedings, an individual claimant is entitled, upon proving only that he or she was a black who applied unsuccessfully for a job with the defendant during the relevant period, Sledge v. J.P. Stevens \u0026 Co., 585 F.2d 625, 637 (4th Cir. 1978), to the benefit of an inference that the decision not to hire \"was made in pursuit of that policy (of discrimination).\" Teamsters, 431 U.S. at 362, 97 S. Ct. at 1868. The burden then shifts to the employer to show \"that the individual applicant was denied an employment opportunity for lawful reasons.\" Id. This burden involves showing by a preponderance of the evidence that nondiscriminatory factors motivated the decision not to hire. Sledge v. J.P. Stevens, 585 F.2d at 637. If the defendant meets this burden, the individual claimant is then entitled to show that the \"exculpatory reason advanced by the employer is mere pretense that, for example, white persons with qualifications identical to those of the claimant or who also did not meet the prescribed qualifications were nonetheless assigned to the position sought.\" Id.\n\nAs earlier noted, the district court has made findings and conclusions in respect of some persons who may present claims in the Stage II proceedings. Those findings and conclusions, made in connection with the general issue of the existence of a discriminatory pattern or policy and under different burdens of proof, have no preclusive effect in Stage II proceedings.\n\nConsistent with the result we reach on the merits, we vacate the district court's award of attorney's fees in favor of ANB.\n\nAFFIRMED IN PART; REVERSED IN PART; AND REMANDED.\n\nAppendix A\n\nGeneral Work Force Statistics\n\nSuffolk Branches\n\nNumber and Percentage Percentage of Blacks in\n\nof Blacks Available Work Force\n\nNumber Percentage Suffolk Nansemond County\n\n1968 3 8.3 31.0 47.9\n\n1969 3 11.1 31.0 47.9\n\n1970 4 13.8 31.0 47.9\n\n1971 5 17.9 31.0 47.9\n\n1972 5 17.2 31.0 47.9\n\n1973 3 9.7 31.0 47.9\n\n1974 2 8.3 31.0 47.9\n\n1975 2 10.5 31.0 47.9\n\nPortsmouth Branches\n\nNumber and Percentage Percentage of Blacks in\n\nof Blacks Available Work Force\n\nNorfolk-\n\nNumber Percentage Portsmouth Portsmoth SMSA\n\n1968 7 5.6 36.0 25.1\n\n1969 6 4.4 36.0 25.1\n\n1970 8 5.4 36.0 25.1\n\n1971 11 7.1 36.0 25.1\n\n1972 15 8.9 36.0 25.1\n\n1973 15 9.1 36.0 25.1\n\n1974 15 8.4 36.0 25.1\n\n1975 16 10.4 36.0 25.1\n\nConsolidated Figures (Suffolk and Portsmouth Branches)\n\nNumber and Percentage Percentage of Blacks in\n\nof Blacks Available Work Force\n\nNorfolk-\n\nPortsmouth\n\nNumber Percentage Suffolk Nansemond Portsmouth SMSA\n\n1968 10 6.3 31.0 47.9 36.0 25.1\n\n1969 9 5.5 31.0 47.9 36.0 25.1\n\n1970 12 6.8 31.0 47.9 36.0 25.1\n\n1971 16 8.7 31.0 47.9 36.0 25.1\n\n1972 20 10.2 31.0 47.9 36.0 25.1\n\n1973 18 9.2 31.0 47.9 36.0 25.1\n\n1974 17 8.1 31.0 47.9 36.0 25.1\n\n1975 18 10.0 31.0 47.9 36.0 25.1\n\nAppendix B\n\nSpecial Qualification Work Force Statistics\n\nSuffolk Branches\n\nOfficials and Managers\n\nNumber and Percentage Percentage of Blacks in\n\nof Blacks Available Work Force\n\nNumber Percentage Suffolk Nansemond County\n\n1968 0 0.0 8.0 10.9\n\n1969 0 0.0 8.0 10.9\n\n1970 0 0.0 8.0 10.9\n\n1971 0 0.0 8.0 10.9\n\n1972 0 0.0 8.0 10.9\n\n1973 0 0.0 8.0 10.9\n\n1974 0 0.0 8.0 10.9\n\n1975 0 0.0 8.0 10.9\n\nOffice and Clerical Workers\n\nNumber and Percentage Percentage of Blacks in\n\nof Blacks Available Work Force\n\nNumber Percentage Suffolk Nansemond County\n\n1968 0 0.0 10.3 22.5\n\n1969 0 0.0 10.3 22.5\n\n1970 1 5.3 10.3 22.5\n\n1971 2 11.1 10.3 22.5\n\n1972 2 10.0 10.3 22.5\n\n1973 1 4.8 10.3 22.5\n\n1974 0 0.0 10.3 22.5\n\n1975 0 0.0 10.3 22.5\n\nService Workers\n\nNumber and Percentage Percentage of Blacks in\n\nof Blacks Available Work Force\n\nNumber Percentage Suffolk Nansemond County\n\n1968 3 100.0 44.8 58.1\n\n1969 3 75.0 44.8 58.1\n\n1970 3 75.0 44.8 58.1\n\n1971 3 75.0 44.8 58.1\n\n1972 3 100.0 44.8 58.1\n\n1973 2 100.0 44.8 58.1\n\n1974 2 100.0 44.8 58.1\n\n1975 2 100.0 44.8 58.1\n\nPortsmouth Branches\n\nOfficials and Managers\n\nNumber and Percentage Percentage of Blacks in\n\nof Blacks Available Work Force\n\nNorfolk-\n\nNumber Percentage Porsmouth Portsmouth SMSA\n\n1968 0 0.0 6.9 4.8\n\n1969 0 0.0 6.9 4.8\n\n1970 0 0.0 6.9 4.8\n\n1971 0 0.0 6.9 4.8\n\n1972 0 0.0 6.9 4.8\n\n1973 1 2.8 6.9 4.8\n\n1974 1 2.8 6.9 4.8\n\n1975 1 2.7 6.9 4.8\n\nOffice and Clerical Workers\n\nNumber and Percentage Percentage of Blacks in\n\nof Blacks Available Work Force\n\nNorfolk-\n\nNumber Percentage Portsmouth Portsmouth SMSA\n\n1968 1 1.1 21.5 13.9\n\n1969 0 0.0 21.5 13.9\n\n1970 3 3.2 21.5 13.9\n\n1971 5 4.9 21.5 13.9\n\n1972 8 6.5 21.5 13.9\n\n1973 7 5.9 21.5 13.9\n\n1974 7 5.3 21.5 13.9\n\n1975 10 9.3 21.5 13.9\n\nService Workers\n\nNumber and Percentage Percentage of Blacks in\n\nof Blacks Available Work Force\n\nNorfolk-\n\nNumber Percentage Portsmouth Portsmouth SMSA\n\n1968 6 85.7 59.2 45.3\n\n1969 6 100.0 59.2 45.3\n\n1970 4 80.0 59.2 45.3\n\n1971 5 83.3 59.2 45.3\n\n1972 7 87.5 59.2 45.3\n\n1973 7 87.5 59.2 45.3\n\n1974 7 87.5 59.2 45.3\n\n1975 5 83.3 59.2 45.3\n\nCombined Figures (Suffolk and Portsmouth Branches)\n\nOfficials and Managers\n\nNumber and Percentage Percentage of Blacks in\n\nof Blacks Available Work Force\n\nNorfolk-\n\nPortsmouth\n\nNumber Percentage Suffolk Nansemond Portsmouth SMSA\n\n1968 0 0.0 8.0 10.9 6.9 4.8\n\n1969 0 0.0 8.0 10.9 6.9 4.8\n\n1970 0 0.0 8.0 10.9 6.9 4.8\n\n1971 0 0.0 8.0 10.9 6.9 4.8\n\n1972 0 0.0 8.0 10.9 6.9 4.8\n\n1973 1 2.3 8.0 10.9 6.9 4.8\n\n1974 1 2.4 8.0 10.9 6.9 4.8\n\n1975 1 2.3 8.0 10.9 6.9 4.8\n\nOffice and Clerical\n\nNumber and Percentage Percentage of Blacks in\n\nof Blacks Available Work Force\n\nNorfolk-\n\nPortsmouth\n\nNumber Percentage Suffolk Nansemond Portsmouth SMSA\n\n1968 1 0.8 10.3 22.5 21.5 13.9\n\n1969 0 0.0 10.3 22.5 21.5 13.9\n\n1970 4 3.5 10.3 22.5 21.5 13.9\n\n1971 7 5.8 10.3 22.5 21.5 13.9\n\n1972 10 7.0 10.3 22.5 21.5 13.9\n\n1973 8 5.8 10.3 22.5 21.5 13.9\n\n1974 7 4.5 10.3 22.5 21.5 13.9\n\n1975 10 7.9 10.3 22.5 21.5 13.9\n\nService Workers\n\nNumber and Percentage Percentage of Blacks in\n\nof Blacks Available Work Force\n\nNorfolk-\n\nPortsmouth\n\nNumber Percentage Suffolk Nansemond Portsmouth SMSA\n\n1968 9 90.0 44.8 58.1 59.2 45.3\n\n1969 9 90.0 44.8 58.1 59.2 45.3\n\n1970 7 77.8 44.8 58.1 59.2 45.3\n\n1971 8 80.0 44.8 58.1 59.2 45.3\n\n1972 10 91.0 44.8 58.1 59.2 45.3\n\n1973 9 90.0 44.8 58.1 59.2 45.3\n\n1974 9 90.0 44.8 58.1 59.2 45.3\n\n1975 7 87.5 44.8 58.1 59.2 45.3\n\nAppendix C\n\nApplicant Flow Data\n\nSuffolk Branches\n\nNumber of Applicantions Number of Hires\n\nWhite Black White Black\n\n1969 23 7 5 1\n\n1970 41 6 3 0\n\n1971 59 20 1 1\n\n1972 11 5 4 2\n\n1973 60 19 7 0\n\n1974 62 35 6 1\n\n1975 40 7 6 2\n\nTotal 296 99 32 7\n\nThese figures translate into the following percentages:\n\nPercentage of\n\nPercentage of Applications Hires\n\nWhite Black White Black\n\n1969 76.7 23.3 83.3 16.7\n\n1970 87.2 12.8 100.0 0.0\n\n1971 74.7 25.3 50.0 50.0\n\n1972 68.7 35.1 66.7 33.3\n\n1973 75.9 24.1 100.0 0.0\n\n1974 63.9 36.1 85.7 14.3\n\n1975 85.1 14.9 75.0 25.0\n\nTotal 74.9 25.1 82.1 17.9\n\nPortsmouth Branches\n\nNumber of Applications Number of Hires\n\nWhite Black White Black\n\n1969 (not available) (Not available)\n\n1970 (not available) (Not available)\n\n1971 (not available) (Not available)\n\n1972 (not available) (Not available)\n\n1973 (not available) 55 11\n\n1974 (not available) 65 12\n\n1975 379 115 24 3\n\nThese figures translate to the following percentages:\n\nPercentage of\n\nPercentage of Applications Hires\n\nWhite Black White Black\n\n1969 (not available) (not available)\n\n1970 (not available) (not available)\n\n1971 (not available) (not available)\n\n1972 (not available) (not available)\n\n1973 (not available) 83.3 16.7\n\n1974 (not available) 84.4 15.6\n\n1975 76.7 23.3 88.9 11.1\n\nDONALD RUSSELL, Circuit Judge, dissenting:\n\nI dissent.\n\nMy difference with the majority opinion begins with its reversal of the district court's determination that it (the district court) was without jurisdiction in this proceeding to consider a claim of discrimination in hiring at the Portsmouth branch of the defendant Bank. The district court based its conclusion that hiring practices at the Portsmouth branch were not a proper subject of suit in this litigation because such practices had not been included in the initiating charge on which the Equal Employment Opportunity Commission (hereinafter EEOC) acted, or in the investigation conducted by the EEOC in connection with that charge, or in the reasonable cause determination of discrimination as made by the EEOC, or had been a subject of conciliation between the EEOC and the defendant.\n\nAll of the factual findings on which the district court rested this determination are clearly supported by the record. The charge of Ms. Holland filed with the EEOC in June, 1969, which provided the basis for this proceeding, related solely to a refusal of employment by officials at the Suffolk branch of the defendant. In her charge she made no reference whatsoever to the Portsmouth branch. When the EEOC undertook its investigation of the charge filed by Ms. Holland in March, 1970, it advised the defendant that it was sending its investigator to \"Suffolk\" and it requested that the \"Suffolk branch\" be informed of the impending visit of the investigator. It made no reference to any possible investigation of the Portsmouth branch or of any charges involving that branch. The investigator in the course of the investigation concerned herself solely with the Suffolk branch and its employment practices during most of the year 1969 and a few days in 1970. Later, when the reasonable cause determination, with its address of the employer given as \"Suffolk, Virginia,\" was issued, it, as the district court points out, again focused exclusively on the hiring practices of the Suffolk branch during the period \"March 1, 1969 through January 13, 1970.\" In that determination, the EEOC stated that as of May, 1969, the employees of the \"respondent\" consisted of 18 whites and no blacks in an office/clerical classification, a number which significantly was the exact number and character of employees at the Suffolk branch, as reported by the defendant for its Suffolk branch in its EEOC report of May, 1969. It also stated in its report which was dated March 11, 1974, that it had reviewed all applications for employment and that the defendant bank had \"hired seven persons, six Caucasians and one Negro. Of these seven persons, five were hired into clerical or teller positions, one Negro and four Caucasians. The Negro teller was hired in November, 1969.\" These figures are also clearly identifiable as relating to the Suffolk branch alone, and related exclusively to the period ending January 13, 1970. Moreover, in its reasonable cause determination, the EEOC stated that, during its investigation, it had represented to the defendant that any records of employment at the Portsmouth branch were \"irrelevant to employment at (the) Suffolk branch\" which was the subject of its investigation. After its reasonable cause determination, the only conciliation engaged in between the defendant and the EEOC concerned the Suffolk branch and the facts disclosed by its investigation of that branch covering the period from March 1, 1969 to January 13, 1970.\n\nIn short, from the filing of the original charge in June, 1969, up to the filing of this action by the EEOC (in default of any action by Ms. Holland ) in January, 1976, the EEOC had confined its investigations, its determinations of discrimination (dated March 11, 1974) and its conciliation efforts (held in July and August, 1974) exclusively and wholly to the employment practices of the defendant at the Suffolk branch for a period of time terminating on January 13, 1970, and, in refusing to consider any employment figures at the Portsmouth branch, had firmly rejected as \"irrelevant\" any inquiry into the defendant's employment practices at the defendant's Portsmouth branch.\n\nWhether, under the circumstances detailed, the district court's jurisdiction in this case was confined to inquiry into hiring activities of the defendant at its Suffolk branch is a question controlled by our decision in EEOC v. General Elec. Co., 532 F.2d 359 (4th Cir. 1976).\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e In that case, we said that the court's jurisdiction was not limited to the language of the charge as filed by a complaining employee or applicant but extended to such types of discrimination as were reasonably uncovered during the investigation of the charge by the EEOC, were included in the reasonable cause determination, and were the subject of conciliation between the EEOC and the employer. 532 F.2d at 372-73. We emphasized, however, that each step in this administrative procedure of (a) investigation, (b) reasonable cause determination and (c) conciliation, was an essential step under the Act and, as the majority opinion states, \"each step ... is designed to be a prerequisite to the following step and, ultimately, to suit.\"\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e And, again as the majority itself observes, this is particularly true of the conciliation step, which, in order to be effective, demands that the employer be fully notified of the violation which is the subject of conciliation.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nIf the rule enunciated in General Electric is applied in this case, it cannot be disputed that the scope of the action filed by the EEOC in this case should be restricted to the employment practices at the Suffolk branch. That was the activity covered by the charge filed by the complainant. The EEOC itself strictly confined its investigations to employment practices for the relevant time period at that branch alone. Even more significant is the fact that the EEOC refused to consider or investigate any employment practices at the Portsmouth branch. And in its reasonable cause determination, it made it crystal clear that any action at the Portsmouth branch was \"irrelevant\" to its investigation and to its reasonable cause determination. It was against this background that the EEOC filed this civil action, seven years after the charge of discrimination was filed, six years after it began its investigation of the charge, and two years after it had issued its reasonable cause determination, raising for the first time the question of discrimination at the Portsmouth branch, without a charge being filed, without an EEOC investigation, without an EEOC reasonable cause determination, and without any effort at conciliation by the EEOC of hiring practices at Portsmouth. If each step in the administrative procedure in a Title VII proceeding i. e., an EEOC investigation, an EEOC reasonable cause determination, and an effort by EEOC at conciliation, is an essential \"prerequisite ... to suit,\" as the majority opinion declares, it would seem beyond controversy that there was no authority for inclusion of the employment practices at the Portsmouth branch in the civil suit by the EEOC in this case. Moreover, apart from the constricting language of the Act itself on the proper scope of this action, it is difficult to perceive under what principle of fairness and due process the EEOC should be permitted to inject into this proceeding at this belated date a claim that it had not merely failed to raise earlier but one that it had expressly asserted both in its investigation and in its reasonable cause determination was \"irrelevant\" to its inquiry.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nThe majority opinion, though declaring unequivocally that \"we require that a particular charge of discrimination be the subject of the reasonable cause determination and conciliation before being subject to suit by the EEOC,\" proceeds to reverse the district court and to find jurisdiction in this action over hiring practices at the Portsmouth branch. It bases this ruling on the reasoning that (a) the charge filed and investigated by the EEOC in connection with the Suffolk branch involved hiring practices which, if found illegal at Suffolk, would support a like finding in connection with the Portsmouth branch, (b) \"the EEOC's investigation (in 1969-70) and attempted conciliation (in 1974) with regard to Suffolk (gave) adequate notice to the defendant of the practices under investigation and ample opportunity for conciliation concerning those practices,\" and (c) \"(h)ad the conciliation effort been successful, given the common control over the similar practices at the two cities' branches, whatever changes were to be instituted at the Suffolk branch would no doubt logically and necessarily have been made at the Portsmouth branch as well.\" I submit no one of those reasons is sound.\n\nA finding of hiring discrimination at the Suffolk branch on the evidence in this case would not necessarily establish discrimination at the Portsmouth branch. Decisions on hiring were made separately at the two branches by the interviewing officer of the respective branch. The labor market from which the two branches drew their job applicants were different and the two labor markets varied markedly in their black constituency, measured both in numbers and in qualifications. So far as the EEOC's case rests on bare statistics, a finding of discrimination at either branch would depend on a comparison of the percentage of black hirees at each branch with the percentage of qualified blacks in the applicable labor market. The percentage of hirees as well as the percentage of qualified blacks in the applicable labor market, varied substantially at the two branches. Proof that the comparison of black applicants and hirees may have been sufficient at one branch to support an assumption of discrimination, based as such assumption would be on statistical data unique to that branch, would not establish that a similar situation existed at the other branch. Thus, if the statistical comparison resulted in a standard deviation of one at Suffolk and five at Portsmouth a result that could be possible because of the differences in the labor market and perhaps a difference in the attitude of the interviewing officers it could well be that any assumption of discrimination in hiring at Suffolk could not be justified but could be justified at Portsmouth. And the EEOC, as does the majority opinion, recognized all this, for it prepared and filed for the record separate evidence and separate statistical data and reached different results in connection with the two branches. A fortiori, it would follow that, under this supposition, Portsmouth might be required to make changes but Suffolk would not. Accordingly, two of the grounds assigned by the majority for its conclusion will not stand analysis.\n\nThe third ground is equally untenable. I suggest it is inexplicable to assume that an investigation which the EEOC itself had expressly noticed the employer was absolutely limited to one branch of the employer's business and where it had represented to the employer that any discussion or investigation of employment practices at another branch (Portsmouth) of the employer was \"irrelevant\" would be effective notice to the defendant that the EEOC would years later charge that the employment practices at such other branch (Portsmouth) were included within the investigation and conciliation which never touched that branch (Portsmouth) so as to provide a basis for a later civil suit involving that other branch. Such a doctrine, if accepted, would make meaningless and unimportant the statutory provision for a reasonable cause determination finding and an offer of conciliation by the EEOC as conditions to a right of suit as well as all the other procedural steps mandated by the statute as a \"prerequisite\" to suit. So long as the EEOC had met the prerequisites for suit on a charge involving one branch of an employer's business, it could, under the principle stated in the majority opinion, include at its whim in its suit, filed years later, charges of discrimination at all the branches of the employer even though the hiring practices at these other branches had never been investigated, had never been the subject of a reasonable cause determination, and had never been the subject of an offer of conciliation. Such a rule, if adopted, would mean that the new rule had washed out the step-by-step procedure so carefully laid down by Congress in the Act for the institution of a suit under Title VII. I am unwilling to participate in such guillotining of the Congressionally mandated procedure, under a novel exception which would enable the EEOC to broaden almost at will a charge at one plant of an employer made in 1969, into a charge against all plants of the employer, made for the first time in 1976, even though the employer was never notified of such broadening of the charge or given any opportunity of conciliation on the broadened charge. The reasons assigned by the majority for including the Portsmouth branch, I respectfully suggest, are unsupportable.\n\nThe majority would find support for its conclusion in the opinions in Stastny v. Southern Bell Telephone \u0026 Telegraph Co., 628 F.2d 267 (4th Cir. 1980), and Hill v. Western Electric Co., 596 F.2d 99 (4th Cir. 1979). Neither of those cases involved the precise point which is raised in this appeal. There was no question raised in either of those cases about the scope of the EEOC investigation, the reasonable cause determination or the range of the offer of conciliation or the effect of the absence of any of these actions on the right to maintain a civil suit. To such extent as it is analogous, Hill even would seem to be contrary to the result reached by the majority. One of the issues in Hill, for instance, was the extent to which a class representative could represent employees having the same claim at two or more plants of the employer which may be considered analogous to the issue here. The Court held specifically that the class representative could only represent class members who had suffered \"injury in precisely the same way\" as he had in \"other departments of the same facility\" (Italics added). 596 F.2d at 102. That language would confine the class representation to the single facility or plant. If this situation can be taken as analogous to that now before us, it is manifest that the plaintiff in this case cannot meet the requirement established in Hill. Admittedly Portsmouth is not \"the same facility\" as Suffolk. Hill is thus unquestionably contrary to the majority's conclusion.\n\nHill did refer to and distinguish Patterson v. American Tobacco Co., 535 F.2d 257 (4th Cir.), cert. denied, 429 U.S. 920, 97 S. Ct. 314, 50 L. Ed. 2d 286 (1976).\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e In that case the issue involved whether the exemption under Title VII granted a bona fide seniority system was applicable to employees who work \"not in different locations.\" In other words, the controversy related to what branches (i. e., those \"not in different locations\") of an employer might be included within a claim that the employer's employment practices were immunized by a bona fide seniority system in connection with charges under Title VII. That question is quite analogous to that presented in this case. In Patterson the district court had found that the two plants, located a few blocks apart and engaged in the same general manufacturing operations, were \"not in different locations\" for the purposes of the Act and were accordingly not within the exemption. But and this is the important fact in the case we held, in deciding that issue, \"that the labor market is the most important factor in determining whether a company's employees work in different locations.\" 535 F.2d at 266. For authority the Court cited Russell v. American Tobacco Co., 528 F.2d 357 (4th Cir. 1975). In Russell, the Court said at pp. 362-63:\n\n\"Neither the Act nor the EEOC regulations define the statutory term \"employees who work in different locations,\" and we deem it unwise to attempt to draft a definition for every situation. It is readily apparent, however, that the labor market is the most important criterion for determining whether a company's employees work in different locations. If the labor for each plant is recruited from different geographical areas, or if one plant requires labor possessing different skills from the labor employed at another company plant, it is obvious that the company cannot draw from the same labor market to man its plants. Under these circumstances, it generally can be said that the employees work at different locations. In contrast, if a company can operate two or more of its plants with employees from the same geographical area who are unskilled or possess the same skills, an applicant for a job can be assigned to an entry level position in either plant. Therefore, these employees, having been hired from the same labor market, would not generally fall within the statutory class of \"employees who work in different locations.' \"\n\nIf the controlling factor is identity of labor market, as I deduce it is in the light of the decisions in Patterson and Russell, then it is improper to treat the two branches of Suffolk and Portsmouth as one and to find that a discrimination charge against a branch in one labor market may be considered a charge against another branch of the same employer in another labor market. That, however, is what the majority does in this case and what I think is not warranted.\n\nThere is another reason, grounded on fair dealings and the fundamentals of due process, for denying jurisdiction over Portsmouth hiring practices in this suit. From 1969 to 1976, the EEOC was in effect representing to the defendant that there was no claim of hiring discrimination against the Portsmouth branch. As a result of its investigation of the Suffolk branch, the EEOC knew of the defendant's practice of discarding employment applications after six months. Thus it was in possession of the knowledge that when it told the defendant it had no interest in the Portsmouth records, the defendant would follow its routine practice of discarding all applications after six months, thereby destroying evidence of possible great value to it in establishing a rebuttal to any charges against it involving the Portsmouth branch by proof of applicant flow from 1969 to 1975. To permit the EEOC now, without a charge to investigate, without any investigation, without a reasonable cause determination, without notice and without an offer of conciliation, and after six years of implicit representation that it was making no claim of discrimination at the Portsmouth branch, and after the defendant had placed itself at a disadvantage in proof because of the EEOC's own conduct, to attempt to piggy-back Portsmouth onto Suffolk in a belated claim of hiring discrimination offends the purposes of Title VII as well as that element of fundamental fair dealings which is at the base of due process. And, though it is not discussed in the majority opinion, prejudice to the defendant arising out of what has all the appearances of a legal \"ambush,\" whether intended or not, was, as we see in a moment, one of the \"triable issues\" in this case. The very inclusion in the Act of the prerequisites to suit, to which I have already referred, was to prevent an \"ambush\" and to avoid the inevitable prejudice such an \"ambush\" would impose on an employer such as this defendant against whom the EEOC, after some seven years, unexpectedly and without prior notice, leveled the charges relating to the Portsmouth branch. Under the language and intent of the Act, as construed in General Electric and other like authorities, and under every principle of fundamental fairness, any inquiry into hiring practices of the Portsmouth branch should have been excluded from the case. The district court agreed. The majority reverses. I think the majority is wrong.\n\nTurning from the jurisdictional issue to the consideration of the merits of the EEOC's claim of discrimination, I would begin with the stipulation of the parties on the issues triable in the case (apart, of course, from the jurisdictional issue involving the Portsmouth branch, already discussed). These issues were stipulated to be: \"B. Whether defendant American National Bank failed or refused to initially hire black employees because of race from 1969 to 1975.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e C. Whether any of the individual claimants whom EEOC presents at trial were denied employment ... because of their race. D. Whether the passage of time has prejudiced defendant.\" In connection with those issues, the parties, prior to trial, entered into certain supplementary stipulations. First, they stipulated that the charges of discrimination were limited to initial hirings in two employment classifications (i. e., (1) officer/manager, and (2) office/clerical)\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e in the years 1969 to 1975 at two branches, one at Suffolk, and the other at Portsmouth.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e It is important to emphasize that, as the EEOC has stipulated, the action was not concerned with any hiring by the defendant prior to 1969, nor was it concerned with the composition of the defendant's work force prior to 1969. What was in issue under the stipulation of issues agreed on by the parties was the change in the composition of such employment classification as a result of hirings from 1969 through 1975, and whether hirings in that classification were racially motivated.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e They also stipulated the statistical data as shown by the 1970 census on the racial breakdown of Total Population and Labor Force characteristics for Norfolk, Suffolk, Nansemond County, Portsmouth, Norfolk-Portsmouth, and that the breakdown of \"Workforce Availability Data on Minority Groups and Women in the Recruitable Labor Market Area\" in those areas.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Under these compilations, the parties did not differ on the black qualified labor force in these various areas. According to the charts on the office/clerical classification, the representation of blacks was 10.3% in Suffolk and 22.5% in Nansemond County. The comparable figure in Portsmouth proper was 13.9% and 21.5% for Norfolk-Portsmouth. The parties, also, stipulated the employment practices followed by the bank in its employment decisions.\n\nThough offering the same types of employment, the two branches received separately any applications for employment at their separate branch offices and made their own separate determination on hiring. The branches were located about twenty-five miles apart in an area of the State where access between cities is not especially easy. In their employment, the two branches drew from entirely different labor markets. The district court found, and the majority accepts the finding, that the Suffolk branch draws its employees from the Suffolk and Nansemond County labor market\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e and the Portsmouth branch from the Portsmouth and Portsmouth-Norfolk labor market.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e It was the long-established procedure of the defendant to require written applications for employment. These applications inquired into the applicant's health, his or her previous banking experience, any special skills or business-machine experience, education, employment record and personal references. They provided no information on the applicant's race. The branches were only required to retain the applications for at least six months. Both branches followed the practice of hiring only as a vacancy developed. In filling the vacancies the bank would normally review the applications filed within the six months prior to the date of the vacancy, select one or more applicants for interview, and, after the interview, would make its choice. Each branch had its own interviewing officer for employment applicants. In passing on the applications the branch would normally not employ without its labor market and would give some preference to the proximity of an applicant's residence to the branch where he or she was to be employed.\n\nWhen the trial actually began, the parties stated their respective claims either for relief or by way of defense. Counsel for the EEOC began his presentation of his claim by asking rhetorically \"what are we required to do\" to make out a prima facie case, and then answered his own inquiry by declaring that he (meaning the plaintiff EEOC) \"was required to show that an individual who applied for a job was black ... (was) qualified ... that a vacancy existed and (was) rejected.\" When that proof had been adduced and a prima facie case was thereby made out, EEOC counsel proceeded: \"The burden then shifts to the defendant to come forth and show your Honor, based upon valid business reasons, why these individuals were not considered; in fact, were rejected.\"\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e Having so stated the defendant's burden, counsel for the EEOC at this point offered the firm opinion that the defendant would be unable to meet this burden and that, because of such failure, \"(t)he only conclusion, under those circumstances, ... is that race was a factor\" in the defendant's hiring decisions and a decree in its favor was in order on behalf of all claimants.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nThe EEOC's proof at the trial followed precisely the scenario thus laid out by its counsel at the commencement of the trial. In its live testimony following this statement by its counsel of its theory of the case, the EEOC began by developing in painstaking fashion the procedure followed by it in its investigation of alleged discrimination on the part of the defendant. It first secured and reviewed all employment applications at the Suffolk branch for the entire relevant period (i. e., 1969 to 1975) and all employment applications at the Portsmouth branch for the years 1973-1975, inclusive. After identifying all the black applicants on these lists, the EEOC, through its representatives, sought to communicate with them suggesting that they might have a claim of discrimination against the defendant and a right to backpay, and requesting information from them relative to their claims. The EEOC took the replies it received and proceeded to identify all those made within six months of any employment decision by the bank at the relevant branch. It did this because the undisputed and agreed practice of the bank, as we have seen, was to consider only applications filed within six months of the time when a vacancy arose. If a white was employed at any time when there was a qualified black applicant or applicants with an application pending within the preceding six months' period, then that black applicant or those applicants were treated by the Commission as potential discriminatees. In this manner the 51 discriminatees asserted by the Commission were, according to the EEOC's testimony, identified by the EEOC through its witness, a paralegal with seven years' experience in this type of work. On the basis of this identification the EEOC stipulated that the 51 individuals so identified represented the only potential discriminatees in this action. The EEOC then proceeded to offer proof of its investigation to establish exactly the amount due each of such discriminatees by way of backpay and the result of this investigation was offered as proof of the amount of backpay due each claimant. The Commission followed up with the testimony of some 34 of the individual claimants. These claimants gave the circumstances on which they based their claims of discrimination.\n\nContrary to the expectations of the Commission's counsel, the bank, not only impeached the statistical evidence of the Commission, but it did, at the conclusion of the Commission's case, accept the burden of production, as declared in Texas Dept. of Community Affairs v. Burdine, 450 U.S. 248, 101 S. Ct. 1089, 67 L. Ed. 2d 207 (1981), and did \"produce admissible evidence which would allow the trier of fact rationally to conclude that the employment decisions (in connection with every potential discriminatory claim) had not been motivated by discriminatory animus.\" In fact, the bank went beyond this burden in connection with every employment decision in the relevant category for the period in question. The bank offered extensive proof in support of its failure to employ all the alleged discriminatees who had testified at trial. The bank, however, did not content itself merely with producing evidence in support of its decision in connection with the claims of the alleged discriminatees who had testified but adduced evidence which was found by the district court to be sufficient to support a rational conclusion \"that the employment decision(s) (in all the other cases as well) had not been motivated by discriminatory animus.\" Thus, the defendant contested with proof the Commission's claim of discrimination in favor of every one of the named 51 alleged discriminatees and, as I later point out, the district court found that the defendant had not engaged in racial discrimination in failing to employ any one of the 51 alleged discriminatees. The bank, also, introduced evidence of its affirmative action program for minority employment which it had adopted in 1973, and had since implemented with the approval of the Department of Labor, to whom jurisdiction over such programs was assigned under the Government Contract Compliance Executive Order. Finally, it impeached the statistical proof by subjecting it to the standard Castaneda test\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e and asserted it failed in proof of discrimination under such test.\n\nAt this point it seems appropriate to mark out precisely the conclusions reached on this record in the district court's opinion dismissing the action and the reasoning of the majority opinion reversing the district court and ordering exclusive relief in favor of the plaintiff, along with my own statement of my views which differ from those of the district court and those stated in the majority opinion. After finding that the action properly only embraced hiring decisions at the Suffolk branch, the district court proceeded, however, to consider the discrimination charge as it affected separately first the Suffolk branch and then the Portsmouth branch since the EEOC sought to present in this action its claim against the Portsmouth branch. It held at the outset that solely on the basis of the EEOC's statistical evidence of hirings in the two agreed work-force categories at the two branches, compared both with the overall black work force and with the qualified black work force in the specific categories involved in the action, the EEOC had made out a prima facie case. It then undertook to determine whether the defendant had rebutted or overcome both the prima facie case resting on inferences drawn from the statistical evidence and the additional nonstatistical evidence offered by the EEOC, which related to the 51 claims of individual discrimination and to the defendant's hiring practices. It found that, when tested by the standard deviation test developed in Castaneda, the statistical evidence was not sufficient to support a reasonable hypothesis of discrimination and the prima facie finding, based on the raw statistical data, was thus neutralized as proof of discriminatory motive or intent. It then reviewed carefully the applicant flow evidence, found it reasonably reliable, and, after evaluating all the evidence on the 51 claims of individual discrimination identified by the EEOC, found as a fact that in no case did the evidence support a finding of discrimination. Finally, it reviewed the defendant's hiring practices and found, again as a fact, that none was discriminatory. It accordingly dismissed the complaint. Thus, the district court found (a) that the statistical evidence was, when tested by the Castaneda standard, neutral in the probability of discrimination in hiring, (b) that there was, as a matter of fact, no discrimination on the part of the defendant in failure to hire any one of the 51 alleged discriminatees, who, by stipulation of the parties, were \"the only (possible) potential discriminatees\" out of the black applicants for employment at either branch of the defendant for the relevant time periods, and (c) that the defendant had engaged in no hiring practice that resulted in discrimination in the relevant time period.\n\nThe majority opinion agrees with \"the district court's ruling that the EEOC's statistical proof made out a prima facie case of discrimination\" but found that the district court \"erred in holding that defendant's rebuttal evidence was sufficient to overcome the prima facie case.\"\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e As a basis for this latter finding, the majority opinion states that \"the district court's analysis of the evidence (by which it concluded that the defendant had met successfully the EEOC's prima facie case) was flawed by specific failures correctly to apprehend or to apply controlling legal principles developed by the Supreme Court for analyzing the evidence in this type of case.\" It identified these flaws as \"(1) the weight apparently assigned by the (district) court to a standard deviation analysis of certain of the statistical evidence; ... (2) the significance which the (district) court assigned to ANB's applicant flow statistics as rebutting evidence; and (3) in the way in which the (district) court treated the relationship between the statistical and nonstatistical evidence offered to prove the discriminatory pattern or practice charged.\" Although these flaws would appear to be largely errors in the weight or significance to be assigned to the evidence, the majority opinion treats them as \"errors of law\" and thus not subject to the clear error rule for appellate review. It did this by concluding that in the case of the statistical evidence the district court gave improper weight to the standard deviation test, and that, in weighing the nonstatistical evidence, the district court failed to give proper consideration to the \"coloring\" which the statistical evidence gave to the nonstatistical evidence.\n\nAt the outset, I differ with both the district court and the majority opinions in their conclusion that on the statistical evidence alone the EEOC had proved a prima facie case. I think that the application of the standard deviation test as declared in Castaneda, which was unquestionably required in evaluating the statistical evidence in considering whether the EEOC had made out a prima facie case on the basis of such statistical evidence alone,\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e demonstrates that the statistical evidence relied on both by the district court and by the majority was insufficient to make out a prima facie case of discrimination, but, more than that, if the statistical evidence, though not refined by the use of the standard deviation test, could be regarded as making out a prima facie case (which I dispute), such a statistical prima facie case was, as the district court found, rebutted by the standard deviation test, the applicant-flow proof, the complete rebuttal of the 51 individual claims of discrimination, and the express findings with respect to the defendant's hiring practices. Specifically, I would find no flaw in the use of the standard deviation test by the district court, in the district court's factual finding of the reliability of the defendant's applicant-flow data, or in its findings on the individual claims of discrimination or on the defendant's hiring practices. Finally, unlike the majority, I conceive of all these findings as findings of fact and not as \"legal errors,\" as analyses and weighing of the evidence, reversible only for clear error.\n\nI first address the finding by the district court and the majority that solely on the statistical evidence the EEOC had made out a prima facie case. The statistical evidence relied on for this finding consisted of two comparisons: One based on general work force statistics comparing the percentage of blacks in the general work force in the pertinent labor market of each branch with that of blacks hired by the defendant at such branch in the period 1969-75 and the other using the percentage of qualified blacks in the two labor categories involved in the charge for the pertinent labor market of each branch for the period 1969-75. Both the district court and the majority discarded the first comparison\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e and \"relied only on the specialized work figures.\" On the basis of these \"specialized work figures,\" they found that blacks were so \"grossly underrepresented\" as to make out a prima facie case. In arriving at this conclusion for purposes of determining whether a prima facie case was made out, neither looked to the standard deviation test enunciated in Castaneda but looked to the record of hirings, particularly in the Suffolk branch in the office/clerical classification.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e They noted that the percentage of blacks available in this category for Suffolk was 10.3% and for Nansemond County 22.5%, or an average of 16.4%. The majority then declares that \"during three of the charge years (1969, 1974, 1975) there were no blacks employed in these categories (i. e., the office/clerical category). In two years (1970, 1973), there was one black, and in two years (1971, 1972) there were two.\" This was the basis for the finding by both the district court and by the majority opinion of gross underrepresentation of blacks.\n\nAs a matter of fact, these figures on employment as used by the majority as a basis for its concurrence in the district court's finding of a prima facie case are inadequate in themselves to make out a prima facie case. In 1969 the EEOC's own undisputed evidence shows that there were five persons hired at the Suffolk branch in the office/clerical category, one of whom was a black (Beulah Chambers, hired on November 17, 1969).\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e In effect, then, 20% of all hirees in this category at the Suffolk branch during 1969 were black. This percentage is twice the representation of blacks in the qualified Suffolk work force, considerably more than the average of both Suffolk and Nansemond County qualified work force statistics for the category (16.4%), and just under the qualified work force statistics for Nansemond County alone.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e Again, in both the years 1974 and 1975 the records included in the evidence by the EEOC show that, out of seven persons employed in the office/clerical category during those years, there was included at least one black hiree in each year.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e The percentage of blacks hired in this category in those two years was thus approximately 14%. The majority would seemingly discredit the hirings in 1971 and 1972, saying there were but two blacks hired in those two years. That is true, but in 1971, there were only two applicants hired in this category and one of these was black, for a percentage of 50%, and in 1972 there was one black hired out of five persons employed in this office/clerical category, for a percentage of 20% black. It is thus seen that, for three of the seven years in question, the percentage of the defendant's hiring in the office/clerical category at the Suffolk branch exceeded considerably the percentage of qualified blacks in that category both in the Suffolk and in the Nansemond County labor markets, and in two of the other four years, the percentage of hirings considerably exceeded the percentage of qualified blacks in the Suffolk labor market and was within two percentage points of the percentage of qualified blacks in the Nansemond County labor market.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e If, on the other hand, we compare the total number of hirees in the office/clerical category with the black hirees in this category for the full period of 1969 through 1975 at the Suffolk branch, the percentage of black hirees will be in excess of 14% or but approximately 2 percentage points less than the average of qualified blacks in the combined Suffolk and Nansemond County labor markets. For the Portsmouth branch we have hiring figures only for the years 1973, 1974 and 1975. In these three years the average percentage of black hirees in relation to overall hiring in the pertinent classifications was 15.2%, which did not represent any \"gross underrepresentation\" by any standard. These sporadic, spotty figures in hiring, in both of the pertinent classifications, spread as they are over seven years, and varying markedly from year to year, certainly evidence no clear-cut pattern or practice, \"no standard operating procedure\"\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e of discrimination against blacks, (the required finding under Teamsters) and they cannot support a finding of \"gross underrepresentation,\" which could be the basis for a finding of a prima facie case of discrimination on the part of the defendant, either at the Suffolk or at the Portsmouth branch.\n\nBut, apart from the complete inadequacy of even the evidence on which the district court and the majority sought to ground their finding of a prima facie case of a \"standard practice\" of discrimination in hiring, I think that the majority sought to deduce a prima facie case from statistical evidence, which necessarily involves an element of intent, in the wrong way and by disregarding the test established by the Supreme Court and followed by us in United Bank for such deduction. Intent is an essential element in a disparate treatment case. Manifestly, whenever, as here, a court seeks to determine whether a hiring selection by an employer is racially tainted by a statistical comparison of hirings with available qualified work force in the labor market, it does not ordinarily do so on the basis of evidence of express intent or motive. Statistics do not provide expressly such evidence. One must resort to the law of probabilities in assessing such statistics for purposes of arriving at a possibly reasonable inference of discriminatory intent. Under the law of probabilities, it is not sufficient for a finding of an inference of tainted motive that the percentage of hirings does not correspond exactly with the percentage of qualified blacks in the work force in the pertinent labor market; it is only when the deviation from the norm reaches such a level that it is reasonable to assume or hypothesize that the hiring was biased or intentional, rather than by chance or at random, that it becomes supportive of a prima facie case of discrimination. The Supreme Court recognized this and in Castaneda provided courts with what it characterizes as a \"precise\" test or formula for ascertaining when the deviation reaches this level and may be sufficient to justify a hypothesis of intent or bias in the hiring process.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e In arriving at such formula, on the basis of the mathematics of probabilities it declared that when the deviation provided by the statistical comparison is \"greater than two or three ... then the hypothesis\" that defendant hired employees without regard to race \"would be suspect,\"\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e to such an extent that it was not unfair to assume that the hiring selection was tainted. In essence, what the court was saying was that until the deviation reached the level of \"more than two or three,\" statistics based on a comparison of hirings with qualified work force would not render those hirings \"suspect\" of racial discrimination.\n\nIn reaching their determination that the EEOC had established a prima facie case solely on the statistical evidence, both the district court erred and the majority departed from the rule established by Castaneda and adopted by us in United Bank for qualifying statistical evidence in this context. The district court did it is true later apply the Castaneda standard in determining whether the statistics, when tested by the Castaneda rule, rebutted the prima facie finding. In so doing it determined that the deviations in this case, taken over the full period in both categories, were not \"more than two or three.\" It concluded that such determination \"neutralized\" the value of the statistics as proof of a tainted hiring practice and as a basis for a hypothesis of bias in the hiring process. I agree with the district court in its calculations under the Castaneda rule, as I assume the majority does at least, it does not express disagreement. My difference with the district court is its failure to use the Castaneda test in determining whether the EEOC had made out a prima facie case with statistical evidence which was \"neutral\" in providing authority for a hypothesis of intent. In taking this position, I am following precisely what the panel did in United Bank, 615 F.2d 14, and what the Supreme Court in Castaneda, 430 U.S. 482, 97 S. Ct. 1272, 51 L. Ed. 2d 498, and Hazelwood School District v. United States, 433 U.S. 299, 97 S. Ct. 2736, 53 L. Ed. 2d 768 (1977), directed us to do.\n\nIf, however, we are to apply the Castaneda test by way of rebuttal, as did the district court, I agree with the district court's conclusion that the deviation in this case in the statistical evidence was not sufficient to render the hiring selections of the defendant \"suspect\" of bias. Under those circumstances, the district court correctly held that the statistical evidence was \"neutralized \" as evidence of bias in the hiring selection and, if bias was an essential element of the plaintiff's case, as the plaintiff itself concedes, it was necessary for the Commission to produce evidence of it elsewhere in the record, for, as we have seen, it is the Commission's burden to persuade throughout the case under Burdine. The majority, however, takes issue with this conclusion. As I read it, the majority opinion does not find fault with the district court's finding that the standard deviation reflected in the statistical evidence for the two pertinent employment categories was not \"more than two or three.\" It contends rather that the district court committed \"legal error\" in the neutral effect given by it to a finding that the standard deviation in the statistical evidence was no \"more than two or three.\" This is one of the three \"specific failures ... to apply controlling legal principles developed by the Supreme Court for analyzing the evidence in this type of case\" found to have flawed the district court's opinion.\n\nThe majority opinion faults the district court on this point because that Court held that, under Castaneda, \"if standard deviations reflected in static work force statistics were not \"more than two or three' the disparities were necessarily shown to be statistically insignificant.\" (Emphasis added) It asserts flatly that this statement \"is simply incorrect.\" The statement of the majority is not, however, a strictly accurate reading of the conclusion which the district court said should be drawn from a standard deviation of \"not more than two or three.\" What the district court did conclude was that, when the standard deviation in the employee selection was more than \"two or three,\" it was a fair hypothesis, based on accepted standards of mathematical probabilities, that the selection whereby blacks were not hired was \"suspect\" and not by chance but, conversely, that if the standard deviation in such a situation was no \"more than two or three,\" there was no basis for a hypothesis that the selection was by design rather than by chance. In essence, the conclusion was that, if the deviation was no \"more than two or three,\" that fact would not permit a hypothesis of bias or design as distinguished from chance and would be purely a neutral indicator insufficient to satisfy the plaintiff's burden of persuasion, which as Teamsters teaches, goes with the plaintiff in a discrimination case throughout the proceedings.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e That I think is a reading clearly justified by Castaneda and it was in effect the reading given Castaneda in United Bank, 615 F.2d at 152. Moreover, it is not substantially different from the construction of Castaneda arrived at in the majority opinion itself to the effect \"that courts of law should be extremely cautious in drawing any conclusions from standard deviations in the range of one to three.\"\n\nIn my opinion, Castaneda begins with the premise a premise reaffirmed recently in Burdine, supra that the burden of persuasion in a discrimination case rests throughout the case, both in establishing a prima facie case and in sustaining a judgment of final liability, upon him who asserts discrimination.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e When the complainant relies as a basis for sustaining this burden on statistical evidence, that evidence is to be tested by rules of statistical probability.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e Until the statistics measured by these rules of probability, as stated in Castaneda reach a point of deviation in their application that will support a hypothesis of bias in hiring, promotion, etc., the plaintiff has not met this burden of persuasion and the defendant is entitled to prevail. Castaneda establishes this threshold point where a hypothetical construct of bias is warranted as a standard deviation of \"more than two or three.\" When the standard deviation fails to reach that level of \"more than two or three,\" the plaintiff, so far as his statistical proof is concerned, has not sustained his burden of persuasion and has not met the threshold test for a prima facie case based on statistical evidence. That was the situation here. Under that construction, the EEOC had unquestionably failed to satisfy the requirements for a prima facie case on the basis of the statistical evidence.\n\nI would assume the majority does not suggest a court might hypothesize when the deviation is no \"more than two or three\" that the employer's selection of hirees was by design, i. e., was discriminatory. To do that would be to give the same weight to a standard deviation of no \"more than two or three,\" as Castaneda says should be given to a standard deviation of \"more than two or three,\" and I am confident that the majority does not opt for any such misapplication of Castaneda. I can only assume that the majority means that the \"weight\" to be given a finding of no \"more than two or three\" is that such a finding does not support a hypothesis of selection in hiring either by design or by chance. Such a finding authorizes an assumption neither of discrimination nor of nondiscrimination, specifically, that the finding in such a case is inconclusive, supportive of neither a hypothesis of design nor of chance. If this is the view of the majority, the district court adopted that view and I can find no reason for the majority to fault it as the first \"flaw\" which it finds \"skewed\" the district court's conclusions. The very test or formula articulated by the majority (i. e., \"that courts of law should be extremely cautious in drawing any conclusions from standard deviations in the range of one to three\") unquestionably justified the district court in saying that such neutralization of the statistical evidence meant simply that the statistical evidence was without value in determining discrimination, either prima facie or substantively. Is not such a finding evidence that the district court, in its review of the statistical evidence was being \"extremely cautious\" in drawing any conclusions from the flawed statistical evidence, and has not the majority trespassed far beyond appellate review and abandoned its own rule of \"extremely cautious\" in evaluating the statistical evidence, giving it in effect conclusive effect?\n\nThe best evidence of discrimination or no discrimination in this case does not, however, consist of probability of inferences drawn from what are clearly neutral statistics but of the defendant's actual employment decisions themselves, analyzed under a proper applicant flow standard. Statistics support inferences but only inferences which, under appropriate circumstances may support a judgment of discrimination if no attempt at rebuttal is made.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e But and this is the important point statistics, with their inferences, cannot stand against proof that an employer never engaged in discrimination in a single employment decision in the relevant time period, when reviewed in the light of the available applicant flow.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e This positive proof that no employment decision was tainted is \"the proof of the pudding\" in the establishment of no discrimination and it completely nullifies any inference sought to be drawn from statistical evidence. This point was made clear in Hazelwood School District v. United States, 433 U.S. 299, 97 S. Ct. 2736, 53 L. Ed. 2d 768 (1977). In that case, where the plaintiff in a discrimination case, relied on statistical compilations for the claim, the Supreme Court remanded with the direction \"on remand to determine whether sufficiently reliable applicant-flow data are available to permit consideration of the petitioners' argument that those data may undercut a statistical analysis dependent upon hiring alone.\" 433 U.S. at 313 n. 21, 97 S. Ct. at 2744 n. 21. In concurring, Justice Brennan agreed upon remand so that \"Hazelwood reasonably should be given the opportunity to come forward with more focused and specific applicant-flow data in the hope of answering the Government's prima facie case.\" Id. at 314, 97 S. Ct. at 2744. Justice White, also concurring, was even more emphatic, suggesting that the Government in a discrimination case, should itself as a part of its prima facie showing submit applicant flow evidence. Thus, he said (Id. at 347-48, 97 S. Ct. at 2748-49):\n\n\"Since the issue is whether Hazelwood discriminated against blacks in hiring after Title VII became applicable to it in 1972, perhaps the Government should have looked initially to Hazelwood's hiring practices in the 1972-1973 and 1973-1974 academic years with respect to the available applicant pool, rather than to history and to comparative work-force statistics from other school districts. Indeed, there is evidence in the record suggesting that Hazelwood, with a black enrollment of only 2%, hired a higher percentage of black applicants than of white applicants for these two years. The Court's opinion of course permits Hazelwood to introduce applicant pool data on remand in order to rebut the prima facie case of a discriminatory pattern or practice. This may be the only fair and realistic allocation of the evidence burden, but arguably the United States should have been required to adduce evidence as to the applicant pool before it was entitled to its prima facie presumption.\" (Italics added)\n\nAnd in New York Transit Authority v. Beazer, 440 U.S. 568, 586, 99 S. Ct. 1355, 1366, 59 L. Ed. 2d 587 (1979), the Supreme Court emphasized the superior reliability in the discrimination context of reliable applicant flow data over purely statistical evidence generating a mere inference of discrimination. In that case, the Authority had a policy of excluding from employment and of discharging persons receiving methadone maintenance. The statistical record established that practically all the persons receiving such maintenance were either black or Hispanic. The plaintiffs, who were black and on methadone, claimed the policy constituted racial discrimination. To support that claim, the plaintiffs relied on the disparity as shown statistically between blacks and Hispanics, on the one hand, and whites, on the other, as evidencing racial discrimination. In denying pertinence to such statistics and in pointing to applicant flow as providing the proper test, the Supreme Court said (pp. 585-86, 99 S. Ct. at 1365-66):\n\n\"We do not know, however, how many of these persons ever worked or sought to work for TA. This statistic therefore reveals little if anything about the racial composition of the class of TA job applicants and employees receiving methadone treatment. More particularly, it tells us nothing about the class of otherwise-qualified applicants and employees who have participated in methadone maintenance programs for over a year the only class improperly excluded by TA's policy under the District Court's analysis.\"\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\n\nWe followed the same rule of relying on applicant flow data as a refutation of any claim of discrimination in EEOC v. United Virginia Bank/Seaboard National, 615 F.2d 147 (4th Cir. 1980). A majority of the court in that case followed the reasoning of Justice White in Hazelwood and looked to such data in determining whether the Commission had made out a prima facie case; Judge Butzner concurred but did so on the ground that the applicant-flow data rebutted absolutely what he considered to be the Commission's prima facie case, which was based wholly on statistics. Under either view, the applicant flow data were found to overcome any claim of discrimination based on an inference arising out of statistical evidence. And the reason for such conclusion is quite obvious. If, after reviewing the applicant flow data in relation with all hiring decisions, no discriminatory refusal to hire is found, there manifestly can be no basis for a discrimination claim.\n\nPerhaps because it recognized the force of Justice White's concurring opinion, the Commission in this case attempted to establish discrimination both prima facie and substantively by testimony of applicant flow data. The bank offered its rebutting testimony. On the basis of all the evidence, most of which consisted of live testimony, the district judge found that not a single hiring decision of the defendant during the relevant period was tainted by racial bias nor had a single one of the 51 persons who the Commission asserted were the \"only potential\" discriminatees among those who applied for employment in the pertinent classification for the relevant time period had actually been denied employment because of his or her race. Such a finding was one of fact and reversible only for clear error. The majority does not seek to address the district court's findings on this point for clear error, obviously because such a holding was not reversible. Rather, it somewhat ambiguously faults the district court's finding in this area because of \"the significance\" (which I assume is synonymous with \"weight\") given this evidence by the district court. The majority rests this criticism of the district court's finding on three grounds: First, the applicant flow data for the Suffolk branch is incomplete; second, the applicant flow data for the Portsmouth branch covers but three of the relevant years; and, third, the applicant flow data are flawed at both branches by the inclusion therein of service worker employment. Except in these three situations, there is no attack on the reliability or trustworthiness of this applicant flow data.\n\nThe first objection raised by the majority opinion to the use of applicant flow data is its conclusion that the applicant flow figures for the Suffolk branch were incomplete. This same point was advanced in the district court by the EEOC and that court, after carefully reviewing the evidence, concluded that the figures were \"reliable.\" Though this was plainly a finding of fact by the trial court and though such finding was not clearly erroneous,\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e the majority would fault the finding as an error of law. The record, however, abundantly sustains the factual finding on this point made by the district court. As a matter of fact, the applicant flow data on which the district court relied for its finding were largely developed in the testimony of witnesses for the EEOC and in fact stand undisputed.\n\nMs. Stephens, a paralegal employed by the EEOC, was directed by the EEOC to determine whether any individual blacks had been discriminated against and who they were. To do this she obtained and reviewed all the applications for employment at the Suffolk branch for the years 1969-75. The majority, however, questions that Ms. Stephens had access to or reviewed all the applications for employment for such period. It points to the language in the stipulation of facts, which states that, \"after a review of the available applications filed with American National Bank in Suffolk from 1969 through 1975 and in Portsmouth during 1975 ....\" It attaches special meaning to the adjective \"available\" and suggests that \"it seems highly unlikely on the record we review that this data represents substantially all the applicant flow data for the years in question.\" It offers as a basis for this only that the district court had noted that \"the total number of applications reflected in the data offered the court varied widely from year to year, from a low of sixteen in 1972 to a high of ninety-seven in 1974.\" From this single observation of the district court the majority made its finding that the employment applications were incomplete. And this is, I submit, contrary to the testimony of Ms. Stephens.\n\nIn its note 47, the district court discussed Ms. Stephens' testimony. In the course of her testimony, she was interrogated on the applications she had reviewed for the Suffolk branch. The district court indicated its unwillingness to admit in evidence the EEOC's exhibit prepared on the basis of her review unless it covered all the employment applications for the pertinent years at the Suffolk branch. After some sparring, the witness affirmed that her exhibit covered all the applications. Moreover, during the colloquy at that time, counsel for the EEOC stated: \"We believe it (the proffered exhibit) reflects those applicants, the total applicants, and the percentage of black applicants for the years 1969 through 1975.\" (Emphasis in text) The figures in the exhibit are consistent with the defendant's compilation of the number of applications filed at the Suffolk branch for the pertinent years. In the face of this evidence, and in the absence of any contrary evidence by the EEOC, the district court found the figures used by the defendant in its applicant flow presentation for the Suffolk branch were reasonably accurate. In the absence of some basis for a conclusion that such finding was clearly erroneous, that factual finding is binding on this appeal.\n\nThe second objection of the majority to the applicant flow data relates solely to the Portsmouth branch. That branch had employment applications for no years behind 1973. The uncontradicted evidence, as incorporated in the stipulation of the parties, was that as a general rule the defendant did not retain employment applications for more than six months. This was because of its practice that in filling a vacancy, it did not go back further than six months in its review of applications. The district court found this a reasonable practice, and one that the defendant generally followed, and, so far as I read it, the majority does not take issue with such finding. In 1970 the EEOC had told the defendant that, though it was investigating an employment claim involving the Suffolk branch, it was not interested in the Portsmouth branch and did not wish to review the records at such branch.\n\nNot only had the Commission thus assured the bank that the Portsmouth branch was not involved in any charge of discrimination, but also there was another circumstance which was calculated to assure the bank that, with the possible exception of the dormant charges of Chambers against the Suffolk branch, the bank was in full compliance with the Act. In 1973, the Office of Federal Contract Compliance, Department of the Treasury, acting under the authority of Executive Order 11,246,\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e as amended by Executive Orders 11,478 and 12,086, had reviewed the affirmative action program developed by the defendant, as well as its hiring practices. That review resulted in the approval of the defendant's affirmative action program at both branches as well as of its hiring practices.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e We repeat: until the EEOC filed its complaint in 1976, there had thus not been the slightest intimation by the EEOC or any other agency of the Government, such as the Department of Labor, having responsibility in the area of discrimination in hiring or employment practices, that either the EEOC or the Department of Labor, under its Executive Order authority, had any intention of charging discrimination at its Portsmouth branch. Actually, so far as the record shows, the EEOC had never received a complaint from any one about that branch and obviously it had never made any investigation of employment at that branch.\n\nThe injection of the Portsmouth branch into the action more than six years after the EEOC had notified the defendant it had no interest in employment at the Portsmouth branch undoubtedly came as a shock to the defendant. Until it was first notified that a charge of discrimination was being leveled against that branch, it had no particular reason to retain beyond six months any employment applications at the Portsmouth branch. I think the district court was fully justified in finding the action of the defendant in not retaining all its employment applications for the years 1969-75 at the Portsmouth branch was perfectly reasonable and in using the clear evidence of a want of discrimination in the years 1973-75 as a rebuttal of any claim of a practice of discrimination at the Portsmouth branch.\n\nThe majority, however, finds fault with this finding of the district court. It appears to suggest that the defendant may have destroyed the earlier records in order to conceal the true facts. There is nothing in the record to support such an inference. Indeed, the EEOC does not suggest such conduct on the defendant's part. Further, it seems to concede that there was no obligation on the defendant to retain these earlier applications at the Portsmouth branch. I say this because the majority appears to concede that \"the affirmative obligation to preserve them (i. e., the Portsmouth pre-\"75 records) (had) expired.\" The majority intimates, however, that every employer ought to maintain all \"employment records going back at least to the effective date of the Title (VII)\" as a matter of \"sound business judgment\" which dictates \"the maintenance of all business records having potential relevance in any of the litigation patterns to which businesses stand constantly exposed.\" It is difficult to think that any business is obligated to retain from 1965 on indefinitely all its employment records if it wishes to avoid the inference that any destruction of such records is a self-serving concealment of damaging evidence against it. Businesses are already inundated with records they are required to keep. I do not think we should add to their burdens by saddling them with such inference from their failure to preserve such records.\n\nThe final conclusion by the majority that the defendant's applicant flow figures are flawed because they included the category of janitors will not stand examination. Such inclusion, the majority suggests, inflates the number of black hirees used in the statistical comparison. Actually, though, if we exclude black janitorial employees in the statistical comparison, there is no real change in the standard deviation. Thus, in the office/clerical category, there were 35 persons employed at the Suffolk branch between 1969 and 1975. Of these 5 were black, excluding the 2 black janitorial employees. Applying the standard deviation test to these figures, I find that, using the qualified work force in Suffolk, a standard deviation of 1.80; if we use Nansemond County statistics, a standard deviation of 2.63; and if we combine Suffolk and Nansemond County, a standard deviation of 2.21. This claim of error in the use of the applicant flow figures, even if sound (which I do not concede), is thus groundless. When the black janitorial employees are clearly excluded, the standard deviation is still well below the level of \"more than two or three.\"\n\nIt is thus manifest beyond dispute that the district court was warranted in making its factual finding that the applicant flow data were \"reliable\" and, on the basis of such data, in finding that none of the bank's hiring decisions in the relevant period was racially tainted. And this conclusion cannot, I submit, be impeached by any inference erroneously deduced from \"neutral\" statistical data. After all, the applicant flow data are evidence which could be neither rebutted nor given a discriminatory \"coloring\" by this neutral statistical evidence.\n\nI think the majority improperly fails to give proper, if not controlling, weight to the district court's finding of want of discrimination in the actual hiring decisions themselves in arriving at its conclusion that, on the entire record, the EEOC had made out factually a case of liability. I take it as well settled that a federal appellate court, such as we are, is a court of error whose function is limited to affirming, modifying, vacating, reversing or remanding for further proceedings upon a consideration of trial court error; it does not engage in equity review, giving right judgments upon the whole record, nor conduct de novo review with or without additional evidence. If, however, this view of our function is inaccurate and we may properly assume the fact-finding function of the trial court in what I submit is contrary to the proper scope of appellate review, then it is necessary to review all the evidence in reaching its findings of fact, and this would include the fact that not one black, identified by the EEOC, had been discriminated against by the defendant. The majority in effect disregards such evidence, particularly its complete refutation by the defendant, and never weighs it in reaching its conclusion.\n\nI turn next to the nonstatistical evidence which the majority does notice and on which it rests in substantial part its decision. This evidence, such as it was, relates to alleged discriminatory hiring practices and procedures followed by the defendant. Manifestly, any such practices are unimportant if the Commission has failed to prove a single tainted employment decision in the relevant time period and this is just what the district court, after a review of the evidence, has found. Nor does the majority conclude that any of the employment procedures in and of themselves were racially motivated or used. It merely finds that evidence of such practice, while insufficient to prove taint, \"tended to corroborate to some degree at least the prima facie showing of discrimination made by the static work force statistics.\" (Emphasis added) However, I think I have demonstrated already that the statistical evidence was \"neutral\" and that the applicant flow data completely refute any possible \"prima facie showing of discrimination made by the static work force statistics.\" But, beyond this, the charges of improper hiring practices themselves lack any force.\n\nAll allegations of hiring practices are of the \"boiler-plate\" variety made by the Commission indiscriminately in all cases, irrespective of how relevant such allegations may be in the particular case. The district court found that this was the situation in this case. It proceeded to underscore the fact that the EEOC made no effort at trial to prove that any of these practices resulted in any discrimination. The majority seems at least, in part to agree with this finding. Thus it joins the district court in condemning the EEOC's action in this case in making \"irresponsible broadside\" charges in its complaint and in failing \"to follow up charges with attempted proof.\" It agrees with the district court in dismissing out of hand the bulk of all these \"irresponsible broadside\" charges.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e It does seek to resurrect from the dust heap two practices, stated in the complaint, one being the use of an all-white interviewing staff and the other \"word-of-mouth recruiting,\" and built some finding of discrimination on them. Accordingly, the majority declares that \"rightly assessed, the EEOC's evidence of word-of-mouth recruiting as the primary means used by ANB to fill vacancies, and the use of an all-white interviewing staff to make its subjective hiring evaluations tended to corroborate to some degree at least the prima facie showing of discrimination made by the static work force statistics.\" (Emphasis added) This tentative finding cannot be sustained on the record, and, in a substantial way, the majority so concedes.\n\nI shall first deal with the charge relating to white interviewing officers. The majority concedes that \"it is clear that the use of an all-white interviewing staff standing alone could not support a determination of liability\"\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e and states unequivocally that it could not \"quarrel with the court's related conclusions that the criteria used for selection (by the all-white interviewing staff) were for the most part objective and consistently applied.\" It is difficult to extract from these statements a basis for the majority's faulting the district court in finding that the practice of using an all-white interviewing staff was not employed for purposes of discrimination. This was exactly the same practice which was found in United Bank not to support a judgment in favor of the EEOC on a finding of discrimination. The charge relating to \"word-of-mouth recruiting,\" on the other hand, really relates to the mere fact that in its application for employment the applicant was requested to list \"friends or relatives employed by the bank.\" This, in the majority opinion's view, tainted the whole employment practice. To support this conclusion, the majority observes that \"thirty-two of the sixty-five applicants hired in Suffolk from 1969-75 and in Portsmouth in 1975 49.2% had listed friends or relatives on their applications.\" The district court noted this same evidence. It found that no special significance was to be attached to this evidence, saying that \"if anything ... statistics show(ed) that the listing of friends and relatives was a minor factor; a majority of the hirees had no \"contacts' working for defendant.\" This finding of the district court appears fully justified and even the majority practically so concedes for it adds that \"controlling significance to this particular factor in the overall assessment of ANB's hiring practices\" is not in order. In any event, the weighing of the evidence on this point was for the district court and its finding on the weight to be ascribed to it can only be disturbed for clear error.\n\nThe legal error which the district court committed and which faulted its findings of fact under the majority's reasoning was that, in reviewing the charges with reference to practices (which the majority implicitly concedes standing alone would not support a judgment against the defendant) the district court failed \"to assess the evidence in the light of, and colored by, the gross underrepresentation of blacks in ANB's work force already statistically demonstrated\" and confined its \"inquiry ... to specific practices isolated from any inference of discrimination already established. It was in effect, as if the EEOC had sought to base its case solely upon the nonstatistical evidence relating to hiring.\" The difficulty with all this reasoning is that there was no statistical evidence of discrimination in this case, I submit. Whether we look at the cold figures or measure the statistics by the standard deviation test established by Castaneda, the statistical evidence does not justify \"any inference of discrimination;\" the statistical evidence is at best neutral and, being neutral, it can give no \"color\" to the EEOC's charge. The only basis for a finding by the majority of discrimination in this case is the nonstatistical evidence and even the majority implicitly recognizes, I submit, that this nonstatistical evidence is insufficient in and of itself to sustain a finding of discrimination. There is accordingly no warrant for diagnosing the district court's finding on these nonstatistical matters as infected with legal error.\n\nIn summary, it is obvious that the statistical evidence was at best neutral and certainly was insufficient to support a prima facie finding of discrimination, when properly tested by the standard deviation test mandated by Castaneda, 430 U.S. at 496 n. 17, 97 S. Ct. at 1281 n. 17. There was no piece of nonstatistical evidence which would support a finding of discrimination. Whether considered separately or together, the statistical and nonstatistical evidence did not make out a case of discrimination and the district court properly dismissed the action. The most relevant evidence was that offered in connection with the specific hiring decisions, to which I have already referred, and the evidence of the defendant's affirmative action program, as approved by the Department of Labor, evidence which the majority does not weigh, but evidence which United Bank says should be weighed in resolving whether EEOC has proved its case. 615 F.2d at 156. In the face of this evidence, I believe there is no basis in fact for a finding of liability in this case. When an employer has taken every hiring decision he has made and shows, as the bank did here, that no hiring decision was tainted, and when he has proved an affirmative action program approved by the Government, he has effectively, I submit, rebuffed any claim of discrimination.\n\nThere remains an ancillary point that deserves perhaps some comment, though I do not regard it as relevant under my analysis of the case. The majority opinion dismisses the finding of the district court on the individual claims and declares that such rulings had \"no preclusive effect\" on the right of these claimants to relitigate their individual claims on remand. It reaches this conclusion because, as it says, the evidence in connection with these claims \"was not offered at this stage to establish entitlement to individual relief, but merely as corroborating or buttressing evidence of a general pattern of racial discrimination in hiring.\" I submit this is contrary to the agreed triable issues and to the Commission's own statement of its claim, as quoted by me supra. One of those issues was \"(w)hether any of the individual claimants whom EEOC presents at trial were denied employment ... because of their race.\" It stated the procedure for proving such claims under McDonnell Douglas and declared it intended to follow that procedure in its proof. How can it be said, in the light of this clear declaration by the Commission of the purpose of its proof, that, proof of the individual claims was \"not offered ... to establish entitlement to individual relief,\" especially since the Commission proceeded to prove exactly what it claimed the backpay award in each individual case should be? The EEOC sought to prove all these claims, and, in addition it, through its paralegal Ms. Stephens offered evidence of the amount of backpay due each of such claimants and the manner in which backpay was calculated. It would appear that these individual claims were directly in issue and were to be determined at this stage in the proceedings. This, however, is, as I have said, unimportant if my views on the disposition of the main issue are correct.\n\nFinally, I would add that this case and United Bank are in effect twins. Both involved bank branches located in the very same areas. The charges in both cases were roughly the same. The evidence submitted followed the same pattern. The district court reached a like conclusion in both cases. On appeal we sustained the dismissal in the earlier case (United Bank ) but reverse it in this case. Such inconsistency in decision is unfortunate and properly raises doubts in the public mind about evenhandedness. I am unable to see how we can decide one case in favor of the defendant and not do likewise here. The rights of parties when they are the same, as I submit they are in the two cases, should not vary with different panels of the same court. I fear that is the situation here.\n\nI would affirm the dismissal of this action for the reasons stated above.\n\n\u003cspan class=\"fn\"\u003e1. The EEOC offered two different definitions of the relevant market area; ANB neither challenged the EEOC's approaches nor offered its own definition. The district court found the relevant labor market area for ANB's Portsmouth branches to be the City of Portsmouth and the Norfolk-Portsmouth SMSA; for the Suffolk branches, it defined the relevant area as the city of Suffolk and Nansemond County. The court used the data set out in Appendix A for general work force comparisons for the years 1968-1975, comparing for each year the number and percentage of blacks employed by ANB with the percentage of blacks in the relevant market area. The data employed here are of course subject to the general limitation implicit in the term \"static.\" They only depict the work force as it existed on specific days at intervals of a year during the charged period. They do not therefore purport to reflect all employment decisions occurring during those intervals, and may \"miss\" significant hirings occurring during those intervals. It is this general limitation rather than any specific inaccuracy in the data here used by the district court that the dissent has pointed up. Slip op. at 93-95. While this limitation can of course give a distorted picture on the ultimate issue of post-Act discrimination, the means for correcting it are provided by the same Supreme Court decisions that authorize use of static work force statistics to make a prima facie case. See generally note 7 infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The court used the data set out in Appendix B for special qualifications work force comparisons for the years 1968-1975, comparing for each year the number and percentage of blacks employed by the defendant in Suffolk and Portsmouth in each category with the percentage of qualified blacks in the available work force.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Hiring procedures were similar at the Portsmouth and Suffolk branches.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. See Appendix C.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The situation is similar to one that occasionally occurs in the private suit where the plaintiff names a defendant not named in the original charge filed with the EEOC. The general rule is that \"it is a jurisdictional prerequisite to the filing of a suit under Title VII that a charge be filed with the EEOC against the party sought to be sued.\" Bowe v. Colgate-Palmolive Co., 416 F.2d 711, 719 (7th Cir. 1969); see Stith v. Manor Baking Co., 418 F. Supp. 150, 155-56 (W.D.Mo.1976), and cases cited therein. The rationale for the rule is like that behind the rule that the claims in a EEOC enforcement suit must have been included in the reasonable cause determination and subject to conciliation. The defendant, if he has been named in the original charge, has been notified of the asserted Title VII violation. Further, the charged party is thus brought before the EEOC, \"(permitting) effectuation of the Act's primary goal, the securing of voluntary compliance with the law.\" Bowe v. Colgate-Palmolive Co., 416 F.2d at 719. Courts have developed exceptions to this rule, though, where it is clear that the defendant through some relationship with the named respondent had notice of the charges and participated in the conciliation process. See, e. g., Stith v. Manor Baking Co., 418 F. Supp. at 156, and cases cited therein; Escamilla v. Mosher Steel Co., 386 F. Supp. 101, 105 (S.D.Tex.1975) (jurisdiction proper over parent of wholly-owned subsidiary where parent had or should have had notice of conciliation process); Chastang v. Flynn \u0026 Emrich Co., 365 F. Supp. 957, 964 (D.Md.1973) (\"where there is substantial, if not complete identity of parties before the EEOC and the court, it would require an unnecessarily technical and restrictive reading of (the statute)\" to deny jurisdiction), aff'd in relevant part, 541 F.2d 1040 (4th Cir. 1976).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The district court apparently concluded alternatively that, applying this principle, ANB's hiring decisions during the relevant period, as revealed in its applicant flow data, were too few in number (39 in Suffolk from 1968 to 1975 and 27 in Portsmouth in 1975) to justify an inference of discrimination. 21 F.E.P. Cases at 1556.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Section 703(j) of Title VII \"imposes no requirement that a work force mirror the general population.\" Teamsters v. United States, 431 U.S. 324, 339 n.20, 97 S. Ct. 1843, 1856, 52 L. Ed. 2d 396 n.20 (1977). Employment discrimination is seldom overt, however, and courts must look to evidence other than specific acts of discrimination to determine whether discrimination exists. Brown v. Gaston County Dyeing Machine Co., 457 F.2d 1377, 1382 (4th Cir. 1972). Static work force statistics showing a racial imbalance are probative in these cases not because the imbalance shown is in itself violative of Title VII, but because \"such imbalance is often a telltale sign of purposeful discrimination; absent explanation, it is ordinarily to be expected that nondiscriminatory hiring practices will in time result in a work force more or less representative of the racial and ethnic composition of the population in the community from which employees are hired. Evidence of longlasting and gross disparity between the composition of a work force and that of the general population thus may be significant....\" Teamsters, 431 U.S. at 339 n.20, 97 S. Ct. at 1856 n.20.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The district court analyzed, as well, general work force figures. See Appendix A. We recognize that in EEOC v. United Virginia Bank/Seaboard National, 615 F.2d 147, 150 (4th Cir. 1980), we upheld under Fed.R.Civ.P. 52(a) a finding by the district court that general labor force statistics were not an appropriate statistical group for comparison with bank employees. Without further analysis we here rely only on the specialized work force figures, which clearly support an inference that race was a factor in hiring. See Appendix B for this data.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The district court included 1968 in its charts, but the charge years included only 1969-1975. The practices apparent in 1968 are consistent with the pattern in later years. Even so, in finding an inference of discrimination we have considered only 1969-1975.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The district court applied the standard deviation analysis to the specialized work force figures, recording generalized values for the number of standard deviations revealed, as follows: Number of Standard Deviations Official-Managerial Employees Suffolk Branches Portsmouth Branches Norfolk- Portsmouth Suffolk Nansemond Portsmouth SMSA 8% 10.9% 6.9% 4.8% 1968 0-1 0-1 1-2 1-21969 0-1 0-1 1-2 1-21970 0-1 0-1 1-2 1-21971 0-1 0-1 1-2 1-21972 0-1 0-1 1-2 1-21973 0-1 0-1 1-2 0-11974 0-1 0-1 1-2 0-11975 0-1 0-1 1-2 0-1 Number of Standard Deviations Office and Clerical Employees Suffolk Branches Portsmouth Branches Norfolk- Portsmouth Suffolk Nansemond Portsmouth SMSA 10.3% 22.5% 21.5% 13.9% 1968 1-2 2-3 4-5 3-41969 1-2 2-3 5-6 4-51970 0-1 1-2 4-5 3-41971 0-1 1-2 4-5 2-31972 0-1 1-2 4-5 2-31973 0-1 1-2 4-5 2-31974 1-2 2-3 4-5 2-31975 1-2 1-2 3-4 1-2\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. In Hazelwood the Court used a standard deviation analysis to emphasize the importance of choosing the right labor pool from which to derive base data for showing statistical disparities. The Court was careful to emphasize that this was the sole purpose and that its \"observations were not intended to suggest that precise calculations of statistical significance are necessary in employing statistical proof ....\" 433 U.S. at 311 n.17, 97 S. Ct. at 2743 n.17. Noting, in paraphrase of the above-cited passage from Castaneda, that \"a fluctuation of more than two or three standard deviations would undercut the hypothesis that decisions were being made randomly with respect to race,\" id., the Court then proceeded to point out that depending upon which of two possible labor pools were chosen, the standard deviations could range from less than one to more than six. Significantly, the only direct consequence for proof assessment noted by the Court was that standard deviations of more than two or three would \"undercut\" the hypothesis of random selection. To the extent there is any implication that the low-side deviations might rebut, it may be significant that they were all less than two.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Another factor suggesting great caution in making fine-tuned use of standard deviation analysis in these cases is that its reliability diminishes in ways probably not susceptible of precise handling by courts as the binomial distribution sample diminishes in size. See W. Hays \u0026 R. Winkler, Statistics: Probability, Inference and Decision 222-26 (1971). The Supreme Court has not indicated the size samples reliably susceptible to this analysis. Castaneda, dealing with an observed figure of more than 300 in a sample of 870, referred in its discussion to the general rule \"for such large samples.\" 430 U.S. at 496 n.17, 97 S. Ct. at 1281 n.10. The smallest sample in Hazelwood where the same sort of standard deviation analysis was discussed was 123. 433 U.S. at 311 n.17, 97 S. Ct. at 2743 n.17. This is therefore the smallest sample considered by the Court in this context, as noted by the district court. 21 F.E.P. Cases at 1558 n.54. Significantly, the categories in the district court's analysis which yielded the smallest standard deviations Suffolk official/managerial employees also represented the smallest samples: four to five. We are aware that in EEOC v. United Virginia Bank/Seaboard National, 615 F.2d 147 (4th Cir. 1980), a divided panel of this court used a standard deviation analysis in respect of samples even smaller than some in the present case. That panel recognized, however, that at some point sample size affects the reliability of this mode of analysis, id. at 151, 152, and employed it there as merely one of several factors demonstrating error in a district court's factual determination that a statistically based prima facie case had been established.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. See Appendix C.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. We do not consider still another possible basis of unreliability because of a lack of factual basis for assessing it. In some cases the comparison of hires to the relevant applicant pool for rebuttal may be entirely inappropriate because the employer's discriminatory hiring practices are so well known throughout the community that blacks may be reluctant to apply because such an effort would be futile. See, e. g., Lea v. Cone Mills Corp., 301 F. Supp. 97, 102 (M.D.N.C.1969), aff'd in relevant part 438 F.2d 86 (4th Cir. 1971). There is no direct evidence to support this in the record.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. ANB contests the EEOC's assertion that the district court \"lumped\" together managerial, clerical and janitorial categories for its analysis of the applicant flow data. Brief for Appellee 31 n.15. Both parties are correct. The court combined all hires in its general analysis of the statistical disparities, 21 F.E.P. Cases at 1555-56, but separated out janitorial and managerial hires for its standard deviation analysis of the figures. Id. at 1559-60. However, in assessing the correctness of the district court's general evaluation of the applicant flow data, we note that for that purpose all employees were \"lumped\" together.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. The clerical category in Suffolk is all we consider here, given our conclusion that the prima facie case with respect to managers had been rebutted. Further, consistent with our position that where special qualifications are required the rebuttal data must also be so categorized, we approach the Portsmouth data by category and consider only the clerical hires due to the small number of managerial hires. The district court noted that two management trainees and two black service workers were hired in Suffolk during 1969-1975 and in Portsmouth in 1975. 21 F.E.P. Cases at 1559 n.57, 1560. Removing these hires and all service-worker applicants from the data, we are left with: Suffolk Branches Number of Applications Number of Hires White Black White Black 1969 22 7 4 11970 40 6 2 01971 59 20 1 11972 11 4 4 11973 60 19 7 01974 62 35 6 11975 40 6 6 1Total 294 97 30 5These figures translate into the following percentages: Percentage of Percentage of Applications Hires White Black White Black 1969 76.7 23.3 83.3 1 6.71970 87.2 12.8 100.0 0.01971 74.7 25.3 50.0 50.01972 73.3 26.7 80.0 20.01973 75.9 24.1 100.0 0.01974 63.9 36.1 85.7 14.31975 87.0 13.0 85.7 14.3Total 75.2 24.8 85.7 14.2Portsmouth Branches Number of Applications Number of Hires White Black White Black 1975 377 113 22 1These figures translate to the following percentages: Percentage of Percentage of Applications Hires White Black White Black 1976 76.9 23.1 95.7 4.3\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. The district court applied a standard deviation analysis to the office and clerical worker segments of the applicant flow figures, correctly finding the officials and managers categories of hires too small for such analysis. 21 F.E.P. Cases at 1559-60. In doing so, although the statistical and numerical comparisons were between the annual applicant pools and hires, the court analyzed the hires in relation to the qualified labor pool statistics for each city rather than the applicant pool. The court found this comparison mandated by Hazelwood and Castaneda. Id. at 1556 n.53. We find no such rule emanating from either case, noting that Hazelwood's discussion was merely collateral given that the Court ordered a remand to the district court for further findings on that data, 433 U.S. at 313, 97 S. Ct. at 2744, and pointing out also that Castaneda's comparison of jury composition to general population figures was not only logical but unavoidable because juries are not selected from applicants but from the citizenry at large. Further, it is manifestly incorrect to compare hires with the applicant pool and then test these statistical comparisons by a standard deviation analysis based on different population statistics. Therefore, the district court's particular use of the standard deviation analysis was without legal or factual basis, and we disregard it entirely. Because of the demonstrated unreliability of these figures there is no need to attempt a correct reanalysis of the statistical significance of these disparities.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. The district court also examined a number of specific practices \"which the EEOC, before and at trial, suggested were discriminatory.\" 21 F.E.P. Cases at 1560. Many of these allegations were made in the reasonable cause determination but were apparently not actively pursued at trial. The district court stated repeatedly in evaluating these claims that the EEOC put on no evidence to support them. We find no error in the resulting findings and conclusions regarding the discriminatory effect of retail credit checks, the requirement for a high school diploma, the requirement for character and employment references, testing, the failure to correspond with applicants or college education as a negative factor. To the extent the EEOC's failure to follow up charges with attempted proof reflected irresponsible broadside charging a conclusion apparently drawn by the district court we obviously do not condone the practice and indeed approve the district court's implicit condemnation of it. This does not, however, relieve either that court or this one of the obligation to subject evidence actually adduced of other hiring practices to independent, objective evaluation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The district court concluded at one point that the only word-of-mouth recruiting shown was that involving some affirmative efforts made by ANB to recruit qualified black employees, and that this obviously did not tend to prove discriminatory motive in hiring. While the court did consider and reject other suggestions of word-of-mouth recruiting, its apparent perception that this was the only direct evidence on the issue in the record clearly influenced the ultimate conclusion that the EEOC had failed to establish word-of-mouth recruiting as its primary hiring procedure. This completely warps the meaning and significance of the term in the context of Title VII litigation. As developed in this context, the term connotes a passive dependence for applicants upon informal advertising of vacancies through employees' communications to friends, relatives and acquaintances and upon walk-in applicants, rather than upon systematic public advertising designed to reach the qualified available labor pool. There was of course substantial direct evidence in the record of word-of-mouth recruiting so understood. Significantly, the court did not find and ANB does not contend that the affirmative action recruiting effort upon which the court focused in assessing the claim of word-of-mouth recruiting produced any results. Properly assessed this evidence simply shows one episodic means of recruiting used by ANB within an unmistakable general pattern of word-of-mouth recruiting assuredly not aimed specifically at blacks whether or not deliberately aimed to exclude them.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Of the sixty-five hires, ten were black. Of these, two, or 20%, had listed friends or relatives on their applications. 21 F.E.P. Cases at 1565. Of the ten blacks hired, four were hired as service workers, including the two who listed friends on their applications. Comparing proportions of white and black hires listing friends, and noticing the percentage of black service workers who listed friends, we must eliminate the hypothesis that listing friends was a minor factor: Listing friends/relatives Number Percent of total Total hires 65 32 49.2 White hires 55 30 54.5 Black hires 10 2 20 Black serviceworker hires 4 2 50 Black non-serviceworker hires 6 0 0\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. General Electric was reaffirmed in EEOC v. Chesapeake \u0026 Ohio Ry., 577 F.2d 229, 231-32 (4th Cir. 1978). In Bridgesmith, Representing the Title VII Class Action: A Question of Degree, 26 Wayne L.Rev. 1413, 1417 (1980), the writer says: \"Although courts are not overly restrictive in interpreting the administrative prerequisites to suit, a clear circumvention of the administrative scheme will result in the dismissal of the initial complaint. In Jerome v. Viviano Food Co., 489 F.2d 965 (6th Cir. 1974), the plaintiff filed a charge of sex discrimination with the EEOC but did not obtain a right to sue notice from the EEOC before instituting suit in federal court. The court granted the defendant's motion for dismissal, holding that an EEOC opportunity for investigation and conciliation is at the heart of the Title VII remedy and may not be avoided by a litigant in order to bring a judicial complaint. (Id. 966; accord, Troy v. Shell Oil Co., 378 F. Supp. 1042 (E.D.Mich.1974), appeal dismissed as moot, 519 F.2d 403 (6th Cir. 1975)). \"An obvious problem exists when the Title VII litigant is empowered to bring a judicial complaint which differs materially from that which was brought with the EEOC. If continuity is lacking between the administrative relief afforded by Title VII and a subsequent judicial proceeding, the administrative first step would be illusory. As a matter of due process to be afforded Title VII defendants, there should be some basic relationship between the judicial complaint and the EEOC charge which preceded it. There has never been a question that the EEOC charge and subsequent judicial complaint should somehow relate to one another. Much litigation has taken place, however, concerning the degree to which synonymy is required. \"One commentator stated that the applicable principle is one of affording the charged party with an opportunity for rebuttal. (See Smalls, supra, note 6, at 830, (28 S.C.L.Rev.)). Therefore, if a substantially different issue arises late in the investigatory or conciliation process, the charged party has no opportunity to rebut. Rebuttal, in the nature of an opportunity to be heard, is necessary for the protection of due process. The question is clearly one of fact, and relatedness between an EEOC charge and a judicial complaint should be dependent upon adequate notice to the charged party and ample time to be heard.\" (Emphasis in text)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Quoting from EEOC v. E.I. DuPont de Nemours \u0026 Co., 373 F. Supp. 1321, 1326 (D.Del.1974).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. In Patterson v. American Tobacco Co., 535 F.2d 257, 272 (4th Cir. 1976), we said \"that the commission's statutory duty to attempt conciliation is among its most essential functions;\" and, in EEOC v. General Electric Co., 532 F.2d at 363, we added that \"the opportunity to conciliate is a crucial issue in determining the issues open for adjudication in the civil suit.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. See Bridgesmith, supra, 26 Wayne L.Rev. 1413.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. This case later came before the court in 586 F.2d 300 (1978), and in 634 F.2d 744 (1980).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Just as in EEOC v. United Bank/Seaboard National, 615 F.2d 147, 149 (4th Cir. 1980): \"there is no claim of other racial discrimination in such things as promotions, transfers, pay, etc., which, as often as not, appear in litigation of this nature.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The majority concedes that the evidence was insufficient to support a finding of discrimination in connection with hiring in the officer/manager category. We are thus only concerned with hirings in the office/clerical category.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. In this discussion of the merits of the claim, we deal with the Portsmouth branch as well as the Suffolk branch, though, under what I conceive to be the proper issue in the case, the Portsmouth branch operation should have no place in this discussion. Since, however, the majority has dealt with the Portsmouth branch as properly within the issues and since, as I view it, there is no basis for an action involving the Portsmouth branch, I have chosen to deal with the Portsmouth branch despite my firm opinion that the court in this case should never have considered the Portsmouth branch as a proper subject of inquiry here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. See the language of Justice White in Hazelwood, quoted later, 433 U.S. at 347-48, 97 S. Ct. at 2748-49.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Stipulations 37 and 38.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The use of Nansemond County as a labor source in establishing the relevant labor pool is, in my opinion contrary to recent precedent both of this and other circuits. The proper standard for establishing the labor market in this context is derived from an applicant flow analysis. We, in effect, held this in United States v. Fairfax County, 629 F.2d 932, 940 (4th Cir. 1980). In rejecting SMSA statistics in favor of applicant flow data, we said: \"At the outset, we note that applicant data are normally highly relevant evidence of an employer's labor market. See, Hazelwood School District v. United States, 433 U.S. at 308 n. 13, 97 S. Ct. at 2741 n. 13. Those who apply constitute the pool from which employees are selected.\" The same rule was stated by the Fifth Circuit in Markey v. Tenneco Oil Co., 635 F.2d 497, 500-501 (5th Cir. 1981), where the Court suggested that, in determining the relevant labor pool, it was appropriate to \"assign a statistical weight to the percentage of blacks in each parish (the employment area) based on that parish's contribution to the applicant pool. Absent discriminatory recruiting practices, the percentage of applicants from a particular parish may be probative of the willingness of individuals in that parish to travel to the Tenneco plant and of the relative accessibility of the plant to residents of the parish, and thus be a more accurate measure of that parish's contribution to Tenneco's labor pool. The trial court should, of course, consider any evidence that helps define the areas from which Tenneco would normally be expected to draw its employees.\" If we apply this standard, Nansemond County should be eliminated from the relevant labor pool and Suffolk should be treated as the sole source. Thus, the undisputed evidence establishes: Of the alleged discriminatees at the Suffolk branch, all were residents of Suffolk. Again, in the EEOC listing of black applicants denied employment discriminatorily in its answers to interrogatories, every applicant was at the time a resident of Suffolk. (See Appendix pp. 1660-1661) The record does not list a single applicant at Suffolk who lived in Nansemond County. The use of Nansemond County as a source of employment applicants is accordingly unsupported by the record and the proper labor pool, if we apply as we should applicant flow, in Suffolk.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. But two of the Portsmouth applicants identified by the EEOC as alleged discriminatees lived elsewhere than in Portsmouth at the time. One of these lived at Chesapeake; the other who lived at Virginia Beach applied for a job as a manager and was not interested in a office/clerical job. Thus, the use of the Norfolk area as a labor pool for employment by the bank at the Portsmouth branch, also, seems unjustified for the same reasons stated in Note 11.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The burden in such a case is not one of \"convincing\" but only one to \"produce admissible evidence which would allow the trier of fact rationally to conclude that the employment decision had not been motivated by discriminatory animus.\" Texas Dept. of Community Affairs v. Burdine, 450 U.S. 248, 101 S. Ct. 1089, 1096, 67 L. Ed. 2d 207 (1981). For a recent restatement of this, as it applies particularly to statistical evidence, see the remand of Johnson v. Uncle Ben's, Inc., 628 F.2d 419 (5th Cir. 1980), by the Supreme Court for reconsideration in the light of Burdine, 451 U.S. 902, 101 S. Ct. 1967, 68 L. Ed. 2d 290 (1981).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Counsel for the EEOC in this outline of his theory of the case was making a statement of the classical disparate treatment formula of McDonnell Douglas v. Green, 411 U.S. 792, 93 S. Ct. 1817, 36 L. Ed. 2d 668 (1973). Implicit in it was the recognition on the part of the EEOC that ultimately and finally in this case, with its small number of hiring decisions involved over a substantial span of time and with the number of potential discriminatees specifically identified, no real pattern or practice of discrimination could be established unless the EEOC was able to prove that all or at least a substantial number of the hiring decisions made by the defendant were racially tainted by the refusal to hire one or more of the potential discriminatees. See International Brotherhood of Teamsters v. United States, 431 U.S. 324, 336, 97 S. Ct. 1843, 1855, 52 L. Ed. 2d 396 (1977).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Castaneda v. Partida, 430 U.S. 482, 97 S. Ct. 1272, 51 L. Ed. 2d 498 (1977).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. The majority, I submit, indicates in this sentence, fatal misunderstanding of the burdens on the respective parties in the McDonnell Douglas context. When the plaintiff in a McDonnell Douglas type case makes out a prima facie case, the burden on the defendant is merely to produce \"evidence that the plaintiff was rejected, or someone else was preferred, for a legitimate, nondiscriminatory reason. The defendant need not persuade the court that it was actually motivated by the proffered reasons.\" Texas Dept. of Community Affairs v. Burdine, -- - U.S. at -- , 101 S. Ct. at 1094. The burden of the plaintiff then is \"to demonstrate that the proffered reason was not the true reason for the employment decision\" and that burden then \"merges with the ultimate burden of persuading (a burden which rests on the plaintiff throughout the trial) the court that she has been the victim of intentional discrimination.\" Id., -- - U.S. at -- , 101 S. Ct. at 1095; see also the Supreme Court's remand of Johnson v. Uncle Ben's, Inc., (628 F.2d 419 (5th Cir. 1980)), 49 L.W. 3787.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. See Hazelwood, supra, 433 U.S. at 308 n. 14, 97 S. Ct. at 2742 n. 14: \"A precise method of measuring the significance of such statistical disparities (between qualified work force and hirings) was explained in Castaneda v. Partida, 430 U.S. 482, 496-497 n. 17, 97 S. Ct. at 1281 n. 17 .... It involves calculation of the \"standard deviation' as a measure of predicted fluctuations from the expected value of a sample.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. For an interesting comment in this regard, see Lerner, Employment Discrimination: Adverse Impact, Validity, and Equality, Supreme Court Review (1979) 17 at 32-33: \"The inappropriateness of comparisons between the racial makeup of the general population and that of an employer's work force is evidenced by the obvious fact that general population figures count children equally with adults, and few children have the strength, skill, and attention span needed to drive heavy trucks. In more general terms, as long as we have child labor laws, general population figures will always produce gross overestimates in the labor force of any area. To dismiss this fact in making group comparisons as if the error were a constant one is simply wrong. We know that the ratio of children to adults differs markedly in different groups at different times and places, as does the ratio of older, retired people to active adults. As a result, the overestimation will often be significantly greater for some groups than for others.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. I confine my discussion to the office/clerical category because, as I have already noted, the majority concedes there is insufficient evidence to sustain a finding of hiring discrimination in the officer/manager classification for the relevant period.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. See EEOC's Exhibit # 41, set forth at page 1561 of the Appendix. This fact is confirmed in EEOC's report of investigation where it states 5 persons were employed in this category, one of whom was black. Incidentally, this was the only investigation, limited as it was basically to the year 1969, made by the EEOC before it filed its suit.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. See note 9.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. The black hiree in 1974 was Gwen Bethea and in 1975 Karen Estes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. In looking at the Nansemond County figures, we must remember that it was the admitted policy of the bank to favor those applicants living near the branch (a practice which would work against employment from Nansemond County) and apparently Nansemond County individuals were not attracted to apply at the Suffolk branch. This latter fact is evident from the fact that, of the 51 discriminatees charged to have been discriminated against, not one who applied at the Suffolk branch was from Nansemond County. The use of Nansemond County statistics, in evaluating employment at the Suffolk branch, is at best of minimal value.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Similarly there is no difference either between the district court and the majority, or between the majority and myself, over the agreed legal rule applicable to this claim. The EEOC must prove, in order to establish a claim of discriminatory practice in hiring, more than \"the mere occurrence of isolated or \"accidental' or sporadic discriminatory acts\" in hiring; it must prove that racial discrimination in such hiring over the period in the two classifications in issue was \"the standard operating procedure\" of the defendant. International Brotherhood of Teamsters v. United States, 431 U.S. 324, 336, 97 S. Ct. 1843, 1854-55, 52 L. Ed. 2d 396 (1977).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. See note 17.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. 430 U.S. at 497 n. 17, 97 S. Ct. at 1281 n. 17.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. This accords with what was said in Teamsters, supra, 431 U.S. at 336, 97 S. Ct. at 1854-1855.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. See also Teamsters, supra, 431 U.S. at 336, 97 S. Ct. at 1854-1855.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. In Note, Title VII Employment Discrimination Use of Demographic Statistics as Prima Facie Evidence of Discrimination, 25 N.Y.L.S.L.Rev. 759, 578 (1980), the commentator said: \"In essence, the utility of statistics in Title VII actions is based upon the frequency theory of probability.\" See also, Braun, Statistics and the Law: Hypothesis Testing and Its Application to Title VII Cases, 32 Hastings L.J. 59, 69-70 (1980).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Texas Dept. of Community Affairs v. Burdine, supra, -- - U.S. at -- , -- , 101 S. Ct. at 1094.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. The applicant flow can, of course, be tainted if the employer has, by its conduct, discouraged black applicants in the relevant labor market from applying. There is no contention by the Commission and no finding by either the district court or by the majority here that the defendant engaged in such conduct.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. For a comment on Beazer, see, Note, Title VII Employment Discrimination Use of Demographic Statistics as Prima Facie Evidence of Discrimination, 25 N.Y.L.S.L.Rev. 759 (1980).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Such a factual finding by the trial court may only be reversed for clear error. Such was the standard followed in Burdine, -- - U.S. at -- , 101 S. Ct. at 1093, and in Danzl v. N. St. Paul, etc. School District, 642 F.2d 1109, 1114 (8th Cir. 1981).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. The program under the Executive Order is described in Note, 31 A.L.R.Fed. 1800. The actual orders are set forth as a note to 42 U.S.C. ยง 2000e.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. EEOC's witness Emile Cardiel testified that the report of the \"Compliance Review of American National Bank,\" dated September 27th, 1973, based on an investigation of the defendant's hiring policies at its offices, \"that the Government was satisfied with the bank's affirmative program and with its hiring policies.\" He later added, the report stated, \"that everything was all right,\" so far as the defendant's hiring policies or practices were concerned.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. See note 18 majority opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. This conclusion is in accord with the recent decision in Heagney v. University of Washington, 642 F.2d 1157, 1163 (9th Cir. 1981).\u003c/span\u003e\n\n",
    "body_length": 189811,
    "citedas": [
      "652 F.2d 1176"
    ],
    "attorneys": "William H. Ng, EEOC, Washington, D.C. (Leroy D. Clark, Gen. Counsel, Joseph T. Eddins, Associate Gen. Counsel, Beatrice Rosenberg, Asst. Gen. Counsel, EEOC, Washington, D.C., on brief), for appellant. Thomas J. Manley, Richmond, Va. (Paul M. Thompson, Jack W. Burtch, Jr., Hunton \u0026 Williams, Richmond, Va., on brief), for appellee.",
    "category": [
      "128",
      "27"
    ],
    "judges": "Before Butzner, Russell and Phillips, Circuit Judges.",
    "citation_count": 130
  }
}
