{
  "id": "Fs_3YWYBTlTomsSBjT4v",
  "document": {
    "title": "Campbell County School Dist. v. State",
    "full_title": "CAMPBELL COUNTY SCHOOL DISTRICT, STATE OF WYOMING; ET AL. (PLAINTIFFS), v. STATE OF WYOMING: DIANA J. OHMAN, STATE SUPERINTENDENT OF PUBLIC INSTRUCTION; ET AL. (DEFENDANTS), AND BIG HORN COUNTY SCHOOL DISTRICT NO. ONE, STATE OF WYOMING, ET AL. (INTERVENING ). STATE OF WYOMING: DIANA OHMAN, SUPERINTENDENT OF PUBLIC INSTRUCTION; DAVE FERRARI, STATE AUDITOR; NEDOLYN TESTOLIN, MICHAEL GLODE, KAREN MOULTON, LYNN DICKEY, LYNN MESSENGER, ELIZABETH FIELD, JUDY CAMPBELL, CHARLOTTE LEVENDOSKY, JACK IVERSEN, WAYNE MORTENSEN, AND JOHN ANDRIKOPOULOS, MEMBERS OF THE WYOMING STATE BOARD OF EDUCATION (DEFENDANTS), v. CAMPBELL COUNTY SCHOOL DISTRICT, STATE OF WYOMING, ET AL. (PLAINTIFFS), AND LARAMIE COUNTY SCHOOL DISTRICT NO. ONE, ET AL., AND WYOMING EDUCATION ASSOCIATION (INTERVENING ). LARAMIE COUNTY SCHOOL DISTRICT NUMBER ONE, STATE OF WYOMING (INTERVENING ), v. DIANA OHMAN, SUPERINTENDENT OF PUBLIC INSTRUCTION, STATE OF WYOMING, ET AL. (DEFENDANTS), AND BIG HORN COUNTY SCHOOL DISTRICT NO. ONE, STATE OF WYOMING, ET AL. (INTERVENING ). WYOMING EDUCATION ASSOCIATION (INTERVENING ), v. DIANA OHMAN, SUPERINTENDENT OF PUBLIC INSTRUCTION, STATE OF WYOMING, ET AL. (DEFENDANTS), AND BIG HORN COUNTY SCHOOL DISTRICT NO. ONE, STATE OF WYOMING, ET AL. (INTERVENING ). BIG HORN COUNTY SCHOOL DISTRICT NO. ONE, STATE OF WYOMING, ET AL. (INTERVENING ), v. CAMPBELL COUNTY SCHOOL DISTRICT, STATE OF WYOMING, ET AL. (PLAINTIFFS), AND LARAMIE COUNTY SCHOOL DISTRICT NO. ONE, ET AL., AND WYOMING EDUCATION ASSOCIATION (INTERVENING ).",
    "jurisdiction": "Wyoming Supreme Court",
    "date": "1995-11-08T00:00:00.000Z",
    "docket": "Nos. 94-136 thru 94-140.",
    "body": "GOLDEN, Chief Justice.\n\nThe question before us is the constitutionality of Wyoming's public school finance system. Four Wyoming school districts (Campbell County School District No. One, Uinta County School District No. One, Sweetwater County School Districts Nos. One and Two) brought suit in January 1992, against the State of Wyoming, the State Superintendent of Public Instruction, the State Board of Education and others \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e seeking declaratory and injunctive relief against the state by claiming certain components of the Wyoming public school finance system were unconstitutional under the Equal Protection Section of the Wyoming Constitution (Art. 1, § 34) and the Education Article of the Wyoming Constitution (Art. 7, §§ 1-23). After the state defendants answered with a denial that the identified components of the finance system were constitutionally infirm, a coalition of twenty-three school districts \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e intervened as defendants aligned with the state defendants. Later, Laramie County School District No. One and the Wyoming Education Association intervened as plaintiffs and aligned with the initial challengers of the school finance system. These intervenors identified other components of the school finance system which were allegedly unconstitutional. Thus, as the issues were joined, the challengers attacked five components of the school finance system: the divisor feature, the municipal divisor feature, the recapture feature, the optional mills feature, and the capital construction feature.\n\nFollowing a three-week trial in October 1993, the District Court, First Judicial District, Laramie County, declared three components of the school finance system — the municipal divisor feature, the recapture feature, and the optional mills feature — unconstitutional. The state defenders have appealed that decision. With respect to the divisor and capital construction features of the school finance system, the district court declared them to be constitutional. The challengers have appealed that decision.\n\nWe affirm the district court's decision that the municipal divisor, recapture and optional mills features of the school finance system are unconstitutional. We reverse the district court's decision that the divisor and capital construction features are constitutional. In other words, we hold Wyoming's public school finance system is unconstitutional.\n\nISSUES\n\nIn their various briefs, the parties have stated many issues. We believe those issues may be succinctly summarized as follows:\n\n1. Whether the court's exercise of its judicial power to declare school finance system statutes unconstitutional violates the doctrine of separation of powers?\n\n2. Whether the court must apply a rational basis or strict scrutiny standard of review to determine the constitutionality of the school finance system statutes?\n\n3. Applying the appropriate standard of review to the challenged components of the school finance system, whether these components are constitutional? \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nIn addressing these issues, we are cognizant of several factors, including: our prior decision in Washakie County Sch. Dist. No. One v. Herschler, 606 P.2d 310 (Wyo. 1980), cert. denied, 449 U.S. 824, 101 S.Ct. 86, 66 L.Ed.2d 28 (1980), in which we declared public education is a fundamental right under our state constitution and struck down the then-existing school finance system under the equal protection provision of our constitution; the post-Washakie reform measures; the workings of the challenged financing system as a whole; the filing of the present action and the procedural manner in which the district court managed this action; the district court's decision; and the language of the education provisions of our constitution and the education system implemented under those constitutional provisions. Each of these will be considered below.\n\nBACKGROUND\n\nWashakie\n\nBefore 1980, local ad valorem taxes generated a substantial portion of the funding to the state's elementary and secondary public schools. Over the years, the development of in-place mineral wealth created disparity in those local resources so great as to engender a challenge to the school finance system. In Washakie, we declared public education a fundamental right under the state constitution and we held the then-existing school finance system unconstitutional because it failed to afford equal protection, in violation of the Wyoming Constitution. In so holding, we isolated no particular statute, but instead examined \"the entire system from organization of school districts through tax bases and levies and distribution of foundation funds, all of which have a bearing upon the disparity which exists.\" Washakie, 606 P.2d at 335.\n\nThis court, in Washakie, expressed its understanding \"that there are special problems and amounts may be distributed in a mode similar to the foundation fund which takes into consideration various balancing factors.\" Washakie, 606 P.2d at 336. We remarked that \"[a] state formula can be devised which will weight the calculation to compensate for special needs — educational cost differentials,\" id., and indicated our awareness\n\nthat the formula that will provide equality will be quite complex. More money may be needed in one school district to achieve quality education than in another because of, e.g., transportation costs, building maintenance costs, construction costs, logistic considerations, number of pupils with special problems, et cetera. However, it is not a problem that cannot be solved, challenging though it might be.\n\nId. at 315, n. 3.\n\nThis court clearly expressed its view that \"until equality of financing is achieved, there is no practicable method of achieving equality of quality.\" Washakie, 606 P.2d at 334. This equality, we concluded, extends to the financing of physical facilities with which to carry on the process of quality education, which financing we found was \"tarred with the same brush of disparate tax resources.\" Id. at 337. We commented that \"statewide availability from total state resources for building construction or contribution to school buildings on a parity for all school districts is required just as for other elements of the educational process.\" Id.\n\nIn Washakie, this court, having examined the \"entire system,\" emphasized the legislature's goal \"is to arrive at financial parity.\" Id. We had confidence the legislature would meet the challenge of fulfilling its constitutional duties to \"provide for the establishment and maintenance of a complete and uniform system of public instruction,\" WYO. CONST. ART. 7, § 1, and \"make such further provisions by taxation or otherwise, as with the income arising from the general school fund will create and maintain a thorough and efficient system of public schools, adequate to the proper instruction of all [school age] youth of the state. . . .\" WYO. CONST. ART. 7, § 9.\n\nPost-Washakie: School Finance Reform Measures\n\nAs explained in Washakie, Wyoming apportions funds to the school districts from the Foundation Program. Several revenue sources either fund the program or reduce the amount of foundation support received by the school districts. Washakie, 606 P.2d at 322. Following our decision, a select committee of the Wyoming legislature assembled for the purpose of recommending modifications of the finance formula to the entire legislature. The committee addressed those infirmities identified by this court and, ultimately, the legislature enacted statutes to redesign financing, including a mandated local twenty-five mill levy, \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e a state twelve mill levy and a county six mill levy. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e In response to Washakie's holding that school funding must depend upon state wealth and not local wealth, the select committee proposed solutions to redistribute some local wealth to other districts. Those solutions culminated in an amendment to the state constitution authorizing the legislature to \"recapture\" revenues generated by the local twenty-five mill school levy which exceeded an amount determined by formula. Local wealth remained a factor in the system, however, when the optional mill levy was made available to the school districts according them the option of levying another six mills for their own use.\n\nIn 1983, legislation implemented financing's redesign. The legislature declared, however, the redesigned system was only transitional and ultimately would be succeeded by a new system designed to more accurately measure costs of education. The 1983 legislature stated its reasons in the preamble of the legislation:\n\nThe Wyoming legislature in enacting this act is cognizant of the Wyoming supreme court decision of Washakie County School District v. Herschler (1980) and has received reports, projections of revenue and recommendations relative to this act from a select legislative committee assisted by an advisory commission. The Wyoming legislature recognizes and acknowledges its responsibility in providing for a complete, uniform, thorough and efficient system of public schools. The Wyoming legislature following public hearings, debate and deliberation leading to the adoption of this act makes the following findings:\n\n1. The issues of equitable funding of public education in Wyoming involve more than measurements of differences in funding per student between school districts and a corresponding attempt to lessen the disparity unless consideration is given to factors such as increased costs of education in rural districts, equality of programs in rural districts, extraordinary requirements for funds in impacted school districts due to an influx of students and special needs of special students.\n\n2. Massive transfers in revenue from certain districts to other districts to achieve equality of funding have the potential to impair the quality of education in districts from which funds will be taken which dictates that transfers of revenue should be undertaken over a period of time to allow adjustment to decreased revenues in those districts.\n\n3. The Wyoming legislature is committed to reducing the disparity in funding education among school districts. Studies involving costs of education indices and methods of providing program equity will be completed by the state department of education and school districts for consideration by the 1984 legislature. In the absence of absolute guidelines in recapturing revenue from certain districts and distributing revenues to meet the above concerns, this act, for the time being, provides for varying rates of recapture among districts subject to recapture and a phase-in period, and for a new system of divisors to convert the number of students in a district to classroom units giving a greater weighting to rural schools to allow for a reasonable and rational transition to a new system designed to more accurately measure costs of education.\n\n1983 WYO.SESSION LAWS, Ch. 136, p. 399-400.\n\nThe legislature never studied, enacted, or implemented a new cost-based system and the 1983 interim system became permanent. Former state superintendents of public instruction, legislators, and challenger school district superintendents testified at the trial of this case that their numerous attempts to persuade the legislature to reflect cost differentials in the system were unsuccessful.\n\nOverview of the School Finance System\n\nBefore discussing the evidence presented at trial, we find it useful to sketch the general contours of the challenged statutory scheme for raising and distributing funding for Wyoming's public elementary and secondary schools.\n\nThe Wyoming statutes reflect the complexity of the education financing scheme. Borrowing from what has been said elsewhere, \"[i]f lack of clarity alone were sufficient to strike these statutes down, this case would be less difficult. We are fortunate, however, that the parties share a common understanding of how [Wyoming's] public schools are financed.\" Roosevelt Elem. School Dist. v. Bishop, 179 Ariz. 233, 236-37, 877 P.2d 806, 809-10 (1994). We are also fortunate one of the exhibits at trial was a booklet entitled THE WYOMING SCHOOL FOUNDATION PROGRAM — A BRIEF LOOK AT OPERATIONS AND FUNDING (1990-91 Edition), prepared by Barry W. Nimmo of the State Department of Education, who was a witness called by both sides at trial. Fifty-five pages in length, this booklet provides a helpful overview of the financing scheme and is the primary source for the following sketch of the financing scheme.\n\nPublic education funding in Wyoming is shared by the local school district and the state through the State Foundation Program. Under the present statutory scheme, the level of education funding which can be raised is primarily a function of a mixture of state and local property taxation along with certain fines and fees. To calculate its level of funding, a school district must use a statutory formula defined by the legislature.\n\nEmploying the statutory formula, each school district computes the amount of funding to which it is entitled called the foundation guarantee. The school district then computes the amount of funding it will generate through local taxes, fines, and fees. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e When local revenues are less than the guarantee, that difference is paid to the school district as a foundation entitlement. When local revenues exceed the guarantee, then the school district does not receive a state entitlement. In some cases, excessive local revenues result in the school district's rebating a certain amount to the state. That amount is known as foundation recapture and is rebated to the foundation fund for eventual redistribution to the rest of the school districts. In addition to a foundation guarantee based upon enrollment, past expenditures for \"add-ons\" \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e are also calculated to determine the total amount of the foundation guarantee. Under the statutes, school districts are reimbursed for 75% of their transportation expenditures and 85% of their special education expenditures.\n\nPresently, the legislature bases the allocation of funding to school districts on school district enrollment and additional expenditures such as transportation, special education and vocational education. Although a foundation program can allocate on a per pupil basis, the Wyoming legislature has designed a formula which assigns classroom units (CRU) to school districts based upon a school district's average daily membership (ADM). ADM is a more precise determination of the number of students actually in attendance on average. The number of CRUs assigned to each school district is based on a schedule of divisors that specifies the number of CRUs for particular ADM levels and is also dependent upon whether the particular school is an elementary, junior high, or high school. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Once the number of CRUs for each school district is calculated, that number is multiplied by the legislatively determined classroom value for the state guarantee amount. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e In 1992, the classroom unit value was $92,331.00. The classroom value is set by the legislature based upon assumption and is not based on any cost study or analysis. The schedule of divisors set by statute is also the product of legislative assumptions and is not based on any cost study or analysis.\n\nAs the formula described above demonstrates, the divisor is a critical element in determining the number of classroom units for each school district and, consequently, the amount of revenue a school district will receive. A higher divisor lowers funding. Another critical element which can limit a school district's funds is the municipal divisor feature which treats all schools as one school when within an incorporated city or town or within five miles of an incorporated city or town. In effect, the various populations of schools within a single municipality are aggregated, thus resulting in a higher assigned divisor. Finally, the formula permits recalculation for school districts which actually have higher student populations than estimated.\n\nLocal school districts may also generate funds through the optional mill levy. Optional mill levy funds are outside of the Foundation Program and will not reduce a school district's state entitlement. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e A school district can levy three mills to fund operations and three mills to fund maintenance. Four of these six mills cannot be levied without voter approval. The amount of funding these mills generate is completely dependent upon assessed local property values and wealthy districts can thus raise more money per mill. To assist poorer districts where a mill raises less than the state average assessed property valuation, the state \"power equalizes\" one voter-approved mill in each category. Power equalization generates funding based upon the state average rather than the local district's assessed property valuation, resulting in greater funding for the school district should the voters approve the mill levy.\n\nFunding for capital construction is also distinct from the Foundation Program. Under a separate statutory scheme, school districts generally fund their new building needs and building renovation and repair needs by issuing bonds for capital construction. The constitutional debt limit for bonding is 10% of assessed valuation. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e WYO. CONST. ART. 16, § 5. Entitlements were available to those districts exceeding their bonding capacity, but in 1988, the legislature began diverting those funds to school operations. Statute authorizes the state to partially supplement low valuation districts up to the state average assessed valuation, but the supplement does not benefit districts exceeding bonding capacity. Additionally, the supplement is inadequately funded and does not satisfy current district demands and is, therefore, prorated. The legislature has established a capital facilities loan and grant program and appropriated $5 million statewide. In emergencies, the legislature grants funding on a case-by-case basis.\n\nThe Present Action and Procedural Background\n\nIn the decade since Washakie, the legislature has changed, modified and adjusted different components of the finance system at different times; no legislative study, however, has ever been conducted to determine whether these changes reduced, eliminated or increased funding disparity per pupil in violation of Washakie. In 1992, certain school districts again challenged the finance system and presented evidence that over the last decade the changes to the finance system had increased and exacerbated the funding disparity identified in Washakie. Those school districts, representing 35% of Wyoming's students, \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e sought a declaratory judgment that the present finance system is unconstitutional under Washakie, claiming unjustifiable disparity and denial of equal educational opportunity.\n\nThe challengers claimed wealth-driven disparities and irrational, arbitrary spending disparities were created by the present system's methods for collecting and distributing revenue and funding capital construction. Statutes challenged for causing wealth-driven disparities were those authorizing the optional mill levy, the 109% recapture level, and capital construction funding. The specific statutes challenged for causing irrational, arbitrary spending disparities were those authorizing the divisor, the municipal divisor, and recalculation. Alleging these statutes caused funding disparities unjustified by cost differentials, the challengers asserted that funding disparities which were wealth-based or not cost-justified were unconstitutional under Washakie's requirement of equality of financing in order to achieve equality of quality education.\n\nIn response, the defenders asserted the challengers had the burden of proving funding disparities existed and those disparities were wealth-based or not based upon cost differentials. According to the defenders, only disparities proved unjustified by cost or wealth-driven disparities were unconstitutional. Additionally, the defenders asserted the challengers must prove clearly and exactly beyond any reasonable doubt that the challenged features significantly deprived, infringed upon, or interfered with their educational rights. As an affirmative defense, the defenders further asserted that disparities which were necessary in order to achieve program equity between school districts were not unconstitutional.\n\nBefore trial, the district court ruled that funding disparities which were not wealth-driven, but instead were the result of the legislative distribution formula, did not invoke strict scrutiny analysis. The district court ruled the challengers bore the burden of proof that these disparities were not cost-justified. The district court ruled the challengers would meet their burden by proving the following three elements:\n\n1. A funding mechanism resulting in a disparity of funds per pupil, not justified by cost differences;\n\n2. That such unjustified disparity exists by virtue of an irrational feature in the formula adopted by the legislature;\n\n3. That such formula results in a persistent and intractable condition of disparity not justified by costs.\n\nThe district court determined, pursuant to the logic of Washakie, the challengers were not required to demonstrate that unjustified disparity caused harm to educational opportunity; harm was presumed. Although before trial the district court made clear that strict scrutiny analysis would not apply to funding disparities which were not wealth-based, the district court after trial reconsidered what level of scrutiny would be applied to the various challenged statutes. Upon reconsideration the district court ruled that strict scrutiny would be applied to the recapture feature, to the optional six mills levy, and to the capital construction feature and that a form of rational basis scrutiny in the nature of equitable distribution would be applied to the distribution formula components. The district court determined that the equitable distribution/rational basis test described in its pre-trial decision letter left room for more judicial scrutiny than that embodied by the broadest form of the rational basis test. That heightened standard derived from Art. 7, § 8 of the Wyoming Constitution which the district court determined required a distribution formula which provided for \"equitable allocation.\"\n\nTrial\n\nAs party litigants, the school districts divided by size; large districts positioned as plaintiffs and small districts intervened on behalf of the state as defendants. The large districts insisted the suit was necessary because the quality of education was sacrificed by failure to fund their actual operating costs for basic education, resulting in a failure to afford their students an equal opportunity to a quality education. Additionally, the large districts identified a number of problem areas which require special programs or efforts and add to their costs. Because funding distribution was not based upon costs and because funding was further limited by the interaction of the funding components, these efforts were adversely affected. The small districts, fearing this lawsuit would result in redistribution of the current funding in order to alleviate the severe shortfalls suffered by the large school districts suing as plaintiffs, presented evidence that while the smaller districts are unable to offer the enriched educational program provided by the large districts, the current method of funding is properly weighted in their favor and permits them sufficient operating revenue for the most minimal educational program.\n\n1. Distribution Formula Evidence\n\na. Divisor System\n\nThe challengers alleged, the defenders did not dispute and the district court accepted that the divisor system produced wide disparities in funding on a per student basis, \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e between schools \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e and between school districts. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e At trial, the challengers presented a cost of education study (Harvey study) as evidence that the per pupil funding disparities were not based on cost differentials. This evidence was unpersuasive to the district court on this point. The district court found the study did not account for cost differentials incurred because of small school districts' support of multiple learning centers dispersed throughout that district. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e That study failed to reflect the obvious cost problems associated with maintaining multiple learning centers. Further, the study did not extend any assurance to the smaller districts that their students would not suffer disproportionate adverse consequences, such as the closing of \"necessarily small schools.\" \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nAs evidence the funding disparities created by the divisor system resulted in disparities in educational opportunities between districts, the challengers also presented a paired district study (Van Mueller study) comparing programs. The district court found this study failed to establish differential access to revenue created disparities in educational opportunity in Wyoming.\n\nThe challengers did not rely exclusively on studies, but presented evidence demonstrating the divisor system failed to adjust for actual educational costs in violation of Washakie. Witnesses for both sides testified that factors associated with each school district caused some to have higher utility costs, higher transportation costs, concentration of special-needs, higher costs of classified and certified personnel, et cetera. The distribution formula made no adjustment for the actual differences which exist between districts. Witnesses also agreed the cost of education varies according to student characteristics, but the distribution formula made no adjustment on the basis of such factors.\n\nThe superintendents of the challenger districts provided evidence that their actual costs exceed the operating revenue provided through the divisor system because the system makes no adjustment for varying educational costs. They also provided evidence of deficiencies caused by less than full reimbursement of transportation and special education expenditures. The deficiencies are made up from the revenue meant for education of the general student population. The divisor system makes multiple adjustments between student populations of 0 and 500, while making no adjustments in divisors beyond a level of 500 students. Many junior high and high schools in the challenger districts have student populations over 1000 students. The challengers contended that increased costs are associated with these large numbers but are not funded. These combined deficiencies result in insufficient revenue which can be devoted to average students who comprise the majority of students. The actual number of classrooms and staff and the amount of support needed to educate those students are inadequate.\n\nRelying on a rational basis test, the defenders claimed the statutory distribution scheme was fairly weighted in favor of small schools and designed to take advantage of the large schools' economies of scale. Testimony by superintendents from the challenger districts revealed the present system's design to provide enhanced support for schools in small communities caused funding disparities for them. That design has the inverse effect of penalizing large urban districts which attempt to keep small neighborhood schools and lower class size. The district court found economy of scale was only an assumption which had never been measured or quantified. Experts for both sides testified that at student populations over 500, school districts were in fact experiencing diseconomies of scale. The district court found the divisor system failed to recognize this.\n\nSchool superintendents from the challenger school districts testified about educational program impact caused by the arbitrariness of the divisor system. The district court determined that while Washakie cautions against an approach which focuses upon differences in educational opportunity, it does not necessarily preclude the use of circumstantial evidence demonstrating inequities in the distribution formula. Specifically, the large districts testified that in addition to suffering deficient funding caused by the divisor system's failure to fund their actual costs, they suffered from cost pressures generated by school population growth and student characteristics.\n\nEducators from both parties identified individual attention to each student as a key component of a quality education. Educators believe increased school and class size adversely affect individual attention and have devoted efforts to mitigating the damage. Although educators recognize large class sizes diminish a school's ability to provide the proper individualized attention for all students, the harm is greatest for those students whose socio-economic circumstances place them at risk of poor performance. Educators classify those students as \"at-risk.\" A failure to provide proper individualized attention to those students has long-term impact for all of society. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nThe district court found that the divisor system accepts the principle that every 500 students should be supported by a particular ratio of teachers, counselors, nurses, and administrative personnel. However, in practice, the present system prevents appropriate funding of its own underlying precept. At most only an extra teacher or two can be added as student populations swell. Because of growth, increased student populations cause several junior high and high schools throughout the state to operate at well above 1000 students, although the schools were built for fewer students. Schools accommodate the overflow with temporary structures and additions. Classes are large, schools are insufficiently staffed, and facilities are so overcrowded that all efforts by the school districts to change the delivery of education in order to improve student performance are directly countered and frustrated. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e Under the current capital construction funding scheme, districts such as Laramie County School District No. One (LCSD # 1) cannot build needed, additional schools. Instead, the district has abandoned the neighborhood school concept and now buses elementary school students throughout the city to available space and is increasing school size beyond efficiently manageable limits at the secondary level. Enrollment is expected to increase at all grade levels.\n\nWhile the divisor system limits the options of large schools, the role of education in reducing social problems pressures those same schools to respond. Recognizing that dropouts usually result in increased social costs because a large percentage end up incarcerated or on public assistance, school districts operate alternative high schools. Alternative high schools address the most serious at-risk students. Alternative high schools are costly, but successful because of their low enrollment, lower student/teacher and student/counselor ratios. In LCSD # 1, the alternative school's actual costs in 1992 were $1,218,110 or about $8500 per student to operate; but because a municipal divisor feature in the present finance system applies, the school only received $613,400. Without the municipal divisor, the school would receive only $855,845; better, but still insufficient to meet its actual costs. The other challenger districts testified to similar funding deficiencies at their alternative high schools due to features of the present finance system.\n\nIn addition to deficient funding for the alternative high school, funding is also deficient for the services required for at-risk students in the main schools. The challenger school districts are currently faced with large numbers of at-risk students due to various social pressures. \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e School districts, under pressure from the state and local community, attempt to equip these students with the knowledge and skills requisite for success after graduation. Primarily, school districts attempt to deal with at-risk students by lowering student/teacher, student/guidance counselor ratios. Funding, however, does not support efforts to lower ratios or class sizes and the challengers contended this inhibits student success.\n\nThe parties testified that the divisor system's interaction with the other finance components constrained them from appropriately responding to student needs through properly sized schools and classes. Challenger districts determined that their education systems were not providing an equal education opportunity to students.\n\nb. Municipal Divisor, Recalculation\n\nDespite the accepted belief that smaller schools are costlier, the effect of the municipal divisor is to assign a higher divisor when small schools are located in cities or towns. The defenders claimed the municipal divisor was necessary to prevent school districts from building unnecessarily small schools in order to generate additional funding. The challengers provided evidence the municipal divisor so limited their funding for their small schools without regard for the actual cost of running a school that at least one school district was functionally bankrupt and other school districts face that same prospect.\n\nTheir evidence regarding the recalculation formula was intended to demonstrate it was arbitrary since a large district could increase enrollment by as much as 297 students and not receive additional funding while a small district could receive additional funding with as few as three new students.\n\n2. Recapture\n\nStatute sets the retention level for recapture districts at 109%. Recapture districts \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e testified that this figure was set without any cost study as a basis and was therefore arbitrary. Defenders asserted that the legislature could have based this figure upon the additional costs recapture districts face because of the very mineral extraction industries which make them wealthy.\n\n3. Optional Mills\n\nChallengers presented evidence that districts with low assessed property valuation and which receive lower per ADM foundation revenue operate on a deficit or near-deficit level. These districts are forced to levy most or all of their optional mills to provide a basic education program. Other property-poor districts with sufficient foundation funding to meet operating expenses do not levy optional mills for an enhanced program because the levy of a mill raises so little money. Districts with high assessed property valuation do not levy these mills to operate a basic program, but instead use them either to generate large cash reserves or to enhance their education program beyond that funded through the foundation program. Defenders asserted that optional mill levies provided for local control.\n\n4. Capital Construction Finance\n\nEvidence at trial revealed that an independent study (MGT study) reported the state schools' need for new construction and renovation and repair totaled $275 million. At the time of trial, only $5 million was designated as capital funding. The state has statutory authorization to partially supplement low valuation districts up to the state average assessed valuation; however, supplements have been inadequately funded by the legislature. The legislature responds to emergencies of school districts on a case-by-case basis, but limited funding is available for non-emergency needs.\n\nThe primary source of revenue for major capital facilities renovation and construction is the sale of bonds paid for out of mills levied against a school district's assessed valuation. The constitution prohibits a school district from bonding beyond 10% of the assessed value of the school district. WYO. CONST. ART. 16, § 5. Because of low assessed valuation, five Wyoming school districts currently exceed 100% of legal bonded indebtedness. Additionally, the evidence showed less wealthy districts cannot rely on bonds to finance needed capital construction. In LCSD # 1, total bonding capacity is only $26 million. A needed new high school would cost $30 million to build. Unable to raise capital construction funding of this magnitude, LCSD # 1 increases school size and class size.\n\nAt trial, testimony considered the contribution of physical facilities towards educational quality. Educational research reports a relationship between the condition of buildings and quality of education. As the building deteriorates and becomes more crowded, test scores go down. This testimony was disputed by a witness legislator who expressed the view that the result of the MGT study was a \"wish list\".\n\nThe trial testimony discussed the current overcrowding situations in the junior high and high schools of large districts. In Green River, the high school was built for 600 students but has 1130 students, creating student management problems. In LCSD # 1, increased numbers of students, mostly on the north side of Cheyenne, require, at the least, a new middle school for sixth and seventh graders and a new high school. However, a bonding capacity of only $26 million makes building an unlikely prospect. Cheyenne buses elementary students instead of building a new middle school and is increasing the numbers of students at its two high schools, already over 1400 students each. The busing of elementary school students is in spite of a neighborhood school policy which cannot currently be honored. Schools attempt to contain class sizes in core curriculum courses but the divisor system prevents sufficient funding to hire additional teachers. As an alternative, the schools employ innovations such as block scheduling and team teaching which should increase the time teachers can spend with students. These innovations, however, lose their effectiveness as class sizes continue to increase.\n\nCapital construction funding as currently financed is not limited to physical facilities. In Sweetwater County School District No. Two, voters approved bonding only after receiving the school district's promise to purchase computers. The local community was concerned that graduates be technologically efficient and extracted the promise; however, in LCSD # 1, computer laboratories do not exist in some schools and their quantities are insufficient in others.\n\nIn summary, the school districts' evidence at trial portrayed recognition by the local educators and communities that the educational system required change to ensure students' successful transition from school to lives as productive, informed citizens. Through solely local effort, the educational system was attempting to change and meet those requirements. Those efforts were effectively nullified because of funding unrelated to actual costs and because the legislature did not participate in the substantive aspects of the educational system. Consequently, the local effort directed at improving the quality of education varied throughout the state, yielding divergent educational opportunity dependent upon the progressiveness and wealth of the local school district and community. Further, because the legislative method of funding was unrelated to the developed local programs, funding disparities and deficiencies resulted, jeopardizing what marginal success such a disjointed system was likely to produce for improving student performance.\n\nThe Trial Court Decision\n\nAs stated earlier, the district court applied a strict scrutiny analysis for the recapture, optional mills, and capital construction features of the funding system. The district court made findings of fact that the recapture feature and the optional mill levy feature created disparities based upon local wealth and declared those statutes unconstitutional. In its findings of fact concerning the capital construction funding scheme, the district court discussed the several means available to school districts to finance their needs. The district court found wide variations in the funding amounts available to a school district based on the part of the scheme relying on local wealth but also found the scheme had a mechanism for the state to fund emergency needs of a school district. Despite the findings of wealth-driven disparity, the district court held the evidence failed to establish proof of harm to a constitutionally protected right and declared the current system of capital construction funding constitutional.\n\nAlso as noted earlier, the district court applied its equitable distribution/rational basis analysis to those statutes comprising the distribution formula (divisor and municipal divisor). The district court accepted that the challengers had proved the existence of funding disparities which resulted in a genuine funding disadvantage to each student of the larger districts. It further accepted that the divisor system, which set a classroom unit value based upon political decision rather than determined variable costs and which distributed funding by such arbitrarily determined classroom units and divisors, caused funding disparities which presented a genuine potential difference in educational opportunity.\n\nThe district court's post-trial decision letter \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e stated that the court had \"serious doubts about the fairness of the funding formula\" and explained several reasons for those doubts. As the district court found, the evidence demonstrated the divisor system has never attempted to quantify cost differences among the districts but only captures the historic relationship between school size and class size. Economies of scale was but an incident rather than a goal of the divisor system. The district court explained further the evidence presented a complex picture of school finance shortcomings which raised serious questions about the fairness of the divisor system. The doubts were raised by evidence that the divisor system, in operation, permitted the small districts to maintain small schools and classes and funded a large percentage of small districts' variable costs. The district court found that for those districts locked into a divisor of 23, the divisor system, in fact, defies the laws of economics.\n\nGenuinely convinced the arbitrariness of the distribution funding formula had been demonstrated, the district court believed, however, the record evidenced an impasse because the challengers had not measured the level of classroom unit funding available to meet variable cost demands nor had they shown what percentage of district-wide expenditures went to meet variable cost demands. Without these measurements, the level and impact of the disparities were unknown and, in the district court's view, the challengers had failed to carry their burden of proof of the magnitude and character of the asserted injury to the constitutional right.\n\nAlthough in its pre-trial decision letter the district court had ruled that under Washakie the challengers did not have to prove educational harm, the district court found that the evidence failed to disclose any widespread and/or significant disparity of educational quality or educational opportunity caused by the divisor system. The district court held the challengers had failed to carry their burden of proving a clear and exact constitutional violation existed in the challenged divisor system and held it constitutional.\n\nThe district court found, however, that the municipal divisor was not rationally justified by cost differences and did not satisfy the equitable distribution test. It held the municipal divisor unconstitutional. The district court made no ruling on issues concerning the recalculation feature of the distribution formula.\n\nConstitution's Education Provisions and the Statutory Education System\n\nThe fundamental right of education expressly recognized by the Wyoming Constitution is declared in Art. 1, § 23:\n\nEducation.\n\nThe right of the citizens to opportunities for education should have practical recognition. The legislature shall suitably encourage means and agencies calculated to advance the sciences and liberal arts.\n\nWYO. CONST. ART. 1, § 23.\n\nThe responsibilities and requirements of the education system are addressed in depth by the Wyoming Constitution in Art. 7, §§ 1-14. Those sections were intended to remedy the shortcomings of the schools during the territorial years \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e by providing for an education system established, maintained, and supervised at the state level. To that end, a state superintendent was provided for \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e and school lands and taxation were secured to supply state support. \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e As is evident from the treatment of education in the constitution, the constitutional framers accorded great regard for education at the 1889 constitutional convention. That great regard reflected Wyoming's progressiveness on educational issues while still a territory. In 1873, after territorial status was achieved, the Wyoming legislature established a compulsory education system, provided for a decentralized network of public school districts, began a comprehensive system of high schools, and established a state university as well as schools for the handicapped. \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nBy establishing education first as a right in the Declaration of Rights article and then detailing specific requirements in a separate Education article in the state constitution, the framers and ratifiers ensured, protected and defined a long cherished principle. Washakie established that the right to education correlated to a duty of the legislature, holding Art. 7, § 1 obligated the legislature to affirmatively act to establish and support a comprehensive system of public education. Washakie, 606 P.2d at 320. Sections 1 and 9 of Art. 7 contain education clauses addressing the type of system to be established and maintained. Those sections state in relevant part:\n\nThe legislature shall provide for the establishment and maintenance of a complete and uniform system of public instruction, embracing free elementary schools of every needed kind and grade, a university with such technical and professional departments as the public good may require and the means of the state allow, and such other institutions as may be necessary.\n\nWYO. CONST. ART. 7, § 1.\n\nThe legislature shall make such further provision by taxation or otherwise, as with the income arising from the general school fund will create and maintain a thorough and efficient system of public schools, adequate to the proper instruction of all youth of the state, between the ages of six and twenty-one years, . . . .\n\nWYO. CONST. ART. 7, § 9.\n\nIn the case of a constitution, it must be presumed the people have intended whatever has been plainly expressed and that intent must be given effect and enforced. Rasmussen v. Baker, 7 Wyo. 117, 128, 50 P. 819, 821 (1897). Although the text of the constitutional provision in question must be given the common and ordinary meaning understood by the majority of voters which ratified it, id., we must be mindful our state constitution is, \"in a sense, a living thing, designed to meet the needs of progressive society, amid all the detail changes to which such society is subject.\" Chicago \u0026 N.W. Ry. Co. v. Hall, 46 Wyo. 380, 391, 26 P.2d 1071, 1073 (1933). Recognizing educational philosophy and needs change constantly, we believe the language of those education article provisions requiring \"a complete and uniform system of public instruction\" (Art. 7, § 1) and \"a thorough and efficient system of public schools, adequate to the proper instruction of all youth of the state\" (Art. 7, § 9), must not be narrowly construed. Indeed, since this court has held the right to a quality education under our state constitution is a fundamental right, that right must be construed broadly.\n\nAt the time of ratification, the words of these clauses carried these definitions:\n\ncomplete: having no deficiency; wanting no part or element; perfect; whole; entire; full;\n\nuniform: having always the same form;\n\nsystem: any combination or assemblage of thing adjusted as a regular and connected whole;\n\ninstruction: the act of instructing or teaching; communication of knowledge; education; enlightenment;\n\nthorough: fully executed; having no deficiencies; hence, complete in all respects; unqualified; perfect;\n\nefficient: acting or able to act with due effect; adequate in performance; bringing to bear the requisite knowledge, skill, and industry; capable, competent;\n\nadequate: equal to requirement or occasion; commensurate; fully sufficient, suitable or fit;\n\nproper: fit; suitable; appropriate;\n\neducation: \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e education in a broad sense, with reference to man, comprehends all that disciplines and enlightens the understanding, corrects the temper, cultivates the taste, and forms the manners and habits; in a narrower sense, it is the special course of training pursued, as by parents or teachers, to secure any one or all of these ends.\n\nTHE CENTURY DICTIONARY (1889).\n\nToday, we see little difference in the contemporary definitions. Only the definition of efficient is more precise:\n\ncomplete: having all necessary parts, elements, or steps;\n\nuniform: having always the same form, manner, or degree; not varying or variable; of the same form with others; conforming to one rule or made; presenting an unvaried appearance of surface, pattern;\n\nsystem: a regularly interacting or interdependent group of items forming a unified whole; a group of artificial objects or an organization forming a network especially for distributing something or serving a common purpose;\n\ninstruction: the action, practice, or profession of teaching;\n\nthorough: marked by full detail, painstaking;\n\nefficient: productive without waste;\n\nadequate: sufficient for a specific requirement;\n\nproper: marked by suitability, rightness or appropriateness; fit;\n\neducate: to develop mentally, morally, or aesthetically especially by instruction.\n\nWEBSTER'S COLLEGIATE DICTIONARY, 10TH ED. (1994).\n\nIn synthesizing these definitions, we can define \"a complete and uniform system of public instruction\" as\n\nan organization forming a network for serving a common purpose of instructing/educating the public which organization has all the necessary parts or elements and has always the same form;\n\nand we can define \"a thorough and efficient system of public schools adequate to the proper instruction of the state's youth\" as\n\nan organization forming a network for serving the common purpose of public schools which organization is marked by full detail or complete in all respects and productive without waste and is reasonably sufficient for the appropriate or suitable teaching/education/learning of the state's school age children.\n\nWe can ascertain the further intent of these words by considering the purpose which the framers believed education served. At the time these clauses were used in the wording of the education article at Wyoming's constitutional convention in 1889, similar education provisions were found in every state constitution, reflecting the contemporary sentiment that education was a vital and legitimate state concern, not as an end in itself, but because an educated populace was viewed as a means of survival for the democratic principles of the state. Meyer v. Nebraska, 262 U.S. 390, 400, 43 S.Ct. 625, 627, 67 L.Ed. 1042 (1923); see Wisconsin v. Yoder, 406 U.S. 205, 238-39, 92 S.Ct. 1526, 1545-46, 32 L.Ed.2d 15 (1972) (J. White concurring). These sentiments were articulated in addresses by Wyoming's Territorial Governors:\n\nIn laying the foundation of a new State, [education] should be the corner stone, for without it no durable political fabric can be erected. It matters little how great our material prosperity may be, if our moral and intellectual growth does not keep pace with it. It is a duty we owe not only to ourselves and to our posterity, but to all mankind. In the diffusion of knowledge among the people rests our only hope for the preservation of our free institutions. . . . Now, in the infancy of our territory, let the fostering aid and encouragement of the government be given to every scheme for the advancement of education, and to establish as the corner stone of our embryo state the principle of universal, free, common school education.\n\nGovernor J.A. Campbell's Address to the First Legislative Assembly of Wyoming Territory (Oct. 13, 1869), in WYOMING TERRITORY, MESSAGES OF THE GOVERNORS: 1869-1890, at 14. (n.p., n.d.)\n\nWithout the intelligence of its people no community may hope to maintain a free government. It augurs well for the future of this commonwealth that at the very beginning broad foundations were laid in the interest of education.\n\nGovernor John W. Hoyt's Message to the Sixth Legislative Assembly of Wyoming Territory (Nov. 6, 1878), in WYOMING TERRITORY, MESSAGES OF THE GOVERNORS: 1869-1890, at 21. (n.p., n.d.)\n\nFrom this history, we can conclude the framers intended the education article as a mandate to the state legislature to provide an education system of a character which provides Wyoming students with a uniform opportunity to become equipped for their future roles as citizens, participants in the political system, and competitors both economically and intellectually. See Kukor v. Grover, 148 Wis.2d 469, 436 N.W.2d 568, 589-90 (1989) (citing cases which have held similar constitutional provisions' histories require this definition). The constitution directs the creation of two systems to deliver education. The purpose of the systems so created and maintained is to deliver a \"proper\" education to the state's youth. The legislature, in fulfilling its constitutional duty, must define and specify what a \"proper education\" is for a Wyoming child.\n\nThe legislature has enacted statutes which set a framework for defining a proper education at the state level. Presently, the legislature imposes these duties upon the state superintendent relevant to the quality of elementary and secondary education system:\n\n§ 21-2-202. Duties of the state superintendent.\n\n(a) In addition to any other duties assigned by law, the state superintendent shall:\n\n(i) Make rules and regulations, consistent with this code, as may be necessary or desirable for the proper and effective administration of the state educational system. . . .\n\n(ii) Consult with and advise the state board, local school boards, local school administrators, teachers and interested citizens, and seek in every way to develop public support for a complete and uniform system of education for the citizens of this state; . . .\n\n(viii) Prepare and maintain a list of accredited schools in Wyoming; . . .\n\n(xiv) Have authority to collect student educational assessment data from school districts, community colleges and the University of Wyoming. . . .\n\n(xvii) Include in the agency's budget request:\n\n(A) Recommendations to the governor for appropriations from the school foundation program account and for appropriations to the account necessary to fund payments to school districts as required by law;\n\n(B) Recommendations to the governor for appropriations from the foundation program for special programs; and\n\n(C) Recommendations to the governor for school capital construction related appropriations under W.S. 21-15-105 and 21-15-106.\n\n(xviii) In accordance with W.S. 21-2-501 and 21-2-701(a)(ii), promulgate rules to assure that each child with disabilities receives a free and appropriate education in accordance with his capabilities, . . .\n\n(c) In addition to subsection (a) of this section, the state superintendent may take appropriate administrative action with the state board as necessary to withhold funds from any school district or state institution failing to comply with any applicable law or with the minimum standards prescribed by the state board.\n\nWYO. STAT. § 21-2-202 (Supp. 1995).\n\nThe legislature imposes these duties on the state board of education relevant to the quality of elementary and secondary education system:\n\n§ 21-2-304. Duties of the state board of education.\n\n(a) The state board of education shall establish policies for public education in this state consistent with the Wyoming Constitution and statutes. . . .\n\n(b) In addition to any other duties assigned to it by law, the state board shall:\n\n(i) Prescribe minimum standards with which public schools and other educational institutions receiving money from any state fund, . . . must comply. The standards shall relate to and include:\n\n(A) General education programs; . . .\n\n(C) The evaluation and accreditation of the public schools.\n\n(ii) Enforce the rules and regulations adopted . . . by taking appropriate administrative action with the state superintendent or withhold state funds from any school district or institution failing to comply with any applicable law or with the minimum standards prescribed by the state board; . . .\n\n(v) Initiate or facilitate discussions regarding the needs of and means for improving education; . . .\n\n(xiv) Establish improvement goals for public schools for assessment of student progress based upon the national assessment of educational progress testing program;\n\n(xv) Promulgate rules and regulations for the development, assessment and approval of school district teacher performance evaluations systems. Rules and regulations adopted under this paragraph shall allow each district flexibility in developing an evaluation system which meets the individual needs of the district; . . .\n\n(e) In addition to subsection (b) of this section, the state board shall establish statewide goals for Wyoming public education.\n\nWYO. STAT. § 21-2-304 (Supp. 1995).\n\nThe legislature imposes these duties on local school boards relevant to the quality of the elementary and secondary education system:\n\n§ 21-3-110. Duties of boards of trustees.\n\n(a) The board of trustees in each school district shall:\n\n(i) Prescribe and enforce rules, regulations and policies for its own government and for the government of the schools under its jurisdiction. Rules and regulations shall be consistent with the laws of the state and rules and regulations of the state board and the state superintendent and shall be open to public inspection; . . .\n\n(xv) Provide, in each district maintaining a high school, a course of study adequate to prepare pupils of the district for admission to the University of Wyoming \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e and the various community colleges of Wyoming; . . .\n\n(xvii) Require the performance of each initial contract teacher to be evaluated in writing at least twice annually. The teacher shall receive a copy of each evaluation of his performance;\n\n(xviii) Establish a teacher performance evaluation system and require the performance of each continuing contract teacher to be evaluated . . .\n\n(xix) Performance evaluations required shall serve as a basis for improvement of instruction, enhancement of curriculum program implementation, measurement of both individual teacher performance and professional growth and development and the performance level of all teachers within the school district, . . .\n\nWYO. STAT. § 21-3-110 (Supp. 1995).\n\nThe legislature specifies the local school boards are to comply with the education program established for the entire state:\n\n§ 21-9-101. Schools to adhere to minimum standards promulgated by state board of education.\n\nThe board of trustees of each school district within the state shall cause the schools under its jurisdiction to adhere to the minimum standards relating to educational programs promulgated by the state board of education.\n\nWYO. STAT. § 21-9-101 (1992).\n\nAdditionally, the legislature has mandated curriculum \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e in one area. That mandate includes a specified subject area, a specified content, a specified standard, and a specified type of assessment:\n\n§ 21-9-102. Instruction in state and federal constitutions required; satisfactory examination a prerequisite to graduation.\n\nAll schools and colleges in this state that are supported in any manner by public funds shall give instruction in the essentials of the United States constitution and the constitution of the state of Wyoming, including the study of and devotion to American institution and ideals, and no student shall receive a high school diploma, associate degree or baccalaureate degree without previously passing a satisfactory examination on the principles of the constitution of the United States and the state of Wyoming. The instruction shall be given for at least three (3) years in the elementary grades and for one (1) year each in the secondary and college grades.\n\nWYO. STAT. § 21-9-102 (1992).\n\nThis statute is enforced in WYO. STAT. § 21-9-103 (1992) which provides:\n\n§ 21-9-103. Penalty for failure to carry out requirements of W.S. 21-9-102.\n\nWillful failure on the part of any school or college administrator or instructor to carry out the requirements of W.S. 21-9-102 shall be sufficient cause for the removal of such person from his position.\n\nIn reviewing these various statutes which implement the constitutional provisions, we have identified a shortcoming. Despite the legislature's requirement that the state board of education prescribe minimum standards, that board's promulgated rules permit the local school districts to establish those minimum standards and then evaluate for themselves whether they have met those standards. Wyoming State Board of Education Rules and Regulations, Chapter VI, School Accreditation (1993).\n\nChapter VI of the State Board's promulgated rules govern school accreditation. In order to achieve and maintain state school accreditation, the state board of education requires public school students shall meet the student performance standards at the level set by the school and district:\n\nSection 7. Common Core of Knowledge. All public school students shall meet the student performance standards at the level set by the school and district in the following areas of knowledge: \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e . . .\n\nSection 8. Common Core of Skills. All public school students shall meet student performance standards at the level set by the school and district in the following skills: \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e. . . .\n\nThe rules further require districts and schools meet district and school performance standards and list the areas requiring action. No level of performance is prescribed.\n\nSection 9. District Performance Standards.\n\n(a) The district shall involve parents, community, and professional staff in developing student performance standards in the common core of knowledge and skills and in implementing programs which will improve student results.\n\n(b) The district shall address student performance standards in an officially adopted planning process reinforced by board of education policies. This process must show, and its implementation demonstrate, how student performance standards have affected planning for facilities and annual budget priorities.\n\n(c) The district shall have a board-approved process in which student performance results are identified, monitored, and reported. The process shall include an annual report card disseminated widely to patrons of the district.\n\n(d) The district shall demonstrate that staff development relates to student performance.\n\n(e) The administration shall monitor building operations to assure all legal requirements, federal, state, and local, are met in each school.\n\nSection 10. School Performance Standards.\n\n(a) Each school shall adopt district student performance standards and site-specific student performance standards.\n\n(b) Each school shall have staff development plan based upon district and school student performance goals.\n\n(c) Each school shall have procedures for involving affected personnel in decision making.\n\n(d) Each school shall have planned strategies and procedures to measure student performance.\n\n(e) Each school shall adopt procedures for changing strategies on the basis of the degree of success in accomplishing adopted student performance goals. Particular attention will be given to addressing needs of gender, ethnic, or socioeconomic group for which results are below either school or district performance levels.\n\n(f) Each school shall involve parents, and students when appropriate, in processes leading to improved student results.\n\n(g) Each school shall adopt a procedure for assessing school climate.\n\nSection 11. At Risk Students. The district shall have policies and procedures for every school in the district to identify and intervene with at-risk students. In addition, all schools shall provide instruction as appropriate through the school curriculum directed at the prevention of at-risk behavior.\n\nFinally, these rules permit graduation upon mastery of the common core of knowledge and skills at the levels set by the district and the schools. This graduation requirement is set despite WYO. STAT. § 21-3-110(a)(xv) (Supp. 1995) which requires the district to provide a course adequate to prepare students for college admission:\n\nSection 12. Graduation Requirements.\n\n(a) A student shall master the student performance standards within the common cores of knowledge and skills at the levels set by the district and the schools, including alternative schools.\n\nWyoming State Board of Education Rules and Regulations, Chapter VI, School Accreditation (1993).\n\nEach school district is thus permitted to separately determine and define an education system for their students, potentially creating forty-nine autonomous education systems.\n\nDISCUSSION\n\nAs seen in the recitation of the facts, the challengers allege that the scope of the Washakie decision encompasses both revenue raising and revenue distribution unjustified disparities and the presence of either kind of unjustified disparity violates the fundamental right to education. In Washakie, the evil was disparate spending, caused in part by local assessed valuation but also in whole by the entire system. In the present case, the challengers allege the evil is still disparate spending, caused by the arbitrary and irrational devices employed in distribution: the divisor, the municipal divisor and the classroom unit value (CRU). They allege these devices have no relation to educational costs and allocation of educational dollars must be based on need related to quality of education.\n\nWashakie declared that our state constitution guarantees an equal opportunity for a quality education. Washakie held this fundamental right could not be denied by unequal funding. Washakie, however, did not define \"equal opportunity for a quality education,\" although it said that until financial equality was reached, there was no hope of achieving \"equality of quality.\" Washakie required the legislature to reform the educational system in conformity with the \"sense of this decision.\" Washakie, 606 P.2d at 337. The sense of Washakie was to require the legislature to examine the entire education system, including its funding, and reform it in order to provide an \"equal opportunity for a quality education.\"\n\nWashakie identified Wyoming's constitutional design of educational responsibility and recited the several pertinent constitutional provisions contained in Art. 7 of the state constitution. As those provisions make clear, \"the legislature has complete control of the state's school system in every respect, including division of the state into school districts and providing for their financing.\" Id. at 320.\n\nWe find the true focus of this case to be whether the legislature has complied with its constitutional duty to provide an equal opportunity for a quality education by structuring both school financing and the education system in a manner, and at a level, that maintains \"a complete and uniform system of public instruction\" and a \"thorough and efficient system of public schools, adequate to the proper instruction of all youth of the state.\" WYO. CONST. ART. 7, §§ 1 and 9. This language identifies three \"duties\" borne by the legislature in order to meet its constitutional responsibility to provide this equal opportunity:\n\n1. The \"system of public instruction\" must be \"complete and uniform\";\n\n2. The \"system of public schools\" must be \"thorough and efficient\"; and\n\n3. The thorough and efficient system of public schools must be \"adequate to the proper instruction\" of the state's youth.\n\nConstitutional provisions imposing an affirmative mandatory duty upon the legislature are judicially enforceable in protecting individual rights, such as educational rights. Seattle Sch. Dist. No. 1 of King Cty. v. State, 90 Wn.2d 476, 585 P.2d 71, 86-87 (1978). Although this court has said the judiciary will not encroach into the legislative field of policy making, as the final authority on constitutional questions the judiciary has the constitutional duty to declare unconstitutional that which transgresses the state constitution. Washakie, 606 P.2d at 319; Bulova Watch Co. v. Zale Jewelry Co. of Cheyenne, 371 P.2d 409, 419 (Wyo. 1962). When the legislature's transgression is a failure to act, our duty to protect individual rights includes compelling legislative action required by the constitution.\n\nIn school reform litigation \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e, defenders of the funding scheme routinely advance the argument that the judiciary's determination of the nature and extent of the constitutional right to a quality education violates the separation of powers doctrine. That argument was aptly answered by the Kentucky Supreme Court:\n\nThe judiciary has the ultimate power, and the duty, to apply, interpret, define, construe all words, phrases, sentences and sections of the Kentucky Constitution as necessitated by the controversies before it. It is solely the function of the judiciary to so do. This duty must be exercised even when such action serves as a check on the activities of another branch of government or when the court's view of the constitution is contrary to that of other branches, or even that of the public.\n\nRose v. Council For Better Educ. Inc., 790 S.W.2d 186, 209 (Ky. 1989). Our proper role is interpreting the meaning of the language of §§ 1 and 9 of Art. 7 in order to determine the duties those provisions impose upon the legislature.\n\nStandard of Review\n\n1. Findings of Fact\n\nIn this appeal, the defenders of the present system do not challenge the district court's findings of fact. Appellant-Plaintiff Campbell County School District does challenge certain of the district court's background findings concerning the post-Washakie legislation. On appeal, a district court's findings of fact will not be set aside unless clearly erroneous. Cottonwood Valley Ranch, Inc. v. Roberts, 874 P.2d 897, 899 (Wyo. 1994).\n\nThe district court stated in its finding of fact number three that the sums generated by the local twenty-five mill levy were diverted into the State Foundation Program. Appellant Campbell County School District correctly points out WYO. STAT. § 21-13-310(a)(ii)(A) (1992) directs revenues from the twenty-five mill levy be mandatory and be computed as a local resource. WYO. STAT. § 21-13-311(a) (1992) directs that the foundation program amount be determined by subtracting local resources (including twenty-five mill levy revenues) from the computed amount of the guarantee to which the district is entitled. The money stays in the local district and lowers the amount of State Foundation Program funds the local district will receive. Appellant Campbell County School District also correctly points out the trial court failed to note the existence of the mandatory six mill county levy in its findings of fact numbers four and five. According to WYO. STAT. § 21-13-201 (1992), a six mill county levy must be levied on the assessed valuation of the property. Those tax revenues are then distributed to the school districts within the county by the county treasurer. These errors in the district court's background findings of fact did not contribute to substantive determinations and we need not consider them further as they had no impact on the district court's conclusions of law.\n\n2. Conclusions of Law\n\nAs the recitation of facts indicates, a critical question was whether the district court should test the challenged post-Washakie reforms by the rational basis test or the strict scrutiny test. \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e The district court applied both tests depending on whether the reform feature was on the revenue raising side or the revenue distribution side. The application of different scrutiny levels resulted from pre-trial resolution of the defenders' assertion that a distinction existed between a fundamental right to education and education funding distribution. In their view, a different standard applied to non-wealth based funding disparities and they urged the proper constitutional standard was proof this type of funding disparity caused harm to the quality of education. The district court disagreed with defenders and, before trial, ruled, correctly in our view, Washakie did not require the challengers to prove harm to the quality of education. Nevertheless, the district court ruled, incorrectly in our view, Washakie did not speak to distribution and, therefore, rational scrutiny applied, requiring the challengers to bear the burden of proof that the disparities were unjustified. Following trial, the district court determined the constitutional language of \"equitable allocation\" required a somewhat heightened scrutiny.\n\nThe ruling's effect manifested itself when the district court determined the evidence at trial was in equipoise. In this situation, the party with the burden of proof must necessarily lose. Since the district court ruled the rational basis test applied, the challengers could not prevail. However, under strict scrutiny the defenders would lose since clearly they had not come forward with cost justifications to the extent required by Washakie. At best, defenders presented generalizations concerning costs. Dr. Andersen, who authored the divisor system, and school officials Lynn Simons and Barry Nimmo, who oversaw the divisor system, all testified the system was not intended to reflect costs. Defenders estimated about one-third of the CRU value of $92,331 was devoted to teacher salaries and benefits and some support services and the remaining two-thirds adequately covered all other education expenses. Defenders' reliance upon gross estimates failed to provide any specificity in identifying costs. Additionally defenders' assertions that small schools cost more and required higher funding while large schools required less funding because of economies of scale were revealed as assumptions without basis in study or empirical data. Washakie contemplated a complex formula to fund cost differentials caused by student need differences and school demographic differences. \u003cspan class=\"fnref\"\u003e34\u003c/span\u003e The divisor system used is not the sophisticated one which Washakie foresaw would be necessary to achieve equality of financing. Had the district court applied a strict scrutiny standard, defenders would have failed in their burden of proof.\n\nOn appeal, the defenders view the \"equitable allocation\" language of WYO. CONST. ART. 7, § 8 as an improper standard to apply for any distribution beyond school land income funding. \u003cspan class=\"fnref\"\u003e35\u003c/span\u003e They continue to assert the correct standard is whether the legislature has provided a \"complete and uniform . . . thorough and efficient system of public schools.\" In their view, the challengers must clearly prove a constitutional violation to the quality of education before the legislative finance system may be struck down as unconstitutional. Additionally, the defenders assert that decisions from other jurisdictions support applying a different level of scrutiny to the distribution side of school finance.\n\nWe hold the district court erred in applying equitable allocation/rational scrutiny. Among other valuable lessons, Washakie teaches that this court will review any legislative school financing reform with strict scrutiny to determine whether the evil of financial disparity, from whatever unjustifiable cause, has been exorcized from the Wyoming educational system. Washakie, 606 P.2d at 335. The triggering issue in Washakie was wealth-based disparities; however, we now extend that decision beyond a wealth-based disparity to other types of causes of disparities.\n\nBecause the right to an equal opportunity to a proper public education is constitutionally recognized in Wyoming, any state action interfering with that right must be closely examined before it can be said to pass constitutional muster. Such state action will not be entitled to the usual presumption of validity; rather, the state must establish its interference with that right is forced by some compelling state interest and its interference is the least onerous means of accomplishing that objective. Miller v. City of Laramie, 880 P.2d 594, 597 (Wyo. 1994).\n\nThe level of scrutiny to be applied was decided in 1980 in Washakie. The evidence of this trial concerning the interaction of the various finance components revealed the necessity that the system as a whole be reviewed under one level of scrutiny. The essence of the necessity was best described by the School Foundation Program booklet when it said:\n\nThe School Foundation Program is deceptively simple in concept, but devilishly complex and convoluted in actual operation. Subtle linkages between and among the various Foundation Program elements mean that a change in one element will usually produce some kind of aberration or misalignment in another. . . . Seemingly minor modifications and adjustments can have altogether unexpected and unintended results. It's a little like trying to bundle a small child into a snowsuit — pushing on one part invariably causes some other part to pop out.\n\nTHE WYOMING SCHOOL FOUNDATION PROGRAM — A BRIEF LOOK AT OPERATIONS AND FUNDING 8 (1990-91 Edition).\n\nThe defenders' reliance upon the standard applied in other jurisdictions is unpersuasive. They mainly rely upon Skeen v. Minnesota, 505 N.W.2d 299 (Minn. 1993); however, this reliance is misplaced. A careful reading of that decision reveals the four-justice majority determined a fundamental right to the state-provided basic level of funding needed to achieve a general and uniform education system exists. Skeen, 505 N.W.2d at 315. The majority would apply a strict scrutiny test to a challenge of that right. Id. at 315. It was only to a challenge of the local school district's funding of education beyond what is necessary to provide an adequate level of education that the majority would apply the rational basis test. Id. at 316. In Skeen, the challenged legislation permitted local school districts to augment the state-funded basic education program. Id. at 303, 306, 316.\n\nThree justices believed the strict scrutiny test applied to either type of challenge, i.e., the basic level of funding and the augmented funding. Id. at 320-22 (Tomljanovich, J., concurring specially; Page and Gardebring, JJ., concurring in part, dissenting in the judgment). In our judgment, Justice Page's view is the correct one and in keeping with our view in Washakie that the strict scrutiny test applies to legislative action which affects a child's right to a proper education:\n\nThe court goes to great lengths to distinguish the fundamental right to an education from education funding, but there is no meaningful distinction between the two. Nothing in the Education Clause of our constitution suggests that the fundamental right to an education applies only to the education itself, not to the money needed to fund that education. Education does not occur in a vacuum; it is achieved as the result of public expenditures. Any system which provides greater expenditures for some children over others should undergo the most exacting scrutiny.\n\nSkeen, 505 N.W.2d at 322.\n\nAgainst this above and foregoing extensive backdrop, we turn now to a discussion of the parties' constitutional arguments. We first consider the funding disparities which the district court considered to be wealth-based.\n\nWealth-Based Funding Disparities. (Recapture, Optional Mills and Capital Construction Finance)\n\n1. Recapture\n\nAs explained earlier, in some school districts, property taxes produce more local revenue than the state average. In response to Washakie's holding that the financing of public education must be a function of state and not local wealth, the legislature moved to redistribute some local wealth to other school districts. The constitution was amended to permit the legislature to collect and redistribute to other school districts up to but no more than 75% of the revenue in excess of the state average yield. WYO. CONST. ART. 15, § 17. In 1992, the legislature permitted school districts to keep only 9% of local revenue which exceeded the foundation guarantee. \u003cspan class=\"fnref\"\u003e36\u003c/span\u003e WYO. STAT. § 21-13-102(b) (1992). The effect of this constitutional amendment and implementing statute is that the state \"recaptures\" 75% of the excess and redistributes it to other school districts, while those school districts subject to recapture retain a portion of the excess which amounts to 109% of their guarantee. All parties agree that under this formula the constitution's 75% limitation will not be violated.\n\nThe challengers attack as arbitrary the constitutionality of the statute permitting them to retain only 109% of their guarantee. Among themselves they held differing views concerning recapture, but those challenging the statute were the wealthier districts with sufficient local revenue to be impacted by the recapture level. Their specific challenge is that the statutorily set level is arbitrarily set without regard for district costs in violation of Washakie. The school districts characterized the 109% level set by the legislature as arbitrary since the legislature gave no reason for that level and they contend their costs justify a higher retention level.\n\nPlaintiff school districts Campbell County and Uinta County are both recapture districts. The school superintendents of those districts testified that after returning money to the state, Uinta ranked 49th out of 49 school districts in terms of the per student state support and Campbell, 44th. In their view, the arbitrariness of the recapture level as it interacts with the rest of the system causes funding disparity in their districts. The Wyoming Education Association, one of the challengers, took the position the legislature should require these districts to give the state all of the excess funding retained now (the 9%) since the districts, due to their wealth, are still able to accumulate substantial funds outside the finance system. Nonwealthy districts do not have this advantage. It would appear the challengers' respective positions are not inconsistent since both do agree the effect of the recapture statute is to allow local wealth-driven funding disparities. The issue is whether the state has constitutionally justified those disparities.\n\nThe defenders of the system contend the recapture statute complied with the constitutional amendment and, in statutorily setting the retention amount, the legislature recognized the mineral extraction industry which contributed to the greater wealth of these school districts also caused greater social costs. The defenders contend the legislative purpose of compensating for those greater social costs does not violate Washakie. The district court found that, although retention of excess funds is available for districts because they endure greater social costs due to the effect of the mineral extraction industry on their community, the experience of the recapture districts is not different from the experiences of other non-recapture school districts which incur greater costs due to school population growth. The district court also found the state failed to carry its burden to demonstrate a compelling state interest which would justify the retention of these funds. The recapture statute, therefore, violated the Wyoming Constitution.\n\nBecause recapture is authorized in the Wyoming Constitution, some challengers complain the district court found the constitution unconstitutional; however, the district court's ruling was faithful to the mandate of Washakie and can be reconciled with the recapture amendment. The recapture portion of the constitutional amendment states:\n\nThe legislature may also provide for the distribution among one or more school districts of not more than three-fourths of any revenue from the special school district property tax in excess of a state average yield, which shall be calculated each year, per average daily membership.\n\nWYO. CONST. ART. 15, § 17.\n\nRecapture affords the legislature a mechanism to redistribute revenue and allows districts to retain local wealth. It is entirely permissible for the legislature to compensate for greater social costs; however, the district court correctly determined only cost-justified funding variations are permitted. Washakie, 606 P.2d at 336. The legislature is mandated to take into consideration various balancing factors and devise a state formula which will weight the calculation to compensate for special needs and educational cost differentials. Id. The challenged recapture statute, however, is not based upon a formula. No evidence produced at trial revealed the 109% retention level was the product of any calculation; instead, it is an arbitrarily derived amount in violation of Washakie. The district court also correctly determined one district's increased costs may not be compensated while another's are ignored. Washakie requires allowances for variances in individuals, groups and local conditions. Id. This post-Washakie legislative change has not met that requirement.\n\n2. Optional Mill Levies\n\na. Background\n\nProperty taxes, levied against assessed property valuation, generate different amounts of revenue for each school district since the assessed property valuation of each school district varies. For example, in Campbell County School District No. One (CCSD # 1), assessed property valuation was $1.3 billion. A mill levy (1/10 of a cent) in CCSD # 1 would generate $1.3 million. In LCSD # 1, assessed property valuation was about $269 million, meaning a mill would generate only about $269,000. CCSD # 1 had about 8000 students. LCSD # 1 had about 13,500 students. CCSD # 1's valuation per mill was over $162 per student while LCSD # 1's valuation per mill was about $19 per student. The average state assessed valuation was $64.55 per student.\n\nAs explained earlier, the local option to levy another six mills available to a school district generates revenue which is outside the foundation program and will not lower the amount of state aid to a school district. These six mills include two distinct categories: three mills for operations and three mills for maintenance. WYO. STAT. § 21-13-102(a)(i)(B)-(C); (ii)(B), (D) (Supp. 1995). The first mill within each category may be levied by the district school board without voter approval. WYO. STAT. § 21-13-102(a)(i)(B)(I), (C)(I); (ii)(B)(I), (D)(I) (Supp. 1995). The final 2 mills within these two categories need voter approval. WYO. STAT. § 21-13-102(a)(i)(B)(II), (C)(II); (ii)(B)(II), (D)(II) (Supp. 1995).\n\nAs the system is presently configured, the legislature assists poor school districts by \"power equalizing\" one operational mill and one maintenance mill. Only the second mill is subject to \"power equalization,\" meaning if the local voters decide to exercise the option and levy the second mill, the state will supplement that levy based upon a formula which raises the amount to assessed state valuation per ADM (per student). For example, the second operational mill in LCSD # 1 would be worth the state average of $64.55 per student, rather than the $19.14 per student of the other two operational mills. Likewise, the second maintenance mill would be worth $64.55 per student rather than the $19.14 per student of the other two maintenance mills.\n\nThe challengers contend the optional mill levy creates wealth-based funding and spending disparities causing inequitable educational opportunities. The district court's findings of fact support these contentions. That court found the most frequent use of optional mills in those districts with the greatest wealth as measured by assessed valuation. The amount of money raised by local optional mills is totally dependent upon the local wealth of individual school districts. One mill in LCSD # 1 raises $19.14 per student and, if power equalized, is worth $64.55 per student. One mill in CCSD # 1 is worth $162.22.\n\nThe district court found optional mill revenues are relied upon in some districts to reduce the disparity resulting from the current system of distribution of funds from the foundation program. The amount of money raised by local optional mills is totally dependent upon the local wealth of individual school districts. The presence of such wealth bears no relationship to the expense of educating students in any particular community. In some of the districts optional mills have become a necessary source of funding to maintain a basic educational program. Other less wealthy districts deem the use of optional mills as futile because the levy of a mill raises so little money. The defenders' justification for the current optional mill process is local control. The district court found the availability of other alternatives permitting local discretion without permitting wide variations in revenue demonstrated local control was not a compelling state interest. The district court concluded the optional mill feature is wealth-driven in violation of equal protection.\n\nWe affirm that legal conclusion based once again upon Washakie. This particular finance system component creates wealth-driven disparity in opportunity for quality education in violation of Washakie. The district court accepted that local control provided a compelling reason for this disparity had it been accomplished in a less onerous way. Washakie determined the plain meaning of our state constitution's Education Article left no doubt the legislature completely controlled the state's school system in every respect, and the matter of providing a school system as a whole and financing it is a responsibility of the legislature. Washakie, 606 P.2d at 320. In view of this determination that an education system is a function of state control, it would be paradoxical to permit disparity because of local control. Although the parties recognize this, they suggest local control is a constitutionally recognized interest and therefore a compelling state interest.\n\nThis contention puzzles us since under Washakie there cannot be both state and local control in establishing a constitutional education system. The parties do not define local control or explain what they mean when they use the term local control. Legal commentators have noted local control is generally treated as a self-evident concept and there often is a failure to address its meaning or the values it is intended to serve. \u003cspan class=\"fnref\"\u003e37\u003c/span\u003e Still, the parties' contentions indicate their belief that some local role exists. Our previous examination of the present statutory framework which the legislature has enacted clearly demonstrates state control and so we examined constitutional history to see if local control is a constitutionally recognized interest. Historical analysis reveals local control is not a constitutionally recognized interest and cannot be the basis for disparity in equal educational opportunity.\n\nb. History of Local Control\n\nThe constitution devotes almost an entire article to education. WYO. CONST. ART. 7, §§ 1-14. The fourteen sections very specifically describe the intended school system and the methods for financing that system. The reasons for and the constitutional framers' intent behind such devotion to detail concerning education are clarified when the historical education struggles during territorial days are examined.\n\nThe history of education during territorial days reveals Wyoming citizens' strong commitment to education for a particular purpose. As we noted earlier, various territorial governors described this purpose as preserving our free institutions by diffusion of knowledge among the people. Governor J.A. Campbell's Address to the First Legislative Assembly of Wyoming Territory (Oct. 13, 1869) in WYOMING TERRITORY, MESSAGES OF THE GOVERNORS: 1869-1890, at 14 (n.p., n.d.). Fromong, supra note 23, at 24.\n\nUnder the Organic Act, the territorial legislature did not have the power to create or establish schools but could dictate a framework for management of the schools. Fromong, supra note 23, at 23. Between 1867 and 1873, agitation arose at the local level for the establishment of effective public schools. Id. at 39-44. The 1873 Governor's message to the territorial legislature urged it to secure a uniform system of education throughout the territory. Id. at 54.\n\nWe cannot, in this age of the world, hope to gain, as permanent residents of our Territory, that class of population who have \"given hostages to fortune,\" and have the greatest interest in the preservation of our institutions, unless our educational advantages are equal to those in the most favored State. It is doubtful whether these advantages can be secured under any system of education that is not uniform throughout the Territory, and I trust that the school law will undergo such revision by you as the public interests appear to demand.\n\nId. at 54-55.\n\nThe Governor's critics agreed with him on the school question and further elucidated:\n\nOur educational advantages are not equal to the most favored state, nor can they reasonably be expected to be; they ought to be similar, but they are not equal nor expected to be equal to those in the favored States. In the new settlements of our territory — none of which are more than six years old — the majority of school buildings are inferior ones; the contrivances to give the juveniles that attend them a correct or partly correct idea of what is being taught is rude; and the convenience and comforts that surround both teacher and pupils in the States are often here wholly wanting. The system of education should be as near as practicably uniform, but those \"equal advantages\" the governor speaks of, will come slowly and by degrees, just as they did in the favored states he alluded to.\n\nThe public schools are for the young, and to prepare them to become useful and honest citizens, and we would like to see such laws enacted as will require competent teachers to be placed over them. . . .\n\nId. at 56.\n\nIn response the territorial legislature began enacting laws yearly, culminating in the comprehensive school code of 1873 which addressed many of these problems. Further, that legislation mandated local property taxation for the support of schools. 1873 Wyo. Sess. Laws, Ch. 58, § 51; Fromong, supra note 23, at 67-69. During the Territorial period, the only source of revenue for schools was from county and district taxation. Fromong, supra note 23 at 121. The ability of counties to support education varied as did their willingness. Id. at 122. Control of the system of education was vested in county superintendents and local school boards. These officials often made educational decisions without regard for the needs of students, such as hiring unqualified teachers and purchasing textbooks without regard for the appropriate curriculum. As a result, the 1873 legislation required the development of the Territorial Institute to train teachers, devise curriculum, set policies, and select textbooks. Id. at 133-152.\n\nBy 1889, some counties were reporting the state of their education system, with some boasting of excellent facilities with libraries, modern methods for delivering education, and the best teachers money could buy. Id. at 97-99. Other counties failed to report, and research reveals little commitment to education with consequent inadequacies in all areas. Id. at 258. Further, by the time of the constitutional convention, the Territorial Institute no longer operated. Id. at 257-58.\n\nThus we see that at the time of the constitutional convention, educational issues were not limited to the problem of establishing schools but included those problems inherent to local control which caused variations rather than \"equal advantages\" between the schools of the districts and \"equal advantages\" in comparison to the rest of the country. The framers' devotion of an entire constitutional article addressing education in such detail makes clear that the education article was drafted in response to a perceived need for a certain type of educational system. By the time of the constitutional convention, the importance of education was established. The framers protected the cherished right in Art. 1, § 23 which declared the right to education. Also by the time of the constitutional convention, however, the shortcomings and inadequacies of local control were obvious. The framers addressed this by settling that education was a state concern to be addressed at the state level. \u003cspan class=\"fnref\"\u003e38\u003c/span\u003e The framers vested the legislature with the responsibility to establish and maintain a complete and uniform system of public instruction and to provide sufficient revenue to create and maintain a thorough and efficient system of public schools which would deliver proper instruction to the state's school-age children.\n\nThe framers left in place the means for the legislature to fund education by local property taxes. We find nothing indicating this signified local control. Given the interest in education at the local level, the sensible explanation is the framers believed interest would be sustained if the communities continued to assist in paying for education. At the time of drafting, the framers were unaware of the vast natural resource wealth in parts of this state which would lead to a school finance system which discriminated against property-poor school districts and the Washakie litigation. The framers certainly did not intend such a system. Indeed, by the Education Article's plain requirements concerning the education system and funding, it is clear the framers contemplated two things: 1) all funds were educational resources for all of the state's youth and 2) a mandate that the state, not local boards, through the legislature, control the system of education.\n\nIt must also be accepted, however, that the framers did not prohibit a local role but left the nature and scope of that local role to the discretion of the legislature. The problems associated with local control were known to the framers, and they addressed them by vesting authority, responsibility, and control in the state legislature, effectively ensuring the state would establish the education system. So long as the constitutional mandates of a complete and uniform public instruction system and a thorough and efficient public school system which delivers proper instruction are met, nothing would appear to prohibit the legislature from delegating to local boards the authority of implementing that legislatively created and maintained system.\n\nFurther scrutiny of the Education Article indicates one section might be a possible locus of local control. WYO. CONST. ART. 7, § 11. That provision states:\n\nSec. 11. Neither the legislature nor the superintendent of public instruction shall have power to prescribe text books to be used in the public schools.\n\nAt the constitutional convention, Mr. Charles N. Potter \u003cspan class=\"fnref\"\u003e39\u003c/span\u003e explained:\n\nIt won't do to let the territory nor the superintendent of public instruction prescribe text books. I venture to say there is not more corruption than that which is caused where the prescribing of text books is left to the legislature.\n\nProceedings and Debates (Sept. 1889) in JOURNALS AND DEBATES OF THE CONSTITUTIONAL CONVENTION, WYOMING at 737 (The Daily Sun 1893).\n\nShortly after ratification, the corruption of which he spoke was explained by Potter during his service as attorney general. He said:\n\nThe evident purpose and object of this Constitutional provision was to prevent a monopoly in the sale of text books to the pupils in the public schools. It was undoubtedly intended to prohibit the adoption of any series of text books for any period of time, which would tend to reduce competition among the publishers of books, and impeding the progress of the schools of the State, by preventing them from changing from time to time to such newer or better text books as might be published and come on to the market, and be more advantageous for use in the public schools.\n\nLetter from C.N. Potter to Hon. S.T. Farwell (Aug. 31, 1892) in 1889-1906 WYO.REPORTS AND OFFICIAL OPINIONS OF ATTORNEY GENERAL at 108-09 (n.p., n.d.); and in 1890-1918 WYO.REPORTS OF SUPERINTENDENT OF PUBLIC INSTRUCTION at 33-34 (The S.A. Bristol Co., 1894).\n\nAttorney General Potter's elucidation of this provision was prompted by a concern of the State Superintendent of Public Instruction about a territorial law which required all county superintendents to meet and select textbooks for the entire state. The constitution required compliance with territorial laws. Since this territorial law appeared to conflict with the constitutional provision, the Attorney General's advice was solicited. Potter's clarification determined the provision was meant to prevent the evil of textbook monopoly. Accepting this interpretation, we see the end result permits local determination of the actual textbooks to be purchased by a school district only to avoid the evil of textbook monopoly, but the provision cannot be said to sanction or authorize local control beyond that specific task into broader areas such as determination of subject areas to be taught to students, course content and other education program policies. Limited to the prevention of the evil of textbook monopoly, that provision cannot be said also to mean the state cannot set standards with which textbooks purchased must comply. Otherwise interpreted, this provision would effectively limit the constitutional mandate for a quality education stated in §§ 1 and 9. This provision was not intended to designate local control.\n\nOne of the parties suggests that perhaps local control is recognized in WYO. CONST. ART. 3, § 27. It states:\n\n§ 27. Special and local laws prohibited.\n\nThe legislature shall not pass local or special laws in any of the following enumerated cases, that is to say: For granting divorces; laying out, opening, altering or working roads or highways; vacating roads, town plats, streets, alleys or public grounds; locating or changing county seats; regulating county or township affairs; incorporation of cities, towns or villages; or changing or amending the charters of any cities, towns or villages; regulating the practice in courts of justice; regulating the jurisdiction and duties of justice of the peace, police magistrates or constables; changing the rules of evidence in any trial or inquiry; providing for changes of venue in civil or criminal cases; declaring any person of age; for limitation of civil actions; giving effect to any informal or invalid deeds; summoning or impaneling grand or petit juries; providing for the management of common schools; regulating the rate of interest on money; the opening or conducting of any election or designating the place of voting; the sale or mortgage of real estate belonging to minors or others under disability; chartering or licensing ferries or bridges or toll roads; chartering banks, insurance companies and loan and trust companies; remitting fines, penalties or forfeitures; creating, increasing, or decreasing fees, percentages or allowances of public officers; changing the law of descent; granting to any corporation, association or individual, the right to lay down railroad tracks, or any special or exclusive privilege, immunity or franchise whatever, or amending existing charter for such purpose; for punishment of crimes; changing the names of persons or places; for the assessment or collection of taxes; affecting estates of deceased persons, minors or others under legal disabilities; extending the time for the collection of taxes; refunding money paid into the state treasury, relinquishing or extinguishing, in whole or part, the indebtedness, liabilities or obligation of any corporation or person to this state or to any municipal corporation therein; exempting property from taxation; restoring to citizenship persons convicted of infamous crimes; authorizing the creation, extension or impairing of liens; creating offices or prescribing the powers or duties of officers in counties, cities, townships or school districts; or authorizing the adoption or legitimation of children. In all other cases where a general law can be made applicable no special law shall be enacted. (Emphasis added.)\n\nOur decisions interpreting Art. 3, § 27 have viewed this provision as enlarging upon the equal protection guarantees of Art. 1, § 34. Phillips v. ABC Builders, Inc., 611 P.2d 821, 826 (Wyo. 1980). This section means only that the legislature is to pass general rather than special laws so a statute operates alike upon all persons in the same circumstances. Meyer v. Kendig, 641 P.2d 1235, 1240 (Wyo. 1982); Simons v. Laramie County School Dist. No. One, 741 P.2d 1116, 1124-25 (Wyo. 1987). The purpose served by the identification in the provision of some thirty-seven instances where general, not local, laws must be enacted, is to ensure careful consideration by the legislature as to the interests affected by enacted laws. KEITER AND NEWCOMB, supra note 26, at 96. Its purpose is not to give constitutional recognition to an interest. See Simons, 741 P.2d at 1125 (declaring violation of Art. 3, § 27 although state argued offending statute's intent was to equalize education funding in compliance with Washakie decision).\n\nThe provision's enumeration of school management means only that if the legislature passes a law concerning management of common schools, it must be a general one applicable to all schools, not a special law. The section's prohibition in this area must be read as a legislative restriction, not as constitutional recognition of an interest.\n\nc. The Constitutional Local Level Role\n\nAs the district court found, the evil of the optional mill levy was its impact upon \"basic\" equal educational opportunity. In view of the constitutional requirement that the state provide a uniform, \"proper\" education program, the question arises whether the legislature can permit optional mill levies so the local school district can raise funds outside of the state foundation program in order to enrich its students' educational opportunities beyond those offered elsewhere in the state.\n\nThe constitution requires the legislature to create and maintain a system providing an equal opportunity to a quality education. That system must be a function of state wealth. Once the legislature achieves the constitutional mandate of a cost-based, state-financed proper education, then assuming the legislature has a compelling reason for providing a mechanism by which local districts may tax themselves in order to enhance their programs in an equitable manner, \u003cspan class=\"fnref\"\u003e40\u003c/span\u003e that appears to be constitutionally permissible. However, we inject two notes of caution. First, in Skeen, the two dissenting state supreme court justices did not believe strict scrutiny permits a local enhancement mechanism. Skeen, 505 N.W.2d at 322 (Page, Gardebring, JJ, dissenting). Second, local enhancement may also result in substantive innovations which should be available to all school districts as part of a proper education. The definition of a proper education is not static and necessarily will change. Should that change occur as a result of local innovation, all students are entitled to the benefit of that change as part of a cost-based, state-financed proper education.\n\n3. Capital Construction Financing\n\nSchool districts generally fund their new building needs and building renovation and repair needs by issuing bonds for capital construction. The constitutional debt limit for bonding is 10% of assessed valuation.\n\nThe legislature directed the State Department of Education to conduct a statewide assessment of school capital construction needs and establish state priorities based upon need. An independent firm, MGT of America, Inc. (MGT), studied and reported the needs for facility renovation and repair totaled $268.7 million with a new construction need of $7.1 million for replacement, totaling just over $275 million in needed capital facility expenditures. Despite this reported need, the legislature routinely transfers capital funds designated for facilities to the foundation program to meet operational expenses. The district court found that since Washakie the legislature has provided approximately $46 million in loans and grants and approximately an additional $10 million in \"emergency\" grants. At the time of trial, only about $5 million was designated as capital funding.\n\nDespite this, the district court found the challengers had not proved constitutional harm by this evidence and held the capital construction funding scheme constitutional. We reverse. In Washakie, with respect to capital construction, we said \"the question of finances for the physical facilities with which to carry on the process of education\" is \"tarred with the same brush of disparate tax resources.\" Washakie, 606 P.2d at 337. Post-Washakie legislative changes, in actual operation, have not removed the tar from this vital part of the total educational package. As we survey the evidence, our requirement of \"statewide availability from total state resources for building construction or contribution to school buildings on a parity for all school districts\" has been virtually ignored. Id. at 337. Capital construction financing is unavailable for many. Safe and efficient physical facilities with which to carry on the process of education are a necessary element of the total educational process. State funds must be readily available for those needs. It simply will not do to set up a legislative scheme to raise funds for that purpose and then turn around and allow the diversion of those funds to another purpose. All educational purposes must be appropriately and responsibly funded to comply with the constitutional mandates of a complete and uniform system of public instruction and a thorough and efficient system of public schools adequate for the proper education of the state's school age children.\n\nWe hold deficient physical facilities deprive students of an equal educational opportunity and any financing system that allows such deficient facilities to exist is unconstitutional. The present capital construction scheme is infirm and fails to pass muster.\n\nWe now consider the funding disparities which the district court considered to be caused by the distribution formula and were not wealth-based.\n\nDistribution Formula Funding Disparities\n\n1. Distribution Formula\n\nAs explained earlier, to distribute the collected revenue, the state, through the Foundation Program, determines, by formula, the amount of funding each school district will require for the year's operating expenses. This amount is called the state guaranteed entitlement. The school district reports its expected local revenue and if a school district's local resources generate less revenue than its guaranteed entitlement, the state pays the difference. The main component of the formula which determines a school's funding amount is the classroom unit. In theory, a school funding amount can be determined either on a per student basis or by classroom unit. Wyoming utilizes the classroom unit method and each year the legislature assigns a classroom unit value. In the 1992-93 school year, the classroom unit value was $92,331. That figure is not set by Wyoming school districts calculating the actual cost of providing education for students; rather, it is a legislatively determined figure.\n\nBased on another formula, the divisor system, a school district calculates how many classroom units it has and multiplies that number by $92,331 to determine the amount of its operating revenue. \u003cspan class=\"fnref\"\u003e41\u003c/span\u003e School districts receive add-on revenue consisting of state reimbursements to the school districts for 75% of their busing costs and 85% of their costs for special education. A feature of the divisor system is the recalculation formula which may permit additional revenue during the school year if enrollment actually is higher than anticipated. A municipal divisor rule causes all schools within an incorporated municipality to receive the largest divisor regardless of size. The challengers attacked the divisor system, the municipal divisor, and the recalculation formula.\n\nThe district court found the disparities challenged are the result of factors relating to a desire to preserve small schools in rural areas, an assumption it costs more to preserve smallness, an assumption of economies of scale in larger (urban) schools, and an assumption diseconomies of scale do not occur regardless of how large a school may grow. Washakie emphasized that only cost-justified disparities are constitutional. The district court's post-trial decision letter accurately captured the essence of the school districts' concerns:\n\nThe Wyoming system of school funding attempts to preserve history by recognizing that funds should be made available to those districts which have maintained smaller schools in order to continue to service all students within the district, however remote they might be from a larger population center. This often entails maintaining several high schools of much less than optimal size in order to accommodate the educational needs of those students without busing them to centers of greater population located some distance away. . . .\n\nThe other end of the scale involves the larger districts and the system through its divisors imposes economies of scale. . . . [The divisor] system provided no incentive to lower class size and in fact provided a disincentive to those districts which attempted to do so. So it was that the legislature made a choice between maintaining those smaller schools, realizing that they were operating well under optimal capacity, while at the same time imposing upon the larger municipalities the discipline of economies of scale. It is interesting to note that these two forces are virtually mutually exclusive. If one were to uniformly impose economies of scale upon all districts, it would necessarily mean the demise of the smaller schools. Yet, at the same time, by imposing economies of scale on the larger schools, such schools are precluded from enjoying the perceived advantages of smaller classes.\n\nThe effect of the legislative choice is not particularly hard to discern. There was much evidence showing that the choice resulted in more money per student available to the smaller districts than to the larger districts. In the main, this disparity in funding created a disparity in the class size. The larger districts were forced to offer larger classes than the smaller districts. On the other hand, the larger districts were able to offer more courses, including more advanced courses, than the smaller districts. Also there was some evidence adduced that the students from larger districts did not score as well as students from the smaller districts as first year students at the University of Wyoming.\n\nHere, the defenders attempt to justify a size-driven funding disparity based upon unproven assumptions of cost and economies of scale. Applying Washakie, we hold any justification which is not demonstrably cost-based is constitutionally infirm.\n\nThe district court accepted that the distribution formula caused funding disparities and found the classroom unit and divisor system to be deficient, irrational and causing a genuine funding disadvantage to each student of the larger districts. The court, however, upheld the entire distribution system since, in the district court's opinion, the challengers failed to meet their burden of proof when they did not measure all costs. The district court also found the distribution system caused no significant disparity of educational quality or educational opportunity, only a genuine potential for disparity. We reverse.\n\nTo reiterate, we apply strict scrutiny to the distribution component of the school finance system. Washakie, 606 P.2d at 334-35. The state bears the burden of proving funding disparities are cost-justified or a compelling reason justifies disparity. Where the evidence establishes funding and spending disparities unjustified by educational cost differentials, the challengers are not burdened with proving disparity of educational quality or educational opportunity; those disparities are presumed. Washakie, 606 P.2d at 334. A review of the district court's findings of fact reveals that the disparities caused by the distribution formula are not cost-based.\n\n2. Findings of Fact\n\na. CRU\n\nA review of the district court's findings of fact reveals the evidence did not demonstrate the necessary cost-based justifications. As originally conceived in the 1950's, the CRU captured the size of classrooms within various sized schools. By determining the amount needed to operate a classroom in various sized schools, smaller schools were assured sufficient funding. In the district court's view, the reality of funding the actual number of classrooms in the state has been lost. The CRU today is merely a unit for distributing dollars and does not reflect the actual number of classrooms which are maintained within a particular district.\n\nThe district court quoted Barry Nimmo's Department of Education publication which states \"the method of computing the classroom unit does not involve any `objectively determined external criteria — such as actual costs of education, or demonstrated need for major facility repairs — but a legislatively mandated formula based almost entirely on prior year enrollment and operations' and it is `likely that the guarantee in some cases provides too little or too much funding to particular school districts in particular years.'\" The district court agreed it could not tell what each CRU buys.\n\nb. Divisors\n\nOriginally, the concept behind divisors was to assure CRUs were weighted in favor of smaller schools, generally believed to be costlier than large schools. A smaller divisor will generate more CRUs than will a larger divisor applied to the same number of students. Low enrollment schools receive the smaller divisors and more funding per student while all schools having a student population over 500 are assigned the largest divisor of 23 and receive less funding per student. The concept views this as fair since larger schools and school districts enjoy \"economies of scale\" allowing efficient educating of students for the same dollars per classroom unit as districts with smaller numbers of students.\n\nThe district court found a state study failed to investigate the actual costs needed to provide a basic education package to each student and whether the differences in funding per student were justified by differences in cost. Dr. Andersen, developer of the present day divisor system, testified the system's purpose was not cost-related. We know further the state legislature did not study costs as promised in the preamble of its 1983 transitional legislation. Former state superintendent Lynn Simons and former State Board of Education member Jack Iversen both testified the divisor system was not cost-based. The district court determined the divisor system, in fact, defies the law of economics, once a school becomes locked into the 23 divisor. At certain sizes, schools can no longer take advantage of economies of scale and in fact diseconomies of scale, meaning costs increase, begin to occur as a school moves beyond the optimum size. The divisor system fails to recognize this. The weight of this evidence is that the distribution formula is not based upon costs.\n\nThe district court found the divisor system caused funding disparities. Since those funding disparities are not based upon actual cost differentials, they are unjustified and, therefore, unconstitutional. The district court found \"to the extent of such differences, there exists a genuine potential difference in educational opportunity.\" Washakie presumes funding disparity results in educational opportunity disparity.\n\nc. Municipal Divisor\n\nAs explained earlier, another critical element which can limit a school district's funds is the municipal divisor feature which assigns a higher divisor to any school within an incorporated city or town or within five miles of an incorporated city or town, regardless of size. In effect, all schools of a particular type within a single municipality are treated as a single school.\n\nDespite the accepted belief smaller schools are costlier, the effect of the municipal divisor is such that a school of 150 students which is in a town or city will be assigned a higher divisor, and consequently less money, than the same size school in a smaller community. The district court found the record showed no provable difference in the cost of running these two schools. By accident of location, however, one school receives one-third more funding.\n\nThe district court declared the municipal divisor unconstitutional. The district court found the state's only reason to assign the higher divisor to any school within a city or town was to prevent towns from building unnecessarily small schools which would receive a low divisor and generate more funding. No proof was offered that this was or had been a problem. School superintendents testified it is nonsensical to believe millions would be spent to build an unneeded school in order to receive a limited amount of funding. The district court concluded this made no sense and was not equitable. We affirm the district court's ruling that the municipal divisor statute is unconstitutional.\n\nd. Recalculation Formula\n\nThe challengers alleged the recalculation formula resulted in inequity for large districts because those districts on the low end of the divisor scale will receive an additional CRU if a single family with two or three children move into the community. However, in a large district with a 23 divisor, should there be an increase of 297 students (99 elementary students, 99 junior high students and 99 high school students), there would not be any additional CRUs. The district court did not address this issue in its final order, but the weight of the evidence is convincing that increased student population increased education costs. Funding increased costs in a different manner based on school size and location is arbitrary and causes unjustified funding disparities. The formula causing unjustified funding variations is unconstitutional.\n\n3. Cost Differentials\n\nWhether this trial would result in redistribution of the funding pie was the primary concern of the defenders:\n\nQ. Isn't it also true that if the funding were reallocated so that you felt yours was adequate, and everyone involved believed that it was a rational basis for the way it was allocated, that someone would still be below average and someone would still be in last place, some district?\n\nThe response of Jack Iversen, superintendent of Laramie County School District, precisely comprehends the constitutional mandate:\n\nA. I would hope that through a cost of education foundation to the whole distribution system that we would not have inadequate opportunities for children, inadequate systems. To answer your question as directly as I can, there doesn't have to be losers in the system. I think if the distribution system is based on how much it costs to educate a child, then we're ensuring the children get educated, . . . .\n\n\"There doesn't have to be losers in the system\" is definitive of the meaning of equal educational opportunity to a proper education. The definition of a proper education is not static, but will change. As revealed by trial testimony from all parties and the rules of the state board of education, a proper education today requires that broad categories of students' needs must be addressed with appropriate education programs. Today's educators recognize a proper education requires appropriate curriculum in core curriculum, core skills, advanced placement courses and rapidly changing computer technology, small schools, and small class size. These and other indicia of educational opportunity must be afforded regardless of school size or location.\n\nAn equal opportunity for a proper education necessarily contemplates the playing field will be leveled so each child has an equal chance for educational success. See Kukor, 436 N.W.2d at 588 (Bablitch, J., dissenting). Educational success must be defined as graduating from high school equipped for a role as a citizen, participant in the political system and competitor both intellectually and economically. Our children's readiness to learn is impacted by social ills, learning deficiencies and a system itself which forces them into large classes or large schools.\n\nChildren with an impaired readiness to learn do not have the same equal opportunity for a quality education as do those children not impacted by personal or social ills simply because they do not have the same starting point in learning. A legislatively created finance system which distributes dollars without regard for the need to level the playing field does not provide an equal opportunity for a quality education. Having no losers in the system requires there be no shrinking pie but a pie of the size needed. Once education need is determined, the pie must be large enough to fund that need.\n\nThe provisions of Article 7 of the Wyoming Constitution are a guide to the legislature for planning, administering and financing an education system. The responsibility for transforming guidelines into a constitutionally acceptable education system rests upon the legislature. Substantively, the constitution uses terms commanding the legislature to provide and fund an education system which is of a quality \"appropriate for the times.\" No other reasonable conclusion can be drawn except the obvious one that the specific directives of §§ 1 and 9 are well beyond simply allowing the legislature to dispense a minimal level of elementary and secondary education and then fund it as best it can amidst other competing priorities. Supporting an opportunity for a complete, proper, quality education is the legislature's paramount priority; competing priorities not of constitutional magnitude are secondary, and the legislature may not yield to them until constitutionally sufficient provision is made for elementary and secondary education.\n\nAs nearly as possible, and making allowances for local conditions, special needs and problems, and educational cost differentials, the education system must achieve financial parity. A cost of education study \u003cspan class=\"fnref\"\u003e42\u003c/span\u003e and analysis must be conducted and the results must inform the creation of a new funding system. To fulfill the constitutional command of \"equality of financing will achieve equality of quality,\" the legislature must state and describe what a \"proper education\" is for a Wyoming child. The constitution requires it be the best that we can do. The legislature, in fulfilling its constitutional duty, must define and specify what that is. Trial testimony indicated aspects of a quality education will include:\n\n1. Small schools \u003cspan class=\"fnref\"\u003e43\u003c/span\u003e, small class size, low student/teacher ratios, textbooks, low student/personal computer ratios.\n\n2. Integrated, substantially uniform substantive curriculum decided by the legislature through the State Superintendent of Public Instruction and the State Board of Education with input from local school boards.\n\n3. Ample, appropriate provision for at-risk students, special problem students, talented students.\n\n4. Setting of meaningful standards for course content and knowledge attainment intended to achieve the legislative goal of equipping all students for entry to the University of Wyoming and Wyoming Community Colleges or which will achieve the other purposes of education.\n\n5. Timely and meaningful assessment of all students' progress in core curriculum and core skills regardless of whether those students intend to pursue college or vocational training.\n\nTo summarize, considering all of these various factors, the legislature must first design the best educational system by identifying the \"proper\" educational package each Wyoming student is entitled to have whether she lives in Laramie or in Sundance. The cost of that educational package must then be determined and the legislature must then take the necessary action to fund that package. Because education is one of the state's most important functions, lack of financial resources will not be an acceptable reason for failure to provide the best educational system. All other financial considerations must yield until education is funded.\n\nThe state financed basket of quality educational goods and services available to all school-age youth must be nearly identical from district to district. If a local district then wants to enhance the content of that basket, the legislature can provide a mechanism by which it can be done. But first, before all else, the constitutional basket must be filled.\n\nCONCLUSION\n\nNothing in this decision shall be construed to interfere with, impair, or adversely affect existing bond obligations of the various school districts throughout the state. We realize the legislature must be afforded ample time for adequate study, drafting of appropriate reform legislation, and debate on and passage of that legislation. Consequently, as we did in Washakie, we shall provide a reasonable period of time for the legislature to achieve constitutional compliance. We order that the legislature shall achieve that compliance not later than July 1, 1997.\n\nWe remand to the district court with directions to enter judgment consistent with this opinion and retain jurisdiction until a constitutional body of legislation is enacted and in effect, taking such action as may be necessary to assure conformity.\n\nTHOMAS, J., files a specially concurring opinion.\n\nTHOMAS, Justice, concurring.\n\nI concur in all the majority has said in this case. As the only member of the current court who participated in Washakie County Sch. Dist. No. 1 v. Herschler, 606 P.2d 310 (Wyo. 1980), cert. denied sub nom., Hot Springs County Sch. Dist. No. 1 v. Washakie, 449 U.S. 824, 101 S.Ct. 86, 66 L.Ed.2d 28 (1980), I must express my disappointment at legislative shortfall. Washakie should have been sufficient to explain the failure to satisfy the constitutional requirements. The legislature has not done what it promised in its preamble to the 1983 legislation redesigning the school financing structure. Instead of reducing disparity in funding education, that disparity has been exacerbated. Whether the State Department of Education's efforts were stymied by lack of funding or executive shortfall may be debatable. In any event, what was intended to happen never occurred.\n\nI am reminded of a remote broadcast of an Army-Navy football game in the early 1950s. During an exciting moment of play in the fourth quarter, the announcer, a person who enjoys renown in his field, described the action on the field in this way: \"Look, there's a fumble rolling around in the air!\"\n\nWhile I do not claim any expertise in educational funding, it is my impression a formula can be developed that will begin with an appropriate baseline for equal funding, whether on a classroom basis or on an individual student basis. Appropriately, that baseline will be adjusted to account for disparities representing actual cost differentials from district to district and supported by empirical data. I believe the financial records of the several school districts, in the hands of a competent cost accountant, will provide the facts essential to those adjustments. Obviously the measurable factors impacting the costs of education from place to place are not total mysteries and can be factually demonstrated rather than assumed. This is the sort of system the Washakie court envisioned. It was never the vision of the Washakie court that the constitutional mandates could be satisfied by expert opinion and arbitrary advisors. Certainly, that approach is unconscionable when facts are available.\n\nAs the majority suggests, it may be essential to \"a complete and uniform system of public education\" to depart from the traditional tax methodology for school financing and simply implement a statewide levy that will be adequate to satisfy the constitutional mandates. That would readily avoid the wealth-based complications represented by the local mill levies and the recapture provisions. Equitable division of that sort of education fund would be far better than the current method with its propensities for catering to local demands and issues.\n\nORDER DENYING REHEARING AND RESPONDING TO REQUESTS FOR CLARIFICATION\n\nThe court after examination and study of the petition for rehearing concludes:\n\n1. The opinion and decision of the court was implicit in its language that it was prospective in operation and not intended to disturb present statutory provisions for financing of school operations, including bonded indebtedness.\n\n2. Other than clarifying the prospective operation of the opinion, all other questions raised by the petition for rehearing have already been considered and resolved within the court's opinion.\n\nIt is therefore\n\nORDERED that the relief granted and direction of the court's opinion handed down on November 8, 1995, are prospective.\n\nFURTHER ORDERED that the school finance system of the state of Wyoming continue under existing statutes, and the validity and enforceability of past and future acts, bonded indebtedness and obligations incurred under applicable statutes, as long as they remain in force and effect, are assured.\n\nFURTHER ORDERED that the judgment of the district court, made and entered on the mandate, be consistent with this order.\n\nFINALLY ORDERED that the petition for rehearing be and is denied, except as otherwise in this order provided.\n\nDATED this 5th day of December, 1995.\n\n\u003cspan class=\"fn\"\u003e1. Defendants later dismissed from the suit were the Governor and State Treasurer.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The following school districts intervened: Big Horn County No. 1, Big Horn County No. 4, Carbon County No. 2, Crook County No. 1, Fremont County No. 9, Fremont County No. 14, Fremont County No. 24, Fremont County No. 38, Hot Springs County No. 1, Johnson County No. 1, Laramie County No. 2, Niobrara County No. 1, Park County No. 16, Platte County No. 1, Platte County No. 2, Sheridan County No. 1, Sheridan County No. 3, Sublette County No. 1, Sublette County No. 9, Uinta County No. 4, Washakie County No. 2, Weston County No. 1, Weston County No. 7.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. In Case No. 94-136, the brief of Appellant-Plaintiffs, Campbell County School District, State of Wyoming, et al., presents these issues: A. Whether the trial court erred in determining that the several components of the school finance system can be isolated and subjected to differing standards of judicial scrutiny? B. Whether the trial court erred in holding that the strict scrutiny standard of review does not apply to the distribution side of the finance system. C. Whether the trial court erred in holding that the recapture aspect of the school finance system is unconstitutional. D. Whether by any standard of scrutiny, the court's conclusions are contrary to its factual findings and the evidence? The brief of Appellee-Defendant State of Wyoming, et al., presents these issues for Case Nos. 94-136, 94-138, and 94-139: Does the evidence support the findings and conclusions of the trial court which upheld the constitutionality of the Wyoming school finance system? The brief of Appellee-Intervening Defendant School Districts Big Horn County School District No. One, et al., in Case Nos. 94-136, 94-138, and 94-139 states the issues as: I. Did the district court properly refuse to apply a strict scrutiny test to the method of distributing school finances when the adequacy of school funding has not been challenged? II. Did the district court properly determine that the current divisor system provides an equitable allocation of school monies as required by Washakie? In Case No. 94-137, Appellant-Defendant State of Wyoming presents these issues: I. Does the separation of powers requirement prevent judicial modification of the school funding system when the public schools are meeting the constitutional standards? II. What is plaintiffs' burden of proof in a challenge to the constitutionality of the school funding system? III. What is the constitutional standard by which the public school system must be measured? IV. May any parts of the school funding system be invalidated without proof of educational harm to any student? Appellee-Intervening Plaintiff Wyoming Education Association presents these issues in reply for Case Nos. 94-137 and 94-140: I. Is the exercise of authority by the court to declare statutes unconstitutional in violation of the doctrine of the separation of powers? II. Did the district court err in applying the strict scrutiny standard of equal protection to the optional mills and recapture provisions of the school finance system? III. What is the proper criteria for demonstrating constitutional harm in a school finance case? IV. Whether the optional mills, recapture and municipal divisor features of the finance system are constitutional under any standard of review? Appellee-Plaintiff Campbell County School District, State of Wyoming, et al., in Case Nos. 94-137 and 94-140 address the issues presented by Appellant-Defendant State, Intervening Defendants, and the Amicus Curiae brief of the Wyoming Legislature. Appellee-Intervening Plaintiff Laramie County School District No. One, in reply to Appellant-Defendant State of Wyoming and Appellant-Intervening Defendant Big Horn School District, in Case Nos. 94-137, 94-140 states this issue: Are the recapture, optional mills, and municipal divisor provisions of the State of Wyoming school finance scheme subject to strict scrutiny? The Amicus Curiae Brief of Wyoming Legislature and Management Council in Case No. 94-137 presents this issue: I. Whether the decision of the district court violates the Wyoming Constitution by usurping the authority of the Wyoming legislature. In Case No. 94-138, Appellant-Intervening Plaintiff Laramie County School District No. One presents these issues: A. Did the district court err in failing to apply the strict scrutiny standard to the entire system of funding public education in Wyoming? (i) Did the district court err by failing to apply the strict scrutiny standard to the distribution of funds for public education in Wyoming? (ii) Did the district court err when it imposed the burden of proof on the plaintiffs to establish that there was \"an immediate and grave threat to the constitutional guarantee of a quality education\" in the present system for funding capital construction projects for schools? In Case No. 94-139, Appellant-Intervening Plaintiff Wyoming Education Association presents these issues: 1. Was sufficient \"constitutional harm\" shown to permit the court to rule on the constitutionality of the capital construction finance system? 2. Is the system of capital construction financing constitutional? 3. Does the strict scrutiny standard of equal protection apply to the distribution as well as the collection of educational funds? 4. Under any standard of equal protection or other constitutional provisions, is the current system of distribution constitutional? Amicus Curiae Lincoln County School District No. Two presents this issue for Case No. 94-139: (1) Assuming, as the District Court found, that the capital construction provisions of the Wyoming Statutes require strict scrutiny, did the intervening plaintiff, the Wyoming Education Association (\"WEA\"), fail to establish proof of harm to a constitutionally protected right so that the District Court was correct in finding that there was no basis for declaring the capital construction provisions unconstitutional? (2) Assuming the absence of proof at trial of the \"specific nature of the harm and its immediacy\" (Findings of Fact, Conclusions of Law and Final Order, Appendix B, p. 24), is the statutory structure governing capital construction financing now so inherently defective that the Supreme Court should declare it unconstitutional for the benefit of the school children of the state and to avoid further expensive litigation of questionable value? In Case No. 94-140, Appellant-Intervening Defendant Big Horn County School District No. One, State of Wyoming, et al., state these issues: A. Should the district court have applied a \"strict scrutiny\" standard of review to determine the constitutionality of the optional mills provisions in Wyoming Statute § 21-13-102(a)? B. Should the district court have applied a \"strict scrutiny\" standard of review to determine the constitutionality of the recapture provisions in Wyoming Statute § 21-13-102(b)?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The local twenty-five mill levy had been optional. The change to mandatory levy was accomplished by legislation without the necessity of a constitutional amendment. WYO. STAT. § 21-13-102(a)(i)(A) (1983) (amended Supp. 1995). The revenue generated from this levy is computed as a local resource.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Prior to Washakie, the local districts were empowered to levy up to twelve mills if they so desired. The state was authorized to levy up to six mills for educational purposes. The committee recommended these mill levy amounts be reversed, placing the six mill option with the local districts and mandating an additional twelve mills which the state would levy for purposes of supporting the State Foundation Program. This suggestion was approved by voters when presented as a constitutional amendment. WYO. STAT. § 21-13-102(a)(i)(B) (1983) (amended Supp. 1995). Thus, a twelve mill levy became a state resource, WYO. STAT. § 21-13-303(a) (1983) (amended 1987), and directed to the State Foundation Program, and a six mill county levy became a local resource reducing the amount of foundation funds available to a school district. WYO. STAT. § 21-13-201(a) (1983).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Local resources available to generate revenue include the six mill county mill levy, the twenty-five mill local district levy, school land income, fines and forfeitures, forest reserve/Taylor grazing fees, motor vehicle fees, and tuition.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Add-ons include transportation operation and maintenance, transportation capital outlay (buses and other vehicles), tuition paid, costs of isolation/homebound students, special education, one-teacher schools, and vocational education.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. As an example, the statute's divisor schedule for elementary schools provides: Elementary School Divisor Schedule: Average Daily Divisor Minimum Classroom Membership Units Less than 10 8 1.00 10 but less than 27 8 1.20 27 but less than 44 12 3.25 44 but less than 76 14 3.60 76 but less than 151 16 5.36 151 but less than 19 9.38 301 301 but less than 22 15.79 501 501 and over 23 22.73 WYOMING SCHOOL FOUNDATION PROGRAM, at 49, quoting WYO. STAT. § 21-13-308(c).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Under the statutory formula, the portion of the guarantee based upon enrollment is calculated as: No. of Students (ADM) X Statutory Classroom = State Guarantee Statutory Divisor Unit Value\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Funds outside of the program are also available for gifted and talented grants and compensatory education grants. These grants are capped respectively at $350,000 and $1,000,000 statewide.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. In Washakie, we said there is no constitutional requirement that school buildings (physical facilities) must be built by creation of debt. Washakie, 606 P.2d at 337.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Total Number of Wyoming Students: 98,951 Plaintiff School Districts: Uinta # 1 3,708 Sweetwater # 1 6,006 Sweetwater # 2 3,924 Laramie # 1 (Intervenor) 13,517 Campbell # 1 7,983 _______ 35,138 Defender School Districts: 15,128 students.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. In Washakie, the difference in general fund revenue per student (ADM) was $2,360. Washakie, 606 P.2d at 338-39. For the 1991-92 school year, that difference was $13,016.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The district court gave two examples. In the first example, an elementary school of 150 students subject to the municipal divisor would receive 6.5 CRUs. An elementary school of 150 students not subject to the municipal divisor would receive 9.4 CRUs. The court found no evidence one cost one third more to operate than the other. In the second example, a junior high school and high school combined to achieve economy of scale received separate, lower divisors resulting in one third more funding than did schools with similar enrollment subjected to a higher divisor because of their location.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Example of disparity between school districts is: # of students $/student Fremont Cty # 24, Shoshoni 318 9,741 Platte Cty # 2, Guernsey 319 7,068 At trial, the only explanation suggested for a $2700 difference for having one additional student was optional mill levies.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. The example used by the district court was Laramie County School District Number Two which supports high schools at Burns, Albin, and Pine Bluffs.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. The district court did not define this term. Testimony at trial indicated that a number of factors are considered to determine whether a school is a necessarily small school or can be consolidated with another.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. A 1989 Wyoming Education and Economics Task Force determined those citizens with the most limited basic skills include 68% of all those arrested, 85% of unwed mothers, 79% of welfare dependents, 85% of high school dropouts, and 72% of the unemployed. EDUCATION AND ECONOMICS TASK FORCE, REPORT TO THE STATE BOARD OF EDUCATION/STATE SUPERINTENDENT OF PUBLIC INSTRUCTION. GREATER EXPECTATIONS: RAISING STANDARDS, FORMING PARTNERSHIPS, AND ACCOUNTING FOR STUDENT LEARNING, at 5-6 (Nov. 1989). Currently, Wyoming's State Board of Education requires all schools to address the needs of at-risk students. Wyoming State Board of Education Rules and Regulations, Ch. VI, § 11 (1993).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. School districts from both parties testified that in the face of budget shortfalls, their highest priority is maintaining a low class size. Initial budget cuts are aimed at textbook purchases, computer purchases, computer maintenance and training, electives, extracurricular activities and support staff personnel. Only when these cuts prove insufficient will the number of teachers be cut since this directly causes increases in class sizes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Among those are poverty and parental absence or neglect. That poverty is a growing concern can be seen in the increasing percentages of students in school districts whose families receive welfare assistance or qualify for free and reduced price lunches. In LCSD # 1, ten of its twenty elementary schools have been designated as Chapter One schools because 49% of the student population qualify for free and reduced price lunches and score less than the 29th percentile in reading and math. A Chapter One school designation qualifies the school to receive federal funding as part of a national recognition that poverty is linked to decreased student success. Despite this additional funding, the budget manager for LCSD # 1 testified the increased costs associated with at-risk students has left the district functionally bankrupt from the constant deficits the school district has experienced. Most Wyoming schools must deal with these increased costs without federal funding.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. At the time of trial, recapture districts were Campbell County School District No. One, Sublette County School District Nos. One and Nine, Park County School District No. Sixteen, and Lincoln County School District No. One.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. The Court's pre-trial and post-trial decision letters were incorporated into its findings of fact and conclusions of law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Terence D. Fromong, The Development of Public Elementary and Secondary Education in Wyoming: 1869-1917, 153-157 (1962) (unpublished Ph.D. dissertation, University of Wyoming (Laramie)). See also John A. Bartholow, The Development of Public Elementary Education in Wyoming: 1917-1945 (1969) (unpublished dissertation, University of Wyoming (Laramie)); George J. Bale, A History of the Development of Territorial Public Education in the State of Wyoming, 1869-1890 (1938) (unpublished dissertation, University of Colorado (Boulder)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. WYO. CONST. ART. 7, § 14.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. WYO. CONST. ART. 7, §§ 2, 3, 5, AND 9.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. ROBERT B. KEITER AND TIM NEWCOMB, THE WYOMING STATE CONSTITUTION, A REFERENCE GUIDE 3 (1993). See also Fromong, supra note 23.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Because Art. 7 uses the word \"instruction\" while Art. 1, § 23 uses the word \"education,\" we also study its definition.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. For admission to the 1995 fall semester, the University of Wyoming required: 1. Graduates of Wyoming high schools need cumulative high school grade point averages of 2.75 or above. . . . 2. [C]omplete at least 13 high school units in the following pre-college curriculum (one unit = one year): Four units of English/communication/language arts are required, with at least three units containing a substantial writing component. Speech and other communication-based courses with substantial writing components may meet this requirement. You may also complete three units in English/communication/language arts plus two units of the same foreign language for this requirement. [T]hree units of mathematics including the concepts of a college preparatory algebra I, algebra II, and geometry sequence. . . . Recommend . . . algebra II, geometry, or a higher-level math course during your senior year. Three units of science are required. At least one unit must be from the physical sciences: physics, chemistry, or a college preparatory physical science course. The other two units may be from any combination of biological, life, physical, or earth/space sciences. [T]hree cultural context units selected from the behavioral or social sciences, visual or performing arts, humanities, or foreign languages. Univ. of Wyoming, Freshman Viewbook, 1994-95.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Several decisions indicate the meaning of \"uniform\" includes a standardized school curriculum. Kukor, 436 N.W.2d at 577-78; Thompson v. Engelking, 96 Idaho 793, 809-10, 537 P.2d 635, 651-52 (1975); Idaho Schools for Equal Educ. v. Evans, 123 Idaho 573, 579-580, 850 P.2d 724, 730-731 (1993). A standardized statewide curriculum is not a foreign concept for Wyoming. In 1896, the State Superintendent of Public Instruction informed the legislature a uniform, standardized, integrated curriculum was needed. Fromong, supra note 23 at 260-62. That office published a suggested course of study and through the efforts of educators the state progressed towards uniformity. Id. at 263-66. The 1913 State Legislature mandated the state superintendent develop a course of study for the elementary schools of the state: reading, spelling, writing, United States history, language and grammar, numbers and arithmetic, history and civil government of Wyoming, humane treatment of animals, nature study and geography, physiology and hygiene, with special instruction of the effects of alcoholic drinks and narcotics, and agriculture. Id. at 272.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. The rules list the areas of a common core of knowledge as language arts, social studies, mathematics, science, fine arts and performing arts, physical education, health and safety, humanities, career options, foreign cultures including language, and applied technology.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. Problem solving, interpersonal communications, keyboarding and computer applications, critical thinking, creativity, life skills, including cardiopulmonary resuscitation (CPR) training.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. The presence of education in state constitutions has generated challenges based upon equal protection claims and challenges based upon the various education provisions. The variations in state constitutions have produced diverse holdings. Those states holding their finance systems unconstitutional are: Roosevelt Elem. School Dist. v. Bishop, 179 Ariz. 233, 877 P.2d 806 (1994); Dupree v. Alma Sch. Dist. No. 30, 279 Ark. 340, 651 S.W.2d 90 (1983); Serrano v. Priest, 18 Cal.3d 728, 135 Cal.Rptr. 345, 557 P.2d 929 (1976) (Serrano II), cert. denied, 432 U.S. 907, 97 S.Ct. 2951, 53 L.Ed.2d 1079 (1977); Horton v. Meskill, 172 Conn. 615, 376 A.2d 359 (1977); Rose v. Council for Better Educ., 790 S.W.2d 186 (Ky. 1989); McDuffy v. Secretary of Exec. Off. of Educ., 415 Mass. 545, 615 N.E.2d 516 (1993); Helena Elementary Sch. Dist. No. 1 v. State, 236 Mont. 44, 769 P.2d 684 (1989); Robinson v. Cahill, 62 N.J. 473, 303 A.2d 273 (1973), cert. denied, 414 U.S. 976, 94 S.Ct. 292, 38 L.Ed.2d 219 (1973) (Robinson I); Abbott v. Burke, 119 N.J. 287, 575 A.2d 359 (1990); Tennessee Small School Sys. v. McWherter, 851 S.W.2d 139 (Tenn. 1993); Edgewood Indep. Sch. Dist. v. Kirby, 777 S.W.2d 391 (Tex. 1989); Seattle Sch. Dist. v. State, 90 Wn.2d 476, 585 P.2d 71 (1978). Those states holding their finance systems constitutional are: Lujan v. Colorado State Bd. of Educ., 649 P.2d 1005 (Colo. 1982); McDaniel v. Thomas, 248 Ga. 632, 285 S.E.2d 156 (1981); Thompson v. Engelking, 96 Idaho 793, 537 P.2d 635 (1975); People ex rel. Jones v. Adams, 40 Ill. App.3d 189, 350 N.E.2d 767 (1976); Unified Sch. Dist. No. 229 v. Kansas, 256 Kan. 232, 885 P.2d 1170 (1994), cert. denied, ___ U.S. ___, 115 S.Ct. 2582, 132 L.Ed.2d 832 (1995); Hornbeck v. Somerset County Bd. of Educ., 295 Md. 597, 458 A.2d 758 (1983); Milliken v. Green, 390 Mich. 389, 212 N.W.2d 711 (1973); Skeen v. Minnesota, 505 N.W.2d 299 (Minn. 1993); Gould v. Orr, 244 Neb. 163, 506 N.W.2d 349 (1993); Bd. of Educ. Levittown v. Nyquist, 57 N.Y.2d 27, 453 N.Y.S.2d 643, 439 N.E.2d 359 (1982), appeal dismissed, 459 U.S. 1138, 1139, 103 S.Ct. 775, 74 L.Ed.2d 986 (1993); Bismarck Public School Dist. 1 v. State, 511 N.W.2d 247 (N.D. 1994) (although three of the court's five justices found the system unconstitutional, a super-majority of four votes is necessary to declare a statute unconstitutional); Bd. of Educ. of Cincinnati v. Walter, 58 Ohio St.2d 368, 390 N.E.2d 813 (1979), cert. denied, 444 U.S. 1015, 100 S.Ct. 665, 62 L.Ed.2d 644 (1980); Fair Sch. Finance Council of Okla. v. State, 746 P.2d 1135 (Okla. 1987); Olsen v. State, 276 Or. 9, 554 P.2d 139 (1976); Danson v. Casey, 484 Pa. 415, 399 A.2d 360 (1979); Richland County v. Campbell, 294 S.C. 346, 364 S.E.2d 470 (1988); Kukor v. Grover, 148 Wis.2d 469, 436 N.W.2d 568 (1989).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. The following school reform cases have applied strict scrutiny: Roosevelt Elem. School Dist. v. Bishop, 179 Ariz. 233, 877 P.2d 806 (1994) (two justices in the plurality decision would have applied strict scrutiny); Horton v. Meskill, 172 Conn. 615, 376 A.2d 359 (1977); Pauley v. Kelly, 162 W. Va. 672, 255 S.E.2d 859 (1979); Serrano v. Priest, 18 Cal.3d 728, 135 Cal.Rptr. 345, 557 P.2d 929 (1976), cert. denied, 432 U.S. 907, 97 S.Ct. 2951, 53 L.Ed.2d 1079 (1977). North Dakota applied an intermediate level of scrutiny. Bismarck Public School Dist. 1 v. State, 511 N.W.2d 247 (N.D. 1994). The following cases applied rational scrutiny: Lujan v. Colorado State Bd. of Educ., 649 P.2d 1005 (Colo. 1982) (two justices in the plurality would have applied rational scrutiny); McDaniel v. Thomas, 248 Ga. 632, 285 S.E.2d 156 (1981); Hornbeck v. Somerset County Bd. of Educ., 295 Md. 597, 458 A.2d 758 (1983); Bd. of Educ., Levittown v. Nyquist, 57 N.Y.2d 27, 453 N.Y.S.2d 643, 439 N.E.2d 359 (1982), appeal dismissed, 459 U.S. 1138, 1139, 103 S.Ct. 775, 74 L.Ed.2d 986 (1983); Board of Educ. of the City School Dist. of Cincinnati v. Walter, 58 Ohio St.2d 368, 390 N.E.2d 813 (1979), cert. denied, 444 U.S. 1015, 100 S.Ct. 665, 62 L.Ed.2d 644 (1980).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. Washakie said: We are well aware that the formula that will provide equality will be quite complex. More money may be needed in one school district to achieve quality education than in another because of, e.g., transportation costs, building maintenance costs, construction costs, logistic considerations, number of pupils with special problems, et cetera. However, it is not problem that cannot be solved, challenging though it might be. Washakie, 606 P.2d at 315 n. 3.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. That relevant portion of the provision states: Provision shall be made by general law for the equitable allocation of such income among all school districts in the state. . . . WYO. CONST. ART. 7, § 8.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. Example: Foundation Guarantee: $100,000 Local Resources: 110,000 109% of Guarantee: 109,000 ________ Recapture Amt: 1,000 The provided example does not indicate the state average yield, however, both parties state the recapture amount has never exceeded the 75% limitation imposed by the constitutional amendment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. Richard Briffault, The Role of Local Control in School Finance Reform, 24 CONN.L.REV. 773 (1992).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. The legislature was slow to recognize the framers' intent. In 1917, Governor Kendrick in his address to the Fourteenth State Legislature advised them to adopt the proposals of a State School Code Committee. That committee had carefully surveyed all aspects of the education system then in place, including physical facilities, teacher and administrator competence, curriculum, and finances. Its report caused Governor Kendrick to remark: [P]ublic education is a state responsibility, and should not be left to the accidental judgment of local boards, which is often excellent, but is just as often exactly the reverse. The legislature adopted the school code. Fromong, supra note 23, at 310-323.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. Charles N. Potter served thirty-two years on the Wyoming Supreme Court, from 1895-1927.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. A possible method was recommended by the defenders' expert at trial who recommended that all optional mills be power equalized.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. In 1991-1992, Wyoming school districts spent $548.5 million in general fund expenditures or $5,543 per pupil for 98,951 students. Forty-five districts received $224.8 million in state aid, while $13.6 million was recaptured from four school districts. Since only a portion of excess may be recaptured, districts retained $4.3 million of revenue generated beyond what was needed for their expenses. The total amount paid out through the state foundation program was $498.5 million. The other $50 million in expenditures were paid for primarily through a revenue source which is outside the foundation program, i.e., the local optional mill levy.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. The district court and all parties determined that the Harvey study is ill-suited as a tool for actual distribution.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. Urban schools must be able to realize the concept of \"smallness\" either through the neighborhood school concept or the schools within a school concept just as rural schools struggle to defend their smallness.\u003c/span\u003e\n\n",
    "body_length": 160968,
    "citedas": [
      "907 P.2d 1238"
    ],
    "attorneys": "Ford T. Bussart, Marvin L. Tyler of Bussart, West, Rossetti, Piaia \u0026 Tyler, Rock Springs, for Campbell County School District, State of Wyoming, et al. Joseph B. Meyer, Attorney General, Rowena L. Heckert, Sr. Assistant Attorney General, Cheyenne, for State of Wyoming, Diana J. Ohman, et al. Timothy J. Kirven of Kirven \u0026 Kirven, P.C., Buffalo, Gerald R. Mason of Mason \u0026 Graham, P.C., Pinedale, for Big Horn County School District No. One, et al. Paul J. Hickey, Mark R. Stewart, Richard D. Bush of Hickey \u0026 Evans, Cheyenne, for Laramie County School District No. One. Patrick E. Hacker, Cheyenne, for Wyoming Education Association. Gerald L. Goulding, Afton, for Lincoln County School District No. Two as amicus curiae. Dan Pauli of the Legislative Service Office, Cheyenne, for Wyoming Legislature and Management Council as amicus curiae.",
    "category": [],
    "judges": "BEFORE GOLDEN, C.J., AND THOMAS, MACY, TAYLOR AND LEHMAN, JJ.",
    "citation_count": 5
  }
}
