{
  "id": "xYC9PWYBTlTomsSBcbO2",
  "document": {
    "title": "United States v. Awadallah",
    "full_title": "UNITED STATES OF AMERICA v. OSAMA AWADALLAH .",
    "jurisdiction": "Second Circuit",
    "date": "2003-11-07T00:00:00.000Z",
    "docket": "Docket No. 02-1269",
    "body": "Argued: April 10, 2003\n\nJudge Straub concurs in the opinion except as to Part II.C.3, and has filed a separate concurrence.\n\nThis appeal, which arises from the government's investigation of the September 11, 2001 terrorist attacks, presents questions about the scope of the federal material witness statute and the government's powers of arrest and detention thereunder. See 18 U.S.C. § 3144. The district court (Scheindlin, J.) ruled that the statute cannot be applied constitutionally to a grand jury witness such as the defendant-appellee, Osama Awadallah, and dismissed the perjury indictment against him as fruit of an illegal detention. The court also suppressed his grand jury testimony as fruit of an illegal detention on the alternative ground that the affidavit in support of the arrest warrant included material misrepresentations.\n\nWe conclude that these rulings must be reversed and the indictment reinstated. We also reverse the district court's independent ruling that the FBI's unreasonable searches and seizures on September 20 and 21, 2001, before Awadallah was arrested as a material witness, require suppression at trial of certain statements and physical evidence.\n\nBACKGROUND\n\nIn the days immediately following September 11, 2001, the United States Attorney for the Southern District of New York initiated a grand jury investigation into the terrorist attacks. Investigators quickly identified Nawaf Al-Hazmi and Khalid Al-Mihdhar as two of the hijackers on American Airlines Flight 77, which crashed into the Pentagon. The Justice Department released the identities of all nineteen hijackers on Friday, September 14, 2001, and news media around the country publicized their names and photographs the following day.\n\nA search of the car Al-Hazmi abandoned at Dulles Airport in Virginia produced a piece of paper with the notation, \"Osama 589-5316.\" Federal agents tracked this number to a San Diego address at which the defendant, Osama Awadallah, had lived approximately eighteen months earlier. Al-Hazmi and Al-Mihdhar also had lived in the San Diego vicinity around that time.\n\nThe district court made extensive factual findings concerning the ensuing events of September 20 and 21, 2001. See United States v. Awadallah, 202 F. Supp. 2d 82, 85-96 (S.D.N.Y. 2002) (\"Awadallah IV\"). With two minor exceptions, the court credited Awadallah's testimony over that of the FBI agents. See id. at 88 n.9. The government states that it \"strongly disagrees with the account of events accepted by the District Judge, and believes the agents testified truthfully and acted entirely properly in their dealings with Awadallah.\" (Appellant's Br. at 8.) However, the government \"has elected not to appeal Judge Scheindlin's credibility findings and does not contest them here.\" (Id.) For purposes of this appeal, then, the government accepts and relies on the facts found by the district court, as does Awadallah. (Appellee's Br. at 1-2.) Our recitation of the facts conforms to the district court's findings.\n\nOn the morning of September 20, 2001, federal agents went to Awadallah's current residence in San Diego. When the agents arrived at the apartment, Awadallah was attending a course in English as a second language at nearby Grossmont College, where he was enrolled. The agents interviewed Awadallah's roommate in their apartment for several hours.\n\nWhen Awadallah came home at around 2:00 p.m. that afternoon, several agents approached him as he entered the parking lot and got out of his car (a gray Honda). \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e They questioned him in the parking lot for a few minutes and then told him that he had to accompany them to the FBI office for questioning. Awadallah insisted on returning to his apartment first to observe the afternoon Muslim prayer, which he did as the agents watched. When Awadallah went into the bathroom, the agents insisted that the bathroom door be left open.\n\nBefore leaving for the FBI office, an agent asked Awadallah to sign a consent form allowing them to search his apartment and car. Otherwise, the agent told him, they would get a warrant and \"tear up\" his home. Believing he had no choice, Awadallah signed the form without reading it. See Awadallah IV, 202 F. Supp. 2d at 89 \u0026 n.13. The agents then put him in their car and drove him to the FBI office. Awadallah told them that he had to return in time for a 6:00 p.m. computer class; they told him that would be no problem.\n\nAt the FBI office, agents offered Awadallah a drink, but he declined because he was fasting. They asked him to sign another consent form for the search of his second car, an inoperative white Honda in the parking lot of his apartment building. This time, Awadallah read the form and learned that he had a right to refuse consent; and though he signed the consent form for his second car, he explicitly revoked his consent for the search of the first car. An agent tried to reach the agents at the apartment building by cell phone, but did not reach them until fifteen minutes later, after the search of the first car had been completed.\n\nThe agents at the scene then searched the apartment and the second car. The search of Awadallah's home produced several computer-generated photographs of Osama bin Laden; the searches of his cars produced two videotapes on Bosnia and one on Islam and a retractable razor which could be described as a box-cutter or a carpet knife.\n\nAwadallah was alone in a locked interview room for a while, until agents arrived to question him. They did not advise him of his rights or tell him that he could leave. They asked him about the September 11 hijackers and about his life and acquaintances. He told the agents that he knew Al-Hazmi, and that he had frequently seen another man with him, whose name he did not know.\n\nThe district court found that Awadallah was \"cooperative\" throughout this questioning. See Awadallah IV, 202 F. Supp. 2d at 92. We construe this finding to mean that he responded to questions, not that he necessarily responded truthfully or completely.\n\nWhen 6:00 p.m. approached, the agents told Awadallah that they had called his school and that it was alright for him to miss class. They told him he would \"have to stay\" with them until they were finished. The entire interview lasted approximately six hours, ending at nearly 11:00 p.m.\n\nBefore allowing Awadallah to leave, the agents scheduled a polygraph examination for the next morning. The record does not show whether an agent was posted at Awadallah's apartment building overnight, but the district court stated that \"[h]e was not guarded or surveilled overnight.\"\n\nAwadallah IV, 202 F. Supp. 2d at 99.\n\nAt 6:30 a.m. the following day, September 21, 2001, Awadallah called the FBI and refused to come in for the polygraph test until he had a lawyer. The agent told him they would get an arrest warrant. Believing he had no choice, Awadallah went with two agents who picked him up at his apartment at 7:00 a.m.\n\nAt the FBI office, agents advised Awadallah of his rights and he signed an advice-of-rights acknowledgment form. The polygraph exam lasted one-and-a-half to two hours. Afterward, the agents told Awadallah that the polygraph registered lies in response to two questions: whether he had advance knowledge of the September 11 attacks and whether he had participated in them in any way. It is unclear whether these were in fact the results. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e The conversation became heated as the agents accused Awadallah of being a terrorist. They refused Awadallah's requests to call a lawyer and his brother, and did not release him in time for Friday prayer.\n\nThroughout the questioning that day, the FBI agents in San Diego had been in contact with an Assistant United States Attorney (\"AUSA\") in New York. At approximately 2:00 p.m. Eastern time, the AUSA instructed the agents to arrest Awadallah as a material witness. The agents handcuffed Awadallah and took him to the San Diego correctional center for booking.\n\nMeanwhile, prosecutors and agents in New York prepared an application for a material witness warrant. In the supporting affidavit, FBI Special Agent Ryan Plunkett recounted how the FBI found the phone number in Al-Hazmi's car, Awadallah's admission that he knew Al-Hazmi, and the results of the agents' searches, including the \"box-cutter\" and the photographs of bin Laden. Agent Plunkett stated that it might become difficult to secure Awadallah's grand jury testimony because he had extensive family ties in Jordan and might be a flight risk. The affidavit did not say when Awadallah said he had last seen Al-Hazmi (over a year earlier); that Awadallah had moved eighteen months earlier from the address associated with the phone number; that Awadallah had used the \"box-cutter\" recently to install a new carpet in his apartment; that Awadallah had been (ostensibly) cooperative with the FBI agents in San Diego; or that Awadallah had three brothers who lived in San Diego, one of whom was an American citizen. Also, the affidavit stated that the \"box-cutter\" had been found in Awadallah's apartment when, in fact, it had been found in his inoperative second car. See Awadallah IV, 202 F. Supp. 2d at 96.\n\nShortly before 6:00 p.m. Eastern time, Agent Plunkett and an AUSA presented the material witness warrant application to Chief Judge Mukasey of the United States District Court for the Southern District of New York. Based solely on the contents of Agent Plunkett's affidavit, Chief Judge Mukasey issued a warrant to arrest Awadallah as a material witness pursuant to 18 U.S.C. § 3144. The court was unaware that Awadallah had already been arrested as a material witness three hours earlier. See Awadallah IV, 202 F. Supp. 2d at 95.\n\nOn September 25, 2001, Awadallah appeared before a Magistrate Judge Ruben B. Brooks in the Southern District of California, who declined to release him on bail and ordered that he be removed to New York. On October 2, 2001, the day after he arrived in New York, Awadallah appeared before Chief Judge Mukasey for a second bail hearing. Chief Judge Mukasey also declined to release Awadallah on bail, finding his continued detention to be \"reasonable under the circumstances.\"\n\nDuring the period of his detention, Awadallah spent time in four prisons as he was transferred to the New York correctional center by way of Oklahoma City. He alleges that he received harsh and improper treatment during this period. Because these allegations of abuse and mistreatment were immaterial to the issues before the district court, Judge Scheindlin expressly declined to make \"findings of fact on disputed issues regarding the conditions of confinement.\" See United States v. Awadallah, 202 F. Supp. 2d 55, 59 n.4 (S.D.N.Y. 2002) (\"Awadallah III\").\n\nNonetheless, Judge Scheindlin noted that Awadallah spent most of his time in solitary confinement; at times lacked access to his family, his lawyer, or a phone; and was repeatedly strip-searched. See id. at 60-61 \u0026 n.5. The government did not dispute that, by October 4, 2001, \"Awadallah had bruises on his upper arms,\" and an agent's report indicated several other injuries on his shoulder, ankles, hand, and face. See id. at 61. Awadallah sometimes refrained from eating because the meals provided did not comply with his religious dietary restrictions.\n\nOn October 10, 2001, twenty days after his arrest as a material witness, Awadallah testified before the grand jury in the Southern District of New York. The prosecutor questioned him for most of the day. In the course of his testimony, Awadallah denied knowing anyone named Khalid Al-Mihdhar or Khalid. The government then showed him an examination booklet he had written in September, which the government obtained from his English teacher in San Diego.\n\nThe booklet contained the following handwritten sentence: \"One of the qui[e]test people I have met is Nawaf. Another one his name Khalid. They have stayed in S.D. [San Diego] for 6 months.\" Awadallah acknowledged that it was his examination booklet, and that most of the writing in it was his own, but he denied that the name Khalid and a few other words on the page were written in his handwriting. On October 15, 2001, when Awadallah again appeared before the grand jury, he stated that his recollection of Khalid's name had been refreshed by his October 10 testimony and that the disputed writing in the exam booklet was in fact his own. However, he did not admit to making false statements in his first grand jury appearance.\n\nThe United States Attorney for the Southern District of New York filed charges against Awadallah on two counts of making false statements to the grand jury in violation of 18 U.S.C. § 1623: falsely denying that he knew Khalid Al-Mihdhar (Count One); and falsely denying that the handwriting in the exam booklet was his own (Count Two).\n\nOn November 27, 2001, the district court (Scheindlin, J.) granted Awadallah's bail application. See United States v. Awadallah, 173 F. Supp. 2d 186, 192-93 (S.D.N.Y. 2001) (\"Awadallah I\"). He satisfied the bail conditions and was released approximately two weeks later.\n\nIn December 2001, Awadallah moved to dismiss the indictment on four grounds: (1) recantation; (2) mistreatment in violation of his due process rights; (3) interference with his right to counsel; and (4) violation of the Vienna Convention on Consular Relations. He also moved to suppress the statements and search evidence obtained by the FBI on September 20 and 21, on the grounds that he had been seized illegally and that his consent to the searches was involuntary.\n\nOn January 31, 2002, the district court rejected the grounds cited by Awadallah for dismissal. See United States v. Awadallah, 202 F. Supp. 2d 17 (S.D.N.Y. 2002) (\"Awadallah II\"). In the same order, however, the court sua sponte raised two other possible grounds for dismissal: (1) the possibility that Awadallah was the victim of a \"perjury trap,\" id. at 43-44, and (2) the court's supervisory power to suppress his grand jury testimony if suppression is warranted by the circumstances of his arrest and treatment, id. at 52-53. The court ordered that these issues, in addition to Awadallah's Fourth Amendment claims, be taken up at an evidentiary hearing.\n\nOn April 30, 2002, after an evidentiary hearing and further briefing, the district court issued two orders dismissing the indictment against Awadallah. In Awadallah III, the court ruled that the federal material witness statute, 18 U.S.C. § 3144, did not apply to grand jury witnesses. 202 F. Supp. 2d at 61-79. This ruling evidently was made without briefing or argument. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e The court held that Awadallah's arrest and detention were therefore unlawful. Applying reasoning developed in the Awadallah II decision, Judge Scheindlin ruled that Awadallah's perjured grand jury testimony had to be suppressed as fruit of this illegal arrest and detention. Id. at 79-82.\n\nIn Awadallah IV, the district court held in the alternative that the indictment also had to be dismissed because the government's affidavit in support of the material witness warrant contained material omissions and misrepresentations. Id. at 96-100. Once again, the court held that the grand jury testimony was fruit of the illegal arrest and detention. Id. As a separate matter, the district court also ruled that Awadallah had been seized in violation of the Fourth Amendment and that he had given no voluntary consent to the searches. Id. at 101-07.\n\nAccordingly, the court suppressed statements and physical evidence obtained by the FBI on September 20 and 21, 2001 before Awadallah's arrest as a material witness. Id. at 100-07.\n\nThe government filed a timely notice of appeal from the Awadallah III and Awadallah IV decisions on May 2, 2002. In this same notice, the government appealed the Awadallah II decision, which had been issued over three months earlier. Awadallah remains free on bail at this time.\n\nDISCUSSION\n\nWe consider the issues presented on appeal in the order in which the district court developed them: (1) whether the federal material witness statute, 18 U.S.C. § 3144, may be applied to grand jury witnesses like Awadallah; (2) whether material misrepresentations in the government's affidavit in support of the material witness warrant require the suppression of Awadallah's grand jury testimony and the dismissal of the indictment against him; and (3) whether evidence obtained by the government on September 20 and 21 before Awadallah was formally detained as a material witness must be suppressed as the fruit of illegal searches and seizures.\n\nI. APPLICABILITY OF 18 U.S.C. § 3144\n\nThe first issue presented is whether the federal material witness statute, 18 U.S.C. § 3144, allows the arrest and detention of grand jury witnesses. In Awadallah III, the district court determined that it did not. Shortly thereafter, however, on July 11, 2002, Chief Judge Mukasey issued an opinion in an unrelated case that declined to follow the reasoning and holding of Awadallah III.\n\nSpecifically, Judge Mukasey held that 18 U.S.C. § 3144 applies to grand jury witnesses. See In re Material Witness Warrant, 213 F. Supp. 2d 287, 288 (S.D.N.Y. 2002). Thus there is now a split of authority within the Circuit on this question.\n\nAs discussed at oral argument, we might evade this issue by holding that Awadallah's allegedly false testimony should not have been suppressed as fruit of the poisonous tree even if his detention under § 3144 was improper, and that the indictment therefore should not have been dismissed. We reach the issue, however, because the present split within our Circuit on the scope of § 3144 affects the liberty interests of persons identified as material witnesses, the security and law enforcement interests of the government, and the ability of courts to make prompt and fair rulings on present and future detentions. It is true that \"at times courts are well advised to avoid an issue presented in litigation by relying on an alternative ground.\" United States v. Tomasi, 313 F.3d 653, 659 n.4 (2d Cir. 2002). \"But there is no principle of law or jurisprudence to the effect that such avoidance is required.\n\nIn some circumstances it is the better course to decide, rather than avoid, a question presented.\" Id. Both parties to this appeal, as well as the amici, persuasively urge us to decide whether § 3144 may properly be applied to grand jury witnesses. The issue is squarely presented, has been fully briefed, and will tend to evade review in future cases where the detention is brief or matters take a different procedural course.\n\nSection 3144, titled \"[r]elease or detention of a material witness,\" provides in its entirety: If it appears from an affidavit filed by a party that the testimony of a person is material in a criminal proceeding, and if it is shown that it may become impracticable to secure the presence of the person by subpoena, a judicial officer may order the arrest of the person and treat the person in accordance with the provisions of section 3142 of this title. No material witness may be detained because of inability to comply with any condition of release if the testimony of such witness can adequately be secured by deposition, and if further detention is not necessary to prevent a failure of justice.\n\nRelease of a material witness may be delayed for a reasonable period of time until the deposition of the witness can be taken pursuant to the Federal Rules of Criminal Procedure.\n\n18 U.S.C. § 3144. The statute is cast in terms of a material witness in \"a criminal proceeding.\" The decisive question here is whether that term encompasses proceedings before a grand jury.\n\nBased on its study of the statutory wording, context, legislative history, and case law, the district court held that \"Section 3144 only allows the detention of material witnesses in the pretrial (as opposed to the grand jury) context.\" Awadallah III, 202 F. Supp. 2d at 76. We have found no other decision that has arrived at this conclusion.\n\nThe only prior case that squarely considered the issue held that 18 U.S.C. § 3149, the precursor to today's material witness statute, allowed detention of grand jury witnesses. See Bacon v. United States, 449 F.2d 933, 936-41 (9th Cir. 1971). The Ninth Circuit conceded that \"[t]he term 'criminal proceeding,' absent a clear context, [was] ambiguous,\" id. at 939, but held that the relevant statutes and Federal Rules of Criminal Procedure, \"[t]aken as a whole,\" were \"clearly broad enough in scope to encompass grand jury investigations,\" id. at 941.\n\nOther courts, including this one, have assumed that the material witness statute authorizes detention of grand jury witnesses. See In re Grand Jury Subpoena (United States v. Koecher), 755 F.2d 1022, 1024 \u0026 n.2 (2d Cir. 1985) (noting prior unpublished order which required that defendant \"remain subject to the warrant of arrest as a material witness\" during remand to determine proper scope of grand jury investigation), vacated as moot, 475 U.S. 133 (1986); see also In re De Jesus Berrios, 706 F.2d 355, 356-58 (1st Cir. 1983) (upholding on other grounds the arrest of a material witness in a grand jury investigation); United States v. Oliver, 683 F.2d 224, 230-31 (7th Cir. 1982) (same); United States v. McVeigh, 940 F. Supp. 1541, 1562 (D. Colo. 1996) (finding government affidavit sufficient to justify arrest of defendant Terry Nichols under § 3144 to testify as material witness before grand jury investigating the Oklahoma City bombing); In re Thornton, 560 F. Supp. 183, 184 (S.D.N.Y. 1983) (denying motion for relief from civil contempt order by witness who had been \"arrested on a material witness warrant issued . . . pursuant to 18 U.S.C. § 3149 . . . to appear and testify before a federal grand jury\"); cf. Arnsberg v. United States, 757 F.2d 971, 981-82 (9th Cir. 1985) (finding federal agents immune from false imprisonment suit after they arrested a grand jury witness pursuant to a warrant issued under § 3149).\n\nTwo judges have also declined to follow the district court's ruling in this case. In In re Material Witness Warrant, 213 F. Supp. 2d 287 (S.D.N.Y. 2002), Chief Judge Mukasey \"decline[d] to follow the reasoning and holding in Awadallah,\" id. at 288, holding instead:\n\nGiven the broad language of the statute, its legislative history . . . , the substantial body of case law indicating that there is no constitutional impediment to detention of grand jury witnesses, and the unquestioned application of the statute to grand jury witnesses over a period of decades before Awadallah, to perceive a Congressional intention that grand jury witnesses be excluded from the reach of section 3144 is to perceive something that is not there.\n\nId. at 300; see also In re Grand Jury Material Witness Detention, No. 3:03-49-MISC-CR, 2003 WL 21674456, at *2 (D. Or. Apr. 7, 2003) (concluding that \"a grand jury proceeding constitutes a 'criminal proceeding,' as the term is used in § 3144\"). Having the benefit of thorough opinions on both sides of the question, we conclude that the district court's ruling in this case must be reversed.\n\nA. STANDARD OF REVIEW\n\nWhen \"[t]he district court's dismissal of [an] indictment raises questions of constitutional interpretation, . . . we review the district court's decision de novo.\" United States v. King, 276 F.3d 109, 111 (2d Cir. 2002) (reversing dismissal of indictment because statute in question was \"a permissible exercise of Congressional authority under the Commerce Clause\"). This standard of review comports with our customary approach to questions of statutory interpretation and constitutionality. See United States v. Pettus, 303 F.3d 480, 483 (2d Cir. 2002) (reviewing a \"question of statutory interpretation and of the constitutionality of [a statute] de novo\"); Muller v. Costello, 187 F.3d 298, 307 (2d Cir. 1999).\n\nIn construing a statute, we begin with its language and plain meaning. See United States v. Koh, 199 F.3d 632, 636 (2d Cir. 1999); United States v. Figueroa, 165 F.3d 111, 114 (2d Cir. 1998); United States v. Proyect, 989 F.2d 84, 87 (2d Cir. 1993) (\"[W]hen the language of the statute is clear, its plain meaning ordinarily controls its construction.\"). \"However, where statutory language is ambiguous a court may resort to the canons of statutory interpretation and to the statute's legislative history to resolve the ambiguity.\" Canada Life Assurance Co. v. Converium Ruckversicherung (Deutschland) AG, 335 F.3d 52, 57 (2d Cir. 2003).\n\nB. LANGUAGE OF THE STATUTE\n\nAs noted above, § 3144 applies to witnesses whose testimony is material in \"a criminal proceeding.\" 18 U.S.C. § 3144. \"Criminal proceeding\" is a broad and capacious term, and there is good reason to conclude that it includes a grand jury proceeding. First, it has long been recognized that \"[t]he word 'proceeding' is not a technical one, and is aptly used by courts to designate an inquiry before a grand jury.\" Hale v. Henkel, 201 U.S. 43, 66 (1906); cf. Cobbledick v. United States, 309 U.S. 323, 327 (1940) (\"The proceeding before a grand jury constitutes 'a judicial inquiry' of the most ancient lineage.\") (citation omitted).\n\nSecond, the term \"criminal proceeding\" has been construed in other statutes to encompass grand jury proceedings. For example, the statute authorizing the government to appeal from \"a decision or order of a district court suppressing or excluding evidence . . . in a criminal proceeding,\" 18 U.S.C. § 3731 (emphasis added), has been construed to authorize appeal of such an order from a grand jury proceeding. See, e.g., In re Grand Jury Subpoena Duces Tecum Dated Jan. 2, 1985, 775 F.2d 499, 502 (2d Cir. 1985) (\"It has been held that a grand jury proceeding is 'a criminal proceeding' within the portion of the Criminal Appeals Act, 18 U.S.C. § 3731, that entitles the Government to appeal from a decision or order of a district court suppressing or excluding evidence.\"); In re Grand Jury Empaneled Feb. 14, 1978, 597 F.2d 851, 857 (3d Cir. 1979) (observing that, \"[i]n deciding questions pertaining to appellate jurisdiction, this circuit and others have adopted the view that the grand jury is a criminal proceeding\"). At least one court has reached the same conclusion under a statute that punishes interstate flight \"to avoid giving testimony in any criminal proceedings,\" 18 U.S.C. § 1073 (emphasis added). See Hemans v. United States, 163 F.2d 228, 235-37 (6th Cir. 1947) (construing former version of statute codified at 18 U.S.C. § 408e).\n\nNotwithstanding this support for the general view that \"criminal proceedings\" encompass grand jury proceedings, however, we cannot say that the statutory wording alone compels that conclusion. Black's Law Dictionary defines a \"criminal proceeding\" as \"[a] proceeding instituted to determine a person's guilt or innocence or to set a convicted person's punishment; a criminal hearing or trial.\" Black's Law Dictionary 1221 (7th ed. 1999). It defines a \"grand jury\" as \"[a] body of . . . people . . . who, in ex parte proceedings, decide whether to issue indictments. If the grand jury decides that evidence is strong enough to hold a suspect for trial, it returns a bill of indictment . . . charging the suspect with a specific crime.\" Id. at 706. Defined this way, a grand jury proceeding is not a \"proceeding instituted to determine a person's guilt or innocence or to set a convicted person's punishment,\" but rather a proceeding to \"decide whether to issue indictments.\" Cf. United States v. Mandujano, 425 U.S. 564, 573 (1976) (\"[T]he grand jury's mission is . . . to determine whether to make a presentment or return an indictment.\"). A grand jury proceeding is certainly a stage of criminal justice; and it is certainly a proceeding. As a proceeding, it is certainly not civil, administrative, arbitral, commercial, social, or any type of proceeding other than (or as much as) criminal. Even so, the dictionary entries could suggest that grand jury proceedings lie outside the scope of § 3144.\n\nAs the district court observed, this Court applied such a view in United States v. Thompson, 319 F.2d 665 (2d Cir. 1963). In Thompson, a divided panel held that the meaning of the term \"criminal proceeding\" was ambiguous as used in the Walsh Act, 28 U.S.C. § 1783 et seq., which confers power upon district courts to issue subpoenas to witnesses outside the United States. The panel ultimately concluded that the term did not encompass grand jury proceedings. 319 F.2d at 668-70. In dissent, Judge Kaufman observed that the majority's conclusion was \"tortured\" and argued that the plain meaning of \"criminal proceeding\" encompassed grand jury proceedings. Id. at 671-73. Congress agreed with Judge Kaufman the following year. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e But the split in a panel of this Court runs counter to the view that a \"criminal proceeding\" plainly encompasses a grand jury proceeding. The statutory context does not allay all uncertainty.\n\nUnder § 3144, a judge \"may order the arrest of the person and treat the person in accordance with the provisions of section 3142 of this title.\" 18 U.S.C. § 3144. Section 3142, which sets conditions for the \"[r]elease or detention of a defendant pending trial,\" uses terms not normally associated with grand juries. It provides:\n\nUpon the appearance before a judicial officer of a person charged with an offense, the judicial officer shall issue an order that, pending trial, the person be-- (1) released on personal recognizance or upon execution of an unsecured appearance bond . . . ; (2) released on a condition or combination of conditions . . . ; (3) temporarily detained to permit revocation of conditional release, deportation, or exclusion . . . ; or (4) detained . . . .\n\n18 U.S.C. § 3142(a) (emphasis added). By its own terms, § 3142 applies during the post-indictment (\"a person charged with an offense\") and pretrial (\"pending trial\") phase of criminal prosecution. The section also goes on to identify factors to be considered \"in determining whether there are conditions of release that will reasonably assure the appearance of the person as required and the safety of any other person and the community.\" 18 U.S.C. § 3142(g). Two of the four listed considerations have little bearing on the situation of an individual detained as a material witness in a grand jury proceeding. See 18 U.S.C. § 3142(g)(1) (\"[t]he nature and circumstances of the offense charged\"); id. § 3142(g)(2) (\"the weight of the evidence against the person\"). For these reasons, we must look beyond the text of § 3144 to discern the meaning of \"criminal proceeding.\"\n\nC. LEGISLATIVE HISTORY\n\nThe legislative history of § 3144 makes clear Congress's intent to include grand jury proceedings within the definition of \"criminal proceeding.\" Congress enacted § 3144 in its current form as part of the Bail Reform Act of 1984. See Pub. L. No. 98-473, 98 Stat. 1837, 1976-81 (1984). Its language is nearly identical to the text of its predecessor statute, 18 U.S.C. § 1349 (1966), \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e which the Ninth Circuit construed to encompass grand juries. See Bacon, 449 F.2d at 939-41.\n\nThe most telling piece of legislative history appears in the Senate Judiciary Committee Report that accompanied the 1984 enactment of § 3144. The Report stated that, \"[i]f a person's testimony is material in any criminal proceeding, and if it is shown that it may become impracticable to secure his presence by subpoena, the government is authorized to take such person into custody.\" S. Rep. No. 98-225, at 28 (1983), reprinted in 1984 U.S.C.C.A.N. 3182, 3211. A footnote to this statement advised categorically that \"[a] grand jury investigation is a 'criminal proceeding' within the meaning of this section. Bacon v. United States, 449 F.2d 933 (9th Cir. 1971).\" Id. at 28 n.88, 1984 U.S.C.C.A.N. at 3211. The approving citation to Bacon by the Senate Committee with responsibility for this bill is as indicative as the text of the footnote.\n\nCommittee reports are not always reliable interpretive tools, see Shannon v. United States, 512 U.S. 573, 583 (1994) (noting that \"a single passage of legislative history\" should not be given \"authoritative weight\" when it \"is in no way anchored in the text of the statute\"), but we may look to them in discerning Congressional intent:\n\nIn surveying legislative history we have repeatedly stated that the authoritative source for finding the Legislature's intent lies in the Committee Reports on the bill, which \"represen[t] the considered and collective understanding of those Congressmen involved in drafting and studying proposed legislation.\"\n\nGarcia v. United States, 469 U.S. 70, 76 (1984) (citation omitted); see also Eldred v. Ashcroft, 537 U.S. 186, 210 n.16 (2003); Thornburg v. Gingles, 478 U.S. 30, 44 n.7 (1986). Here, the Senate committee report states in so many words the intent to include grand jury proceedings within the ambit of the statute--an intent that is consistent with the statute's language, even if not compelled by it.\n\nThis statement of congressional intent is particularly telling, because the Bail Reform Act of 1984 reenacted the provisions of the former § 3149 in nearly identical language. \"Congress is presumed to be aware of an administrative or judicial interpretation of a statute and to adopt that interpretation when it re-enacts a statute without change.\" See Lorillard v. Pons, 434 U.S. 575, 580 (1978). In Lorillard, as here, there was clear evidence that Congress had considered the specific judicial interpretation in question. See id. at 581; see also Holder v. Hall, 512 U.S. 874, 961 (1994) (separate opinion of Stevens, J.) (noting that, \"[w]hen a Congress that re-enacts a statute voices its approval of an administrative or other interpretation thereof, Congress is treated as having adopted that interpretation, and [the courts are] bound thereby\"); In re Material Witness Warrant, 213 F. Supp. 2d at 297.\n\nAwadallah and an amicus party supporting his position argue that this principle of ratification by reenactment is inapplicable because there was no \"settled judicial interpretation\" of the term \"criminal proceeding\" when § 3144 was enacted in 1984. (Amicus Br. of NYCDL at 23 (quoting Holder, 512 U.S. at 920).) \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e We disagree. The Senate report stated that \"[a] grand jury investigation is a 'criminal proceeding' within the meaning of this section.\" S. Rep. No. 98-225, at 28 n.88 (1983), 1984 U.S.C.C.A.N. at 3211 (emphasis added). As of 1984, a single court had expressly considered whether the term \"criminal proceeding\" within the meaning of the federal material witness statute included grand jury proceedings--and it had held that it did. See Bacon, 449 F.2d at 939-41. This Court had reached a different conclusion in Thompson, but only in connection with an unrelated statute, 319 F.2d at 668-70, and that interpretation was legislatively overruled the following year, see supra note 5. When Congress enacted § 3144--and until the district court ruled otherwise in this case--there was a settled view that a grand jury proceeding is a \"criminal proceeding\" for purposes of the material witness statute. We therefore conclude that a grand jury proceeding is a \"criminal proceeding\" for purposes of § 3144.\n\nD. CONSTITUTIONAL CONSIDERATIONS\n\nIn concluding that § 3144 does not apply to grand jury witnesses, the district court invoked the canon of constitutional avoidance, under which a court should construe an ambiguous statute to avoid constitutional problems if a viable alternative interpretation exists. See Awadallah III, 202 F. Supp. 2d at 76-77 (citing INS v. St. Cyr, 533 U.S. 289, 299-300 (2001); Edward J. DeBartolo Corp. v. Florida Gulf Coast Bldg. \u0026 Constr. Trades Council, 485 U.S. 568, 575 (1988)). This rule, which facilitates a choice between alternative interpretations of an ambiguous statute, has no bearing if the meaning of the statute is known. See Dep't of Hous. \u0026 Urban Dev. v. Rucker, 535 U.S. 125, 134 (2002) (noting that \"the canon of constitutional avoidance . . . 'has no application in the absence of statutory ambiguity'\") (quoting United States v. Oakland Cannabis Buyers' Coop., 532 U.S. 483, 494 (2001)). Here, we have determined that Congress intended to place grand jury proceedings within the scope of § 3144. The canon of constitutional avoidance therefore does not come into play. Cf. St. Cyr, 533 U.S. at 299 (noting the corollary rule that, \"when a particular interpretation of a statute invokes the outer limits of Congress' power, we expect a clear indication that Congress intended that result\").\n\nAssuming arguendo that there are two viable interpretations of § 3144, \"the canon . . . applies only when there are serious concerns about the statute's constitutionality.\" Harris v. United States, 536 U.S. 545, 555 (2002) (citation omitted). The district court determined that \"[i]mprisoning a material witness for a grand jury investigation raises a serious constitutional question\" under the Fourth Amendment's prohibition against unreasonable search and seizure. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Awadallah III, 202 F. Supp. 2d at 77. We respectfully disagree.\n\nAs a threshold matter, the detention of material witnesses for the purpose of securing grand jury testimony has withstood constitutional challenge. In New York v. O'Neill, 359 U.S. 1 (1959), the Supreme Court considered \"the constitutionality of a Florida statute entitled 'Uniform Law to Secure the Attendance of Witnesses from Within or Without a State in Criminal Proceedings.'\" Id. at 3. This statute--which had been adopted in 42 states and the Commonwealth of Puerto Rico--enabled a judge of one state to certify \"the necessity of the appearance of [a] witness in a criminal prosecution or grand jury investigation,\" and concomitantly enabled the state where that witness could be found to \"take the witness into immediate custody\" and \"deliver the witness to an officer of the requesting State.\" Id. at 4-5. The Court held that this statute did not violate the Privileges and Immunities Clause of the Fourteenth Amendment. Id. at 6-7. In doing so, it observed that \"Florida undoubtedly could have held respondent within Florida if he had been a material witness in a criminal proceeding within that State.\" Id. at 7. The Court observed that \"[a] citizen cannot shirk his duty, no matter how inconvenienced thereby, to testify in criminal proceedings and grand jury investigations in a State where he is found. There is no constitutional provision granting him relief from this obligation to testify even though he must travel to another State to do so.\" Id. at 11.\n\nThe Supreme Court has made similar pronouncements in other cases. In Stein v. New York, 346 U.S. 156 (1953), overruled in part by Jackson v. Denno, 378 U.S. 368 (1964), the petitioners claimed that confessions were coerced by custodial interrogation and that their admission into evidence was unconstitutional. Id. at 159-60. Even in the less August context of a police investigation (no grand jury had been convened), the Supreme Court observed that \"[t]he duty to disclose knowledge of crime rests upon all citizens,\" and that this duty \"is so vital that one known to be innocent may be detained, in the absence of bail, as a material witness. This Court never has held that the Fourteenth Amendment prohibits a state from such detention and interrogation of a suspect as under the circumstances appears reasonable and not coercive.\" Id. at 184 (citing N.Y. Code Crim. Proc. § 618-b; Fed. R. Crim. P. 46(b)); cf. Allen v. Nix, 55 F.3d 414, 415-17 (8th Cir. 1995) (affirming denial of habeas relief to petitioner who claimed, among other things, that his detention on a state material witness warrant during a murder investigation violated the Fourth Amendment).\n\nSimilarly, the Court has observed that the Senate has \"the power in some cases to issue a warrant of arrest to compel\" the \"attendance of witnesses,\" and that this power was \"a necessary incident of the power to adjudge, in no wise inferior under like circumstances to that exercised by a court of justice.\" Barry v. United States ex rel. Cunningham, 279 U.S. 597, 616 (1929). \"[A] court has power in the exercise of a sound discretion to issue a warrant of arrest without a previous subpoena, when there is good reason to believe that otherwise the witness will not be forthcoming.\" Id. at 616 (citing former 28 U.S.C. § 659). \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e The Barry case made clear that it was saying nothing new: \"The constitutionality of [28 U.S.C. § 659] apparently has never been doubted. Similar statutes exist in many of the states and have been enforced without question.\" Id. at 617.\n\nThis Court has likewise upheld the constitutionality of detaining grand jury witnesses under a New York material witness statute, former § 618-b of the New York Code of Criminal Procedure. In United States ex rel. Allen v. LaVallee, 411 F.2d 241 (2d Cir. 1969), we upheld the admissibility of a confession obtained during the detention of a state grand jury witness under § 618-b. Id. at 244.\n\nWe rejected the petitioner's argument that \"he was illegally detained as a material witness, because there was no criminal action or proceeding then pending, as required by § 618-b;\" the grand jury proceeding and the ongoing police investigation were enough. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Id. at 243.\n\nWe reached a similar conclusion in United States ex rel. Glinton v. Denno, 309 F.2d 543 (2d Cir. 1962) (\"Glinton I\"), which rejected a constitutional challenge to the admission of statements obtained while the petitioner was detained as a material witness for a state grand jury investigation. Although the New York material witness statute \"require[d] a criminal action or proceeding to be pending in some New York court,\" we held that this requirement was satisfied by the grand jury investigation under way at the time of Glinton's arrest, id. at 544, observing that such statutes \"appear to be fairly common and to have been enforced without question.\" \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Id.\n\nGlinton's Fourth Amendment claim, based on his detention for two weeks after the grand jury was discharged, was procedurally untenable in Glinton I, but was fully considered in United States ex rel. Glinton v. Denno, 339 F.2d 872 (2d Cir. 1964) (\"Glinton II\"). In Glinton II, we saw \"no reason to reverse our earlier holding that . . . [Glinton's] initial commitment, in lieu of bail, on November 13 as a material witness was lawful . . . . There cannot be any doubt that Glinton was validly committed as a material witness.\" Id. at 874-75 (citation omitted). We continued:\n\n[T]he district attorney easily could have preserved the legality of Glinton's detention by keeping the grand jury proceeding alive or by commencing a new one. . . . Assuming that Glinton's presence as a material witness was still necessary, this continued detention would not have violated the Fourth Amendment. It cannot seriously be urged, therefore, that a detention which has been proper in all respects becomes violative of the Constitution merely upon a technicality, the discharging of the grand jury.\n\nId. at 876. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nThe district court failed to account for these cases in detecting a constitutional problem in the detention of a material witness, and focused instead on developing its own Fourth Amendment analysis. Even meeting the district court decision on those terms, we see no serious constitutional problem that would warrant the exclusion of grand jury proceedings from the scope of § 3144.\n\nThe Fourth Amendment prohibits \"unreasonable searches and seizures.\" U.S. Const. amend. IV. Determining the reasonableness of a seizure involves a balancing of competing interests:\n\nThe essential purpose of the proscriptions in the Fourth Amendment is to impose a standard of \"reasonableness\" upon the exercise of discretion by government officials, including law enforcement agents, in order \"to safeguard the privacy and security of individuals against arbitrary invasions . . . .\" Thus, the permissibility of a particular law enforcement practice is judged by balancing its intrusion on the individual's Fourth Amendment interests against its promotion of legitimate governmental interests.\n\nDelaware v. Prouse, 440 U.S. 648, 653-54 (1979) (citations and footnotes omitted); see also Michigan v. Summers, 452 U.S. 692, 700 n.12 (1981) (\"'[T]he key principle of the Fourth Amendment is reasonableness--the balancing of competing interests.'\") (quoting Dunaway, 442 U.S. at 219 (White, J., concurring)). Thus we must consider both \"the nature and quality of the intrusion on the individual's Fourth Amendment interests\" and \"the importance of the governmental interests alleged to justify the intrusion.\" Tennessee v. Garner, 471 U.S. 1, 8 (1985) (citing United States v. Place, 462 U.S. 696, 703 (1983)).\n\nIn its balancing analysis, the district court found that \"[t]he only legitimate reason to detain a grand jury witness is to aid in 'an ex parte investigation to determine whether a crime has been committed and whether criminal proceedings should be instituted against any person.'\" Awadallah III, 202 F. Supp. 2d at 77 (emphasis omitted) (quoting United States v. Calandra, 414 U.S. 338, 343-44 (1974)). This is no small interest. In United States v. Mandujano, 425 U.S. 564 (1976), the Supreme Court explained:\n\nThe grand jury is an integral part of our constitutional heritage which was brought to this country with the common law. . . . Indispensable to the exercise of its power is the authority to compel the attendance and the testimony of witnesses . . . . When called by the grand jury, witnesses are thus legally bound to give testimony. This principle has long been recognized.\n\nId. at 571-72 (citations omitted). \"[I]t is clearly recognized that the giving of testimony and the attendance upon court or grand jury in order to testify are public duties which every person within the jurisdiction of the Government is bound to perform upon being properly summoned.\" Blair v. United States, 250 U.S. 273, 281 (1919) (emphasis added).\n\nThe district court noted (and we agree) that it would be improper for the government to use § 3144 for other ends, such as the detention of persons suspected of criminal activity for which probable cause has not yet been established. See Awadallah IV, 202 F. Supp. 2d at 77 n.28.\n\nHowever, the district court made no finding (and we see no evidence to suggest) that the government arrested Awadallah for any purpose other than to secure information material to a grand jury investigation. Moreover, that grand jury was investigating the September 11 terrorist attacks. The particular governmental interests at stake therefore were the indictment and successful prosecution of terrorists whose attack, if committed by a sovereign, would have been tantamount to war, and the discovery of the conspirators' means, contacts, and operations in order to forestall future attacks.\n\nOn the other side of the balance, the district court found in essence that § 3144 was not calibrated to minimize the intrusion on the liberty of a grand jury witness. See Awadallah IV, 202 F. Supp. 2d at 78-79. According to the district court, several procedural safeguards available to trial witnesses are not afforded in the grand jury context. See id. at 62-67, 78-79. We agree with the district court, of course, that arrest and detention are significant infringements on liberty, but we conclude that § 3144 sufficiently limits that infringement and reasonably balances it against the government's countervailing interests.\n\nThe first procedural safeguard to be considered is § 3144's provision that \"[n]o material witness may be detained because of inability to comply with any condition of release if the testimony of such witness can adequately be secured by deposition, and if further detention is not necessary to prevent a failure of justice.\" 18 U.S.C. § 3144 (emphasis added). The district court agreed with the government that this deposition provision does not apply to grand jury witnesses. See Awadallah III, 202 F. Supp. 2d at 78. The government's altered position on appeal is that \"Congress intended depositions to be available as a less restrictive alternative to detaining a grand jury witness.\" (Appellant's Reply Br. at 18.) Such a pivot by the government on appeal is awkward, but we accept the government's explanation that it was persuaded by Chief Judge Mukasey's view in In re Material Witness Warrant, 213 F. Supp. 2d at 296. (Appellant's Br. at 67-69; Appellant's Reply Br. at 18-19.)\n\nWe conclude that the deposition mechanism is available for grand jury witnesses detained under § 3144. At the time of Awadallah's detention, the Federal Rule of Criminal Procedure that governs depositions provided:\n\nIf a witness is detained pursuant to [§ 3144], the court on written motion of the witness and upon notice to the parties may direct that the witness' deposition be taken. After the deposition has been subscribed the court may discharge the witness.\n\nFed. R. Crim. P. 15(a) (1987). \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e The district court is thereby authorized to order a deposition and to release the witness once it has been taken. Awadallah and the NYCDL argue that this provision cannot apply to grand jury witnesses because there can be no \"party\" or \"trial\" prior to indictment. (Appellee's Br. at 43-46; NYCDL Br. at 10, 34-36.) The prosecutor and the witness may broadly be deemed parties, however, in the sense that each has interests to advance or protect before the grand jury. Thus, the rule governing the issuance of subpoenas--which indisputably applies during grand jury proceedings (Appellee's Br. at 28)--refers to \"the party requesting\" a subpoena. Fed. R. Crim. P. 17(a).\n\nThe district court found the deposition provision inapplicable in the grand jury context in part because a conventional deposition is inconsistent with the procedural and evidentiary rules of a grand jury hearing. See Awadallah III, 202 F. Supp. 2d at 78. However, the district court may set additional conditions for the conduct of a deposition. Compare Fed. R. Crim. P. 15(d) (1987) (\"[s]ubject to such additional conditions as the court shall provide\"), with Fed. R. Crim. P. 15(e) (2003) (\"[u]nless these rules or a court order provides otherwise\"). The court thus can limit the deposition according to grand jury protocol, for example by limiting the witness's right to have counsel present during the deposition or by permitting the use of hearsay.\n\nRule 46 of the Federal Rules of Criminal Procedure, which governs detention and release, further supports the view that depositions are available to grand jury witnesses detained under § 3144. The version of Rule 46 in effect at the time of Awadallah's detention provided that \"[t]he attorney for the government shall make a biweekly report to the court listing each defendant and witness who has been held in custody pending indictment, arraignment or trial for a period in excess of ten days,\" and as to \"each witness so listed,\" state \"the reasons why such witness should not be released with or without the taking of a deposition pursuant to Rule 15(a).\" Fed. R. Crim. P. 46(g) (1993) (emphasis added). The new version of the rule, which omits the reference to defendants, is even more explicit:\n\nAn attorney for the government must report biweekly to the court, listing each material witness held in custody for more than 10 days pending indictment, arraignment, or trial. For each material witness listed in the report, an attorney for the government must state why the witness should not be released with or without a deposition being taken under Rule 15(a).\n\nFed. R. Crim. P. 46(h)(2) (2003) (emphasis added). Both versions of the rule expressly contemplate the deposition of a \"witness held in custody . . . pending indictment.\" Id. It follows that the deposition mechanism of § 3144 is a safeguard available to grand jury witnesses.\n\nThe second procedural safeguard at issue is § 3144's express invocation of the bail and release provisions set forth in 18 U.S.C. § 3142. Section 3144 directs that \"a judicial officer may . . . treat the [detained] person in accordance with the provisions of section 3142 of this title.\" 18 U.S.C. § 3144. As noted above, § 3142 sets conditions for the \"[r]elease or detention of a defendant pending trial,\" as follows:\n\nUpon the appearance before a judicial officer of a person charged with an offense, the judicial officer shall issue an order that, pending trial, the person be-- (1) released on personal recognizance or upon execution of an unsecured appearance bond . . . ; (2) released on a condition or combination of conditions . . . ; (3) temporarily detained to permit revocation of conditional release, deportation, or exclusion . . . ; or (4) detained . . . .\n\n18 U.S.C. § 3142(a).\n\nAs the district court observed, some of the terms used in § 3142--namely, \"a person charged with an offense\" and \"pending trial\"--do not comport with the structure of grand jury proceedings. However, we do not deduce (as the district court did) that \"it is plain that section 3142 cannot apply to grand jury proceedings.\" Awadallah III, 202 F. Supp. 2d at 63. We agree with Chief Judge Mukasey that the provisions of § 3142 govern insofar as they are applicable in the grand jury setting:\n\n[T]he common sense reading of section 3144 is that it refers to section 3142 only insofar as that section is applicable to witnesses, in making available such alternatives to incarceration as release on bail or on conditions, in suggesting standards such as risk of flight, likelihood that the person will appear, and danger to the community, and in providing for a detention hearing. Not every provision of section 3142 applies to witnesses, but some do, and those govern.\n\nIn re Material Witness Warrant, 213 F. Supp. 2d at 295. Thus, a person detained as a material witness in a grand jury investigation may obtain a hearing on the propriety of his continued detention and the conditions, if any, which will allow his release.\n\nThe district court also observed that the closed nature of a grand jury investigation limits the court's ability to assess the materiality of a witness's testimony. See Awadallah III, 202 F. Supp. 2d at 63. This may be true at the margins, because the materiality of the testimony given by a trial witness can be assessed on the basis of the indictment, discovery materials, and trial evidence, whereas grand jury secrecy requires the judge to rely largely on the prosecutor's representations about the scope of the investigation and the materiality of the witness's testimony. However, as Chief Judge Mukasey observed, \"courts make similar determinations all the time, based on sealed submissions, when deciding whether a subpoena calls for relevant information, whether such information is privileged, and the like.\" In re Material Witness Warrant, 213 F. Supp. 2d at 294 (noting that \"I've done it myself\").\n\nMoreover, \"the hypothesized difficulty of the materiality decision can be just as great, or greater, when a court must determine if a trial witness must be detained, because the decision likely will have to be made before the trial begins and thus before it is possible to fit the witness's testimony into the grid of other evidence.\" Id. at 294-95. The materiality determination called for by § 3144 lies within the district court's competence.\n\nFinally, Awadallah and the NYCDL argue that § 3144 provides no limit on how long a grand jury witness may be detained, whereas the detention of a trial witness is implicitly limited (or speeded) by the time limits on prosecution contained in the Speedy Trial Act, 18 U.S.C. § 3161 et seq. (Appellee's Br. at 55; NYCDL Br. at 27-31.)\n\nHowever, the Speedy Trial Act permits delay for various reasons, see 18 U.S.C. § 3161(h), which may have the collateral effect of extending the detention of a material witness; and nothing in the Speedy Trial Act requires a court to consider the effect of a continuance or delay on a detained witness. The Act therefore provides cold comfort to a detained trial witness.\n\nWhile § 3144 contains no express time limit, the statute and related rules require close institutional attention to the propriety and duration of detentions: \"[n]o material witness may be detained because of inability to comply with any condition of release if the testimony of such witness can adequately be secured by deposition, and if further detention is not necessary to prevent a failure of justice.\" 18 U.S.C. § 3144. The court must \"treat the person in accordance with the provisions of section 3142,\" which provides a mechanism for release. Id. And release may be delayed only \"for a reasonable period of time until the deposition of the witness can be taken pursuant to the Federal Rules of Criminal Procedure.\" Id. Perhaps most important, Rule 46 requires the government to make a \"biweekly report\" to the court listing each material witness held in custody for more than ten days and justifying the continued detention of each witness. Fed. R. Crim. P. 46(g) (1993); see also Fed. R. Crim. P. 46(h)(2) (2003). These measures tend to ensure that material witnesses are detained no longer than necessary.\n\nIn light of the foregoing analysis, we must ask whether Awadallah was properly detained when he was held for several weeks without being allowed to give his deposition and obtain release. Such a detention constitutes a significant intrusion on liberty, since a material witness can be arrested with little or no notice, transported across the country, and detained for several days or weeks. Under the circumstances of this case, however, we are satisfied that Awadallah's detention was not unreasonably prolonged. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e As indicated above, the deposition mechanism invoked in § 3144 is available to grand jury witnesses, but it is not required in every instance. Section 3144 requires release after deposition only if \"the testimony of such witness can adequately be secured by deposition\" and \"further detention is not necessary to prevent a failure of justice.\" 18 U.S.C. § 3144 (emphasis added). Similarly, § 3142 provides that a person may be detained if, \"after a hearing . . . , the judicial officer finds that no condition or combination of conditions will reasonably assure the appearance of the person as required and the safety of any other person and the community.\" 18 U.S.C. § 3142(e).\n\nThe procedural history demonstrates that Awadallah received adequate process to ensure that the duration of his detention was reasonable. Awadallah was arrested on Friday, September 21, 2001. He first appeared before a magistrate judge in San Diego for a bail hearing on Monday, September 24. That hearing was adjourned until the following day in order for Awadallah's counsel to obtain a translator. When Awadallah appeared before the magistrate judge the next day, the court received testimony from his witnesses and heard argument from counsel. Awadallah's attorney argued, among other things, that a deposition should be taken pursuant to § 3144. The court found that, under § 3142, there were no conditions of release that would reasonably assure Awadallah's appearance before the grand jury. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e The court denied bail and ordered that Awadallah be removed to New York.\n\nThe government transported Awadallah across the country, and he arrived in New York on Monday, October 1. The next day, he appeared for a second bail hearing before Chief Judge Mukasey in the Southern District of New York.\n\nChief Judge Mukasey also declined to release Awadallah from detention, finding that, \"given the facts alleged in the application[,] he may well have incentive to leave,\" and that \"[t]here is no way to prevent him from leaving, no effective way, unless he is detained.\" The court found that his continued detention was \"reasonable under the circumstances.\" During this hearing, the government informed the court that the grand jury met only on Mondays and Wednesdays, that the following Monday was a holiday, and that the next opportunity to present Awadallah to the grand jury would be Wednesday, October 10. The court therefore set October 11 as a control date for further hearings.\n\nWhen Awadallah appeared before the grand jury on Wednesday, October 10, he made statements that resulted in perjury charges being filed against him. He testified before the grand jury a second time on Monday, October 15, and he was arrested on the perjury charges on Friday, October 19. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nAll told, Awadallah spent 20 days in detention as a material witness before testifying before the grand jury and uttering the allegedly perjurious statements. The undisputed facts establish that he received two bail hearings pursuant to § 3142 within days of his arrest, and that the judges in both hearings found his continued detention to be both reasonable and necessary. Under these circumstances, Awadallah's detention as a material witness was a scrupulous and constitutional use of the federal material witness statute.\n\nII. VALIDITY OF THE MATERIAL WITNESS WARRANT\n\nHaving concluded that Awadallah was properly detained under § 3144 as a material grand jury witness, we now consider the district court's alternative basis for suppressing his grand jury testimony and dismissing the indictment. In Awadallah IV, the court assumed § 3144's applicability and asked \"whether Awadallah was appropriately detained in accordance with the requirements of that statute.\" 202 F. Supp. 2d at 96. The court ruled, in essence, that \"the indictment must be dismissed because of material omissions and misrepresentations in the application for the arrest warrant.\" Id. at 85.\n\nA. LEGAL FRAMEWORK\n\nAs explained in Part I, § 3144 permits the detention of a material witness \"[i]f it appears from an affidavit filed by a party that the testimony of a person is material in a criminal proceeding, and if it is shown that it may become impracticable to secure the presence of the person by subpoena.\" 18 U.S.C. § 3144. Under the Warrant Clause of the Fourth Amendment, \"no Warrants shall issue, but upon probable cause, supported by Oath or affirmation, and particularly describing the place to be searched, and the persons or things to be seized.\" U.S. Const. amend. IV.\n\nTherefore, an application for a material witness warrant under § 3144 must establish probable cause to believe that (1) the witness's testimony is material, and (2) it may become impracticable to secure the presence of the witness by subpoena. See Bacon, 449 F.2d at 942-43 (holding that probable cause is the appropriate standard for § 3144 material witness warrants).\n\nOrdinarily, a search or seizure pursuant to a warrant is presumed valid. In certain circumstances, however, a defendant may challenge the truthfulness of factual statements made in the affidavit, and thereby undermine the validity of the warrant and the resulting search or seizure. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e See Franks v. Delaware, 438 U.S. 154, 164-72 (1978); United States v. Canfield, 212 F.3d 713, 717 (2d Cir. 2000). In order to invoke the Franks doctrine, Awadallah must show that there were intentional and material misrepresentations or omissions in Agent Plunkett's warrant affidavit. A misrepresentation or omission is intentional when \"the claimed inaccuracies or omissions are the result of the affiant's deliberate falsehood or reckless disregard for the truth.\" Canfield, 212 F.3d at 717-18 (quoting United States v. Salameh, 152 F.3d 88, 113 (2d Cir. 1998)).\n\nIt is material when \"the alleged falsehoods or omissions were necessary to the [issuing] judge's probable cause finding.\" Id. at 718. We gauge materiality by a process of subtraction:\n\nTo determine if the false information was necessary to the issuing judge's probable cause determination, i.e., material, \"a court should disregard the allegedly false statements and determine whether the remaining portions of the affidavit would support probable cause to issue the warrant.\" If the corrected affidavit supports probable cause, the inaccuracies were not material to the probable cause determination and suppression is inappropriate.\n\nId. at 718 (citation omitted). \"The ultimate inquiry is whether, after putting aside erroneous information and material omissions, 'there remains a residue of independent and lawful information sufficient to support probable cause.'\" Id. (citation omitted); see also United States v. Trzaska, 111 F.3d 1019, 1027-28 (2d Cir. 1997).\n\nB. STANDARD OF REVIEW\n\nOn appeal, we review de novo the legal question of \"[w]hether the untainted portions [of the affidavit] suffice to support a probable cause finding.\" Canfield, 212 F.3d at 717 (citation omitted); see also United States v. Reeves, 210 F.3d 1041, 1044 (9th Cir. 2000) (\"Whether probable cause is lacking because of alleged misstatements or omissions in the supporting affidavit is . . . reviewed de novo.\"). \"The issue of materiality may be characterized as a mixed question of law and fact, or as a pure question of law,\" but \"[w]e are not bound by the findings of the district court under either characterization.\" United States v. Marin-Buitrago, 734 F.2d 889, 894 (2d Cir. 1984) (citations omitted). However, \"[w]hether a person acted deliberately or recklessly is a factual question of intent\" that we review only for clear error. Trzaska, 111 F.3d at 1028 (citing United States v. Moore, 968 F.2d 216, 220-21 (2d Cir. 1992), for the proposition that a \"district court's factual determinations during [a] Franks hearing are reviewed for clear error\").\n\nC. ANALYSIS\n\nWithin this framework, the district court saw two principal problems in Agent Plunkett's affidavit. First, the court ruled that Agent Plunkett \"could not have made an informed judgment about the materiality of Awadallah's testimony to the grand jury's investigation as he was never present in the grand jury.\" Awadallah IV, 202 F. Supp. 2d at 97. Second, the court ruled that there were material misrepresentations and omissions in the affidavit such that, \"[i]f the misleading information had been removed and the omitted information disclosed, it is overwhelmingly likely that the court would have found that Awadallah's presence at the grand jury could have been secured by a subpoena.\" Id. at 98. For the reasons that follow, we disagree.\n\n1. KNOWLEDGE\n\nAs a threshold matter, we reject the idea that only a prosecutor, and not an FBI agent, may assess the materiality of a grand jury witness's testimony. See Awadallah IV, 202 F. Supp. 2d at 97 (invalidating the warrant in part because the affidavit \"was submitted by Agent Plunkett based solely upon his personal knowledge\" and he \"could not have made an informed judgment about the materiality of Awadallah's testimony to the grand jury's investigation\" since \"he was never present in the grand jury\"). As the government observes (Appellant's Reply Br. at 43), Awadallah does not press this argument on appeal; and we have found no case prohibiting an FBI agent from signing an affidavit for a material witness warrant. True, a panel of the Ninth Circuit held in Bacon that, \"[i]n the case of a grand jury proceeding, we think that a mere statement by a responsible official, such as the United States Attorney, is sufficient to satisfy [materiality],\" 449 F.2d at 943 (emphasis added), but the panel did not say that only the United States Attorney could attest to materiality.\n\nUnder § 3144, a material witness warrant may issue only if \"it appears from an affidavit filed by a party that the testimony of a person is material in a criminal proceeding.\" 18 U.S.C. § 3144. In Trzaska, we stated that \"the person preparing the affidavit\" for a search warrant \"should have had at least some personal knowledge of what had transpired.\" 111 F.3d at 1028. Applying this notion in the context of a material witness warrant, we believe that an FBI agent who works closely with a prosecutor in a grand jury investigation may satisfy the \"personal knowledge\" requirement. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nAgent Plunkett stated in his affidavit that Awadallah had \"participated in the investigation of Usama Bin Laden and the al Qaeda terrorist group.\" He described previous indictments and recent convictions obtained in the Southern District of New York as part of the same overarching investigation. \"Based on information developed to date, including interviews with witnesses and analyses of other evidence,\" he described the focus of the ongoing grand jury investigation as \"a series of terrorist attacks that were carried out, apparently in coordinated fashion, on September 11, 2001.\" He stated that he had \"debriefed other agents and law enforcement officers who [had] been involved in this investigation,\" and that he \"reviewed relevant reports, documents and records in this investigation.\" The record shows that he worked closely with an AUSA in the Southern District of New York and was in close contact with the agents who were dealing with Awadallah in San Diego. Under these circumstances, we conclude that Agent Plunkett had personal knowledge sufficient to file an affidavit from which \"it appears . . . that the testimony of [Awadallah was] material in a criminal proceeding.\" 18 U.S.C. § 3144.\n\n2. INTENTION\n\nThe district court identified five statements in Agent Plunkett's affidavit that it deemed misleading. First, the court believed the affidavit misled by stating that Awadallah had \"substantial family ties in Jordan and elsewhere overseas,\" but omitting that Awadallah had three brothers in San Diego, one of them a citizen. Awadallah IV, 202 F. Supp. 2d at 97. Second, the court believed the affidavit misled by stating that Awadallah's phone number had been found in the car at Dulles Airport, but omitting that the phone number belonged to Awadallah at a prior residence eighteen months earlier. Id. at 98. Third, the court believed the affidavit misled by omitting that Awadallah had been \"cooperative\" with FBI agents on September 20 and 21. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e Id. at 97-98. Fourth, the court believed the affidavit misled by stating that a \"box-cutter\" had been found in Awadallah's apartment, but omitting that it was really a carpet knife; that it had actually been found in his inoperative second car; and that witnesses had seen him install a carpet recently. Id. at 98 n.27.\n\nFinally, the court believed the affidavit misled by referring to \"prior conduct\" for which Awadallah might have feared being investigated, when no such conduct was known.\n\nId. at 97.\n\nWe do not see how the final statement can be regarded as misleading when read in context. The affidavit stated that \"Awadallah may also be concerned that his prior conduct, as set out above, may provide a basis for law enforcement authorities to investigate and possibly prosecute him.\" The district court failed to appreciate the limitation in the phrase \"as set out above,\" which makes clear that the statement references the preceding paragraphs of the affidavit itself and does not describe or suggest any additional conduct for which Awadallah could have been prosecuted. It does not matter that the conduct described in the affidavit was not prosecutable: the affidavit stated only that Awadallah \"may . . . be concerned\" about prosecution and that he therefore had considerable \"incentive to flee.\"\n\nIt is a stretch to say that any of the four other statements identified by the district court were in fact misleading, but assuming that they are misleading for purposes of our Franks analysis, we find no basis to conclude that these misrepresentations and omissions were intentional. Awadallah must establish that the misleading statements were the result of \"deliberate falsehood or reckless disregard for the truth.\" Canfield, 212 F.3d at 717-18. The district court did not find that the statements were intentionally or recklessly misleading; it said they were \"not a result of mistake or accident.\" Awadallah IV, 202 F. Supp. 2d at 98-99. Although we review factual findings on intent only for clear error, see Trzaska, 111 F.3d at 1028, this finding is insufficient as a matter of law under the Franks doctrine.\n\nOur review of the record reveals no basis for a finding that Agent Plunkett intentionally misled the court or recklessly disregarded the truth. The evidentiary hearing held by the district court was limited in scope. See generally Awadallah II, 202 F. Supp. 2d at 21 (discussing issues that required hearing). Agent Plunkett testified only with regard to (1) whether any information had been presented orally to Chief Judge Mukasey to supplement the warrant application; and (2) Awadallah's October 4 proffer to the government. The AUSA who helped Agent Plunkett prepare the affidavit did not testify. There was no examination of Agent Plunkett's intent or of additional knowledge that might have been imputed to him.\n\nThe affidavit itself disclaims any pretense of completeness: \"Because the limited purpose of this affidavit is to support the issuance of the requested warrant, I have not set forth all the facts known to me, or to other agents or law enforcement personnel concerning this nationwide investigation.\" The finding that omissions were not made by \"mistake or accident\" is compatible with this express disclaimer. But the mere intent to exclude information is insufficient, as the Fourth Circuit has observed:\n\nAn affiant cannot be expected to include in an affidavit every piece of information gathered in the course of an investigation. However, every decision not to include certain information in the affidavit is 'intentional' insofar as it is made knowingly. If . . . this type of 'intentional' omission is all that Franks requires, the Franks intent prerequisite would be satisfied in almost every case. . . . [Rather,] Franks protects against omissions that are designed to mislead, or that are made in reckless disregard of whether they would mislead, the magistrate.\n\nUnited States v. Colkley, 899 F.2d 297, 300-01 (4th Cir. 1990) (emphasis in original). The district court, which was cognizant of this standard, made no finding of recklessness or bad intent. And the nature of the omissions does not itself suggest concealment. \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e Therefore, even assuming that four of the statements identified by the district court were misleading, there is no basis to conclude that they were intentionally or recklessly so.\n\n3. MATERIALITY\n\nWe also conclude that the material witness warrant was valid because Agent Plunkett's affidavit, even with any necessary emendations, established probable cause to believe that Awadallah's testimony was material to the grand jury investigation and that it might become impracticable to secure his presence by subpoena. Before proceeding with this materiality analysis, we must first consider an additional category of information that the district court could (and probably should) have excised from the affidavit.\n\nWe have held that \"[e]vidence seized during an illegal search should not be included in a [search] warrant affidavit.\" \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e Trzaska, 111 F.3d at 1026. While \"[t]he mere inclusion of tainted evidence in an affidavit does not, by itself, taint the warrant or the evidence seized pursuant to the warrant,\" the court \"should excise the tainted evidence and determine whether the remaining, untainted evidence would provide a neutral magistrate with probable cause to issue a warrant.\" Id. (citations omitted).\n\nAs further discussed in Part III below, the district court held that FBI agents subjected Awadallah to unreasonable searches and seizures on September 20 and 21, 2001, before obtaining the warrant for his arrest. The court ruled that, if the prosecution proceeds, statements and physical evidence obtained by the FBI during these searches and seizures must be suppressed as fruit of the poisonous tree. See Awadallah IV, 202 F. Supp. 2d at 100-07. The government assumes for purposes of this appeal (or at least does not contest) that \"Awadallah was illegally seized on September 20 and again on September 21, as Judge Scheindlin found,\" focusing instead on the district court's application of the exclusionary rule. (Appellant's Br. at 122.)\n\nBased on this Fourth Amendment ruling, the district court probably should have excised the fruits of the improper searches and seizures from Agent Plunkett's affidavit. First, the affidavit should not have referenced at all the three videotapes, the \"box-cutter,\" and the bin Laden photographs seized from Awadallah's apartment and cars. Second, the affidavit should not have stated that Awadallah entered the United States on a student visa in 1999, that he admitted knowing Al-Hazmi, that he admitted being associated with the phone number, or that he has family overseas, since all of this information was gleaned from interviewing Awadallah.\n\nThe district court did not consider excising these fruits of the improper searches and seizures from the affidavit, no doubt because it found sufficient reason to invalidate the warrant without them. Awadallah does not appeal from the district court's failure to make these additional excisions, and he addresses the issue only in passing. (Appellee's Br. at 101.) In the interest of completeness, however, we exercise our discretion to incorporate the additional excisions into our analysis.\n\nBecause the FBI obtained the videotapes, the \"box-cutter,\" the photographs, and Awadallah's admissions during their searches and seizures on September 20 and 21, we assume that this information, like the misleading statements, should not have been used in the government's warrant application.\n\nNonetheless, even after excising the information obtained in violation of the Fourth Amendment and emending the four misleading statements discussed above, \"there remains a residue of independent and lawful information sufficient to support probable cause.\" Canfield, 212 F.3d at 718 (citation omitted); see also Trzaska, 111 F.3d at 1027-28. The corrected affidavit includes the following undisputed facts:\n\n• Nawaf Al-Hazmi was a passenger on American Airlines Flight 77, which crashed into the Pentagon;\n\n• Al-Hazmi entered the United States at the Port of Los Angeles, California, in January 2000;\n\n• A car registered to Al-Hazmi and discovered at Dulles Airport on September 11 contained documents belonging to Khalid Al-Mihdhar, another passenger on Flight 77, documents that linked Al-Mihdhar to San Diego, California;\n\n• The car also contained \"a piece of paper, on which the following name and number were written: 'Osama 589-5316;'\"\n\n• An FBI search of telephone databases revealed that the phone number belonged to Awadallah approximately eighteen months earlier at an address in La Mesa, California;\n\n• \"On September 20, 2001, Agents of the FBI located and interviewed Osama Awadallah in La Mesa, California;\"\n\n• Awadallah's connection to the hijackers was under investigation;\n\n• Awadallah was \"cooperative\" with the FBI agents in the sense that he responded to questions;\n\n• \"Given Awadallah's connections to one or more of the hijackers who committed the terrorist attacks that are the subject of the grand jury's investigation, Awadallah may have an incentive to avoid appearing before the grand jury and/or deprive the investigation of relevant information;\"\n\n• \"Awadallah may also be concerned that his prior conduct, as set out above, may provide a basis for law enforcement authorities to investigate and possibly prosecute him;\" and\n\n• \"[T]here is no assurance that [Awadallah] would appear in the grand jury as directed.\"\n\n(Affidavit of Agent Ryan Plunkett, dated Sept. 21, 2001, at 5-7.) \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e This information makes clear that at least one of the September 11 hijackers possessed Awadallah's home phone number and lived in the same vicinity as Awadallah for some length of time. The same piece of paper supports the inference that Awadallah knew one or more of the hijackers. These facts alone establish probable cause to believe that Awadallah's testimony would be material to the grand jury investigating the September 11 attacks.\n\nWith regard to the impracticability of securing Awadallah's presence by subpoena, it is telling that the FBI agents \"located\" Awadallah on September 20. This means that, in the wake of a mass atrocity and in the midst of an investigation that galvanized the nation, Awadallah did not step forward to share information he had about one or more of the hijackers, whose names and faces had been widely publicized across the country. \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nIt is of course possible, even plausible, that Awadallah feared what might happen to him if he presented himself to the FBI in the days following September 11. It is also possible he did not remember Al-Hazmi or Al-Mihdhar until FBI agents asked him about them, or that he did not see their names in the newspapers and on television. But the relevant inquiry is not whether Awadallah has some explanation for avoiding the FBI. The question is whether his failure to come forward, in combination with the other facts listed above, establishes probable cause to believe that he had information material to the grand jury and that it might become impracticable to secure his presence by subpoena. In the circumstances presented in this case--in which the totality of the circumstances known to the court included the terrorist attacks known to everyone else on the planet, and the implicit threat of further attacks--we hold that it does.\n\nFor these reasons, we conclude that the material witness warrant was valid, that Awadallah's grand jury testimony should not have been suppressed, and that the indictment must therefore be reinstated. \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nIII. APPLICABILITY OF THE FOURTH AMENDMENT EXCLUSIONARY RULE TO EVIDENCE OBTAINED ON SEPTEMBER 20 AND 21\n\nAlthough the district court dismissed the indictment, it applied and extended its analysis to rule that, in a trial, certain evidence would be excluded as the fruit of Fourth Amendment violations. The court expressly did this to obviate an interlocutory appeal that might otherwise result if the dismissal of the indictment were reversed. See Awadallah IV, 202 F. Supp. 2d at 85. We have reversed the dismissal of the indictment, and we now consider the application of the Fourth Amendment exclusionary rule.\n\nThe district court ruled that statements and evidence obtained from Awadallah by the FBI on September 20 and 21, 2001 had to be suppressed as fruit of the poisonous tree because the FBI violated Awadallah's Fourth Amendment right against unreasonable search and seizure. See Awadallah IV, 202 F. Supp. 2d at 100. The court ruled that the FBI agents seized Awadallah illegally on September 20 when they confronted him at his home and took him to their office, and that they did so again the next day after his polygraph test. It also ruled that Awadallah's consent to the September 20 searches was involuntary and tainted by that day's illegal seizure. Id. at 101-07.\n\nAs noted above, the government does not dispute in this appeal that \"Awadallah was illegally seized on September 20 and again on September 21, as Judge Scheindlin found.\" (Appellant's Br. at 122, 128.) Rather, the government challenges the district court's application of the Fourth Amendment exclusionary rule, arguing that this Court's decision in United States v. Varela, 968 F.2d 259 (2d Cir. 1992), prohibits the suppression of evidence when the perjury alleged in the indictment was committed after the constitutional violation. \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e We conclude that the district court erred by ordering suppression of the evidence obtained on September 20 and 21.\n\nA. STANDARD OF REVIEW\n\nWhen examining a ruling on a motion to suppress, \"we review the district court's factual findings for clear error and its conclusions of law de novo,\" viewing the evidence \"in the light most favorable to the prevailing party.\" United States v. Harrell, 268 F.3d 141, 145 (2d Cir. 2001); see also United States v. Dhinsa, 171 F.3d 721, 724 (2d Cir. 1998). The applicability of the fruit of the poisonous tree doctrine is \"a question of law reviewed de novo.\" Howard v. Moore, 131 F.3d 399, 409 (4th Cir. 1997) (citing United States v. Elie, 111 F.3d 1135, 1140 (4th Cir. 1997)); see also United States v. Ienco, 182 F.3d 517, 526 (7th Cir. 1999).\n\nB. ANALYSIS\n\nThe Fourth Amendment provides that \"[t]he right of the people to be secure in their persons, houses, papers, and effects, against unreasonable searches and seizures, shall not be violated.\" U.S. Const. amend. IV. The Supreme Court has \"recognized, however, that the Fourth Amendment contains no provision expressly precluding the use of evidence obtained in violation of its commands.\" Arizona v. Evans, 514 U.S. 1, 10 (1995) (citing United States v. Leon, 468 U.S. 897, 906 (1984)). \"The wrong condemned by the [Fourth] Amendment is fully accomplished by the unlawful search or seizure itself, and the use of the fruits of a past unlawful search or seizure work[s] no new Fourth Amendment wrong.\" Id. (internal quotation marks and citations omitted).\n\nIn order to discourage or prevent such violations, however, the courts have fashioned an \"exclusionary rule [that] operates as a judicially created remedy designed to safeguard against future violations of Fourth Amendment rights through the rule's general deterrent effect.\" Id. (citations omitted). \"As with any remedial device, the rule's application has been restricted to those instances where its remedial objectives are thought most efficaciously served. Where 'the exclusionary rule does not result in appreciable deterrence, then, clearly, its use . . . is unwarranted.'\" Id. at 11 (quoting United States v. Janis, 428 U.S. 433, 454 (1976)). Moreover, \"[i]ndiscriminate application of the exclusionary rule . . . may well 'generat[e] disrespect for the law and administration of justice.'\" Leon, 468 U.S. at 908 (quoting Stone v. Powell, 428 U.S. 465, 491 (1976)).\n\nWe are therefore appropriately cautious about any extension of the exclusionary rule:\n\n[A]ny extension of the rule beyond its core application--normally, barring use of illegally seized items as affirmative evidence in the trial of the matter for which the search was conducted--must be justified by balancing the 'additional marginal deterrence' of the extension against the cost to the public interest of further impairing the pursuit of truth.\n\nTirado v. Commissioner, 689 F.2d 307, 310 (2d Cir. 1982) (citations omitted). In determining whether exclusion will have the requisite deterrent effect, \"the key question is whether the particular challenged use of the evidence is one that the seizing officials were likely to have had an interest in at the time,\" that is, \"whether it was within their predictable contemplation and, if so, whether it was likely to have motivated them.\" Id. at 311. \"[I]f law enforcement officers are already deterred from Fourth Amendment violations by a prohibition against using illegally seized evidence to secure convictions for the offenses they are investigating, the further question is whether some significant incremental deterrence is achieved by prohibiting use of the evidence for additional purposes.\" Id.\n\nThe present case lies outside the \"core application\" of the exclusionary rule. Federal agents seized Awadallah and searched his property in the course of determining whether he had information material to the grand jury investigation; they had no probable cause to believe he had committed any crime. Having detained Awadallah as a material witness and presented him to the grand jury, the government now prosecutes him for making allegedly false statements during his testimony. The charged crime was thus committed twenty days after the improper searches and seizures.\n\nApplying the test described above to these facts, we ask whether excluding the fruits of the improper searches and seizures from Awadallah's perjury trial would have sufficient deterrence value to justify application of the exclusionary rule. We have confronted analogous circumstances in two cases. In United States v. Ceccolini, 542 F.2d 136 (2d Cir. 1976), rev'd in part, 435 U.S. 268 (1978), an illegal search led police to question an employee in a store owned by Ceccolini. Based on the information thus obtained, the government subpoenaed Ceccolini to testify before a grand jury about illegal gambling. 542 F.2d at 138. In his testimony, Ceccolini denied taking bets at his store. Id. The employee contradicted this statement, and the government indicted and prosecuted Ceccolini for perjury. Id. After the illegal search came to light, the district court suppressed the employee's testimony as fruit of the illegal search and set aside Ceccolini's guilty verdict. Id. at 139.\n\nAs here, the prosecutor in the Ceccolini appeal did not dispute that the search in question was illegal, but challenged the suppression. See id. at 140 \u0026 n.5. A divided panel rejected the prosecutor's argument that \"the rule excluding the fruit of an illegal search is inappropriate in a perjury prosecution, especially when the perjury occurred after the illegal intrusion.\" Id. at 142.\n\nWe saw \"no sufficient basis for distinguishing trials of perjury charges from trials on charges of other serious crimes to which the exclusionary rule would apply in the Government's direct case at trial.\" Id. Without elaboration, we \"disagree[d] with the Government's contention that the exclusionary rule serve[d] no purpose\" in the case. Id. at 143.\n\nThat assessment was one of two grounds for affirming the suppression of the employee's testimony and the district court's decision to set aside the guilty verdict. We also rejected the government's argument that the employee's testimony was an act of free will sufficiently removed from the illegal search as to purge any taint: \"the road to [the employee's] testimony from [the officer's] concededly unconstitutional search [was] both straight and uninterrupted . . . .\" Id. at 142. The Supreme Court reversed, concluding that we \"erred in holding that the degree of attenuation was not sufficient to dissipate the connection between the illegality and the testimony.\" United States v. Ceccolini, 435 U.S. 268, 279 (1978). The Supreme Court therefore \"[did] not reach the Government's contention that the exclusionary rule should not be applied when the evidence derived from the search is being used to prove a subsequent crime such as perjury.\" Id. at 273.\n\nThe district court here cited Ceccolini in support of its decision to suppress the evidence obtained illegally on September 20 and 21. See Awadallah II, 202 F. Supp. 2d at 48-49. Like the district court, we think that what remains of Ceccolini supports the view that the exclusionary rule may be applied in perjury prosecutions even though the charged perjury occurred after the illegal search or seizure. But Ceccolini does not require application of the exclusionary rule in such cases. Rather, as in other situations, we must determine whether \"the exclusionary rule serves [a] purpose here.\" Ceccolini, 542 F.2d at 143.\n\nWould exclusion of the evidence obtained by the FBI on September 20 and 21 yield significant deterrence value? On this question, we are guided by United States v. Varela, 968 F.2d 259 (2d Cir. 1992), the second case in which we confronted a similar factual scenario. In Varela, the defendant made incriminating statements regarding cocaine trafficking after police arrested him without probable cause. Id. at 260. By reason of the Fourth Amendment violation, a district court suppressed his statements and dismissed the drug charges against him. Id. Several months later, Varela appeared before a grand jury to testify about cocaine trafficking by his alleged co-conspirators, and he made false statements that contradicted his previously suppressed statements. Id. at 261. The previously suppressed statements were then used to prosecute and convict him for perjury. Id.\n\nWe affirmed Varela's conviction. Balancing \"the deterrence value of a particular application of the exclusionary rule\" against \"society's interest in bringing all probative evidence to bear on the questions before the court,\" id. at 261, we held that \"statements obtained as fruit of an illegal arrest may be introduced in a perjury trial, if the alleged perjury occurred after the illegal arrest and there is no actual evidence of collusion between the proponents of the evidence and the arresting officers,\" id. at 263. Since the \"law enforcement officials already [were] prohibited from using unlawfully seized evidence to convict [the] defendant of the offenses under investigation,\" we asked whether \"any incremental deterrence [would] result[] from excluding the same evidence in a subsequent proceeding.\" Id. at 262. We found that any incremental deterrence failed to outweigh society's interest in using the evidence, because we \"would have [had] to make the unlikely assumption that when the . . . agents arrested Varela unlawfully and solicited his cooperation, they were motivated in part by the belief that Varela would later choose to lie to a grand jury.\" Id. That possibility was \"too remote to serve as a motivating factor.\" Id. We therefore \"join[ed] the First, Fifth, and Ninth Circuits in concluding that the exclusionary rule does not apply in such a case.\" Id. at 260 (citing United States v. Finucan, 708 F.2d 838, 845 (1st Cir. 1983); United States v. Raftery, 534 F.2d 854, 857 (9th Cir. 1976); and United States v. Turk, 526 F.2d 654, 667 (5th Cir. 1976)). \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nAs the district court observed, there are distinctions between Varela and Awadallah's case. First, Varela's statements had already been suppressed once in the prior prosecution for which they were initially obtained, whereas the evidence obtained by the FBI while questioning Awadallah as a possible material witness would first be used in his forthcoming perjury prosecution. See Awadallah II, 202 F. Supp. 2d at 52. Second, a court had already determined that Varela's prior statements were obtained unlawfully by the time he uttered false statements to a grand jury, whereas no court had yet found the seizure of Awadallah to be unlawful when he appeared before the grand jury. See id.\n\nThus our case differs from Varela insofar as the Fourth Amendment violations have not yet caused the government to suffer a disadvantage in prosecuting Awadallah. However, Fourth Amendment exclusionary rule jurisprudence does not require that law enforcement officials and the public be penalized by an actual exclusion of evidence--and a frustrated prosecution--before one may conclude that the circumstances of the case require no further exclusion of evidence or exaction of penalty. \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e So long as the deterrent force created by exclusion has already been brought to bear, there is no significant need to suppress the evidence in a subsequent prosecution for criminal conduct (here, perjury) that post-dates the Fourth Amendment violation.\n\nOn the facts of this case, we think the incentive to avoid exclusion was sufficiently strong at the time of the search and seizure. The FBI agents detained and questioned Awadallah as a possible material witness, but they must have had a lively sense that their investigation could potentially evolve into a criminal prosecution. Awadallah's telephone number was in the possession of one of the September 11 hijackers, and he was therefore one of the few people known, at that time, to have some connection to them; he lived in the vicinity of the hijackers for some length of time; and he had not come forward to assist an investigation that galvanized the rest of the country.\n\nThe district court looked at these circumstances and thought that perjury was a foreseeable consequence of the FBI agents' conduct. See Awadallah II, 202 F. Supp. 2d at 52. As a matter of law, however, we must ask not just \"whether the particular challenged use of the evidence . . . was within [the seizing officials'] predictable contemplation,\" but also \"whether it was likely to have motivated them.\" Tirado, 689 F.2d at 311. Here, the government's motivation may have evolved as the investigation proceeded in ensuing days, but viewing this case (as we must) in light of all the circumstances, we think it is untenable to say that the FBI agents, just ten days after the September 11 attacks, sought to elicit perjury rather than truthful information. Cf. United States v. Turk, 526 F.2d 654, 667 (5th Cir. 1976) (refusing to assume \"that the police could be so confident that an immunized search victim would prevaricate before a grand jury that they would be willing to seize evidence of a crime illegally, and thus to forego the possibility of direct prosecution\").\n\nWe therefore conclude that the \"law enforcement officers [were] already deterred from Fourth Amendment violations,\" and that no \"significant incremental deterrence is achieved by prohibiting use of the evidence\" in Awadallah's perjury prosecution. Tirado, 689 F.2d at 311.\n\nThe information and evidence obtained by the FBI on September 20 and 21, twenty days before Awadallah appeared before the grand jury, is not excludable as fruit of the improper searches and seizures.\n\nCONCLUSION\n\nFor the foregoing reasons, we reverse the decisions of the district court and remand for reinstatement of the indictment and further proceedings consistent with this opinion.\n\nSTRAUB, Circuit Judge, concurring in the judgment on separate grounds:\n\nI concur in the majority opinion in nearly all respects, including the holdings in Part I that the federal material witness statute, 18 U.S.C. § 3144, permits the arrest and detention of grand jury witnesses and is constitutional and the holding in Part III that the District Court erred when it held, as one of its alternative rulings, that the statements and other evidence obtained from Awadallah on September 20 and 21 would have to be suppressed at Awadallah's perjury trial. With respect to Part II of the majority opinion, I join the majority in concluding that Agent Plunkett's personal knowledge of the relevant information made him a suitable affiant (Parts II.A through II.C.1) and that there is no basis in the record for concluding that Agent Plunkett intentionally misled the court by omitting or misstating relevant information in his affidavit (Part II.C.2).\n\nThe sole exception to my concurrence is my respectful disagreement with my colleagues' conclusion, in Part II.C.3 of the majority opinion, that the particular material witness arrest warrant at issue in this case was valid. Once the evidence that was unlawfully obtained from Awadallah on September 20 and 21 is excised from Agent Plunkett's affidavit, the few strands of factual information that would have remained--while sufficient to satisfy the materiality prong of the federal material witness statute--would not have established probable cause to believe that it may have \"become impracticable\" to secure Awadallah's presence before the grand jury by subpoena. See 18 U.S.C. § 3144. To conclude otherwise, as the majority does, impermissibly fuses the separate statutory materiality and impracticability requirements and has significant implications for Fourth Amendment jurisprudence. Moreover, the majority reaches this question unnecessarily, for we need not determine the validity of the warrant to reverse the District Court's suppression decision. Accordingly, although I agree with the conclusion that the District Court's decision to suppress Awadallah's grand jury testimony must be reversed, I do so for separate reasons.\n\nI.\n\nAssuming, as my colleagues do, that our precedents regarding search warrants would apply in the context of a material witness arrest warrant, see ante at [68-69 \u0026 n.21], I likewise evaluate the validity of the Plunkett affidavit after excising the statements and physical evidence unlawfully obtained from Awadallah on September 20 and 21. Unlike my colleagues, however, I believe that this stripped-down affidavit would not have contained sufficient information to support a finding of probable cause, under the impracticability prong of § 3144, to issue a warrant for Awadallah's arrest as a material witness.\n\nThe majority opinion contains an enumeration of the facts that remain in our hypothetical affidavit once all of the tainted evidence collected on September 20 and 21 is excised. \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e See ante at [71-72]. That list essentially boils down to the following set of facts upon which we must rest any probable cause finding:\n\n• The FBI discovered a slip of paper bearing the name \"Osama\" and the telephone number \"589-5316\" in an abandoned car at Dulles Airport that belonged to one of the suspected September 11 hijackers, Nawaf Al-Hazmi.\n\n• The FBI discovered that one such telephone number (619-589-5316) was subscribed approximately eighteen months earlier to an Osama Awadallah in La Mesa, California, a city immediately to the east of San Diego. \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\n• Other documents in the abandoned car linked Al-Hazmi and another suspected terrorist, Khalid Al-Midhar, to San Diego, California.\n\n• FBI agents \"located and interviewed Osama Awadallah in La Mesa, California\" (emphasis added) and Awadallah was cooperative with the agents during the interview \"in the sense that he responded to questions.\" Ante at [72].\n\nI agree with the majority's conclusion that, based on the presence of Awadallah's phone number in Al-Hazmi's car (even though that phone number was eighteen months out of date) and the San Diego connection, the redacted affidavit would have \"establish[ed] probable cause to believe that Awadallah's testimony would be material to the grand jury investigating the September 11 attacks.\" Ante at [73] (emphasis added). In the days immediately following the September 11 attacks, considering the scale of the devastation wrought by those attacks, the palpable fear of additional strikes and our unsettling lack of knowledge about the hijackers, almost any information about the suspected participants would have been material. Thus, in finding that Awadallah had material information, I do not make any judgment about the substance, extent or, perhaps, inculpatory nature of any information that Awadallah could provide. (Indeed, the limited facts remaining in the redacted affidavit make it impossible to do so.) Even if the most that Awadallah could tell the grand jury was that he did not know the suspected terrorists (and that they must have obtained his telephone number from another person or source) that information would still be material because it would likely close off one avenue of the grand jury investigation (and possibly open up others).\n\nNonetheless, although the materiality prong would have been satisfied, the redacted affidavit does not contain sufficient facts to show that \"it may become impracticable to secure [Awadallah's] presence [before the grand jury] . . . by subpoena.\" 18 U.S.C. § 3144. In excising the tainted evidence from the affidavit, all of the usual indicators of impracticability have been stripped. The redacted affidavit no longer contains any information about Awadallah's ties to San Diego or the length of time he has lived in the United States to show that he is a flight risk; nor any mention of Awadallah's overseas family ties and connections to suggest that he might have a place to go; nor any \"admitted connection to the hijackers\" to give him an incentive to flee. Furthermore, the amended affidavit evaluated in the majority opinion contains the fact that Awadallah was cooperative with the FBI agents \"in the sense that he responded to questions.\" Ante at [72].\n\nIn finding that the impracticability prong is satisfied, my colleagues highlight that \"in the wake of a mass atrocity and in the midst of an investigation that galvanized the nation, Awadallah did not step forward to share information he had about one or more of the hijackers, whose names and faces had been widely publicized across the country.\" Ante at [73]. The principal problem with this conclusion is that it is premised on several significant inferential leaps that do not find sufficient factual support in the redacted affidavit. My colleagues erroneously draw from the slip of paper not merely the easy and obvious inference that the suspected hijackers knew (or knew of) Awadallah but that (i) the hijackers' possession of Awadallah's 18-month-old phone number meant that Awadallah knew them; and (ii) Awadallah was sufficiently familiar with the hijackers that he should have promptly sought out the FBI once the suspected hijackers' identities and pictures were published; and (iii) Awadallah's failure to come forward promptly and of his own volition establishes that he would likely flee if subpoenaed. I do not join my colleagues because, in my view, reliance on such a tenuous and speculative chain of inferences effectively dispenses with the impracticability requirement. \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nFrom the redacted affidavit, we can draw almost no information about what Awadallah knew about the hijackers (even if we accept that whatever he knew would likely be material). The fact that two of the suspected hijackers had a slip of paper with Awadallah's name and outdated telephone number on it, even taken together with the San Diego connection, does not demonstrate that Awadallah had any particular type of information about the hijackers. Without any facts that even remotely suggest the nature or extent of Awadallah's \"information,\" we are in no position to ascertain whether he should have come forward to the FBI. \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\n\nSince we do not know whether Awadallah should have been expected to come forward with this unspecified information about the suspected terrorists, in the absence of other factors suggesting that Awadallah posed a flight risk, we cannot gauge whether his decision not to contact the FBI should be viewed--as the majority views it--in its most extreme light: as probable cause to believe that he would be likely to flee instead of complying with a grand jury subpoena. It is absolutely true that the acts of terrorism committed on September 11 were the equivalent of acts of war, and that the investigation that ensued \"galvanized the nation.\" Ante at [73]. In such a climate, it is difficult to view Awadallah's failure to come forward with relevant information (again assuming that Awadallah had what he understood to be relevant information) without some degree of suspicion. At the same time, in light of the waves of anti-Muslim sentiment that also followed September 11, as the majority acknowledges, even law-abiding and conscientious members of Muslim communities might, at least initially, have been reluctant to come forward of their own volition. See ante at [74] (\"It is of course possible, even plausible, that Awadallah feared what might happen to him if he presented himself to the FBI in the days following September 11.\").\n\nI cannot join Part III.C.3 of the majority opinion because, in my view, there simply would not have been a sufficient factual basis, in the redacted affidavit, to show that the government had probable cause to believe that it would be impracticable to secure Awadallah's testimony before the grand jury by subpoena. In finding that there is a sufficient basis, I fear that the majority opinion may have the effect of weakening the impracticability requirement--traditionally the more difficult of the two § 3144 prongs to satisfy \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e --by resting its impracticability finding entirely on a slender materiality showing and a number of suppositions (not supported by any facts in the redacted affidavit) about the significance of Awadallah's failure to come forward. Other courts have rejected much stronger impracticability showings. In Bacon, for example, a case that features prominently in our analysis of the federal material witness statute, see ante at [20, 30-32], the Ninth Circuit found the government's impracticability showing insufficient, despite the fact that it included proof that (i) the witness \"had personal contact with fugitives from justice\"; (ii) she had access to money to facilitate any escape effort; and (iii) she was captured on a rooftop adjoining the residence where she was believed to be staying (leading the court to infer that she \"wished to avoid apprehension\"). Bacon, 449 F.2d at 944-45 (refusing to draw additional inferences that were not adequately supported by the record). Later, in Arnsberg v. United States, 757 F.2d 971 (9th Cir. 1985), the Ninth Circuit rejected another impracticability showing, finding the warrant at issue in that case invalid even where the facts showed that the witness was \"somewhat obstinately insisting upon his right to refuse to appear before a grand jury until personally served.\" Id. at 976. According to the Arnsberg court, the government failed to make a showing that the witness \"was a fugitive or that he would be likely to flee the jurisdiction,\" the types of factors that are generally required for a showing of impracticability. Id.\n\nUnder the view adopted by my colleagues, if an individual with any unspecified level of material information about the persons suspected of perpetrating a crime fails to come forward to the FBI with that information, that failure will serve as proof that he would not abide by a grand jury subpoena and may justify his arrest as a material witness. Even if the majority's holding is viewed to be limited to the obviously unique context of the aftermath of the September 11 attacks, it seems to suggest that any individual with a documented connection to the suspected hijackers--including, e.g., anyone from a neighbor or colleague to a less familiar acquaintance at their mosque \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e --could, without any additional showing, have been arrested as a material witness if he failed (for whatever reason) to come forward in the days following the publication of the suspected hijackers' names and photographs.\n\nII.\n\nI am further troubled by my colleagues' willingness to decide this thorny Fourth Amendment question despite the availability of a much more straightforward (and less controversial) means to the same end. See Alexander v. Louisiana, 405 U.S. 625, 633 (1972) (describing the Court's \"usual custom of avoiding decision of constitutional issues unnecessary to the decision of the case before us\"); Ashwander v. TVA, 297 U.S. 288, 347 (1936) (Brandeis, J., concurring) (\"The court will not pass upon a constitutional question although properly presented by the record, if there is also present some other ground upon which the case may be disposed of.\"); see also Dep't of Commerce v. U.S. House of Representatives, 525 U.S. 316, 343-44 (1999) (same); United States v. Ajlouny, 629 F.2d 830, 840 (2d Cir. 1980) (declining to \"adjudicate the [constitutional question of the] lawfulness of the surveillance\" at issue in the case because the court did \"not believe it would be appropriate to apply the exclusionary rule in this case, even if the surveillance were unlawful and did lead to any trial evidence\"), cert. denied, 449 U.S. 1111 (1981).\n\nIndeed, I am particularly hesitant to engage such an issue when it has not been squarely addressed by either the District Court below or the parties on appeal. The District Court did not consider the impact of excising the illegally seized evidence from Agent Plunkett's affidavit--presumably because, by finding the arrest unlawful on several other grounds (that we have now rejected), it had no need to reach this issue. And, although the government indicated at oral argument that the scrap of paper, standing alone, could furnish probable cause for Awadallah's arrest as a material witness, only two pages at the end of its 83-page reply brief were devoted to this possibility. Awadallah, likewise, asserted the invalidity of a redacted affidavit only in passing. Unlike the applicability of the federal material witness statute, then, which was carefully and methodically examined in the parties' briefs, as well as in the submissions from amici curiae, see ante at [18-19], the sufficiency of the Plunkett affidavit once the evidence unlawfully obtained on September 20 and 21 is excised has not been \"squarely presented\" by the parties.\n\nIII.\n\nThe District Court, having determined that Awadallah's arrest was invalid (on several alternative theories) in Awadallah III and Awadallah IV, held that his allegedly perjurious testimony before the grand jury must be suppressed as the \"fruit\" of that unlawful arrest and detention. United States v. Awadallah, 202 F. Supp. 2d 55, 79-82 (S.D.N.Y. 2002) (\"Awadallah III\") (rejecting the government's \"independent source\" and \"inevitable discovery\" arguments); United States v. Awadallah, 202 F. Supp. 2d 82, 100 (S.D.N.Y. 2002) (\"Awadallah IV\") (holding that Awadallah's grand jury testimony, \"which occurred after twenty days of continuous wrongful detention,\" must be suppressed). The majority holds that the District Court erred in suppressing Awadallah's grand jury testimony because the majority finds that the warrant, even after excising the tainted evidence and amending the alleged misstatements, would have contained sufficient factual information to support a finding of probable cause to arrest Awadallah. See ante at [68-74]. Although I disagree with the majority's conclusion that there was probable cause for Awadallah's arrest as a material witness, I share the view that the District Court erred in suppressing Awadallah's grand jury testimony as the fruit of his unlawful arrest and detention. Even if we were to hold, as I suggest in Part I of this concurrence, that the warrant for Awadallah's arrest was invalid, that would not bar prosecution of his subsequent perjury.\n\nWe review the District Court's factual findings on Awadallah's motion to suppress for clear error and its legal conclusions--including the question of whether Awadallah's testimony was a \"fruit\" of his unlawful arrest and detention--de novo. See United States v. Thompson, 35 F.3d 100, 103 (2d Cir. 1994); Howard v. Moore, 131 F.3d 399, 409 (4th Cir. 1997) (explaining that whether appellant's confessions were \"'tainted fruits' is a question of law reviewed de novo\"), cert. denied, 525 U.S. 843 (1998).\n\nEven if we assume, for the reasons set forth above, that Awadallah's arrest and detention were unlawful, it does not follow that his allegedly perjurious testimony \u003cspan class=\"fnref\"\u003e34\u003c/span\u003e before the grand jury was the fruit of that illegality. This Court has long recognized that it would be \"an unwarranted extension of [the fruit of the poisonous tree] doctrine to apply it . . . to a new wrong committed by the defendant.\" United States v. Remington, 208 F.2d 567, 570 (2d Cir. 1953), cert. denied, 347 U.S. 913 (1954). In Remington, we considered and rejected the argument (similar to the one proffered by Awadallah) that the defendant's perjury could be suppressed as the \"fruit\" of the government's misconduct:\n\nWe do not see how this theory can be applied in the present case. Here we have a separate crime of perjury committed after the illegal conduct by the government . . . . [T]o call the perjury a fruit of the government's conduct here, is to assume that a defendant will perjure himself in his defense. It is difficult to see any causal relation otherwise between the government's wrong and the defendant's act of perjury during the trial. If this assumption is a premise of the defendant's argument, we cannot accept it for it involves a disregard of the defendant's oath and an assumption that perjury, although a crime, is an inevitable occurrence in judicial proceedings. . . . We do not preserve justice by allowing further criminal activity to take place.\n\nId. \u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\n\nTen years later, in United States v. Winter, 348 F.2d 204 (2d Cir.), cert. denied, 382 U.S. 955 (1965), we reaffirmed Remington, holding that the government's failure to advise a defendant of his right to counsel did not give the defendant \"a defense to a charge that he thereafter gave false testimony while under oath in response to a material question directed to him by a competent tribunal.\" Id. at 210; see also United States v. Mandujano, 425 U.S. 564, 582 (1976) (plurality) (\"In any event, a witness sworn to tell the truth before a duly constituted grand jury will not be heard to call for suppression of false statements made to that jury . . . .\") (rejecting defendant's argument that Fifth Amendment required suppression where Miranda warnings were not given); United States v. Wong, 431 U.S. 174, 180 (1977) (holding that \"perjury is not a permissible way of objecting to the Government's questions\"); Wheel v. Robinson, 34 F.3d 60, 67 (2d Cir. 1994) (\"[I]t is well settled that even constitutional deficiencies in the underlying proceeding do not prevent prosecution for perjury.\"); United States v. Weiss, 752 F.2d 777, 785 (2d Cir. 1985) (same).\n\nThese cases make clear that suppression of Awadallah's grand jury testimony would not be an appropriate remedy for his unlawful arrest and detention. Awadallah's arguments to the contrary--that Remington is outdated and factually distinguishable and that this case is properly governed by Brown v. Illinois, 422 U.S. 590 (1975), and its progeny--are unavailing. In Brown, the Supreme Court evaluated the applicability of the exclusionary rule where the petitioner had been convicted of murder based, in part, on inculpatory statements that he made to police after being unlawfully arrested. See id. at 602. For the statements to be admissible, \"the causal chain, between the illegal arrest and the statements made subsequent thereto, [must] be broken,\" such that the statements were \"'sufficiently an act of free will to purge the primary taint.'\" Id. (quoting Wong Sun v. United States, 371 U.S. 471, 486 (1963)). Our subsequent cases have explained that \"[t]o determine whether a defendant's actions are a product of free will, a court should consider how close in time the illegal search occurred to the defendant's actions, the presence of intervening circumstances and the purpose and flagrancy of the official misconduct.\" United States v. Trzaska, 111 F.3d 1019, 1027 (2d Cir. 1997) (citing Brown, 422 U.S. at 603-04); see also United States v. Oguns, 921 F.2d 442, 447-48 (2d Cir. 1990). Even if we were to apply the Brown analysis, as Awadallah suggests, his testimony before the grand jury cannot reasonably be viewed as the product of his arrest and detention.\n\nThe government has identified a number of intervening circumstances that demonstrate that Awadallah's grand jury testimony cannot properly be viewed as the fruit of his unlawful arrest and detention. Awadallah consulted with counsel on multiple occasions during the twenty days between his arrest and his first grand jury appearance, including on the morning he testified. See United States v. Wellins, 654 F.2d 550, 555 (9th Cir. 1981). Awadallah also appeared before judicial officers on at least two occasions during this time. See Johnson v. Louisiana, 406 U.S. 356, 365 (1972). Before he testified, Awadallah was advised of his rights--including his right to leave the grand jury room to consult with his attorneys--and warned about the consequences of perjury. Cf. Oguns, 921 F.2d at 447-48 (emphasizing the importance of the fact that the defendant was advised of his rights). Although Awadallah indicated at the hearing before the District Court that he was \"under pressure\" and \"scared\" during his grand jury appearance, he tied those emotions principally to the fact that his attorneys were not in the room with him. He did not suggest that his statements before the grand jury were anything but the product of his own \"free will.\" \u003cspan class=\"fnref\"\u003e36\u003c/span\u003e Trzaska, 111 F.3d at 1026 (\"Evidence obtained as a result of the defendant's 'intervening independent act of free will' serves to 'purge the primary taint of the unlawful invasion.'\") (quoting Wong Sun, 371 U.S. at 486). Awadallah's conclusory assertion, in his brief, that his grand jury testimony was \"involuntary\" cannot be reconciled with these facts. In addition, although the District Court seemed to believe that Awadallah's grand jury testimony would have been different if he had not been incarcerated, see Awadallah III, 202 F. Supp. 2d at 81-82, the gravamen of the perjury charge--that Awadallah claimed that he did not recall the name of Al-Hazmi's companion, Khalid Al-Midhar--was part of Awadallah's statements to the agents who questioned him twenty days earlier, on September 20.\n\nAs to the \"purpose and flagrancy of the government's misconduct,\" Trzaska, 111 F.3d at 1027, for the reasons set forth in the majority opinion, I reject Awadallah's repeated assertions that the \"aim\" of the government in arresting and detaining him was to get him to testify falsely before the grand jury. See ante at [86-87] (\"[I]n light of all the circumstances, we think it is untenable to say that the FBI agents . . . sought to elicit perjury rather than truthful information.\"). On these facts, Awadallah's argument that his grand jury testimony should be suppressed as the fruit of his unlawful arrest and detention is unavailing. Finally, Awadallah's other argument for suppression of his grand jury testimony--his claim of a perjury trap--was properly rejected by the District Court.\n\nIn summary, I join Part I, Parts II.A through II.C.2 and Part III of the Court's opinion and I join my colleagues in reversing the judgment of the District Court, reinstating the indictment and remanding for additional proceedings. As set forth above, however, I depart from my colleagues in their conclusion, in Part II.C.3, that a properly redacted and amended affidavit would be sufficient to satisfy the impracticability requirements of 18 U.S.C. § 3144.\n\n\u003cspan class=\"fn\"\u003e1. The Honorable Gregory W. Carman, Chief Judge, United States Court of International Trade, sitting by designation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Awadallah claimed that 15-20 agents approached him in the parking lot. The district court found that there were fewer than ten agents. See Awadallah IV, 202 F. Supp. 2d at 88 n.9.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. According to Awadallah, the administrator of the polygraph test testified before Judge Scheindlin that the test is often given as an interrogation technique to induce confessions, and that the results were not verified by the quality control polygraph unit in Washington, D.C., as they usually would be. Moreover, Awadallah states that he only slept for three hours the night before the test, and that the test administrator did not know whether that could have affected the readings. The district court made no factual findings on the polygraph results.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The government states that it had no notice Judge Scheindlin would rule that 18 U.S.C. § 3144 did not apply to grand jury witnesses. According to the government, this was not one of the issues included within the scope of the evidentiary hearing and supplemental briefing. (Appellant's Br. at 30-31.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. In 1964, as Chief Judge Mukasey noted in his decision, In re Material Witness Warrant, 213 F. Supp. 2d at 291 n.4, Congress reenacted the relevant language of § 1783, see Pub. L. No. 88-619, § 10(a), 78 Stat. 997 (1964), and issued a report stating that the statute \"permits the issuance of a subpena [sic] to be served in a foreign country in all criminal proceedings, including grand jury proceedings.\" S. Rep. No. 1580 (1964), reprinted in 1964 U.S.C.C.A.N. 3782, 3790 (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Former § 3149 provided: If it appears by affidavit that the testimony of a person is material in any criminal proceeding, and if it is shown that it may become impracticable to secure his presence by subpoena, a judicial officer shall impose conditions of release pursuant to section 3146. No material witness shall be detained because of inability to comply with any condition of release if the testimony of such witness can adequately be secured by deposition, and further detention is not necessary to prevent a failure of justice. Release may be delayed for a reasonable period of time until the deposition of the witness can be taken pursuant to the Federal Rules of Criminal Procedure. 18 U.S.C. § 3149 (1966).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Two amicus briefs were filed in support of defendant-appellee and affirmance, one from the New York Council of Defense Lawyers (\"NYCDL\") and one from the American Civil Liberties Union and New York Civil Liberties Union (collectively, \"ACLU\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The NYCDL argues in addition that applying § 3144 to grand jury witnesses violates the Fifth Amendment Due Process Clause, (NYCDL Br. at 27-28, 31-34), but the NYCDL offers little analysis in support of this claim, the district court never considered it, and Awadallah does not assert it himself on appeal. We therefore decline to consider this claim. We note, however, that the factors we consider below to assess the reasonableness of Awadallah's detention under the Fourth Amendment may likewise survive a due process inquiry.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Former 28 U.S.C. § 659, a forebear of § 3144, \"provide[d] that any federal judge, on application of the district attorney, and being satisfied by proof that any person is a competent and necessary witness in a criminal proceeding in which the United States is a party or interested, may have such person brought before him by a warrant of arrest, to give recognizance, and that such person may be confined until removed for the purpose of giving his testimony, or until he gives the recognizance required by said judge.\" Barry, 279 U.S. at 617.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. We recognized in Allen that \"the expansion of Fourth and Fifth Amendment rights, together with stricter scrutiny of the § 618-b procedure by the New York courts, may indicate that [the controlling state case] would be decided differently today.\" 411 F.2d at 244 (footnote omitted). As the NYCDL notes, \"[t]he following year, 1970, the New York Legislature added additional procedural protections to its material witness statutes.\" (NYCDL Br. at 38 n.16.) Still, cases pre-dating the additional safeguards added to the statute in 1970 evidence the courts' longstanding acceptance of detention to assure the availability of grand jury witnesses.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The New York material witness statute in force at the time of our decisions in Glinton I and Allen provided, in pertinent part, as follows: Whenever a judge . . . is satisfied, by proof on oath, that a person . . . is a necessary and material witness for the people in a criminal action or proceeding pending in any of the courts of this state, he may, after an opportunity has been given to such person to appear before such judge and be heard in opposition thereto, order such person to enter into a written undertaking, with such sureties and in such sum as he may deem proper, to the effect that he will appear and testify at the court in which such action or proceeding may be heard or tried, and upon his neglect or refusal to comply with the order for that purpose, the judge must commit him to such place, other than a state prison, as he may deem proper, until he comply or be legally discharged. N.Y. Code Crim. Proc. § 618-b (1915), as quoted in Allen, 411 F.2d at 243 n.1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Awadallah and the NYCDL emphasize that Glinton I and Glinton II pre-dated Morales v. New York, 396 U.S. 102 (1969), and Dunaway v. New York, 442 U.S. 200 (1979). (Appellee's Br. at 62; NYCDL Br. at 38.) However, those cases cast no doubt on our ruling that Glinton had been detained constitutionally pursuant to New York's material witness statute. The defendants in Morales and Dunaway were seized for the purpose of custodial interrogation on less than probable cause to believe they had committed crimes, see Morales, 396 U.S. at 105-06; Dunaway, 442 U.S. at 202, whereas Glinton (like Awadallah) was detained pursuant to a material witness statute as a witness with information material to a grand jury investigation under way at the time of his arrest. See Glinton II, 339 F.2d at 875. The Glinton decisions upheld the detention of a material witness without considering custodial interrogation for other purposes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The new version of the rule provides: A witness who is detained under 18 U.S.C. § 3144 may request to be deposed by filing a written motion and giving notice to the parties. The court may then order that the deposition be taken and may discharge the witness after the witness has signed under oath the deposition transcript. Fed. R. Crim. P. 15(a)(2) (2003).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. We make no ruling on the propriety of the conditions of Awadallah's detention or the treatment he received while in custody. The district court described the conditions as alleged by Awadallah in Awadallah II, 202 F. Supp. 2d at 23-25, but it expressly declined to make \"findings of fact on disputed issues regarding the conditions of confinement,\" Awadallah III, 202 F. Supp. 2d at 59 n.4; see also Awadallah IV, 202 F. Supp. 2d at 88 n.9 (\"I make no findings of fact with respect to the events during his twenty days of detention prior to testifying before the grand jury.\"). These issues lie outside the scope of this appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Toward the end of the bail hearing, the magistrate commented that there were no conditions of release with respect to Awadallah that would \"assure . . . the safety of any other person [and] the community.\" That consideration is, however, inappropriate in the material witness context. See S. Rep. No. 98-225, at 28 n.90 (1983), 1984 U.S.C.C.A.N. at 3211 (\"Of course a material witness is not to be detained on the basis of dangerousness.\"). It is evident, however, that the magistrate simply misspoke (probably the result of reading verbatim from § 3142(g)). The hearing transcript makes clear that the magistrate understood that the factors outlined in § 3142(g) were not all applicable to material witnesses. With the exception of that stray comment regarding community safety at the end of the hearing, the magistrate's analysis was entirely focused on whether it would be impracticable to secure Awadallah's presence before the grand jury by subpoena. The magistrate considered, inter alia, Awadallah's character; his physical and mental condition; his family, employment, and community ties; and his financial resources. The misstatement therefore does not alter our view of the legitimacy of this bail hearing.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. It is unclear from the record whether the control hearing scheduled by Chief Judge Mukasey for October 11 took place. The record does indicate, however, that Awadallah met with his attorneys at least two times between his October 10 and October 15 grand jury appearances, and that October 15 was the first date on which Awadallah could continue his testimony before the grand jury. See Awadallah II, 202 F. Supp. 2d at 34-35.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. The Franks doctrine arose in the context of a search warrant, and neither the Supreme Court nor this Court has extended it to arrest warrants. See United States v. Broward, 594 F.2d 345, 350 (2d Cir. 1979) (declining to decide whether district court correctly applied Franks to arrest warrant). Other courts have applied it to arrest warrants. See, e.g., United States v. Colkley, 899 F.2d 297, 299-303 (4th Cir. 1990); United States v. Martin, 615 F.2d 318, 327-39 (5th Cir. 1980). For purposes of this appeal, we assume without deciding that Franks applies to material witness arrest warrants; even if it applies, it does Awadallah no good. (Appellant's Br. at 86 n.*.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Rule 6(d) of the Federal Rules of Criminal Procedure limits who may be present during a grand jury proceeding to \"attorneys for the government, the witness being questioned, interpreters when needed, and a court reporter or an operator of a recording device.\" Fed. R. Crim. P. 6(d)(1). Physical presence in the grand jury room, however, is not the only way to acquire knowledge of the scope and focus of an investigation. See, e.g., Fed. R. Crim. P. 6(e)(3)(A)(ii) (2002) (permitting a prosecutor to disclose \"matters occurring before the grand jury\" to \"such government personnel . . . as are deemed necessary by an attorney for the government to assist an attorney for the government in the performance of such attorney's duty to enforce federal criminal law\"); Fed. R. Crim. P. 6(e)(3)(C)(i)(V) (permitting disclosure of \"matters occurring before the grand jury\" that \"involve foreign intelligence or counterintelligence\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. As noted above in the statement of facts, we construe this finding to mean that Awadallah responded to questions, not that he necessarily responded truthfully or completely.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. As Agent Plunkett knew, Awadallah was a single adult male; siblings may or may not amount to \"substantial family ties,\" and if one of his brothers in San Diego was a citizen, two were not. Although the phone number belonged to Awadallah at a former address, it is hard to see why that matters to the investigation. Whether Awadallah was in fact cooperating was surely as unknown to Agent Plunkett as it was to the district court and as it is to us. As to the \"box-cutter,\" the tool is multi-purpose, and Agent Plunkett expressed no view as to why Awadallah had one.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. We assume for purposes of this discussion, without deciding, that evidence obtained in violation of the Fourth Amendment must be excluded from a material witness arrest warrant as well as from a search warrant. See United States v. Marchand, 564 F.2d 983 (2d Cir. 1977) (holding that where an arrest was premised on both legally and illegally obtained evidence, the validity of the arrest would depend on whether \"the untainted information, considered by itself, establishes probable cause\") (citation omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. In arguing that a corrected affidavit establishes probable cause for Awadallah's arrest, the government also seeks to introduce several \"related facts which were also known at the time\" of the application, including some potentially inflammatory information not included in Agent Plunkett's affidavit. (Appellant's Reply Br. at 48-49.) These \"related facts\" lie outside the scope of a proper Franks inquiry because the relevant question is whether \"the remaining portions of the affidavit\" give rise to probable cause. Canfield, 212 F.3d at 718 (emphasis added). We confine our analysis to the corrected affidavit described in the text.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. See, e.g., H.G. Reza, et al., \"19 Quiet Lives That Shattered the World,\" L.A. Times, Sept. 15, 2001, at A1; Michelle Mittelstadt, \"3 of 19 Hijackers Linked to San Diego; Feds Give Names, Details on Men Said to Have Crashed Airliners,\" San Diego Union-Tribune, Sept. 15, 2001, at A1; Kelly Thornton, \"3 of 19 Hijackers Linked to San Diego; Trio Lived in Claremont and Lemon Grove,\" San Diego Union-Tribune, Sept. 15, 2001, at A1; Neil A. Lewis \u0026 David Johnston, \"After the Attacks: The Investigation; Justice Dep't Identifies 19 Men as Suspected Hijackers,\" N.Y. Times, Sept. 15, 2001, at A2; David Firestone \u0026 Dana Canedy, \"After the Attacks: The Suspects; FBI Documents Detail the Movements of 19 Men Believed to Be Hijackers,\" N.Y. Times, Sept. 15, 2001, at A3.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Judge Straub's concurrence parts company with this Section, and argues that it could be excised with Occam's razor. One reason Judge Straub's thoughtful approach is not adopted by the majority is that it seems to run counter to a factual finding (which may or may not be clear error) that the post-arrest detention may have affected Awadallah's state of mind. Specifically, the district court links the undisputed conditions of Awadallah's prolonged confinement to the disoriented state of mind that may have contributed to the perjury. See Awadallah III, 202 F. Supp. 2d at 82.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. The government filed its notice of appeal on May 2, 2002, more than three months after the district court's principal discussion of the exclusionary rule in Awadallah II. The notice of appeal was nevertheless timely, because the district court did not actually apply the exclusionary rule until it issued Awadallah IV on April 30, 2002. See Fed. R. App. P. 4(b)(1)(B)(i) (providing that the government must file its notice of appeal \"within 30 days after . . . the entry of the judgment or order being appealed\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Ceccolini is not cited in Varela.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. It would make little sense to require a prior suppression ruling as a condition for exclusion, because there is no such ruling when the exclusionary rule deters a prosecutor from pressing charges.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. In addition to excising the information obtained unlawfully on September 20 and 21, the majority elects to correct the alleged misstatements and omissions contained in the affidavit to demonstrate that \"even with . . . [such] emendations,\" see ante at [68], the Plunkett affidavit contained sufficient evidence to establish probable cause for Awadallah's arrest. As such, their modified affidavit contains two additional facts that favor Awadallah--namely (i) that the telephone number linking him to the slip of paper found in Al-Hazmi's car was 18 months out of date and (ii) that Awadallah was cooperative when interviewed on September 20 by FBI agents.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. While the proximity of La Mesa to San Diego is not spelled out in the affidavit, that fact seems easily and independently verifiable.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Of course, the materiality and impracticability prongs of the § 3144 probable cause inquiry do not always require entirely independent analyses. In many cases, the facts that are used to show what a particular witness knows (materiality) are relevant to the question of whether he will comply with a subpoena (impracticability). Indeed, in this case, prior to the redaction of the affidavit, Awadallah's admitted connection to the hijackers functioned just that way--it was sufficient to satisfy the materiality prong of § 3144 and it was also relevant to (but not dispositive of) the question of impracticability. The facts in the redacted affidavit, however, that support the materiality finding are very thin, yielding virtually no information about the nature or extent of Awadallah's relationship with the suspected hijackers. Thus, those facts provide little guidance as to the potential impracticability of securing his grand jury testimony by subpoena.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. In reality, of course, we know from Awadallah's tainted statements to the police and from his subsequent grand jury testimony that Awadallah's actual contacts with the hijackers were more memorable and perhaps should have compelled him to come forward. None of that appears in the redacted affidavit, however, and our probable cause assessment may not be predicated on evidence that was illegally gathered.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. See Bacon v. United States, 449 F.2d 933, 943 (9th Cir. 1971) (explaining that while a prosecutor's \"mere assertion\" may suffice for the materiality showing, the impracticability prong will only be satisfied if the affidavit in support of the warrant contains a sufficient showing of the \"underlying facts or circumstances\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. While it could be argued that Awadallah's connection to the hijackers is more significant than the relationships referenced above because his phone number was found in a car that the hijackers abandoned just prior to the attacks, such an argument would seem to be significantly undercut by the fact--also contained the majority's amended affidavit--that Awadallah had not been associated with that phone number for eighteen months. See ante at [72].\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. To the extent that Awadallah is suggesting that his mere presence before the grand jury was the fruit of his unlawful arrest, I reject that assertion. The Supreme Court has established, in analogous cases, that a defendant \"cannot claim immunity from prosecution simply because his appearance in court was precipitated by an unlawful arrest.\" United States v. Crews, 445 U.S. 463, 474 (1980) (\"An illegal arrest, without more, has never been viewed as a bar to subsequent prosecution, nor as a defense to a valid conviction.\"); see also Ker v. Illinois, 119 U.S. 436, 440 (1886) (\"[F]or mere irregularities in the manner in which he may be brought into custody of the law [- in Ker's case, forcible abduction -], we do not think [defendant] is entitled to say that he should not be tried at all for the crime with which he is charged in a regular indictment.\"); Frisbie v. Collins, 342 U.S. 519, 522 (1952) (same); Brown v. Doe, 2 F.3d 1236, 1243 (2d Cir. 1993). These cases foreclose any argument that Awadallah's presence before the grand jury is somehow a suppressible fruit of the unlawful arrest. Cf. Crews, 445 U.S. at 474 (explaining that a defendant \"is not himself a suppressible fruit\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Other circuits have likewise held that the fruit of the poisonous tree doctrine does not apply to new crimes committed by an individual who has been unlawfully detained. See, e.g., United States v. Pryor, 32 F.3d 1192, 1195-96 (7th Cir. 1994) (giving false social security number to police officers); United States v. Smith, 7 F.3d 1164, 1167 (5th Cir. 1993) (threatening the President); United States v. Mitchell, 812 F.2d 1250, 1253 (9th Cir. 1987) (same); United States v. Garcia-Jordan, 860 F.2d 159, 161 (5th Cir. 1988) (making false statements to border patrol officials); United States v. Bailey, 691 F.2d 1009, 1017 (11th Cir. 1982) (fleeing from police and resisting arrest), cert. denied, 461 U.S. 933 (1983); cf. United States v. King, 724 F.2d 253, 256 (1st Cir. 1994) (treating shooting at police officers (new crime) as an intervening act that breaks the chain of causation in the fruit of the poisonous tree analysis).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. To be clear, the District Court made no factual findings regarding the voluntariness of Awadallah's grand jury testimony and, instead, determined that suppression of his testimony was appropriate because \"[n]o one will ever know how Awadallah would have testified had he been subpoenaed rather than imprisoned.\" Awadallah III, 202 F. Supp. 2d at 82 (rejecting the government's inevitable discovery argument); see also Awadallah IV, 202 F. Supp. 2d at 100. In so holding, the District Court reviewed the conditions of Awadallah's confinement and the circumstances of his testimony before the grand jury and concluded that, if he had been subpoenaed before the grand jury (and not unlawfully arrested and detained prior to his testimony), he \"would have been well-fed and well-rested, well-prepared and probably less frightened.\" Awadallah III, 202 F. Supp. 2d at 82. The most that this \"finding,\" see ante at [75 n.24], and Awadallah's testimony at the hearing, see supra, may be read to suggest is that Awadallah's grand jury testimony may have been the product of confusion or error, which will, of course, be a proper consideration for the jury when it evaluates whether Awadallah knowingly made false statements to the grand jury. Cf. United States v. Awadallah, 202 F. Supp. 2d 17, 37 (S.D.N.Y. 2002) (\"Awadallah II\") (noting, in rejecting Awadallah's recantation defense, that \"the questions of whether he was 'confused' or 'forgot' may be relevant to the issue of whether he knowingly lied to the grand jury\"). The District Court's findings and Awadallah's recollection of the grand jury proceedings, however, do not show that Awadallah's testimony was not the product of his free will.\u003c/span\u003e\n\n",
    "body_length": 144593,
    "citedas": [
      "349 F.3d 42"
    ],
    "attorneys": "James B. Comey, Jr., UnitedStates Attorney for the SouthernDistrict of New York, New York,New York (Robin L. Baker, KarlMetzner, Celeste L. Koeleveld,and Christine H. Chung,Assistant United StatesAttorneys, on the brief), forAppellant. Robert J. Boyle, New York, NewYork, for Defendant-Appellee. Lawrence Mark Stern, New York,New York, for Defendant-Appellee(Jesse Berman, Of Counsel, onbrief). Diana D. Parker, New York, NewYork (Victor J. Rocco,President, New York Council ofDefense Lawyers; Daniel J.Horwitz and Lorraine R. Doran,Carter, Ledyard \u0026 Milburn, onthe brief), for the New YorkCouncil of Defense Lawyers asDefendant-Appellee. Arthur N. Eisenberg, New YorkCivil Liberties UnionFoundation, New York, New York(Laura W. Guthrie, New YorkCivil Liberties UnionFoundation; Jethro M.Eisenstein, Profeta \u0026Eisenstein; Steven R. Shapiro,Lucas Guttentag, and Robin L.Amicus Curiae in Support ofGoldfaden, American CivilLiberties Union Foundation, onthe brief), for the AmericanCivil Liberties Union and theNew York Civil Liberties Unionas Amici Curiae in Support ofDefendant-Appellee.",
    "category": [
      "243",
      "36",
      "75"
    ],
    "judges": "Before: Jacobs and Straub, Circuit Judges, and Carman,Chief Judge. *fn1",
    "citation_count": 137
  }
}
