{
  "id": "FKFTR2YBTlTomsSB7t95",
  "document": {
    "title": "People v. Phillips",
    "full_title": "THE PEOPLE AND v. RICHARD LOUIS ARNOLD PHILLIPS AND",
    "jurisdiction": "California Supreme Court",
    "date": "1985-12-31T00:00:00.000Z",
    "docket": "Crim. No. 21374",
    "body": "This is an automatic appeal (Pen. Code, § 1239, subd. (b))\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e after defendant was sentenced to death for robbing and shooting two putative confederates in a drug trafficking scheme, one fatally. He was found guilty by a jury of two counts of robbery (§ 211), one count of attempted murder (§§ 187, 664) and one count of first degree murder with a special circumstance, i.e., murder in the commission of a robbery (former § 190.2, subd. (c)(3)(i), as enacted by Stats. 1977, ch. 316, § 9, pp. 1257-1258,\n\nrepealed by Prop. 7 of the initiative measure approved by the voters Nov. 7, 1978). Allegations that defendant personally used a firearm in the commission of one of the robberies, the attempted murder, and the murder were found to be true. (§ 12022.5.)\n\nAfter careful review of each of defendant's arguments, we affirm the judgment on the guilt phase and the special circumstance finding. However, we reverse the judgment on the penalty phase because (1) the trial court failed to give a reasonable doubt instruction regarding evidence of other criminal activity, and (2) the trial court failed to limit admissibility of criminal activity to evidence that demonstrates the commission of an actual crime.\n\nFacts\n\nDefendant became acquainted with Bruce Bartulis (the robbery and murder victim) and Ronald Rose (the robbery and attempted murder victim) in September of 1977. Rose and Bartulis, who were in the construction business, began building some houses adjacent to defendant's home in Newport Beach, California. The three men became friendly after defendant allowed the builders to use an electrical outlet located on his premises.\n\nOn the first day of November 1977, defendant offered Rose and Bartulis an opportunity to participate in a large cocaine purchase, proposing that they invest $25,000 and promising them a return of five times their investment. Rose and Bartulis accepted, and, on November 2, Rose cashed a check for $10,000 and gave the money to defendant. On several occasions thereafter, defendant prodded them \"to come up with the rest of the money.\" Rose subsequently gave defendant a check for $1,500, but eventually told defendant that they could not deliver any more cash and asked him either to use the amount they had given him or to return the money. Defendant agreed to use the money.\n\nIn late November or early December 1977, defendant indicated to Rose and Bartulis, who had told defendant of their difficulties in obtaining insulation for the houses they were constructing, that he knew where they could obtain some stolen insulation, since \"his brother was a part of this deal.\" In fact defendant has no brother. Defendant told the builders that they would have to pick up the insulation in Fresno, where it was being stored in a warehouse. Rose and Bartulis agreed to buy some of the insulation.\n\nOn the morning of December 7, 1977, defendant informed Rose that the insulation was available to be picked up that night in Fresno. Rose had notarized and given defendant a promissory note for $25,000, which represented\n\nthe balance of the $25,000 Rose and Bartulis had committed themselves to in the cocaine deal as well as payment for the insulation. Defendant told Rose that they should meet him that evening at a gasoline station just off the freeway, and instructed him to \"get as much cash together as [he] could.\"\n\nRose obtained between $3,500 and $5,000 in large-denomination bills. With that in hand, he and Bartulis drove to Fresno in Rose's 1977 Ranchero. Rose had an unloaded .44 magnum pistol in the vehicle, with some ammunition behind one of the seats. They checked into a motel designated by defendant and then went to the gasoline station at the appointed time. Within half an hour, defendant arrived, accompanied by his girlfriend, Sharon Colman.\n\nColman had been living with defendant since October and was acquainted with Rose and Bartulis. That day she had flown from Newport Beach to Fresno. She then called defendant, who had flown to Sacramento, and arranged to have him pick her up at the airport in Fresno. Defendant arrived at the airport about 11 p.m., driving a Toyota he had borrowed from his mother (who resided in Sacramento). He told Colman that they were going to meet Rose and Bartulis at a gas station.\n\nDefendant and Colman met Rose and Bartulis at the gas station about 11:30 p.m. Defendant directed the builders to follow him to where they would meet his brother. They followed as defendant and Colman drove north on Highway 99. In the course of the drive, they stopped at an open gasoline station, where defendant used the restroom. When he came out, he walked over to the Ranchero and borrowed a book of matches. The four then continued their trip.\n\nEventually, defendant exited the freeway and the vehicles stopped in a vacant area off the road and just east of the off-ramp. Defendant got out of the Toyota and walked over to the driver's side of the Ranchero (which was parked alongside). While Colman sat in the Toyota listening to the radio, the three men talked for a while, drank some beer and smoked a marijuana cigarette. At one point, defendant re-entered his car on the passenger side, continuing his conversation with Rose and Bartulis. The tenor of the conversation was not angry. A few minutes later, defendant again exited the car and stood next to the Ranchero. Defendant leaned inside the driver's window. Suddenly Colman heard shots being fired. She saw gunflashes and, as defendant withdrew his arm from a window, saw a gun in his hand. She heard the driver, Bartulis, moaning; defendant silenced him by striking him over the head with the gun. Defendant leaned Bartulis forward and extracted his wallet, then went around to the other side of the Ranchero and did the\n\nsame to Rose. In the course of this search, he complained that he could not find the money they were supposed to have. He returned to the Toyota with the two wallets and two handguns (the one he had used in the shooting and another) and handed them to Colman. Defendant had Colman open the trunk of the car, from which he took a can of gasoline. He then poured the gasoline over the Ranchero and its occupants and set them ablaze.\n\nRose was still alive. After being shot, Rose had \"played possum\" while being searched and even while gasoline was poured over him. As with the shooting, he did not actually see defendant do either of these things. He did recall that defendant was alone at the window on the driver's side, that the shots came from the direction in which defendant was standing, and that he heard a male voice close to him while his body was being searched. When he was set afire, Rose jumped out of the Ranchero and tried to shed his burning clothing. Defendant, who had run back to the Toyota and begun to turn it around, saw Rose running away. Complaining to Colman that Rose \"wasn't dead,\" defendant drove at Rose and hit him, in the process cracking the windshield.\n\nDefendant and Colman drove to Sacramento. He was calm, though somewhat disturbed at not knowing whether Rose was dead. He lamented several times that he had been unable to find the money that Rose was supposed to have had with him. (The wallets, which Colman handed over to defendant in the car, contained only $120 to $150.) Defendant also commented that his gun \"was too big of a calibre because he was too close.\"\n\nUpon reaching Sacramento, the pair went to the home of defendant's mother. Defendant went to his mother's room and told her he had been to a \"disco\" dance and that on the way home the windshield had been cracked by some gravel thrown up by a truck. He assured her he would \"take care of it\" that day. A short time later, hearing voices downstairs, defendant's mother came downstairs to investigate. Though she had originally thought her son was alone, she saw a woman (presumably Colman) with him.\n\nMeanwhile, two Madera County Deputy Sheriffs proceeding along Highway 99 on a routine patrol noted a glow in the sky which turned out, on closer inspection, to be three fires just off the freeway. The deputies ran to Rose and covered him, extinguishing the flames. Rose had suffered five gunshot wounds and burns over 65 percent of his body. When he was taken to the hospital, it was not thought that he would live.\n\nIn the Ranchero, Bartulis was found dead, with a bullet wound in the heart. He appeared to have been shot in the left side of the chest and the wound indicated that a large -- .44- or .45-calibre -- bullet was used. Two\n\nbullet holes were observed in the Ranchero, and a spent .45-calibre shell was found on the ground near the vehicle. The deputies also found a jacket containing badly burned currency showing $100 denominations.\n\nThe day after the killing, Colman flew to Fresno. Defendant remained in Sacramento for a few days. While Colman was in Fresno, defendant told her on the telephone that he had had a friend call the hospital and learned that Rose was in \"really bad condition,\" that he \"didn't remember a lot of things\" and \"couldn't talk or anything.\" Defendant visited Colman in Fresno and then they rejoined each other in Los Angeles; from there they drove to Salt Lake City, where Colman had relatives.\n\nOn December 14, 1977, a warrant issued for defendant's arrest; an arrest warrant was also apparently issued for Colman. Colman later left Salt Lake City, apparently in the latter part of December 1977, and returned to Sacramento in the car defendant had borrowed from his brother-in-law. Defendant arranged to have Colman stay at a motel in Sacramento and await contact from a friend of his. Instead, Colman took the opportunity to turn herself in, despite defendant's expression of confidence that \"she would not be dumb enough to cross him or call anybody about it, because if he was in a situation where he couldn't get to [her], that he would have somebody else that could.\" Defendant was apprehended by the Federal Bureau of Investigation on March 17, 1978.\n\nThe defense was alibi. Defendant primarily sought to persuade the jury that Colman and Rose and defendant's erstwhile friend, Richard Graybill (who aided police in their efforts to apprehend defendant) were involved in a conspiracy to fix defendant with the blame for the shootings, which were purportedly committed by Graybill and Colman.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Rose's participation in the conspiracy, it was suggested in argument, might be explained by a desire to avoid the necessity of paying off the $25,000 note or to avoid criminal liability for shooting Bartulis himself.\n\nDefendant admitted knowing Rose and Bartulis. With regard to the cocaine deal, he testified that he set up a meeting for certain individuals interested in consummating such a transaction, using a large barbecue party as a \"front.\" These individuals, including Rose and Bartulis, had expressed interest in using defendant's South American \"source\" and his \"transportation supplies\" to bring cocaine into the country. Defendant did not attend the meeting himself, but understood that there were six shares taken by\n\ninvestors at $35,000 a share. Richard Graybill was the \"coordinator\" of the deal, though the money was ultimately to go to defendant's source in Peru (whom he refused to name). After putting up $10,000 in \"front money,\" Rose and Bartulis had difficulties and were unable to come up with the remaining $25,000. Because he had vouched for them as being \"cool\" to the other participants (essentially \"co-signed for them\") defendant agreed to lend them $25,000 in exchange for a promissory note and the use of their contractor's license. When Rose indicated to defendant that part of their business difficulties stemmed from the unavailability of insulation, defendant told Rose that Graybill was in the building supply business in Fresno and put Rose in contact with him.\n\nDefendant testified that he was at a business meeting and then a disco in Sacramento on the night the killing took place, though he refused to divulge the identities of the people at the meeting. Graybill came to the motel in Sacramento where defendant's meeting was taking place and asked to borrow his (defendant's) mother's car. Defendant lent him the car and, at about midnight, drove Graybill's Cadillac from the motel to a disco and then home. Graybill, accompanied by Colman, returned the Toyota with a damaged windshield between 4:30 and 5 in the morning, without explanation. Defendant had the windshield replaced the next day.\n\nWhen he left the state after the killing, defendant, assertedly, had already agreed with Graybill to \"ride the beef for him,\" since defendant \"had been to prison\" and Graybill \"had some very bad enemies\" from his prior narcotics dealings. They decided defendant should go to Salt Lake City to \"let things cool off\" while Graybill negotiated on his behalf to give himself up and plead guilty to second degree murder.\n\nDiscussion\n\nI. Guilt Phase.\n\nWe first review the claims of error relating to the guilt phase of the trial.\n\nA. Defendant waived the public defender's conflict of interest in representing him at his preliminary hearing.\n\nDefendant contends that he was deprived of the effective assistance of counsel at his preliminary hearing, since his counsel, the public defender, had represented Colman at an earlier stage. This contention is without merit. The record reflects that defendant knowingly waived any objection to the conflict, after his motion for substitution was granted based on his own assertion that a conflict existed.\n\nAt a hearing on his motion for a continuance of the preliminary hearing on June 21, 1979, the public defender represented to the court, for the record, in defendant's presence, that he had explained to defendant that his office had represented Colman, and that \"we did talk to her [and] . . . did have information from her.\" He had further explained, he said, that defendant could, if he wished, \"declare a conflict,\" but that defendant had indicated that he wished to be represented by the public defender \"at these stages of the proceeding.\" Counsel noted that defendant might still wish to \"declare\" a conflict before the preliminary hearing. Defense counsel's remarks later in the hearing indicate that defendant had been encouraged to and expected to retain other counsel in the future. Defendant remained silent throughout. He was indeed represented by the public defender at the preliminary hearing. Later, however, on October 30, 1979, defendant moved for substitution of his counsel, declaring as his reason the public defender's conflict of interest. The next day, the court heard the motion and relieved the public defender and appointed new counsel.\n\nDefendant's silence in the courtroom on June 21, 1979, in the face of his counsel's representations, does not show an unambiguous and knowledgeable waiver of the right to effective counsel as contemplated by our decisions; an effective waiver, under these decisions, must be express and understanding, in response to specific advice by the court regarding the potential conflict and the right to new counsel if a conflict exists. (See In re Hochberg (1970) 2 Cal. 3d 870, 878-879 [87 Cal. Rptr. 681, 471 P.2d 1]; People v. Chacon (1968) 69 Cal. 2d 765, 774 [73 Cal. Rptr. 10, 447 P.2d 106, 34 A.L.R.3d 454]; In re Johnson (1965) 62 Cal. 2d 325, 334-335 [42 Cal. Rptr. 228, 398 P.2d 420]; People v. Angulo (1978) 85 Cal. App. 3d 514, 518-519 [148 Cal. Rptr. 517]; see also United States v. Garcia (5th Cir. 1975) 517 F.2d 272, 278 [requiring advice as to dangers of conflict and a narrative response by defendant].) However, defendant's failure to move to set aside the information under section 995, after his substitution motion was granted, bars him from raising on appeal his challenge to the conduct of the preliminary hearing. (§ 996; People v. Pompa-Ortiz (1980) 27 Cal. 3d 519, 529 [165 Cal. Rptr. 851, 612 P.2d 941]; People v. Harris (1967) 67 Cal. 2d 866, 870 [64 Cal. Rptr. 313, 434 P.2d 609]; People v. Palacios (1968) 261 Cal. App. 2d 566, 571-572 [68 Cal. Rptr. 137].)\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nDefendant cites People v. Anderson (1968) 70 Cal. 2d 15 [73 Cal. Rptr. 550, 447 P.2d 942] for the proposition that \"[section] 996 does not express an absolute mandate, however, and cases may arise in which a defendant\n\nmay properly attack his indictment for the first time on appeal. Section 996, like the general rule that errors not objected to at trial cannot be raised on appeal, rests upon waiver. Thus, if the circumstances do not show a waiver, a defendant may challenge the indictment on appeal even though he did not raise the point by a motion under Penal Code section 995.\" (Id., at p. 23.) The circumstances of this case, however, do show a waiver. Although defendant points to the fact that his motion for substitution of counsel was in propria persona and attempts to suggest that the conflict of interest was \"overlooked by the experienced trial counsel and the court itself,\" the record establishes beyond any doubt that, after his motion for substitution was granted on October 31, 1979, defendant knew the public defender had a conflict of interest owing to its prior representation of Colman, which entitled defendant to new counsel.\n\nIn his reply brief, defendant argues that the record does not show whether he was informed that in the course of its representation of Colman, the public defender's office entered into an agreement with Colman whereby she told the prosecution her story under an informal testimonial immunity arrangement. This possibility makes no difference. What was important to defendant's understanding of the conflict was the knowledge that Colman had given information about the crimes to her public defender in the context of an attorney-client relationship, and this posed possible problems in cross-examining Colman.\n\nThough it may seem anomalous to conclude that there was no valid waiver of defendant's right to counsel by his silence at the June 21, 1979, hearing, but that his silence after the substitution motion was granted did constitute a waiver, the record shows that at the latter time defendant knew all that the requirement of an express waiver is designed to assure that he knows. Accordingly, no reason appears for interfering with the normal operation of section 996.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nB. The trial court's error in refusing to order disclosure of any agreement between the prosecution and Colman's attorney in exchange for Colman's testimony was harmless beyond a reasonable doubt.\n\nDuring the trial, defense counsel stated on several occasions that the prosecution and Colman's attorney had entered into some agreement for\n\nColman's testimony. The trial court concluded that any agreement not communicated to Colman was irrelevant to the issue of her credibility. Thus, it prevented defense counsel from examining the prosecution and Colman's attorney about the existence and terms of any such agreement. Defendant contends that this ruling deprived him of due process.\n\nThe prosecution has a duty to disclose all substantial material evidence favorable to an accused, including evidence relating to the credibility of a material witness. (People v. Ruthford (1975) 14 Cal. 3d 399, 406 [121 Cal. Rptr. 261, 534 P.2d 1341].) \"[Suppression] of substantial material evidence bearing on the credibility of a key prosecution witness is a denial of due process . . . .\" (Id., at p. 408.) Since a witness's credibility depends heavily on his motives for testifying, the prosecution must disclose to the defense and jury any inducements made to a prosecution witness to testify and must also correct any false or misleading testimony by the witness relating to any inducements. (Giglio v. United States (1972) 405 U.S. 150, 154-155 [31 L.Ed.2d 104, 108-109, 92 S.Ct. 763]; People v. Westmoreland (1976) 58 Cal. App. 3d 32, 43 [129 Cal. Rptr. 554].)\n\nIn this case, according to the testimony of Colman's attorney and the prosecutor, no inducements to testify were communicated by them to Colman in any manner, except that her attorney advised Colman to \"have faith and trust\" in her (the attorney) and testify. Colman testified that she had been charged along with defendant in connection with the murder, but was now free on her own recognizance. She confirmed that her preliminary hearing had been continued numerous times. Colman further indicated in response to cross-examination that she was \"expecting that they would take into consideration that [she was] willing to cooperate.\" (In fact, the charges against Colman were dismissed shortly after the trial.)\n\nTherefore, the present case differs from People v. Westmoreland, supra, 58 Cal. App. 3d 32, in which the prosecutor knew that the witness's response to a question whether he had been offered the opportunity to plead guilty to a lesser offense was false. Despite his knowledge of the witness's misleading answer, the prosecutor in Westmoreland remained silent and failed to correct the testimony. Here, there was no attempt to mislead the jury into believing that the witness testified without any expectation of leniency. Colman candidly admitted that she expected her willingness to cooperate to be taken into consideration by the prosecution.\n\nHowever, defendant argues that the prosecution and a witness's attorney should not be permitted to insulate a witness from any agreement entered into in exchange for testimony. He insists that some notion of the possibility of leniency was communicated to Colman. Furthermore, her ignorance of\n\npossible conditions on its availability might have induced her to testify in a manner calculated to satisfy the prosecution. (See, e.g., People v. Medina (1974) 41 Cal. App. 3d 438 [116 Cal. Rptr. 133] [use of witnesses' testimony violated due process when the testimony was given in exchange for an immunity that was conditioned on the testimony's consistency with the witnesses' pretrial statements to police].)\n\nWe find the reasonng of the Westmoreland court persuasive on this issue: \"[Whenever] the district attorney offers one of several persons accused of complicity in the same criminal offense the opportunity to plead guilty to a lesser offense or engages in discussions with his attorney concerning the possibility of leniency, and later the accused appears as a prosecution witness at the trial of the other defendants, both the witness and the district attorney are subject to the accusation that offers of leniency were made in exchange for favorable testimony. If such a charge is made at the trial, and if there is a conflict in the evidence on this issue, it is up to the jury to resolve the conflict and then to judge the credibility of the prosecution witness accordingly. To hold otherwise would lead to post-trial charges and countercharges and, what is worse, could pave the way to the type of double talk which ultimately could lead to the circumvention of the disclosure rules which have evolved to insure a fair trial to all persons accused of crime.\" (Italics added.) (Id., 58 Cal. App. 3d at p. 47.)\n\nIn context, it seems clear that the \"double talk\" condemned by the Westmoreland court referred to precisely the same kind of allegedly \"undisclosed\" promise to a witness' attorney at issue in this case. As Westmoreland recognized, unless the defense attorney is permitted to discover the contents of the arrangement between the prosecutor and the witness's attorney, the defense cannot effectively challenge the witness's statement that his testimony is not being given in return for favored treatment. If disclosure is not required, the defense will never learn whether the terms of the agreement itself suggest that the witness must have had some inkling of the arrangement -- as would be the case, for example, if the promised leniency were dependent on the witness' testifying in a particular manner. Consequently, when an accomplice testifies for the prosecution, full disclosure of any agreement affecting the witness is required to ensure that the jury has a complete picture of the factors affecting the witness's credibility.\n\nMoreover the \"tactical\" device of keeping a prospective prosecution witness in the dark about the terms of a deal that has been negotiated with his counsel suffers from an even more fundamental flaw than an impairment of defense discovery rights. As Justice Fleming pointed out in People v. Brunner (1973) 32 Cal. App. 3d 908, 913-914 [108 Cal. Rptr. 501], one of the principal dangers that arises whenever an accomplice testifies in exchange\n\nfor an expected benefit is that the \"witness may be so influenced by his hopes and fears that he will promise to testify to anything desired by the prosecution in order to obtain a grant of immunity. Because the satisfaction of the prosecution is the [witness's] ticket to freedom, the prosecutor, by dangling the promise of immunity, can put the words he wishes into the [witness's] mouth. This danger is especially grave when the witness knows he is expected to give particular testimony, absent which he will not receive the promised immunity.\"\n\nIt is true that, unlike People v. Medina, supra, 41 Cal. App. 3d 438, a witness who is kept ignorant of the terms of the bargain that his attorney has arranged with the district attorney does not know for certain that favorable treatment depends on his testifying in a particular manner. At the same time, however, unless the witness is informed both of the terms of the agreement and that his receipt of the benefit cannot be denied so long as he testifies fully and truthfully at the criminal trial, the witness cannot help but believe that his own treatment will depend on how \"well\" he does -- from the prosecution's perspective -- in testifying against his accomplice. Consequently, a prosecutor's insistence that the witness not be informed of the terms of the bargain has the inevitable tendency to lead the witness to color his testimony, so as to receive the most favorable treatment from the prosecutor. No legitimate public interest is served by such a practice.\n\nAccordingly, the trial court erred when it held that any agreement not communicated to Colman was irrelevant to the issue of her credibility. The defense counsel is entitled to discover the terms of any agreement for lenient treatment negotiated on behalf of a prosecution witness.\n\nDespite the errors in this regard, however, reversal of the judgment of guilt or the special circumstance finding is not warranted. When the prosecution fails to disclose evidence favorable to the defense, \"[the] defendant must make a showing of substantial materiality and even after this showing is made reversal is not required if the prosecution establishes [that] the failure to disclose was harmless beyond a reasonable doubt.\" (People v. Ruthford, supra, 14 Cal. 3d at p. 409.) While the defense should have been given a fuller opportunity to discover evidence that might have permitted a stronger attack on Colman's credibility, closing arguments on both sides demonstrate that the jury was made well aware of the possible impact of Colman's expectation of leniency on her credibility. The prosecutor noted that \"it wouldn't make any sense if she came in here and testified unless she were hoping for consideration . . . that's why she's testifying.\" Defense counsel emphatically brought home to the jury the potentially coercive effect of the prosecution's tactics, declaring that \"they're holding a murder charge over her head to testify, and she's singing like a bird, the tune that they\n\ncall.\" In this situation, the jury could properly assess Colman's credibility even without testimony on a specific agreement between her attorney and the prosecution. (Cf., In re Wright (1978) 78 Cal. App. 3d 788, 816 [144 Cal. Rptr. 535] [possible perjury by prosecution witness would not have had such an effect on witness' credibility as to make a verdict of not guilty reasonably probable].)\n\nFurthermore, the evidence against defendant with respect to the charged offense was overwhelming. While Colman was an important prosecution witness, the key witness against defendant was Ronald Rose, the victim who miraculously survived despite being shot, set on fire and run over by a car. Given Rose's testimony, and the considerable amount of corroborating evidence, the jury verdict as to guilt and the special circumstance allegation was virtually a foregone conclusion. Under the circumstances, there was no prejudice to the defendant.\n\nC. The trial court did not abuse its discretion in preventing the defense from eliciting from Colman her \"professional background\" as a prostitute and that her reason for flying to Fresno was to ply her trade.\n\nPrior to Colman's testimony, the prosecution made a motion in limine to prevent the defense from eliciting from Colman on cross-examination testimony regarding alleged acts of prostitution, and to exclude certain nude photographs of Colman, apparently taken by defendant. Defendant's counsel opposed the motion, contending that evidence of prostitution was admissible both \"to show the financial situation of the parties who are cohabiting\" and \"to show her specific reason for going to Fresno,\" and supporting admission of the photographs to show \"what the relationship was\" and, possibly, suggest a motive for bias. The trial court granted the motion in limine. The trial court subsequently reaffirmed both rulings when the defense claimed that the prosecution had \"opened [the] door\" for admission of such evidence by once characterizing Colman's relationship with defendant as \"living as man and wife,\" which, defense counsel complained, \"leaves the image of a rather platonic, nice situation, which is certainly a long way from the truth of what the pictures very aptly represent.\" Defendant now claims that the trial court abused its discretion in limiting cross-examination of Colman with regard to her activities as a prostitute. (He does not challenge the ruling excluding the nude photographs.)\n\nPermitting the defense to elicit testimony from Colman that she engaged in acts of prostitution had an obvious potential for embarrassing or unfairly discrediting her. (Evid. Code, § 765.) The degrading impact of such questions has long been recognized. (See People v. Crandall (1899) 125 Cal. 129, 134 [57 P. 785].) The question faced by the trial court, then, in deciding\n\non the motion in limine, was whether the patent prejudicial impact of permitting such questioning was substantially outweighed by its probative value. (Evid. Code, § 352.) In opposing the motion, the defense suggested two ways in which Colman's testimony might be relevant. Defense counsel first suggested that it might be admissible to show the \"financial situation\" of Colman and defendant, but he quickly disclaimed any intention of \"[going] into [Colman's] life history.\" Defense counsel limited himself to trying to persuade the court that he should be allowed to elicit from Colman expected testimony that her purpose in flying to Fresno on the day of the murder was \"to work the streets\" there in order to preclude any inference by the jury that she went to Fresno pursuant to any common scheme with defendant. The prosecutor pointed out, however, that he had already indicated in his opening statement that Colman's presence in Fresno to meet defendant was a \"pure coincidence.\" (In his closing argument, the prosecutor reiterated that it was a \"sheer coincidence\" that Colman was there.) On this basis, the trial court concluded that, if the testimony were relevant at all, its prejudicial effect would \"far outweigh\" its probative value, and, accordingly, it granted the motion in limine under Evidence Code section 352.\n\nDefendant's present claims that the trial court abused its discretion in precluding inquiry regarding Colman's activities as a prostitute and her purpose in going to Fresno, are based on reasons other than those advanced by defense counsel at trial. He suggests that the defense should have been allowed to elicit Colman's testimony as to why she went to Fresno in an attempt to show that she did not actually go there for purposes of prostitution -- but rather, to meet defendant or, as suggested in defendant's reply brief, to meet Richard Graybill. Defendant's argument appears to rest on nothing more than a speculative possibility that, by vigorous cross-examination, defense counsel might have succeeded in breaking down the witness and exposing her story of going to Fresno for prostitution as a fabrication. (Cf. People v. Alfaro (1976) 61 Cal. App. 3d 414 [132 Cal. Rptr. 356].) Certainly, it appears from the arguments on the motion that defense counsel had not thought of trying to break down Colman's story (nor is it apparent from the record how he learned what her testimony would be); indeed, he seemed perfectly satisfied with that explanation and only wanted the jury to hear it too. In any event, if it was possible that Colman had another reason for going to Fresno that could have been discovered by cross-examination, defendant failed to apprise the court of this, and, in light of the obvious prejudicial effect of the expected testimony, the trial court cannot be faulted for excluding it. (People v. Burton (1961) 55 Cal. 2d 328, 344-345 [11 Cal. Rptr. 65, 359 P.2d 433]; People v. Coleman (1970) 8 Cal. App. 3d 722, 728-731 [87 Cal. Rptr. 554]; People v. Lancaster (1957) 148 Cal. App. 2d 187, 195-196 [306 P.2d 626].)\n\nThe second possible ground suggested by defendant for admitting testimony about Colman's acts of prostitution must be rejected for the same reason. He asserts that if her activities as a prostitute were directed by defendant, acting as her \"pimp,\" then that might have been a motive for giving biased, untruthful testimony, since \"many prostitutes have strong feelings of resentment and outrage against [their pimps].\" This ground of asserted relevance rests upon a speculative generalization about the relationships between prostitutes and pimps, which the trial court might well have deemed insufficient by itself to outweigh the certain prejudice that would result from admission of the testimony. Defense counsel's momentary flirtation with the notion that the testimony might be relevant to show the \"financial situation\" of Colman and defendant was surely not the same thing as suggesting that Colman had a motive for bias in her \"outrage\" against defendant. It is noteworthy in this regard that, though the prosecutor stressed that the People did not \"seek to prohibit the defendant from any relevant testimony regarding their relationship . . .\" and the court stated, in essence, that its assessment of the relevancy of Colman's activities might change depending upon defendant's other testimony, the defense made no attempt to show by defendant's testimony that the relationship between him and Colman before and at the time of the killing was anything but amicable. Moreover, since the ground asserted for admitting the testimony was not raised before the trial court, it may not be considered now for the first time. (People v. Coleman, supra, 8 Cal. App. 3d at pp. 729-731.)\n\nD. The trial court did not err in admitting a tape recording of a telephone conversation between defendant and Richard Graybill while defendant was a fugitive.\n\nDefendant contends that the admission into evidence of a tape recording of a telephone conversation between him and Richard Graybill, while defendant was a fugitive, violated his constitutional rights to freedom from unreasonable searches, privacy, and due process.\n\nThe facts were established at a hearing on defendant's motion to suppress. (§ 1538.5.) In December 1977, Graybill learned that Colman (who had lived with Graybill until she moved in with defendant) was being sought by police. A short time later, he received a telephone call from defendant. Graybill informed the Madera County Sheriff's office of the call, and agreed to try to lure defendant into a position where he could be captured. Defendant remained in telephone contact with Graybill, sometimes calling him at home and other times by prearrangement at various public telephones (in order to minimize the chances of the calls being traced). In January 1978, upon the advice of a detective, Graybill recorded a telephone conversation with defendant on his tape recorder. The tape (which was also Graybill's\n\nproperty) was subsequently admitted (in its entirety, by stipulation) against defendant at the trial.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nDefendant asks us to reconsider our holding in People v. Murphy (1972) 8 Cal. 3d 349 [105 Cal. Rptr. 138, 503 P.2d 594], which upheld against a Fourth Amendment challenge the admissibility of tape recordings of conversations, on the telephone and in-person, surreptitiously made by associates of the defendant who were acting at the direction of law enforcement officers. (Id., at pp. 358-361; see also United States v. White (1971) 401 U.S. 745 [28 L.Ed.2d 453, 91 S.Ct. 1122]; Hoffa v. United States (1966) 385 U.S. 293 [17 L.Ed.2d 374, 87 S.Ct. 408].) He criticizes as \"unpersuasive\" the rationale of cases, including Murphy, upholding the admissibility of such recordings.\n\nMurphy and the United States Supreme Court decisions upon which it relies emphasize that a defendant has no constitutionally protected expectation that his confidant will not reveal a conversation to the police, and the recording merely corroborates and assures the accuracy of the confidant's later testimony. Defendant counters that, as a practical matter, it is the witness's testimony which merely \"supplements\" the tape in most such situations. He points out that, without the tape, Graybill's credibility might have been such that the jury would not have believed this recounting of the conversation. An apt response to this argument is contained in Justice Harlan's opinion in Lopez v. United States (1963) 373 U.S. 427 [10 L.Ed.2d 462, 83 S.Ct. 1381]: \"Stripped to its essentials, petitioner's argument amounts to saying that he has a constitutional right to rely on possible flaws in the agent's memory, or to challenge the agent's credibility without being beset by corroborating evidence that is not susceptible to impeachment. For no other argument can justify excluding an accurate version of a conversation that the agent could testify to from memory. We think the risk that petitioner took in offering a bribe to [the agent] fairly included the risk that the offer would be accurately reproduced in court, whether by faultless\n\nmemory or mechanical recording.\" (Id., at p. 439 [10 L.Ed.2d at p. 471], fn. omitted; quoted in People v. Murphy, supra, 8 Cal. 3d at p. 360.)\n\nMore fundamentally, defendant objects to characterizing as merely a case of misplaced trust a situation in which an associate of the accused acts at the direction of the state. The point made in Murphy and the federal precedent is that the accused in such a case is not a passive victim of a government intrusion into his zone of privacy; rather, he has, by taking a companion into his confidence, in essence extended his zone of privacy to embrace the companion as to any confidences so disclosed. There is simply no constitutional principle that prohibits the recipient of a confidence from breaching the trust reposed in him not to disclose it to others, including the police. Murphy is in accord with settled federal statutory law (tit. III, Omnibus Crime Control and Safe Streets Act, 18 U.S.C. § 2511 (2)(c) and (d)), as well as applicable California statutes. (§ 633.)\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e We see no reason to reconsider it now.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nFinally, defendant objects to admission of the tape recording under the rationale of People v. Hitch (1974) 12 Cal. 3d 641 [117 Cal. Rptr. 9, 527 P.2d 361]. The recording begins in midsentence and Graybill admitted that he did not turn the tape recorder on until perhaps 15 seconds after the conversation had begun. Defendant contends, by analogy to Hitch, that the deputy who advised Graybill to record the telephone conversation had a duty to assure that the entire conversation was recorded, so that the recording could not be used in a misleading manner. Defendant failed to make this objection in the trial court, though, so it may not now be considered by us. (People v. Welch (1972) 8 Cal. 3d 106, 114-115 [104 Cal. Rptr. 217, 501 P.2d 225].)\n\nE. The trial court correctly admitted photographs of the murder victim.\n\nDefendant complains that certain photographs depicting the charred remains of the murder victim in the Ranchero were unduly gruesome and\n\nshould not have been admitted in light of their limited probative value. \"Admission of photos of victims lies within the discretion of the trial court unless their probative value is clearly outweighed by their prejudicial effect.\" (People v. Cruz (1980) 26 Cal. 3d 233, 253 [162 Cal. Rptr. 1, 605 P.2d 830].) Here the trial court clearly understood its duty to weigh the photographs' relevance against their tendency to prejudice the jury (compare People v. Ford (1964) 60 Cal. 2d 772, 801 [36 Cal. Rptr. 620, 388 P.2d 892]), and it excluded one of the four proffered photographs of the victim in the Ranchero as cumulative. (See People v. Haskett (1982) 30 Cal. 3d 841, 859 [180 Cal. Rptr. 640, 640 P.2d 776]; People v. Ramos (1982) 30 Cal. 3d 553, 576-577 [180 Cal. Rptr. 266, 639 P.2d 908].) We have reviewed the remaining photos and find no abuse of discretion in their admission. Defendant contends that they would have been cumulative on the issue of malice to the undisputed testimony regarding the burning of the Ranchero and the victim's body. Even so assuming, we cannot say the trial court was wrong in apparently accepting the prosecutor's argument that the position of the body in the vehicle might help the jury evaluate testimony that defendant extracted the victims' wallets and searched them and a potential issue of self-defense based on the presence of Rose's revolver in the vehicle.\n\nF. The trial court did not abuse its discretion in permitting defendant to be impeached by three prior felony convictions.\n\nDefendant contends that the trial court improperly allowed him to be impeached by the unduly cumulative admission into evidence of all three of his prior burglary convictions.\n\nThe trial court properly applied the test for admission of prior convictions for impeachment outlined in People v. Beagle, supra, 6 Cal. 3d at pages 451-454, and did not abuse its discretion in admitting the three essentially contemporaneous convictions.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e The first factor under Beagle is whether a conviction reflects adversely on the defendant's honesty or veracity. It is settled that burglaries accomplished with larcenous intent (as reflected in defendant's conviction records) may be used for this purpose. (People v. Bishop (1982) 132 Cal. App. 3d 717, 721 [183 Cal. Rptr. 414]; People v. Keating (1981) 118 Cal. App. 3d 172, 180 [173 Cal. Rptr. 286].) Further, we think the fact that defendant was convicted for burglaries in three counties more or less contemporaneously is suggestive of an ambitious premeditated dishonesty of which the court could reasonably conclude the jury ought to be aware. The other factors also point to admission. The convictions were\n\n\"comparatively recent,\" in 1976, while the instant offenses took place in 1977. There is no suggestion that the burglaries involved the sort of assaultive conduct that was central to the instant offenses, that is, they do not \"present a close analogy to the current charges.\" And, finally, defendant was not deterred from testifying, so the fourth factor identified in Beagle is inapplicable.\n\nWe are not insensitive to the concern expressed by defendant that the admission of all three burglary convictions may well have depicted him to the jury as an \"habitual offender.\" However, defendant did not object on the ground of cumulativeness, arguing only about the dissimilarity of the prior offenses to the present offenses. (People v. Welch, supra, 8 Cal. 3d at pp. 114-115.) Consequently, we are unprepared to say that the trial court abused its discretion in admitting all three prior burglary convictions, especially in view of the contemporaneity of the convictions, which might be seen as shedding light on the extent of defendant's dishonesty.\n\nG. The trial court correctly ruled that defendant had no right to refuse to testify regarding assertedly \"collateral\" areas during cross-examination.\n\nDefendant testified in his own behalf. During cross-examination, the prosecutor interrogated him extensively on his alibi and on his version of the circumstances surrounding the cocaine deal in which Bartulis and Rose were alleged participants. He refused to answer a number of these questions, initially on Fifth Amendment grounds and later, after the trial court informed him that the privilege did not apply, on the ground that he would be killed if he answered.\n\nConceding that he waived most of the protection of the privilege in taking the stand (People v. Saddler (1979) 24 Cal. 3d 671, 679 [156 Cal. Rptr. 871, 597 P.2d 130]), defendant nonetheless contends that the prosecutor's cross-examination was not properly limited to matters covered in the direct examination, but ranged far afield. Defendant refused to answer questions about the bank account into which he deposited $6,200 on the day Rose gave him $10,000 (which defendant testified he passed on to Graybill through Colman); the identities of associates with whom he met in Sacramento on the night of the murder; the source of the cocaine supply; its manner of delivery; the identity of the smuggler; the origin of the men in pinstripe suits that defendant testified provided \"security\" for his barbecue; whether the men carried machine guns; the identities of other attendees of the party; whether the cocaine transaction was completed; the means of delivery of the cocaine; its means of distribution; the location of the promissory note from Rose between the date of the murder and its delivery to\n\ndefense counsel; and the extent of defendant's personal knowledge of how murder \"contracts\" are put out.\n\nExamination of the questions which defendant refused to answer discloses that virtually all of them sought detailed information about the grandiose cocaine deal that defendant testified to on direct, with an evident and proper purpose of exposing the story as an extravagant fabrication. Other questions also came within the broad scope of permissible cross-examination. The prosecution certainly had a right to inquire about the identities of participants in the meeting in Sacramento, who were supposed witnesses to defendant's alibi. Similarly, since there was a dispute between Rose's and defendant's testimony regarding the reasons for Rose's issuance of the $25,000 promissory note, testimony concerning what happened to it while it was in defendant's custody was relevant. Finally, the question regarding defendant's knowledge concerning death \"contracts\" properly arose out of Colman's testimony that defendant told her that if Rose lived, \"he would have to try to get a contract on him.\" \"Although the permissible scope of cross-examination in California is restricted to the scope of the direct examination (Evid. Code, §§ 772, subd. (d), 761; Witkin, Cal. Evidence (2d ed. 1966) § 1204), when a defendant 'takes the stand and makes a general denial of the crime with which he is charged the permissible scope of cross-examination is very wide.' [Citations.]\" (People v. Saddler, supra, 24 Cal. 3d at p. 679.)\n\nH. The erroneous instruction on the special circumstance of murder in the commission of a robbery was harmless.\n\nDefendant contends that the trial court gave the jury an erroneous instruction on the special circumstance of murder in the commission of a robbery (former § 190.2, subd. (c)(3)(i)), which failed to apprise the jury of all the facts that must be proved to establish the existence of the special circumstance. At the time of the killing, on December 7, 1977, section 190.2 provided: \"The penalty for a defendant found guilty of murder in the first degree shall be death or confinement in the state prison for life without possibility of parole in any case in which one or more of the following special circumstances has been charged and specially found . . . to be true . . . . [ para. ] (c) The defendant was [ 1 ] personally present during the commission of the act or acts causing death, and [ 2 ] with intent to cause death [ 3 ] physically aided or committed such act or acts causing death and any of the following additional circumstances exits: . . . [ para. ] (3) [ 4 ] The murder was willful, deliberate, and premeditated and [ 5 ] was committed during the commission or attempted commission of any of the following crimes: [ para. ] (i) Robbery in violation of Section 211. . . .\" (Italics and bracketed numerals added.)\n\nRather than giving the 1977 revision of the CALJIC instruction on the special circumstance of murder in the commission of a robbery,\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e the trial court gave the jury a modified version of the 1979 CALJIC instruction, which, reflecting the changes in section 190.2 wrought by the 1978 death penalty initiative,\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e deleted most of the required findings. The trial court instructed the jury, in pertinent part: \"If you find the Defendant in this case guilty of murder of the first degree, you must then determine if the murder was committed under the following special circumstance: the murder was willful, deliberate and premeditated, and was committed during the commission or attempted commission of robbery in violation of Section 211, Penal Code. [ para. ] A special circumstance must be proved beyond a reasonable doubt. [ para. ] If you have a reasonable doubt as to whether a special circumstance is true, it is your duty to find that it is not true. [ para. ] In order to find the special circumstance charged in this case to be true or untrue, you must agree unanimously. [ para. ] You will include in your verdict on a form which will be supplied whether the special circumstance is or is not true. [ para. ] To find that the special circumstance referred to in these instructions as murder in the commission of robbery, it must be proved: That the murder was committed while the Defendant was engaged in the commission or attempted commission of a robbery.\"\n\nAlthough we agree with defendant that he was entitled to instructions on the special circumstance of murder in the commission of a robbery that apprised the jury of all of the findings required by section 190.2 as it read at the time of the offense, we conclude that the trial court's error was harmless since the jury necessarily made these findings implicitly in reaching the verdict that it did. (See People v. Sedeno (1974) 10 Cal. 3d 703, 721 [112 Cal. Rptr. 1, 518 P.2d 913]; People v. Tanner (1979) 95 Cal. App. 3d 948, 956-957 [157 P.2d 465] [erroneous instruction that intent did not matter for crime of arson was harmless since first degree murder verdicts showed finding of specific intent].)\n\nThe trial court instructed the jury that the special circumstance which it was supposed to find true or untrue was that \"[the] murder was willful,\n\ndeliberate and premeditated and was committed during the commission or attempted commission of robbery. . . .\" (Italics added.) Defendant urges, however, that the subsequent instruction -- \"[to] find the special circumstance . . . it must be proved: that the murder was committed while the Defendant was engaged in the commission or attempted commission of a robbery\" -- might have suggested to the jury that is all that must be proved, resulting in a perceived conflict in the instructions. No real occasion for confusion existed, though. The latter instruction does not say that only the fact that the murder was committed in the commission of a robbery must be proved; it merely reiterates the need for a finding that the murder was so committed. In finding that the special circumstance allegation was true, the jury specifically found \"that the murder of Bruce P. Bartulis was willfull [ sic ], deliberate and premeditated, and was personally committed by [defendant] during the commission or attempted commission of the crime of robbery. . . .\" Moreover, the prosecutor in his closing argument accurately informed the jury in this regard: \"You'll have to determine whether the special circumstance is true or not. The special circumstance alleged is that the murder was willful, deliberate and premeditated, and it was committed during the commission or attempted commission of a robbery. [ para. ] Now, in order, of course, to find that special circumstance, you have to find what is called premeditation. . . .\" It is ordinarily presumed that jurors are intelligent persons capable of understanding and correlating all jury instructions that are given. (People v. Coleman (1979) 89 Cal. App. 3d 312, 323 [152 Cal. Rptr. 407]; People v. Romo (1975) 47 Cal. App. 3d 976, 990 [121 Cal. Rptr. 684].)\n\nDefendant is correct, though, when he complains that the jury was not apprised by the instructions that the special circumstance of murder in the commission of a robbery also required proof that (1) he was \"personally present\" when the murder was committed, (2) he \"physically aided or committed\" the killing, and (3) he did so \"with intent to cause death.\" Nevertheless, this error was harmless because the jury necessarily resolved each of the foregoing issues adversely to defendant. As previously noted, the jury's special finding expressly states that the murder \"was personally committed by [defendant] . . .,\" and the jury also found to be true the allegation that defendant \"personally [used] a firearm\" in the commission of the murder. These findings necessarily reflect the jury's conclusions that defendant was personally present during the commission of the murder and that he \"physically aided or committed\" the killing. Despite the lack of a proper instruction, the jury's explicit findings that defendant \"personally committed\" the murder, and used a firearm in doing so, render fantastic, not merely \"improbable,\" defendant's speculation that the jury might have believed that Colman did the shooting and defendant was merely a passive accomplice who armed himself later during the asportation of the victims' wallets.\n\nFinally, though the first degree murder verdict does not by itself show that the jury determined that defendant intended to cause Bartulis's death, since it may have been based on a felony-murder theory, the special finding that the murder was willful, deliberate and premeditated does. Those terms were defined in the instructions on first degree murder:\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e \"The word 'willful,' as used in this instruction, means intentional. [ para. ] The word 'deliberate' means formed or arrived at or determined upon as a result of careful thought and weighing of considerations for and against the proposed course of action. The word 'premeditated' means considered beforehand. [ para. ] If you find that the killing was preceded and accompanied by a clear, deliberate intent on the part of the defendant to kill, which was the result of deliberation and premeditation, so that it must have been formed upon pre-existing reflection and not under a sudden heat of passion or other condition precluding the idea of deliberation, it is murder of the first degree. [ para. ] The law does not undertake to measure in units of time the length of the period during which the thought must be pondered before it can ripen into an intent to kill which is truly deliberate and premeditated. The time will vary with different individuals and under varying circumstances. [ para. ] The true test is not the duration of time, but rather the extent of the reflection. A cold, calculated judgment and decision may be arrived at in a short period of time, but a mere unconsidered and rash impulse, even though it includes an intent to kill, is not such deliberation and premeditation as will fix an unlawful killing as murder of the first degree. [ para. ] To constitute a deliberate and premeditated killing, the slayer must weigh and consider the question of killing and the reasons for and against such a choice and, having in mind the consequences, he decides to and does kill.\" (Italics added.) Thus, to commit a \"willful\" murder, the actor must possess an intent to kill. (People v. Gorshen (1959) 51 Cal. 2d 716, 730 [336 P.2d 492].) It has been held that a determination that a killing was deliberate and premeditated is not the equivalent of a finding of malice. (Id., at pp. 731-733; People v. Horn (1974) 12 Cal. 3d 290, 298 [115 Cal. Rptr. 516, 524 P.2d 1300]; People v. Sedeno, supra, 10 Cal. 3d at p. 722.) Here, though, we are concerned only with intent to kill. That a jury verdict of willful, deliberate and premeditated murder necessarily embraces such a finding was recognized in People v. Sedeno, supra, \"In Sedeno, the trial court erred in failing to give an instruction sua sponte on involuntary manslaughter due to diminished capacity. (10 Cal. 3d at p. 720.) Such an instruction would have required the jury to specifically determine whether the accused had acted without an intent to kill and malice. The error was harmless as to the question of the intent to kill because the jury had received instructions on second degree murder without\n\nan intent to kill and had specifically and necessarily rejected that theory by returning a verdict of first degree murder. (Id., at p. 721.)\" (People v. Wickersham (1982) 32 Cal. 3d 307, 335-336 [185 Cal. Rptr. 436, 650 P.2d 311], italics added.)\n\nI. The trial court was not required to instruct the jury sua sponte concerning the \"incidental robbery\" theory.\n\nDefendant argues that the special circumstance finding must be reversed because the trial court failed to instruct the jury sua sponte that the special circumstance of murder \"in the commission of a robbery\" does not apply to a murder accompanied by an \"incidental\" robbery, as was held in People v. Green (1980) 27 Cal. 3d 1, 61-62 [164 Cal. Rptr. 1, 609 P.2d 468]. It was not conceivable in this case that the jury might have found evidence to support a finding that the victims' wallets were taken only to hide their identities. On the facts presented here, Green's \"incidental robbery\" doctrine cannot properly be characterized as a general principle of law \"closely and openly connected with the facts before the court\" from which a sua sponte duty to instruct could arise. (See People v. Robertson (1982) 33 Cal. 3d 21, 52 [188 Cal. Rptr. 77, 655 P.2d 279]; People v. St. Martin (1970) 1 Cal. 3d 524, 531 [83 Cal. Rptr. 166, 463 P.2d 390]; People v. Sedeno, supra, 10 Cal. 3d at p. 720.)\n\nJ. Defendant was not deprived of the effective assistance of counsel at the guilt phase.\n\nDefendant raises several unrelated contentions concerning claimed ineffectiveness of his trial counsel during the guilt phase of his trial. To establish constitutionally inadequate representation, defendant must show that defense counsel failed to act in a manner to be expected of reasonably competent attorneys acting as diligent advocates, and that (1) counsel's acts or omissions resulted in the withdrawal of a potentially meritorious defense, or (2) it is reasonably probable that a determination more favorable to defendant would have resulted in the absence of counsel's failings. (People v. Pope (1979) 23 Cal. 3d 412, 425 [152 Cal. Rptr. 732, 590 P.2d 859, 2 A.L.R.4th 1]; People v. Fosselman (1983) 33 Cal. 3d 572, 584 [189 Cal. Rptr. 855, 659 P.2d 1144].) He has not succeeded in doing so.\n\nWe have already concluded that the error in instructing the jury on the special circumstance of murder in the commission of a robbery was harmless. Consequently, defense counsel's failure to bring the correct instruction to the attention of the court did not withdraw a potentially meritorious defense.\n\nAnticipating a holding that his failure to move to set aside the information under section 995 barred his claim of ineffective assistance of counsel at the\n\npreliminary hearing (as indeed we have concluded, ante), defendant contends that reasonably competent counsel would have made such a motion. The record shows that defendant, with knowledge of the conflict, chose to be represented at the preliminary hearing by the public defender, and sought other counsel only at a later stage. Even assuming that defendant's silence at the June 21, 1979, hearing is not sufficient to constitute an effective waiver, we cannot exclude the strong possibility that counsel simply decided as a tactical matter that nothing would be served by going through another preliminary hearing (particularly in light of the strength of the evidence upon which defendant was held to answer) and bringing about further delay of the trial. Where tactical considerations might explain counsel's omission, and the record does not illuminate its basis, a claim of ineffective assistance of counsel is more appropriately made in a petition for habeas corpus. (People v. Pope, supra, 23 Cal. 3d at p. 426.)\n\nDefendant also challenges his counsel's asserted failure to adequately cross-examine Colman. He suggests that his counsel demonstrated his incompetence by failing to suggest to the court valid grounds for admitting testimony about Colman's activities as a prostitute and her reasons for going to Fresno on the day of the murder. Again, it appears that tactical reasons might well explain the attorney's decision not to assert the grounds now suggested. For example, a tactical reason certainly can be inferred for counsel's failure to seek to extract from Colman testimony that her real reason for flying to Fresno was to meet defendant pursuant to a plan to kill Rose and Bartulis. In any case, evidentiary objections (and, inferentially, arguments in support of the admission of evidence) are generally matters of tactics properly reviewed by habeas corpus. (See People v. Lanphear (1980) 26 Cal. 3d 814, 828 [163 Cal. Rptr. 601, 608 P.2d 689].)\n\nDuring his cross-examination of Colman, defense counsel asked her if she were testifying with the knowledge that everything she said that day could be used against her. Colman responded that she knew her attorney would be there to represent her when she went to court in February. Defendant now claims that his counsel should have asked Colman whether she gave the prosecution a statement under an informal agreement that \"the statement could never be used against her and in the prosecution of her,\" notwithstanding her testimony at the preliminary hearing that she had not been promised any immunity by the district attorney's office. Defendant's argument appears to be based on a faulty premise that if Colman repeated essentially the same story at the trial as she did in her statement for the prosecutor, the trial testimony could not be used against her. There is nothing in the record to support such an interpretation of the purported agreement.\n\nFinally, defendant contends that competent counsel would have cross-examined Colman more closely about what might have happened to the gasoline can which she and Rose testified defendant emptied over the Ranchero and its occupants. Colman testified that she did not see it when defendant returned to the car, and no can was found at the scene. Moreover, the gas cap of the Ranchero was found lying in the trunk, leading investigators at first to believe that the gasoline poured into the passenger compartment might have been siphoned out of the gas tank. A siphon hose was evidently found in the vicinity. Again, the record does not preclude a possible tactical reason for not pursuing the question further. By accepting Colman's lack of an explanation for the discrepancy, defense counsel preserved an occasion for argument to the jury against the credibility of Colman's story and in favor of the existence of some alternative explanation: \"Gas cans don't disappear. . . . [ para. ] [The police] did find that the siphoning hose and the gas cap of the pickup was off. I expect that the siphon hose is very significant and the gas cap being off, and those are an indication of the premeditation by whom ever [ sic ] was there.\" In any event, it is impossible to determine from the record whether any further cross-examination might have extracted any different testimony from the witness, who claimed, simply, that she did not know what happened to the can. Again, the proper avenue for reviewing this claim of inadequacy, based on matters of tactical choice, is habeas corpus.\n\nII. Penalty Phase\n\nAt the penalty phase proceedings, all of the evidence introduced by the prosecution related to the aggravating factor of other \"criminal activity.\" (Former § 190.3, subd. (b).)\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e Richard Graybill, defendant's former friend, testified about three incidents that allegedly fell into this category: (1) the \"CW murder plan,\" a plan fabricated by the police and Graybill, in which defendant ostensibly agreed to return to California to kill a person who had \"snitched\" on Graybill in the past; (2) the \"solder plan,\" in which defendant told Graybill that he intended to obtain money some time in the future by borrowing $45,000 against a load of solder he had stolen and thereafter killing the people who loaned him the money; and (3) the \"industrial burglary plan,\" in which defendant asked Graybill to help him rob a supply shop and told Graybill that he -- defendant -- would kill the security guard. In addition to Graybill's testimony, the prosecution introduced two letters\n\nwritten by defendant from the Utah jail, in which defendant ostensibly solicited criminal acts against (1) an accountant and (2) four witnesses who were to testify for the prosecution in this case, including defendant's own mother. The prosecution presented no other evidence at the penalty phase.\n\nIn his closing argument, the prosecution stated that the jury should consider, as aggravating factors warranting imposition of the death penalty, both this evidence of other criminal activity and \"the nature and circumstances of the present offense.\" (Former § 190.3, subd. (a).) Defense counsel presented no evidence in mitigation, but asked the jury to re-examine its verdict of guilt and give defendant the benefit of any lingering reservations.\n\nA. The trial court had no duty to give a clarifying instruction on what is meant by \"the nature and circumstances of the present offense\" as a factor in deciding whether to impose the death penalty.\n\nFormer section 190.3 provided that \"[in] determining the penalty the trier of fact shall take into account any of the following factors if relevant: [ para. ] (a) The circumstances of the crime of which the defendant was convicted in the present proceeding and the existence of any special circumstances found to be true . . . .\"\n\nThe jury was accordingly instructed: \"In determining which penalty is to be imposed on the Defendant, you shall consider all the evidence which has been received during any part of the trial of this case, except as you may hereafter be instructed. [ para. ] You shall consider, take into account, and be guided by the following factors if applicable: [ para. ] (a) The circumstances of the crime of which the defendant was convicted in the present proceeding and the existence of any special circumstances found to be true. . . .\"\n\nIn his closing argument, the prosecutor assured the jurors that \"it's perfectly proper and appropriate for you to consider the horrible manner in which the Defendant executed one victim and tried to execute the other.\" A little later, he told them: \"Now with regard to the circumstances of the crime, as I say, you can consider the manner in which the crime was executed; you can consider the fact that the Defendant shot down a 26 year old victim, Bruce Bartulis, who was in the prime of his life. You can consider that the man's life was snuffed out for money . . . .\"\n\nWithout citation to authority, defendant suggests that the trial court had a sua sponte duty to give the instruction on \"the nature and circumstances of the present offense\" a clarifying gloss to inform the jury that its penalty determination must not be based on facts that are \"common to all homicides.\" Permitting the consideration of such factors, defendant\n\nargues, may result in \"irrational\" decisions based on the jurors' \"emotional reaction to the facts of death alone.\" The jury's decision, defendant insists, \"should be made on the basis of the unique characteristics of the case before the court . . . .\"\n\nDefendant's argument reveals a basic misunderstanding of the process by which the law supposes the jury will determine the appropriate penalty. The factors outlined in the death penalty statute\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e guide the jury in answering basically two questions: (1) is it the \"community's belief that [the crime is] so grievous an affront to humanity that the only adequate response may bethe penalty of death?\" (quoting Gregg v. Georgia (1976) 428 U.S. 153, 184 [49 L.Ed.2d 859, 880-881, 96 S.Ct. 2909] (plur. opn.)); and (2) if so, are there nevertheless \"aspects of the defendant's character and record . . . which may call for a less severe penalty?\" (Gillers, Deciding Who Dies (1980) 129 U.Pa.L.Rev. 1, 56, quoting Lockett v. Ohio (1978) 438 U.S. 586, 605 [57 L.Ed.2d 973, 990, 98 S.Ct. 2954] (plur. opn.).) While the penalty determination is ultimately dependent on the individual circumstances of a case, the fact that the defendant's crime was to kill another human being cannot comprehensibly be withdrawn from the jury's consideration in determining how \"grievous an affront to humanity\" was committed by the defendant.\n\nIf defendant is arguing that the prosecutor's comments encouraged the jury to give inordinate attention to the victim's youth and the \"horrible manner in which the Defendant executed one victim and tried to execute the other,\" then that argument, too, must be rejected on the ground that defendant waived any such objection by his failure to object and seek an admonition when the comments were made. (People v. Green, supra, 27 Cal. 3d at p. 34.)\n\nB. The trial court erred in failing to give a reasonable doubt instruction in regard to evidence of other \"criminal activity.\"\n\nAt the conclusion of the penalty phase, the trial court instructed the jury that, in determining which penalty to impose on the defendant, it should take into account the aggravating and mitigating factors enumerated in former section 190.3, including subdivision (b): \"The presence or absence of criminal activity by the defendant which involved the use or attempted use of force or violence or the expressed or implied threat to use force or violence.\"\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e The criminal activity to be considered under this provision does not include \"[the] circumstances of the crime of which the defendant was convicted in the present proceeding . . . .\" (Former § 190.3, subd. (a).)\n\nThe jurors were not told that they could consider evidence of other criminal activity (former § 190.3, subd. (b)) only if they found \"beyond a reasonable doubt\" that defendant had engaged in such activity. This omission was error under People v. Robertson, supra, 33 Cal. 3d at pp. 53-55, 60-62 and People v. Stanworth (1969) 71 Cal. 2d 820, 840-841 [80 Cal. Rptr. 49, 457 P.2d 889]. Before determining the scope and effect of this error, however, it is necessary to determine what conduct the jury may have considered to be other \"criminal activity\" under former section 190.3, subdivision (b).\n\nC. Other \"criminal activity\" under former section 190.3, subdivision (b) must demonstrate a violation of a penal statute.\n\nIn his closing argument at the penalty phase, the prosecutor presented those aggravating factors set forth in former section 190.3 that provided the basis on which he believed the jury should return a verdict of death. With respect to former section 190.3, subdivision (b), the prosecutor told the jury it could consider evidence of three separate incidents of other \"criminal activity.\" These incidents and the evidence upon which they were based are: (1) the tape recording of a telephone conversation between defendant and Graybill, admitted during the guilt phase, in which defendant agreed to execute a plan with Graybill to murder \"CW\" (Don Hunsucker) (hereafter \"CW Murder Plan\"); (2) the penalty phase testimony of Graybill that defendant asked him to help in the burglary of a supply shop in San Jose, during which defendant would kill the security guard (\"Industrial Burglary\n\nPlan\"); and (3) a letter introduced at the penalty phase, written to Bill Moyes by defendant while in a Utah jail awaiting extradition to California, in which defendant sought the apparent murder of four people who later testified against defendant at trial -- Rose, Graybill, Colman, and defendant's mother.\n\nIn addition to these three incidents, the prosecutor introduced at the penalty phase evidence of: (1) another letter written by defendant while in the Utah jail awaiting extradition to California, in which defendant asked Bill Moyes to abduct, beat, and threaten \"the accountant\" to obtain $15,000; and (2) the testimony of Graybill that defendant told him that upon release from prison he would use a truck load of solder he had stolen as collateral for a $45,000 loan and would then kill the people who lent him the money (\"Solder Plan\"). While the prosecutor did not argue to the jury that these incidents constituted evidence of other criminal activity under former section 190.3, subdivision (b),\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e he had previously served notice on defendant that this was the basis upon which he would introduce this penalty phase evidence.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nDefendant contends that many of these alleged activities could not properly be considered by the jury as evidence of other criminal activity under former section 190.3, subdivision (b), because the evidence presented did not demonstrate the commission of actual crimes.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e In answer, respondent asserts that evidence of other criminal activity need not amount to an actual crime in order to be admissible as an aggravating factor. Accordingly, we first address the issue of what conduct may properly be considered as other criminal activity under former section 190.3, subdivision (b).\n\nDefendant relies on the language and implicit rulings of past cases, decided before the enactment of the 1977 death penalty statute, to support his contention that evidence of other \"criminal activity\" admitted pursuant to former section 190.3, subdivision (b), must demonstrate the actual commission of a crime. The People argue that the Legislature's choice of terminology\n\n-- specifically, \"criminal activity,\" rather than \"prior crimes\" or \"other crimes,\" the language of relevant past judicial decisions -- demonstrates that evidence of other criminal activity need not amount to the actual commission of a crime to be admissible as an aggravating factor under the statute. The legislative history does not support respondent's position that the Legislature intended to depart from the precedent of these decisions. Rather, as we discuss below, the history of former section 190.3, subdivision (b), demonstrates only that the Legislature's choice of terms was intended to be sufficiently broad to include crimes for which the defendant has not been convicted.\n\nIt was not until 1957 that separate procedures were established to determine guilt and penalty in death penalty cases. (Stats. 1957, ch. 1968, § 2, pp. 3509-3510, amending § 190, as amended by the Amendments to the Codes 1873-1874, ch. 508, pp. 457-458.)\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e Former section 190.1, establishing these procedures, provided in relevant part: \"Evidence may be presented at the further proceedings on the issue of penalty, of the circumstances surrounding the crime, of the defendant's background and history, and of any facts in aggravation or mitigation of the penalty.\"\n\nThis provision was interpreted to include defendant's \"prior\" or \"other\" crimes. (See People v. Jones, supra, 52 Cal. 2d at pp. 647-648 [\"other crimes\"]; People v. Robillard (1960) 55 Cal. 2d 88, 100 [10 Cal. Rptr. 167, 358 P.2d 295, 83 A.L.R.2d 1086] [\"prior crimes\"]; People v. Bentley (1962) 58 Cal. 2d 458, 460-461 [24 Cal. Rptr. 685, 374 P.2d 645] [\"crimes\" committed after the murder]; and People v. Pike (1962) 58 Cal. 2d 70, 94-95 [22 Cal. Rptr. 664, 372 P.2d 656] [\"another offense\"] [each of these\n\ncases basing this interpretation of former § 190.1 on the language of the statute]; see also People v. Hamilton (1963) 60 Cal. 2d 105, 129 [32 Cal. Rptr. 4, 383 P.2d 412] [\"prior crimes\"]; People v. Terry, supra, 61 Cal. 2d at pp. 143-144 [\"criminal acts\"]; People v. Mitchell (1966) 63 Cal. 2d 805, 815-817 [48 Cal. Rptr. 371, 409 P.2d 211] [\"other crimes,\" \"other offenses\"]; and People v. Tolbert (1969) 70 Cal. 2d 790, 813 [76 Cal. Rptr. 445, 452 P.2d 661] [\"prior crimes\"] [each case relying on the above-noted prior case law interpreting section 190.1 to permit proof of other crimes during the penalty phase].)\n\nThe trial court had no sua sponte duty to instruct the jury about the elements of all of the crimes that may have been introduced at the penalty phase. (People v. Tahl (1967) 65 Cal. 2d 719, 736-738 [56 Cal. Rptr. 318, 423 P.2d 246]; People v. Nye (1969) 71 Cal. 2d 356, 367 [78 Cal. Rptr. 467, 455 P.2d 395].) However, the court had to instruct the jury that it could \"consider evidence of other crimes only when the commission of such other crimes is proved beyond a reasonable doubt.\" (People v. Stanworth, supra, 71 Cal. 2d at p. 840; see also People v. McClellan (1969) 71 Cal. 2d 793, 804-805 [80 Cal. Rptr. 31, 457 P.2d 871], and cases cited therein.) Evidence of other crimes could be introduced in the penalty phase even if the defendant had not been convicted of the crimes. (People v. Mitchell, supra, 63 Cal. 2d at pp. 815-816; see also People v. Ketchel (1963) 59 Cal. 2d 503, 542 [30 Cal. Rptr. 538, 381 P.2d 394]; People v. Tahl, supra, 65 Cal. 2d at p. 734; People v. Nye, supra, 71 Cal. 2d at pp. 366-367.)\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nIn the absence of a waiver (see, e.g., People v. Jones, supra, 52 Cal. 2d at pp. 646-647), the admissibility of evidence of other crimes uniformly depended on whether the evidence was competent and relevant (see People v. Terry, supra, 61 Cal. 2d at pp. 144-145, and cases cited therein), and, most significant to the present discussion, sufficient to demonstrate the commission of actual crimes. While the latter requirement was never articulated as such, it is clear from the evidence of \"other crimes\" deemed properly admissible under former section 190.1.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e Evidence that defendant planned\n\nor intended to commit another crime was held admissible under former section 190.1 as relevant to defendant's state of mind, demonstrating a lack of guilt or remorse, but not as evidence of another crime. (People v. Tahl, supra, 65 Cal. 2d at p. 735.)\n\nThe status and procedures of the California death penalty subsequently underwent substantial change, most of which is irrelevant to our present discussion.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e In 1977, the Legislature enacted the death penalty statute which is under our present scrutiny. (Stats. 1977, ch. 316, §§ 4-14, pp. 1256-1262.) The 1977 statute provides in relevant part: \"§ 190.3. If the defendant has been found guilty of murder in the first degree, and a special circumstance has been charged and found to be true . . . the trier of fact shall determine whether the penalty shall be death or life imprisonment without possibility of parole. In the proceedings on the question of penalty, evidence may be presented by both the people and the defendant as to any matter relevant to aggravation, mitigation, and sentence, including, but not limited to, the nature and circumstances of the present offense, the presence or absence of other criminal activity by the defendant which involved the use or attempted use of force or violence or which involved the expressed\n\nor implied threat to use force or violence, and the defendant's character, background, history, mental condition and physical condition.\n\n\"However, no evidence shall be admitted regarding other criminal activity by the defendant which did not involve the use or attempted use of force or violence or which did not involve the expressed or implied threat to use force or violence. As used in this section, criminal activity does not require a conviction.\n\n\"However, in no event shall evidence of prior criminal activity be admitted for an offense for which the defendant was prosecuted and was acquitted. . . .\n\n\". . . .\n\n\"In determining the penalty the trier of fact shall take into account any of the following factors if relevant:\n\n\". . . .\n\n\"(b) The presence or absence of criminal activity by the defendant which involved the use or attempted use of force or violence or the expressed or implied threat to use force or violence.\"\n\nThis language underwent several changes prior to its adoption. Respondent contends that these changes evidence a legislative intent that former section 190.3 \"go beyond\" former section 190.1 to include what might not amount to a crime per se. We disagree. Rather, these changes merely demonstrate a legislative intent to include crimes for which a capital defendant has not been convicted.\n\nAs originally drafted, section 190.3 of Senate Bill No. 155 (introduced in the Senate on Jan. 19, 1977) provided in pertinent part: \"In the proceedings on the question of penalty, evidence may be presented by either the people or the defendant as to . . . the defendant's prior criminal activity. . . . In determining the penalty the trier of fact shall take into account any of the following factors if relevant: (a) The presence or absence of prior criminal activity by the defendant.\" (Italics added.)\n\nThe section was subsequently amended in the Senate, on March 10, 1977, to render admissible only evidence of defendant's \" prior convictions . . . for felonies involving the use or threat of force or violence against the person of another.\" (Italics added.) As amended March 24, 1977, this evidence was characterized as \" significant prior criminal activity,\" defined as\n\n\" a conviction for a felony involving the use or threat of force or violence against the person of another.\" (Italics added.) The bill passed the Senate in this form.\n\nFollowing the passage of Senate Bill No. 155 in the Senate, section 190.3 was amended in the Assembly to delete any requirement of a felony conviction and to refer simply to \" criminal activity by the defendant which involved the use or attempted use of force or violence or the expressed or implied threat to use force or violence.\" (As amended Apr. 13, 1977, italics added.)\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nThe section was subsequently amended in the Assembly, on April 28, 1977, to add: \"However, no evidence shall be admitted regarding other criminal activity by the defendant which did not involve the use or attempted use of force or violence or which did not involve the expressed or implied threat to use force or violence. As used in this section, criminal activity does not require a conviction.\" (Italics added.) On May 9, 1977, the Assembly finally amended section 190.3 to add: \"However, in no event shall evidence of prior criminal activity be admitted for an offense for which the defendant was prosecuted and was acquitted.\" Senate Bill No. 155 was passed in this form on August 11, 1977, over the Governor's veto.\n\nThis legislative history demonstrates a refinement of the term \"criminal activity\" to include more than a capital defendant's prior felony convictions, but not so broad as to include offenses for which the defendant has been acquitted.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e While the term is clearly meant to include misdemeanor as well as felony offenses involving the use or attempted use of force or violence, or the expressed or implied threat to use force or violence, the legislative history does not indicate an intent to include nonoffenses for\n\nwhich the defendant could not even be tried. The inclusion of nonoffenses as \"criminal activity\" under former section 190.3 would allow the prosecutor unfettered discretion in the selection of evidence to present to the penalty phase jury and would render superfluous the statute's use of the word \"criminal\" to modify \"activity.\" Accordingly, the only reasonable interpretation is that the statute limits admissibility to evidence that demonstrates the commission of an actual crime, a requirement easily verified under the definitional guidelines established by legislative bodies in this and other jurisdictions.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e Significantly, this court has consistently applied this interpretation not only in pre-1977 cases, but also in our review of death penalty cases tried under the 1977 legislation. (See People v. Harris (1981) 28 Cal. 3d 935, 962-963 [171 Cal. Rptr. 679, 623 P.2d 240] [possession of deadly weapons by jail inmates; violation of § 4574]; People v. Easley (1983) 34 Cal. 3d 858, 868, 885 [196 Cal. Rptr. 309, 671 P.2d 813] [arson for hire; § 653f]; see also People v. Boyd (1985) 38 Cal. 3d 762 [215 Cal. Rptr. 1, 700 P.2d 782] [1978 death penalty initiative; attempted robbery].)\n\nWe therefore conclude that evidence of other criminal activity introduced in the penalty phase pursuant to former section 190.3, subdivision (b), must be limited to evidence of conduct that demonstrates the commission of an actual crime, specifically, the violation of a penal statute. (See fn. 25.) In light of this conclusion, we consider whether a number of incidents, relied on by the prosecution as instances of \"criminal activity,\" properly qualified as an aggravating factor under former section 190.3, subdivision (b).\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\n(a) \" CW Murder Plan.\"\n\nThe prosecutor told the jury that it could consider as evidence of other criminal activity under former section 190.3, subdivision (b), \"the matter of the CW Murder Plan. That is to say, the plan whereby Mr. Graybill, acting in cooperation with law enforcement people, attempted to lure the defendant back to California by a scheme wherein the defendant was planning to go ahead and murder someone.\" As noted earlier, this evidence of a feigned scheme in which Graybill asked defendant to murder \"CW\" was contained in a tape recording of a telephone conversation between defendant and Graybill, admitted during the guilt phase at defendant's request. (See fn. 5, ante.)\n\nThe People concede \"that since Graybill was a feigned accomplice or the equivalent, appellant's agreeing to come to Fresno to commit a murder for Graybill, a murder neither Graybill nor the authorities were going to permit, did not constitute a crime.\" Respondent correctly interprets applicable law.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e Accordingly, the \"CW Murder Plan\" was improperly presented to the jury as evidence of other criminal activity.\n\n(b) \" The Solder Plan.\"\n\nAt the penalty phase, Graybill testified that defendant had told him that upon his release from prison he would use a truck load of solder he\n\nhad stolen as collateral for a $45,000 loan and would then kill the people who had lent him the money. The prosecutor had previously notified defendant and the trial court that he would introduce evidence of this plan at the penalty phase as evidence of other criminal activity. (Former § 190.3, subd. (b).) In his argument to the jury, however, the prosecutor appeared to be arguing that this plan was part of the circumstances of the instant crime. (Former § 190.3, subd. (a).)\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\n\nThe prosecution's assertion that this evidence comes within the circumstances of the instant crime is simply without factual support in the record. Moreover, as respondent concedes, this evidence fails to demonstrate the commission of a crime. Accordingly, the evidence was inadmissible under either subdivision (a) or subdivision (b) of former section 190.3.\n\n(c) \" Industrial Burglary Plan.\"\n\nGraybill testified at the penalty phase that defendant had asked him to help in the burglary of a supply shop in San Jose. When Graybill expressed concern about the shop's security guard, defendant said not to worry, that he would kill the guard. The prosecutor told the jury that it could consider as evidence of other criminal activity under former section\n\n190.3, subdivision (b) \"the defendant's indication to Mr. Graybill that during a proposed burglary in San Jose, he would remove the potential danger of the security guard by killing him.\"\n\nWhile not characterized as such by the prosecution, this evidence could constitute a criminal solicitation in violation of section 653f, subdivision (a) and/or (b),\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e if \"proved by the testimony of two witnesses, or of one witness and corroborating circumstances.\" (§ 653f, subd. (d).) However, since Graybill's testimony alone is insufficient to prove the commission of the crime, this evidence was improperly admitted by the trial court, and therefore improperly considered by the penalty jury, as evidence of other criminal activity.\n\n(d) Letter seeking apparent murder of four prosecution witnesses.\n\nThe prosecution introduced into evidence at the penalty phase copies of two letters (exhibits 19 and 20) written by defendant while incarcerated in the county jail in Salt Lake City, Utah before being returned to California to face trial. Attached to the copies of the letters were photocopies of the envelopes in which the original letters had been contained, bearing defendant's name and address as the return addressee. Since defendant had been classified as an escape risk and a dangerous inmate, his letters were opened by a jail employee and photocopied before being mailed. Only one of the two letters presented during the penalty phase was explicitly characterized by the prosecutor to the jury as evidence of other criminal activity under former section 190.3, subdivision (b). This letter (exhibit 20) contained apparent solicitations of the murders of Rose, Colman, Graybill, and defendant's mother, Barbara Hollingshead. Solicitation of murder is a crime under section 653f, subdivision (b), even though the solicitation is made by a person who is outside of California (§ 778b). Defendant's second letter (exhibit 19), discussed below, though not explicitly referred to by the prosecution as evidence of other criminal activity, solicited the kidnaping, beating, and extortion of \"the accountant\" in violation of section 653f, subdivision (a).\n\nSection 653f, subdivision (d), requires that a criminal solicitation be \"proved by the testimony of two witnesses, or of one witness and corroborating circumstances.\" This requirement \"has been regarded as requiring at least one witness who gives 'positive' or 'direct' evidence of facts\n\nthat are incompatible with innocence, and corroborating evidence of circumstances which, independent of the direct evidence, tend to show guilt. [Citations.]\" (2 Witkin, Cal. Crimes (1963) § 856, p. 803.) Here, the testimony of the only witness, an employee of the Utah County jail, was limited to establishing the authenticity of the copies of defendant's letters.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e The authenticity of a writing is a preliminary fact that must be proven before proffered evidence is admissible. (Evid. Code, § 403, subd. (a)(3).) Since the county jail employee's testimony was solely limited to establishing this preliminary fact, it cannot constitute positive or direct evidence of defendant's alleged criminal solicitation.\n\nIn this case, however, we do have \"the testimony . . . of one witness and corroborating circumstances\" as required by section 653f, subdivision (d). The introduction of defendant's jailhouse letter (exhibit 20) effectively rendered defendant \"a witness\" within the meaning of the provision, who provided direct \"testimony\" about the crime of solicitation. The purpose of section 653f, subdivision (d) is to guard against convictions for solicitation based on the testimony of one person who may have suspect motives. The danger that the statute guards against is not present, however, when the accused himself provides evidence of the alleged crime and independent circumstances corroborate this evidence.\n\nExamination of the letter's content shows that defendant's letter on its face is somewhat ambiguous as to the conduct it solicits.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e However, several\n\nexternal factors serve as sufficient evidence from which the jury could have found that the letter constituted a solicitation of murder. At the time the letter was written, defendant was incarcerated in a Utah jail awaiting extradition to California to stand trial for the attempted murder of Ron Rose and the murder of Rose's friend and companion, Bruce Bartulis. Since Rose would be able to testify about these events in detail, defendant had a strong motive to kill Rose, more specifically, to succeed at what he had previously attempted. As Colman testified, defendant had expressed an intent to \"get a contract\" on Rose if he lived. Defendant also had strong motives for killing the others listed in his letter. Graybill, a long-time friend of defendant, and Colman, defendant's girlfriend and companion at the time of the murders, had both decided to cooperate with law enforcement and the prosecution in an effort to arrest and convict defendant. As previously noted, Colman cooperated with law enforcement notwithstanding defendant's statement to her that \"she would not be dumb enough to cross him . . . because if he was in a situation where he couldn't get to [her], that he would have somebody else that could.\" Finally, Hollingshead, defendant's mother, was at home when defendant arrived with Colman after the commission of the crimes. Perhaps as defendant feared, Hollingshead's testimony at trial contradicted that of defendant.\n\nIt was therefore clearly in defendant's interests to eliminate all of these witnesses before they had a chance to testify at his trial. The fact that the proposed victims were all potential witnesses against defendant in the imminent capital trial, combined with the evidence of defendant's earlier threats against some of these same witnesses, provided adequate independent corroboration to satisfy the requirements of section 653f, subdivision (d). In light of defendant's apparent motive, the letter's directions to \"knock out,\" \"nail\" and \"blast\" these witnesses tend to support the conclusion that defendant was seeking their murder. This evidence also supports the requisite element of specific intent to kill or express malice. (See People v. Bottger (1983) 142 Cal. App. 3d 974, 980-982 [191 Cal. Rptr. 408]; People v. Gordon (1975) 47 Cal. App. 3d 465, 472 [120 Cal. Rptr. 840].)\n\nWe next address defendant's challenges to the admissibility of both his letters. Defendant first asserts that the letters are inadmissible because (1)\n\nthe copies of both letters were so illegible that they could not properly be authenticated (Evid. Code, § 1400) and therefore did not constitute relevant evidence (id., § 350); and (2) alternatively, that he was denied effective assistance of counsel (People v. Pope, supra, 23 Cal. 3d 412) by his attorney's failure to object to the admission of his letters on the ground that their illegibility caused their probative value to be outweighed by their prejudicial effect. (Evid. Code, § 352). These contentions are without merit.\n\nIn determining the admissibility of a \"writing\" (Evid. Code, § 250) based on its legibility, the writing \"need not be completely intelligible . . . as long as enough is intelligible to be relevant without creating an inference of speculation or unfairness.\" (People v. Demery (1980) 104 Cal. App. 3d 548, 559 [163 Cal. Rptr. 814].)\n\nWhile reproduction of defendant's letters rendered some words in both letters illegible, these words are few and their meaning not critical for understanding either letter. All of the pages of each letter are included, and defendant's handwriting is generally legible. We do not consider it significant that the trial court clerk, in reading the letters aloud to the jury, omitted certain words that appear to be legible, since copies of both letters were distributed to each juror.\n\nIn exhibit 20, the illegible words are primarily limited to the physical descriptions of Colman, Rose and Rose's wife. No illegible words are contained in the letter's references to Graybill or Hollingshead, nor are any contained in the directions about what is to be done to each proposed victim. (See fn. 30, ante.) The illegible words constitute less than 2 percent of exhibit 20. (Cf., People v. Stephens (1953) 117 Cal. App. 2d 653, 661 [256 P.2d 1033] [approximately 50 percent of tape recordings unintelligible].)\n\nSimilarly, the illegible words in exhibit 19 constitute less than 10 percent of the letter. While some of these words are contained in defendant's directions about what to do to the \"accountant,\" their omission does not affect the letter's clear meaning. (See fn. 32, post.)\n\nWe therefore conclude that the illegible aspects of exhibits 19 and 20 did not create any \"inference of speculation or unfairness\" (People v. Demery, supra, 104 Cal. App. 3d at p. 559) that may have adversely affected their authentication under Evidence Code section 1400. Nor did their admission unduly prejudice defendant under Evidence Code section 352 as a result of their illegibility. In failing to object to the admission of the letters on this ground, defendant's trial counsel did not deny defendant effective assistance of counsel. The letters were therefore properly admitted as relevant to the issue of other criminal activity under former section 190.3, subdivision (b).\n\nDefendant next contends that the letters were improperly admitted into evidence because their inspection and copying by Salt Lake City jail officials violated the Fourth Amendment and his right of privacy under article I, section 1 of the California Constitution. This contention is without merit.\n\nUnder Penal Code section 2600, California prisoners retain the civil rights of free persons, including the right to privacy, except to the extent that restrictions are necessary to insure institutional security and public safety. (De Lancie v. Superior Court (1982) 31 Cal. 3d 865, 868 [183 Cal. Rptr. 866, 647 P.2d 142]; cf. Bailey v. Loggins (1982) 32 Cal. 3d 907, 915 [187 Cal. Rptr. 575, 654 P.2d 758] [right to freedom of press]; Procunier v. Martinez (1974) 416 U.S. 396, 413 [40 L.Ed.2d 224, 240, 94 S.Ct. 1800] [under federal constitutional law, censorship of prisoner mail justified only if it furthers an important governmental interest (such as security, order, and rehabilitation) unrelated to suppression of expression].) Defendant contends that he had a reasonable expectation of privacy concerning letters sent from prison, relying heavily on the Court of Appeal opinion in De Lancie v. Superior Court, which was superseded by our subsequent opinion (31 Cal. 3d 865) in the case.\n\nIn De Lancie, we held that, in the absence of any security interest, conversations between pretrial detainees and visitors could not be monitored solely to gather evidence to be used at their upcoming trials. We expressly declined to base our decision on federal or state constitutional grounds, finding it sufficient to rest it on section 2600, which provides generally that a person imprisoned in state prison may \"be deprived of . . . only such rights, as is necessary in order to provide for the reasonable security of the institution . . . and . . . the public,\" and section 2601, which designates certain retained civil rights, including the right \"[to] have personal visits.\" We reasoned that pretrial detainees are entitled to at least the same protection. (31 Cal. 3d at pp. 871-872.)\n\nHowever, the statutes upon which De Lancie rests, and article I, section 1 of the California Constitution, were inapplicable to the Utah jail in which defendant was detained. Defendant suggests that evidence obtained in a manner that would not be proper in California, even if valid under federal law and the law of the state where it was obtained, should be excluded in California courts. We rejected the same argument in People v. Blair (1979) 25 Cal. 3d 640 [159 Cal. Rptr. 818, 602 P.2d 738], holding that the purposes of the exclusionary rule would not be served by such an extraterritorial application. Since the seizure in that case was legal where it occurred, and no California law enforcement personnel participated, exclusion would have \"[served] no deterrent effect in either jurisdiction.\" (Id., at p. 656.) Nor\n\ndid the other accepted purpose of the rule, the preservation of judicial integrity, require exclusion, since \"[unlike] the situation that arises when a seizure contrary to California law occurs in this state, the venture [by police in the other state] [was] not lawless and the government [was] therefore not profiting from illegal conduct or acting as a law-breaker.\" (Ibid)\n\nDefendant's claim that the inspection of his letters violated the Fourth Amendment is also without merit. Defendant's letters were inspected for security reasons pursuant to regulations that authorized such inspections without notice to the prisoner if there were affirmative indications that he was dangerous or presented an escape risk. Such inspections are generally acknowledged to be reasonable. (See United States v. Hearst (9th Cir. 1977) 563 F.2d 1331, 1345; compare United States v. Hinkley (D.C. Cir. 1982) 672 F.2d 115, 130-132 [inspection by guard of prisoners' papers violated Fourth Amendment because not in accord with established institutional practice, and excerpts that captured the guard's attention did not suggest a threat of criminal activity or implicate \"special considerations peculiar to the penal system\"].)\n\nHowever, defendant claims that jail officials lulled him into a \"sense of pseudoprivacy,\" by informing that his outgoing mail would not be inspected. Accordingly, defendant argues that the official's subsequent intrusion violated the Fourth Amendment under our holding in North v. Superior Court (1972) 8 Cal. 3d 301 [104 Cal. Rptr. 833, 502 P.2d 1305, 57 A.L.R.3d 155].\n\nIt is undisputed that defendant was not informed that his outgoing mail was being read. Moreover, the manual prepared for inmates by one of the jail officials, which summarized the jail rules and regulations, apparently stated without qualification that outgoing mail was not monitored. However, the regulations apparently provide that, while outgoing mail is not ordinarily monitored, it may be inspected (without notice to the detainee) if there is some affirmative indication that the inmate presents a security problem. The jail administrative officer explained that defendant's letters were read because he was classified as \"dangerous\" and an \"escape risk.\" Furthermore, he testified that defendant asked him whether outgoing mail was monitored, and the administrator replied that \"under normal conditions\" it was not. The administrator nonetheless reminded defendant of an occasion when the jail captain had testified in a homicide case regarding the contents of a letter written from jail. For a definitive answer to his question, the officer referred defendant \"to his rules and regulations.\"\n\nThe officer's answers to defendant's questions about the monitoring of mail were ambiguous. Although he told defendant that mail was not normally\n\nmonitored, he also told him that it was sometimes read. However, if defendant actually followed up on the officer's referral \"to his rules and regulations,\" then it appears he may have been aware of the jail's policy to monitor a detainee's mail if there were affirmative indications that the detainee presented a security problem. We therefore decline to characterize the jail administrator's statements to the defendant as giving rise to a reasonable expectation of privacy. Additionally, although the prisoner's manual apparently did misrepresent the jail's monitoring policy, there was no evidence adduced at the suppression hearing that defendant ever perused, or even was aware of, the manual. Therefore, we cannot conclude that defendant had a reasonable subjective expectation that the contents of his letters would remain private.\n\nNotwithstanding the lack of any evidence of bad faith or that the inspections exceeded in any way their proper scope under the regulations, defendant asks us to characterize the inspections as unreasonable because he may have been inadvertently misled to believe that his letters would pass unread. North, upon which defendant relies, did not so hold; there we condemned a \" deliberate \" scheme to \"secretly exploit [] marital confidences . . . for the sole purpose of gathering possibly incriminating evidence.\" (Italics added.) (8 Cal. 3d at p. 312; see also People v. Hill (1974) 12 Cal. 3d 731 [117 Cal. Rptr. 393, 528 P.2d 1]; People v. Jardine (1981) 116 Cal. App. 3d 907, 914 [172 Cal. Rptr. 408]; People v. Suttle (1979) 90 Cal. App. 3d 572, 578 [153 Cal. Rptr. 409].)\n\nOnce the properly limited inspections revealed defendant's attempt to have witnesses killed, there was nothing to prevent the prosecutor (who was appropriately informed of the contents of the letters) from introducing them at the penalty phase of defendant's trial. (See United States v. Baumgarten, supra, 517 F.2d at p. 1028 [\"plain view\" doctrine justified copying and dissemination of letter to law enforcement officials after proper \"scanning\" of letter]; United States v. Hinkley, supra, 672 F.2d at p. 131.)\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e Accordingly, we conclude that the prosecutor properly relied on defendant's letter (exhibit 20) as evidence of other criminal activity under former section 190.3, subdivision (b).\n\n(e) Letter soliciting extortion of the \"accountant.\"\n\nAs mentioned earlier, exhibit 19 consists of a letter written by defendant while in a Utah jail awaiting extradition to California. In the letter, defendant\n\nasks Bill Moyes to kidnap, beat and threaten the \"accountant.\"\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e Exhibit 19 is sufficiently legible to be admissible under general evidentiary standards and its review and copying by jail administrators did not violate any statutory or constitutional standards. However, this letter does not comply with section 653f, subdivision (d), which requires that criminal solicitation be proved \"by . . . one witness and corroborating circumstances.\" While introduction of the letter rendered defendant a \"witness,\" there is no corroborating evidence of circumstances independent of the defendant's direct evidence that tend to show guilt. Therefore, exhibit 19 was improperly admitted in the penalty phase as evidence of other criminal activity.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\n\nD. The jury's improper consideration of several incidents of alleged other criminal activity, and the trial court's failure to give a reasonable doubt instruction, were prejudicial.\n\nWe have identified two significant errors in the penalty phase: (1) the trial court's failure to instruct the jury that it could not consider evidence of other criminal activity under former section 190.3, subdivision\n\n(b), unless it found that such activity had been proven beyond a reasonable doubt (People v. Robertson, supra, 33 Cal. 3d at pp. 53-55, 60-62); and (2) the prosecution's erroneous reliance, as instances of such \"criminal activity,\" on a number of incidents -- the \"CW Murder Plan,\" the \"Solder Plan,\" the \"Industrial Burglary Plan,\" and defendant's letter soliciting extortion of the accountant -- which were not actual crimes.\n\nIn determining prejudice and reversible error at the penalty phase, we agree with Justice Broussard's refinement of the traditional test in People v. Robertson, supra, 33 Cal. 3d 21. The lead opinion abides by the traditional test that \"'any substantial error occurring during the penalty phase of the trial . . . must be deemed to have been prejudicial.' (People v. Hamilton (1963) 60 Cal. 2d 105, 135-137 [32 Cal. Rptr. 4, 383 P.2d 412]; People v. Hines [(1964)] 61 Cal. 2d [164], 168-170 [37 Cal. Rptr. 622, 390 P.2d 398].)\" (33 Cal. 3d at p. 54.) In his concurring opinion, Justice Broussard suggested that \" substantiality\" \"should imply a careful consideration whether there is any reasonable possibility that an error affected the verdict.\" (Id., at p. 63.)\n\nApplying this test to the facts of this case, we conclude that reversal of the penalty judgment is required. First, we consider the trial court's failure to confine \"criminal activities\" to evidence demonstrating the commission of an actual crime. If former section 190.3, subdivision (b) had been properly interpreted and applied, Graybill's entire testimony at the penalty phase would have been excluded because the evidence with respect to all three incidents related by Graybill -- the \"CW Murder Plan,\" the \"solder plan,\" and the \"Industrial Burglary Plan\" -- was insufficient to establish any actual, completed crime. The prosecution relied on these incidents at the penalty phase to demonstrate defendant's alleged casual attitude toward killing and his readiness to resort to murder in a variety of settings. This is precisely the sort of evidence that is likely to have a significant impact on the jury's evaluation of whether defendant should live or die. Since there is a reasonable possibility that the improper introduction of the alleged misconduct affected the jury's verdict, its admission must be deemed prejudicial to the defendant. (People v. Robertson, supra, 33 Cal. 3d at pp. 54-55 [plur. opn.], p. 63 [conc. opn. by Broussard, J.].)\n\nThe second error -- the failure to give a \"reasonable doubt\" instruction -- tainted all of the other crimes that could properly have been considered by the jury as aggravating factors under section 190.3, subdivision (b). Past cases have frequently found such error prejudicial (see, e.g., People v. McClellan, supra, 71 Cal. 2d 793, 806) and that would appear to be particularly true in this case in which the prosecution's penalty phase evidence rested so heavily on other crimes evidence.\n\nRespondent suggests that the evidence of the most serious \"other crime\" presented at the penalty phase -- the letter written by defendant from a Utah prison apparently soliciting the murder of four prosecution witnesses -- was so overwhelming that the absence of a \"reasonable doubt\" instruction could not possibly have made a difference. It is not clear, however, that such an error may properly be dismissed on that basis.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e Moreover, in this case there was evidence in the record from which defense counsel could have argued that there was at least a reasonable doubt whether defendant was actually serious about going through with the elaborately constructed scheme set forth in the letter. In response to defense counsel's questioning on cross-examination, Graybill, the prosecution witness who was defendant's long time friend, acknowledged that defendant was \"prone to exaggerating these things [i.e., planned criminal acts].\" In addition, the jailhouse letter itself indicates that the described plan was not to be immediately put into operation but instead that Moyes, the recipient of the letter, was to bring it with him when he visited defendant in jail. Although the jury could, of course, have nonetheless found beyond a reasonable doubt that defendant was in fact guilty of solicitation of murder, defendant was at least entitled to have the issue properly presented to the jury.\n\nThe judgment is affirmed on the guilt phase and finding of special circumstances. The judgment is reversed on the penalty phase and remanded for a new penalty trial.\n\nKAUS, J.,*fn* Concurring. I agree with the majority opinion which, I believe, is correct in all important respects. Its extremely thorough treatment of defendant's many contentions, particularly those relating to the penalty phase, somehow obscures the fact that this is one of the clearest cases for reversal of the penalty that we have come across: (1) the trial court admitted a good deal of prejudicial evidence which did not qualify as \"criminal activity\" under the Penal Code; and (2) with respect to those incidents which did qualify, it failed to give a reasonable doubt instruction.\n\nAs long as I have pen in hand, I feel compelled to express the hope that if, at a retrial, the prosecution again elects to offer the letters from the Utah jail, it will do a better job of proving the \"rules and regulations\" which supposedly apprised defendant that outgoing mail was subject to being monitored.\n\nBIRD, C. J., Concurring and Dissenting. Although I concur in the judgment, I write separately because the lead opinion's analysis of the errors regarding the admission of \"other criminal activity\" evidence (see former Pen. Code, § 190.3, subd. (b)\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e ) and the prejudice that ensued raises significant questions.\n\nI.\n\nIn an attempt to ensure the accused a fair penalty phase trial, my colleagues suggest that in many cases it may be advisable for the trial judge to make a preliminary determination out of the presence of the jury as to whether there is substantial evidence to prove each element of the \"other criminal activity\" that the prosecutor seeks to present at the penalty phase. (Lead opn., ante, at pp. 72-73 fn. 25.) Although this is an admirable effort which will no doubt result in the exclusion of irrelevant and highly prejudicial evidence at the penalty phase, I remain convinced that due process requires a determination by a separate jury on the truth of other violent criminal activity which the prosecutor intends to rely on in aggravation.\n\nTo permit a jury which has just sustained a first degree murder charge with special circumstances to consider the truth of heretofore uncharged criminal activity is unlikely to foster impartial factfinding. \"Such a jury would have a very strong tendency -- indeed, would be almost compelled -- to find [the accused] guilty of the relatively less serious [criminal activity] once it [has] heard all the guilt phase evidence showing him to be a person who commits first degree murder[]. This evidence should not [be] presented to the jury at all until [it has] been found true beyond a reasonable doubt by an impartial fact finder.\" (People v. Frierson (1985) 39 Cal. 3d 803, 821-822 [218 Cal. Rptr. 73, 705 P.2d 396] (conc. opn. of Bird, C.J.).)\n\nII.\n\nThe lead opinion also adopts the test for prejudice proposed in Justice Broussard's concurring opinion in People v. Robertson (1982) 33 Cal. 3d 21, at page 63 [188 Cal. Rptr. 77, 655 P.2d 279]. (Lead opn., ante, at pp. 83-84.) Under that test, \"any substantial error\" -- which \"[implies] a\n\ncareful consideration whether there is any reasonable possibility that an error affected the [penalty] verdict\" -- mandates reversal of a sentence of death. It is useful to explore the origins of the \"any substantial error\" test and to note that the Broussard formulation is not the only test for assessing the prejudicial effect of penalty phase error.\n\nOver two decades ago, in People v. Hines (1964) 61 Cal. 2d 164 [37 Cal. Rptr. 622, 390 P.2d 398], Justice Tobriner, writing for the court, explained that in applying the California Constitution's \"miscarriage of justice \" standard in a death penalty case, \"we must recognize the deep-founded difference between the task of the jury in the penalty trial and its 'usual function of finding whether or not certain events occurred and certain consequences resulted from them.' [Citation.] In all other situations than the penalty trial the jury deliberates under the court's instructions and reaches its verdict within the area delineated by the judge. In the penalty phase the court gives no such instructions; 'the jury must decide [this] question without benefit of guideposts, standards or applicable criteria.' [Citation.] The jury decides in its absolute and unguided discretion whether to exact the death penalty. In all other situations than the penalty trial the evidence must be narrowed down to the point at issue; in the penalty trial the evidence consists of a multitude of matters pertaining to the defendant [citation] enabling the jury to make 'a complete and careful analysis of that person as a human composite of emotional, psychological and genetic factors.' [Citation.]\" (Id., at pp. 168-169.)\n\nJustice Tobriner continued: \"The isolation of the determination of the death penalty in the penalty trial, which proceeds without standards for the jury, plus the expansion of the subject-matter of the trial, which has reached very wide margins, gives to the jury an undefined task performed upon a showing of a mass of material. As a result the jury may conceivably rest the death penalty upon any piece of introduced data or any one factor in this welter of matter. The precise point which prompts the penalty in the mind of any one juror is not known to us and may not even be known to him. Yet this dark ignorance must be compounded 12 times and deepened even further by the recognition that any particular factor may influence any two jurors in precisely the opposite manner. [ para. ] We cannot determine if other evidence before the jury would neutralize the impact of an error and uphold a verdict. Such factors as the grotesque nature of the crime, the certainty of guilt, or the arrogant behavior of the defendant may conceivably have assured the death penalty despite any error. Yet who can say that these very factors might not have demonstrated to a particular juror that a defendant, although legally sane, acted under the demands of some inner compulsion and should not die? We are unable to ascertain whether an error which is not purely insubstantial would cause a different result; we lack the\n\ncriteria for objective judgment. [ para. ] Thus, any such substantial error in the penalty trial may have affected the result; it is 'reasonably probable' that in the absence of such error 'a result more favorable to the appealing party would have been reached.'\" (Id., at p. 169.)\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e In numerous decisions since Hines, this court has adhered to the rule that \"any substantial error\" at the penalty phase of a capital case requires reversal and a remand for new penalty trial. (See, e.g., People v. Varnum (1967) 66 Cal. 2d 808, 814-815 [59 Cal. Rptr. 108, 427 P.2d 772] [error found \"substantial\"]; People v. Vaughn (1969) 71 Cal. 2d 406, 421-422 [78 Cal. Rptr. 186, 455 P.2d 122] [error did not constitute \"substantial error\"].)\n\nIt is true, of course, that unlike the death penalty statute in effect at the time of Hines, the 1977 and 1978 death penalty laws -- responding to the constitutional mandate set forth in a number of intervening United States Supreme Court decisions (e.g., Gregg v. Georgia (1976) 428 U.S. 153 [49 L.Ed.2d 859, 96 S.Ct. 2909]) -- set forth numerous \"factors\" to be considered by the jury in its penalty deliberations. (See § 190.3.) While these factors do provide some direction and \"guideposts\" to the sentencing jury, it is important not to exaggerate the difference in the scope of jury discretion under the current statutes and that under the old law. Although section 190.3 places limits on the \"aggravating\" factors that the jury may consider in arriving at its decision (see People v. Boyd (1985) 38 Cal. 3d 762, 772-776 [215 Cal. Rptr. 1, 700 P.2d 782]), the United States Supreme Court has made it clear that the jury must be free to consider any mitigating evidence relating to the defendant's character or background that the defendant proffers in his behalf. (E.g., Lockett v. Ohio (1978) 438 U.S. 586, 604 [57 L.Ed.2d 973, 989-990, 98 S.Ct. 2954]; Eddings v. Oklahoma (1982) 455 U.S. 104 [71 L.Ed.2d 1, 102 S.Ct. 869].)\n\nFurthermore, the current statute does not purport to tell the jury how much importance to place on each of the various listed factors or how to weigh one factor against another. In the final analysis, each juror is still\n\nrequired to make a judgment drawn from the juror's own personal values as to whether, in light of the circumstances of the offense and the defendant's character and background, the defendant deserves to live or die. (See People v. Brown (1985) 40 Cal. 3d 512, 538-545 [220 Cal. Rptr. 637, 709 P.2d 440].) For these reasons, it remains true that \"[the] precise point which prompts the [death] penalty in the mind of any one juror is not known to us and may not even be known to him.\" (Hines, supra, 61 Cal. 2d at p. 169.)\n\nJustice Broussard's recasting of the Hines formulation -- which has yet to gain a majority view -- may be appropriate for some contexts, so long as the fundamental concerns that prompted the Hines decision are kept in mind in applying the standard. Since there is no way of knowing the set of values which each juror brings to the penalty determination, this court must be extremely cautious in dismissing an error at the penalty trial as \"harmless.\"\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nIt is also important to recognize that the Broussard formulation is not the only test for evaluating whether a penalty phase error is a \"substantial\" one. In her concurring opinion in Eddings v. Oklahoma, supra, 455 U.S. at page 119 [71 L.Ed.2d at p. 14], Justice O'Connor observed that the federal precedents interpreting the Eighth Amendment's prohibition on cruel and unusual punishment (Woodson v. North Carolina (1976) 428 U.S. 280 [49 L.Ed.2d 944, 96 S.Ct. 2978]; Lockett v. Ohio, supra, 438 U.S. 586) \"require us to remove any legitimate basis for finding ambiguity concerning the factors actually considered by the [trier of fact in imposing the death penalty].\"\n\nA majority of this court adopted this formulation in People v. Easley (1983) 34 Cal. 3d 858, 879 [196 Cal. Rptr. 309, 671 P.2d 813]. There, a death sentence was reversed as a result of the trial court's penalty phase instruction which inaccurately told the jury that it must not be influenced by sympathy or pity for the accused. (Id., at p. 878; see CALJIC No. 1.00.) \"By directing the jury not to be swayed by sympathy or pity, . . . the court in effect told the jury not to give any weight to the bulk of the evidence proffered by the defendant. Thus, the instruction may very well have eliminated any chance Easley had to escape the death penalty.\" (Id., at p. 880.) Those conclusions were buttressed by the acknowledgement that the trial\n\ncourt \"significantly misled the jury with respect to the fundamental nature of its sentencing task\" by precluding consideration of sympathy at the penalty phase, and by \"effectively [requiring] the jury to disregard much of the evidence which Easley had presented at the penalty phase.\" (Ibid.)\n\nThese principles -- along with Justice O'Connor's Eddings formulation -- were applied a few months later in People v. Lanphear (1984) 36 Cal. 3d 163 [203 Cal. Rptr. 122, 680 P.2d 1081]. As in Easley, the trial court had instructed the jurors in the language of CALJIC No. 1.00 and had failed to instruct that they could consider \"any aspect of the defendant's character or background in determining whether death was the appropriate penalty.\" (Lanphear, supra, 36 Cal. 3d at p. 166.) In holding that retrial of the penalty phase was \"constitutionally mandated,\" the court observed that \"we may not affirm a judgment of death in the face of ambiguity which may have misled the jury as to its proper function.\" (Id., at p. 169.)\n\nThese identical errors were considered recently in People v. Brown, supra, 40 Cal. 3d 512. Using reasoning similar to that used in Lanphear, a majority of this court held that \"the ambiguous tension between these instructions and defendant's right to sympathetic consideration of all the character and background evidence he presented requires reversal of the penalty judgment. [Citations.]\" (Id., at p. 538, fn. omitted.)\n\nOf course, not every penalty phase error may be \"substantial\" enough to create \"ambiguity which may have misled the jury as to its proper function.\" However, an error may still be \"substantial\" even if it is not possible to conclude with relative certainty that a jury would have reached a different result in the absence of the error. Given the unique function a penalty jury serves and the factors it assesses in making its determination, such a mechanistic approach to assessing prejudice should be avoided.\n\nJustice Broussard's Robertson standard applied in the lead opinion appears flexible enough to accommodate such concerns with respect to the admission of and instructions on other criminal activity evidence. However, the \"any ambiguity\" test of Easley and the federal precedents might also be appropriate for certain kinds of errors. What is important is that we not lose sight of Easley, Lanphear and Brown in fashioning a workable standard that will be applicable in all cases.\n\nFEINERMAN (Robert), J.,*fn* Concurring and Dissenting. I concur in affirming the judgment on the guilt phase and the special circumstance finding. I respectfully dissent from the reversal of the judgment on\n\nthe penalty phase. In my opinion, there is no reasonable possibility that any errors committed during the penalty phase of defendant's trial affected the jury's penalty determination.\n\nThe defendant committed a deliberate and monstrous murder for monetary gain and attempted to execute a second victim. After defendant's arrest, he planned the murder of the second victim and three other prosecution witnesses -- Richard Graybill, a longtime friend, Sharon Colman, defendant's girlfriend, and Barbara Hollingshead, defendant's mother. No mitigating circumstances were presented on behalf of the defendant. The evidence in aggravation presented to the jury in the penalty phase regarding defendant's character and background overwhelmingly demonstrated that the defendant was the personification of evil. Furthermore, the defendant admitted that he was involved with others in cocaine trafficking and had shot a man in Mexico.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003ea\n\nTo state, as the majority has, that defendant's jailhouse letters containing directions to \"knock out,\" \"nail,\" and \"blast\" four prosecution witnesses is \"somewhat ambiguous as to the conduct it solicits\" is specious reasoning. Ambiguity cannot be properly determined in a vacuum. Considering the terms \"knock out,\" \"nail,\" and \"blast\" separately, as isolated words, each term may appear ambiguous. Considering them together in the circumstances in which they were used, their meaning is chillingly clear. Logic, common sense and the realities of everyday life compel the conclusion that when \"A,\" a murderer and drug dealer, solicits \"B\" to \"knock out,\" \"nail\" or \"blast\" \"C,\" whose testimony will result in \"A's\" conviction, \"A\" wants \"C\" dead. Any other conclusion is unreasonable.\n\nThe majority's argument that there was a reasonable doubt whether the defendant was \"actually serious\" about going through with his scheme to kill the prosecution witnesses is unconvincing. The defendant was a determined and vengeful survivalist. When he wrote Exhibit 20, defendant was lodged in a jail in Utah and was awaiting extradition to California to stand trial for the attempted murder of Ron Rose and the murder of Rose's friend, Bruce Bartulis. Graybill and Colman had decided to cooperate with law enforcement and Hollingshead, defendant's mother, was at home when the defendant arrived with Colman after the commission of the crimes. Manifestly,\n\nit was in the defendant's best interests to eliminate all of these witnesses before they had a chance to testify against him at his trial.\n\nAlthough the jury may have erroneously considered certain incidents of purported other criminal activity, those events (i.e., the \"CW Murder Plan,\" the \"Solder Plan,\" the \"Industrial Burglary Plan,\") were of relative minor significance compared to the other incidents which the jury could properly consider as other criminal activity (i.e., defendant's letters soliciting the murder of four prosecution witnesses, including his own mother, defendant's admission that he had shot a man in Mexico and defendant's admission that he had been involved with others in cocaine trafficking). A search for the golden fleece of the \"perfect trial\" is inevitably doomed to failure. \"'[A] defendant is entitled to a fair trial but not a perfect one,' for there are no perfect trials.\" (Brown v. United States (1973) 411 U.S. 223, 231 [36 L.Ed.2d 208, 215, 93 S.Ct. 1565].) It is also important to recognize that \"extreme justice is often injustice.\"\u003cspan class=\"fnref\"\u003e2\u003c/span\u003ea\n\nI recognize that the highest standard of care must be utilized in reviewing the record in the penalty phase of a capital case. It is an awesome responsibility to be part of a process that can result in the taking of a human life. But we also have a concomitant responsibility to society as a whole. As Justice Benjamin N. Cardozo stated in Snyder v. Mass. (1934) 291 U.S. 97 at page 122 [78 L.Ed. 674, 687, 54 S.Ct. 330, 90 A.L.R. 575], \"But justice, though due to the accused, is due to the accuser also. The concept of fairness must not be strained till it is narrowed to a filament. We are to keep the balance true.\"\n\nGiven the backdrop of a record that highlights the fact that not one scintilla of evidence in mitigation was introduced on behalf of the defendant in the penalty phase, I do not believe there is a reasonable possibility that the minor incidents improperly admitted as other criminal activity or the omission of a reasonable doubt instruction as to those incidents properly considered as other criminal activity could have made a difference in the jury's verdict in the penalty phase.\n\n\u003cspan class=\"fn\"\u003e* Retired Associate Justice of the Supreme Court sitting under assignment by the Chairperson of the Judicial Council.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e** Presiding Justice, Court of Appeal, Second District, Division Five, assigned by the Chairperson of the Judicial Council.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. All further statutory references are to the Penal Code unless otherwise indicated.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The defense also presented a witness who testified that on the day after the killing he saw a person unlike defendant in appearance boasting about having been involved in or having seen a shootout in Fairmead.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Section 996 provides: \"If the motion to set aside the indictment or information is not made, the defendant is precluded from afterwards taking the objections mentioned in Section 995.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. We note that in People v. Barboza (1981) 29 Cal. 3d 375 [173 Cal. Rptr. 458, 627 P.2d 188], we held as a \"judicially declared rule of criminal procedure\" that the contract between Madera County and the public defender there, which in essence deducted funds spent for other appointed counsel from the public defender's budget, \"[contained] inherent and irreconcilable conflicts of interest.\" (Id., at p. 381.) We were concerned that \"[the] direct consequence of this arrangement was a financial disincentive for the public defender either to investigate or declare the existence of actual or potential conflicts of interest requiring the employment of other counsel.\" (Id., at p. 379.) Here, the public defender discovered and disclosed the conflict to the court and to defendant, who chose to continue to be represented by the office in the early stages of the prosecution.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The tape contained a discussion of an apparent agreement between them that defendant would return to California to kill someone (\"CW\") for Graybill. In the course of that discussion defendant made a damaging reference to a .45-calibre pistol which \"sure did put a hole right through him. It went right through him because I could hear it go through the body of the car after it went through him. . . .\" Defendant testified that the reference was to a shootout in which he and Graybill had been involved in Mexico. The prosecutor introduced the tape recording into evidence with the request that only the segment of the recording dealing with the weapon and the shooting be played to the jury. Defendant and his counsel objected to playing the segment on the ground that Graybill and defendant had already testified to the relevant information. Defendant requested, alternatively, that if the court permitted the segment to be played, it allow the entire recording. Defendant wanted the segment to be heard in context and believed that the entire tape supported defendant's position that Graybill's request was real, not feigned.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Section 633 provides an exception to statutory restrictions on wiretapping and eavesdropping: \"Nothing in section 631 or 632 shall be construed as prohibiting . . . any . . . policeman . . . or deputy sheriff . . . or any person acting pursuant to the direction of one of the above-named law enforcement officers acting within the scope of his authority, from overhearing or recording any communication which they could lawfully overhear or record prior to the effective date of this chapter. [ para. ] Nothing in section 631 or 632 shall be construed as rendering inadmissible any evidence obtained by the above-named persons by means of overhearing or recording any communication which they could lawfully overhear or record prior to the effective date of this chapter.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Defendant's related argument that admission of the tape recording violated article I, section 1 of the California Constitution, guaranteeing the right of privacy, must also be rejected. People v. Ayers (1975) 51 Cal. App. 3d 370 [124 Cal. Rptr. 283], which appears to be directly on point, observes: \"The legality of the recording of either telephonic or face-to-face conversations [with the consent of one of the parties] is well-established.\" (Id., at p. 376.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Since Proposition 8 (§ 28, art. I of the Cal. Const.) applies only to prosecutions for crimes committed on or after its effective date (June 9, 1982), it does not apply to this case. (People v. Smith (1983) 34 Cal. 3d 251, 258 [193 Cal. Rptr. 692, 667 P.2d 149].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The 1977 revision of CALJIC No. 8.84.1 provided, in pertinent part: \"To find that the special circumstance, referred to in these instructions as murder in commission of a robbery, is true, each of the following facts must be proved: [ para. ] 1. That the murder was willful, deliberate and premeditated, and [ para. ] 2. That defendant was personally present during the commission of the act or acts causing death, and [ para. ] 3. That defendant, with intent to cause death, physically aided or committed the act or acts causing the death, and [ para. ] 4. That the murder was committed during the [commission] [or] [attempted commission] of a robbery. . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Section 190.2, subdivision (a)(17)(i) now identifies as a special circumstance a murder committed \"while the defendant was engaged in or was an accomplice in the commission of . . . [ para. ] Robbery . . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. It does not matter that these definitions were not repeated in connection with the special circumstance instructions. The jury was told to consider the instructions as a whole. (See People v. Shaw (1965) 237 Cal. App. 2d 606, 623 [47 Cal. Rptr. 96].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The current version of section 190.3, subdivision (b) tracks the former provision except for one minor distinction. Whereas the former provision referred to criminal activity \"which involved the use or attempted use of force or violence or the expressed or implied threat to use force or violence,\" the current provision speaks of criminal activity \"which involved the use or attempted use of force or violence or the express or implied threat to use force or violence.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The 10 factors identified in section 190.3 at the time of the murder were: \"(a) The circumstances of the crime of which the defendant was convicted in the present proceeding and the existence of any special circumstances found to be true pursuant to Section 190.1. [ para. ] (b) The presence or absence of criminal activity by the defendant which involved the use or attempted use of force or violence or the expressed or implied threat to use force or violence. [ para. ] (c) Whether or not the offense was committed while the defendant was under the influence of extreme mental or emotional disturbance. [ para. ] (d) Whether or not the victim was a participant in the defendant's homicidal conduct or consented to the homicidal act. [ para. ] (e) Whether or not the offense was committed under circumstances which the defendant reasonably believed to be a moral justification or extenuation for his conduct. [ para. ] (f) Whether or not the defendant acted under extreme duress or under the substantial domination of another person. [ para. ] (g) Whether or not at the time of the offense the capacity of the defendant to appreciate the criminality of his conduct or to conform his conduct to the requirements of law was impaired as a result of mental disease or the affects of intoxication. [ para. ] (h) The age of the defendant at the time of the crime. [ para. ] (i) Whether or not the defendant was an accomplice to the offense and his participation in the commission of the offense was relatively minor. [ para. ] (j) Any other circumstance which extenuates the gravity of the crime even though it is not a legal excuse for the crime.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The trial court qualified this factor pursuant to the further language of former section 190.3, cautioning the jury \"not to consider\" any evidence of \"criminal activity by the defendant which did not involve the use or attempted use of force or violence, or which did not involve the [expressed] or implied threat to use force or violence.\" In fact, this provision of the statute provides that \"no evidence shall be admitted\" of such other criminal activity.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. In his closing argument, the prosecutor did not discuss the content of this second letter but merely referred to defendant's \"letters\" as evidence of his character. The prosecutor referred to defendant's plan to obtain a loan from people he intended to kill (the \"Solder Plan\") as part of the circumstances of the instant crime. (See discussion, post, at pp. 73-74.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Pursuant to former section 190.3, the prosecution must provide pretrial notice of the evidence it intends to introduce in aggravation. In addition to the two incidents noted above, the prosecutor in the instant case provided defendant and the trial court with notice that he would introduce in aggravation evidence of the three incidents he characterized to the jury as \"other criminal activity.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. After oral argument in the present case, the parties were requested to submit supplemental briefing on these and related issues.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Prior to 1957, in death penalty cases, the jury returned a single verdict as to guilt and penalty, and the evidence pertaining to both was generally limited to \"facts and circumstances attending the commission of the offense itself.\" (People v. Barclay (1953) 40 Cal. 2d 146, 157-158 [252 P.2d 321]; see also People v. Friend (1957) 47 Cal. 2d 749, 763-764 [306 P.2d 463]; People v. Jones (1959) 52 Cal. 2d 636, 646-647 [343 P.2d 577]; People v. Terry (1964) 61 Cal. 2d 137, 142-145 [37 Cal. Rptr. 605, 390 P.2d 381].) This court criticized this procedure as incongruous when compared to the administrative discretion then accorded parole boards under the noncapital indeterminate sentence laws to fit the punishment \"to the perpetrator of the crime, not merely the crime.\" (People v. Friend, supra, 47 Cal. 2d at p. 763, fn. 7.) As Justice Schauer observed: \"In tailoring punishment for most offenders the controlling agency has the benefit of a complete study of the person. In the whole life story the particular crime is an incident, a controlling one for the time being, probably, but only one of many which the board considers in reaching its ultimate conclusion. It seems, therefore, incongruous that in a case of first degree murder the jury conceivably may be given the responsibility of selecting life imprisonment or death as punishment, but in making that determination may be denied the full measure of enlightenment which for less drastic punishments is available to the administrative board.\" (Ibid.) We suggested that \"[the] character and scope of evidence pertinent to punishment which should be received in a case wherein the jury is required to fix the penalty, is a subject which could well receive legislative attention.\" (Ibid.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Compare People v. Griffin (1963) 60 Cal. 2d 182, 191 [32 Cal. Rptr. 24, 383 P.2d 432], holding admissible evidence of a prior crime for which defendant obtained an acquittal. This ruling was explicitly overruled by the language of former section 190.3, providing that \"in no event shall evidence of prior criminal activity be admitted for an offense for which the defendant was prosecuted and was acquitted.\" Accord, People v. Terry, supra, 61 Cal. 2d at pp. 147-148 (holding inadmissible evidence of a prior conviction for which defendant received a pardon).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. See People v. Jones, supra, 52 Cal. 2d at pp. 646-648 (evidence of other rapes, robberies and burglaries); People v. Robillard, supra, 55 Cal. 2d at pp. 98-100 (evidence of two prior convictions; evidence of robberies from which defendant was fleeing at the time of the murder); People v. Pike, supra, 58 Cal. 2d at pp. 94-95 (\"evidence of the commission by Pike of the offense of pimping\"); People v. Bentley, supra, 58 Cal. 2d at pp. 460-461 (evidence of \"the commission of the robbery, kidnapping and attempted murder of a service station attendant . . .\"); People v. Mitchell, supra, 63 Cal. 2d at pp. 815-817 (evidence of another robbery, battery, and the possession of concealed guns and robbery paraphernalia resulting in a revocation of defendant's parole); People v. Tahl, supra, 65 Cal. 2d at pp. 732-734 (evidence of other killings, robberies, rape, and an attempt to kill); People v. Nye, supra, 71 Cal. 2d at pp. 366-367 (evidence of rape, burglary, robbery, and forgery; the latter held inadmissible because based on incompetent evidence); People v. McClellan, supra, 71 Cal. 2d at pp. 803-808 (testimony of accomplice regarding five prior robberies held inadmissible at penalty phase because uncorroborated); People v. Terry, supra, 61 Cal. 2d at pp. 149-150 (evidence of a prior conviction and possession of marijuana held admissible).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Section 190.1 was invalidated on February 18, 1972, by this court's ruling in People v. Anderson (1972) 6 Cal. 3d 628 [100 Cal. Rptr. 152, 493 P.2d 880], that the death penalty constituted cruel or unusual punishment under former article I, section 6 (present § 17) of the California Constitution. The statute was reinstated with the death penalty on November 7, 1972, pursuant to a constitutional amendment, adopted by the people through initiative measure, adding article I, section 27. Section 190.1 was subsequently repealed in 1973 by the California Legislature's enactment of a mandatory death penalty when certain enumerated special circumstances were found. (Stats. 1973, ch. 719, §§ 1-6, pp. 1297-1300.) This mandatory death penalty was invalidated in 1976 (Rockwell v. Superior Court (1976) 18 Cal. 3d 420 [134 Cal. Rptr. 650, 556 P.2d 1101]), based on the authority of five cases in which \"the United States Supreme Court construed similar state mandatory death penalty statutes, invalidating two of them on the ground that they failed to provide the sentencing authority with the option to impose a sentence other than death, guided by sufficient standards to assure against arbitrariness and discrimination in the application of the death penalty. (Gregg v. Georgia, supra, 428 U.S. 153; Proffitt v. Florida (1976) 428 U.S. 242 [49 L.Ed.2d 913, 96 S.Ct. 2960]; Jurek v. Texas (1976) 428 U.S. 262 [49 L.Ed.2d 929, 96 S.Ct. 2950]; Woodson v. North Carolina (1976) 428 U.S. 280 [49 L.Ed.2d 944, 96 S.Ct. 2978]; Roberts v. Louisiana (1976) 428 U.S. 325 [49 L.Ed.2d 974, 96 S.Ct. 3001] . . . .\") (People v. Frierson (1979) 25 Cal. 3d 142, 174 [158 Cal. Rptr. 281, 599 P.2d 587].) The enactment of the 1977 death penalty statute followed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. The Assembly Committee on Criminal Justice interpreted this language to provide \"no restriction on the evidence introduced to show the defendant's character to be bad because of any alleged criminal activity. There is no restriction on the use of prior charges in which the defendant may have faced trial and had been acquitted. Misdemeanor assaults and batteries are included.\" (Assem. Com. on Crim. Justice (1977-1978 Reg. Sess.) review of Sen. Bill No. 155 (Apr. 20, 1977), p. 1.) In the absence of other explanatory material, we interpret the broad language of the first sentence of the Assembly committee's analysis to be qualified by the second and third sentences -- specifically, that section 190.3 (as then amended) provided no restrictions on the introduction of nonfelony criminal activity or prior charges for which the defendant was acquitted. We do not interpret this language to preclude any restrictions whatsoever on the introduction of evidence of other criminal activity.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. As the Legislative Counsel summarized the Assembly amendments before the Senate voted to concur in them, they \"[provide] for evidence of the defendant's prior criminal activity to include any use or attempted use of force or violence or the expressed or implied threat to use force or violence if the defendant was not prosecuted and acquitted, rather than only conviction for a felony involving the use or threat of force or violence.\" (Legislative Counsel's Dig. of Assem. Amends. Sen. Daily File, May 18, 1977, p. 79.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. That evidence of actual conduct, rather than mere intent, is the subject of former section 190.3, subdivision (b), is supported by the Assembly Criminal Justice Committee's analysis of Senate Bill No. 155 shortly before its passage. This analysis provided in relevant part that \"Only evidence of prior assaultive behavior can be introduced in the area of prior criminality.\" (Italics added.) (Assem. Com. on Crim. Justice (1977-1978 Reg. Sess.) review of Sen. Bill No. 155 (May 2, 1977), p. 2.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. The problems revealed by the record in this case suggest that in many cases it may be advisable for the trial court to conduct a preliminary inquiry before the penalty phase to determine whether there is substantial evidence to prove each element of the other criminal activity. This determination, which can be routinely made based on the pretrial notice by the prosecution of the evidence it intends to introduce in aggravation (§ 190.3), should be made out of the presence and hearing of the jury. (Evid. Code, § 402.) Once the trial court has determined what evidence is properly admissible as other criminal activity (id., § 310), \"the prosecution should request an instruction enumerating the particular other crimes which the jury may consider as aggravating circumstances in determining penalty. . . . [The] jury should be instructed not to consider any additional other crimes in fixing the penalty.\" (People v. Robertson, supra, 33 Cal. 3d at p. 55, fn. 19.) Whether such other criminal activity has been proven beyond a reasonable doubt is then a question of fact for the jury. (Evid. Code, § 312.) If the jury finds that the evidence does not establish such criminal activity beyond a reasonable doubt, it could still consider such evidence, if appropriate, under any of the other listed factors enumerated in former section 190.3. With respect to the question whether the jury should be instructed on the elements of alleged other crimes, People v. Tahl, supra, 65 Cal. 2d at pp. 736-738, and People v. Nye, supra, 71 Cal. 2d at p. 367, stand only for the proposition that a trial court has no sua sponte duty to instruct the jury as to the elements of all of the other crimes that have been introduced at the penalty phase. This rule recognizes that a defendant for tactical considerations may not want the penalty phase instructions overloaded with a series of lengthy instructions on the elements of alleged other crimes, perhaps because he fears that such instructions could result in the jury placing undue significance on such other crimes rather than on the central question of whether he should live or die. In light of these tactical considerations, a defendant who has not requested an instruction on the elements of the alleged other crimes may not complain on appeal. However, if a defendant -- or the prosecution -- requests such an instruction, they are entitled to have the jury informed of the elements of the alleged other crimes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Since Graybill was a feigned accomplice, the requisite minimum of two persons for a conspiracy was lacking. (§ 182; see Perkins \u0026 Boyce, Criminal Law (3d ed. 1982) p. 693 [common law holds no conspiracy if one of two supposed confederates is a feigned accomplice, though perhaps 30 states have amended statutes to adopt Model Penal Code's \"unilateral\" approach]; La Fave \u0026 Scott, Handbook on Criminal Law (1972) § 61, pp. 461-462; Marcus, Prosecution and Defense of Criminal Conspiracy Cases (1982) § 2.04, pp. 2-9, 2-14, supp. p. 10 [listing 9 states which have basically adopted the \"unilateral\" approach of Model Pen. Code, § 5.0391].) Nor can it be said that defendant's agreement to come to California to do the killing amounted to an attempted murder, since \"no appreciable fragment of the [contemplated] crime was accomplished.\" (See People v. Adami (1973) 36 Cal. App. 3d 452, 457 [111 Cal. Rptr. 544] [no attempted murder where defendant did no more than solicit undercover policeman to commit killing].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. In asserting that the \"solder plan\" was part of the circumstances of the crime for which defendant was tried in the instant case, the prosecutor argued: \"Now with regard to the circumstances of the crime, as I say, you can consider the manner in which the crime was executed; you can consider the fact that the Defendant shot down a 26 year old victim, Bruce Bartulis, who was in the prime of his life. You can consider that man's life was snuffed out for money, and for, basically, the only purpose would be for money, mainly as the Defendant had predicted to Graybill five months earlier, he was going to get a loan of money from somebody and then instead of repaying it, he was going to kill him. \"In this case, it was an effective loan, at least if you assume there never was any cocaine and there never was any building materials, it really didn't amount to anything more than a loan, and the Defendant killed one person and tried to kill the other. . . . \"I would like to discuss for a few moments the aggregating [ sic ] circumstances of the case which I would suggest that the death penalty is the appropriate penalty. These things, of course, you all know, you've heard, but I'd like to summarize them for you. \"The Defendant, apparently, had been planning some such crime for five months, according to the testimony of Mr. Graybill when he was yet in Chino. He first spoke of getting some money, some $45,000.00 worth of money, from a couple of people and then killing them so he didn't have to pay it back. \"Another aggregating [ sic ] circumstance is the reason for the killing. The simple reason that he was killing the victims of a swindle and the victims were real people who became his victims at random. These just happened to be the people who were next door. . . . he conned them with his charm, knowing all along, as he had thought about it as early as five months before, that somewhere along the line he was going to kill them. \"Before doing that, another aggregating [ sic ] factor, he squeezed as much as he could out of them before he killed them because, the testimony was that on several occasions, the Defendant asked Mr. Rose to come up with more money and he never, perhaps, quite got as much as he wanted, because he had earlier indicated to Mr. Graybill the figure of $45,000.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Section 653f, subdivision (a) provides in relevant part: \"Every person who solicits another . . . to commit or join in the commission of robbery, burglary\" is punishable by imprisonment of one year or less, by fine or by both. Subdivision (b) provides: \"Every person who solicits another to commit or join in the commission of murder is punishable by imprisonment in the state prison for two, four, or six years.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. During a pretrial hearing on defendant's section 1538.5 motion to suppress the letters and the tape recording of a conversation between defendant and Graybill, David Minier, District Attorney of the County of Madera, testified that in connection with his prosecution of this case, he had gone to Salt Lake City to interview the addressee of the letters, Bill Moyes (then a prisoner in the Utah State Penitentiary), and to attempt to find the originals of the letters. Moyes told Minier that he had received one letter (a copy of which was admitted as exhibit 19), which had been destroyed, but had never seen, received, or had knowledge of the second letter (exhibit 20). Minier's testimony was admitted not for the truthfulness of any matter in controversy, but to explain why the originals were not available to the court under the best evidence rule.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Defendant begins the letter with the explanation that \"Here is the California information. This is the order in which the business must be dealt with.\" The letter then gives the names of Richard Graybill, Sharon Colman, Ron Rose, and Barbara Hollingshead. Each name is followed by a physical description of the person, his or her address, and directions for conducting the \"business\" as to each person. The letter provides in pertinent part: \"1. 'Ric', Richard Graybill. . . Must go first: Two armed men with guns showing tell him \"Freeze and no one will get hurt!! Come with us, some one wants to talk to you. Make him get in our car, and immeediately [ sic ] knock out. Then take his car also. dispose of, as we will discuss. . . . \"#2. Sharon Colman. . . Suggest a squirt bottle with amonia [ sic ], a good one that sprays a fine heavy spray, not a single stream . . . If you catch her at home, make her leave a note saying this: 'Gone to talk with Ric, be home later.' Spell Ric, Ric, when you first go up to the door as she says, Yes? Tell her 'The Las Vegas plan is in motion; someone wants to talk to you.' She should do as you say after that. Knock out, gag, immediately. \"#3. Ron Rose. . . Ideal would be to nail, and transport in Ric's car, Then if he lives in West Covina, drive to ontario [ sic ] airport and leave, if he lives in Fresno, leave at Fresno Airport. [ para. ] Wear gloves at all times. Won't hurt to have blood of #3 in car. So time schedule is, 10:00 PM approx. #1 8:00 AM approx #2, 2:00 to 3:00 PM, #3. [ para. ] Wait 2 days (no more, no less) \"#4. Barbara Hollingshead. . . Wait until her husband goes to work, gone about a 1/2 hr-: go side door, Knock, she probably won't open, but say 'Who's there.' Say 'Mrs. Hollingshead, Sheldon wants me to pick up his welding mask from the garage. If she opens the door, force it open, and blast her right there. If she says, 'Come around the back, do it in the garage, must be through-\" (Diagram of house follows.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. Under the circumstances of this case, we need not decide whether adequate recognition of prisoners' First or Fourth Amendment interests in the security monitoring of mail might require the fashioning of a rule limiting the \"plain view\" doctrine, akin to the \"nexus\" rule applicable to objects found in the course of a search pursuant to a warrant. (See People v. Superior Court (Meyers) (1979) 25 Cal. 3d 67, 73 [157 Cal. Rptr. 716, 598 P.2d 877]; Skelton v. Superior Court (1969) 1 Cal. 3d 144, 157-158 [81 Cal. Rptr. 613, 460 P.2d 485].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. Exhibit 19 reads in full (blanks indicating illegible words) as follows: \"Howdy, Misko, \"Really good to see you \u0026 Bob together, makes me feel things are rolling. \"By now I hope you and D have gotten together. I want you guys to jump the accountant when he is alone, if you don't think you can do it without someone seeing you, then surround [ sic ] him front and back, and if one you has a gun, so much the better, make him get in the car (the license plate removed and no registration showing). Do not use each others name in front of him. Drive him shoot a as possible, make him get out of the car and, first thing, kick him in the nuts. Then have Doug (or Rey, which ever one you're working with) hold from behind, and you beat him in the guts several times . \"Then tell him this: Mr. theres six of us in this town taking care of business. You disrespected Tony and I want to know why. Hit him a couple more times then say, I figure you've got a reason why you're want to know why (Hit him again) if he doesn't answer, ask him go to those niggers you were doing business with. If he doesn't mortgage go thru? And when you get an answer, tell him he has 72 hours, then he better be 15,000 in a black briefcase where he goes. The next group won't be as gentle. If Tony gets his way he'll break your knees, and our boss will collect, weather (sic) from you or your estate. \"We need to listen did he: \"1. go to the cops? \"2. Contact Mr. or his family? \"3. Go to the niggersd \"You Doug to point out to you. Tell Doug at the halfway house and working at the new Elks Club (might be at 21st South). First his partners , but we won't move on him until later. \"See you \"Ricci\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. In his closing argument, the prosecutor did not explicitly refer to exhibit 19 as evidence of other criminal activity but rather, together with exhibit 20, as evidence of defendant's character. Since the trial court did not provide a limiting instruction, however, the jury may well have considered exhibit 19 as evidence of other criminal activity.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. With respect to \"guilt phase\" proceedings, the United States Supreme Court has declared that \"failure to instruct a jury on the necessity of proof of guilt beyond a reasonable doubt can never be harmless error. [Citations.] Thus, a defendant whose guilt was actually proved by overwhelming evidence would be denied due process if the jury was instructed that he could be found guilty on a mere preponderance of the evidence.\" (Italics added.) (Jackson v. Virginia (1979) 443 U.S. 307, 320, fn. 14 [61 L.Ed.2d 560, 574, 99 S.Ct. 2781].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e* Retired Associate Justice of the Supreme Court sitting under assignment by the Chairperson of the Judicial Council.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. All statutory references are to the Penal Code.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Even before Hines, a number of decisions had adopted a similar approach to the penalty phase prejudicial error question. (See, e.g., People v. Hamilton (1963) 60 Cal. 2d 105, 137 [32 Cal. Rptr. 4, 383 P.2d 12] [\"[It] necessarily follows that any substantial error occurring during the penalty phase of the trial, that results in the death penalty, since it reasonably may have swayed a juror, must be deemed to have been prejudicial. This rule of law has been hinted at, if not decided, in prior cases. In People v. Linden (1959) 52 Cal. 2d 1, 27 [338 P.2d 397], it was said that error and misconduct at the penalty trial 'implicitly invites reversal in every case. Only under extraordinary circumstances can the constitutional provision . . . save the verdict.'\"]; People v. Terry (1964) 61 Cal. 2d 137, 154 [37 Cal. Rptr. 605, 390 P.2d 381] [\"To attempt to assess the effect of error in this legal vacuum is to superimpose one untestable surmise upon another. We must not pile conjecture upon conjecture and posit the decision of life or death upon a pyramid of guesses. Hence we must conclude that in view of the nature of this kind of trial, the above errors necessarily caused prejudice.\"].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Chief Justice Roger Traynor observed in his monograph on harmless error: \"Perhaps the most dangerous risk inheres in errors that relate to the issue of penalty in a capital case. A jury has absolute discretion in arriving at a verdict of death; there are no standards to guide it. In consequence an appellate court cannot possibly determine what factors influenced a jury to impose the death penalty. Any error, unless it related only to the proof of some fact otherwise indisputably established, might have tipped the scales against the defendant. Hence, an error in the penalty phase of a capital case usually compels reversal.\" (Traynor, The Riddle of Harmless Error (1970) pp. 72-73.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e* Presiding Justice, Court of Appeal, Second District, Division Five, assigned by the Chairperson of the Judicial Council. 1a Defendant testified on both direct and cross-examination, as part of his alibi, that he was involved with others in cocaine trafficking, and testified on cross-examination that he had shot a man in Mexico. I believe both of these admissions can properly be considered as other criminal activity under former Penal Code section 190.3. Clearly, no reasonable doubt instruction should be required at the penalty phase in regard to evidence of other criminal activity where the evidence of those other crimes was introduced and relied on by the defendant himself. 2a Racine, La Thebaide (1664) act IV, scene 3; see also Voltaire, Oedipe (1718) act III, scene 3.\u003c/span\u003e\n\n",
    "body_length": 162691,
    "citedas": [
      "222 Cal. Rptr. 127",
      "41 Cal. 3d 29",
      "711 P.2d 423"
    ],
    "attorneys": "Frank D. Berry, Jr., under appointment by the Supreme Court, and Paul I. Myers III for Defendant and Appellant. George Deukmejian and John K. Van de Kamp, Attorneys General, Robert H. Philibosian, Chief Assistant Attorney General, Arnold O. Overoye, Assistant Attorney General, Willard F. Jones, Nancy Sweet, Jane N. Kirkland and Edmund D. McMurray, Deputy Attorneys General, for Plaintiff and Respondent.",
    "category": [
      "36",
      "78"
    ],
    "judges": "Opinion by Reynoso, J., with Broussard, J., concurring. Separate concurring opinion by Kaus, J.*fn* Separate concurring and dissenting opinion by Bird, C.J. Separate concurring and dissenting opinion by Feinerman (Robert), J.*fn** Mosk, J., concurred in the disposition only.",
    "citation_count": 13
  }
}
