{
  "id": "oYC5PWYBTlTomsSBwadp",
  "document": {
    "title": "United States v. Rahman",
    "full_title": "UNITED STATES OF AMERICA v. OMAR AHMAD ALI ABDEL RAHMAN; IBRAHIM A. EL-GABROWNY; EL SAYYID NOSAIR; TARIG ELHASSAN; CLEMENT RODNEY HAMPTON-EL; AMIR ABDELGANI; FADIL ABDELGANI; VICTOR ALVAREZ; MOHAMMED SALEH AND FARES KHALLAFALLA .",
    "jurisdiction": "Second Circuit",
    "date": "1999-08-16T00:00:00.000Z",
    "docket": "Docket Nos. 96-1044L, -1045, -1060, -1061, -1062,-1063, - 1064, -1065, -1079, -1080",
    "body": "August Term 1997\n\nArgued: January 14-15, 1998\n\nAppeal from the January 17, 1996, judgment of the United States District Court for the Southern District of New York (Michael B. Mukasey, District Judge) convicting ten appellants of various offenses, including seditious conspiracy, in connection with a plot to bomb the World Trade Center and bridges and tunnels in New York City.\n\nConvictions affirmed; sentence of El-Gabrowny remanded for further consideration; sentences of all other Appellants affirmed.\n\nINTRODUCTION\n\nThese are appeals by ten defendants convicted of seditious conspiracy and other offenses arising out of a wide-ranging plot to conduct a campaign of urban terrorism. Among the activities of some or all of the defendants were rendering assistance to those who bombed the World Trade Center, see United States v. Salameh, 152 F.3d 88 (2d Cir. 1998) (affirming convictions of all four defendants), planning to bomb bridges and tunnels in New York City, murdering Rabbi Meir Kahane, and planning to murder the President of Egypt. We affirm the convictions of all the defendants. We also affirm all of the sentences, with the exception of the sentence of Ibrahim El-Gabrowny, which we remand for further consideration.\n\nBACKGROUND\n\nDefendants-Appellants Sheik Omar Abdel Rahman, El Sayyid Nosair, Ibrahim El-Gabrowny, Clement Hampton-El, Amir Abdelgani (\"Amir\"), Fares Khallafalla, Tarig Elhassan, Fadil Abdelgani (\"Fadil\"), Mohammed Saleh, and Victor Alvarez (collectively \"defendants\") appeal from judgments of conviction entered on January 17, 1996, following a nine-month jury trial in the United States District Court for the Southern District of New York (Michael B. Mukasey, District Judge).\n\nThe defendants were convicted of the following: seditious conspiracy (all defendants); soliciting the murder of Egyptian President Hosni Mubarak and soliciting an attack on American military installations (Rahman); conspiracy to murder Mubarak (Rahman); bombing conspiracy (all defendants found guilty except Nosair and El-Gabrowny); attempted bombing (Hampton-El, Amir, Fadil, Khallafalla, Elhassan, Saleh, and Alvarez); two counts of attempted murder and one count of murder in furtherance of a racketeering enterprise (Nosair); attempted murder of a federal officer (Nosair); three counts of use of a firearm in relation to a crime of violence (Nosair); possession of a firearm with an obliterated serial number (Nosair); facilitating the bombing conspiracy by shipping a firearm in interstate commerce and using and carrying a firearm in relation to a crime of violence (Alvarez); two counts of assault on a federal officer (El-Gabrowny); assault impeding the execution of a search warrant (El-Gabrowny); five counts of possession of a fraudulent foreign passport, and one count of possession with intent to transfer false identification documents (El-Gabrowny).\n\nI. The Government's Case\n\nAt trial, the Government sought to prove that the defendants and others joined in a seditious conspiracy to wage a war of urban terrorism against the United States and forcibly to oppose its authority. The Government also sought to prove various other counts against the defendants, all of which broadly relate to the seditious conspiracy. The Government alleged that members of the conspiracy (acting alone or in concert) took the following actions, among others, in furtherance of the group's objectives: the attempted murder of Hosni Mubarak, the provision of assistance to the bombing of the World Trade Center in New York City on February 26, 1993, and the Spring 1993 campaign of attempted bombings of buildings and tunnels in New York City. In addition, some members of the group were allegedly involved in the murder of Rabbi Meir Kahane by defendant Nosair.\n\nThe Government adduced evidence at trial showing the following: Rahman, a blind Islamic scholar and cleric, was the leader of the seditious conspiracy, the purpose of which was \"jihad,\" in the sense of a struggle against the enemies of Islam. Indicative of this purpose, in a speech to his followers Rahman instructed that they were to \"do jihad with the sword, with the cannon, with the grenades, with the missile . . . against God's enemies.\" Govt. Ex. 550 at 22. Rahman's role in the conspiracy was generally limited to overall supervision and direction of the membership, as he made efforts to remain a level above the details of individual operations. However, as a cleric and the group's leader, Rahman was entitled to dispense \"fatwas,\" religious opinions on the holiness of an act, to members of the group sanctioning proposed courses of conduct and advising them whether the acts would be in furtherance of jihad.\n\nAccording to his speeches and writings, Rahman perceives the United States as the primary oppressor of Muslims worldwide, active in assisting Israel to gain power in the Middle East, and largely under the control of the Jewish lobby. Rahman also considers the secular Egyptian government of Mubarak to be an oppressor because it has abided Jewish migration to Israel while seeking to decrease Muslim births. Holding these views, Rahman believes that jihad against Egypt and the United States is mandated by the Qur'an. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Formation of a jihad army made up of small \"divisions\" and \"battalions\" to carry out this jihad was therefore necessary, according to Rahman, in order to beat back these oppressors of Islam including the United States. Tr. 2197. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nAlthough Rahman did not arrive in the United States until 1990, a group of his followers began to organize the jihad army in New York beginning in 1989. At that time, law enforcement had several of the members of the group under surveillance. In July 1989, on three successive weekends, FBI agents observed and photographed members of the jihad organization, including (at different times), Nosair, Hampton-El, Mahmoud Abouhalima, Mohammad Salameh, and Nidal Ayyad (the latter three of whom were later convicted of the World Trade Center bombing, see Salameh, 152 F.3d at 161), shooting weapons, including AK-47's, at a public rifle range on Long Island. Although Rahman was in Egypt at the time, Nosair and Abouhalima called him there to discuss various issues including the progress of their military training, tape-recording these conversations for distribution among Rahman's followers. Nosair told Rahman \"we have organized an encampment, we are concentrating here.\" Govt. Ex. 851 at 2-3.\n\nOn November 5, 1990, Rabbi Meir Kahane, a former member of the Israeli parliament and a founder of the Jewish Defense League, gave a speech at the Marriot East Side Hotel in New York. Kahane was a militant Zionist, who advocated expelling Arabs from Israel. The content of this speech was a plea to American Jews to emigrate and settle in Israel. Nosair and possibly Salameh and Bilal Alkaisi, another member of the group, attended the speech. After the speech, as Kahane stood talking with the crowd, two shots were fired and Kahane was hit in the neck and chest.\n\nNosair, whom witnesses observed with a gun in hand immediately after the shooting, then ran toward the rear door of the room, trailed by one of the onlookers. At the door, 70-year-old Irving Franklin sought to impede Nosair's flight. Nosair shot Franklin in the leg, and fled the room. Outside the hotel Nosair encountered uniformed postal police officer Carlos Acosta. Acosta tried to draw his weapon and identify himself, but before he could fire, Nosair fired two shots at him. The first of these shots hit Acosta in the chest but was deflected into his shoulder by a bullet-proof vest he was wearing, and the second just missed Acosta's head. Despite being shot, Acosta returned fire, hitting Nosair in the neck. Nosair fell to the ground, dropping his weapon, a .357 caliber magnum revolver, at his side. Acosta recovered the weapon and detained Nosair. Ballistics testing showed that the weapon recovered from Nosair was the weapon that fired projectiles found in the room in which Kahane and Franklin had been shot, as well as in the area Acosta had been shot.\n\nSubsequent to these events, law enforcement personnel executed search warrants for Nosair's home, car, and work lockers. Among the items seized in these searches was a handwritten notebook, in which Nosair stated that to establish a Muslim state in the Muslim holy lands it would be necessary:\n\n\"to break and destroy the morale of the enemies of Allah. (And this is by means of destroying) (exploding) the structure of their civilized pillars. Such as the touristic infrastructure which they are proud of and their high world buildings which they are proud of and their statues which they endear and the buildings in which they gather their heads (leaders).\" Tr. 3962-63.\n\nWhile Nosair was at the prison ward of Bellevue Hospital following the shooting, Nosair stated in response to a question from a treating physician that he had no choice but to kill Kahane, and that it was his \"duty.\" Tr. 9244-46. After Nosair was moved from Bellevue to Rikers Island, he began to receive a steady stream of visitors, most regularly his cousin El-Gabrowny, and also Abouhalima, Salameh, and Ayyad. During these visits, as well as subsequent visits once Nosair was at Attica, \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Nosair suggested numerous terrorist operations including the murders of the Judge who sentenced him and of Dov Hikind, a New York City Assemblyman, and chided his visitors for doing nothing to further the jihad against the oppressors. Nosair also tape recorded messages while in custody, including one stating:\n\n\"God the Almighty . . . will facilitate for the believers to penetrate the lines no matter how strong they are, and the greatest proof of that [is] what happened in New York. God the Almighty enabled His extremely brave people, with His great power, to destroy one of the top infidels. They were preparing him to dominate, to be the Prime Minister some day. They were preparing him despite their assertion that they reject his agenda . . . and that he is a racist.\" Govt. Ex. 163R2 at 1.\n\nDuring Nosair's state trial in 1991, an FBI informant, Emad Salem, began to befriend various of Rahman's followers in an attempt to infiltrate the jihad organization. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e At that trial, Salem met El-Gabrowny, Nosair's cousin, who was raising money to aid in Nosair's defense. Salem also met other regular attendees such as Siddig Ibrahim Siddig Ali, Abouhalima, Ali Shinawy, Hamdi Moussa, and Ahmed Abdel Sattar. Salem, accompanied by El-Gabrowny, also met with Nosair. El-Gabrowny introduced Salem as \"a new member in the family.\" Tr. 4713-15.\n\nAs a result of these contacts, Salem traveled to Detroit with Rahman and others to attend a conference on the Islamic economy. During this trip, Salem, seeking to ingratiate himself to Rahman, informed Rahman of his prior service in the Egyptian military during the 1973 conflict with Israel. Rahman told Salem that this was not jihad because he had been paid to fight by an infidel government. Rahman also told Salem that he could make up for this, however, by assassinating Mubarak, a \"loyal dog to the Americans.\" Tr. 4633-34.\n\nBefore the Nosair trial ended, Salem was invited for dinner at El-Gabrowny's house. During dinner, El-Gabrowny indicated he was concerned about being bugged by the FBI, turned up the television, and then discussed construction of high-powered explosives with Salem. Salem testified that after this dinner at El-Gabrowny's house, bombing became a frequent topic of conversation between them. By early 1992, Rahman had also welcomed Salem into the group. Rahman specifically praised Salem for attempting to restart paramilitary training with the group, noting that there would come a day when the training would be needed.\n\nMohammad Saad, the cousin of Sattar and a participant in the jihad group, developed a plan to get Nosair out of jail and confided the plan to Salem. Salem repeated the plan to El-Gabrowny, who cautioned them to slow down and await the outcome of Nosair's appeal. After being badgered by Nosair to take action, El-Gabrowny met with Salem and told him that he was in touch with \"underground people\" who could help them construct bombs. Tr. 4730-31. El-Gabrowny instructed Salem on the superiority of remote detonators rather than timers, describing to Salem how a remote detonator could assist in bombing Dov Hikind.\n\nIn June 1992 El-Gabrowny visited Nosair again in prison. Upon his return, he instructed Salem and Shinawy that Nosair wanted to see them. Salem testified that, when they made the visit, Nosair berated them for not proceeding with bombing plans and directed Shinawy to seek a fatwa from Rahman approving the bombings. On the way home from the visit, Shinaway told Salem that the planned operation would involved twelve bombs. Shinawy also explained that they would need guns in case they encountered police during the deployment, indicating that his source for firearms was Hampton-El. Two days later Salem went to El-Gabrowny's house and found Shinawy already there. The three agreed that they would try to secure a \"safehouse\" for constructing bombs, and El-Gabrowny committed to attempt to obtain detonators from Afghanistan. A few days later, Shinawy summoned Salem to the Abu Bakr Mosque where he introduced Salem to Hampton-El. Salem and Shinaway explained to Hampton-El that they were making bombs but that they were having trouble getting detonators. Hampton-El said that he had access to \"ready-made bombs\" for $900 to $1,000 apiece. Tr. 4932-33, 6485-86. He also offered to obtain a handgun for Salem. A few days later Shinaway gave Salem a handgun presumably from Hampton-El.\n\nIn early July 1992, a rift developed between Salem and the FBI, and it was agreed that Salem's undercover investigation would be terminated. To explain his disappearance, Salem told El-Gabrowny that he needed to go to Spain for a while to take care of a problem in his jewelry business.\n\nIn late 1992, the paramilitary training resumed, led by Siddig Ali and Hampton-El on weekends between October 1992 and February 1993. Defendants Amir and Fadil Abdelgani and Elhassan all participated in the training camp, as did Abdo Haggag, an Egyptian spy who testified for the Government during the trial. The purpose of the training was to teach the participants jihad tactics. There was talk that jihad was needed in Bosnia, and that some of the trainees might go there. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e As Siddig Ali later explained to Salem, the training was meant to prepare the trainees for jihad wherever it was needed. During training, Siddig Ali reported to Rahman, and Rahman offered his insights into the training.\n\nIn the midst of this training, Hampton-El sought detonators and \"clean\" guns from Garrett Wilson, a cooperating witness for the U.S. Naval Investigative Service, who testified for the Government at trial. Tr. 10748-60. Hampton-El explained that he wanted to train a group of people in \"commando tactics\" and discussed training techniques and bomb identification. Tr. 10758-59.\n\nDuring this time, Ramzi Yousef (another compatriot who was later convicted of the World Trade Center bombing, see Salameh, 152 F.3d at 161) arrived in the United States. Rahman was making numerous calls to overseas numbers, including a Pakistan number which Yousef had inscribed in a bomb making pamphlet. Rahman, Salameh, and Yousef also made several calls to the same number in Pakistan in November. Nosair, speaking with his wife from prison, said, \"[A]nd what will happen in New York, God willing, it will be . . . because of my prayers.\" Govt. Ex. 128T at 7.\n\nIn January 1993, Rahman appeared at a conference in Brooklyn, and voiced his beliefs in violent jihad. Rahman further stated that being called terrorists was fine, so long as they were terrorizing the enemies of Islam, the foremost of which was the United States and its allies. While building the World Trade Center bomb, the builders kept in close phone contact with El-Gabrowny and Rahman. Salameh and Yousef repeatedly called El-Gabrowny at home and at the Abu Bakr Mosque and Rahman at home. In December 1992 and January 1993, El-Gabrowny visited Nosair at Attica and later arranged for the World Trade Center bombers to visit Nosair in the weeks preceding the bombing (Abouhalima visited Nosair on January 2 and February 7, and Salameh visited him on February 13).\n\nOn February 24, 1993, Salameh rented a van to be used in the World Trade Center bombing. As identification, he used a New York license bearing his own name and El-Gabrowny's address. As Ayyad was making arrangements to purchase the hydrogen gas to be used in the World Trade Center bomb, he called El-Gabrowny. On February 26, 1993, the World Trade Center complex was bombed, causing six deaths and massive destruction.\n\nOn March 4, 1993, federal agents executed a search warrant for El-Gabrowny's home. Salameh's use of El-Gabrowny's address when renting the van used in the bombing provided the basis for the warrant. The warrant allowed a search for explosives and related devices. The search of El-Gabrowny's home revealed, among other things, stun guns \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e and taped messages from Nosair urging fighting and jihad in response to the Jewish immigration to Israel. Just prior to executing the search warrant, the agents encountered El-Gabrowny as he left the building and then, seeing them, started back toward it. The agents stopped and frisked him. El-Gabrowny became belligerent and assaulted two agents. On his person, the agents found five fraudulent Nicaraguan passports and birth certificates with pictures of Nosair and his wife and children.\n\nAfter the bombing of the World Trade Center, Salem again began working for the FBI as an informant. In March of 1993, President Mubarak was scheduled to visit New York. Certain members of Rahman's group saw this visit as an opportunity to assassinate him, in the words of Siddig Ali, \"to execute the desire of the Sheik.\" Tr. 10087-89, 10295-96. In seeking financing for this plan, Siddig Ali called a man in the United Arab Emirates for funding, stating that Rahman would vouch for him. Siddig Ali also contacted a source in the Sudanese government to get a copy of Mubarak's itinerary while in New York. Siddig Ali described the plan to Abdo Mohammed Haggag, a Rahman confidant who later cooperated with the Egyptian and United States authorities, and noted that it would be carried out by participants in the paramilitary training including Elhassan and Amir Abdelgani. Siddig Ali said that those men would assist and did not need to be told anything until the last moment. Haggag confronted Amir about the plan. Amir said that Siddig Ali had not informed him but that he was ready for any operation when called. Nothing came of this plan because Haggag secretly gave the Egyptian government information about the plot, and the New York part of Mubarak's trip to the United States was canceled.\n\nSiddig Ali then proposed a new round of bombings. In late April 1993, he became friendly with Salem, who was, by that point, tape recording his conversations for the FBI. Salem agreed to assist Siddig Ali in putting together the bombs but stated that he would have no part in deploying them. After contemplating bombing a U.S. armory, Siddig Ali proposed bombing the United Nations complex. When initially discussing this plan with Salem, he stated that Rahman had approved the attack on the United Nations, and had called it not merely permissible, but a \"must\" and a \"duty.\" Tr. 5527-28. Siddig Ali invited Salem to discuss these matters directly with Rahman, but reminded him that because of the surveillance, to use caution in so doing. Caution, as defined by Siddig Ali, included phrasing statements in a broad and general manner, and assuring that Rahman was insulated from active involvement in the plot.\n\nSalem met with Siddig Ali again on May 12, pretending that he had surveyed locations for use as a bomb-making safehouse and that he had settled on a garage in Queens that was renting for $1,000 a month. This safehouse was actually rented by the FBI, and the FBI installed videocameras and surveillance equipment in the safehouse before members of the group began using it.\n\nTaking Siddig Ali up on his earlier invitation, Salem had a private conversation with Rahman on the night of May 23, 1993. At the bidding of Siddig Ali, Salem began the conversation by pledging allegiance to Rahman. Salem then told Rahman that he and Siddig Ali were planning to \"do a job.\" Govt. Ex. 311T at 3. Salem explicitly asked Rahman about the United Nations. Rahman replied that bombing the United Nations was \"not illicit, however will be bad for Muslims.\" Id. at 6-7. Rahman instead told Salem to \"Find a plan, find a plan . . . to inflict damage on the American army itself.\" Id. Salem then asked about a strike on the FBI headquarters in New York. Rahman told him to \"wait for a while,\" and to \"plan carefully.\" Id. at 7.\n\nSalem recounted this conversation to Siddig Ali, who stated that when he had discussed the United Nations issue with Rahman, Rahman had been in favor of the plan. Subsequently, in discussing the plan to bomb the United Nations with Hampton-El, Siddig Ali told him that he had received an \"official fatwa\" from Rahman regarding the plan. Govt. Ex. 315T at 7-9. Siddig Ali also told Khallafalla and Amir Abdelgani the same thing, stating the Rahman's approval was necessary whenever one did something \"basically unlawful,\" which would be wrong unless the \"mission [was] under the flag of God and his messenger.\" Govt. Ex. 320T at 7-9.\n\nAs a result of the failure of the plan to execute Mubarak, there was some speculation by members of the group that Siddig Ali was an informer. Siddig Ali and Salem conversed one day with Rahman about the issue. Rahman voiced his suspicions that Siddig Ali was the informer. Ironically, Salem secretly tape recorded this conversation for the Government. During the conversation, Rahman revealed that Abouhalima, one of the World Trade Center bombers, was supposed to have fled to Sudan, not to Egypt, where he was subsequently arrested after the bombing. After the Discussion, Siddig Ali told Salem that Rahman had ordered that they be circumspect when discussing their plans with him so that he would not be incriminated.\n\nOn May 27, 1993, Siddig Ali introduced Salem to Amir Abdelgani and Fares Khallafalla near the Medina Mosque. The four then traveled to the safehouse where they discussed the bombing plans. At that time Siddig Ali indicated he wanted to bomb the United Nations and the Lincoln and Holland Tunnels. Siddig Ali outlined the proposed plan for three explosions five minutes apart, sometimes sketching on a piece of cardboard. The cardboard was later recovered at the safehouse.\n\nOver the next few days, Siddig Ali and Amir Abdelgani (once accompanied by Salem) drove together to the Lincoln and Holland tunnels, the United Nations, and the Federal Building in Manhattan to scout the targets and examine traffic conditions. During one of these scouting trips, Amir suggested that they consider bombing the diamond district in Manhattan because that would be like \"hitting Israel itself.\" Govt. Ex. 323T at 6-9. At the United Nations, Siddig Ali noted that a bomb detonated at the entrance would topple the building. The men later gathered at the safehouse to discuss the operation.\n\nOn May 30, 1993, Hampton-El met with Siddig Ali and Salem at Hampton-El's safehouse, which he used for conducting business. Siddig Ali and Salem explained that they needed detonators, and Hampton-El said he would try to locate some for them. The three discussed the plan to blow up the United Nations and the tunnels. On June 4, 1993, Siddig Ali arranged to go with Salem to meet Mohammed Saleh. Siddig Ali explained to Salem that Saleh was an important supporter of jihad activities who might assist in the bombing campaign. Saleh was the owner of two gasoline stations in Yonkers, New York. During dinner at Saleh's house, Siddig Ali explained the bombing plan to Saleh, noting the different targets on a piece of paper. Salem was asked by Siddig Ali to eat the piece of paper once Siddig Ali felt that Saleh understood the plan. During dinner, Saleh agreed to help purchase military equipment.\n\nOver the next few weeks, Siddig Ali brought Alvarez and Elhassan into the group. Various members of the group began to collect the items they believed were needed to prepare the bombs. The group also met frequently to refine the bombing plan. On June 13, 1993, Salem and Khallafalla purchased two timers for the bombs in Chinatown. On June 15 and 18, Hampton-El left messages for Siddig Ali indicating that he was still searching for detonators. On June 19, Amir Abdelgani, Khallafalla, Salem, Alvarez, and Siddig Ali met at Siddig Ali's house to discuss the details of the plan, including the number of people and bombs needed to carry it out. Siddig Ali indicated that they needed fertilizer, fuel, and stolen cars.\n\nAmir, Alvarez, and Salem attempted on the evening of June 19 to buy stolen cars to deliver the bombs and to use as getaway cars during the bombing. Although they located a source for stolen cars, they did not have sufficient funds to purchase the cars. That same day, Elhassan met with a friend who was an engineer to discuss the feasibility of blowing up the tunnels and to determine where the weakest points of the tunnels were located.\n\nOn June 21, 1993, the group met at the Mosque and drove to the safehouse. Amir, Siddig Ali, and Elhassan discussed a method of communicating at the tunnels so that both of them would blow up at the same time, and planned their escapes after the bombing. Amir and Siddig Ali advised everyone that, if they were caught, not to talk until their lawyers were present. That evening Alvarez tried again, unsuccessfully, to obtain cars for the operation.\n\nOn June 22, 1993, after buying five 55-gallon steel barrels from a Newark drum business, Siddig Ali and Amir went to Saleh's gas station to get fuel for the bombs. Saleh agreed over the phone to provide the fuel. Belhabri, Saleh's employee, filled two of the drums with $140 worth of diesel fuel. Saleh agreed to keep two of the empty barrels in his garage. Siddig Ali and Amir did not pay for the fuel, but Belhabri made out a receipt on which he recorded the license plate of the van. Siddig Ali wrote a phony signature on the receipt.\n\nThe next day, June 23, Amir returned to Saleh's gas station with Fadil to fill the remaining three 55-gallon drums with diesel fuel. They met Saleh who called his employee at the other station to tell him to wait for the two so that they could get fuel before the station closed. Amir called Siddig Ali and asked if he could tell Fadil the bombing plan since Amir thought that Fadil would eventually catch on. Siddig Ali gave him permission to tell Fadil. Amir and Fadil obtained fuel. When Belhabri wrote out a receipt, Amir objected and called Saleh who then told Belhabri not to put the license number on the receipt but just to write \"Sudanese.\" Belhabri provided $151 worth of fuel. At the same time, Siddig Ali and Salem were purchasing more fertilizer for the bombs.\n\nLater in the day, Alvarez gave Siddig Ali a 9mm semi-automatic rifle with an empty 25-round magazine. Siddig Ali and Salem took the gun from Alvarez's apartment in New Jersey to the safehouse. A little after 8 p.m. that evening, Amir and Fadil arrived at the safehouse with the fuel. Amir then washed down the van so that there would be no traces left of the fuel. For the next hour, Amir, Fadil, Siddig Ali, and Salem discussed the bombing plan. At one point, Fadil was asked whether he would participate, and he responded that he had to perform an Istikhara prayer (a prayer seeking divine intervention to guide one's decision in a course of action). After going to the Mosque to pray, Fadil met Elhassan and Alvarez, and they drove back to the safehouse.\n\nBack at the safehouse, Amir began mixing the fuel and the fertilizer, and watched a videotape showing the tunnels that had been shot earlier in the day by Siddig Ali and Salem. Elhassan, Alvarez, and Fadil then returned, joined Amir, and began stirring the fuel and fertilizer together. They discussed the timers and the placement of bombs. At about 2 a.m. on the morning of June 24, FBI agents raided the safehouse and arrested the defendants, seizing the fuel and fertilizer mixture and the cardboard diagram Siddig Ali had periodically used to sketch the bombing plan.\n\nA few hours before arrests were made at the safehouse, FBI agents arrested Saleh at his apartment in Yonkers. At FBI headquarters, Saleh denied having sold fuel to the men but said that Salem had come to his station demanding fuel on two occasions. About a week later on July 5, 1993, Saleh called one of his employees from prison and instructed him to tell Belhabri to destroy the two receipts documenting the fuel given to the Abdelganis and Siddig Ali. Saleh said that it would be \"dangerous\" for Belhabri if he failed to follow these instructions.\n\nII. The Defense Case\n\nThe defendants presented their case for two months, calling 71 witnesses. Hampton-El, Elhassan, Alvarez, and Fadil Abdelgani each testified on his own behalf. The specific defenses put forth by the individual defendants will be set out below as they become relevant to particular claims on appeal. Siddig Ali, among others, was charged in the same indictment as the defendants but was not part of the trial because he pleaded guilty to all counts with which he was charged and cooperated, to a degree, with the Government.\n\nIII. Verdicts and Sentences\n\nThe jury trial in the case ran from January 9, 1995, to October 1, 1995. The jury returned verdicts finding defendants guilty on all submitted charges, except that Nosair and El-Gabrowny obtained not guilty verdicts on the Count Five bombing conspiracy charges. The defendants were sentenced as follows: Rahman and Nosair, life imprisonment; El-Gabrowny, 57 years; Alvarez, Hampton-El, Elhassan, and Saleh, 35 years; Amir Abdelgani and Khallafalla, 30 years; Fadil Abdelgani, 25 years. The sentences are more fully explained in Part IV(A), infra.\n\nDISCUSSION\n\nI. Constitutional Challenges\n\nA. Seditious Conspiracy Statute and the Treason Clause\n\nDefendant Nosair (joined by other defendants) contends that his conviction for seditious conspiracy, in violation of 18 U.S.C. § 2384, was illegal because it failed to satisfy the requirements of the Treason Clause of the U.S. Constitution, Art. III, § 3.\n\nArticle III, Section 3 provides, in relevant part:\n\n\"Treason against the United States, shall consist only in levying War against them, or in adhering to their Enemies, giving them Aid and Comfort. No Person shall be convicted of Treason unless on the Testimony of two Witnesses to the same overt Act, or on Confession in open Court.\"\n\nThe seditious conspiracy statute provides:\n\n\"If two or more persons in any State or Territory, or in any place subject to the jurisdiction of the United States, conspire to overthrow, put down or to destroy by force the Government of the United States, or to levy war against them, or to oppose by force the authority thereof, or by force to prevent, hinder or delay the execution of any law of the United States, or by force to seize, take, or possess any property of the United States contrary to the authority thereof, they shall each be fined under this title or imprisoned not more than twenty years, or both.\" 18 U.S.C. § 2384.\n\nNosair contends that because the seditious conspiracy statute punishes conspiracy to \"levy war\" against the United States without a conforming two-witness requirement, the statute is unconstitutional. He further claims that because his conviction for conspiracy to levy war against the United States was not based on the testimony of two witnesses to the same overt act, the conviction violates constitutional standards.\n\nIt is undisputed that Nosair's conviction was not supported by two witnesses to the same overt act. Accordingly the conviction must be overturned if the requirement of the Treason Clause applies to this prosecution for seditious conspiracy.\n\nThe plain answer is that the Treason Clause does not apply to the prosecution. The provisions of Article III, Section 3 apply to prosecutions for \"treason.\" Nosair and his co-appellants were not charged with treason. Their offense of conviction, seditious conspiracy under Section 2384, differs from treason not only in name and associated stigma, but also in its essential elements and punishment.\n\nIn the late colonial period, as today, the charge of treason carried a \"peculiar intimidation and stigma\" with considerable \"potentialities . . . as a political epithet.\" See William Hurst, Treason in the United States (Pt. II), 58 Harv. L. Rev. 395, 424-25 (1945).\n\nAt the time of the drafting of the Constitution, furthermore, treason was punishable not only by death, but by an exceptionally cruel method of execution designed to enhance the suffering of the traitor. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e See 4 William Blackstone, Commentaries *92 (observing that the punishment for treason is \"terrible\" in that the traitor is \"hanged by the neck, then cut down alive,\" that \"his entrails [are then] taken out, and burned, while he is yet alive,\" \"that his head [is] cut off,\" and that his \"body [is then] divided into four parts\"). \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e In contrast, lesser subversive offenses were penalized by non-capital punishments or less brutal modes of execution. See id. at *94-*126. The Framers may have intended to limit the applicability of the most severe penalties--or simply the applicability of capital punishment for alleged subversion--to instances of levying war against, or adhering to enemies of, the United States. See Hurst, supra, at 425 n.141 (indicating that at least some delegates \"regarded the effort to limit the application of the death penalty for subversive crimes as the central motive of the restrictive definition of treason\"). Today treason continues to be punishable by death, while seditious conspiracy commands a maximum penalty of twenty years imprisonment.\n\nIn recognition of the potential for political manipulation of the treason charge, the Framers may have formulated the Treason Clause as a protection against promiscuous resort to this particularly stigmatizing label, which carries such harsh consequences. It is thus possible to interpret the Treason Clause as applying only to charges denominated as \"treason.\"\n\nThe Supreme Court has identified but not resolved the question whether the clause applies to offenses that include all the elements of treason but are not branded as such. Compare Ex Parte Quirin, 317 U.S. 1, 38 (1942) (suggesting, in dictum, that citizens could be tried for an offense against the law of war that included all the elements of treason), with Cramer v. United States, 325 U.S. 1, 45 (1945) (noting in dictum that it did not \"intimate that Congress could dispense with [the] two-witness rule merely by giving the same offense [of treason] another name.\") The question whether a defendant who engaged in subversive conduct might be tried for a crime involving all the elements of treason, but under a different name and without the constitutional protection of the Treason Clause, therefore remains open. And we need not decide it in this case, because the crime of which Nosair was convicted differs significantly from treason, not only in name and punishment, but also in definition.\n\nSeditious conspiracy by levying war includes no requirement that the defendant owe allegiance to the United States, an element necessary to conviction of treason. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e See 18 U.S.C. § 2381 (defining \"allegiance to United States\" as an element of treason). Nosair nevertheless maintains that \"[t]he only distinction between the elements of seditious conspiracy under the levy war prong and treason by levying war is that the former requires proof of a conspiracy while the latter requires proof of the substantive crime.\" Reply Brief for Nosair at 9. Noting that the requirement of allegiance appears explicitly in the treason statute, but not in the Treason Clause, Nosair suggests that allegiance to the United States is not an element of treason within the contemplation of the Constitution. He concludes that, for constitutional purposes, the elements constituting seditious conspiracy by levying war and treason by levying war are identical, and consequently that prosecutions for seditious conspiracy by levying war must conform to the requirements of the Treason Clause.\n\nThe argument rests on a false premise. The Treason Clause does not, as Nosair supposes, purport to specify the elements of the crime of treason. Instead, in addition to providing evidentiary safeguards, the Clause restricts the conduct that may be deemed treason to \"levying war\" against the United States and \"adhering to their Enemies, giving them Aid and Comfort.\" It does not undertake to define the constituent elements of the substantive crime.\n\nMoreover, any acceptable recitation of the elements of treason must include the breach of allegiance. The concept of allegiance betrayed is integral to the term \"treason,\" and has been since well before the drafting of the Constitution. See 3 Holdsworth, History of English Law 287 (noting that \"the idea of treachery\" has been part of the treason offense since the reign of Edward III). In both \"its common-law and constitutional definitions the term 'treason' imports a breach of allegiance.\" Green's Case, 8 Ct. Cl. 412 (1872). Treason \"imports a betraying.\" Id. (quoting 3 Tomlin's Law Dictionary 637). Blackstone, too, noted that treason, \"in it's [sic] very name . . . imports a betraying, treachery or breach of faith.\" 4 Blackstone, supra, at *75. Early on, our Supreme Court recognized that \"[t]reason is a breach of allegiance, and can be committed by him only who owes allegiance.\" United States v. Wiltberger, 18 U.S. 76, 97 (5 Wheat.) (1820) (Marshall, C.J.). Nor is there any doubt that the delegates to the Constitutional Convention \"used [the term 'treason'] to express the central concept of betrayal of allegiance.\" Hurst, supra, at 415.\n\nNosair's suggestion that the statutory definition of treason added the requirement of allegiance is mistaken. The reference to treason in the constitutional clause necessarily incorporates the elements of allegiance and betrayal that are essential to the concept of treason. Cf. Wiltberger, 18 U.S. at 97 (noting that the inclusion of the words \"owing allegiance\" in a statute punishing treason are surplusage because the concept is implicit in the term). The functions of the Clause are to limit the crime of treason to betrayals of allegiance that are substantial, amounting to levying war or giving comfort to enemies, and to require sufficiently reliable evidence. Treason, in other words, may not be found on the basis of mere mutterings of discontent, or relatively innocuous opposition. The fact that the Treason Clause imposes its requirements without mentioning the requirement of allegiance is not a basis for concluding that treason may be prosecuted without allegiance being proved. That any conviction for treason under the laws of the United States requires a betrayal of allegiance is simply implicit in the term \"treason.\" Nosair was thus tried for a different, and lesser, offense than treason. We therefore see no reasonable basis to maintain that the requirements of the Treason Clause should apply to Nosair's prosecution. Cf. United States v. Rodriguez, 803 F.2d 318, 320 (7th Cir. 1986) (rejecting argument that \"oppose by force\" prong of Section 2384 conflicts with Treason Clause).\n\nB. Seditious Conspiracy Statute and the First Amendment\n\nRahman, joined by the other appellants, contends that the seditious conspiracy statute, 18 U.S.C. § 2384, is an unconstitutional burden on free speech and the free exercise of religion in violation of the First Amendment. First, Rahman argues that the statute is facially invalid because it criminalizes protected expression and that it is overbroad and unconstitutionally vague. Second, Rahman contends that his conviction violated the First Amendment because it rested solely on his political views and religious practices.\n\n1. Facial Challenge\n\na. Restraint on Speech.\n\nSection 2384 provides:\n\n\"If two or more persons in any State or Territory, or in any place subject to the jurisdiction of the United States, conspire to overthrow, put down, or destroy by force the Government of the United States, or to levy war against them, or to oppose by force the authority thereof, or by force to prevent, hinder, or delay the execution of any law of the United States, or by force to seize, take, or possess any property of the United States contrary to the authority thereof, they shall be fined under this title or imprisoned not more than twenty years, or both.\" 18 U.S.C. § 2384.\n\nAs Section 2384 proscribes \"speech\" only when it constitutes an agreement to use force against the United States, Rahman's generalized First Amendment challenge to the statute is without merit. Our court has previously considered and rejected a First Amendment challenge to Section 2384. See United States v. Lebron, 222 F.2d 531, 536 (2d Cir. 1955). Although Lebron's analysis of the First Amendment issues posed by Section 2384 was brief, the panel found the question was squarely controlled by the Supreme Court's then-recent decision in Dennis v. United States, 341 U.S. 494 (1951). In Dennis, the Court upheld the constitutionality of the Smith Act, which made it a crime to advocate, or to conspire to advocate, the overthrow of the United States government by force or violence. See 18 U.S.C. § 2385; Dennis, 341 U.S. at 494. The Dennis Court concluded that, while the \"element of speech\" inherent in Smith Act convictions required that the Act be given close First Amendment scrutiny, the Act did not impermissibly burden the expression of protected speech, as it was properly \"directed at advocacy [of overthrow of the government by force], not Discussion.\" See id. at 502.\n\nAfter Dennis, the Court broadened the scope of First Amendment restrictions on laws that criminalize subversive advocacy. It remains fundamental that while the state may not criminalize the expression of views--even including the view that violent overthrow of the government is desirable--it may nonetheless outlaw encouragement, inducement, or conspiracy to take violent action. Thus, in Yates v. United States, 354 U.S. 298, 318 (1957), overruled in part on other grounds, Burks v. United States, 437 U.S. 1, 7 (1978), the Court interpreted the Smith Act to prohibit only the advocacy of concrete violent action, but not \"advocacy and teaching of forcible overthrow as an abstract principle, divorced from any effort to instigate action to that end.\" And in Brandenburg v. Ohio, 395 U.S. 444, 447 (1969) (per curiam), the Court held that a state may proscribe subversive advocacy only when such advocacy is directed towards, and is likely to result in, \"imminent lawless action.\"\n\nThe prohibitions of the seditious conspiracy statute are much further removed from the realm of constitutionally protected speech than those at issue in Dennis and its progeny. To be convicted under Section 2384, one must conspire to use force, not just to advocate the use of force. We have no doubt that this passes the test of constitutionality.\n\nOur view of Section 2384's constitutionality also finds support in a number of the Supreme Court's more recent First Amendment decisions. These cases make clear that a line exists between expressions of belief, which are protected by the First Amendment, and threatened or actual uses of force, which are not. See Wisconsin v. Mitchell, 508 U.S. 476, 484 (1993) (\"A physical assault is not . . . expressive conduct protected by the First Amendment\"); R.A.V. v. City of St. Paul, 505 U.S. 377, 388 (1992) (\"[T]hreats of violence are outside the First Amendment\"); NAACP v. Claiborne Hardware Co., 458 U.S. 886, 916 (1982) (\"The First Amendment does not protect violence\"); Watts v. United States, 394 U.S. 705, 707 (1969) (Congress may outlaw threats against President, provided that \"[w]hat is a threat [is] distinguished from what is constitutionally protected speech.\"); see also Hoffman v. Hunt, 126 F.3d 575, 588 (4th Cir. 1997) (upholding constitutionality of Freedom of Access to Clinic Entrances Act, as Act prohibits only use of force, physical obstruction, or threats of force); Terry v. Reno, 101 F.3d 1412, 1418-20 (D.C. Cir. 1996) (same); Cheffer v. Reno, 55 F.3d 1517, 1521 (11th Cir. 1995) (same).\n\nb. Vagueness and Overbreadth.\n\nRahman also contends that Section 2384 is overbroad and void for vagueness. See Village of Hoffman Estates v. Flip-side, Hoffman Estates, Inc., 455 U.S. 489, 494-95 (1982).\n\n(i) Overbreadth.\n\nA law is overbroad, and hence void, if it \"does not aim specifically at evils within the allowable area of State control, but, on the contrary, sweeps within its ambit other activities that . . . constitute an exercise of freedom of speech or of the press.\" Thornhill v. Alabama, 310 U.S. 88, 97 (1940). Particularly when conduct and not speech is involved, to void the statute the overbreadth must be \"real [and] substantial . . . Judged in relation to the statute's plainly legitimate sweep.\" Broadrick v. Oklahoma, 413 U.S. 601, 613 (1973); see also City Council of Los Angeles v. Taxpayers for Vincent, 466 U.S. 789, 799-800 \u0026 800 n.19 (1984).\n\nWe recognize that laws targeting \"sedition\" must be scrutinized with care to assure that the threat of prosecution will not deter expression of unpopular viewpoints by persons ideologically opposed to the government. But Section 2384 is drawn sufficiently narrowly that we perceive no unacceptable risk of such abuse.\n\nRahman argues that Section 2384 is overbroad because Congress could have achieved its public safety aims \"without chilling First Amendment rights\" by punishing only \"substantive acts involving bombs, weapons, or other violent acts.\" Rahman Br. at 67. One of the beneficial purposes of the conspiracy law is to permit arrest and prosecution before the substantive crime has been accomplished. The Government, possessed of evidence of conspiratorial planning, need not wait until buildings and tunnels have been bombed and people killed before arresting the conspirators. Accordingly, it is well established that the Government may criminalize certain preparatory steps towards criminal action, even when the crime consists of the use of conspiratorial or exhortatory words. See, e.g., United States v. Jeter, 775 F.2d 670, 678 (2d Cir. 1985). Because Section 2384 prohibits only conspiratorial agreement, we are satisfied that the statute is not constitutionally overbroad.\n\n(ii) Vagueness.\n\nRahman also challenges the statute for vagueness. A criminal statute, particularly one regulating speech, must \"define the criminal offense with sufficient definiteness that ordinary people can understand what conduct is prohibited and in a manner that does not encourage arbitrary and discriminatory enforcement.\" Kolender v. Lawson, 461 U.S. 352, 357 (1983); see also Hoffman Estates, 455 U.S. at 499. Rahman argues that Section 2384 does not provide \"fair warning\" about what acts are unlawful, leaving constitutionally protected speech vulnerable to criminal prosecution.\n\nThere is indeed authority suggesting that the word \"seditious\" does not sufficiently convey what conduct it forbids to serve as an essential element of a crime. See Keyishian v. Board of Regents, 385 U.S. 589, 598 (1967) (noting that \"dangers fatal to First Amendment freedoms inhere in the word 'seditious,'\" and invalidating law that provided, inter alia, that state employees who utter \"seditious words\" may be discharged). But the word \"seditious\" does not appear in the prohibitory text of the statute; it appears only in the caption. The terms of the statute are far more precise. The portions charged against Rahman and his co-defendants--conspiracy to levy war against the United States and to oppose by force the authority thereof--do not involve terms of such vague meaning. Furthermore, they unquestionably specify that agreement to use force is an essential element of the crime. Rahman therefore cannot prevail on the claim that the portions of Section 2384 charged against him criminalize mere expressions of opinion, or are unduly vague.\n\n2. Application of Section 2384 to Rahman's Case\n\nRahman also argues that he was convicted not for entering into any conspiratorial agreement that Congress may properly forbid, but \"solely for his religious words and deeds\" which, he contends, are protected by the First Amendment. In support of this claim, Rahman cites the Government's use in evidence of his speeches and writings.\n\nThere are two answers to Rahman's contention. The first is that freedom of speech and of religion do not extend so far as to bar prosecution of one who uses a public speech or a religious ministry to commit crimes. Numerous crimes under the federal criminal code are, or can be, committed by speech alone. As examples: Section 2 makes it an offense to \"counsel[],\" \"command[],\" \"induce[]\" or \"procure[]\" the commission of an offense against the United States. 18 U.S.C. § 2(a). Section 371 makes it a crime to \"conspire . . . to commit any offense against the United States.\" 18 U.S.C. § 371. Section 373, with which Rahman was charged, makes it a crime to \"solicit[], command[], induce[], or otherwise endeavor[] to persuade\" another person to commit a crime of violence. 18 U.S.C. § 373(a). Various other statutes, like Section 2384, criminalize conspiracies of specified objectives, see, e.g., 18 U.S.C. § 1751(d) (conspiracy to kidnap); 18 U.S.C. § 1951 (conspiracy to interfere with commerce through robbery, extortion, or violence); 21 U.S.C. § 846 conspiracy to violate drug laws). All of these offenses are characteristically committed through speech. Notwithstanding that political speech and religious exercise are among the activities most jealously guarded by the First Amendment, one is not immunized from prosecution for such speech-based offenses merely because one commits them through the medium of political speech or religious preaching. Of course, courts must be vigilant to insure that prosecutions are not improperly based on the mere expression of unpopular ideas. But if the evidence shows that the speeches crossed the line into criminal solicitation, procurement of criminal activity, or conspiracy to violate the laws, the prosecution is permissible. See United States v. Spock, 416 F.2d 165, 169-71 (1st Cir. 1969).\n\nThe evidence justifying Rahman's conviction for conspiracy and solicitation showed beyond a reasonable doubt that he crossed this line. His speeches were not simply the expression of ideas; in some instances they constituted the crime of conspiracy to wage war on the United States under Section 2384 and solicitation of attack on the United States military installations, as well as of the murder of Egyptian President Hosni Mubarak under Section 373.\n\nFor example:\n\nRahman told Salem he \"should make up with God . . . by turning his rifle's barrel to President Mubarak's chest, and kill[ing] him.\" Tr. 4633.\n\nOn another occasion, speaking to Abdo Mohammed Haggag about murdering President Mubarak during his visit to the United States, Rahman told Haggag, \"Depend on God. Carry out this operation. It does not require a fatwa . . . You are ready in training, but do it. Go ahead.\" Tr. 10108.\n\nThe evidence further showed that Siddig Ali consulted with Rahman about the bombing of the United Nations Headquarters, and Rahman told him, \"Yes, it's a must, it's a duty.\" Tr. 5527-29.\n\nOn another occasion, when Rahman was asked by Salem about bombing the United Nations, he counseled against it on the ground that it would be \"bad for Muslims,\" Tr. 6029, but added that Salem should \"find a plan to destroy or to bomb or to . . . inflict damage to the American Army.\" Tr. 6029-30.\n\nWords of this nature--ones that instruct, solicit, or persuade others to commit crimes of violence--violate the law and may be properly prosecuted regardless of whether they are uttered in private, or in a public speech, or in administering the duties of a religious ministry. The fact that his speech or conduct was \"religious\" does not immunize him from prosecution under generally-acceptable criminal statutes. See Smith, 494 U.S. at 879, reaffirmed in Boerne, 521 U.S. at 407.\n\nRahman also protests the Government's use in evidence of his speeches, writings, and preachings that did not in themselves constitute the crimes of solicitation or conspiracy. He is correct that the Government placed in evidence many instances of Rahman's writings and speeches in which Rahman expressed his opinions within the protection of the First Amendment. However, while the First Amendment fully protects Rahman's right to express hostility against the United States, and he may not be prosecuted for so speaking, it does not prevent the use of such speeches or writings in evidence when relevant to prove a pertinent fact in a criminal prosecution. The Government was free to demonstrate Rahman's resentment and hostility toward the United States in order to show his motive for soliciting and procuring illegal attacks against the United States and against President Mubarak of Egypt. See Mitchell, 508 U.S. at 487 (\"The First Amendment . . . does not prohibit the evidentiary use of speech to establish the elements of a crime or to prove motive or intent.\"); United States v. Hoffman, 806 F.2d 703, 708-09 (7th Cir. 1986) (evidence of religious affiliation relevant to show defendant's motive to threaten President, because defendant leader of religious group was imprisoned by Government at time of threats).\n\nFurthermore, Judge Mukasey properly protected against the danger that Rahman might be convicted because of his unpopular religious beliefs that were hostile to the United States. He explained to the jury the limited use it was entitled to make of the material received as evidence of motive. He instructed that a defendant could not be convicted on the basis of his beliefs or the expression of them--even if those beliefs favored violence. He properly instructed the jury that it could find a defendant guilty only if the evidence proved he committed a crime charged in the indictment.\n\nWe reject Rahman's claim that his conviction violated his rights under the First Amendment.\n\nII. Statutory Challenge\n\nA. Possession of Foreign Passports under 18 U.S.C. § 1546\n\nEl-Gabrowny challenges his convictions on Counts 24 through 28 under 18 U.S.C. § 1546 for possessing five forged Nicaraguan passports (identifying the five members of the Nosair family). \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e He contends the possession of a forged passport of a foreign state is not covered by the statute.\n\nThe words of the statute do not support his contention. Section 1546(a) states, in relevant part:\n\n\"Whoever knowingly forges . . . any immigrant or nonimmigrant visa, permit, border crossing card, alien registration receipt card, or other document prescribed by statute or regulation for entry into . . . the United States, or . . . possesses . . . any such visa, permit, border crossing card, alien registration receipt card, or other document prescribed by statute or regulation for entry into . . . the United States, knowing it to be forged [shall be guilty of a crime.]\" 18 U.S.C. § 1546(a) (emphases added). Section 1546 thus covers the possession of any document prescribed--here used as a synonym for \"designated\"--by statute or regulation for entry into the United States, knowing it to be forged. Several statutes and regulations prescribe foreign passports as \"document[s] . . . for entry into the United States.\"\n\nFor example, 8 U.S.C. § 1181 provides, with certain exceptions, that no immigrant shall be admitted into the United States unless at the time of application for admission he . . . presents a valid unexpired passport or other suitable travel document, or document of identity and nationality, if such document is required under the regulations issued by the Attorney General.\n\n8 U.S.C. § 1181(a). A regulation issued by the Attorney General requires that [a] passport valid for the bearer's entry into a foreign country at least 60 days beyond the expiration date of his or her immigrant visa shall be presented by each immigrant except an immigrant who [meets certain requirements].\n\n8 C.F.R. § 211.2(a). Moreover, federal regulations prescribe that [a] valid unexpired visa and an unexpired passport . . . shall be presented by each arriving nonimmigrant alien except [as specified in the provision].\n\n8 C.F.R. § 212.1. Although the statute and regulations cited do not use the word \"foreign\" to modify \"passport,\" the passports referred to in these provisions are necessarily ones issued by foreign governments, as they refer to passports presented by aliens, and a United States passport may not be issued except to a national of the United States. See 22 C.F.R. §§ 51.2(a), 51.3(a)-(c), 51.80(a) (United States passport may be revoked by reason of noncitizenship). Thus, a passport issued by a foreign government is clearly a document \"prescribed by statute or regulation for entry into . . . the United States\" and knowing possession of a forged or altered foreign passport is an offense under the plain meaning of Section 1546(a). Accord United States v. Osiemi, 980 F.2d 344, 346 (5th Cir. 1993). Because the language of the statute is clear, our inquiry is complete, and we need not examine legislative history. See United States v. Articles of Banned Hazardous Substances Consisting of an Undetermined Number of Cans of Rainbow Foam Paint, 34 F.3d 91, 98 (2d Cir. 1994).\n\nEl-Gabrowny seeks support from several court decisions excluding foreign passports from the prohibitions of the statute. Those decisions, however, referred to a prior, and significantly different, version of Section 1546(a). Before its amendment in 1986, Section 1546(a) prohibited the possession of forged documents \"required\" for entry into the United States. See United States v. Campos-Serrano, 404 U.S. 293, 294 n.1 (1971); see also Osiemi, 980 F.2d at 346 \u0026 n.2 (showing changes in statute). El-Gabrowny cites Campos-Serrano for the proposition that a foreign passport does not come within the prohibitions of the statute. That was true under the prior version of Section 1546(a) because a foreign passport was not \"required\" for entry into the United States. See Campos-Serrano, 404 U.S. at 298 (holding that possession of a counterfeit alien registration receipt card was not an offense under Section 1546 because such cards were not \"required\" for entry); United States v. Vargas, 380 F. Supp. 1162, 1168 (E.D.N.Y. 1974) (holding that a foreign passport was not a document \"required\" for entry into the United States); \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e United States v. Fox, 766 F. Supp. 569, 572 (N.D. Tex. 1991) (same); see also Osiemi, 980 F.2d at 346-48. However, the 1986 amendment to the statute replaced the word \"required\" with \"prescribed by statute and regulation.\" This amendment expanded the reach of Section 1546(a). See Osiemi, 980 F.2d at 346 \u0026 n.2. A foreign passport does come within the amended statute because a foreign passport is a document \"prescribed by statute or regulation for entry into . . . the United States.\" El-Gabrowny's argument fails.\n\nIII. Pretrial and Trial Challenges\n\nA. Seizure of Passports\n\nAfter a pre-trial hearing, the District Court denied El-Gabrowny's motion to suppress the forged passports on the ground, inter alia, that their seizure was justified under Terry v. Ohio, 392 U.S. 1 (1968). See United States v. El-Gabrowny, 876 F. Supp. 495, 498-500 (S.D.N.Y. 1994). El-Gabrowny contends the passports should not have been admitted in evidence at trial because their seizure violated prohibitions of the Fourth Amendment.\n\nUnder Terry, to determine whether police officers were justified in frisking a temporarily detained person to see if he is carrying weapons, we apply an \"objective standard: would the facts available to the officer at the moment of the seizure or the search 'warrant [an officer] of reasonable caution in the belief' that the action taken was appropriate?\" Terry, 392 U.S. at 21-22. Before carrying out a stop and frisk for weapons, \"[t]he officer need not be absolutely certain that the individual is armed; the issue is whether a reasonably prudent [officer] in the circumstances would be warranted in the belief that his safety or that of others was in danger.\" Id. at 27.\n\nSeveral \"specific and articulable facts\" available to the officers at the time of the seizure amply justified their conduct. See id. at 21. The FBI had learned, upon searching the debris at the site of the explosion at the World Trade Center, that the exploded vehicle had been rented by Mohammad Salameh, whose New York driver's license showed as his residence the address of El-Gabrowny's apartment in Brooklyn. On March 4, 1993, agents obtained a warrant to search the apartment for explosives and related devices. Also on that day, news of Salameh's arrest was widely broadcast. See El-Gabrowny, 876 F. Supp. at 497. Before agents entered El-Gabrowny's apartment, two officers waited outside in vehicles and watched El-Gabrowny, who had left his building and was walking down the street. As agents entered the building to conduct the search, El-Gabrowny, whose identity was known to the agents, turned and started to walk back toward the building at an accelerated pace, his hands thrust in the pockets of his jacket. Id. at 497. Upon observing this, the officers approached El-Gabrowny, identified themselves as police officers, removed his hands from his pockets, and tried to place his hands against a wall to frisk him. El-Gabrowny resisted. One officer felt a firm rectangular object in El-Gabrowny's pocket that he believed might be a plastic explosive. El-Gabrowny then struck both agents and was arrested for assaulting the agents. The officers removed the object from El-Gabrowny's pocket, and found that it was an envelope containing the fraudulent passports. Id. at 498.\n\nIn light of these facts, the agents were justified under Terry in stopping El-Gabrowny and frisking him for weapons to protect their own safety and that of the agents conducting the search. It was reasonable for the officers to suspect that the firm rectangular object in El-Gabrowny's pocket might be an explosive device, given the use of explosives at the World Trade Center bombing and the fact that the warrant for the apartment covered explosives.\n\nIn any event, the officers were authorized to arrest El-Gabrowny for his assaults on them. His arrest for the assault would inevitably have led to the discovery and seizure of the passports that were in his pocket upon a search of his person incident to that arrest. See United States v. Robinson, 414 U.S. 218, 229 (1973); Nix v. Williams, 467 U.S. 431, 440, 448 (1984) (inevitable discovery). \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e B. Jury Voir Dire\n\nRahman, joined by his co-defendants, argues that the District Court's voir dire of prospective jurors was inadequate and deprived him of his Sixth Amendment right to an impartial jury. He claims that the Court's questioning of the jurors was insufficient with respect to (1) their prior knowledge of the case from reports they may have heard in the media, and (2) ethnic and/or religious bias that might have prejudiced them against the defendants. Because it is clear that the District Court thoroughly screened the prospective jurors for bias in both respects, this claim is unpersuasive.\n\n\"[J]udges have been accorded ample discretion in determining how best to conduct the voir dire.\" Rosalez-Lopez, 451 U.S. at 189; see also United States v. Barnes, 604 F.2d 121, 137 (2d Cir. 1979). Thus, while counsel may suggest that particular questions be put to the panel of prospective jurors, the Court's refusal to ask those questions will not be grounds for reversal, provided the voir dire \"cover[s] the subject[s]\" that may arise in the case to ensure that jurors will be impartial. See Aldridge, 283 U.S. at 311; United States v. Taylor, 92 F.3d 1313, 1324 (2d Cir. 1996); Barnes, 604 F.2d at 137. With respect to pretrial publicity, the Supreme Court has held that, while questioning prospective jurors individually about the specific contents of any news reports they may have seen might assist counsel in exercising peremptory challenges, the Constitution requires only that the Court determine whether they have formed an opinion about the case. See Mu'Min v. Virginia, 500 U.S. 415, 425 (1991).\n\nIt is clear that Judge Mukasey's thorough selection procedures went far beyond the minimum constitutional requirements. Over 500 prospective jurors went through the Court's three-week-long screening process. After providing groups of prospective jurors with preliminary instructions, the Court gave each venireperson a nineteen-page questionnaire to fill out. This questionnaire did far more than \"cover the topic[s]\" of pretrial publicity and ethnic bias. Jurors were asked not only whether they had heard anything about the case, but also about the source of that information and whether they could nonetheless render \"a fair and impartial verdict based only on the evidence presented in court.\" They were also asked more subtle, detailed questions about their personal experiences that might have prejudiced them against the defendants: whether they or their loved ones regularly use the Holland and Lincoln Tunnels and the George Washington Bridge, and whether they were at or near the World Trade Center when it was bombed, for example.\n\nThe Court's inquiry into ethnic and religious prejudice was even more comprehensive. All prospective jurors were asked, \"Is there anything about a case where all the defendants are Muslims (which means they practice Islam) that would make it hard for you to serve as a juror?\" They were told that all the defendants were of Arab descent, and asked, \"Is there any reason you could not be fair and impartial to any defendant in this case?\" and asked to explain if the answer was \"yes.\" Moreover, all prospective jurors were then required to answer \"yes\" or \"no\" to the following questions:\n\n\"Do you know anything about, or have any opinion about, the teachings or doctrines of Islam?\"\n\n\"If yes, please explain.\"\n\n\"Do/have you worked with people of Arab descent?\"\n\n\"Do you socialize with people of Arab descent? Have you ever had a negative experience with a person of Arab descent?\"\n\n\"If yes, please explain.\"\n\n\"Do you have any negative or positive feelings or opinions about people of Arab descent?\"\n\n\"If yes, please explain.\"\n\nThe answers to the questionnaires were provided to counsel for both sides. Subsequently, after a number of the prospective jurors were excused for cause, the Court conducted individual voir dire with each remaining pool member. The Court's inquiry included various follow-up questions suggested by counsel; at one point, the Court adopted defense counsel's suggestion that it rephrase certain questions about persons of Arabic and African descent in order to allow prospective jurors to give more detailed and honest responses.\n\nJudge Mukasey's voir dire skillfully balanced the difficult task of questioning such a large jury pool with the defendants' right to inquire into the sensitive issues that might arise in the case. The defendants' constitutional challenge to the fairness of the procedures is therefore without merit.\n\nC. Severance\n\nBased on claims of prejudicial spillover, Fadil Abdelgani, Amir Abdelgani, El-Gabrowny, Rahman, and perhaps Saleh and Kalafallah \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e contend that the District Court committed reversible error in denying their severance motions. See United States v. Rahman, 854 F. Supp. 254, 261-64 (S.D.N.Y. 1994).\n\nDistrict courts exercise \"a considerable degree of discretion in determining whether, on balance, the fair administration of Justice will be better served by one aggregate trial of all indicted defendants or by two or more trials of groups of defendants.\" United States v. Casamento, 887 F.2d 1141, 1151 (2d Cir. 1989). \"[W]hen defendants properly have been joined under Rule 8(b), a district court should grant a severance under Rule 14 only if there is a serious risk that a joint trial would compromise a specific trial right of one of the defendants, or prevent the jury from making a reliable judgment about guilt or innocence.\" Zafiro v. United States, 506 U.S. 534, 539 (1993).\n\nBecause no defendant has convincingly shown prejudice resulting from the District Court's denial of the severance motions, we find there was no abuse of discretion.\n\nD. Sufficiency of the Evidence\n\nThe following defendants challenge the sufficiency of the evidence on the following charges: Rahman challenges the sufficiency of the evidence on all counts of conviction; El-Gabrowny, Hampton-El, and Fadil Abdelgani challenge the sufficiency of the evidence supporting their seditious conspiracy convictions; Hampton-El and Alvarez contend that the proof supporting their attempted bombing convictions was insufficient; and Nosair attacks the sufficiency of the evidence supporting his three convictions for racketeering (the murder of Meir Kahane and the shootings of Irving Franklin and Carlos Acosta).\n\n1. Standard of Review\n\nThis Court reviews claims concerning the sufficiency of the evidence de novo. See United States v. Leslie, 103 F.3d 1093, 1100 (2d Cir. 1997). In reviewing such a claim we must consider the evidence as a whole, and not as individual pieces, see United States v. Giraldo, 80 F.3d 667, 673 (2d Cir. 1996), and remember that the jury is entitled to base its decision on reasonable inferences from circumstantial evidence. See United States v. Klausner, 80 F.3d 795, 802 (2d Cir. 1996). Based on these principles, we must uphold a jury's verdict on appeal if \"any rational trier of fact could have found the essential elements of the crime beyond a reasonable doubt.\" United States v. Jackson, 443 U.S. 307, 319 (1979).\n\nAdditionally, as a matter of substantive law, one may be proven guilty of conspiracy even if one does not know all the other members or all the details of the conspiracy's operation. See United States v. Sureff, 15 F.3d 225, 230 (2d Cir. 1994). Once an unlawful agreement is shown, to show membership, the Government need provide only \"some evidence from which it can reasonably be inferred that the person charged with conspiracy knew of the existence of the scheme alleged in the indictment and knowingly joined and participated in it.\" United States v. Sanchez Solis, 882 F.2d 693, 696 (2d Cir. 1989).\n\n2. Rahman\n\nRahman argues that the evidence presented by the Government was insufficient to support a conviction for any of the counts with which he was charged. Rahman asserts that he had limited contact with most of the other defendants, that he was physically incapable, due to his blindness, of participating in the \"operational\" aspects of the conspiracies, and that there was little direct evidence of his knowledge of many of the events in question. We find Rahman's claims unavailing.\n\na. Seditious Conspiracy and Bombing Conspiracy.\n\nTo support a conviction for seditious conspiracy under 18 U.S.C. § 2384, the Government must demonstrate that: (1) in a State, or Territory, or place subject to the jurisdiction of the United States, (2) two or more persons conspired to \"levy war against\" or \"oppose by force the authority of\" the United States government, and (3) that the defendant was a member of the conspiracy. 18 U.S.C. § 2384.\n\nFirst, we find ample evidence in the record to support the jury's finding that there was indeed a conspiracy to \"levy war\" against the United States. Over the course of the trial, the jury was presented with considerable evidence of a conspiracy. The evidence included the fact that many of the defendants in this case, as well as many the World Trade Center defendants, participated in military training exercises the purpose of which was to train members to carry out jihad \"operations.\" Tr. 6496-97. Appellant Nosair murdered Kahane in 1990, assisted by Salameh (who had been present at the training sessions). Among Nosair's possessions, the Government found notebooks describing \"war\" on the enemies of Islam and the manner of prosecuting such, including \"exploding . . . their high world buildings,\" as well as manuals on guerilla warfare tactics and explosives. Tr. 3963.\n\nSalameh, Yousef, and Abouhalima, the bombers of the World Trade Center, had considerable phone contact and/or direct contact with El-Gabrowny, Nosair, and Rahman in the weeks leading up to the bombing. Siddig Ali assisted Abouhalima's flight from the United States following the bombing. Rahman also encouraged Salem to murder Mubarak and issued a fatwa calling for the murder. In accordance with this call to duty, Siddig Ali plotted to assassinate Mubarak in March of 1993. The Abdelganis, Saleh, Elhassan, Hampton-El, and Alvarez engaged in a plot to bomb the Lincoln and Holland Tunnels and the United Nations. They purchased fuel, fertilizers, and timers and actively sought detonators. They had begun construction of the explosives when they were arrested. Each of these acts was connected by myriad contacts between the defendants. These illustrative acts, coupled with other evidence presented at trial, convince us that there is ample evidence to support the jury's Conclusion that there was a conspiracy to \"levy war\" on the United States, and that the conspiracy contemplated the use of force.\n\nAs to Rahman's individual claim, there is also sufficient evidence to support the Conclusion that he was in fact a member of the conspiracy. While there is no evidence that Rahman personally participated in the performance of the conspiracy, when conspiracy is charged, the Government is not required to show that the defendant personally performed acts in its furtherance: it is sufficient for the defendant to join in the illegal agreement. The evidence showed that Rahman was in constant contact with other members of the conspiracy, that he was looked to as a leader, and that he accepted that role and encouraged his co-conspirators to engage in violent acts against the United States.\n\nRahman discussed the results of the paramilitary training with Abouhalima and Nosair, and encouraged his followers to conduct jihad, including acts of violence, against the United States. During a visit to Nosair at Attica, Nosair instructed Shinawy to seek a fatwa from Rahman regarding a plan to bomb various targets. Siddig Ali reported to Rahman concerning the resumed paramilitary training. Rahman encouraged Salem to conduct jihad by killing Mubarak and issued a fatwa for Mubarek's death. Rahman made numerous calls overseas, including calls to a number in Pakistan that was inscribed in a bombing manual carried by convicted World Trade Center bomber Yousef. Rahman also had frequent contact with other members of the conspiracy including El-Gabrowny, Abouhalima, and Salameh in the weeks leading up to the World Trade Center bombing.\n\nSiddig Ali told Salem that Rahman had referred to the Spring 1993 bombing campaign as a \"must\" and a \"duty.\" Siddig Ali also told Salem that he was free to discuss the plot with Rahman, but to do so in general terms so as to keep Rahman insulated. Although Rahman did advise against making the United Nations a bombing target because that would be bad for Muslims, he advised Salem to seek a different target (U.S. military installations) for the bombings, and to plan for them carefully. In that same conversation, he also warned Salem to be careful around Siddig Ali, who he suspected was a traitor. Rahman then sought out the traitor in his group, having a long Discussion with Salem and Siddig Ali over who was the traitor. This evidence shows that a reasonable trier of fact could have found that Rahman was a member of the conspiracy and that he was in fact its leader.\n\nAs to the bombing conspiracy count, the Government must prove: (1) that Rahman was a member of a conspiracy to \"destroy, by means of fire or explosives, any building, vehicle or other real or personal property\" in interstate commerce, 18 U.S.C. §§ 371, 844(i); and (2) that one or more of the conspirators did \"any act to effect the object of the conspiracy.\" 18 U.S.C. § 371. Even if we assume that this count is limited to the Spring 1993 plot \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e , there is clear evidence to support a reasonable Conclusion that there was a conspiracy of which Rahman was a member, and that the conspirators had taken overt acts \"to effect the object\" thereof. The conspirators had, among other things: (1) scouted the Lincoln and Holland Tunnels; (2) contributed rent for a place to make the bombs; (3) purchased fuel oil, fertilizer, and timers from which to make the bombs; and (4) begun mixing the fuel and fertilizer.\n\nParticularly relevant to the finding of Rahman's membership are the statements of Siddig Ali to Salem that Rahman had issued a fatwa for the Spring 1993 bombing plot, and had called it a \"must\" and a \"duty.\" Although Rahman wavered on the target of the bombing during his conversation with Salem, he nonetheless approved bombing as the method and suggested alternative targets. Rahman and Siddig Ali met together several times during the bombing preparations. On June 17, 1993, less than two weeks before the anticipated bombing, Rahman held a press conference (using Siddig Ali as his translator) during which he warned that the United States would pay a terrible price for supporting Mubarak.\n\nThis evidence, taken together, was sufficient to support a reasonable Conclusion that Rahman was guilty of the bombing conspiracy.\n\nb. Conspiracy and Solicitation to Murder Mubarak.\n\nRahman also claims that there is insufficient evidence to support his convictions for soliciting Salem, Siddig Ali, and Haggag, to murder Mubarak, and for being a member of a conspiracy to do such.\n\nTo support a conviction on the conspiracy to murder count, for which Rahman received a life sentence, the Government was required to prove: (1) that Rahman was a member of a conspiracy to kill a foreign official, 18 U.S.C. §§ 1116(a), 1117; and (2) that one of the conspirators took an overt act to \"effect\" such. See 18 U.S.C. § 1117. Again, there is sufficient evidence of the existence of the conspiracy, that Rahman was a member of it, and of the overt act. Specifically, in 1991 on the Detroit trip, Rahman told Salem that Mubarak should be killed. Siddig Ali told Salem that Mubarak's planned March 1993 visit provided an opportunity for the group to \"execute the desire of\" Rahman, namely, to assassinate Mubarak. Rahman had made clear to Siddig Ali that he wanted Mubarak killed, and had already issued a fatwa regarding such. Rahman told Haggag that killing Mubarak did not require an additional fatwa, and that Haggag and \"the people with training\" should carry out the assassination. Tr. 10108.\n\nIn furtherance of this conspiracy, Siddig Ali made contacts with an individual at the Sudanese mission to the U.N. seeking to get information regarding Mubarak's itinerary, and made plans for the assassination. Siddig Ali contacted a source in the United Arab Emirates seeking financing for the plan, stating that Rahman would vouch for him. In May 1993, both Haggag and Siddig Ali sought to take credit for proposing the plan when Rahman was questioning them over who was the traitor in the group. Based on the above, a reasonable trier of fact could conclude that the Government presented sufficient evidence to support Rahman's conviction on this count.\n\nTo convict Rahman of soliciting Mubarak's murder, the Government must prove by \"'strongly corroborative circumstances' that the defendant had the intent that another person engage in conduct constituting a crime described in Title 18 . . . and that the defendant actually commanded, induced or otherwise endeavored to persuade the other person to commit the felony.\" United States v. McNeill, 887 F.2d 448, 450 (3d Cir. 1989) (quoting United States v. Gabriel, 810 F.2d 627, 635-36 (7th Cir. 1987)). Whether such corroborative circumstances exist is a question of fact for the jury, see Gabriel, 810 F.2d at 635, and \"otherwise endeavors to persuade\" means \"any situation where a person seriously seeks to persuade another.\" McNeill, 887 F.2d at 450.\n\nWe conclude that a reasonable trier of fact could find that the Government proved such. First, Rahman explicitly suggested to Salem that he could make up for his service in the Egyptian army by killing Mubarak. Siddig Ali made it clear that Rahman adamantly wanted Mubarak dead. Rahman also told Haggag to kill Mubarak. These facts, taken together with the fact that the Government also provided evidence that Rahman was the leader of the group, who decided whether certain causes were pursued, and who picked targets and approved all plans, justifies a Conclusion that Rahman solicited Salem, Siddig Ali, and Haggag to murder Mubarak.\n\nc. Solicitation to Bomb a Military Installation.\n\nWith regard to the conviction for solicitation to bomb a military installation, the Government must also meet the McNeill test. Here, that test is met again based on Rahman's status as leader of the group, combined with the fact that he specifically told Salem to target military bases. Thus a reasonable trier of fact could find Rahman guilty of such solicitation.\n\n3. Nosair\n\nNosair argues that the evidence was insufficient to show that the murder of Kahane (or any of the specific charges levied under the RICO statute, including the attempted murder of Acosta and Franklin) was done with the statutorily required motive--to maintain or increase his position within a racketeering enterprise. See 18 U.S.C. § 1959.\n\n18 U.S.C. § 1959(a) states:\n\n\"Whoever . . . for the purpose of gaining entrance to or maintaining or increasing position in an enterprise engaged in racketeering activity, murders, . . . assaults with a dangerous weapon, commits assault resulting in serious bodily injury upon, . . . or attempts . . . so to do, shall be punished . . . .\"\n\nTo be convicted of this crime, the Government must prove beyond a reasonable doubt:\n\n\"(1) that the organization was a RICO enterprise, (2) that the enterprise was engaged in racketeering activity as defined in RICO, (3) that the defendant in question had a position in the enterprise, (4) that the defendant committed the alleged crime of violence, and (5) that his general purpose in so doing was to maintain or increase his position in the enterprise.\" United States v. Concepcion, 983 F.2d 369, 381 (2d Cir. 1992). Here, Nosair concedes that the Government presented sufficient evidence on the first four elements, and contests only the fifth.\n\nNosair bases his claim on a narrow construction of the term \"Jihad Organization,\" which the indictment defined as being equivalent to the charged seditious conspiracy. Thus, Nosair claims that the murder of Kahane, a private Israeli citizen, could not further the goals of an organization whose primary purpose was to levy war on the United States. We find this reading of the indictment flawed. According to the indictment, the Jihad Organization, the RICO enterprise in question, was \"opposed to nations, governments, institutions and individuals that did not share the group's particular radical interpretation of Islamic law,\" Indictment ¶ 1 (emphasis added), and an objective of this group was \"to carry out, and conspire to carry out, acts of terrorism--including bombings, murders, and the taking of hostages--against various governments and government officials, including the United States government and its officials.\" Id. ¶ 3. Thus, the murder of Kahane did not \"stray\" from the purposes of the Jihad organization, and in fact was entirely consonant therewith.\n\nNosair asserts that the Government also failed to show that the murder furthered his position in the organization. Under Concepcion, to prove the motive element the Government must present sufficient evidence so a \"jury could properly infer that the defendant committed his violent crime because he knew it was expected of him by reason of his membership in the enterprise or that he committed it in furtherance of that membership.\" Concepcion, 983 F.2d at 381. Further, such motive need not be the \"sole and principal motive\" for the act, and \"maintaining or increasing position\" should be construed liberally. Id.\n\nUnited States v. Thai, 29 F.3d 785 (2d Cir. 1994), much relied on by Nosair, is not availing. In Thai, we overturned a section 1959 conviction on sufficiency grounds. See id. at 818. In so doing, we applied the above principles, noting that the crime was strictly pecuniary in motive and that, even though the Government asserted that the motive of the enterprise was pecuniary, tying the crime to the group without any other direct evidence of such a connection was speculative. Id.\n\nThis case is easily distinguished from Thai because there is sufficient evidence from which to infer that the murder of Kahane, as well as the related violent crimes, were committed \"in furtherance of\" Nosair's membership in the jihad group. See Concepcion, 934 F.2d at 381. Specifically, we point to the fact that Nosair's notebook found during the search of his apartment stated that one of the goals of the jihad group was to allow \"Muslims to repossess their sacred lands in the hands of the enemies of God,\" Tr. 3963--a clear reference to Israel. In a conversations with Rahman, Nosair lamented the Jewish emigration from Eastern Europe to Israel. Killing Kahane is related to the fulfillment of these goals.\n\nThere was also evidence to suggest that the murder of Kahane involved other members of the organization, namely, Salameh and Ayyad, both of whom were convicted of the World Trade Center bombing. Rahman, the leader of the organization, remarked that he would have been honored to issue a fatwa regarding the murder of Kahane. Nosair, in a message taped from Rikers Island, stated \"God the Almighty enabled His extremely brave people, with His great power, to destroy one of the top infidels.\" Govt. Ex. 163R at 1. Nosair told his physician, in response to a question about the murder, \"I had no choice, it was my duty.\" Tr. 9244-45. Nosair sought to use the murder to inspire his compatriots to take other action, thus using it to increase his position in the organization.\n\nThus, a reasonable inference that the murder was in furtherance of his membership can be made, and his statement that it was his \"duty\" to murder Kahane leads to an inference that the murder was motivated by a desire to maintain or elevate his position in the organization.\n\n4. Fadil Abdelgani\n\nFadil Abdelgani concedes that there was sufficient evidence for the jury to convict him of the conspiracy to bomb and attempted bombing charges. However, he alleges that there was not sufficient evidence to support the guilty verdict for seditious conspiracy for which he received twenty years' imprisonment. We disagree.\n\nThe Government persuasively counters that a jury could reasonably infer that Fadil knew of the group's overriding purpose of forcibly opposing the United States based on his participation in the 1992 training camp and on the time he spent with Amir and other group members in the safehouse on June 23 while the plot was discussed. Fadil's participation in the attempted bombing itself also justifies an inference that he agreed to forcibly oppose the United States; the bombing plan was to disable major commercial activity of the United States (by disabling the tunnels) and to hit at the Government itself by bombing the United Nations. See United States v. Sanchez Solis, 882 F.2d 693, 696 (2d Cir. 1989). Fadil's alleged lack of knowledge of Nosair or Rahman and the details of some of the other overt acts of the conspiracy is not fatal to the Government's position. The case law of this Court holds that to be guilty of conspiracy a defendant need not know every detail of the conspiracy or know of the identities of all of the other conspirators. See United States v. Labat, 905 F.2d 18, 21 (2d Cir. 1990).\n\nIn light of Fadil's sometimes false and often strained testimony during the trial, the jury could also have concluded that he gave such testimony because he was conscious of his guilt. See United States v. Friedman, 998 F.2d 53, 57 (2d Cir. 1993). For example, Fadil testified that he never told the other safehouse defendants that he needed to pray before deciding whether or not to join in the conspiracy even though this comment was verified by the tape recording. Fadil also claimed that he had absolutely no idea what the others were doing mixing fuel and fertilizer, but he just joined in because he was standing around with nothing to do.\n\nIn sum, a reasonable jury could have concluded based on the evidence presented that Fadil was guilty of both the bombing conspiracy and the broader seditious conspiracy.\n\n5. El-Gabrowny\n\nEl-Gabrowny claims there was insufficient evidence for the jury to convict him of seditious conspiracy. El-Gabrowny claims that the jury's verdict was based on circumstantial evidence and that he was simply found guilty \"by association.\" The claim is unavailing. In his brief on appeal, El-Gabrowny focuses on the evidence that was not presented at trial and the acts in which he was not involved. El-Gabrowny notes that no tapes were produced in which he discusses plans to bomb buildings or any violent acts. He argues that he had nothing to do with the Kahane murder or the Spring 1993 bombing plots (during which time he was in prison).\n\nIn so arguing, El-Gabrowny attempts to minimize the real evidence presented against him. That evidence, we find, was sufficient for a rational trier of fact to find the essential elements of his participation in the seditious conspiracy beyond a reasonable doubt. El-Gabrowny routinely engaged in Discussions with Salem about building bombs, and in June 1992 offered to attempt to obtain detonators from Afghanistan. He also indicated he would try to acquire a safehouse for the construction of bombs, and that he was in touch with \"underground people\" who could assist in a bombing. Tr. 4908-09, 4912.\n\nHe was in constant contact with Nosair, and evidence seized from his house indicated that he shared Nosair's views on the duty to perform jihad. El-Gabrowny encouraged Salem and others to visit Nosair in prison at which time Nosair advocated that they begin jihad and plan to bomb buildings. El-Gabrowny frequently communicated with the World Trade Center bombers during the months, weeks, and days prior to the bombing. Salameh used El-Gabrowny's address on the driver's license that he used to rent the van that was used in the bombing. Upon his arrest, El-Gabrowny was carrying forged passports for Nosair and his family which were apparently meant to be used as part of the planned jailbreak of Nosair.\n\nIn light of his Discussions about bomb building with Salem and his subsequent close interaction with the World Trade Center bombers and Nosair, \"any rational trier of fact could have found the essential elements of the crime beyond a reasonable doubt.\" United States v. Amato, 15 F.3d 230, 235 (2d Cir. 1994) (emphasis omitted).\n\n6. Alvarez\n\nAlvarez claims that there was insufficient evidence to show a \"substantial step\" to support the attempted bombing charge. In support of this argument, Alvarez relies primarily on United States v. Ivic, 700 F.2d 51 (2d Cir. 1983) (Friendly, J.). In Ivic, this court looked to the Model Penal Code (\"MPC\") definition of \"attempt\" to determine if the evidence was sufficient to support the charge. Id. at 66-67. Section 5.01(1)(c) of the MPC provides that:\n\n\"A person is guilty of an attempt to commit a crime if, acting with the kind of culpability otherwise required for the commission of the crime, he purposely does . . . anything that, under the circumstances as he believes them to be, is an act . . . constituting a substantial step in a course of conduct planned to culminate in his commission of the crime.\"\n\nSection 5.01(d) provides a list of factual circumstances which, if strongly corroborative of his criminal purpose, shall not be held insufficient as a matter of law. These factors include:\n\n\"(c) reconnoitering the place contemplated for the commission of the crime;\"\n\n\"(f) possession, collection or fabrication of materials to be employed in the commission of the crime, at or near the place contemplated for its commission, where such possession, collection or fabrication serves no lawful purpose of the actor under the circumstances.\"\n\nIvic upheld the conviction of an attempted bombing where the evidence showed that: (1) the defendants \"discussed the bomb site and the best means of planting a bomb there\"; (2) the defendants \"had acquired and had readily available the explosives needed to carry out the bombing\"; (3) one of the defendants \"had reconnoitered the bomb site\" and another \"authorized the operation.\" Ivic, 700 F.2d at 67. This Court noted, however, in dicta that the evidence was \"barely\" sufficient. See id.\n\nIn this case, given the large number of steps taken by the defendants in preparation for the bombing, we find that they had moved beyond \"mere preparation.\" The defendants had: recruited sufficient participants to carry out the plan; contributed money to rent a safehouse in which to build the bombs; reconnoitered the potential targets of the bombs, by driving through and videotaping the tunnels and discussing the structure of the tunnels with an engineer; purchased, or attempted to purchase, what they believed to be the necessary components for the bombs, including actually purchasing oil, fertilizer, timers, and barrels in which to mix the explosives; attempted to find stolen cars in which to carry the bombs; and obtained a submachine gun to assist in carrying out the plan. Given the nature and scope of the proposed plan, namely, that it was to be a coordinated explosion of massive bombs designed to destroy large targets, we believe that the defendants had moved beyond \"mere preparation,\" and had in fact taken numerous \"substantial steps\" which were \"strongly corroborative of their criminal purpose.\" We therefore reject Alvarez's claim.\n\n7. Hampton-El\n\nHampton-El challenges the sufficiency of evidence against him on the seditious conspiracy and attempted bombing charges. As to both charges, he argues that he did not have the requisite intent. He asserts that the Government did not prove that he intended to \"join Siddig Ali and his minions\" to oppose the authority of the U.S. by force or to levy war against the U.S. nor did the Government prove that he specifically intended to bring about the bombing by aiding and abetting in the safehouse operation. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\na. Seditious Conspiracy.\n\nAt trial Hampton-El testified that he did not know any specifics of the operations of Siddig Ali, Salem, or the others, and that he \"did not mean it,\" Tr. 16000, when he agreed to try to find detonators and weapons for them. Relying on United States v. Martinez, 54 F.3d 1040 (2d Cir. 1995), Hampton-El claims that the Government's case impermissibly relied on inferences, and not on proof beyond a reasonable doubt, to show that he intended to join the seditious conspiracy. In Martinez, this Court made clear that \"where a fact to be proved is also an element of the offense . . . it is not enough that the inferences in the government's favor are permissible. [T]he reviewing court must also be satisfied that the inferences are sufficiently supported to permit a rational juror to find that the element . . . is established beyond a reasonable doubt.\" Id. at 1043. Hampton-El asserts that his only intent was to conduct jihad in Bosnia, and that is why he was engaged in training exercise in the United States.\n\nWe find sufficient evidence to support a finding of intent to join the conspiracy beyond a reasonable doubt based on the following evidence: Hampton-El co-led the shooting training in 1989 and the paramilitary training in 1992 of jihad group members, some of whom were involved in the World Trade Center bombing, and some of whom were involved in the spring 1993 bombing attempt; from 1989 to 1993, he was closely aligned with Nosair, El-Gabrowny, Rahman, Shinawy, and Abouhalima, whom the evidence showed to be planning urban terrorism against the United States; Shinawy (and Salem) went to him for help in obtaining detonators in June 1992 for bombs they told him they were constructing, and one can reasonably infer they went to him because he was a trusted member of the conspiracy; he requested detonators and weapons from Garrett Wilson in December 1992, just months before the World Trade Center bombing; Siddig Ali went to him in March 1993, a month after the World Trade Center bombing, to obtain weapons, and he warned Siddig Ali that members of the group should not have contact; on May 30, 1993, he discussed the spring 1993 bombing plot with Siddig Ali and Salem, said the attack \"takes a lot of courage,\" and agreed to try to find detonators for them; and he contacted Mustafa Assad after meeting with Siddig Ali and Salem, met with Assad who is known to have been a bomb builder, and then told Siddig Ali that his source was working on the request.\n\nThe jury was not obliged to accept Hampton-El's claim that after the May 30, 1993, meeting with Siddig Ali and Salem, he deliberately distanced himself from the bombing plan because he did not want to be involved in violence against the United States. In numerous phone calls to Siddig Ali after the meeting, several of which Hampton-El initiated, he assured Siddig Ali that he was continuing to look for detonators and that he expected to obtain them soon. Hampton-El also frequently called his source for the detonators, Assad, during this time period.\n\nThe evidence was sufficient to permit a jury to find beyond a reasonable doubt that Hampton-El was continuously involved with group members throughout the life of the conspiracy, that he actively sought out detonators for Siddig Ali and Salem, and that he joined in the seditious conspiracy to make war on the United States.\n\nb. Attempted Bombing.\n\nThe evidence was also sufficient to show that Hampton-El aided and abetted the attempt to bomb by his efforts to find detonators. To be found guilty as an aider and abettor, a defendant must know of the criminal venture, have joined the criminal venture, shared in it, and contributed to it by some act. See United States v. Giraldo, 80 F.3d 674, 676 (2d Cir. 1995). Hampton-El asserts that he did not know of the criminal venture and he did not even know that the safehouse existed or that the co-defendants were attempting to construct bombs there. However, a reasonable trier of fact could have found that Hampton-El did know of the scheme after the May 30, 1993, meeting at his apartment with Siddig Ali and Salem. At that time, Salem testified, and the intelligible portions of the tape corroborate, that Hampton-El was informed that they planned to bomb the United Nations and the tunnels, and that Hampton-El agreed to help find detonators. He then sought out the detonators. Thus, the jury's verdict finding Hampton-El guilty of attempted bombing was reasonable and supported by sufficient evidence.\n\nE. Government Overinvolvement\n\nDefendants Khallafalla and Saleh argue that their conviction violated the Due Process Clause by reason of the Government's \"overinvolvement\" in the conspiracy. According to defendants, the Government impermissibly lent direction, technical expertise, and critical resources to the bombing plot through Salem, an informant. We reject this claim because the Government's conduct was within acceptable bounds.\n\nThe Supreme Court has suggested that in an extreme case, Government involvement in criminal activity might be \"so outrageous that due process principles would absolutely bar the Government from invoking judicial processes to obtain a conviction.\" United States v. Russell, 411 U.S. 423, 431-32 (1973); see also United States v. Alexander, 675 F.2d 34, 39 (2d Cir. 1982). Such an argument might in principle prevail even where, as here, the defendants were not entrapped by the Government. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e See United States v. Chervil, 949 F.2d 559, 565 (2d Cir. 1991). However, only Government conduct that \"'shocks the conscience'\" can violate due process. United States v. Chin, 934 F.2d 393, 398 (2d Cir. 1991) (quoting Rochon v. California, 342 U.S. 165, 172 (1952)); see also County of Sacramento v. Lewis, 118 S. Ct. 1708, 1717 \u0026 n.8 (1998) (holding that substantive due process bars executive conduct that shocks the conscience). The paradigm examples of conscience-shocking conduct are egregious invasions of individual rights. See, e.g., Rochon, 342 U.S. at 172 (breaking into suspect's bedroom, forcibly attempting to pull capsules from his throat, and pumping his stomach without his consent). Especially in view of the courts' well-established deference to the Government's choice of investigatory methods, see United States v. Myers, 692 F.2d 823, 843 (2d Cir. 1982), the burden of establishing outrageous investigatory conduct is very heavy, see United States v. Schmidt, 105 F.3d 82, 91 (2d Cir. 1997).\n\nThe Government's behavior, and in particular the role of Salem, does not shock the conscience. Undercover work, in which a Government agent pretends to be engaged in criminal activity, is often necessary to detect criminal conspiracies. If such work is to succeed, the undercover agent must have \"something of value to offer\" the conspirators. Russell, 411 U.S. at 432. Supplying such a resource \"can hardly be said to violate\" due process. Id. In Schmidt, we found that United States Marshals did not violate due process when they posed as hit men, accepted a prisoner's solicitation to murder two guards during an escape, and then conducted a controlled breakout. See Schmidt, 105 F.3d at 85, 92. In this case, Salem's contribution to the criminal conduct was proportionately far smaller: the defendants were already actively advancing a conspiracy, and they already had substantial resources and technical expertise. There is no evidence that the criminal conspiracy would have foundered without the Government's entry. The jihad organization had, after all, already bombed the World Trade Center without Salem's help. Moreover, as in Schmidt, the entry of the Government informant was intended not only to gather evidence, but also to prevent further death and destruction. See id. at 92. Such conduct is not outrageous, and it does not violate due process.\n\nF. Restriction on Cross-Examination\n\nEl-Gabrowny, joined by the other defendants, contends that the District Court erred in preventing defense counsel from cross-examining Emad Salem about racial bias he allegedly harbored against Black Muslims while working as an informant in the FBI's investigations, and from examining various agents as to whether Salem exhibited such bias.\n\n\"[Trial Judges retain wide latitude insofar as the Confrontation Clause is concerned to impose reasonable limits on such cross-examination based on concerns about, among other things, harassment, prejudice, confusion of the issues, the witness' safety, or interrogation that is repetitive or only marginally relevant.\" Delaware v. Van Arsdall, 475 U.S. 673, 679 (1986). Only when this broad discretion is abused will we reverse a trial court's decision to restrict cross-examination. United States v. Maldonado-Rivera, 922 F.2d 934, 956 (2d Cir. 1990). There was no abuse of discretion here. Considering the very weak foundation for the allegation of racial bias on Salem's part and the even weaker basis for allegations affecting his credibility on this account, we find the District Judge was well within his discretion in so limiting the cross-examination.\n\nEl-Gabrowny contends that our decision in United States v. Salerno, 937 F.2d 797, 810 (2d Cir. 1991), rev'd on other grounds, 505 U.S. 317 (1992), requires reversal here. In Salerno, we held that the District Court exceeded its discretion when it refused to allow a defendant to cross-examine FBI agents about their alleged bias against the defendant himself, where the agents allegedly tape recorded and transcribed his conversations so as to reflect unfavorably on him. 937 F.2d at 809. The circumstances in Salerno were significantly different. For example, here the alleged bias was against third parties, not against the defendant or other members of the defendant's racial or ethnic group. There was no substantial showing how the purported bias might have altered the evidence. Moreover, the District Court in Salerno had initially agreed with the defendant that he should be permitted to examine the agents about the alleged bias and instructed his counsel that he could do so as part of the defense case. When the time for the defense case arrived, the court denied him the promised opportunity to examine the agents. See id. at 810.\n\nThe circumstances in Salerno were far different from those present here; it does not suggest that Judge Mukasey abused his discretion in curtailing the cross-examination of Salem.\n\nG. Double Jeopardy Arising from Rule 29(a) Motion\n\nNosair challenges his convictions on Counts 9 and 10, which relate to the shooting of Postal Officer Carlos Acosta during Nosair's flight after the assassination of Meir Kahane, on grounds of double jeopardy. On June 28, 1995, at the close of the Government's case-in-chief, Nosair moved under Fed. R. Crim. P. 29(a) for judgment of acquittal of all counts against him, including the attempted murder charges in Counts 9 and 10. The Court denied the motion, but expressed serious questions regarding the sufficiency of the Government's evidence to sustain these counts and indicated that it would reflect further on the issue. See Tr. 13092-93, 12152, 13170. The defense case began on July 5.\n\nAfter further Discussion of Nosair's motion to dismiss Counts 9 and 10 under Rule 29(a) at the end of the day on July 12, the Government argued that the issue was \"precisely the same\" as considered by the Supreme Court in Yates v. Evatt, 500 U.S. 391 (1991), in which the defendant's conviction was upheld. Judge Mukasey responded, \"Same issue, different result.\" The colloquy continued as follows:\n\n\"Nosair's counsel: Has your Honor ruled?\"\n\n\"The Court: I have. Understand, it applies only to that part of Count 9 that charges attempted murder.\"\n\n\"Nosair's counsel: And it applies to Count 10, your Honor.\"\n\n\"The Court: It applies to all of Count 10. The jury would have nothing other than speculation to determine that kind of intent in this case.\"\n\n\"Nosair's counsel: Thank you, your Honor.\"\n\n\"The Court: Anything else? Good night. [Court is adjourned.]\" Tr. 14269-70. Before the trial resumed on July 17 (the next trial day), the Government submitted a further memorandum on the issue. See Tr. 14276. Before the close of the trial day, the Court made note that the facts in Yates were \"remarkably similar\" to those here, and gave rise to a jury question. Judge Mukasey said he would reread the cases and asked counsel to do the same. See Tr. 14440. After considering arguments from counsel the next trial day (July 19), the Judge expressed the view that \"The close bounce goes to the government in this situation, and this is a close bounce.\" Tr. 14536. Nosair's counsel then raised the issue of double jeopardy, asserting \"[Y]our Honor ordered on July 13 a judgment of acquittal with regard to Count 10.\" The Judge answered \"I said I was going to dismiss, I said I was dismissing that portion of Count 9, the charge of attempted murder, and all of Count 10.\" Tr. 14537. In response to defense counsel's argument that \"if your Honor has ordered a judgment of acquittal . . ., jeopardy has attached,\" the Court responded, \"That depends, I suppose, on whether my statement in open court is self-executing.\" Tr. 15538. Following a further exchange of memoranda, the District Court explicitly denied the Rule 29(a) motion on August 9. See Tr. 16091. The Court observed in rejecting the double jeopardy claim that judgment had not been entered and that the defendant had suffered no prejudice as the result of what the Court described as its \"vacillation.\" All Discussions and rulings regarding the motion to dismiss occurred outside the presence of the jury.\n\nNosair now argues, as he did in the District Court, that the oral ruling operated to acquit him on Counts 9 and 10, and that the reversal of this ruling resulted in the submission of these counts to the jury, subjecting him to jeopardy a second time on the same charges.\n\nThe general rule is that a \"judgment of acquittal [on a charge], whether based on a jury verdict of not guilty or on a ruling by the court[,]\" terminates the proceeding on that charge and bars any subsequent prosecution for the same offense. United States v. LoRusso, 695 F.2d 45, 54 (2d Cir. 1982); United States v. Scott, 437 U.S. 82, 91 (1978). \"Where no judgment has been entered, however, and there has been no dismissal of the jury (nor any indication to the jury of a ruling that could prejudice the defendant on such counts as are eventually submitted), there appears to be no constitutional impediment to the court's modification of its oral decision to dismiss . . . .\" LoRusso, 695 F.2d at 54. We have further indicated that the timeliness of a district court's decision to reconsider is an important factor in evaluating whether a reversal of an oral grant of acquittal subjects a defendant to a successive prosecution within the meaning of the Double Jeopardy Clause. See United States v. Washington, 48 F.3d 73, 79 (2d Cir. 1995).\n\nUnder the circumstances presented by this appeal, we find that the District Court acted within its power. The event that the defendant claims constituted an acquittal occurred at the very end of a trial week, out of the jury's presence. Before the proceedings reopened on Monday morning, the Government had moved for reconsideration, and the District Court promptly signaled its openness to reconsider the matter of the defendant's motion for acquittal.\n\nNone of these proceedings involving the defendant's motion took place in the presence of the jury. The jury was never instructed to the effect that trial had terminated on the charges in question. Nosair suffered no prejudice of any kind; he did not lose any opportunity to offer evidence, or commit himself to any course of defense that needed reassessment in light of the changed ruling. Indeed Nosair's trial counsel appears to have acknowledged that Nosair's objection to reconsideration was not based on a claim of prejudice. See Tr. at 14539. This is therefore not a case like United States v. Blount, 34 F.3d 865 (9th Cir. 1994), where the district court reinstated the dismissed counts after the defendant had presented his defense, and after the court announced to the jury that the dismissed counts were \"no longer in the case.\" Id. at 867, 868. In view of these considerations, we reject Nosair's contention that he was \"twice put in jeopardy.\" As in LoRusso, 695 F.2d at 45, we conclude that the trial Judge could rescind his oral ruling granting a motion to dismiss a count and permit the count to continue before the jury without violating the defendant's right under the Double Jeopardy Clause.\n\nH. Exclusion of Expert Testimony\n\nRahman contends the trial court violated his right to due process by denying him the opportunity to present his defense. He contends his defense depended on his ability to prove \"the essentially religious nature of his intent.\" He sought to advance his defense by offering expert witnesses on Islamic religious traditions and international human rights. Upon the Government's objection, the District Court excluded their testimony.\n\nUnder Fed. R. Evid. 702, expert testimony may be admitted if the court finds that it will \"assist the trier of fact to understand the evidence or to determine a fact in issue.\" Even relevant testimony, however, is properly excluded if its probative value is substantially outweighed by the danger of unfair prejudice, confusion, or waste of time. See Fed. R. Evid. 403. District court rulings on the admissibility of expert testimony are reviewed for abuse of discretion. See United States v. Valdez, 16 F.3d 1324, 1332 (2d Cir. 1994); United States v. Cruz, 797 F.2d 90, 95 (2d Cir. 1986); see also General Elec. Co. v. Joiner, 118 S. Ct. 512, 519 (1997) (same, for District Court rulings on expert scientific testimony).\n\nRahman submitted lengthy offers of proof on the subjects to be covered by the proposed testimony. These offers, from which we quote extensively below, were submitted in a letter from one of Rahman's lawyers. Counsel argued that this testimony would help the jury to understand Rahman's ministerial relationship with his co-defendants, and would show that his conversations with them amounted only to \"legitimate and well-recognized religious practice\" rather than a criminal conspiracy. The points to be covered by the proposed expert testimony fell into several different categories. Most of the material provided general information about Islam and suggested that Rahman's actions and statements were governed by Islamic law. These included the following statements:\n\n\"'Islam' means submission to the will of God. [A] strict monotheism is at the heart of Islamic theology.\"\n\n\"[P]olytheism (shirk) is the concept of worshiping more than one god and is anathema to the strict monotheism of Moslems.\"\n\n\"Muslim clerics' sermons are frequently combined with Quranic references . . . .\"\n\n\"[T]he Arabic word \"sharia\" refers to the corpus of Islamic law which is derived from two main sources, the Quran and the sayings of the Prophet as well as analogical reasoning and the consensus of scholars . . . .\"\n\n\"Islam . . . started in the 7th Century A.D. and now claims one billion adherents in the world.\"\n\n\"[T]he five pillars or basic precepts of Islam [are] Faith, Prayer, Alms, Pilgrimage, and Fasting.\"\n\n\"Muslim clerics and scholars have preached about . . . a Muslim's necessity to engage in jihad . . . .\"\n\n\"[J]ihad [had its] origins in Islam after Prophet Mohammed began preaching in the 7th Century . . . .\"\n\n\"[J]ihad is cast in the mold of a legal doctrine . . . .\"\n\n\"Jihad has come to mean . . . the combatting of oppression . . . .\"\n\n\"[T]he Muslim community as a whole has a collective duty or obligation to engage in armed struggle in the path of God [, which] must be organized and announced by a Caliph or Sultan. It is only when the enemy attacks Muslim territory that jihad becomes an individual duty . . . .\"\n\n\"[I]t is an individual obligation for able-bodied Muslims from all over to come to the aid of their brethren [and] that jihad is governed by a very clear set of rules such as an invitation to embrace Islam, treatment of prisoners and division of spoils.\"\n\n\"[A] person who provides a fatwa is called a Mufti.\"\n\n\"[A]ccording to Islamic law a leadership cannot be conferred on a blind person.\"\n\n\"[A]n Imam . . . leads communal prayer and that a sheik is . . . an elder who is accorded respect and deference.\"\n\n\"[A] sheik may also be a scholar in which case he has . . . certain duties [including] to lead the Muslims in prayer and deliver a Friday sermon, . . . provide lessons and religious instruction, . . . to provide advice, counsel and mediation in situations of dispute, and . . . where he is questioned on a matter involving the interpretation of Islamic law, to provide . . . a non-binding advisory opinion . . . .\"\n\n\"[W]hen a scholar is being asked to render an opinion about a subject matter for which he knows the answer he may not simply dismiss the questioner and that to do so would erode his authority . . . .\"\n\nLetter from Abdeen Jabara, counsel for Rahman, to Andrew C. McCarthy, Asst. U.S. Atty. (July 7, 1995) (hereinafter \"Jabara Letter\").\n\nWe find no abuse of discretion in Judge Mukasey's rejection of this testimony. The vast majority of what was proffered was not relevant to the issues before the jury. If the evidence showed that Rahman conspired to levy war against the United States or solicited others to commit crimes of violence--including mass killing and destruction through the blowing up of buildings and tunnels--it would not constitute a defense that he was justified in doing so within a framework of Islamic law. See Employment Division v. Smith, 494 U.S. 872, 879 (1990), reaffirmed in City of Boerne v. Flores, 521 U.S. 507 (1997); see also United States v. Bailey, 444 U.S. 394, 410 (1980) (no duress where defendant had \"reasonable, legal alternative to violating the law\"); United States v. Bakhitiari, 913 F.2d 1053, 1057 (2d Cir. 1990) (defense of duress or coercion requires threat that induces a well-founded fear of impending death or serious bodily harm, from which unlawful act was only reasonable means of escape); 1 LaFave \u0026 Scott, Substantive Criminal Law § 5-3 at 618-19 (1986).\n\nOne of the issues stressed by defense counsel in the argument on the admissibility of the testimony was the fact that an Islamic scholar, when asked to render an opinion, \"may not simply dismiss the questioner . . .[without] erod[ing] his authority, stature and position as a scholar.\" Jabara Letter at 2-3. We agree with the District Judge that such details of Islamic tradition were irrelevant to the issues before the jury. As a matter of United States law, the fact that a Mufti or scholar must render an opinion when asked would neither explain nor excuse solicitation to commit acts of terrorism and violence when rendering that opinion. Id.\n\nOther passages of the proffer seemed designed to suggest to the jury that Rahman could not have conspired in or solicited acts of terrorism against the United States because this would have been contrary to the teachings of Islam. Among these items were statements:\n\n'that a security pledge ensues between a Muslim who enters the country of the non-Muslims with the permission and acceptance of that country and [that] . . . the Muslim is legally required to remain at peace with his host country and may not violate that pledge by undertaking or engaging in acts that would breach the security and safety of its citizens and inhabitants.\" Jabara Letter at 3.\n\nJudge Mukasey was within his discretion in excluding the expert testimony in this category because it was of marginal relevance and was likely to cause confusion among jurors. The issue was whether the evidence showed that Rahman, with the requisite criminal intent, conspired to wage war on the United States through acts of terrorism or solicited others to commit crimes of violence. The question whether such acts on his part would have been condoned or forbidden by Islamic law could lead to an evidentiary dispute about Islamic law that would have little likelihood of illuminating whether he committed the forbidden acts of terrorism.\n\nA third category of proffer was of expert testimony purporting to explain what Rahman's thoughts and intentions were.\n\nThe expert would have testified that Dr. Abdel Rahman subscribes first and foremost to the concept of jihad to, as he sees it, cleanse or purify nominally Muslim countries . . . . and that Dr. Abdel Rahman has concentrated on urging jihad to overthrow the secular government in Egypt and in defending Muslims in what Dr. Rahman calls the fields of jihad, Bosnia, Palestine, the Philippines, Somalia, southern Sudan, and formerly in Afghanistan. Id. at 2.\n\nIt was not an abuse of discretion for Judge Mukasey to conclude that this proffer, rather than providing evidence of Rahman's past behavior or activities, constituted an effort to tell the jury the defendant's intentions through the mouths of witnesses other than himself. As Judge Mukasey explained, the defendant's experts were not competent to testify to Rahman's intentions or beliefs.\n\nWe conclude that Judge Mukasey was well within his discretion in excluding all of the proffered expert testimony, of which examples are given above, that fell into the categories described.\n\nIt is true that the proffer included a few items of relevant matter--in particular, the meanings of the words \"jihad\" and \"fatwa.\" The proffer asserted, for example:\n\n\"The Arabic word 'jihad' is the verbal noun of the Arabic verb 'jahada,' which means \"to endeavor, to strive, to struggle\" and that in a Muslim religious context it can have several different meanings . . . [including] the personal struggle against one's evil inclinations or efforts toward the moral uplift of society or towards the spread of Islam . . ., the combatting of oppression or obstruction in the exercise of the faith of Muslims . . . always in the path of God to underscore the religious character of the struggle.\"\n\n\"[A] fatwa is merely a non-binding opinion by an Islamic scholar as to what [is] the position of Islamic law . . . .\" Id. at 1-2.\n\nThe Government's evidence showed that Rahman had exhorted his followers to \"jihad,\" and on various occasions had delivered a \"fatwa.\" Government witnesses spoke of \"jihad\" organizations as terrorist organizations. Tr. 1994-2005. These portions of the proffer were relevant to tell the jury that the word \"jihad\" could have various meanings and did not necessarily connote terrorist violence, and that a \"fatwa\" is not a command, but merely an opinion.\n\nHad Rahman offered to call an expert on the Arabic language or on the Muslim religion simply to prove that jihad can have a nonviolent meaning, and that fatwa means opinion, we have no reason to doubt that Judge Mukasey would have permitted this testimony. In fact, the Judge said so:\n\n\"Rahman's counsel: They have one conversation where Emad Salem asks for a religious opinion, a fatwa--not a command, a religious opinion. And we have the right to show that that is all that is.\"\n\n\"The Court: Nobody is denying you this right to show that or to argue that.\" Tr. 14053.\n\nIndeed, shortly thereafter, the defense elicited from Siraq Wahhaj, a witness called by the defendant El-Gabrowny, the following testimony on the meaning of the term \"jihad.\"\n\nIt's a struggle. That's what the word jihad means, it means struggle. It could take on another meaning for instance in Afghanistan, Muslims fighting for their liberation against the Russians. That's jihad also. But for us, in the context of our environment, jihad is, [A] cleaning up our community of drugs, [B] getting our family, our men, strong, getting them jobs, taking care of their family. That's a kind of jihad or struggle. Tr. 14136-37.\n\nSubsequently, Rahman elicited through another witness, Mona Ahmed, the meaning of the word \"fatwa.\" The witness testified to the effect that a fatwa was an opinion. When asked, \"Are you commanded to follow that opinion?\" Ahmed responded,\n\n\"No, he does not command us anything. There is something I would like to know, and I ask him what is right and what is wrong, and he would answer, and its all up to me what I see.\" Tr. 14583-84\n\nThus, Judge Mukasey made clear that the defendants were permitted to offer expert evidence of the meaning of words shown by the Government's evidence to have been used by the defendants, and they did so. As to the excluded expert testimony on Islamic traditions, we agree with the District Judge's assessment that the experts' proffered testimony would have imported more confusion than clarification to the trial. It was properly excluded.\n\nRahman also challenges Judge Mukasey's exclusion of two additional experts. One, the director of a group that monitors human rights in the Middle East, would have testified about human rights abuses committed by the Egyptian government, including the detention, arrest, and execution of dissidents. The other, identified as \"an expert in international terrorism and security,\" Letter from Lynne F. Stewart, counsel for Rahman, to Andrew C. McCarthy, Asst. U.S. Atty. (June 16, 1995), would have testified that Rahman \"has been solely focused\" on \"bringing an Islamic government to Egypt by any means necessary,\" that \"the United States government which gives more than three billion dollars annually to the Mubarak regime, . . . is adamantly opposed to such change,\" and that any attack on the U.S. government \"would be contrary to and dilute Dr. Abdel Rahman's Egyptian agenda,\" id. (July 6, 1995).\n\nBoth experts were properly barred from testifying. Egypt's human rights record was not in dispute, nor was it relevant to these proceedings. The alleged human rights record of Egypt, combined with whatever relationship between the governments of the United States and Egypt which Rahman believes to exist, would not entitle Rahman to wage terrorist activity against the United States or to plot to murder the President of Egypt. To allow the jurors to hear such evidence would distract them from the issues on which they needed to pass. The same is true of the proposed testimony of the international security expert. Rahman's commitment to end what he perceived to be the U.S. government's opposition to establishing Islamic rule in Egypt could not justify a terrorist campaign against either Egypt or the United States. The expert's testimony that taking terrorist action against the United States was contrary to Rahman's agenda was speculation by a person who was not competent to testify to Rahman's intentions. His further proposed testimony--that the trial defendants did not have the necessary funding or expertise to have undertaken the World Trade Center bombing--was again speculation without legal competence. The witness was not in a position to know what funding or expertise the defendants possessed. The proposed testimony as to what were Rahman's intentions and purposes was again an effort to tell the jury Rahman's thoughts through a witness who was not competent to testify to them.\n\nI. Exclusion of Taped Conversations\n\nHampton-El contends that the exclusion of a tape-recorded conversation between Salem and Agent Napoli was error that deprived Hampton-El of his full opportunity to present a defense. The conversation occurred on June 23, 1993, just after Salem had spoken with Hampton-El. Hampton-El had told Salem that though he had not obtained \"results . . . at this time,\" he had made inquiries and would \"continue\" his \"efforts\" and \"hopefully Allah . . . will open the door for us.\" Govt. Ex. 367T. From earlier evidence, the jury was entitled to infer that Hampton-El was referring to his efforts to obtain detonators. In the excluded conversation, Napoli says to Salem, \"we got to get the Doctor [Hampton-El] involved, buying material, buying ammunition . . . .\" Hampton-El Ex. GG-14. When Napoli asks if Salem has any indication that Hampton-El is going to \"go with us [in the bombing of tunnels],\" Salem replies, \"No, no, no has nothing to do with us. I talked to the Doctor myself three or four hours ago.\" Id. Salem reported that Hampton-El had said, \"I am sorry brother, I couldn't help you in this time, it is very tough, I couldn't get you what you want.\" Id.\n\nHampton-El contends that the exclusion of this conversation prevented the jury from hearing important evidence negating his involvement in the plot. The contention fails for several reasons. First, as Judge Mukasey said to defendant's counsel, the tape was offered primarily \"to show an agent's evaluation of the case against your client,\" Tr. 14845, the inference being that Napoli must have thought the case against Hampton-El was weak because he urged Salem to obtain more evidence. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e But, as the Judge correctly noted, the agent's view of the case was irrelevant. Defense counsel, responded, \"Your Honor, I agree with you.\" Id. Then, shifting ground, counsel said that he was offering the tape \"to show that the stuff was not there on June 24,\" id., during the early morning hours of which the raid at the safehouse had occurred. But to this claim, Judge Mukasey properly observed, \"Nobody claims the stuff was there on June 24.\" Id. Moreover, on cross-examination, Hampton-El's counsel elicited Salem's acknowledgment that Hampton-El had not supplied grenades or detonators. Tr. 6573-74. Salem also recounted his recorded statements that the doctor had his own project and that the doctor's projects had \"nothing to do with us.\" Tr. 6589-90. Indeed, the tape of Hampton-El's conversation with Salem was played to the jury, further diminishing the probative value of the tape of Salem's report of this conversation to Napoli.\n\nHampton-El further contends that the Napoli tape would prove the falsity of Salem's \"yes\" answer to the question, on his cross-examination, \"You were just saying that you expected the following morning to pick up the stuff from him [Hampton-El], is that correct?\" Tr. 6600. But the Napoli conversation had little tendency to prove that Salem's response was false. Hampton-El had told Salem about continuing efforts to obtain detonators, and Salem could truthfully believe that Hampton-El's willingness to meet with those building bombs indicated that Hampton-El expected to obtain the detonators he was seeking. If counsel, knowing about the Napoli tape, wanted to press Salem that he really expected Hampton-El to obtain detonators in the future, not necessarily \"the following morning,\" he was free to do so, but the point was not pursued.\n\nFinally, the substantial evidence of Hampton-El's long-standing involvement with the conspirators, culminating in his recorded expression of continuing efforts to obtain detonators, knowing the plans for the Spring 1993 bombing, render the exclusion of the Napoli tape harmless error, if error at all.\n\nJ. Loss of Exculpatory Evidence\n\nKhallafalla and Saleh argue that the Government deprived them of a fair trial by losing, or directing Salem to destroy, two classes of exculpatory tape recordings. During much of the investigation, Salem recorded many of his conversations on his own, and defendants maintain that the Government later encouraged Salem to make these recordings and destroy them selectively. In the final weeks of the investigation, Salem cooperated with the FBI in recording his conversations; defendants claim that he and the FBI destroyed some of these recordings as well.\n\nWhen it occurs, the Government's loss of evidence may deprive a defendant of the right to a fair trial. See United States v. Bakhtiar, 994 F.2d 970, 975-76 (2d Cir. 1993). Whether that loss warrants sanctions depends on the Government's culpability for the loss and its prejudicial effect. See id. Before these factors become relevant, however, the record must first show that evidence has been lost and that this loss is \"chargeable to the State.\" Colon v. Kuhlmann, 865 F.2d 29, 30 (2d Cir. 1988). After a post-trial hearing at which Khallafalla and Saleh testified, the District Court found that the Government had not lost any evidence, and that any lost evidence, if it existed, would not have been exculpatory. We review these findings for clear error, see United States v. Morgenstern, 933 F.2d 1108, 1116 (2d Cir. 1991), and find none.\n\nSalem's personal taping operation was one troubling aspect of Salem's troubled relationship with the FBI. Before the spring of 1993, Salem had agreed only to serve as a confidential informant, not as a trial witness. FBI agents repeatedly told Salem not to make recordings. Nonetheless, Salem surreptitiously recorded many of his conversations, using an automatic device that recorded anyone who called, including family members and others as well as members of the conspiracy. Judge Mukasey found that Salem made these recordings both to create a record of his innocence and to record the terms of his cooperation with the FBI. When Salem intimated to FBI agents that he was keeping his own tapes, they first told him to stop, then later told him that taping was permissible, fearing that any stronger response (telling him to stop or turn them over) would infuriate him. This worry proved correct: in July 1992, when agents asked Salem to record official tapes as evidence, he quit the investigation.\n\nAlthough Salem did record over some of his personal tapes, these erasures are not chargeable to the Government. The tapes in question were not recorded at the Government's request or instruction. There is no indication that Government agents made any request or instruction to destroy any of the tapes.\n\nDefendants' other claims of lost evidence are meritless. After the investigation, when Salem clearly alerted investigators that he had personal tapes, the Government collected them. Although the U.S. Attorney's Office improvidently returned some tapes to Salem for a short period, there is no evidence that he altered or destroyed any of those tapes at that time. The record also shows that the Government recovered all of the tapes that Salem made under formal FBI supervision during the last weeks of the investigation. Once again, although we share Judge Mukasey's misgivings about the Government's method of tracking those tapes--and, in particular, about its failure to track tapes based on serial numbers--there is no evidence that any of these tapes were lost. We also agree with Judge Mukasey that there is no reason to believe any lost tapes would have been exculpatory. Defendants' post-trial claims as to the contents of the \"missing tapes\" simply are not credible. For example, both defendants have said that \"missing tapes\" would show that they were told that the jihad sought to aid Bosnia. However, existing tapes establish that both men heard and approved when other members of the jihad detailed the plans to bomb targets in New York City.\n\nK. Government's Summation\n\nFadil Abdelgani contends that reversal is required on the ground that the Government appealed to the jury's \"sense of fear\" when the prosecution stated during summation that \"[t]he defendants in this room conspired to steal from Americans their freedom from fear, and for that they must be held accountable.\" Tr. 18928. The Government has \"broad latitude in the inferences it may reasonably suggest to the jury during summation.\" Casamento, 887 F.2d at 1189. Accordingly, defendants who contend that a prosecutor's remarks warrant reversal \"face a heavy burden, because the misconduct alleged must be so severe and significant as to result in the denial of their right to a fair trial.\" United States v. Locascio, 6 F.3d 924, 945 (2d Cir. 1993). The Government's remark was not inappropriate because the conspiracies in question were designed to commit acts of terrorism, which by their nature are intended to instill fear in a population. There was no breach of Abdelgani's fair trial rights.\n\nL. Jury Instructions\n\n1. Transferred Intent\n\nNosair challenges the Court's instruction on the doctrine of transferred intent as applied to Counts Eight and Nine. These counts charged that Nosair shot Franklin and Acosta, in violation of 18 U.S.C. § 1959, as he was fleeing after the murder of Kahane. In charging on Count Seven, the Kahane murder, Judge Mukasey instructed the jury that an element of the section 1959 RICO offense was that Nosair murdered Kahane \"in order to maintain or increase his position in the Jihad Organization.\" Tr. 20509. Then, with respect to Counts Eight and Nine, the Judge similarly charged that an element of these offenses was that \"Mr. Nosair assaulted Mr. Franklin as charged in Count Eight and Mr. Acosta as charged in Count Nine, in connection with maintaining and increasing his position in the Jihad Organization.\" Tr. 20514-15. Elaborating on this element, the Judge charged as follows:\n\n\"If you find that Mr. Nosair committed the assaults charged in Counts Eight and Nine or the attempted murder charged in Count Nine, you may decide whether any such crime was committed in aid of racketeering activity by applying the legal principle of transferred intent . . . . That principle says that if a defendant planned to commit a murder to maintain or increase his position in an enterprise and, in attempting to carry out that plan, committed a violent assault or attempted murder on another person, the intent of the planned murder may be transferred to the other crimes.\"\n\nWhat this means for your purposes is that the government may prove the second and third elements of the offense charged in Counts Eight and Nine by proving that on November 5, 1990, the defendant El Sayyid Nosair specifically intended to cause the death of Meir Kahane for the purpose of maintaining or increasing his position in the enterprise, and then willfully shot Irving Franklin, as charged in Count Eight, and Carlos Acosta, as charged in Count Nine, in the course of carrying out or immediately fleeing from the Kahane homicide. Tr. 20515-16.\n\nNosair acknowledges the validity of the doctrine of transferred intent, but contends that it was impermissibly invoked in this case to permit the jury to transfer to the Franklin and Acosta shootings the motive that Nosair had when he murdered Kahane. Application of the doctrine to transfer motive, Nosair contends, permits the jury to draw an irrational inference, in violation of the Due Process Clause. See Francis v. Franklin, 471 U.S. 307, 314-15 (1985) (permissive inference violates Due Process Clause \"if the suggested Conclusion is not one that reason and common sense justify in light of the proven facts before the jury\").\n\nThe doctrine of transferred intent, in its traditional application, permits the fact-finder to attribute or \"transfer[]\" to a defendant who shoots at one person with intent to kill and inadvertently kills another the intent to kill the second person. See 4 W. Blackstone, Commentaries *200-01 (Harper ed. 1854). The doctrine has been recognized by the Supreme Court, see Yates v. Evatt, 500 U.S. 391, 409 (1991), and by this Court, see United States v. Concepcion, 983 F.2d 369, 381 (2d Cir. 1992).\n\nContrary to Nosair's contention, Concepcion has already established for this Circuit that the transferred intent doctrine is applicable to transferred motive. Concepcion had approached a retail drug location in order to use violence to settle a territorial dispute with a rival gang. See id. at 375. When a man named Gines got in his way, Concepcion shot him, and Gines died from his wounds. See id. We upheld a section 1959 conviction on the ground that Concepcion \"set out to commit a proscribed act of violence in order to maintain or increase his position in the enterprise, and that, in the course of so doing, he committed that act against a person who got in his way.\" Id. at 382.\n\nEven if applicable to transferred motive, as in Concepcion, Nosair endeavors to limit the doctrine to instances where \"the very same act of firing the weapon at the intended target[] produces an immediate and unintended victim.\" Brief for Nosair at 64. Concepcion refutes such a limitation. Concepcion's shot at Gines was aimed only at Gines; Concepcion's original target had not yet been located. It was the relationship of the shooting to Concepcion's objective that permitted the transfer of a motive to maintain or increase his position in the enterprise.\n\nNosair further contends that the shootings of Franklin and Acosta were too far removed in space and time from the Kahane murder to permit a rational inference of transferred motive and that it was not \"necessary\" to shoot the additional victims in order to kill Kahane. See id. at 66. However, there was no significant gap, either in space or time, between the shootings. Franklin was shot as Nosair ran out of the hotel room in which he had just shot Kahane, and Acosta was shot moments later within two blocks of the hotel, as Nosair endeavored to escape. Judge Mukasey appropriately limited the availability of the permissible inference of transferred motive by instructing the jury that the motive element could be found if Nosair shot his additional victims \"in the course of carrying out or immediately fleeing from the Kahane homicide.\" Tr. 20516. Furthermore, though it was not \"necessary\" to shoot the two subsequent victims in order to kill Kahane, the requisite relationship to the Kahane murder is supplied by Nosair's attempt to escape. Since his escape could readily be found to be a further step taken in order to maintain or increase his position in the enterprise after killing Kahane, the shootings of those who \"got in his way,\" Concepcion, 983 F.2d at 382, could also be so found. The transferred motive instruction was entirely proper.\n\n2. Entrapment Defense\n\nHampton-El makes the totally insubstantial claim that in giving the jury an instruction on entrapment Judge Mukasey undercut that defense by \"marshal[ing] evidence that applied only to the so-called 'safehouse defendants,'\" Brief for Hampton-El at 81, thereby, Hampton-El contends, excluding him from the defense. No marshaling occurred, and those not connected to the safehouse were not excluded from the entrapment defense. The District Judge appropriately referred to the group of items in the safehouse that had been provided by the Government's agent, Salem, in the course of explaining both that such items could be considered on the issue of inducement and that the furnishing of such items did not constitute a per se impropriety by the Government. Tr. 20553-54. There was no objection to this instruction, and it was entirely correct.\n\n3. Intoxication \"Defense\"\n\nAlvarez challenges the District Court's instruction on what he characterizes as an intoxication defense. He contends that he presented evidence of his frequent cocaine use only as a fact that, in combination with other facts, such as his psychological problems, precluded the required finding, beyond a reasonable doubt, of specific intent. He insists that he did not assert cocaine intoxication as a defense and contends that the instruction on intoxication raised a straw man defense and trivialized his contention as to specific intent since there was no evidence of constant use of cocaine throughout the entire period of his participation in the conspiracy.\n\nThe instruction, set out in the margin, \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e was appropriate in view of the testimony of Alvarez concerning his cocaine use and that of Dr. Aranda, the defendant's clinical psychologist, concerning the effect of such use on a person with Alvarez's psychological problems. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e The instruction, the wording of which is not challenged, was \"needed to 'spear a red herring,'\" United States v. Lewis, 780 F.2d 1140, 1143 (4th Cir. 1986) (quoting United States v. Cheung Kin Ping, 555 F.2d 1069, 1074 (2d Cir. 1977)) (intoxication instruction given over defendant's objection), and Alvarez could not avoid it by characterizing his evidence as only \"facts\" rather than a \"defense.\" United States v. Lavallie, 666 F.2d 1217, 1219 (8th Cir. 1981), on which Alvarez relies, involved a defendant who disputed only his commission of the alleged act, rather than his intent, which Alvarez disputed, and the Eighth Circuit subsequently limited Lavallie to its facts and permitted an intoxication instruction even as to a general intent offense, see United States v. Norquay, 987 F.2d 475, 480 (8th Cir. 1993). The final paragraph of Judge Mukasey's instruction adequately guarded against the risk that the jury might focus solely on intoxication, to the exclusion of Alvarez's total challenge to the proof of specific intent.\n\n4. Use of Firearm\n\nAlvarez also challenges the portion of the instruction on Count Sixteen (using and carrying an Uzi semi-automatic rifle) that explained the \"use\" prong of 18 U.S.C. § 924(c). As the Government recognizes, the instruction, though proper when given, lacked the \"active employment\" limitation subsequently required by Bailey v. United States, 516 U.S. 137, 144 (1995). Nevertheless, the omission was harmless error since the evidence overwhelmingly showed that Alvarez carried the weapon, see United States v. Pimentel, 83 F.3d 55, 60 (2d Cir. 1996) (faulty \"use\" charge is harmless error where jury was instructed on \"carrying\" and evidence showed that defendants transported weapon in his car); United States v. Giraldo, 80 F.3d 667, 678 (2d Cir. 1996) (same), and the verdict on Count Fifteen (transporting the Uzi in interstate commerce) confirms the jury's understanding that, on the evidence presented, Alvarez carried the weapon.\n\nM. Ineffective Assistance of Counsel\n\nFour appellants, Rahman, El-Gabrowny, Elhassan, and Fadil Abdelgani, make a variety of claims concerning ineffective assistance of counsel. In response to a motion by the latter three to have their trial counsel relieved from representing them on appeal, this Court appointed supplemental counsel to present their claims of ineffective assistance.\n\nThe basic standards concerning the requisite quality of representation, see Strickland v. Washington, 466 U.S. 668, 687-88 (1984), the right to proceed pro se, see Faretta v. California, 422 U.S. 806 (1975), and the Court's obligation to inquire concerning a counsel's conflict of interest, see United States v. Levy, 25 F.3d 146, 152-53 (2d Cir. 1994); United States v. Curcio, 680 F.2d 881 (2d Cir. 1982), are well known and need not be elaborated. We therefore turn to the individual claims.\n\n1. Rahman\n\nRahman first contends that Judge Mukasey erred in disqualifying the firm of Kunstler \u0026 Kuby from representing him. The District Court was properly concerned that this firm could not render unconflicted representation because it was serving as counsel for co-defendants El-Gabrowny and Siddig Ali. After conducting a Curcio hearing, see Curcio, 680 F.2d at 888-90, Judge Mukasey reasonably concluded that conflicts existed and that Rahman demonstrated such an inadequate understanding of the risks of conflicted representation as to preclude an effective waiver. See United States v. Rahman, 837 F. Supp. 64 (S.D.N.Y. 1993). Accordingly, he obliged the firm to choose among its clients, and upon the firm's refusal to choose, he applied a rule of temporal priority and disqualified the firm from representing the last client to retain it, Rahman. See id. at 72. The Court's handling of the conflicts issue was entirely proper.\n\nThereafter, Rahman unequivocally informed the Court that he wished to proceed pro se, and, despite the Court's repeated suggestions that he reconsider, he represented himself for fourteen months of the pretrial period, until Lynn F. Stewart, Esq., and later two other attorneys, appeared for Rahman. Rahman contends that the District Court erred in permitting him to proceed pro se for such an extended period of time during the pretrial phase of a complicated case. The Court's decision was meticulously made and was well within its proper exercise of discretion.\n\nFinally, Rahman claims that he was denied effective assistance of counsel because of the District Court's denial of Stewart's request for a continuance of two and one-half months, made shortly after she entered her appearance. In denying her request, Judge Mukasey adhered to the previously established date for jury selection, but agreed to postpone the taking of evidence. As it happened, Rahman's subsequent illness resulted in a postponement of jury selection, and evidence was not presented until early February 1995, thus effectively affording Stewart, as she acknowledged, the additional preparation time she had sought. This aspect of Rahman's complaint is without merit.\n\n2. El-Gabrowny\n\nEl-Gabrowny, apparently acknowledging that the District Court properly disqualified Kunstler \u0026 Kuby from representing him for numerous entirely valid reasons, see United States v. Rahman, 861 F. Supp. 266 (S.D.N.Y. 1994), contends that the pretrial representation by the conflict-burdened firm impaired his defense. The claim is without merit. New counsel appeared fully six months before the trial began and provided a vigorous defense. The only pretrial deficiency alleged is the failure of the Kunstler firm to obtain a severance; however, the firm made such a motion before the conflicts that led to its disqualification arose, and the motion, vigorously presented, was justifiably denied. The claims of ineffectiveness on the part of El-Gabrowny's trial counsel are entirely insubstantial. In fact, his representation was exemplary.\n\n3. Elhassan\n\nElhassan's first complaint is that the District Court erred in denying his request to proceed pro se, a request made two weeks after the trial had begun. Judge Mukasey's decision was well within the broad discretion of a district Judge considering an application for self-representation made after a trial has begun. See United States v. Stevens, 83 F.3d 60, 66-67 (2d Cir. 1996). Elhassan's request was grounded only on a vague claim of \"mistrust\" of counsel, and the risk of trial disruption was clear. See United States ex rel. Maldonado v. Denno, 348 F.2d 12, 15 (2d Cir. 1965).\n\nSecond, Elhassan makes the frivolous claim that his trial counsel was ineffective for failing to make a severance motion, yet she made such a motion to sever Elhassan's case from Abouhalima's, and joined in the other defendants' motions for a broader severance.\n\n4. Fadil Abdelgani\n\nFadil Abdelgani contends that a conflict of interest existed between him and his trial counsel. In fact, no conflict impairing counsel's ability to render effective assistance existed; at most, disagreements arose concerning various aspects of trial strategy. Nor did a conflict warranting disqualification arise when trial counsel responded candidly to the Court's inquiry, after his client had made accusations about him. There was not remotely the \"complete breakdown of communication or an irreconcilable conflict which leads to an apparently unjust verdict.\" McKee v. Harris, 649 F.2d 927, 931 (2d Cir. 1981) (citation and internal quotation marks omitted).\n\nFinally, there is no merit to the contention of El-Gabrowny, Elhassan, and Fadil Abdelgani that they have received ineffective assistance of counsel on appeal to the extent that their trial counsel have presented their primary appellate arguments. Their trial counsel performed ably at trial and have continued to do so on appeal.\n\nN. Claim of Cumulative Errors\n\nRahman argues that the \"cumulative unfairness\" of his trial amounted to a violation of due process and requires reversal of his conviction.\n\nIt is true that the effect of multiple errors in a single trial may cast such doubt on the fairness of the proceedings that a new trial is warranted, even if no single error requires reversal. See, e.g., United States v. Fields, 466 F.2d 119, 121 (2d Cir. 1972); United States v. Guglielmini, 384 F.2d 602, 607 (2d Cir. 1967). However, Rahman has made no such showing. Indeed, most of the \"errors\" he cites in support of his cumulative-unfairness claim were not errors at all. For example, he challenges the introduction of allegedly prejudicial evidence against his co-defendants after the District Court denied the severance motion and the District Court's exclusion of expert testimony on Islamic religious practices--both claims we have rejected on their merits elsewhere in this opinion. See Part III(C) and Part III(H), supra.\n\nRahman's assertions that the searches and wiretaps used to obtain evidence against him were unconstitutional were all thoroughly considered and rejected by the Court below. See United States v. Abdel Rahman, 861 F. Supp. 247, 249-53 (S.D.N.Y. 1994); United States v. Abdel Rahman, 1994 WL 388918, at *1-*3 (S.D.N.Y. July 22, 1994). On appeal, Rahman has provided no new arguments or authority to support his contention that this evidence was illegally obtained, and we do not find the District Court's decisions to be in error.\n\nLastly, Rahman cites the prejudice he allegedly sustained when the District Court denied the defendants' motion for a mistrial following defendant Siddig Ali's guilty plea. He claims that because neither the Government nor the Court informed defense counsel that Ali was actively engaged in plea negotiations at the start of the trial, the defendants were prejudiced when they made their opening statements without this knowledge. Had counsel known that a plea from Ali was imminent or even likely, Rahman asserts, they would have challenged Ali's credibility in their opening statements, and their inability to do so thus deprived them of a fair trial.\n\nWe agree with the District Court that Ali's co-defendants had no right to be informed of his plea negotiations. Given that several prior efforts to reach a plea agreement with Ali had failed, neither the Court nor the Government had reason to believe this round would prove successful. There is no suggestion that the Government intentionally delayed the entry of the plea in bad faith in order to deprive the defendants' attorneys of the opportunity to address the issue in their opening statements.\n\nWe find that Rahman's cumulative unfairness claim is without merit.\n\nIV. Sentencing Challenges\n\nIn order to understand the defendants' claims concerning sentences and our resolution of them, the somewhat complex sentence determinations must be set forth in detail.\n\nA. Determination of the Sentences\n\nThe District Court applied the November 1, 1992, version of the Sentencing Guidelines, in effect at the time of the criminal conduct, since that version was more advantageous to the defendants than the version in effect at the time of sentencing. The Court's initial task was to select a base offense level for the crime of seditious conspiracy, the one offense of which all the appellants were convicted. The Guidelines provide that the base offense for a conspiracy (unless covered by a specific offense guideline) is the base offense level for the substantive offense that the defendant conspired to commit. See U.S.S.G. § 2X1.1 \u0026 comment. (n.2). However, the Guidelines do not specify a base offense level for the generalized offense of sedition, nor for the two specific goals of the conspiracy charged in Count One--levying war against the United States and opposing by force the authority of the United States. The District Court therefore turned to U.S.S.G. § 2X5.1, which provides that if the offense is a felony for which no guideline has been issued, the sentencing Judge is to apply \"the most analogous offense guideline,\" so long as one is \"sufficiently analogous.\" \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e Id. The Court determined that the treason guideline, id. § 2M1.1, provided the most appropriate analogy because the jury had explicitly found, in answer to a question on the verdict form, that one of the goals of the seditious conspiracy had been \"to wage a war of urban terrorism against the United States.\" Tr. 20660. The treason guideline states that \"if the conduct is tantamount to waging war against the United States,\" a base offense level of 43 should apply, id. § 2M1.1(a)(1). \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nThe next task was to consider adjustments. Judge Mukasey first considered a downward adjustment pursuant to U.S.S.G. § 2X1.1(b)(2), which authorizes a three-level reduction for uncompleted conspiracies (in the absence of a specific offense guideline). He reasoned that this inchoate offense reduction is to be determined individually as to each defendant. \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e He then ruled that the reduction would be denied to those defendants whom he concluded were involved with completed acts, notably the World Trade Center bombing (Rahman, Nosair, Hampton-El, and El-Gabrowny) and would be given to all the other defendants because their involvement in the Count One conspiracy was limited to the uncompleted Spring 1993 bombing plot. The adjusted level for Amir Abdelgani, Fadil Abdelgani, and Alvarez was therefore reduced to 40. However, Elhassan, Saleh, and Khallafalla were each given a two-level increase for obstruction of Justice, pursuant to id. § 3C1.1, resulting in an adjusted offense level of 42. The Court concluded that upward enhancements were appropriate for Rahman, Nosair, El-Gabrowny, and Hampton-El, but recognized that such enhancements would make no difference since 43 is the highest level in the sentencing table. \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e See Tr. 30, 60 (Jan. 16, 1996).\n\nThe Court then, following the recommendation of the pre-sentence reports, applied the Guidelines' \"grouping\" rules, applicable to determining the offense level where convictions result on multiple counts. See U.S.S.G. §§ 3D1.1-3D1.5. The Court recognized that Counts One (seditious conspiracy), Five (overall bombing conspiracy), and Six (Spring 1993 attempted bombing) should be grouped together, see id. § 3D1.2, and that the offense level for that group was the adjusted offense level (adjusted separately for each defendant) for Count One, since that count was the most serious of the counts included in the group. See id. § 3D1.3(a). Normally, the next step would have been to increase the adjusted offense level for each defendant's Count One \"group\" to reflect convictions on other counts, grouped into their appropriate groups, but in the circumstances of this case, the grouping rules called for no increases above each defendant's adjusted level for the Count One Group. \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e Thus, each defendant's adjusted offense level for the Count One group became his \"combined offense level,\" id. § 3D1.4, and that \"combined offense level\" became the appropriate level to use to determine the \"total punishment,\" id. § 3D1.5.\n\nThe Court's next step was to give consideration to the possibility of a departure from each defendant's adjusted offense level. The only ground of departure that the Court discussed with counsel was the possibility of a downward departure from the high offense level generated by the treason guideline analogy to reflect the fact of \"the absence of a declared war.\" Tr. 38 (Jan. 10, 1996). Ultimately the Court decided not to depart on this ground.\n\nThe adjusted offense levels for the Count One conduct translated into the following sentencing ranges: Rahman, Nosair, El-Gabrowny, and Hampton-El (level 43), life; Elhassan, Khallafalla, and Saleh (level 42), 30 years (360 months) to life; Amir Abdelgani, Fadil Abdelgani, and Alvarez (level 40), 24 1/3 years (292 months) to 30 5/12 years (365 months). \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nThe Court's next step was to notice the extent to which the statutory maximums for the counts on which each defendant was convicted limited the Court's authority to cumulate sentences in order to reach the total punishment called for by the Guidelines. In taking this step, the Court took into account U.S.S.G. § 5G1.2(d), which specifies that whenever the sentence imposed on the count carrying the highest statutory maximum (here, 20 years for Count One, see 18 U.S.C. § 2384, for all defendants except Rahman and Nosair) is less than the total punishment range specified by the Guidelines (which was true for all defendants, since the bottom of the lowest of the total punishment ranges for any defendant was 24 1/3 years), sentences are to be imposed consecutively \"to the extent necessary to produce a combined sentence equal to the total punishment.\" U.S.S.G. § 5G1.2(d). The Court discussed with counsel whether the Guidelines' requirement of consecutiveness to reach the total punishment applied to Counts Five and Six, which had been properly grouped with Count One, see Tr. 41-47 (Jan. 10, 1996), but ultimately decided that consecutiveness was required. No consideration appears to have been given as to whether the circumstance of imposing consecutive sentences on grouped counts, considered alone or with other factors in the case, warranted a departure.\n\nFor the four defendants whose guideline total punishment was life, sentences were imposed as follows. Since Rahman was convicted on Count Three (conspiracy to murder President Mubarak) and Nosair was convicted on Count Seven (murder of Kahane), both of which carry a penalty of life imprisonment, see 18 U.S.C. §§ 1111, 1116, 1117 (Count Three), 1959(a)(l) (Count Seven), each was eligible for the life sentence called for by his \"total punishment\" Guidelines calculation for Count One, and each received a life sentence. \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e El-Gabrowny was convicted on counts carrying an aggregate maximum sentence of 57 years--20 years (Count One) (seditious conspiracy), 3 years on each of Counts Twenty (assault on ATF agent), Twenty-One (assault on police officer), Twenty-Two (interfering with execution of search warrant), Twenty-Three (possession of false identification documents), see 18 U.S.C. §§ 111(a)(1), 2231(a), 1028(a)(3), (b)(2)(B), (c)(3), and 5 years on each of Counts Twenty-Four through Twenty-Eight (possession of false entry documents), see 18 U.S.C. § 1546. Following section 5G1.2(d), the Court imposed all these sentences consecutively, for a total of 57 years, in order to approach the total punishment calculation of life. Judge Mukasey stated, however, that if it were not for the Guidelines requirement of consecutiveness, he would have sentenced El-Gabrowny to a total of 33 years. \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e Hampton-El was convicted of counts carrying an aggregate maximum sentence of 35 years--20 years (Count One) (seditious conspiracy), 5 years (Count Five) (overall bombing conspiracy), see 18 U.S.C. § 371, and 10 years (Count Six) (Spring 1993 attempted bombing), see 18 U.S.C. § 844(i). \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e The court imposed all these sentences consecutively for a total of 35 years, again to approach the total punishment of life.\n\nThe three defendants whose guideline punishment range was 30 years to life, were all convicted on counts carrying an aggregate maximum of 35 years--20 years (Count One) (seditious conspiracy), 5 years (Count Five) (overall bombing conspiracy), and 10 years (Count Six) (Spring 1993 attempted bombing). They were sentenced as follows. Elhassan and Saleh were each sentenced to 35 years, the statutory maximums, imposed consecutively. Khallafalla was sentenced to 30 years--the statutory maximums, but with 5 years on Count Five (overall bombing conspiracy) concurrent and 10 years on Count Six (Spring 1993 attempted bombing) consecutive.\n\nOf the three defendants whose total punishment range for Count One was 24 1/3 years to 30 5/12 years, Alvarez was convicted on counts carrying an aggregate sentence of 45 years--20 years (Count One), 5 years (Count Five), 10 years (Count Six), 5 years (Count Fifteen) (shipping firearm), see 18 U.S.C. § 924(c), and 5 years (Count Sixteen) (carrying firearm), see id.,and Amir and Fadil Abdelgani were convicted on counts carrying an aggregate sentence of 35 years--20 years (Count One), 5 years (Count Five), and 10 years (Count Six). Sentences were imposed as follows. Alvarez was sentenced to 35 years--the statutory maximums for each count; the 20 years on Count One, the 5 years on Count Five, and the 5 years on Count Fifteen (shipping firearm) are concurrent, but the 10 years on Count Six and the 5 years on Count Sixteen (carrying firearm) are consecutive (the latter consecutiveness required by 18 U.S.C. § 924(b)). Amir Abdelgani was sentenced to 30 years--the statutory maximums on each count; the 20 years on Count One and the 5 years on Count Five are concurrent, but the 10 years on Count Six are consecutive. Fadil Abdelgani was sentenced to 25 years--the statutory maximums on Counts One and Five, and five years on count Six; the 20 years on Count One and the 5 years on Count Five are concurrent, but the 5 years on Count Six are consecutive. In sentencing Fadil to a shorter term than his co-defendants with the same applicable sentencing range, \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e Judge Mukasey stated that \"although I do not believe that his participation in this crime warrants an adjustment for role in the offense because he was to be one of the participants, nonetheless there is something to be said for proportionality.\" Tr. 73 (Jan. 17, 1996). Though we have rejected efforts to achieve proportionality among defendants as a valid ground for a departure, see United States v. Joyner, 924 F.2d 454 (1991), a sentencing Judge has discretion to consider such proportionality in exercising discretion to select a sentence within an applicable Guidelines range.\n\nThe following table summarizes the sentences imposed:\n\nSentences Imposed\n\nAdjusted Corresponding Aggregate\n\noffense sentencing Sentence on\n\nlevel range all counts\n\nfor (\"total in years\n\nCount punishment\")\n\nOne for Count\n\nOne in\n\nyears\n\nRahman 43 Life Life\n\nNosair 43 Life Life\n\nEl-Gabrowny 43 Life 57\n\nHampton-El 43 Life 35\n\nElhassan 42 30-Life 35\n\nSaleh 42 30-Life 35\n\nKhallafalla 42 30-Life 30\n\nAmir 40 24 1/3-30 30\n\nAbdelgani 5/12\n\nAlvarez 40 24 1/3-30 35\n\n5/12 \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nFadil 40 24 1/3-30 25\n\nAbdelgani 5/12\n\nB. Sentencing Claims\n\nThe appellants raise challenges to several aspects of the sentences imposed. As with all other arguments presented on this appeal, each appellant seeks the benefit of all arguments briefed by all other appellants.\n\n1. Use of Treason Guideline as Analogy\n\nThe defendants contend that the District Court erred in determining that the treason guideline, U.S.S.G. § 2M1.1, provides a suitable analogy to the seditious conspiracy offense charged in Count One. Before considering the merits of that contention, we consider the standard of review. The applicable provision of the statute governing our jurisdiction to review sentences provides that where a sentence is imposed for an offense for which there is no applicable sentencing guideline, the reviewing court shall set aside the sentence and remand if it determines that the sentence is \"plainly unreasonable.\" 18 U.S.C. § 3742(f)(2). The reviewing court is also required to vacate a sentence and remand if the sentence \"was imposed in violation of law.\" Id. § 3742(f)(1). These provisions create an ambiguity as to whether the task of the reviewing court is to turn directly to the sentence and determine whether it is \"plainly unreasonable,\" or should first consider whether the sentencing court used a correct analogy and, if persuaded that it did not, vacate the sentence as \"imposed in violation of law.\"\n\nIn United States v. Cefalu, 85 F.3d 964 (2d Cir. 1996), we concluded that where section 2X5.1 of the Guidelines obliges the sentencing Judge to apply the most analogous guideline, we would \"determine first whether there is a sufficiently analogous guideline, and if not, whether the sentence is plainly unreasonable.\" Id. at 966. See United States v. Miller, 116 F.3d 641 (2d Cir. 1997) (citing Cefalu in applying U.S.S.G. § 2E1.1, comment. (n.2), concerning federal offense analogous to state law crime serving as predicate for RICO offense). Cefalu also makes clear that the sentencing Judge's selection of a sufficiently analogous offense under section 2X5.1 involves the application of a guideline to the facts, a determination to which we will give \"due deference\" as required by 18 U.S.C. § 3742(e). \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e Cefalu, 85 F.3d at 968 n.6; see Miller, 116 F.3d at 677.\n\nThe defendants challenge the District Court's selection of the treason guideline as an analogy on several grounds. First, they contend that the Court did not merely find the offense of treason analogous to their offense but \"equated\" their offense with treason. See Brief for Elhassan at 29. This argument then refers to the defendants' earlier contention that the Government's use of the seditious conspiracy charge to allege levying war circumvents the constitutional limitations on prosecution of treason. We have rejected that contention in Part I(A), supra, but our upholding of the use of section 2384 to charge a seditious conspiracy to levy war does not necessarily mean that it is lawful to use the offense of treason as an analogy in order to impose on those convicted of seditious conspiracy a penalty prescribed for treason. After all, the distinctions between the offense of seditious conspiracy and the offense of treason, on which we relied in Part I(A), included the fact that treason is punishable by life imprisonment and even death, whereas the maximum statutory penalty for seditious conspir-acy is 20 years. There is a surface plausibility to the defendants' contention that if seditious conspiracy to wage war against the United States is not treason for purposes of encountering the constitutional limitations on the prosecution of treason, then such a seditious conspiracy cannot be punished by using the treason guideline as an analogy.\n\nJudge Mukasey made the following response to the defendant' point. First, he pointed out that since the Sentencing Commission punished treason committed by waging war as the most serious form of treason and assigned it the highest punishment range allowable as a mandatory sentence, it is reasonable to infer that the Commission would have wanted those who commit seditious conspiracy by waging war to receive the maximum penalty available under the seditious conspiracy statute. Tr. 5-8 (Jan. 16, 1996). We agree with that point, but it serves to support only the 20-year sentences that were imposed on Count One.\n\nWhat remained to be considered is why the defendants could lawfully be punished for more than 20 years, especially those defendants, unlike Rahman and Nosair, who were not convicted of an offense carrying a maximum statutory penalty of life. Judge Mukasey's answer was that punishments in excess of 20 years were being imposed on these defendants \"only because they have violated other statutes as well.\" Id. at 10-11. That response is correct, but does not answer the defendants' challenge to the use of the treason guideline. It is true that the consecutiveness of the defendants' sentences that carried their cumulative punishment above 20 years could not have occurred unless they had been convicted of other counts. And it is also true that Judge Mukasey faithfully applied the provisions of U.S.S.G. § 5G1.2(d) in imposing consecutive sentences on some of the other counts. But the key link in his sentence calculations was his use of the treason analogy of section 2M1.1(a)(1) to set the defendants' base offense level for Count One (seditious conspiracy) at 43, i.e., life imprisonment (subject only to slight adjustments for some of the defendants). \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e It was that level 43 (or the adjusted levels close to it) that provided the target toward which the cumulation of sentences on other counts could then reach. Though Judge Mukasey emphasized that the defendants \"are not being punished for treason,\" Tr. 10 (Jan. 16, 1996), the Guidelines' prescribed offense level (and consequent punishment) for treason by waging war was in fact a major determinant of their ultimate sentences.\n\nWhat makes the defendants' point especially troubling is that some of the other counts that were available for consecutive sentences in order to approach the treason offense levels--Count Five (overall bombing conspiracy) and Count Six (Spring 1993 attempted bombing) and perhaps others--involved conduct that was part of the seditious conspiracy. Though the offenses charged in Counts Five and Six are not lesser included within the offense charged in Count One, since each includes an element not required for conviction on Count One, they were nonetheless used to enhance the punishment for Count One above the statutory maximum for that count. The Guidelines themselves normally seek to preclude that result by sensibly requiring that certain related offenses be grouped so that the convictions for those offenses do not increase the sentence on the most serious offense within the group. See U.S.S.G. § 3D1.3(a). And Counts Five and Six were placed with Count One within a single group. But the limitation that normally results from grouping was overridden in this case by the combination of assigning a treason offense level to the Count One offense and then applying the consecutive sentence provisions of section 5G1.2(d) to all counts, including Counts Five and Six.\n\nAfter careful consideration, we conclude that the use of the guideline for treason tantamount to waging war against the United States as analogous to the conduct of the defendants constituting the Count One offense was authorized by the Guidelines and did not violate any protected right of the defendants. As a matter of language and logic, treason by waging war is surely analogous to the offense of a seditious conspiracy that includes as a goal levying war against the United States. Nothing in the Guidelines precludes either the use of the treason analogy or the sentence calculations that resulted from it. Indeed, the Guidelines call for precisely the calculations that Judge Mukasey made, once the treason guideline was selected. The Commission could have provided that sentences on any offenses grouped for purposes of section 3D1.2 are exempt from the consecutiveness requirement of section 5G1.2, but it has not done so. We see neither a statutory bar to the treason analogy nor a constitutional bar. We can be certain that the Framers, in imposing procedural limits on the prosecution of the offense of treason, never contemplated the Sentencing Guidelines. But as long as those procedural limits are observed when the substantive offense of treason is prosecuted, we do not believe that they are applicable to the determination of punishment for what we have held to be the distinct offense of seditious conspiracy, even when a goal of that conspiracy is waging war against the United States.\n\nNor do we believe, apart from regulatory, statutory, or constitutional limits, that the use of the treason analogy is unjust. To plan the waging of war against the United States is manifestly a grievous assault on the American people, meriting extremely serious punishment. Of the defendants who did not commit an offense subject to life imprisonment, the treason analogy contributed to sentences ranging from 30 years to 57 years. When one considers the huge scale of death and destruction contemplated by the defendants as part of their war against the United States, those sentences are neither \"plainly unreasonable\" under the statute governing our review, see 18 U.S.C. § 3742(f)(2), nor unjust under any more generalized standard.\n\nThe defendants' argument seems to assume that level 43, the highest guideline level, which calls for life imprisonment, is reserved for those who commit treason and is generally applied to all who commit treason. Both points are incorrect. Level 43 also applies to those who commit a premeditated killing, see U.S.S.G. § 2A1.1, or commit certain felonies, including arson, that result in death, see, e.g., id. § 2K1.4(c). Furthermore, persons who commit treason are not necessarily sentenced under section 2M1.1(a)(1). That guideline applies only to those whose \"conduct is tantamount to waging war against the United States.\" If the conduct of a person convicted of treason is not \"tantamount to waging war against the United States,\" the sentence level is determined under subsection (a)(2) of the treason guideline by \"the offense level applicable to the most analogous offense.\"\n\nJudge Mukasey reasoned that subsection (a)(1) of the treason guideline, calling for the Guidelines' highest level of punishment, is applied not so much because of the offense of treason as because the conduct was of the \"most serious\" kind, (see U.S.S.G. § 2M1.1, Commentary), conduct that is \"tantamount to waging war against the United States.\" Because the defendants had engaged in similar conduct, Judge Mukasey found this guideline \"sufficiently analogous\" under U.S.S.G. § 2X1.5.\n\nJudge Mukasey repeatedly emphasized that the defendants were not being sentenced or punished for treason, Tr. 8 (Jan. 16, 1996), and that, notwithstanding the guideline level of 43, they could not be sentenced to more than 20 years for the crime of seditious conspiracy.\n\nWe agree with Judge Mukasey's reasoning. The defendants were neither convicted of treason nor punished for treason. In view of the fact that their offense involved waging war against the United States, the guideline covering treason \"tantamount to waging war against the United States\" was found most analogous. Even though \"most analogous,\" that guideline would not be applied unless it was \"sufficiently analogous.\" U.S.S.G. § 2X5.1. We agree with Judge Mukasey's Conclusion that the defendants' conduct satisfied both tests.\n\nThe defendants raise other objections to the treason analogy. Elhassan contends that use of the treason guideline analogy renders the statutory maximum sentence for seditious conspiracy a mandatory minimum sentence. That consequence, he argues, runs contrary to both the Sentencing Commission's aversion to mandatory minimum penalties, see United States Sentencing Commission, Mandatory Minimum Penalties in the Federal Criminal Justice System 27-30 (1991), and Congress's intention to include \"individual offense characteristics in the guideline calculus.\" United States v. Voss, 956 F.2d 1007, 1011 (10th Cir. 1992). Neither point has merit. Whatever the Commission's view might be concerning statutory mandatory minimum sentences, it has made clear its intention that a \"total punishment,\" calculated under section 3D1.4 is to be imposed via consecutive sentences, as long as other counts are available, even though that punishment exceeds the statutory maximum for the offense conduct on which the total punishment is based. See U.S.S.G. § 5G1.2(d).\n\nThe argument based on Congressional intent fares no better. This argument is presumably based on the provision of the Sentencing Reform Act that purports to require sentencing Judges to consider \"the history and characteristics of the defendant.\" 18 U.S.C. § 3553(a)(1). The difficulty is that Congress, perhaps endeavoring to satisfy the contending forces that battled during the evolution of the Sentencing Reform Act, also required sentencing Judges to consider \"the nature and circumstances of the offense,\" id., and the need for the sentence \"to reflect the seriousness of the offense . . . and to provide just punishment for the offense,\" id. § 3553(a)(2)(A). Use of the treason guideline analogy manifestly \"reflect[s] the seriousness\" of the defendants' offense. Moreover, as we made clear in United States v. Merritt, 988 F.2d 1298, 1306-07 (2d Cir. 1993), considerations relating to the history, circumstances, and character of the defendant can be taken into account in appropriate cases by departure.\n\nElhassan and Hampton-El, on behalf of all defendants, contend that other guidelines provide a better analogy than the treason guideline. They suggest the appropriateness of the guideline for arson by use of explosives, see U.S.S.G. 2K1.4, which they contend better fits their particular conduct in the offense. What they overlook is that they were convicted not just of planning to destroy property by use of explosives, but of conspiracy to wage a war of mass killing and destruction against the United States. Moreover, the Guidelines issue on appeal is not whether some other guideline would also have served as an appropriate analogy; it is the two part test whether the guideline for treason by waging war against the United States was both \"the most analogous offense guideline\" and \"sufficiently analogous\" to the criminal conduct of the defendants. See U.S.S.G. § 2X5.1. The defendants' conduct fully justified Judge Mukasey's selection of the guideline for treason tantamount to waging war as \"the most analogous offense guideline.\"\n\nElhassan, on behalf of all defendants, also contends that using the treason guideline as a sentencing analogy obliterates the distinction that Congress has drawn between treason as a substantive offense and seditious conspiracy as a conspiracy offense. The Guidelines provide an adequate response. One of the virtues of the Guidelines is their calibrated prescription of punishments for substantive and conspiracy offenses. Before the Guidelines, prosecutors could hope to enhance sentences above statutory maximums by charging defendants with both conspiring to commit a crime and the substantive offense of committing it, and Judges sometimes rewarded that expectation by imposing consecutive sentences for both offenses. See, e.g., Pereira v. United States, 347 U.S. 1, 11-12 (1954); Sanders v. United States, 415 F.2d 621 (5th Cir. 1969); United States v. Accardi, 342 F.2d 697, 701 (2d Cir. 1965). The Guidelines substantially ended that practice by providing that a conspiracy offense and the substantive offense that was the sole object of the conspiracy are to be grouped together, see U.S.S.G. § 3D1.2 \u0026 comment 4 (n.2), and sentences for the two offenses will normally not be consecutive, except to the extent necessary to reach the total punishment for the most serious of the grouped counts, see U.S.S.G. § 5G1.2(d). It is true that the Guidelines equate the offense level for the substantive and conspiracy offenses, see id. § 2X1.1(a). But they also provide a three-level reduction for a conspiracy where the conspirators did not complete the acts necessary for successful completion of the substantive offense that was the object of the conspiracy. See id. § 2X1.1(b)(2), a reduction the Government agrees is to be applied individually to each defendant. See Letter of Patrick J. Fitzgerald, Asst. U.S. Atty., to Judge Mukasey (Jan. 16, 1996). With these provisions in place, it was entirely valid to use the guideline for a substantive offense as an analogy for a conspiracy offense.\n\n2. Whether Each Defendant Was Found to Have Agreed to Levy War for Purposes of Sentencing\n\nThe defendants contend, in an argument developed primarily by El-Gabrowny, that even if the treason guideline is available for use in sentencing those convicted of a seditious conspiracy that includes as one of it goals the waging of war, the treason guideline may not be applied to any one defendant unless the sentencing Judge finds that that defendant agreed to wage war. They further contend that the requisite findings were not made. The Government does not appear to dispute the premise of the argument, recognizing the subtle point that, under the Guidelines, \"[t]he principles and limits of sentencing accountability . . . are not always the same as the principles and limits of criminal liability.\" U.S.S.G. § 1B1.3, comment. (n.1) (emphasis added). Cf. Salinas v. United States, 118 S. Ct. 469, 475-78 (1997) (criminal liability for RICO conspiracy does not require defendant's agreement to commit two predicate acts). But the Government maintains that Judge Mukasey properly accepted the jury's verdict as a determination that all of the defendants had conspired to wage war against the United States.\n\nThe treason guideline prescribes a base offense level of 43 \"if the conduct is tantamount to waging war against the United States.\" U.S.S.G. § 2M1.1(a)(1) (emphasis added), and Judge Mukasey was fully entitled to use the treason guideline as an analogy based on his view that the conduct of each defendant was \"tantamount to waging war.\" The evidence established that each defendant joined either the plot that resulted in the bombing of the World Trade Center or the plot to bomb major New York City tunnels and bridges, or both plots. Such activity, with its potential for massive loss of lives (beyond the six deaths that actually occurred at the World Trade Center bombing), could not be found to be other than conduct \"tantamount to waging war.\" Judge Mukasey made it abundantly clear how serious he considered the defendants' conduct. He relied not only on the jury's verdict but on the underlying evidence, which he properly concluded fully supported the verdict.\n\n3. Challenges to Consecutive Sentences\n\nA subtext to the defendants' attack on the use of the treason guideline analogy is a challenge to the District Court's imposition of consecutive sentences on counts other than Count One to reach or approach the total punishment resulting from that analogy, at least to the extent that the statutory maximums on counts of conviction permitted. Though we agree that the guideline on consecutive sentencing authorizes precisely the stacking of sentences that occurred in this case, see U.S.S.G. 5G1.2(d), we encounter some uncertainty as to whether such stacking was required. That uncertainty arises from 18 U.S.C. § 3584, which provides:\n\n\"Imposition of Concurrent or Consecutive Terms.--If multiple terms of imprisonment are imposed on a defendant at the same time, or if a term of imprisonment is imposed on a defendant who is already subject to an undischarged term of imprisonment, the terms may run concurrently or consecutively, except that the terms may not run consecutively for an attempt and for another offense that was the sole object of the attempt.\" 18 U.S.C. § 3584(a) (emphasis added). \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e Thus, the statute appears to accord the District Judge discretion as to consecutiveness, with an exception for some instances of attempts.\n\nMoreover, section 3584(b) seems to underscore the discretionary nature of the decision as to consecutiveness by identifying the factors the sentencing Judge is to consider:\n\n\"Factors To Be Considered in Imposing Concurrent or Consecutive Terms.--The court, in determining whether the terms imposed are to be ordered to run concurrently or consecutively, shall consider, as to each offense for which a term of imprisonment is being imposed, the factors set forth in section 3553(a).\" 18 U.S.C. § 3584(b). Section 3553(a) sets forth several factors, including \"the kinds of sentence . . . as set forth in the guidelines that are issued by the Sentencing Commission.\" Id. § 3553(a)(4).\n\nDespite the statutory provisions, the Guidelines prescribe a precise regime for the decision as to consecutiveness of terms imposed on multiple counts. Unless the offense statute requires consecutiveness, see U.S.S.G. § 5G1.2(a), the sentencing Judge first calculates the total punishment called for by the Guidelines. See id. § 5G1.2(b). Next, the sentencing Judge notices whether that total punishment called for by the Guidelines is within or above the statutory maximum for the count carrying the highest maximum. See id. § 5G1.2(c). If the total punishment is less than the highest count maximum, the Judge first imposes the total punishment on that count, then imposes the total punishment, up to the statutory maximums, on all other counts, and then specifies that the sentences on the other counts run concurrently with the sentence on the count carrying the highest maximum. See id. If the total punishment called for by the Guidelines exceeds the statutory maximum for the count carrying the highest maximum, the Judge imposes consecutive sentences, but only to the extent necessary to make the combined sentences on all counts equal to the targeted total punishment. \u003cspan class=\"fnref\"\u003e34\u003c/span\u003e See id. § 5G1.2(d).\n\nIn our case, Judge Mukasey faithfully applied section 5G1.2. For example, as to defendant El-Gabrowny, Judge Mukasey first determined that the total punishment called for by the Guidelines was life imprisonment. Since the count with the highest statutory maximum (Count One) carried a maximum of 20 years, he imposed sentences of 20 years on Count One, maximum sentences of 3 years on each of Counts Twenty to Twenty-Three (total, 12 years), and 5 years on each of Counts Twenty-Four to Twenty-Eight (total, 25 years). He then ran all sentences consecutively to approach the targeted total punishment of life, resulting in a sentence of 57 years. The Judge noted that, had the Guidelines not restricted his discretion, he would have sentenced El-Gabrowny to a total of 33 years. See Tr. 147-49 (Jan. 17, 1996). The Judge did not explicitly consider whether he had the authority to make a downward departure.\n\nAt first glance, it might seem that the restrictions on discretion as to concurrency, prescribed by section 5G1.2, permissibly restrict the grant of discretion set forth in 18 U.S.C. § 3584, in precisely the same manner as many other aspects of the Guidelines restrict the statutory discretion of sentencing Judges. For example, most criminal statutes specify that a defendant may be punished to a term of \"not more than\" a specified maximum term, see, e.g., 18 U.S.C. § 2113(d) (\"not more than twenty-five years\" for armed bank robbery), thereby authorizing a sentence anywhere between zero and the maximum, yet the Guidelines specify a precise offense level for the criminal conduct, which corresponds to a narrow sentencing range.\n\nAnother example where the Guidelines restrict statutory sentencing discretion concerns the decision whether to impose a fine. The statute states that \"[a] defendant who has been found guilty of an offense may be sentenced to pay a fine,\" 18 U.S.C. § 3571 (emphasis added), and specifies several factors to be considered \"[i]n determining whether to impose a fine.\" See id. § 3572(a)(1), (3), (4) (emphasis added). However, the Guidelines state that \"[t]he court shall impose a fine in all cases, except where the defendant establishes that he is unable to pay and is not likely to become able to pay any fine,\" U.S.S.G. § 5E1.2(a) (emphasis added). Similar to the governing statute, the Guidelines specify relevant considerations, including the defendant's ability to pay and any restitution that the defendant is obligated to make, see id. § 5E1.2(d)(2), (4), but the Guidelines make the considerations relevant only to the amount of the fine, rather than to the decision whether to impose a fine, see id. § 5E1.2(d). See United States v. Corace, No. 97-1437, 146 F.3d 51, 56 (2d Cir. 1998).\n\nThe argument for permitting section 5G1.2 to restrict the discretion authorized by section 3584 is strengthened by the fact that one of the factors in section 3553 that section 3584 directs sentencing Judges to consider is \"the kinds of sentences . . . set forth in the guidelines.\" 18 U.S.C. § 3553(a)(4). Arguably, a consecutive sentence is a \"kind\" of sentence within the meaning of section 3553(a)(4), although the word \"kind\" might be confined to such categories as imprisonment, fine, probation, and supervised release.\n\nIn any event, the three circuits that have considered the tension between section 3584 and section 5G1.2 have all ruled that the sentencing Judge retains some discretion to run sentences concurrently, though such discretion may be exercised only by use of the departure authority. See United States v. Saccoccia, 58 F.3d 754 (1st Cir. 1995); United States v. Lail, 963 F.2d 263, 264 (9th Cir. 1992); United States v. Martinez, 950 F.2d 222, 226 (5th Cir. 1991). These rulings do not permit a broad discretion from section 3584 to trump section 5G1.2; they simply permit a departure if the standards for a departure are met, i.e., the sentencing Judge finds that the case presents \"an aggravating or mitigating circumstance, of a kind or to a degree, not adequately taken into consideration by the Sentencing Commission . . . .\" See 18 U.S.C. § 3553(b).\n\nOn a closely related issue, our Court has ruled that in circumstances where section 5G1.2 requires concurrent sentences, the sentencing Judge has discretion to make an upward departure in order to impose consecutive sentences. See United States v. Weng Yu Hui, 83 F.3d 592, 593-94 (2d Cir. 1996). Other circuits have made the same ruling. See United States v. Quinones, 26 F.3d 213, 216 (1st Cir. 1994); United States v. Perez, 956 F.2d 1098, 1103 (11th Cir. 1992); United States v. Pedrioli, 931 F.2d 31, 32 (9th Cir. 1991). Just as there is discretion to depart upward to impose consecutive sentences where the guidelines call for concurrency, we believe there is discretion to depart downward to sentence concurrently where the guidelines call for consecutive sentencing. \u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\n\nEl-Gabrowny's case presents a mitigating circumstance, at least \"to a degree,\" not adequately considered by the Sentencing Commission. Though the Commission considered the possibility that the total punishment called for by the Guidelines on one or more counts might exceed the statutory maximums, thereby normally requiring consecutive sentences on other counts to reach, or at least approach, the total punishment, see U.S.S.G. § 5G1.2(d), there is no reason to think that the Commission gave adequate consideration to the extent to which such a sentence could be extended by multiplication of essentially duplicative charges for a single criminal act. For resisting the agents in front of Saleh's apartment, El-Gabrowny received three sentences of three years each--two for assault and one for impeding a search. For having the five false Nosair family passports in his pocket, El-Gabrowny received six sentences--one of three years for possession of five false identity documents and five of five years each for possession of each of five false passports. Had the prosecutor drafted the charges to include a count of false identity documents for each of the five instead of grouping them in one count, El-Gabrowny's sentence would have been 69 years instead of 57. We believe the prosecutor's ability to lengthen sentences in these circumstances simply by adding essentially duplicative counts, each describing the same criminal conduct, is a circumstance that was not adequately considered by the Sentencing Commission when it devised the formula for consecutive sentencing under § 5G1.2(d). It therefore establishes a permissible basis for downward departure. If the concept of \"heartland\" means anything, see U.S.S.G. Ch. 1, Pt. A, § 4(b), this combination of unusual circumstances is outside of it.The remaining issue on this point is whether Judge Mukasey understood that he could make a departure from consecutiveness in El-Gabrowny's case and declined to do so as a matter of discretion, or thought he lacked departure authority. We have generally assumed that sentencing Judges are aware of their departure authority, see United States v. Brown, 98 F.3d 690, 694 (2d Cir. 1996); United States v. Rivers, 50 F.3d 1126, 1131 (2d Cir. 1995), but have not made that assumption \"where the Judge's option turns on an obscure point of law or where the Judge's sentencing remarks create ambiguity as to whether the Judge correctly understood an available sentencing option.\" United States v. Sweeney, 90 F.3d 55, 58 (2d Cir. 1996). The departure authority here has not previously been settled in this Circuit, and Judge Mukasey's sentencing remarks, if anything, imply that he thought he lacked departure authority. After explaining the 33-year sentence he thought was appropriate for El-Gabrowny, he stated, \"I do not believe that the guidelines leave me free to impose that sentence.\" Tr. 149 (Jan. 17, 1996).\n\nEl-Gabrowny argued at sentencing the unfairness of running all of his sentences consecutively, though he did not precisely urge a departure. We will not require service of 24 more years than a sentencing Judge tells us he wishes to impose, just because the defendant might not have used precisely the right words to express his objection. Resentencing, unlike retrial, imposes no great burden on the court system and makes only the slightest inroad on finality. We retain discretion to review novel or complex sentencing issues that were not properly preserved in the trial court. We consider El-Gabrowny's claim to present a sufficiently novel and complex issue, and we have proceeded accordingly. \u003cspan class=\"fnref\"\u003e36\u003c/span\u003e See United States v. Kingdom (U.S.A.), Inc., 157 F.3d 133, 135-36 (2d Cir. 1998); see also United States v. Leung, 40 F.3d 577, 586 n.2 (2d Cir. 1994) (correction of sentencing error usually entails fewer demands on judicial system than correction of trial error).\n\n4. Inchoate Offense Reduction\n\nEl-Gabrowny contends that he was improperly denied an inchoate offense reduction under U.S.S.G. § 2X1.1(b)(2). He argues that Judge Mukasey denied him the reduction because of his link to the completed bombing of the World Trade Center, but did not make a finding as to whether that bombing was within the scope of the agreement entered into by El-Gabrowny. Judge Mukasey made three statements arguably relevant to this matter, all said in the context of rejecting El-Gabrowny's claim for a minor role adjustment under U.S.S.G. § 3B1.2(b). The day before sentencing he said that El-Gabrowny \"held passports which were apparently to be used in connection with a breakout attempt connected to the World Trade Center.\" Tr. 42 (Jan. 16, 1996). At sentencing, he said that El-Gabrowny's \"contact with Ayyad, Salameh, with others, indicate he was integral to Nosair's contact with the outside world and Nosair was integral to the World Trade Center bombing.\" Tr. 148 (Jan. 17, 1996). He also stated that El-Gabrowny \"was aware that those passports were something that the agents would show up [for] and seek to find. As a result it is clear that he took them out of his apartment.\" Id. We assume that his abbreviated comments are meant to indicate that Judge Mukasey believed El-Gabrowny to have played a participating role in the World Trade Center bombing.\n\nAs Judge Mukasey stated, the record shows that El-Gabrowny was in contact with the actual bombers, Ayyad and Salameh, in the weeks leading up to the bombing. We infer that Judge Mukasey was alluding to Ayyad's phone call to El-Gabrowny as Ayyad was making arrangements to purchase the hydrogen gas for the bomb, Salameh's use of a driver's license with El-Gabrowny's address on it when renting the Ryder truck used in the bombing, and El-Gabrowny's accompaniment of both Ayyad and Salameh to visit Nosair in prison in the weeks leading up to the attack.\n\nHowever, Judge Mukasey did not make specific findings linking El-Gabrowny to the bombing such that we can affirm the denial of an inchoate offense reduction. We do not determine whether El-Gabrowny is entitled to an inchoate offense reduction; rather, particularized findings of his link to a completed bombing are required to permit proper review of the denial of his claim.\n\n5. Role-in-the-Offense Adjustment\n\nThe Guidelines provide for a four-level reduction in offense level for a defendant who plays a \"minimal role in concerted activity,\" U.S.S.G. § 3B1.2 comment. (n.1), or a two-level reduction for a \"minor participant in criminal activity,\" id. § 3B1.2(b). A reduction will not be available simply because the defendant played a lesser role than his co-conspirators; to be eligible for a reduction, the defendant's conduct must be \"minor\" or \"minimal\" as compared to the average participant in such a crime. See United States v. Ajmal, 67 F.3d 12, 18 (2d Cir. 1995). The District Court's finding that a defendant did not play a minor or minimal role will not be reversed unless clearly erroneous. See, e.g., United States v. Martin, 78 F.3d 808, 814 (2d Cir. 1996).\n\nSaleh and Khallafalla contend that in rejecting requests made by several defendants \u003cspan class=\"fnref\"\u003e37\u003c/span\u003e for mitigating role reductions, the Court overread the jury verdict in stating that the jury \"through the verdict\" found all defendants willing to do whatever was necessary to accomplish the goals of the conspiracy. Tr. 44 (Jan. 16, 1996). The guilty verdict on Count One, they point out, does not preclude the possibility that any one conspirator played a \"minor\" or \"minimal\" role in the conspiracy.\n\nThe defendants mischaracterize the District Court's reasoning. In denying their motions, the Court stated:\n\n\"The issue is whether . . . any of those people is significantly less culpable than the average participant in the conspiracy that is charged in this indictment and the conspiracy on which the jury returned a guilty verdict, and I don't believe any of them is. . . . The facts proved at trial indicated that each of them was willing to do what it was that was necessary for him to do. The argument that I have to consider a worldwide army and then consider each defendant a mere speck in the worldwide army I don't think is convincing. The fact is that each of them through the verdict was found to have been willing to do what it was that was necessary for him to do to accomplish the goals of the conspiracy. For that reason, th[e motions] are going to be denied.\"\n\nTr. 43-44 (Jan. 16, 1996) (emphasis added). The Court referred not only to the jury's verdict but explicitly to the facts proved at trial. Role adjustments were not improperly grounded on the jury's verdict.\n\nC. Remand for Reconsideration of El-Gabrowny's Sentence and for Findings\n\nFor the reasons stated, we will remand El-Gabrowny's sentence with the following instructions:\n\n\"(1) The Court may reconsider El-Gabrowny's sentence and exercise discretion whether to depart from the consecutiveness requirement of section 5G1.2(d).\"\n\n\"(2) The Court should make findings sufficient to permit review of the denial of El-Gabrowny's inchoate offense reduction.\"\n\nCONCLUSION\n\nThe ten defendants were accorded a full and fair jury trial lasting nine months. They were vigorously defended by able counsel. The prosecutors conducted themselves in the best traditions of the high standards of the Office of the United States Attorney for the Southern District of New York. The trial Judge, the Honorable Michael B. Mukasey, presided with extraordinary skill and patience, assuring fairness to the prosecution and to each defendant and helpfulness to the jury. His was an outstanding achievement in the face of challenges far beyond those normally endured by a trial Judge.\n\nWe have considered all of the other claims raised on appeal by all of the defendants, beyond those discussed in this opinion, and conclude that they are without merit. The convictions of all ten defendants are affirmed. With the exception of the sentence of defendant El-Gabrowny, which is remanded for further proceedings as set forth in this opinion, the sentences of all the other defendants are affirmed.\n\n\u003cspan class=\"fn\"\u003e1. \"Qur'an\" is the transliteration currently favored by Islamic scholars of the word more popularly transliterated as \"Koran.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. All \"Tr.\" references, unless otherwise noted, are to the consecutively numbered pages of the transcript of the trial from Jan. 9, 1995, until Oct. 1, 1995.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Nosair was eventually acquitted of the murder of Kahane in New York state court, but was found guilty of weapons charges, and was sentenced to a term of 7 1/3 to 22 years' imprisonment, and was transferred to Attica. The visits by members of the group continued when Nosair moved to Attica as did Nosair's calls to arms.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Salem was one of the Government's key witnesses at trial. The Government acknowledges that Salem is a braggart who often told tall tales of his past. However, by 1993 Salem was regularly tape recording his conversations with the group members and those tapes served to corroborate much of his testimony at trial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. None of the trainees ever went to Bosnia.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. While in prison, Nosair stated that he would have been able to pull off the Kahane murder if he had brought a stun gun with him.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Although the Constitution does not recognize different degrees of treason, the English common law counterpart of treason by levying war and adhering to the enemy is \"high treason.\" See United States v. Kawakita, 108 F. Supp 627, 631 (S.D. Cal. 1952); United States v. Greiner, 26 F. Cas. 36, 38 (E.D. Pa. 1861) (\"[T]he two species of treason mentioned in the constitution are described in it in language borrowed from that of the English statute of treasons.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. These penalties were reserved for male traitors. Women convicted of treason were \"drawn to the gallows, and there . . . burned alive,\" because \"the natural modesty of the sex forbids the exposing and public[] mangling [of] their bodies.\" Id. at *93.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Whether any of the defendants in fact owed allegiance to the United States and thus could have been prosecuted for treason if the other requirements to make such a prosecution were satisfied is immaterial to whether they were properly prosecuted for the lesser offense of seditious conspiracy.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The facts pertaining to El-Gabrowny's possession of the passports are not in dispute. At the time of his arrest, El-Gabrowny was found in possession of five fraudulent Nicaraguan passports outside his apartment building in Brooklyn.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The Vargas court also reasoned that Section 1546(a) reaches only immigration visas and permits, and not passports, regardless whether passports are \"required\" for entry into the United States. 380 F. Supp. at 1167-68; see also Fox, 766 F. Supp. at 572. As noted above, however, the plain language of the Section 1546(a), read in conjunction with the statutes and regulations, makes clear a passport is an \"other document prescribed by statute or regulation for entry . . . into the United States.\" 18 U.S.C. § 1546(a).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. In view of this wholly satisfactory justification for the seizure of the passports, we need not consider several additional theories on which the Government claims justification. See Colorado v. Bertine, 479 U.S. 367, 369 (1987)(upholding inventory search that district court found had been performed in a \"somewhat slipshod\" manner); Michigan v. Summers, 452 U.S. 692, 704-05 (1981) (upholding seizure of individual whose home was being searched for contraband pursuant to a valid warrant and his search upon discovery of said contraband); United States v. Perea, 986 F.2d 633, 644 (2d Cir. 1993) (upholding admission of evidence that would inevitably have been discovered in the course of a valid inventory search).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The Government's brief responds to severance claims made by Saleh and Kalafallah. From our reading of their briefs, we are not certain that those defendants are asserting severance claims. In any event, assuming that they are, we find those claims are without merit.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. It appears, as Judge Mukasey acknowledged after the verdict, that in his jury instructions he mistakenly limited the bombing conspiracy count to the Spring 1993 plot instead of including, as charged, the bombing of the World Trade Center. For that reason, the Government argues, and Judge Mukasey agreed, El-Gabrowny and Nosair were acquitted of the bombing conspiracy charge.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. The Government did not seek to prove at trial that Hampton-El was guilty as a principal of the attempt.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Entrapment requires proof that the Government induced commission of the charged crime, and that the defendant lacked a preDisposition to engage in such criminal conduct. See Mathews v. United States, 485 U.S. 58, 63 (1988). The evidence at trial established that both Khallafalla and Saleh joined the conspiracy at the bidding of Siddig Ali. There was no Government inducement, and hence no entrapment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Hampton-El's counsel, accepting the risk that the Napoli tape might not be ruled admissible, had ended his opening statement to the jury with Napoli's statement to Salem, in an effort to show that the Government did not believe that his client was involved in the plot. Tr. 1748.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. The instruction included the following: I want to say a few things, however, about voluntary intoxication. Intoxication, or being high on cocaine, in itself is not a legal defense to a criminal charge. However, intoxication may, under some circumstances, negate the existence of the defendant's intent to commit the crime that the government must prove in order to establish guilt. If you find that defendant was intoxicated throughout the entire course of his alleged participation in the crimes charged, you may conclude that the defendant did not have the required intent that I described earlier. . . . I remind you also that Mr. Alvarez, through his attorney, made other arguments to you about his capacity based on the testimony of Dr. Aranda and of Mr. Alvarez, and certain tapes, and you may give those arguments and that evidence whatever weight you think they deserve. Tr. 20556-57.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Dr. Aranda testified, \"With somebody like Mr. Alvarez, and anybody with prolonged use [of cocaine], you start seeing psychological difficulties. . . . \"Over a period of time, you are going to see mental confusion [that] would just, if anything, compound the overall cognitive function, would make it worse.\" Tr. 17844.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. \"If there is not a sufficiently analogous guideline, the provisions of 18 U.S.C. § 3553(b) shall control . . . .\" U.S.S.G. § 2X5.1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. If the conduct is not tantamount to waging war against the United States, the treason guideline instructs the Court to apply the offense level applicable to the most analogous offense. See U.S.S.G. § 2M1.1(a)(2).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Though the Government unsuccessfully opposed an inchoate offense reduction for all defendants on the ground that each considered himself in a state of war, the Government agreed with the Court that the reduction should be applied individually, in light of the principles concerning individual punishment of conspirators specified in U.S.S.G. § 1B1.3. See Letter of Patrick J. Fitzgerald, Asst. U.S. Atty., to Judge Mukasey (Jan. 16, 1996).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. The judgments for Rahman and Nosair report their total offense level as 47 and 48, respectively.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. As to those defendants whose adjusted offense level for Count One was 43, the highest level possible, convictions on other counts (outside the group comprising Counts One, Five, and Six) could not result in any further increase; as to those defendants whose adjusted offense was less than 43, either they were not convicted of counts other than Counts One, Five, and Six, or all of their additional convictions carried offense levels more than 9 levels below the level for Count One, and therefore are to be disregarded in determining a combined offense level for all counts, see U.S.S.G. § 3D1.4(c).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. The Guidelines currently in effect, which were not applied to the defendants, would have called for an upward adjustment since the defendants' felonies involved terrorism. See U.S.S.G. 3A1.4 (1997). That adjustment would have placed the Abdelganis and Alvarez in Criminal History Category VI, where their adjusted offense level would have translated into a sentencing range of 30 years to life.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. The life sentence for Rahman was imposed on Count Three (conspiracy to murder President Mubarak). Statutory maximum sentences of 20 years (Count One) (seditious conspiracy), 20 years (Count Two) (solicitation to murder President Mubarak), 20 years (Count Four) (solicitation to attack military installation), and 5 years (Count Five) (overall bombing conspiracy) were imposed on the remaining counts on which he was convicted, all to run concurrently, in conformity with U.S.S.G. § 5G1.2(c). The life sentence for Nosair was imposed on Count Seven (murder of Kahane). Statutory maximum sentences of 20 years (Count One) (seditious conspiracy), 20 years (Count Eight) (assaulting Franklin), 20 years (Count Nine) (assaulting Officer Acosta), 20 years (Count Ten) (attempted murder of Officer Acosta), 5 years (Count Eleven) (use of firearm against Kahane), 5 years (Count Twelve) (use of firearm against Franklin), 5 years (Count Thirteen) (use of firearm against Officer Acosta), 5 years (Count Fourteen) (possession of firearms) were imposed on the remaining counts on which he was convicted, all to run concurrently, except for the 5-year sentences on counts Eleven, Twelve, and Thirteen, which were required to be imposed consecutively to each other and to the sentences on the other counts. See 18 U.S.C. § 924(c)(1); U.S.S.G. § 5G1.2(a). The Government notes that section 924(c) authorizes a maximum sentence of 20 years for a \"second or subsequent\" conviction, apparently indicating its view that a conviction is \"second\" for purposes of section 924(c) when the conduct underlying one section 924(c) violation occurs after the conduct underlying another one, not merely where a second conviction occurs after a first one. However, the Government acknowledges that it did not raise this point in the District Court and seeks no benefit from it in this Court. See Letter from Andrew C. McCarthy. Asst. U.S. Atty., to Clerk of Court 11 n.6 (Jan. 30, 1998).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Judge Mukasey explained that he would have reached a 33 year sentence by imposing 20 years on Count One (seditious conspiracy), 3 years on each of Counts Twenty (assault on ATF agent), Twenty-One (assault on police officer), Twenty-Two (interfering with execution of search warrant) and Twenty-Three (possession of false identification documents), concurrent with each other but consecutive to other counts, 5 years on Count Twenty-Four (possession of false entry documents for one member of Nosair's family), consecutive to other counts, and 5 years on counts Twenty-Five to Twenty-Eight (possession of false entry documents for other members of Nosair's family), concurrent with each other but consecutive to other counts. See Tr. 148-49 (Jan. 17, 1996).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Section 844(i) was amended in 1994 and currently carries a maximum penalty of 20 years. See Pub. L. No. 103-322, § 320106(3)(A), 108 Stat. 1796 (1994).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Fadil's sentence was near the bottom of the applicable \"total punishment\" range. By contrast, Amir and Alvarez were sentenced near the top of that range.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Alvarez's aggregate sentence exceeds the \"total punishment\" Guidelines calculation for Count One because the 5 year sentence on Count Sixteen was required to be imposed consecutively. See 18 U.S.C. § 924(b).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. Elhassan contends that the \"plainly unreasonable\" standard of 18 U.S.C. § 3742(e)(4) should be applied to the sentencing Judge's selection of the most analogous guideline. Cefalu forecloses that contention.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. As we have explained, use of the treason analogy resulted in adjusted offense levels of 43, 42, or 40 for the Count One offense alone, and those levels, under the grouping rules, see U.S.S.G. §§ 3D1.3, 3D1.4, became the levels for imposition of an aggregate total punishment for all counts resulting in conviction, subject only to statutory maximums.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Section 3584(a) also provides default rules for interpretation of criminal judgments: Multiple terms of imprisonment imposed at the same time run concurrently unless the court orders or the statute mandates that the terms are to run consecutively. Multiple terms of im- prisonment imposed at different times run con- secutively unless the court orders that the terms are to run concurrently. 18 U.S.C. § 3584(a). In our case, the multiple terms were imposed at the same time, and the Court explicitly ordered many of them to run consecutively.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. El-Gabrowny misunderstands section 5G1.2 and its relation to the rest of the Guidelines in contending that the consecutiveness of sentences on counts other than the count with the highest guideline level is required only up to the statutory maximum sentence on that count. On the contrary, section 5G1.2(d) requires consecutiveness up to the \"total punishment,\" and that is determined by using the offense level for the group of offenses with the highest offense level. See U.S.S.G. § 3D1.4.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Two courts, considering the analogous issue of whether the discretion authorized by section 3584 permits a sentencing Judge to decline to impose consecutive sentences required by the Guidelines in some circumstances where a defendant is already serving an unexpired term of imprisonment, see U.S.S.G. § 5G1.3, have ruled that the sentencing Judge retains discretion, even without meeting the strict standards for a departure. See United States v. Nottingham, 898 F.2d 390, 395 (3d Cir. 1990); United States v. Wills, 881 F.2d 823, 826 (9th Cir. 1989), overruled in relevant part by Pedrioli, 931 F.3d at 32. The argument in Nottingham that the discretion in section 3584 cannot be restricted by section 5G1.3 (nor presumably by section 5G1.2) has some appeal, but our decision in Weng Yu Hui carries us into the realm of permitting concurrent sentences, contrary to section 5G1.2's requirement of consecutiveness, only where a departure is appropriate.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. The defendants' other challenges to consecutiveness are without merit. Amir Abdelgani argues that consecutive sentences on Counts One, Five, and Six violate 18 U.S.C. § 3584(a), which prohibits consecutive sentences for attempt and \"another offense that was the sole object of the attempt.\" Although he was convicted of an attempt in Count Six, his convictions on Counts One and Five were for conspiracy, rather than for a completed crime that was the \"sole object\" of the attempt. Congress has not prohibited consecutive sentences for attempts and conspiracies that have the same object. Hampton-El argues that the consecutive sentences on these three counts violated the defendants' double jeopardy protection. He cites to the Korfant line of cases, see United States v. Korfant, 771 F.2d 660, 662 (2d Cir. 1995); see also United States v. Macchia, 35 F.3d 662 (2d Cir. 1994), for the proposition that offenses that are not technically lesser-included within other offenses might nonetheless overlap so substantially as to raise double jeopardy concerns. However, this line of cases concerns the double jeopardy problem that arises from successive prosecution for related conspiracies. See United States v. McGowan, 58 F.3d 8, 13 (2d Cir. 1995) (\"The Korfant inquiry implements a policy forbidding the government from multiplying opportunities to prove a conspiracy, in derogation of the Double Jeopardy clause, by breaking up a single conspiracy into multiple segments.\"); United States v. Calderone, 982 F.2d 42, 48 (2d Cir. 1992) (\"The Government cannot be permitted to retry defendants on smaller and smaller conspiracies, wholly contained within the scope of a large conspiracy, until it finds one small enough to be proved to the satisfaction of a jury.\"). In that relatively narrow context, the Korfant line of cases requires consideration of eight factors in order to determine whether the offenses \"appear in fact and in law the same.\" Macchia, 35 F.3d at 668 (citation omitted). Since the defendants did not face successive trials for their arguably overlapping conspiracies, Hampton-El's double jeopardy argument is governed by the standard Blockburger analysis, which allows separate punishment for two offenses as long as each requires some distinct element of proof. See Blockburger v. United States, 284 U.S. 299, 304 (1932); United States v. Avelino, 967 F.2d 815, 816 (2d Cir. 1992). Hampton-El appears to concede that his challenge would be unavailing under Blockburger because the seditious conspiracy, the bombing conspiracy, and the attempted destruction of property offenses each has elements not contained in the other offenses.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. The Court simultaneously denied role-in-the-offense reductions to Alvarez, Saleh, Fadil, Amir, Khallafalla, Hampton-El, and Elhassan. See Tr. 43-44 (Jan. 16, 1996).\u003c/span\u003e\n\n",
    "body_length": 220410,
    "citedas": [
      "189 F.3d 88"
    ],
    "attorneys": "Ramsey Clark, New York, N.y. (Lawrence W. Schilling, Lynne Stewart, Abdeen Jabara, on the brief), for appellant Rahman. Anthony L. Ricco, Ricco \u0026 Villanueva, New York, N.y.; Edward D. Wilford, New York, N.y.; Polly N. Passonneau, New York, N.y., for appellant El-Gabrowny. Roger L. Stavis, New York, N.y. (Andrew G. Patel, New York, N.y., on the brief), for appellant Nosair. Joyce London, New York, N.y.; Gail Jacobs, Great Neck, N.y., for appellant Elhassan. Kenneth D. Wasserman, Georgia J. Hinde, New York, N.y. (Siri L. Averill, New York, N.y., on the brief), for appellant Hampton-El. Steven Bernstein, New York, N.y., for appellant, A. Abdelgani. Moira Casey, Douglaston, N.y.; Charles D. Levine, Forest Hills, N.y., for appellant F. Abdelgani. Wesley M. Serra, Brown, Berne \u0026 Serra, Bronx, N.y., for appellant Alvarez. Beverly Van Ness, New York, N.y.; John H. Jacobs, New York, N.y., for appellant Saleh. Valerie S. Amsterdam, New York, N.y., for appellant Khallafalla. Andrew C. McCarthy, Asst. U.s. Atty., New York, N.y. (Mary Jo White, U.s. Atty., Guy Petrillo, Asst. U.s. Atty., New York, N.y., on the brief), for appellee.",
    "category": [
      "243",
      "36",
      "75"
    ],
    "judges": "Before: Newman, Leval, and Parker, Circuit Judges.",
    "citation_count": 201
  }
}
