{
  "id": "5I7LQWYBTlTomsSBmsqt",
  "document": {
    "title": "WASSEL v. EGLOWSKY",
    "full_title": "BERNARD V. WASSEL, and SEVY WASSEL, his wife, Plaintiffs v. EDWARD M. EGLOWSKY, STEPHEN H. STILLERMAN, Defendants. EDWARD M. EGLOWSKY and STEPHEN H. STILLERMAN, Defendants and Third-Party Plaintiffs v. ARNOLD GOLDMAN and CENTRAL TRUST COMPANY, Third-Party Defendants",
    "jurisdiction": "D. Maryland",
    "date": "1975-07-30T00:00:00.000Z",
    "docket": "72-1239-K",
    "body": "Kaufman, District Judge.\n\nPlaintiffs, Bernard and Sevy Wassel, \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\" allege violations of the Securities Act of 1933, 15 U.S.C. §§ 77a-aa, and the Securities Exchange Act of 1934, 15 U.S.C. §§ 78a-hh, by defendants, Edward M. Eglowsky and Stephen H. Stillerman. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\" The latter deny liability but secondarily assert, with regard to any possible liability on their part to Wassel pursuant to Wassel's '33 Act contention, \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\" third-party claims for indemnification or contribution against third-party defendants Central Trust Company and Arnold J. Goldman, Esq. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\" A lengthy non-jury trial has developed considerable conflict in testimony, thus necessitating, at the threshold, findings by this Court.\n\nFACTS\n\nOn August 31, 1972, plaintiffs \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\" purchased 25,000 shares of Dyna-Mech Sciences, Inc. (hereinafter referred to as \"Dyna-Mech\" \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\" ) at a price of $1.00 per share. Dyna-Mech, a New York corporation, was incorporated in August 1968 by certain residents of Rochester, New York for the purpose of manufacturing an \"all-terrain vehicle\" (ATV). Initially, 370,000 shares were issued to William Steckerl, Dyna-Mech's President; 161,750 to Harry Lortz, a Dyna-Mech Vice-President; and 154,750 to Sidney Berke, another Dyna-Mech Vice-President. Approximately 5500 shares were issued to others who were members of Dyna-Mech's Board of Directors and to attorneys in a law firm which represented Dyna-Mech at the time of its incorporation. An additional 76,416 shares of Dyna-Mech were sold to a number of residents in the Rochester area seemingly pursuant to the intrastate exemption provided by section 3(a)(11) \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\" of the Securities Act of 1933 (hereinafter referred to as the \"'33 Act\"). In all, as of October 1968, there were 768,416 shares of Dyna-Mech outstanding. Apparently, in March 1970, Dyna-Mech engaged in another intrastate offering of 250,000 shares, thus raising the total number of outstanding shares to 1,041,306.\n\nSoon after its incorporation Dyna-Mech ran into increasingly severe financial problems. In 1970 Steckerl was in contact with Edwin Miller, Jr., a Canadian citizen, and President of Canusa Holdings Limited, incorporated in Delaware, and also President of Canusa Holdings Limited, a Canadian corporation. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\" Miller offered to provide Dyna-Mech with $60,000 of additional capital and to assist in arranging additional financing for Dyna-Mech. In return Canusa was issued 220,000 shares of Dyna-Mech stock on June 17, 1970 and was granted an exclusive distributorship for the ATV in Canada. The Dyna-Mech stock certificate which Canusa obtained bore the following legend:\n\nNo sale, offer to sell or transfer of the shares represented by this certificate shall be made unless a registration statement under the Federal Securities Act of 1933, as amended, with respect to such shares is then in effect or an exemption from the registration requirements of such Act is then in fact applicable to such shares.\n\nLortz had been discharged by the Dyna-Mech Board of Directors sometime previous to the transactions with Canusa and his 161,750 shares had been repurchased by Dyna-Mech for $8,000 (in settlement of certain litigation). Thus, the 220,000 shares acquired by Canusa represented more than 20% of the total of 1,099,556 of Dyna-Mech then outstanding. Subsequently, a dispute arose between Dyna-Mech and Canusa, resulting in the institution of a number of lawsuits in the New York courts in late 1970 between Canusa on the one hand and Dyna-Mech and Steckerl and Berke individually on the other hand. Those lawsuits were eventually settled in June 1973.\n\nArnold J. Goldman, Esq., a personal friend of Steckerl, replaced Dyna-Mech's original corporate counsel in July 1970 after the Lortz shares had been repurchased and after the contract with Canusa had been entered into. There was not any written designation of Goldman as Dyna-Mech's corporate counsel, then, or at any time subsequent. Seemingly, one of Goldman's first services as Dyna-Mech counsel involved a contract with Central Trust Company, a Rochester bank, pursuant to which Central Trust agreed to continue acting as Dyna-Mech's stock transfer agent for a fee of $500 a year.\n\nBy early 1971, Dyna-Mech's financial difficulties had worsened, and Steckerl and Berke placed advertisements in various newspapers seeking additional financing. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\" A group from Indiana indicated interest and in February 1971 that group, the \"Pitcher group\", received a total of 500,000 shares of newly issued Dyna-Mech stock. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\" After July 1971, Steckerl and Berke ceased their active participation in Dyna-Mech's affairs and all of Dyna-Mech's corporate books and records as well as the ATV proto-type were moved to Marion, Indiana. However, the Pitcher group failed to pay the notes with which it had purchased the Dyna-Mech stock, resulting in litigation in the New York courts between the Pitcher group on the one hand and Steckerl and Berke on the other hand. Goldman represented Steckerl and Berke and seemingly Dyna-Mech in that litigation, which was eventually settled in 1973 at which time the Pitchers turned over title in a building valued at $30,000 to Steckerl and Berke. In the late spring of 1972 the corporate records and books of Dyna-Mech were returned to Goldman by the Pitchers.\n\nIn the spring of 1972 Miller indicated to Goldman a desire either to take over Dyna-Mech on his own behalf or on behalf of others. Goldman told Steckerl and Berke of Miller's interest and was authorized by Steckerl and Berke to conduct negotiations with Miller. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\" Apparently, there was also an initial proposal by a man named Birkenshaw who was brought into the picture by Miller and who was interested, for a short time, in April 1972, in gaining control of Dyna-Mech. The Birkenshaw negotiations came to naught. However, by June 1972 a plan had been worked out by Goldman and Miller pursuant to which Miller proposed that he would negotiate the takeover of Dyna-Mech by William Thompson, a resident of California. That June plan was memorialized in a letter dated June 7, 1972 from Miller to Goldman and signed by them both, which in relevant part read:\n\nIt is our understanding that you are the Attorney and have full authority to sign for the above company [Dyna-Mech] and have been instructed by its principals to negotiate an agreement to turn over control and clean up the obligations of the Company and hopefully make it successful.\n\nI represent clients who are prepared to purchase control of the above company subject to the following terms and conditions for the total purchase price of $75,000.00.\n\n* * *\n\nYou Shall:\n\n1. Immediately reserve the name of William Thompson, Incorporated and obtain the corporation's Minute Book for evaluation.\n\n2. As soon as practical, change the name of the Company to William Thompson, Incorporated or such other name acceptable to my clients.\n\n3. Increase the capitalization to five million shares.\n\n4. Deliver a minimum of one million, five hundred and twenty-two thousand shares of the capital stock of the subject company in present form.\n\n5. As soon as you receive the balance of the first $5,000.00 and the $5,000.00 letter of credit, the present directors and officers will resign and allow my people to appoint a board of directors of their choice and provide them with full voting rights on the one million, five hundred and twenty-two thousand shares.\n\n6. Provide a financial statement and certificate from the Company's auditors that the Company is free of all debts and liabilities and verify the tax loss.\n\n7. Provide an Attorney's certificate that the Company can be traded on the over-the-counter market and is in good standing, that there are no lawsuits or judgments pending or in force, that to the best of your knowledge and belief there is no cause for any actions to be filed and that the Company is empowered to deal in land, leases, leasing companies, motion pictures, etc. and own shares in other corporations in America or elsewhere.\n\n* * *\n\n11. Assist in help getting a market called as soon as possible on Dyna-Mech Sciences, Incorporated and to assist the new board of directors and their officers in operation of the Company until you can resolve all corporate matters (prior numbers one to ten) with no liabilities to prior management.\n\nI Shall On Behalf Of My Client:\n\nA. Pay $500.00 to Attorney Arnold Goldman for reserving the name of William Thompson, Incorporated, securing the corporation's Minute Book and for a non-refundable six week option to purchase control of Dyna-Mech Sciences, Incorporated and if the option is exercised, pay an additional $4,500.00 on or before July 20, 1972; these monies to be used as follows:\n\n1. Pay Central Trust all transfer fees,\n\n2. Pay the accountant to prepare a certified financial statement as soon as practical so that an annual shareholders' meeting can be held thereby allowing further recapitalization of authorized stock to a minimum five million shares,\n\n3. The balance of the above $5,000.00 to be used against your legal fees.\n\nB. It is understood that out of the $75,000.00 the total legal fees are not to exceed $15,000.00, thereby allowing you $60,000.00 to clean up any and all obligations up to the date of closing including attendance at the shareholders' meeting, place and time to be mutually agreed upon. [Emphases supplied except with regard to the words \"if the option is exercised\"].\n\n* * *\n\nThat document was amended by a document dated June 16, 1972 and also signed by Goldman and Miller. That amendment provided that all of the provisions of the June 7, 1972 letter agreement remained in force and effect except that the capitalization would be increased to 10,000,000 shares rather than 5,000,000 and except that two new conditions were imposed upon Goldman, namely:\n\n12. Arrange special shareholders meeting for 1:00 p.m., July 22, 1972.\n\n13. Provide letter stating that 280,000 shares between Mr. Edward Miller and his clients and 197,206 (EM Jr.) (AG) \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\" in the hands of the public are the only free trading shares.\n\n[Emphasis supplied except with regard to the words \"280,000 shares between Mr. Edward Miller\".]\n\nFurthermore, one condition was added to the column headed \"Mr. Edward Miller, Jr. on behalf of client\" which would appear in actuality to be an additional condition imposed upon Goldman. That condition was:\n\nG. Go with Mr. Edward Miller, Jr. to break up 220,000 share certificate into various clients names. [Emphasis supplied.]\n\nNeither of those documents was ever communicated by Goldman to either Steckerl or Berke. All that Goldman communicated was that Miller either on his own behalf or on behalf of others was interested in acquiring Dyna-Mech for $60,000. Seemingly, no mention of the $75,000 figure was ever made by Goldman to either Steckerl or Berke. During the May-July 1972 period, Goldman was given proxies by both Steckerl and Berke to vote their Dyna-Mech stock. Berke however warned Goldman that he feared that Miller did not intend to save Dyna-Mech but only intended to use it as a conduit by which Miller could sell the Dyna-Mech stock to the public. Berke instructed Goldman not to use Berke's proxy for any purpose until after Miller had paid the $60,000 to be used to pay Dyna-Mech's creditors. Berke had by that time given up any real hope of salvaging Dyna-Mech and only hoped that the creditors of and investors in Dyna-Mech, many of whom were his personal friends, would be able to recover a part of their investment. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\"\n\nGoldman testified at trial that he considered the June 7, 1972 and June 16, 1972 documents he and Miller signed as purely executory and in no way binding on him. Goldman further testified that his actions after June 16, 1972 were not intended as a performance of his obligations under those documents and, in fact, that by June 23, 1972 at the latest, he considered those documents as dead. In the light of the subsequent pattern of actions by Goldman, Thompson and Miller, this Court does not accept such testimony by Goldman. Rather, this Court finds that all of Goldman's actions taken after June 16, 1972 were fully consistent with and were taken in connection with performance of the provisions of the two documents which Goldman and Miller had signed in June 1972.\n\nOn June 20, 1972, Goldman received a cashier's check for $4500 from William Thompson. On June 23, 1972, Robert B. Potts, the Secretary of Canusa, came to Rochester with the 220,000 share certificate of Dyna-Mech stock which had been sold to Canusa in 1970. Goldman prepared a letter addressed to Central Trust dated June 23, 1972 which read:\n\nAs attorney for Dyna-Mech Sciences, Inc., you are hereby authorized to reissue 279,000 shares of the common stock of Dyna-Mech Sciences, Inc., as contained in the request of Canusa Holdings Limited, dated June 21, 1972. This is not a sale but is merely a break-up of large blocks of stock belonging to Canusa Holdings Limited and of smaller shares which are being reissued to the stockholders of Canusa Holdings Limited.\n\nYou are further authorized to issue these shares as requested without the investment legend which appears on the stock certificate for 220,000 shares originally issued to Canusa Holdings Limited.\n\nThe request of Canusa referred to in Goldman's letter was a document dated June 21, 1972 which Potts had brought with him to Rochester. That document, which was typed under the letterhead of Canusa Holdings, Limited and signed by Potts, read:\n\nI, ROBERT B. POTTS, Secretary of Canusa Holdings Limited certify that the attached list of individuals and firms represents stockholders of Canusa Holdings Limited, and that it is requested that 279,000 shares of the common stock of Dyna-Mech Sciences, Inc. be broken up and reissued as indicated on said list.\n\nThe attached list named twenty-two persons and indicated next to each name the number of shares of Dyna-Mech each was to receive. Prior to June 23, 1972, Goldman had been told by Miller that Canusa was dissolving and that all of the shares of Dyna-Mech to be distributed by Canusa to its shareholders would actually be sold by them to William Thompson. After Potts arrived in Rochester, he and Goldman, according to Goldman's trial testimony, went together to Central Trust where they met Daniel Atfield who was then in charge of Central Trust's stock transfer department. Atfield, according to Goldman's testimony, declined to transfer any shares at that time because: (1) Dyna-Mech owed Central Trust $1189 for previous services as a transfer agent, \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\" (2) Central Trust could not issue 279,000 shares in new certificates when the only certificate being surrendered to it was for 220,000, and (3) Central Trust desired an up-to-date list of Dyna-Mech's officers and directors and up-to-date financial statements of Dyna-Mech and of William Thompson. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\" Goldman states that he left with Atfield both his June 23, 1972 letter and the listing of Canusa shareholders which had been given to him by Potts.\n\nOn June 26, 1972, Goldman paid Steffan \u0026 Company, a Rochester accounting firm, $1500 to provide up-to-date financials for Dyna-Mech. On June 30, 1972, Goldman paid Central Trust the $1189 which Dyna-Mech owed to Central Trust. Goldman testified that both of those payments were made from the $4500 he had previously received from William Thompson.\n\nOn July 5, 1972, according to Goldman, a \"one man meeting\" of the Dyna-Mech Board of Directors was held. Only Steckerl and Goldman were present. At that meeting Steckerl resigned as President and William Thompson was elected as the new President of Dyna-Mech. Berke testified that he only learned of that meeting \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\" when he received a copy of an undated letter to Dyna-Mech shareholders signed by William Thompson as \"Chairman and President\". That letter read in part as follows:\n\nAt a recent special meeting of the Board of Directors of your company, I was elected President, effective immediately. As you know, Dyna-Mech Sciences, Inc. has been dormant for the past year. A group which I represent and which has extensive financial interests believes that the company can be revived and has an exciting future. I am, therefore, happy to outline some of our agressive [sic] and dynamic plans for the company whose name we plan to change to William Thompson Incorporated, hopefully after the special stockholders' meeting described in the attached notice.\n\nAttached to that letter \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\" was a list of the new officers and directors of Dyna-Mech. Steckerl and Berke did not appear on that list. Robert B. Potts, listed as \"Secretary and Director of Canusa Holdings Limited\", appears on that list as the new Dyna-Mech Secretary. Also attached to that letter was a notice of a special stockholders' meeting of Dyna-Mech to be held on July 22, 1972 in Fort Erie, Ontario. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\" That notice was dated July 5, 1972 and was signed by Robert B. Potts as Dyna-Mech's Secretary.\n\nThe shareholders' meeting announced by the notice of July 5, 1972 did in fact take place on July 22, 1972 in Fort Erie, Ontario, the headquarters of Canusa and the residence of Miller and Potts. Although there is some dispute as to the details of what occurred at that meeting, its basic outline is clear. After a buffet luncheon paid for by William Thompson, and a brief presentation, including the showing of a portion of a film which a company controlled by William Thompson was then in the course of producing in California, the Dyna-Mech shareholders assembled separately by themselves in another room. There, at a meeting chaired by Goldman, \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\" four proposals were adopted. First, Dyna-Mech's name was changed to William Thompson, Incorporated. \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\" Second, the number of authorized shares of stock was increased from two to ten million shares. Third, the articles of incorporation were amended to broaden the authorized scope of Dyna-Mech's operations. Fourth, the shareholders elected a new Board of Directors. Those proposals were only adopted after Berke vehemently opposed the increase in the number of shares. In so doing, Berke emphasized that William Thompson had not yet put any money into Dyna-Mech and that any increase in the number of shares should await evidence of Thompson's good faith. Berke, however, did vote in favor of the other three proposals. At that July 22, 1972 meeting, approximately 750,000 of the 1,776,306 shares of Dyna-Mech then outstanding were voted. \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\" Miller voted the 220,000 shares of Dyna-Mech which Canusa held, for all four propositions. Steckerl was not present, but Goldman similarly voted the latter's proxy for 370,000 shares in favor of all four of the propositions. Neither of those blocks separately amounted to a majority of the shares represented at that meeting, but together those 590,000 shares amounted to over 78% of the 750,000 represented.\n\nAfter the shareholders' meeting was concluded, Dyna-Mech's new Board of Directors, which did not include Goldman, adjourned to the Canusa offices which were in another building. At that meeting, Philip Schreiber, Esq. was designated as Dyna-Mech's corporate counsel, although no resolution was passed removing Goldman from that position. Goldman testified that he was not aware that he had been replaced as Dyna-Mech's corporate counsel until late August, 1972. After the July 22, 1972 meeting, William Thompson took Dyna-Mech's books and records with him to California. At some time after July 22, 1972, 1,000,000 shares of Dyna-Mech stock were issued to William Thompson and 150,000 to his brother Larry Thompson.\n\nIt is against that background of Dyna-Mech's corporate history that the transaction involving Wassel, the plaintiff herein, and the defendants, Stillerman and Eglowsky, must be viewed. At some time in early July 1972, \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\" Eglowsky and Stillerman placed the following advertisement in the Wall Street Journal:\n\nCAPITAL WANTED\n\nLAND DEVELOPMENT COMPANY\n\nspecializing in recreational acreage ready to go public. Will accept a few additional investors.\n\n212-867-2541\n\nWassel, after reading that ad in the Friday, July 21, 1972 edition of that newspaper, called the indicated telephone number, a number which in fact was that of an answering service, and left his Baltimore, Maryland phone number with the answering service. A day or two later, Stillerman and Eglowsky returned Wassel's call, and inquired of Wassel as to how much money he had to invest. Wassel testified that he replied that he only had $30,000 to invest. Eglowsky, on the other hand, testified that Wassel responded that he (Wassel) managed an investment syndicate as well as having funds of his own to invest. In this instance at least, this Court finds Eglowsky's testimony to be more credible and finds that Wassel held himself out as having considerably more funds to invest than he actually had or controlled.\n\nDuring that telephone conversation, defendants described four investment opportunities which they were ready to make available to Wassel. One involved \"Tiderock\", a corporation which owned certain real estate and whose stock was privately owned. Defendants told Wassel that Tiderock was going to go public soon but before it could so do its financial statement required strengthening by the input of new cash. Defendants offered Wassel the opportunity to buy stock of Tiderock. Another opportunity defendants mentioned related to the stock of a bankrupt corporation, which corporation was being acquired by a solvent corporation which was going to place valuable assets into the bankrupt shell and accordingly cause the stock of the bankrupt to rise considerably. The other two opportunities were not clearly specified or otherwise described during the trial of this case. Wassel told Stillerman and Eglowsky that his business dealings often took him to New York and he would call them before he next came to New York.\n\nSometime previously, Eglowsky and his father-in-law had purchased 25,000 shares of Dyna-Mech stock at $0.10 per share from a Leon Nassar. During July 1972, Eglowsky was aware that Dyna-Mech had been a dormant company for at least a year. On July 9, 1972, Stillerman and Eglowsky \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\" were contacted by Miller who said that he had 130,000 shares of free-trading Dyna-Mech stock available at $1.25 per share. Miller confirmed that offer by a letter dated July 10, 1972 to which he also attached a copy of the notice to Dyna-Mech's stockholders of the upcoming July 22nd Dyna-Mech shareholder meeting. Eglowsky and Stillerman responded by asking Miller for more information about Dyna-Mech and about William Thompson. After Miller supplied additional information, Eglowsky and Stillerman, on July 17, 1972, made a tentative offer to Miller to purchase at $1 per share 80,000 of the 130,000 shares which Miller had offered and to acquire an option on the remaining 50,000. Two conditions were seemingly placed upon that offer: (1) the stock must be \"free trading\"; and (2) in the event that Dyna-Mech was not listed in the \"Pink Sheet\" [sic] -- i.e. quoted as publicly trading in the OTC \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\" market -- by October 31, 1972, the transaction would be rescinded.\n\nMiller was no stranger to Stillerman and Eglowsky -- or vice versa -- in July 1972. There had previously been a number of \"deals\" between Miller, on the one hand, and Stillerman and Eglowsky, on the other. Further, there have been a number of additional deals between them since the transactions considered herein took place. Indeed, there were other deals going on between them in 1972 simultaneously with the Dyna-Mech transaction. In fact, Canusa had originally been a corporation named American Franchise Development Corp. which was controlled by Gilled Industries, Inc. which in turn was controlled by Stillerman and Eglowsky, who caused control of American Franchise Development to pass to Miller. It appears that as a result of a number of complicated transactions which took place during the summer and fall of 1972 Miller owed Stillerman and Eglowsky a minimum of $40,000, excluding the effect of the Dyna-Mech transaction. \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\" In connection with one of those transactions Miller had given Stillerman and Eglowsky a check for $9,300.06 which had twice, after deposit by Stillerman and Eglowsky, failed to clear.\n\nIn late July 1972 Wassel telephoned Stillerman and Eglowsky from Baltimore to say that he would be going to New York within the next day or two and wished to meet and speak with them about the investment opportunities which they had previously mentioned. They told Wassel that he could not invest in Tiderock since the office of the Attorney General of New York had informed them that their ad in the Wall Street Journal might constitute an illegal public offering if any sales were made pursuant to it, but that they still had several other attractive opportunities available. One or two days after that telephone conversation Wassel and Eglowsky met in a New York hotel near the train station. According to Eglowsky, Wassel told Eglowsky that he headed an investment syndicate which had $100,000 available to invest; and Eglowsky told Wassel that he could not participate in the Tiderock deal for the reason he had previously given Wassel, but that Stillerman and he were investigating an investment in a bankrupt company which was being taken over by a solvent one. Also, according to Eglowsky, he said that a group was being formed to purchase all or almost all of the free trading shares of the bankrupt and that he expected that the stock of the bankrupt company would increase greatly in value; and he (Eglowsky) offered to let Wassel into the group in return for 25% of any profit which Wassel might make from the transaction. The meeting broke up with Eglowsky telling Wassel that he would get in touch with Wassel once the bankrupt company transaction had moved ahead. This Court accepts Eglowsky's account of that meeting.\n\nNot too many days thereafter Miller arrived in Stillerman's and Eglowsky's New York office with a certificate for 220,000 shares of Dyna-Mech in the name of Canusa and with an attached blank stock power, signed by Potts as Canusa's Treasurer, witnessed by Goldman and dated September 13, 1971. That stock certificate bore upon it the restrictive legend set forth supra at slip op. p. 5. When Eglowsky asked Miller how many shares of Dyna-Mech Miller owned in total, Miller said that he owned 130,000 shares himself and that Zertel Holdings Company, the stock of which he (Miller) owned, held another 140,000 shares. Miller said that all of those shares had originally been owned by Canusa but that they had been given to him and to Zertel during the previous year in satisfaction of loans of $200,000 to $300,000 which he had personally made to Canusa. Eglowsky said that, subject to verifying that Miller's shares were free trading, he and Stillerman were willing to put together a group to purchase the 130,000 shares, but that they wanted some sort of control over the other 140,000 to prevent Miller from selling them in the market and depressing the price. Miller assured them that the shares were free trading and gave them Goldman's name. Goldman, Miller said, was counsel for Dyna-Mech and either had written or was in the process of writing an opinion letter to the transfer agent stating that all of the shares Miller and Zertel owned were free trading and that the restrictive legend could be removed. Miller also assured Eglowsky and Stillerman that Dyna-Mech would be listed in the Pink Sheets by the end of October. Miller agreed to let Eglowsky and Stillerman \"hold\" the 140,000 shares of Dyna-Mech which belonged to Zertel while Eglowsky and Stillerman were putting together a group to buy the 130,000 shares which Miller owned in his own name. \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\" Miller then left the 220,000 share certificate with Eglowsky and Stillerman with the understanding that the latter would take the certificate to the transfer agent, Central Trust, in Rochester, in order to have those shares reissued in the \"street name\" of Otto Weinmann, a New York brokerage firm, in smaller certificates and without any restrictive legend upon them.\n\nWithin the next day or two Eglowsky called Goldman to verify that the shares were free trading. Eglowsky testified that he told Goldman that he was forming a group to buy those shares. Goldman, according to Eglowsky, said that those shares were free trading and that he was sending a letter to that effect to Central Trust. \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\"\n\nEglowsky testified that he then called Central Trust to verify that the Canusa shares were free trading. Atfield, who was then in charge of Central Trust's stock transfer department, does not remember such a call. For reasons discussed, it may not be important whether any such conversation took place. But if it did, it was at best a perfunctory conversation in which Eglowsky was told that certain shares could not be reissued without a restrictive legend upon them unless a letter of corporate counsel was received, and that Goldman had indicated that he expected to submit such a letter to Central Trust in the near future. \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\"\n\nAfter Eglowsky's conversation with Goldman he sent the 220,000 share certificate to Manjit Shukla, an employee of Otto Weinmann, and told Shukla that he (Eglowsky) had been told by Goldman that the shares were free trading and that those shares could be reissued in street name without the restrictive legend upon them as soon as Goldman's letter arrived at Central Trust. Shukla was to wait until that letter did arrive and then go to Rochester and get the shares reissued. Shukla then began to call Goldman repeatedly. Otto Weinmann's telephone records for August 1972 indicate that Goldman's Rochester telephone number was called three times on August 7, 1972 and five times on August 8, 1972. Shukla indicated in a deposition taken in connection with this case that he definitely spoke with Goldman and asked him if his opinion letter had been sent and if the stock was now free trading. Goldman admits that Shukla or someone from Otto Weinmann called his office repeatedly during that period of time but states that he never spoke with anyone, that no message was ever given to him and that he paid no attention and took no special interest in the eight long distance calls within 48 hours. This Court simply cannot accept Goldman's story and finds that Goldman did speak with Shukla and that Goldman knew that the Otto Weinmann brokerage house was eagerly awaiting the issuance of Goldman's opinion letter.\n\nGoldman testified that by August 8, 1972 he had completed the investigation necessary for him to issue a new opinion letter which would state that the restrictive legend could be removed from the 220,000 share certificate. Although Goldman testified that one of the major objections which Central Trust had raised in the June 23, 1972 meeting had been the lack of up-to-date Dyna-Mech financials, and although Goldman did not receive the Dyna-Mech financials he had ordered from Steffan \u0026 Company until August 15, 1972, nonetheless on August 8, 1972 Goldman sent a letter to Central Trust, accompanied only by a listing of the new officers and directors of Dyna-Mech and up-to-date financials of William Thompson International, Inc. and William Thompson Productions, Inc., two other corporations the stock of which was apparently owned or controlled by William Thompson. That letter read in part:\n\n* * *\n\nYou are hereby authorized to transfer 220,000 shares of the common stock of Dyna-Mech Sciences, Inc. as represented by the certificate which now stands in the name of Canusa Holdings Limited and to reissue a certificate as requested without the investment legend which appears on the original stock certificate. It is our opinion that more than two years having elapsed since the stock was originally issued that the stock has now come to rest.\n\n* * *\n\nOn the next day, Shukla appeared at Central Trust with the certificate. \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\" Central Trust broke it down into a large number of 500, 1000 and 5000 share certificates and reissued all of those certificates in the name of Otto Weinmann, with no restrictive legend upon them. On August 16, 1972, Miller having delivered the additional 50,000 shares of Dyna-Mech stock which he controlled to Eglowsky and Stillerman, and the latter having given them to Shukla, Shukla journeyed again from New York City to Central Trust in Rochester and had those certificates reissued free of restriction, \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\" and in Otto Weinmann's name. All 270,000 shares of Dyna-Mech issued in that name and received by Shukla in Rochester were turned over by the latter to Eglowsky and Stillerman. \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\"\n\nSince neither Goldman nor Central Trust played any significant role in events subsequent to August 16, 1972, it is appropriate at this point in this opinion to set forth findings of facts concerning their respective roles.\n\nGoldman, as Dyna-Mech's corporate counsel, played a prominent and a key role in the negotiations leading up to the take-over of Dyna-Mech by William Thompson. Pursuant to the June 7 and June 16 documents Goldman committed himself to getting the restriction removed from the Canusa shares. As a result of the Eglowsky and Shukla telephone calls Goldman was aware that those shares were not simply being sold to the Canusa shareholders or to William Thompson, who by this time had issued to himself 1,000,000 shares of additional Dyna-Mech stock, but rather that those shares were being sold to strangers not on the list of Canusa shareholders and that a New York City brokerage house was eagerly awaiting the issuance of his opinion letter pursuant to which certain of Dyna-Mech's stock would be free trading and reissued minus a restrictive legend. Goldman, who had been paid no legal fee before the summer of 1972 for his work as Dyna-Mech's counsel since his retention as counsel in July 1970, \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\" was to receive, pursuant to the June 7 and June 16 documents, a $15,000 legal fee if all arrangements were completed. Goldman chaired the July 22, 1972 meeting and voted 370,000 shares at that meeting in favor of William Thompson's assumption of control over Dyna-Mech. In an affidavit dated July 23, 1973 in connection with another proceeding Goldman stated in part:\n\n* * * [On] July 22, 1972, in Fort Erie, Ontario, a special shareholders' meeting was held at which time control of the corporation passed to a group headed by Mr. William Thompson of Los Angeles, California. Your deponent further states that Mr. Thompson was only interested in the corporate shell of Dyna-Mech Sciences, Inc. and any tax loss carry forward.\n\n* * * shortly thereafter it became apparent that Mr. Thompson had suffered severe financial setbacks and that his taking control of Dyna-Mech Sciences, Inc. was mere window-dressing and would in no way affect Dyna-Mech Sciences, Inc.' insolvency. * * *\n\nThe evidence in this case clearly and convincingly establishes that on August 8, 1972 Goldman rendered his quoted opinion letter to Central Trust as part of a comprehensive agreement reached between Goldman, Miller and Thompson who between them were clearly planning and controlling Dyna-Mech's destiny; and that Goldman was well aware on August 8, 1972 that the Canusa shares were going to be offered for sale to the public as soon as the restrictive legend had been removed and new certificates issued, but that nonetheless he wrote and delivered his August 8, 1972 letter in pursuance of the June documents.\n\nCentral Trust's position is quite different. This Court finds that Central Trust did not remove the restrictive legend from the Dyna-Mech stock represented by the certificate in Canusa's name until (1) it received an opinion from Goldman whom Central Trust believed in good faith and with good reason was corporate counsel for Dyna-Mech and (2) until it received from Otto Weinmann, in whose name the new shares were issued, a signed \"letter\" of \"representations and warranties\" which was grossly misleading. \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\" In view of all of the circumstances including the size of its fee and the practical realities as to how much independent investigation a transfer agent can be expected to make, Central Trust neither knew nor should have known on August 8, 1972 of any improprieties in the transfer of Canusa stock nor was it guilty of any culpably negligent practices in its conduct of its duties as stock transfer agent.\n\nAs stated supra, neither Goldman nor Central Trust played any role in the subsequent events after August 9, 1972 involving Wassel and the latter's attempted and/or accomplished wheelings and dealings with Eglowsky and Stillerman and later Thompson. After August 9, 1972, Eglowsky and Stillerman had in their possession 270,000 shares of unrestricted Dyna-Mech stock in small denomination street-name certificates, and felt sufficiently confident to \"purchase\" from Miller on August 15, 1972 25,000 shares at $1.00 per share and an option for another 50,000 shares. Purchase is perhaps not an exact description of what really occurred since only $4700 of the purchase price was paid in cash and the rest was covered by three post-dated checks, two bearing dates of September 4, 1972 and signed by Eglowsky, and one check being for half the purchase price, i.e., $12,500 signed by Stillerman, bearing the date of November 2, 1972. In view of the amount of the then outstanding debt Miller owed to Eglowsky and Stillerman and the nature of the previous dealings among the three, a check dated that far in the future could hardly be considered the real equivalent of immediate payment. \u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\" Nonetheless, on August 15, 1972, according to Eglowsky's testimony, Miller executed an undated \"Bill of Sale\" to Eglowsky and Stillerman for 25,000 shares of Dyna-Mech stock.\n\nThere were differences in testimony at trial as to whether Wassel next contacted Stillerman and Eglowsky or vice versa, but in any event Stillerman and Eglowsky mailed to Wassel on August 24, 1972 a copy of Miller's \"Bill of Sale\". An accompanying cover letter signed \"Ed and Steve\" ended: \"We look forward to seeing you next week.\" \u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\" Shortly thereafter, Wassel called Stillerman and Eglowsky and said that he was interested in the Dyna-Mech transaction and would come to New York to discuss it with Stillerman and Eglowsky if they paid his expenses to New York including his air fare from Baltimore. Stillerman and Eglowsky agreed to pay Wassel's expenses but insisted that he travel to New York by train rather than plane. \u003cspan class=\"fnref\"\u003e36\u003c/span\u003e\"\n\nOn August 30, 1972, Wassel did arrive (via train) in New York. He immediately went to the office of Stillerman and Eglowsky where he stayed for approximately five hours. At trial Wassel insisted that he was shown absolutely no written material relating to Dyna-Mech. Eglowsky testified, however, that he showed Wassel a number of documents including promotional material concerning the motion picture which William Thompson was in the process of producing as well as various financial statements of William Thompson and Dyna-Mech. \u003cspan class=\"fnref\"\u003e37\u003c/span\u003e\" Eglowsky's testimony that, as an eager seller, he waved every piece of paper he could find in the face of a potential buyer like Wassel is much more credible than Wassel's testimony that he simply sat and listened to Stillerman and Eglowsky talk about Dyna-Mech over a period of five hours, without once being shown any written support for their claims. \u003cspan class=\"fnref\"\u003e38\u003c/span\u003e\" There was also considerable dispute about Eglowsky's oral statements to Wassel on August 30, 1972 concerning the Dyna-Mech transaction. Wassel testified that Eglowsky promised that Wassel's money would triple in three weeks. Eglowsky testified that he gave a rather straightforward though optimistic evaluation of the transaction. The truth would seem to lie somewhere in between. Undoubtedly, Eglowsky painted a very attractive picture of the Dyna-Mech transaction. On the other hand, Wassel's over-eagerness caused him to view that glowing picture in an even more attractive light than painted by Eglowsky. In particular, Eglowsky seems to have emphasized that there was a limited number of free trading shares of Dyna-Mech outside of the Miller shares. Also, Eglowsky apparently implied or even perhaps rather explicitly stated that the fact of the revitalizing infusion of Thompson's assets into the Dyna-Mech shell was not widely known and was \"inside\" information to which Eglowsky and Stillerman were privy because of their dealings and association with Miller. \u003cspan class=\"fnref\"\u003e39\u003c/span\u003e\" Wassel construed those comments by Eglowsky as meaning that Stillerman and Eglowsky could and did intend to \"finagle\" (Wassel's own word) the price of Dyna-Mech for their own profit. Seemingly, Wassel had no objection thereto as long as he also was a beneficiary of the finagling. \u003cspan class=\"fnref\"\u003e40\u003c/span\u003e\"\n\nIn addition to the Dyna-Mech transaction Wassel also inquired during his August 30, 1972 meeting with Stillerman and Eglowsky about any other \"deals\" which Stillerman and Eglowsky were then putting together in which he (Wassel) might participate. In particular Wassel asked if he could participate in the Tiderock transaction, but Stillerman and Eglowsky repeated what they had earlier told Wassel, namely, that the New York Attorney General's statement that the Wall Street Journal ad possibly constituted a public offer had made them decide not to sell any participation in Tiderock to any person who had responded to that ad. Wassel then inquired about Gilled Industries, Inc. Eglowsky told Wassel that any shares of Gilled purchased from Eglowsky and/or Stillerman who were respectively President and Vice President of Gilled would be restricted but that unrestricted, i.e., free-trading, shares of Gilled could possibly be purchased from Peter Stone who was an attorney who had previously done some legal work for Gilled and had been paid for that work in Gilled stock. Wassel also indicated a desire to participate with Stillerman and Eglowsky in the option which they held to purchase an additional 50,000 shares of Dyna-Mech from Miller. Eglowsky testified that he telephoned William Thompson from his office on August 30, 1972, that he put Wassel on the telephone with Thompson, that Wassel and Thompson then spoke for approximately twenty minutes, and that after the phone call Wassel seemed impressed with Thompson's plans for Dyna-Mech. Seemingly, on that date, August 30, 1972, Wassel, Eglowsky and Stillerman reached agreement upon a number of investments Wassel was to make. However, Wassel did not sign any documents on August 30, 1972, but indicated that he would return the next day with Robert Howard, Esq., a New York Attorney with whom Wassel had previously participated in an unrelated investment transaction involving the purchase by a group including Wassel and Howard \u003cspan class=\"fnref\"\u003e41\u003c/span\u003e\" of some bonds. As Wassel put it, he wanted Howard \"to check the wording\" before he, Wassel, signed any documents.\n\nThe next morning, August 31, 1972, Wassel called Howard from Stillerman's and Eglowsky's office and asked Howard to come over. When Howard arrived Wassel took him aside and told Howard that he (Wassel) \"was making a terrific deal\" \u003cspan class=\"fnref\"\u003e42\u003c/span\u003e\" and that \"the deal was all set\". \u003cspan class=\"fnref\"\u003e43\u003c/span\u003e\" Essentially, Howard's role at the August 31, 1972 meeting was to draw up necessary documents to effectuate properly the transactions which Wassel, Eglowsky, Stillerman and Stone had already agreed to. The first of those transactions was that Wassel was to purchase 25,000 shares of Dyna-Mech at $1.00 a share from Miller, which shares were to be pooled with the 25,000 Eglowsky and Stillerman had previously purchased from Miller, and were to be kept in street name with Otto Weinmann. Stillerman and Eglowsky were to have discretionary authority for a four-month period to sell those shares with all sales to be allocated equally between Wassel's shares and Stillerman's and Eglowsky's shares. It was also agreed that Wassel was to have a 25% interest in the option held by Stillerman and Eglowsky to purchase the additional 50,000 shares of Dyna-Mech from Miller. In a separate transaction Gilled was to grant Wassel an option to purchase on or before September 29, 1972, 50,000 shares of restricted Gilled stock at $0.46 per share. Apparently Wassel did not pay anything extra for that option. Finally, Wassel was to purchase from Stone for $3,000 an option to purchase, on or prior to November 30, 1972, 18,411 shares of unrestricted Gilled stock for $1.00 per share owned by Stone. The Gilled option for 50,000 shares contained a provision that should Wassel not exercise the option to purchase Stone's shares by September 29, 1972, then Gilled would pay Wassel $3,000 for that option. Wassel testified that the plan underlying those arrangements was the expectation that a large, short-term profit would be realized by Stillerman, Eglowsky and Wassel in the Dyna-Mech stock as soon as public trading in Dyna-Mech began, \u003cspan class=\"fnref\"\u003e44\u003c/span\u003e\" and that Wassel's share of the profit would be available to enable him to pick up the options on the additional 50,000 shares of Dyna-Mech, the 50,000 shares of Gilled, and the Stone option. Wassel testified that Stillerman and Eglowsky assured him that he, Wassel, would be a rich man within a short time and would make $300,000 to $400,000 from his investment of a total of $28,000. On August 31, 1972, before he signed any documents, Wassel spoke with Miller over the telephone and discussed the Dyna-Mech transaction with him. \u003cspan class=\"fnref\"\u003e45\u003c/span\u003e\" Wassel then signed the agreement drafted by his attorney, Howard, and previously agreed to by Wassel, Eglowsky and Stillerman, which provided that Wassel was to purchase 25,000 shares of Dyna-Mech from Miller at $1.00 per share and was to have a 25% interest in the option to purchase 50,000 shares which Stillerman and Eglowsky had acquired from Miller. Wassel wrote and signed a check for $25,000 made out to Miller and gave it to Stillerman and Eglowsky. Then Wassel went with Stillerman to Stone's office where he signed an option agreement seemingly drafted by Stone and wrote out a check for $3,000 payable to Stone. Additionally, a Gilled corporate resolution which gave Wassel an option to purchase 50,000 shares of Gilled was drafted by Howard and typed in Howard's office the next day, September 1, 1972. \u003cspan class=\"fnref\"\u003e46\u003c/span\u003e\" On August 31, 1972, after the above transactions were completed, Eglowsky wrote Wassel a check on Gilled's account to pay for Wassel's trip expenses to and in New York. Wassel then returned to Baltimore. Some days later, after some initial confusion, Wassel received a receipt from Otto Weinmann indicating that 25,000 shares of Dyna-Mech were being held for his account in street name at Otto Weinmann. \u003cspan class=\"fnref\"\u003e47\u003c/span\u003e\"\n\nAfter his purchase of the Dyna-Mech stock, Wassel eagerly anticipated its opening for public trading and during September 1972 repeatedly called Stillerman and Eglowsky to ascertain why the Dyna-Mech stock had not yet appeared in the Pink Sheets. Stillerman and Eglowsky told Wassel to be patient and that the OTC trading of Dyna-Mech stock had been temporarily delayed. Later in September 1972 Wassel was contacted directly by Miller who offered him a package investment in which for $50,000 Wassel would receive 20,000 shares of unrestricted Dyna-Mech stock and 100,000 shares of Anusound Corporation which apparently was one of the Canusa companies under a new name. Wassel accepted Miller's offer to pay Wassel's expenses for a trip to New York City, journeyed to that city, talked to Miller, but did not enter into any transactions with Miller as a result of that trip. Wassel testified at trial that after that meeting with Miller, he \"felt that he had been lied to\" by Eglowsky and Stillerman because he (Wassel) then recalled that Eglowsky and Stillerman had previously assured him that Wassel's 25,000 shares, the 25,000 shares owned by Eglowsky and Stillerman, and their jointly held option on 50,000 shares represented all of the outstanding \"tradeable\", i.e., unrestricted, Dyna-Mech stock. \u003cspan class=\"fnref\"\u003e48\u003c/span\u003e\" However, although Wassel has testified that he felt during his trip to New York City which was paid for by Miller that he (Wassel) had been previously lied to by Eglowsky and Stillerman, Wassel did not at that time confront Stillerman and Eglowsky with that alleged lie on their part, but rather kept calling them to find out when public trading in Dyna-Mech would begin.\n\nIn early October 1972 Wassel received a telephone call from William Thompson in California. Thompson indicated that he wished to offer some investments to Wassel. Wassel agreed to go to Los Angeles to meet with Thompson, but only after Thompson agreed not only to pay Wassel's expenses in Los Angeles and between Los Angeles and Baltimore, but also to pay the entire cost of a ten-day far-western vacation for Wassel and his wife in San Francisco and Las Vegas after Wassel left Thompson in Los Angeles and before Wassel and his wife returned to Baltimore. \u003cspan class=\"fnref\"\u003e49\u003c/span\u003e\"\n\nDuring September Wassel not only made a number of telephone calls to Eglowsky and Stillerman to determine when Dyna-Mech would be listed in the Pink Sheets, but Wassel also called and was called by Otto Weinmann repeatedly for the same reason. Otto Weinmann's telephone records indicate that on September 22, 1972 a six-minute call was made from Otto Weinmann to Wassel, on September 25, 1972 an eleven-minute collect call was accepted by Otto Weinmann from Wassel, on September 29, 1972 a seventeen-minute collect call from Wassel was accepted, on October 2, 1972 a thirteen-minute call was placed to Wassel, and on October 3, 1972 a one-minute call was placed to Wassel. On October 4, 1972 Dyna-Mech appeared in the Pink Sheets and began trading publicly at a price of $1 bid and $1-1/2 asked. \u003cspan class=\"fnref\"\u003e50\u003c/span\u003e\" On the same day, i.e., October 4, 1972, at 9:06 A.M., a two-minute telephone call was made from Otto Weinmann in New York to Wassel's home telephone in Pikesville, Maryland. Wassel testified that he did not receive that call nor did he receive any message from any person that Otto Weinmann had called that morning. In view of Wassel's admission at trial that he had repeatedly called Otto Weinmann during September to see if Dyna-Mech was trading publicly and in view of the fact that Wassel's testimony herein has not proven to be credible in a number of other instances, this Court does not attach credibility to Wassel's said denial and finds that on October 4, 1972 Wassel was told by Otto Weinmann that Dyna-Mech had begun to trade publicly at a price equal to or higher than that at which Wassel had purchased his Dyna-Mech stock.\n\nOn October 6, 1972 Wassel and his wife flew from Baltimore to Los Angeles at Thompson's expense. While Wassel was in California Thompson offered Wassel two investments. One involved the purchase by Wassel of 300,000 shares of restricted Dyna-Mech stock for $50,000. The second related to the purchase by Wassel of a 25% interest in a television program which Thompson was attempting to produce and sell. Wassel testified that his sole purpose in accepting Thompson's invitation to California was to find out more about Dyna-Mech from the man who was then running it. Wassel also testified that it was only upon his arrival in California on October 6, 1972 that he obtained a copy of the report to Dyna-Mech shareholders signed by Thompson and dated September 8, 1972. However, deposition testimony given by Wassel prior to trial contradicts that assertion. \u003cspan class=\"fnref\"\u003e51\u003c/span\u003e\" Wassel's explanation at trial of the conflict in his statements was evasive and unconvincing, and leads this Court to find that Wassel as a Dyna-Mech shareholder received from Otto Weinmann a copy of that September 8, 1972 letter on or shortly after that date. Wassel, even though he, by his own account, knew at the time he did so that Dyna-Mech was a bankrupt company, signed a \"Memorandum of Agreement\" dated October 6, 1972 with Thompson. That document reads as follows:\n\nMEMORANDUM OF AGREEMENT\n\nWilliam Thompson, Inc., hereby agrees, in consideration for the sum of $1.00 (One dollar), to sell to Dr. Bernard V. Wassel the sum of 300,000 (Three hundred thousand) shares of restricted investment stock for the total sum of $50,000.00 (Fifty thousand dollars) payable on or before November 30, '72.\n\nThis transaction has been approved and agreed to by the board of Directors of William Thompson, Inc., at a special meeting held on September 30, 1972, at Lake Dallas, Texas.\n\n/s/ William Thompson, Inc. [SEAL]\n\nWilliam Thompson, Inc.\n\nWilliam Thompson, President\n\nAgreed and Accepted by:\n\n/s/ Bernard Wassel\n\nDr. Bernard V. Wassel\n\nWitnessed by: /s/ Calvin Ward\n\nCalvin Ward\n\nOctober 6, 1972.\n\nAt trial Wassel, a non-lawyer, characterized that \"Memorandum\" as an \"option\" and testified that he had no intention of investing a single penny in Dyna-Mech stock at the time he signed the \"Memorandum\" and that, by signing it, he (Wassel) was only attempting to acquire documentary evidence which he could take back with him to New York and show to Eglowsky and Stillerman who, he (Wassel) had come to believe, by October 6, 1972, had \"swindled\" him. Wassel's alleged lack of interest in purchasing shares of restricted Dyna-Mech stock at 17 cents apiece on a day when shares of unrestricted Dyna-Mech were being publicly traded at 1-1/4 to 1-1/2 bid and 1-3/4 to 2 asked is skeptically noted.\n\nOn October 6, 1972, in addition to signing the aforementioned Memorandum, Wassel also contracted to purchase a 25% interest in a television program which Thompson was producing. That action is noteworthy in the face of Wassel's testimony at trial that when he was with Thompson in California in October 1972 he (Wassel) had neither the capital nor the intention to enter into any further investments whatsoever. Not only is Wassel's account of his dealings with Thompson in California inherently incredible, but it is also directly contradicted by the testimony of both Eglowsky and Calvin Ward, a Vice-President of Dyna-Mech under the Thompson regime and the man who witnessed the execution of the October 6, 1972 Memorandum by Thompson and Wassel. Eglowsky testified that during October 1972 Thompson telephoned him in New York and told him that Wassel had bought an additional 300,000 shares of Dyna-Mech. Eglowsky then telephoned Wassel and, after some initial dissembling, Wassel admitted buying the additional Dyna-Mech shares and the 25% interest in the television program. Wassel indicated to Eglowsky that he believed that he, Wassel, had pulled off an investment coup in buying the Dyna-Mech stock from Thompson and offered to let Stillerman and Eglowsky participate with him in the transaction. Eglowsky's testimony that Wassel bought the Dyna-Mech stock outright is supported by Ward who was present when Wassel and Thompson signed the \"Memorandum\". Ward testified that from Wassel's statements and from the general tone of the discussion at the time of the signing, it was his (Ward's) impression that Wassel was buying the Dyna-Mech shares outright rather than acquiring an option to buy them.\n\nAfter Wassel signed the Memorandum and signed another document relating to the television production, \u003cspan class=\"fnref\"\u003e52\u003c/span\u003e\" Wassel and his wife continued their vacation in San Francisco and Las Vegas, spending a total of ten days in those two cities. Their expenses for the entire trip were paid by Thompson. Wassel testified that once he saw the September 8, 1972 letter to shareholders and realized that Thompson was willing to offer 300,000 shares of Dyna-Mech at less than $0.17 per share he realized that he had been swindled by Stillerman and Eglowsky. Even if this Court were to accept that testimony at face value, there would be no apparent explanation for Wassel's spending ten days vacationing before making any effort to contact the two men whom he now believed had swindled him. But in any event, this Court rejects Wassel's testimony regarding his California trip, and finds that Wassel, who had been told by Otto Weinmann on October 4, 1972 that Dyna-Mech stock had begun publicly trading at above the $1 per share price which Wassel had paid for his shares, went to California and signed the \"Memorandum\" and other document with Thompson fully intending to meet his obligations under those documents before the date of November 30, 1972 specified in the Memorandum, by using the profits he (Wassel) expected to realize from the various transactions he had entered into with Stillerman, Eglowsky and Stone. After Wassel left Los Angeles and while he and his wife were on the vacation portion of their far-western trip, Dyna-Mech continued to trade publicly with bid prices in the range of 1 to 1-1/2. On October 16, 1972, however, the day Wassel returned to Baltimore, Dyna-Mech's price began to drop. On October 17, 1972, Dyna-Mech's bid price was only 1/2. After October 17, 1972, and during the remainder of the period relevant herein, the bid price for a share of Dyna-Mech never rose above 5/8. Wassel then contacted Stillerman and Eglowsky and arranged a meeting with them to be held on October 24, 1972. On that day, Stillerman, Eglowsky and Wassel met with Howard present. During the course of that meeting, after Wassel indicated that he had no intention of exercising the Stone option, Eglowsky wrote Wassel a $3,000 check. Wassel testified that at the outset of the meeting he accused Stillerman and Eglowsky of swindling him, and demanded the return of all of his money. Wassel testified that Stillerman and Eglowsky agreed to return all of Wassel's money, i.e., $28,000, and that the $3,000 was only an initial payment. Eglowsky testified that the sequence of events was quite different. He testified that when Wassel appeared at the office with Howard, he was accompanied by Ward, as mentioned previously a Vice President of Dyna-Mech, who told Stillerman and Eglowsky that Wassel had asked Ward to collect from them the money that Wassel owed Thompson for the Dyna-Mech and television production transactions. \u003cspan class=\"fnref\"\u003e53\u003c/span\u003e\" Eglowsky told Ward that they were not interested in any investments with Thompson and would not give Ward any money. Howard then said that Wassel had decided not to exercise the Gilled option and, as provided in the Gilled corporate resolution which Howard had drafted, Eglowsky then wrote Wassel a check for $3,000. This Court accepts Eglowsky's testimony that the $3,000 was in payment for the option and rejects Wassel's testimony that the $3,000 was a down payment on the return of $28,000. That conclusion is supported by Eglowsky's endorsement of the back of the check which read:\n\nOn behalf of Gilled Industries for option on 18,411 shares\n\nWassel's handwritten endorsement was written on the back of that check directly below that of Eglowsky. Wassel conceded at trial that he read that endorsement at the time at which Eglowsky wrote it. Wassel also testified that he waited until he had received the said $3,000 check before he (Wassel) accused Stillerman and Eglowsky of swindling him and before he demanded the return of all of the rest of his money. Eglowsky and Stillerman refused and apparently either they and/or Howard suggested that some effort be made to see if Dyna-Mech could be saved as a viable company. \u003cspan class=\"fnref\"\u003e54\u003c/span\u003e\" The October 24, 1972 meeting then broke up with Wassel storming out of Stillerman's and Eglowsky's office and threatening to complain about them to the office of the Attorney General of the State of New York and to the federal Securities and Exchange Commission (SEC). Over the next six or seven weeks Wassel conducted a seemingly continuous campaign to persuade Stillerman and Eglowsky to return Wassel's $25,000. Seemingly at no time did Wassel ever even try to contact Miller to whom his check for $25,000 had been made out. Wassel's campaign by his own admission did include complaints to the New York Attorney General's office, and to the SEC. Wassel also admitted making calls to Eglowsky's wife and to Stillerman's father for the purpose, Wassel testified, of persuading Dr. Stillerman and Mrs. Eglowsky to assist him in his obtaining the return of his money. \u003cspan class=\"fnref\"\u003e55\u003c/span\u003e\" On December 7, 1972, Wassel instituted the present action against Stillerman and Eglowsky. \u003cspan class=\"fnref\"\u003e56\u003c/span\u003e\"\n\nPLEADINGS\n\nWassel's original complaint, filed pro se, named Eglowsky, Stillerman and Stone as defendants, and alleged that Wassel had replied to an advertisement in the Wall Street Journal, and subsequently had received in Baltimore a telephone call placed to him from New York City by the defendants. The original complaint sets forth a somewhat colored but clearly recognizable account of Wassel's purchase of the 25,000 shares of \"Dyno-Mech\" (sic), the Stone option and the Gilled option. The complaint concluded as follows:\n\nThe Defendants breached the contract and refuse to return to the Plaintiff his $25,000.00 [sic]\n\nWHEREFORE, the Plaintiff demands the return of his $25,000.00; actual damages of $25,000.00; punitive damages of $50,000.00 and compensatory damages of $50,000.00.\n\nCOUNT TWO\n\nFor that by the allegations as set forth in Count One, the Plaintiff sues the Defendants for obtaining money from the Plaintiff by false and defraudulent means.\n\nWHEREFORE, the Plaintiff demands the return of his $25,000.00; actual damages of $25,000.00; punitive damages of $50,000.00 and compensatory damages of $50,000.00.\n\nCOUNT THREE\n\nFor that by the allegations as set forth in Count One, the Plaintiff sues the Defendants for obtaining money from the Plaintiff by false pretenses.\n\nWHEREFORE, the Plaintiff demands the return of his $25,000.00; actual damages of $25,000.00; punitive damages of $50,000.00 and compensatory damages of $50,000.00.\n\nAfter process had been served on each of the three originally designated defendants, Wassel sought and after some delay retained counsel to represent him. In a communication to this Court dated March 19, 1973 Wassel enclosed, inter alia, a copy of Rule 10b-5, 17 C.F.R. § 240.10b-5. After some further delay, Wassel, without opposition by defendants, filed on July 5, 1973 an amended complaint, which, after again recounting Wassel's version of the facts of the August 31-September 1, 1972 transactions, alleged, in part:\n\n9. That said representatives [sic] on the part of the Defendants, Stephen H. Stillerman and Edward M. Eglowsky, constituted a manipulative scheme to defraud the Plaintiff, said scheme being based on untrue facts, and the Defendant, Peter G. Stone participated in said scheme by acting in concert with the Defendants, Stephen H. Stillerman and Edward M. Eglowsky in arranging for the sale to the Plaintiff of the Gilled option.\n\n10. The foregoing actions of Defendants were violations of Section 10(b) of the Securities Act and the rules and regulations promulgated thereunder and entitle Plaintiff to maintain this case to recover all damages by him sustained.\n\nSubsequently Wassel's first counsel retired from the case and Wassel retained new counsel. Thereafter, in a memorandum filed April 24, 1974 in support of a motion by Wassel for summary judgment, counsel for Wassel referred, seemingly for the first time, to section 12(1) of the '33 Act. On July 24, 1974, Wassel filed without objection by any of the three defendants, a second amended complaint which clearly alleged violation of section 12(1) and Rule 10b-5 and demanded rescission of both the Dyna-Mech and Stone option transactions.\n\nOn August 13, 1974, Eglowsky and Stillerman answered the second amended complaint and asserted, inter alia, the affirmative defense of limitations against the count based on section 12(1) and, in addition, filed a third-party complaint for indemnification and contribution against Goldman, Central Trust and Miller. However, counsel for Eglowsky and Stillerman specifically requested that Miller, a resident of Canada, not be served with process. In fact, Miller never was so served, and prior to trial Stillerman and Eglowsky voluntarily withdrew their third-party complaint against Miller. \u003cspan class=\"fnref\"\u003e57\u003c/span\u003e\" Goldman also originally filed a crossclaim against Miller but withdrew that crossclaim, without prejudice, at the start of the trial.\n\nCASE-IN-CHIEF\n\nA. Venue\n\nEglowsky and Stillerman assert that venue herein does not properly lie in this District. The venue provision of the '33 Act is located in section 22(a), 42 U.S.C. § 77v, which provides in part:\n\nJurisdiction of offenses and suits. --\n\n(a) The district courts of the United States, and the United States courts of any Territory, shall have jurisdiction of offenses and violations under this subchapter and under the rules and regulations promulgated by the Commission in respect thereto, and, concurrent with State and Territorial courts, of all suits in equity and actions at law brought to enforce any liability or duty created by this subchapter. Any such suit or action may be brought in the district wherein the defendant is found or is an inhabitant or transacts business, or in the district where the offer or sale took place, if the defendant participated therein, and process in such cases may be served in any other district of which the defendant is an inhabitant or wherever the defendant may be found. * * *\n\nThe venue provision of the '34 Act is contained in section 27, 15 U.S.C. § 78aa, which provides in part:\n\nJurisdiction of offenses and suits. --\n\nThe district courts of the United States, and the United States courts of any Territory or other place subject to the jurisdiction of the United States shall have exclusive jurisdiction of violations of this chapter or the rules and regulations thereunder * * * Any suit or action to enforce any liability or duty created by this chapter or rules and regulations thereunder, or to enjoin any violation of such chapter or rules and regulations, may be brought in any such district or in the district wherein the defendant is found or is an inhabitant or transacts business, and process in such cases may be served in any other district of which the defendant is an inhabitant or wherever the defendant may be found. * * *\n\nIn Stern v. Gobeloff, 332 F. Supp. 909, 911 (D. Md. 1971), which also involved a question as to whether venue was proper in a suit brought under both of the '33 and '34 Acts, Judge Murray of this Court wrote:\n\nAs to venue, it is not necessary that defendants be found to have \"transacted business\" in this district in order to support venue. Where an offer to sell securities is made by telephone by an offeror in one federal district and accepted by an offeree in another, part of the \"act or transaction constituting the violation\" occurs in each district, and venue may be laid in either. United States v. Bushwick Mills, 165 F.2d 198 (2nd Cir. 1947); Hooper v. Mountain State Securities Corp., 282 F.2d 195 (5th Cir. 1960).\n\n* * *\n\nAccordingly, in view of the undisputed facts as to the long distance telephone discussions between Wassel in Maryland and Stillerman and/or Eglowsky in New York, venue lies in this Court in the case-in-chief.\n\nB. Relation-Back of the Section 12(1) Count\n\nDefendants contend that Wassel's claim based on section 12(1) of the '33 Act was not timely filed, and is barred by limitations. The limitations provision which governs actions brought under section 12(1) is set forth in section 13 of the '33 Act, 15 U.S.C. § 77m, which provides:\n\nLimitation of actions. -- No action shall be maintained to enforce any liability created under section [11 or section 12(2)] * * * unless brought within one year after the discovery of the untrue statement or the omission, or after such discovery should have been made by the exercise of reasonable diligence, or, if the action is to enforce a liability created under section [12(1)] * * *, unless brought within one year after the violation upon which it is based. In no event shall any such action be brought to enforce a liability created under section [11 or section 12(1)] * * * more than three years after the security was bona fide offered to the public, or under section [12(2)] * * * more than three years after the sale.\n\nThe second amended complaint was seemingly filed within \"* * * three years after the security was bona fide offered to the public * * *\" since in this Court's view, as indicated supra, no bona fide public offering of Dyna-Mech stock was ever made. However, the second amended complaint was filed more than 22 months after the \"* * * violation upon which it [the 12(1) count] is based\", i.e., the sale by Eglowsky and Stillerman to Wassel of the 25,000 shares of Dyna-Mech stock, and thus more than one year after such violation. Accordingly, the 12(1) count of the second amended complaint is barred by section 13 unless that count relates back to the date of the original complaint. Rule 15(c) of the Federal Rules of Civil Procedure provides in part:\n\nRelation Back of Amendments. Whenever the claim or defense asserted in the amended pleading arose out of the conduct, transaction, or occurrence set forth or attempted to be set forth in the original pleading, the amendment relates back to the date of the original pleading. * * *\n\nIn 6 C. WRIGHT \u0026 A. MILLER, FEDERAL PRACTICE AND PROCEDURE § 1497 at 499-500 (1971 ed.), the authors have written that the\n\n* * * federal rules represent a shift away from the rigidified notions of \"forms\" and \"causes of action\" to more functional concepts phrased in terms of the underlying conduct, transaction, or occurrence that provides the background of the dispute. The fact that an amendment changes the legal theory on which the action initially was brought is of no consequence if the factual situation upon which the action depends remains the same and has been brought to defendant's attention by the original pleading. [Footnotes omitted.]\n\nIn Shuman v. Sherman, 356 F. Supp. 911 (D. Md. 1973), this Court had occasion to consider whether an amendment alleging a violation of section 12(2) of the '33 Act related back to the date of the original complaint which alleged, in addition to other claims not relevant herein, violation of section 12(1) of the '33 Act. In Jackson v. Airways Parking Company, 297 F. Supp. 1366 (N.D. Ga. 1969), cited and quoted from in Sherman (at 915 n.13), Judge Edenfield wrote (at 1382):\n\n* * * The point of Rule 15(c) is that it is fair to have an amended complaint relate back if the initial complaint put the defendant on notice that a certain range of matters was in controversy and the amended complaint falls within that range. The \"cause of action\" doctrine is an unduly restrictive interpretation of Rule 15(c). It does not do justice to the actual statutory language. Notice, not mechanical notions of cause of action for res judicata purposes, is the key. As the Fifth Circuit put it:\n\n\"When a suit is filed in a federal court under the Rules, the defendant knows that the whole transaction described in it will be fully sifted, by amendment if need be, and that the form of the action or the relief prayed or the law relied on will not be confined to their first statement.\" Barthel v. Stamm, 145 F.2d 487, 491 (5th Cir., 1944), cert. den., 324 U.S. 878, 89 L. Ed. 1430, 65 S. Ct. 1926 (1945).\n\nLeading commentators now recognize that if the original pleading gives fair notice of the general fact situation out of which the claim arises, the defendant cannot be heard to complain of the amended complaint arising out of the same transaction. 3 Moore, para. 15.15[2]. * * *\n\nIn Shuman this Court held that such \"fair notice\" had not been given to the defendants and that the amendment could not relate back. In Shuman (at 916) it is noted that the original 12(1) complaint dealt with a sale of securities occurring \"within the time frame of October 15-17, 1968 only\", and that the alleged 12(2) violation which was the gravamen of the amended complaint concerned activities \"* * * occurring in the time frame of January/February, 1968, ten months prior to the activities complained of in the original complaint.\" The situation presented herein is quite different. From the date of the original complaint the defendants have known that Wassel was attacking in connection with events which occurred in their office on August 30-31, 1972. As Judge Sibley wrote in Barthel v. Stamm, 145 F.2d 487, 491 (5th Cir. 1944), cert. denied, 324 U.S. 878, 89 L. Ed. 1430, 65 S. Ct. 1926 (1945) (quoted from in Jackson at 1382 and Shuman at 915 n.13), once the original complaint herein was filed, Eglowsky and Stillerman should have been on notice \"* * * that the whole transaction described in it * * * [would] be fully sifted, * * *\" and that Wassel would not be limited to his original legal theory. Accordingly, since the claim asserted in the amended complaint arose out of the identical occurrence set forth in the original complaint and since that original complaint put Eglowsky and Stillerman on fair notice of the events that Wassel claimed gave rise to his right to recover, this Court holds that the second amended complaint relates back to the date of filing of the original complaint and that therefore Wassel's section 12(1) cause of action is not barred by the limitations provision of section 13.\n\nEglowsky and Stillerman have asserted as an alternative affirmative defense that Wassel's quest for rescission under section 12(1) is barred by the equitable doctrine of laches. While the period of time Wassel waited before instituting this suit or ever making claim on Eglowsky and Stillerman would appear to bar Wassel from obtaining rescission or rescissionary damages, \u003cspan class=\"fnref\"\u003e58\u003c/span\u003e\" that delay would not seem to add up to delay of sufficient extent to constitute laches. In any event, however, laches seemingly has no application in an action brought under section 12(1), since, even though the buyer in a 12(1) proceeding is seeking to rescind the purchase by and the sale to him, a 12(1) action \"* * * is one at law for money judgment.\" Straley v. Universal Uranium and Milling Corp., 289 F.2d 370, 373 (9th Cir. 1961). Wassel, as a purchaser who still owns the security, seeks in this case pursuant to section 12(1) the return of the purchase price. In sum, laches poses no bar to Wassel's within 12(1) action.\n\nC. Elements of Liability under Section 12(1)\n\nSection 12(1) of the '33 Act, 15 U.S.C. § 77l, provides:\n\nAny person who --\n\n(1) offers or sells a security in violation of section [5] of this title [making it unlawful to use the mails or other facility of interstate commerce or transportation or communication to sell an unregistered security], * * *\n\nshall be liable to the person purchasing such security from him, who may sue either at law or in equity in any court of competent jurisdiction, to recover the consideration paid for such security with interest thereon, less the amount of any income received thereon, upon the tender of such security, or for damages if he no longer owns the security.\n\nThe elements of a 12(1) action have been succinctly set forth as follows by Judge Wisdom in Lewis v. Walston \u0026 Co., 487 F.2d 617, 621 (5th Cir. 1973):\n\nLiability for the sale of unregistered securities is absolute under § 12(1) of the Securities Act of 1933. A purchaser may recover regardless of whether he can show any degree of fault, negligent or intentional, on the seller's part. Liability is established if the plaintiff proves three elements: (1) that no registration statement covering the securities involved was in effect; (2) that, in the language of the statutes, the defendants were \"[persons] who [sold] or [offered] to sell\" the securities; (3) that the mails, or facilities for interstate transportation or communications were used in making the sale. * * * [Footnote omitted.]\n\nHerein, the first element referred to by Judge Wisdom, the nonregistration of the Dyna-Mech stock, was stipulated by counsel during trial. The third element, the use of a facility of interstate transportation or communication, is satisfied by the numerous interstate telephone calls both preceding and following the transaction involved herein between Wassel in Maryland and Stillerman and Eglowsky in New York. Indeed, even purely intrastate telephone calls apparently satisfy the jurisdictional requirements of the federal securities laws. See Kerbs v. Fall River Industries, Inc., 502 F.2d 731, 737-38 (10th Cir. 1974); Myzel v. Fields, 386 F.2d 718, 727-28 (8th Cir. 1967), cert. denied, 390 U.S. 951, 19 L. Ed. 2d 1143, 88 S. Ct. 1043 (1968); Lennerth v. Mendenhall, 234 F. Supp. 59, 63 (N.D. Ohio 1964). The second element of section 12(1) liability mentioned by Judge Wisdom is also met herein. In Lewis v. Walston \u0026 Co., supra, the plaintiffs all purchased stock in Allied Automation in large, if not sole, measure because, as Judge Wisdom wrote (at 619), Mrs. DeCasenave, an employee of the brokerage firm of Walston \u0026 Co., Inc., \"* * * touted Allied Automation to the plaintiffs by telephone and whenever they came in to the Walston office on business. * * *\" Commenting, Judge Wisdom related (at 621-22):\n\nMrs. DeCasenave of course was not a \"seller\" in the most common sense of that word, that is, she was not the party who parted with the securities sold and received the consideration given in exchange. That, however, is not conclusive under § 12(1), for the courts have recognized that other parties who participate in the negotiations of or arrangements for the sale of unregistered securities \"sell\" those securities within the meaning of § 12(1). See Cady v. Murphy, 1 Cir. 1940, 113 F.2d 988; 3 L. Loss, Securities Regulation at 1714-16 (2d ed. 1961). Brokers have long been held liable as sellers under § 12(2), as have other parties responsible for bringing about sales of securities they themselves do not own. Hill York Corp. v. American International Franchises, Inc., 5 Cir. 1971, 448 F.2d 680; Lennerth v. Mendenhall, N.D.O. 1964, 234 F. Supp. 59. In Hill York, this Court announced the test applied in this Circuit to determine whether a participant in the arrangements for a sale \"sells\" securities within the meaning of § 12(1). The test is whether the party is the \"proximate cause\" of the sale.\n\nIn this case, the actions of Eglowsky and Stillerman constituted in fact the \"proximate cause\" of Wassel's purchase of the Dyna-Mech stock. Thus, for the purposes of section 12(1), they \"sold\" that stock to Wassel.\n\nEglowsky and Stillerman, however, contend that the Dyna-Mech stock in question was covered by the exemption provided in section 4(1) of the '33 Act, that therefore it did not need to be registered, and that accordingly its sale cannot give rise to liability under section 12(1).\n\nSection 4(1) of the '33 Act, 15 U.S.C. § 77d(1), provides:\n\nThe provisions of section 5 shall not apply to --\n\n(1) transactions by any person other than an issuer, underwriter, or dealer.\n\n* * *\n\nIn Quinn and Company v. Securities and Exchange Com'n, 452 F.2d 943, 946 (10th Cir. 1971), cert. denied, 406 U.S. 957, 92 S. Ct. 2059, 32 L. Ed. 2d 344 (1972), the Court wrote as to the 4(1) exemption:\n\n* * * The exemption relied upon must be strictly construed against the person claiming its benefit, as public policy strongly supports registration. * * * [Footnotes omitted.]\n\nAccord, United States v. Custer Channel Wing Corp., 376 F.2d 675, 678 (4th Cir.) (Sobeloff, J.), cert. denied, 389 U.S. 850, 19 L. Ed. 2d 119, 88 S. Ct. 38 (1967).\n\nSection 4(1) uses the word \"underwriter\". Stillerman and Eglowsky fall within the statutory definition of \"underwriter\" found in section 2(11) of the '33 Act, 15 U.S.C. § 77b, which provides:\n\n(11) The term \"underwriter\" means any person who has purchased from an issuer with a view to, or offers or sells for an issuer in connection with, the distribution of any security, or participates or has a direct or indirect participation in any such undertaking, or participates or has a participation in the direct or indirect underwriting of any such undertaking; but such term shall not include a person whose interest is limited to a commission from an underwriter or dealer not in excess of the usual and customary distributors' or sellers' commission. As used in this paragraph the term \" issuer \" shall include, in addition to an issuer, any person directly or indirectly controlling or controlled by the issuer, or any person under direct or indirect common control with the issuer. [Emphases supplied.]\n\nMiller was a person \"controlling\" Dyna-Mech at the times relevant herein. \"Control is a question of fact.\" Securities \u0026 Exch. Comm'n v. International Chem. Dev. Corp., 469 F.2d 20, 28 (10th Cir. 1972). Not only did Miller participate directly in the reorganization of Dyna-Mech, the change of its management, the removal of the restrictive legend on certain of its stock certificates and the creation of an Over-the-Counter market in Dyna-Mech stock in October 1972, but Miller was either the author of the plan or aided and abetted Goldman in preparing the plan. Therefore, Miller was an \"issuer\" for purposes of section 2(11) and Eglowsky and Stillerman who offered and sold Dyna-Mech for him were underwriters. It follows that they cannot claim the section 4(1) exemption. Although no other section 4 exemptions are claimed by Stillerman and Eglowsky, it is noted that none of them are available to Stillerman and Eglowsky. \u003cspan class=\"fnref\"\u003e59\u003c/span\u003e\"\n\nD. 10b-5 Liability\n\nIf the judgment Wassel is granted herein under the 12(1) count becomes final, Wassel's quest for 10(b) relief seemingly becomes a mere appendage. But because Wassel's within money judgment under 12(1) may not be affirmed on appeal, it would appear well for this Court at this time to address itself to Wassel's 10b-5 claim.\n\nSection 10(b) of the '34 Act, 15 U.S.C. § 78j, provides:\n\nIt shall be unlawful for any person, directly or indirectly, by the use of any means or instrumentality of interstate commerce or of the mails, or of any facility of any national securities exchange --\n\n* * *\n\n(b) To use or employ, in connection with the purchase or sale of any security registered on a national securities exchange or any security not so registered, any manipulative or deceptive device or contrivance in contravention of such rules and regulations as the Commission may prescribe as necessary or appropriate in the public interest or for the protection of investors.\n\nRule 10b-5, 17 C.F.R. § 240.10b-5, provides:\n\nIt shall be unlawful for any person, directly or indirectly, by the use of any means or instrumentality of interstate commerce, or of the mails or of any facility of any national securities exchange,\n\n(a) To employ any device, scheme or artifice to defraud,\n\n(b) To make any untrue statement of a material fact or to omit to state a material fact necessary in order to make the statements made, in the light of the circumstances under which they were made, not misleading, or\n\n(c) To engage in any act, practice, or course of business which operates or would operate as a fraud or deceit upon any person, in connection with the purchase or sale of any security.\n\nThere is no longer any question that there is a private right of action implied for violation of Rule 10b-5. See Superintendent of Ins. v. Bankers Life \u0026 Cas. Co., 404 U.S. 6, 13 n.9, 30 L. Ed. 2d 128, 92 S. Ct. 165 (1971). Essentially, the elements of a 10b-5 cause of action are (1) a material and false representation or omission by defendant, (2) some form of scienter or scienter-like conduct by defendant, (3) an intention that the misrepresentation be acted upon, (4) some degree of reliance by plaintiff, and (5) actual resulting damage to plaintiff. \u003cspan class=\"fnref\"\u003e60\u003c/span\u003e\" Herein, all of those requirements are met. A material misrepresentation or omission herein, inter alia, was the failure by Eglowsky and Stillerman to disclose to Wassel the extent of their previous dealings with Miller and, more particularly, the extent to which Miller was currently in debt to them. Obviously, if Wassel had known of that debt, he might well have been more wary of Eglowsky and Stillerman's touting of Miller's stock. On the basis of testimony given at trial this Court finds that that omission was made with sufficient \"scienter\" within the test stated most recently by Judge Butzner in Carras v. Burns, 516 F.2d 251 (4th Cir. 1975) (slip opinion at 9-10):\n\nAlthough there has been much discussion of the mental state required for liability, the courts agree that § 10(b) and Rule 10b-5 have eliminated the need to prove common law intent to defraud. It is sufficient if the defendant \"knew the statement was misleading or knew of the existence of facts which, if disclosed, would have shown it to be misleading.\" Globus v. Law Research Service, Inc., 418 F.2d 1276, 1290 (2d Cir. 1969); accord, Hecht v. Harris, Upham \u0026 Co., 430 F.2d 1202 (9th Cir. 1970); cf. S.E.C. v. Capital Gains Research Bureau, Inc., 375 U.S. 180, 194 [11 L. Ed. 2d 237, 84 S. Ct. 275] (1963). See generally Bromberg, Securities Law -- Fraud § 8.4(540). * * * [Footnotes omitted.]\n\nAs to reliance, when one considers the limited role of reliance in a nondisclosure case such as this, \u003cspan class=\"fnref\"\u003e61\u003c/span\u003e\" the reliance requirement is also well met by plaintiffs. \u003cspan class=\"fnref\"\u003e62\u003c/span\u003e\"\n\nPlaintiffs indicated prior to trial that their primary objective in this case was recovery of the $25,000 purchase price under section 12(1); that secondarily, under the 10b-5 count, they seek the award of \"rescissional damages\"; and that as a last resort they ask for the award of compensatory damages. In Baumel v. Rosen, 412 F.2d 571 (4th Cir. 1969), cert. denied, 396 U.S. 1037, 90 S. Ct. 681, 24 L. Ed. 2d 681 (1970), Judge Bryan wrote (at 574-75):\n\n* * * Rescission is a radical move, and the law exacts the election of that course to be asserted without wait. The demand is that advice of the determination be given within a reasonable time after discovery of the ground for rescission.\n\nThis principle is stringently administered. Reasonable time is inceptive from the receipt by the rescinder of word putting him on notice. It is then incumbent upon him to pick up the scent and nose to the source. * * * If the quest confirms the suspicion, then he must make decision with reasonable dispatch. Failing this, entitlement to rescission disappears.\n\n* * *\n\nFurther rationale for the requirement of immediacy is that every day's lapse renders more difficult the very aim of rescission: to return the parties to statu quo ante. That obviously is well exampled here. [Citation omitted.]\n\nIn Johns Hopkins University v. Hutton, 488 F.2d 912, 917 (4th Cir. 1973), Judge Field quoted the above language from Baumel and wrote that \"* * * it was not any unique factual contours of Baumel which provoked Judge Bryan to state the principle which we find applicable to the present case * * *\". Thus, a plaintiff, who seeks rescission in a 10b-5 action, is required to act with all reasonable speed after such plaintiff actually knows of the fraud or has notice of facts which, if he exercises due diligence, should cause him to have or to obtain knowledge thereof.\n\nBy late September 1972 at the latest, Wassel by his own testimony knew that Stillerman and Eglowsky had lied to him. Nonetheless, not only did Wassel not \"make decision with reasonable dispatch\" \u003cspan class=\"fnref\"\u003e63\u003c/span\u003e\" to rescind his purchase of Dyna-Mech but instead he negotiated with both Miller and Thompson for the purchase of hundreds of thousands of additional shares of Dyna-Mech. It was only after the market price of Dyna-Mech plummeted that Wassel sought rescission. Such conduct clearly runs afoul of the Baumel test and renders the remedy of rescission unavailable to Wassel in connection with his 10b-5 claim. While there is little law on the subject, the same would appear to be true of Wassel's quest for rescissional damages, a concept seemingly tracing its roots to Judge Lay's analysis in Myzel v. Fields, 386 F.2d 718 (8th Cir. 1967), cert. denied, 390 U.S. 951, 19 L. Ed. 2d 1143, 88 S. Ct. 1043 (1968). \u003cspan class=\"fnref\"\u003e64\u003c/span\u003e\" There remains the reservation by Wassel of his claim for compensatory damages. Prior to trial counsel, with the consent of this Court, agreed that any proof of such damages which might prove to be necessary in connection with Wassel's 10b-5 claim would be separated from the trial herein and reserved for a subsequent proceeding. In view of this Court's decision supra as to Wassel's entitlement to relief in connection with his section 12(1) claim, there is no necessity for conducting such a separate proceeding at this time. Should this Court's ruling as to rescission under 12(1) be reversed on appeal, such a proceeding could of course be then held if required.\n\nF. In Pari Delicto and the Like\n\nIt might well be the understatement of the year to characterize Wassel's conduct as non-exemplary. He acted at best foolishly. However, even his type of rainbow hunting, get-rich-quick investor who could not care less whether he gets in bed with others who for their own profit are trying to put something over on unsuspecting members of the public is not per se barred from recovering from persons who violate 12(1) and/or 10b-5. Wassel did not know anything like what Eglowsky, Stillerman and Goldman knew concerning the overall plan of the Miller-Thompson-Goldman-Eglowsky-Stillerman group to sell Dyna-Mech stock to the public without SEC registration and without affirmatively informing the public of the true facts which any partially sensible investor, no matter how speculatively inclined, had a right to know and would have wanted to know about Dyna-Mech and Thompson. While the defenses of in pari delicto and unclean hands are not totally unavailable and may sometimes be applicable in certain types of securities cases including 10b-5 suits, in which a plaintiff is as bad a guy as the defendant, Wolf v. Frank, 477 F.2d 467, 473-74 (5th Cir.), cert. denied, 414 U.S. 1104, 38 L. Ed. 2d 560, 94 S. Ct. 739 (1973); Pearlstein v. Scudder \u0026 German, 429 F.2d 1136, 1141-42 (2d Cir. 1970); Kuehnert v. Texstar Corp., 412 F.2d 700, 703-05 (5th Cir. 1970), Wassel's conduct does not descend on a comparative basis even close to the depths reached by Eglowsky and Stillerman -- and by Goldman. On balance, in this case, \"* * * the objective of the securities laws * * * [to increase] the protection to be afforded the investing public * * *\", Kuehnert v. Texstar Corp., supra at 704, is better served by permitting Wassel to pursue his remedies under both 12(1) and 10b-5. Additionally, as to the 12(1) count herein, Professor Loss has written:\n\n* * * And application of the in pari delicto doctrine, at least on the basis solely of the buyer's knowledge of the violation, is so foreign to the purpose of the section that there is hardly a trace of it in the decisions under § 12(2), let alone § 12(1). [Footnote omitted.]\n\n3 L. LOSS, SECURITIES REGULATION at 1694 (2d ed. 1961); cf. 6 LOSS at 3828-30.\n\nReturning to the 10b-5 count, it also is to be noted that this is not a case in which, if Wassel, had he investigated sufficiently before he entered into the transaction, could reasonably have been expected to discover that Miller was indebted for at least $40,000 to Eglowsky and/or Stillerman and that the plan of the inside group called for selling publicly a large number of shares of Dyna-Mech stock of which Wassel knew nothing. With regard to a buyer's duty to investigate, see Fox v. Kane-Miller Corp., 398 F. Supp. 609 (D. Md. 1975).\n\nTHIRD-PARTY CASE\n\nA. Indemnification\n\nEglowsky and Stillerman, as third-party plaintiffs, have sued Central Trust and Goldman as third-party defendants for indemnification or in the alternative for contribution in connection with any liability of Eglowsky and Stillerman for violation of section 12(1) of the '33 Act. \u003cspan class=\"fnref\"\u003e65\u003c/span\u003e\"\n\n* * * The two doctrines should be carefully distinguished. Contribution involves distributing losses among tortfeasors by requiring each to pay his proportionate share. Indemnity entails shifting the entire loss from one tortfeasor who has been compelled to pay it to another who, for equitable reasons, should bear it instead. In essence, contribution results in a sharing of the burden, whereas indemnity results in shifting it. [Footnote omitted; emphasis added.]\n\nRuder, \"Multiple Defendants in Securities Law Fraud Cases: Aiding and Abetting, Conspiracy, In Pari Delicto, Indemnification and Contribution,\" 120 U. Pa. L. Rev. 597, 647 (1972) (hereafter \"Ruder\"). No case has been cited to this Court nor is this Court aware of any case in which indemnification has been allowed to an unsuccessful defendant in a 12(1) case. \u003cspan class=\"fnref\"\u003e66\u003c/span\u003e\" At least two Courts have indicated that, in circumstances in which a party is guilty of \"* * * a sin graver than ordinary negligence\", indemnity is not available to him. See Globus v. Law Research Service, Inc., 418 F.2d 1276, 1288 (2d Cir. 1969), cert. denied, 397 U.S. 913, 25 L. Ed. 2d 93, 90 S. Ct. 913 (1970), and Kuehnert v. Texstar Corp., 412 F.2d supra at 705 n.7, both dealing with one or more sections of the federal securities laws other than 12(1). After a review of the case law, Judge Caleb M. Wright has written, particularly with regard to cases involving section 10(b) of the '34 Act and/or section 17(a) of the '33 Act, that \"* * * most of the cases on indemnity under the Securities Acts can be read to support the proposition that an unsuccessful defendant may obtain indemnity from one significantly more responsible for the injury to the plaintiff. * * *\" Gould v. American-Hawaiian Steamship Co., 387 F. Supp. 163, 167 (D. Del. 1974). See also Ruder, supra at 658-59. In the context of the facts of this case as found by this Court, Central Trust is clearly not significantly more responsible for the injury to Wassel than are Eglowsky and Stillerman. And Goldman, in this Court's opinion, falls generally in the same category as do Eglowsky and Stillerman, even though his conduct as a member of the bar may in an important sense pose more danger to our societal needs than the conduct of operators like Eglowsky and Stillerman. It follows that indemnification from Goldman is not available to Stillerman and Eglowsky, and a fortiori is not available to the latter pair as against Central Trust.\n\nB. Contribution\n\nRESTATEMENT (SECOND) OF TORTS § 886A (Tentative Draft No. 16, April 24, 1970) provides in part:\n\n(1) Except as stated in subsections (2), (3), (4) [and (5)], where two or more persons become liable in tort to the same person for the same harm, there is a right of contribution among them, even though judgment has not been recovered against any or all of them.\n\n(2) The right of contribution exists only in favor of a tortfeasor who has discharged the entire claim for the harm by paying more than his equitable share of the common liability, and is limited to the amount paid hy [sic] him in excess of such share. No tortfeasor can be required to make contribution beyond his own equitable share.\n\n(3) There is no right of contribution in favor of any tortfeasor who has intentionally or recklessly caused the harm.\n\n* * * * * *\n\nContribution in cases involving the federal securities laws is a matter of federal not state law, Gould v. American-Hawaiian Steamship Co., supra at 168 n.13, and has been awarded in a number of such cases. See, e.g., the Gould case and cases cited therein at 168-69. However, the above-quoted provisions of the RESTATEMENT appear to reflect sound doctrine which is in no way controverted by any modern federal holding known to this Court. Accordingly, Eglowsky and Stillerman would appear to assert a sound contribution claim against Goldman, but not against Central Trust. The necessary predicate for a contribution recovery is that the party it is recovered from be a \"joint tortfeasor\", i.e., that he be \"* * * liable in tort to the same person for the same harm * * *\". RESTATEMENT, supra. Central Trust is not so liable to Wassel herein. The transfer agent may well be what the title of a law review article implies, i.e., the neglected child of the securities industry. \u003cspan class=\"fnref\"\u003e67\u003c/span\u003e\" As to the transfer agent, the web of federal regulation and control which has specifically covered most portions of the securities industry has not yet been generally so extended. \u003cspan class=\"fnref\"\u003e68\u003c/span\u003e\" No case has been cited to or located by this Court in which a transfer agent, in the absence of other circumstances, \u003cspan class=\"fnref\"\u003e69\u003c/span\u003e\" has been found liable for violation of the federal securities laws. Seemingly, the standard properly applicable to Central Trust is that provided in a \"SEC Staff Reply\" to an inquiry as to the duties of transfer agents in connection with removal of restrictive legends from stock certificates.\n\nAs presently drafted, neither Rule 144 nor its accompanying release speak to any specific procedures to be followed by a company and its transfer agent in connection with the removal of restrictive legends. The burden of policing the utilization of the exemption provided by Section 4(2) of the Securities Act of 1933 and the determination of the specific means by which this is accomplished rests ultimately with the issuer of the securities involved. Rule 144 would not alter these obligations in any way. Consequently, the particular procedures a company and its transfer agent may wish to adopt concerning the removal of restrictive legends in the context of sales pursuant to Rule 144 is within the discretion of those parties and the responsibility for the effectiveness of those procedures lies with them. In closing, while the transfer agent has no greater responsibility under Rule 144 than under the present system, it should be noted that if the agent knows or has reason to know that an illegal distribution would occur in connection with transactions pending before him, he should take appropriate steps to forestall such a distribution from taking place. [Emphasis supplied.]\n\nSEC Reply, Defrees, Fiske, Voland, Alberts \u0026 Hoffman, CCH Fed. Sec. L. Rep. P 78,745 ('71-'72 Transfer Binder).\n\nUnder the facts of this case as found by this Court, Central Trust did not know or have reason to know that an illegal distribution was occurring or would occur in connection with the removal of the legend and the break-up of the 220,000 shares of Dyna-Mech stock represented by the Canusa certificate. On June 23, 1972, Goldman had told Atfield of Central Trust that the break-up of the Canusa certificate was only intended as a redistribution of Canusa assets to Canusa shareholders necessitated by Canusa's liquidation. Central Trust never in fact knew that those shares were owned by Miller and not by Canusa. \u003cspan class=\"fnref\"\u003e70\u003c/span\u003e\" More importantly, Central Trust was unaware of the dealings between Goldman, Thompson and Miller which preceded Goldman's opinion letters of June 23, 1972 and August 8, 1972. Central Trust was also unaware of the role which the brokerage house of Otto Weinmann in fact played in the procurement of Goldman's August 8, 1972 opinion letter. On August 9, 1972, when Shukla presented the Canusa certificate to Atfield of Central Trust, the latter had before him a letter from Goldman as counsel for Dyna-Mech. Goldman, an attorney, with whom Central Trust had dealt for two years as the legal representative of Dyna-Mech, \u003cspan class=\"fnref\"\u003e71\u003c/span\u003e\" stated that the shares could be reissued without legend \"as requested\". The issuance of the new shares in the denominations and in the name requested by Shukla was in accordance with the \"request\" referred to in Goldman's letter.\n\nAdditionally, it might be noted that in testimony before this Court Eglowsky admitted that he was aware that stock was not necessarily tradeable without a registration statement simply because there was no restrictive legend on it.\n\n* * * Petitioners, as professionals in the securities business and as persons dealing closely with the investing public, are expected to secure compliance with the requirements of the Act to protect the public from illegal offerings. Quinn and Company, Inc. and Dornacker were not entitled to rely on the lack of cautionary legends on the stock certificates. Brokers and securities salesmen are under a duty to investigate, and a violation of that duty brings them within the term \"willful\" of the Securities Act. * * * [Footnotes omitted.]\n\nQuinn and Company, Inc. v. Securities and Exchange Com'n, 452 F.2d 943, 946-47 (10th Cir. 1971), cert. denied, 406 U.S. 957, 92 S. Ct. 2059, 32 L. Ed. 2d 344 (1972).\n\nEglowsky and Stillerman fit into the mold described in the Quinn case. Central Trust would apparently so also fit except that in this case it neither knew nor had reason to know that there was any impropriety in its reissuance of the Dyna-Mech shares given to it by Shukla. Thus, Central Trust committed no wrong vis-a-vis Dyna-Mech or Stillerman and Eglowsky. A fortiori it was guilty of no wrong to Wassel with whom it never dealt or even had contact. Therefore, since, it is not a person \"liable in tort to the same person for the same harm\", RESTATEMENT, supra, i.e., it (Central Trust) is not liable at all to Wassel. Accordingly, there is no right of contribution in favor of Stillerman and Eglowsky against Central Trust as a joint tortfeasor or otherwise.\n\nGoldman, resisting the assertion of a contention of contribution against him by Eglowsky and Stillerman, initially challenges, as does Central Trust, the venue of the third-party claim. In that connection, both Goldman and Central Trust point out that neither of them ever appeared in Maryland nor contacted any person in Maryland. Both, in stating that contention, assume that venue must be shown to exist independently in the third-party case as well as in the case-in-chief. That, however, would not seem to be the better view. \"* * * With a few exceptions, especially in the earlier decisions, the weight of authority supports the view herein advocated: the third-party defendant has no objection based on venue. * * *\" 3 J. MOORE, FEDERAL PRACTICE para. 14.28[2] at 14-614 (1974) (footnotes omitted). See 6 C. WRIGHT \u0026 A. MILLER, FEDERAL PRACTICE AND PROCEDURE § 1445 (1971). The acquisition of personal jurisdiction over a third-party defendant presents a different question. In Lyons v. Marrud, Inc., 46 F.R.D. 451 (S.D.N.Y. 1968), involving, inter alia, extraterritorial service of process under section 22(a) of the '33 Act, \u003cspan class=\"fnref\"\u003e72\u003c/span\u003e\" Judge Mansfield, then a District Judge, discussed the extent to which a third-party must be alleged to have participated with the defendant in the alleged wrongdoing in order to be brought within section 22(a), and (at 455) the extent to which the third-party claim must be \"* * * fundamentally derived from, and dependent upon, the plaintiffs' claims in the main action which admittedly are suits 'to enforce * * * liability or duty created by this subchapter', § 22(a).\" Central Trust's conduct herein would not appear so to qualify, for reasons essentially the same as require a conclusion herein of non-wrongdoing by Central Trust. On the other hand, Goldman's conduct would appear so to qualify since but for Goldman's wrongful actions Eglowsky and Stillerman could not have made the sale to Wassel of unrestricted shares of Dyna-Mech flowing from the Canusa certificate. In sum, it would appear that personal jurisdiction over Goldman is present herein and that even if independent third-party venue is required, it is present as to Goldman, who worked closely with the group in control of Dyna-Mech after the July 22, 1972 shareholders' meeting. \u003cspan class=\"fnref\"\u003e73\u003c/span\u003e\" Pursuant to the June 7, 1972 and June 16, 1972 documents which Goldman and Miller signed, Goldman was aware of Miller's desire to sell publicly the Dyna-Mech shares which Miller had acquired from Canusa. Against that background, Goldman also knew or should have known from the repeated phone calls of Shukla, an employee of a brokerage house, and perhaps also from the telephone call this Court finds Goldman received from Eglowsky, that those calls related to a public distribution of those shares which was planned and which only awaited, before being put into force and effect, the issuance of Goldman's letter and the removal of the stock legend. Goldman had already arranged for the preparation of up-to-date financial reports on Dyna-Mech which Goldman testified he knew would be necessary if the resumption of public trading of Dyna-Mech stock was to take place. Finally, regardless of whether Goldman in his own opinion as a lawyer recognized that Miller was an \"issuer\" and that persons such as Eglowsky would be an \"underwriter\" insofar as sections 5 and 4(1) of the '33 Act were concerned, Goldman knew facts which establish that Miller, who voted 220,000 shares in favor of the Thompson takeover of Dyna-Mech at the July 22, 1972 meeting, was a person in control of Dyna-Mech as of that latter date. Goldman did much more than simply serve as an attorney for Dyna-Mech herein. Compare Black \u0026 Company v. Nova-Tech, Inc., 333 F. Supp. 468, 472 (D. Ore. 1971), with Nicewarner v. Bleavins, 244 F. Supp. 261, 266 (D. Colo. 1965). Goldman was one of the key persons in bringing about and making possible the sale to Wassel by Eglowsky and Stillerman of Miller's shares of Dyna-Mech stock. His actions were a \"proximate cause\" of the sale of Dyna-Mech stock to Wassel, \u003cspan class=\"fnref\"\u003e74\u003c/span\u003e\" and rendered Goldman potentially liable to Wassel. See Lewis v. Walston \u0026 Co., 487 F.2d supra at 621-22. \u003cspan class=\"fnref\"\u003e75\u003c/span\u003e\" Accordingly, Goldman is a joint tortfeasor and contribution is available to Eglowsky and Stillerman against him.\n\nThe question remains as to whether Eglowsky and Stillerman can claim contribution from Goldman on a 50-50 basis or whether Goldman's pro rata share is limited to a third. Normally, contribution amongst joint tortfeasors is on a pro rata basis. W. PROSSER, HANDBOOK OF THE LAW OF TORTS § 50 at 310 (4th ed. 1971) (hereinafter \"PROSSER\"). However, where the fault of one of the joint tortfeasors, herein Stillerman, is largely derivative, i.e., herein from Eglowsky, that tortfeasor, i.e., Stillerman, and the tortfeasor from whom his liability is derived, i.e., Eglowsky, should be lumped together to render them jointly one entity for purposes of apportioning the ultimate distribution of liability to the common plaintiff between them on the one hand and Goldman on the other hand. \u003cspan class=\"fnref\"\u003e76\u003c/span\u003e\" RESTATEMENT (SECOND) OF TORTS § 886A, comment h (Tentative Draft No. 16, April 24, 1970); \u003cspan class=\"fnref\"\u003e77\u003c/span\u003e\" PROSSER, supra at 310. Further, Eglowsky and Stillerman acted as one entity -- Goldman acted as another -- and it took the wrongdoing of Eglowsky-Stillerman acting as one entity and the wrongdoing of Goldman to unleash the damage Wassel suffered herein. As far as Wassel is concerned, of course, he may look to either or both of Eglowsky and Stillerman to effect jointly and severally his recovery. \u003cspan class=\"fnref\"\u003e78\u003c/span\u003e\"\n\nNo right of contribution accrues herein, however, in favor of Eglowsky and Stillerman against Goldman, until one or both of Eglowsky and Stillerman have paid to Wassel the entire amount to which Wassel is entitled. Only then can either or both of them collect from Goldman the 50% share of that amount for which he is liable to them. RESTATEMENT (SECOND) OF TORTS § 886A, comment f (Tentative Draft No. 16, April 24, 1970). \u003cspan class=\"fnref\"\u003e79\u003c/span\u003e\"\n\nAccordingly, judgment in Wassel's favor will be entered in the amount of $25,000 plus interest from the time of the sale to Wassel, i.e., on August 31, 1972, at the rate of 6% per annum. \u003cspan class=\"fnref\"\u003e80\u003c/span\u003e\"\n\nFrank A. Kaufman / United States District Judge\n\n\u003cspan class=\"fn\"\u003e1. Bernard Wassel initially was the sole plaintiff herein. Late in the litigation defendants raised the issue of Mrs. Wassel's absence, contending that she was an indispensable party. Wassel, with leave of Court, amended his complaint to add his wife as an additional plaintiff. Defendants have not alleged or demonstrated any identifiable prejudice resulting from Mrs. Wassel's late joinder. Mrs. Wassel's claim \"* * * arose out of the conduct, transaction, or occurrence set forth * * * in the original pleading * * *.\" Accordingly, pursuant to Federal Civil Rule 15(c), \"* * * the amendment relates back to the date of the original pleading * * *\" even though it adds a new plaintiff. * * * As long as defendant is fully apprised of a claim arising from specified conduct and has prepared to defend the action against him, his ability to protect himself will not be prejudicially affected if a new plaintiff is added, and he should not be permitted to invoke a limitations defense. * * * 6 C. WRIGHT \u0026 A. MILLER, FEDERAL PRACTICE \u0026 PROCEDURE § 501 at 524 (1971 ed.).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Prior to trial, a motion for summary judgment was granted in favor of Peter G. Stone, a third defendant, after plaintiffs conceded inability to provide any evidence of wrongful participation by Stone in the relevant and material events or any evidence of any damages suffered by plaintiffs to the extent, if any, Stone did wrongfully so participate.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. No third-party claim is stated as to any possible liability of defendants in connection with Wassel's '34 Act contention.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Originally, Edward H. Miller, Jr. was named as an additional third-party defendant by defendants Eglowsky and Stillerman and was also named in a cross-claim by third-party defendant Goldman. Service was never effected upon Miller. Prior to trial counsel for Eglowsky and Stillerman and Goldman voluntarily dropped their claims against Miller.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Mrs. Wassel's participation in all events relating to this case is limited to her name appearing on certain relevant documents.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. As discussed in the body of this opinion infra, the name of Dyna-Mech was changed on July 22, 1972 to William Thompson, Incorporated. Herein, \"Dyna-Mech\" refers to the company both before and after the name change, and \"William Thompson\" refers only to the individual of that name except as otherwise specifically indicated.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. That section, 15 U.S.C. § 77c(a)(11), provides: 77c. Exempted securities. -- (a) Except as hereinafter expressly provided, the provisions of this subchapter [§§ 77a-77aa of this title] shall not apply to any of the following classes of securities: * * * (11) Any security which is a part of an issue offered and sold only to persons resident within a single State or Territory, where the issuer of such security is a person resident and doing business within or, if a corporation, incorporated by and doing business within, such State or Territory.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Herein \"Canusa\" will be hereafter used to refer to Canusa Holdings Limited, Canada. Certain stock certificates of Dyna-Mech involved herein were owned by that company. None of Dyna-Mech's stock was ever apparently owned by Canusa Holdings Limited, Delaware.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Steckerl and Berke had already loaned money personally to Dyna-Mech before that time.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Mrs. Thelma M. Pitcher received 300,000 shares; her son, David K. Pitcher, received 182,000 shares, and Archie Johnson received 18,000 shares.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Seemingly, Steckerl and Berke had put their Dyna-Mech stock in escrow at the time of the Pitcher transaction. The Pitchers' stock was also put in escrow pending payment on the notes which they gave for the stock. In the spring of 1972 when it became clear that the Pitchers had no further interest in Dyna-Mech, and Miller did, Steckerl and Berke decided to try to salvage Dyna-Mech by authorizing Goldman to conduct negotiations with Miller rather than themselves conducting the same since there was so much animosity between Steckerl and Berke on the one hand and Miller on the other hand that none of them wanted to deal together directly.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The correction and initialing are set forth as the same appears on the original document.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Certain of this Court's findings of fact are based upon Berke's testimony at trial. To the extent such testimony conflicts with trial testimony of Goldman, this Court attaches credibility and reliability to Berke's testimony, and not to the testimony of Goldman.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. No transfers of Dyna-Mech stock are recorded in the Dyna-Mech Stock Transfer Record Book kept for Dyna-Mech by Central Trust for the period from June 7, 1971 to July 31, 1972, perhaps because Dyna-Mech had failed to pay Central Trust for the latter's services on a current basis.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Goldman, in the course of testifying at trial at some length about the June 23, 1972 conversation among Potts, Atfield and himself, emphasized that Atfield requested the updated Dyna-Mech financials for the use of Central Trust. Atfield, however, testified that he had no memory of the June 23, 1972 meeting at all. As discussed infra in the body of this opinion, those Dyna-Mech financials were necessary before public trading of Dyna-Mech could resume, regardless of whether or not the bank also needed them.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. This Court frankly has doubts as to whether the July 5, 1972 meeting ever took place. If it did, Berke, the only then existing director other than Steckerl, has testified that he received no notice of the meeting. This Court, as otherwise indicated in this opinion, attaches reliability and credibility to Berke's testimony. The validity of a Board of Directors' meeting attended by only one director is questionable in the absence of any by-law authorizing the same. See N.Y. Business Corporation Law §§ 702, 707 (1963).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. The letterhead of the letter shows that the address given, i.e., \"349 Power Building Rochester, New York\" was Goldman's office. The three telephone numbers given were those of William Thompson in Los Angeles, of Goldman in Rochester, and of Canusa in Fort Erie, Ontario.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. All previous Dyna-Mech stockholders' meetings had apparently taken place in Rochester.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. According to Goldman's own testimony he chaired the stockholders' meeting and there was no previous \"meeting\". According to the testimony of Berke who was himself present, Miller ran the initial luncheon \"meeting\" and Goldman chaired the ensuing shareholders' meeting.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. See n. 6 supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. At trial Goldman who represented himself during the trial of this case and also testified as a witness took the position that since the Pitchers were in default on July 5, 1972 on their notes to Dyna-Mech their 500,000 shares were not \"entitled to vote\" and were of no legal consequence and that accordingly the number of shares represented at the July 22, 1972 meeting did constitute a quorum under New York law. See N.Y. Business Corporation Law § 608 (1963).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. The exact date that ad first appeared is not clear. That it appeared is uncontroverted.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. It would appear that in virtually all of the transactions relevant to this case involving Eglowsky and Stillerman, Eglowsky acted as the leader.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. \"Over-the-Counter\".\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. One of those transactions which seemingly never was consummated involved the formation of a proposed Canadian Professional Wrestling League.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Seemingly there was an understanding that Stillerman and Eglowsky would have in effect an option on those 140,000 shares of Dyna-Mech.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Goldman denies that he ever spoke with Eglowsky at all. This Court accepts Eglowsky's testimony in that regard. Calling corporate counsel to verify that the restrictive legend could be removed was a natural action for Eglowsky to perform under the circumstances. Further, since Goldman had already indicated in his June 23, 1972 opinion letter that the restrictive legend could be removed from the Canusa shares, there is no apparent reason why he would not have communicated that fact to Eglowsky. Finally, Goldman's testimony with regard to telephone messages received at his office but not responded to was totally lacking in any \"feel\" of credibility.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Atfield, who testified in this Court, was at most a very junior officer with ministerial duties.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. If Goldman's testimony about his not having talked with Shukla is credited, then one would need to conclude that Shukla's appearance on August 9th, one day after the date of Goldman's August 8th letter, was only a coincidence. The unlikelihood thereof is another reason for disbelieving that Goldman testimony.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Seemingly some of those shares Shukla so presented to Central Trust had originally been issued as part of one of the intrastate offerings of Dyna-Mech stock. Some of those certificates bore legends that they were not to be resold until after certain dates, all of which had passed before August 1972.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. The number of shares of Dyna-Mech which Miller controlled at that time appears to have been between 269,000 and 270,000. The precise number and the exact allocation between shares in Miller's name and shares in Zertel's name are not clear from the record. A determination of those precise figures is not necessary to the resolution of any of the issues herein or of the amount of the judgment awarded herein to Wassel.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. Subsequently, Goldman instituted suit against Steckerl and Berke in a New York state court for legal fees allegedly owing to him by them. Seemingly, that case is still pending.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. That \"letter\" was signed by Shukla during his trip to Rochester on August 9, 1972. That \"letter\", which may well have been a form letter used by either Central Trust or Otto Weinmann (though there is no evidence in this case one way or the other as to that possibility), read as follows: Otto Weinmann 15 William Street New York, New York 10005 August 9, 1972 Central Trust Company Transfer Agent for Dyna-Mech Sciences, Inc. 44 Exchange Street Rochester, New York Gentlemen: This letter is addressed to you in connection with our proposed sale of 220,000 common shares of Dyna-Mech Sciences, Inc. for account of Canusa Holdings Ltd. To induce Dyna-Mech Sciences, Inc. and you as its transfer agent to release these shares from the outstanding representations and warranties: 1. To the best of our knowledge and belief: (a) During the six months preceding the date of this letter neither Canusa Holdings Ltd. nor any of its \"associates\" (as that term is defined under the Securities Act of 1933) has made sales of any securities of Dyna-Mech Sciences, Inc. except as indicated below: AmountSeller Date (No. of shares) Type of Transaction(b) It is not the intention of Canusa Holdings Ltd. or any of its associates at the present time to engage in a series of sales of securities of Dyna-Mech Sciences, Inc. which might be deemed a \"distribution\" (as that term is defined under the Securities Act of 1933) of such securities. (c) Canusa Holdings Ltd. has not solicited or arranged for the solicitation of orders to buy in anticipation of or in connection with this proposed sale nor has it made nor does it intend to make any payment to any person in connection with this sale of shares other than to us. 2. We will perform no more than the usual and customary broker's functions, will receive no more than the usual or customary broker's commission; will not solicit or arrange for the solicitation of orders to buy in anticipation of or in connection with such proposed sale and will do no more than execute our customer's orders to sell, as a broker in accordance with all applicable rules and regulations. Very truly yours, OTTO WEINMANN by: [signature of Manjit Shukla] This Court notes that in Shukla's deposition he characterized this document as a receipt or \"* * * at least I thought I was signing a receipt * * *\". Shukla Deposition at 59. However, Shukla did identify the document during the proceeding when his deposition was taken. Shukla Deposition at 63. In view of Shukla's experience in the securities field, and in view of the fact that both Shukla and Eglowsky have both stated that Eglowsky told Shukla about the ongoing Canusa-Miller-Eglowsky/Stillerman arrangements, this Court cannot credit his testimony that he did not understand the document. It is even an understatement to describe paragraph (c) of the letter as misleading. Certainly it left Central Trust totally in the dark about the true nature and totality of what was occurring with regard to anticipated dealings in Dyna-Mech stock.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. During August and September 1972, while Eglowsky and Stillerman were offering Miller's Dyna-Mech stock to Wassel, they also offered and sold a substantial amount of that stock to a number of residents of the New York City area. One of those sales, in September 1972, was of 20,000 shares at $1.00 per share to a Stephen Berkman. Pursuant to authority mailed to him by Miller, and without Berkman's knowledge, Eglowsky endorsed Berkman's check payable to Miller for $20,000 to a numbered bank account in the name of Eglowsky. Eglowsky testified that Miller authorized him to endorse the check in partial satisfaction of a large debt Miller owed Eglowsky.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. At trial Eglowsky testified that there were two reasons that he and Stillerman invited Wassel to join with them in the Dyna-Mech transaction. One reason was that they believed Wassel controlled a substantial investment syndicate and could possibly be induced to invest in other projects of Stillerman and Eglowsky. The other reason was that Stillerman and Eglowsky felt that they had committed themselves to buy at least 80,000 shares of Dyna-Mech from Miller at $1.00 a share and they did not have that much money themselves.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. At trial Eglowsky admitted that Wassel's request for expenses did not seem consistent with Wassel's characterization of himself as the manager of a large investment syndicate.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. Seemingly the Dyna-Mech financials which Eglowsky referred to were the ones prepared by Steffan \u0026 Company for Goldman which had been forwarded by Goldman to Miller and by Miller to Stillerman and Eglowsky.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. During the August 30, 1972 meeting, Stillerman and Eglowsky were, according to Wassel, carrying on a number of other transactions. Wassel testified that the activity in the office of Stillerman and Eglowsky impressed him considerably and made him more eager to invest with them.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. Eglowsky testified that he told Wassel that he (Eglowsky) had previously dealt with Miller. Wassel denies Eglowsky so told him. It is undisputed however that Eglowsky did not tell Wassel any details of those prior transactions and that Eglowsky did not tell Wassel of the large sum of money Miller then owed Stillerman and Eglowsky.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. Wassel testified that he assumed any such \"finagling\" would be legal. In view of Wassel's admission of substantial previous dealings in securities and in view of the common connotation given to the word \"finagle\", it is difficult to credit Wassel's said statement.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. Howard died before trial of this case but after his deposition had been taken. His entire deposition was entered into evidence at trial without objection by any of the parties and in accordance with Federal Civil Rule 32(a)(3)(A).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. Howard Deposition at 13.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. Howard Deposition at 14.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. Wassel testified that Eglowsky told him that Dyna-Mech's stock would be listed in the Pink Sheets, i.e., publicly traded, \"next Monday\". Eglowsky testified that he told Wassel only that he believed that Dyna-Mech would be listed \"soon\". It is to be noted that the next Monday after August 31, 1972 was Labor Day, 1972.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. Eglowsky testified that Wassel spoke with Miller over the phone on August 31, 1972 and with William Thompson on August 30, 1972. Wassel testified that he only spoke with \"someone who Eglowsky said was called Miller\" on August 30, 1972. In deposition testimony Howard confirmed that Wassel spoke with Miller before entering into the various agreements.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. The actual document which memorialized the purchase by Wassel of the 25,000 shares of Dyna-Mech was drafted by Wassel's attorney, Howard, on August 31, 1972, based upon Howard's understanding of the arrangements previously reached by Wassel and Stillerman and Eglowsky. Howard Deposition at 16-17. Similarly, the Gilled resolution was suggested by Howard and drafted by him on the next day, September 1, 1972, again pursuant to his understanding of the parties' previous agreement. Howard Deposition at 17.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. The certificates for the 25,000 shares of Dyna-Mech stock purchased by Wassel were delivered to him by Otto Weinmann on some date after January 23, 1974. Those certificates are directly traceable to the Dyna-Mech shares represented by the certificate formerly standing in the name of Canusa.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. Eglowsky testified that on August 31, 1972 he believed that there were approximately 70,000 unrestricted shares of Dyna-Mech outstanding in addition to Miller's shares and that he communicated that belief to Wassel on August 31, 1972. Howard's deposition would appear to corroborate Wassel's account. See Howard Deposition at 16, 34.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. The fact that both Miller and Thompson appear by Wassel's own testimony to have believed that Wassel had additional funds remaining after his investments of August 31, 1972 would strongly indicate that Wassel intentionally misrepresented his financial status either during the negotiations leading up to the August 31st transactions or thereafter in his discussions with Miller and Thompson. Wassel has at all times in this case indicated that the $28,000 he invested on August 31, 1972 constituted all of his then available liquid assets.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. The record does not disclose any information as to how that was accomplished, or what use, if any, was made of the updated Dyna-Mech financials provided by Steffan \u0026 Company on August 15, 1972 to Goldman. And see, in that general context, Rule 15c(2)-11, 17 C.F.R. § 240.15c2-11.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. Wassel, in reply to a question as to when he first learned that Dyna-Mech was a bankrupt company, replied (Wassel Deposition at 102): September 8th, 1972 this letter came out from William Thompson to all the shareholders of Dyno-Mech [sic] and I was given this whole financial statement and so forth.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. No copy of that television document was produced during trial. Wassel testified that he recalled signing two documents while in California, one, the Dyna-Mech \"option\" and the other, a paper which related to a television program Thompson was producing. Ward testified that Wassel signed a document committing him to pay $25,000 for a 25% interest in that television program. Eglowsky, who claimed that Thompson mailed him copies of both documents which Wassel signed in California, also testified that the second document appeared to commit Wassel to pay $25,000 outright.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. Ward testified at trial that in late October 1972 Thompson sent him to Baltimore to collect the money from Wassel which Wassel owed pursuant to Wassel's October 6, 1972 undertakings. Ward could not explain why he was sent to Baltimore in late October when the October 6, 1972 Memorandum provided that Wassel had until November 30, 1972 to pay. Ward testified that upon his arrival in Baltimore, Wassel told him that he would have to go to New York to collect his money. Ward then accompanied Wassel to Stillerman's and Eglowsky's office in New York, Ward did not see Howard at that meeting and testified that he did not meet Howard until some time later as discussed infra in the body of this opinion. Ward testified that he waited in a room while a heated argument, the details of which he did not overhear, took place in another room between Wassel on the one hand and Stillerman and Eglowsky on the other, and that Wassel then stormed out and was not seen by Ward again. Ward's testimony, except for Howard's presence (a fact about the October 24, 1972 meeting as to which both Wassel and Eglowsky agree), seems to corroborate Eglowsky's account rather than Wassel's. Wassel testified that he took Ward to Stillerman and Eglowsky's office in November 1972 when Ward telephoned him and offered to pay Wassel's expenses to New York if Wassel would simply introduce Ward to Stillerman's and Eglowsky's office from whom Thompson hoped to raise money. In spite of his testimony that days before he had concluded that Stillerman and Eglowsky were swindlers and had so informed them to their faces, Wassel seemingly saw nothing odd in taking a train to New York just to introduce Ward to them.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. Howard, who died prior to trial and whose entire deposition was admitted by agreement of all of the parties as evidence in this case, was apparently the key figure in what were ultimately unsuccessful negotiations to save Dyna-Mech which apparently took place throughout the fall of 1972. See Howard Deposition at 19-20. Potts, who had been Secretary and a director of Canusa, and who was Secretary of Dyna-Mech under the Thompson regime, resigned that latter position on December 12, 1972 and, in a letter of that date addressed to Thompson wrote: As per our phone conversation of to-days [sic] date I herby [sic] tender my resignation as Director and Secretary of William Thompson Incorporated. My reason for resigning is that I approve of William Thompson Incorporated entering into the agreement proposed by a New York City group headed by Edward Eglowski [sic] and Robert Howard which is contary [sic] to your thinking and in my opinion by not accepting the proposal you are putting the company in jeopardy. Ward's testimony at trial confirmed that it was Thompson's failure to cooperate which doomed Howard's rescue efforts.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. At trial Eglowsky testified that Wassel imitated official governmental officers during those telephone calls and stated to Dr. Stillerman and Mrs. Eglowsky that there were warrants out for the arrests of Stillerman and Eglowsky and that unless the latter returned all of the money to Wassel, they were going to jail. Wassel did admit during his testimony that Mrs. Eglowsky became \"upset\" when he spoke with her over the telephone although he testified that it had not been his deliberate purpose in calling her to disturb her.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. A number of persons whose testimony might possibly have proven relevant and material neither testified at trial nor upon deposition. Those witnesses included Miller, Thompson and Steckerl. Shukla's deposition testimony was introduced at trial without objection by any of the parties and seemingly clearly within the coverage of Federal Civil Rule 32(a)(3)(B). Seemingly the deposition testimony of Miller and Thompson, if either or both of them had been deposed, could also have been so admitted, since each of those persons reside more than 100 miles from Baltimore, Maryland. Perhaps Thompson's testimony would only have corroborated Ward's, and Steckerl's testimony would only have corroborated Berke's. As far as this Court has been informed, all three of Miller, Thompson and Steckerl would have been available to each and every one of the parties for the taking of their depositions. It is also to be noted that Stillerman, whose deposition was taken prior to trial, was present during part of the trial and was available to be called as a witness by any of the parties, and that counsel for Stillerman and Eglowsky stated during trial that he was not calling Stillerman as a witness because Stillerman's testimony would have been cumulative to and repetitious of that of Eglowsky. In any event, Eglowsky was rather clearly more dominant than Stillerman in the conduct of the dealings with Miller, Wassel and others which are relevant and material herein.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57. During trial, Eglowsky testified that during the pre-trial period of this case he was in frequent contact with Miller. In fact, Eglowsky's counsel put into evidence during trial several letters recently received by Eglowsky from Miller.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58. See slip op. pp. 64-66, infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59. The exemption provided by section 4(2) is not available since, although Miller is an \"issuer\" for the purpose of section 2(11), i.e., defining who is a statutory underwriter, he does not come within the definition of issuer found in section 2(4). Thus, no sale by him can be a \"transaction * * * by an issuer * * *.\" Section 4(2) provides: The provisions of section [5] * * * of this title shall not apply to -- * * * (2) transactions by an issuer not involving any public offering. * * * Section 2(4) provides: (4) The term \"issuer\" means every person who issues or proposes to issue any security; except that with respect to certificates of deposit, voting-trust certificates, or collateral-trust certificates, or with respect to certificates of interest or shares in an unincorporated investment trust not having a board of directors (or persons performing similar functions) or of the fixed, restricted management, or unit type, the term \"issuer\" means the person or persons performing the acts and assuming the duties of depositor or manager pursuant to the provisions of the trust or other agreement or instrument under which such securities are issued; except that in the case of an unincorporated association which provides by its articles for limited liability of any or all of its members, or in the case of a trust, committee, or other legal entity, the trustees or members thereof shall not be individually liable as issuers of any security issued by the association, trust, committee, or other legal entity; except that with respect to equipment-trust certificates or like securities, the term \"issuer\" means the person by whom the equipment or property is or is to be used; and except that with respect to fractional undivided interests in oil, gas, or other mineral rights, the term \"issuer\" means the owner of any such right or of any interest in such right (whether whole or fractional) who creates fractional interests therein for the purpose of public offering. Nor is the exemption provided by section 4(3) available herein, since Eglowsky and Stillerman were underwriters \"* * * acting as an underwriter in respect of the security involved in such transaction * * *.\" Section 4(4) provides: The provisions of section [5] * * * of this title shall not apply to -- * * * (4) brokers' transactions executed upon customers' orders on any exchange or in the over-the-counter market but not the solicitation of such orders. The transaction involved herein did not take place \"* * * on any exchange or in the over-the-counter market * * *.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e60. See Fox v. Kane-Miller Corp., 398 F. Supp. 609, (D. Md. 1975) (slip opinion at 43-44A, 52-54). A copy of that opinion is included in the official court file in this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e61. See Carras v. Burns, supra, slip opinion at 12-13; Fox v. Kane-Miller, supra, slip opinion at 44.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e62. It is also to be noted that there is no requirement of strict buyer-seller privity between a 10b-5 plaintiff and a 10b-5 defendant. See Johns Hopkins University v. Hutton, 326 F. Supp. 250 (D. Md. 1971), aff'd in part, rev'd in part on other grounds, 488 F.2d 912 (4th Cir. 1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e63. Baumel v. Rosen, 412 F.2d 571, 574 (4th Cir. 1969), cert. denied, 396 U.S. 1037, 90 S. Ct. 681, 24 L. Ed. 2d 681 (1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e64. See the discussion in Fox v. Kane-Miller, 398 F. Supp. 609, supra at n.60, slip opinion at 30A-32A, including n. 9A therein.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e65. Counsel for Eglowsky and Stillerman has conceded that neither Goldman nor Central Trust caused Eglowsky and Stillerman to fail -- or participated with them, in their failure, if any -- to provide Wassel with information as required by 10b-5.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e66. In the course of discussing section 11 of the '33 Act and indemnification of directors and officers by their corporate employer, Professor Loss has written: When the individual defendant has been unsuccessful, even though he has been found guilty only of negligence or nonfeasance, the situation is quite different. Whether such a person seeks reimbursement only for his litigation expenses or for the judgment he has had to pay, and whether there has or has not been a prior agreement of indemnification, other considerations enter the picture. The policy of the Securities Act against reimbursement or indemnification in such cases is perhaps not so marked as it is in England. But it is clearly implicit in the statute. Indemnification defeats pro tanto the statutory provision on contribution. And it is hostile to the in terrorem effect intended for § 11; negligence in the preparation of the registration statement was made a basis of civil liability largely in order to promote careful adherence to the statutory requirements. * * * [Emphasis in part supplied; footnotes omitted.] 3 L. LOSS, SECURITIES REGULATION at 1831 (2d ed. 1961).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e67. Johnson, \"The Registrar and Transfer Agent -- Child of the Securities Industry: Neglected or Indulged?\", Securities Law Rev. 673 (1971).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e68. Id. at 673-74.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e69. Cf. Securities and Exchange Com'n v. International Chemical Development Corp., 469 F.2d 20, 29, 34 (10th Cir. 1972), in which (at 35) Judge Doyle wrote: \"It is not Syphers' role as a transfer agent as such that provides liability; it is this activity together with his other actions * * * which makes him responsible as an aider in the distribution.\" (Emphasis added.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e70. Miller's name does not appear at any place in the Dyna-Mech stock transfer book kept by Central Trust.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e71. Central Trust had no knowledge of the replacement, if such occurred, of Goldman by Schreiber at the July 22, 1972 Dyna-Mech Board of Directors meeting.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e72. See slip op. pp. 50-51, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e73. Subject matter jurisdiction is also present since the third-party suit is \"* * * ancillary to the main action growing out of the same 'core of facts * * *'.\" Lyons v. Marrud, Inc., supra at 454. It is perhaps also well to note that Judge Mansfield's approach in Lyons would seem to require a holding that venue is also established herein by section 22(a) even if Goldman as a third-party defendant may meritoriously raise a venue objection.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e74. At trial Eglowsky testified that he did not desire to buy in the summer and fall of 1972 any Dyna-Mech stock with a restrictive legend on it and that he viewed a legend as a \"red-flag\". Thus, removal of the legend, which Atfield testified Central Trust would not have brought about but for a letter authorizing the same from Dyna-Mech's corporate counsel, was a necessary element to the involvement of Eglowsky and Stillerman and therefore a necessary element in the sale to Wassel.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e75. It is not necessary for this Court also to determine in this case whether if the second amended complaint had added the 12(1) count against Goldman and named Goldman at the time of filing of the second amended complaint as an additional party defendant that amendment would relate back under Federal Civil Rule 15(c) and avoid the bar of the statute of limitations. See generally 6 C. WRIGHT \u0026 A. MILLER, FEDERAL PRACTICE AND PROCEDURE § 1498 (1971); 3 J. MOORE, FEDERAL PRACTICE para. 15.15[4] (1968).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e76. It is true that Stillerman was present at all meetings with Wassel except for one held outside of the office of Eglowsky and Stillerman. But Eglowsky was, as indicated supra, the dominant man in his relationship with Stillerman.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e77. That comment provides in part: h. Method of apportionment. The purpose of contribution is to arrive at a proper distribution of the liability among the persons liable. Since it is an equitable remedy, it is traditionally governed by the principles of equity as to what is a proper distribution. Normally \"equality is equity,\" and all of the tortfeasors who are liable may be expected to end by paying equal shares. Thus if A, B and C are all liable to the plaintiff for the same tort, and A discharges the liability of all by paying $12,000, he will normally have a right of contribution against B to the extent of $4,000, and against C for the same amount. There will, however, be situations in which equitable principles will call for a different distribution. Thus if B is the servant of C, or an independent contractor, and C has become liable only vicariously for the tort of B, it may be proper to hold B and C together for a one-half share of the total liability, rather than one-third each. Again, if the plaintiff suffers harm through the fall of a party wall between two lots, one of which is owned by A, and the other by B, C and D in common, it may be proper to hold B, C and D together liable for one-half, rather than one-quarter each. * * *\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e78. No question is before this Court as to the extent to which Stillerman and Eglowsky may recover against one another after either or both has satisfied Wassel's judgment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e79. That comment provides: f. Partial payments. In order to be entitled to contribution, the tortfeasor seeking it must have discharged the entire claim of the injured person, by paying more than his equitable share of the common liability. There is thus no right to contribution in favor of one who has made a partial payment on that liability. The equity rule applies, that there can be no contribution so long as the claim of the original plaintiff is still outstanding. [Emphasis added.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e80. Section 12(1) specifically provides for the recovery of interest. See p. 1360, supra. As to the rate of interest, see the discussion in Fox v. Kane-Miller Corp., supra at F. Supp., slip opinion at 81-82. Wassel has sought counsel fees herein under both of the 12(1) and 10b-5 counts. Counsel fees are not available in a 10b-5 case such as this one in which there is no \"common fund\" and where there are no \"overriding considerations of justice\" involved. See Fey v. Walston \u0026 Co., Inc., 493 F.2d 1036, 1056 (7th Cir. 1974); Chaney v. Western States Title Insurance Co., 292 F. Supp. 376, 379-80 (D. Utah 1968); Stevens v. Abbott, Proctor \u0026 Paine, 288 F. Supp. 836, 848-49 (E.D. Va. 1968). Cf. Alyeska Pipeline Service Company v. The Wilderness Society, 421 U.S. 240, 95 S. Ct. 1612, 44 L. Ed. 2d 141, 43 U.S.L.W. 4561 (1975). Section 11(e) of the '33 Act does permit the Court in its discretion, in a section 12 suit, to assess upon a defendant the plaintiff's reasonable attorney's fees \"if the court believes * * * the defense to have been without merit\". See Johns Hopkins University v. Hutton, 297 F. Supp. 1165, 1234 (D. Md. 1968), rev'd on other grounds, 422 F.2d 1124 (4th Cir. 1970), and cases cited thereat. The standard is one of \"frivolity\" or \"bad faith\" on the defendants' part. The record herein does not bring the defenses of Stillerman and Eglowsky, or for that matter the defense of Goldman quite to that level.\u003c/span\u003e\n\n",
    "body_length": 145594,
    "citedas": [
      "399 F. Supp. 1330"
    ],
    "attorneys": "Francis S. Brocato, of Baltimore, Maryland, for Plaintiffs. , Gerald D. Fischer and Blackman, Lefrak, Myerson \u0026 Feld, of New York, New York, and Gerald A. Zimlin, of Baltimore, Maryland, for Defendants and Third-Party Plaintiffs. , Arnold Goldman, of Rochester, New York, Pro Se. , James P. Garland, Robert B. Haldeman and Semmes, Bowen \u0026 Semmes, of Baltimore, Maryland, for Third-Party Defendant Central Trust Company. Kaufman, District Judge.",
    "category": [
      "252"
    ],
    "judges": "Kaufman, District Judge.",
    "citation_count": 0
  }
}
