{
  "id": "EaJ6R2YBTlTomsSBU1_a",
  "document": {
    "title": "In re Avena",
    "full_title": "IN RE CARLOS JAMIE AVENA ON HABEAS CORPUS.",
    "jurisdiction": "California Supreme Court",
    "date": "1996-02-05T00:00:00.000Z",
    "docket": "No. S046608, Crim. No. 25640.",
    "body": "LUCAS, C. J.\n\nCarlos Jaime Avena was convicted in 1980 in Los Angeles County Superior Court of the first degree murders of Manuel Solis and Miguel Vasquez. (Pen. Code, § 187; all further statutory references are to this code unless otherwise indicated.) Multiple-murder and robbery-murder special-circumstance allegations were also sustained. (§ 190.2, subd. (a)(3) \u0026 (17).) In addition, petitioner was convicted of robbery, attempted robbery, two counts of assault with a deadly weapon, and two counts of assault with intent to commit murder. (§ 211, 664/211, 245, subd. (a), \u0026 former § 217.) The jury set the penalty at death under the 1978 death penalty law. (§ 190.1 et seq.)\n\nPetitioner appealed and also filed a petition for a writ of habeas corpus. This court determined he stated a prima facie case for relief in his habeas corpus petition and issued an order to show cause. Finding issues of material fact in dispute as to only one of his allegations, we appointed Judge Kathleen Parker, Judge of the Superior Court of Los Angeles County, to hold a hearing and file her report with us. We later vacated Judge Parker's appointment due to her failing health and thereafter appointed John Ouderkirk, Judge of the Superior Court of Los Angeles County, to act as our referee. Judge Ouderkirk has now filed his report. Both petitioner and respondent except to various portions of the referee's findings. After due consideration, we conclude that the referee's findings are supported by the evidence and thus reject those claims. After considering those findings, we conclude the order to show cause should be discharged and the writ denied.\n\nFACTS\n\nA. The Crimes\n\nOn September 12, 1980, petitioner and brothers Victor and Arturo Padua were driving in a white 1971 Mazda. Petitioner sat in the backseat and had a .22-caliber rifle with him. All three had consumed some beer that evening. While waiting for a stoplight, a brown Ford Galaxy pulled alongside them. When Arturo Padua yelled an insult at the brown car, one of its occupants threw a beer bottle at them, striking the Mazda on the window where petitioner was seated. Petitioner retaliated by shooting at the Ford, which then sped off.\n\nPetitioner and the Paduas gave chase. The Ford stopped suddenly, causing petitioner's Mazda to collide with the rear of the Ford. The Ford again drove away; the Mazda, however, was rendered inoperable. Petitioner and the Paduas pushed it to the side of the road and decided to secure alternative transportation. It was then they saw a pink Chevrolet Camaro, driven by victims Manuel Solis and Miguel Vasquez. Petitioner and the Padua brothers approached the Camaro and stood on either side of the car. Petitioner was carrying his rifle and Arturo was carrying a piece of wood. Although the exact sequence of events is unclear, petitioner apparently demanded the driver give him his money and the keys to the Camaro. Petitioner then shot into the car, wounding the occupants. Petitioner also apparently grabbed one of the victims, pulled him out of the car, and shot him four times in the chest. The other victim exited the passenger side of the Camaro whereupon Arturo struck him in the head with the piece of wood. When one of the victims made a vain attempt to flee, petitioner told Arturo to move out of his line of sight, and then he shot the victim twice. Some people on the street, including the victim's brother, Daniel Solis, witnessing this crime, engaged in some sort of confrontation that included throwing a bottle. The witnesses fled when petitioner began shooting at them. Petitioner and the Paduas then left in the pink Camaro.\n\nOnce in the car, petitioner said he was out of ammunition and needed to go home and reload. After reloading, the trio drove the Camaro to a church parking lot, where they set the car on fire, apparently to eliminate their fingerprints. They then walked to 22nd Street and Normandie, near the Santa Monica Freeway. The Paduas went to buy more beer and then returned to petitioner. By this time, it was approximately 11 p.m., and the trio was once again on foot.\n\nVictor Padua, apparently having had enough excitement for one night, hid in some bushes near a freeway exit. When victim Ana Hernandez stopped her yellow Chevette at a stoplight, petitioner and Arturo walked up to either side of the car and attempted to open her door. Petitioner shot into the car door; Arturo may have slammed a beer bottle on the windshield. Hernandez accelerated through the red light to escape; petitioner shot at the escaping Chevette, striking the rear of the vehicle.\n\nOfficers McCann and Derenia were coincidentally driving by the off-ramp in an unmarked police car at this time and observed the yellow Chevette drive through the red light. They then saw petitioner standing in the off-ramp with the rifle. Petitioner opened fire on the officers, shooting out the car windows. The officers returned fire, both emptying their revolvers before driving under the freeway, making a U-turn, and returning. Petitioner and Arturo fled on foot, managing to escape capture. A police search of the area revealed several .22-caliber casings on the ground and, eventually, Victor Padua, still hiding in the bushes.\n\nPolice initially did not connect Victor to the shootings, as he gave a false story. Finding evidence that Victor had been seen in the company of two other men that night, police questioned him again and this time he told police about petitioner and Arturo. They were arrested and identified by Officers McCann and Derenia. The witnesses of the Solis and Vasquez murders confirmed the shootings, but were too far away to make positive identifications. Hernandez likewise said it was too dark to make a positive identification of her assailants.\n\nVictor Padua testified against petitioner at his trial. In addition, petitioner gave a statement to police that was surreptitiously recorded. This statement largely tracked Victor's account of the crimes, except that petitioner claimed the driver of the pink Camaro menaced him with a knife and that was why he shot him. The recording was played for the jury.\n\nPetitioner also admitted he used a .22-caliber rifle that was loaded by means of a tubular magazine with a capacity of 17 to 20 rounds. He said he bought the rifle on the street for $30. A police expert testified that the .22-caliber shell casings found at the murder scene and on the off-ramp were, with one exception, fired from the same gun. The expert testified that only three types of rifles could have produced those shell casings. One type, the Marlin Glenfield, was described as a \"very common, very popular . . . very low priced [rifle]\" that uses a tubular magazine with an 18-round capacity. (One shell casing exhibited characteristics that made it impossible to determine with certainty that it came from the same weapon.)\n\nPetitioner's trial counsel, Marvin Part, waived his opening statement and rested without presenting any defense at the guilt phase of the trial. Part called only two minor witnesses at the penalty phase of the trial. Following argument, the jury set the penalty at death.\n\nB. The Petition for Writ of Habeas Corpus, the Evidentiary Hearing, and the Referee's Report\n\nIn his petition for a writ of habeas corpus, petitioner claimed that his trial counsel Part was constitutionally ineffective for failing to: (1) \"Adequately interview petitioner and his immediate family for probative information\"; (2) \"Arrange for proper investigation of the facts\"; (3) \"Interview witnesses\"; (4) \"Present any pretrial motions on behalf of [petitioner], including a motion to suppress . . . [petitioner's] statement to police\"; (5) \"Investigate, raise and support the defense of diminished capacity\"; (6) \"Present his client before the jury in a respectable fashion,\" i.e., to ensure that petitioner did not appear before the jury in jail clothes; (7) \"Present mitigating evidence at the penalty trial\"; and (8) \"Argue effectively on behalf of [petitioner] at [the] guilt or penalty phase of the trial.\"\n\nFinding these allegations, considered together with the exhibits, established a prima facie showing of relief, we issued an order to show cause. ( People v. Duvall (1995) 9 Cal. 4th 464, 475 [37 Cal. Rptr. 2d 259, 886 P.2d 1252] (hereafter Duvall); In re Hochberg (1970) 2 Cal. 3d 870, 875, fn. 4 [87 Cal. Rptr. 681, 471 P.2d 1].) After receiving the People's return and petitioner's traverse, we concluded that most of the issues raised could be decided on the pleadings because there were no disputed factual matters outside the trial record. (Duvall, (supra) , at pp. 478-479.) As to petitioner's claim that Part should have investigated and presented the defense of diminished capacity, however, there were disputed issues of material fact. Accordingly, we referred the matter to a referee for an evidentiary hearing. (Id. at p. 478.)\n\nWith regard to that issue, we submitted these questions to our referee: \"(a) What did petitioner tell his trial counsel about petitioner's use of PCP or alcohol (i) generally, and (ii) on the night of the killings? (b) Was there other evidence of petitioner's use of PCP that counsel failed to discover because his investigation was inadequate, and if so, what was that evidence? (c) Was there evidence that petitioner's PCP use was a factor in his commission of the offenses? (d) Might the circumstances of petitioner's PCP use, viewed in light of his background and character, have been considered a mitigating factor by the penalty phase jury (see Pen. Code, § 190.3, subds. (d), (h), \u0026 (k))?\"\n\nAfter a protracted evidentiary hearing, our referee made the following rulings:\n\nRegarding questions (a)(i) and (a)(ii) : \"Petitioner told his trial counsel nothing about his use of alcohol or PCP generally. Petitioner did not tell his trial counsel that he used PCP on the night of the killings. Yes, petitioner did tell his trial counsel that he consumed beer on the night of the killings.\"\n\nIn support of these findings, the referee found that petitioner testified that Part asked him if he used drugs on the night of the killings, and that petitioner said he told Part he had ingested phencyclidine (PCP) and marijuana, and drank beer and cognac on the night of the killings. Petitioner claims he told Part about his drug use during their first meeting at the county jail. \"Petitioner claimed to have a virtually verbatim recollection of the portions of his conversation with trial counsel which related to drugs. However, as to other parts of the conversation, he had very limited recollection.\" He further claims he did not tell police about his drugs use because they did not ask him about it, although he claimed that his use during the interrogation of the terms \"crazy\" and \"wrong\" meant \"being high on drugs.\"\n\nThe referee concluded: \"It is reasonable to conclude that the defendant would have volunteered that he was high on drugs if it were true. It is speculation to say that trial counsel's missing file would corroborate petitioner's testimony.\"\n\nTrial counsel Part testified that he had no specific recollection of his conversations with petitioner, but that he was sure petitioner never mentioned using drugs or PCP. The referee concluded that Part's testimony was the more credible \"because of the circumstantial evidence corroborating his version. The Referee does not find petitioner to be credible in this area.\"\n\nRegarding question (b): The referee concluded there was evidence of petitioner's PCP use that Part failed to discover because his investigation was inadequate. Specifically, Part should have discovered: (1) \"A juvenile court probation report dated April 17, 1978 containing the petitioner's statement that he had been arrested for auto theft and possession of angel dust\"; (2) \"An LAPD Form No. 510 filled out on September 15, 1980 when petitioner was arrested indicated in bold handwritten letters that the petitioner was a user of PCP and marijuana.\"; (3) \"A California Youth Authority 'Referral Document' dated July 5, 1978,\" indicating petitioner had previously been found to be an abuser of PCP; (4) \" 'PCP was very epidemic in (the area of the crime)' and 'The relationship to PCP was widely a part of the gang membership and activity (in 1980)' \"; (5) \"At the reference hearing various associates and family members of the petitioner testified to their observations of the petitioner's chronic PCP usage. This testimony may or may not have been truthful. However, one can assume that if the testimonial evidence was available in 1990, it would have been available in 1981\"; (6) \"Blood, urine acidification and fat sample tests were available in 1981 to detect usage of PCP.\"\n\nThe referee found that at the time of trial, Part was in possession of the first two documents (the \"510\" form, and the 1978 juvenile probation report), because they had been provided in discovery. The third item (the Youth Authority report) could have been discovered with \"minimal investigation\" and the balance was discoverable with \"reasonable investigation.\"\n\nThe referee further concluded that, \"Trial counsel's memory was very weak when asked for any details about what investigation was actually conducted. Trial counsel's case file would normally be of assistance in documenting what investigation was conducted. However, that file is missing and trial counsel could not give a definitive reason why it is missing or a definitive time when it disappeared.\"\n\n\"The Referee finds no justifiable reason for the failure to produce this file in November 1982. Trial counsel's client, the petitioner, the subject of this voluminous file, had been sentenced to death just nine months earlier. It should have been produced or trial counsel should have been able to give a definite and plausible reason for its disappearance.\"\n\nFinally, two \"criminal defense lawyers with extensive death penalty litigation experience, Charles Gessler and Howard Gillingham, testified that, without any question, based on the information available, they would have investigated Avena's drug use.\"\n\nRegarding question (c) : The referee noted that \"petitioner's post-conviction assertions that he used PCP on the night of the killings\" were not \"credible,\" and that \"[t]here was little credible evidence, worthy of consideration, produced at the hearing to conclude that petitioner used PCP on the night of the killings.\" Nevertheless, the referee concluded that \"[t]here was evidence that petitioner's long term PCP use may have been a factor in his commission of the offenses.\" For example, two experts, Drs. Rosenthal and Aniline, testified that taking PCP could affect a person's behavior hours, days, weeks, even months after ingestion. Doctor Aniline opined that petitioner's long-term PCP use was the major contributor to petitioner's behavior on the night of the crimes. The referee cautioned, however, that \"[t]here was substantial evidence produced that would tend to discredit this opinion. . . .\"\n\nRegarding question (d) : The referee found no evidence that petitioner's alleged PCP use could be viewed as a mitigating circumstance under section 190.3, factor (d) (extreme mental or emotional disturbance). There was, however, \"some evidence\" of past PCP use which might fall within section 190.3, factor (h) (diminished ability to appreciate criminality). Finally, the referee concluded that \"petitioner's PCP use, viewed in light of his background and character, might have been considered a mitigating factor within the meaning of Penal Code section 190.3, factor (k). Factor (k) gives the jury broad discretion to interpret evidence as mitigation.\" The referee noted that \"[p]etitioner presented credible evidence that he was raised in a home with an alcoholic father who physically abused the petitioner and petitioner's mother. The family was poor and petitioner was handicapped by his limited ability to speak English. In addition, the petitioner grew up in a neighborhood where gangs and drugs were prevalent. There was expert testimony regarding the potentially violent and lasting effects of long term PCP usage. As previously indicated, there was evidence available that petitioner was such a user of PCP.\"\n\nC. Petitioner's Exceptions to the Referee's Report\n\n1. Did Petitioner Tell His Counsel About His PCP Use on the Night of the Murders?\n\nPetitioner's first and major exception to the referee's report is to challenge the referee's Conclusion that petitioner did not tell his trial counsel, Marvin Part, that he had used PCP on the night of the killings. Instead, petitioner contends there was substantial evidence that he told Part he used PCP that fateful night.\n\nWe first address the applicable standard of review. As a general matter, \" '[t]he referee's Conclusions of law are subject to independent review, as is his resolution of mixed questions of law and fact. [Citations.] . . . The referee's findings of fact, though not binding on the court, are given great weight when supported by substantial evidence. The deference accorded factual findings derives from the fact that the referee had the opportunity to observe the demeanor of witnesses and their manner of testifying.' ( In re Marquez (1992) 1 Cal. 4th 584, 603 [3 Cal. Rptr. 2d 727, 822 P.2d 435]; see also In re Jackson (1992) 3 Cal. 4th 578, 585 [11 Cal. Rptr. 2d 531, 835 P.2d 371]; In re Cordero (1988) 46 Cal. 3d 161, 180-181 [249 Cal. Rptr. 342, 756 P.2d 1370].)\" ( In re Hitchings (1993) 6 Cal. 4th 97, 109 [24 Cal. Rptr. 2d 74, 860 P.2d 466]; see also In re Ross (1995) 10 Cal. 4th 184, 201 [40 Cal. Rptr. 2d 544, 892 P.2d 1287] [emphasizing referees can observe demeanor of witnesses]; People v. Mayfield (1993) 5 Cal. 4th 142, 199 [19 Cal. Rptr. 2d 836, 852 P.2d 331] [same].)\n\nWe emphasize that, because petitioner seeks to overturn a final judgment in a collateral attack, he bears the burden of proof. (Duvall, (supra) , 9 Cal. 4th at p. 474.) \" 'For purposes of collateral attack, all presumptions favor the truth, accuracy, and fairness of the conviction and sentence; defendant thus must undertake the burden of overturning them. Society's interest in the finality of criminal proceedings so demands, and due process is not thereby offended.' \" (Ibid., quoting People v. Gonzalez (1990) 51 Cal. 3d 1179, 1260 [275 Cal. Rptr. 729, 800 P.2d 1159], italics in original.)\n\nAn unusual situation is presented in this case, because the referee who prepared the report did not actually observe the witnesses testify. Instead, it appears the referee simply reviewed the transcript of the hearing. In addition, the parties stipulated that the referee could rely on a defense summary of the criminal trial in lieu of reading the transcript of the entire trial. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Accordingly, it is arguable the deference we would ordinarily give to the referee's rulings as to questions of fact is inappropriate in this case.\n\nEven if we view the evidence de novo, however, we agree with the referee that the evidence supports the finding that petitioner never told counsel Part that he had ingested PCP on the night of the killings. The only evidence to the contrary was petitioner's own testimony at the evidentiary hearing. His testimony, however, was not particularly credible. To begin with, petitioner had a strong incentive to assert he was intoxicated on PCP so as to lay the groundwork for a claim that Part provided ineffective assistance by failing to present a defense based on diminished capacity.\n\nExamining petitioner's testimony, we agree with the referee that \"petitioner claimed to have a virtually verbatim recollection of the portions of his conversation with trial counsel which related to drugs. However, as to other parts of the conversation, he had very limited recollection.\" Specifically, petitioner claimed to remember with clarity portions of a 20-minute conversation he had with counsel Part during their first meeting, some 11 years earlier. Suspiciously, the only things petitioner remembered about the conversation were: (1) Part said petitioner's taped admissions would make the defense difficult, (2) petitioner told Part that on the night of the crimes, he had smoked some PCP-laced cigarettes and some marijuana, and had drunk some beer, (3) Part said that petitioner's drug use would not make a difference so \"don't worry about it,\" and (4) petitioner wanted to see a psychiatrist. When the prosecutor noted that these few topics would not have exhausted the 20 minutes, petitioner repeatedly replied he could not remember the balance of the conversation.\n\nPetitioner explained that he remembered he told counsel about his PCP use the night of the killings because he thought it was \"important.\" By the time of the hearing, however, he failed to remember the contents of his 1986 declaration, which stated that in this initial interview, he told Part that he had \"been beaten up by the cops after [his] arrest\" and that he \"had not been advised of [his] rights.\" After the prosecutor refreshed petitioner's recollection, the following colloquy occurred:\n\n\"Q: [By the prosecutor] So you said you remembered about the PCP because it was important. Why didn't you tell us about being beaten up by the cops? That is not important?\n\n\"A: [Petitioner] I can't remember everything exactly what I told to Mr. Part during that time, but I think it was important, yes.\n\n\"Q: And you also failed to tell us about the fact that, 'I had not been advised of my rights.' Why didn't you remember to tell us about that?\n\n\"A: Well, now that you have got it out, I remember.\n\n\"Q: Now you remember, but you didn't remember before?\n\n\"A: No.\n\n\"Q: Why not?\n\n\"A: I just didn't remember.\"\n\nStanding in contravention to petitioner's inconsistent testimony is the testimony of trial counsel Marvin Part. When asked whether petitioner told him he smoked PCP, counsel replied \"[n]ot to my recollection.\" Part also said petitioner \"never\" told him he was a regular user of PCP. Part was then asked some direct questions:\n\n\"Q: [By the prosecutor] Did he tell you that he was a regular user of PCP?\n\n\"A: [By Counsel Part] He never told me that.\n\n\" Q: Did he tell you that he smoked PCP on the night that the murders were committed?\n\n\"A: No he did not.\"\n\nConsidering the testimony of both petitioner and counsel Part, we find that with an ample incentive to lie, petitioner exhibited a selective memory of the contents of the critical interview, whereas Part forthrightly stated petitioner never told him he was intoxicated on PCP the night of the killings. Based on this evidence, we agree with the referee that petitioner was not a credible witness and conclude petitioner has failed to carry his burden.\n\nPetitioner makes a number of arguments to the contrary, but none is availing. First, he contends that because, shortly after his arrest, he admitted to Part and the police that he had drunk some beer on the night in question, it was unlikely he would have failed to reveal he had smoked some PCP-laced cigarettes. An equally plausible explanation why he failed to admit to PCP use, however, is that he had not smoked any that night. Second, contrary to petitioner's suggestion, the fact that he was a known chronic abuser of PCP does not necessarily lead to a Conclusion that he \"must have\" ingested some PCP on the night in question. While it is true his long-term use makes it more likely that petitioner may have used PCP that night (as compared, say, to one who had never used the drug), the mere fact of his frequent past use of PCP falls short of proving that he took some on the night in question.\n\nThird, petitioner asserts that Part, as an experienced criminal trial attorney, would have recognized the relevance of any possible drug use, and \"it is therefore reasonable to conclude that Part did ask Avena if he used drugs.\" This supposition conflicts, however, with Part's actual testimony:\n\n\"Q: Mr. Part, as you took a look at this case and analyzed the facts as an experienced trial lawyer, did the facts suggest to you that the defendant was smoking PCP?\n\n\"A: No.\n\n\"Q: Did the facts suggest to you that the defendant was stoned on a drug to a point where he was not responsible for his actions?\n\n\"A: No, quite to the contrary.\"\n\nPart was familiar with the facts of the case and did not anticipate that drug use was an important factor in the crime. This was a reasonable Conclusion inasmuch as petitioner's decisions (1) to return home to reload his weapon, (2) to later set fire to the pink Camaro to obscure his fingerprints, and (3) to steal another car by stationing himself at the bottom of a freeway offramp where he knew cars would come to a stop, are not actions of one whose ability to \" 'maturely and meaningfully reflect upon the gravity of his contemplated act[s]' \" ( People v. Cruz (1980) 26 Cal. 3d 233, 242 [162 Cal. Rptr. 1, 605 P.2d 830], italics omitted) has been substantially diminished by PCP intoxication. The basis for petitioner's inference that it is reasonable to assume Part would have asked petitioner about possible drug use is thus unsupported by the record.\n\nPetitioner also contends that it was his \"habit and custom\" to respond truthfully when asked by \"authority figures\" about his drug use in connection with previous arrests or detentions. Petitioner thus claims his \"habit and custom\" constitute admissible evidence, under Evidence Code section 1105, that, on the night of the killings, he told Part of his PCP use. Aside from the rather dubious invocation of Evidence Code section 1105, petitioner's \"habit and custom\" argument is premised on his assumption that Part asked him whether he used drugs. There is no persuasive evidence that Part made such an inquiry.\n\nPart's trial file disappeared sometime between the end of trial and the beginning of petitioner's subsequent unrelated trial for killing an inmate. Appellate counsel Kraft claims she asked Part several times for the trial file during this period, but that her requests were ignored. Part testified he could not remember what happened to the file. The referee found that \"trial counsel could not give a definitive reason why [the file] is missing or a definitive time when it disappeared.\" \"The Referee finds no justifiable reason for the failure to produce this file . . . . It should have been produced or trial counsel should have been able to give a definite and plausible reason for its disappearance.\"\n\nIn light of the missing file, petitioner contends we should assume Part intentionally suppressed the file to hide evidence of his ineffective assistance. He asserts Evidence Code section 413 \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e permits the drawing of inferences adverse to Part due to the missing file. That provision is inapposite for two reasons. First, there was no finding that Part \"willfully suppress[ed]\" the file. (See People v. Ledesma (1987) 43 Cal. 3d 171, 211-213 [233 Cal. Rptr. 404, 729 P.2d 839] [counsel intentionally destroyed file].) Second, Part is not a \"party\" to this action. Even assuming for argument that petitioner is correct that Part intentionally suppressed the trial file, it would be improper to draw an inference due to Part's alleged misconduct that will ultimately work to the People's detriment. (See generally, In re Ross, (supra) , 10 Cal. 4th at p. 214 [rejecting a claim that trial counsel's unexplained loss of the trial files requires the burden of proof be shifted to the People to prove counsel was not ineffective].)\n\nEvidence Code section 413 aside, however, the referee was entitled to consider the possibly suspicious circumstances surrounding the file's disappearance in determining the facts of this case. After doing so, he concluded: \"It is speculation to say that trial counsel's missing file would corroborate petitioner's testimony.\" We agree. There is no evidence that Part even took notes during the interview in question, that he retained them if he did, or that he placed them in the now-missing file. Although it is somewhat troubling that Part could not account for his trial file, we conclude petitioner has not shown the file would have had a demonstrable impact on the question of whether petitioner told Part he was intoxicated on PCP on the night of the murders.\n\n2. Was There Other Evidence of Petitioner's PCP Use That Was Not Discovered by Trial Counsel?\n\nDespite petitioner having failed to carry his burden of establishing that he told Part he was under the influence of PCP on the night of the killings, the referee ruled that there was other evidence--reasonably available but not obtained by Part--that showed as a general matter that petitioner was a chronic user of PCP. Further, the referee found Part's investigation was \"inadequate,\" and that with \"minimal investigation,\" Part would have discovered the following: (a) a 1978 juvenile probation report stating petitioner had been arrested for \"auto theft and possession of angel dust\"; (b) a Los Angeles Police Department form 510 that indicated that when petitioner was arrested, the arresting officer believed petitioner was a PCP user; \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e (c) a 1978 California Youth Authority \"referral document\" indicating petitioner used PCP; (d) evidence that petitioner was a gang member, and that PCP use was \"widely a part of gang membership and activity [in 1980]\"; and (e) the testimony of some friends and his mother, who would have testified to petitioner's frequent use of PCP during the weeks preceding the murders. In addition, the referee concluded that scientific tests to detect PCP usage were available at the time of petitioner's 1981 trial.\n\nPetitioner does not, with one exception noted below, challenge these findings by the referee. He does argue, however, that the referee erred by failing to make findings regarding two additional items of evidence he claims Part should have discovered. First, petitioner contends the referee should have found that Part was ineffective for failing to discover the 1982 probation report that was prepared in the instant case. Petitioner claims the report contains several references to his prior PCP use. We agree with respondent, however, that Part cannot be held responsible for failing to discover (and use at trial) a document that was not prepared prior to the trial.\n\nWe also reject petitioner's second contention that the referee should have found that Part was ineffective for failing to discover the transcript of petitioner's September 15, 1980, interrogation by police. He contends \"[a] careful review of the tape and the transcript demonstrates that [his] lack of memory and confusion for the events of September 12, 1980, are consistent with the symptoms of someone who was under the influence of PCP.\"\n\nIt is doubtful Part was unaware of the transcript of this crucial interview, inasmuch as petitioner made several incriminating statements to police in that interview. Even assuming Part was unaware of the transcript, however, we disagree with petitioner that the referee should have cited the transcript of this interview as evidence demonstrating petitioner's drug use. After reviewing the transcript, we do not find that petitioner's responses to interrogation questions were \"consistent\" with his being on PCP. Our review reveals petitioner was fairly lucid and that he gave responsive answers to questions. Admittedly he was hesitant at times, but this was understandable given the seriousness of the charges against him. His inability (or perhaps, unwillingness) to recall some details of the night in question is not surprising; it may simply have been a manifestation of his desire for self-preservation. Moreover, we note that the police did not ask petitioner whether he was intoxicated on PCP on either the night of the crimes or at the time of the interrogation. In sum, we reject petitioner's argument that the transcript of this interview comprised evidence of petitioner's drug use.\n\nAs stated above, in regards to petitioner's friends and his mother who testified at the evidentiary hearing regarding petitioner's PCP use in general, the referee found that \"[t]his testimony may or may not have been truthful. However, one can assume that if the testimonial evidence was available in 1990, it would have been available in 1981.\" Petitioner excepts to the referee's Conclusion that the witnesses \"may or may not have been truthful.\" It is possible that, without having heard the witnesses testify in person, Judge Ouderkirk felt unable to determine their veracity and thus used the noncommittal \"may or may not\" phraseology. We note that on the one hand, friends and family would have an incentive to testify favorably to petitioner. Their recounting of petitioner's chronic PCP use, however, is consistent with both the probation report prepared in this case, and with the California Youth Authority's \"referral document\" for his 1978 assault. This consistency with unrelated law enforcement documents lends credence to their testimony.\n\nOn the other hand, Part expressly testified that petitioner never told him he was a PCP user, and further testified that petitioner never supplied him with the names of the friendly witnesses who ultimately testified at the evidentiary hearing. This testimony suggests a finding that the later testimony of the friends and family members may not have been truthful.\n\nLike Judge Ouderkirk, we also did not hear the testimony presented at the evidentiary hearing, and thus are as handicapped as our referee in determining the veracity of the witnesses from the cold record. We need not, however, make a definitive decision on that issue, because even assuming for argument that we were to sustain petitioner's exception in this regard and conclude the witnesses all testified truthfully, their testimony that petitioner often used PCP adds little to what we already know.\n\nFirst, assuming the witnesses testified truthfully, we may conclude there was sufficient evidence available pretrial showing petitioner was a chronic abuser of PCP. This information could, in turn, have led Part to further investigate whether petitioner was under the influence of PCP on the night in question. There was, however, already ample evidence available showing petitioner was a frequent user of PCP, including the police report and prior Youth Authority documents. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Thus, the testimony of petitioner's friends and his mother was cumulative to that evidence. Moreover, the referee concluded, based on substantial evidence, that \"[t]here was little credible evidence, worthy of consideration, produced at the hearing to conclude that petitioner used PCP on the night of the killings.\" Thus, we may assume that had Part investigated the point prior to trial, he would not have uncovered any additional information in that regard.\n\nSecond, if we assume the witnesses testified truthfully, we might conclude that petitioner's chronic PCP use may have had an effect on his mental faculties--short of a legally recognizable diminished capacity--and thereby helped induce the crime. The referee already concluded, however, that \"[t]here was evidence that petitioner's long term PCP use may have been a factor in his commission of the offenses.\" Crediting the testimony of these witnesses, then, would not have affected the referee's Conclusion.\n\nFinally, if we assume these witnesses testified truthfully about petitioner's long-term PCP use, such drug abuse could have comprised mitigating evidence at the penalty phase. The referee already concluded, however, that other evidence of petitioner's drug use might have been considered by the jury as mitigating evidence under section 190.3, factor (k).\n\nIn sum, we need not decide whether the witnesses testified truthfully at the hearing regarding petitioner's alleged PCP use, because even assuming for argument that we were to sustain petitioner's exception in this regard and conclude the witnesses testified truthfully, their testimony that petitioner frequently used PCP would add little to the referee's findings.\n\n3. Was Petitioner's PCP Use a Factor in the Commission of the Crimes?\n\nAside from the question whether petitioner told Part that he was under the influence of PCP on the night of the crimes, we asked our referee whether there was any other evidence that PCP use was a \"factor\" in the commission of the crimes. The referee concluded that (1) petitioner's assertions that he was under the influence of PCP that night were not credible; (2) there was \"little credible evidence, worthy of consideration . . . that petitioner used PCP on the night of the killings; and (3) there was, however, \"evidence that petitioner's long term PCP use may have been a factor in his commission of the offenses.\"\n\nPetitioner first takes exception to the referee's Conclusion that there was no credible evidence that he was under the influence of PCP on the night of the crimes. The only evidence of this alleged fact was generated from petitioner himself, first in his statements to the probation officer which appear in the probation and sentencing report, then in his testimony at the evidentiary hearing, and finally in Dr. Rosenthal's testimony.\n\nAs stated earlier, petitioner had a motive to claim he was under the influence of PCP at the time of the crimes, so we must view his testimony with this in mind. Victor Padua, petitioner's accomplice on September 12, 1980, testified that he had often smoked PCP-laced cigarettes with petitioner. In addition, Padua testified that when he picked up petitioner that night, he \"seemed to be\" under the influence of PCP, although Padua admitted he could not recall whether he smoked any PCP with petitioner that night. We note that Padua, more than 10 years after the crimes, may also have a motive to testify so as to assist his friend avoid the death penalty. We thus must consider this fact when evaluating his testimony.\n\nA defense investigator, Edward Sanchez, testified that Arturo Padua, the other possible percipient witness that night, and Ivania Cantarero, petitioner's then girlfriend, told him that petitioner had smoked PCP the night of the crimes. Neither person testified at the hearing below, however, or ever told this information to police.\n\nFinally, Dr. Rosenthal testified that petitioner used PCP the night of the crimes. Rosenthal admitted, however, that he received this information from petitioner himself, from Arturo Padua, and from petitioner's relatives, and that he simply accepted their statements as true for purposes of his diagnosis.\n\nOn this showing, we agree with the referee that there was little credible evidence showing petitioner was under the influence of PCP the night of the crimes. Bearing in mind that petitioner bore the burden of proof (Duvall, (supra) , 9 Cal. 4th at p. 474), we find that this evidentiary showing was insufficient to support a finding that petitioner was intoxicated on PCP the night of the crimes. We therefore overrule petitioner's exception on this point.\n\nPetitioner does not take exception to the referee's finding that petitioner's overall PCP use may have been a factor in the crimes. In support of this finding, the referee cited the hearing testimony of Drs. Rosenthal and Aniline. The gist of their testimony was that ingesting PCP may affect one's behavior \"hours, days, weeks, even months after ingestion.\" The referee also noted, however, that there was \"substantial evidence produced that would tend to discredit\" the opinions of the two doctors. Petitioner strongly excepts to this latter finding, noting respondent failed to present any medical evidence of its own.\n\nAs with the determination of the veracity of petitioner's friends and mother, however, Judge Ouderkirk did not resolve the dispute, but merely concluded that there was evidence that \"would tend to discredit\" the testimony of Drs. Rosenthal and Aniline. That Conclusion is supported by evidence in the record. For example, Dr. Rosenthal himself testified that the effect of PCP was quite \"varied\" and can cause all manner of behavioral changes. Although at one point he opined that he had \"little doubt\" that petitioner acted under the influence of PCP, he later admitted he could not \"be absolutely sure that PCP . . . was a factor in this crime.\"\n\nFurther contrary evidence came in the form of testimony from petitioner's friends and his mother. For example, Maria Rodriguez testified she had frequently observed petitioner use PCP, and had used PCP with petitioner over 300 times. She testified that when he used PCP, he acted like a zombie, would stare and mumble, behavior completely at odds with petitioner's violent, rampaging actions that comprised the crimes in this case. Myrna Gonzalez, petitioner's girlfriend between 1977 and 1980, testified she had seen petitioner high on PCP, and confirmed that he became quiet and had difficulty speaking and walking. She never saw him act violently while under the influence of PCP, although once he pushed her. These observations of petitioner while under the influence of PCP were largely confirmed by petitioner's mother.\n\nAlthough the People did not present any expert medical evidence, they presented the testimony of Officer Warren Pickens, one of the senior officers in charge of the investigation of petitioner's crimes. Pickens testified that he had been involved in over 500 homicide investigations, and had participated in the arrest and investigation of persons who had taken PCP. He stated that when he questioned Victor Padua and petitioner, they both denied using PCP. He testified that he saw nothing in the facts of the crimes that suggested the use of PCP, and explained that when he questioned petitioner two days after the crimes, he would have expected petitioner to exhibit loss of memory, lethargy, difficulty speaking, an unresponsive affect, and a blank stare. Officer Pickens observed none of these symptoms in petitioner.\n\nConsidering this evidence, we find substantial evidence to support the referee's finding that there was evidence \"produced that would tend to discredit\" the expert opinions that petitioner's long-term PCP use was a factor in his crimes. The mere fact that PCP has a variable effect on users, and that observations of petitioner's past usage revealed he became quiet, passive, and had difficulty walking while under the drug's influence, supports the referee's finding. Moreover, Pickens testified that petitioner did not exhibit any symptoms of having been under the influence of PCP and expressly denied having smoked any \"sherms.\" Although the evidence was not overwhelmingly in support of this Conclusion (e.g., Maria Rodriguez also testified that petitioner sometimes acted differently when under the influence of PCP, and was unable to sit still), there was nevertheless substantial evidence to support the referee's finding. We thus reject petitioner's exception to this portion of the referee's findings.\n\nD. Respondent's Exceptions to the Referee's Report\n\nAs noted above, our second question asked the referee to determine whether \"there [was] other evidence of petitioner's use of PCP that counsel failed to discover because his investigation was inadequate, and if so, what was that evidence?\" (Italics added.) The referee responded in the affirmative, explaining that counsel's \"investigation was inadequate.\" (Italics added.)\n\nRespondent questions the meaning of the word \"inadequate,\" both in our question and in the referee's response. If the use of the word \"inadequate\" suggests the referee was to make, or made, a legal decision on the reasonableness of Part's representation, respondent takes exception to the referee's finding. To the extent respondent is merely claiming that this court has the ultimate responsibility to say whether Part's performance was inadequate as a matter of law, we agree. That is not to say, however, that it is inappropriate for the referee to have expressed an opinion as to whether Part's investigation was inadequate. Such Conclusions of law by the referee, however, are subject to independent review by this court and are not given the ordinary deference we show to factual findings by a referee. (In re Ross, (supra) , 10 Cal. 4th at p. 201.)\n\nRespondent also \"respectfully questions\" the referee's restatement of the testimony of Attorneys Gessler and Gillingham, defense attorneys who testified as experts for petitioner and opined that competent counsel would have investigated petitioner's potential drug use. Gessler also stated he would have interviewed family members. Respondent argues that \"What some hypothetical competent counsel would have done in hindsight . . . is of marginal relevance and intrudes upon the legitimate function of this [court].\"\n\nIt is unclear whether respondent is objecting to this part of the referee's findings. We note that reliance on attorney experts is commonplace (see In re Neely (1993) 6 Cal. 4th 901, 914 [26 Cal. Rptr. 2d 203, 864 P.2d 474] [defense attorney testified as an expert in evaluating trial counsel's failure to investigate the case]; In re Fields (1990) 51 Cal. 3d 1063, 1077 [275 Cal. Rptr. 384, 800 P.2d 862] [same]; In re Jackson (1992) 3 Cal. 4th 578, 662-663 [11 Cal. Rptr. 2d 531, 835 P.2d 371] [defense attorneys testified as experts in evaluating tactics of defendant's trial attorney]; see also People v. Mayfield, (supra) , 5 Cal. 4th 142, 208, fn. 16 [prosecution attorney testified as an expert that San Bernardino County venirepersons would be unlikely to look on illicit drug use as a factor in mitigation]), and we may consider such evidence, although we are not bound by it. (In re Ross, (supra) , 10 Cal. 4th at pp. 214-215.) In any event, respondent did not object to the testimony of either Gessler or Gillingham on grounds of relevance and thus waived this objection.\n\nE. The Merits of Petitioner's Claims\n\nPetitioner claims his trial counsel, Part, was constitutionally ineffective in a variety of ways. We have previously explained that, \"[i]n order to demonstrate ineffective assistance of counsel, a defendant must first show counsel's performance was 'deficient' because his 'representation fell below an objective standard of reasonableness . . . under prevailing professional norms.' ( Strickland v. Washington (1984) 466 U.S. 668, 687-688 [80 L. Ed. 2d 674, 693-694, 104 S. Ct. 2052]; Ledesma, (supra) , 43 Cal. 3d at pp. 215-216.) Second, he must also show prejudice flowing from counsel's performance or lack thereof. (Strickland, (supra) , at pp. 691-692 [ 80 L. Ed. 2d at pp. 695-696]; Ledesma, (supra) , at pp. 217-218.) Prejudice is shown when there is a 'reasonable probability that, but for counsel's unprofessional errors, the result of the proceeding would have been different. A reasonable probability is a probability sufficient to undermine confidence in the outcome.' ( In re Sixto (1989) 48 Cal. 3d 1247, 1257 [259 Cal. Rptr. 491, 774 P.2d 164]; Strickland, (supra) , at p. 694 [ 80 L. Ed. 2d at pp. 697-698].)\" ( People v. Jennings (1991) 53 Cal. 3d 334, 357 [279 Cal. Rptr. 780, 807 P.2d 1009].)\n\nIn a recent case, the United States Supreme Court addressed the unusual situation of trial counsel failing to make a valid objection at trial, where the precedent for the objection was later overruled. ( Lockhart v. Fretwell (1993) 506 U.S. 364 [122 L. Ed. 2d 180, 113 S. Ct. 838]; (hereafter Fretwell).) In that case, the high court, when applying the second prong of the Strickland test, noted that the test for \"prejudice\" is not solely one of outcome determination. Instead, the pertinent inquiry is \"whether counsel's deficient performance renders the result of the trial unreliable or the proceeding fundamentally unfair.\" ( Id. at p. 372 [122 L. Ed. 2d at p. 191].) \"Thus, an analysis focussing solely on mere outcome determination, without attention to whether the result of the proceeding was fundamentally unfair or unreliable, is defective.\" ( Id. at p. 369 [122 L. Ed. 2d at p. 189], fn. omitted.) \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\n\"In evaluating defendant's showing [a court accords] great deference to the tactical decisions of trial counsel in order to avoid 'second-guessing counsel's tactics and chilling vigorous advocacy by tempting counsel \"to defend himself or herself against a claim of ineffective assistance after trial rather than to defend his or her client against criminal charges at trial. . . .\" ' \" (In re Fields, (supra) , 51 Cal. 3d 1063, 1069-1070, quoting In re Cordero (1988) 46 Cal. 3d 161, 180 [249 Cal. Rptr. 342, 756 P.2d 1370] and People v. Ledesma, (supra) , 43 Cal. 3d at p. 216.) \" 'However, \"deferential scrutiny of counsel's performance is limited in extent and indeed in certain cases may be altogether unjustified. 'eference is not abdication' [citation]; it must never be used to insulate counsel's performance from meaningful scrutiny and thereby automatically validate challenged acts or omissions.\" ' \" (51 Cal. 3d at p. 1070; see also People v. Karis (1988) 46 Cal. 3d 612, 621 [250 Cal. Rptr. 659, 758 P.2d 1189].) Finally, we note that a criminal defendant can \"reasonably expect that before counsel undertakes to act at all he will make a rational and informed decision on strategy and tactics founded on adequate investigation and preparation.\" ( People v. Ledesma, (supra) , 43 Cal. 3d at p. 215.)\n\nWe now address the merits of petitioner's claims, keeping in mind that we found disputed issues of material fact as to only one question: petitioner's alleged PCP usage. In so doing, we take judicial notice of the trial record in petitioner's direct appeal, People v. Avena (S004422, app. pending). (Evid. Code, § 452, subd. (d)(1).)\n\n1. Alleged Failure to Investigate and Present a Diminished Capacity Defense\n\nPetitioner's primary claim is that Part should have investigated and presented a defense of diminished capacity based on petitioner's alleged PCP intoxication during the crimes. Although the defense of diminished capacity is now abolished ( People v. Saille (1991) 54 Cal. 3d 1103 [2 Cal. Rptr. 2d 364, 820 P.2d 588]; § 25, 28; see generally, 1 Witkin \u0026 Epstein, Cal. Criminal Law (2d ed. 1988) Defenses, § 208-211, pp. 238-243), it was extant when petitioner committed his crimes. \"Diminished capacity [was] a defense to all specific intent crimes.\" ( People v. Cruz, (supra) , 26 Cal. 3d 233, 242.) It provided that \"A person who intentionally kills may be incapable of harboring malice aforethought because of a mental disease, defect, or intoxication, and in such case his killing, unless justified or excused, is voluntary manslaughter.\" ( People v. Conley (1966) 64 Cal. 2d 310, 318 [49 Cal. Rptr. 815, 411 P.2d 911], italics added.) \" 'The true test is not the duration of the time as much as it is the extent of the reflection.' . . . he true test must include consideration of the somewhat limited extent to which this defendant could maturely and meaningfully reflect upon the gravity of his contemplated act.\" ( People v. Wolff (1964) 61 Cal. 2d 795, 821 [40 Cal. Rptr. 271, 394 P.2d 959], italics in original; see generally, People v. Saille, (supra) , 54 Cal. 3d at pp. 1109-1111.)\n\nIt is undisputed that Part failed to investigate this defense. As the referee found, however, petitioner never told Part that he was \"high\" on PCP the night of the crimes, and we have reached the same Conclusion based on our independent review. Petitioner's argument is thus reduced to a claim that, based on other available evidence, Part should have investigated a diminished capacity defense arising from petitioner's alleged PCP use.\n\nIt is here that petitioner stands on firmer ground, for the referee found there was evidence of petitioner's habitual PCP usage available to Part (the juvenile probation report, the Los Angeles Police Department arrest form, and the Youth Authority referral document), that should have spurred him to conduct an investigation. Had Part done so, he would have discovered the evidence now contained in the declarations accompanying petitioner's application for a writ of habeas corpus. Specifically, those declarations show: (1) petitioner smoked PCP-laced cigarettes (\"sherms\") with Arturo Padua \"on a regular basis for at least six months to a year before September 12, 1980 [the day of the crimes]. [They] smoked them 3 to 4 times a month, usually on the weekends.\" This is consistent with the declaration of Arturo Padua. (2) Petitioner's girlfriend, Ivania Cantarero, stated petitioner \"used PCP and marijuana on an average of once a week.\" (3) Both petitioner's mother (Marianna Avena) and his sister (Elizabeth Avena) state generally that petitioner \"was using drugs, including PCP.\"\n\nUltimately, however, Part's unjustified failure to investigate petitioner's alleged PCP use was not prejudicial and therefore does not warrant relief. This is so because the evidence Part failed to uncover, taken together, is insufficient to establish a defense of diminished capacity. The primary failing of this evidence is that it fails to establish that petitioner was under the influence of PCP on the night the crimes occurred. Instead, this evidence merely demonstrates that petitioner habitually ingested PCP.\n\nPeople v. Pensinger (1991) 52 Cal. 3d 1210 [278 Cal. Rptr. 640, 805 P.2d 899] is instructive. In that case, there was evidence the defendant drank several beers and some shots of hard liquor, all between three or four in the afternoon and 8:30 that night. One witness testified that the defendant had been drinking and shooting Quaalude, although there was no expert evidence on the effect of the Quaalude. Although the defendant testified, he did not claim he was intoxicated. Other witnesses reported that the defendant did not seem intoxicated. ( Id. at pp. 1241-1242.) We held that \"[t]his evidence does not amount to substantial evidence that defendant lacked the capacity to form the requisite mental states . . . .\" ( Id. at p. 1241.) More to the point, we explained that \"[n]ormally, merely showing that the defendant had consumed alcohol or used drugs before the offense, without any showing of their effect on him, is not enough to warrant an instruction on diminished capacity. [Citations.]\" (Ibid., italics added.)\n\nThe evidence in Pensinger at least showed the defendant in that case consumed some amount of drugs and alcohol on the day of his crimes. In petitioner's case, we have no credible evidence that he smoked PCP on the day in question. In addition, even if we assume he did use drugs on the day in question, there is no evidence showing how much he ingested or the degree of intoxicating effect, if any, it had on him. Instead, we have only evidence that petitioner often smoked PCP in the weeks and months preceding the crimes, and expert evidence that such use can cause an adverse reaction. By his own testimony, however, Dr. Aniline admitted each person's reaction to PCP is different. Dr. Rosenthal essentially corroborated this opinion. This is manifestly insufficient to support a diminished capacity defense at trial.\n\nPetitioner relies on expert testimony that suggests that PCP is stored in the body's tissues and that this residue can produce violent behavior up to several months later. Dr. Aniline testified at the evidentiary hearing that in light of petitioner's chronic abuse of PCP, \"the usage that night is of . . . minor importance. It adds or if it turned out to be true, it would add and contribute to the opinion that PCP played a role. You would have both the current as well as past history. The history [of past PCP abuse] was, in my opinion, . . . the major contributing factor here.\" Dr. Aniline agreed that PCP use had affected persons \"days and even weeks after they took the drug.\" As a result of petitioner's long-term PCP use and alleged use on the night of the crime, Dr. Aniline first concluded petitioner's ability to form an intent to kill \" might have been impaired.\" (Italics added.) He then stated more definitely that petitioner's capacity to \"appreciate the criminality of his conduct\" was \"impaired.\"\n\nWe are perplexed by Dr. Aniline's testimony and find his opinions somewhat self-contradictory. Although the gist of his expert opinion was that petitioner could not meaningfully and maturely reflect on his crimes, he stated other opinions that were seemingly at odds with this primary thesis. For example, on cross-examination, he admitted he had not read petitioner's confession in this case, which included petitioner's clear memory of the events. In addition, Dr. Aniline noted that a person's response to PCP intoxication is highly individual, and that a person so intoxicated could still drive a car and hold down a job that entailed known tasks. Such behavior under the influence of PCP seems inconsistent with the impaired mental state required for a successful diminished capacity defense. In sum, we find Dr. Aniline's opinions in this regard self-contradictory and entitled to little weight.\n\nDr. Rosenthal's expert testimony was essentially the same as Dr. Aniline's testimony. Dr. Rosenthal explained that the symptoms of PCP intoxication vary with the individual, but that such persons are often \"very much out of touch with reality. They are out of control, agitated, compulsive. They may be hallucinating. They may have delusional thoughts.\" If petitioner was so intoxicated, \"he would be unable to form intent or think rationally. His thinking would be disorganized, impulsive. He would be reacting from moment to moment.\" He stated that from \"everything\" that he had reviewed, \"there was little doubt that [petitioner] was under the influence of PCP [on the night of the murders].\" He also testified that the effects of habitual PCP abuse can be felt for weeks and months.\n\nTaken together, we cannot say the evidence amassed by petitioner, even considering the testimony Drs. Aniline and Rosenthal, is sufficient to support a viable diminished capacity defense. The glaring omission is any credible evidence that he actually took some PCP on the night of the crimes. Moreover, there is no evidence showing how the drug affected him that night. Standing in the place of such evidence is petitioner's expert opinion evidence that residue amounts of PCP stored in petitioner's body tissues through weeks of chronic drug abuse, perhaps combined with more recent ingestion of the drug, may have caused him to behave in a violent manner, and that this combination may have so affected his mental faculties such that he could not maturely and meaningfully reflect on his criminal actions.\n\nSuch a Conclusion is contradicted by petitioner's seemingly goal-directed behavior that night, which exhibited a much higher degree of mental functioning than Dr. Aniline and Dr. Rosenthal would have us believe. For example, petitioner participated in the pursuit of the brown Ford Galaxy, shooting at it in retaliation for the thrown beer bottle. When the Mazda in which petitioner was riding became inoperable, he formed a plan to secure alternative transportation by stealing the pink Camaro driven by the murder victims. As one of the victims fled, petitioner asked one of the Paduas to step aside and out of the line of fire. He then returned home in order to reload his rifle. Later, he decided to abandon the Camaro because it bore incriminating evidence; the plan included setting the car ablaze to conceal fingerprints. Finally, seeking yet another car, petitioner stationed himself at the bottom of the freeway off-ramp, realizing that a car would eventually exit the freeway and come to a stop where its occupants would be most vulnerable to a forcible theft of their vehicle.\n\nThus, petitioner's actual conduct that night, when compared to the weak and tenuous evidence that PCP intoxication may have prevented the mature and meaningful reflection on the gravity of his crimes, convinces us there was no viable diminished capacity defense available to petitioner and thus no prejudice from Part's failure to explore one. Although we do not condone or excuse Part's inexplicable failure to investigate the availability of a diminished capacity defense, especially given evidence of petitioner's past drug use as revealed in documents available to Part, we conclude petitioner has not demonstrated Part's inaction prejudiced him under either of the tests laid down in Strickland and Fretwell. Stated another way, there is no reasonable probability that, but for counsel's unprofessional error in failing to locate and present to the jury expert and lay evidence regarding petitioner's alleged PCP intoxication, petitioner would have enjoyed a more favorable outcome of the trial ( Strickland v. Washington, (supra) , 466 U.S. at p. 694 [80 L. Ed. 2d at pp. 697-698]), and counsel's allegedly deficient performance in failing to present this evidence did not render the result of the trial unreliable or fundamentally unfair. (Fretwell, (supra) , 506 U.S. at p. 372 [ 122 L. Ed. 2d at p. 191].)\n\n2. United States v. Cronic\n\nPetitioner, pointing to the minimal nature of Part's representation, contends he is entitled to reversal without having to show prejudice. In support, he cites United States v. Cronic (1984) 466 U.S. 648 [80 L. Ed. 2d 657, 104 S. Ct. 2039] (hereafter Cronic). In other words, he asserts that the minimal assistance Part provided must be presumed to have been ineffective. \"We recognize that in some cases ineffective assistance must be presumed 'without inquiry into the actual conduct of the trial' because 'the likelihood that any lawyer, even a fully competent one, could provide effective assistance is so small' that the cost of litigating the issue is unjustified.\" ( People v. Bonin (1989) 47 Cal. 3d 808, 844 [254 Cal. Rptr. 298, 765 P.2d 460], quoting Cronic, (supra) at pp. 659-660 [ 80 L. Ed. 2d at p. 668].) As in Bonin, we conclude this case does not come within Cronic 's exception to the rule requiring a showing of prejudice laid down in Strickland v. Washington, (supra) , 466 U.S. 668.\n\nIn Cronic, the high court explained that: \"The right to the effective assistance of counsel is . . . the right of the accused to require the prosecution's case to survive the crucible of meaningful adversarial testing. When a true adversarial criminal trial has been conducted--even if defense counsel may have made demonstrable errors--the kind of testing envisioned by the Sixth Amendment has occurred. But if the process loses its character as a confrontation between adversaries, the constitutional guarantee is violated.\" (Cronic, (supra) , 466 U.S. 656-657 [ 80 L. Ed. 2d at p. 666], fns. omitted.) Thus, \"[t]here are . . . circumstances that are so likely to prejudice the accused that the cost of litigating their effect in a particular case is unjustified. Most obvious, of course, is the complete denial of counsel. . . . Similarly, if counsel entirely fails to subject the prosecution's case to meaningful adversarial testing, then there has been a denial of Sixth Amendment rights that makes the adversary process itself presumptively unreliable.\" ( Id. at pp. 658-659 [80 L. Ed. 2d at pp. 667-668], italics added, fns. omitted.) It is this latter language on which petitioner relies.\n\nTo limit this otherwise broad language, however, the high court made some revealing comments in footnotes. First, it gave some examples: \"The Court has uniformly found constitutional error without any showing of prejudice when counsel was either totally absent, or prevented from assisting the accused during a critical stage of the proceeding.\" (Cronic, (supra) , 466 U.S. at p. 659, fn. 25 [ 80 L. Ed. 2d at p. 668].) After briefly describing Davis v. Alaska (1974) 415 U.S. 308 [39 L. Ed. 2d 347, 94 S. Ct. 1105], in which counsel was prevented from cross-examining a crucial prosecution witness, the Cronic court opined: \" Apart from circumstances of that magnitude, however, there is generally no basis for finding a Sixth Amendment violation unless the accused can show how specific errors of counsel undermined the reliability of the finding of guilt.\" (Cronic, (supra) , 466 U.S. at p. 659, fn. 26 [ 80 L. Ed. 2d at p. 668], italics added.)\n\nAn examination of the trial reveals that Part's trial representation was minimal at best. He waived opening argument at the guilt phase, called no defense witnesses, and did not address either the two murders or the two special circumstance allegations in a brief closing argument. Instead, he limited himself to commenting on the state of the evidence for the assault with intent to murder charges. He was, however, neither \"totally absent\" nor \"prevented\" from assisting petitioner at trial.\n\nNor can we say that outside influences prevented Part from providing more vigorous legal assistance. The high court recognized that such outside influences can sometimes render it impossible for any lawyer to provide constitutionally adequate assistance. (Cronic, (supra) , 466 U.S. at pp. 659-660 [ 80 L. Ed. 2d at pp. 668-669].) Petitioner's argument, however, is not that there were such outside influences, but that Part himself failed to work hard enough. This case thus falls outside the small exception carved out by Cronic. As that case itself recognized, \"the Sixth Amendment does not require that counsel do what is impossible or unethical. If there is no bona fide defense to the charge, counsel cannot create one and may disserve the interests of his client by attempting a useless charade.\" ( Id. at pp. 656-657, fn. 19 [80 L. Ed. 2d at p. 666].) Although we are disturbed by how little Part appears to have done at trial, it is undisputed that he was faced with a defendant with no apparent defense who had confessed to two first degree murders as well as a series of other serious crimes.\n\nIn sum, we find petitioner has not proven that he was prejudiced by Part's alleged failings. Accordingly, Part did not provide constitutionally ineffective legal assistance by failing to investigate and present a defense of diminished capacity at trial.\n\n3. Failure to Challenge the Admissibility of Petitioner's Confession on Miranda Grounds\n\nPetitioner next contends that Part was ineffective for failing to investigate the voluntariness of his confession and make a pretrial motion to suppress the taped confession based on the interrogating police officers' alleged failure to read petitioner his Miranda rights. ( Miranda v. Arizona (1966) 384 U.S. 436 [16 L. Ed. 2d 694, 86 S. Ct. 1602, 10 A.L.R.3d 974] (hereafter Miranda).) By incorporating his declaration into his petition for a writ of habeas corpus, petitioner alleges that he told Part during their very first interview that he had not been \" Mirandized \" before officers interrogated him; this interrogation led to the taped confession that was admitted against him at trial. Another declaration states that Part told appellate counsel that he knew police had a taped confession but he \"did not seek to have it transcribed or analyzed to see what was said on it. He did not listen to it with petitioner; nor did he ever let petitioner listen to it.\" Both these declarations alleged that petitioner never heard the tape of the confession before it was played during the Evidence Code section 402 hearing in the middle of trial.\n\nThe record suggests Part first learned of the Miranda claim in the middle of trial. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e No Miranda warnings were apparent on the taped confession, although police testified and explained that petitioner did not want any part of the interrogation written down so they started the tape surreptitiously after they had read him his Miranda rights.\n\nWithout deciding whether Part was constitutionally remiss for failing to investigate this issue, we conclude that, assuming for argument that Part's investigation was inadequate, there was no prejudice. Although Part did not make a pretrial motion to suppress, the matter was litigated in the Evidence Code section 402 hearing prior to the confession being admitted at trial and played for the jury. At the hearing, petitioner testified and affirmed that he was never read his rights. Both Officers Pickens and Fesperman testified at the hearing and stated they informed petitioner of his Miranda rights and that he waived them. There was one portion of the taped confession in which Part claimed petitioner stated, \"I want to talk to a lawyer,\" but the tape was not clear as to the words \"to a lawyer.\" The trial Judge listened to the tape several times and ruled petitioner merely said \"I want to talk\" and did not mention the word \"lawyer.\" Thus, although Part did not make a pretrial motion, the in limine motion to suppress gave petitioner the opportunity to litigate the admissibility of the confession.\n\nAfter hearing this testimony and the arguments of the parties, the trial court noted that this was a question of credibility and ruled that the confession \"was freely and voluntarily given and that the defendant was advised of his rights.\" The court thus implicitly credited the officers' testimony and disbelieved petitioner's testimony. As petitioner does not now adduce any additional evidence on the subject, we conclude that even had Part investigated the issue and moved before trial to suppress the confession, the result would have been the same. Petitioner was thus not prejudiced by the omission. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\n4. Failure to Make a Pitchess Motion\n\nAs a subsidiary claim, petitioner alleges that Part was constitutionally ineffective for failing to make a Pitchess motion ( Pitchess v. Superior Court (1974) 11 Cal. 3d 531 [113 Cal. Rptr. 897, 522 P.2d 305]) to challenge Officer Pickens, who petitioner claims beat him during the interrogation. Petitioner alleges in a declaration that \"I had been beaten up by the cops after my arrest . . . [Part] told me it would be hard to prove.\" Petitioner also testified at the Evidence Code section 402 hearing on the voluntariness of his confession that police beat him. He reported he was grabbed by the testicles and slapped. Petitioner testified he answered \"yes\" to the officers' questions \"because I was afraid that they were going to start to beat me up again.\" Petitioner's version of the interrogation was specifically denied by Officer Pickens. The trial court ruled in the People's favor by finding petitioner's statements were voluntary, thereby implicitly finding that they were not made to avoid a beating.\n\nAs with his Miranda claim, however, petitioner does not present any evidence--other than his bare assertion--that adds to what was already presented at the Evidence Code section 402 hearing. He does not show, for example, what Part would have discovered had he made a Pitchess motion. In his traverse, petitioner complains that he had no opportunity to move for discovery because the trial court lost jurisdiction by the time appellate/habeas corpus counsel began their representation and first raised this issue. We reject, however, the implicit suggestion that we should overturn a long-final criminal judgment without evidence that counsel's alleged ineffectiveness had some effect on the judgment. \"We presume the regularity of proceedings that resulted in a final judgment [citation], and . . . the burden is on the petitioner to establish grounds for his release.\" (Duvall, (supra) , 9 Cal. 4th at p. 474.)\n\nAlthough petitioner lost the opportunity for discovery when the trial court relinquished jurisdiction in the case, his burden to establish the grounds for collateral relief remained. Moreover, discovery may be available in a habeas corpus proceeding if, as here, an order to show cause has issued. ( People v. Gonzalez, (supra) , 51 Cal. 3d at p. 1261.) There being no showing of possible prejudice, we reject petitioner's claim that Part was constitutionally ineffective for failing to file a Pitchess motion.\n\n5. Waiver of Petitioner's Right to Appear at Trial in Civilian Clothes\n\nDuring trial, Part expressly waived petitioner's right not to appear before the jury in jail clothes. Part noted on the record that he had tactical reasons for doing so. He explained this decision in his declaration accompanying the return to the order to show cause: \"t has been my belief, tactic, and custom that I would rather have a defendant appear in jail clothes than in civilian clothes. I feel that this evokes some measure of sympathy for the defendant.\" In her declaration, appellate counsel Eleanor Kraft alleges that she spoke with Part, and that he told her he preferred petitioner appear in jail clothes because \"Blacks and Mexicans . . . don't know how to dress right. They dress too loud and with the wrong colors and that would make things worse.\" In his declaration, Part strongly and expressly denies making these statements. Ordinarily, such a clear factual dispute would require a reference. We declined to include this issue in our reference order, however, because petitioner failed to demonstrate any prejudice.\n\nA criminal defendant has the right to appear before the jury in civilian clothes instead of jail garb, and violation of this right is of federal constitutional dimension requiring application of the Chapman standard ( Chapman v. California (1967) 386 U.S. 18 [17 L. Ed. 2d 705, 87 S. Ct. 824, 24 A.L.R.3d 1065]; see generally, People v. Taylor (1982) 31 Cal. 3d 488 [183 Cal. Rptr. 64, 645 P.2d 115].) The right, however, may be waived by counsel. (31 Cal. 3d at pp. 495-496.) Even assuming for argument, however, that Part's reasons for waiving the right for petitioner were unreasonable, petitioner makes no effort to demonstrate any prejudice flowing from the alleged error. Given that petitioner confessed his culpability in a taped confession, and was identified as the killer by coparticipant Victor Padua, we conclude that Part's tactical decision to have petitioner appear before the jury in jail clothes, even if unsound, was not prejudicial.\n\n6. Failure to Investigate and Present Available Mitigating Evidence at the Penalty Phase\n\nPetitioner contends that Part was constitutionally ineffective in his legal representation because he failed to investigate and present available mitigating evidence at the penalty phase of the trial. This evidence comes under two broad headings: failure to call family and friends for evidence of his good character; and failure to call witnesses who would have testified that petitioner acted in self-defense when he killed Ruben Alfaro while in pretrial detention.\n\na. Reliance on Deere\n\nAs an initial matter, we reject petitioner's reliance on People v. Deere (1985) 41 Cal. 3d 353 [222 Cal. Rptr. 2d 13, 710 P.2d 925] for the proposition that failure to present mitigating evidence alone necessarily constitutes ineffective assistance of counsel. Subsequent to the filing of petitioner's habeas corpus petition, we \"disapproved of the suggestion in Deere. . . that counsel necessarily provides constitutionally inadequate representation when he or she accedes to a client's wishes and declines to present available mitigating evidence at the penalty phase of a capital trial. [Citation.] At least in the absence of evidence showing counsel failed to investigate available mitigating evidence or advise defendant of its significance [citation], we cannot say\" a defendant's trial attorney necessarily provides ineffective assistance of counsel by failing to present available mitigating evidence. ( People v. Sanders (1990) 51 Cal. 3d 471, 526 [273 Cal. Rptr. 537, 797 P.2d 561], fn. omitted.)\n\nThereafter, we clarified that counsel's decision to decline presenting mitigating evidence at a penalty phase of a capital trial is tested by the same standard applicable to allegations of ineffective assistance of counsel. (See In re Ross, (supra) , 10 Cal. 4th at pp. 189 [\"Petitioner presented no witnesses at the penalty phase\"], 204 [applying Strickland v. Washington to the alleged misconduct].) That is, not only incompetence but also prejudice must be shown.\n\nb. Good Character Evidence\n\nIn support of his claim that Part failed to present available mitigating evidence in the form of good character evidence, petitioner presents three declarations:\n\n(1) Marianna Avena, petitioner's mother, declared that she was aware of his drug use, and that he intervened and protected her when her husband attempted to assault her, but that petitioner always respected her husband. In addition, she declared that she loves her son, that he loves her and his brothers and sisters, and that she was never contacted by Part or a defense investigator;\n\n(2) Elizabeth Avena, petitioner's sister, declared that she was aware of her brother's drug problem, that she loved her brother, that she attempted to enter the courtroom but the bailiff told her to leave, and that she was never contacted by Part or asked to testify; and,\n\n(3) Ivania Cantarero, petitioner's girlfriend, declared that she was aware of petitioner's drug problem, that he was never violent under the influence of drugs, that he never mistreated her, that someone from the defense contacted her and that she revealed at that time her juvenile arrest for assault, but that it had been dismissed, that she was not allowed in the courthouse because she was a potential witness, and that if called to testify, she would have recounted petitioner's loving relationship with her and with his family.\n\nRespondent argues that calling petitioner's mother and sister to testify would have \"opened the proverbial can of worms.\" Respondent suggests that such testimony would have led to damaging cross-examination that would have revealed petitioner's gang affiliation as well as his alleged assault on his father. Calling Cantarero, respondent argues, would have left her vulnerable to impeachment concerning her juvenile arrest for assault. (See In re Jackson, (supra) , 3 Cal. 4th 578, 614-615 [in determining whether to present mitigating evidence, defense counsel properly may consider the detrimental consequences that may result from the introduction of such evidence]; In re Ross, (supra) , 10 Cal. 4th at pp. 206-209 [proposed mitigating evidence would have been impeached]; People v. Miranda (1987) 44 Cal. 3d 57, 121 [241 Cal. Rptr. 594, 744 P.2d 1127] [trial counsel could decline to present certain mitigating evidence for fear of rebuttal].) In his traverse, petitioner takes strong exception to these arguments.\n\nc. Evidence of the Alfaro Killing\n\nPetitioner also alleges that Part provided ineffective assistance by failing to investigate the circumstances surrounding petitioner's killing, while in pretrial detention, of fellow inmate Ruben Alfaro. Evidence presented at trial shows that in September 1981, while defendant was in pretrial detention for the offenses for which he was eventually convicted and sentenced to death, deputies noticed a commotion while prisoners were returning from lunch. Deputy Oki, who was in a caged security area, observed defendant stabbing another inmate, Ruben Alfaro, with a shank (i.e., a jail-made knife). Alfaro was lying with his back on the floor and defendant stabbed him three or four times in the chest. Another inmate, Jesus Gonzalez, was also stabbing Alfaro. Oki was only four or five feet from the altercation.\n\nDeputy Minnis was Oki's partner and he also observed the attack. He specifically noticed the blood-covered shank in defendant's hand. When Minnis yelled out, defendant and Gonzalez fled; defendant discarded the shank. Minnis detained defendant and it was later discovered defendant was wearing a towel wrapped around his midsection, a known protective tactic used by jail inmates who anticipate participating in a knife fight. Gonzalez was detained by Deputy Baylis, who had observed Gonzalez running from the scene; Gonzalez later admitted ownership of a long shank found near the knife attack.\n\nAlfaro died from his wounds. An autopsy revealed the cause of death was blood loss due to multiple stab wounds. The stab wounds were consistent with defendant's shank.\n\nTwo days before the Alfaro homicide, Deputy Bauder observed defendant exhibited several puncture-type wounds on his left temple, neck, and chest. Defendant told Bauder that an unidentified \"black guy had tried to get him.\" A search of the room in which defendant had been held turned up 5 shanks but no witnesses among the 80 or 90 inmates.\n\nEvidence that petitioner killed Alfaro doubtlessly comprised potent aggravating evidence at trial. Petitioner claims that had Part conducted an adequate investigation, he would have found that petitioner acted in self-defense. In support, petitioner provides: (1) four declarations, filed under seal, from persons who state that they were inmates at the time of the Alfaro homicide, and that they saw Alfaro attack petitioner with a shank; and (2) a declaration from Roger Potash, the attorney who represented petitioner in the Alfaro matter. Potash alleges that there was evidence establishing petitioner acted in self-defense when he stabbed Alfaro. Potash, however, negotiated a conditional plea of nolo contendere to second degree murder in the Alfaro homicide; the terms of the plea permit petitioner to withdraw the plea should this court reverse the convictions that led to the death penalty.\n\nWe question whether petitioner would have been able to demonstrate he was innocent of the Alfaro murder. To begin with, he pleaded no contest to the charge of second degree murder, thereby admitting his guilt and forgoing the opportunity to present a claim of self-defense. Petitioner strenuously argues the conditional nature of the plea left him the option of withdrawing the plea should he gain a favorable Disposition in this capital case. Without passing judgment on Potash's defense strategy, we note that Part may well have blanched at presenting the evidence of four county jail inmates, all of whom could likely be impeached with prior felony convictions. Moreover, petitioner would have been left trying to explain to the jury, if Alfaro was indeed the aggressor, why petitioner was seen by jail deputies stabbing Alfaro's prone body several times in the chest, desisting this deadly attack only after deputies yelled for him to stop. We also note that Alfaro sustained numerous stab wounds, while neither petitioner nor Gonzalez was wounded, suggesting that petitioner went far beyond what was reasonably necessary for self-defense. At most, this evidence indicates petitioner was guilty of some lesser degree of homicide, not that he was completely innocent.\n\nd. Failure to Show Prejudice\n\nAs with petitioner's claim regarding his appearing at trial in jail clothes, however, we did not deem a reference necessary to resolve disputed factual issues because petitioner fails to allege sufficient facts to demonstrate prejudice, even if we assume for argument that Part's \"representation fell below an objective standard of reasonableness\" \"under prevailing professional norms.\" ( Strickland v. Washington, (supra) , 466 U.S. at p. 688 [80 L. Ed. 2d at p. 694].) As in In re Ross, (supra) , 10 Cal. 4th 184, our inquiry is this: if the mitigating evidence now presented in declarations and factual allegations had been presented at trial, is it reasonably probable the outcome of the penalty phase would have been different? ( Id. at p. 205.) This is often a difficult decision; ultimately, the resolution of the prejudice issue depends on the \"quality\" of the proffered mitigating evidence as compared to the relative strength of the aggravating evidence properly considered by the jury. After considering the relatively meager mitigating evidence petitioner has uncovered, and after comparing that evidence to the extremely serious nature of the crimes petitioner committed, we conclude it is not reasonably probable the penalty phase verdict would have been different had the jury heard this mitigating evidence.\n\nWe may profit from a comparison between this case and two recent cases, In re Ross, (supra) , 10 Cal. 4th 184, and In re Marquez (1992) 1 Cal. 4th 584 [3 Cal. Rptr. 2d 727, 822 P.2d 435], inasmuch as both cases raised the same issue as here, i.e., failure to investigate and present available mitigating evidence at the penalty phase. In Ross, the petitioner was convicted of three first degree murders, five robberies, two burglaries, and rape in concert. Ross personally raped one of the victims. Two of the victims (including a fourteen-year-old boy) were shot behind the head while they were lying down. Defense counsel did not call any witnesses to provide mitigating evidence at the penalty phase. (He did, however, stipulate that one victim was associated with a street gang, that a codefendant did not receive the death penalty, and that the defendant, Ross, was only 21 years old at the time of the crimes.) Following trial, appellate counsel uncovered 15 witnesses, all of whom were relatives, who would have testified to Ross's physical abuse as a child at the hands of his stepfather, Ross's kindness to his siblings, his successful attempt to steer his stepbrother away from drugs, and that all his relatives loved Ross and would suffer if he were sentenced to death. (In re Ross, (supra) , 10 Cal. 4th at pp. 190-195.)\n\nWe denied relief. First, we reasoned that much of this mitigating evidence was subject to varying degrees of impeachment and rebuttal. (In re Ross, (supra) , 10 Cal. 4th at pp. 206-213.) For example, the prosecution would have presented evidence of a psychiatric report prepared when Ross was 15 years old in which he denied any child abuse. Also, there was evidence Ross's mother told a probation officer that when Ross was with his peers, \"he had no control of himself or his behavior.\" (Id. at p. 206.) Ross's mother also told the officer that he \" 'has a hate for whites, shows a great deal of resentment towards all type of people.' \" (Ibid.)\n\nIn addition to noting the potential for impeachment and rebuttal of the proposed mitigating evidence, we emphasized the seriousness of Ross's crimes: \"[Ross] was convicted of three murders on two separate occasions, including the cold-blooded killing of a father and fourteen-year-old son, who were shot while lying on a bed, one with his hands tied behind his back. He personally raped the sister of the third murder victim. Although the additional mitigating evidence, had it been presented, might have evoked sympathy, there was no compelling connection between that evidence and the crimes in this case. The crimes were gang-conducted robbery murders, not sudden explosions of angry violence or psychopathic serial killings. . . . For all these reasons, we find no reasonable probability the result would have been different had the mitigating evidence been presented.\" (In re Ross, (supra) , 10 Cal. 4th at p. 213; see also In re Fields, (supra) , 51 Cal. 3d at pp. 1079-1080 [failure to present more mitigating evidence was harmless because of the aggravated nature of crime].)\n\nIn contrast to In re Ross, (supra) , 10 Cal. 4th 184, we granted relief on habeas corpus in In re Marquez, (supra) , 1 Cal. 4th 584. In Marquez, the petitioner (Marquez) was convicted of one first degree murder in 1981, one second degree murder in 1979, burglary, and robbery. He confessed to both crimes, but later claimed he did so because his wife was pregnant and he did not want her to have a miscarriage. In addition, he had difficulty understanding the Spanish spoken by the interrogating officer. He claimed he was in El Pilon and Buena Vista, Mexico, during the two murders and his alibi was supported by a few witnesses. His defense attorney did not present any penalty phase evidence; Marquez was sentenced to suffer the death penalty.\n\nIn his petition for a writ of habeas corpus, Marquez contended that his trial attorney failed to adequately investigate available mitigating evidence in El Pilon, Mexico. Specifically, he demonstrated that his attorney went to El Pilon but spent less than one-half hour in the village, preferring to spend most of his time in a hotel in a scenic suburb of Mexico City. Had he conducted a more extensive investigation, he would have uncovered numerous witnesses who could have supported Marquez's alibi, as well as provided much good character evidence. For example, this evidence could have been used to \"focus on petitioner's generosity, his consideration of others, and his capacity for hard work.\" (In re Marquez, (supra) , 1 Cal. 4th at p. 602.) We found this evidence was \"substantial\" because \"[i]t would give the jury, for the first time, a description of petitioner's childhood and adolescence growing up in the village of El Pilon, and put before the jury the positive aspects of his character.\" (Id. at p. 609.) \"If this evidence were weighed against the relatively spare aggravating evidence --there was no proof of prior convictions or of uncharged acts of criminal violence--we think it is reasonably probable that a jury would conclude that life imprisonment without possibility of parole was a sufficient punishment.\" (Ibid., italics added.)\n\nUnlike both Ross and Marquez, the additional mitigating evidence now presented by petitioner is neither very extensive nor very persuasive. First, regarding the alleged mitigating evidence by Marianna Avena, Elizabeth Avena, and Ivania Cantarero, we note the sheer number of potential witnesses is small when compared to that in Marquez. More important than their number, however, is the fact that these three declarations are not particularly detailed, and fail to portray petitioner as an individual. For example, other than the alleged assault on petitioner's mother by her husband, we learn very little of petitioner's childhood, and whether his childhood and adolescent experiences would have engendered sympathy in a jury.\n\nSecond, even assuming petitioner would have been able to convince the jury that he killed Alfaro in self-defense and was thus wholly innocent of any crime with regard to that incident (a dubious proposition, as we discussed, ante), we nevertheless conclude, for two reasons, that it is not reasonably probable the jury would have come to a different result. First, we note that petitioner's crimes are quite aggravated. He killed two unarmed victims (Manuel Solis, Miguel Vasquez), one at point-blank range, in order to steal their car. He came close to killing several more victims (Daniel Solis, Ana Hernandez), including two police officers (Officers McCann and Derenia).\n\nSecond, there was other aggravating evidence indicating petitioner's violent nature. In January 1978, Carlos De Santiago was standing on Los Angeles street corner with some members of the \"Harpys\" street gang. As a car drove by, a man with a shotgun jumped from the car and opened fire. De Santiago was hit in the neck, but could not identify the assailant. Defendant later admitted he fired the shots in retaliation, claiming some Harpys had shot into his parents' house and had broken his car windshield. Defendant was then 17 years old.\n\nThen, on November 5, 1981, petitioner assaulted Deputy De Leon as the deputy was attempting to \"uncuff\" another prisoner. De Leon testified there was no apparent reason for petitioner's attack when petitioner suddenly became violent, attempting to strike De Leon in the face. De Leon needed the assistance of another deputy to subdue petitioner, who attempted to bite De Leon in the groin area during the fight.\n\nThus, unlike In re Marquez, where the aggravating evidence was \"relatively spare\" (1 Cal. 4th at p. 609), the aggravating evidence here, especially the circumstances of the crime of which petitioner was convicted (§ 190.3, factor (a)), was quite strong. We therefore conclude that, even assuming for argument that Part's failure to investigate and present available mitigating evidence fell below minimum constitutional standards, petitioner has not demonstrated: (1) that there is a reasonable probability that, but for counsel's omissions, petitioner would have enjoyed a more favorable outcome of the trial ( Strickland v. Washington, (supra) , 466 U.S. at p. 694 [80 L. Ed. 2d at pp. 697-698]); or (2) that counsel's allegedly deficient performance in failing to investigate and present available mitigating evidence at the penalty phase of the trial rendered the result of the trial unreliable or fundamentally unfair. (Fretwell, (supra) , 506 U.S. at pp. 372-373 [ 122 L. Ed. 2d at p. 191].)\n\n7. Did Trial Counsel Adequately Investigate and Present the Case in General?\n\nFinally, we address petitioner's subsidiary contentions that Part failed to properly investigate the case in general. This part addresses petitioner's allegations, made in his petition for a writ of habeas corpus, that Part was constitutionally ineffective for failing to adequately interview petitioner and his immediate family, to properly investigate the facts, to interview witnesses, to present any pretrial motions on his behalf, and, generally, to argue effectively on his behalf.\n\nIn support of these allegations, petitioner alleges Part contacted him only four times prior to trial, that he did not have an interpreter for his preliminary hearing, that he asked to see a psychiatrist but never saw one, that he disagreed with Part's decision to leave certain jurors on the jury and to strike two with Hispanic surnames, that he gave Part the names and addresses of his family but they were never contacted, that he did not hear the tape of his confession until the middle of trial, that the bailiff made his sister leave the courtroom, and that Part did not take his case seriously.\n\nWe are admittedly less than sanguine about Part's apparently minimal representation in this case. Nevertheless, petitioner does not even attempt to explain, let alone demonstrate with further declarations or other available documentary evidence, how these alleged acts and omissions by Part were prejudicial or otherwise led to an unfair trial. We reiterate that \" '[w]e cannot, and will not, predicate reversal of a judgment on mere speculation that some undisclosed testimony may have altered the result.' \" ( People v. Allison (1989) 48 Cal. 3d 879, 907 [258 Cal. Rptr. 208, 771 P.2d 1294], quoting People v. Williams (1988) 44 Cal. 3d 1127, 1154 [245 Cal. Rptr. 635, 751 P.2d 901].)\n\nConclusion\n\nThe order to show cause is discharged and the petition for writ of habeas corpus is denied.\n\nBaxter, J., George, J., and Werdegar, J., concurred.\n\nARABIAN, J.,\n\nConcurring.--I agree with the Conclusion that despite some obvious and glaring deficiencies in his representation, petitioner was not prejudiced or denied his right to effective assistance of counsel. I write separately because I decline to endorse the gratuitous speculation by the majority that in Lockhart v. Fretwell (1993) 506 U.S. 364 [122 L. Ed. 2d 180, 113 S. Ct. 838] the United States Supreme Court recast the prevailing standard for determining whether and when trial counsel's performance was constitutionally inadequate. (Maj. opn., ante, at pp. 721-722.)\n\nLockhart v. Fretwell, (supra) , 506 U.S. 364, was decided on virtually unique facts: at trial, counsel failed to make a Collins objection ( Collins v. Lockhart (8th Cir. 1985) 754 F.2d 258) challenging the constitutionality of the defendant's death sentence because an element of the crime was also used as a factor in aggravation. The state Supreme Court rejected the defendant's various ineffective assistance of counsel claims on direct and collateral review because it had not yet addressed the merits of the underlying issue. By the time the matter reached the Eighth Circuit Court of Appeals on petition for writ of habeas corpus, that court had overruled Collins two years previously ( Perry v. Lockhart (8th Cir. 1989) 871 F.2d 1384). Nevertheless, it found the defendant had been denied his constitutional right to effective counsel by virtue of the failure to object when Collins was extant law.\n\nThe United States Supreme Court reversed on the rationale that to apply a strictly \"outcome determinative\" test in these circumstances \"may grant the defendant a windfall to which the law does not entitle him. [Citation.]\" ( Lockhart v. Fretwell, (supra) , 506 U.S. at p. 370 [122 L. Ed. 2d at p. 189, 113 S. Ct. at p. 843].) Despite conceded error, an omission of this type, \"as a matter of law, ought not inform the [prejudice] inquiry. . . .\" ( Id., at p. 373 [122 L. Ed. 2d at p. 192, 113 S. Ct. at p. 845] (conc. opn. of O'Connor, J.); see Strickland v. Washington (1984) 466 U.S. 668, 695 [80 L. Ed. 2d 674, 698, 104 S. Ct. 2052] [\"An assessment of the likelihood of a result more favorable to the defendant must exclude the possibility of arbitrariness, whimsy, caprice, 'nullification,' and the like.\"]; see also Kimmelman v. Morrison (1986) 477 U.S. 365 [91 L. Ed. 2d 305, 106 S. Ct. 2574] [failure to make a meritless Fourth Amendment claim not prejudicial]; Nix v. Whiteside (1986) 475 U.S. 157 [89 L. Ed. 2d 123, 106 S. Ct. 988] [no prejudice due to counsel's failure to utilize perjured testimony].) Therefore, whether the trial was unfair or unreliable became the relevant inquiry. ( Lockhart v. Fretwell, (supra) , 506 U.S. at pp. 371-372 [122 L. Ed. 2d at pp. 190-191, 113 S. Ct. at p. 844.].)\n\nAs Justice O'Connor explains in her Concurring opinion, however, this result did not augur a new standard for testing claims of ineffective assistance of counsel. On the contrary, the court's \"narrow holding\" was limited to the \"unusual circumstance\" of that case. ( Lockhart v. Fretwell, (supra) , 506 U.S. at pp. 374-375 [122 L. Ed. 2d at p. 192, 113 S. Ct. at p. 845.] (conc. opn. of O'Connor, J.).) Distinguishing those few and infrequent instances in which an assessment of fairness and reliability will supersede an outcome-focused analysis, Justice O'Connor emphasizes that the \"decision will, in the vast majority of cases, have no effect on the prejudice inquiry under [ Strickland v. Washington, (supra) , 466 U.S. 668]. The determinative question --whether there is 'a reasonable probability that, but for counsel's unprofessional errors, the result of the proceeding would have been different,' [citation]--remains unchanged.\" (506 U.S. at p. 373 [122 L. Ed. 2d at p. 192].)\n\nHere, petitioner's assertions of ineffective assistance are not based upon any unusual circumstance involving \"an advantage the law might permit him\" on a \"decidedly incorrect point.\" ( Lockhart v. Fretwell, (supra) , 506 U.S. at pp. 374-375 [122 L. Ed. 2d at pp. 192-193, 113 S. Ct. at p. 845] (conc. opn. of O'Connor, J.).) Quite the opposite: he principally makes the entirely routine claim counsel failed to investigate and present mitigating evidence. Accordingly, if \"there is a reasonable probability that, absent [such] errors, the sentencer . . . would have concluded that the balance of aggravating and mitigating circumstances did not warrant death,\" then petitioner has established prejudice under the only applicable standard. ( Strickland v. Washington, (supra) , 466 U.S. at p. 695 [80 L. Ed. 2d at p. 698].)\n\nSince Strickland defines the appropriate measure for prejudice, there is no reason for the majority to generate possible confusion by quoting with apparent approval references in Lockhart v. Fretwell, (supra) , 506 U.S. at pp. 368, 372 [122 L. Ed. 2d at pp. 188-191], to questions of unfairness and unreliability. (Maj. opn., ante, at pp. 721-722.) Such inquiries are plainly irrelevant under the facts. In concluding petitioner has failed to establish prejudice under either standard (maj. opn., ante, at pp. 722, fn. 5,), the majority compound the potential for uncertainty by implying that both the general rule of Strickland and the limited exception articulated in Fretwell inform our inquiry. They do not; the latter has no bearing on the resolution of this case.\n\nStrickland v. Washington, (supra) , 466 U.S. 668, has stood for more than a decade as the mainstay of Sixth Amendment jurisprudence governing the right to effective assistance of counsel. Before suggesting a transmutation or contemplating a departure, we should await a more definitive and explicit pronouncement from the high court as final arbiter. (Cf. In re Neely (1993) 6 Cal. 4th 901, 924 [26 Cal. Rptr. 2d 203, 864 P.2d 474] (conc. opn. of Arabian, J.).)\n\nMOSK, J.\n\nI Dissent.The majority appear to be embarrassed--and with good reason--to deny this petitioner relief in the face of the shockingly ineffective assistance he received from his court-appointed trial counsel, Marvin Part. Although managing to find that petitioner suffered no prejudice from any of his counsel's numerous professional errors, the majority frankly state that \"We are admittedly less than sanguine about Part's apparently minimal representation in this case\" (maj. opn., ante, p. 738) and concede that \"we are disturbed by how little Part appears to have done at trial\" (id. at p. 728). That is putting it mildly. In fact Part did nothing of substance to prepare for this capital trial, and what little he did during the trial itself was probably detrimental to his client's cause. The majority cite a few of Part's deficient acts and omissions; I shall cite all of them, with references to the record. When Part's consistently inadequate performance is seen in its entirety, it will be apparent that petitioner's constitutional right to the assistance of counsel for his defense has been violated and that he is entitled to the relief he seeks.\n\nI. THE FACTS\n\n1. Part spent only 3 percent of his available working hours preparing for trial. Petitioner was held to answer on December 15, 1980, and Part was appointed his trial counsel on January 7, 1981. Because of numerous continuances trial did not begin until 43 weeks later, on November 4, 1981. We need not speculate about the amount of time Part spent preparing for that trial, for he has told us himself. On the day before testimony began, Part filed his first request for attorney fees. In that request he declared under penalty of perjury that during the entire period since the date of his appointment he had spent a total of 53 hours in preparation time. We may reasonably assume there were 1,720 normal working hours in the same 43-week period (43 x 40). It follows that Part spent only 3 percent of his available working hours preparing for petitioner's trial (53 1,720). Even if Part had many other demands on his time during the same period, an attorney who chooses to undertake the heavy responsibility of representing a defendant facing a capital trial must be prepared to devote more than a mere 3 percent of his professional time to preparing for that trial. There are many steps that counsel must take in order to provide constitutionally effective representation at such a trial; as will appear, however, Part took virtually none of them. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\n2. Part did not personally engage in any investigation before trial. Again he admitted the fact: at the evidentiary hearing Part testified, \"I did not do any investigation. . . . I never went out and found people [i.e., prospective witnesses]. Mr. Sternberg [ sic ] did that.\"\n\n3. Part did not cause his investigator to engage in any investigation before trial. William R. Stenberg, a licensed investigator, was appointed by the court on March 18, 1981, to assist Part in preparation for trial. (Pen. Code, § 987.9.) He died before the evidentiary hearing. When Part was asked at the hearing whether he had sent Stenberg out to do any investigation before trial, he replied, \"I'm not sure that I did.\" When asked whether Stenberg ever told him that he had interviewed any prospective witnesses before trial, Part answered, \"I don't remember.\" It appears from the record, however, that Part did not ask Stenberg to conduct any such investigations or interviews, and that Stenberg in fact conducted none. Thus in a declaration filed in support of the petition for habeas corpus, Edward J. Sanchez, a licensed investigator retained by petitioner's appellate counsel, averred that he interviewed Stenberg before his death and the latter stated that \"Mr. Part did not request that he investigate the case at the guilt or penalty phases.\" Sanchez confirmed this declaration at the evidentiary hearing, testifying specifically that \"Mr. Stenberg related that he had done absolutely nothing as to the penalty phase, that he wasn't asked to do anything.\" The referee quoted this testimony in support of his finding that Part failed to discover evidence of petitioner's PCP use because his investigation was inadequate.\n\nPart's failure to cause Stenberg to investigate petitioner's case is substantiated by a further undisputed event. According to the Sanchez declaration, Stenberg stated that the only time he interviewed anyone on Part's behalf was in April 1982, when he interviewed petitioner and four other inmates of the Los Angeles County jail. Stenberg declared that he submitted a billing statement for those interviews, and \"That was the only statement submitted or work done.\" This assertion is verified by the trial record, which contains a copy of Stenberg's foregoing billing statement; in that statement Stenberg declares under penalty of perjury that between the date he was appointed (Mar. 18, 1981) and the date his appointment terminated (Sept. 7, 1982) he performed only the following services for Part: he interviewed petitioner and the four other jail inmates named in the Sanchez declaration, he attempted to interview an inmate named Gonzales, and he conferred with Part--all in April 1982.\n\nRather than exonerate Part, however, this evidence confirms the fact that he failed to have Stenberg investigate the case at bar: this is so because in April 1982, when Stenberg conducted these interviews, petitioner's trial was over --it had ended a month earlier, when the judgment of death was pronounced on February 12, 1982. In April, Part was representing petitioner in a different case, the murder charge then pending against him for his involvement in the killing of Ruben Alfaro in the Los Angeles County jail. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e That was the case--not the case at bar--that Stenberg was investigating when he rendered his only services for Part.\n\nThere is no doubt that adequate investigation of potential defenses, as well as the strengths and weaknesses of the prosecution's case, is a key step in trial preparation by competent criminal defense counsel: \"The defendant can reasonably expect that before counsel undertakes to act, or not to act, counsel will make a rational and informed decision on strategy and tactics founded on adequate investigation and preparation.\" ( In re Fields (1990) 51 Cal. 3d 1063, 1069 [275 Cal. Rptr. 384, 800 P.2d 862], italics added.)\n\n4. Part did not personally interview any prospective witnesses before trial. Part testified at the evidentiary hearing that he did not talk to any psychiatrist or other medical expert to determine whether phencyclidine (PCP) use by petitioner would have been a viable defense at either phase of the trial. When Part was asked whether he had interviewed any prospective witnesses before trial, he answered, \"I don't remember whether I did or didn't.\" When asked specifically if he had interviewed any members of petitioner's family to learn whether petitioner's behavior on the night of the crimes was \"not normal for him,\" Part testified, \"I don't remember talking to any family members.\" Similarly, Part had no memory of \"talking to any friends [of petitioner] at all before or during trial.\"\n\nIt appears from the record that Part had no such memory for the simple reason that he did not in fact conduct any such interviews. In his declaration petitioner averred that \"I gave Mr. Part the names and addresses of my family.\" In their own declarations petitioner's mother and sister averred that no one--neither Part nor his investigator--interviewed them either before or during trial. Petitioner's mother confirmed this fact in her testimony at the evidentiary hearing. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e And again the People do not dispute this fact in their return.\n\nThe importance of the fact was emphasized at the evidentiary hearing by Attorney Charles Gessler, a criminal defense lawyer experienced in death penalty litigation who testified as an expert for petitioner. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Gessler explained that family members are so essential a source of information, especially in preparing a penalty defense, that \"I cannot conceive of a case where the attorney would not talk personally to at least the key family members\"--which he defined as always including the defendant's mother--\"even if they had already been screened by an investigator.\" Here, of course, petitioner's family members had not even been screened by Part's investigator.\n\n5. Part made no pretrial motions of any kind. The record is devoid of any pretrial motion initiated by Part. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\n6. Part relied on the prosecutor's case file as his sole source of facts and leads. After the prosecutor turned over his case file to him Part undertook no further discovery, relying instead on that file as his sole source of facts and leads. As the majority acknowledge (maj. opn., ante, p. 723), the referee found that Part thereby failed to discover a number of additional items of evidence of petitioner's chronic use of PCP. In In re Hall (1981) 30 Cal. 3d 408, 425 [179 Cal. Rptr. 223, 637 P.2d 690] we held that counsel's preparation for a murder trial was constitutionally inadequate in part because he relied on the state's investigation to provide him with facts and leads. We reasoned, \"Although the state and its representatives have no interest in convicting innocent persons, it would be unrealistic to assume that once charges have been levelled against a specific individual the police will search as zealously for exculpatory evidence as they will for information that might lead to conviction. The witnesses interviewed, the questions asked, and the leads pursued will all be unavoidably affected by the investigator's close relationship with the prosecution.\"\n\nThe case at bar illustrates this reality. Police Officer Richard Kellenberger was assigned to investigate the double murder and was one of the officers who interrogated petitioner after his arrest on that charge. At trial Kellenberger testified on cross-examination that when he asked petitioner where he and the Padua brothers were going when they began driving on the night in question, petitioner said, \"I don't know, man. We were so drunk.\" Kellenberger then testified, however, that he did not \"follow up\" petitioner's statement that he was drunk because he \"didn't feel it was important . . . .\" On redirect examination the prosecutor asked, \"In your investigation of this case, did you ever find any evidence that anyone was intoxicated?\" Kellenberger replied, \"No.\" On recross-examination Kellenberger candidly explained that he did not find evidence of intoxication because he did not look for any: when asked, \"what did you do\" to find out if any of the parties were drunk on the night of the crimes, Kellenberger said only that he \"drew a Conclusion\" from the observations of witnesses and the condition of the burned-out car. The following colloquy then put a quick end to the inquiry:\n\n\"Q [by Attorney Part] Did you ever ask the defendant how much he had to drink that night?\n\n\"A I didn't ask him. I spoke to the other two individuals.\n\n\"Q You knew that the other parties had been drinking and buying beer through the entire situation; is that correct?\n\n\"A Yes.\n\n\"Q At one point in a conversation the defendant told you that they were drunk; is that correct?\n\n\"A That's correct.\n\n\"Q Was that the entire investigation was [ sic ] just the Conclusion that you came to?\n\n\"A No, I wasn't investigating these individuals for being intoxicated.\n\n\"Mr. Part: Thank you. That's all I have.\" (Italics added.)\n\n7. Part took no steps to investigate a diminished capacity defense on any ground. A principal issue at the evidentiary hearing was whether Part investigated a diminished capacity defense based on PCP use. As the majority observe (maj. opn., ante, at p. 723), \"It is undisputed that Part failed to investigate this defense.\" Yet the referee found there was evidence of petitioner's chronic use of PCP that Part could have discovered with minimal investigation, as well as evidence that petitioner's PCP use may have been a factor in his commission of the offenses.\n\nNor did Part take any steps to investigate a diminished capacity defense based on alcohol intoxication. In his declaration filed in support of the petition for habeas corpus, petitioner averred that he told Part that he drank a number of beers before and during the commission of the offenses. Part did not dispute this fact in the declaration he filed in support of the return, and he admitted it in his testimony at the evidentiary hearing. As noted above, petitioner also told Officer Kellenberger during his interrogation that he did not know where he and the Padua brothers intended to go when they began driving because \"We were so drunk.\" As will appear, this statement was tape-recorded and Part apparently had listened to the tape. Despite this information Part failed to investigate a defense based on intoxication.\n\nIt is true that in his declaration Part averred that \"If Mr. Avena had informed me that he actually used PCP, I would have investigated this fact and made it a part of his diminished capacity defense, the same as I had done with his use of alcohol.\" (Italics added.) The emphasized averment, however, appears to be false: there is no showing that Part conducted any such investigation. He did not direct his investigator, for example, to interview petitioner's family or friends about a history of alcohol abuse by petitioner, or to locate any witnesses who could testify to petitioner's consumption of alcohol on the night in question (e.g., employees of liquor stores where petitioner or the Padua brothers bought beer that night). He did not seek any records that might reflect a history of alcohol abuse by petitioner. And he did not even talk to Victor Padua, who subsequently testified at trial that he and his brother and petitioner had drunk a number of beers before and during the commission of the offenses.\n\n8. Part did not seek the appointment of a medical expert to determine petitioner's mental condition at the time of the crimes. Evidence Code section 730 provides that before or during any trial, any counsel may move for the appointment of an expert to investigate any matter and to testify as an expert witness whenever it appears that \"expert evidence is or may be required\" by any party. Penal Code section 987.9 provides that in a capital trial of an indigent defendant, defense counsel may request the court for funds for the payment of experts \"for the preparation or presentation of the defense.\" Such experts may include, of course, psychiatrists or other mental health professionals. Under these provisions, defense counsel in capital cases commonly request a pretrial examination of their client by such an expert whenever there is reason to question the defendant's mental condition at the time of the crime. In his declaration petitioner averred that in his initial interview with Part \"I asked to see a 'shrink' but I never saw one.\" Part does not deny this fact in his own declaration. Indeed, it is undisputed that Part made no effort to obtain such an examination of petitioner; as noted above, he testified he did not even talk to any medical expert before trial about the possibility that petitioner's mental condition might have been relevant to either phase of the proceeding. Yet the facts known to Part should have suggested the relevance of that condition.\n\nThe same facts were strongly suggestive to informed witnesses at the evidentiary hearing. Thus Dr. Fred Rosenthal, a psychiatrist with broad expertise in the effects of long-term PCP use on behavior, \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e testified, after reviewing petitioner's conduct on the night in question, that \"this rather extreme irrational series of violent acts would be consistent with someone who is intoxicated with PCP.\" Similarly, Dr. Orm Aniline, another psychiatrist with extensive experience in diagnosing the effects of long-term PCP use on behavior, \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e testified that in his opinion petitioner was acting under the influence of PCP and that among the bases of his opinion was petitioner's \"overall behavior,\" including the fact that petitioner committed \"a senseless shooting with what I really think is a somewhat senseless attempt to obtain a car, and then seemingly to destroy it for what, again, was not a reason, I don't think, sufficient to cause a conflagration . . . .\" Attorney Howard Gillingham, another criminal defense lawyer experienced in death penalty litigation called as an expert witness for petitioner, \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e testified that he too would have been alerted to the possibility that substance abuse might have affected petitioner's mental condition by the fact that much of petitioner's behavior on the night in question was \"bizarre.\"\n\nIndeed, even the People characterize petitioner's behavior in such terms. In their return, the People describe petitioner's conduct as \"the absolutely senseless slaying of two totally innocent individuals for the purpose of an equally meaningless theft of a vehicle which was abandoned and burned shortly thereafter\" (italics added). No less bizarre, of course, was the last act of the scenario: instead of simply taking to his heels when a patrol car containing two armed police officers appeared on the scene, petitioner stood his ground and from a distance of some thirty-six feet single-handedly launched a fusillade of bullets at the police car, shooting out all its windows. That strange and extremely foolhardy behavior was suggestive of drugor alcohol-induced mental impairment even to a police officer who interrogated petitioner about the incident: Officer Warren Pickens testified that \"I asked him why in the hell he would fire 19 rounds out of a rifle at two policemen passing by; and I asked him if he was on drugs or drinking or what.\"\n\nDespite all these highly suggestive circumstances, Part made no effort to use the resources easily available to him to investigate petitioner's mental condition at the time.\n\n9. Part took no steps to investigate the voluntariness of petitioner's pretrial statement. Part knew that the police had made a tape recording of their interrogation of petitioner shortly after his arrest, and Part apparently had listened to the recording himself. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e As the People concede, nowhere in the recording do the police interrogators advise petitioner of his Miranda rights ( Miranda v. Arizona (1966) 384 U.S. 436 [16 L. Ed. 2d 694, 86 S. Ct. 1602, 10 A.L.R.3d 974] (hereafter Miranda)) and obtain an informed waiver of those rights. In addition, the recording was made surreptitiously, by means of a hidden microphone; its sound quality is inevitably poor, and many words and phrases--especially those uttered by petitioner, who did not know he was being recorded and apparently spoke in a subdued voice--are difficult to understand or wholly unintelligible. Despite these facts, Part did nothing to investigate the voluntariness of petitioner's statement before trial. Yet he evidently knew that the statement would be a crucial element of the case against his client: in his declaration Part asserted that \"I had hoped to keep the defendant's taped confession out of the trial,\" although he has not explained how he hoped to do so without adequate preparation. And his fears were realized: at trial the prosecution was allowed to call the interrogating police officers (1) to testify that they advised petitioner of his Miranda rights and obtained a waiver thereof before activating the hidden tape recorder, and (2) to give their testimonial version of the entire interrogation, filling in crucial gaps in petitioner's transcribed answers to their questions. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e The recording was played to the jury, and the prosecutor heavily relied on petitioner's statement in his closing argument. Indeed, the majority herein refer repeatedly to the statement as evidence of guilt so strong that petitioner cannot have been prejudiced by Part's constitutionally inadequate representation. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nThe majority rely on the fact that Part eventually did move--in the middle of trial--for a hearing on the admissibility of petitioner's interrogation under Evidence Code section 402 (hereafter the section 402 hearing). But the motion was too little, too late: Part had done nothing at all to prepare for that hearing. For example, Part had failed to enlist petitioner's aid in understanding the many unclear portions of the recording by listening to it with his client, or even allowing his client to hear it at all; petitioner did not hear the tape until it was played in the middle of trial. More important, Part also failed to retain the services of a forensic acoustics expert so that the recording could be professionally enhanced, analyzed, and transcribed; instead, Part contented himself with using an amateur transcription admittedly made by the very deputy district attorney who was prosecuting his client. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\n10. Part did not move before trial to suppress petitioner's statement on any ground. Part failed to make a timely motion to suppress petitioner's statement (Pen. Code, § 1538.5) for either of two violations of his constitutional rights under the Miranda decision. First, Part did not move to suppress on the ground that petitioner was not advised of those rights. As noted above, Part apparently had listened to the recording before trial and the People concede that nowhere in the recording do the police advise petitioner of his Miranda rights. Moreover, in his declaration petitioner averred that \"At the first time I saw Mr. Part at the jail, I told him I had been beaten up by the cops after my arrest. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e I also told him I had not been advised of my rights. He told me it would be hard to prove.\" (Italics added.) Part did not dispute this fact in his own declaration. Indeed, on this issue Part's declaration instead supports petitioner: Part declared that \"I had hoped to keep the defendant's taped confession out of the trial because of constitutional issues.\" (Italics added.) Those \"constitutional issues,\" of course, can only have been issues relating to the voluntariness of the statement.\n\nWhen Part requested the section 402 hearing in midtrial, he claimed petitioner had just informed him for the first time that the police had not advised him of his Miranda rights. Even if we accept as true Part's self-serving claim in this regard--as do the majority--it does not excuse his failure to determine before trial whether his client had been advised of those rights. The issue is not, when did petitioner tell him that he had not been so advised, but whether Part conducted a timely investigation of the matter as a step in his preparation for trial--especially since Part had listened to the recording and hence must have known that it was silent as to any such advice. Any competent criminal defense counsel would have conducted such an investigation and filed a pretrial motion to suppress on that ground.\n\nSecond, Part did not move before trial--or even at the section 402 hearing--to suppress petitioner's statement on an additional and distinct ground, i.e., that in the course of the interrogation but before making any incriminating admissions petitioner asserted his right not to talk to the police, but instead to remain silent. In his declaration petitioner averred that \"I had told Mr. Part about not being told about having a lawyer and I also told him that I told the cops that I did not want to talk about the whole thing.\" (Italics added.) Again Part did not dispute this fact in his own declaration. As will appear, moreover, the tape recording itself confirms that regardless of whether petitioner was advised of his Miranda rights, he attempted to cut off the questioning soon after the interrogation began.\n\nOfficer Kellenberger and Officer Ronald G. Fesperman conducted the interrogation. The interview room contained a hidden microphone, and the tape recorder to which it was connected was secreted in another room of the police station. Fesperman testified that when petitioner indicated early in the questioning that he did not want anything put in writing, he (Fesperman) promptly left the interview room, activated the tape recorder in the other room, and returned to the interview room. According to the transcription of the subsequent recording prepared by petitioner's expert, \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e when Fesperman reentered the room Kellenberger said he was \"just telling [petitioner]\" that \"the only thing that's going to help [him]\" is to tell \"[his] side of the story,\" but that the district attorney must \"be able to see it on paper.\" Fesperman then announced to petitioner, \"If you don't want anything written down, fine, we don't have to write anything down.\" At the same time, however, Fesperman winked at Kellenberger to let him know that the interrogation was nevertheless being secretly recorded.\n\nUnfortunately for his interrogators' plan, petitioner saw the wink. Immediately suspicious, he asked for an explanation; but because his limited knowledge of English apparently did not include the verb \"to wink,\" he asked Fesperman, \"how come you close the eye?\" FESPERMAN RESPONDED WITH A LIE: \" 'Cause I got a bad eye.\" KELLENBERGER THEN OFFERED ANOTHER LIE: attributing the wink to fatigue, he asked rhetorically, \"you know how long we been up?\" Apparently unconvinced by these hastily contrived excuses, petitioner asserted at that point that he no longer wished to talk to his interrogators: he told them, \"Don't want to talk about it,\" i.e., about the subject of the interrogation, which was his involvement in the crimes they were investigating. Petitioner then reinforced his point by telling the officers to \"Forget about it.\" Ignoring his wish, however, they pressed on. Kellenberger reiterated and expanded his false explanation of Fesperman's wink: \"You know how long we been awake man? 'Bout thirty six hours. You watch me, you're gonna see my eyes closing too.\" Unimpressed, petitioner repeated his wish to end the interview: \"Forget about it, man. I don't want to talk . . . .\" And after a brief pause petitioner concluded, \"It's over\"--an observation which, when taken in its context, most plausibly meant that as far as petitioner was concerned the interview was over. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nAgain the officers ignored petitioner's wish to stop talking to them. Their opening came when, after another pause, petitioner voiced thoughts of suicide. Seizing the opportunity to appear caring, the officers urged him not to consider taking his life: Kellenberger exhorted him, \"you don't want to do that, man . . . . ou gotta make the best out of it. You can't give up. Can't be a quitter, man.\" After this expression of ostensible concern for petitioner's well-being, the officers resumed their interrogation: Fesperman asked petitioner, \"Why do you think all of this happened, Jaime?\" When petitioner said, \"I was wrong that day,\" Kellenberger told him, \"The thing you gotta do now is sit down and say, okay, why did it go wrong, what happened?\" The officers then asked petitioner a long series of specific questions about his involvement in each of the events of the night of the crimes, and petitioner eventually made the incriminating admissions that were subsequently put before the jury and relied on here.\n\nAny competent criminal defense counsel would have challenged the admission of petitioner's statement on the ground thus exposed. Miranda itself spelled out the specific constitutional violation: \"Once warnings have been given, the subsequent procedure is clear. If the individual indicates in any manner, at any time prior to or during questioning, that he wishes to remain silent, the interrogation must cease. At this point he has shown that he intends to exercise his Fifth Amendment privilege; any statement taken after the person invokes his privilege cannot be other than the product of compulsion, subtle or otherwise. Without the right to cut off questioning, the setting of in-custody interrogation operates on the individual to overcome free choice in producing a statement after the privilege has been once invoked.\" (Miranda, (supra) , 384 U.S. 436, 473-474 [ 16 L. Ed. 2d 694, 723], italics added, fn. omitted.) In another leading case the high court quoted the foregoing passage and reemphasized its rule: \"The critical safeguard identified in the passage at issue is a person's 'right to cut off questioning.' [384 U.S.] at 474 [ 16 L. Ed. 2d at 723]. Through the exercise of his option to terminate questioning he can control the time at which questioning occurs, the subjects discussed, and the duration of the interrogation. The requirement that law enforcement authorities must respect a person's exercise of that option counteracts the coercive pressures of the custodial setting. We therefore conclude that the admissibility of statements obtained after the person in custody has decided to remain silent depends under Miranda on whether his 'right to cut off questioning' was 'scrupulously honored.' \" ( Michigan v. Mosley (1975) 423 U.S. 96, 103-104 [46 L. Ed. 2d 313, 321, 96 S. Ct. 321], fn. omitted.)\n\nIf Part failed to act because he did not know the foregoing well-settled rule, it is inexcusable. It is no less inexcusable if he failed to act because--as the record strongly suggests--he did not know the facts making that rule applicable here. And he did not know the facts because, as noted above, he failed to consult a forensic acoustics expert and obtain a professional transcription of the recording before trial; lacking that transcription and relying instead on the prosecutor's version, Part misheard petitioner's crucial assertion of his right to remain silent. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nThe trial record tells the story. Near the end of the section 402 hearing the tape recording was played for the court and counsel. Part observed that the recording was \"poor in quality\" and that he was using the transcription prepared by the prosecutor himself. Part then called the attention of court and counsel to the portion of the recording reproduced hereinabove (fn. 15, ante). In a misinformed attempt to show that in that portion of the recording his client asserted a different Miranda right--the right to the presence of an attorney (see 384 U.S. at pp. 469-473 [16 L. Ed. 2d at pp. 720-723])--Part focused on petitioner's response to Kellenberger's rhetorical question, \"you know how long we been up?\" According to Part, \"then the defendant supposedly says, 'I want to talk to my.' And then there's an unintelligible word. At least it is unintelligible because it is a dotted line here on this alleged transcription. I think that is important to the Court--and I understand that we have other things to do [ sic ]--to listen and see if you can find what that particular word is. Because I think that if the word is, 'I want to talk to my lawyer,' there might be a situation where the officers may not be able to question the defendant without allowing him an opportunity to talk to a lawyer.\" (Italics added.)\n\nPart's misunderstanding of what petitioner said was promptly confirmed by the transcription prepared by the prosecutor. The following colloquy ensued:\n\n\"THE COURT: What does the transcript indicate follows that phrase?\n\n\"Mr. Felker [the prosecutor]: Your Honor, the transcript is something that I did.\n\n\"THE COURT: Well, I understand that. I just want to know so if I'm going to listen again--\n\n\"Mr. Felker: There's an ellipsis after 'I want to talk to my . . .' and to my knowledge and recollection, there is nothing after that. There is no word.\"\n\nIn an effort to make some sense out of Part's suggestion, the trial Judge listened while the passage was replayed three times. The Judge then proposed her own version of the passage, saying that \"It sounds to me\" as if petitioner said merely, \"I want to talk.\" That version, of course, was far more favorable to the prosecution; not surprisingly, the prosecutor readily agreed to it, abandoning his own transcription of the statement (\"I want to talk to my. . . .\"). Yet the Judge was still uncertain, confessing that \"it's not clear enough for me to state as fact that that's what he says, . . .\" The Judge then listened to the passage twice more, but remained unable to hear any word after the word \"talk.\" Accordingly, the Judge concluded that \"I take it to mean when the officer returned and went through the part about, 'okay, if you don't want anything written down you don't need to have anything written down,' apparently gave a big wink [and] he almost blew it, as it were, at that point and caused the defendant to make some statement in there. I do not hear anything in there [after] the word 'talk,' however, and the word 'talk' sounds like the end of the sentence. I'm not going to supply words that cannot be heard.\"\n\nIf, before trial or even before the section 402 hearing, Part had consulted a forensic acoustics expert and obtained the professional transcription later obtained by appellate counsel, he would not have led the trial Judge--and the majority here--on this wild goose chase. Instead of mishearing petitioner's statement as \"I want to talk to my . . .\" and trying to establish that the missing word was \"lawyer,\" Part would have learned that what petitioner actually said was the totally different statement, \"Don't want to talk about it.\" That statement was complete in itself, and implicated the wholly different Miranda right of a suspect to \"cut off questioning.\" \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\n11. When the case came to trial, Part waived his client's constitutional right to appear before the jury in civilian clothes. During a recess in the jury selection process the trial Judge put on record the fact that at the outset of trial she had observed that petitioner was wearing jail clothes and had reminded Part that his client was entitled to be dressed in civilian clothes throughout the trial. Part then confirmed that he had told the Judge he wanted petitioner to be dressed in jail clothes as a \"trial tactic,\" but he did not disclose his \"tactic.\" Accordingly, throughout the trial petitioner appeared before the jury in jail garb.\n\nIn Estelle v. Williams (1976) 425 U.S. 501, 512 [48 L. Ed. 2d 126, 135, 96 S. Ct. 1691], the United States Supreme Court held that \"the State cannot, consistently with the Fourteenth Amendment, compel an accused to stand trial before a jury while dressed in identifiable prison clothes . . . .\" In People v. Taylor (1982) 31 Cal. 3d 488 [183 Cal. Rptr. 64, 645 P.2d 115] we applied that rule in a homicide case to reverse a conviction of voluntary manslaughter. In our unanimous opinion we explained that the foremost reason for the rule is that \"compelling a defendant to go to trial in jail clothing could impair the fundamental presumption of our system of criminal Justice that the defendant is innocent until proved guilty beyond a reasonable doubt.\" ( Id. at p. 494.) This is so because the sight of the defendant in jail clothing \"inexorably leads to speculation about the reason for defendant's custody status, which distracts the jury from attention to permissible factors relating to guilt. In most instances, parading the defendant before the jury in prison garb only serves to brand the defendant as someone less worthy of respect and credibility than others in the courtroom.\" (Ibid.) \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nWe went on to acknowledge that a defense counsel may nevertheless waive this right on behalf of his client, but we stressed that counsel may do so only \"for tactical reasons\" and that it will be a \"rare case\" IN WHICH THIS OCCURS: \"there may be instances where for tactical reasons the defendant may wish to be tried in jail garb. [Citations.] Recognizing that the defendant is entitled to be tried in ordinary clothing, an attorney may nevertheless decide, based on the peculiar circumstances of an individual case, not to exercise that right. In such a rare case, courts should be reluctant to interfere with that decision because an attorney may waive his client's rights as to matters involving trial tactics.\" ( People v. Taylor, (supra) , 31 Cal. 3d at p. 496.)\n\nThis is not such a \"rare case.\" Here the counsel appointed by this court to represent petitioner on his automatic appeal filed a declaration under penalty of perjury in support of the habeas corpus petition in which she averred that when she asked Part after trial why he required petitioner to wear jail clothes throughout the proceedings, he stated that he did so because \"You know how those Blacks and Mexicans are--they don't know how to dress right. They dress too loud and with the wrong colors and that would make things worse.\"\n\nSuch an explanation, of course, reflects attitudes of racial and ethnic stereotyping, prejudice, and disrespect that no counsel should harbor towards his client--or indeed towards anyone else. And in any event it is manifestly inadequate as a trial tactic: if any counsel has doubts about his client's judgment in choosing clothes appropriate to wear at trial, he has only to give him timely advice on the matter and, if necessary, assist him in obtaining the proper attire. It is a common practice for counsel to give such advice to their clients and even to their witnesses.\n\nIn his declaration Part denied that he made the foregoing reply to appellate counsel's inquiry, and proposed instead a different \"tactical reason,\" to wit, that he caused petitioner to wear jail clothes because \"I feel that this evokes some measure of sympathy for the defendant.\" In the abstract, this may be a permissible trial tactic. (See Estelle v. Williams, (supra) , 425 U.S. at p. 508 [48 L. Ed. 2d at p. 133].) But in the case at bar the explanation is unpersuasive for two reasons.\n\nFirst, Part does not allege--and the record does not show--that in waiving petitioner's constitutional right to wear civilian clothes at trial Part ever consulted with his client on the issue, i.e., that he ever informed petitioner of his options, explained their pro's and con's, and obtained his agreement to the proposed tactic. It is true that counsel may waive a client's rights as to many matters of trial tactics, but he may not do so if the tactic would deprive the defendant of certain rights deemed fundamental. ( People v. Williams (1970) 2 Cal. 3d 894, 905 [88 Cal. Rptr. 208, 471 P.2d 1008].) For example, counsel generally has sole discretion in deciding whether to call certain witnesses (ibid.), but he cannot waive his client's right to testify in his own defense ( People v. Robles (1970) 2 Cal. 3d 205, 214-215 [85 Cal. Rptr. 166, 466 P.2d 710]). The right here in question falls somewhere between those two extremes.\n\nWe need not decide whether the right is sufficiently fundamental to require the client's informed consent to waiver, however, because Part's purported waiver in the case at bar is invalid on another ground: it was apparently a blanket waiver for all his clients, regardless of their individual circumstances. Thus in his declaration Part sought to justify his waiver of this right on the ground that \"It has been my belief, tactic, and custom that I would rather have a defendant appear in jail clothes than in civilian clothes.\" (Italics added.) But it is improper for a defense counsel to decide this issue as a generalized matter of \"belief, tactic, and custom.\" As noted above, we have made clear that a defense counsel may decide to waive his client's right to appear in civilian clothes only when the decision is \"based on the peculiar circumstances of an individual case\" ( People v. Taylor, (supra) , 31 Cal. 3d at p. 496).\n\nThe second reason why Part's posttrial explanation of this waiver is unpersuasive is because it is totally inconsistent with the trial record. In his posttrial declaration Part claimed that he caused petitioner to wear jail clothes because it evoked \"sympathy\" for his client from the jury. At trial, however, Part had told the jury a very different story. As will appear in more detail below, Part had repeatedly told the jurors in oral argument that they should have no sympathy for petitioner: thus he said, for example, that \"nobody in the world has any sympathy for a murderer. I don't have any sympathy for a murderer. And I don't think you should, too.\" Either Part's posttrial explanation for the waiver is false, or this is another example of his confused thinking about how to conduct petitioner's defense. (See fn. 11, ante.)\n\n12. At trial, Part waived the right to make an opening statement to the jury. The record so states.\n\n13. At the guilt phase, Part did not call any witnesses or introduce any evidence. The silence of the record speaks for itself. In addition, near the end of the trial Part made a \"statement for the record\" seeking to justify his failure to put on a defense at the guilt phase by stressing the strength of the prosecution's case. In that statement Part said he had been \"surprised\" when the prosecution called Victor Padua as a witness. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e The other highly damaging piece of evidence against petitioner, according to Part, was \"a complete tape recorded confession.\" Of course, if Part had engaged in his own discovery rather than relying on the prosecutor's case file, he might not have been \"surprised\" when Padua was called as the lead-off witness; and if Part had made timely and informed motions to suppress petitioner's statement, he might not have had to reckon with its damaging effect on the jury--and on the majority of this court. At the evidentiary hearing Part testified that he put on no defense at the guilt phase because he was saving his effort and credibility for the penalty phase; as will appear, however, Part put on no defense in mitigation at the penalty phase either.\n\n14. In his argument to the jury on the guilt phase, Part conceded that his client was guilty beyond a reasonable doubt of both counts of first degree murder, of the robbery count, and of both special circumstances alleged on each count of murder. In his opening argument to the jury the prosecutor contended that he had sustained his burden of proving that petitioner was guilty beyond a reasonable doubt of committing two counts of first degree murder against Manuel Solis and Miguel Vasquez, the occupants of the pink Chevrolet Camaro seized by petitioner and the Padua brothers; that in taking that vehicle by deadly force petitioner was also guilty beyond a reasonable doubt of committing first degree robbery against Solis, its driver; and that the two special circumstances alleged on each murder count--multiple murder and robbery murder--were also true beyond a reasonable doubt.\n\nThe prosecutor then urged the jury to infer from the evidence of the murders that petitioner intended to kill--not just to scare--all six people he fired at on the night of the crimes--not only Solis and Vasquez, but also the four victims of the lesser counts of assault with intent to commit murder. The prosecutor concluded by remarking, \"I have no idea what Mr. Part will say about the defendant's intent or about this case when he stands up, ladies and gentlemen. I'm very curious. I'm very curious to see what he does say because for the life of me I can't see anything in this case that would seem to indicate anything but that the defendant has committed all the crimes charged in the matter before the Court.\"\n\nWhen Part rose to give his argument, what he said--and more important, what he did not say--confirmed the prosecutor's view of the evidence on all the counts that mattered. Part began by telling the jurors that \"I originally thought when this particular case went on, that probably nothing would be gained by me getting up here and talking to you. You'd probably have the same result if I got up here and said something or I didn't. I figured, well, just get up here and save a little bit of time, and I'll waive my opening argument, and we'll get on with the instructions, and you can go back to the jury room and deliberate.\"\n\nPart next told the jury that he decided to make an argument after all because he did not believe the prosecution had proved that petitioner was guilty beyond a reasonable doubt on all the counts. Part then revealed, however, that he was concerned only with the assault counts, saying that he would not challenge the prosecution's case on the \"serious\" counts of murder and robbery, but only on the \"not so serious\" COUNTS: \"I'm going to talk about things that are really not so serious. I'm not going to talk about the murder. I'm not going to talk about the robbery. I'm going to talk about the assaults with intent to commit murder.\n\n\"You can say to yourself, well, what's he getting up here and talking to us about that for? I mean, we're talking about serious things here. We're talking about dead people, we're talking about murders, we're talking about special circumstances, we're talking about life without possibility of parole or death perhaps.\n\n\"Why does he want to talk about [Penal Code section] 217's, assaults with intent to commit murder? And the answer is because that's my job.\"\n\nAs Part conceived of his \"job,\" it was only to address the counts that he personally believed the prosecution had not proved beyond a reasonable doubt, i.e., the assault counts, \"Even though what I'm talking about is at the bottom of the ladder, not much when we're talking about [the counts] at the top of the ladder.\" And that is all that Part proceeded to do: in the remainder of his argument he briefly reviewed the evidence of the four assaults and urged that when petitioner fired at the victim of each of those assaults he did not intend to kill but only to scare, and hence was guilty at most of assault with a deadly weapon.\n\nIn so doing, however, Part not only conceded by negative implication that the prosecution had made its case beyond a reasonable doubt on the murder and robbery counts and the special circumstance allegations, he affirmatively suggested as much to the jury. Thus he began by saying, \"Now, when I got up there and I talk about this, I'm talking about a search for the truth and Justice, and that might sound funny coming out of my mouth after what you heard as to what the defendant allegedly did in this particular situation.\" (Italics added.) Part then raised the subject of petitioner's pretrial statement to the police, telling the jury: \"Now, here is the defendant on tape. All right. The tape is right in front of you, literally confessing to shooting down a couple of people [ in ] cold-blood [] on the streets in Los Angeles County.\" (Italics added.) Again and again Part conceded that his argument \"sounds silly\" because he was ignoring the prosecution's evidence on the \"serious\" counts against his client. \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e And Part concluded his argument by reiterating that \"I am not going to get up here and I am not going to talk to you about the other counts [i.e., murder and robbery] because I am sure you have them firmly in mind.\" (Italics added.)\n\nTaking swift advantage of Part's express and implied concessions, the prosecutor began his rebuttal argument by emphasizing what was clearly no longer in issue: \"Ladies and gentlemen, I don't disagree with Mr. Part in many respects. . . . s to the murder counts and the special circumstance allegations, I think it is clear at this point not only from the evidence, but from the argument or lack thereof that in fact the defendant is guilty of the first two counts and the special circumstances.\" (Italics added.) Not surprisingly, the jury apparently had no difficulty in convicting petitioner on the conceded murder and robbery counts and in finding true the special circumstance allegations of multiple murder and robbery murder. \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\n\"There can be no doubt that closing argument for the defense is a basic element of the adversary factfinding process in a criminal trial.\" ( Herring v. New York (1975) 422 U.S. 853, 858 [45 L. Ed. 2d 593, 598, 95 S. Ct. 2550].) In holding unconstitutional a state law that allowed Judges in nonjury criminal trials to deny counsel the opportunity to make a final summation, the high court explained: \"It can hardly be questioned that closing argument serves to sharpen and clarify the issues for resolution by the trier of fact in a criminal case. For it is only after all the evidence is in that counsel for the parties are in a position to present their respective versions of the case as a whole. Only then can they argue the inferences to be drawn from all the testimony, and point out the weaknesses of their adversaries' positions. And for the defense, closing argument is the last clear chance to persuade the trier of fact that there may be reasonable doubt of the defendant's guilt. [Citation.]\n\n\"The very premise of our adversary system of criminal Justice is that partisan advocacy on both sides of a case will best promote the ultimate objective that the guilty be convicted and the innocent go free. In a criminal trial, which is in the end basically a factfinding process, no aspect of such advocacy could be more important than the opportunity finally to marshal the evidence for each side before submission of the case to judgment.\" (422 U.S. at p. 862 [45 L. Ed. 2d at p. 600], italics added.)\n\nWhen, as here, defense counsel takes this important opportunity to address the trier of fact but uses it to concede his client's guilt beyond a reasonable doubt, the adversarial process has clearly been perverted. As will appear (pt. III, post), recent federal and state decisions hold that such an argument to the jury falls below the standard of competent representation.\n\n15. At the penalty phase, Part put on no evidence in mitigation. As the majority acknowledge (maj. opn., ante, p. 706), \"Part called only two minor witnesses at the penalty phase of the trial.\" Both testified in connection with the stabbing death of Ruben Alfaro at the Los Angeles County jail on September 15, 1981. One such witness, Deputy Sheriff Bauder, testified that two days before the stabbing he heard a disturbance in a large dayroom in the jail and petitioner asked to be let out. The witness saw three shallow, abrasion-like marks on petitioner's body, and asked what had happened. Petitioner replied that \"some Black guy\" had tried to stab him, but could not identify anyone. There were 80 or 90 inmates in the day room at the time, but no one had seen anything.\n\nIn his declaration filed with the return, Part stresses that his witness thus \"testified to the fact that Mr. Avena had been attacked prior to the killing.\" But if this testimony was intended to support a theory that petitioner stabbed Alfaro in self-defense, it was plainly inadequate to the task: Alfaro was not a \"Black guy\" but a Mexican-American, as Part acknowledged in his argument to the jury. Indeed, in an attempt to salvage the situation Part went so far as to argue that his client was lying when he told the deputy sheriff that his assailant was a \"Black guy\": thus Part said to the jury, \"it wasn't a Black guy, but [petitioner] wasn't about to identify anybody.\" The jury cannot have been much impressed with such self-impeached testimony.\n\nPart's only other witness at the penalty phase was Deputy Sheriff Baylis, who testified that he saw inmate Gonzalez running from the scene of the Alfaro stabbing and found a long, bloody \"shank\" that Gonzalez admitted was his. The witness then testified that when he came upon Alfaro lying bleeding on the floor, he noticed another, shorter shank nearby. In his argument to the jury Part stressed that the latter was not the shank that petitioner used to stab Alfaro, which was also short but had been differently described by prosecution witnesses. But if this testimony--implying that there was a third shank at the scene--was intended to support a theory that petitioner stabbed Alfaro in self-defense, it was again inadequate. Baylis testified that when he saw the shank it was lying on the floor some two feet from Alfaro, that he never saw the shank on Alfaro's person or saw Alfaro touch it, and that he did not know where it came from. The deputy sheriff who actually witnessed the stabbing take place, moreover, testified that he never saw Alfaro stab at petitioner or even possess a shank. On this state of the evidence Part was reduced to arguing to the jury, \"You will never know who pulled the first knife. You will never know what happened. You can infer anything and speculate as to what you want.\" Part offered the jury two such speculations: i.e., that petitioner or Gonzalez brought the third shank to the scene and left it there to make it look like self-defense, or that Alfaro was carrying the third shank and attacked petitioner with it first. There are, however, other equally possible scenarios: e.g., that when the altercation drew the attention of the deputy sheriffs on duty, one of the numerous other inmates at the scene discarded the shank to avoid being found with it in his possession. \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e Again the testimony offered by Part was of little value.\n\nNo competent counsel, by contrast, would have relied solely on his client's jailers to make his case that the defendant killed a fellow inmate in self-defense; rather, competent counsel would have done the necessary investigation to identify and locate inmate eyewitnesses to the incident, and would then have interviewed them to determine if any had seen how the fight began and whether the victim was in fact the aggressor. In the case at bar petitioner averred in his declaration that \"After the incident in the jail where Alfaro was killed I gave Mr. Part the names of people in the jail who were inmates who saw what happened. He told me he was not being paid to investigate that case.\" \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e Part did not dispute this fact in his own declaration. Instead, Part asserted only that it was his \"trial tactic\" not to call \"any of the inmates who may have been minor witnesses to the stabbing death attributed to the defendant.\" He has not explained why these witnesses would have been \"minor\" or how this \"trial tactic\" benefited his client.\n\nSuch witnesses, moreover, were available. Roger F. Potash, the attorney appointed as Part's successor to defend petitioner in the Alfaro case, filed a declaration in which he averred that while preparing for the trial of that case he was provided with \"defense witness information\" by petitioner, and that both he (Potash) and his investigator interviewed the witnesses thus identified by petitioner and \"they established a self-defense for Mr. Avena.\" (Each of these witnesses also stated that no one had interviewed them in connection with the case at bar.) The record now contains four declarations, filed under seal, in which these witnesses aver that they were inmates of the Los Angeles County jail at the time of the death of Alfaro, that they were present at the scene of the incident, and that they saw Alfaro attack petitioner with a shank. Although their testimony would likely have been subject to impeachment on the ground of prior felony convictions, competent counsel could have helped the jury to understand that if witnesses to an event inside a jail are not jailers they must be inmates, and that the jury should not reject their testimony simply because of their status.\n\nAs the majority acknowledge (maj. opn., ante, at p. 734), \"Evidence that petitioner killed Alfaro doubtlessly comprised potent aggravating evidence at trial.\" The prosecutor certainly made the most of it in his closing argument. Because of Part's failure or refusal to follow the leads that his client provided him, however, the jury in effect heard only one side of the story.\n\nEven more egregious was Part's failure to call as witnesses any of petitioner's family or friends to help the jury understand his background and character. Part has offered only one excuse for this failure, and it is unpersuasive.\n\nIn his \"statement for the record\" near the end of the trial Part told the court that he did not call any family members because \"there had been some juvenile problems where he allegedly had attacked his father with a chair and went to camp after the petition was sustained. In fact, his father was instrumental in having him arrested.\" That such was in fact Part's motivation was confirmed at the evidentiary hearing on the habeas corpus petition, when Part again testified that he did not call any family members at the penalty phase solely because of the incident in which petitioner threatened or struck his father with a chair and the latter reported him to the juvenile authorities.\n\nIf Part had taken even the most minimal investigatory step of interviewing petitioner's mother before trial, however, he would have learned what actually happened in the \"chair incident\"--and more important, he would have learned that the incident was not aggravating evidence but mitigating evidence. This is because petitioner was not the assailant, as Part seemed to believe; rather, it was petitioner's father who assaulted petitioner's mother with the chair, and petitioner intervened to protect her. Thus in her declaration filed in support of the habeas corpus petition, petitioner's mother averred that \"Concerning the 'chair incident,' the following took place: My husband, Edwardo Avena, and I had been separated for about five years at that time. However, occasionally he would come over to visit. On that occasion he became very hostile and we argued. Very often he became quite nasty when he was drinking. Edwardo picked up a chair and was advancing toward me with it when Carlos [i.e., petitioner] intervened, took the chair away from him, and calmed him down. Edwardo became angry at Carlos because it hurt his macho image to have his son take the chair away from him.\" Part did not dispute these facts in his own declaration, and the People do not dispute them in the return.\n\nAny competent criminal defense counsel, moreover, would have developed and introduced additional evidence in mitigation at the penalty phase. Thus both Attorneys Howard Gillingham and Charles Gessler, appearing at the evidentiary hearing as expert witnesses, testified that the evidence of petitioner's chronic PCP use, viewed in the light of his background and character, might well have been considered a mitigating factor by the jury. As evidence of background and character, Gillingham pointed to the facts that petitioner arrived in this country from Mexico at the age of 11, not speaking English, and settled in a low-income neighborhood of Los Angeles where gang activity was common and there was much peer pressure to use alcohol and drugs, and where PCP was the drug of choice. In turn, Gessler stressed that petitioner's father had a long history of alcoholism and of physically abusing his wife and children, and that petitioner was protective of his family members, both from his father's abuse and from the risks of the streets. For this reason Gessler was of the opinion that the \"chair incident\" was mitigating rather than aggravating. And Gessler summarized the steps that competent counsel would take in these circumstances: \"in order to show this client was not the worst of the worst deserving of the death penalty you have to show what his life was like as a youngster, forces beyond his control which led him into the narcotics abuse which apparently played a part in this particular crime.\"\n\nThe referee found this testimony persuasive, reciting in his findings of fact that \"Petitioner presented credible evidence that he was raised in a home with an alcoholic father who physically abused the petitioner and petitioner's mother. The family was poor and petitioner was handicapped by his limited ability to speak English. In addition, the petitioner grew up in a neighborhood where gangs and drugs were prevalent. There was expert testimony regarding the potentially violent and lasting effects of long term PCP usage. As previously indicated, there was evidence available that petitioner was such a user of PCP.\"\n\nPart, however, failed to introduce this evidence--or any other mitigating evidence--at the penalty phase.\n\n16. In his argument to the jury on the penalty phase, Part urged the jury to have no sympathy for his client and to spare his life simply because some murderers are even worse. In his opening argument on the penalty phase the prosecutor reminded the jury that \"You have heard absolutely nothing in this trial\" in the way of mitigating evidence of petitioner's background and character. Indeed, said the prosecutor, \"You haven't even heard anything that would seem to indicate that the defendant is in fact a human being like you and I [ sic ].\" Next the prosecutor argued that petitioner was even worse than an animal, because an animal kills only for a reason but petitioner killed for no reason at all. The prosecutor then advised the jurors that the court would instruct them that if they find the aggravating factors outweigh the mitigating factors they shall impose a sentence of death, and shall impose a sentence of life imprisonment without possibility of parole if they find the mitigating factors outweigh the aggravating factors. With that preamble, the prosecutor repeatedly emphasized that the defense had introduced \"no mitigation whatsoever.\" \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nBecause of his failure to develop and present such evidence, of course, Part was unable to construct a contrary argument, i.e., that the mitigating evidence outweighed the aggravating evidence. Later in his presentation he did make a modest reference to some of the statutory factors in mitigation (Pen. Code, § 190.3), but promptly undermined most of their significance. Thus Part noted there was no evidence of prior felony convictions. Referring to the question whether the crimes were committed \"under the influence of extreme mental or emotional disturbance\" (id., factor (d)), he remarked that petitioner told the police that his \"wife\" was in the hospital on the night of the crimes. \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e Part immediately conceded, however, that that \"doesn't give anybody a license to commit a crime because they are having a problem . . . .\" Part then noted that petitioner was 19 years old at the time of the crimes--but again immediately argued, \"Just because a person might be 19 years old at the time of an occurrence of a crime does not give them a license to commit a crime. Doesn't give them a shield to hide behind and say, 'Well, I committed that murder, but I was 19 years old, folks. That's when I was 19 years old.' \" The prosecutor could not have said it better.\n\nNext, referring to the question whether at the time of the crimes petitioner's mental capacity was impaired by \"the effects of intoxication\" (Pen. Code, § 190.3, factor (h)), Part observed that \"there had been some drinking going on\" during the evening. But he quickly conceded there was no evidence that petitioner \"was sensationally drunk. I mean, he could walk around and all these kinds of things. He appeared to be not falling down drunk or anything like that.\" \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e Part then argued briefly that the crimes did not show criminal sophistication or professionalism on petitioner's behalf. Finally Part reached the question of the circumstances of the crimes. As to the uncharged offenses, Part said only--and cryptically--that they were \"situational\" events. As to the crimes of which his client was convicted, Part told the jury that \"That is not a legal excuse for the crime. Now, we are talking about the first two people [i.e., Solis and Vasquez, the murder and robbery victims]. Of course, there's no legal cause or excuse. You just can't gun down two people in Los Angeles to get a car to ride home in.\" Again, the prosecutor could not have said it better.\n\nThe main body of Part's argument, however, was even more bizarre--and even more favorable to the prosecution. At this late date there is no mystery about the duties of defense counsel at the penalty phase of a capital trial. The general principle, of course, is that \"in capital cases the fundamental respect for humanity underlying the Eighth Amendment [citation] requires consideration of the character and record of the individual offender and the circumstances of the particular offense as a constitutionally indispensable part of the process of inflicting the penalty of death.\" ( Woodson v. North Carolina (1976) 428 U.S. 280, 304 [49 L. Ed. 2d 944, 961, 96 S. Ct. 2978] (plur. opn. of Stewart, J., Powell, J., and Stevens, J.).) The principle has been applied in many cases and by many practitioners, and that experience has been summed up in a much-cited scholarly article. (Goodpaster, The Trial for Life: Effective Assistance of Counsel in Death Penalty Cases (1983) 58 N.Y.U. L.Rev. 299 (hereafter Goodpaster).) Professor Goodpaster states the general rule that \"To ensure a meaningful penalty hearing in capital cases, it is essential that the client be presented to the sentencer as a human being.\" ( Id. at p. 321, italics added and fn. omitted.) He then explains how this principle should be put into practice, listing specific ways in which counsel can meet his burden of persuading the jury that the defendant should be allowed to live. Two of those methods are relevant here.\n\nFirst and foremost, \"counsel must portray the defendant as a human being with positive qualities. The prosecution will have selectively presented the Judge or jury with evidence of defendant's criminal side, portraying him as evil and inhuman, perhaps monstrous. Defense counsel must make use of the fact that few people are thoroughly and one-sidedly evil. Every individual possesses some good qualities and has performed some kind deeds. Defense counsel must, therefore, by presenting positive evidence of the defendant's character and acts, attempt to convince the sentencer that the defendant has redeeming qualities. A true advocate cannot permit a capital case to go to the sentencer on the prosecution's one-sided portrayal alone and claim to be rendering effective assistance.\" (Goodpaster, (supra) , 58 N.Y.U. L.Rev. at p. 335, italics added and fns. omitted.)\n\nSecond, \"the defense must attempt to show that the defendant's capital crimes are humanly understandable in light of his past history and the unique circumstances affecting his formative development, that he is not solely responsible for what he is. . . . Counsel's demonstration that upbringing and other formative influences may have distorted the defendant's personality or led to his criminal behavior may spark in the sentencer the perspective or compassion conducive to mercy. Thus, effective assistance of counsel in such circumstances entails at a minimum the attempt to gather and present at least some evidence of the defendant's background which might serve to explain the defendant's crimes and elicit a compassionate response from the sentencer.\" (Goodpaster, (supra) , 58 N.Y.U. L.Rev. at pp. 335-336, italics added and fn. omitted.)\n\nYet rather than portraying petitioner as a human being with at least some redeeming quality, rather than urging that his background and upbringing would justify at least some degree of mercy or compassion, Part in effect argued the opposite: he made three points, and all were ultimately adverse to his client.\n\nFirst, as we have often recognized, in arguing the issue of penalty counsel may urge the jurors to consider any lingering doubts they may have on the issue of guilt. (See, e.g., People v. Johnson (1992) 3 Cal. 4th 1183, 1259-1260 [14 Cal. Rptr. 2d 702, 842 P.2d 1], and cases cited (conc. opn. of Mosk, J.).) The seminal case for this rule is People v. Terry (1964) 61 Cal. 2d 137, 145-146 [37 Cal. Rptr. 605, 390 P.2d 381], in which Justice Tobriner, writing for the court, agreed that \"a jury which determines both guilt and penalty may properly conclude that the prosecution has discharged its burden of proving defendant's guilt beyond a reasonable doubt but . . . it may still demand a greater degree of certainty of guilt for the imposition of the death penalty.\" Justice Tobriner reasoned that \"The jury's task, like the historian's, must be to discover and evaluate events that have faded into the past, and no human mind can perform that function with certainty. Judges and juries must time and again reach decisions that are not free from doubt; only the most fatuous would claim the adjudication of guilt to be infallible. The lingering doubts of jurors in the guilt phase may well cast their shadows into the penalty phase and in some measure affect the nature of the punishment.\" ( Id. at p. 146, italics added.)\n\nIn the case at bar, however, if the penalty jurors had any lingering doubt about petitioner's guilt of the crimes charged, Part quickly lifted it from their minds: he began his penalty argument by telling the jurors that their verdict on the guilt phase \"was the only verdict you could have brought back. I believe that the evidence here was overwhelming as far as the defendant's participation in the two murders on the night in question. No question about it. Beyond a reasonable doubt. Beyond any doubt.\" (Italics added.)\n\nPart evidently did not volunteer his opinion on the guilt verdict for the purpose of ingratiating himself with the jurors in order to elicit some compassion for petitioner, because he thereafter repeatedly urged them to have no sympathy for his client. He began planting the seeds of this attitude as early as his argument on the guilt phase. \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e His view on the point was most forcefully expressed, however, in his penalty phase argument. As noted above, Part told the penalty jury that \"nobody in the world has any sympathy for a murderer. I don't have any sympathy for a murderer. And I don't think you should, too. I am not sitting here, I am not pointing at Mr. Avena [ and ] saying have sympathy for him. I don't want you to discuss this matter on sympathy because I think when you talk about sympathy and sorrow, you know you shouldn't think about the defendant. I'm sorry for the people who lost their lives. And I am sorry for their families.\" (Italics added.) The prosecutor could not have said it better.\n\nPart next gave his argument a personal turn, assuring the jurors that \"Just because I am a defense attorney, it doesn't mean that I sit here with the tears rolling out of my eyes and I am a person who looks to the rights of the defendant, so on and so forth.\" Rather, he declared, \"I am as law enforcement-minded as anybody in this jury. And I am probably even more, even though I am a defense lawyer. I believe in the death penalty for a proper case and I vote for it every time it comes up in the ballot.\" In urging the jurors not to decide \"on passion\" what is a proper case for the death penalty, Part told them that as a matter of emotion \"you can't like the defendant. There is no way in the world you can like him or any other person who goes out in the streets of Los Angeles and kills somebody.\" (Italics added.)\n\nFinally, lest the jury had somehow missed the point Part drove it home in his rebuttal argument. The prosecutor had stressed several more times that the defense had put on no evidence in mitigation, no excuses for petitioner's conduct. Responding, Part agreed that \"There's no excuse for killing somebody except if you are a police officer or in self-defense or so on and so forth. He doesn't have any excuses. He's a bad person. There's no question about that. I submit that. I am not going to argue his good points. I am not trying to say, 'Well, look. He's good to his mother. He had a job,' whatever it might be. I never said anything like that. I understand the defendant that I have here. He doesn't come up here with a good reputation or a lot of kindness or whatever that might be. He doesn't have those things. He's a person that you can't like.\" (Italics added.) Again, the prosecutor could not have said it better.\n\nHaving stripped his client of all vestiges of his humanity in the eyes of the jurors, having deprived him of any chance of stirring their compassion or deserving their mercy, Part was then reduced to arguing that the jury should spare petitioner simply because some murderers are even worse.\n\nThus Part told the jury that he personally did not believe that the death penalty was a deterrent, and that in his opinion the reason why the Legislature enacted the penalty was to satisfy the public's desire for vengeance in a few extreme cases: he stated that most murderers are not given the death penalty, but \"There are such crimes that are so heinous, that are so terrible, that are so bad, that the public vengeance cries out for it. That's the reason, folks.\" Part proceeded to list a handful of murderers whose crimes were \"so revolting\" and \"so nauseating\" that in his opinion they qualified as proper cases for the death penalty: he referred the jury to \"Charles Manson, a fiend,\" to Kenneth Bianchi, known as \"the Hillside Strangler,\" to William Bonin, known as \"the Freeway Killer,\" and to Ricardo Sanders, perpetrator of the \"Bob's Big Boy murders\" ( People v. Sanders (1995) 11 Cal. 4th 475, 497 [46 Cal. Rptr. 2d 751, 905 P.2d 420]).\n\nPart then compared petitioner to such infamous murderers, arguing that his client was not as bad as they: he was not, Part told the jury, a depraved maniac stalking the streets of Los Angeles, nor a serial killer satisfying strange fetishes, nor a professional robber determined to eliminate his victims in cold blood. \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e Part also argued that petitioner could easily have killed Ana Hernandez when he attempted to commandeer her car at the end of the evening, but he did not; and that although he thereafter attacked the investigating police officers and shot out all the windows of their patrol car, \"Nobody got hurt.\" In Conclusion, and after further reviewing the evidence, Part said of his client once again, \" He doesn't deserve your sympathy, and he doesn't deserve a break, and you don't have to like him, and I don't know how you can, but just because of those particular factors, this case does not rise\" to the level that would justify the jury's imposing the death penalty on petitioner. (Italics added.)\n\nThe premise of Part's argument, of course, was dubious on its face: it is a matter of common knowledge--and the jurors must therefore have been aware--that in California the death penalty is not in fact reserved for serial killers and mass murderers, but is often imposed on defendants whose level of criminality is far lower than theirs--indeed, is lower than petitioner's. And the Conclusion that Part sought to draw from his premise was vulnerable to precisely the response that it elicited from the prosecutor. The prosecutor first pointed out the obvious--\"There's always somebody worse\" than the defendant on trial. Then, in a rebuttal that the jury could well have found persuasive, the prosecutor argued:\n\n\"He holds up Charles Manson in front of you and says my man isn't as bad as Mr. Manson. My man isn't as bad as this man who fired-- . . . I don't know how many rounds were fired at Bob's Big Boy. My man isn't that bad.\n\n\"\n\n\"I would imagine if Mr. Part was defending the person in Bob's Big Boy, he would allude [to] Juan Corona. \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e If he was defending Juan Corona--like I said, maybe he would allude to Rasputin or the devil himself.\"\n\nIn short, far from giving the jury a convincing reason to show his client at least some degree of mercy, Part's argument (1) relieved the jurors of any lingering doubt they may have had about petitioner's guilt, (2) repeatedly called him a \"bad person\" without any redeeming quality and exhorted the jury to have no sympathy for him, and (3) urged them to spare his life simply because some murderers are worse. As I said of a similarly bizarre performance in People v. Jackson (1980) 28 Cal. 3d 264, 336 [168 Cal. Rptr. 603, 618 P.2d 149] (dis. opn. of Mosk, J.), \"on this record he would probably have had a better chance of receiving a sentence of life imprisonment without possibility of parole if his counsel had made no argument at all.\"\n\nII. PETITIONER IS ENTITLED TO RELIEF UNDER STRICKLAND V. WASHINGTON\n\nUnder the rule of Strickland v. Washington (1984) 466 U.S. 668 [80 L. Ed. 2d 674, 104 S. Ct. 2052] (hereafter Strickland), a defendant seeking to overturn a judgment of conviction because of constitutionally ineffective assistance of counsel in violation of the Sixth Amendment to the United States Constitution must make two showings. First, the defendant must show that \"counsel's representation fell below an objective standard of reasonableness . . . under prevailing professional norms.\" ( Id. at p. 688 [80 L. Ed. 2d at p. 693].) Second, he must show that counsel's deficient conduct resulted in prejudice to the defense. ( Id. at p. 692 [80 L. Ed. 2d at p. 696].) To do so, however, he need not show that it is \"more likely than not\" that counsel's deficient conduct affected the outcome of the case. ( Id. at p. 693 [80 L. Ed. 2d at p. 697].) Rather, he need show only a \"reasonable probability\" that counsel's deficient conduct affected the outcome ( id. at p. 694 [80 L. Ed. 2d at p. 698]), and in this context \"reasonable probability\" means a probability \"sufficient to undermine confidence in\" the outcome. (Ibid.) \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nThe majority either concede or assume arguendo that Part's deficient acts and omissions fell below the standard of reasonable attorney conduct. For the reasons stated in part I of this opinion, I would squarely hold that Part's acts and omissions discussed herein did fall below that standard.\n\nThe majority then hold, however, that petitioner suffered no prejudice from Part's deficient acts and omissions. They achieve this result by the device of viewing each of Part's deficient acts and omissions in isolation. They proceed to find, on one ground or another, no reasonable probability that each such act or omission affected the outcome of the trial. And they conclude that petitioner is entitled to no relief. Quod erat demonstrandum.\n\nIn my view the majority's divide-and-conquer device trivializes the great guaranty of the Sixth Amendment that every person accused of crime shall enjoy the right \"to have the assistance of counsel for his defense.\" When in the course of a trial defense counsel commits not just one but many professional errors, as here, the constitutional guaranty is not satisfied merely because a reviewing court is unable to identify one of those errors as being so serious that it is probable that it alone changed the outcome. Rather, if the effect of all of counsel's professional errors, taken cumulatively, was to deny his client a fair trial, the defendant has not had the \"assistance\" of counsel \"for his defense\" as guaranteed by the Constitution. This is so because the purpose of the guaranty is not simply to ensure that counsel commits no single error of prejudicial dimensions; \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e the purpose, more broadly, \"is to ensure that a defendant has the assistance necessary to justify reliance on the outcome of the proceeding.\" (Strickland, (supra) , 466 U.S. at pp. 691-692 [ 80 L. Ed. 2d at p. 696], italics added.) \"Most important,\" the Strickland court admonished, \"in adjudicating a claim of actual ineffectiveness of counsel, a court should keep in mind that the principles we have stated do not establish mechanical rules. Although those principles should guide the process of decision, the ultimate focus of inquiry must be on the fundamental fairness of the proceeding whose result is being challenged. In every case the court should be concerned with whether, despite the strong presumption of reliability, the result of the particular proceeding is unreliable because of a breakdown in the adversarial process that our system counts on to produce just results.\" ( Id. at p. 696 [80 L. Ed. 2d at p. 699], italics added.) \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\n\nIn applying this reasoning to the facts of the case at bar, it will be helpful to recapitulate the various deficiencies in Part's representation of petitioner that are discussed in part I of this opinion. They are:\n\n1. Part spent only 3 percent of his available working hours preparing for trial.\n\n2. Part did not personally engage in any investigation before trial.\n\n3. Part did not cause his investigator to engage in any investigation before trial.\n\n4. Part did not personally interview any prospective witnesses before trial.\n\n5. Part made no pretrial motions of any kind.\n\n6. Part relied on the prosecutor's case file as his sole source of facts and leads.\n\n7. Part took no steps to investigate a diminished capacity defense on any ground.\n\n8. Part did not seek the appointment of a medical expert to determine petitioner's mental condition at the time of the crimes.\n\n9. Part took no steps to investigate the voluntariness of petitioner's pretrial statement.\n\n10. Part did not move before trial to suppress petitioner's statement on any ground.\n\n11. When the case came to trial, Part waived his client's constitutional right to appear before the jury in civilian clothes.\n\n12. At trial, Part waived the right to make an opening statement to the jury.\n\n13. At the guilt phase, Part did not call any witnesses or introduce any evidence.\n\n14. In his argument to the jury on the guilt phase, Part conceded that his client was guilty beyond a reasonable doubt of both counts of first degree murder, of the robbery count, and of both special circumstances alleged on each count of murder.\n\n15. At the penalty phase, Part put on no evidence in mitigation.\n\n16. In his argument to the jury on the penalty phase, Part urged the jury to have no sympathy for his client and to spare his life simply because some murderers are even worse.\n\nWhen the cumulative effect of all these professional errors is fairly considered, I cannot see how we can have \"confidence in the outcome\" of the trial. As the United States Supreme Court has repeatedly recognized, \" 'Of all the rights that an accused person has, the right to be represented by counsel is by far the most pervasive for it affects his ability to assert any other rights he may have.' \" ( United States v. Cronic (1984) 466 U.S. 648, 654, and cases cited in fn. 9 [ 80 L. Ed. 2d 657, 664, 104 S. Ct. 2039].) The sad litany of Part's many deficient acts and omissions in representing petitioner compels me to conclude that the result of this trial \"is unreliable because of a breakdown in the adversarial process\" (Strickland, (supra) , 466 U.S. at p. 696 [ 80 L. Ed. 2d at p. 699]). Under Strickland, therefore, petitioner has shown prejudice and is entitled to the relief he seeks.\n\nIII. PETITIONER IS ENTITLED TO RELIEF UNDER UNITED STATES V. CRONIC\n\nIn the alternative, I am of the view that petitioner is entitled to relief without a showing of prejudice under the doctrine of United States v. Cronic, (supra) , 466 U.S. 648 (hereafter Cronic).\n\nCronic is a companion case to Strickland, filed on the same day; the Cronic opinion explicates and expands on the statement in Strickland (466 U.S. at p. 692 [80 L. Ed. 2d at p. 696]) that \"In certain Sixth Amendment contexts, prejudice is presumed. Actual or constructive denial of the assistance of counsel altogether is legally presumed to result in prejudice. So are various kinds of state interference with counsel's assistance. [Citing Cronic.] Prejudice in these circumstances is so likely that case-by-case inquiry into prejudice is not worth the cost. [Citing Cronic.]\"\n\nIn Cronic the high court explained that \"the adversarial process protected by the Sixth Amendment requires that the accused have 'counsel acting in the role of an advocate.' [Citation.] The right to the effective assistance of counsel is thus the right of the accused to require the prosecution's case to survive the crucible of meaningful adversarial testing. When a true adversarial criminal trial has been conducted--even if defense counsel may have made demonstrable errors--the kind of testing envisioned by the Sixth Amendment has occurred. But if the process loses its character as a confrontation between adversaries, the constitutional guarantee is violated.\" (466 U.S. at pp. 656-657 [80 L. Ed. 2d at p. 666], italics added and fns. omitted.)\n\nIn light of this emphasis on the \"adversarial\" nature of a trial, it is not surprising that when the high court went on to identify the \"circumstances that are so likely to prejudice the accused that the cost of litigating their effect in a particular case is unjustified\" (Cronic, (supra) , 466 U.S. at p. 658 [ 80 L. Ed. 2d at p. 667], fn. omitted), it placed an absence of adversarial testing on the same footing as an outright denial of counsel: \"The presumption that counsel's assistance is essential requires us to conclude that a trial is unfair [1] if the accused is denied counsel at a critical stage of his trial. Similarly, [2] if counsel entirely fails to subject the prosecution's case to meaningful adversarial testing, then there has been a denial of Sixth Amendment rights that makes the adversary process itself presumptively unreliable.\" ( Id. at p. 659 [80 L. Ed. 2d at p. 668], italics added and fn. omitted.)\n\nThe case at bar falls within the second of these categories. It is true that Part went through the motions of cross-examining, either briefly or at greater length, most of the prosecution witnesses. But any potential benefits of that exercise for his client were more than offset by Part's many deficient acts and omissions listed above, i.e., by the things that Part did not do to defend petitioner that competent counsel would have done, and by the things that Part did do that worked to his client's disadvantage. \"Adversarial testing\" requires more of counsel than just cross-examination of prosecution witnesses. It requires, at a minimum, timely and in-depth investigation of potential defenses and the strengths and weaknesses of the prosecution's case, and thorough pretrial testing of the prosecution's evidence by appropriate motions; indeed, without such pretrial investigation and motions counsel will lack much of the information needed to conduct a meaningful cross-examination. Adversarial testing also requires a serious effort to develop and present evidence negating the prosecution's proof of guilt, and, in capital trials, to develop and present evidence mitigating the penalty, as well as arguments to the jury that advance the defendant's case and undermine that of the prosecution. Because Part failed to do any of this, he \"entirely fail[ed] to subject the prosecution's case to meaningful adversarial testing\" within the rule of Cronic, (supra) , 466 U.S. at page 659 [ 80 L. Ed. 2d at page 668].\n\nThe majority avoid this Conclusion by giving Cronic a far narrower reading than the opinion will bear. Thus the majority set up a straw man by denying that \"outside influences\" prevented Part from providing constitutionally effective assistance: the majority reason (maj. opn., ante, at p. 728) that in Cronic \"The high court recognized that such outside influences can sometimes render it impossible for any lawyer to provide constitutionally adequate assistance. (Cronic, (supra) , 466 U.S. at pp. 659-660 [ 80 L. Ed. 2d at pp. 668-669].) Petitioner's argument, however, is not that there were such outside influences, but that Part himself failed to work hard enough. This case thus falls outside the small exception carved out by Cronic.\"\n\nThis is an evident misunderstanding of Cronic. In the pages of Cronic cited by the majority (466 U.S. at pp. 659-660 [80 L. Ed. at pp. 668-669]) the high court identifies one kind of case in which prejudice will be presumed, to wit, a case in which the circumstances of the trial themselves (e.g., threats of mob violence, denial of time to prepare) prevent counsel from doing his job. The archetype of such a case, of course, is Powell v. Alabama (1932) 287 U.S. 45 [77 L. Ed. 158, 53 S. Ct. 55, 84 A.L.R. 527], which the Cronic court proceeds to discuss in some detail. But that is a rare case today; more important, it is obviously not the only kind of case in which prejudice will be presumed under Cronic, as shown by the quotations hereinabove from the body of the Cronic opinion (466 U.S. at pp. 658-659 [80 L. Ed. 2d at pp. 667-668]). Thus it is not, as the majority claim, \"the small exception carved out by Cronic \" (maj. opn., ante, at p. 728), but simply one example of Cronic 's general principle that prejudice will be presumed from an actual or constructive denial of counsel. And it is certainly not the exception relied on by petitioner.\n\nThe majority also claim that three footnotes in the Cronic opinion \"limit\" the admittedly broad language of the text of the opinion quoted hereinabove. As will appear, however, the majority demonstrably misread the footnotes they rely on. The devil may often be in the details, but the rule of Cronic is not in its footnotes.\n\nThe majority's first misreading is obvious. The majority quote (maj. opn., ante, at p. 727) the text of footnote 25 of Cronic (466 U.S. at p. 659, fn. 25 [80 L. Ed. 2d at p. 668]): \"The Court has uniformly found constitutional error without any showing of prejudice when counsel was either totally absent, or prevented from assisting the accused during a critical stage of the proceeding.\" The majority subsequently quote from that sentence to distinguish Cronic from petitioner's case, stressing that Part was \"neither 'totally absent' nor 'prevented' from assisting petitioner at trial.\" (Maj. opn., ante, p. 727.)\n\nA glance at the Cronic opinion, however, is enough to show the majority's mistake: footnote 25 of that opinion refers only to the first of the high court's two categories of cases in which prejudice is presumed, i.e., when there is a \"complete denial of counsel\" (Cronic, (supra) , 466 U.S. at p. 659 [ 80 L. Ed. 2d at p. 668]). But in the case at bar petitioner does not contend there was a \"complete denial of counsel\"; he relies instead on the second of the high court's categories of cases of presumed prejudice, i.e., when counsel \"entirely fails to subject the prosecution's case to meaningful adversarial testing\" (ibid.). Footnote 25 is irrelevant to that category, and hence is irrelevant to the case at bar.\n\nThe majority's second misreading is less obvious but no less wrong. As an example of the second category of cases of presumed prejudice, i.e., when counsel \" entirely fails to subject the prosecution's case to meaningful adversarial testing,\" the high court referred in the text of its Cronic opinion (466 U.S. at p. 659 [80 L. Ed. 2d at p. 668]) to Davis v. Alaska (1974) 415 U.S. 308 [39 L. Ed. 2d 347, 94 S. Ct. 1105] (hereafter Davis), a case in which counsel was prevented from cross-examining a crucial prosecution witness. The majority take note of that reference, and then quote (maj. opn., ante, at p. 727) the text of footnote 26 of Cronic (466 U.S. at p. 659, fn. 26 [80 L. Ed. 2d at p. 668]): \" Apart from circumstances of that magnitude, however, there is generally no basis for finding a Sixth Amendment violation unless the accused can show how specific errors of counsel undermined the reliability of the finding of guilt.\" The majority italicize the opening clause of the sentence, as if to imply that the second category of Cronic cases is limited to the \"circumstance\" of Davis, i.e., to cases of denial of cross-examination.\n\nSuch an implication would be erroneous. Footnote 26 does not say, \"Apart from that circumstance,\" but \"Apart from circumstances of that magnitude,\" and the emphasized phrase refers to a sentence of the Cronic text (omitted by the majority here) in which the high court quotes Davis as explaining that denial of cross-examination is constitutional error \" ' \"of the first magnitude\" ' \" (466 U.S. at p. 659 [80 L. Ed. 2d at p. 668], quoting Davis, (supra) , 415 U.S. at p. 318 [ 39 L. Ed. 2d at pp. 354-355]). It follows that the clause of footnote 26 italicized by the majority is not in fact limited to cases of denial of cross-examination, but refers to all cases of failure of adversarial testing that are of the same \"magnitude--i.e., of the same importance--as denial of cross-examination. As explained above, the deficiencies in Part's representation of petitioner were so pervasive as to amount a case \"of the same magnitude\" as denial of cross-examination.\n\nThe majority's third misreading of a Cronic footnote is more a matter of selective quotation. Thus the majority quote (maj. opn., ante, at p. 728) the first two sentences of footnote 19 of the Cronic opinion (466 U.S. at pp. 656-657, fn. 19 [80 L. Ed. 2d at p. 666]): \"the Sixth Amendment does not require that counsel do what is impossible or unethical. If there is no bona fide defense to the charge, counsel cannot create one and may disserve the interests of his client by attempting a useless charade.\" The majority then stress (maj. opn., ante, at p. 728) that Part was \"faced with a defendant with no apparent defense\" who had confessed to the crimes charged. Of course, Part saw petitioner as having \"no apparent defense\" because he had failed to investigate any possible defense on his client's behalf. More important, the many steps that Part should have taken in representing petitioner would not have been \"a useless charade.\" They would have been the adversarial testing that the Sixth Amendment requires.\n\nThis fact is underscored by the very next sentence of footnote 19 of Cronic, which the majority do not quote: there the high court admonished that \"At the same time, even when no theory of defense is available, if the decision to stand trial has been made, counsel must hold the prosecution to its heavy burden of proof beyond reasonable doubt.\" (466 U.S. at p. 657, fn. 19 [80 L. Ed. 2d at p. 657], italics added.) As we have seen, Part did the opposite: in his guilt argument he conceded that petitioner was guilty beyond a reasonable doubt of the only charges that mattered--two murders with special circumstances--and in his penalty argument he conceded petitioner's guilt of those charges beyond \"any\" doubt and urged the jury to have no sympathy for his client.\n\nRecent federal and state decisions hold that such arguments alone are enough to require relief without proof of prejudice.\n\nThe general rule was stated only last year in U.S. v. Williamson (10th Cir. 1995) 53 F.3d 1500, 1511: \"There is no question but that the sort of conduct alleged here, i.e., the admission by counsel of his client's guilt to the jury, represents a paradigmatic example of the sort of breakdown in the adversarial process that triggers a presumption of prejudice. [Citations.]\" \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\n\nThe leading case applying this rule is U.S. v. Swanson (9th Cir. 1991) 943 F.2d 1070 (hereafter Swanson). The defendant in that case was charged with one charge of bank robbery, and went to trial on a not guilty plea. His counsel, David Ochoa, began his closing argument to the jury by saying it was his \"job\" to ensure that the prosecution had proved its case beyond a reasonable doubt. ( Id. at p. 1077.) Counsel then repeatedly told the jurors, however, that he was not \"trying to raise a reasonable doubt,\" because he believed the defense case did not reach \"the level of raising reasonable doubt\"; rather, he believed the prosecution case was \"overwhelming,\" both as to the identity of the robber and the element of intimidation. ( Id. at pp. 1077-1078.) And he concluded, \"many people ask me, 'Why do you defend someone when the evidence is overwhelming?' Because I am defending the system.\" ( Id. at p. 1078.)\n\nThe defendant appealed his conviction solely on the ground that the foregoing argument to the jury constituted ineffective assistance of counsel. The government contended the claim must fail because there was no showing that the argument was prejudicial under Strickland, (supra) , 466 U.S. 668. Rejecting this contention, the Ninth Circuit Court of Appeals reversed the judgment, reasoning that \"We are persuaded that Mr. Ochoa's conduct caused a breakdown in our adversarial system of Justice in this case that compels an application of the Cronic exception to the Strickland requirement of a showing that the outcome of the trial would have been different without counsel's errors or omissions. See Cronic, 466 U.S. at 659-60 [80 L. Ed. 2d at 668], 104 S. Ct. at 2047. Mr. Ochoa's concession in his argument to the jury that there was no reasonable doubt concerning the element of intimidation, and whether Swanson was the perpetrator of the bank robbery, does not demonstrate mere negligence in the presentation of his client's case or a strategy to gain a favorable result that misfired. Instead, Mr. Ochoa's statements lessened the Government's burden of persuading the jury that Swanson was the perpetrator of the bank robbery. Mr. Ochoa's conduct tainted the integrity of the trial.\" (943 F.2d at p. 1074.)\n\nThe Swanson court explained that \"Mr. Ochoa's closing argument was not merely a negligent misstep in an attempt to champion his client's cause. The concession that there was no reasonable doubt that his client robbed the bank was an abandonment of the defense of his client at a critical stage of the criminal proceedings. . . . A lawyer who informs the jury that it is his view of the evidence that there is no reasonable doubt regarding the only factual issues that are in dispute has utterly failed to 'subject the prosecution's case to meaningful adversarial testing.' Cronic, 466 U.S. at 659 [80 L. Ed. 2d at 668], 104 S. at 2047.\" (943 F.2d at p. 1074, italics added.)\n\nRelying on other cases in which prejudice was presumed because of actual or constructive denial of counsel, the Swanson court reasoned that the record \"demonstrates the constructive absence of an attorney dedicated to the protection of his client's rights under our adversarial system of Justice. Once Swanson's court appointed attorney told the jury that there was no reasonable doubt regarding his client's identity as the perpetrator of the crime charged against him, he ceased to function as defense counsel. 'An effective attorney \"must play the role of an active advocate, rather than a mere friend of the court.\" ' \" (943 F.2d at p. 1075.)\n\nIn addition, the Swanson court declared that \"Mr. Ochoa's abandonment of his duty of loyalty to his client by assisting the prosecutor also created a conflict of interest. . . . 'A defense attorney who abandons his duty of loyalty to his client and effectively joins the state in an effort to attain a conviction or death sentence suffers from an obvious conflict of interest. Such an attorney, like unwanted counsel, ' \"represents\" the defendant only through a tenuous and unacceptable legal fiction.' \" (943 F.2d at p. 1075.)\n\nFor all these reasons the Swanson court concluded, \"We cannot envision a situation more damaging to an accused than to have his own attorney tell the jury that there is no reasonable doubt that his client was the person who committed the conduct that constituted the crime charged in the indictment.\" (943 F.2d at p. 1075.) \u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\n\nState courts are in accord. Thus in State v. Harbison (1985) 315 N.C. 175 [337 S.E.2d 504] the defendant went to trial on a not guilty plea to charges of murdering one person and assaulting another with a deadly weapon inflicting serious bodily injury. In closing argument one of his counsel told the jury that he wanted to leave the courtroom with a clear conscience and that \" 'I have my opinion as to what happened on that April night, and I don't feel that [the defendant] should be found innocent. I think he should do some time to think about what he has done. I think you should find him guilty of manslaughter and not first degree.' \" (337 S.E.2d at p. 506.) The defendant was convicted and appealed, but the North Carolina Supreme Court affirmed the judgment.\n\nSome years later, however, the defendant filed a motion for postconviction relief on the ground that his counsel's argument constituted ineffective representation. This time he was successful: the North Carolina Supreme Court granted the motion and ordered a new trial. Relying on the rule of Cronic, (supra) , 466 U.S. 648, the court held that when counsel concedes guilt in argument to the jury without his client's consent, \"the harm is so likely and so apparent that the issue of prejudice need not be addressed.\" (337 S.E.2d at p. 507.)\n\nThe North Carolina Supreme Court explained that \"When a defendant enters a plea of 'not guilty,' he preserves two fundamental rights. First, he preserves the right to a fair trial as provided by the Sixth Amendment. Second, he preserves the right to hold the government to proof beyond a reasonable doubt.\" (337 S.E.2d at p. 507.) Pursuing this point, the court reasoned that \"When counsel admits his client's guilt without first obtaining the client's consent, the client's rights to a fair trial and to put the State to the burden of proof are completely swept away. The practical effect is the same as if counsel had entered a plea of guilty without the client's consent. Counsel in such situations denies the client's right to have the issue of guilt or innocence decided by a jury.\" (Ibid.)\n\nMore recently and closer to home, the Supreme Court of Nevada so held on a record not dissimilar to that of the case at bar. In Jones v. State (1994) 110 Nev. 730 [877 P.2d 1052], the defendant's girlfriend, Pamela Williams, was found stabbed to death in the mobilehome she shared with defendant. Shortly afterwards defendant volunteered to police officers that he had been in a fight with Williams and thought he had \" 'hurt her real bad.' \" (Id. at p. 1053.) Defendant was arrested, and later that day gave the police a statement after being advised of his rights and signing a written waiver. At trial the officer who took the statement testified to its contents; they included the defendant's confession that in the course of an argument he stabbed Williams with a kitchen knife. A tape recording of the statement was played to the jury. The defendant took the stand, denied killing Williams, and offered an innocent explanation of a cut on his hand and blood-soaked items of men's clothing found near the body.\n\nDuring the argument to the jury, however, defense counsel conceded that he believed \" 'the evidence shows beyond a reasonable doubt that the defendant did kill Pamela,' \" but argued that he was guilty only of second degree murder. (877 P.2d at p. 1055.) The jury returned a verdict of first degree murder and subsequently fixed the penalty at death, finding aggravating but no mitigating circumstances.\n\nOn appeal the Supreme Court of Nevada addressed only the issue of the effect of counsel's concession of guilt in argument to the jury. Quoting from a federal district court opinion that summarized the holdings of three cases cited hereinabove, \u003cspan class=\"fnref\"\u003e35\u003c/span\u003e the Nevada Supreme Court said: \" 'When counsel concedes a client's guilt during the guilt-innocence phase of trial in spite of the client's earlier plea of not guilty and without the defendant's consent, counsel provides ineffective assistance of counsel regardless of the weight of evidence against the defendant or the wisdom of counsel's 'honest approach' strategy. [Citations.] . . . An attorney cannot deprive his or her client of the right to have the issue of guilt or innocence presented to the jury as an adversarial issue on which the state bears the burden of proof without committing ineffective assistance of counsel.' \" (877 P.2d at p. 1056.)\n\nThe Nevada Supreme Court held that counsel's argument fell below an objective standard of reasonableness under the first prong of the Strickland test. (Strickland, (supra) , 466 U.S. 668, 687-688 [ 80 L. Ed. 2d 674, 693].) The court then expressed doubt that the defendant could make the showing of prejudice required by Strickland ( id. at pp. 691-692 [80 L. Ed. 2d at pp. 693-694]), but decided against imposing that requirement in the present context: \"We are unable to conclude with a strong degree of certainty that the second prong of the Strickland test, which requires a showing of prejudice, has also been met. Nevertheless, in a capital case involving an error of this magnitude, we are constrained to give the full benefit of the doubt on this issue to [the defendant]. In addressing this same issue, the Supreme Court of North Carolina determined that prejudice may be presumed where defense counsel improperly concedes his client's guilt . . . .\" (877 P.2d at p. 1057.) The court then quoted with approval the declaration of the North Carolina Supreme Court in State v. Harbison, (supra) , 337 S.E.2d 504, 507, to the effect that when counsel concedes guilt in argument to the jury without his client's consent, \"the harm is so likely and so apparent that the issue of prejudice need not be addressed.\"\n\nFor these reasons the Nevada Supreme Court reversed the judgment of conviction and sentence of death and remanded the case for a new trial.\n\nIn the case at bar, as we have seen, counsel's deficient acts and omissions included but extended far beyond his concession in jury argument that petitioner was guilty beyond a reasonable doubt of both murders and both special circumstances. It follows a fortiori that petitioner is entitled to relief under the rule of the cases discussed herein.\n\nKENNARD, J.\n\nI Dissent. As Justice Mosk explains in his Dissenting opinion, trial counsel's representation at both the guilt and penalty phases of petitioner's capital trial was seriously deficient, thus requiring that his convictions and death sentence be vacated.\n\nCiting United States v. Cronic (1984) 466 U.S. 648, 659 [80 L. Ed. 2d 657, 668, 104 S. Ct. 2039], Justice Mosk concludes that, even without a showing of prejudice by petitioner, petitioner is entitled to the relief requested because his trial counsel \" ' entirely fail [ ed ] to subject the prosecution's case to meaningful adversarial testing.' \" (Dis. opn. of Mosk, J., ante, at p. 774.) Although I agree that petitioner's convictions should be set aside, unlike Justice Mosk I see no need to decide whether petitioner is, under Cronic, entitled to relief without a showing of prejudice. As I shall discuss, under Strickland v. Washington (1984) 466 U.S. 668, 694 [80 L. Ed. 2d 674, 697-698, 104 S. Ct. 2052] petitioner has met his burden of showing that \"there is a reasonable probability that, but for counsel's unprofessional errors, the result of the proceeding would have been different.\"\n\nThe most serious of counsel's numerous deficiencies at trial was his failure to move for suppression of petitioner's tape-recorded confession on the ground that petitioner's constitutional right to remain silent (U.S. Const., 5th Amend.; Miranda v. Arizona (1966) 384 U.S. 436, 474 [16 L. Ed. 2d 694, 723-724, 86 S. Ct. 1602, 10 A.L.R.3d 974]) had been violated when, after he told the investigating officers, \" don't want to talk about it,\"1a the officers nevertheless continued to question him. As a result, the jury heard petitioner's statement to the police that he had participated in the shootings of the victims. As this court has explained, a confession \" 'operates as a kind of evidentiary bombshell which shatters the defense.' \" ( People v. Cahill (1993) 5 Cal. 4th 478, 503 [20 Cal. Rptr. 2d 582, 853 P.2d 1037], quoting People v. Schader (1965) 62 Cal. 2d 716, 731 [44 Cal. Rptr. 193, 401 P.2d 665].) An improperly admitted confession \"is much more likely to affect the outcome of the trial than are other categories of evidence . . . .\" ( People v. Cahill, (supra) , 5 Cal. 4th at p. 503.) In this case, petitioner's confession was the most persuasive evidence of petitioner's participation in the fatal shootings; its suppression would have removed this damaging evidence from the jury's consideration. Because it is reasonably probable that the outcome of petitioner's trial would have been different if his confession had not been admitted at trial, I would set aside petitioner's convictions and death sentence.2a\n\n\u003cspan class=\"fn\"\u003e1. Respondent states in his brief on the merits that Judge Ouderkirk prepared his report based on a defense summary of the evidentiary hearing. This appears erroneous; the pertinent minute orders refer to a \"synopsis of trial \" (italics added), contained in defense exhibit H. Moreover, Judge Ouderkirk's factual findings have numerous references to page numbers in the evidentiary hearing transcript. We assume Judge Ouderkirk, in preparing his report, read the transcript of the evidentiary hearing but only the summary of the criminal trial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. \"In determining what inferences to draw from the evidence or facts in the case against a party, the trier of fact may consider, among other things, the party's failure to explain or to deny by his testimony such evidence or facts in the case against him, or his willful suppression of evidence relating thereto, if such be the case.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The arresting officer, Donald Fesperman, denied writing the letters \"PCP\" on the form 510, although he admitted filling out the rest of the form. A handwriting expert testified there was a high degree of probability that the person who filled out the form also wrote the letters \"PCP.\" The referee expressly found that Officer Fesperman wrote the letters \"PCP\" on the form 510. We find there is substantial evidence to support this determination.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. We reject respondent's argument that we should excuse Part's failure to discover these documents in the record because the trial record was \"voluminous.\" Even assuming the record was oversized (which is dubious), we cannot excuse counsel overlooking information contained in the police report in the case at hand.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. It is unclear whether the Supreme Court's decision in Fretwell, (supra) , 506 U.S. 364, alters or supersedes the second (prejudice) prong of the traditional Strickland test (see U.S. v. $30,440 in U.S. Currency (9th Cir. 1993) 2 F.3d 328, 330 [\"[f]or Strickland to apply . . . there must . . . have been fundamental unfairness in the trial so . . . its result was unjust,\" citing Fretwell ]), or is merely a gloss on that test made necessary by the unusual facts of Fretwell. (See Justice O'Connor's Concurring opinion in Fretwell, (supra) , 506 U.S. at pp. 373-374 [ 122 L. Ed. 2d at pp. 192-193] [ Fretwell will have no effect on the Strickland prejudice inquiry \"in the vast majority of cases\"].) As explained, post, we need not resolve this issue at this time because petitioner fails to satisfy either formulation of the test.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Part informed the Judge midtrial that petitioner had just informed him during a break that he had not been \" Mirandized.\" Part immediately moved for a hearing and, after some Discussion, the trial Judge agreed it was appropriate to hold an Evidence Code section 402 hearing \"right now if the defendant is now asserting that claim which I presume he has not previously asserted.\" (Italics added.) Part replied: \"Not that I know of. Not that I remember. Not that I had any knowledge of.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Petitioner also contends that Part was ineffective for failing to have the taped confession professionally analyzed and transcribed. He alleges that at trial, Part worked from a transcription prepared by the People. Petitioner provides a slightly different transcription, but it does not add much. In particular, it does not substantiate the claim that petitioner asked for an attorney or otherwise indicated that he was being coerced to confess. We thus conclude that no prejudice flowed from this alleged omission by Part.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1 According to Part's first request for attorney fees, all he did during his 53 hours of preparation time was to read the transcript of the trial of petitioner's former codefendant Arturo Padua (1,477 pages) and of petitioner's preliminary hearing (279 pages), review the prosecution's file on the case, talk with petitioner and his investigator, and, assertedly, \"interview prospective witnesses.\" Whether the last actually occurred is, as we shall see, highly doubtful. Part's contact with petitioner, moreover, was minimal: in a declaration filed in support of the petition for habeas corpus, petitioner averred that except for courtroom appearances he saw Part only four times during the forty-three weeks before trial. Part did not dispute this fact in the declaration he filed in support of the return. And the People do not dispute the fact in the return itself, thereby effectively admitting it. ( In re Sixto (1989) 48 Cal. 3d 1247, 1252 [259 Cal. Rptr. 491, 774 P.2d 164].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2 At the evidentiary hearing all counsel stipulated that Part was appointed to represent petitioner in the Alfaro case on March 19, 1982, and was relieved of that appointment on August 13, 1982.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3 Petitioner's sister was not called to testify at the evidentiary hearing.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4 As the majority acknowledge (maj. opn., ante, p. 720), such expert testimony is not only admissible, it is commonplace. For example, Gessler stated that he has testified as an expert on the competency of defense counsel representation in a number of capital cases, including People v. Payton (1992) 3 Cal. 4th 1050 [13 Cal. Rptr. 2d 526, 839 P.2d 1035], In re Jackson (1992) 3 Cal. 4th 578 [11 Cal. Rptr. 2d 531, 835 P.2d 371], and In re Marquez (1992) 1 Cal. 4th 584 [3 Cal. Rptr. 2d 727, 822 P.2d 435].\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5 Shortly after Part was appointed, counsel for then codefendant Arturo Padua moved to dismiss the special circumstances and certain counts alleged against his client. When the motion came on for hearing, Part orally joined in it. After Padua's case was severed, however, Part engaged in no further motion activity of his own.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6 Dr. Rosenthal has testified as an expert witness on this topic in many cases, including In re Cordero (1988) 46 Cal. 3d 161 [249 Cal. Rptr. 342, 756 P.2d 1370] and People v. Ledesma (1987) 43 Cal. 3d 171 [233 Cal. Rptr. 404, 729 P.2d 839].\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7 Like Dr. Rosenthal, Dr. Aniline has also testified as an expert witness on this topic in numerous cases, including In re Sixto, (supra) , 48 Cal. 3d 1247.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Gillingham stated he has testified as an expert on the competency of defense counsel representation in such capital cases as People v. Pensinger (1991) 52 Cal. 3d 1210 [278 Cal. Rptr. 640, 805 P.2d 899], and In re Cordero, (supra) , 46 Cal. 3d 161.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. For example, even before the prosecution played the tape recording in the courtroom Part described its contents to the trial Judge as a series of leading questions and largely yes-or-no answers, rather than a narrative.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. For example, on direct examination Officer Kellenberger testified that in the course of the interrogation petitioner \"said\" he shot the driver of the pink Chevrolet Camaro. On cross-examination, however, it appeared that in the transcript of the interrogation petitioner did not in fact say anything in reply to the key question, \"Is that when you shot him?\" When asked about this discrepancy, Kellenberger stated, \"At that particular point he nodded his head.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The confused state of Part's thinking about petitioner's pretrial statement is illustrated by the fact that when the tape recording of the statement was first discussed at trial Part told the court that it was composed of statements \"which, in my opinion, would be more helpful to the defendant than a detriment,\" and hence that if the prosecutor did not intend to play the recording, \"I will play it myself.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. After the trial, petitioner's appellate counsel obtained a professional transcription of the recording and submitted it in support of the petition for habeas corpus. The majority (maj. opn., ante, at p. 729, fn. 7) dismiss that version with the comment that \"it does not add much.\" How the majority are able to compare it with the prosecution's version is a mystery, because the latter was not put in evidence and hence is not in the record. In any event, as will appear, the professional transcription differs in a crucial respect from the way that the court and counsel heard--and the prosecutor transcribed--a key portion of the recording.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Part did not seek to support this claim by filing a Pitchess motion ( Pitchess v. Superior Court (1974) 11 Cal. 3d 531 [113 Cal. Rptr. 897, 522 P.2d 305]) to discover complaints of excessive force against the interrogating officers. Such a motion will lie to support a claim that a confession was coerced. ( People v. Memro (1985) 38 Cal. 3d 658, 674-684 [214 Cal. Rptr. 832, 700 P.2d 446].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Because the prosecution's version of this transcription was not put in evidence, we must use the transcription prepared by petitioner's expert.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. I reproduce below the quoted portion of the transcription. (Text not enclosed by braces was found by the transcriber to be clearly intelligible; text within braces was marginally intelligible; parentheses indicate the estimated number of syllables that were unintelligible.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\": If you don't want anything written down, fine, wedon't have to write anything down. Okay.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"AVENA: Uh, how come, how--\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\": We'll, we'll do it your way.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"AVENA: Excuse me, how come you close the eye?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\": 'Cause I got a bad eye.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\": We--you know how long we been up?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"AVENA: (8-12 syl.), man. Don't want to talk about it.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\": Hmm?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"AVENA: Forget about it.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\": You know how long we been awake man? 'Bout thirty six hours. You watch me, you're gonna see my eyes closing too.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"AVENA: Forget about it, man, I don't want to talk (1-2 syl.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Pause--3 Sec.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"AVENA: It's over\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Part's reliance on the prosecutor's version is also demonstrated by the statement in his declaration that \"There appeared to be no differentiation between the transcription of the tape and the tape itself.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. I agree with the trial Judge that we should not \"supply words that cannot be heard\"; but from the fact that the Judge--not claiming to be an expert--could not hear the words that followed the word \"talk\" (and misheard the words that preceded it) when the tape recording was played in the courtroom, it does not follow that a forensic acoustics expert, analyzing the same tape with laboratory equipment, could not hear them either. On the contrary, the declaration of petitioner's expert identified the statements, \"Don't want to talk about it\" and \"Forget about it,\" as \"utterances that are considered to be clearly intelligible.\" The People do not question the accuracy of this portion of the transcription.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. In addition, both the United States Supreme Court and this court have recognized that the practice also violates equal protection because it operates primarily against defendants who are too poor to post bail. ( Estelle v. Williams, (supra) , 425 U.S. at pp. 505-506 [48 L. Ed. 2d at p. 131]; People v. Taylor, (supra) , 31 Cal. 3d at p. 495.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. That was certainly true: after the prosecutor's direct examination of Padua, Part told the court that \"I'm not prepared to cross-examine that witness because my tactics, obviously, in this particular case have changed with the production of this witness.\" Part explained that he did not know Padua would testify \"until getting an inkling last night and knowing this morning . . . .\" Part then asked for time to decide on a new trial tactic, speculating that \"it may be that I won't even ask him a question on cross-examination. It could be that I will float through all of the other witnesses almost conceding the counts. It could be that I'd even ask the defendant to plead [guilty] because [I am] thinking that the only thing we have to save here is the penalty phase.\" The court granted a recess until the following day, when Part's new tactic revealed itself: for the rest of the guilt phase he contented himself with cross-examining the prosecution's witnesses, and called none of his own.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. For example, Part acknowledged that it \"Sounds silly why I am standing up here arguing for assault with a deadly weapon rather than assault with intent to commit murder when we are talking about horrendous penalties, but my job is to make the People prove their case.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA few moments later Part again conceded that \"It sounds like I am sitting up here talking about nickels and dimes when the District Attorney is talking about a million dollar situation. And perhaps that is true. But that is my job.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. The jury interrupted its brief deliberations only once, to ask for a restatement of the definitions of the assault crimes and for a rereading of the testimony relating to two of the assaults.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. This was apparently not an uncommon sequence of events in the Los Angeles County jail: Part's own witness, Deputy Bauder, testified that after searching the 80 or 90 inmates involved in the incident occurring 2 days earlier, he found no less than 5 discarded shanks in the room.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. There may have been a pattern here. Another item of aggravating evidence introduced by the prosecution was the testimony of Deputy Sheriff Anthony De Leon to the effect that petitioner intervened while he was removing the restraints from another inmate, and that when he attempted to put petitioner in a \"recalcitrant cell,\" petitioner assaulted him \"for reasons unknown.\" Part called no defense witnesses to tell petitioner's side of the story. In his declaration, however, petitioner averred that he told Part about the incident and \"I asked him if he wanted the names of people who were there and he said no, that he did not have anything to do with that and was not getting paid to investigate it, so it's no big deal.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. For example, the prosecutor argued: \"Ladies and gentlemen, you tell me one mitigating circumstance that's been presented to you in this case. Give me one.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"There is absolutely no mitigation whatsoever presented by the defense, presented by the People, presented by our common sense. None.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"All--all of the evidence, all of the inferences, all of the facts in this case are aggravating circumstances, ladies and gentlemen. Every bit of it. There is no mitigation whatsoever.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. The woman in question was not married to petitioner.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. At the evidentiary hearing Part again claimed he did not introduce any evidence of intoxication \"because I did not want the jury to feel that a person who drank had a license to commit a crime.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Thus in addressing the jury on the sufficiency of the evidence of the assault counts, Part said of his client, \"You don't have to like him. In fact, you probably don't like him.\" A few minutes later Part returned to his theme, repeating, mantra-like, \"You might not like the defendant for what he has done. You might not like the defendant for what he is charged with. You might not like the defendant for his lifestyle.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. For example, Part told the jury that petitioner \"did not take his rifle into Bob's Big Boy restaurant and shoot nine people. He didn't go out every night to kill a different person. He didn't go into four separate homes and slaughter people inside.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Juan Corona was a serial killer who was convicted on 25 counts of first degree murder for hacking and stabbing to death a total of 25 migrant farmworkers over a period of 4 months. ( People v. Corona (1978) 80 Cal. App. 3d 684 [145 Cal. Rptr. 894].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. I agree with the Concurring opinion herein of Justice Arabian that the recent decision of the high court in Lockhart v. Fretwell (1993) 506 U.S. 364 [122 L. Ed. 2d 180, 113 S. Ct. 838], is distinguishable on its facts and has no bearing on the resolution of this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. As the Strickland court said in another connection, \"The object of an ineffectiveness claim is not to grade counsel's performance.\" (Strickland, (supra) , 466 U.S. at p. 697 [ 80 L. Ed. 2d at p. 699].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. The concept of finding prejudice in cumulative effect, of course, is not new. Under the \"cumulative error\" doctrine, errors that are individually harmless may nevertheless have a cumulative effect that is prejudicial. (E.g., Delzell v. Day (1950) 36 Cal. 2d 349, 351 [223 P.2d 625]; Du Jardin v. City of Oxnard (1995) 38 Cal. App. 4th 174, 180 [45 Cal. Rptr. 2d 48].) For example, the doctrine required reversal of a judgment when numerous minor instances of attorney misconduct during trial had a cumulatively prejudicial effect. ( Gackstetter v. Market Street Ry. Co. (1933) 130 Cal. App. 316, 325-327 [20 P.2d 93].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. In the cited case relief was ultimately denied because counsel in fact did no more than remark in his argument that he disagreed with a portion of the defendant's testimony in which she expressed doubts about the veracity of certain prosecution witnesses on one of the counts against her; in all other respects counsel \"did not cease to function as an advocate in behalf of [his client]\" and urged the jury to find her not guilty on all counts. (53 F.3d at pp. 1511-1512.) The same evidently cannot be said of Part.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. Prior to Cronic, (supra) , 466 U.S. 648, other federal courts had held that similar arguments to a jury conceding the defendant's guilt constituted ineffective assistance of counsel and grounds for federal habeas corpus relief. Thus in Wiley v. Sowders (6th Cir. 1981) 647 F.2d 642, 650, the court reasoned: \"Although statements made by attorneys in closing arguments are not evidence, nevertheless, for all practical purposes, counsel's admission of guilt on behalf of his client denied to petitioner his constitutional right to have his guilt or innocence decided by the jury. Petitioner, in pleading not guilty, was entitled to have the issue of his guilt or innocence presented to the jury as an adversarial issue. Counsel's complete concession of petitioner's guilt nullified the adversarial quality of this fundamental issue.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAgain, in Francis v. Spraggins (11th Cir. 1983) 720 F.2d 1190, 1194, the court explained: \"Where a capital defendant, by his testimony as well as his plea, seeks a verdict of not guilty, counsel, though faced with strong evidence against his client, may not concede the issue of guilt merely to avoid a somewhat hypocritical presentation during the sentencing phase and thereby maintain his credibility before the jury. Even though an adverse verdict would have the effect of precluding further argument on the issue of guilt, counsel does not have license to anticipate that effect and to concede the issue during the guilt/innocence phase simply because an adverse verdict appears likely.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Francis v. Spraggins, (supra) , 720 F.2d 1190; Wiley v. Sowders, (supra) , 647 F.2d 642; State v. Harbison, (supra) , 337 S.E.2d 504.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1a This statement appears in the transcript prepared by Fausto Poza, the forensic expert retained by petitioner's appellate counsel, and submitted as an exhibit accompanying thepetition for writ of habeas corpus.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAlthough trial counsel's failure to move to suppress petitioner's confession was one of the grounds on which this court issued its order to show cause, the court's order of reference issued on June 30, 1988 (before I joined the court), did not include this issue. In my view, this court should have included this issue in its order of reference. In his return to the order to show cause, the Attorney General challenged the accuracy of Poza's transcription. Accordingly, this court should have directed the referee to determine the accuracy of the transcription. (See People v. Romero (1994) 8 Cal. 4th 728, 739-740 [35 Cal. Rptr. 2d 270, 883 P.2d 388] [evidentiary hearing is necessary when \"the return and traverse reveal that petitioner's entitlement to relief hinges on the resolution of factual disputes . . . .\"].) Because the reference hearing did not encompass this issue, it must now be resolved solely on the declarations and exhibits accompanying the petition for writ of habeas corpus, the return, and the traverse. The only evidence of the contents of petitioner's tape-recorded statement included therein is the transcript prepared by Poza.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2a Strickland v. Washington, (supra) , 466 U.S. 668, rather than Lockhart v. Fretwell (1993) 506 U.S. 364 [122 L. Ed. 2d 180, 113 S. Ct. 838], defines the standard of prejudice applicable here. Because the rules governing the admissibility of petitioner's confession have not changed since the trial of this case, this is not a situation in which use of the \"outcome determinative\" test to assess counsel's performance would grant petitioner \"a windfall to which the law did not entitle him.\" ( Id. at pp. 369-370 [122 L. Ed. 2d at p. 189, 113 S. Ct. at p. 843].)\u003c/span\u003e\n\n",
    "body_length": 230759,
    "citedas": [
      "12 Cal.4th 694",
      "909 P.2d 1017",
      "49 Cal.Rptr.2d 413"
    ],
    "attorneys": "Eleanor M. Kraft, under appointment by the Supreme Court, Nudell \u0026 Allen, Karen J. Nudell, Talcott, Lightfoot, Vandevelde, Woehrle \u0026 Sadowsky, Michael J. Lightfoot and John P. Martin for Petitioner. John K. Van de Kamp and Daniel E. Lungren, Attorneys General, Richard B. Iglehart and George Williamson, Chief Assistant Attorneys General, Edward T. Fogel, Jr., and Carol Wendelin Pollack, Assistant Attorneys General, Gary R. Hahn, Mark Alan Hart, Donald E. de Nicola, Mark E. Turchin, Susan Lee Frierson, Robert S. Henry and Frederick Grab, Deputy Attorneys General, for Respondent.",
    "category": [
      "36",
      "78",
      "75"
    ],
    "judges": "Opinion by Lucas, C. J., with Baxter, George, and Werdegar, JJ., Concurring. Concurring opinion by Arabian, J. Dissenting opinions by Mosk and Kennard, JJ.",
    "citation_count": 291
  }
}
