{
  "id": "HKFeR2YBTlTomsSBvf-U",
  "document": {
    "title": "Bily v. Young",
    "full_title": "ROBERT R. BILY AND v. ARTHUR YOUNG \u0026 COMPANY AND ; J. F. SHEA CO., INC., ET AL. AND V. ARTHUR YOUNG \u0026 COMPANY AND .",
    "jurisdiction": "California Supreme Court",
    "date": "1992-08-27T00:00:00.000Z",
    "docket": "No. S017199",
    "body": "We granted review to consider whether and to what extent an accountant's duty of care in the preparation of an independent audit of a client's financial statements extends to persons other than the client.\n\nSince Chief Judge Cardozo's seminal opinion in Ultramares Corp. v. Touche (1931) 255 N.Y. 170 [174 N.E. 441, 74 A.L.R. 1139] (Ultramares),\n\nthe issue before us has been frequently considered and debated by courts and commentators. Different schools of thought have emerged. At the center of the controversy are difficult questions concerning the role of the accounting profession in performing audits, the conceivably limitless scope of an accountant's liability to nonclients who may come to read and rely on audit reports, and the effect of tort liability rules on the availability, cost, and reliability of those reports.\n\nFollowing a summary of the facts and proceedings in this case, we will analyze these questions by discussing the purpose and effect of audits and audit reports, the approaches taken by courts and commentators, and the basic principles of tort liability announced in our prior cases. We conclude that an auditor\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e owes no general duty of care regarding the conduct of an audit to persons other than the client. An auditor may, however, be held liable for negligent misrepresentations in an audit report to those persons who act in reliance upon those misrepresentations in a transaction which the auditor intended to influence, in accordance with the rule of section 552 of the Restatement Second of Torts, as adopted and discussed below. Finally, an auditor may also be held liable to reasonably foreseeable third persons for intentional fraud in the preparation and dissemination of an audit report.\n\nI.\n\nSummary of Facts and Proceedings Below\n\nThis litigation emanates from the meteoric rise and equally rapid demise of Osborne Computer Corporation (hereafter the company). Founded in 1980 by entrepreneur Adam Osborne, the company manufactured the first portable personal computer for the mass market. Shipments began in 1981. By fall 1982, sales of the company's sole product, the Osborne I computer, had reached $10 million per month, making the company one of the fastest growing enterprises in the history of American business.\n\nIn late 1982, the company began planning for an early 1983 initial public offering of its stock, engaging three investment banking firms as underwriters. At the suggestion of the underwriters, the offering was postponed for several months, in part because of uncertainties caused by the company's employment of a new chief executive officer and its plans to introduce a new computer to replace the Osborne I. In order to obtain \"bridge\" financing needed to meet the company's capital requirements until the offering, the\n\ncompany issued warrants to investors in exchange for direct loans or letters of credit to secure bank loans to the company (the warrant transaction). The warrants entitled their holders to purchase blocks of the company's stock at favorable prices that were expected to yield a sizable profit if and when the public offering took place.\n\nPlaintiffs in this case were investors in the company. They include individuals as well as pension and venture capital investment funds. Several plaintiffs purchased warrants from the company as part of the warrant transaction. Others purchased the common stock of the company during early 1983. For example, one plaintiff, Robert Bily, who was also a director of the company, purchased 37,500 shares of stock from company founder Adam Osborne for $1.5 million.\n\nThe company retained defendant Arthur Young \u0026 Company (hereafter Arthur Young), one of the then-\"Big Eight\" public accounting firms, to perform audits and issue audit reports on its 1981 and 1982 financial statements. (Arthur Young has since merged with Ernst \u0026 Whinney to become Ernst \u0026 Young, now one of the \"Big Six\" accounting firms.) In its role as auditor, Arthur Young's responsibility was to review the annual financial statements prepared by the company's in-house accounting department, examine the books and records of the company, and issue an audit opinion on the financial statements.\n\nArthur Young issued unqualified or \"clean\" audit opinions on the company's 1981 and 1982 financial statements. Each opinion appeared on Arthur Young's letterhead, was addressed to the company, and stated in essence: (1) Arthur Young had performed an examination of the accompanying financial statements in accordance with the accounting profession's \"Generally Accepted Auditing Standards\" (GAAS); (2) the statements had been prepared in accordance with \"Generally Accepted Accounting Principles\" (GAAP); and (3) the statements \"present[ed] fairly\" the company's financial position. The 1981 financial statement showed a net operating loss of approximately $1 million on sales of $6 million. The 1982 financial statements included a \"Consolidated Statement of Operations\" which revealed a modest net operating profit of $69,000 on sales of more than $68 million.\n\nArthur Young's audit opinion on the 1982 financial statements was issued on February 11, 1983. The Arthur Young partner in charge of the audit personally delivered 100 sets of the professionally printed opinion to the company. With one exception, plaintiffs testified that their investments were\n\nmade in reliance on Arthur Young's unqualified audit opinion on the company's 1982 financial statements.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nAs the warrant transaction closed on April 8, 1983, the company's financial performance began to falter. Sales declined sharply because of manufacturing problems with the company's new \"Executive\" model computer. When the Executive appeared on the market, sales of the Osborne I naturally decreased, but were not being replaced because Executive units could not be produced fast enough. In June 1983, the IBM personal computer and IBM- compatible software became major factors in the small computer market, further damaging the company's sales. The public offering never materialized. The company filed for bankruptcy on September 13, 1983. Plaintiffs ultimately lost their investments.\n\nPlaintiffs brought separate lawsuits against Arthur Young in the Santa Clara County Superior Court. Plaintiffs J.F. Shea \u0026 Co., et al. (the Shea plaintiffs), brought one lawsuit; plaintiff Robert Bily brought another. The two actions were consolidated for trial. The focus of plaintiffs' claims was Arthur Young's audit and audit opinion of the company's 1982 financial statements.\n\nPlaintiffs' principal expert witness, William J. Baedecker, reviewed the 1982 audit and offered a critique identifying more than 40 deficiencies in Arthur Young's performance amounting, in Baedecker's view, to gross professional negligence. In his opinion, Arthur Young did not perform its examination in accordance with GAAS. He found the liabilities on the company's financial statements to have been understated by approximately $3 million. As a result, the company's supposed $69,000 operating profit was, in his view, a loss of more than $3 million. He also determined that Arthur Young had discovered material weaknesses in the company's accounting controls, but failed to report its discovery to management.\n\nAlthough most of Baedecker's criticisms involved matters of oversight or nonfeasance, e.g., failures to detect weaknesses in the company's accounting procedures and systems, he also charged that Arthur Young had actually discovered deviations from GAAP, but failed to disclose them as qualifications or corrections to its audit report. For example, by January 1983, a senior auditor with Arthur Young identified $1.3 million in unrecorded liabilities including failures to account for customer rebates, returns of\n\nproducts, etc. Although the auditor recommended that a letter be sent to the company's board of directors disclosing material weaknesses in the company's internal accounting controls, his superiors at Arthur Young did not adopt the recommendation; no weaknesses were disclosed. Arthur Young rendered its unqualified opinion on the 1982 statements a month later.\n\nThe case was tried to a jury for 13 weeks. At the close of the evidence and arguments, the jury received instructions and special verdict questions including three theories of recovery: fraud, negligent misrepresentation, and professional negligence. The fraud instructions required proof of an intentional misrepresentation made by defendant \"with intent to defraud the plaintiff or a particular class of persons to which plaintiff belonged.\" Similarly, the negligent misrepresentation instructions required a negligent misrepresentation made \"with the intent to induce plaintiff or a particular class of persons to which plaintiff belongs to rely on it.\"\n\nThe negligence instructions stated in part that an independent auditor has a duty to have the degree of skill and learning possessed by reputable certified public accountants in the same community and to use \"reasonable diligence and its best judgment in the exercise of its professional skill.\"\n\nWith respect to liability to third parties, negligence instructions were in accordance with International Mortgage Co. v. John P. Butler Accountancy Corp. (1986) 177 Cal. App. 3d 806 [223 Cal. Rptr. 218] to the effect that: \"An accountant owes a further duty of care to those third parties who reasonably and foreseeably rely on an audited financial statement prepared by the accountant. A failure to fulfill any such duty is negligence.\"\n\nThe jury exonerated Arthur Young with respect to the allegations of intentional fraud and negligent misrepresentation, but returned a verdict in plaintiffs' favor based on professional negligence. No comparative negligence on plaintiffs' part was found. The jury awarded compensatory damages of approximately $4.3 million, representing approximately 75 percent of each investment made by plaintiffs. The Court of Appeal affirmed the resulting judgment in plaintiffs' favor with respect to all matters relevant to the issue now before us.\n\nII.\n\nThe Audit Function in Public Accounting\n\nAlthough certified public accountants (CPA's) perform a variety of services for their clients, their primary function, which is the one that most\n\nfrequently generates lawsuits against them by third persons, is financial auditing. (Hagen, Certified Public Accountant's Liability for Malpractice: Effect of Compliance with GAAP and GAAS (1987) 13 J. Contemp. Law 65, 66 [hereafter Hagen]; Siliciano, Negligent Accounting and the Limits of Instrumental Tort Reform (1988) 86 Mich.L.Rev. 1929, 1931 [hereafter Siliciano].) \"An audit is a verification of the financial statements of an entity through an examination of the underlying accounting records and supporting evidence.\" (Hagen, supra, 13 J. Contemp. Law at p. 66.) \"In an audit engagement, an accountant reviews financial statements prepared by a client and issues an opinion stating whether such statements fairly represent the financial status of the audited entity.\" (Siliciano, supra, 86 Mich.L.Rev. at p. 1931.)\n\nIn a typical audit, a CPA firm may verify the existence of tangible assets, observe business activities, and confirm account balances and mathematical computations. It might also examine sample transactions or records to ascertain the accuracy of the client company's financial and accounting systems. For example, auditors often select transactions recorded in the company's books to determine whether the recorded entries are supported by underlying data (vouching). Or, approaching the problem from the opposite perspective, an auditor might choose particular items of data to trace through the client's accounting and bookkeeping process to determine whether the data have been properly recorded and accounted for (tracing). (Hagen, supra, 13 J. Contemp. Law at pp. 66-67, fn. 15.)\n\nFor practical reasons of time and cost, an audit rarely, if ever, examines every accounting transaction in the records of a business. The planning and execution of an audit therefore require a high degree of professional skill and judgment. Initially, the CPA firm plans the audit by surveying the client's business operations and accounting systems and making preliminary decisions as to the scope of the audit and what methods and procedures will be used. The firm then evaluates the internal financial control systems of the client and performs compliance tests to determine whether they are functioning properly. Transactions and data are sampled, vouched for, and traced. Throughout the audit process, results are examined and procedures are reevaluated and modified to reflect discoveries made by the auditors. (Hagen, supra, 13 J. Contemp. Law at pp. 67-68.) \"For example, if the auditor discovers weaknesses in the internal control system of the client, the auditor must plan additional audit procedures which will satisfy himself that the internal control weaknesses have not caused any material misrepresentations in the financial statements.\" (Ibid.)\n\nThe end product of an audit is the audit report or opinion. The report is generally expressed in a letter addressed to the client. The body of the report\n\nrefers to the specific client-prepared financial statements which are attached. In the case of the so-called \"unqualified report\" (of which Arthur Young's report on the company's 1982 financial statements is an example), two paragraphs are relatively standard.\n\nIn a scope paragraph, the CPA firm asserts that it has examined the accompanying financial statements in accordance with GAAS. GAAS are promulgated by the American Institute of Certified Public Accountants (AICPA), a national professional organization of CPA's, whose membership is open to persons holding certified public accountant certificates issued by state boards of accountancy. (Hagen, supra, 13 J. Contemp. Law at pp. 72-73.)\n\nThe GAAS include 10 broadly phrased sets of standards and general principles that guide the audit function. They are classified as general standards, standards for fieldwork, and standards of reporting. General Standard No. 1 provides: \"The examination is to be performed by a person or persons having adequate technical training as ... auditor[s].\" General Standard No. 3 provides: \"Due professional care is to be exercised in the performance of the examination and the preparation of the report.\" Standard of Fieldwork No. 2 provides: \"A sufficient understanding of the internal control structure is to be obtained to plan the audit and to determine the nature, timing, and extent of tests to be performed.\"\n\nThe generality of these statements is somewhat mitigated by the Statements on Auditing Standards (SAS), which are periodic interpretations of the standards issued by the Auditing Standards Board of the AICPA. (Miller \u0026 Bailey, Comprehensive GAAS Guide (1991) pp. 5.03, 5.11, 6.07 [hereafter GAAS Guide].) For example, SAS-55, which relates to internal financial control structure, includes steps to be followed in understanding and testing accounting control systems in relation to information provided in financial statements. (GAAS Guide at p. 7.03 et seq.) The GAAS Guide, a commonly used summary of GAAS, that purports to integrate and comprehensively restate pertinent auditing standards, includes 140 major sections and more than 1,000 pages.\n\nIn an opinion paragraph, the audit report generally states the CPA firm's opinion that the audited financial statements, taken as a whole, are in conformity with GAAP and present fairly in all material respects the financial position, results of operations, and changes in financial position of the\n\nclient in the relevant periods. (GAAS Guide at p. 11.03; Hagen, supra, 13 J. Contemp. Law at pp. 74-76.)\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nThe GAAP are an amalgam of statements issued by the AICPA through the successive groups it has established to promulgate accounting principles: the Committee on Accounting Procedure, the Accounting Principles Board, and the Financial Accounting Standards Board. Like GAAS, GAAP include broad statements of accounting principles amounting to aspirational norms as well as more specific guidelines and illustrations. The lack of an official compilation allows for some debate over whether particular announcements are encompassed within GAAP. (Hagen, supra, 13 J. Contemp. Law at pp. 74-76.) One standard text purporting to comprehensively restate GAAP includes 90 major sections and more than 500 pages. (M. Miller, GAAP Guide (1991).)\n\nIn addition to or in place of the standardized statements in an audit report, the auditing CPA firm may also qualify its opinion, noting exceptions or matters in the financial statements not in conformity with GAAP or significant uncertainties which might affect a fair evaluation of the statements. The report may also contain a disclaimer stating the accountant's inability to express any opinion about the statements or an adverse opinion that the statements do not fairly present the financial position of the client in conformity with GAAP. (Hagen, supra, 13 J. Contemp. Law at pp. 69-72.)\n\nArthur Young correctly observes that audits may be commissioned by clients for different purposes. Nonetheless, audits of financial statements and the resulting audit reports are very frequently (if not almost universally) used by businesses to establish the financial credibility of their enterprises in the perceptions of outside persons, e.g., existing and prospective investors, financial institutions, and others who extend credit to an enterprise or make risk-oriented decisions based on its economic viability. The unqualified audit report of a CPA firm, particularly one of the \"Big Six,\" is often an admission ticket to venture capital markets--a necessary condition precedent to attracting the kind and level of outside funds essential to the client's financial growth and survival. As one commentator summarizes: \"In the first instance, this unqualified opinion serves as an assurance to the client that its own\n\nperception of its financial health is valid and that its accounting systems are reliable. The audit, however, frequently plays a second major role: it assists the client in convincing third parties that it is safe to extend credit or invest in the client.\" (Siliciano, supra, 86 Mich.L.Rev. at p. 1932.)\n\nThe GAAP acknowledge that financial audit reporting is \"a principal means of communicating accounting information to those outside an enterprise.\" (Statement of Financial Accounting Concepts of the Financial Accounting Standards Board of the AICPA No. 1, P 6, p. 7.) As the AICPA recently stated: \"The independent audit, through the process of examining evidence underlying the financial statements, adds credibility to management's representations in the statements. In turn, the audit provides investors, bankers, creditors, and others with reasonable assurance that the financial statements are free of material misstatement.\" (AICPA, Understanding Audits and the Auditor's Report, A Guide for Financial Statement Users (1989) p. 36; see also Bus. \u0026 Prof. Code, ยง 5051, subd. (d) [practice of accountancy includes preparation of reports on audits for purpose of obtaining credit or filing documents with government agencies]; Cal. Code Regs., tit. 16, ยง 58.3 [accountant may not issue report on unaudited financial statements to client or others without complying with professional standards].)\n\nThe AICPA's professional standards refer to the public responsibility of auditors: \"A distinguishing mark of a profession is acceptance of its responsibility to the public. The accounting profession's public consists of clients, credit grantors, governments, employers, investors, the business and financial community, and others who rely on the objectivity and integrity of certified public accountants to maintain the orderly functioning of commerce. This reliance imposes a public interest responsibility on certified public accountants.\" (2 AICPA Professional Standards (CCH 1988) ยง 53.01.)\n\nThe United States Supreme Court had also recognized the public function of the CPA auditor as a reason to deny work product protection to the auditor's work papers. Distinguishing CPA firms from lawyers and other professionals who perform services for clients, the high court stated: \"By certifying the public reports that collectively depict a corporation's financial status, the independent auditor assumes a public responsibility transcending any employment relationship with the client. The independent public accountant performing this special function owes ultimate allegiance to the corporation's creditors and stockholders, as well as to the investing public. This 'public watchdog' function demands that the accountant maintain total independence from the client at all times and requires complete fidelity to\n\nthe public trust.\" (United States v. Arthur Young \u0026 Co. (1984) 465 U.S. 805, 817-818 [79 L.Ed.2d 826, 835-837, 104 S.Ct. 1495].)\n\nIII.\n\nApproaches to the Problem of Auditor Liability to Third Persons\n\nThe complex nature of the audit function and its economic implications has resulted in different approaches to the question whether CPA auditors should be subjected to liability to third parties who read and rely on audit reports. Although three schools of thought are commonly recognized, there are some variations within each school and recent case law suggests a possible trend toward merger of two of the three approaches.\n\nA substantial number of jurisdictions follow the lead of Chief Judge Cardozo's 1931 opinion for the New York Court of Appeals in Ultramares, supra, 174 N.E. 441, by denying recovery to third parties for auditor negligence in the absence of a third party relationship to the auditor that is \"akin to privity.\" (See pt. III(A), post.) In contrast, a handful of jurisdictions, spurred by law review commentary, have recently allowed recovery based on auditor negligence to third parties whose reliance on the audit report was \"foreseeable.\" (See pt. III(B), post.)\n\nMost jurisdictions, supported by the weight of commentary and the modern English common law decisions cited by the parties, have steered a middle course based in varying degrees on Restatement Second of Torts section 552, which generally imposes liability on suppliers of commercial information to third persons who are intended beneficiaries of the information. (See pt. III(C), post.) Finally, the federal securities laws have also dealt with the problem by imposing auditor liability for negligence-related conduct only in connection with misstatements in publicly filed and distributed offering documents. (See pt. III(D), post.)\n\nIn this section we will review and briefly analyze each of the recognized approaches to the problem before us.\n\nA. Privity of Relationship\n\nIn Ultramares, supra, 174 N.E. 441, plaintiff made three unsecured loans totalling $165,000 to a company that went bankrupt. Plaintiff sued the company's auditors, claiming reliance on their audit opinion that the company's balance sheet \"present[ed] a true and correct view of the financial condition of [the company].\" ( at p. 442.) Although the balance sheet\n\nshowed a net worth of $1 million, the company was actually insolvent. The company's management attempted to mask its financial condition; the auditors failed to follow paper trails to \"off-the-books\" transactions that, if properly analyzed, would have revealed the company's impecunious situation.\n\nThe jury, precluded by the trial Judge from considering a fraud cause of action, returned a verdict in plaintiff's favor based on the auditor's negligence in conducting the audit. The New York Court of Appeals, speaking through Chief Judge Cardozo, reinstated the fraud cause of action but set aside the negligence verdict.\n\nThe auditor in Ultramares knew the company was in need of capital and that its audit opinion would be displayed to third parties \"as the basis of financial dealings.\" (Ultramares, supra, 174 N.E. at p. 442.) In this regard, it supplied to the company 32 copies of the opinion \"with serial numbers as counterpart originals.\" (Ibid.) Plaintiff's name, however, was not mentioned to the auditor nor was the auditor told about any actual or proposed credit or investment transactions in which its audit opinion would be presented to a third party.\n\nWith respect to the negligence claim, the court found the auditor owed no duty to the third party creditor for an \"erroneous opinion.\" In an often quoted passage, it observed: \"If liability for negligence exists, a thoughtless slip or blunder, the failure to detect a theft or forgery beneath the cover of deceptive entries, may expose accountants to a liability in an indeterminate amount for an indeterminate time to an indeterminate class. The hazards of a business conducted on these terms are so extreme as to enkindle doubt whether a flaw may not exist in the implication of a duty that exposes to these consequences.\" (Ultramares, supra, 174 N.E. at p. 444.)\n\nAlthough acknowledging the demise of privity of contract as a limitation on tort liability in the context of personal injury and property damage, the court distinguished between liability arising from a \"physical force\" and \"the circulation of a thought or the release of the explosive power resident in words.\" (Ultramares, supra, 174 N.E. at p. 445.) It also distinguished its own prior decision in Glanzer v. Shepherd (1922) 233 N.Y. 236 [135 N.E. 275, 23 A.L.R. 1425], in which a seller of beans requested the operator of a public scale to give a certificate of weight to the buyer. When the certificate proved inaccurate and the buyer sued, the court held the operator liable for negligence. As the court explained, the difference between the cases was that \"the transmission of the certificate [in Glanzer ] was not merely one possibility among many, but the ' end and aim of the transaction,' as certain and\n\nimmediate and deliberately willed as if a husband were to order a gown to be delivered to his wife, or a telegraph company, contracting with the sender of a message, were to telegraph it wrongly to the damage of the person expected to receive it.\" (174 N.E. at p. 445, italics added.)\n\nIn summarizing its holding, the court emphasized that it was not releasing auditors from liability to third parties for fraud but merely for \"honest blunder.\" (Glanzer v. Shepherd, supra, 174 N.E. at p. 448.) It questioned \"whether the average business man receiving a certificate without paying for it, and receiving it as one of a multitude of possible investors, would look for anything more.\" (Ibid.)\n\nIn cases following Ultramares, the New York Court of Appeals has not required privity of contract as a universal prerequisite to third party suits against auditors; rather, on occasion, it has found an equivalent privity of relationship between the auditor and the plaintiff. For example, in White v. Guarente (1977) 43 N.Y.2d 356 [401 N.Y.S.2d 474, 372 N.E.2d 315], one of 40 limited partners sued the partnership's auditor for professional negligence in failing to disclose in an audit report that the general partners had withdrawn funds from the partnership in violation of the partnership agreement. Observing: (1) the limited partnership agreement contained an express provision requiring an annual audit by a CPA; and (2) the CPA had also prepared the partnership's tax returns on which the limited partners relied in preparing their personal returns, the court found a duty on the part of the CPA to exercise due care for the benefit of the limited partners.\n\nDistinguishing Ultramares, the court commented that the \"services of the accountant were not extended to a faceless or unresolved class of persons, but rather to a known group possessed of vested rights, marked by a definable limit and made up of certain components.\" (White v. Guarente, supra, 372 N.E.2d at p. 318.) Following Glanzer v. Shepherd, supra, 135 N.E. 275, it found the furnishing of the audit and tax return information to be \"one of the ends and aims\" of the CPA's engagement and \"within the contemplation of the parties to the accounting retainer.\" (372 N.E. at p. 319.)\n\nThe New York Court of Appeals restated the law in light of Ultramares, White v. Guarente, and other cases in Credit Alliance v. Arthur Andersen \u0026 Co. (1985) 65 N.Y.2d 536 [493 N.Y.S.2d 435, 483 N.E.2d 110]. Credit Alliance subsumed two cases with different factual postures: in the first case, plaintiff alleged it loaned funds to the auditor's client in reliance on audited financial statements overstating the client's assets and net worth; in the second, the same scenario occurred, but plaintiff also alleged the auditor knew plaintiff was the client's principal lender and communicated directly\n\nand frequently with plaintiff regarding its continuing audit reports. The court dismissed plaintiff's negligence claim in the first case, but sustained the claim in the second.\n\nThe New York court promulgated the following rule for determining auditor liability to third parties for negligence: \"Before accountants may be held liable in negligence to noncontractual parties who rely to their detriment on inaccurate financial reports, certain prerequisites must be satisfied: (1) the accountant must have been aware that the financial reports were to be used for a particular purpose or purposes; (2) in the furtherance of which a known party or parties was intended to rely; and (3) there must have been some conduct on the part of the accountants linking them to that party or parties, which evinces the accountants' understanding of that party or parties' reliance.\" (Credit Alliance v. Arthur Andersen \u0026 Co., supra, 483 N.E.2d at p. 118.)\n\nDiscussing the application of its rule to the cases at hand, the court observed the primary, if not exclusive, \"end and aim\" of the audits in the second case was to satisfy the lender. The auditor's \"direct communications and personal meetings [with the lender] result[ed] in a nexus between them sufficiently approaching privity.\" (Credit Alliance v. Arthur Andersen \u0026 Co., supra, 483 N.E.2d at p. 120.) In contrast, in the first case, although the complaint did allege the auditor knew or should have known of the lender's reliance on its reports: \"There was no allegation of either a particular purpose for the reports' preparation or the prerequisite conduct on the part of the accountants ... [nor] any allegation [the auditor] had any direct dealings with plaintiffs, had agreed with [the client] to prepare the report for plaintiffs' use or according to plaintiffs' requirements, or had specifically agreed with [the client] to provide plaintiffs with a copy [of the report] or actually did so.\" (Credit Alliance v. Arthur Andersen \u0026 Co., supra, 483 N.E.2d at p. 119.)\n\nThe evolution of the New York rule illustrates a primary difficulty of articulating a standard of auditor liability to third parties: As one moves from privity of contract to privity of relationship, a wide variety of possible circumstances and relationships emerges. From preengagement communications with its client, an auditor may acquire full knowledge of third party recipients of the audit report and a specific investment or credit transaction that constitutes the \"end and aim\" of the audit. As a consequence, the auditor is placed on notice of a specific risk of liability that accompanies the audit engagement. Yet, under the Credit Alliance test, the auditor appears to have no liability in this situation in the absence of further, distinct conduct \"linking\" the auditor to the third party in a manner that \"evinces [auditor]\n\nunderstanding\" of third party reliance. (Credit Alliance v. Arthur Andersen \u0026 Co., supra, 483 N.E.2d at p. 118.)\n\nThe New York court offers no rationale for the distinct \"linking\" element of its rule nor does it specify what conduct is required to satisfy this element, although direct communications between auditor and third party were deemed sufficient on the facts. One might question whether \"linking\" conduct should be necessary if, as in the example given in the previous paragraph, the auditor knows his engagement is for the express purpose of benefiting an identifiable class of third parties. Indeed, the New York court's previous decision in White v. Guarente, supra, 372 N.E.2d 315, poses a case in which the auditor knew the audit was to be conducted for the benefit of the limited partners as required by the client's partnership agreement, but was not \"linked\" to the limited partners in any other significant way. In such cases, \"linkage\" is arguably achieved by the auditor's conduct in undertaking and carrying out the engagement with knowledge of its specific purpose and the ultimate use to be made of the audit report. (See Credit Alliance v. Arthur Andersen \u0026 Co., supra, commenting on White v. Guarente as follows: \"Indeed, as a member of the limited partnership and as a specifically intended beneficiary of the partnership's contract with the accountants, the limited partner might well have been considered actually in privity with the accountants.\" (483 N.E.2d at p. 117, fn. 9.)\n\nThe \"linking conduct\" element of the New York rule will undoubtedly be defined more precisely as New York case law continues to develop. Although the first two elements of the rule (and the New York court's decision in White v. Guarente) are functionally similar to Restatement Second of Torts section 552, the \"linking conduct\" element appears to require not only that the existence of the third person be known to the auditor, but that the auditor either directly convey the audit report to the third person or otherwise act in some manner specifically calculated to induce reliance on the report. (See Haddon View Inv. Co. v. Coopers \u0026 Lybrand (1982) 70 Ohio St.2d 154 [24 Ohio Ops.2d 268, 436 N.E.2d 212, 214- 215]; First Nat. Bank of Commerce v. Monco Agency Inc. (5th Cir. 1990) 911 F.2d 1053, 1060.) In this regard, a mere \"unsolicited phone call\" by the third party to the auditor is insufficient. The auditor must be aware of a \"particular purpose\" for the audit engagement and must act to further that purpose. (Security Pacific Business Credit, Inc. v. Peat Marwick Main \u0026 Co. (1992) 79 N.Y.2d 695, 705-707 [586 N.Y.S.2d 87, 597 N.E.2d 1080].) This additional showing is not required by the Restatement test, which is discussed in part III(C), post.\n\nFrom the cases cited by the parties, it appears at least nine states purport to follow privity or near privity rules restricting the liability of auditors to\n\nparties with whom they have a contractual or similar relationship. In five states, this result has been reached by decisions of their highest courts.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e In four other states, the rule has been enacted by statute.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Federal court decisions have held that the rule represents the law of three additional states whose highest courts have not expressly considered the question.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e The more recent of the cited cases generally follow the New York rule as reformulated in Credit Alliance.\n\nB. Foreseeability\n\nArguing that accountants should be subject to liability to third persons on the same basis as other tortfeasors, Justice Howard Wiener advocated rejection of the rule of Ultramares in a 1983 law review article. (Wiener, Common Law Liability of the Certified Public Accountant for Negligent Misrepresentation (1983) 20 San Diego L.Rev. 233 [hereafter Wiener].) In its place, he proposed a rule based on foreseeability of injury to third persons. Criticizing what he called the \"anachronistic protection\" given to accountants by the traditional rules limiting third person liability, he concluded: \"Accountant liability based on foreseeable injury would serve the dual functions of compensation for injury and deterrence of negligent conduct. Moreover, it is a just and rational judicial policy that the same criteria govern the imposition of negligence liability, regardless of the context in which it arises. The accountant, the investor, and the general public will in the long run benefit when the liability of the certified public accountant for negligent misrepresentation is measured by the foreseeability standard.\" ( at p. 260.) Under the rule proposed by Justice Wiener, \"[f]oreseeability of the risk would be a question of fact for the jury to be disturbed on appeal only where there is insufficient evidence to support the finding.\" ( at pp. 256-257.)\n\nFollowing in part Justice Wiener's approach, the New Jersey Supreme Court upheld a claim for negligent misrepresentation asserted by stock purchasers against an auditor who had rendered an unqualified audit report approving fraudulently prepared financial statements. (Rosenblum v. Adler (1983) 93 N.J. 324 [461 A.2d 138, 35 A.L.R.4th 199].) The court found no\n\nreason to distinguish accountants from other suppliers of products or services to the public and no reason to deny to third party users of financial statements recovery for economic loss resulting from negligent misrepresentation. ( at pp. 142-146.) From its review of the purpose and history of the audit function, it concluded: \"The auditor's function has expanded from that of a watchdog for management to an independent evaluator of the adequacy and fairness of financial statements issued by management to stockholders, creditors, and others.\" ( at p. 149.) Noting the apparent ability of accounting firms to obtain insurance against third party claims under the federal securities laws, the court posited the same or similar protection would be available for common law negligent misrepresentation claims. (Ibid.)\n\nFrom a public policy standpoint, the court emphasized the potential deterrent effect of a liability-imposing rule on the conduct and cost of audits: \"The imposition of a duty to foreseeable users may cause accounting firms to engage in more thorough reviews. This might entail setting up stricter standards and applying closer supervision, which should tend to reduce the number of instances in which liability would ensue. Much of the additional cost incurred either because of more thorough auditing review or increased insurance premiums would be borne by the business entity and its stockholders or its customers.\" (Rosenblum v. Adler, supra, 461 A.2d at p. 152.)\n\nNotwithstanding its broad pronouncements about the public role of auditors and the importance of deterring negligence by imposing liability, when the New Jersey court formulated a rule of liability it restricted the auditor's duty to \"all those whom that auditor should reasonably foresee as recipients from the company of the statements for its proper business purposes, provided that the recipients rely on the statements pursuant to those business purposes.\" (Rosenblum v. Adler, supra, 461 A.2d at p. 153, italics added.) According to the court, its rule would preclude auditor liability to \"an institutional investor or portfolio manager who does not obtain audited statements from the company\" or to \"stockholders who purchased the stock after a negligent audit\" unless they could demonstrate \"the necessary conditions precedent.\" (Ibid.)\n\nThe New Jersey court offered no principled basis for its \"conditions precedent\" requirement. Institutional investors, portfolio managers, or prospective stock purchasers who may pick up an audit report from a stockbroker, friend, or acquaintance or otherwise acquire it indirectly are no less \"foreseeable\" users. In view of the lack of any effective limits on access to audit reports once they reach the client, an auditor can foresee its reports coming into the hands of practically anyone. Thus, the court's approach evinces an Ultramares -like concern about the prospect of unlimited auditor\n\nliability, but offers no reasoned explanation of its decision to establish a limit based solely on the company's distribution, a factor over which the auditor has no control.\n\nTwo other state high courts--those of Wisconsin and Mississippi--have endorsed foreseeability rules. In Citizens State Bank v. Timm, Schmidt \u0026 Co. (1983) 113 Wis.2d 376 [335 N.W.2d 361], the Wisconsin Supreme Court relied on compensation, risk- spreading, and deterrence rationales, commenting: \"Unless liability is imposed, third parties who rely on the accuracy of financial statements will not be protected. Unless an accountant can be held liable to a relying third party, this negligence will go undeterred. ... If relying third parties, such as creditors, are not allowed to recover, the cost of credit to the general public will increase because creditors will either have to absorb the cost of bad loans made in reliance on faulty information or hire independent accountants to verify the information received. Accountants may spread the risk through the use of liability insurance.\" ( at p. 365.) Notwithstanding its adoption of the foreseeability rule, the Wisconsin court left open the prospect that \"public policy\" factors inherent in the particular case might call for a limitation of liability, declining to decide that issue on summary judgment. ( at pp. 366-367.)\n\nIn Touche Ross v. Commercial Union Ins. (Miss. 1987) 514 So.2d 315, the Mississippi Supreme Court was also confronted with a negligent audit claim. Although the court adopted a foreseeability rule, the precedential value of its decision is limited by two circumstances: (1) the court's statement of the rule is dictum; it held there was no liability on the part of the auditor because the loss suffered by the third party resulted from criminal conduct occurring after the audit ( at pp. 323-325); and (2) even within the context of the court's Discussion of foreseeability, its reasoning was based in large part on a unique Mississippi statute precluding the application of privity as an element of all tort actions, including those claiming economic loss. ( at p. 321.)\n\nIn addition to these out-of-state cases, the Court of Appeal in International Mortgage Co. v. John Butler Accountancy Corp., supra, 177 Cal. App. 3d 806, also adopted, with certain variations, a foreseeability approach. That decision will be discussed in the next part of this opinion.\n\nIn the nearly 10 years since it was formally proposed, the foreseeability approach has not attracted a substantial following. And at least four state supreme courts have explicitly rejected the foreseeability approach in favor\n\nof the Restatement's \"intended beneficiary\" approach since the New Jersey court's decision in Rosenblum.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nThe foreseeability approach has also encountered substantial criticism from commentators, who have questioned, among other matters, its failure to consider seriously the problem of indeterminate liability and its prediction of a significant deterrent effect that will improve the quality of audit reporting. Other commentators have disagreed. The body of scholarly and practical literature is substantial.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nC. The Restatement: Intent to Benefit Third Persons\n\nSection 552 of the Restatement Second of Torts covers \"Information Negligently Supplied for the Guidance of Others.\" It states a general principle that one who negligently supplies false information \"for the guidance of others in their business transactions\" is liable for economic loss suffered by the recipients in justifiable reliance on the information. (Id., subd. (1).) But the liability created by the general principle is expressly limited to loss suffered: \"(a) [B]y the person or one of a limited group of persons for whose benefit and guidance he intends to supply the information or knows that the recipient intends to supply it; and (b) through reliance upon it in a transaction that he intends the information to influence or knows that the recipient so intends or in a substantially similar transaction.\" (Id., subd. (2).) To paraphrase, a supplier of information is liable for negligence to a third party only if he or she intends to supply the information for the benefit of one or more third parties in a specific transaction or type of transaction identified to the supplier.\n\nComment (h) to subdivision (2) of section 552, Restatement Second of Torts, observes that the liability of a negligent supplier of information is appropriately more narrowly restricted than that of an intentionally fraudulent supplier. It also notes that a commercial supplier of information has a\n\nlegitimate concern as to the nature and scope of the client's transactions that may expand the supplier's exposure liability. As the comment states: \"In many situations the identity of the person for whose guidance the information is supplied is of no moment to the person who supplies it, although the number and character of the persons to be reached and influenced, and the nature and extent of the transaction for which guidance is furnished may be vitally important. This is true because the risk of liability to which the supplier subjects himself by undertaking to give the information, while it may not be affected by the identity of the person for whose guidance the information is given, is vitally affected by the number and character of the persons, and particularly the nature and the extent of the proposed transaction.\" (Ibid., italics added.)\n\nTo offer a simple illustration of comment (h) to subdivision (2) of section 552, Restatement Second of Torts, an auditor engaged to perform an audit and render a report to a third person whom the auditor knows is considering a $10 million investment in the client's business is on notice of a specific potential liability. It may then act to encounter, limit or avoid the risk. In contrast, an auditor who is simply asked for a generic audit and report to the client has no comparable notice.\n\nThe authors of the Restatement Second of Torts offer several variations on the problem before us as illustrations of section 552. For example, the auditor may be held liable to a third party lender if the auditor is informed by the client that the audit will be used to obtain a $50,000 loan, even if the specific lender remains unnamed or the client names one lender and then borrows from another. (Com. (h), illus. 6, 7.) However, there is no liability where the auditor agrees to conduct the audit with the express understanding the report will be transmitted only to a specified bank and it is then transmitted to other lenders. (Com. (h), illus. 5.) Similarly, there is no liability when the client's transaction (as represented to the auditor) changes so as to increase materially the audit risk, e.g., a third person originally considers selling goods to the client on credit and later buys a controlling interest in the client's stock, both in reliance on the auditor's report. (Com. (j) and illus. 14.)\n\nUnder the Restatement rule, an auditor retained to conduct an annual audit and to furnish an opinion for no particular purpose generally undertakes no duty to third parties. Such an auditor is not informed \"of any intended use of the financial statements; but ... knows that the financial statements, accompanied by an auditor's opinion, are customarily used in a wide variety of financial transactions by the [client] corporation and that they may be relied upon by lenders, investors, shareholders, creditors, purchasers and the like,\n\nin numerous possible kinds of transactions. [The client corporation] uses the financial statements and accompanying auditor's opinion to obtain a loan from [a particular] bank. Because of [the auditor's] negligence, he issues an unqualifiedly favorable opinion upon a balance sheet that materially misstates the financial position of [the corporation] and through reliance upon it [the bank] suffers pecuniary loss.\" (Rest.2d Torts, ยง 552, com. (h), illus. 10.) Consistent with the text of section 552, the authors conclude: \"[The auditor] is not liable to [the bank].\" (Ibid.)\n\nAlthough the parties debate precisely how many states follow the Restatement rule, a review of the cases reveals the rule has somewhat more support than the privity of relationship rule and much more support than the foreseeability rule. At least 17 state and federal decisions have endorsed the rule in this and related contexts.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Whatever the exact number of states that have endorsed it, the Restatement rule has been for many, if not most, courts a satisfactory compromise between their discomfort with the traditional privity approach and the \"specter of unlimited liability.\" (Briggs v. Sterner (S.D.Iowa 1981) 529 F.Supp. 1155, 1177.)\n\nIn attempting to ascertain the presence of an intent to benefit third parties from the facts of particular audit engagements and communications with auditors, the Restatement rule inevitably results in some degree of uncertainty. Dean William L. Prosser, the Reporter for the Restatement, reflected on the difficulty of formulating a comprehensive rule in this area: \"The problem is to find language which will eliminate liability to the very large class of persons whom almost any negligently given information may foreseeably reach and influence, and limit the liability, not to a particular plaintiff defined in advance, but to the comparatively small group whom the defendant expects and intends to influence. Neither the Reporter, nor, it is believed, the Advisers nor the Council, is entirely satisfied with the language\n\nof Subsection (2); and if anyone can do better, it will be most welcome.\" (Rest.2d Torts, Tent. Draft No. 11 (Apr. 15, 1965) ยง 552, p. 56.)\n\nD. Federal Securities Law\n\nAuditors may also incur liability to third persons under the federal securities law. Under section 10(b) of the Securities Exchange Act of 1934 (1934 Act) and rule 10(b)-5 of the Securities and Exchange Commission (SEC), accountants may be held liable to actual purchasers or sellers of securities for fraud or gross negligence. (15 U.S.C. ยง 78j(b); see Ernst \u0026 Ernst v. Hochfelder (1976) 425 U.S. 185 [47 L.Ed.2d 668, 96 S.Ct. 1375]; Blue Chip Stamps v. Manor Drug Stores (1975) 421 U.S. 723 [44 L.Ed.2d 539, 95 S.Ct. 1917].)\n\nAccountants may incur liability to third parties without a showing of fraud or gross negligence under section 18 of the 1934 Act, 15 United States Code section 78r, or section 11 of the Securities Act of 1933 (1933 Act), 15 United States Code section 77k. Section 11 of the 1933 Act provides in part: \"In case any part of the registration statement ... contained an untrue statement of a material fact or omitted to state a material fact required to be stated therein or necessary to make the statements therein not misleading, any person acquiring such security (unless it is proved that at the time of such acquisition he knew of such untruth or omission) may, either at law or in equity, in any court of competent jurisdiction sue--... (4) every accountant, engineer, or appraiser, or any person whose profession gives authority to a statement made by him, who has with his consent been named as having prepared or certified any part of the registration statement, or as having prepared or certified any report or valuation which is used in connection with the registration statement, with respect to the statement in such registration statement, report, or valuation, which purports to have been prepared or certified by him.\" (15 U.S.C. ยง 77k(a)(4).) An accountant or other professional within the scope of section 11 can escape liability for a false or misleading statement by proving due diligence, i.e., that after \"reasonable investigation\" he or she had \"reasonable ground to believe and did believe\" that the statement was \"true and not misleading.\" (Id., ยง 77k(b)(3).)\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nThe liability of accountants and other professionals to third parties under section 11 of the 1933 Act is circumscribed by several factors: (1) the\n\naccountant's liability is limited to situations in which he or she prepares or certifies the accuracy of a portion of a registration statement and thus is aware he or she is creating part of a communication to the public ; (2) liability is limited to third parties who actually purchase securities; (3) damage exposure is limited to the out-of- pocket loss suffered by the purchaser and can be no greater than the amount of the offering. (15 U.S.C. ยง 77k(a), (e) and (g).) Thus, under section 11: \"[T]he plaintiff class, the proof of violation, and the measure of damages are statutorily defined in a manner that enhances the accountant's ability to gauge, ex ante, its liability exposure.\" (Siliciano, supra, 86 Mich.L.Rev. at p. 1954, fn. 131, italics in original.)\n\nSection 18 of the 1934 Act imposes liability on accountants for misstatements contained in documents filed with the SEC. Liability is limited to third persons who, in reliance on the accountant's statement, \"have purchased or sold a security at a price which was affected by such statement, for damages caused by such reliance.\" (15 U.S.C. ยง 78r(a).) The accountant may successfully defend the action by proving that \"he acted in good faith and had no knowledge that such statement was false or misleading.\" (Ibid.)\n\nIn summary, under the federal securities laws, an auditor's liability to third persons on theories akin to common law negligence is limited to those situations in which the third party suffers a loss in the purchase or sale of a security in reliance on an auditor's misstatement in a public registration statement or other public document filed with the SEC for use in connection with an identified securities registration. In these situations, the auditor is placed on notice of the extent of its potential liability exposure.\n\nIV.\n\nAnalysis of Auditor's Liability to Third Persons for Audit Opinions\n\n\"Every person is bound, without contract, to abstain from injuring the person or property of another, or infringing upon any of his rights.\" (Civ. Code, ยง 1708; all further statutory references are to this code unless otherwise indicated.) Civil liability for injury to others is imposed based on causes of action in tort, which include, insofar as relevant to this case: negligence, negligent misrepresentation, and fraud.\n\nA. Negligence\n\n\"[N]egligence is conduct which falls below the standard established by law for the protection of others.\" (Rest.2d Torts, ยง 282.) \"Every one is\n\nresponsible, not only for the result of his willful acts, but also for an injury occasioned to another by his want of ordinary care or skill in the management of his property or person, except so far as the latter has, willfully or by want of ordinary care, brought the injury upon himself.\" (ยง 1714, subd. (a).)\n\nThe threshold element of a cause of action for negligence is the existence of a duty to use due care toward an interest of another that enjoys legal protection against unintentional invasion. (Rest.2d Torts, ยง 281, subd. (a); 6 Witkin, Summary of Cal. Law (9th ed. 1988), Torts, ยง 732, p. 60.) Whether this essential prerequisite to a negligence cause of action has been satisfied in a particular case is a question of law to be resolved by the court. (6 Witkin, supra, ยง 748 at p. 83.)\n\nA judicial Conclusion that a duty is present or absent is merely \" 'a shorthand statement ... rather than an aid to analysis .... \"[D]uty,\" is not sacrosanct in itself, but only an expression of the sum total of those considerations of policy which lead the law to say that the particular plaintiff is entitled to protection.' \" (Dillon v. Legg (1968) 68 Cal. 2d 728, 734 [69 Cal. Rptr. 72, 441 P.2d 912, 29 A.L.R.3d 1316], quoting Prosser, Law of Torts (3d ed.) pp. 332-333.) \"Courts, however, have invoked the concept of duty to limit generally 'the otherwise potentially infinite liability which would follow from every negligent act ....' \" (Thompson v. County of Alameda (1980) 27 Cal. 3d 741, 750 [167 Cal. Rptr. 70, 614 P.2d 728, 12 A.L.R.4th 701], quoting Dillon, supra, 68 Cal. 2d at p. 739.)\n\nWe have employed a checklist of factors to consider in assessing legal duty in the absence of privity of contract between a plaintiff and a defendant. In Biakanja v. Irving (1958) 49 Cal. 2d 647 [320 P.2d 16, 65 A.L.R.2d 1358], a notary public undertook to prepare a will for the decedent and then negligently failed to have it properly attested. We allowed the decedent's brother, the sole beneficiary under the will, to recover from the notary public. In permitting negligence liability to be imposed in the absence of privity, we outlined the factors to be considered in making such a decision: \"The determination whether in a specific case the defendant will be held liable to a third person not in privity is a matter of policy and involves the balancing of various factors, among which are the extent to which the transaction was intended to affect the plaintiff, the foreseeability of harm to him, the degree of certainty that the plaintiff suffered injury, the closeness of the connection between the defendant's conduct and the injury suffered, the moral blame attached to the defendant's conduct, and the policy of preventing future harm. ... Here, the 'end and aim' of the transaction was to provide for the passing of [the] estate to plaintiff. ... Defendant must have been aware from the terms of the will itself that, if faulty solemnization\n\ncaused the will to be invalid, plaintiff would suffer the very loss which occurred. As [decedent] died without revoking his will, plaintiff, but for defendant's negligence, would have received all of the ... estate, and the fact that she received only one-eighth of the estate was directly caused by defendant's conduct.\" ( at pp. 650-651.)\n\nViewing the problem before us in light of the factors set forth above, we decline to permit all merely foreseeable third party users of audit reports to sue the auditor on a theory of professional negligence. Our holding is premised on three central concerns: (1) Given the secondary \"watchdog\" role of the auditor, the complexity of the professional opinions rendered in audit reports, and the difficult and potentially tenuous causal relationships between audit reports and economic losses from investment and credit decisions, the auditor exposed to negligence claims from all foreseeable third parties faces potential liability far out of proportion to its fault; (2) the generally more sophisticated class of plaintiffs in auditor liability cases (e.g., business lenders and investors) permits the effective use of contract rather than tort liability to control and adjust the relevant risks through \"private ordering\"; and (3) the asserted advantages of more accurate auditing and more efficient loss spreading relied upon by those who advocate a pure foreseeability approach are unlikely to occur; indeed, dislocations of resources, including increased expense and decreased availability of auditing services in some sectors of the economy, are more probable consequences of expanded liability.\n\nIn a broad sense, economic injury to lenders, investors, and others who may read and rely on audit reports is certainly \"foreseeable.\" Foreseeability of injury, however, is but one factor to be considered in the imposition of negligence liability. Even when foreseeability was present, we have on several recent occasions declined to allow recovery on a negligence theory when damage awards threatened to impose liability out of proportion to fault or to promote virtually unlimited responsibility for intangible injury.\n\nIn placing explicit limits on recovery for negligent infliction of emotional distress by accident bystanders, we commented: \" '[F]oreseeability' ... 'is endless because [it], like light, travels indefinitely in a vacuum.' \" (Thing v. La Chusa (1989) 48 Cal. 3d 644, 659 [257 Cal. Rptr. 865, 771 P.2d 814].) \" '[It] proves too much. ... Although it may set tolerable limits for most types of physical harm, it provides virtually no limit on liability for non-physical harm.' ... It is apparent that reliance on foreseeability of injury alone in finding a duty, and thus a right to recover, is not adequate when the damages sought are for an intangible injury. In order to avoid limitless liability out of all proportion to the degree of a defendant's negligence, and\n\nagainst which it is impossible to insure without imposing unacceptable costs on those among whom the risk is spread, the right to recover for negligently caused emotional distress must be limited.\" ( at pp. 663-664, citations omitted.)\n\nEmphasizing the important role of policy factors in determining negligence, we observed that \"there are clear judicial days on which a court can foresee forever and thus determine liability but none on which that foresight alone provides a socially and judicially acceptable limit on recovery of damages for [an] injury.\" (Thing v. LaChusa, supra, 48 Cal. 3d at p. 668; see also Nally v. Grace Community Church (1988) 47 Cal. 3d 278, 297 [253 Cal. Rptr. 97, 763 P.2d 948] [\"Mere foreseeability of the harm or knowledge of the danger, is insufficient to create a legally cognizable special relationship giving rise to a legal duty to prevent harm.\"]; Elden v. Sheldon (1988) 46 Cal. 3d 267, 274 [250 Cal. Rptr. 254, 758 P.2d 582] [\"[P]olicy considerations may dictate a cause of action should not be sanctioned no matter how foreseeable the risk ... for the sound reason that the consequences of a negligent act must be limited in order to avoid an intolerable burden on society.\"].)\n\nIn line with our recent decisions, we will not treat the mere presence of a foreseeable risk of injury to third persons as sufficient, standing alone, to impose liability for negligent conduct. We must consider other pertinent factors.\n\n1. Liability Out of Proportion to Fault\n\nAn auditor is a watchdog, not a bloodhound. (In re Kingston Cotton Mill Co. (1896) 2 Ch. 279, 288.) As a matter of commercial reality, audits are performed in a client-controlled environment. The client typically prepares its own financial statements; it has direct control over and assumes primary responsibility for their contents. (See In re Interstate Hosiery Mills, Inc. (1939) 4 S.E.C. 721 [\"The fundamental and primary responsibility for the accuracy [of financial statements] rests upon management.\"].) The client engages the auditor, pays for the audit, and communicates with audit personnel throughout the engagement. Because the auditor cannot in the time available become an expert in the client's business and record-keeping systems, the client necessarily furnishes the information base for the audit.\n\nThe client, of course, has interests in the audit that may not be consonant with those of the public. \"Management seeks to maximize the stockholders' and creditors' confidence in the company, within the bounds of [GAAP and GAAS]; whereas, the public demands a sober and impartial evaluation of\n\nfiscal performance.\" (First Nat. Bank of Commerce v. Monco Agency Inc., supra, 911 F.2d at p. 1058.)\n\nClient control also predominates in the dissemination of the audit report. Once the report reaches the client, the extent of its distribution and the communications that accompany it are within the exclusive province of client management. Thus, regardless of the efforts of the auditor, the client retains effective primary control of the financial reporting process.\n\nMoreover, an audit report is not a simple statement of verifiable fact that, like the weight of the load of bean in Glanzer v. Shepherd, supra, 135 N.E. 275, can be easily checked against uniform standards of indisputable accuracy. Rather, an audit report is a professional opinion based on numerous and complex factors. As discussed in part II above, the report is based on the auditor's interpretation and application of hundreds of professional standards, many of which are broadly phrased and readily subject to different constructions. Although ultimately expressed in shorthand form, the report is the final product of a complex process involving discretion and judgment on the part of the auditor at every stage. Using different initial assumptions and approaches, different sampling techniques, and the wisdom of 20-20 hindsight, few CPA audits would be immune from criticism. (Siliciano, supra, 86 Mich.L. Rev. at p. 1956, fn. 137.)\n\nAlthough the auditor's role in the financial reporting process is secondary and the subject of complex professional judgment, the liability it faces in a negligence suit by a third party is primary and personal and can be massive. The client, its promoters, and its managers have generally left the scene, headed in most cases for government-supervised liquidation or the bankruptcy court. The auditor has now assumed center stage as the remaining solvent defendant and is faced with a claim for all sums of money ever loaned to or invested in the client. Yet the auditor may never have been aware of the existence, let alone the nature or scope, of the third party transaction that resulted in the claim.\n\nThe character of the damages claimed from the auditor--economic loss resulting from investment and credit decisions--introduces further uncertainties into the negligence suit against the auditor. An award of damages for pure economic loss suffered by third parties raises the spectre of vast numbers of suits and limitless financial exposure.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nInvestment and credit decisions are by their nature complex and multifaceted. Although an audit report might play a role in such decisions, reasonable\n\nand prudent investors and lenders will dig far deeper in their \"due diligence\" investigations than the surface level of an auditor's opinion. And, particularly in financially large transactions, the ultimate decision to lend or invest is often based on numerous business factors that have little to do with the audit report. The auditing CPA has no expertise in or control over the products or services of its clients or their markets; it does not choose the client's executives or make its business decisions; yet, when clients fail financially, the CPA auditor is a prime target in litigation claiming investor and creditor economic losses because it is the only available (and solvent) entity that had any direct contact with the client's business affairs. (Siliciano, supra, 86 Mich.L.Rev. at pp. 1932-1933.)\n\nThe facts of this case provide an apt example. Although plaintiffs now profess reliance on Arthur Young's audit report as the sine qua non of their investments, the record reveals a more complicated decisionmaking process. As a group of corporate insiders and venture capitalists who were closely following the Cinderella-like transformation of the company, plaintiffs perceived an opportunity to make a large sum of money in a very short time by investing in a company they believed would (literally within months) become the dominant force in the new personal computer market.\n\nAlthough hindsight suggests they misJudged a number of major factors (including, at a minimum, the product, the market, the competition, and the company's manufacturing capacity), plaintiffs' litigation-focused attention is now exclusively on the auditor and its report. Plaintiffs would have us believe that, had the Arthur Young report disclosed deficiencies in accounting controls and the $3 million loss (on income of over $68 million), they would have ignored all the other positive factors that triggered their interest (such as the company's rapid growth in sales, its dynamic management, and the intense interest of underwriters in a public offering) and flatly withheld all their funds. Plaintiffs' revisionist view of the company's history, the audit, and their own investments, suggests something less than a \"close connection\" between Arthur Young's audit report and the loss of their invested funds. (Biakanja v. Irving, supra, 49 Cal. 2d at p. 650.)\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nIn view of the factors discussed above, judicial endorsement of third party negligence suits against auditors limited only by the concept of\n\nforseeability raises the spectre of multibillion-dollar professional liability that is distinctly out of proportion to: (1) the fault of the auditor (which is necessarily secondary and may be based on complex differences of professional opinion); and (2) the connection between the auditor's conduct and the third party's injury (which will often be attenuated by unrelated business factors that underlie investment and credit decisions).\n\nAs other courts and commentators have noted, such disproportionate liability cannot fairly be justified on moral, ethical, or economic grounds. (Siliciano, supra, 86 Mich.L.Rev. at pp. 1944-1945 and cases cited therein; Gormley, supra, 14 Seton Hall L.Rev. at pp. 552-553.) As one commentator has summarized: \"The most persuasive basis for maintaining the limited duty [of auditors] is a proportionality argument. ... It can be argued as a general proposition in these cases that the wrongdoing of an accountant is slight compared with that of the party who has deceived him (his client) as well as the plaintiff. This rationale for nonliability is similar to the proximate cause grounds on which willful intervening misconduct insulates a 'merely negligent' party from liability.\" (Rabin, supra, 37 Stan.L.Rev. at pp. 1536-1537, fn. 74.)\n\n2. The Prospect of Private Ordering\n\nCourts advocating unlimited auditor liability to all foreseeably injured third parties often analogize the auditor's opinion to a consumer product, arguing that the demise of privity as a barrier to recovery for negligence in product manufacture implies its irrelevance in the area of auditor liability as well. (See, e.g., Rosenblum v. Adler, supra, 461 A.2d at pp. 145-147.) Plaintiffs advance similar arguments. The analogy lacks persuasive force for two reasons. Initially, as noted above, the maker of a consumer product has complete control over the design and manufacture of its product; in contrast,\n\nthe auditor merely expresses an opinion about its client's financial statements--the client is primarily responsible for the content of those statements in the form they reach the third party.\n\nMoreover, the general character of the class of third parties is also different. Investors, creditors, and others who read and rely on audit reports and financial statements are not the equivalent of ordinary consumers. Like plaintiffs here, they often possess considerable sophistication in analyzing financial information and are aware from training and experience of the limits of an audit report \"product\" that is, at bottom, simply a broadly phrased professional opinion based on a necessarily confined examination.\n\nIn contrast to the \"presumptively powerless consumer\" in product liability cases, the third party in an audit negligence case has other options--he or she can \"privately order\" the risk of inaccurate financial reporting by contractual arrangements with the client. (Siliciano, supra, 86 Mich.L.Rev. at pp. 1956-1957.) For example, a third party might expend its own resources to verify the client's financial statements or selected portions of them that were particularly material to its transaction with the client. Or it might commission its own audit or investigation, thus establishing privity between itself and an auditor or investigator to whom it could look for protection. In addition, it might bargain with the client for special security or improved terms in a credit or investment transaction. Finally, the third party could seek to bring itself within the Glanzer exception to Ultramares by insisting that an audit be conducted on its behalf or establishing direct communications with the auditor with respect to its transaction with the client. (Siliciano, supra, 86 Mich.L.Rev. at pp. 1956-1957.)\n\nAs a matter of economic and social policy, third parties should be encouraged to rely on their own prudence, diligence, and contracting power, as well as other informational tools. This kind of self-reliance promotes sound investment and credit practices and discourages the careless use of monetary resources. If, instead, third parties are simply permitted to recover from the auditor for mistakes in the client's financial statements, the auditor becomes, in effect, an insurer of not only the financial statements, but of bad loans and investments in general.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\n3. The Effect on Auditors of Negligence Liability to Third Persons\n\nCourts and commentators advocating auditor negligence liability to third parties also predict that such liability might deter auditor mistakes, promote more careful audits, and result in a more efficient spreading of the risk of inaccurate financial statements. For example, the New Jersey Supreme Court reasoned: \"The imposition of a duty to foreseeable users may cause accounting firms to engage in more thorough reviews. This might entail setting up stricter standards and applying closer supervision, which would tend to reduce the number of instances in which liability would ensue. Much of the additional cost incurred because of more thorough auditing review or increased insurance premiums would be borne by the business entity and its stockholders or its customers. ... Accountants will also be encouraged to exercise greater care leading to greater diligence in audits.\" (Rosenblum v. Adler, supra, 461 A.2d at p. 152.)\n\nWe are not directed to any empirical data supporting these prognostications. From our review of the cases and commentary, we doubt that a significant and desirable improvement in audit care would result from an expanded rule of liability. Indeed, deleterious economic effects appear at least as likely to occur.\n\nIn view of the inherent dependence of the auditor on the client and the labor-intensive nature of auditing, we doubt whether audits can be done in ways that would yield significantly greater accuracy without disadvantages. (Siliciano, supra, 86 Mich.L.Rev. at pp. 1963-1968.) Auditors may rationally respond to increased liability by simply reducing audit services in fledgling industries where the business failure rate is high, reasoning that they will inevitably be singled out and sued when their client goes into bankruptcy regardless of the care or detail of their audits. As a legal economist described the problem: \"The deterrent effect of liability rules is the difference between the probability of incurring liability when performance meets the required standard and the probability of incurring liability when performance is below the required standard. Thus, the stronger the probability that liability will be incurred when performance is adequate, the weaker is the deterrent effect of liability rules. Why offer a higher quality product if you will be sued regardless whenever there is a precipitous decline in stock prices?\" (Fischel, The Regulation of Accounting: Some Economic Issues (1987) 52 Brooklyn L. Rev. 1051, 1055.) Consistent with this reasoning, the economic result of unlimited negligence liability could just as easily be an increase in the cost\n\nand decrease in the availability of audits and audit reports with no compensating improvement in overall audit quality. ( at pp. 1055-1056; Siliciano, supra, 86 Mich.L.Rev. at pp. 1960-1965.)\n\nIn light of the relationships between auditor, client, and third party, and the relative sophistication of third parties who lend and invest based on audit reports, it might also be doubted whether auditors are the most efficient absorbers of the losses from inaccuracies in financial information.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e Investors and creditors can limit the impact of losses by diversifying investments and loan portfolios. They effectively constitute a \"broad social base upon which the costs of accounting errors can be spread.\" (Siliciano, supra, 86 Mich.L.Rev. at p. 1973.) In the audit liability context, no reason appears to favor the alleged tortfeasor over the alleged victim as an effective distributor of loss. (; Bilek, supra, 39 Sw.L.J. at pp. 705-707.)\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nPlaintiffs argue that the kinds of factors we have discussed can be adequately assessed by the triers of fact on a case-by-case basis. According to the argument, if the auditor's error is economically insignificant or the causal relationship between reliance on the audit report and financial injury is too attenuated, the trier of fact will simply find \"no negligence\" or \"no proximate cause.\" We are not so confident. In applying the Biakanja factors (supra, 49 Cal. 2d 647), we are necessarily required to make pragmatic assessments of the consequences of recognizing and enforcing particular legal duties. In our judgment, a foreseeability rule applied in this context inevitably produces large numbers of expensive and complex lawsuits of questionable merit as scores of investors and lenders seek to recoup business losses. In view of the prospects of vast if not limitless liability for the \"thoughtless slip or blunder,\" the availability of other efficient means of self-protection for a generally sophisticated class of plaintiffs, and the dubious benefits of a broad rule of liability, we opt for a more circumscribed approach. In so doing, we seek to deter careless audit reporting while avoiding the spectre of a level of liability that is morally and economically excessive.\n\nThe Dissent acknowledges, as we do, the complexity of the problem before us and the necessity of a legislative process of study, debate, experimentation, and careful rulemaking. In view of the nature of the problem, we refrain from endorsing a broad and amorphous rule of potentially unlimited liability that has been endorsed by only a small minority of the decided cases. As we recently stated: \"In the absence of clear legislative direction ... we are unwilling to engage in complex economic regulation under the guise of judicial decisionmaking.\" (Harris v. Capital Growth Investors XIV (1991) 52 Cal. 3d 1142, 1168 \u0026 fn. 15 [278 Cal. Rptr. 614, 805 P.2d 873].)\n\nFor the reasons stated above, we hold that an auditor's liability for general negligence in the conduct of an audit of its client financial statements is confined to the client, i.e., the person who contracts for or engages the audit services. Other persons may not recover on a pure negligence theory.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nThere is, however, a further narrow class of persons who, although not clients, may reasonably come to receive and rely on an audit report and\n\nwhose existence constitutes a risk of audit reporting that may fairly be imposed on the auditor. Such persons are specifically intended beneficiaries of the audit report who are known to the auditor and for whose benefit it renders the audit report. While such persons may not recover on a general negligence theory, we hold they may, for the reasons stated in part IV(B) post, recover on a theory of negligent misrepresentation.\n\nThe sole client of Arthur Young in the audit engagements involved in this case was the company. None of the plaintiffs qualify as clients.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e Under the rule we adopt, they are not entitled to recover on a pure negligence theory. Therefore, the verdict and judgment in their favor based on that theory are reversed.\n\nB. Negligent Misrepresentation\n\nOne difficulty in considering the problem before us is that neither the courts (ourselves included), the commentators, nor the authors of the Restatement Second of Torts have made clear or careful distinctions between the tort of negligence and the separate tort of negligent misrepresentation. The distinction is important not only because of the different statutory bases of the two torts, but also because it has practical implications for the trial of cases in complex areas such as the one before us.\n\nNegligent misrepresentation is a separate and distinct tort, a species of the tort of deceit. \"Where the defendant makes false statements, honestly believing that they are true, but without reasonable ground for such belief, he may be liable for negligent misrepresentation, a form of deceit.\" (5 Witkin, Summary of Cal. Law (9th ed. 1988) Torts, ยง 720 at p. 819; see also ยง 1572, subd. 2 [\"[t]he positive assertion, in a manner not warranted by the information of the person making it, of that which is not true, though he believes it\n\nto be true\"]; ยง 1710, subd. 2 [\"[t]he assertion, as a fact, of that which is not true, by one who has no reasonable ground for believing it to be true\"].)\n\nUnder certain circumstances, expressions of professional opinion are treated as representations of fact. When a statement, although in the form of an opinion, is \"not a casual expression of belief\" but \"a deliberate affirmation of the matters stated,\" it may be regarded as a positive assertion of fact. (Gagne v. Bertran (1954) 43 Cal. 2d 481, 489 [275 P.2d 15].) Moreover, when a party possesses or holds itself out as possessing superior knowledge or special information or expertise regarding the subject matter and a plaintiff is so situated that it may reasonably rely on such supposed knowledge, information, or expertise, the defendant's representation may be treated as one of material fact. (Gagne v. Bertran, supra, 43 Cal. 2d at p. 489; Cohen v. S \u0026 S Construction Company (1983) 151 Cal. App. 3d 941, 946 [201 Cal. Rptr. 173]; see also 5 Witkin, Summary of Cal. Law, supra, Torts, ยง 680 at pp. 781-782; BAJI No. 12.32.) There is no dispute that Arthur Young's statements in audit opinions fall within these principles.\n\nBut the person or \"class of persons entitled to rely upon the representations is restricted to those to whom or for whom the misrepresentations were made. Even though the defendant should have anticipated that the misinformation might reach others, he is not liable to them.\" (5 Witkin, Summary of Cal. Law, supra, Torts, ยง 721 at p. 820; Rest.2d Torts, ยง 552, coms. (g) and (h); Christiansen v. Roddy (1986) 186 Cal. App. 3d 780, 785- 787 [231 Cal. Rptr. 72 [appraiser who negligently evaluated property for mortgage company not liable to investors in a loan secured by the property].)\n\nOf the approaches we have reviewed, Restatement Second of Torts section 552, subdivision (b) is most consistent with the elements and policy foundations of the tort of negligent misrepresentation. The rule expressed there attempts to define a narrow and circumscribed class of persons to whom or for whom representations are made. In this way, it recognizes commercial realities by avoiding both unlimited and uncertain liability for economic losses in cases of professional mistake and exoneration of the auditor in situations where it clearly intended to undertake the responsibility of influencing particular business transactions involving third persons. The Restatement rule thus appears to be a sensible and moderate approach to the potential consequences of imposing unlimited negligence liability which we have identified.\n\nWe recognize the rule expressed in the Restatement Second of Torts has been criticized in some quarters as vague and potentially arbitrary. In his article advocating a foreseeability rule, Justice Wiener generally criticized\n\nthe Restatement rule as resting \"solely on chance considerations\" and \"fortuitousness\" (e.g., the \"state of the mind of the accountant\" and the scope of his engagement) having, in his view, nothing to do with increasing the flow of accurate information. (Wiener, supra, 20 San Diego L.Rev. at p. 252.)\n\nWe respectfully disagree. In seeking to identify a specific class of persons and a transaction that the supplier of information \"intends the information to influence,\" the authors of the Restatement Second of Torts have applied basic factors of tort liability recognized in this state and elsewhere (see Biakanja, supra, 49 Cal. 2d 647). By confining what might otherwise be unlimited liability to those persons whom the engagement is designed to benefit, the Restatement rule requires that the supplier of information receive notice of potential third party claims, thereby allowing it to ascertain the potential scope of its liability and make rational decisions regarding the undertaking. The receipt of such notice justifies imposition of auditor liability for conduct that is merely negligent.\n\nMoreover, the identification of a limited class of plaintiffs to whom the supplier itself has directed its activity establishes a closer connection between the supplier's negligent act and the recipient's injury, thereby ameliorating the otherwise difficult concerns of causation and of credible evidence of reliance. Finally, no unfairness results to those recipients who are excluded from the class of beneficiaries because they have means of private ordering--among other things, they can establish direct communication with an auditor and obtain a report for their own direct use and benefit. For these reasons, the rule expressed in the Restatement Second of Torts represents a reasoned, not an arbitrary, approach to the problem before us.\n\nAdditional criticism has been leveled at the Restatement approach because of the vagueness of its \"intent to benefit\" language. As we read section 552 of the Restatement Second of Torts, it does not seek to probe the state of mind of the accountant or other supplier of information. Rather, it attempts to identify those situations in which the supplier undertakes to supply information to a third party whom he or she knows is likely to rely on it in a transaction that has sufficiently specific economic parameters to permit the supplier to assess the risk of moving forward. As the authors of section 552 observe, liability should be confined to cases in which the supplier \" manifests an intent to supply the information for the sort of use in which the plaintiff's loss occurs.\" (Id., com. (a), italics added.) This follows because the \"risk of liability to which the supplier subjects himself by undertaking to give the information ... is vitally affected by the number and character of the persons, and particularly the nature and extent of the proposed transaction.\" (Id., com. (h); italics added.)\n\nThe \"intent to benefit\" language of the Restatement Second of Torts thus creates an objective standard that looks to the specific circumstances (e.g., supplier-client engagement and the supplier's communications with the third party) to ascertain whether a supplier has undertaken to inform and guide a third party with respect to an identified transaction or type of transaction. If such a specific undertaking has been made, liability is imposed on the supplier. If, on the other hand, the supplier \"merely knows of the ever-present possibility of repetition to anyone, and the possibility of action in reliance upon [the information] on the part of anyone to whom it may be repeated,\" the supplier bears no legal responsibility. (Rest.2d Torts, ยง 552, com. (h).)\n\nThe Restatement Second of Torts approach is also the only one that achieves consistency in the law of negligent misrepresentation. Accountants are not unique in their position as suppliers of information and evaluations for the use and benefit of others. Other professionals, including attorneys, architects, engineers, title insurers and abstractors, and others also perform that function. And, like auditors, these professionals may also face suits by third persons claiming reliance on information and opinions generated in a professional capacity.\n\nIn a series of decisions, our Courts of Appeal have endorsed liability for negligence or negligent misrepresentation in the dissemination of commercial information to persons who were \"intended beneficiaries\" of the information. In several of these cases, section 552 of the Restatement Second of Torts was consulted or relied on as a general statement of the rule of law. We review several typical examples.\n\nA lender loaned money to a partnership. When the loan was not repaid, the lender sued lawyers retained by the partnership, alleging in part they had negligently prepared and delivered to their client for transmission to the lender an opinion letter expressing the erroneous view that the partnership was a general partnership composed of 14 general partners. The lender's complaint alleged that the lawyer and law firm \"knew and understood that [the opinion letter] was to be shown to [the lender] in order to induce [it] to make loans to [the partnership].\" (Roberts v. Ball, Hunt, Hart, Brown \u0026 Baerwitz (1976) 57 Cal. App. 3d 104, 107 [128 Cal. Rptr. 901].) The court held the complaint stated a cause of action, observing: \"[A] legal opinion intended to secure benefit for the client, either monetary or otherwise, must be issued with due care, or the attorneys who do not act carefully will have breached a duty owed to those they attempted or expected to influence on behalf of their clients.\" ( at p. 111, italics added.)\n\nIn another action, purchasers of stock from a lawyer's clients sued the lawyer, alleging he had negligently advised his clients the stock could be\n\nissued as dividends and sold to the purchasers without jeopardizing an exemption from registration of the stock pursuant to federal securities laws. The SEC later suspended the exemption, causing the purchased stock to lose value. In contrast to Roberts, there was no allegation the legal advice was ever communicated to plaintiffs or relied on by them in purchasing the stock. (Goodman v. Kennedy (1976) 18 Cal. 3d 335, 343 [134 Cal. Rptr. 375, 556 P.2d 737].) In upholding a dismissal of the purchasers' complaint following the sustaining of demurrers without leave to amend, we distinguished Roberts, characterizing it as a case in which \"an attorney gives his client a written opinion with the intention that it be transmitted to and relied upon by the plaintiff in dealing with the client.\" ( at p. 343, fn. 1.) We further observed: \"In that situation the attorney owes the plaintiff a duty of care in providing the advice because the plaintiff's anticipated reliance upon it is 'the end and aim of the transaction.' \" (Ibid., citing Glanzer v. Shepherd, supra, 135 N.E. 275, italics added.)\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nPlaintiffs ask us to read Goodman consistently with their foreseeability theory of liability. They point to language that the attorney owed no duty of care to the purchasers \"in the absence of any showing that the legal advice was foreseeably transmitted to or relied upon by plaintiffs or that plaintiffs were intended beneficiaries of a transaction to which the advice pertained.\" (Goodman v. Kennedy, supra, 18 Cal. 3d at p. 339.) Seizing on the \"foreseeably transmitted\" language, plaintiffs maintain we were describing two distinct theories of liability--an \"opinion letter model\" and a \"third party beneficiary model.\" They then reason their case falls within the first model because an audit report is analogous to an opinion letter. Assuming the analogy were apt, we cannot reasonably read Goodman so broadly. In Goodman, there was no transmission of any of the attorney's allegedly ill-conceived advice to any plaintiff, foreseeable or unforeseeable. Thus, our \"foreseeably transmitted\" language was merely dictum designed to emphasize the weakness of plaintiff's position in that case.\n\nOther than International Mortgage Co. v. John P. Butler Accountancy Corp., supra, 177 Cal. App. 3d 806, plaintiffs cite no California case in which the court has recognized a cause of action for professional negligence or negligent misrepresentation on behalf of a third party except those that fit what they call the \"third party beneficiary model.\" As in Roberts and Goodman, California courts have consistently required some manifestation on the part of a professional who offers an opinion, information, or advice\n\nthat he or she is acting to benefit a third party or defined group of third parties in a specific and circumscribed transaction.\n\nThus, in Burger v. Pond (1990) 224 Cal. App. 3d 597 [273 Cal. Rptr. 709], the court held that a husband's second wife could not sustain a claim against the husband's attorney for negligence in dissolving the husband's first marriage. The court observed the attorney never agreed \"implicitly or explicitly to perform legal services intended directly to benefit\" the second wife. ( at p. 607.) Although the summary judgment showed the second wife was present in the attorney's office during consultations with the husband about the dissolution, and that the lawyer was informed of their plans for marriage and children as soon as the first marriage was dissolved, these facts were deemed insufficient to create a triable issue of fact. The court held that the attorney was employed by the husband alone to benefit him alone by procuring a dissolution of his marriage. As the court remarked: \" '[F]oreseeability' is not a substitute for legal duty.\" ( at p. 606.)\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nSimilarly, in a series of cases involving title insurers and abstractors, the Courts of Appeal have applied Restatement Second of Torts section 552 and its intended beneficiary standard to determine whether liability to third parties would be imposed. In these cases, the \"title companies were found liable only to persons (1) for whose guidance information was supplied; (2) who justifiably relied on the information; and, most importantly, (3) who were intended to be influenced by the communication. Intent to influence is a threshold issue. In its absence there is no liability even though a plaintiff has relied on the misrepresentation to his or her detriment, and even if such reliance were reasonably foreseeable.\" (Stagen v. Stewart-West Coast Title Co. (1983) 149 Cal. App. 3d 114, 121- 122 [196 Cal. Rptr. 732], italics added.)\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nHaving determined that intended beneficiaries of an audit report are entitled to recovery on a theory of negligent misrepresentation, we must consider whether they may also recover on a general negligence theory. We conclude they may not. Nonclients of the auditor are connected with the audit only through receipt of and express reliance on the audit report. Similarly, the gravamen of the cause of action for negligent misrepresentation in this context is actual, justifiable reliance on the representations in that report. Without such reliance, there is no recovery regardless of the manner in which the audit itself was conducted. (See Garcia v. Superior Court (1990) 50 Cal. 3d 728, 737 [268 Cal. Rptr. 779, 789 P.2d 960] (maj. opn.), 741-744 (Lucas, C. J., conc.) [both opinions emphasizing importance of justifiable reliance element in cause of action for negligent misrepresentation based on furnishing false information].)\n\nBy allowing recovery for negligent misrepresentation (as opposed to mere negligence), we emphasize the indispensability of justifiable reliance on the statements contained in the report. As the jury instructions in this case illustrate, a general negligence charge directs attention to defendant's level of care and compliance with professional standards established by expert testimony, as opposed to plaintiff's reliance on a materially false statement made by defendant.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e The reliance element in such an instruction is only implicit--it must be argued and considered by the jury as part of its evaluation of the causal relationship between defendant's conduct and plaintiff's injury. In contrast, an instruction based on the elements of negligent misrepresentation necessarily and properly focuses the jury's attention on the truth or falsity of the audit report's representations and plaintiff's actual and justifiable reliance on them. Because the audit report, not the audit itself, is the foundation of the third person's claim, negligent misrepresentation more precisely captures the gravamen of the cause of action and more clearly conveys the elements essential to a recovery. (Garcia v. Superior Court, supra, 50 Cal. 3d at p. 737, 741-744.)\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nBased on our decision, the California standard jury instructions concerning negligent misrepresentation should be amended in future auditor liability\n\ncases to permit the jury to determine whether plaintiff belongs to the class of persons to whom or for whom the representations in the audit report were made. For the guidance of trial courts, we suggest the jury be instructed on the elements of negligent misrepresentation as set forth in BAJI No. 12.45 with the addition of the following instruction in lieu of BAJI No. 12.50:\n\n\"The representation must have been made with the intent to induce plaintiff, or a particular class of persons to which plaintiff belongs, to act in reliance upon the representation in a specific transaction, or a specific type of transaction, that defendant intended to influence. Defendant is deemed to have intended to influence [its client's] transaction with plaintiff whenever defendant knows with substantial certainty that plaintiff, or the particular class of persons to which plaintiff belongs, will rely on the representation in the course of the transaction. If others become aware of the representation and act upon it, there is no liability even though defendant should reasonably have foreseen such a possibility.\"\n\nBy suggesting the above instruction, we do not preclude additional or alternative instructions consistent with our decision and the law of negligent misrepresentation.\n\nIn adopting the approach of Restatement Second of Torts section 552, subdivision (2) regarding the plaintiff or group of plaintiffs who may sue for negligent misrepresentation, we do not necessarily endorse other provisions of section 552 or of the Restatement or their terminology describing the torts of negligent and intentional misrepresentation. In California, the elements of the misrepresentation torts (which are also denominated forms of \"deceit\") are prescribed by statute (ยง 1572; 1710) and our common law tradition. Our decision effects no change in those traditional elements; it merely describes the category of plaintiffs who may recover provided all other elements are satisfied.\n\nMoreover, we do not suggest the question of intent to benefit a third party will inevitably involve a question of fact. If competent evidence does not permit a reasonable inference that the auditor supplied its report with knowledge of the existence of a specific transaction or a well-defined type of transaction which the report was intended to influence, the auditor is not placed on notice of the risks of the audit engagement. In such cases,\n\nsummary adjudication will be appropriate because plaintiff will not, as a matter of law, fall within the class of intended beneficiaries.\n\nC. Intentional Misrepresentation\n\nAs Chief Judge Cardozo recognized in Ultramares, supra, 174 N.E. 441, the liability of auditors to third parties presents different policy considerations when intentional fraud is involved. The secondary position of the auditor in the presentation of financial statements, the moral force of the argument against unlimited liability for mere errors or oversights and the uncertain connection between investment and credit losses and the auditor's report pale as policy factors when intentional misconduct is in issue. By joining with its client in an intentional deceit, the auditor thrusts itself into a primary and nefarious role in the transaction.\n\nIn this context, the auditor's actual knowledge of the false or baseless character of its opinion is not required: \"If the defendant has no belief in the truth of the statement, and makes it recklessly, without knowing whether it is true or false, the element of scienter is satisfied.\" (5 Witkin, Summary of Cal. Law, supra, Torts, ยง 705 at pp. 806-807; ยง 1572, subd. 1 [fraud includes \"[t]he suggestion, as a fact, of that which is not true, by one who does not believe it to be true\"]; ยง 1710, subd. 1.)\n\nWe are directed to no authority that would immunize auditors from liability to third parties for intentional misrepresentation; the general rule appears to be to the contrary. (Rest.2d Torts, ยง 531 [\"One who makes a fraudulent misrepresentation is subject to liability to the persons or class of persons whom he intends or has reason to expect to act or to refrain from action in reliance upon the misrepresentation, for pecuniary loss suffered by them through their justifiable reliance in the type of transaction in which he intends or has reason to expect their conduct to be influenced.\"].)\n\nConsistent with our analysis, the elements of the tort of intentional misrepresentation as set forth in BAJI No. 12.31 should be supplemented with the following instruction in lieu of BAJI No. 12.50:\n\n\"The representation must have been made with the intent to defraud plaintiff, or a particular class of persons to which plaintiff belongs, whom defendant intended or reasonably should have foreseen would rely upon the representation. One who makes a representation with intent to defraud the public or a particular class of persons is deemed to have intended to defraud every individual in that category who is actually misled thereby.\" (See BAJI No. 12.50 [third alternative]; ยง 1711.)\n\nAgain, as explained in our Discussion of negligent misrepresentation, additional or alternative instructions consistent with our decision may be appropriate.\n\nV.\n\nDisposition\n\nThis case was tried on the assumption that the general negligence rule and foreseeability approach of International Mortgage Co. v. John P. Butler Accountancy Corp., supra, 177 Cal. App. 3d 806, represented California law. The jury was instructed in accordance with that approach. For the reasons stated above, we have rejected the rule of International Mortgage Co. in favor of a negligent misrepresentation rule substantially in accord with section 552 of the Restatement Second of Torts. As a result, plaintiffs' judgment based on the general negligence rule must be set aside. Because plaintiffs were not clients of Arthur Young, they were not entitled to recover on a general negligence theory.\n\nArthur Young has requested that we remand this case to the Court of Appeal with instructions to enter judgment in its favor. With one exception, we accede to the request. As explained above, plaintiffs' verdict for general negligence must be reversed. The jury also rejected plaintiffs' causes of action for negligent misrepresentation and intentional fraud. Although it was not instructed in accordance with the rules we have announced here, the jury was told Arthur Young could be held liable for misrepresentation to \"plaintiff or a particular class of persons to which plaintiff belonged.\" If anything, these general instructions are more favorable to plaintiffs than the ones required by our decision, which more narrowly and specifically defines the \"class of persons\" entitled to recover.\n\nMoreover, with one exception discussed in the next paragraph, plaintiffs did not cross-appeal from the judgment with respect to any issue regarding the negligent and intentional misrepresentation causes of action. Having failed to demonstrate prejudicial error in the trial of those causes of action, plaintiffs are not entitled to a retrial. (Cal. Const., art. VI, ยง 13.)\n\nThe Shea plaintiffs, but not plaintiff Bily, cross-appealed from the adverse judgment on their misrepresentation causes of action, arguing the trial court improperly refused to instruct the jury on Arthur Young's liability as aider and abettor of the company's alleged fraud. Because of its Disposition of the appeal, the Court of Appeal did not reach the merits of the Shea plaintiffs' cross-appeal. On remand, the Court of Appeal shall decide the cross-appeal and direct judgment or further proceedings as appropriate and consistent with this opinion.\n\nFor the reasons stated above, the judgment of the Court of Appeal is reversed and this case is remanded with instructions to: (1) direct judgment in favor of defendant Arthur Young and against plaintiff Bily; and (2) decide the cross-appeal of the Shea plaintiffs and then to direct judgment or further proceedings as appropriate, consistent with our opinion.\n\nPanelli, J., Arabian, J., Baxter, J., and George, J., concurred.\n\nDisposition\n\nFor the reasons stated above, the judgment of the Court of Appeal is reversed and this case is remanded with instructions to: (1) direct judgment in favor of defendant Arthur Young and against plaintiff Bily; and (2) decide the cross-appeal of the Shea plaintiffs and then to direct judgment or further proceedings as appropriate, consistent with our opinion.\n\nI Dissent.\n\nDefendant, one of the nation's largest certified public accounting firms, wrote an audit report expressing its unqualified opinion that a corporation's financial statements fairly presented its financial condition and had been prepared in conformity with generally accepted accounting principles. Defendant printed 100 copies of this report and gave them to the corporation, which in turn gave copies to potential investors, including plaintiffs. Many of these investors relied on defendant's report when deciding to invest in the corporation.\n\nThe audited financial statements contained material errors that defendant would have discovered had it performed a reasonably careful audit using generally accepted auditing standards. As a result of defendant's carelessness, many investors incurred significant losses when the corporation became bankrupt. A jury reviewed the evidence, found that defendant had been negligent, and awarded damages to those plaintiffs who had relied on defendant's audit report. The principal question is whether defendant was under a duty to exercise due care to protect plaintiffs, as foreseeable users of the audit report, from injury resulting from their reliance on defendant's unqualified opinion.\n\nThe majority concludes that defendant owed plaintiffs no duty. Rummaging in the archives of legal history, amidst the debris of discarded dogmas, the majority retrieves and revives, as an element of a cause of action for negligence, the requirement of privity, which this court had described more than 20 years ago as \"virtually abandoned in California.\" (Heyer v. Flaig (1969) 70 Cal. 2d 223, 227 [74 Cal. Rptr. 225, 449 P.2d 161].) Under the strict version of the privity rule that the majority adopts, an accountant's liability for professional negligence in the conduct of an audit \"is confined to the client\" who retained the accountant to audit its financial statements. (Maj. opn., ante, p. 406.)\n\nTurning to plaintiffs' cause of action for negligent misrepresentation, the majority adopts a rule that is equally arbitrary in operation and only slightly less restrictive than the rule it adopts for negligence liability. The majority holds that an accountant is liable to a third party for negligent misrepresentation in an audit report only if the third party relied on the misrepresentation in a transaction that the accountant intended to influence.\n\nThe effect of these holdings is to give negligent accountants broad immunity for their professional malpractice in rendering audit opinions.\n\nIn defining the scope of duty in negligence cases, courts must balance competing concerns. The burden imposed by the duty should bear some reasonable relation to the moral fault of the negligent party and should not be so onerous that those held liable are unwilling or financially unable to engage in socially beneficial activity. On the other hand, tort liability is itself socially beneficial to the extent that it provides both an incentive for due care, thereby preventing avoidable injuries, and compensation for those who have been injured. Courts should not define a legal duty so narrowly as to preclude these positive effects of tort liability, as the majority has done in this case.\n\nLenders and investors use the reports prepared by independent auditors so widely, and rely on them so heavily, that it is difficult to conceive how our complex modern capital markets would function if they were no longer available or no longer able to inspire confidence. In weighing the competing policy considerations that factor into a decision defining the scope of the accountant's duty in this context, a court must seek to fashion a rule that, without making the provision of auditing services prohibitively risky, ensures that the quality of those critically important services will be maintained at a high level. Such a rule is necessary so that lenders and investors will continue to have confidence in audited financial reports and so that the usual and foreseeable users of audit reports will receive fair compensation when they have been victimized by the occasional failure of an accountant to meet prevailing professional norms.\n\nIn my view, the law that has existed in this state until today strikes the proper balance. Until today, California law had recognized that accountants owe a duty of care to all persons who reasonably and foreseeably rely on accountants' professional opinions. (International Mortgage Co. v. John P. Butler Accountancy Corp. (1986) 177 Cal. App. 3d 806 [223 Cal. Rptr. 218].) Extending the duty to all such users provides a necessary incentive for due care in the conduct of audits and in the preparation of audit reports, and ensures fair compensation to innocent victims of auditors' negligence. Unlike the majority, I am not persuaded that the duty so defined has excessively burdened the accounting profession, or that it has caused or is likely to cause a significant reduction in the availability of auditing services. Even if these unfortunate consequences could be demonstrated, the remedy should come in the form of carefully crafted legislation, not wholesale curtailment of legal duty.\n\nI\n\nUnlike the majority, I would not adopt one rule for negligence liability and a different rule for liability under the conceptually distinct but factually\n\nrelated theory of negligent misrepresentation. Under these two liability theories, essentially the same standard of care is applied to the same conduct by the accountant. Given this overlap, it is anomalous to hold that the class of persons to whom the accountant owes a duty varies depending on which legal theory has been pleaded. Although the focus of this separate opinion is the theory of negligence, an analysis under the theory of negligent misrepresentation would yield the same result.\n\nAny Discussion of the scope of negligence liability in this state ought to begin with the following basic rule that our Legislature established long ago: \"Every one is responsible, not only for the result of his [or her] willful acts, but also for an injury occasioned to another by his [or her] want of ordinary care or skill in the management of his [or her] property or person, except so far as the latter has, willfully or by want of ordinary care, brought the injury upon himself [or herself].\" (Civ. Code, ยง 1714, subd. (a).) Under this rule, an individual who has acted negligently is liable for all reasonably foreseeable injuries caused by that negligence. To this rule of general liability, courts will make only those exceptions that are \"clearly supported by public policy.\" (Rowland v. Christian (1968) 69 Cal. 2d 108, 112 [70 Cal. Rptr. 97, 443 P.2d 561, 32 A.L.R.3d 496]; accord, Burgess v. Superior Court (1992) 2 Cal. 4th 1064, 1079 [9 Cal. Rptr. 2d 615, 831 P.2d 1197]; Christensen v. Superior Court (1991) 54 Cal. 3d 868, 885 [2 Cal. Rptr. 2d, 79]820 2d 181.\n\nUnder the fundamental principle governing the scope of negligence liability, accountants are liable for all reasonably foreseeable injuries caused by the negligent performance of their professional duties. This would necessarily include injuries to foreseeable users like the plaintiffs in this case. If negligent accountants are to be granted special dispensation from the general scope of liability, this dispensation must be justified by considerations of public policy.\n\nTo determine whether public policy justifies a limitation on the scope of the duty owed in a particular context, courts consider these factors: \"the foreseeability of harm to the plaintiff, the degree of certainty that the plaintiff suffered injury, the closeness of the connection between the defendant's conduct and the injury suffered, the moral blame attached to the defendant's conduct, the policy of preventing future harm, the extent of the burden to the defendant and consequences to the community of imposing a duty to exercise care with resulting liability for breach, and the availability, cost, and prevalence of insurance for the risk involved.\" (Rowland v. Christian, supra, 69 Cal. 2d 108, 113; see also Burgess v. Superior Court, supra, 2 Cal. 4th 1079, 1080; Thompson v. County of Alameda (1980) 27 Cal. 3d 741, 750 [167 Cal. Rptr. 70, 614 P.2d 728, 12 A.L.R.4th 701]; Tarasoff v. Regents\n\nof University of California (1976) 17 Cal. 3d 425, 434 [131 Cal. Rptr. 14, 551 P.2d 334, 83 A.L.R.3d 1166]; Biakanja v. Irving (1958) 49 Cal. 2d 647, 650 [320 P.2d 16, 65 A.L.R.2d 1358].) Therefore, the rule established by the majority, granting negligent accountants special dispensation from liability, must be evaluated by reference to these policy considerations.\n\nA. Harm to Third Persons Is Foreseeable\n\nWhy do corporations have their financial statements audited by certified public accountants? Although corporations find audit reports useful as a check on their internal accounting procedures, this is not the sole or even the primary purpose for which most corporate businesses now obtain audit reports. As the majority itself acknowledges, \"audit reports are very frequently (if not almost universally) used by businesses to establish the financial credibility of their enterprises in the perceptions of outside persons, e.g., existing and prospective investors, financial institutions, and others who extend credit to an enterprise or make risk-oriented decisions based on its economic viability.\" (Maj. opn., ante, p. 382.)\n\nDefendant in this case does not plead ignorance of the common uses for the audit reports it prepares. As one of the nation's largest accounting firms, and a prominent member of the business community in its own right, defendant knows that its work product gives the client's financial statements an essential measure of credibility in the eyes of those individuals and entities who, in dealings with the client, must make business decisions based on an assessment of the client's financial position. Defendant knows, in brief, that audit reports invite and produce reliance, and that injury results when reliance proves unjustified. Because the normal and common uses of audit reports are well known throughout the business community, an accountant can readily foresee that negligence in the conduct of the audit or the preparation of the audit report will result in harm to individuals and corporations that receive the report and rely on it in their business dealings with the client.\n\nAs neither the majority nor defendant disputes the foreseeability of harm to relying third parties, this point need not be belabored. But neither should it be slighted. As this court has stressed, foreseeability of harm is the \"most important\" of the policy considerations governing negligence liability. (Tarasoff v. Regents of University of California, supra, 17 Cal. 3d 425, 434; see also J'Aire Corp. v. Gregory (1979) 24 Cal. 3d 799, 806 [157 Cal. Rptr. 407, 598 P.2d 60] [\"... this court has focused on foreseeability as the key component necessary to establish liability ....\"].)\n\nB. Economic Injury to Third Persons Is Certain\n\nCourts have expressed concern that recognizing tort liability in some situations would encourage false claims based on feigned injuries. This concern has been noted primarily, if not exclusively, when the only claimed injury is an intangible harm such as emotional distress. (See Burgess v. Superior Court, supra, 2 Cal. 4th 1064, 1073, fn. 6; Molien v. Kaiser Foundation Hospitals (1980) 27 Cal. 3d 916, 925 [167 Cal. Rptr. 831, 616 P.2d 813, 16 A.L.R.4th 518]; Quesada v. Oak Hill Improvement Co. (1989) 213 Cal. App. 3d 596, 609 [261 Cal. Rptr. 769].)\n\nUnlike emotional distress, economic loss is not readily simulated. When a corporation has become bankrupt, and shares of its stock are worthless, the resulting injury to the corporation's shareholders is unquestionably genuine. If no funds remain to repay loans and accounts payable, the injury to suppliers and lenders is likewise incontestable. \"No one has suggested any difficulty in proving the fact of injury when an accountant's negligence is involved.\" (Wiener, Common Law Liability of the Certified Public Accountant for Negligent Misrepresentation (1983) 20 San Diego L.Rev. 233, 256.) Nor has the majority suggested that the plaintiffs' losses in this case could be other than real. The certainty of the injury must be counted as a factor that favors continuing recognition of accountants' liability to relying third parties for negligent auditing.\n\nC. The Accountant's Conduct Is Closely Connected to the Injury Suffered\n\nTo recover damages for an accountant's negligence in rendering an unqualified audit opinion, a plaintiff must prove both reliance on the audit opinion and a factual nexus between the plaintiff's loss and the undisclosed defects in the audited financial statements. To establish reliance, the third party must prove that it reviewed the client's financial statements, that the statements contained material errors or omissions, that it would not have entered into a business transaction with the client (as investor, lender, supplier, etc.) had the financial statements revealed the true facts, and that it would not have accepted the client's financial statements at face value had the accountant not endorsed them with an unqualified audit opinion. To establish the required factual nexus, the plaintiff must show that the loss was a foreseeable result of the fact or condition that the financial statements misrepresented or concealed. (See Restat.2d Torts (1977) ยง 548A, com. b.)\n\nWhen the third party has demonstrated causation in this manner, showing that the accountant's opinion played an essential role in the third party's business decision and its resulting loss, the connection between the auditor's\n\nnegligence and the third party's injury must be Judged close by any reasonable measure.\n\nThe majority does not dispute that when reliance exists, the accountant's negligence is closely connected to the third party's resulting injury. Rather, the majority implies that reliance is easily feigned, and that false claims of reliance are difficult to disprove. (Maj. opn., ante, pp. 400-401.) Thus, the majority asserts that juries will be deceived into awarding substantial damages to plaintiffs who did not rely at all on the audit report, or for whom the audit report was only a minor and insignificant factor in the decision to lend to or invest in the client. The majority's concern is unwarranted.\n\nAs noted, an independent auditor's report invites and produces reliance. Businesses retain accountants to audit their financial statements because they know that audit reports are effective in inducing investors to invest and lenders to lend. If audit reports were not a substantial factor in the decisions of investors and lenders, businesses would have little need for independent auditing services. Thus, accountants can hardly argue that third party reliance is anything other than a routine and predictable response. Claims of actual reliance are more likely to be genuine than feigned.\n\nBecause the plaintiff must show that reliance was reasonable, an accountant is not defenseless when faced with a claim of reliance that is dubious under the circumstances of the particular case. By means of expert testimony that a reasonable investor or lender would not have relied on the accountant's opinion under the same circumstances, the accountant can rebut the claim of reliance.\n\nThe supposed problem of feigned reliance claims differs neither in degree nor in kind from the many other credibility issues routinely resolved by triers of fact in civil litigation. It cannot justify a blanket rule of nonliability that would preclude compensation for genuine injuries caused by negligence in auditing. Some words of the United States Supreme Court are appropriately recalled here. Rejecting an argument similar to that made by the majority, the court said: \"Petitioner's entire argument ... is founded on the premise that the jury will not be able to separate the wheat from the chaff. We do not share in this low evaluation of the adversary process.\" (Barefoot v. Estelle (1983) 463 U.S. 880, 901, fn. 7 [77 L.Ed.2d 1090, 103 S.Ct. 3383].)\n\nD. Moral Blame Is Comparable to Other Actionable Professional Negligence\n\nAs independent auditor of a business's financial statements, an accountant assumes a moral responsibility to third parties who may be expected to rely\n\non the audit report. Courts and commentators have long recognized this moral obligation: \" 'The certified public accountant acknowledges a moral responsibility (and under the Securities Act this is made a legal and financial responsibility) to be as mindful of the interests of strangers who may rely on his [or her] opinion as of the interests of the client who pays his [or her] fee. [P] ... The certified public accountant, therefore, in providing accounting statements which all concerned may accept as disinterested expressions, based on technically sound procedures and experienced judgment, may serve as a kind of arbiter, interpreter, and umpire among all the varied interests. Thereby he [or she] can eliminate the necessity for costly separate investigations by each party at interest, as well as endless doubts, delays, misunderstandings, and controversies which are so much sand in the economic machine.' \" (Rosenblum v. Adler (1983) 93 N.J. 324 [461 A.2d 138, 150, 35 A.L.R. 4th 199], quoting Carey, Professional Ethics of Public Accounting (1946) pp. 13-14.)\n\nThe United States Supreme Court, in refusing to recognize an accountant- client privilege for tax accrual workpapers, described the accountant's responsibility in these terms: \"By certifying the public reports that collectively depict a corporation's financial status, the independent auditor assumes a public responsibility transcending any employment relationship with the client. The independent public accountant performing this special function owes ultimate allegiance to the corporation's creditors and stockholders, as well as to the investing public. This 'public watchdog' function demands that the accountant maintain total independence from the client at all times and requires complete fidelity to the public trust.\" (United States v. Arthur Young \u0026 Co. (1984) 465 U.S. 805, 817- 818 [79 L.Ed.2d 826, 835-837, 104 S.Ct. 1495], italics in original.)\n\nThe Securities and Exchange Commission expressed the same view some 35 years ago: \" 'The responsibility of a public accountant is not only to the client who pays his [or her] fee, but also to investors, creditors and others who may rely on the financial statements which he [or she] certifies.' \" (Rosenblum v. Adler, supra, 93 N.J. 324 [461 A.2d 138, 149], quoting In re Touche, Niven, Bailey \u0026 Smart (1957) 37 S.E.C. 629, 670.)\n\nAccountants themselves do not dispute or disclaim their ethical obligation to third party users of audit opinions: \"A distinguishing mark of a profession is acceptance of its responsibility to the public. The accounting profession's public consists of clients, credit grantors, governments, employers, investors, the business and financial community, and others who rely on the objectivity and integrity of certified public accountants to maintain the orderly functioning of commerce. This reliance imposes a public interest responsibility on\n\ncertified public accountants.\" (2 American Institute of Certified Public Accountants, Prof. Standards (CCH 1988) ยง 53.01.)\n\nBecause an accountant's moral, ethical, and professional responsibilities extend to foreseeable users of audit opinions, such as lenders and investors, an accountant whose carelessness causes economic loss to a foreseeable user is as morally blameworthy as an attorney who negligently drafts a will or contract, or a broker or escrow holder who negligently mishandles important documents in a real estate transaction. In each instance, the breach of a professional responsibility through lack of due care should result in liability to those to whom the professional owes an established moral and ethical obligation. Although defendant and the majority advance various arguments against this Conclusion, none is persuasive.\n\nDefendant argues that accounting is more art than science, that it requires the exercise of professional judgment, and that even the most carefully performed audit cannot guarantee that the audited financial statements are entirely free of error. From this, defendant would have this court conclude that little if any moral blame attaches when an accountant fails to detect errors in a client's financial statements.\n\nDefendant's argument proceeds from a faulty premise. It incorrectly assumes that an accountant will be liable for negligence whenever an audit fails to uncover a material mistake in a financial statement. No such strict liability is at issue. On the contrary, accountants are held only to the standards of their profession: \"The auditor is neither required to investigate every supporting document, nor deemed to have the training or skills of a lawyer or criminal investigator.\" (Rosenblum v. Adler, supra, 93 N.J. 324 [461 A.2d 138, 148].)\n\nThe law fully recognizes that, just as an attorney does not guarantee a client's success in litigation, nor a doctor a patient's complete recovery from sickness or injury, an accountant performing an audit does not guarantee the accuracy of the client's financial statements. (International Mortgage Co. v. John P. Butler Accountancy Corp., supra, 177 Cal. App. 3d 806, 818.) Negligence liability results only when the accountant has failed to meet the standards of the accounting profession. More specifically, an accountant performing an audit is subjected to negligence liability only upon proof of a failure to perform a reasonably careful audit according to generally accepted auditing standards. When such a breach of due care has been proven, the accountant's conduct is morally blameworthy to the same extent as other forms of professional malpractice for which negligence liability is routinely imposed. (See, e.g., Burgess v. Superior Court, supra, 2 Cal. 4th 1064, 1081.)\n\nThe majority maintains that in cases like this one it is wrong to impose liability on an accountant for failing to detect errors in financial statements, because the accountant's wrongdoing is slight when compared to that of the client who committed the errors in the first instance. If the client is more at fault than the accountant, this greater fault is relevant in an action by the accountant against the client for indemnity, but it provides no reason to absolve the negligent accountant from liability to third parties. When the client is not a party to the lawsuit, and the only question is whether a loss should fall on the negligent accountant or on a third party who reasonably and foreseeably relied on the accountant's integrity and professional skill, considerations of relative moral fault necessarily require placing the loss on the party whose use of care could have prevented it, rather than on a wholly innocent victim. (See Iselin- Jefferson Financial Co. v. United California Bank (1976) 16 Cal. 3d 886, 890-892 [129 Cal. Rptr. 670, 549 P.2d 142] [holding notary public who negligently acknowledged a forged signature on a guarantee agreement liable to a purchaser of accounts receivable who relied on the notarization]; see also, Civ. Code, ยง 3543 [\"Where one of two innocent persons must suffer by the act of a third, he [or she], by whose negligence it happened, must be the sufferer.\"].)\n\nThe majority asserts that holding negligent accountants liable to foreseeable users of audit opinions will subject accountants to \"a claim for all sums of money ever loaned to or invested in the client\" (maj. opn., ante, p. 400), and result in \"vast numbers of suits and limitless financial exposure\" (Ibid.). The majority uses such assertions to justify its claim that liability to foreseeable users of audit opinions would be out of proportion to fault.\n\nThe majority's characterizations of the scope of the liability that until now has existed in this state are gross exaggerations, yet typical of the hyperbole that seems to infect any debate of accountants' negligence liability to third parties. Such liability is indeterminate (like virtually all other forms of tort liability), but it is not limitless. Because liability has extended only to those business transactions conducted in reliance on the audited financial statements, and because audited financial statements become obsolete within a few years at most, the accountant's liability exposure has been finite and reasonably predictable in duration. Liability continues only so long as the audited financial statements reasonably influence business decisions. The amount of the potential liability is also measurable. Because it depends on the client's investment and borrowing potential, the scope of liability is necessarily proportional to the size and growth rate of the audited business.\n\nThese boundaries of time and amount mark the outer limits of accountant liability for negligence in auditing. Within those limits, a negligent accountant will be liable for only a fraction of the money invested in or lent to the\n\nclient. No liability ensues absent reliance, and, as the majority states, \"the ultimate decision to lend or invest is often based on numerous business factors that have little to do with the audit report.\" (Maj. opn., ante, p. 401.) A bank's decision to make a fully secured loan, for instance, may be little influenced by financial statement inaccuracies having no bearing on the security's value. In such cases, the necessary element of causation will be lacking, and the accountant will not be liable.\n\nThe factor of moral blame, I conclude, supports a rule that makes a negligent accountant liable to an innocent third party for economic losses resulting from the third party's reasonable and foreseeable reliance on the negligent accountant's audit opinion.\n\nE. Liability Prevents Future Harm\n\nCivil Code section 3274 declares that in this state money damages are not only the prescribed remedy \"for the violation of private rights,\" but also \"the means of securing their observance.\" As a particular application of this broad principle, it is generally recognized that tort liability prevents harm by deterring negligent conduct. (See, e.g., Burgess v. Superior Court, supra, 2 Cal. 4th 1081- 1082.) The majority fails to explain why this is not as true for independent audits of financial statements as for other professional activities. In my view, the deterrent effect of tort liability is especially important in this area.\n\nIn capital markets, accurate financial reporting is indispensable for sound decisions and thus for the efficient allocation of resources. To ensure that the financial data they receive is accurate, lenders and investors insist that financial statements in all substantial transactions be verified by the unqualified opinion of a certified public accountant. In risking their capital on the basis of financial data thus verified, lenders and investors depend on the integrity and expertise of the certified public accountant in deciphering the complexities of modern financial information.\n\nWhen the trust of lenders and investors proves misplaced, the loss may extend well beyond the particular lenders and investors involved. Lenders who suffer substantial losses will pass the costs on to their customers and society at large through higher interest charges, tighter lending controls, higher loan application costs, and, too often, the massive costs associated with failed financial institutions. Investors who suffer losses through investment in failing businesses that appeared sound on paper will not be able to use the funds thus wasted to foster the growth of other, more deserving companies. Having suffered losses due to unreliable financial information,\n\nboth lenders and investors may concentrate their funds in the most well-established businesses, to the detriment of young, start-up companies with innovative products or services. Finally, the losses resulting from misallocation of funds and the sudden collapse of reportedly sound companies have economy-wide consequences in terms of loss of employment and failure of investor confidence in the stock market.\n\nDoes the rule holding negligent accountants liable to persons who reasonably and foreseeably rely on their audit reports of financial statements serve to avert these many forms of harm? I submit it does. As one commentator has put it: \"Negligent auditing will be deterred as accountants, realizing that their mistake will involve potentially greater financial consequences, will use even greater care to avoid them.\" (Paschall, Liability to Non-clients: The Accountant's Role and Responsibility (1988) 53 Mo. L.Rev. 693, 729.) This reasoning is supported by both common sense and judicial authority. (See International Mortgage Co. v. John P. Butler Accountancy Corp., supra, 177 Cal. App. 3d 806, 820 [liability \"provides a financial disincentive for negligent conduct and will heighten the profession's cautionary techniques\"]; Citizens State Bank v. Timm, Schmidt \u0026 Co. (1983) 113 Wis.2d 376 [335 N.W.2d 361, 365] [\"Unless an accountant can be held liable to a relying third party, this negligence will go undeterred.\"]; Rosenblum v. Adler, supra, 93 N.J. 324 [461 A.2d 138, 152] [liability will \"cause accounting firms to engage in more thorough reviews,\" which will \"reduce the number of instances in which liability would ensue\"].)\n\nCustomer demand is not sufficient to ensure the quality of independent audits. What clients of auditing services want above all is not a careful audit but an unqualified opinion to satisfy investors, lenders, and others concerned with the clients' financial health. Indeed, defendant itself acknowledges that a client \"may, for reasons of its own, actively seek to publish less than accurate financial information.\" Accountants are strongly motivated to satisfy their clients because it is they who pay the accountants' fees and provide future business. The accountant is thus caught between client pressure to produce an unqualified opinion and the moral and ethical obligation to maintain high standards of care and thoroughness. It is vital that accountants resolve this conflict in favor of careful auditing. The threat of liability to third parties reinforces the accountant's independence from the client, thereby helping to prevent loyalty to the client from consciously or unconsciously interfering with the accountant's professional judgment.\n\nTo deter negligent conduct, it is not necessary that negligent parties be held liable for each and every injury resulting from their negligent acts. Liability to a limited class of victims may suffice. And in fact, most of this\n\ncourt's recent decisions limiting or precluding negligence liability have involved claims by secondary victims seeking recovery for collateral effects of the wrongful conduct. For example, when a defendant has negligently caused physical injury to another, this court has carefully limited the defendant's liability to third parties for emotional distress occasioned by the injury to the primary victim. (Thing v. La Chusa (1989) 48 Cal. 3d 644, 667-668 [257 Cal. Rptr. 865, 771 P.2d 814].) We have also denied recovery for loss of consortium to a child, parent, or unmarried cohabitant of a person physically injured by a defendant's negligence. (See Elden v. Sheldon (1988) 46 Cal. 3d 267 [250 Cal. Rptr. 254, 758 P.2d 582]; Baxter v. Superior Court (1977) 19 Cal. 3d 461 [138 Cal. Rptr. 315, 563 P.2d 871]; Borer v. American Airlines, Inc. (1977) 19 Cal. 3d 441 [138 Cal. Rptr. 302, 563 P.2d 858].) In each of these situations, the defendant's liability to the primary victim, the person physically injured by the defendant's negligent conduct, provided an adequate deterrent.\n\nThis case is different. The losses for which plaintiffs seek recovery are not a mere ripple effect of some primary wrong to a different party. In cases such as this one, the accountant's client is not a primary victim, for the client has not been harmed by the accountant's failure to detect mistakes in the client's own financial statements. Although the majority makes accountants liable to third parties for negligent misrepresentation when the accountants intended to influence a transaction between the third party and the client, these situations are exceptional. The net effect of the majority's holding, then, is that in the usual case, in which the accountant lacks specific knowledge of the client's intended dealings with third parties, the accountant can perform the audit and issue the audit report with virtual assurance that no liability will ensue no matter how negligently the job is done. With no liability deterrent, the incentive for care is reduced, the incidence of negligence rises, and harm to third parties multiplies.\n\nF. Burden to Accountants and Consequences to Community of Imposing Liability\n\nHow heavy is the burden to accountants and what are the consequences to the community when the law makes accountants liable to foreseeable users of audit opinions? These are serious questions, deserving serious consideration. They should be answered on the basis of facts, not speculation. Yet the record before this court includes no competent evidence that would be helpful in addressing these issues. Absent a reliable and satisfactory basis for decision, this court can make no informed judgment on these issues and should not invoke these considerations in support of a rule that denies liability in derogation of the fundamental principle making persons liable for all foreseeable consequences of their negligence.\n\nThis evidentiary void cannot be excused by a lack of experience with the liability rule in question. For several years now, accountants have been liable to foreseeable users of audit opinions in this state, as well as in New Jersey, Mississippi, and Wisconsin. (See International Mortgage Co. v. John P. Butler Accountancy Corp., supra, 177 Cal. App. 3d 806; Rosenblum v. Adler, supra, 93 N.J. 324 [461 A.2d 138]; Touche Ross v. Commercial Union Ins. (Miss. 1987) 514 So.2d 315, 322; Citizens State Bank v. Timm. Schmidt \u0026 Co., supra, 113 Wis.2d 376 [335 N.W.2d 361]; see also, Blue Bell v. Peat, Marwick, Mitchell \u0026 Co. (Tex.Ct.App. 1986) 715 S.W.2d 408, 412 [\"we find the reasoning of the cases and commentators urging adoption of the foreseeability test persuasive\"].) The federal securities laws have an even stricter rule. An accountant who has certified any part of a registration statement containing an untrue statement of material fact is liable to any purchaser of the registered security. (15 U.S.C. ยง 77k(a)(4).) In an action under this federal law, the plaintiff need not prove that the accountant was negligent, although the accountant may escape liability by proving due diligence. (Id., ยง 77k(b)(3); see Herman \u0026 MacLean v. Huddleston (1983) 459 U.S. 375, 382 [74 L.Ed.2d 548, 555-556, 103 S.Ct. 683].)\n\nHas the strict rule of liability under the federal securities laws caused accountants to refuse to certify financial data in registration statements? Is liability insurance available to accountants who engage in this work? Are accounting services more costly or less available in New Jersey than in New York? How have the different liability rules affected the incidence of accountant malpractice in New York and New Jersey? We simply do not know. It is reasonable to assume, however, that if serious adverse consequences had resulted from the rule of liability under the federal securities laws, or from the rule existing in New Jersey, Mississippi, and Wisconsin, those rules would have succumbed to legislative abrogation. Their continued existence is itself eloquent testimony that a rule of liability to foreseeable users of audit opinions does not destroy the accounting profession or otherwise have consequences demonstrably inimical to public welfare.\n\nWere it to be demonstrated that the burden of the existing liability rule is excessive, the proper solution would not be the severe and arbitrary curtailment of duty adopted by the majority. Rather, liability could be capped in a variety of less extreme and more evenhanded ways. For example, an accountant's maximum exposure for negligence in an independent audit could be fixed at a percentage of the reported net worth of the audited company. Or the accountant's opinion in the audit report could be backed by a surety bond in a similar amount, with recovery on the bond being a third party's sole recourse in cases of proven negligence. These approaches would preserve most of the benefits of the existing tort liability rule--especially the incentive for due care--while at the same time making less indeterminate the\n\naccountant's liability exposure for auditing work. To be sure, solutions like these would require legislation, but this is inherently a legislative problem because it requires thorough investigation and debate, followed by compromise, a certain amount of experimentation, and fine tuning of the law based on practical experience with its operation.\n\nG. Availability, Cost and Prevalence of Insurance\n\nThe availability and cost of liability insurance is significant in strict liability cases because in those cases the defendant's superior ability to spread the victim's loss, through insurance or price adjustments, is a major justification for imposing liability. This factor has much less significance when liability is based on fault, as it is in negligence cases like this one. In any event, there is no competent evidence before this court establishing that liability insurance is unavailable or prohibitively expensive for accountants who perform audits. Finally, even if such evidence were to be presented, the proper means of addressing the problem would be carefully crafted legislation such as I have previously discussed.\n\nH. Summary and Conclusion\n\nThe foreseeability standard \"provides a logical and just limit to an accountant's liability.\" (Imark Industries v. Arthur Young \u0026 Co. (1987) 141 Wis.2d 114 [414 N.W.2d 57, 66].) Holding negligent accountants liable to those who reasonably and foreseeably rely to their detriment on defective audit reports compensates innocent victims, encourages greater care in the performance of audits, reinforces the independence of accountants from their clients, and avoids misallocation of capital resources, all to the benefit of the accounting profession, those who rely on its services, and the public at large. I find no public policy considerations sufficient to warrant an exception to California's well- established general principles of tort liability.\n\nII\n\nFor the tort of negligence, the majority resurrects in its strictest form the \"anachronistic privity barrier.\" (Note, The Enlarging Scope of Auditors' Liability to Relying Third Parties (1983) 59 Notre Dame L.Rev. 281, 282.) Thus, under the rule the majority adopts, only the client can recover for the accountant's negligence in performing audit services. To my knowledge, no decision from any jurisdiction in recent times has so restrictively defined the scope of an accountant's liability for professional malpractice. Even New York, in which the privity rule was first applied to negligence in auditing, has relaxed the harsh privity rule to permit recovery by persons other than\n\nthe accountant's immediate client. (See Credit Alliance v. Arthur Andersen \u0026 Co. (1985) 65 N.Y.2d 536 [493 N.Y.S.2d 435, 483 N.E.2d 110, 118].)\n\nThe majority justifies its retrograde restriction by offering the prospect that some few third parties may recover under the rubric of negligent misrepresentation. The majority explains that any third party recovery should be under this legal theory, rather than simple negligence, because it \"more precisely captures the gravamen of the cause of action.\" (Maj. opn, ante, p. 413.) For the tort of negligent misrepresentation, the majority adopts the test articulated in the Restatement Second of Torts. Under the Restatement rule, a person who negligently supplies false information is liable for a loss suffered \"(a) by the person or one of a limited group of persons for whose benefit and guidance he [or she] intends to supply the information or knows that the recipient intends to supply it ; and (b) through reliance upon it in a transaction that he [or she] intends the information to influence or knows that the recipient so intends or in a substantially similar transaction.\" (Rest.2d Torts (1977) ยง 552, subd. (2), italics added.)\n\nWhen applied to the audit opinions of independent accountants, the Restatement rule imposes liability only when the negligent accountant has specific knowledge of the client's intended use of the audit report, and not when the intended use, although not specifically revealed, is perfectly obvious to the accountant by virtue of the client's financial situation and common business practices. The arbitrariness of this distinction has been justly condemned: \"There is apparently no reason for preferring a foreseen user over a foreseeable one. Neither party pays for the audit, and neither party is owed a greater duty of care from the accountant. Since modern auditors fully expect third parties to rely on their opinions, the distinction is simply indefensible.\" (Note, The Enlarging Scope of Auditors' Liability to Relying Third Parties, supra, 59 Notre Dame L.Rev. 281, 287; see also Blue Bell v. Peat, Marwick, Mitchell \u0026 Co., supra, 715 S.W.2d 408, 412 [\"To allow liability to turn on the fortuitous occurrence that the accountant's client specifically mentions a person or class of persons who are to receive the reports, when the accountant may have that same knowledge as a matter of business practice, is too tenuous a distinction for us to adopt as a rule of law.\"].)\n\nBy permitting recovery only by those persons, or limited groups of persons, that the accountant actually knows will receive and rely upon the audit report, the Restatement rule penalizes knowledge and rewards ignorance. To avoid liability, the accountant need only agree with the client to remain blissfully unaware of the report's proposed distribution and the uses to which it will be put. (See Note, The Enlarging Scope of Auditors' Liability\n\nto Relying Third Parties, supra, 59 Notre Dame L.Rev. 281, 287 [\"... a clever accountant could circumvent the Restatement provision by asking his [or her] client not to reveal the intended users of the statements.\"].)\n\nHere, for example, defendant gave the client corporation 100 printed copies of a booklet containing the audited financial statements and its audit report, thereby demonstrating (if such demonstration were even necessary) that it knew the client would widely distribute the report. Although defendant must necessarily have realized from its review of the client's records that the client was in need of additional capital, and indeed had discussed a proposed public stock offering with the client, it apparently was never told of the specific plans by which the client later obtained capital from plaintiffs. Under these circumstances, it is arbitrary and unfair to make liability turn on defendant's knowledge of the precise use of the audit report. That this defendant's knowledge did not extend to the details of proposed transactions--with whom, when, how much, and so forth--should be legally irrelevant.\n\nThe majority insists that it is unnecessary to extend liability beyond specifically known users because other victims of negligent auditing, those who reasonably and foreseeably rely on a professionally deficient audit opinion, can minimize their losses by diversifying their investment and loan portfolios. There are several problems with this argument. First, it is based on the principle of caveat emptor (\"buyer beware\"), which in this context conflicts with the moral and ethical responsibility of accountants to exercise due care to avoid harm to foreseeable users. Second, it ignores the general principle that the risk of loss should be placed on the party best able to prevent its occurrence. (See Escola v. Coca Cola Bottling Co. (1944) 24 Cal. 2d 453, 462 [150 P.2d 436] (conc. opn. of Traynor, J.).) Finally, it affords the least protection to those most in need of it. This is so because the ability to diversify is proportional to the funds available. Diversification is easy for large institutional investors and lenders, but it is difficult or impossible for lenders and investors of modest means, who may have no choice but to concentrate their funds in one or a few loans or investments.\n\nIn a similar vein, the majority argues that lenders and investors may conduct their own audits of the client's financial statements or negotiate a separate opinion directly from the independent auditor retained by the client. But separate audits by each lender and investor, although no doubt a boon to the accounting profession, will result in a socially wasteful duplication of effort and expense, resulting in disruption and delay of business activity, together with higher transaction costs, leading to higher interest charges and demands for higher investment returns.\n\nMoreover, as with the majority's previous argument, those most in need of protection are least able to avail themselves of these protective measures.\n\nSmall investors and lenders may find separate audits prohibitively expensive, and they may lack the sophistication to request separate opinions.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e In short, the majority's rule is one that protects the wealthy and financially savvy at the expense of those innocent investors and lenders whose only faults are their modest means and their willingness to place their trust in independent audit reports.\n\nThe jury's verdict in this case stands against the majority's assertion that plaintiffs should have taken additional steps to protect themselves. This assertion constitutes a charge that plaintiffs acted negligently when they invested their funds in reliance on the audit report. Yet the jury expressly found no comparative negligence on plaintiffs' part.\n\nThe majority imposes no duty on accountants to take their own protective measures in high risk situations. Accountants can limit their liability through agreements with the client restricting distribution of their audit reports. (See Paschall, Liability to Non-clients: The Accountant's Role and Responsibility, supra, 53 Mo. L.Rev. 693, 726-729.) In addition, \"The auditors could in some circumstances, such as when auditing a privately owned company, expressly limit in their certificates the persons or class of persons who would be entitled to rely upon the audit.\" (Rosenblum v. Adler, supra, 93 N.J. 324 [461 A.2d 138, 152].) Such disclaimers give fair notice to all potential report users and prevent third parties' reliance from being reasonable.\n\nNaturally, accountants would prefer not to limit distribution of audit reports or to put disclaimers in their opinions because the value of the audit to the client would then be reduced. But accountants should not be permitted to have it both ways: they should not profit from the value produced by anticipated third party reliance and yet escape all responsibility when their negligence results in injury to relying third parties. Those accountants who are unable or unwilling to accept the burden of negligence liability to foreseeable third party users of their audit opinions should bear the burden of notice through liability disclaimers. Absent liability disclaimers, the law ought to protect the reasonable expectations of third parties who rely on an accountant's statement of professional opinion in a document obviously prepared for general business use.\n\nConclusion\n\nThe majority recognizes that accountants acknowledge a responsibility to third parties who foreseeably rely on audit reports in their business dealings\n\nwith the audited company. Yet the majority adopts a rule that betrays the expectations of third party users whose reliance makes the audit report valuable to the audited company. Under the majority's rule, the audit report is made a trap for the unwary, because only the most legally sophisticated and well advised will understand that the report will not deliver what on its face it seems to promise: a qualified professional's actual assurance that the financial statement fairly states the financial situation of the audited company. An assurance with no legal recourse is essentially a hoax. Under the rule the majority adopts, any value that third parties place on the unqualified opinion is mistaken, because the law now insists that reliance upon the opinion, no matter how reasonable and foreseeable, is unjustified.\n\nFinally, and perhaps most important, the majority pays too little attention to the importance of negligence liability as a means of preventing bad financial data from entering and polluting the waters of commerce. Without a liability rule that enforces the reasonable expectations of third party users of audit reports and provides an adequate incentive for due care, we may expect less careful audits, inefficient allocation of capital resources, increased transaction costs for loans and investments, and delay and disruption in the processes of lending and investing.\n\nExisting law should be preserved. Negligent accountants should be held accountable for reasonably foreseeable injuries caused by the faulty performance of their professional duties in auditing financial statements. I would affirm the judgment of the Court of Appeal.\n\nMosk, J., concurred.\n\nThe petitions of respondent Robert R. Bily and appellants J. F. Shea Co., Inc., et al., for a rehearing were denied November 12, 1992, and the opinion was modified to read as printed. Mosk, J., and Kennard, J., were of the opinion that the petition should be granted.\n\n\u003cspan class=\"fn\"\u003e1. This case arises in the context of an engagement of a firm of certified public accountants to perform an audit and render a formal, written report. We will use the terms \"auditor\" and \"accountant\" interchangeably and in this context.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. One plaintiff, Richard L. King, had not received or read the Arthur Young audit report and, therefore, could not have relied on it in making his investment. The jury nonetheless returned a verdict in his favor. The Court of Appeal reversed the judgment in King's favor, finding the absence of reliance fatal to his claim. No issue pertinent to King's claim is before us.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. In California, such an expression of opinion is mandated by a rule of the State Board of Accountancy. (Cal. Code Regs., tit. 16, ยง 58.1 [\"This rule applies to the accountant's report issued in connection with examinations of financial statements that are intended to present financial position, results of operations and changes in financial position in conformity with generally accepted accounting principles. The report shall either contain an expression of opinion regarding the financial statements, taken as a whole, or an assertion to the effect that an opinion cannot be expressed. When an overall opinion cannot be expressed, the reasons should be stated.\"].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Colonial Bank of Alabama v. Ridley \u0026 Schweigert (Ala. 1989) 551 So.2d 390; Idaho Bank \u0026 Trust Co. v. First Bancorp of Idaho (1989) 115 Idaho 1082 [772 P.2d 720]; Citizens National Bank v. Kennedy \u0026 Coe (1989) 232 Neb. 477 [441 N.W.2d 180]; Credit Alliance v. Arthur Andersen \u0026 Co., supra, 483 N.E.2d 110; Landell v. Lybrand (1919) 264 Pa. 406 [107 A. 783, 8 A.L.R. 461].\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Arkansas Code Annotated section 16-114-302 (Supp. 1990); Illinois Revised Statutes, chapter 111, paragraph 5535.1 (Supp. 1990); Kansas Statutes Annotated section 1-402(b); Utah Code Annotated section 58-26-12 (Supp. 1990).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. McLean v. Alexander (3d Cir. 1979) 599 F.2d 1190, 120, 249 A.L.R.Fed. 373] (Delaware law); Stephens Indus. Inc. v. Haskins \u0026 Sells (10th Cir. 1971) 438 F.2d 357 (Colorado law); Ackerman v. Schwartz (7th Cir. 1991) 947 F.2d 841 (Indiana law).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. First Florida Bank, N.A. v. Max Mitchell \u0026 Co. (Fla. 1990) 558 So.2d 9, 12-15 (rejecting \"expansive reasonably foreseeable approach\" in favor of Restatement rule); First Nat'l Bank v. Crawford (W.Va. 1989) 386 S.E.2d 310, 311-312 (rejecting foreseeability and privity rules in favor of \"middle ground\" offered by Restatement rule); Raritan River Steel Co. v. Cherry, Bekaert \u0026 Holland (1988) 322 N.C. 200 [367 S.E.2d 609, 617] (same); Haberman v. Pub. Power Supply Sys. (1987) 109 Wn.2d 107 [744 P.2d 1032, 1067-1068], modified (Wash. 1988) 750 P.2d 254 (adopting Restatement rule and rejecting expansive rule of liability \"[i]n deference to legitimate fears of indeterminate liability to third persons\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. E.g., Siliciano, supra, 86 Mich.L.Rev. 1429; Bilek, Accountants' Liability to the Third Party and Public Policy: A Calabresi Approach (1985) 39 Sw.L.J. 689 (hereafter Bilek); Ebke, In Search of Alternatives: Comparative Reflections on Corporate Governance and the Independent Auditor's Responsibilities (1984) 79 Nw.L.Rev. 663; Gormley, The Foreseen, The Foreseeable, and Beyond--Accountants' Liability to Nonclients (1984) 14 Seton Hall L.Rev. 528 (hereafter Gormley); contra see Wiener, supra, 20 San Diego L.Rev. 233; Hagen, Accountants' Common Law Liability to Third Parties (1988) Colum.Bus.L.Rev. 181.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Bethlehem Steel Corporation v. Ernst \u0026 Whinney (Tenn. 1991) 822 S.W.2d 592 (modified Restatement test adopted); First Fla. Bank N.A. v. Max Mitchell \u0026 Co., supra, 558 So.2d 9; Badische Corp. v. Caylor (1987) 257 Ga. 131 [356 S.E.2d 198]; Pahre v. Auditor of State (Iowa 1988) 422 N.W.2d 178; Law Offices of Lawrence J. Stockler, P.C. v. Rose (1989) 174 Mich. App. 14 [436 N.W.2d 70, 81-82], leave to appeal denied, 434 Mich. 862 (1990); Bonhiver v. Graff (1976) 311 Minn. 111 [248 N.W.2d 291]; Aluma Craft Mfg. Co. v. Elmer Fox \u0026 Co. (Mo.Ct.App. 1973) 493 S.W.2d 378; Thayer v. Hicks (1990) 243 Mont. 138 [793 P.2d 784]; Spherex Inc. v. Alexander Grant \u0026 Co. (1982) 122 N.H. 898 [451 A.2d 1308]; Raritan River Steel Co. v. Cherry, supra, 367 S.E.2d 609; Haddon View Inv. Co. v. Coopers \u0026 Lybrand (1982) 70 Ohio St.2d 154 [24 Ohio Ops.3d 268, 436 N.E.2d 212]; Shatterproof Glass Corp. v. James (Tex.Civ.App. 1971) 466 S.W.2d 873; Haberman v. Pub. Power Supply Sys., supra, 744 P.2d 1032; First Nat'l Bank v. Crawford, supra, 386 S.E.2d 310; First Nat. Bank of Commerce v. Monco Agency Inc., supra, 911 F.2d 1053 (Louisiana law); Ingram Indus., Inc. v. Nowicki (E.D. Ky. 1981) 527 F.Supp. 683 (Kentucky law); Bunge v. Eide (D.N.D. 1974) 372 F.Supp. 1058; Rusch Factors, Inc. v. Levin (D.R.I. 1968) 284 F.Supp. 85 (Rhode Island law.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The United States Supreme Court has described the basic elements of liability under section 11 as follows: \"Section 11 of the 1933 Act allows purchasers of a registered security to sue certain enumerated parties in a registered offering when false or misleading information is included in a registration statement. The section was designed to assure compliance with the disclosure provisions of the Act by imposing a stringent standard of liability on the parties who play a direct role in a registered offering. If a plaintiff purchased a security issued pursuant to a registration statement, he need only show a material misstatement or omission to establish a prima facie case. Liability against the issuer of a security is virtually absolute, even for innocent misstatements. Other defendants bear the burden of demonstrating due diligence.\" (Herman \u0026 Maclean v. Huddleston (1983) 459 U.S. 375, 381-382 [74 L.Ed.2d 548, 555-556, 103 S.Ct. 683], fns. omitted.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. One frequently used illustration of the need to limit liability for economic loss assumes a defendant negligently causes an automobile accident that blocks a major traffic artery such as a bridge or tunnel. Although defendant would be liable for personal injuries and property damage suffered in such an accident, it is doubtful any court would allow recovery by the myriad of third parties who might claim economic losses because the bridge or tunnel was impassible. (Rabin, Tort Recovery for Economic Loss: A Reassessment (1985) 37 Stan.L.Rev. 1513, 1534-38 [hereafter Rabin; developing illustration from In re Kinsman Transit Co. (2d Cir. 1968) 388 F.2d 821, 825, fn. 8]; see also Siliciano, supra, 86 Mich.L.Rev. at pp. 1942-1943.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. With one exception, each of the plaintiffs testified that he had read and relied on Arthur Young's audit report dealing with the company's 1982 financial statements in making his investment in the company. Without deprecating plaintiffs' testimony, we note that third party professions of reliance on audit reports may be easily fabricated. Because there may be no record showing the distribution of the audit report by the client, it may be difficult for the auditor to prove any particular plaintiff did not receive, read, or rely on the report. Whether plaintiff first encountered the report before making the investment (when reliance could reasonably be inferred) or in the office of a lawyer or coinvestor after the company failed (when no such inference could be drawn) is not readily susceptible of verification from any unbiased source. Although instances of uncorroborated, self-interested testimony are also present in other litigation contexts, the prospect of huge numbers of financially large, complex claims of doubtful merit that cannot be readily sorted out in pretrial litigation is an additional factor to be considered in determining whether negligence liability ought to be imposed. (Biakanja, supra, 49 Cal. 2d at p. 650 [emphasizing \"the closeness of the connection between defendant's conduct and the injury suffered\"].) The United States Supreme Court has used similar considerations in restricting federal securities law liability under section 10(b) of the 1934 Act (15 U.S.C. ยง 78; (b)) and rule 10(b)-5 of the SEC. (See Blue Chip Stamps v. Manor Drug Stores, supra, 421 U.S. at p. 746 [44 L.Ed.2d at p. 555].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The Dissent argues that unsophisticated third parties who rely on audit reports are left unprotected by our decision. In our view, the argument itself poses a dilemma. If a third party possesses sufficient financial sophistication to understand and appreciate the contents of audit reports (which often include complex financial data and accounting language as well as technical terms like \"Generally Accepted Accounting Principles\" and \"Generally Accepted Auditing Standards\"), he or she should also be aware of their limitations and of the alternative ways of privately ordering the relevant risks. If, on the other hand, a third party lacks the threshold knowledge to understand the audit report and its terms, he or she has no reasonable basis for reliance. In either event, there is no sound basis to extend potentially unlimited liability based on any alleged lack of sophistication.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Amicus curiae California Society of Certified Public Accountants has included as an appendix to its brief three declarations from accounting and insurance industry personnel incorporating the results of in-house industry surveys dealing with accountants' professional liability problems, including the availability and use of insurance by accountants. The material included in the appendix is not in the record on appeal; the Court of Appeal declined to take judicial notice of it. Plaintiff Robert Bily has filed a motion to strike the appendix and related portions of the society's brief. Both our rules and our practice accord wide latitude to interested and responsible parties who seek to file amicus curiae briefs. (Cal. Rules of Court, rule 14(b).) Amicus curiae presentations assist the court by broadening its perspective on the issues raised by the parties. Among other services, they facilitate informed judicial consideration of a wide variety of information and points of view that may bear on important legal questions. For these reasons, we are inclined, except in cases of obvious abuse of the amicus curiae privilege, not to employ orders to strike as a means of regulating their contents. Plaintiff Bily's motion is, therefore, denied. We, do, however, share plaintiff Bily's concerns about the reliability and relevance of the information supplied by the society. The declarations and data in its Appendix consist of surveys and opinions directly generated by interested parties engaged in lobbying activities in the area of auditor liability. They are not part of the record, were not subjected to the testing mechanisms of the adversary process or independent professional review, and do not qualify for judicial notice pursuant to Evidence Code section 450 et seq. Moreover, they pertain to matters irrelevant to the legal rules and standards we consider in this case. As such, we have not considered them in our decision. (See Matuz v. Gerardin Corp. (1989) 207 Cal. App. 3d 203, 206-207 [254 Cal. Rptr. 725] [court may simply choose to ignore improper material in appellate brief rather than to strike it from the files].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. The decision of the Court of Appeal in International Mortgage Co. v. John P. Butler Accountancy Corp., supra, 177 Cal. App. 3d 806, reflects the reasoning of those courts that have permitted negligence recovery to all foreseeable users of audit reports. As discussed above, its central premise that \"tort liability should be delimited only by the concept of foreseeability\" ( at p. 820) is one we have since rejected in several cases. (See pp. 398-399, ante.) Because of its exclusive and narrow focus on foreseeability and the independent role of the auditor, the decision fails to consider any of the policy factors we have discussed. Without support or analysis, it assumes that privity of contract or relationship makes no sense in any tort context and that Ultramares was based on mere \"protectionist concerns.\" (177 Cal. App. 3d at p. 812.) Similarly, it assumes that auditor liability to third parties for negligence \"will heighten the profession's cautionary techniques.\" ( at p. 820.) For the reasons stated above, we cannot agree with these assumptions or with the holding or reasoning of the Court of Appeal. Its decision is disapproved.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. In theory, there is an additional class of persons who may be the practical and legal equivalent of \"clients.\" It is possible the audit engagement contract might expressly identify a particular third party or parties so as to make them express third party beneficiaries of the contract. Third party beneficiaries may under appropriate circumstances possess the rights of parties to the contract. (See Martinez v. Socoma Companies, Inc. (1974) 11 Cal. 3d 394, 400-403 [113 Cal. Rptr. 585, 521 P.2d 841]; Outdoor Services, Inc. v. Pabagold, Inc. (1986) 185 Cal. App. 3d 676, 681-684 [230 Cal. Rptr. 73]; see also ยง 1559.) This case presents no third party beneficiary issue. Arthur Young was engaged by the company to provide audit reporting to the company. No third party is identified in the engagement contract. Therefore, we have no occasion to decide whether and under what circumstances express third party beneficiaries of audit engagement contracts may recover as \"clients\" under our holding.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Plaintiff Bily contends that he qualifies as a client of Arthur Young because he was a director of the company and thus in privity with Arthur Young. We disagree. Arthur Young was engaged by the company to conduct the audit; the audit report was addressed to the board of directors (including Bily) in its capacity as a body representing the company. In contrast, Bily invested in the company in his individual capacity; he sues here for damages based solely on economic loss arising from his personal investment. In his individual capacity, Bily had no contractual or similar relationship to Arthur Young, and thus was not in privity with Arthur Young. (See Stevenson v. Oceanic Bank (1990) 223 Cal. App. 3d 306, 315 [272 Cal. Rptr. 757] [individual plaintiff could not base breach-of-contract claim on letter received by him in his capacity as corporate officer].) In sum, Bily was not a client of Arthur Young within the rule we announce here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. We also noted the confidential nature of attorney-client communications and concluded that the imposition of attorney professional liability to third parties in such a context would divert a lawyer's attentions from the service of the client and place an undue burden on the profession. (Goodman, supra, 18 Cal. 3d at p. 344.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. See also Sooy v. Peter (1990) 220 Cal. App. 3d 1305, 1314 [270 Cal. Rptr. 151] (attorney's duty of due care did not extend to another attorney, who was representing a third party in \"what was at best an arm's length transaction, and at worst an adversarial proceeding\") and Goldberg v. Frye (1990) 217 Cal. App. 3d 1258, 1267 [266 Cal. Rptr. 483] (attorney representing the administrator of an estate had no duty to legatees who were merely \"incidental beneficiaries\" of the representation).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. The remaining cases cited by plaintiffs do not impose liability in favor of merely foreseeable users of professional communications; indeed, they are generally consistent with Restatement Second of Torts section 552 and the \"intended beneficiary model.\" (Huber, Hunt \u0026 Nichols, Inc. v. Moore (1977) 67 Cal. App. 3d 278, 301-302 [136 Cal. Rptr. 603] [contractor sues architect for negligence in preparation of plans and specifications; defense verdict for architect affirmed; court expresses doubt about contractor's status as intended beneficiary under Goodman ]; M. Miller Co. v. Dames \u0026 Moore (1961) 198 Cal. App. 2d 305, 307, 309 [18 Cal. Rptr. 13] [contractor sues engineers engaged by sanitary district for negligent preparation of soils report \"intended by [the engineers] to provide information for prospective bidders such as plaintiff\"; summary judgment in favor of the engineers reversed; court observes that contractor's allegations \"if proved, would support the Conclusion that the transaction was intended to affect [the contractor], that harm to [the contractor] was readily foreseeable, and that [the contractor's] injury was the direct result of [the engineer's] negligence].\")\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. With respect to plaintiffs' negligence claim, the jury was instructed in part as follows: \"The essential elements of common law professional negligence, each of which must be proved to recover damages are as follows: The elements of a cause of action in [tort] for professional negligence are, one, the duty of the professional to use such skill, prudence and diligence as other members of his profession commonly possess and exercise. Two, a breach of that duty. Three, a legal causal connection between the negligent conduct and the resulting injury. And four, actual loss or damage resulting from the professional's negligence.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. The Dissent argues that auditors should be subject to liability to all foreseeable users of audit reports because auditors can simply insert blanket disclaimers of third party liability in their reports. We perceive no reason to require auditors to disclaim liability to unknown persons who are not intended beneficiaries of their reports in the first instance. An audit report is directed primarily to the client. In this case, Arthur Young's report was specifically addressed to: \"The Board of Directors, Osborne Computer Corporation.\" Under the rule we adopt, if the auditor knows of a third party transaction or type of transaction which the audit report has been commissioned to influence, the report is also necessarily directed to that specific third party. Because its report is directed to no one else, an auditor need not attempt to communicate with other persons by means of a disclaimer of liability.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. Contrary to the majority's assertion, ordering a separate opinion from an auditor requires a level of business acumen and sophistication significantly above that needed merely to comprehend and rely upon an accountant's unqualified opinion in an audit report.\u003c/span\u003e\n\n",
    "body_length": 173426,
    "citedas": [
      "11 Cal. Rptr. 2d 51",
      "3 Cal. 4th 370",
      "834 P.2d 745"
    ],
    "attorneys": "Heller, Ehrman, White \u0026 McAuliffe, M. Laurence Popofsky, Marie L. Fiala, Kirk G. Werner, Robert B. Hawk, Melanie C. Gold, Paul G. Urla, Paul Buchanan, Adria Balog, Carl D. Liggio and John Matson for Defendant and Appellant. Wilke, Fleury, Hoffelt, Gould \u0026 Birney, Thomas G. Redmon, Matthew W. Powell, Willkie, Farr \u0026 Gallagher, Louis A. Craco, Deborah E. Cooper, Diana B. Simon, Pettit \u0026 Martin, John L. Boos, Laura D. Cooper, Philip F. Atkins-Pattenson and Dennis P. Scott as Amici Curiae on behalf of Defendant and Appellant. Thelin, Marin, Johnson \u0026 Bridges, Paul H. Dawes, Karl D. Belgum, Timm A. VerDuin, Jennifer M. Wilcoxen, Dianne P. Urhausen and Gene K. Cheever for Plaintiffs and Appellants. Cotchett \u0026 Illston, Cotchett, Illston \u0026 Pitre, Joseph W. Cotchett, Susan Illston, Bruce L. Simon, Karen Karpen, Michael Liberty and Nancy L. Fineman for Plaintiff and Respondent. Wright \u0026 L'Estrange, Robert C. Wright and Laurie E. Barber as Amici Curiae on behalf of Plaintiff and Respondent. Christopher Chenoweth, John J. Gill, Michael F. Crotty, Matthew H. Street, Buchalter, Nemer, Fields \u0026 Younger, Marcus M. Kaufman, Ware \u0026 Freidenrich, Peter M. Rehon, Lisa C. Roberts and Nels R. Nelsen as Amici Curiae on behalf of Plaintiffs and Appellants and Plaintiff and Respondent.",
    "category": [
      "124",
      "252"
    ],
    "judges": "Opinion by Lucas, C. J., with Panelli, Arabian, Baxter and George, JJ., Concurring. Separate Dissenting opinion by Kennard, J., with Mosk, J., Concurring.",
    "citation_count": 15
  }
}
