{
  "id": "zn-HPWYBTlTomsSBifec",
  "document": {
    "title": "United States v. Soto-Beniquez",
    "full_title": "UNITED STATES OF AMERICA v. WILLIAM SOTO-BENIQUEZ . UNITED STATES OF AMERICA v. JUAN SOTO-RAMIREZ . UNITED STATES OF AMERICA v. EDUARDO ALICEA-TORRES . UNITED STATES OF AMERICA v. RAMON FERNANDEZ-MALAV\u0026EACUTE; . UNITED STATES OF AMERICA v. CARMELO VEGA-PACHECO . UNITED STATES OF AMERICA v. ARMANDO GARCIA-GARCIA . UNITED STATES OF AMERICA v. JOSE LUIS DE LEON MAYSONET . UNITED STATES OF AMERICA v. RENE GONZALEZ-AYALA . UNITED STATES OF AMERICA v. JUAN ENRIQUE CINTRON-CARABALLO . UNITED STATES OF AMERICA v. MIGUEL VEGA-COLON . UNITED STATES OF AMERICA v. MIGUEL VEGA-COSME .",
    "jurisdiction": "First Circuit",
    "date": "2003-11-20T00:00:00.000Z",
    "docket": "No. 01-1619, 00-1464, 00-1488, 00-1470, 00-1362, 00-1543, 00-1361,, 00-1456",
    "body": "This massive drug conspiracy case from Puerto Rico involved a six-month trial and resulted in convictions of the eleven defendants who appeal, eight of whom received life sentences and three of whom received sentences of more than twenty years.\n\nThe government charged this case as involving one overarching conspiracy from January 1990 to March 1994 to distribute drugs at Bitumul (Israel Ward) in Hato Rey, San Juan, Puerto Rico and to protect that distribution through multiple murders. Twenty-two defendants were indicted on charges of conspiracy with intent to distribute more than five kilograms of cocaine, more than five kilograms of cocaine base, more than five kilograms of heroin, and more than 100 kilograms of marijuana over a four-year period, in violation of 21 U.S.C. § 841(a)(1). Two of these defendants, William Soto-Ben¡quez and Juan Soto-Ram¡rez (a/k/a Pipo), were also charged with violating the Continuing Criminal Enterprise (CCE) statute, 21 U.S.C. § 848(a) and (b). The government alleged that Soto-Ram¡rez headed the conspiracy and that Soto-Ben¡quez was the triggerman and principal supplier. The remaining nine appellants were charged with playing various roles in distributing drugs or protecting the distribution of drugs.\n\nThe original twenty-two defendants were separated into two groups. The first group of eleven, comprised of those who the government said were more major players in the conspiracy, were tried before a jury from December 28, 1998 to June 25, 1999. The jury convicted all eleven defendants on all counts with which they were charged.\n\nThe two CCE defendants were sentenced to life imprisonment on Count One, the CCE count, while Count Two, the conspiracy count, was dismissed as to them under the rule of Rutledge v. United States, 517 U.S. 292 (1996). Six other defendants were also sentenced to life imprisonment: Alicea-Torres, Fernández-Malavé, Vega-Pacheco, Garc¡a-Garc¡a, Vega-Cosme, and Cintrón-Caraballo. The remaining three -- Vega-Colón, Gonzalez-Ayala, and de León Maysonet -- were each sentenced to 292 months of imprisonment.\n\nThese appeals present three substantial issues: a multiple conspiracy issue, an issue of improper argument by the government in its rebuttal closing argument, and a set of Apprendi sentencing issues. Defendants' key theme on appeal is that the government overcharged the conspiracy in at least two significant respects. First, defendants argue that, assuming Soto-Ben¡quez and Soto-Ram¡rez did distribute drugs to points in Bitumul from 1990 until late 1992 or early 1993, the drug points were largely independent; the fact of a common supplier does not mean the independent drug point operators agreed to a conspiracy, much less to the ensuing murders. Second, defendants argue that, by late 1992, both Soto-Ben¡quez and Soto-Ram¡rez were out of action: one had been imprisoned and the other had left for Florida after narrowly escaping an attempt on his life. Any conspiracy was by then concluded, defendants assert, and the government's attempts to include another year's worth of events, until March 1994, in the conspiracy were improper. Those events involved a different and rival drug dealer, Rodr¡guez-López (a/k/a El Bebo), and took place partly in another town called Fajardo. The defendants argue that if their theory as to multiple conspiracies is correct, then there are significant ramifications that affect the application of the statute of limitations, the admissibility of testimony (particularly, evidence of fifteen horrific murders), the refusal to sever certain defendants, and various sentencing determinations.\n\nThe defendants also complain, with justification, about the government's poor record of pre-trial production of required materials, as well as its belated springing of requested sentencing enhancements on certain defendants after the Pre-Sentence Investigative Report (PSR) had been prepared and the defendants' objections to it had been served. The trial court was obviously frustrated with the government's conduct in this case and threatened three times to dismiss the indictment, but in the end did not. Post-trial, the court also found the evidence sufficient to support the convictions.\n\nOver twenty-five issues are raised in these appeals and are discussed in the sequence of events leading to and through trial, with the exception of the multiple conspiracies issue, which we discuss first.\n\nI.\n\nThe facts are stated, for sufficiency of the evidence purposes, as a reasonable jury could have found them, in the light most favorable to the verdict.\n\nThe government's case turned on the testimony of several cooperating co-conspirators -- Ramón Cesário-Soto, Victor Negrón-Maldonado (a/k/a Pitosito), and Luis Torrens-Alicea (a/k/a Pito Salsa) -- as well as the testimony of police officers and investigators.\n\nThe case centers around six drug points in the Bitumul Ward of Hato Rey, San Juan, Puerto Rico: (1) Callejón Nueve, operated by Juan Soto-Ram¡rez and later by Negrón-Maldonado, (2) La Pared, also operated by Soto-Ram¡rez, (3) Street B between La Pared and Callejón Nueve, operated by Juan Cintrón-Caraballo and supplied by Soto-Ram¡rez, (4) El Palo on Laguna Street, operated by Alberto Santiago-Figueroa, a defendant not participating in this trial, and supplied by Soto-Ram¡rez, (5) Cuba Street, which included two distribution points operated by Soto-Ben¡quez and Soto-Ram¡rez, and (6) Laguna Street, operated by Miguel Vega-Cosme. These points, which began operation around 1990, dealt in crack cocaine, cocaine, heroin, and marijuana.\n\nSoto-Ram¡rez and Soto-Ben¡quez were the leaders of the operation. Soto-Ram¡rez operated or supplied almost all of the drug points. His house at Callejón Dos was used by various defendants to prepare crack and heroin for distribution at the six drug points and to store weapons to defend and acquire territory for the drug points. When defendant Miguel Vega-Cosme established his drug point on Laguna Street with his son, defendant Miguel Vega-Colón, he first requested permission from Soto-Ram¡rez.\n\nSoto-Ben¡quez served as the triggerman and principal supplier. He ultimately supplied most of the narcotics sold at the drug points and owned many of the weapons used to kill rival gang members. Cesário-Soto described him as \"one with ranks\" in the drug world.\n\nThe remaining defendants were involved in running one or more of the six drug points. Eduardo Alicea-Torres sold drugs at the Cuba Street and Callejón Dos drug points from 1990 until at least 1991, and later began his own drug point. Ramon Fernández-Malavé packaged crack and cocaine for Soto-Ram¡rez and cooperating government witness Negrón-Maldonado in 1992. Carmelo Vega-Pacheco packaged drugs for Soto-Ram¡rez and Negrón-Maldonado through 1992, and sold narcotics at the Cuba Street drug points in 1990 and 1991. Armando Garc¡a-Garc¡a sold narcotics at the Cuba Street drug points from 1990 to 1991, packaged drugs in 1992, and sold drugs at Callejón Nueve in 1993. From 1990 to 1992, Jose de León Maysonet stored narcotics and weapons for the drug points, and after 1992, he sold narcotics at Callejón Nueve. Juan Cintrón-Caraballo operated the Street B drug point throughout the charged conspiracy. Miguel Vega-Cosme supplied Soto-Ram¡rez with narcotics and operated a drug point at Laguna Street from 1990 until 1994 with Soto-Ram¡rez's permission. Vega-Cosme also supplied ammunition used in shootings of rival gang members in 1992 and 1993, and negotiated on behalf of the group in seeking to resolve its differences with the rival Chacho gang. Miguel Vega-Colón, the son of Vega-Cosme, packaged crack cocaine, heroin, and marijuana for his father and stood as an armed guard at the Callejón Nueve drug point, a point separate from the one his father ran on Laguna Street.\n\nSeveral of the defendants were involved in a series of murders undertaken to defend and acquire territory in Bitumul on behalf of the conspiracy. The first of these killings occurred on February 10, 1991. Soto-Ram¡rez confessed to Negrón-Maldonado that he, along with two deceased members of the conspiracy, killed Dagoberto Robles-Rodr¡guez because he felt threatened by Robles-Rodr¡guez. Soto-Ram¡rez then gained control of Robles-Rodr¡guez's heroin point on Cuba Street. Soto-Ram¡rez pled guilty in a Puerto Rico court to Robles-Rodr¡guez's homicide.\n\nAnother killing occurred on February 20, 1991. As government informant Ana Luz Dones-Arroyo was leading undercover police officer Efrain Hernández de León to the location at Callejón Dos where Soto-Ram¡rez and others stored their weapons, both were gunned down. Soto-Ram¡rez shot Dones-Arroyo, and defendant Alicea-Torres killed the police officer and disposed of the body. A ballistics expert testified that the same two weapons used in the murder of Robles-Rodr¡guez were used to kill Dones-Arroyo and Hernández de León.\n\nAccording to Negrón-Maldonado's testimony, several more murders occurred after these two. On July 20, 1991, Soto-Ram¡rez ordered the murder of one of his sellers at the Cuba Street drug point, Fernando Agosto-Villegas, because two-eighths of a kilogram of cocaine and a machine gun belonging to Soto-Ram¡rez were missing. On May 12, 1992, Soto-Ben¡quez ordered the murder of Heriberto Rivera-González in retribution for the death of Jose Cosme-Sobrado (a/k/a Canito), who had been managing several of Soto-Ram¡rez's drug points. Rivera-González was suspected of participating in the murder of Cosme-Sobrado earlier that day. Defendant Cintrón-Caraballo, cooperating government witness Negrón-Maldonado, and two other members of the group kidnapped Rivera-González and brought him to Callejón Dos, where Negrón-Maldonado and others killed him. Finally, on November 25, 1992, Negrón-Maldonado, Soto-Ben¡quez, and another co-conspirator not on trial here, Juan Antonio Rodr¡guez-López, killed Reynaldo Cancel-Robles. Soto-Ben¡quez supplied a drug dealer named \"Cuelli,\" who owned a drug point outside Bitumul in the Vista Hermosa housing project. Cancel-Robles was killed because he had ousted \"Cuelli\" from this drug point.\n\nOn December 20, 1992, gang warfare broke out between the group and members of a rival gang led by \"Chacho.\" A shootout occurred between the two gangs, in which Angel Rivera-Pagán, a member of Soto-Ram¡rez's and Soto-Ben¡quez's group, was killed. Eight days later, Negrón-Maldonado, Rodr¡guez-López, and others retaliated by murdering Roberto Vasallo-Morninglane, a member of the Chacho gang.\n\nThe gang warfare continued, and several days later, on January 10, 1993, defendant Vega-Pacheco, government witnesses Cesário-Soto and Negrón-Maldonado, Rodr¡guez-López, and others went to the Quintana housing project and killed five more people, two of whom were members of the Chacho gang. Vega-Pacheco later pled guilty in a Puerto Rico court to participating in those five murders, which came to be known as the Quintana massacre.\n\nYet another murder took place on March 7, 1993, when defendant Fernández-Malavé killed Tito Dones-Sanchez. Negrón-Maldonado and Cesário-Soto testified that Fernández-Malavé opened fire on a white van after Cintrón-Caraballo and other dealers at the Callejón Nueve drug point saw it driving nearby and suspected that those inside were members of the rival El Visco gang. Dones-Sanchez was later found dead inside a white van of the same description, which a municipal police officer had witnessed leaving the Bitumul area. Fernández-Malavé pled guilty in a Puerto Rico court to the murder of Dones-Sanchez.\n\nWhile these murders were occurring in 1992 and 1993, some changes occurred in the leadership of the group. On January 8, 1992, Soto-Ram¡rez was incarcerated after pleading guilty in a Puerto Rico court to various crimes, including attempted murder. After Soto-Ben¡quez was shot in an assassination attempt, he ceased activities in Bitumul in December 1992 and moved to Florida in 1993. While Soto-Ram¡rez was in prison, Cosme-Sobrado managed three of Soto-Ram¡rez's drug points until Cosme-Sobrado was killed on May 12, 1992. Negrón-Maldonado then took over managing the points until he left for Philadelphia in June or July 1993. When managing the points, both Cosme-Sobrado and Negrón-Maldonado took instructions from Soto-Ram¡rez through telephone calls from prison and forwarded the proceeds from the drug points to Soto-Ram¡rez's wife.\n\nIn June or July 1993, Rodr¡guez-López, a former member of the group, returned to Bitumul from Fajardo, where he had fled after the Quintana massacre. Rodr¡guez-López had teamed up with defendant Rene Gonzalez-Ayala and government witness Torrens-Alicea to steal a two hundred kilogram shipment of cocaine at a beach in Fajardo. Without consulting anyone in Bitumul, Rodr¡guez-López brought the cocaine back to Bitumul and established a \"new\" drug point at Callejón Nueve, where Soto-Ram¡rez's drug point had been abandoned. Rodr¡guez-López employed several members of the original group in setting up the new drug point, including Garc¡a-Garc¡a and de León Maysonet, but he also brought in individuals from outside Bitumul, including Gonzalez-Ayala and Torrens-Alicea.\n\nTension arose between Rodr¡guez-López and the members of the original group, in particular Cintrón-Caraballo and Negrón-Maldonado, over the influx of outsiders working at the new drug point at Callejón Nueve. Torrens-Alicea testified, however, that after Negrón-Maldonado returned from Philadelphia, he \"ironed out\" these differences with Rodr¡guez-López over the course of two meetings in August or September 1993.\n\nAround that time, several defendants again became involved in violent activities. According to Torrens-Alicea's testimony, on September 12, 1993, de León Maysonet, Gonzalez-Ayala, Garc¡a-Garc¡a, and three other members of the gang went to Fajardo to find and kill an individual named Vitito, who had been hired to kill those responsible for the stolen cocaine in Fajardo. They never found Vitito. Instead, de León Maysonet, Gonzalez-Ayala, and another member of the gang were arrested in Fajardo while in possession of a firearm and eleven decks of heroin; both de León Maysonet and Gonzalez-Ayala pled guilty in Puerto Rico court to the charges. On October 11, 1993, Torrens-Alicia, Garc¡a-Garc¡a, and two others killed Oscar Nazario-Rivera in Floral Park, Hato Rey, because he was a member of the Chacho gang and had threatened Rodr¡guez-López.\n\nII.\n\nOn April 10, 1997, a federal grand jury in Puerto Rico returned a two-count indictment against the eleven appellants, along with ten other defendants. Count One charged Soto-Ben¡quez and Soto-Ram¡rez with engaging in a continuing criminal enterprise in violation of 21 U.S.C. § 848(a) and (b). Count Two charged that from about January 1, 1990, until about March 7, 1994, all twenty-one defendants conspired to distribute more than five kilograms of heroin, more than five kilograms of cocaine, more than five kilograms of cocaine base, and more than 100 kilograms of marijuana, as prohibited by 21 U.S.C. § 841(a)(1) and 21 U.S.C. § 846.\n\nRodr¡guez-López, who became a cooperating witness in the pre-trial stage of the case, testified to the grand jury. The government eventually discovered that he had lied before the grand jury about his presence at a murder. The government informed the grand jury about the false testimony, and on December 14, 1998, obtained a superseding indictment. In the superseding indictment, the government alleged the same charges against the same twenty-one defendants listed in the original indictment. The government also added Rodr¡guez-López as a defendant to the conspiracy charge of the superseding indictment, thus raising the total number of defendants to twenty-two.\n\nOn December 28, 1998, the district court divided the twenty-two defendants into two groups for trial purposes. At that point, sixteen of the original twenty-two defendants were slated to go to trial. The district court selected the eleven appellants as the first group to be tried. After an eighty-six-day trial, the jury returned a guilty verdict as to all eleven defendants on all counts for which they were charged.\n\nAll eleven defendants appealed. This court consolidated their appeals.\n\nIII.\n\nA. Sufficiency of the Evidence Proving a Single Conspiracy (Garc¡a-Garc¡a, de León Maysonet, Gonzalez-Ayala)\n\nTo join a drug conspiracy, a defendant must agree with others to advance the aim of the conspiracy -- here, to possess drugs for distribution. United States v. Garcia-Torres, 280 F.3d 1, 4 (1st Cir. 2002). Advancing the aim of the conspiracy can involve performing ancillary functions such as processing and cooking drugs, procuring weapons, collecting monies, enforcing discipline, chastising rivals, accounting, and the like, as long as such actions are performed with the aim of furthering the conspiracy. See id. To hold that defendants have \"joined\" a conspiracy, there must be sufficient evidence both that they knew about the conspiracy and that they knew the ancillary service would advance that conspiracy. Id.\n\nSpecial issues arise when defendants argue that there were multiple conspiracies and that their activities were not part of the conspiracy charged. The initial issue -- and the only issue we need to reach here -- is whether the government proved the conspiracy charged in the indictment. This issue, assuming a properly instructed jury, resolves into a sufficiency-of-evidence question. United States v. Martinez-Medina, 279 F.3d 105, 113 \u0026 n.2 (1st Cir. 2002); United States v. Wihbey, 75 F.3d 761, 773-74 (1st Cir. 1996). If the evidence is sufficient to support the jury's finding that all the defendants are guilty of the single conspiracy charged, then no error has occurred. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nA number of factors come into play in determining whether the evidence establishes a single conspiracy, \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e including (1) the existence of a common purpose, such as selling drugs for profit, (2) the interdependency of various elements in the plan, such as whether the success of an individual's own drug transactions depends on the health and success of the drug trafficking network that supplies him, and (3) the degree of overlap among the participants. See Martinez-Medina, 279 F.3d at 114; United States v. Rivera-Ruiz, 244 F.3d 263, 268 (1st Cir. 2001); United States v. Portela, 167 F.3d 687, 697 (1st Cir. 1999). We look to the totality of the evidence to see if it supports a finding of a single conspiracy. Rivera-Ruiz, 244 F.3d at 268; Portela, 167 F.3d at 696. The government need not show that each conspirator knew of or had contact with all other members. Nor need it show that the conspirators knew all of the details of the conspiracy or participated in every act in furtherance of the conspiracy. United States v. Mena-Robles, 4 F.3d 1026, 1032 (1st Cir. 1993). Changes in the cast of characters do not preclude a finding of a single overarching conspiracy. United States v. Shea, 211 F.3d 658, 665 (1st Cir. 2000).\n\nThe defendants present two main challenges to the sufficiency of evidence proving a single conspiracy. First, they argue that there was no conspiracy at all because Soto-Ram¡rez and Soto-Ben¡quez were simply common distributors to a number of diverse and independent drug points. This argument is belied by the record, which shows a great deal more than common distribution. The evidence establishes not only that Soto-Ram¡rez and Soto-Ben¡quez were the primary suppliers of the six drug points, but also that the six drug points shared a common system of defense. Various defendants stood guard at drug points owned by other co-conspirators to protect them from rival gang members. For example, Vega-Colón, who worked at his father's point on Laguna Street, also stood as an armed guard at Rodr¡guez-López's point on Callejón Nueve. Those standing guard at different drug points shared resources with each other. They communicated among themselves via walkie-talkies or radios, issuing alerts when the police or unfamiliar cars from outside Bitumul were in the area. They also shared rifles purchased and stored by Soto-Ben¡quez, and ammunition purchased by Vega-Cosme after taking up collections from each of the drug points. When the drug points were threatened by rival gangs, members of the group would join together to guard vulnerable points from attack. After the shootout with the Chacho gang in December 1992, Negrón-Maldonado, Fernández-Malavé, and Vega-Pacheco stood guard together at Callejón Dos. And after the conspiracy was threatened by members of the El Vizco gang, Soto-Ben¡quez, Negrón-Maldonado, Fernández-Malavé, and Cintrón-Caraballo stood guard together at the Street B drug point. The six drug points also negotiated as a group in settling disputes with rival gangs. When war broke out against the Chacho gang at the end of 1992, Vega-Cosme met with Chacho to negotiate on behalf of all six drug points because the war was interfering with drug sales at the Bitumul points.\n\nFurthermore, members of the group jointly avenged the deaths of others involved in the operation of the six drug points. After the death of Cosme-Sobrado, who managed Soto-Ram¡rez's drug points while he was in prison, members of the group met at Callejón Dos. Individuals from different drug points attended the meeting, including Soto-Ben¡quez and Alicea-Torres (Cuba Street point), Vega-Cosme and Vega-Colón (Laguna Street point), Cintrón-Caraballo (Street B point), and Negrón-Maldonado (Callejón Nueve point). As a result of the meeting, Negrón-Maldonado and Cintrón-Caraballo came together to kidnap and murder Rivera-González, whom Soto-Ram¡rez's wife suspected of participating in Cosme-Sobrado's murder.\n\nIn addition to this system of common defense, the co-conspirators had agreements regarding the distribution of narcotics at the drug points. Vega-Cosme and Negrón-Maldonado met at least three times to assign colors to the caps of crack capsules sold at different points in the Bitumul Ward so that their origin could be identified and competition between the points avoided. Vega-Cosme also asked Soto-Ram¡rez for permission before setting up his drug point with his son Vega-Colón on Laguna Street.\n\nThe evidence supports the jury's finding that each of the defendants joined in this common enterprise. First, the evidence establishes that each defendant joined in the common defense of the points. Seven of the defendants -- Soto-Ram¡rez, Soto-Ben¡quez, Alicea-Torres, Vega-Pacheco, Fernández-Malavé, Garc¡a-Garc¡a, and Cintrón-Caraballo -- ordered or participated in murders to protect the drug points. Soto-Ram¡rez and Alicea-Torres killed a police officer and a government informant who were about to discover the group's stash of weapons used to protect the drug points. Soto-Ram¡rez ordered the murder of one of his drug dealers when some cocaine and a machine gun disappeared, sending the message that those who broke ranks and stole from the group would be punished. See United States v. Rodriguez, 162 F.3d 135, 143 (1st Cir. 1998) (finding the beating of a member of the conspiracy suspected of being an informant to be in furtherance of the conspiracy because it served to \"maintain[] discipline in [the conspiracy's] ranks\"). On Soto-Ben¡quez's orders, Cintrón-Caraballo kidnapped Rivera-González and brought him to Bitumul to be killed to avenge the death of Cosme-Sobrado. Vega-Pacheco participated in the Quintana massacre to avenge the death of Rivera-Pagán, a member of the group. While defending the group's territory at Callejón Nueve, Fernández-Malavé killed Tito Dones-Sanchez by opening fire on a van suspected of containing rival gang members. Garc¡a-Garc¡a killed a member of the rival Chacho gang who threatened Rodr¡guez-López.\n\nAlthough not direct participants in those murders, the remaining four defendants also contributed to the common defense of the drug points. We put aside, for the moment, the issue of whether the group's post-1993 activities involved a separate conspiracy. De León Maysonet and Gonzalez-Ayala went to Fajardo for the purpose of killing someone who threatened Rodr¡guez-López. Vega-Cosme supplied ammunition for shootings of rival gang members in 1992 and 1993 and negotiated on behalf of the group with the Chacho gang. Vega-Colón stood as an armed guard at Rodr¡guez-López's point on Callejón Nueve.\n\nSecond, in addition to evidence that each defendant participated in the system of common defense, there is evidence that each defendant participated in the common enterprise of selling drugs through the six points. We again put aside for the moment whether the group's post-1993 activities involved a separate conspiracy. Soto-Ram¡rez controlled several drug points, and his house was used to prepare and package crack and heroin for distribution at several of the drug points. Soto-Ben¡quez was the primary supplier of cocaine and crack to the six drug points. Alicea-Torres and Vega-Pacheco sold narcotics for points owned by Soto-Ben¡quez and Soto-Ram¡rez from 1990 to 1991. Fernández-Malavé packaged crack cocaine, cocaine, and heroin from 1992 to 1993, and packaged cocaine specifically for Soto-Ram¡rez from May 1992 to December 1992. Garc¡a-Garc¡a sold narcotics for Soto-Ben¡quez and Soto-Ram¡rez from 1990 to 1991, packaged narcotics in 1992, and returned to selling narcotics for Rodr¡guez-López in 1993. Cintrón-Caraballo supervised a drug point for crack cocaine and distributed cocaine and crack cocaine for Soto-Ram¡rez throughout the duration of the conspiracy. Gonzalez-Ayala helped Rodr¡guez-López steal 200 kilograms of cocaine for the conspiracy in 1993 and subsequently packaged and distributed it. De Leon Maysonet packaged and stored narcotics for the conspiracy from 1990 to 1992 and then sold narcotics at the Callejón Nueve point in 1993. Vega-Cosme supplied ammunition and narcotics to Soto-Ram¡rez and distributed heroin at a drug point with Soto-Ram¡rez's permission throughout the duration of the conspiracy. Vega-Colón, Vega-Cosme's son, packaged crack, heroin, and marijuana for his father's point.\n\nThe second argument challenging the sufficiency of evidence proving a single conspiracy is presented by defendants Garc¡a-Garc¡a, de León Maysonet and Gonzalez-Ayala. They argue that the government overreached in counting as part of one massive conspiracy a separate, later, and antagonistic drug-selling group. The three defendants argue that they cannot be guilty of the continuing conspiracy when they were in competition with the original conspiracy and the original conspirators were out to kill the head of their drug group. They concede that the evidence does show their involvement with separate drug points. But the evidence does not, they contend, show that they participated in an overall drug conspiracy headed by Soto-Ben¡quez and Soto-Ram¡rez. They argue that this conspiracy effectively ended by the summer of 1993. In January 1992, Soto-Ram¡rez was arrested and incarcerated. And William Soto-Ben¡quez, after escaping death in a shootout, ceased activities in Bitumul in December 1992 and moved to Florida in 1993. Cosme-Sobrado, who succeeded Soto-Ram¡rez, was killed on May 12, 1992, and Victor Negrón-Maldonado left for Philadelphia in June or July 1993.\n\nThe three defendants argue that later events centered around a separate conspiracy, led by Rodr¡guez-López. Rodr¡guez-López, who had originally been part of the conspiracy headed by Soto-Ram¡rez and Soto-Ben¡quez, left Bitumul for Fajardo in the summer of 1993 to avoid being arrested for his involvement in the Quintana massacre. While in Fajardo, he stole a 200 kilogram shipment of cocaine. Upon his return to San Juan in June or July of 1993, and without consulting anyone in Bitumul, Rodr¡guez-López reestablished a drug point at Callejón Nueve with the stolen cocaine, employing outsiders from Fajardo to operate the point. Negrón-Maldonado testified that while he was in Philadelphia, he had telephone conversations with people in Bitumul, including Cintrón-Caraballo, who wanted to kill Rodr¡guez-López for bringing outsiders into the Bitumul operation; Torrens-Alicea confirmed that some members of the original group \"were out to kill\" Rodr¡guez-López.\n\nEach of the three defendants argues that the multiple conspiracies theory affects his liability in a different way. Gonzalez-Ayala contends that, at most, he was a member only of a later uncharged conspiracy headed by Rodr¡guez-López; he did not join any conspiracy at all until the summer of 1993, when he helped Rodr¡guez-López steal the shipment of cocaine and returned with Rodr¡guez-López to set up the drug point at Callejón Nueve. Gonzalez-Ayala thus contends that no evidence ties him to the other Bitumul drug points or the earlier murders connected with those drug points.\n\nDe León Maysonet contends that he was prejudiced by the government's single conspiracy theory because all of his participation in the original conspiracy occurred while he was a minor. He was nonetheless held liable as an adult because he supposedly ratified the conspiracy by continuing to participate after he turned eighteen on January 12, 1992. United States v. Welch, 15 F.3d 1202, 1211-12 (1st Cir. 1993). He contends, however, that the only acts of ratification presented by the government occurred after the original conspiracy had ended and Rodr¡guez-López had taken over.\n\nGarc¡a-Garc¡a argues that the government's presentation of a single overarching conspiracy, rather than multiple conspiracies, subjected him to evidence of murders in which he did not participate. Garc¡a-Garc¡a contends that the only murder in which he allegedly participated -- that of Oscar Nazario-Rivera -- occurred after the original conspiracy ended and was not drug-related.\n\nThe jury was instructed on multiple conspiracies, at the request of the defense. The district court informed the jury that it must acquit \"[e]ven if the evidence in the case shows that defendants were a member of some conspiracy, and not the single conspiracy charged in the indictment.\" As noted earlier, where the jury was properly instructed and found the defendants guilty of conspiracy, its verdict is reviewable only for sufficiency of evidence. David, 940 F.2d at 732.\n\nOn the evidence, a jury could have concluded that there was a later, rival conspiracy, but it was not compelled to do so. There is sufficient evidence to support the jury's verdict of guilt, as well as its implicit finding that a single conspiracy existed that extended through the summer of 1993. The jury could plausibly have found that Rodr¡guez-López was a member of the original conspiracy, that the reestablishment of the Callejón Nueve drug point in the small neighborhood of Bitumul was part of an agreed-upon general operation to sell drugs and to control the drug trade in Bitumul, that the tension among the members of the overarching group did not destroy the overall agreement, that those tensions were worked out, and that the cooperation worked to everyone's benefit and continued to provide a system of common defense.\n\nGovernment informant Luis Torrens-Alicea testified that differences between Rodr¡guez-López and the original Bitumul conspiracy were \"ironed out\" during two meetings involving Rodr¡guez-López, Negrón-Maldonado, and Cintrón-Caraballo at the El Trebol housing project in August or September of 1993. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Other evidence corroborates this account. Members of the original group continued to transact and meet with Rodr¡guez-López after his return. Negrón-Maldonado bought heroin on credit from Rodr¡guez-López on at least one occasion, and \"cooked\" crack cocaine for Rodr¡guez-López. \"Peter,\" who managed Soto-Ram¡rez's point, Alicea-Torres, and Vega-Cosme all distributed kilograms of cocaine for Rodr¡guez-López after his return. On September 12, 1993, Garc¡a-Garc¡a, de León Maysonet, and two other members of the original Bitumul group joined together with newcomers Gonzalez-Ayala and Torrens-Alicea to find and kill Vitito, who had been hired to kill those who had stolen the 200 kilogram shipment of cocaine in Fajardo. Furthermore, after Rodr¡guez-López's return, Soto-Ram¡rez, Vega-Cosme, Cintrón-Caraballo, and Negrón-Maldonado all continued to operate the same drug points, and Garc¡a-Garc¡a, de León Maysonet, Alicea-Torres, Fernández-Malavé, and two other members of the original conspiracy continued to work at those points.\n\nMoreover, contrary to defendants' assertions that the drug points operated independently after the summer of 1993, the evidence permitted the conclusion that they continued to work together. Negrón-Maldonado's three meetings with Vega-Cosme to coordinate the cap colors for crack capsules occurred between September and November of 1993, three to five months after Rodr¡guez-López's return. In addition, members of the conspiracy acted jointly to defend each other from threats. Vega-Cosme continued to purchase ammunition for the collective defense of the drug points. On September 12, 1993, as mentioned earlier, members of the original Bitumul group joined with the newcomers to find and kill Vitito, who had been hired to kill Rodr¡guez-López and others. On October 11, 1993, Torrens-Alicea, Garc¡a-Garc¡a, and two other individuals murdered Oscar Nazario-Rivera, a member of the rival Chacho gang who had threatened Rodr¡guez-López. Members of the conspiracy also continued to warn one another about possible threats. In 1994, after Vega-Cosme's drug point was shot at by individuals from San Jose, he went to Cintrón-Caraballo and Negrón-Maldonado to warn them of the danger. And on several occasions in early 1994, after Alberto Santiago-Figueroa, who ran the El Palo point on Laguna Street, saw people armed with rifles driving by his point, he sent a messenger to inform Negrón-Maldonado of what he had seen.\n\nBecause the record supports the jury's finding of a single conspiracy, the three defendants are liable for their participation. Although Gonzalez-Ayala may have joined the conspiracy late, as long as he did so knowingly, he is liable for the conspiracy itself and earlier acts in furtherance of the conspiracy. David, 940 F.2d at 735. A jury could easily have found that he joined knowingly. Gonzalez-Ayala was present at the meeting of Negrón-Maldonado, Cintrón-Caraballo, and Rodr¡guez-López in August or September of 1993, in which they worked out their differences. He also participated in the trip to Fajardo to kill Vitito. Mere association with conspirators does not establish a knowing intent to join a conspiracy. United States v. Gomez-Pabon, 911 F.2d 847, 853 (1st Cir. 1990). But, in this situation, the jury could have reasonably inferred from Gonzalez-Ayala's presence at negotiations between major players in the gang and from his participation in the hunt for Vitito that he knew or learned of \"the essential nature of the plan\" to distribute narcotics in Bitumul and the violent tactics used to carry out that distribution. Mena-Robles, 4 F.3d at 1032 (quoting United States v. O'Campo, 973 F.2d 1015, 1019 (1st Cir. 1992)).\n\nSimilarly, although de León Maysonet joined the conspiracy as a minor, he ratified his participation after he had turned eighteen. In 1993, he stood guard at the Callejón Nueve point, packaged and stored narcotics for the point, and participated in the unsuccessful mission to Fajardo in 1993 to find and kill Vitito.\n\nGarc¡a-Garc¡a actively participated in the conspiracy from the beginning, selling drugs at the Cuba Street point from 1990 to 1991 and packaging narcotics for drug points from 1992 to 1993.\n\nWe reject the defendants' multiple conspiracies arguments.\n\nB. Pre-Trial\n\n1. Grand Jury Misconduct (Soto-Ben¡quez, Soto-Ram¡rez, Fernández-Malavé) \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nOne event concerning a grand jury witness underlies a number of issues presented by the defense.\n\nThe government used a then-cooperating conspirator, Rodr¡guez-López, as a grand jury witness in obtaining the original indictment on April 10, 1997. In July of 1998, the prosecution first learned that it might have been misled by Rodr¡guez-López. Negrón-Maldonado, who had just started cooperating with federal authorities, informed the prosecution that Rodr¡guez-López was not, as he had told the prosecution, present at Rivera-González's murder. When confronted with this information, Rodr¡guez-López admitted that he had lied to FBI investigators about being present at the murder but insisted that he had not fabricated any of his testimony before the grand jury, which did not address the Rivera-González murder.\n\nRather than disclose this information immediately, the prosecution waited and investigated. In November 1998, the government learned from a second cooperating defendant that Rodr¡guez-López also might have lied about his presence at several other murders, including at least one murder about which he had testified to the grand jury, that of Rivera-Pagán. On November 18, the government notified defense counsel of this inconsistency. It also insisted that Rodr¡guez-López, who still denied lying to the grand jury, take a polygraph test. When he failed the test on December 1, Rodr¡guez-López admitted that he had indeed lied during the grand jury proceedings and that he had not been present at Rivera-Pagán's murder. On December 14, the prosecution obtained a superseding indictment from the grand jury that changed Rodr¡guez-López from a star government witness to a defendant. The superseding indictment, which was returned 15 days before trial started, was based on the testimony of a federal agent who presented the government's evidence that Rodr¡guez-López had lied to the FBI. Rodr¡guez-López did not testify at trial.\n\nSeveral defendants object that their convictions were irreparably tainted by Rodr¡guez-López's perjury before the grand jury. The trial court rejected this claim, holding that the fact that the superseding indictment was obtained and the perjured testimony was not presented at trial cured any problem. That ruling was correct.\n\nThe unknowing presentation of perjured testimony before the grand jury was harmless and does not warrant any remedial action. \"[A]s a general matter, a district court may not dismiss an indictment for errors in grand jury proceedings unless such errors prejudiced the defendants.\" Bank of Nova Scotia v. United States, 487 U.S. 250, 254 (1988); see also United States v. Flores-Rivera, 56 F.3d 319, 328 (1st Cir. 1995). Here, the district court specifically found that \"[d]efendants can hardly show prejudice when the matter was later explained to the Grand Jury and the perjured testimony has not been used in trial.\" We review this conclusion only for an abuse of discretion. See United States v. Maceo, 873 F.2d 1, 3 (1st Cir.), cert. denied, 493 U.S. 840 (1989). No such abuse was present here.\n\nFirst, the grand jury returned a superseding indictment after learning of the perjured testimony, thereby demonstrating that sufficient evidence existed to indict the defendants even absent the testimony of Rodr¡guez-López.\n\nOf even greater import, a petit jury subsequently found the defendants guilty beyond a reasonable doubt of the charges alleged in the indictment. Such a finding \"demonstrates a fortiori that there was probable cause to charge the defendants with the offenses for which they were convicted.\" United States v. Lopez-Lopez, 282 F.3d 1, 9 (1st Cir. 2002) (quoting United States v. Mechanik, 475 U.S. 66, 67 (1986)). As such, \"[a]ll but the most serious errors before the grand jury are rendered harmless by a conviction at trial.\" United States v. Reyes-Echevarria, No. 02-1653, 2003 U.S. App. LEXIS 19614, at *6 (1st Cir. Sept. 22, 2003). \"Only a defect so fundamental that it causes the grand jury no longer to be a grand jury, or the indictment no longer to be an indictment\" is sufficient to invalidate a subsequent conviction. Id. (quoting Midland Asphalt Corp. v. United States, 489 U.S. 794, 802 (1989)). The government's unknowing presentation of perjured testimony before the grand jury is not a defect of that magnitude on these facts.\n\n2. Indictment\n\na) Pre-Indictment Delay (Soto-Ben¡quez, Soto-Ram¡rez)\n\nSoto-Ben¡quez and Soto-Ram¡rez argue that the indictment should have been dismissed because the government delayed in obtaining it. As discussed infra, the indictment complied with the statute of limitations, which is the primary safeguard against pre-indictment delay. When the statute of limitations has been met, a defendant seeking reversal of his conviction based on pre-indictment delay \"bears the heavy burden of showing not only that the pre-indictment delay caused him actual, substantial prejudice, but also that the prosecution orchestrated the delay to gain a tactical advantage over him.\" United States v. Stokes, 124 F.3d 39, 46-47 (1st Cir. 1997); see also United States v. Marion, 404 U.S. 307, 324 (1971). Soto-Ben¡quez and Soto-Ram¡rez have not attempted to make such a showing.\n\nb) Constitutionality of CCE Indictment (Soto-Ben¡quez, Soto-Ram¡rez)\n\ni. Failure to Charge Three Predicate CCE Acts\n\nSoto-Ben¡quez and Soto-Ram¡rez argue that their CCE convictions should be reversed because the indictment did not set forth as elements of the offense the three predicate offenses required for the crime of CCE, 21 U.S.C. § 848. As described in our case law, the elements of a CCE crime are (1) the defendant committed a felony violation of the federal narcotics laws, (2) the violation was part of a continuing series of violations, (3) the series of offenses occurred in concert with five or more persons, (4) the defendant was an organizer, supervisor, or manager, and (5) the defendant obtained substantial income or resources from the series of violations. United States v. Rouleau, 894 F.2d 13, 14 (1st Cir. 1990). To show a continuing series of violations, three or more predicate drug offenses must be demonstrated. Id.\n\nDefendants argue that their due process rights were violated because they were deprived of adequate notice of the predicate offenses underlying the CCE charge. Where the CCE count of an indictment does not list the specific predicate offenses but those offenses are alleged in other counts of the indictment, courts have generally held that defendants have received actual notice of the charges and no reversible error has occurred. United States v. Staggs, 881 F.2d 1527, 1530-31 (10th Cir. 1989) (finding indictment adequate where no underlying violations were specified in the CCE count but at least three underlying violations were listed elsewhere in the indictment); United States v. Moya-Gomez, 860 F.2d 706, 752 (7th Cir. 1988); United States v. Becton, 751 F.2d 250, 256-57 (8th Cir. 1984). We think it preferable for predicate offenses to be alleged in the CCE count. But, at least where the CCE count incorporates by reference predicate offenses charged elsewhere in the indictment, failure to list predicate offenses in the CCE count itself is not reversible error because the defendant has been provided fair notice. Moya-Gomez, 860 F.2d at 752; Becton, 751 F.2d at 256-57.\n\nHere, while the CCE count did not explicitly set forth three CCE predicate offenses, it incorporated Count Two, the conspiracy count. Count Two did provide such notice. Count Two states that \"at divers times\" between January 1, 1990 and March 7, 1994, the defendants distributed and possessed with intent to distribute heroin, cocaine, crack cocaine, and marijuana. It further states that the defendants \"would purchase multi-kilogram quantities of heroin, cocaine and marijuana at wholesale prices, . . . would cut, divide, and package [the drugs] in small packages for subsequent sale at drug points, [and] . . . would sell packaged [drugs] in small quantities to customers at drug points.\" That count also alleges specifically that Soto-Ram¡rez and Soto-Ben¡quez supervised the \"supply [of] sellers with the drugs to be sold . . . and [the sale of] narcotics at drug point,\" and that they would \"personally deliver packaged narcotics to [their] runners and sellers.\"\n\nDefendants argue (1) that the acts described in Count Two are insufficient to provide notice because they establish only one predicate offense, namely, the conspiracy to distribute narcotics, \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e and (2) that the acts are insufficiently described. Both assertions are incorrect. As to the defendants' first contention, each act of distribution described in the indictment constitutes a separate predicate offense. See, e.g., United States v. Escobar-de Jes£s, 187 F.3d 148, 160 n.6 (1st Cir. 1999) (treating two different incidents of possession with the intent to distribute as two separate predicate offenses). Multiple acts of distribution, certainly three or more, are alleged. As to their second contention, the time period and acts are alleged in sufficient detail to provide adequate notice.\n\nDefendants then argue that the indictment failed to specify either the amount of drugs distributed or the amount of \"substantial income\" received by the defendants, thus depriving them of notice as to whether they were charged under 21 U.S.C. § 848(a) or (b). Section 848(a) carries a sentence of thirty years to life, whereas § 848(b) carries a mandatory life sentence. We reject defendants' argument. Defendants, merely by reading the indictment, were on notice of the possibility of a life sentence. Section 848(b) requires life imprisonment for the \"principal . . . leaders\" of the continuing criminal enterprise if their violation of the drug laws involved more than 300 times the quantity described in 21 U.S.C. § 841(b)(1)(B). The indictment identified Soto-Ram¡rez and Soto-Ben¡quez as the two \"leader[s] . . . of the drug-trafficking organization described in Counts One and Two.\" It also identified them as conspiring to distribute, inter alia, more than five kilograms of cocaine base, which is more than 300 times the five grams of cocaine base described in § 841(b)(1)(B).\n\nDefendants also argue that in the indictment the predicate offenses for the CCE charge were based on the conspiracy count, but at trial, the government used evidence of uncharged narcotics offenses to establish the predicate offenses. Thus, defendants argue, although the CCE charge remained the same, the facts used to prove the series element of the charge were different from those set forth in the indictment.\n\nDefendants frame this argument as a claim of constructive amendment, but it is actually a claim of variance. \"A constructive amendment occurs when the charging terms of the indictment are altered, either literally or in effect, by prosecution or court after the grand jury has last passed upon them. A variance occurs when the charging terms remain unchanged but when the facts proved at trial are different from those alleged in the indictment.\" United States v. Fisher, 3 F.3d 456, 462 (1st Cir. 1993) (citations and quotation marks omitted). Convictions may be reversed based on variance only upon a showing of prejudice to the defendant's substantial rights -- that is, when lack of notice regarding the charges deprives the defendant of his ability to prepare an effective defense and to avoid surprise at trial. Id. Here, defendants were not prejudiced. The indictment charged them with violations of narcotics laws from January 1990 to March 1994; the use of narcotics offenses in that time period should have been no surprise to them.\n\nii. CCE Prosecution As Contrary to CongressionalIntent\n\nSoto-Ben¡quez and Soto-Ram¡rez next argue that their prosecution under the CCE statute is contrary to legislative intent. That intent, they contend, is to enhance punishment for large-scale drug kingpins. Defendants argue that the evidence did not show them to be kingpins because they lived modestly. The government argues that we should not entertain this argument because the crime charged is within the statutory language and that ends the inquiry. If the crime charged is literally within the words of the statute, there is not usually occasion to inquire into intent. See United States v. Rutherford, 442 U.S. 544, 551 (1979). That is the case here.\n\nTo the extent that defendants' argument challenges the sufficiency of evidence as to the substantial income element of the CCE charge, it fails. Soto-Ben¡quez sold at least $10,000 worth of cocaine per week to Negrón-Maldonado. Soto-Ram¡rez owned three drug points for at least three years, each of which yielded approximately $5,000 per week from crack cocaine alone. These figures provide sufficient evidence to support the jury's finding of substantial income.\n\nc) Statute of Limitations (Soto-Ben¡quez, Soto-Ram¡rez)\n\nSoto-Ben¡quez and Soto-Ram¡rez argue that their prosecution was untimely under the statute of limitations. A CCE offense consists of a series of three or more underlying predicate offenses. A CCE charge is within the statute of limitations if the government demonstrates that at least one predicate act was committed in the five years prior to the indictment. See, e.g., United States v. Baker, 10 F.3d 1374, 1410 (9th Cir. 1993). In this case, the indictment is dated April 11, 1997. Thus, the prosecution had to prove that one predicate act was committed on or after April 12, 1992.\n\nThe parties dispute which acts count as predicate offenses for purposes of determining whether the statute of limitations has run. Soto-Ben¡quez and Soto-Ram¡rez argue, by analogy to the RICO statute, that only the acts of the parties charged with the CCE count, and not those of their co-conspirators, may be considered. See United States v. Torres-Lopez, 851 F.2d 520, 524-25 (1st Cir. 1988) (applying this rule to substantive RICO charges). The government argues that it need only demonstrate that acts in furtherance of the conspiracy occurred within the five-year limitations period and that the defendants failed to withdraw from the conspiracy.\n\nWe need not resolve this issue because the evidence, viewed in the light most favorable to the prosecution, is sufficient to support the conclusion that both Soto-Ram¡rez and Soto-Ben¡quez themselves committed predicate offenses after April 12, 1992. Although Soto-Ram¡rez was incarcerated on January 8, 1992, the government presented evidence that he still controlled and managed the drug points at La Pared, Callejón Nueve, and Cuba Street. While he was in prison, he employed Cosme-Sobrado to manage the points until May 1992. After Cosme-Sobrado was killed, Soto-Ram¡rez appointed \"Manol¡n\" and \"Peter\" as Cosme-Sobrado's successors. Soto-Ram¡rez gave instructions on the operation of the points by telephone, and the proceeds from the points were given to Soto-Ram¡rez's wife. This evidence of Soto-Ram¡rez's own acts within the five-year period is sufficient to establish the timeliness of his indictment.\n\nSoto-Ben¡quez argues that he ceased all activities related to the conspiracy in December 1992 when he moved to Florida. Assuming arguendo that this statement is true, the December 1992 date does not help Soto-Ben¡quez. The operative date for limitations purposes is April 12, 1992, some eight months earlier. The record supports the conclusion that Soto-Ben¡quez engaged in predicate offenses after that date. In January 1993, for example, Soto-Ben¡quez provided transportation, firearms, and a hide-out for members of the Bitumul gang after the Quintana massacre, in which the gang murdered five people in retaliation for the death of fellow gang member Rivera-Pagán. Soto-Ben¡quez's indictment was not barred by the statute of limitations.\n\n3. Abuse of Prosecutorial Discretion (Fernández-Malavé)\n\nFernández-Malavé makes a generalized protest that the federal prosecution should never have been brought because he (and many of the other defendants) had already pled guilty to related state charges. This argument does not present an issue that is reviewable by this court. Whatever the contours of permissible attacks on the exercise of prosecutorial discretion, this claim lies outside of those contours. See United States v. Stokes, 124 F.3d 39, 45 (1st Cir. 1997) (\"[T]he federal government [has] a perfect right to take a hard look at [a] case and to determine whether society's interests call for the unusual step of instituting a federal prosecution notwithstanding the prior commencement of a state prosecution for substantially the same conduct.\").\n\n4. Pre-Trial Denial of Motions for Severance (Gonzalez-Ayala, de León Maysonet)\n\nGonzalez-Ayala and de León Maysonet appeal from the district court's denial of their motions to be severed and tried with the second group of defendants. On December 28, 1998, the day on which jury selection began, the district court decided to split the sixteen defendants who planned to go to trial into two groups. The government proposed that the first ten defendants on the indictment become the first group to go to trial. The government's reasoning was that this division would allow the prosecution to \"try[] the senior conspirators together, that is the principal leaders, and the organizers and supervisors of the conspiracy\" and to \"try[] the conspirators who planned and carried [out] numerous acts of violence within the conspiracy together.\" The district court initially accepted this proposal but then severed one defendant to allow for a mental competency hearing, another defendant because he was on bond, and yet another defendant because his counsel withdrew from the case on that day. Two other defendants were severed because they could not yet proceed to trial; one was still a fugitive and the other, Rodr¡guez-López, had been indicted only two weeks earlier. Having severed five defendants, the district court was left with the eleven appellants and decided to proceed to trial with all eleven.\n\nGonzalez-Ayala and de León Maysonet contend that the district court erred in refusing to sever their cases. Rule 14, Fed. R. Crim. P., allows a trial court to sever defendants when joinder would prejudice them. Gonzalez-Ayala and de León Maysonet argue that the joinder prejudiced them by forcing them to go to trial with more senior conspirators. They contend that the complexity of the case and the markedly different degrees of culpability between them and their co-defendants, many of whom committed murders or held leadership positions in the conspiracy, created the potential for jury confusion. Moreover, they argue that they were prejudiced by the presentation of spillover evidence regarding fifteen murders committed by their co-defendants, in which they did not participate.\n\nWe review the district court's denial of defendants' motions for severance under Fed. R. Crim. P. 14 for abuse of discretion. United States v. Lane, 474 U.S. 438, 449 n.12 (1986); United States v. DeLuca, 137 F.3d 24, 36 (1st Cir. 1998). To demonstrate abuse of discretion, defendants must show that joinder deprived them of a fair trial, resulting in a miscarriage of justice. United States v. Baltas, 236 F.3d 27, 33 (1st Cir. 2001). Because the general rule is that those indicted together are tried together to prevent inconsistent verdicts and to conserve judicial and prosecutorial resources, severance is particularly difficult to obtain where, as here, multiple defendants share a single indictment. United States v. O'Bryant, 998 F.2d 21, 25 (1st Cir. 1993).\n\nDefendants have not made such a strong showing of prejudice. As to the murder evidence, defendants cannot complain of an improper spillover effect where evidence is independently admissible against them. United States v. Brandon, 17 F.3d 409, 440 (1st Cir. 1994); O'Bryant, 998 F.2d at 26. Because conspiracy cases often involve evidence that is admissible against all members of the conspiracy, \"in the context of conspiracy, severance will rarely, if ever, be required.\" DeLuca, 137 F.3d at 36 (quoting Flores-Rivera, 56 F.3d at 325 (internal quotation marks and citations omitted)). Here, the murder evidence would likely be admissible against Gonzalez-Ayala and de León Maysonet even in a separate trial in order to demonstrate the operation and development of the conspiracy's system of common defense.\n\nAs to the complexity of the case and the potential for jury confusion, there is no indication that the jury was unable to distinguish the evidence and acts relating to each defendant. The court instructed the jury that each defendant must be judged separately based on the evidence admissible against him. Defendants are not entitled to severance solely on the basis that their co-defendants were more culpable. See Flores-Rivera, 56 F.3d at 325; Brandon, 17 F.3d at 440-41.\n\n5. Pre-Trial Discovery (Soto-Ben¡quez, Soto-Ram¡rez, Fernández-Malavé, Alicea-Torres)\n\nDefendants make both a generalized attack on the government's habitual dilatoriness in turning over discovery material and more specific attacks. Here, we address only the alleged lateness of the prosecution's compliance with discovery; the Brady and Giglio claims are dealt with later, as are the specific attacks.\n\nSeveral of the defendants allege that the prosecution consistently failed to respond to discovery requests and orders in a timely fashion, and then \"smother[ed] [them] with an avalanche of documents during trial.\" The defendants are correct that the prosecution did, on several occasions, fail to comply with discovery timetables set by the district court. These discovery violations do not warrant reversing the defendants' convictions.\n\nWe have long recognized that \"the decision as to whether discovery sanctions are warranted and the choice of what sanctions should be imposed are matters within the sound discretion of the trial court.\" Gannett v. Carp (In re Carp), 340 F.3d 15, 23 (1st Cir. 2003); Media Duplication Servs., Ltd. v. HDG Software, Inc., 928 F.2d 1228, 1238 (1st Cir. 1991). As such, review of a district court's use or non-use of discovery sanctions is only for abuse of discretion. See United States v. One 1987 BMW 325, 985 F.2d 655, 657 (1st Cir. 1993). An abuse of discretion \"occurs when a material factor deserving significant weight is ignored, when an improper factor is relied upon, or when all proper and no improper factors are assessed, but the court makes a serious mistake in weighing them.\" Indep. Oil \u0026 Chem. Workers, Inc. v. Procter \u0026 Gamble Mfg. Co., 864 F.2d 927, 929 (1st Cir. 1988).\n\nThe district court did not abuse its discretion in refusing to dismiss the indictment due to the prosecution's discovery violations. Rather than resort to the drastic remedy of dismissal, the district court wisely addressed the prosecution's failures to comply with discovery deadlines on a situation-by-situation basis in order to prevent or remedy any prejudice that those violations may have had on the defendants. Cf. United States v. Santana, 6 F.3d 1, 11 (1st Cir. 1993) (suggesting that a court should not dismiss an indictment when prosecutorial misconduct is \"redressable through the utilization of less drastic disciplinary tools\"). For instance, in response to the government's failure to comply with one discovery order, the district court chastised the prosecution and ordered the government to provide the defendants with information not normally covered by Rule 16 of the Federal Rules of Criminal Procedure. Addressing another violation, the district court set an accelerated discovery timetable and warned the prosecution that \"[i]f the government fails to comply, the court will dismiss the indictment.\" In a third instance, the court refused to admit into evidence a photograph that the prosecution had not adequately disclosed to the defense. Each of these responses to the government's discovery violations helped mitigate any prejudice to the defendants that might otherwise have resulted from the government's apparent inability to meet discovery deadlines. Given this solution, the district court's continual denials of the defendants' motions to dismiss the indictment due to the government's discovery violations were certainly not abuses of discretion. That conclusion is not a condonation of the government's behavior; it is just a recognition that reversal of the conviction is not warranted, given the district court's imposition of other sanctions.\n\nC. Alleged Trial Errors\n\n1. Evidentiary Rulings\n\na) Admission of Murder Evidence As to CCE Defendants (Soto-Ben¡quez, Soto-Ram¡rez)\n\nSoto-Ben¡quez and Soto-Ram¡rez object that they were unfairly prejudiced by the admission of evidence concerning the murders of Jose Cosme-Sobrado, Angel Rivera-Pagán, and Miguel Angel Millan-Soto (a/k/a Guelo). The district court found that the three murders were not part of the conspiracy, but admitted the evidence over the defendants' Rule 403 objection because the three murders explained the motive for subsequent murders that did further the conspiracy.\n\nThe district court's ruling is reviewed for abuse of discretion. Old Chief v. United States, 519 U.S. 172, 183 n.7 (1997). The court did not abuse its discretion in admitting the evidence. Cosme-Sobrado's murder was relevant to demonstrate a motive for an overt act in furtherance of the conspiracy: the kidnapping and murder of Herberto Rivera-González. Members of the conspiracy killed Rivera-González because he was a suspected participant in Cosme-Sobrado's murder. Cosme-Sobrado's death was also important to demonstrate that conspirators from different drug points would come together to avenge the death of a member of their gang. Similarly, the killings of Rivera-Pagán and Millan-Soto in shootings by the Chacho gang were relevant to demonstrate the basis for gang warfare with Chacho. This gang warfare led to two overt acts in furtherance of the conspiracy: the murder of Roberto Vasallo-Morninglane, who was a member of the Chacho gang, and the Quintana massacre.\n\nSoto-Ram¡rez and Soto-Ben¡quez also claim, without further explanation, that they were prejudiced by evidence of twelve other murders. Because this argument is made in a perfunctory manner, unaccompanied by any effort at developed argumentation, it has been waived. See Grella v. Salem Five Cent Sav. Bank, 42 F.3d 26, 36 (1st Cir. 1994).\n\nb) Admission of Murder Evidence As to Non-CCE Defendants (Garc¡a-Garc¡a, Gonzalez-Ayala, de León Maysonet)\n\nThree defendants contend that evidence of murders should not have been admitted against them because the government did not establish a connection between any of the murders and the charged conspiracy. They argue that the murders were not shown to be in furtherance of the charged conspiracy. They also argue that even if the murders were in furtherance of a conspiracy headed by Soto-Ram¡rez and Soto-Ben¡quez from 1990 until the summer of 1993, those murders did not advance the interests of the later conspiracy headed by Rodr¡guez-López. These errors regarding the admission of the murder evidence, they contend, cannot be harmless because the murders constituted about seventy-five percent of the government's evidence at trial.\n\nReview is for abuse of discretion. No abuse occurred here. The three murders discussed in the previous section were admissible to demonstrate the motive for subsequent overt acts in furtherance of the conspiracy. The remaining murders were admissible as acts in furtherance of the conspiracy.\n\nA reasonable factfinder could infer that the murder of Dagoberto Robles-Rodr¡guez was in furtherance of the conspiracy. Soto-Ram¡rez and Soto-Ben¡quez worked for Robles-Rodr¡guez, who owned the drug point on Cuba Street, at the time of the murder. Negrón-Maldonado testified that Soto-Ram¡rez teamed up with co-conspirators Cosme-Vega and \"Manol¡n\" and killed Robles-Rodr¡guez at least partly because Soto-Ram¡rez felt threatened by him. Afterwards, Soto-Ram¡rez and Soto-Ben¡quez took control of Robles-Rodr¡guez's drug point. A reasonable inference is that Soto-Ram¡rez killed Robles-Rodr¡guez to avoid further threats and to gain full control of the drug point, thus eliminating a potential competitor to the conspiracy.\n\nIt is also a reasonable inference that government informant Ana Luz Dones-Arroyo and undercover police officer Efrain Hernández de León were killed in furtherance of the conspiracy -- to prevent their discovery of the group's weapons stash. The two were gunned down as Dones-Arroyo was leading the officer to the location of the stash.\n\nFernando Agosto-Villegas was killed on Soto-Ram¡rez's orders because two-eighths of a kilogram of cocaine and a machine gun belonging to Soto-Ram¡rez were missing. The murder furthered the conspiracy by sending the message that those suspected of stealing from the conspiracy would be treated harshly. Rodriguez, 162 F.3d at 143.\n\nHerberto Rivera-González was killed in retribution for the death of Cosme-Sobrado, who had been managing Soto-Ram¡rez's drug point for him while he was in prison. The defendants correctly note that the government never proved that Rivera-González was actually a member of a rival gang or participated in killing Cosme-Sobrado. But the government met its burden when it presented testimony that the conspirators believed, even if incorrectly, that Rivera-González was responsible and that they killed him for that reason. See, e.g., United States v. Mayes, 917 F.2d 457, 464 (10th Cir. 1990) (explaining that to be \"in furtherance\" of a conspiracy, an act must be intended to promote conspiratorial objectives but need not actually succeed in furthering the conspiracy).\n\nReynaldo Cancel-Robles was killed because he seized control of a drug point located outside Bitumul in the Vista Hermosa housing project that was supplied by Soto-Ben¡quez. His murder furthered the conspiracy by protecting its customer base and thus ensuring a stronger market for its narcotics.\n\nRobert Vasallo-Morninglane and the five victims of the Quintana Massacre were killed in retribution for the death of Angel Rivera-Pagán. Rivera-Pagán had died in a shootout in Bitumul with the rival Chacho gang, to which Vasallo-Morninglane and two of the five victims of the Quintana Massacre belonged. These murders furthered the conspiracy's goal of defending its territory and its members against rival drug-trafficking organizations.\n\nTito Dones-Sanchez was killed while riding in a van near the drug point at Callejón Nueve. Fernández-Malavé spotted the van and opened fire on it, believing that those inside were members of a rival gang who intended to threaten the drug point. Dones-Sanchez was murdered to protect the drug territory at Callejón Nueve, and thus to further the goals of the conspiracy.\n\nOscar Nazario-Rivera was killed because he was a member of the rival Chacho gang and had fired shots at Rodr¡guez-López in the past. His murder furthered the conspiracy by eliminating a possible threat to one of its major players, Rodr¡guez-López. Cf. United States v. Nesser, 939 F. Supp. 417, 421 (W.D. Pa. 1996) (\"Hiding information about the leader of a drug conspiracy [in order to protect him] is another way to further its purpose, by allowing it to continue.\").\n\nWe also reject defendants' argument that these murders furthered a separate conspiracy from the one in which they participated. As discussed above, the record supports the jury's finding that a single conspiracy existed and that the three defendants were part of it.\n\nBecause evidence of all fifteen murders was admissible to demonstrate the existence of a conspiracy, it was admissible against these three defendants. Defendants correctly note that the record establishes that Garc¡a-Garc¡a participated in only one murder, that Gonzalez-Ayala and de León Maysonet participated in no murders, and that most of the murders occurred before Gonzalez-Ayala joined the conspiracy and before de León Maysonet turned eighteen. But, as discussed earlier, the three defendants are liable for conspiracy. As a result, they are liable for acts in furtherance of the conspiracy, even if they did not participate in those acts and even if those acts occurred before they joined the conspiracy.\n\nc) Admission of Guilty Pleas (Fernández-Malavé, Gonzalez-Ayala, de León Maysonet)\n\nThe district court admitted into evidence Fernández-Malavé's guilty plea to the murder of Tito Dones-Sanchez over defense counsel's objection that the plea was not knowing and voluntary. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e According to Fernández-Malavé, his plea in Puerto Rico court was coerced because the local prosecutor had falsely represented to him that the earlier testimony of an unavailable witness could be used against him at trial. After hearing lengthy argument on this issue, the district court denied Fernández-Malavé's motion, concluding that Fernández-Malavé knowingly pled guilty in order to avoid facing first-degree murder charges.\n\nNormally, it is inappropriate for a federal court to review a collateral attack on a state court conviction without affording the state court a prior opportunity to do so. United States v. Bouthot, 878 F.2d 1506, 1511 (1st Cir. 1989). But when a defendant challenges the voluntariness of a state court guilty plea for purposes of an admissibility determination, the interests of comity and federalism that underlie the exhaustion doctrine are best served by addressing the merits of that claim. Id.; see United States v. Campusano, 947 F.2d 1, 4-5 (1st Cir. 1991). We thus review the district court's evidentiary ruling for abuse of discretion. United States v. Perrotta, 289 F.3d 155, 164 (1st Cir. 2002).\n\nThe district court had a more than sufficient basis upon which to deny Fernández-Malavé's motion to exclude his guilty plea. The court noted that \"counsel for the defendant described exactly what the plea was\" during the plea colloquy in state court and that Fernández-Malavé expressly told the court that he had discussed his options with his lawyer and was pleading guilty freely and voluntarily. Furthermore, the court concluded that the Puerto Rico prosecutor did not mislead Fernández-Malavé about the admissibility of the unavailable witness's prior testimony, but was instead simply advocating a plausible interpretation of the Puerto Rico evidence rules. Fernández-Malavé has not presented any reason to doubt these findings.\n\nDe León Maysonet and Gonzalez-Ayala also object to the district court's admission of their plea agreements regarding state crimes; de León Maysonet had pled guilty to possessing a controlled substance, while Gonzalez-Ayala had pled guilty to conspiring or attempting to violate the Puerto Rico controlled substances law. The argument of these defendants differs slightly from that of Fernández-Malavé: they claim that the plea agreements were not admissible because the government did not enter in evidence a transcript of their plea colloquies in Puerto Rico court. Gonzalez-Ayala also argues that his plea should not have been admitted because the crime to which he pled encompasses numerous types of criminal activity, making it impossible for the jury to determine the activities for which he was actually convicted. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nThe district court had a sufficient basis to reject these arguments as well. Even without the transcript of the plea colloquy, the pleas linked the defendants to the charged drug conspiracy: according to the arresting officer, both Gonzalez-Ayala and de León Maysonet possessed heroin and a firearm when they were arrested. Had the defendants produced specific evidence that the guilty pleas were coerced, the admissibility of the pleas might be questionable. But defendants cannot defeat the relevance of these guilty pleas by making unsupported allegations that they were not voluntary.\n\nFor similar reasons, we reject Gonzalez-Ayala's argument that his plea should not have been admitted because the statute to which he pled guilty applied to more than one factual scenario. The guilty plea corroborated the fact that Gonzalez-Ayala was found carrying drugs and a weapon, and that fact was relevant in establishing that he was part of the charged conspiracy.\n\nd) Admission of the Testimony of Cesário-Soto (Alicea-Torres)\n\nAlicea-Torres makes a separate argument that the government knowingly offered in evidence perjured testimony from witness Cesário-Soto. Cesário-Soto testified at trial that he had observed Alicea-Torres sell drugs at two different drug points. Alicea-Torres alleges that at an earlier interview conducted by his counsel and attended by the prosecuting attorney, Cesário-Soto stated only that Alicea-Torres was in the area. That discrepancy provides the basis for the defendant's misconduct claim.\n\nWe bypass the question whether the defendant properly preserved the objection and reject on the merits his claim that the prosecution knowingly used perjured testimony. First, the two statements by Cesário-Soto are not necessarily conflicting. At the interview, defense counsel did not pursue what was meant by the witness's statement that Alicea-Torres was \"in the area.\" Second, there was no prejudice. Defense counsel cross-examined Cesário-Soto as to the supposed conflict between his testimony and the statements he made during the interview. Moreover, Cesário-Soto was not the only witness to link Alicea-Torres to two different drug points: Negrón-Maldonado testified that Alicia-Torres sold drugs at Calejon Dos and Torrens-Alicea testified that Alicea-Torres conducted drug transactions with Rodr¡guez-López and spent time at Callejón Nueve. There is no reasonable likelihood that any false testimony could have affected the judgment of the jury. Cf. Kyles v. Whitley, 514 U.S. 419, 433 n.7 (1995) (\"[A] conviction obtained by the knowing use of perjured testimony is fundamentally unfair, and must be set aside if there is any reasonable likelihood that the false testimony could have affected the judgment of the jury.\").\n\ne) Motion to Suppress Exhibit 227, a Photograph, and Related Testimony (Fernández-Malavé)\n\nFernández-Malavé appeals the denial of his motion to suppress a photograph, later admitted as Exhibit 227, of items that appeared to be drugs and that were seized when he was arrested on April 9, 1993. He contends that the photograph was taken after Officers Rosa-Lopez and Victor-Rivera illegally entered and searched his apartment without a warrant.\n\nThe trial court conducted an evidentiary hearing on the suppression motion and held that the warrantless entry was justified by exigent circumstances. The court made the following factual determinations. Officer Rosa-Lopez was on routine patrol during the evening of April 9, 1993 when he saw a person carrying a nickel-plated gun in his hand. Before he could respond, the individual noticed Officer Rosa-Lopez (who was in uniform) and began to run in the opposite direction. Officer Rosa-Lopez pursued the suspect up a nearby stairway between two houses, but lost sight of him when he apparently jumped onto an adjacent patio. Meanwhile, Officer Victor-Rivera was patrolling the same area when he received notice on his police radio of the pursuit involving Officer Rosa-Lopez. While he was approaching the area to provide back-up, he observed an individual carrying a black gun. That individual, on spotting Officer Victor-Rivera (who was in uniform), immediately turned around and ran into a house behind him. Officer Victor-Rivera followed the person, later identified as Fernández-Malavé, into the house and pursued him up the stairway. Officer Rosa-Lopez, still searching for the first suspect outside, heard a window open. He turned toward the noise and saw someone drop a gun and a plastic bag containing drugs out of the window. When he looked through the window, he saw Fernández-Malavé inside. He then seized the drugs and the weapon. After a third officer told him that Officer Victor-Rivera was inside, Officer Rosa-Lopez went to the front of the house. Officer Rosa-Lopez explained to Officer Victor-Rivera that he had just observed Fernández-Malavé drop the seized drugs and weapon out of the back window, and Fernández-Malavé was placed under arrest.\n\nThis court reviews the district court's findings of fact for clear error and its ultimate Fourth Amendment conclusion de novo. Ornelas v. United States, 517 U.S. 690, 699 (1996). The district court's rendition of facts is not clearly erroneous. Fernández-Malavé unsuccessfully attempts to discredit the court's findings by noting that much of Officer Rosa-Lopez's testimony was not included in an earlier sworn statement of his. There are multiple explanations for why Officer Rosa-Lopez might not have reported certain details about his encounter with Fernández-Malavé in his sworn statement, including his belief at the time that those details were not important. The absence of those details does not establish clear error.\n\nThe district court's Fourth Amendment conclusion was correct. Once Fernández-Malavé abandoned the weapon and drugs by throwing them out of the window, he had no reasonable expectation of privacy in those items and their seizure did not itself violate his Fourth Amendment rights. It is well settled that if a defendant abandons property while he is being pursued by police officers, he forfeits any reasonable expectation of privacy he may have had in that property. See Abel v. United States, 362 U.S. 217, 241 (1960). Nevertheless, if Officer Victor-Rivera's pursuit of Fernández-Malavé into his house was unconstitutional, then the evidence of the drugs might well have been subject to suppression as the fruit of an illegal entry. Cf. California v. Hodari D., 499 U.S. 621, 629 (1991); United States v. Lewis, 40 F.3d 1325, 1334 (1st Cir. 1994).\n\nEven without a warrant, police officers are entitled to enter private residences when \"exigent circumstances\" necessitate such action. See Fletcher v. Town of Clinton, 196 F.3d 41, 49 (1st Cir. 1999). One consistently recognized example of exigent circumstances encompasses the \"hot pursuit\" of a suspect the police reasonably believe to be a felon. Minnesota v. Olson, 495 U.S. 91, 100 (1990); Hegarty v. Somerset County, 53 F.3d 1367, 1374 (1st Cir. 1995). In such cases, the police are permitted to pursue the fleeing felon into a private residence in order to effect an arrest. See United States v. Santana, 427 U.S. 38, 43 (1976).\n\nOfficer Victor-Rivera's pursuit of Fernández-Malavé falls squarely within the doctrinal confines of the hot pursuit exception, and thus did not violate the Fourth Amendment. We have previously held in a remarkably similar situation that an officer who is looking for a fleeing suspect and has a reasoned basis to think that he has found the suspect is justified in pursuing the suspect into a house. See United States v. Lopez, 989 F.2d 24, 27 (1st Cir. 1993) (holding that police were justified under the hot pursuit doctrine in following defendant into a house because he fit a general description of an armed assault suspect and ran from police when he was ordered to halt). That same conclusion holds here.\n\nFernández-Malavé also objects on hearsay grounds to the admission of Officer Rosa-Lopez's testimony about a subsequent field test that confirmed that the items in the picture were indeed drugs. The hearsay objection is that Officer Rosa-Lopez did not perform the field test himself, but instead only observed the test as it was conducted. The court correctly overruled this objection at trial. Officer Rosa-Lopez did not testify about an out-of-court statement, see Fed. R. Evid. 801(c), but about his personal observation of the results of the field test.\n\nf) Improper Admission of Rule 702 Expert Testimony AsLayTestimony Under Rule 701 (Cintrón-Caraballo)\n\nCintrón-Caraballo argues that the court should have excluded the testimony of eleven witnesses because they provided expert testimony but, he says, were not disclosed as experts under Rule 702. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e These witnesses included eight forensic examiners (Ruben Diaz-De Leon, Alfredo Roman-Rodriguez, Virginia Cortes, Luis Batista-Maldonado, Nelson Morales-Huerta, Luis Mercedes-Rodriguez, Francisco Ramos-Seda, and Cesar W. Ostolaza-Perez), two pathologists (Dr. Yocasta Brougal-Mena and Dr. Francisco Cortes), and a firearms examiner (Juan B. Maldonado). This was prejudicial, Cintrón-Caraballo argues, because the defendants would have been entitled to summaries of the witnesses' testimony if they had been designated as experts. See Fed. R. Crim. P. 16(a)(1)(G)(defendants are entitled to summaries of all expert testimony, which must include \"the witness's opinions, the bases and reasons for those opinions, and the witness's qualifications\").\n\nThe district court correctly determined that none of the eight forensic examiners provided expert testimony. Witnesses who testify only about their perceptions of an event, or about lay opinions arising out of those perceptions, see Fed R. Evid. 701, are not experts under Rule 702 regardless of any specialized training or experience they may possess. See United States v. Paiva, 892 F.2d 148, 157 (1st Cir. 1989) (\"[T]he individual experience and knowledge of a lay witness may establish his or her competence, without qualification as an expert, to express an opinion on a particular subject outside the realm of common knowledge.\"); see also United States v. Rivera-Santiago, 107 F.3d 960, 968 (1st Cir. 1997). That rule is dispositive here: the court permitted each of the witnesses to testify only about their observations at the various crime scenes they personally investigated. Indeed, the court consistently reminded both the witnesses and the lawyers that if any of these witnesses' testimony \"sound[ed] like a 702 [opinion] . . . [he would] not admit it.\" Although at points the district court faced difficult decisions about the side of the Rule 701 / Rule 702 divide on which a witness's opinion fell, there was no abuse of discretion in the court's resolution of these issues. See Kumho Tire Co. v. Carmichael, 526 U.S. 137, 152 (1999) (review of a district court's decision to admit or exclude expert testimony is for abuse of discretion).\n\nNor did the district court abuse its discretion in allowing the expert testimony of the two pathologists, Drs. Cortes and Brugel-Mena. The district court found, despite the government's failure to label the witnesses' testimony and reports as Rule 702 material in its pre-trial disclosure, that the government had effectively complied with the applicable disclosure requirements. In particular, the government had informed defendants before trial that both pathologists would be testifying about several autopsies and provided the defendants with copies of all of these autopsy reports. Although Dr. Cortes testified about one autopsy report that he did not personally prepare, the district court permitted this substitution because the pathologist who had prepared that report was unavailable to testify due to serious illness. There is no generalized prohibition on allowing experts to testify about autopsy reports that they did not personally prepare. See Manocchio v. Moran, 919 F.2d 770, 780 (1st Cir. 1990).\n\nThe government failed to formally designate the last witness, Juan Maldonado, as an \"expert\", but it did inform the defendants that Maldonado would be testifying about ballistics and provided the defense with all of Maldonado's notes on his testimony. And once again, the district court permitted Maldonado's testimony due to the lack of prejudice to the defense. Here, though, the court compensated the defendants for the government's failure to adhere to the technical requirements of Fed. R. Crim. P. 16 by certifying the witness only as a ballistics expert, and refusing to also certify him as a \"firearms expert.\" This decision was an appropriate sanction against the government and undercuts the defendant's prejudice argument.\n\ng) Rule 404(b) \"Bad Act\" Evidence (Cintrón-Caraballo)\n\nCintrón-Caraballo argues that the court erred in admitting evidence of his March 8, 1994 arrest by Puerto Rico police, and of the contemporaneous seizure of a gun that he was carrying. He argues that this evidence was impermissible bad act evidence under Fed. R. Evid. 404(b) because it was not relevant to demonstrating his participation in the conspiracy, which, according to the indictment, had ended one day earlier, on March 7. Cintrón-Caraballo also argues that the firearms evidence should have been excluded as unreliable because the firearm had been destroyed by Puerto Rico authorities.\n\nThese arguments are unavailing. Evidence of Cintrón-Caraballo's arrest was admissible under Rule 404(b) because the arrest was for activities evidencing his participation in the conspiracy charged in the indictment. The arrest took place on Street B, where the drug point that the government alleged Cintrón-Caraballo supervised was located. This evidence demonstrated an overt act in furtherance of the alleged conspiracy and Rule 404(b) explicitly provides that evidence of bad acts is admissible for purposes other than showing actions in conformity with those acts. See Fed. R. Evid. 404(b).\n\nThe fact that the indictment charged the conspiracy with ending \"on or about\" March 7 does not change this conclusion. The \"on or about\" language left the district court leeway to conclude that the arrest fit within this time frame, and thus that the arrest was evidence of an act directly in furtherance of the conspiracy. Cf. Portela, 167 F.3d at 704 (indictment charging defendant with possession of cocaine \"on or about\" March 1995 provided \"perfectly adequate\" notice to the defendant for acts charged in April 1995).\n\nWe also reject Cintrón-Caraballo's related objection that the photograph of the gun should have been excluded because there was no reliable evidence that it was the gun actually seized from him. The district court found that there were sufficient indicia of reliability that the photograph was what it purported to be because specific markings on the gun in the photograph matched the description in the police report. The arresting officer also testified that the photograph depicted the weapon seized from Cintrón-Caraballo. Under these circumstances, the photograph was properly authenticated. See Fed. R. Evid. 901(a).\n\nh) Admission of Evidence on Rebuttal (Soto-Ram¡rez)\n\nIn the government's case-in-chief, Negrón-Maldonado testified that Soto-Ram¡rez was involved in the murder of a government informant, Ana Luz Dones-Arroyo. Soto-Ram¡rez countered this testimony by suggesting that the government did not have sufficient evidence to indict him for Dones-Arroyo's murder because it had accepted his guilty plea to the charge of accessory after the fact. In rebuttal, the government called Juan Maldonado, who had previously testified as a ballistics expert, but whom the court had refused to further qualify as a firearms expert. Maldonado testified that the same weapon that was used to kill Robles-Rodr¡guez -- a murder to which Soto-Ram¡rez had pled guilty -- was also used in the murder of Dones-Arroyo.\n\nDefendant argues that Maldonado's testimony was not admissible as rebuttal evidence because Soto-Ram¡rez's argument that he only pled guilty to the accessory after the fact charge was not \"a sweeping denial\" of his involvement in the Dones-Arroyo murder. We review the admission of rebuttal evidence for abuse of discretion. See United States v. Leon-Delfis, 203 F.3d 103, 113 (1st Cir. 2000); Faigin v. Kelly, 184 F.3d 67, 85 (1st Cir. 1999).\n\nThe district court did not abuse its discretion in rejecting Soto-Ram¡rez's argument and admitting Maldonado's testimony as rebuttal evidence. \"Rebuttal evidence may be introduced to explain, repel, contradict or disprove an adversary's proof.\" United States v. Laboy, 909 F.2d 581, 588 (1st Cir. 1990). That is exactly what the government did here. The defense opened the door to Maldonado's testimony when it attempted to demonstrate that Soto-Ram¡rez was only an accessory after the fact because that claim implied that Soto-Ram¡rez was not guilty of the underlying murder.\n\nSoto-Ram¡rez also argues that Maldonado's testimony in rebuttal should have been excluded because it was expert firearms testimony that the district court had specifically excluded during the government's case-in-chief. The court rejected this argument, concluding that the defendants had sufficient notice that Maldonado would testify to this issue and thus that its previous holding limiting Maldonado's testimony to ballistics was not applicable. This conclusion was sound. The defendants were provided with a report before trial that Maldonado would testify that the same weapons were used in the Robles-Rodr¡guez and Dones-Arroyo murders.\n\n2. Brady and Giglio Claims (Soto-Ben¡quez, Soto-Ram¡rez, Alicea-Torres)\n\nDefendants contend that there were multiple Brady and Giglio violations. See Brady v. Maryland, 373 U.S. 83, 87 (1963); Giglio v. United States, 405 U.S. 150, 153-54 (1972). First, several defendants challenge the government's failure to reveal the apparent inconsistencies in Rodr¡guez-López's story when it first became aware of them in the summer of 1998. At that time, all the prosecution knew was that Rodr¡guez-López had lied to the FBI (not the grand jury) about being present at Rivera-González's murder. He had not testified to the grand jury about that murder. Although the prosecution must reveal material information that is favorable to the accused, the fact that Rodr¡guez-López may not have been present at the Rivera-González murder is not exculpatory evidence. Admittedly, the analysis might have been different if the government had ultimately called Rodr¡guez-López as a witness at trial: his earlier lies to the government would certainly have constituted a basis for impeaching him. See Giglio, 405 U.S. at 153-54; Moreno-Morales v. United States, 334 F.3d 140, 145 (1st Cir. 2003). But the government did not call Rodr¡guez-López. Furthermore, as the trial court noted, the defendants knew a month before trial that Rodr¡guez-López had lied, so they had sufficient time to interview him and have him testify if they so desired.\n\nSeveral defendants also argue that the government failed to fully disclose the extent of Negrón-Maldonado's plea and cooperation agreement with the government. After testifying on direct examination about ten murders, Negrón-Maldonado admitted during redirect examination that the government had promised him favorable treatment in his related state court proceedings in exchange for his testimony. Counsel for Soto-Ben¡quez and Soto-Ram¡rez immediately moved for a mistrial, telling the court that the prosecution had never disclosed its intervention in the Puerto Rico courts on behalf of the witness. (The prosecution had disclosed the existence of a plea arrangement between itself and Negrón-Maldonado). At side-bar, the government explained that while the Commonwealth of Puerto Rico had made certain oral assurances to the witness at the prosecution's behest, no agreement had been reduced to writing and thus there was no document that could have been produced to inform the defense of the agreement.\n\nThe government's obligation to disclose impeachment evidence is not, as suggested by the prosecution, dependent on whether that evidence has been reduced to written form. See Giglio, 405 U.S. 152, 154-55 (reversing conviction where an oral agreement between a prosecutor and key witness was not disclosed to the defense). Here, the government failed to disclose the full extent of its agreement with the witness until the defense uncovered the details of the arrangement during cross-examination.\n\nNonetheless, the defendants were not prejudiced by the government's delay in revealing this information and are not entitled to reversal on appeal. See United States v. Lemmerer, 277 F.3d 579, 588 (1st Cir. 2002) (a defendant must show that \"learning the information altered the subsequent defense strategy,\" and that given timely disclosure, \"a more effective strategy would likely have resulted\" (quoting United States v. Devin, 918 F.2d 280, 290 (1st Cir. 1990)); United States v. Ingraldi, 793 F.2d 408, 411-12 (1st Cir. 1986) (same). Negrón-Maldonado admitted the full extent of his arrangement with the government during cross-examination. Moreover, the defendants' strategy in cross-examining Negrón-Maldonado was surely not impacted by the government's delayed disclosure. Even without knowing about the federal prosecution's intervention in state court, the defense's cross-examination of Negrón-Maldonado was intended to suggest that the witness was fabricating his testimony in order to receive favorable treatment. There has been no showing that having a larger quantum of evidence than originally supposed would have altered the way in which the defense cross-examined the witness, and the court granted additional time to defense counsel to prepare and investigate the new information before cross-examination of the witness resumed. Again, we do not approve of the prosecution's conduct; we hold only that it does not provide a basis for reversal.\n\nSoto-Ben¡quez and Soto-Ram¡rez also allege that the prosecution failed to disclose that it had granted immunity to Janet Garcia-Diaz, the girlfriend of Torrens-Alicea, another cooperating witness. This argument is without merit. Garcia-Diaz was told that she would not be prosecuted after she specifically inquired of the government whether she needed a lawyer, on the same day that she was called as a defense witness by Vega-Colón to impeach Torrens-Alicea's testimony for the prosecution. There was a window of, at most, several hours between the government's statement to Garcia-Diaz and the defendants' discovery of this supposed grant of immunity. Even assuming that the defendants were entitled to this information under Giglio, they became aware of the so-called \"grant of immunity\" on the same day that it was extended. No prejudice has been shown.\n\nFinally, Soto-Ben¡quez and Soto-Ram¡rez suggest that the prosecution did not disclose the fact that cooperating witnesses were allowed to make unmonitored phone calls, visit with their spouses, and take pictures of themselves \"half-naked\" in government offices. Defendants, though, were informed by discovery letter about several visits by family members to cooperating witnesses. In any case, these benefits pale in comparison with the deals negotiated in the plea bargains. Defendants were well aware of the agreements with cooperating witnesses (absent that of Negron-Maldonado, discussed above) and used them well in cross-examination. There was no prejudice to the defendants.\n\n3. Closing Arguments (de León Maysonet, Gonzalez-Ayala, Garc¡a-Garc¡a)\n\nSeveral defendants urge that the prosecution's closing argument led to reversible error.\n\nIn its rebuttal in closing the prosecutor argued: And one point that I want to make clear as to Ramon Fernandez Malave, as to Carmelo Vega Pacheco, as to Rene Gonzalez Ayala, as to Jose Luis de Leon Maisonet and anyone else who argues here before you that they are here before you pleading not guilty, pleading their innocence. Well, let me tell you something, ladies and gentlemen of the jury, a plea of not guilty is not, not a declaration of innocence. A plea of not guilty simply means, government, prove your case. But a plea of not guilty is not a declaration of innocence.\n\n(emphasis added). Defense counsel objected:\n\nWe would like to interpose an objection, hinges on the constitution right to the presumption of innocence.\n\nThe court replied, in the presence of the jury:\n\nThere is a presumption of innocence going on. Fine.\n\n(emphasis added). The prosecutor echoed that:\n\nThere is a presumption of innocence. They are to be presumed innocent, that is not what I'm arguing against, Your Honor. And I understand the jurisprudence from the First Circuit supports my argument.\n\nThe court then said:\n\nKeep on going.\n\nLater, the prosecution made a similar statement:\n\nCarmelo Vega Pacheco again comes before you and says my client is pleading not guilty. Again, a plea of not guilty is not a declaration of innocence. It simply puts the government to its proof. And he argues, yes, he participated in [the] Quintana massacre but that was in furtherance of a different conspiracy.\n\n(emphasis added). The defense again objected to this later statement, but not on the ground asserted on appeal -- namely, that the prosecutor's comments undercut the presumption of innocence.\n\nBecause a contemporaneous objection was made by defense counsel to the earlier statement, we review de novo the question of whether the argument was improper and review for abuse of discretion the court's ruling on whether the misconduct, if any, warrants a new trial. United States v. Hernandez, 218 F.3d 58, 68 (1st Cir. 2000). We conclude that error occurred but that it does not warrant a new trial.\n\nOn appeal, the prosecution argues that these statements were an accurate description of the law. It also contends that its comments were invited by the improper argument of several defendants that their pleas of not guilty in this case were reliable indications of their innocence because if they were guilty they would have admitted it in this case, as they did in the state court.\n\nThe prosecution is wrong on both points. First, the prosecutor's comments did undermine the presumption of innocence. By saying that a plea of not guilty is \"not a declaration of innocence\" but simply means \"government, prove your case,\" the prosecutor undercut the axiomatic principle that a defendant is presumed innocent until proven guilty and need not declare or prove that he is innocent. Regardless of the complex relationship between the presumption of innocence and the prosecution's duty to convince the jury beyond a reasonable doubt, see, e.g., Taylor v. Kentucky, 436 U.S. 478, 483-85 (1978) (noting the scholarly debate concerning whether the presumption of innocence is analytically distinct from the requirement that the government prove guilt beyond a reasonable doubt); McCormick on Evidence § 346 (5th ed. 1999) (suggesting that the presumption of innocence is \"a convenient introduction to the statement of the burdens upon the prosecution\"), due process requires that both of these principles guide the jury in reaching its verdict. Taylor, 436 U.S. at 483-86; Coffin v. United States, 156 U.S. 432, 453, 461 (1895). To undercut one, even if the other remains standing, is improper. It is for precisely this reason that a district court's failure to instruct the jury on the presumption of innocence may violate due process even when the jury has been properly informed of the prosecution's burden of proving guilt beyond a reasonable doubt. Taylor, 436 U.S. at 488-89.\n\nThe prosecution's contention that the statements were a justified response to the argument of defense counsel is also incorrect. Although it is true that, in certain circumstances, a prosecutor's otherwise impermissible statements during closing argument may be allowable because they were \"invited\" by defense counsel, United States v. Henderson, 320 F.3d 92, 107 (1st Cir. 2003), this was clearly not such a case. Defense counsel's argument that the defendants' pleas of not guilty in federal court were particularly trustworthy because the defendants had formerly pled guilty in state court was not improper and did not justify the prosecutor's response.\n\nNot every prosecutorial error in making closing argument justifies a new trial, even when that error undermines constitutional rights. No reversible error occurs when the reviewing court determines beyond a reasonable doubt that the constitutional error was harmless. Wihbey, 75 F.3d at 772 n.6; see also United States v. Hasting, 461 U.S. 499, 510-11 (1983). As the Supreme Court has clarified, the relevant question \"is not what effect the constitutional error might generally be expected to have upon a reasonable jury, but rather what effect it had upon the guilty verdict in the case at hand.\" Sullivan v. Louisiana, 508 U.S. 275, 279 (1993); see United States v. Rivera-Santiago, 107 F.3d 960, 967 (1st Cir. 1997).\n\nWe conclude beyond a reasonable doubt that the prosecutor's improper closing argument did not prejudice the defendants in this case. The court gave curative instructions that established the presumption of innocence immediately after the prosecutor's first improper statement (the only time the defense made the appropriate objection). It then reinforced the presumption in its general instructions to the jury, noting that it \"is a cardinal principle of our system that every person accused of a crime is presumed to be innocent unless and until his/her guilt is established beyond a reasonable doubt.\" Given those instructions and the strong evidence of guilt, we conclude beyond a reasonable doubt that the statements did not affect the ultimate outcome of the case, especially when they occupied only several seconds in a six-month long trial.\n\n4. Cumulative Effect of Errors (Soto-Ben¡quez, Soto-Ram¡rez)\n\nA series of errors, each one of which is individually \"harmless,\" may have a cumulative effect that requires a new trial. United States v. Sepulveda, 15 F.3d 1161, 1195-96 (1st Cir. 1993).\n\nDefendants rely on this proposition, arguing that, considered as a whole, the prosecution's missteps warrant a new trial. To this point, we have concluded that the prosecution erred in repeatedly failing to meet discovery deadlines, in neglecting to disclose the extent of its plea arrangement with Negrón-Maldonado, and in making inappropriate remarks during closing arguments. This conduct is blameworthy and the government should take steps to see that it does not recur.\n\nStill, the government's bad behavior does not require that the jury's verdict of guilt be set aside. At a minimum, to overturn a verdict, the prosecution's bad behavior must have prejudiced the defendants. See, e.g., United States v. Joyner, 191 F.3d 47, 53 (1st Cir. 1999) (in evaluating allegations of prosecutorial misconduct, \"the unavoidable bottom line\" is \"whether we deem it likely, or not, that any prejudice affected the outcome of the case\"). Although the frustrations of defense counsel are understandable, that test is not met here.\n\nThe defense was not demonstrably prejudiced by any of the government's violations, and sometimes even gained an advantage from them. The defendants ultimately received the necessary discovery and were provided with compensation such as additional discovery and the exclusion of otherwise admissible evidence. When the defendants learned of the federal prosecution's intervention in state court on behalf of Negrón-Maldonado, the court offered them additional time to cross-examine the witness. And while the court's curative instruction during the prosecutor's closing arguments was concise, it was sufficient in the context of the overall instructions to assure that the jury was properly appraised of the import of the presumption of innocence. The totality of errors argument is unsuccessful.\n\nD. Post-Trial\n\n1. Sufficiency of Evidence as to CCE Count (Soto-Ben¡quez, Soto-Ram¡rez)\n\nSoto-Ben¡quez and Soto-Ram¡rez argue that there is insufficient evidence to support their convictions. They offer no further explanation, except to cite to their filings before the district court. Their argument as to sufficiency of evidence has been waived. See Grella, 42 F.3d at 36. \"If counsel desires our consideration of a particular argument, the argument must appear within the four corners of the brief filed in this court.\" Executive Leasing Corp. v. Banco Popular de P.R., 48 F.3d 66, 67-68 (1st Cir. 1995). Attorneys cannot circumvent this requirement by referencing their district court filings. Id. at 68.\n\n2. Sufficiency of Evidence as to Conspiracy Count (Cintrón-Caraballo, Vega-Cosme, Vega-Colón)\n\nVega-Cosme and Vega-Colón argue that the evidence is insufficient to tie them to the charged conspiracy. We reject this claim.\n\nThe government presented overwhelming evidence of Vega-Cosme's participation in the conspiracy. Government witnesses testified that Vega-Cosme had a series of agreements with other members of the conspiracy to maximize drug revenue. He negotiated with the Chacho gang on behalf of the drug points to end the warfare that was interfering with drug sales, met with Negrón-Maldonado to coordinate the colors of crack capsule caps to avoid competition between the points, and arranged the opening of his own drug point on Laguna Street with Soto-Ram¡rez. Although Vega-Cosme correctly notes that there is no evidence that Soto-Ram¡rez acted as his supplier, the government did present testimony that Vega-Cosme supplied narcotics to Soto-Ram¡rez, along with ammunition used in shootings of rival gang members in 1992 and 1993.\n\nThe record also shows sufficient evidence of the participation of Vega-Cosme's son, Miguel Vega-Colón. Vega-Colón packaged crack cocaine, heroin, and marijuana for his father's point. He also stood armed guard at the Callejón Nueve drug point, which was owned by Rodr¡guez-López. Both of those activities were in furtherance of the conspiracy. Moreover, based on Vega-Colón's presence at meetings between Vega-Cosme and Soto-Ram¡rez, a reasonable jury could have concluded that he joined the conspiracy knowingly and voluntarily.\n\nVega-Cosme and Vega-Colón also argue that their convictions are based on unreliable testimony from co-conspirators who \"had clear incentives to testify untruthfully.\" In assessing the sufficiency of evidence, credibility determinations must be resolved in favor of the verdict. United States v. Guerra-Garcia, 336 F.3d 19, 22 (1st Cir. 2003). Credibility judgments are the province of the jury, not of this court.\n\nCintrón-Caraballo also makes an insufficiency of evidence argument. He argues that the district court erred in admitting certain expert testimony and Rule 404(b) \"bad act\" evidence, and contends that without this evidence, the only evidence tying him to the conspiracy is the uncorroborated testimony of co-conspirators. This argument fails. The contested evidence was properly admitted. See Part III.B(f)-(g). Moreover, even if Cintrón-Caraballo's conviction rested only on co-conspirator testimony, the jury was entitled to credit such testimony and convict him on that basis. See United States v. Torres-Galindo, 206 F.3d 136, 140 (1st Cir. 2000).\n\n3. Special Verdict and Jury Instructions for CCE Count (Soto-Ben¡quez, Soto-Ram¡rez)\n\nSoto-Ben¡quez and Soto-Ram¡rez claim that the district court committed reversible error when it failed to instruct the jury to determine the quantity and type of drugs. First, they argue that the drug amount is an element of the CCE offense and that the jury was not otherwise instructed to find a minimum drug amount. Second, they argue that Apprendi v. New Jersey, 530 U.S. 466 (2000), requires that the drug amount be proven to the jury beyond a reasonable doubt. The standard of review for alleged jury instruction errors involving the interpretation of the elements of a statutory offense is de novo. United States v. Shea, 150 F.3d 44, 49-50 (1st Cir. 1998).\n\nWe reject both arguments. As to the claim that the drug amount is an element of the CCE offense, the CCE statute plainly does not require a minimum drug amount for a conviction.\n\nAs to Soto-Ram¡rez and Soto-Ben¡quez's Apprendi argument, Apprendi requires that \"[o]ther than the fact of a prior conviction, any fact that increases the penalty for a crime beyond the prescribed statutory maximum must be submitted to a jury, and proved beyond a reasonable doubt.\" 530 U.S. at 490. Here, absent a finding of drug quantity, the statutory maximum for CCE is already life imprisonment: the statute authorizes a sentence of twenty years to life imprisonment regardless of drug amount. 21 U.S.C. § 848(a)-(c). A drug amount above a certain level can result in a mandatory life sentence, § 848(b), but does not change the statutory maximum. Hence, no Apprendi violation has occurred with regard to the CCE convictions. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\n4. Special Verdict for Conspiracy Count (Alicea-Torres, Fernández-Malavé)\n\nAlicea-Torres and Fernández-Malavé argue that the trial court erred in not providing the jury with a special verdict form requiring it to determine the quantity and type of drugs as to each defendant. They argue that a special verdict form was necessary to ensure that the jury was unanimous as to drug type and quantity. This argument is based on Apprendi and is discussed later.\n\nE. Sentencing\n\n1. Apprendi and Related Issues\n\na) Apprendi Error (Alicea-Torres, Fernández-Malavé, Vega-Pacheco, Vega- Cosme, Vega-Colón)\n\nFive of the non-CCE defendants -- Alicea-Torres, Fernández-Malavé, Vega-Pacheco, Vega-Cosme, and Vega-Colón -- assert that their sentences violated the rule of Apprendi. They argue that the amount of drugs distributed by the conspiracy was not proven beyond a reasonable doubt to a jury, that the drug amount raised the statutory maximum, and that their sentences must be vacated as a result. We conclude that Apprendi error did occur, but that the error was harmless.\n\nThe jury instructions in this case did not make direct reference to drug amount or quantity. Instead, the jury was instructed that, to find the defendants guilty of the conspiracy count, it had to find that the government proved the conspiracy charged in the indictment beyond a reasonable doubt. The jury was provided with a copy of the indictment, which charged the defendants with knowingly and intentionally distributing more than five kilograms of heroin, more than five kilograms of cocaine, more than five kilograms of crack cocaine, and more than 100 kilograms of marijuana. However, the jury was also instructed that the actual amount of drugs need not be proven, and that the government need only prove that defendants distributed or possessed with intent to distribute a \"measurable amount\" of drugs.\n\nThe latter part of these instructions resulted in Apprendi error. This case presents an even stronger case of Apprendi error than United States v. Nelson-Rodriguez, 319 F.3d 12 (1st Cir. 2003). In that case, as here, the jury was given a copy of the indictment and instructed that to find the defendants guilty on the conspiracy count, it had to find them guilty of the conspiracy in the indictment. Id. at 45. The indictment in Nelson-Rodriguez, as here, specified drug types and quantities sufficient to support the defendants' sentences. Id. We concluded that this instruction was insufficient to elicit a jury determination of the threshold drug amount and quantity. Id. The same analysis applies here with greater force because the jury was specifically instructed that it need only find a \"measurable amount\" of drugs.\n\nAll five defendants who raise the Apprendi issue were sentenced above the default statutory maximum. Absent a jury determination of drug amount or type, the default statutory maximum is based on the distribution of unspecified amounts of marijuana, which results in a maximum sentence of five years for first-time felony drug convictions and ten years if a prior such conviction exists. 21 U.S.C. §§ 841(b)(1)(D), 846. Alicea-Torres, Fernández-Malavé, Vega-Pacheco, and Vega-Cosme were sentenced to life imprisonment, and Vega-Colón was sentenced to 292 months, or about twenty-five years, of imprisonment.\n\nThe existence of an Apprendi error, however, does not end the inquiry. If the defendants failed to preserve their Apprendi objection below, their sentences are vacated only if we find plain error. United States v. Cotton, 535 U.S. 625, 631 (2002). If they did preserve their objection, their sentences are vacated only if we find that the error was not harmless beyond a reasonable doubt. Nelson-Rodriguez, 319 F.3d at 49.\n\nFernández-Malavé preserved his Apprendi objection, and we assume without deciding that the remaining defendants did the same, as it makes no difference to the outcome. Defendants' trial took place from December 1998 to June 1999, before Apprendi was decided. At the time, several defendants requested a special verdict form requiring the jury to determine the drug amount and type as to each defendant. But only Fernández-Malavé, who was the sole non-CCE defendant sentenced after Apprendi was decided, challenged his sentence before the district court on this basis. The question whether the remaining defendants' special verdict request was sufficient to preserve an Apprendi objection, absent a separate objection at sentencing, is a complex one. Nelson-Rodriguez, 319 F.3d at 48. Here, as in Nelson-Rodriguez, we prefer to assume without deciding that the objection was preserved and the harmless error standard applies. Id.\n\nThe Apprendi error in this case was harmless beyond a reasonable doubt. An Apprendi error is harmless where the evidence overwhelmingly establishes the minimum drug quantity needed to justify the statutory maximum under which the defendants were sentenced. Martinez-Medina, 279 F.3d at 121-22. Here, the government produced overwhelming evidence that the conspiracy involved at least five kilograms of cocaine, which triggers a maximum sentence of life imprisonment for all co-conspirators under 21 U.S.C. § 841(b)(1)(A) and § 846. Government witnesses Negrón-Maldonado and Torrens-Alicea both testified that Rodr¡guez-López and Gonzalez-Ayala stole a 200 kilogram shipment of cocaine in Fajardo, which was then brought back to Bitumul for distribution. Negrón-Maldonado further testified that in 1991 he purchased a kilogram of cocaine per week from Soto-Ram¡rez. After May 1992, Negrón-Maldonado stated, he and another co-conspirator named Manol¡n, who managed Soto-Ram¡rez's point while Soto-Ram¡rez was in prison, each purchased one kilogram of cocaine per week from Soto-Ben¡quez to be sold at their respective drug points. Negrón-Maldonado also testified that after January 1993, he continued to purchase from Soto-Ben¡quez three-eighths of a kilogram of cocaine each week for his drug point.\n\nIn addition, the government presented overwhelming evidence that the conspiracy distributed more than the 50 grams of crack cocaine necessary to trigger a life sentence under 21 U.S.C. § 841(b)(1)(A). According to Negrón-Maldonado, 125 grams of crack cocaine would yield approximately 800 to 850 crack capsules using the conspiracy's packaging techniques. Negrón-Maldonado testified that Cintrón-Caraballo received 600 capsules of crack cocaine (90 grams) per week for distribution at his drug point in 1990, 800 to 850 capsules (125 grams) per week in 1991, and 1000 capsules (150 grams) per week in early 1993. Furthermore, Negrón-Maldonado testified that at the beginning of 1992, he would \"cook\" 500 grams to a kilogram of cocaine into crack cocaine two to three times per week for Soto-Ram¡rez's points; this alone amounts to one to three kilograms per week. At around the same time, Negrón-Maldonado himself was also selling 500 to 800 crack capsules, or between 75 to 125 grams of crack, per week. When he left for the United States, he sold an additional 2000 crack capsules, or over 300 grams of crack. All told, Negrón-Maldonado estimated that a single drug point would distribute at least one kilogram of crack cocaine per month --more than twenty times the amount necessary to trigger a life sentence.\n\nIn the face of this overwhelming evidence, defendants argue that the testimony of co-conspirators alone is never a sufficient basis to find an Apprendi error harmless beyond a reasonable doubt. That is not so. See United States v. Stewart, 306 F.3d 295, 324-25 (6th Cir. 2002) (finding Apprendi error harmless beyond a reasonable doubt based on the testimony of co-conspirators). Defendants offered no evidence contradicting the conspiracy-wide drug quantities at trial, and they point to no such evidence on appeal, except their attack on the general credibility of the two witnesses.\n\nThe jury in this case could not have convicted all eleven defendants of participation in the conspiracy without believing the testimony of Negrón-Maldonado and Torrens-Alicea regarding at least some of the transactions. Negrón-Maldonado and Torrens-Alicea also testified regarding the quantity of drugs involved in those transactions. Defendants offer no explanation for why the jury would believe Negrón-Maldonado and Torrens-Alicea's account of each defendant's activities in furtherance of the conspiracy, but discredit their testimony regarding the quantity or type of drugs involved in those activities. In Nelson-Rodriguez, we found an Apprendi error harmless on very similar facts: the jury could not have convicted without crediting informant testimony, the same informant testified to the drug amount, and the defendant offered no reason to disbelieve the testimony except a general attack on the witness's credibility. 319 F.3d at 49-50.\n\nDefendants further protest that even if the conspiracy writ large involved the requisite quantities and types of drugs, the Apprendi error is not harmless. They argue that it was not reasonably foreseeable to each of them individually, from their limited involvement, that such quantities of drugs would be involved. Under the Sentencing Guidelines, a narcotics conspirator's sentence is based on the amount of drugs he actually handled, negotiated, or saw, as well as the amount of drugs that he reasonably could have foreseen to be embraced by the conspiracy he joined. Rodriguez, 162 F.3d at 149; U.S.S.G. § 1B1.3 \u0026 cmt. 2. Defendants argue that unless this court is certain that the jury would find the drug quantity reasonably foreseeable to each defendant, the Apprendi error cannot be harmless.\n\nWe reject this argument. Apprendi does not require that the jury determine beyond a reasonable doubt the quantity of drugs foreseeable to each defendant. Apprendi requires only that juries determine facts necessary to increase the statutory maximum. 530 U.S. at 490. Here, the conspiracy-wide drug quantity determines the statutory maximum. See 21 U.S.C. § 846 (holding each conspirator responsible for the quantity of drugs distributed by the conspiracy). As long as the sentence falls within this statutory maximum, the district court may determine the quantity of drugs reasonably foreseeable to each defendant by a preponderance of the evidence and sentence each defendant accordingly. Derman v. United States, 298 F.3d 34, 42-43 (1st Cir. 2002). In determining whether an Apprendi error is harmless, the determinative question is whether the evidence overwhelmingly establishes the amount of drugs distributed by the conspiracy as a whole. It does here.\n\nb) Multi-Object Conspiracy (Vega-Cosme)\n\nVega-Cosme raises a related argument that the defendants were charged with a multi-object conspiracy. In a multi-object conspiracy charge, a jury convicts the defendants of distributing one type of drug or another type of drug. See, e.g., United States v. Dale, 178 F.3d 429, 431 (6th Cir. 1999) (jury instructed to convict if conspiracy distributed crack cocaine or marijuana). Although the First Circuit has not ruled on this issue, other circuits have held that when a defendant is charged with a multi-object conspiracy, and the jury returns a general verdict, the statutory maximum should be based on the object carrying the lowest maximum penalty. See, e.g., id. at 432; United States v. Orozco-Prada, 732 F.2d 1076, 1083-84 (2d Cir. 1984). Vega-Cosme argues that the jury in this case returned a general verdict on a multi-object conspiracy charge -- namely, that the defendants distributed more than five kilograms of heroin, cocaine, or cocaine base, or more than 100 kilograms of marijuana. He argues that the statutory maximum should therefore have been based on the penalty for conspiring to distribute 100 kilograms of marijuana, which is up to forty years imprisonment under 21 U.S.C. § 841(b)(1)(B). If this were indeed the case, Vega-Cosme's life sentence would be problematic.\n\nVega-Cosme's argument, though, is without merit. The defendants were not charged with a multi-object conspiracy. The indictment charged them with distributing more than five kilograms each of heroin, cocaine, and crack cocaine, and more than 100 kilograms of marijuana. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Because those drug quantities and types were joined by the conjunctive term \"and\" rather than the disjunctive term \"or,\" there was no ambiguity about the crime charged. See United States v. Neuhausser, 241 F.3d 460, 469-70 (6th Cir. 2001) (no Apprendi error in sentencing defendant to higher statutory maximum for cocaine conspiracy, when defendant was charged with conspiracy to distribute both cocaine and marijuana); United States v. Banks, 78 F.3d 1190, 1203 (7th Cir. 1996) (no ambiguity where indictment was phrased in conjunctive rather than disjunctive); United States v. Watts, 950 F.2d 508, 515 (8th Cir. 1991) (same).\n\nVega-Cosme argues that, regardless of the indictment, the jury instructions transformed Count Two into a multi-object conspiracy charge. The jury instructions contain a definition of \"possession with intent to distribute\" that required the government to \"prove beyond a reasonable doubt that the defendant knew he was possessing a controlled substance\" but not that \"the defendant knew which particular controlled substance was involved.\" Vega-Cosme contends that this instruction changed the conjunctive term \"and\" in the indictment into the disjunctive term \"or.\" This argument is meritless. First, this definition should not have affected the jury's consideration of the conspiracy charge. The conspiracy count of the indictment and the jury instructions regarding the elements of conspiracy require the jury to find that defendants conspired to \"distribute\" controlled substances to return a guilty verdict; nowhere does the term \"possession with intent to distribute\" appear. Second, even if the term had appeared, the definition requires the government to prove that the defendants did in fact possess specific drugs, even if they did not know which drugs they possessed. Thus, the government must still show that the defendant possessed cocaine and cocaine base and heroin and marijuana, even if the defendant himself did not know the specific drugs that he had in his possession. Finally, even if a multi-object conspiracy were charged and an Apprendi error therefore occurred, Vega-Cosme admits that review would be for plain error because he did not preserve this argument below. We have already determined that any Apprendi error as to drug amount or type would be harmless; a fortiori, no plain error occurred.\n\nc) Failure to Reference § 841(b)(1)(B) in Indictment (Fernández-Malavé)\n\nFernández-Malavé argues that his sentence must be vacated because the indictment was defective under Apprendi for failing to reference specifically § 841(b)(1)(B), the statutory penalty subsection under which he was sentenced. This claim is meritless. The indictment included threshold drug quantities and types. There is no Apprendi requirement that the penalty subsection be included in the indictment once the drug quantity and type are alleged. See United States v. Eirby, 262 F.3d 31, 38 (1st Cir. 2001).\n\n2. Sufficiency of Evidence As to Drug Quantities (Soto-Ram¡rez, Soto-Ben¡quez, Cintrón-Caraballo, Vega-Colón, Vega- Cosme)\n\nFive defendants argue, separate from their Apprendi claims, that the district court erred in determining the amount of drugs attributable to them. They argue that the evidence does not establish by a preponderance the quantity or type of drugs necessary to support the calculation of their base offense levels. We review factual determinations at sentencing for clear error. United States v. Damon, 127 F.3d 139, 141 (1st Cir. 1997).\n\nThe district court's determinations of drug amounts were not clearly erroneous. Under the Sentencing Guidelines, each defendant must be sentenced based on the amount of drugs that he handled, negotiated, saw, or could reasonably have foreseen to be embraced by the conspiracy. Rodriguez, 162 F.3d at 149; U.S.S.G. § 1B1.3 \u0026 cmt. 2. Applying this standard, the district court attributed at least 1.5 kilograms of crack cocaine to each of the five defendants, resulting in a base offense level of 38 for each.\n\nThe record at trial and sentencing supports this calculation. Negrón-Maldonado testified that Soto-Ram¡rez sold 300 crack capsules to Cintrón-Caraballo on at least ten occasions in 1990, which amounts to 450 grams of crack cocaine. He also testified that at the beginning of 1990, Soto-Ram¡rez supplied him with 1000 to 1500 crack capsules, or about 150 to 200 grams, per week. Assuming that these purchases continued for at least seven weeks, Soto-Ram¡rez would have distributed 1.5 kilograms of crack cocaine just from sales to Cintrón-Caraballo and Negrón-Maldonado in 1990. Furthermore, according to Negrón-Maldonado's testimony, during early 1992, Negrón-Maldonado \"cooked\" one to three kilograms of cocaine into crack cocaine per week for Soto-Ram¡rez's points. In one and a half weeks, Negrón-Maldonado would have packaged at least 1.5 kilograms of crack cocaine for distribution at Soto-Ram¡rez's points. Although Soto-Ram¡rez was in prison at this time, the drug quantity was reasonably foreseeable to him because he was still supervising his drug points by telephone.\n\nThe government presented evidence that Soto-Ben¡quez supplied other members of the conspiracy with cocaine, which they converted into at least 1.5 kilograms of crack cocaine and distributed at their respective drug points. Negrón-Maldonado testified that each week in early 1992, he bought one to three kilograms of cocaine from Soto-Ben¡quez and converted it into crack cocaine. Over two weeks, this would exceed the required 1.5 kilograms. Negrón-Maldonado also testified that Soto-Ben¡quez supplied Cintrón-Caraballo with 125 grams of cocaine per week and Negrón-Maldonado with 75 to 125 grams of cocaine per week, which was converted into crack cocaine for sale at their respective drug points. Over eight weeks, this would exceed the required 1.5 kilograms. Soto-Ben¡quez protests that he could not have reasonably foreseen that the cocaine he supplied would be converted into crack cocaine. The district court had sufficient evidence to conclude otherwise. Negrón-Maldonado testified that Soto-Ben¡quez's house was used, repeatedly, as a location for converting cocaine into crack cocaine. He also testified that when Cosme-Sobrado was killed, Soto-Ben¡quez picked up the proceeds from Soto-Ram¡rez's crack cocaine point and determined that money was missing. Bitumul is a small community; given Soto-Ben¡quez's involvement, it would be difficult for him to be wholly ignorant that his co-conspirators were producing crack cocaine. These activities and Soto-Ben¡quez's leadership role in the conspiracy are sufficient to support the conclusion that Soto-Ben¡quez knew Negrón-Maldonado and Cintrón-Caraballo sold crack cocaine at their points and that he could have reasonably foreseen that the cocaine he supplied to them would be converted into crack cocaine.\n\nCintrón-Caraballo's crack cocaine point was in operation throughout the duration of the conspiracy, according to Negrón-Maldonado's testimony. Negrón-Maldonado testified that Cintrón-Caraballo purchased over 90 grams of crack cocaine per week for distribution at his point in 1990, 125 grams per week in 1991, 125 grams on a regular basis in 1992, and over 150 grams per week in early 1993. Assuming that Cintrón-Caraballo's drug point operated at least four weeks each year, the total amount of crack cocaine purchased for distribution would exceed 1.5 kilograms.\n\nNegrón-Maldonado testified that the drug point operated by Vega-Cosme and Vega-Colón sold crack cocaine in 1990, 1992, and 1993. Negrón-Maldonado estimated that one drug point distributing crack cocaine would usually sell at least one kilogram per month. That volume of sales alone is sufficient to exceed the required 1.5 kilograms. In addition, the government presented evidence indicating that the quantity of crack cocaine sold by Negrón-Maldonado and Cintrón-Caraballo was reasonably foreseeable to Vega-Cosme. Vega-Cosme met at least three times with the others to coordinate the color of the caps on their respective crack capsules. These meetings are evidence that Vega-Cosme had some awareness of his co-conspirators' crack cocaine sales and that, after color-coding was instituted, he had some way of tracking their activities.\n\nIn response, all five defendants argue that this evidence is unreliable because it is based on the testimony of cooperating co-conspirators and was uncorroborated. Vega-Colón and Vega-Cosme argue in their brief that absent a rule requiring corroboration of such evidence, \"unsuspecting defendants would be entirely at the mercy of cooperating co-defendants, who have all the incentive in the world to testify in a manner [whether truthful or not] that will assist the government in obtaining a larger sentence.\" That risk is real, but vacating their sentences for lack of corroboration is not the answer. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Here, the cooperating co-defendants were vigorously cross-examined, and defense counsel had the opportunity to present evidence of the witnesses's plea agreements, grants of immunity, and receipt of government money. If the government's dilatory production of discovery materials had impeded the cross-examination, the situation might be different. But it did not. The jury found the co-conspirators credible, and, for sentencing purposes, so did the trial court. These plausible credibility determinations cannot be disturbed on appeal. Cf. Torres-Galindo, 206 F.3d at 139-40 (\"Uncorroborated testimony of a cooperating accomplice may sustain a conviction so long as that testimony is not facially incredible . . . .\").\n\n3. Alleged Rule 32 Violation (Cintrón-Caraballo, Vega-Cosme)\n\nCintrón-Caraballo argues that the district court erred (1) in permitting the government to introduce evidence in support of an upward adjustment for his role as a supervisor in the conspiracy under U.S.S.G. § 3B1.1 and (2) in granting the adjustment. Although the probation officer did not include the upward adjustment for a supervisory role in the PSR and the government did not object to this omission before sentencing, the government attempted to argue the upward adjustment to the court at the sentencing hearing. We agree with Cintrón-Caraballo that this course of action violated Fed. R. Crim. P. 32, which requires that \"[w]ithin 14 days after receiving the presentence report, the parties shall communicate in writing to the probation officer, and to each other, any objections\" to it. Fed. R. Crim. P. 32(b)(6)(B) (2000) (amended 2002).\n\nAny possible prejudice to Cintrón-Caraballo from the government's non-compliance was cured by the district court's grant of a two-week continuance to give defense counsel an adequate opportunity to respond to the government's late submission. See United States v. Young, 140 F.3d 453, 457 (2d Cir. 1998) (\"The sentencing court may impose sentencing enhancements belatedly suggested by the Government and not contained in the PSR, provided the defendant is afforded an adequate opportunity to respond . . . .\" (internal citation omitted)).\n\nVega-Cosme raises a similar argument that the district court erred in granting a two-level upward adjustment for possession of a weapon. Here again, the adjustment was not included in the PSR, and the prosecution did not object to its omission before sentencing but argued for the enhancement at sentencing, which was in violation of Rule 32. Because Vega-Cosme did not object at sentencing, review is for plain error. United States v. Frisby, 258 F.3d 46, 47-48 (1st Cir. 2001). There was none. Vega-Cosme had the opportunity to respond to the evidence at the sentencing hearing. Contrast United States v. Curran, 926 F.2d 59, 62 (1st Cir. 1991), in which the court vacated a defendant's sentence when he had no opportunity to contradict letters that were not included in the PSR and that the court relied upon in reaching its decision. Given the trial testimony regarding Vega-Cosme's role in obtaining ammunition for the conspiracy and the extensive murder evidence presented at trial, the government's belated seeking of a firearms enhancement could not have come as such a surprise to Vega-Cosme as to render the entire sentencing proceeding a miscarriage of justice.\n\n4. Denial of Downward Adjustment (Gonzalez-Ayala, de León Maysonet)\n\nGonzalez-Ayala and de León Maysonet argue that the district court committed an error of law when it refused to grant them a downward adjustment based on their roles as minor participants in the conspiracy. They argue in their brief that the district court \"failed to realize that the guidelines permitted the sentencing court to decrease defendants' sentencing level\" based on the fact that \"the appellants' level of participation was below that of the other defendants.\" Mistakes of law in applying the Sentencing Guidelines are reviewed de novo. United States v. Cali, 87 F.3d 571, 575 (1st Cir. 1996). The district court made no mistake of law.\n\nThe district court correctly determined that these defendants were not entitled to a minor-role adjustment merely because they were the least culpable among those who were actually indicted. See United States v. Daniel, 962 F.2d 100, 103 (1st Cir. 1992). The relevant inquiry is whether the defendant played a part that made him substantially less culpable than the average participant in similar crimes. See U.S.S.G. § 3B1.2 cmt. 3; United States v. Brandon, 17 F.3d 409, 460 (1st Cir. 1994).\n\nAbsent a mistake of law, we review the district court's fact-based determination that a defendant was not a minor participant for clear error. United States v. Rosario-Peralta, 199 F.3d 552, 571 (1st Cir. 1999). The court's determination was not clearly erroneous. The government presented testimony at trial that de León Maysonet stored weapons and narcotics for the conspiracy in 1992, stood as an armed guard at drug points in 1993, and packaged and sold narcotics at the Callejón Nueve point in 1993. The government also presented evidence at trial that he participated in an unsuccessful mission to Fajardo to find and kill an individual named Vitito, who had been hired to kill those responsible for stealing the 200 kilograms of cocaine. The evidence is sufficient to support the district court's finding that de León Maysonet was not a minor participant, based on his two-year involvement and his participation in a variety of criminal activities in support of the conspiracy. As to Gonzalez-Ayala, government witnesses Negrón-Maldonado and Torrens-Alicea testified at trial that he participated in the planning and execution of the theft of 200 kilograms of cocaine in Fajardo and that he received profits from the sale of that cocaine. They also testified that he helped package heroin and cocaine for distribution at the Callejón Nueve point. The record supports the district court's conclusion, based on the quantity of drugs he helped obtain for the conspiracy and his ongoing role in the packaging and sale of those drugs, that Gonzalez-Ayala was not a minor participant.\n\n5. Grant of Upward Adjustment (Cintrón-Caraballo)\n\nCintrón-Caraballo argues that the evidence was insufficient to support the district court's grant of a three-level sentencing enhancement for his role as a supervisor in the conspiracy under U.S.S.G. § 3B1.1(b). Under the Sentencing Guidelines, a three-level enhancement is permissible \"[i]f the defendant was a manager or supervisor (but not an organizer or leader) and the criminal activity involved five or more participants or was otherwise extensive.\" U.S.S.G. § 3B1.1(b). Review of this determination is for clear error. United States v. Brown, 298 F.3d 120, 122 (1st Cir. 2002).\n\nThe district court correctly counted the eleven defendants convicted in the trial as meeting the \"five or more participants\" prong. The more serious question is whether Cintrón-Caraballo was a manager or supervisor, terms not defined in the Sentencing Guidelines but described in U.S.S.G. § 3B1.1 cmt. 4 as involving:\n\nthe exercise of decision making authority, the nature of participation in the commission of the offense, the recruitment of accomplices, the claimed right to a larger share of the fruits of the crime, the degree of participation in planning or organizing the offense, the nature and scope of the illegal activity, and the degree of control and authority exercised over others.\n\nCintrón-Caraballo argues that there was no firm evidence that he was a supervisor; there was only rumor and innuendo. But the government presented testimony at trial that Cintrón-Caraballo controlled a drug point at Street B that sold crack cocaine and that he had \"Nanito, . . . Bennie's little brothers, and other persons\" selling for him. He also had Negrón-Maldonado cook cocaine into crack for his drug point. The district court did not clearly err in finding that Cintrón-Caraballo acted as a supervisor in running his drug point.\n\n6. Denial of Downward Departure (Soto-Ram¡rez)\n\nSoto-Ram¡rez challenges the district court's denial of a downward departure based on his upbringing. The record contained well-documented evidence that Soto-Ram¡rez had suffered severe neglect and sexual abuse as a child. A denial of a downward departure is generally non-reviewable unless the lower court's failure to depart stemmed from a misapprehension of its authority under the Sentencing Guidelines. See United States v. Rivera-Rodriguez, 318 F.3d 268, 275 (1st Cir. 2003). This standard is unaffected by the PROTECT Act, which applies when the decision made is to grant a departure. 18 U.S.C. § 3742(e). Here, Soto-Ram¡rez argues that the district court failed to recognize that it had the power to grant a downward departure based on abuse that Soto-Ram¡rez suffered as a child. But the district court did acknowledge its power to depart. It expressly stated, \"I have [the] authority to depart because of an upbringing situation which may have affected the defendant.\" Accordingly, we have no jurisdiction to review its decision on this issue.\n\nIV.\n\nThis was a lengthy and complex case handled patiently and well by the trial court. Despite missteps by the prosecution, defendants received a fair trial and sufficient evidence supported both the verdicts and the sentences for each defendant, which are affirmed. So ordered.\n\n\u003cspan class=\"fn\"\u003e1. If the evidence instead establishes agreements different from those charged, the next issue is variance. The reviewing court asks whether the evidence is sufficient to permit a properly instructed jury to convict the defendant of a similar related conspiracy, and if so, whether the variance between the two conspiracies affected the substantial rights of the defendant. United States v. Glenn, 828 F.2d 855, 858 (1st Cir. 1987); see also Kotteakos v. United States, 328 U.S. 750, 774 (1946). We need not reach this step of the inquiry in this case because we find sufficient evidence to support the finding of a single conspiracy.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. In some cases, the indictment itself sets forth different, often sequential conspiracies in multiple counts. See, e.g., United States v. David, 940 F.2d 722 (1st Cir. 1991). Defendants then may argue that there is only one conspiracy, not two, and that they may not be sentenced for two conspiracies without violating the double jeopardy clause. Id. at 732. This court uses a similar totality of the circumstances, multi-factored approach in analyzing a claim of that type. Id. at 734.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Torrens-Alicea also testified that, at this meeting, Cintrón-Caraballo and Negrón-Maldonado informed Rodr¡guez-López that they now sought to kill Soto-Ram¡rez and his associates. Because Soto-Ram¡rez and Soto-Ben¡quez had already left Bitumul at this point, however, these new tensions did not prevent the drug points from working together, as described infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. A number of defendants present no argument on issues but purport to adopt arguments presented by other defendants on those issues. In no instance in which that is done is the argument successful. When an issue is listed as raised by a defendant, the defendant listed is the one who argued the issue.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. If the conspiracy is used to establish the continuing series of violations, then defendants may be punished on the CCE charge but not the conspiracy charge. Rutledge v. United States, 517 U.S. 292, 307 (1996). Because the court eventually dismissed the conspiracy charge, Count Two, against the two CCE defendants, this is not an issue here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Fernández-Malavé also asserts in his brief a different objection to the admission of his guilty plea, rooted in Fed. R. Evid. 403. Because this objection was not raised below, the court's decision not to exclude the evidence on Rule 403 grounds is reviewed for plain error. See United States v. Woods, 210 F.3d 70, 78 (1st Cir. 2000). Given the relevance of the murder of Dones-Sanchez to the charged conspiracy, it is clear that there was not plain error in admitting the guilty plea despite potential Rule 403 concerns: the murder was highly probative of a material issue in the case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The defendants also argue briefly that the convictions were inadmissible hearsay because they did not fall within Rule 803(22). This argument is not developed in the defendants' brief, and, in any case, is not meritorious. See Fed. R. Evid. 803(22) (exception to hearsay rule for \"[e]vidence of a final judgment, entered after a trial or upon a plea of guilty . . . adjudging a person guilty of a crime punishable by death or imprisonment in excess of one year, to prove any fact essential to sustain the judgment\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The trial in this case took place in 1999, before the December 1, 2000 effective date of the amendments to Rules 701 and 702. Accordingly, we apply the pre-amendment Rules and case law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Soto-Ben¡quez and Soto-Ram¡rez also argue reversible error based on the district court's denial of their request for a special verdict sheet requiring the jury to find the type and amount of drugs as to each defendant. In criminal cases, the failure to use a special verdict form is reviewed for abuse of discretion. United States v. Ellis, 168 F.3d 558, 562 (1st Cir. 1999). For the reasons discussed above, we find no such abuse here. It was not necessary for the jury to determine the quantity or type of drugs to convict Soto-Ram¡rez and Soto-Ben¡quez on the CCE count.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The indictment did not need to specify the exact amount of drugs involved in the conspiracy, as long as it alleged the appropriate threshold amounts necessary to support the defendants' sentences. Cf. Derman v. United States, 298 F.3d 34, 42 n.4 (1st Cir. 2002).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. If the government is mindful of its obligations, countervailing incentives, such as avoidance of perjury charges, can reduce the incentive to lie.\u003c/span\u003e\n\n",
    "body_length": 143379,
    "citedas": [
      "350 F.3d 131"
    ],
    "attorneys": "Marlene Apontes-Cabrera for appellant Soto-Ben¡quez. Miriam Ramos-Grateroles for appellant Soto-Ram¡rez. Raymond Rivera Esteves for appellant Alicea-Torres. Luz M. Rios-Rosario for appellant Fernández-Malavé. Javier Morales-Ramos for appellant Vega-Pacheco. Rachel Brill for appellant Garc¡a-Garc¡a. Roberto Roldan-Burgos for appellant de León Maysonet. Victor Miranda-Corrada for appellant Gonzalez-Ayala. Rafael Anglada-Lopez for appellant Cintrón-Caraballo. Marcia G. Shein for appellants Vega-Cosme and Vega-Colón. Jacabed Rodriguez-Coss and Michelle Morales, Assistant UnitedStates Attorneys, with whom H.S. Garcia, United States Attorney, andSonia I. Torres-Pabon, Assistant United States Attorney, were on brief,for appellee.",
    "category": [
      "75"
    ],
    "judges": "Before Selya, Circuit Judge,Coffin, Senior Circuit Judge,and Lynch, Circuit Judge.",
    "citation_count": 1
  }
}
