{
  "id": "nYqlQGYBTlTomsSBF9vU",
  "document": {
    "title": "Shahar v. Bowers",
    "full_title": "ROBIN JOY SHAHAR v. MICHAEL J. BOWERS, INDIVIDUALLY AND IN HIS OFFICIAL CAPACITY AS ATTORNEY GENERAL OF THE STATE OF GEORGIA .",
    "jurisdiction": "Eleventh Circuit",
    "date": "1997-05-30T00:00:00.000Z",
    "docket": "No. 93-9345",
    "body": "EDMONDSON, Circuit Judge:\n\nIn this government-employment case, Plaintiff-Appellant contends that the Attorney General of the State of Georgia violated her federal constitutional rights by revoking an employment offer because of her purported \"marriage\"\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e to another woman. The district court concluded that Plaintiff's rights had not been violated. We affirm.\n\nGiven the culture and traditions of the Nation, considerable doubt exists that Plaintiff has a constitutionally protected federal right to be \"married\" to another woman: the question about the right of intimate association. See generally FW/PBS, Inc. v. City of Dallas, 493 U.S. 215, 110 S. Ct. 596, 611, 107 L. Ed. 2d 603 (1993); Roberts v. United States Jaycees, 468 U.S. 609, 104 S. Ct. 3244, 3250, 82 L. Ed. 2d 462 (1984). Given especially that Plaintiff's religion requires a woman neither to \"marry\" another female--even in the case of lesbian couples--nor to marry at all, considerable doubt also exists that she has a constitutionally protected federal right to be \"married\" to another woman to engage in her religion: the question about the right of expressive association. See generally Salvation Army v. N.J. Dept. of Community Affairs, 919 F.2d 183, 198-200 (3d Cir.1990).\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e See also Lyng v. Northwest Indian Cemetery Protective Assn., 485 U.S. 439, 108 S. Ct. 1319, 1326, 99 L. Ed. 2d 534 (1988); Employment Div., Dept. of Human Res. v. Smith, 494 U.S. 872, 110 S. Ct. 1595, 1603, 108 L. Ed. 2d 876 (1990); Bowen v. Roy, 476 U.S. 693, 106 S. Ct. 2147, 2152, 90 L. Ed. 2d 735 (1986) (plurality opinion) (\"Never to our knowledge has the Court interpreted the First Amendment to require the Government itself to behave in ways that the individual believes will further his or her spiritual development or that of his or her family.\")\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nBecause even a favorable decision on these constitutional questions would entitle Plaintiff to no relief in this case, powerful considerations of judicial restraint call upon us not to decide these constitutional issues. See e.g., Lyng, 108 S. Ct. at 1323 (\"A fundamental and longstanding principle of judicial restraint requires that courts avoid reaching constitutional questions in advance of the necessity of deciding them.\"); Employment Div., Dept. of Human Res. v. Smith, 485 U.S. 660, 108 S. Ct. 1444, 1452, 99 L. Ed. 2d 753 (1988); City of Mesquite v. Aladdin's Castle, Inc., 455 U.S. 283, 102 S. Ct. 1070, 1077, 71 L. Ed. 2d 152 (1982) \"This self-imposed limitation on the exercise of this Court's jurisdiction has an importance to the institution that transcends the significance of particular controversies.\") So, today we do stop short of making a final decision about such claimed rights. Instead, we assume (for the sake of argument only) that Plaintiff has these rights; but we conclude that the Attorney General's act--as an employer--was still lawful.\n\nI.\n\nThe facts are not much in dispute; but we accept Plaintiff's view when there is uncertainty. Plaintiff Robin Joy Shahar is a woman who has \"married\" another woman in a ceremony performed by a rabbi within the Reconstructionist Movement of Judaism. According to Shahar, though the State of Georgia does not recognize her \"marriage\" and she does not claim that the \"marriage\" has legal effect, she and her partner consider themselves to be \"married.\"\n\nSince August 1981, Defendant-Appellee Michael J. Bowers has been the Attorney General of the State of Georgia, a statewide elective office. He has been elected to the office four times. As the Attorney General, Bowers is the chief legal officer of the State of Georgia and head of the Georgia Department of Law (the \"Department\"). His responsibilities include enforcing the laws of the State by acting as a prosecutor in certain criminal actions; conducting investigations; representing Georgia, its agencies and officials in all civil litigation (including habeas corpus matters); and providing legal advice (including advice on the proper interpretation of Georgia law) to Georgia's executive branch.\n\nWhile a law student, Shahar spent the summer of 1990 as a law clerk with the Department.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e In September 1990, the Attorney General offered Shahar the position of Staff Attorney when she graduated from law school.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Shahar accepted the offer and was scheduled to begin work in September 1991.\n\nIn the summer of 1990, Shahar began making plans for her \"wedding.\" Her rabbi announced the expected \"wedding\" to the congregation at Shahar's synagogue in Atlanta. Shahar and her partner invited approximately 250 people, including two Department employees, to the \"wedding.\" The written invitations characterized the ceremony as a \"Jewish, lesbian-feminist, out-door wedding.\" The ceremony took place in a public park in South Carolina in June 1991.\n\nIn November 1990, Shahar filled out the required application for a Staff Attorney position. In response to the question on \"marital status,\" Shahar indicated that she was \"engaged.\" She altered \"spouse's name\" to read \"future spouse's name\" and filled in her partner's name: \"Francine M. Greenfield.\" In response to the question \"Do any of your relatives work for the State of Georgia?\" she filled in the name of her partner as follows: \"Francine Greenfield, future spouse.\"\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nSometime in the spring of 1991, Shahar and her partner were working on their \"wedding\" invitations at an Atlanta restaurant. While there, they ran into Elizabeth Rowe and Susan Rutherford. Rowe was employed by the Department as a paralegal, Rutherford as an attorney. Rowe was invited to, and did attend, Shahar's ceremony. The four women had a brief conversation, which included some discussion of the \"wedding\" preparations.\n\nIn June 1991, Shahar told Deputy Attorney General Robert Coleman that she was getting married at the end of July, changing her last name, taking a trip to Greece and, accordingly, would not be starting work with the Department until mid-to-late September. At this point, Shahar did not say that she was \"marrying\" another woman. Senior Assistant Attorney General Jeffrey Milsteen, who had been co-chair of the summer clerk committee, was in Coleman's office at the time and heard Coleman congratulate Shahar. Milsteen later mentioned to Rutherford that Shahar was getting married. Rutherford then told Milsteen that Shahar was planning on \"marrying\" another woman. This revelation caused a stir.\n\nSenior aides to the Attorney General became concerned about what they viewed as potential problems in the office resulting from the Department's employment of a Staff Attorney who purported to be part of a same-sex \"marriage.\" As the Attorney General was out of the office that week, the five aides held several meetings among themselves to discuss the situation.\n\nUpon the Attorney General's return to the office, he was informed of the situation. He held discussions with the senior aides, as well as a few other lawyers within the Department. After much discussion, the Attorney General decided, with the advice of his senior lawyers, to withdraw Shahar's job offer. In July 1991, he did so in writing. The pertinent letter stated that the withdrawal of Shahar's offer:\n\nhas become necessary in light of information which has only recently come to my attention relating to a purported marriage between you and another woman. As chief legal officer of this state, inaction on my part would constitute tacit approval of this purported marriage and jeopardize the proper functioning of this office.\n\nThe Attorney General and his staff have also indicated (in depositions taken in the present action) that, after weighing the facts and relevant considerations, they concluded that Shahar's same-sex \"marriage\" would create the appearance of conflicting interpretations of Georgia law and affect public credibility about the Department's interpretations; interfere with the Department's ability to handle controversial matters; interfere with the Department's ability to enforce Georgia's sodomy law; and, in general, create difficulties maintaining the supportive working relationship among the office lawyers that is necessary for the proper functioning of the Department. Also, following her decision to participate in a controversial same-sex \"wedding,\" the Attorney General and his staff had serious doubts about the quality of Shahar's judgment in general.\n\nShahar brought the present action against the Attorney General, individually and in his official capacity, seeking both damages and injunctive relief (including \"reinstatement\"). She said revoking her offer violated her free exercise and free association rights and her rights to equal protection and substantive due process.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nBowers moved for summary judgment on all causes of action. On that same day, Shahar moved for partial summary judgment.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e The district court granted the Attorney General's motion for summary judgment and denied Shahar's.\n\nII.\n\nEven when we assume, for argument's sake, that either the right to intimate association or the right to expressive association or both are present, we know they are not absolute. Cf. Board of Comm'rs, Waubansee Cty. v. Umbehr, U.S., 116 S. Ct. 2342, 2347, 135 L. Ed. 2d 843 (1996) (\"While protecting First Amendment freedoms, we have, however, acknowledged that the First Amendment does not create property or tenure rights, and does not guarantee absolute freedom of speech.\")\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Georgia and its elected Attorney General also have rights and duties which must be taken into account, especially where (as here) the State is acting as employer. See e.g., Rankin v. McPherson, 483 U.S. 378, 107 S. Ct. 2891, 2897, 97 L. Ed. 2d 315 (1987) (\"Public employers are employers, concerned with the efficient function of their operations; review of every personnel decision made by a public employer could, in the long run, hamper the performance of public functions.\") We also know that because the government's role as employer is different from its role as sovereign, we review its acts differently in the different contexts. See Waters v. Churchill, 511 U.S. 661, 114 S. Ct. 1878, 1888, 128 L. Ed. 2d 686 (1994) (plurality opinion) (\"The key to First Amendment analysis of government employment decisions ... is this: The government's interest in achieving its goals as effectively and efficiently as possible is elevated from a relatively subordinate interest when it acts as sovereign to a significant one when it acts as employer.\") In reviewing Shahar's claim, we stress that this case is about the government acting as employer.\n\nA.\n\nShahar argues that we must review the withdrawal of her job offer under strict scrutiny. The only precedent to which Shahar refers us for the proposition that strict scrutiny is to be applied to the government as employer is Dike v. School Board, 650 F.2d 783 (5th Cir. Unit B 1981). In Dike, the Fifth Circuit--our predecessor--implied that a school district's refusal to allow a teacher to breast-feed her child on her lunch hour must withstand strict scrutiny. Id. at 787 (\"The school board may establish by appropriate pleading and proof that its regulations ... as applied to teachers who breastfeed their children during their non-duty time, further sufficiently important state interests and are closely tailored to effectuate only those interests.\").\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e To the extent that Dike might be interpreted as requiring strict scrutiny review of a government employee's freedom of intimate association claim, it misstates the appropriate standard; and we overrule it now.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nWe also note that the Supreme Court recently rejected a similar argument in an analogous case. In Board of Comm'rs, Waubansee Cty. v. Umbehr, U.S., 116 S. Ct. 2342, 135 L. Ed. 2d 843 (1996), the Court held that government contractors are protected from termination or failure to renew their contracts for exercising their free speech rights and that the Pickering balancing test\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e is the appropriate standard for determining whether a First Amendment violation has occurred.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e The Court specifically rejected the contractor's argument that \"on proof of viewpoint-based retaliation for contractors' political speech, the government should be required to justify its actions as narrowly tailored to serve a compelling state interest,\" id. at 2349, and wrote as follows:\n\n[Contractor] is correct that if the Board had exercised sovereign power against him as a citizen in response to his political speech, it would be required to demonstrate that its action was narrowly tailored to serve a compelling governmental interest. But in this case, as in government employment cases, the Board exercised contractual power, and its interests as a public service provider, including its interest in being free from intensive judicial supervision of its daily management functions, are potentially indicated. Deference is therefore due to the government's reasonable assessment of its interest as contractor.\n\nId. at 2349.\n\nWe conclude that the appropriate test for evaluating the constitutional implications of the State of Georgia's decision--as an employer--to withdraw Shahar's job offer based on her \"marriage\" is the same test as the test for evaluating the constitutional implications of a government employer's decision based on an employee's exercise of her right to free speech, that is, the Pickering balancing test.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nB.\n\nWe have previously pointed out that government employees who have access to their employer's confidences or who act as spokespersons for their employers, as well as those employees with some policy-making role, are in a special class of employees and might seldom prevail under the First Amendment in keeping their jobs when they conflict with their employers. See Bates v. Hunt, 3 F.3d 374, 378 (11th Cir.1993); Sims v. Metropolitan Dade County, 972 F.2d 1230, 1237-38 (11th Cir.1992). See also Kinsey v. Salado Independent School Dist., 950 F.2d 988 (5th Cir.1992) (en banc). See generally Pickering v. Board of Ed., 391 U.S. 563, 88 S. Ct. 1731, 1735 n. 3, 20 L. Ed. 2d 811 (1968).\n\nPut differently, the government employer's interest in staffing its offices with persons the employer fully trusts is given great weight when the pertinent employee helps make policy, handles confidential information or must speak or act--for others to see--on the employer's behalf. See Bates, 3 F.3d at 378; Sims, 972 F.2d at 1237-38. Staff Attorneys inherently do (or must be ready to do) important things, which require the capacity to exercise good sense and discretion (as the Attorney General, using his considered judgment, defines those qualities): advise about policy; have access to confidential information (for example, litigation strategies); speak, write and act on behalf of the Attorney General and for the State.\n\nIn a case such as this one, the employee faces a difficult situation. In fact, we know of no federal appellate decision in which a subordinate prosecutor, state's attorney or like lawyer has prevailed in keeping his job over the chief lawyer's objection. See e.g., Connick v. Myers, 461 U.S. 138, 103 S. Ct. 1684, 1694, 75 L. Ed. 2d 708 (1983); Livas v. Petka, 711 F.2d 798, 801 (7th Cir.1983) (\"One of the problems faced by a prosecutor such as Petka, however, is that his policies are implemented by subordinates ... That Petka lost confidence in Livas, for whatever reason, is therefore sufficient justification for Livas' dismissal.\").\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e We conclude that the Attorney General--who is an elected official with great duties and with no job security except that which might come from his office's performing well--may properly limit the lawyers on his professional staff to persons in whom he has trust.\n\nAs both parties acknowledge, this case arises against the backdrop of an ongoing controversy in Georgia about homosexual sodomy, homosexual marriages, and other related issues, including a sodomy prosecution--in which the Attorney General's staff was engaged--resulting in the well-known Supreme Court decision in Bowers v. Hardwick, 478 U.S. 186, 106 S. Ct. 2841, 2844, 92 L. Ed. 2d 140 (1986) (criminal prosecution of homosexual sodomy does not violate substantive due process).\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e When the Attorney General viewed Shahar's decision to \"wed\" openly--complete with changing her name--another woman (in a large \"wedding\") against this background of ongoing controversy, he saw her acts as having a realistic likelihood to affect her (and, therefore, the Department's) credibility, to interfere with the Department's ability to handle certain kinds of controversial matters (such as claims to same-sex marriage licenses, homosexual parental rights, employee benefits, insurance coverage of \"domestic partners\"), to interfere with the Department's efforts to enforce Georgia's laws against homosexual sodomy,\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e and to create other difficulties within the Department which would be likely to harm the public perception of the Department. See Board of Comm'rs, Waubansee Cty. v. Umbehr, U.S., 116 S. Ct. 2342, 2347, 135 L. Ed. 2d 843 (1996) (\"The government needs to be free to terminate both employees and contractors ... to improve the efficiency, efficacy and responsiveness of service to the public...\")\n\nIn addition, because of Shahar's decision to participate in such a controversial same-sex \"wedding\" and \"marriage\" and the fact that she seemingly did not appreciate the importance of appearances and the need to avoid bringing \"controversy\" to the Department, the Attorney General lost confidence in her ability to make good judgments for the Department.\n\nWhatever our individual, personal estimates might be, we as we observe throughout this opinion--cannot say that the Attorney General's worries and view of the circumstances that led him to take the adverse personnel action against Shahar are beyond the broad range of reasonable assessments of the facts.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e See Waters v. Churchill, 511 U.S. 661, 114 S. Ct. 1878, 1887-90, 128 L. Ed. 2d 686 (1994) (plurality opinion) (for Pickering balance, facts to be weighed on government's side merely need to be reasonable view of facts or reasonable predictions; manager's view of circumstances is entitled to substantial weight).\n\nC.\n\nWe must decide whether Shahar's interests outweigh the disruption and other harm the Attorney General believes her employment could cause. Pickering balancing is never a precise mathematical process: it is a method of analysis by which a court compares the relative values of the things before it. A person often knows that \"x\" outweighs \"y\" even without first determining exactly what either \"x\" or \"y\" weighs. And it is this common experience that illustrates the workings of a Pickering balance.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nTo decide this case, we are willing to accord Shahar's claimed associational rights (which we have assumed to exist) substantial weight. But, we know that the weight due intimate associational rights, such as, those involved in even a state-authorized marriage, can be overcome by a government employer's interest in maintaining the effective functioning of his office. See McCabe v. Sharrett, 12 F.3d 1558, 1569-1570 (11th Cir.1994) (upholding transfer of sheriff's secretary to less desirable job based on her marriage to an officer in sheriff's department).\n\nIn weighing her interest in her associational rights, Shahar asks us also to consider the \"non-employment related context\" of her \"wedding\" and \"marriage\" and that \"she took no action to transform her intimate association into a public or political statement.\" In addition, Shahar says that we should take into account that she has affirmatively disavowed a right to benefits from the Department based on her \"marriage.\"\n\nTo the extent that Shahar disclaims benefits bestowed by the State based on marriage, she is merely acknowledging what is undisputed, that Georgia law does not and has not recognized homosexual marriage. See O.C.G.A. §§ 19-3-1; 19-3-3.1; City of Atlanta v. McKinney, 265 Ga. 161, 454 S.E.2d 517, 519 (Ga.1995) (\"We hold that the city ... exceeded its authority in extending employee benefits to persons who are not dependents under state law.\"); Georgia Osteopathic Hosp., Inc. v. O'Neal, 198 Ga. App. 770, 403 S.E.2d 235, 243 (Ga.App.1991) (\"In order for a common-law marriage to come into existence, the parties must be able to contract, must agree to live together as man and wife, and must consummate the agreement.\"). We fail to see how that technical acknowledgment counts for much in the balance.\n\nIf Shahar is arguing that she does not hold herself out as \"married,\" the undisputed facts are to the contrary. Department employees, among many others, were invited to a \"Jewish, lesbian-feminist, out-door wedding\" which included exchanging wedding rings: the wearing of a wedding ring is an outward sign of having entered into marriage. Shahar listed her \"marital status\" on her employment application as \"engaged\" and indicated that her future spouse was a woman. She and her partner have both legally changed their family name to Shahar by filing a name change petition with the Fulton County Superior Court.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e They sought and received the married rate on their insurance. And, they, together, own the house in which they cohabit. These things were not done secretly, but openly.\n\nEven if Shahar is not married to another woman, she, for appearance purposes, might as well be. We suppose that Shahar could have done more to \"transform\" her intimate relationship into a public statement. But after (as she says) \"sanctifying\" the relationship with a large \"wedding\" ceremony by which she became--and remains for all to see--\"married,\" she has done enough to warrant the Attorney General's concern.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e He could conclude that her acts would give rise to a likelihood of confusion in the minds of members of the public: confusion about her marital status and about his attitude on same-sex marriage and related issues.\n\nAs for disruption within the Department, Shahar argues that we may discount the potential harm based on (what she sees as) the weakness of the Attorney General's predictions. Shahar overstates the Attorney General's \"evidentiary burden.\" See Waters, 114 S. Ct. at 1888 (\"Government employers should be allowed to use personnel procedures that differ from the evidentiary rules used by courts, without fear that these differences will lead to liability.\")\n\nIn Connick v. Myers, 461 U.S. 138, 103 S. Ct. 1684, 75 L. Ed. 2d 708 (1983), the Supreme Court upheld the termination of an assistant district attorney based on her exercise of her free speech rights. In so doing, the Court noted the close working relationship involved in a district attorney's office (which we think is similar to the Department) and held as follows:\n\nWhen close working relationships are essential to fulfilling public responsibilities, a wide degree of deference to the employer's judgment is appropriate. Furthermore, we do not see the necessity for an employer to allow events to unfold to the extent that the disruption of the office and the destruction of working relationships is manifest before taking action.\n\nId. at 1692. See also Waters, 114 S. Ct. at 1887 (\"We have given substantial weight to government employers' reasonable predictions of disruption... even though when the government is acting as sovereign our review of legislative predictions of harm is considerably less deferential.\")\n\nAs we have already written, the Attorney General's worry about his office being involved in litigation in which Shahar's special personal interest might appear to be in conflict with the State's position has been borne out in fact. See supra, note 16. This worry is not unreasonable. In addition, the Department, when the job offer was withdrawn, had already engaged in and won a recent battle about homosexual sodomy--highly visible litigation in which its lawyers worked to uphold the lawful prohibition of homosexual sodomy. This history makes it particularly reasonable for the Attorney General to worry about the internal consequences for his professional staff (for example, loss of morale, loss of cohesiveness and so forth) of allowing a lawyer, who openly--for instance, on her employment application and in statements to co-workers--represents herself to be \"married\" to a person of the same sex, to become part of his staff. Doubt and uncertainty of purpose can undo an office; he is not unreasonable to guard against that potentiality.\n\nShahar also argues that, at the Department, she would have handled mostly death penalty appeals and that the Pickering test requires evidence of potential interference with these particular duties. Even assuming Shahar is correct about her likely assignment within the Department, a particularized showing of interference with the provision of public services is not required. Waters, 114 S. Ct. at 1887 (\"Few of the examples [of government employers restricting protected speech] we have discussed involve tangible, present interference with the agency's operation. The danger in them is mostly speculative.\") In addition, the Attorney General must be able to reassign his limited legal staff as the needs of his office require. As the Third Circuit said in Ness v. Marshall, 660 F.2d 517, 521-522 (3d Cir.1981):\n\nThat a city solicitor could conceivably operate in such a legal/technical manner is a possibility that need not concern us here. Neither need we decide whether the plaintiffs in fact limited themselves to the role they described.... Under the Administrative Code it is contemplated that a mayor might rely upon the city solicitors for the legal advice necessary to implement policy.\n\nIn a similar way, it is not for this court to tie the Department's hands by telling it which Staff Attorneys may be assigned to which cases or duties or to force upon the Attorney General a Staff Attorney of limited utility. Such an interference by the federal judiciary into the internal organization of the executive branch of a state government is almost always unwarranted. Cf. Mayor of Phila. v. Educational Equality League, 415 U.S. 605, 94 S. Ct. 1323, 1330-31, 39 L. Ed. 2d 630 (1974) (\"To the degree that the principles cited by the Mayor reflect concern that judicial oversight of discretionary appointments may interfere with the ability of an elected official to respond to the mandate of his constituency, they are on point.\").\n\nD.\n\nAs we have already touched upon, the Attorney General, for balancing purposes, has pointed out, among other things, his concern about the public's reaction--the public that elected him and that he serves--to his having a Staff Attorney who is part of a same-sex \"marriage.\" Shahar argues that he may not justify his decision by reference to perceived public hostility to her \"marriage.\" We have held otherwise about the significance of public perception when law enforcement is involved. In McMullen v. Carson, 754 F.2d 936 (11th Cir.1985), we held that a sheriff's clerical employee's First Amendment interest in an off-duty statement that he was employed by the sheriff's office and also was a recruiter for the Ku Klux Klan was outweighed by the sheriff's interest in esprit de corps and credibility in the community the sheriff policed. More important, we relied, in large part, on public perceptions of the employee's constitutionally protected act. Id. at 938-940.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nIn McMullen, both public perception and the anticipated effect that the employee's constitutionally protected activity would have on cohesion within the office were crucial in tipping the scales in the sheriff's favor. Nothing indicates that the employee had engaged in a criminal act or that he had joined an organization (he had joined the Invisible Empire\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e ) that had engaged in any criminal act. Given that it was additionally undisputed that neither the employee's statements nor his protected expressive association hindered his ability to perform his clerical duties and that the specific clerk \"performed his duties in exemplary fashion,\" id. at937, the two factors--public perception and anticipated effect--seemed to be the only ones weighing on the sheriff's side of the scale. Id. at 938 (\"The fundamental question here is whether plaintiff can be fired for his Klan beliefs and activities just because of the violent public reaction to his employment....\"). But that was enough.\n\nThis case is different from McMullen in some ways, but McMullen guides us about the significance of \"public perception.\" In this case, the Attorney General was similarly entitled to consider any \"deleterious effect on [his] ability to enforce the law of the community,\" id., and that \"under our system of Government, that duty [law enforcement] can be performed only with the consent of the vast majority.... Efficient law enforcement requires mutual respect, trust and support.\" Id. at 939.\n\nThe Attorney General was also entitled to conclude that the public may think that employment of a Staff Attorney who openly purports to be part of a same-sex \"marriage\" is, at best, inconsistent with the other positions taken or likely to be taken by the Attorney General as the state's chief legal officer. The Attorney General has a right to take steps to protect the public from confusion about his stand and the Law Department's stand on controversial matters, such as same-sex marriage.\n\nPublic perception is important; but, at the same time, it is not knowable precisely. That the public (which we know is rarely monolithic) would not draw the Attorney General's anticipated inferences from Shahar's \"marriage\" or, at least, would not attribute such perceptions to the Department or the Attorney General is a possibility.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e But assessing what the public perceives about the Attorney General and the Law Department is a judgment for the Attorney General to make in the day-to-day course of filling his proper role as the elected head of the Department, not for the federal judiciary to make with hindsight or from a safe distance away from the distress and disturbance that might result if the decision was mistaken. We must defer to Georgia's Attorney General's judgment about what Georgians might perceive unless his judgment is definitely outside of the broad range of reasonable views. Nothing that either the Supreme Court or this circuit has held in applying the Pickering test leads us to a different conclusion. See e.g., Waters v. Churchill, 511 U.S. 661, 114 S. Ct. 1878, 1887, 128 L. Ed. 2d 686 (1994) (plurality opinion); Connick v. Myers, 461 U.S. 138, 103 S. Ct. 1684, 1694, 75 L. Ed. 2d 708 (1983).\n\nShahar says that by taking into account these concerns about public reaction, the Attorney General impermissibly discriminated against homosexuals; and she refers us to the Supreme Court's recent decision in Romer v. Evans, U.S., 116 S. Ct. 1620, 134 L. Ed. 2d 855 (1996). In Romer, the Supreme Court struck down an amendment to a state constitution as irrational because the amendment's sole purpose was to disadvantage a particular class of people (to \"deny them protection across the board,\" id. at 1628) and because the government engaged in \"classification of persons undertaken for its own sake, something the Equal Protection Clause does not permit.\" Id. at 1629.\n\nRomer is about people's condition; this case is about a person's conduct.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e And, Romer is no employment case. Considering (in deciding to revoke a job offer) public reaction to a future Staff Attorney's conduct in taking part in a same-sex \"wedding\" and subsequent \"marriage\" is not the same kind of decision as an across-the-board denial of legal protection to a group because of their condition, that is, sexual orientation or preference.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nIII\n\nThis case is about the powers of government as an employer, powers which are far broader than government's powers as sovereign. In addition, the employment in this case is of a special kind: employment involving access to the employer's confidences, acting as the employer's spokesperson, and helping to make policy. This kind of employment is one in which the employer's interest has been given especially great weight in the past. Furthermore, the employment in this case is employment with responsibilities directly impacting on the enforcement of a state's laws: a kind of employment in which appearances and public perceptions and public confidence count a lot.\n\nParticularly considering this Attorney General's many years of experience and Georgia's recent legal history, we cannot say that he was unreasonable to think that Shahar's acts were likely to cause the public to be confused and to question the Law Department's credibility; to interfere with the Law Department's ability to handle certain controversial matters, including enforcing the law against homosexual sodomy; and to endanger working relationships inside the Department. We also cannot say that the Attorney General was unreasonable to lose confidence in Shahar's ability to make good judgments as a lawyer for the Law Department.\n\nWe stress in this case the sensitive nature of the pertinent professional employment. And we hold that the Attorney General's interest--that is, the State of Georgia's interest--as an employer in promoting the efficiency of the Law Department's important public service does outweigh Shahar's personal associational interests.\n\nWe do not decide today that the Attorney General did or did not do the right thing when he withdrew the pertinent employment offer. That decision is properly not ours to make. What we decide is much different and less: For the Law Department's professional staff, Georgia's Attorney General has made a personnel decision which none of the asserted federal constitutional provisions prohibited him from making.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\n\nAFFIRMED.\n\nDisposition\n\nAFFIRMED.\n\nTJOFLAT, Circuit Judge, specially concurring:\n\nI join the court's judgment affirming the district court's rejection of Robin Shahar's claim that Attorney General Michael Bowers withdrew his offer of employment because she is a homosexual and thus denied her the equal protection of the laws in violation of the Fourteenth Amendment. I do so because, as the court concludes, the record does not permit the inference that the Attorney General's decision was based on her homosexual status.\n\nI also join the court's judgment with respect to Shahar's remaining claims, all brought under the First and Fourteenth Amendments--that the Attorney General withdrew the offer because of Shahar's intimate association with her lesbian partner and because Shahar participated in a religious wedding ceremony with her partner.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e This latter claim is couched as two claims: a claim that Shahar's participation in the ceremony constituted an exercise of religion on her part, and a claim that such exercise was a purpose of her and her partner's expressive association. The court rejects all of these claims by assuming the existence of the alleged constitutional right and then, under Pickering v. Board of Educ., 391 U.S. 563, 88 S. Ct. 1731, 20 L. Ed. 2d 811 (1968), balancing the assumed right against the Attorney General's governmental interest in the efficient operation of the Department of Law.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nThe court engages in Pickering balancing in an effort to avoid the question whether the Constitution protects the First and Fourteenth Amendment rights Shahar seeks to enforce. I agree that constitutional questions should be answered only when necessary to the resolution of the case. See Lyng v. Northwest Indian Cemetery Protective Ass'n, 485 U.S. 439, 445-46, 108 S. Ct. 1319, 1323-24, 99 L. Ed. 2d 534 (1988); Ashwander v. TVA, 297 U.S. 288, 346-48, 56 S. Ct. 466, 482-83, 80 L. Ed. 688 (1936) (Brandeis, J., concurring). In this case, however, I believe the court must reach the constitutional question in order to determine under Pickering whether the Attorney General's action was lawful. As I explain below, the court must describe qualitatively the constitutional right it is placing on the scale in order to determine whether, on balance, the government's interest is to prevail. The court does not do this--it does not tell us, with respect to each of Shahar's remaining claims, where the assumed right ranks in the constitutional hierarchy.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nPickering balancing, in the public employment context, involves the weighing of the employee's interest in the exercise of a constitutional right against the employer's interest in maintaining an efficient workplace.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e The employee has exercised a constitutional right, and the employer, concluding that such exercise seriously has impaired, or will impair, the ability of the workplace to function properly, makes an employment decision adverse to the employee. In order to decide whether the employer's decision was justified, the court places the interest of the employer on one side of a \"scale\" and the interest of the employee on the other side. If the employer's interest outweighs the employee's, the employer prevails. Pickering balancing does not apply where the employee's constitutionally protected conduct did not motivate the employer's decision. In such a case, balancing is not necessary; the employer prevails because the employee has not established the element of causation. See, e.g., Board of County Comm'rs v. Umbehr, U.S., 116 S. Ct. 2342, 2347, 135 L. Ed. 2d 843 (1996); Mt. Healthy City School Dist. Bd. of Educ. v. Doyle, 429 U.S. 274, 283-84, 97 S. Ct. 568, 574, 50 L. Ed. 2d 471 (1977); McCabe v. Sharrett, 12 F.3d 1558, 1562 (11th Cir.1994).\n\nWhen a court engages in Pickering balancing, it must identify the constitutional source of the right the employee exercised and assign weight to that right. Otherwise, balancing cannot occur. it cannot occur any more than the local butcher can weigh five pounds of hamburger without placing a five pound weight on the other side of the scale. In the case at hand, the court, with respect to each of Shahar's claims, assumes Shahar's exercise of a constitutional right without describing the right and telling us the weight it has assigned to it.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e It then places on the other side of the scale the Attorney General's interest in operating an efficient Department of Law that can command the public's respect, and concludes that such interest outweighs what the court has assumed and placed on Shahar's side of the scale.\n\nI submit that if one assumes that the First Amendment protects the homosexual relationship between Shahar and her partner as an intimate association, summary judgment on the intimate association claim was inappropriate on the record before us. Thus, I reach the question whether that relationship has First Amendment protection. I conclude that it does not. As for Shahar's claims that the Attorney General based his employment decision on Shahar's participation in the religious wedding ceremony and thus infringed her rights of free exercise of religion and expressive association, I conclude that the claims fail for want of proof that the religious nature of that ceremony motivated, in whole or in part, the Attorney General's decision. I turn first to Shahar's intimate association claim.\n\nI.\n\nA.\n\nShahar argues that the Attorney General's withdrawal of the offer of employment violated her right to intimate association with her partner. The Supreme Court articulated the right to intimate association in Roberts v. United States Jaycees, 468 U.S. 609, 104 S. Ct. 3244, 82 L. Ed. 2d 462 (1984), recognizing that its prior decisions \"afford the formation and preservation of certain kinds of highly personal relationships a substantial measure of sanctuary from unjustified interference by the State.\" Id. at 618, 104 S. Ct. at 3250.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e The Court explained that relationships \"that attend the creation and sustenance of a family--marriage, childbirth, the raising and education of children, and cohabitation with one's relatives\" are the type of relationships afforded protection as intimate associations. Id. at 619, 104 S. Ct. at 3250 (citations omitted).\n\nThe Court has since explained that \"we have not held that constitutional protection is restricted to relationships among family members.\" Rotary Int'l, 481 U.S. at 545, 107 S. Ct. at 1946. On the other hand, the Court has also stated that \"we do not think the Constitution recognizes a generalized right of social association.' \" City of Dallas v. Stanglin, 490 U.S. 19, 25, 109 S. Ct. 1591, 1595, 104 L. Ed. 2d 18 (1989).\n\nThe Court in Roberts provided some guidance in determining which relationships are entitled to protection as intimate associations. Roberts provides a list of \"factors that may be relevant [to determining whether a given relationship constitutes an intimate association], including size, purpose, policies, selectivity, congeniality, and other characteristics that in a particular case may be pertinent.\" 468 U.S. at 620, 104 S. Ct. at 3251. While these factors may be relevant, I believe that courts must also determine whether the asserted relationship has \"played a critical role in the culture and traditions of the Nation by cultivating and transmitting shared ideals and beliefs.\" Id. at 618-19, 104 S. Ct.3250.\n\nIn its most recent case to address the issue of intimate association, FW/PBS, Inc. v. City of Dallas, 493 U.S. 215, 110 S. Ct. 596, 107 L. Ed. 2d 603 (1990), the Court evaluated a claim that a municipal ordinance that required a license for any motel renting rooms for fewer than ten hours violated a hotel patron's intimate association rights. There, the Court held that\n\nwe do not believe that limiting motel room rentals to 10 hours will have any discernible effect on the sorts of traditional personal bonds to which we referred in Roberts. Any \"personal bonds\" that are formed from the use of a motel room for fewer than 10 hours are not those that have \"played a critical role in the culture and traditions of the Nation by cultivating and transmitting shared ideals and beliefs.\"\n\nId. at 237, 110 S. Ct. at 596 (quoting Roberts, 468 U.S. at 618-19, 104 S. Ct. at 3249-50).\n\nThis passage illustrates the Court's view that \"the culture and traditions of the Nation\" are critical to the determination of whether a particular relationship is entitled to protection as an intimate association.\n\nThe cases Roberts cites as examples of relationships that are protected as intimate associations further indicate the crucial importance of \"the culture and traditions of the Nation.\" In Zablocki v. Redhail, 434 U.S. 374, 98 S. Ct. 673, 54 L. Ed. 2d 618 (1978), the Court traced the long line of cases extending from the nineteenth century to the present recognizing the fundamental character of marriage. Citing Maynard v. Hill, 125 U.S. 190, 205, 211, 8 S. Ct. 723, 726, 729, 31 L. Ed. 654 (1888), the Zablocki Court noted that marriage is \"the most important relation in life and [is] the foundation of the family and society, without which there would there would be neither civilization nor progress.\" Zablocki, 434 U.S. at 384, 98 S. Ct. at 680 (quotation marks and citations omitted).\n\nThe Court noted in Smith v. Organization of Foster Families for Equality and Reform, that \"the liberty interest in family privacy has its source ... in intrinsic human rights, as they have been understood in this Nation's history and traditions.\" 431 U.S. 816, 845, 97 S. Ct. 2094, 2110, 53 L. Ed. 2d 14 (1977) (quotation marks omitted). In Carey v. Population Servs. Int'l, the Court explained that \"the decision whether or not to beget or bear a child is at the very heart of the cluster of constitutionally protected choices\" about family, childrearing, and conception. 431 U.S. 678, 685, 97 S. Ct. 2010, 2016, 52 L. Ed. 2d 675 (1977). Finally, in Moore v. City of East Cleveland, a plurality of the Court observed that \"our decisions establish that the Constitution protects the sanctity of the family precisely because the institution of the family is deeply rooted in this Nation's history and tradition. It is through the family that we inculcate and pass down many of our most cherished values, moral and cultural.\" 431 U.S. 494, 503-04, 97 S. Ct. 1932, 1938, 52 L. Ed. 2d 531 (1977) (footnotes omitted).\n\nThese cases, coupled with the Court's holding in FW/PBS, lead to the conclusion that in order to find that Shahar's relationship is protected as an intimate association, we must find that homosexual relationships have \"played a critical role in the culture and traditions of the Nation by cultivating and transmitting shared ideals and beliefs.\"\n\nI conclude that this simply is not the case. Shahar has pointed to nothing to suggest that homosexual relationships have played a critical role in our history and tradition. On the contrary, the Supreme Court's decision in Bowers v. Hardwick, 478 U.S. 186, 106 S. Ct. 2841, 92 L. Ed. 2d 140 (1986), suggests that homosexual relationships have not played such a role. In that case the Court concluded that there is no fundamental right to engage in homosexual sodomy. Id. at 190-96, 106 S. Ct. at 2843-47. In arriving at that conclusion, the Court stated that \"no connection between family, marriage, or procreation on the one hand and homosexual activity on the other has been demonstrated.\" Id. at 191, 106 S. Ct. at 2844. The Court concluded that \"to claim that a right to engage in [homosexual sodomy] is deeply rooted in this Nation's history and tradition or implicit in the concept of ordered liberty is, at best, facetious.\" Id. at 194, 106 S. Ct. at 2486 (quotation marks omitted).\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nHomosexual relationships have not played the same role as marital or familial relationships in the history and traditions of the Nation. Shahar's relationship with her partner is not a \"fundamental element of personal liberty\" protected as an intimate association. As a result, Shahar fails to state a claim that her right to intimate association has been violated. Summary judgment on this claim was therefore appropriate.\n\nB.\n\nThe court purports to avoid this constitutional decision by assuming that Shahar's relationship constitutes a protected intimate association and then, by engaging in Pickering balancing, concluding that the Attorney General's interests outweigh Shahar's interest in her intimate association. As I stated earlier, a court cannot engage in Pickering balancing without identifying the constitutional source of the employee's right and assigning the right a weight or constitutional value. The court points to the First Amendment as the source of the right of intimate association. It does not, however, indicate the weight it assigns to Shahar's assumed intimate association. The court simply sidesteps this issue. Instead, after assuming for the sake of argument that Shahar has a right of intimate association, the court, observing that the right is \"not absolute,\" ante at [13], concludes that the Attorney General's interest outweighed Shahar's and that his \"act--as an employer--was still lawful.\" Ante at [5].\n\nI suggest that if the court is going to assume that Shahar's relationship with her partner is a protected intimate relationship, the court ought to assume that it is \"a fundamental element of personal liberty,\" Roberts, 468 U.S. at 618, 104 S. Ct. at 3249, protected because it is \"deeply rooted in this Nation's history and tradition.\"\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Moore, 431 U.S. at 503, 97 S. Ct. at 1938; see supra n.3. A reasonable trier of fact could find from the record in this case that the Attorney General's decision was motivated not by the fact that Shahar is a homosexual, but because she and her partner were maintaining an open homosexual relationship.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Thus, unless the Attorney General would prevail as a matter of law in a Pickering balance, summary judgment was inappropriate. I believe that it is likely that Shahar would prevail in such a balance.\n\nIf Shahar's relationship is entitled to the same level of protection as is a heterosexual marriage, I doubt whether the public perception of that relationship, or the State of Georgia's public policy against according such relationships the same protections and privileges as heterosexual marriage, would be placed on the government's side of the scale. Even if those factors were weighed in the balance, it is difficult to imagine that they would outweigh Shahar's interest in her relationship.\n\nA hypothetical will illustrate the point. Suppose that Shahar had married a man of another race rather than \"marrying\" a woman. Such a relationship would clearly be protected as an intimate association. See Roberts 468 U.S. at 620, 104 S. Ct. at 3251 (citing Loving v. Virginia, 388 U.S. 1, 12, 87 S. Ct. 1817, 1823, 18 L. Ed. 2d 1010 (1967)). I believe that a court engaged in a Pickering balance would either (1) refuse to consider as government interests the public perception of such a relationship or any state policy positions hostile toward that relationship, or (2) conclude that such governmental interests do not prevail in the balance. In short, if the court accords Shahar's relationship the same constitutional value that the Supreme Court has assigned to heterosexual marriage, the Attorney General would face a heavy burden in prevailing in a Pickering balance.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nThe court could have assumed that Shahar's intimate association right has less weight than that accorded intimate associations rooted in the Nation's history and tradition.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e From my reading of its opinion, however, it did not do so. Even if we were to accord Shahar's right a lesser constitutional value, the Pickering balancing problem would persist: precisely what weight would we place on Shahar's side of the scale? In sum, I fail to see how the court can avoid the constitutional question whether Shahar's relationship with her partner is protected under the First and Fourteenth Amendments. For this reason, I cannot ascribe to the court's analysis of her intimate association claim.\n\nII.\n\nBefore reaching the issue of whether Pickering applies to Shahar's free exercise of religion claim, the court must determine whether the record permits the inference that Shahar's participation in the \"wedding\" ceremony constituted an exercise of her sincere religious beliefs. See, e.g., Frazee v. Illinois Dep't. of Employment Sec., 489 U.S. 829, 834, 109 S. Ct. 1514, 1517-18, 103 L. Ed. 2d 914 (1989) (holding that First Amendment protection extends not merely to a claimant \"responding to the commands of a particular religious organization\" but also to a claimant exercising a \"sincerely held religious belief.\"). In addition, the court must determine that the record permits the inference that Shahar's religious exercise motivated the Attorney General's decision.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e See Mt. Healthy, 429 U.S. at 283-84, 97 S. Ct. at 574.\n\nSimilarly, Shahar must establish that the Attorney General was motivated by the religious nature of her \"wedding\" ceremony in order to reach the question of whether Pickering applies to Shahar's expressive association claim. In Roberts, the Supreme Court recognized that it has \"long understood as implicit in the right to engage in activities protected by the First Amendment a corresponding right to associate with others\" for purposes of engaging in those First Amendment activities. 486 U.S. at 622, 104 S. Ct. at 3252. Here, the alleged First Amendment activity for which Shahar and her partner associated was the free exercise of religion: their participation in a religious \"wedding\" ceremony.\n\nWhile the record does establish that Shahar was engaged in the exercise of her religion, there is no evidence that the religious nature of the ceremony motivated the Attorney General's decision. The record establishes that homosexual \"marriages' are recognized by a part of the Reconstructionist movement of the Jewish faith. In addition, the record shows that Shahar and her partner are life-long Jews and that they have been active in a Jewish congregation which ministers to homosexuals and recognizes homosexual \"marriages.\" Shahar's wedding ceremony was performed by a rabbi and was otherwise quite similar to a traditional Jewish wedding between a man and a woman. These facts establish that Shahar's wedding ceremony was an exercise of her religion: she participated in a \"wedding\" ceremony that was in accord with her sincere religious beliefs.\n\nThe record, however, is devoid of evidence which would show that the Attorney General was motivated by the religious nature of Shahar's marriage ceremony. The record shows that the Attorney General was aware that Shahar planned to engage in a \"big or church\" wedding. In addition, the Attorney General discussed with one of his staff members whether such a marriage would be recognized by the Jewish faith. This establishes only that the Attorney General was aware of the religious nature of the ceremony; there is no evidence that the religious nature of the ceremony prompted him to withdraw Shahar's offer of employment. As a result, both Shahar's free exercise claim and her expressive association claim fail for want of proof that religion bore a causal relationship to the Attorney General's decision.\n\nIn conclusion, I concur in the court's judgment for the reasons stated above.\n\nGODBOLD, Senior Circuit Judge, dissenting in which BARKETT, Circuit Judge, and KRAVITCH, Senior Circuit Judge, join:\n\nThe court en banc has pretermitted decision of whether Shahar has constitutional rights of intimate association or expressive association. Instead it assumes that she enjoyed such rights and decides that these presumed rights have not been violated because the Attorney General acted reasonably in \"revoking [Shahar's] employment offer.\"\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nI would grasp the nettle and hold that in the particular circumstances of this case Shahar enjoyed rights of intimate association and expressive association and that the Attorney General violated those rights because he did not act reasonably in revoking the agreement made with Shahar.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nShahar does not assert a right to be married as provided by the laws of Georgia (statutory or common law), or to be issued a marriage license, or to inherit from her spouse, or to be entitled to social security benefits through her spouse. She does not question the constitutionality of the Georgia marriage license statute or any provisions of Georgia law that speak in terms of marriage as a ceremony, or as a status, between persons of different sexes. Nor does she question the validity of Georgia principles of common law marriages. As the panel of this Court held in its now-vacated opinion:\n\nWhat Shahar claims is that she proposed to--and did--engage in a Jewish religious ceremony that is recognized as a marriage ceremony by the branch of Judaism to which she adheres; that this conferred upon her and her partner a religious-based status that is apart from and independent of civil marriage as provided by Georgia law; and that she can accept, describe, and hold out both the ceremonial event and the status created by it by using the term \"marriage.\"\n\n70 F.2d at 1222. In P 1 of her amended complaint Shahar alleged that she was \"fired\" because of her participation \"in a private religious ceremony of marriage.\" The rabbi performed a \"Jewish marriage ceremony,\" P 7, followed by \"a weekend celebration of Jewish marriage,\" a \"private religious marriage ceremony,\" P 8 Plaintiff and her partner considered their \"planned religious marriage\" an important event, P 9. In P 10 Shahar disclaimed any claim of civil or legal marriage pursuant to law. That paragraph alleged:\n\n10. Plaintiff does not believe and has at no time represented either that her religious union with her partner carries with it any legal rights or that it constitutes a legal (civil) marriage. The ceremony was of purely religious nature.\n\nThe religious and historical roots of the associational rights that Shahar defends were spelled out in the panel opinion. Because that opinion has now been vacated, they deserve to be repeated.\n\nThe intimate association Shahar asserts is not based upon false or sham assertions of religious belief, or hasty decision, of overnight conversion. She and her partner grew up in traditional Jewish families. Shahar attended Hebrew school from the third grade. She was bat mitzvahed at age 13 and continued in Hebrew school until she was confirmed at age 16. Greenfield grew up in a conservative, kosher, Jewish home. She went through Jewish training through high school, attended Jewish summer camps, and was involved in Jewish youth groups.\n\nShahar and Greenfield have been significant participants in the life of their synagogue, located in Atlanta. It is affiliated with the Reconstructionist Movement, one of several movements within Judaism. The synagogue serves gays, lesbians, and heterosexuals. The Reconstructionist Movement is regarded as liberal in some respects but is conservative in others. Shahar has led services at the synagogue and has given several sermons. She and Greenfield often attend together. The proposed ceremony was announced at a service of the synagogue.\n\nTheir rabbi, Sharon Kleinbaum, counseled them in eight or nine formal premarital sessions and many informal ones. Rabbi Kleinbaum described the manner in which she satisfied herself of their commitment to the Jewish faith. She discussed with them \"the seriousness of their commitment to the Jewish issues as well as to each other, and anything related to wedding ceremonies in general that, as a Rabbi, I would do.\" Dep. p. 82. Continuing, she said, \"I discussed with them the nature of their home life and the significance of Jewish practices to them and how it was inconceivable to them to do any kind of ceremony that was not a Jewish one.\" Id. at 83.. Rabbi Kleinbaum considers that the union in which they joined is a public affirmation of their commitment to each other and to the Jewish people, having no legal significance but only personal and religious significance, and that it can be terminated only by the church.\n\nThe evidence demonstrates without dispute that same-sex marriage is accepted within the Reconstructionist Movement of Judaism, that Shahar and her partner are committed to that belief, and that, in keeping with their Jewish principles, they carefully and thoughtfully prepared for marriage.\n\n70 F.2d at 1222-23.\n\nThe evidence discloses that Judaism in the United States does not have a monolithic view of same-sex marriages. The Reconstructionist Movement accepts the concept of same-sex marriage, and many rabbis within the Movement perform such marriages. The Reconstructionists are working on a manual that will help guide rabbis performing same-sex marriages. Other movements in Judaism reject same-sex marriages, and still other movements are divided in view, with some rabbis performing such marriages and others declining to do so. But the critical facts are that Shahar and her partner are lifelong adherents to Judaism and good-faith, dedicated participants in the Reconstructionist Movement; the Reconstructionist Movement is a significant movement within American Judaism; and it regards same-sex marriages as acceptable and desirable in preference to couples living together without marriage.\n\nThe actual ceremony between Shahar and Greenfield occurred after the Attorney General terminated the agreement with her, but it is relevant to the fact that her association has religious basis and status. It was the culmination of a weekend of religious-centered activities that began Friday evening with a celebration of the Hebrew Sabbath, which extends from Friday evening to Saturday evening. The wedding occurred on Sunday. Essentially the ceremony followed the traditional ceremony for a heterosexual Jewish couple except for deletion of terms \"bride\" and \"groom.\" It took place beneath the traditional canopy. The couple signed the traditional Kutubah, or written marriage contract. They exchanged rings in traditional fashion, and the traditional glass was broken. The traditional seven blessings were given, done in Hebrew and in English. Rabbi Kleinbaum was dressed in traditional garb. She described the event as a \"Jewish religious ceremony,\" as a \"Jewish marriage,\" and as a \"Jewish wedding.\"\n\nIn her testimony Rabbi Kleinbaum explained the importance of the family to the survival of the Jewish people and the significance of the Jewish marriage ceremony to the creation of the family unit. Therefore, as she explained, the commitments made by Shahar and her partner through the marriage ceremony were not only commitments to each other but to their congregation and to all of the Jewish people as well.\n\nThe Attorney General did not act reasonably. One must focus on what he knew and what he did. Post-event rationalizations of what he might have done, thought up afterwards in ivory towers, will not do. Two statements are central, the termination letter and the Attorney General's statement of position made to the panel of this court. The termination letter said in part:\n\nThis action has become necessary in light of information which has only recently come to my attention relating to a purported marriage between you and another woman. As the chief legal officer of this state inaction on my part would constitute tacit approval of this purported marriage and jeopardize the proper function of this office.\n\n70 F.2d at 1221. The Attorney General's position before the panel was expressed in a significant three-prong statement:\n\nThe Attorney General did not withdraw Shahar's offer of employment because of her association, religious or otherwise, with other homosexuals or her female partner, but rather because she invoked the civil and legal significance of being \"married\" to another woman. Shahar is. still free to associate with her female partner, as well as other homosexuals, for religious and other purposes.\n\nId. at 1224, quoting from the Attorney General's brief. Examine the three prongs. They are: (1) Shahar's employment was not withdrawn for her association with her partner; (2) It was withdrawn because she invoked the civil and legal status of being married to another woman; (3) She is free to associate with her partner for religious reasons.\n\nAs to (1), the undisputed evidence is that in fact the Attorney General did terminate Shahar because of her religious-based association with her partner. As I explain below, he feared that he might be infringing on Shahar's religious beliefs, but he failed to make reasonable inquiry to determine if he was. As to (3), plainly Shahar was not free to associate with her partner for religious purposes. That is exactly what she had done, and it cost her her employment agreement.\n\nThe prong that requires discussion is (2). The termination letter is plainly based on the Attorney General's conclusion that Shahar was falsely holding herself out as becoming married in the civil and legal sense, i.e., proposing to engage in a \"purported marriage.\" In search of evidence of holding out by Shahar this court relies upon her use of the words \"marriage\" and \"wedding.\" This implicates differing perceptions of what words mean. In a common law/statutory/traditional sense \"marriage\" describes a ceremony as a relationship or status between two persons as defined by common law or statute, involving two heterosexual persons, one male and one female. But, as this case tells us, that is not the only and ineluctable meaning. To a person of Shahar's faith as a Reconstructionist Jew \"marriage\" refers to the formal Jewish wedding ceremony recommended and carried out pursuant to the participants' Jewish faith by two persons (including two homosexuals) who have made a lifelong commitment to each other and are bound to each other by the ceremony in a relationship that can be terminated only within their faith and who, by engaging in the ceremony, made a commitment to the Jewish people as well. \"Marriage\" also refers to the status thereby conveyed upon them. In the eyes of Shahar and her partner they engaged in a Jewish marriage and they are accepted by their faith as married and accordingly they may use the term \"marriage\" to refer to the ceremonial event and to the status created by it.\n\nThis court, in its footnote 1, recognizes the duality of meaning that I have described for \"wedding\" and \"marriage\" [and \"spouse\"]. Throughout its opinion the court attempts to indicate (not always successfully) by quotation marks and limiting words which meaning it is referring to. But the decision of the en banc court is based upon, and approves, the Attorney General's attribution to these words of only a single meaning, the statutory/common-law/traditional meaning, and his perception that any other meaning is either false or non-existent, i.e., Shahar proposed to engage in a \"purported marriage.\" The court simply adopts one perception and excludes the other as though it did not exist for Shahar and for others of her faith.\n\nWhat the Attorney General knew was that Shahar had used the terms \"marriage\" and \"spouse\" and \"marriage ceremony\" in referring to the ceremony she planned and to the status to be created by it. She had used the terms \"honeymoon\" or \"wedding trip\" in describing her plans. Within the office there was information that she planned to send, or had sent, invitations to the ceremony and that some staff members were on the invitation list, and other information that, as the Attorney General described it, the planned ceremony would be \"a big or church wedding, I don't remember which.\" Possessed of some, or all, of this knowledge, the Attorney General neither saw Shahar nor talked to her but built a Chinese wall around himself and concluded that she had falsely invoked the civil/statutory/common-law meaning that he attributed to the terms. We know that it occurred to him that assigning a single meaning to \"marriage\" and \"wedding ceremony\" might not be correct, for he talked with a female Jewish member of his staff, who told him that the wedding was to be performed by a rabbi from New York who performed homosexual marriages but that \"she was not aware of homosexual marriages or gay and lesbian marriages being recognized in Judaism.\" At best the response was ambiguous--on the one hand the wedding was to be done by a rabbi, but on the other hand the staff member was not aware that it would be recognized in Judaism. As it turned out, she was correct about the rabbi but incorrect or uninformed about recognition of the marriage.\n\nSince the Attorney General neither saw nor talked with Shahar the decision by this court relies upon information supplied to him by senior staffers who had talked with him. The Attorney General was out of town when the matter first came up. Senior staffers met together several times and discussed their concerns and possible action. The group considered, but rejected, a suggestion that there be a meeting with Shahar to discuss the matter. After the Attorney General returned he met with staffers. He reached the conclusion that the job offer should be withdrawn. In a meeting with staffers the structure of a \"termination meeting\" with Shahar was worked out. The Attorney General would not be present at the meeting. A designated staffer (accompanied by a witness) was to meet with Shahar, tell her that the offer to her was withdrawn. and deliver to her the termination letter (in sealed form). The messenger was instructed to make no additional comments and to tell Shahar if she had comments they should be addressed to the. Attorney General in writing. The staff member-spokesman prepared a written script of what he would say. Ironically, it concluded: \"Thanks again for coming in and have a nice day.\" The scenario was played out. Shahar asked to see the Attorney General and was told that he was unavailable.\n\nThe Attorney General and his staff acted in ignorance of the religious roots of the association that Shahar planned, the centrality of it to her faith, and the recognition of it by the religion to which she was committed. Staff members could recall no discussion of or inquiry into the religious aspects of the matter. The actions by the Attorney General do not meet the constitutional requirements of reasonableness.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nIf the Attorney General had made reasonable investigation this case might never have arisen. But not only did he make no further investigation, he closed the door to knowledge. It would have been easy to confer with Shahar, or have an assistant do so, and explore her desire to use the term \"marriage\" and his concern about this usage. If she had then explained that she used the term as recommended and accepted by her faith, the Attorney General, correctly enlightened, might have been satisfied. On the other hand, he might have rejected her explanation as insufficient to ameliorate his concerns. He might have explained to her his fear of possible impact on his office and could have explored with her ways in which she might disseminate knowledge of the religious nature of her intimate association. What we do know is that neither the Attorney General, nor the staff members on whom this court implies that he relied, made inquiry into the religious nature of her plans beyond the ambiguous or mistaken response from the single Jewish staff member of whom the Attorney General inquired. The Attorney General walled himself off, forbade comment or inquiry by staff members who met with Shahar, and terminated the agreement with Shahar on his erroneous perception of the association that she was asserting. Whatever his views about possible adverse effects on his office, he did not act reasonably.\n\nRespectfully, I dissent.\n\nKRAVITCH, Senior Circuit Judge, dissenting, in which BARKETT, Circuit Judge, and GODBOLD, Senior Circuit Judge, join:\n\nI adhere to the view, previously expressed in my opinion in the now-vacated panel decision of this case, that the district court: (1) correctly recognized that Shahar's relationship with her partner qualifies as a protected intimate association under the First Amendment; and (2) erroneously concluded that, on the record of this case, Bowers's legitimate interests as a public employer outweighed Shahar's constitutionally-recognized, associational interests. Accordingly, I dissent from the en banc court's affirmance of the district court's grant of summary judgment to Bowers.\n\nI begin by noting what this case does not concern. It does not involve a claim that homosexuals have a constitutional right to marry in the civil or legal sense. Shahar used words, such as \"marriage\" and \"wedding\", in a generic, not a legalistic, sense when she described her relationship with her partner.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Due to her religious beliefs, these words also took on a spiritual character for Shahar, but she never contested her ineligibility for the legal benefits of a civil marriage under Georgia law. As a result, the court is not called, as the en banc majority implies in Footnote 2 of its opinion, to engage the \"constitutional controversy\" over the \"institution of marriage.\"\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nThe first issue properly before the court is whether Shahar's relationship with her partner qualifies as an intimate association under the Constitution. The Supreme Court has held \"that the First Amendment protects those relationships, including family relationships, that presuppose \"deep attachments and commitments to the necessarily few other individuals with whom one shares a special community of thoughts, experiences, and beliefs but also distinctively personal aspects of one's life.\" Bd. of Directors of Rotary Int'l v. Rotary Club, 481 U.S. 537, 545, 107 S. Ct. 1940, 95 L. Ed. 2d 474 (1987) (quoting Roberts v. United States Jaycees, 468 U.S. 609, 619-20, 104 S. Ct. 3244, 82 L. Ed. 2d 462 (1984)). This court has applied the intimate association doctrine expansively to cover not only well-established familial bonds, but also dating couples. See Wilson v. Taylor, 733 F.2d 1539 (1 1th Cir.1984) (ruling that non-marital relationship between police officer and daughter of reputed, organized crime figure is protected intimate association). Shahar's relationship with her partner satisfies the Supreme Court's definition of an intimate association in that it is characterized by \"relative smallness, a high degree of selectivity in decisions to begin and maintain an affiliation, and seclusion from others in critical aspects of the relationship.\" Roberts, 468 U.S. at 620. In light of this court's ruling in Wilson and the Supreme Court's ruling in Roberts, I conclude that Shahar's relationship with her partner qualifies as a protected intimate association under the First Amendment.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nI agree with the en banc majority that the right of intimate association is not absolute, and that in the public employment context adverse actions which implicate intimate associational interests should be reviewed pursuant to the balancing test first enunciated in Pickering v. Bd. of Educ., 391 U.S. 563, 88 S. Ct. 1731, 20 L. Ed. 2d 811 (1968). See Stough v. Gallagher, 967 F.2d 1523, 1527 (11th Cir.1992) (ruling that under Pickering \"courts must balance the [protected First Amendment] interests of the public employees as citizens ... and the interest of the 'State as an employer, in promoting the efficiency of the public services it performs through its employees'\" (quoting Pickering, 391 U.S. at 568)). In my view, however, the en banc majority has employed a balancing test in name only.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e The en banc majority's opinion devotes paragraph after paragraph to Bowers's interests, but gives short shrift to Shahar's intimate associational interests. In contrast, Judge Godbold's dissenting opinion eloquently relates the sincerity and depth of feeling which underlies Shahar's connection to her partner. Because the association in question falls close to the familial end of the continuum of human relationships, I conclude that Shahar's interests weigh heavily in the Pickering balance. See Roberts, 468 U.S. at 620 (contrasting family ties with large business enterprises in observing that various associational bonds support \"greater and lesser claims to constitutional protection\").\n\nOn the other side of the balance, the en banc majority first considers Bowers's interests in the internal workings of his office. Bowers has not asserted that Shahar's association caused any actual disruption of the functioning of his staff. Instead, Bowers has forecast that Shahar's presence will undermine morale and create divisions within the Georgia Department of Law because some employees will view her association as a political statement inconsistent with state laws that the Department must enforce. The en banc majority correctly notes that courts must give \"substantial weight to government employers' reasonable predictions of disruption ....\" Waters v. Churchill 511 U.S. 661, 114 S. Ct. 1878, 1887, 128 L. Ed. 2d 686 (1994). The Supreme Court, however, has rejected the notion that courts must accept blindly all claims of harm conjured by government employers:\n\nOn the other hand, we do not believe that the court must apply the [balancing] test only to the facts as the employer thought them to be, without considering the reasonableness of the employer's conclusions. Even in situations where courts have recognized the special expertise and special needs of certain decisionmakers, the deference to their conclusions has never been complete.... We think employer decisionmaking will not be unduly burdened by having courts look to the facts as the employer reasonably found them to be. It may be unreasonable, for example, for the employer to come to a conclusion based on no evidence at all. Likewise, it may be unreasonable for an employer to act based on extremely weak evidence when strong evidence is clearly available--if, for instance, an employee is accused of writing an improper letter to the editor, and instead of just reading the letter, the employer decides what it said based on unreliable hearsay.\n\nId. at 1889 (emphasis in original).\n\nTo the extent Bowers concluded Shahar would disrupt the office because her relationship could be interpreted as a political statement, he did not act reasonably. Shahar's association with her partner, although not secret, was private. Shahar's religious marriage ceremony was by invitation and was held in another state. It was neither announced in the newspapers, nor otherwise reported publicly.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Further, Shahar never claimed she had contracted a legal marriage, nor did she challenge her legal ineligibility for civil marriage. Bowers could and should have ascertained all of these facts before he took action against Shahar. Instead, as Judge Godbold notes in his dissent, Bowers categorically refused to discuss his purported concerns with Shahar. Finally, the record confirms that Bowers had no factual basis to believe Shahar had violated the law or advocated violations of law.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e Because Bowers failed to act reasonably, under Waters, his predictions regarding intra-office strife do not weigh very heavily in the balance.\n\nBowers's other main justification for his action centers around his fear of negative public reaction to his hiring of Shahar. Although public confidence certainly is a relevant concern for Bowers, it is important to note that catering to private prejudice is not a legitimate government interest. See City of Cleburne v. Cleburne Living Center, 473 U.S. 432, 448, 105 S. Ct. 3249, 87 L. Ed. 2d 313 (1985); Palmore v. Sidoti, 466 U.S. 429, 433, 104 S. Ct. 1879, 80 L. Ed. 2d 421 (1984). The en banc majority attempts to justify its emphasis on anticipated public hostility by pointing to McMullen v. Carson, 754 F.2d 936 (11th Cir.1985), a case in which this court considered public reaction to the presence of a Ku Klux Klan recruiter in a sheriff's office in affirming a governmental employment decision. McMullen, however, bears no relationship to this case.\n\nFirst, unlike McMullen, where the employee publicized his association with the Klan on a television news broadcast, in this case, Shahar did not make any public statements. Further, the sheriff's decision in McMullen was not simply based on his prediction that the public would be biased against the Klan-affiliated employee. Rather, the record established that \" violent racism has become the Klan's trademark ... [that] divisive, confrontational tactics are used by the Klan during periods of racial unrest in order to promote recruitment [and that] those tactics are still being used in Florida.\" McMullen, 754 F.2d at 938 (emphasis added). The sheriff and the community thus reasonably could conclude that the Klan recruiter sanctioned such inflammatory, often illegal, activities. In contrast, Bowers simply baldly asserted that public reaction to Shahar's pending employment with his office would have prevented him from serving the state effectively. In light of the Klan's undisputed history of criminal violence, public reaction in McMullen was not only more certain, but also likely would have been more severe than anything which reasonably might have been projected in this case. Finally, although public concern over the Klan's criminally violent activities is a legitimate basis for governmental action, the Supreme Court has now held that animosity toward gay people is an illegitimate purpose for state policy, and thus, to prevail in the balancing of interests, Bowers must cite more than perceived, public distaste for homosexuals. See generally Romer v. Evans, U.S., 116 S. Ct. 1620, 1629, 134 L. Ed. 2d 855 (1996).\n\nThe foregoing analysis leads me to conclude that, on the record of this case, Shahar's constitutional interest in pursuing her intimate association with her partner outweighs any threat to the operation of the Georgia Department of Law. Accordingly, I would reverse the district court's order granting summary judgment against Shahar.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e For these reasons, I respectfully dissent.\n\nBIRCH, Circuit Judge, dissenting, in which BARKETT, Circuit Judge, GODBOLD and KRAVITCH, Senior Circuit Judges, join:\n\nI respectfully dissent. Shahar's relationship with her partner qualifies as a protected intimate association under the First Amendment for the reasons set out in Judge Kravitch's dissent, pages 2-3. I agree with both the majority and dissent that, in a government employment context, the Pickering balancing test is the appropriate test for reviewing official action which implicates First Amendment intimate associational rights. See Pickering v. Board of Educ., 391 U.S. 563, 88 S. Ct. 1731, 20 L. Ed. 2d 811 (1968). I might have found the majority's application of the Pickering balancing test more convincing were it not for the Supreme Court's recent decision in Romer v. Evans, U.S., 116 S. Ct. 1620, 134 L. Ed. 2d 855 (1996). In my opinion, the Court's recognition in Romer that homosexuals, as a class, are entitled to some protection under the Equal Protection Clause bears on the validity--and therefore the weight in applying the Pickering balancing test--of Bowers's justifications for his action. With Romer in the balance, the scales tip decidedly in favor of Shahar because Bowers's asserted interests are not a legitimate basis for infringing Shahar's constitutionally-protected right of intimate association. For this reason, I dissent from the en banc court's affirmance of the district court's order granting summary judgment to Bowers.\n\nIn Romer, the Supreme Court held that a Colorado constitutional amendment which discriminates against homosexuals does not pass constitutional muster. Romer, U.S. at, 116 S. Ct. at 1627. The Court did not decide the issue of whether homosexuals constitute a suspect class because the Colorado law which was at issue in Romer failed even under the rational basis inquiry. See id. at 1627. The import of Romer, however, is to elucidate what the Supreme Court considers not to be a rational basis for discrimination against homosexuals.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e The state argued that the rationale for the law included \"respect for other citizens' freedom of association, and in particular the liberties of landlords or employers who have personal or religious objections to homosexuality.\" Id. at 1629. Over a vigorous dissent by Justice Scalia, a six-justice majority of the Court rejected the state's rationale, declaring that \"animosity toward the class\" of homosexuals is not a legitimate basis for state action. Id. at 1628; see id. at 1629 (Scalia, J., dissenting) (\"In holding that homosexuality cannot be singled out for disfavorable treatment, the Court ... places the prestige of this institution behind the proposition that opposition to homosexuality is as reprehensible as racial or religious bias.\"). I am compelled to conclude that the Court's pronouncement in Romer must inform our consideration of Shahar's intimate association claim.\n\nThe Pickering balance in this case requires us to measure Shahar's right of intimate association against Bowers's asserted interests in infringing that right in the context of an employment relationship. The weight we accord to Bowers's asserted interests, however, hinges entirely on the reasonableness of his predictions as to how Shahar's homosexual relationship might affect or disrupt the Attorney General's office, see Waters v. Churchill, 511 U.S. 661, 114 S. Ct. 1878, 1889, 128 L. Ed. 2d 686 (1994); significantly, it is undisputed that Bowers has made no showing of actual disruption to the office. When we closely examine these predictions, we discover that each one is based on a series of assumptions and unsupported inferences about Shahar because of her status as a homosexual.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e I cannot agree with the majority that these inferences and assumptions constitute a legitimate state interest to discriminate against Shahar in light of the Supreme Court's teaching just last term that mere \"animosity toward the class\" of homosexuals is not a rational basis for state action. Romer, U.S. at, 116 S. Ct. at 1628.\n\nThe first inference that Bowers drew from Shahar's status as a lesbian who married\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e another woman is that the public might be hostile to her participation in a same-sex marriage and might view Shahar's employment by his Department as inconsistent with Georgia law. Bowers argued in his brief that \"the public perception is that \"the natural consequence of a marriage is some sort of sexual conduct... and if it's homosexual, it would have to be sodomy.' \" Appellee's Panel Brief at 10-11 (quoting Bowers Dep. at 80-81).\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e As the Supreme Court made clear in Palmore v. Sidoti, 466 U.S. 429, 104 S. Ct. 1879, 80 L. Ed. 2d 421 (1984), the government may not transform private biases into legitimate state interests by relying on the prejudices of the public.\n\nPrivate biases may be outside the reach of the law, but the law cannot, directly or indirectly, give them effect. \"Public officials sworn to uphold the Constitution may not avoid a constitutional duty by bowing to the hypothetical effects of private ... prejudice that they assume to be both widely and deeply held.\"\n\nId. at 433 (quoting Palmer v. Thompson, 403 U.S. 217, 260-61, 91 S. Ct. 1940, 29 L. Ed. 2d 438 (1971) (White, J., dissenting)); see also City of Cleburne v. Cleburne Living Ctr., 473 U.S. 432, 448, 105 S. Ct. 3249, 87 L. Ed. 2d 313 (1985) (applying the principle of Palmore to government action reviewed under the rational basis test).\n\nIn applying the principle of Palmore to this case, the key question is not whether the government official reasonably could assume that the public might have a negative reaction to the employee's presence; it is whether the public's perception upon which the official relies is itself a legitimate basis for government action. If the public's perception is borne of no more than unsupported assumptions and stereotypes, it is irrational and cannot serve as the basis of legitimate government action.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e In this instance, the public's (alleged) blanket assumption that \"if it's homosexual, it would have to be sodomy\" is based not on anything set forth in the record but rather on public stereotyping and animosity toward homosexuals. Under the principles articulated in Romer, this does not provide the state with a legitimate, rational basis to discriminate against Shahar. Bowers's \"concern\" for the public's perception of homosexuals, therefore, is entitled to no weight in balancing Shahar's right of intimate association.\n\nBowers also asserts an interest in dismissing Shahar under the broad rubric of concern for the internal workings of his office. Bowers advances two main arguments in support of this interest: (1) Shahar's conduct might undermine the \"morale\" of the office because some employees might view her conduct as a political statement inconsistent with Georgia's laws criminalizing sodomy and denying public benefits to couples engaged in same-sex marriages; and (2) as Attorney General, Bowers is justified in assuming not only that Shahar would violate Georgia law by committing sodomy but, moreover, that she necessarily would have a conflict of interest with respect to certain types of controversial cases involving sodomy or benefits for same-sex partners.\n\nBowers's argument with respect to the alleged deleterious effect of Shahar's status and conduct on \"morale\" within the office is another attempt to legitimize his adverse action against Shahar on the basis of inferences that others--here, his employees--might derive from her status as a lesbian. The inferences from Shahar's acknowledged homosexuality that she is likely to violate Georgia's sodomy law, or would be unable or unwilling to enforce Georgia's sodomy or marriage laws, is no more justified on behalf of Bowers or his employees than it is on behalf of the public. Moreover, it is important to note that Bowers's speculation regarding Shahar's ability to handle certain types of cases is just that: speculation. Bowers has emphatically refused to meet with Shahar to discuss any of his concerns. Compounding this deficiency in Bowers's assertion that his prediction is \"reasonable\" is the fact that Bowers does not make the same assumption with respect to any of his other employees: He does not assume, for instance, that an unmarried employee who is openly dating an individual of the opposite sex has likely committed fornication,\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e a criminal offense in Georgia, and thus may have a potential conflict in enforcing the fornication law. Nor, for that matter, does he apparently assume that married employees could well have committed sodomy--i.e., oral or anal sex, see O.C.G.A. § 16-6-2-- and could themselves have a potential conflict in enforcing Georgia's sodomy law.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nIn short, Bowers's asserted interests in taking adverse action against Shahar are based on inferences from her status as a homosexual which Bowers claims that he, the public, and department staff are entitled to make. In light of the Supreme Court's decision in Romer, these status-based inferences, unsupported by any facts in the record and explained only by animosity toward and stereotyping of homosexuals, do not constitute a legitimate interest that outweighs Shahar's First Amendment right of intimate association. Accordingly, I would reverse the district court's order granting summary judgment to Bowers.\n\nBARKETT, Circuit Judge, dissenting, in which GODBOLD and KRAVITCH, Senior Circuit Judges, join:\n\nThe majority opinion does not meet the constitutionally required process for determining when the government as employer may curtail a public employee's First Amendment rights. It departs not only from Supreme Court precedent establishing that process, but from this circuit's precedent in applying the process to analogous factual contexts.\n\nSince Pickering, the Supreme Court and several circuits (including this one) have applied its principles in several First Amendment contexts, including privacy,\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e free exercise of religion,\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e and freedom of association.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e These cases make clear that while the balancing test is easier for the government to satisfy than the strict scrutiny standard used in the non-employment context, it still affords significant protection from unwarranted government intrusion into an employee's First Amendment interests.\n\nAs Judge Godbold and Judge Kravitch so clearly demonstrate, notwithstanding its references to the Pickering test, the majority simply fails to apply the test in the instant case. Instead, the majority permits a government employer to support termination decisions predicated on the employee's exercise of First Amendment rights with only a minimal and totally subjective rationale and without considering the rights of the employee in the balance. In effect, the majority grants overwhelming, if not complete, deference to the Attorney General's subjective views. See Majority Op. at [27] (\"Whatever our individual, personal estimates might be, we ... cannot say that the Attorney General's worries and view of the circumstances that led him to take the adverse personnel action against Shahar are beyond the broad range of reasonable assessments of the facts.\"); Majority Op. At [42] \"(\"We must defer to Georgia Attorney General's judgment about what Georgians might perceive unless his judgment is definitely outside of the broad range of reasonable views.\").\n\nThe only purported support offered by the majority for its wholesale restructuring of Pickering appears to be its reading of the plurality opinion in Waters v. Churchill, 511 U.S. 661, 114 S. Ct. 1878, 128 L. Ed. 2d 686 (1994). However, the sole issue in Waters was \"whether the Connick test should be applied to what the government employer thought was said, or to what the trier of fact ultimately determines to have been said.\" Id. at 1884 (emphasis added). Thus it simply addressed the method for resolving factual disputes as to whether the affected employee engaged in protected conduct.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Indeed, the Court's reasoning in Waters supports Shahar's position. The Court held that the facts as found by the employer after \"objectively reasonable investigation\" should establish whether the conduct (in that case, speech) was constitutionally protected. Id. at 1892 (Souter, J., concurring, summarizing plurality opinion) (emphasis added). Waters asserts Pickering 's principles and reiterates the necessity for constitutionally enforced processes to protect the rights of government employees.\n\nThe Pickering test necessitates a careful, fact-intensive, structured inquiry to \"balance the interests of the public employees, as citizens\" in engaging in expression, \"and the interest of the State as an employer, in promoting the efficiency of the public services it performs through its employees.\" Stough v. Gallagher, 967 F.2d 1523, 1527 (11th Cir.1992)(internal quotations omitted). In granting overwhelming deference to an employer's subjective decision to terminate, the majority ignores a well developed body of circuit precedent that applies the Pickering balancing test in analogous law enforcement contexts and establishes a workable balance between the employee's exercise of First Amendment rights and measured deference to law enforcement officials. See Stough, 967 F.2d at 1523; McCabe v. Sharrett, 12 F.3d 1558 (11th Cir.1994); Waters v. Chaffin, 684 F.2d 833 (11th Cir.1982); McMullen v. Carson, 754 F.2d 936 (11th Cir.1985).\n\nStough involved a § 1983 suit where a newly elected sheriff was sued after demoting a police officer who had campaigned for another candidate. On appeal, in balancing the competing interests, the court noted that the officer had engaged in political speech which deserves \"special protection\" from the First Amendment, that the officer had spoken during his off-duty hours, and that the expressions were not rude or insulting. Stough, 967 F.2d at 1529. The court also noted the absence of actual evidence that the expression adversely affected the sheriff's work environment, and the fact that the sheriff had previously indicated that personal loyalty was not a prerequisite for the affected officer's job. Id. at 1529.\n\nIn McCabe, the issue was whether a police chief could permissibly transfer a personal secretary who married a lower-level police officer. The court indicated that, under Pickering, \"the employer's interest will weigh more heavily in the Pickering balance the more closely the challenged employment action serves the employer's interest in the efficient and effective functioning of the office.\" McCabe, 12 F.3d at 1570. The court noted that the police chief produced substantial evidence that \"loyalty and keeping confidences are required for proper performance of the job\" from which the personal secretary was transferred and his concerns about possible disloyalty were not merely subjective fears, but \"objectively reasonable\" as a matter of common experience. Id. at 1571-73. Thus, the court afforded no deference to the police chief's view, and conducted its balancing based on an objective assessment.\n\nIn Waters v. Chaffin, the court considered whether a police chief could discipline a subordinate police officer for criticizing him in an off-duty conversation with another police officer. The court noted that the fact that \"the employee who speaks out is a police officer does not mean that the balance is always struck in favor of the state. 'Policemen, like teachers and lawyers, are not relegated to a watered-down version of constitutional rights.' \" Id. at 836 (quoting Garrity v. New Jersey, 385 U.S. 493, 500, 87 S. Ct. 616, 17 L. Ed. 2d 562 (1967)) (emphasis added). Although the court recognized that the law enforcement context justified allowing a police chief to act on reasonable predictions of harm, rather than actual evidence of harm, it also indicated that this rule is less appropriate when the chief officer and the affected officer do not work closely together, stating that \"we will not allow a generalized concern to overshadow the realities of the case.\" Chaffin, 684 F.2d at 839-40. In addition, the court gave added weight to the fact that the subordinate's expression occurred off-duty. Id. at 837-38.\n\nFinally, as Judge Kravitch describes, the McMullen court considered whether a police chief could fire a low-level at-will clerical employee in the wake of strong community protests following an employee's announcement on television that he was a recruiter for the Ku Klux Klan. In weighing the balance of interests, the court noted the uncontradicted evidence that black citizens would categorically distrust the sheriff's office if a known Klan member were allowed to remain on staff, and that the sheriff had \"no less restrictive means of dealing with the problem.\" McMullen, 754 F.2d at 939. The court also noted that public perception of the Klan as a violent racist group was based on the reality of the Klan's history, and that absent immediate action on the sheriff's part, \"serious conflict was almost certain to occur.\" Id. at 938-39. The court then conducted an \"independent and complete review of the record,\" affording special weight to the task of a law enforcement agency, but not to the sheriff's assessment of what was reasonable. Id. at 940. After conducting this review the court concluded that:\n\nthe reaction of a community cannot always dictate constitutional protections to employees. We hold only that a law enforcement agency does not violate the First Amendment by discharging an employee whose active participation in an organization with a history of violent activity, which is antithetical to enforcement of the laws by state officers, has become known to the public and created an understandably adverse public reaction that seriously and dangerously threatens to cripple the ability of the law enforcement agency to perform effectively its public duties.\n\nId. at 940.\n\nInstead of relying on the holdings in these cases, the majority references McMullen, Sims v. Metropolitan Dade County, 972 F.2d 1230 (11th Cir.1992), Kinsey v. Salado Independent School Dist., 950 F.2d 988 (5th Cir.1992) (en banc), Bates v. Hunt, 3 F.3d 374 (11th Cir.1993), and Pickering generally for the proposition that \"government employees who have access to their employer's confidences or who act as spokespersons for their employers, as well as those employees with some policy-making role, are in a special class of employees and might seldom prevail under the First Amendment in keeping their jobs when they conflict with their employers.\" Majority Op. at [19]. However, the cases cited by the majority simply do not support this proposition.\n\nFrom McMullen, the majority draws the conclusion that a law enforcement official may act based on public perception and anticipated effect. But the majority ignores the fact that the McMullen court's conjectures about future harm were based on present, actual adverse public reaction to the affected employee's conduct. It also disregards the importance McMullen places on assessing the validity of public perceptions and the nature of the effect those perceptions would have on law enforcement. Indeed, McMullen supports the proposition that a government official cannot hide behind public perception as a means to enforce private prejudice. See also Palmore v. Sidoti, 466 U.S. 429, 433, 104 S. Ct. 1879, 80 L. Ed. 2d 421 (1984)(\"Private biases may be outside the reach of the law, but the law cannot, directly or indirectly, give them effect.\").\n\nSims addressed the question of the quantum of evidence necessary to overcome qualified immunity with a Pickering -based claim. See Sims, 972 F.2d at 1236. Because an individual seeking to overcome qualified immunity must show that an official has violated clearly established law, the Sims majority held that the plaintiff in that case had to make the extraordinary showing that \" Pickering balancing would lead to the inevitable conclusion that the discharge of the employee was unlawful.\" Id. at 1237. To the extent that Sims is even relevant in other contexts, it does not stand for the broad proposition offered by the majority, since the case states only that \"when the employee serves in a sensitive capacity that requires extensive public contact, the employee's private speech may pose a substantial danger to the agency's successful functioning.\" Id. This assertion, of course, should not be shorn from its context--namely, a case in which the Pickering analysis was purposefully conducted with a \"thumb\" on the government side of the scale because of the plaintiff's extraordinary burden in overcoming qualified immunity, an issue not on appeal in this case.\n\nKinsey v. Salado Indep. School Dist., 950 F.2d 988 (5th Cir.1992) (en banc ), is also largely inapposite, as that Fifth Circuit case involved the authority of a school board to remove the superintendent of schools, a position second only to the school board itself in terms of policy-making authority. More particularly, Kinsey involved a conflict of political affiliation between the two highest ranking education policy makers in the county. It thus cannot be read as support for the notion that \"employees with some policy-making role ... are in a special class of employees and might seldom prevail under the First Amendment,\" Majority Op. at [19] (emphasis added).\n\nThe final case cited by the majority is Bates v. Hunt, 3 F.3d 374 (11th Cir.1993). Bates arose from the decision of the Alabama Governor to fire an at-will political appointee in his Office of Constituent Affairs for signing an affidavit supporting a disgruntled former employee who had sued the Governor. The court determined that the essence of the appointee's job was to speak and act as a delegate of the Governor to his constituents. Bates, 3 F.3d at 378. Concluding that the Governor was not required to let an adversary represent him, the court found that the Governor's discharge of the appointee did not unconstitutionally burden the appointee's speech rights. As in Kinsey, the court in Bates tightly connected the particular job functions of the affected employee to the grounds for dismissal, a task the majority here ignores.\n\nThe political affiliation case law from the Supreme Court and this circuit simply cannot support the majority's broad assertion that government employees with \"some policy-making role\" enjoy only minimal job security when \"they conflict with their employers.\" Majority Op. at [19-20]. In the leading political affiliation case, Branti v. Finkel, 445 U.S. 507, 100 S. Ct. 1287, 63 L. Ed. 2d 574 (1980), the Supreme Court squarely rejected a chief public defender's attempt to terminate two disfavored assistant public defenders because they held confidential policy-making positions. In so ruling, the Court stated that \"the ultimate inquiry is not whether the label 'policy maker' or 'confidential' fits a particular position; rather, the question is whether the hiring authority can demonstrate that party affiliation is an appropriate requirement for the effective performance of the public office involved.\" Branti, 445 U.S. at 518.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Drawing an analogy to the current context, Branti teaches that the ultimate inquiry for balancing purposes is not the nature of the job Shahar was assigned to, but whether the Attorney General can demonstrate that Shahar's intimate association hinders her ability to perform effectively the job of a staff attorney. The majority never considers how Shahar's relatively low status in the Attorney General's Office affects the balance, but instead implicitly treats all of the attorneys in the office as having equal responsibilities. It also overlooks the analysis of the district court in the Branti decision, which suggests that an assistant attorney's exercise of policy-making authority and access to confidential information is not always of the sort that lessens his or her protected interests. See supra note 5.\n\nAdditionally, in the absence of any record evidence of \"weighing\" or \"balancing\" by the Attorney General, the majority attempts to provide after-the-fact reasons to support Bowers's side of the scale. Referencing a controversy in Georgia over issues related to homosexuality and \"the Attorney General's involvement at the heart of that controversy \" (Majority Op. at [24 n. 16])(emphasis added), the majority cites to four state court decisions decided after Shahar's termination (three of which did not involve the Attorney General's office), and three short Attorney General opinion letters, also written after Shahar's termination. However, the majority fails to mention post-termination evidence of Shahar's apparently successful performance within the legal community as a staff lawyer for the City of Atlanta.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nSimilarly, the majority indicates that the public might reasonably conclude that Shahar engages in sodomy, and that such a belief would undermine the Department's efforts to enforce Georgia's \"laws against homosexual sodomy.\" Majority Op. at [25]. The relevant Georgia statute, however, does not define sodomy in terms of sexual orientation.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e The public cannot reasonably assume therefore that homosexuals in the Attorney General's office are more likely to engage in prohibited activity than any other member of that office.\n\nWhile overemphasizing the Attorney General's concerns in the Pickering balance, the majority also discounts Shahar's interests. The majority never expressly identifies Shahar's claims that she has kept her relationship with her partner a largely private and decidedly low-key matter, and that she has not engaged in any conduct which is at odds with Georgia law. See Majority Op. at [30-33.]\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Given the fact that it is not illegal in Georgia for two women to own a house in common, purchase insurance together or even exchange rings, it is difficult to understand how the fact that someone might discover these things could possibly affect the ability of the Attorney General to do his job effectively; the Attorney General is simply not charged with ensuring that his employees refrain from obtaining the blessing of their religious leaders prior to co-habitating in Georgia (which is essentially all Shahar has done).\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nFinally, I believe that the Attorney General has an evidentiary burden to offer credible predictions of harm or disruption based on more than mere speculation. The Attorney General's \"worry about his office being involved in litigation in which Shahar's special personal interest might appear to be in conflict with the State's position\" is simply not a reasonable basis upon which to expect disruption. First, the record contains no evidence that homosexual issues in general constitute a \"special personal interest\" for Shahar. Indeed, Shahar was intended for an assignment involving the review of death penalty cases. Moreover, even if Shahar has a \"special personal interest\" in homosexual rights, such an interest tells us nothing about its disruptiveness to her work environment. Surely the Attorney General's office has lawyers who have a \"special interest\" in any number of topics: abortion, school desegregation, affirmative-action or rights for the disabled, for instance. When those issues arise and the Attorney General is forced to take a view, some attorneys may personally disagree with that view and may even ask not to work on the matter, but that does not establish that those views have been disruptive to the office as a whole. Absent hard evidence, it is difficult to imagine a court upholding, for example, an Attorney General's assertion that he fired a black attorney because he believed (assumed?) that attorney's \"special interest\" in desegregated schools would prove disruptive to the office.\n\nFor these reasons, I respectfully dissent.\n\n\u003cspan class=\"fn\"\u003e* Honorable Phyllis A. Kravitch heard oral argument in this case on 23 October 1996 as a judge on active status. She took senior status on 31 December 1996 and has elected to participate in this decision pursuant to 28 U.S.C. § 46(c).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. For clarity's sake, we use the words \"marriage\" and \"wedding\" (in quotation marks) to refer to Shahar's relationship with her partner; we use the word marriage (absent quotation marks) to indicate legally recognized heterosexual marriage.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. These doubts are suggested by a variety of considerations, to state briefly a few: (1) where \"rights\" are not set out in the Constitution's text, we must be especially cautious about creating rights merely because they might seem like a good idea to us or because some part of the population believes them to be a good idea. See Bowers v. Hardwick, 478 U.S. 186, 106 S. Ct. 2841, 2846, 92 L. Ed. 2d 140 (1986) (\"The Court is most vulnerable and comes nearest to illegitimacy when it deals with judge-made constitutional law having little or no cognizable roots in the language or design of the Constitution.\"); (2) we are now in the two hundred and twenty-first year of the independence of the Nation and well over a century beyond the adoption of the Civil War Amendments, including the Fourteenth Amendment, to the Constitution, yet no federal appellate court or state supreme court has recognized the federal rights of same-sex marriage claimed by Plaintiff; (3) the institution of marriage has been the source before of constitutional controversy in which the challenge was made that the institution of marriage involved some combination other than one man and one woman. The advocates of polygamy, we assume, were no less sincere than the advocates of same-sex marriage, and they too had some religious arguments for their views. Yet, the Supreme Court repeatedly held that the Constitution provides no protection to polygamous marriages. See e.g., Reynolds v. United States, 98 U.S. 145, 166-167, 25 L. Ed. 244 (1878) (Free Exercise Clause does not require that \"those who make polygamy a part of their religion are excepted from the operation of the statute\" criminalizing polygamy).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Though the Bowen opinion was a plurality opinion, a majority of the Court joined in the portion of the opinion quoted above.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. When she was employed by the Department as a summer clerk and when she was offered a position with the Department, Shahar was known as \"Robin Brown.\" Following her \"wedding,\" she and her partner changed their last names to \"Shahar.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. \"To carry out the functions of the Attorney General and the Department of Law,\" section 45-15-30 of the Code of Georgia empowers the Attorney General to hire various subordinate lawyers within the Department. Section 45-15-31(a) provides that all such subordinate attorneys \"shall be appointed by the Attorney General for such periods of time as he deems advisable\" and \"may be removed by the Attorney General.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Greenfield was employed by a state university at the time.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. On appeal, Shahar does not contest the dismissal of her substantive due process claim.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Shahar moved for summary judgment on her freedom of association and free exercise claims.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The Supreme Court has identified the origin of the right to intimate association as First Amendment freedom of association. See Board of Dirs. of Rotary Intern. v. Rotary Club, 481 U.S. 537, 107 S. Ct. 1940, 1946, 95 L. Ed. 2d 474 (1987).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. In Dike, the district court had dismissed the teacher's complaint on the ground that no constitutionally protected interest was involved. The Dike court's actual holding was that she had stated a cause of action and that further proceedings were necessary. Id. at 785.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. In her concurring opinion when the case was before our three-judge panel, Judge Kravitch characterized the Dike opinion this way: \"nominally applying strict scrutiny to school board's burden on employee's liberty interest in breast-feeding her child, but remanding for reconsideration of whether school board's interest in avoiding disruption of educational process, ensuring that teachers perform their duties without distraction, and avoiding potential liability for accidents were strong enough to justify the burden.\" Shahar v. Bowers, 70 F.3d 1218, 1231 n. 11 (11th Cir.1995), vacated 78 F.3d 499 (1996). See also, 70 F.3d at 1231 (\"A survey of intimate association cases (and analogous privacy cases) in the context of employment reveals that courts, irrespective of the doctrinal test being applied, have consistently balanced the interest of the government employer in the efficient functioning of its office against the employee's interest in pursuing his or her constitutionally protected freedom.\") We agree that Dike, given the case's procedural posture on appeal, is not clear about what, if anything, it actually decides about the applicability of strict scrutiny--as opposed to balancing of interests--to government employment cases.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. For background, see Pickering v. Board of Board of Ed., 391 U.S. 563, 88 S. Ct. 1731, 1734, 20 L. Ed. 2d 811 (1968). The outcome of the Pickering balancing test is a question of law. See e.g., Connick v. Myers, 461 U.S. 138, 103 S. Ct. 1684, 1692 n. 10, 75 L. Ed. 2d 708 (1983).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. In Umbehr, the Court determined \"whether, and to what extent, the First Amendment protects independent contractors from the termination of at-will government contracts in retaliation for their exercise of the freedom of speech.\" 116 S. Ct. at 2345. Upon holding that the First Amendment protects contractors from such retaliatory termination, it then determined the relevant standard for deciding whether a government contractor's First Amendment rights had been violated.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. In Parks v. City of Warner Robins, 43 F.3d 609 (11th Cir.1995), we recently held that a government employee's termination (pursuant to an anti-nepotism policy) did not impose a \"significant burden\" on either her right to marry or her right to intimate association and, therefore, we reviewed the city's anti-nepotism policy (as applied to that employee) under the rational basis test. In so doing, we distinguished generally applicable legislative acts from ad hoc executive decisions: Unlike the legislative act embodied in Warner-Robins' anti-nepotism policy, however, the secretary's reassignment in McCabe [ v. Sharrett, 12 F.3d 1558 (1994) ] was a quintessentially executive act. See McKinney v. Pate, 20 F.3d 1550, 1557 n. 9 (11th Cir.1994) (en banc) (distinguishing executive acts, which \"characteristically apply to a limited number of persons\" and which \"typically arise from the ministerial or administrative activities of members of the executive branch\" from legislative acts, which \"generally apply to a larger segment of ... society\" and which include \"laws and broad-ranging executive regulations.\"). 43 F.3d at 613 n. 2. Nothing in this opinion is intended to disapprove Parks or to hint that it is no longer the law in this circuit for reviewing legislative acts.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Livas involved the termination of an assistant state's attorney for political patronage reasons and, accordingly, the Seventh Circuit analyzed that claim under the test developed by the Supreme Court for such cases. Though Shahar's case is not a political patronage case and does not trigger the precise same concerns as those cases, her case is analogous to Livas (and other political patronage cases involving prosecutors). That is, the chief attorney (at whatever level, for example, attorney general, district attorney) must have a faith and confidence in his professional legal staff that might not ordinarily be required in other areas of government employment. So, in balancing the parties' interests, the chief attorney must be given greater deference in his employment decisions than might be appropriate in other areas of government employment. See also Americanos v. Carter, 74 F.3d 138, 143 (7th Cir.1996) (deputy attorney general not entitled to protection where \"DAGs have the direct ability to implement the policies and goals of the AG\" and \"the legislature ... also felt that it was important for an AG to employ the legal staff of his or her own choosing\") (citing relevant statute); Monks v. Marlinga, 923 F.2d 423, 426 (6th Cir.1991) (per curiam) (assistant prosecuting attorney not entitled to protection as \"the job of assistant prosecutor is a policy-making position\"). Cf. Branti v. Finkel, 445 U.S. 507, 100 S. Ct. 1287, 1295 n. 13, 63 L. Ed. 2d 574 (1980)(observing that responsibilities of assistant public defender are \"in contrast to the broader public responsibilities of an official such as a prosecutor.\") At least before the Government Employee Rights Act of 1991, we, in our Title VII and Age Discrimination in Employment Act jurisprudence, held that assistant state attorneys and the like--lawyers who serve at the pleasure of their policy-making chief--were not employees protected by the statutes, but were members of the personal staff of the chief lawyer: the position is one of policy-making level, involving one who necessarily advises, and acts upon, the exercise of constitutional and legal powers of the chief's office. See e.g., EEOC v. Reno, 758 F.2d 581, 584 (11th Cir.1985) (assistant state attorney). See also Wall v. Coleman, 393 F. Supp. 826, 831 (S.D.Ga.1975) (\"As a matter of common knowledge and experience we know that [a district attorney] gets public credit for the good job done and impression made by his assistants and gets public criticism for the poor performance or impression made by his assistants. At election time he is judged by what he and his assistants have done.\"). This \"personal staff\" (to use Congress's words) idea embodies the general and traditional proposition that positions of confidentiality, policy-making or acting and speaking before others on behalf of the chief are truly different from other kinds of employment. This point is central to the case now before us. In deciding the present case, we put aside all other kinds of public employment; but, in doing so, we do not say today that other kinds of employment would necessarily lead to a different result.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. The controversy in the State of Georgia and the Attorney General's involvement at the heart of that controversy, both as the State's litigator and its legal advisor, have not let up since the Attorney General's 1991 decision to revoke the offer to Shahar. See In re R.E.W., 267 Ga. 62, 472 S.E.2d 295 (Ga.1996) (three-judge dissent from denial of certiorari to review court of appeal decision holding restriction on father's visitation rights inappropriate where based on his homosexual relationship); Christensen v. State, 266 Ga. 474, 468 S.E.2d 188, 190 (Ga.1996)(in case involving same-sex solicitation in public rest area, upholding--against challenge based on state constitution--statute criminalizing solicitation of sodomy); City of Atlanta v. McKinney, 265 Ga. 161, 454 S.E.2d 517, 521 (Ga.1995) (striking down portion of Atlanta ordinance mandating provision of benefits to registered \"Domestic Partners\"); Van Dyck v. Van Dyck, 262 Ga. 720, 425 S.E.2d 853 (Ga.1993) (live-in lover statute inapplicable to attempt to modify alimony where former spouse lived in meretricious same-sex relationship); Op. Atty. Gen 96-7, 1996 WL 180274 (Ga.A.G.) (Attorney General called on to advise whether state college newspaper may refuse to publish advertisements suggesting that homosexuals are not \"born gay\" and \"there is another way out\" and containing text which \"might be perceived to 'derogatorily describe homosexuals' \"); Op. Att'y Gen. 94-14 (1994 Ops. Att'y Gen. Ga. 32 (Darby 1994)) (Attorney General called on to advise Insurance Commissioner as to approval of proposed policy amendment affording group accident and health coverage to \"domestic partners\"); Op. Att'y Gen. 93-26 (1993 Ops. Att'y Gen. Ga. 72 (Darby 1993)) (Attorney General called on to advise Insurance Commissioner regarding \"group health insurance provided pursuant to municipal ordinances which create the status of domestic partnership\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. About public perception, we accept that the fact the Shahars are professed lesbians and see themselves as \"married\" does not prove beyond reasonable doubt that either of them has engaged in sodomy within the meaning of Georgia law. But we also accept that, when two people say of themselves that they are \"married\" to each other, it is reasonable for others to think those two people engage in marital relations. A United States Circuit Judge in another circuit has written: \"Sodomy is an act basic to homosexuality.\" See Watkins v. U.S. Army, 847 F.2d 1329, 1357 (9th Cir.1988) (Reinhardt, J., dissenting), vacated, 875 F.2d 699 (1989). We cannot say that Georgia's Attorney General is clearly wrong to worry that reasonable people--inside and outside the Law Department--in Georgia could think along these same lines. Whatever else may be doubted about Georgia's sodomy law, we know that its application to homosexual sodomy violates no fundamental liberty interest protected by the Federal Constitution because the Supreme Court has already so held. See Bowers v. Hardwick, 478 U.S. 186, 106 S. Ct. 2841, 2846-47, 92 L. Ed. 2d 140 (1986). See also Id. at 2842 n. 2 (\"We express no opinion on the constitutionality of the Georgia statute as applied to other acts of sodomy.\"). We acknowledge that some reasonable persons may suspect that having a Staff Attorney who is part of a same-sex \"marriage\" is the same thing as having a Staff Attorney who violates the State's law against homosexual sodomy. So, we accept that Shahar's participation in a same-sex \"wedding\" and \"marriage\" could undermine confidence about the Attorney General's commitment to enforce the State's law against homosexual sodomy (or laws limiting marriage and marriage benefits to traditional marriages). Shahar has tried to analogize this case (specifically, the Attorney General's concerns about Shahar's \"marriage\") to miscegenation cases. Particularly given the obvious difference between concerns about public perception about miscegenation--which cannot constitute a legitimate governmental interest, see Loving v. Virginia, 388 U.S. 1, 87 S. Ct. 1817, 1823, 18 L. Ed. 2d 1010 (1967)--and concerns about public perceptions about whether a Staff Attorney in the Attorney General's office is engaged in an ongoing violation of criminal laws against homosexual sodomy--which laws the Supreme Court has said are valid, see Bowers, 106 S. Ct. at 2846-47, we believe that the analogy is not helpful to decide this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Shahar was notified of the withdrawal of her employment offer at a face-to-face meeting not with the Attorney General, but with two of his senior aides. The withdrawal of the offer was set out in writing in a letter signed by the Attorney General which was handed to Shahar at this meeting. The Attorney General did not meet with Shahar before he withdrew his offer. He acted based on the information supplied to him from his trusted aides who had spoken directly with Shahar--by telephone or in person--about her intent to \"marry\" a woman and from aides who had seen her job application in which she had, in writing, described a woman as her \"future spouse.\" The decisive information that Shahar intended, in a religious celebration, to \"marry\" a woman and then to be known herself as a \"married\" woman was not erroneous. We cannot say that the Attorney General acted unreasonably in relying on this information or in acting without his having spoken personally with Shahar. See generally Waters v. Churchill, 511 U.S. 661, 114 S. Ct. 1878, 128 L. Ed. 2d 686 (1994). See also Dartland v. Metropolitan Dade County, 866 F.2d 1321, 1323 (11th Cir.1989). As we see it, the Attorney General's not having met with Shahar is inconsequential to the Pickering balance.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. We are not the first court to assume the existence of a right and, then, to go on to apply the Pickering balancing test, taking into account the assumed right. See e.g. Kemp v. State Bd. of Agric., 803 P.2d 498, 505 (Colo.1990) (en banc), cert. denied, 501 U.S. 1205, 111 S. Ct. 2798, 115 L. Ed. 2d 972 (1991) (\"Even assuming that [the employee's] right to petition was implicated, the Pickering/Connick balancing test is equally applicable in deciding whether the state's interest as an employer outweighs the First Amendment interest of the employee.\"); Barnard v. Jackson Cty., 43 F.3d 1218, 1223 (8th Cir.1995) (\"Because we believe that the second component of the above test resolves the issues regarding Barnard's contacts with the Star, we assume without deciding that Barnard's speech with the Star touched upon matters of public concern, and we proceed to the Pickering balancing test.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Under Georgia law, a person desiring a name change must \"present a petition to the superior court of the county of his residence, setting forth fully and particularly the reasons why the change is asked...\" O.C.G.A § 19-12-1(a). \"Within seven days of the filing of the petition, the petitioner shall cause a notice of the filing, signed by him, to be published in the official legal organ of the county once a week for four weeks.\" O.C.G.A § 19-12-1(b).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. We recognize that some of these acts (the exchange of rings, the insurance and property ownership) may not have been known by the Attorney General when he decided to withdraw Shahar's job offer. We can still consider them. First, these additional facts do not change the reason--Shahar's \"wedding\" and \"marriage\"--for the withdrawal of the job offer. Second, in balancing the Attorney General's interests with Shahar's, the facts of Shahar's subsequent conduct are evidence of the reasonableness of the Attorney General's concerns (about potential public knowledge and perception) at the time he made his decision. By the way, Shahar has requested \"reinstatement\" as part of her \"relief.\" \"After-acquired evidence\" can be especially relevant in that context. McKennon v. Nashville Banner Publ. Co., 513 U.S. 352, 115 S. Ct. 879, 886, 130 L. Ed. 2d 852 (1993).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. The Supreme Court later cited McMullen with approval, in Rankin v. McPherson, 483 U.S. 378, 107 S. Ct. 2,891 n. 18, 97 L. Ed. 2d 315 (1987), as follows: This is not to say that clerical employees are insulated from discharge where their speech, taking the acknowledged factors into account, truly injures the public interest in the effective functioning of the public employer. Cf. McMullen v. Carson, 754 F.2d 936 (C.A.11 1985) (clerical employee in sheriff's office properly discharged for stating on television news that he was an employee for the sheriff's office and a recruiter for the Ku Klux Klan).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. About perceptions, we wrote these words: \"Although the Invisible Empire is just one of the various Klan organizations in the country, the public makes no distinctions in its perception of the Klan as a monolithic entity.\" McMullen, 754 F.2d at 938 (emphasis added). We also said this about the employer's duty to wait for events to unfold: \"Plaintiff suggests Sheriff Carson acted too swiftly, that actual public perception should have been tested before taking any action. Carson responded that based on his 27 years of experience with the Jacksonville Sheriff's Office, he knew all too well what the reaction would be ... There was no reason for Carson to wait in this type of situation.\" Id. at 939.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. The Attorney General's sense that Georgia's people, in general, are set against equating in some way a relationship between persons of the same sex with traditional marriage seems to have been corroborated by O.C.G.A. § 19-3-3.1 (prohibiting same-sex marriage) and by 1 U.S.C § 7 (defining marriage as consisting of a man and a woman) and 28 U.S.C. § 1738C (giving states the power to refuse to recognize same-sex marriages entered into in other states). The federal statutes became law with the support of both of Georgia's senators and ten of Georgia's twelve Members of the House of Representatives and were sponsored by a Georgia Member of the House of Representatives.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. We also note that in deciding Romer, the Court did not overrule or disapprove (or even mention) Bowers v. Hardwick, 478 U.S. 186, 106 S. Ct. 2841, 92 L. Ed. 2d 140 (1986), which was similarly about conduct in that it held that the State of Georgia did not violate \"substantive due process\" in prosecuting homosexual sodomy as a crime.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Neither Romer nor any other case in which a state government (acting as sovereign) violated the Equal Protection Clause of the Fourteenth Amendment by giving effect to private prejudice, see e.g. Palmore v. Sidoti, 466 U.S. 429, 104 S. Ct. 1879, 80 L. Ed. 2d 421 (1984), convinces us otherwise.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. That the Attorney General did not revoke Shahar's offer because of her religious affiliation or her religious beliefs (as opposed to her conduct) is plain from the record. Assuming arguendo that the Attorney General's decision to revoke Shahar's offer did implicate her Free Exercise rights, we believe that Pickering balancing applies, see e.g. Brown v. Polk County, Iowa, 61 F.3d 650, 658 (8th Cir.1995) (en banc), and that the Attorney General prevails in that balance for the reasons discussed above. In addition, several of us also doubt that a facially neutral executive act which adversely impacts on the exercise of one's religion either constitutes a violation of the Free Exercise Clause or requires heightened scrutiny. Lyng v. Northwest Indian Cemetery Protective Assn., 485 U.S. 439, 108 S. Ct. 1319, 1326, 99 L. Ed. 2d 534 (1988) (government's ability to carry out its policies \"cannot depend on measuring the effects of a governmental action on a religious objector's spiritual development\"). We affirm the district court's holding denying Shahar's free exercise claim. The district court also held that the record supports no reasonable inference that the Attorney General revoked Shahar's offer because of her sexual orientation--as opposed to her conduct in \"marrying\" another woman. Because Shahar fails to point us to enough evidence to support such an inference, we also affirm the district court's holding on Shahar's equal protection claim.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. The record in this case supports an inference that the Attorney General withdrew Shahar's offer of employment because he thought Shahar had \"set him up;\" once ensconced in the Department of Law office, she would use her position to advance a homosexual-rights agenda among her co-employees. Had the Attorney General's decision been motivated by this concern, Shahar may have had a free speech claim. See, e.g., Connick v. Myers, 461 U.S. 138, 150-54, 103 S. Ct. 1684, 1692-93, 75 L. Ed. 2d 708 (1983) (applying Pickering to a district attorney's decision to discharge a deputy because her speech on a matter of public concern disrupted the district attorney's office). Shahar, however, did not present a free speech claim to the district court; consequently, such a claim is not involved in this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Shahar's complaint sought (for each of her claims) injunctive relief (an order requiring the Attorney General to reinstate the offer of employment) and money damages. In his answer, the Attorney General pled qualified immunity as an affirmative defense to Shahar's prayers for money damages. The district court did not pass on this defense because it concluded that the record disclosed no constitutional violation. In this appeal, the Attorney General does not ask us to affirm the district court's summary judgment with respect to the damages aspect of the case on the alternative ground that he is entitled to qualified immunity.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The court contends that this is unnecessary because Pickering balancing is never a precise mathematical process: it is a method of analysis by which a court compares the relative values of the things before it. A person often knows that \"x\" outweighs \"y\" even without first determining exactly what either \"x\" or \"y\" weighs. And it is this common experience that illustrates the workings of a Pickering balance. Ante at [29]. The court cites two cases for the proposition that other courts have balanced under Pickering a government employer's interest against an employee's assumed constitutional right. The first case, Kemp v. State Bd. of Agric., 803 P.2d 498 (Colo.1990), cert. denied 501 U.S. 1205, 111 S. Ct. 2798, 115 L. Ed. 2d 972 (1991), is, in my view, inapposite. In Kemp, the plaintiff, an employee of Colorado State University who claimed that sex and race discrimination resulted in \"a salary increase she felt was too low,\" 803 P.2d 498 at 500, invoked the university's formal grievance procedure and chose to have her grievance heard in a closed rather than in an open proceeding. While the proceeding was underway, she wrote one of her U.S. Senators complaining about irregularities in the proceeding. When the office in charge of investigating her allegations learned that she had brought an outside party into the picture, he terminated the proceeding. The university president affirmed the officer's decision. The employee then sued the university and others, seeking unspecified injunctive relief and money damages. Kemp v. State Bd. of Agric., 790 P.2d 870 (Colo.Ct.App.1989). The question before the court was whether the university's closed hearing procedure, which \"clearly indicated that outside forces may not be invited into the proceedings until a decision has been rendered,\" Kemp, 803 P.2d at 504-505, violated the employee's First Amendment rights of free speech and petition of grievances. The Colorado Supreme Court chose to decide the question by engaging in Pickering balancing instead of determining whether the employee had waived her rights of free speech and of petition by voluntarily choosing to have her grievance decided in a closed proceeding. Applying Pickering to the employee's claims, the court had no problem determining that her speech was not a matter of public concern under Connick and that Pickering therefore did not protect the employee. The court then faced the novel question of whether Pickering applied to First Amendment petition claims. The court assumed that the employee's right to petition was implicated when she contacted her senator and concluded that she had \"no stronger interest [under the Petition Clause] than [she] had under the Free Speech Clause.\" Id. at 506. Thus, while the court assumed the existence of the right, it assigned the right the maximum weight possible--the same weight accorded speech on a matter of public concern. If, in the case at hand, the court is going to assume that Shahar's relationship with her partner constitutes an intimate association under the First Amendment, the court should do as the Colorado Supreme Court did and give it the highest weight possible, the weight given heterosexual marriage. The other case in which an employee's right was assumed is Barnard v. Jackson County, 43 F.3d 1218 (8th Cir.), cert. denied, U.S., 116 S. Ct. 53, 133 L. Ed. 2d 17 (1995). There, an auditor hired by a county legislature to perform and internal audit of the county's agencies and offices leaked the results of his audit to the press. When the legislators learned what he had done, they terminated his employment. In striking a Pickering balance, the court assumed that the leak was speech on a matter of public concern. Barnard differs from the instant case in that the right the Eighth Circuit assumed and the weight to be accorded to it were well established. In the instant case, while the existence of the right of intimate association has been established, the nature of the right outside of the marital/familial context and the weight such right should be accorded are not well established. Again, the court's assumption in that case tells us to what weight the right is entitled. The court's opinion in the instant case should do the same.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Pickering was a free speech case: a public high school teacher claimed that his employer fired him because he sent a letter to a local newspaper. The letter was critical of the way that Board of Education and superintendent had handled political issues related to education. 391 U.S. at 564, 88 S. Ct. at 1732-33. The Supreme Court concluded that the employer's action was lawful only if its interests as an employer outweighed the teacher's interest in exercising his free speech right. Some courts have extended Pickering balancing to scrutinize adverse employment decisions made on account of the employee's exercise of other constitutionally protected rights. See, e.g., Hatcher v. Board of Pub. Educ. and Orphanage, 809 F.2d 1546, 1559 (11th Cir.1987) (applying Pickering to an expressive association claim); Stough v. Crenshaw County Bd. of Educ., 744 F.2d 1479, 1480-82 (11th Cir.1984) (applying Pickering to parents' \"constitutional right to control the education of their children\"); Brown v. Polk County, 61 F.3d 650, 658-59 (8th Cir.1995) (en banc) (applying Pickering to a free exercise of religion claim), cert. denied, U.S., 116 S. Ct. 1042, 134 L. Ed. 2d 189 (1996); Sullivan v. Meade Independent School District No. 101, 530 F.2d 799, 804-06 (8th Cir.1976) (suggesting that Pickering would apply to association claim and substantive due process privacy claim). I do not criticize the court for extending Pickering to claims of intimate association, expressive association, and free exercise. My criticism is with the way in which the court applies Pickering to the assumed rights in this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Nor does the court identify a causal link between Shahar's exercise of the right in question and the Attorney General's withdrawal of the offer of employment. As pointed out above, there is no need to engage in Pickering balancing if it has not been shown that the adverse employment decision was caused by the employee's exercise of the constitutional right.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. As the court notes, the Supreme Court has formally located the right of intimate association within the First Amendment. See Board. of Dirs. of Rotary Int'l v. Rotary Club of Duarte, 481 U.S. 537, 545-47, 107 S. Ct. 1940, 1945-46, 95 L. Ed. 2d 474 (1987). The cases cited by Roberts, however, are substantive due process cases. Because of this confusion, there exists a split among the circuits as to whether the right of intimate association is a First Amendment or substantive due process right. Compare Griffin v. Strong, 983 F.2d 1544, 1547 (10th Cir.1993) (holding that the right of intimate association is \"properly based on the concept of liberty in the Fourteenth Amendment\") (quotation marks and citation omitted), and Kraft v. Jacka, 872 F.2d 862, 871 (9th Cir.1989) (same); with Wallace v. Texas Tech Univ., 80 F.3d 1042, 1051 (5th Cir.1996) (holding that the right of intimate association is a First Amendment right). I do not believe that this question affects my analysis here, and therefore do not address the issue further.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The fact that Hardwick addressed homosexual conduct does not undermine this conclusion. The cases I discuss above address conduct as well: the right to get married and the right to have and raise one's children. Moreover, homosexual conduct is as central to a homosexual \"marriage\" as heterosexual intercourse is to a heterosexual marriage. The suggestion that homosexual relationships have played a role in our history and traditions while acknowledging that homosexual conduct has played no role in them would be \"at best, facetious.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Shahar contends that her \"intimate association is of the type most central to that personal liberty. Shahar's interests in creating and maintaining her primary, familial relationship with her partner warrant the greatest weight possible for intimate associations in the Pickering analysis.' Reply Brief at 41. Her relationship with her partner \"exemplifies the First Amendment values behind the right of intimate association and weighs heavily on her side of the Pickering scale as a core protected activity.\" Reply Brief at 19. Its \"purpose was to create a family,\" Appellant's Brief at 23; thus, her \"committed union with her female partner is precisely the type of intimate human relationship that the Constitution most strongly protects,\" id. at 22. In sum, according to Shahar, the relationship is entitled to the same protection as those relationships explicitly identified by the Supreme Court in Roberts: marriage and familial relationships.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. A reasonably trier of fact could also find that the Attorney General withdrew Shahar's offer because he could not trust her; during a telephone conversation in June 1991, Shahar misled Deputy Attorney General J. Robert Coleman into believing that she was going to marry a male. A reasonable trier of fact could also or alternatively find that the Attorney General, as he explained to the Dean of the Emory Law School in a letter contained in the record of this case below, withdrew the offer because he thought that Shahar had set him up and planned to use him to advance a homosexual-rights agenda. With either finding, Shahar's asserted intimate association claim, as well as her other claims, would fail for lack of proof of causation; that is, the trier of fact would have determined that the Attorney General's action was not motivated by Shahar's constitutionally protected activity.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Moreover, whether the Attorney General would have the benefit of his qualified immunity defense would be problematic. By not raising the issue in this appeal as a ground for affirming the district court's summary rejection of the damages aspect of the case, the Attorney General may be deemed to have abandoned that defense.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. For example, the court could have seized upon language in Roberts which suggests that, in addition to fundamental liberty interests such as marriage and familial relationships, all human relationships constitute liberty interests. These relationships can be arrayed on a spectrum with marital and familial relationships at one end and business relationships at the other. \"Between these polls, of course, lies a broad range of human relationships that may make greater or lesser claims to constitutional protection from particular incursions by the State.\" Roberts, 468 U.S. at 620, 104 S. Ct. at 3251. Having seized on this language, the court could have located Shahar's relationship with her partner at some point on this spectrum between marital/familial relationships and business relationships. Then the court could have addressed the question whether the relationship is such that Pickering balancing was required. Had this been the court's approach, I would have suggested that the court look to Connick for an answer. Connick addressed the question of the scrutiny a court should apply in determining whether a public employer's decision to discharge an employee on account of her speech violated the First Amendment. The Supreme Court distinguished between speech involving a matter of public concern and speech involving a matter of personal concern. With respect to the former, the Court held that the employer's action must be evaluated under Pickering. This is because \"speech on public issues occupies the highest rung of the hierarchy of First Amendment values, and is entitled to special protection.' 461 U.S. at 145, 103 S. Ct. at 1689 (quotation marks omitted). With respect to speech not involving matters of public concern, the Court held that \"it is unnecessary for [courts] to scrutinize the reasons for [the employer's decision].\" Id. at 146, 103 S. Ct. at 1690. The Court, however, did \"not suggest [that this type of speech] is totally beyond the protection of the first Amendment.\" Id. at 147, 103 S. Ct. at 1690. The Court decided not to scrutinize purely private speech because \"government offices could not function if every employment decision became a constitutional matter.\" Id. at 143, 103 S. Ct. at 1688. For this reason, government officials should enjoy wide latitude in managing their offices, without intrusive oversight by the judiciary in the name of the First Amendment. Perhaps the government employer's dismissal of the worker may not be fair, but ordinary dismissals from government service which violate no fixed tenure or applicable statute or regulation are not subject to judicial review even if the reasons for the dismissal are alleged to be mistaken or unreasonable. Id. at 146-47, 103 S. Ct. at 1690. When a public employee speaks not as a citizen upon matters of public concern, but instead as an employee upon matters only of personal interest, absent the most unusual circumstances, a federal court is not the appropriate forum in which to review the wisdom of a personnel decision taken by a public agency allegedly in reaction to the employee's behavior.\" Id. at 147, 103 S. Ct. at 1690. If Shahar's relationship with her partner does not occupy \"the highest rung of the hierarchy of First Amendment values\" such that it is \"entitled to special protection,\" the court could have held that the Attorney General's action is beyond scrutiny. For if his action is subject to scrutiny in this case, then any adverse employment decision allegedly based on a relationship within the Roberts spectrum would also be subject to scrutiny. The Connick Court sought to avoid this result.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The court explains that because Shahar's religion does not \"require\" her to marry a woman, \"considerable doubt also exists that she has a constitutionally protected federal right to be \"married' to another woman to engage in her religion.\" Ante at [2]. I have found no authority for the proposition that the Free Exercise Clause protects only those activities which a person's religion commands him or her to perform. I believe that Supreme Court precedent is to the contrary. See, e.g., Employment Div., Dep't of Human Resources v. Smith, 494 U.S. 872, 886-87, 110 S. Ct. 1595, 1604-05, 108 L. Ed. 2d 876 (1990) (noting that \"repeatedly and in many different contexts, (the Supreme Court has) warned that courts must not presume to determine the place of a particular belief in a religion or the plausibility of a religious claim\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. I assume it would make no difference in this court's decision, but the Attorney General did not revoke an \"employment offer.\" He had offered employment and the offer had been accepted, but the date on which work was to begin was left open. Before that date was fixed the Attorney General canceled the employment agreement.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The district court and all three members of the panel agreed that Shahar enjoyed protected intimate association rights. The district court did not address expressive association.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. This court also suggests that Shahar held herself out as \"married\" in the statutory/common-law/traditional sense because she and her partner were granted (presumably on a homeowners or auto insurance policy) an insurance rate available to married women. But the undisputed evidence is that Shahar talked to her insurance agent, explained the relationship between her and her partner, and asked if the rate was available to them. The insurance company afforded them that rate. This was no false \"holding out,\" no pretext of marriage in the legal sense. Indeed, it was the contrary. Shahar told the agent the facts of her relationship. If this incident tends to prove anything it is that the insurance company, possessed of facts, recognized and accepted the duality of meaning of \"marriage\" and for its purposes accepted that Shahar was a married woman. This court also refers to joint ownership of a home as \"holding out.\" Under Georgia law joint ownership does not require marital status. O.C.G.A. §§ 44-6-120 and 44-6-190. It is unclear when the insurance matter occurred. Joint ownership of the house existed before this case arose. It is clear that the Attorney General did not rely on either of these factors or even know of them. 1 Such generic meanings are an established part of the English language. Webster's New Collegiate Dictionary (1979) at 698 (giving \"an intimate or close union\" as one definition of marriage), 1318 (noting that wedding is defined, inter alia, as \"an act, process, or instance of joining in close association\"). 2 Certainly, it would have been more prudent for Shahar to have consistently used terms, such as \"commitment ceremony\" and \"partnership\", to refer to her relationship. Shahar's use of language, however, does not transform this case into a debate over traditional marriage, particularly given that she only used the controversial terms with members of Bowers's staff in two conversations and on one conflict of interest form. 3 Bowers apparently recognizes that Shahar's relationship with her partner meets the objective characteristics of an intimate association outlined in Roberts and its progeny, and therefore, he contends a further requirement applies, namely that the relationship in question must fall within the category of associations traditionally endorsed by society at large. In support of this argument, Bowers cites FW/PBS, Inc. v. City of Dallas, 493 U.S. 215, 110 S. Ct. 596, 107 L. Ed. 2d 603 (1990), a case in which the Supreme Court upheld the constitutionality of a local licensing ordinance for motels that rented rooms for periods of less than 10 hours. In so ruling, the Court observed that associations \"formed from the use of a motel room for fewer than 10 hours are not those that have 'played a critical role in the culture and traditions of the Nation by cultivating and transmitting shared ideals and beliefs.' \" Id. at 237. In my view, the foregoing statement stands for the proposition that superficial relationships fail to qualify as intimate associations under the Constitution, not for the proposition that courts should deny recognition to deep-seated relationships which are, or have been, unpopular. Because Shahar's relationship with her partner unquestionably constitutes a close, ongoing interpersonal association, not an hours-long encounter, FW/PBS does not undermine her claim for constitutional protection.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The en banc majority properly recognizes that as the chief law enforcement officer in Georgia, Bowers's legitimate concerns for the functioning of his staff carry special weight in the Pickering balance. I believe, however, that the en banc majority goes further, and inappropriately grants virtually absolute deference to Bowers, without weighing the countervailing interests on which he impinges. Such an approach categorically exempts Bowers's employment decisions from scrutiny, and therefore, is inconsistent with well-established authority mandating particularized decision-making in this context. See, e.g., Bates v. Hunt, 3 F.3d 374, 378 (11th Cir.1993) (\"Whether a governmental employer has improperly infringed on an employee's First Amendment rights turns on the specific facts of the particular case: a 'case-by-case' analysis is required.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The fact that Shahar did not publicize her relationship similarly undercuts Bowers's claim that Shahar showed poor judgment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. In fact, Bowers testified that he \"didn't know whether [Shahar] violated the law or not,\" Bowers Dep. at 67, and that he didn't \"know the nature of the sexual relation[s between Shahar and her partner], if any,\" id. at 69.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Because I conclude Shahar's other claims would not warrant relief beyond that to which Shahar would be entitled pursuant to her intimate association claim, I do not address any other issues raised in this appeal. 1 Although the discriminatory conduct that occurred in Romer arose in a different factual context than this case, I disagree with the majority's attempt to distinguish Romer to the extent that it finds it to be wholly irrelevant. The reasoning and principles enunciated in Romer are, in my view, highly relevant to this case and provide a directive that, at least, should inform our analysis. 2 The distinction that the majority draws between Shahar's status as a homosexual and her conduct in entering into a homosexual marriage, see Majority op. at [47 n. 27], is truly a distinction without a difference, in my opinion. It is a matter of simple logic that only homosexuals would enter into a homosexual marriage. Bowers's action, therefore, draws a distinction that, on its face, reaches homosexuals only and distinguishes among similarly situated people on the basis of one trait only: that they are homosexual. Bowers cannot escape this conclusion by subdividing the class of homosexuals into those who elect to enter into a homosexual marriage and those who do not, and then claiming that he discriminated against Shahar not because of her status as a homosexual, but because she is a homosexual and she entered into a homosexual marriage. The Supreme Court's decision in Loving v. Virginia, 388 U.S. 1, 87 S. Ct. 1817, 18 L. Ed. 2d 1010 (1967), is instructive on this point. In Loving, the Supreme Court struck down as unconstitutional Virginia's anti-miscegenation statute. As the state of Virginia argued, that statute was not directed at a specific race. Id. at 7-8. Yet, the Supreme Court concluded in Loving that the statute did invoke a racial classification, id. at 8-9, notwithstanding the fact that it applied only to blacks and whites who engaged in the \"conduct,\" Majority op. at [47 n. 27], of marrying a person from another race. This case is no less about classification on the basis of sexual orientation than Loving was about classification on the basis of race. According to the manifest logic of Loving, therefore, Bowers's action drew a classification along lines of sexual orientation. With the advent of Romer, such a classification has a significant effect on the Pickering balancing equation. In his special concurrence, Judge Tjoflat agrees with the majority that the record does not support an inference that Bowers's decision was based on Shahar's homosexual status. Considering the fact that the briefs as well as all the opinions in this case are riddled with references to Shahar's homosexual status and the reasonableness--or non-reasonableness--of Bowers's inferences from that status, I find it difficult to understand how we can seriously contend that an inference of discrimination on the basis of homosexual status cannot be made. The special concurrence attempts to avoid the equal protection dimension of this case by using a cramped view of causation. See ante at [13] (\"A reasonable trier of fact could find from the record in this case that the Attorney General's decision was motivated not by the fact that Shahar is a homosexual, but because she and her partner were maintaining an open homosexual relationship.\"). It is easy to appreciate this by imagining, as the special concurrence suggests, see ante at [14], that Shahar had been dismissed because she was a white woman that married a black man, and replacing references to homosexuality by references to race in both the majority and concurring opinions. For example, the footnote which accompanies the above quoted text from the special concurrence, see ante at [13 n. 9], would have stated: \"A reasonable trier of fact could also find that the Attorney General withdrew Shahar's offer because he could not trust her; during a telephone conversation in June 1991, Shahar misled Deputy Attorney General J. Robert Coleman into believing that she was going to marry a [white] male. A reasonable trier of fact could also or alternatively find that the Attorney General, as he explained to the Dean of the Emory Law School in a letter contained in the record of this case below, withdrew the offer because he thought that Shahar had set him up and planned to use him to advance a [racial-equality] agenda.\" A clearer violation of the Equal Protection Clause hardly could have been presented. 3 In connection with Shahar's relationship with her partner, I am using the words \"married\" or \"marriage\" in their generic sense of a committed, intimate union. It may be important to note that at no time has Shahar violated Georgia law by entering into a homosexual marriage. A Georgia law that was enacted in 1996, almost five years after Shahar was dismissed by Bowers, declares that Georgia does not recognize same-sex marriages. See O.C.G.A. § 19-3-3.1 (Supp.1996); see also O.C.G.A. § 193-30(b)(1) (Supp.1996) (\"No marriage license shall be issued to persons of the same sex.\"). Shahar has not sought to obtain a marriage certificate or to have her marriage legally recognized by the state of Georgia. 4 In the face of Shahar's evidence of statistical studies showing that lesbians prefer to engage in non-sodomy sexual practices, rather than anal or oral sex--the only two practices prohibited by Georgia's sodomy statute--, Bowers argues that the public is not aware of these statistics and that, therefore, the public's erroneous assumptions about lesbians take precedence. Erroneous assumptions about a person, however, are not a rational basis for discriminating against that person, even if these erroneous assumptions are wide-spread and are religiously based. See Romer, U.S. at, 116 S. Ct. at 1629. 5 For this reason, the majority's citation to McMullen v. Carson, 754 F.2d 936 (11th Cir.1985), in which a state official relied on anticipated public reaction as a basis for dismissing a Klu Klux Klan recruiter from a sheriff's office, is misplaced. In light of the Klan's undisputed history of criminal violence against minorities in this country, I can hardly imagine anyone would argue that the public's assumption that membership in the Klan is antithetical to the work of an employee of a law enforcement agency is irrational. 6 In Georgia, \"an unmarried person commits the offense of fornication when he voluntarily has sexual intercourse with another person.\" O.C.G.A. § 16-6-18. I trust that no one would find unreasonable, in the colloquial sense of the word, the assumption that Georgia's fornication law is frequently disregarded by the citizenry of Georgia or perhaps even the unmarried staff of its Department of Law. 7 In the context of a habeas petition by a married heterosexual convicted of sodomy, Moseley v. Esposito, No. 89-6897-1 (Super. Ct. Dekalb Co.), Bowers's Department of Law moved to strike the petitioner's motion to discover whether any of Bowers's attorneys had themselves ever violated the sodomy law because \"the personal conduct [of Department attorneys] is no more relevant than the personal conduct of Petitioner's counsel or the Court.\" R2-35-Exh. B at 2 (Brief in Support of Motion to Strike and Expunge in Moseley); see also id. at 3-4 (\"The information [Moseley] seeks has nothing to do with professional impropriety, but rather is wholly irrelevant.... \"). Bowers has no reason for believing that Shahar's personal conduct would affect her abilities to ethically represent the state, except based on an impermissible inference from her status as a homosexual. Lawyers are trained to be advocates of legal positions with which they may personally disagree. 1 See Fyfe v. Curlee, 902 F.2d 401 (5th Cir.), cert. denied, 498 U.S. 940, 111 S. Ct. 346, 112 L. Ed. 2d 310 (1990). 2 See Brown v. Polk County, 61 F.3d 650, 658 (8th Cir.1995)(en banc). 3 See Gregorich v. Lund, 54 F.3d 410, 414 \u0026 n. 4 (7th Cir.1995); Boddie v. City of Columbus, Miss., 989 F.2d 745, 748 (5th Cir.1993); Hatcher v. Board of Pub. Educ. \u0026 Orphanage, 809 F.2d 1546, 1559 (11th Cir.1987). 4 In answering that question, the Waters plurality made two observations that the majority overlooks. First, the plurality stated that it did not believe that balancing must be applied only to the facts as the employer perceived them, without considering the reasonableness of the employer's conclusions. Id. at 1889. According to the plurality, \"even in situations where courts have recognized the special expertise and special needs of certain decision makers, the deference to their conclusions has never been complete.\" Id. Second, the plurality stated that \"it may be unreasonable, for example, for the employer to come to a conclusion based on no evidence at all ... [and] likewise, it may be unreasonable for an employer to act based on extremely weak evidence when strong evidence is clearly available.\" Id. 5 The Court also recounted the rationale the district court advanced to rebut the idea that the assistant public defenders were appropriately viewed as policy making, confidential employees subject to discharge solely on the basis of their political affiliations. According to the district court, although the assistants had broad responsibilities with respect to particular cases that were assigned to them, they had limited, if any, responsibility for the overall operation of the office. Branti, 445 U.S. at 511. \"They did not act as advisors or formulate plans for the implementation of the broad goals of the office, and although they made decisions in the context of specific cases, they do not make decisions about the orientation and operation of the office in which they work.\" Id. (internal quotations omitted). The district court also noted that the assistants \"did not occupy any confidential relationship to the policy making process, and did not have access to confidential documents that influenced policy making deliberations.\" Id. Many of the same statements could be made about Shahar as a staff attorney. To the extent, then, that policy-making authority and confidentiality legitimately provide the Georgia Attorney General with a basis for deference in this case, it does not follow that all attorneys in his office have similar policy-making authority or similar confidential relationships with the Attorney General. 6 Moreover, to the degree that Georgians have opinions about homosexuality, the law suggests their opinions are at least mixed. In Georgia's largest city, Atlanta, for instance, elected officials have passed a municipal ordinance prohibiting discrimination on the basis of sexual orientation. See City of Atlanta v. McKinney, 265 Ga. 161, 454 S.E.2d 517, 519 (Ga.1995). See also, In the Interest of R.E.W., 220 Ga. App. 861, 471 S.E.2d 6 (Ga.Ct.App.) (granting gay father unsupervised visitation rights with his child), cert. denied, 267 Ga. 62, 472 S.E.2d 295 (Ga.1996). 7 See Ga. Stat. § 16-6-2(a) (\"A person commits the offense of sodomy when he or she performs or submits to any sexual act involving the sex organs of one person and the mouth or anus of another.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Although McCabe and McMullen also involved off-duty conduct, other factors, not present here, weighed in the balance against the employee in those cases.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Georgia's recently enacted ban on same-sex marriages does not alter this analysis. Even if we assume that the statute is constitutional, it simply states that individuals who are involved in same-sex unions are not entitled to the full panoply of benefits available to individuals who are involved in opposite-sex unions. See O.C.G.A. § 19-3-3.1. In so doing, the new statute implicitly acknowledges the right of same-sex couples to use the word \"marriage\" to describe their relationships. See O.C.G.A. § 19-3-3.1(b) (\"No marriage between persons of the same sex shall be recognized as entitled to the benefits of marriage.\")\u003c/span\u003e\n\n",
    "body_length": 165510,
    "citedas": [
      "114 F.3d 1097"
    ],
    "attorneys": "For appellant: Debra E. Schwartz, Atlanta, GA. William B. Rubenstein, American Civil Liberties Union Foundation, New York, New York. Ruth E. Harlow, New York, NY. For Amicus: Georgia Psychological Association, Robert B. Remar, Kirwan, Goger, Georgia Kay Lord, Chesin \u0026 Parks, Atlanta, GA. For Amicus: AAUP, et al, Kathleen M. Sullivan, Stanford Law School, Crown Quadrangle, Stanford, California. For appellee: Michael E. Hobbs, Office of State Attorney General, Atlanta, GA. Dorothy Yates Kirkley, Jones, Day, Reavis \u0026 Pogue, Atlanta, GA. For appellee: Laura Lynn Pulliam, Paul, Hastings, Janofsky \u0026 Walker, Atlanta, GA. William J. Holley, II, Parker, Hudson, Rainer \u0026 Dobbs, Atlanta, GA. Gregory R. Hanthorn, Diane G. Pulley, Jones, Day, Reavis \u0026 Pogue, Atlanta, GA.",
    "category": [],
    "judges": "Before Hatchett, Chief Judge, Tjoflat, Anderson, Edmondson, Cox, Birch, Dubina, Black, Carnes and Barkett, Circuit Judges, and Godbold and Kravitch,*fn* Senior Circuit Judges. Tjoflat, Circuit Judge, specially concurring. Godbold, Senior Circuit Judge, dissenting in which Barkett, Circuit Judge, and Kravitch, Senior Circuit Judge, join. Kravitch, Senior Circuit Judge, dissenting, in which Barkett, Circuit Judge, and Godbold, Senior Circuit Judge, join. Birch, Circuit Judge, dissenting, in which Barkett, Circuit Judge, Godbold and Kravitch, Senior Circuit Judges, join. Barkett, Circuit Judge, dissenting, in which Godbold and Kravitch, Senior Circuit Judges, join.",
    "citation_count": 42
  }
}
