{
  "id": "24qDQGYBTlTomsSB3WPr",
  "document": {
    "title": "Proffitt v. Wainwright",
    "full_title": "CHARLES WILLIAM PROFFITT -APPELLANT, v. LOUIE L. WAINWRIGHT, SECRETARY, FLORIDA DEPARTMENT OF OFFENDER REHABILITATION -APPELLEE",
    "jurisdiction": "Eleventh Circuit",
    "date": "1982-09-10T00:00:00.000Z",
    "docket": "No. 80-5997",
    "body": "KRAVITCH, Circuit Judge:\n\nI. Case History\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nOn March 21, 1974 appellant Charles Proffitt was tried and convicted of first degree murder by a jury in the Circuit Court of Hillsborough County, Florida. In the second phase of the bifurcated proceeding the jury issued an advisory sentence recommending the death penalty, and the judge, in agreement with that recommendation, sentenced appellant to death. Pursuant to Florida's capital sentencing statute, Pub.L.No. 72-724, § 9, 1972 Fla. Laws (current version at Fla.Stat.Ann. § 921.141 (West Supp.1982)), appellant was afforded an automatic appeal to the Florida Supreme Court, which upheld his conviction and sentence. Proffitt v. State, 315 So.2d 461 (Fla. 1975). Appellant then sought review by the United States Supreme Court, which granted certiorari to consider the constitutionality of the Florida death-penalty statute. 423 U.S. 1082, 96 S. Ct. 1090, 47 L. Ed. 2d 94 (1976). Seven members of the Court, in three separate opinions, held that the statute did not violate the eighth or fourteenth amendments, Proffitt v. Florida, 428 U.S. 242, 244-60, 96 S. Ct. 2960, 2963-70, 49 L. Ed. 2d 913 (1976) (opinion of Powell, Stevens, and Stewart, JJ.); id. at 261, 96 S. Ct. at 2970 (opinion of White and Rehnquist, JJ. and Burger, C.J.); id. at 261, 96 S. Ct. at 2970 (opinion of Blackmun, J.), and hence affirmed appellant's sentence.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nHaving exhausted his direct remedies, appellant sought collateral relief -- first in the state courts, which denied relief summarily without an evidentiary hearing, see Proffitt v. State, 360 So.2d 771 (Fla. 1978), cert. dismissed on appellant's motion, Proffitt v. State, 372 So.2d 1111 (1979),\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e and finally in the federal district court, the decision of which denying habeas corpus is the subject of this appeal. In the district court appellant urged several grounds for relief. He claimed the representation he received at the guilt phase of his trial was ineffective rendering his conviction unconstitutional under the sixth amendment. He also raised several constitutional challenges to the state court's sentencing decision, including (1) ineffective assistance of counsel at the penalty hearing; (2) admission of testimony and reports by court-appointed psychiatrists without adequate opportunity for confrontation; (3) limitation of the jury's consideration of mitigating evidence in violation of Lockett v. Ohio, 438 U.S. 586, 98 S. Ct. 2954, 57 L. Ed. 2d 973 (1978); and (4) consideration of aggravating factors not authorized by the sentencing statute in violation of the due process clause and eighth amendment.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nThe district court appointed a magistrate\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e to conduct the evidentiary hearing required by Townsend v. Sain, 372 U.S. 293, 83 S. Ct. 745, 9 L. Ed. 2d 770 (1963). The magistrate, after thorough and probing analysis, recommended denial of relief on all of appellant's claims except that based on ineffective assistance of counsel at the sentencing stage of the trial.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e As to the latter, he found defense counsel's representation constitutionally deficient and recommended remand to the state court with instructions either to conduct a new sentencing hearing or, alternatively, to resentence appellant to life imprisonment. The district court adopted the magistrate's findings and recommendations on all issues except the last. It rejected the claim of ineffective counsel at sentencing and the magistrate's conclusion on that ground and thus dismissed appellant's habeas petition. Appellant challenges the district court's substantive conclusions and further argues that the district court committed procedural error in rejecting the magistrate's recommendation on his ineffective counsel claim without conducting a new hearing on that issue. We address the procedural question first because its resolution, if favorable to appellant, would require a remand to the district court obviating the need for us to decide most of appellant's substantive claims at this juncture. Since an understanding of the operation of the Florida capital sentencing statute under which appellant was sentenced is necessary for informed evaluation of both the procedural and substantive issues, we preliminarily set forth a brief description of that act and of the sentencing proceeding in this case.\n\nII. Florida's Capital Sentencing Statute\n\nUnder Fla.Stat. § 921.141,\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e following the guilt phase of trial for a defendant convicted of a capital felony, the trial judge conducts a separate sentencing proceeding before the jury that convicted the defendant. At the sentencing hearing, the parties may introduce evidence of and argument concerning aggravating\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e and mitigating factors.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e On the basis of the evidence presented at the sentencing hearing together with that presented at the guilt phase of the trial,\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e a majority of the jury renders an advisory sentence. Fla.Stat.Ann. § 921.141(2), (3) (West Supp.1982). The jury is instructed to consider \"whether sufficient aggravating circumstances exist\"; \" whether sufficient mitigating circumstances exist which outweigh the aggravating circumstances found to exist\"; and, \"based on these considerations, whether the defendant should be sentenced to life imprisonment or death.\" Id. § 921.141(2). The trial judge then independently evaluates the evidence, makes the same determination as to the existence of aggravating and mitigating factors, and decides which sentence to impose. Id. § 921.141(c).\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nIn this case, the sentencing proceeding was brief. The prosecution called one witness: a Dr. Crumbley who, acting as psychiatric consultant for the County Sheriff's Office, had examined appellant shortly following his arrest.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e In the course of two interviews with the doctor, appellant had confessed to committing the murder. Appellant's attorney waived his doctor-patient privilege for purposes of sentencing only, allowing the doctor to testify.\n\nOn direct examination, Dr. Crumbley testified that appellant had expressed concern about a feeling he had that was \"so overwhelming that he felt he would do damage to people in the future.\" Dr. Crumbley testified that appellant told him his uncontrollable desire had built up an unbearable tension, which he had \"fought as hard as he could,\" but that it finally overcame him with the result that he killed a man and was now awaiting trial. Appellant had further expressed concern that if he was acquitted he might kill someone again, and he asked Dr. Crumbley about arranging psychiatric help for him. At a second interview, appellant again spoke of the tension he had experienced prior to the killing and described a sense of relaxation he had felt afterward. He told the doctor the tension was building up again with his hostility directed toward a particular inmate. He asked whether he could be moved to a different cell or whether something could be done to relieve the emotional pressure he was experiencing. Dr. Crumbley further testified that appellant killed the victim (who was a total stranger to him) solely to satisfy his emotional tension and that in Crumbley's opinion appellant could be dangerous to society and to other inmates. Dr. Crumbley stated that his two interviews with appellant took fifteen to twenty minutes each and that he had performed no psychiatric or psychological testing.\n\nAppellant's counsel then cross-examined the doctor, eliciting his opinion that appellant was acting under extreme, uncontrollable emotional distress when he committed the murder, that appellant \"couldn't help what he did,\" that appellant's condition was treatable, and that if treated appellant would no longer be dangerous. Dr. Crumbley explained that there were confinement facilities specializing in treatment of individuals with the kind of emotional disturbance suffered by appellant.\n\nDefense counsel called no witnesses, and following the doctor's testimony the attorneys argued briefly concerning the aggravating and mitigating factors enumerated in the Florida capital sentencing statute. The prosecuting attorney argued that five of the aggravating factors\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e and none of the mitigating factors\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e were present. Appellant's counsel argued that at most the prosecution had established only one aggravating factor\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e and that this was outweighed by the mitigating evidence.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nIII. Procedural Issue\n\nIn 1976, Congress expanded district courts' delegatory authority by permitting appointment of magistrates to conduct evidentiary hearings in federal habeas cases. See note 5 supra. In United States v. Raddatz, 447 U.S. 667, 100 S. Ct. 2406, 65 L. Ed. 2d 424 (1980), the Supreme Court, interpreting the Federal Magistrates Act, held that a district court judge need not rehear the testimony on which the magistrate relied in accepting the magistrate's findings or recommendation. Rather, the Court held, the statutory command to district court judges to \"make a de novo determination\" of those portions of the magistrate's findings and recommendations to which the parties object is satisfied as long as the judge, rather than the magistrate, exercises \"ultimate adjudicatory power.\" Id. at 674-76, 100 S. Ct. at 2411-12. The Court also held that this arrangement does not violate the due process clause or article III of the Constitution. Id. at 677-84, 100 S. Ct. at 2413-16. The Court left open the question whether a district court judge may constitutionally \" reject a magistrate's proposed findings on credibility when those findings are dispositive and substitute the judge's own appraisal . . . without seeing and hearing the witness or witnesses whose credibility is in question.\" Id. at 681 n.7, 100 S. Ct. at 2415 n.7. The Fifth Circuit addressed the latter issue in Louis v. Blackburn, 630 F.2d 1105 (5th Cir. 1980).\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e It held that in cases involving the constitutional rights of a criminal defendant due process requires that, before entering an order inconsistent with the credibility choices made by a magistrate, a district court judge must himself hear the testimony of witnesses whose testimony is determinative. Id. at 1109.\n\nAppellant argues that the district court judge's rejection, without hearing testimony, of the magistrate's recommendation concerning his ineffective counsel claim was erroneous under Louis v. Blackburn. Determining whether the judge's order is \"inconsistent with credibility choices made by the magistrate\" is a two-step process. First, we must review the magistrate's recommendation and decide whether credibility choices he made in assessing appellant's ineffective counsel claim were dispositive. If the answer is affirmative, we must then scrutinize the district court's order to ascertain if the judge's rejection of the magistrate's recommendation was also a rejection, whether express or implicit, of the magistrate's credibility choices. See id. at 1107-08.\n\nIn support of his ineffective counsel claim, appellant presented to the magistrate numerous detailed allegations concerning the defense attorney's actions before trial, at the guilt stage of the trial, and at the sentencing phase. The magistrate rejected all of appellant's ineffective counsel arguments except that based on the sentencing phase, and the district court adopted the magistrate's findings with respect to the pre-sentencing claims. Hence, appellant's Louis v. Blackburn due-process challenge is limited to his claim of ineffective counsel at sentencing, on which the magistrate and judge disagreed.\n\nThe magistrate concluded appellant had received ineffective assistance at the penalty hearing due to five flaws in defense counsel's representation: (1) the attorney's failure to present any mitigating evidence, (2) his consent to the admission of Dr. Crumbley's testimony, (3) his failure to request a presentence investigation report, (4) his failure to explain the circumstances of appellant's prior conviction, and (5) the brevity of his argument. The magistrate's conclusion that these omissions, viewed cumulatively, amounted to ineffective assistance of counsel was based partly on his analysis of the constitutional requirements for sentencing in capital cases and partly on his assessment of the reasons for the attorney's failure to ensure those requirements were met at Proffitt's trial. The district court addressed each of the bases for the magistrate's conclusion that appellant received ineffective assistance of counsel and rejected all five. We now consider whether the magistrate's conclusions on these issues were based on credibility choices concerning testimony at the evidentiary hearing and, if so, whether the district court's disagreement with the magistrate involved a rejection of such credibility choices.\n\nA. Failure to Present Mitigating Character Evidence\n\n1. The Evidence\n\nLockett v. Ohio, 438 U.S. 586, 98 S. Ct. 2954, 57 L. Ed. 2d 973 (1978), established a constitutional requirement in capital cases that the sentencing authority consider all mitigating evidence proffered by the defendant relating to his character and record and to the circumstances of the particular offense. Appellant's trial took place in 1974, some four years prior to the Supreme Court's decision in Lockett. At that time, the rule had not yet been established that the Constitution compels consideration of all relevant mitigating character evidence. Moreover, although the Supreme Court subsequently interpreted the Florida statute as not limiting sentencer consideration of mitigating evidence,\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e the ambiguous wording of the statute left open the question whether that act allowed consideration of mitigating character evidence other than that falling within the statutorily enumerated factors.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nAt the sentencing phase of appellant's trial his counsel presented no evidence of his character or personal history.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e The attorney's testimony at the magistrate's evidentiary hearing indicates that, at the time of appellant's trial, he understood the Florida statute as limiting the mitigating evidence that could be introduced to that falling within the statutory mitigating circumstances. Transcript of Evidentiary Hearing 190-191, 218-20. In a pre-trial motion to dismiss the indictment the defense attorney asserted inter alia that the Florida death-penalty statute unconstitutionally limited presentation of mitigating evidence.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e The trial judge denied the motion, however, and defense counsel made no further attempt to introduce non-statutory evidence. Although the attorney testified that his interpretation of the statute influenced his decision as to what evidence to present at the sentencing hearing, he suggested that other reasons were important as well. In particular, he stated that he believed that he could fit any mitigating evidence within the statutory mitigating factors, id. at 191-92, and that, in any event, the defendant had instructed him not to introduce any mitigating evidence. Id. at 220-21.\n\n2. The Magistrate's Findings\n\nIn assessing whether defense counsel's failure to present mitigating evidence constituted ineffective assistance, the magistrate recognized that Proffitt was one of the first capital cases tried under the then newly-enacted Florida death penalty statute and that Proffitt's trial preceded the Lockett decision by several years. The magistrate did not believe the attorney's \"misperception of the law\" was excused, however, by the indefiniteness of that constitutional rule at that time. The magistrate accepted defense counsel's testimony \"that he went into the trial assuming that he could not put on any evidence in mitigation except as set forth in the statute.\" Nonetheless, the magistrate concluded that the subsequent Supreme Court holding against limiting mitigation evidence was reasonably foreseeable and that the attorney had in fact anticipated it. The magistrate rejected defense counsel's statement that he introduced no mitigating evidence pursuant to an instruction from appellant based on his not wanting to spend twenty-five years in jail.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e The magistrate also rejected respondent's assertion that defense counsel failed to present mitigating evidence because no such evidence was available. The magistrate relied on a written proffer of evidence submitted by appellant in finding that the attorney could have procured favorable character evidence to present at the penalty phase. In addition to the proffer, defense counsel's testimony that he did not call appellant's mother because he could not think of any reason to do so except for \"the possible sympathy that it might have evoked from the jury,\" instead of supporting counsel's decision, in the magistrate's view bolstered appellant's claim that she should have been called as a witness to testify concerning appellant's character and personal history. The magistrate attributed defense counsel's failure to present mitigation evidence to a \"lack of preparation\" as well as to a mistake of law.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nIn summary, the evidence considered by the magistrate on the issue of defense counsel's failure to present mitigating evidence included (1) the trial record (including pretrial motions filed by defense counsel), (2) defense counsel's testimony at the evidentiary hearing, and (3) a written proffer of evidence submitted by appellant. The testimonial evidence he referred to in his memorandum included the defense attorney's statements concerning his understanding of the law respecting the Florida death penalty statute, his description of his preparation for the penalty stage of trial, and his statement that his failure to introduce mitigating evidence was in response to appellant's instructions. The magistrate accepted the attorney's testimony as to his interpretation of the statute and his preparation for the penalty stage of trial; indeed, the magistrate relied on this testimony in finding counsel's assistance inadequate. The magistrate disbelieved defense counsel's statement that he was following Proffitt's instructions in not introducing mitigating evidence, however, and the rejection of this testimony was critical to the magistrate's decision.\n\n3. The District Court's Opinion\n\nThe district court disagreed with the magistrate's conclusions concerning defense counsel's failure to introduce mitigating evidence at the penalty stage. The judge's disagreement stemmed primarily from a difference in his interpretation of the standard for judging ineffective assistance of counsel claims rather than from differences in his view of the evidence.\n\nThe judge agreed with the magistrate that defense counsel had labored under the impression that evidence in mitigation was limited to the specific mitigating circumstances enumerated in the statute. He disagreed, however, with the magistrate's conclusion that defense counsel had erroneously interpreted the law as it existed at the time of trial. The attorney's \"misapprehension of the law,\" the judge found, could \"only be characterized as a misapprehension through hindsight which has the advantage of Lockett v. Ohio decided four years later.\" The attorney's belief that evidence in mitigation was limited to the statutory circumstances was, in the judge's view, \"understandable,\" and his inclusion in a \"comprehensive\" pre-trial motion of the contention that, as such, the statute was unconstitutional did not undermine that conclusion.\n\nThe judge disagreed with the magistrate's assessment of the evidence insofar as the magistrate attributed counsel's omission to insufficient preparation rather than unavailability of mitigating evidence. The judge cited the defense attorney's testimony concerning his general preparation for trial -- testimony not referred to in the magistrate's memorandum. The judge relied on the attorney's statements that he had met with appellant weekly to discuss the case, that he had engaged the assistance of an investigator, that he had talked to witnesses in Tampa who knew and worked with appellant, and that he had personally traveled to Connecticut to interview members of appellant's family. Moreover, the judge found convincing the attorney's testimony that he had not called appellant's sister as a mitigating witness because she had a criminal record; that he had not called appellant's half-brother because he and appellant \"had not had a relationship for some time\"; that he had not called appellant's mother because she was ill and therefore unable to travel from Connecticut to Florida for the trial, because appellant did not want to get his family involved, and because the attorney felt appellant's mother had nothing of substance to contribute in any event; and that he had not called appellant's wife because he did not feel she would make a good witness since she was unhappy with appellant's lifestyle and because he was concerned that calling her to testify might constitute waiver of the marital privilege, which appellant had asserted to prevent her from testifying at the guilt phase of trial.\n\nIn accepting the above-described testimony, the judge did not reject any credibility determinations implicitly made by the magistrate in violation of Louis v. Blackburn, supra. Although the magistrate ultimately concluded that the attorney's failure was the product of his \"misperception of the law\" and \"not the result of tactical considerations,\" nothing in the magistrate's findings indicates he did not credit the above testimony. First, the magistrate's acceptance of appellant's proffer describing mitigating evidence that could have been introduced does not indicate that he rejected the defense attorney's testimony concerning why he did not present certain witnesses. In addition to appellant's relatives, whom the defense attorney declined to call, the proffer lists as possible witnesses several other persons, including one of appellant's supervisors and a psychiatrist who examined appellant after trial. The magistrate, without accepting \"all the details in the proffer as true,\" simply found that the information it contained generally indicated that the defense attorney could have called character witnesses on appellant's behalf. Since the magistrate did not expressly reject the defense attorney's testimony as to why he did not call certain of the enumerated witnesses, the only conclusion one can draw from his partial reliance on the proffer is that he felt it probable the attorney could have called some of the witnesses listed by appellant in the proffer and not that the reasons the attorney gave for rejecting particular witnesses were not believable. The district court judge, on the other hand, rejected appellant's written proffer of evidence, correctly concluding that the magistrate's reliance on the proffer was improper. Even if the proffer had constituted competent evidence, however, rejection by the judge of such non-testimonial evidence would not require a second evidentiary hearing under Louis v. Blackburn. Second, the magistrate's memorandum does not evince disbelief of the defense attorney's description of his general preparatory efforts. Rather, the magistrate thought the attorney's failure to plan a separate strategy for the sentencing phase rendered his assistance inadequate irrespective of whatever other preparatory efforts the attorney undertook before and during trial. Nor does the district court's contrary conclusion indicate that the judge disbelieved the defense attorney's testimony, which the magistrate accepted, to the effect that the attorney engaged in no special preparation for the penalty phase; the judge simply disagreed that such separate preparation was required to meet the legal standard of reasonably effective counsel. We conclude that the judge's rejection of the magistrate's recommended ruling that defense counsel's failure to present mitigating evidence rendered his representation inadequate did not depend on differences in credibility choices requiring a rehearing under Louis v. Blackburn.\n\nB. Absence of Presentence Investigation\n\nThe magistrate concluded that defense counsel erred by failing to request a presentence investigation report. Such investigation he found was necessary to provide information on appellant's character and background, on which no other information in the record had shed any light. Moreover, because \"the only view the jury and the judge had of the petitioner was the impersonal picture drawn by Dr. Crumbley of an obsessed killer,\" presentation to the sentencers of information about appellant's personality and characteristics could be critical.\n\nThe defense attorney's testimony at the evidentiary hearing on this point was as follows:\n\nQ Do you believe there was a pre-sentence investigation?\n\nA Should have been.\n\nQ If there was not one, should you have asked for one?\n\nA Should have been automatic.\n\nQ Why would it be automatic?\n\nA Well, let me put it this way. I know it's automatic now unless waived by statutory authority. Whether that statute was in effect at the time of Proffitt's trial, I can't tell you. But I do recall a pre-sentence investigation being run.\n\nQ Did you recall that there was a pre-sentence investigation?\n\nA I think so.\n\nQ And if there hadn't been one, should you have asked for one?\n\nA If there were such things as pre-sentence investigations then, and I think there were, I should have asked for one.\n\nTranscript of Evidentiary Hearing 275-76. As the magistrate noted, the record indicates that no presentence investigation was conducted for Proffitt's trial. The magistrate's conclusion that counsel's failure to demand such an investigation constituted ineffective assistance rested partly on the magistrate's opinion that the Crumbley testimony, which presented a very negative picture of appellant's character, created a strong need for \"humanizing information\" about appellant. The magistrate also viewed the statement by the attorney at the evidentiary hearing that he \"should have asked for\" a presentence investigation as an admission that he erred in not doing so.\n\nThe district court judge, noting that the attorney's testimony \"was given from unaided memory more than five years after the trial,\" found it \"noteworthy that counsel in his testimony talked about 'now' as distinguished from 'then.'\" The judge observed that the Florida rule governing presentence investigation reports in criminal cases was amended shortly before appellant's trial to extend authorization for trial courts to order presentence investigations from only \"cases in which probation is authorized by law\" to \"all cases in which the court has discretion as to what sentence may be imposed.\" Compare Rule 1.790, Fla.R.Crim.P. [adopted by Florida Supreme Court, 196 So.2d 124 (1967) (effective Jan. 1, 1968), as amended by 211 So.2d 203 (Fla. 1968) and 253 So. 2d 421 (Fla. 1971)] with Rule 3.710, Fla.R.Crim.P. [adopted by Florida Supreme Court, 272 So.2d 65 (Fla. 1972); codified at 34 Fla.Stat.Ann. § 3.710 (West 1975)]. Although the language of the new rule seems to encompass capital cases (as compared with the old rule, which was expressly limited to cases in which probation could be granted), the Committee Note indicates it was not intended to cover capital cases.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e The district court judge recognized that later cases have held Rule 3.710 neither requires nor precludes presentence investigations in capital cases, see Thompson v. State, 328 So.2d 1 (Fla.1976); Songer v. State, 322 So.2d 481 (Fla.1975); Swan v. State, 322 So.2d 485 (Fla.1975). Nonetheless, he found that \"at the time of Petitioner's trial in 1974, both historical as well as contemporary legal opinion and authority was to the effect that presentence investigation reports were not customary or necessary in capital cases; and, in fact, there was a serious question at the time that the use of a presentence report might even be error.\"\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nThe district judge's disagreement with the magistrate on whether counsel's failure to request a presentence investigation constituted ineffective assistance directly concerns the attorney's testimony at the evidentiary hearing. In some sense, the disagreement can be viewed as a difference in interpretation of that testimony. The difference was not a matter of credibility, however. This is not a situation in which the magistrate believed the attorney was telling the truth but the district court disbelieved his testimony. Rather, the magistrate interpreted the attorney's statement as a simple admission that he should have requested a presentence investigation, while the district judge interpreted it as a conditional admission that he should have requested one if the law authorized such investigations at the time of Proffitt's trial. These circumstances thus present us with an issue we have not previously faced: whether the reasoning of Louis v. Blackburn, supra, requires that a district court judge conduct a new evidentiary hearing when the judge's interpretation of a witness's testimony differs from that of the magistrate on a point critical to decision of the issue to which the testimony is relevant.\n\nThe rationale for requiring district judges to rehear testimony before rejecting credibility choices made by a magistrate lies in the recognition that credibility choices frequently depend on the trier of fact's assessment of the witness's demeanor. Obviously, observation of such factors as witnesses' facial expressions and tone of voice cannot be observed by reading a \"cold and impersonal written transcript.\" See Louis v. Blackburn, 630 F.2d at 1110. These factors not only reflect on the witness's credibility (i.e., on his sincerity and the degree of certainty with which he asserts matters about which he testifies) but may also reflect on the meaning the witness intends by the words he uses when such meaning is unclear from the words alone. We thus do not hold that a judge need never rehear testimony when he attributes a different meaning to words uttered by a witness than the meaning ascribed to them by the magistrate. Unless the words spoken by the witness are inherently ambiguous, however, the decision whether a second hearing is necessary must be left to the sound discretion of the district judge.\n\nIn the case before us, the witness's testimony was not inherently unclear. The attorney's remark that \"if there were such things as pre-sentence investigations then. . . I should have asked for one,\" itself suggests that at some point relevant to the period in question there was a change either in the law or in practice with respect to conducting presentence investigations. The magistrate made no apparent attempt to decipher the attorney's ambiguous reference to change and interpreted the attorney's testimony without the benefit of such understanding. The district judge, on the other hand, determined what changes had occurred and took them into consideration in interpreting the attorney's testimony. When viewed in the context of the changes in Florida's law governing presentence investigations that occurred shortly after Proffitt's trial, the import of the defense attorney's statement becomes clear: if Proffitt's trial took place after the statute requiring presentence investigations in felony cases was enacted, see note 25 supra, then he should have requested such an investigation; if the trial took place before it became clear that such investigations were proper in capital cases, however, he was admitting to no such obligation. Since the defense counsel's testimony was not inherently vague, and since any uncertainty it presented was resolvable by reference to matters within the judicial notice of the court, J.M. Blythe Motor Lines Corp. v. Blalock, 310 F.2d 77 (5th Cir. 1972) (federal courts will take judicial notice of state laws without requiring proof thereof), the district judge did not abuse his discretion in rejecting the magistrate's interpretation of that testimony without rehearing the witness.\n\nC. Failure to Object to Admission of Crumbley Testimony\n\nAt the penalty stage of appellant's trial, the defense attorney waived appellant's doctor-patient privilege and allowed the prosecutor to introduce Dr. Crumbley's testimony. After cross-examining the doctor, he argued that the testimony established two mitigating circumstances: that the crime was committed while appellant was under extreme mental or emotional stress and that appellant's capacity to appreciate the criminality of his conduct and to conform his conduct to the requirements of law was substantially impaired.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e The prosecutor countered these arguments by contending that the doctor's opinions concerning appellant's mental state were not reliable because the doctor had no psychiatric credentials and had performed no psychiatric tests on appellant. The prosecutor argued further that the doctor's testimony showed appellant was likely to kill other people in the future and was therefore a danger to society -- an argument not justified by any of the statutorily enumerated aggravating circumstances but nonetheless likely to appeal to the emotions of the jurors.\n\nAt the evidentiary hearing, the attorney testified that he allowed the introduction of the doctor's testimony because he thought it would establish mitigating circumstances. He also stated that he had hoped the trial judge, who under the Florida statute renders the final decision on sentencing, \"would be able to cut through the emotional impact of that information, recognize it as a mitigating circumstance, and rule in accordance with that recognition.\"\n\nThe magistrate concluded that defense counsel's failure to object to the admission of Dr. Crumbley's testimony was so grievous an error that \"a substantial contention can be made that this failure alone constitutes ineffective assistance of counsel.\" In the magistrate's view, the introduction of this \"frightening\" testimony was unnecessary to obtain evidence of psychiatric mitigating circumstances because the attorney could have obtained other psychiatric opinions through a privately employed psychiatrist. Moreover the magistrate noted that Dr. Crumbley's \"opinion as to whether the petitioner was laboring under emotional distress or a substantial mental impairment did not carry much force\" in light of his lack of psychiatric credentials. At the very least, the magistrate concluded, \"the use of Dr. Crumbley's testimony significantly increased the need to present humanizing information in order to counteract the dramatic impact of that testimony.\"\n\nThe district court judge disagreed that the attorney's decision to waive appellant's privilege constituted ineffective assistance of counsel. The judge found that the record of the penalty hearing, as well as defense counsel's testimony at the habeas hearing, showed that the attorney had had a \"cogent reason\" for his decision: \"the Petitioner had already been found guilty at that point in the proceeding and counsel expected to develop on cross-examination the existence of two of the statutory mitigating circumstances, namely, that the Petitioner acted 'under the influence of extreme mental or emotional disturbance,' and that 'the capacity of the defendant . . . to conform his conduct to the requirements of law was substantially impaired.'\" The judge found that defense counsel's cross-examination of the doctor at the penalty hearing was clearly directed toward developing the enumerated mitigating circumstances and that his argument at the habeas hearing reinforced the conclusion that development of those circumstances was the basis for his waiving the privilege. The judge disagreed with the magistrate's statement that Crumbley's testimony was unnecessary to establish the statutory mitigating factors:\n\nThe magistrate's reasoning is further flawed on this point because it presupposes the contemporary availability of such testimony from other qualified sources. The fact is that two other practicing psychiatrists subsequently appointed by the trial judge failed to support Dr. Crumbley's view concerning the mitigating circumstances about which he testified. Defense counsel used what he had, and it may well have been all he could get.\n\nThe judge's disagreement does not rest on rejection of credibility choices made by the magistrate. The factors on which the magistrate's conclusion rested included (1) the content of appellant's conversations with Dr. Crumbley, which the magistrate found to be \"frightening\"; (2) the doctor's \"lack of psychiatric credentials,\" which in the magistrate's view rendered his opinion \"without much force\"; and (3) a presumption that other psychiatric opinions supportive of the statutory mitigating circumstances could have been obtained. The magistrate did not derive any of these considerations from testimony given at the evidentiary hearing, nor could he have done so. The facts involved were all taken from the record of the penalty hearing, with the exception of the question of availability of alternative favorable psychiatric testimony, which may have been based partly on information contained in appellant's proffer. As noted above, the judge was not required to accept the written proffer. Neither, of course, was he required to accept the magistrate's assessment of facts contained in the trial record.\n\nAlthough the district judge's opinion indicates that he gave credence to defense counsel's testimony concerning the reasons for his decision to waive appellant's privilege, that testimony was not mentioned by the magistrate. The testimony established that despite the frightening nature of the evidence and its potential negative emotional impact on the jury, the defense attorney \"hope[d]\" that the judge would recognize it as a mitigating circumstance. Not only did the magistrate not explicitly reject this testimony, but such rejection is not implicitly required by his conclusion. See Louis v. Blackburn, 630 F.2d at 1108.\n\nD. Failure to Explain Prior Conviction\n\nUnder the Florida capital sentencing statute, prior criminal conduct by a defendant is relevant to sentencing in two respects. First, a defendant's prior conviction for \"another capital felony or [] a felony involving the use or threat of violence to the person\" may be considered by the sentencer as an aggravating circumstance. Fla.Stat.Ann. § 921.141(5) (b) (West Supp.1982). Second, that \"the defendant has no significant history of prior criminal activity\" is a statutory mitigating circumstance. Id. § 921.141(6) (a).\n\nAt the sentencing phase of appellant's trial, the prosecution introduced a certified copy of a judgment of conviction against appellant for \"Breaking and Entering Without Permission.\" The defense attorney made no attempt to explain the circumstances of this conviction, and appellant claims that the facts render the conviction insignificant either as an aggravating circumstance or to rebut the mitigating one.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e The magistrate accepted the explanation of the conviction provided by appellant in his written proffer and concluded that defense counsel should have presented these facts in rebuttal. No testimony or other evidence was presented to the magistrate either by the state or by appellant concerning the circumstances surrounding appellant's prior offense.\n\nThe district judge rejected the magistrate's conclusion that the defense attorney should have presented evidence to explain or rebut the prior conviction. Citing United States v. Gray, 565 F.2d 881, 887 (5th Cir.), cert. denied, 435 U.S. 955, 98 S. Ct. 1587, 55 L. Ed. 2d 807 (1978), the district court stated that, in its view, the magistrate mistakenly accepted \"speculative and inconcrete claims of 'what might have been if.'\" The judge's primary basis for disagreement, however, was his conclusion, after reviewing the record of the penalty hearing, that \"the matter of Petitioner's prior conviction was a low profile subject which, in terms of Petitioner's best interests at that time, might well have been handled by his counsel with utmost skill in choosing to leave it that way.\" Neither the magistrate's nor the judge's conclusions on this issue were based on any testimony at the evidentiary hearing; the opinions of each and the disagreement between them were based solely on appellant's written proffer and on a review of the trial transcript for the penalty phase. Hence Louis v. Blackburn, supra, provides no basis for challenging this portion of this district judge's order.\n\nE. Brevity of Argument\n\nSimilarly, the magistrate's comment that the generality and brevity of the defense counsel's argument at the sentencing hearing \"adds weight\" to appellant's ineffective counsel claim and the district judge's disagreement with that statement were based on their differing views about facts contained in the trial record and not on any evidence brought out at the evidentiary hearing.\n\nF. Conclusion\n\nFor the reasons stated above, we find that the district court's disagreement with the magistrate on appellant's ineffective counsel claim did not turn on rejection of credibility choices made by the magistrate. Hence appellant was not entitled, under Louis v. Blackburn, supra, to a second evidentiary hearing.\n\nIV. Substantive Issues\n\nA. Ineffective Assistance of Counsel at Guilt Phase\n\nAppellant contends his attorney's representation at trial was inadequate to meet minimum constitutional standards. This contention involves the testimony of the prosecution's key witness, a boarder named Mary Bassett who resided with appellant and his wife in their trailer. Bassett testified at trial that she was awakened early on the morning of the murder and overheard a conversation between appellant and his wife in which appellant related the facts of the killing. Appellant's attorney filed a pre-trial motion to suppress this testimony on the ground that the conversation was a confidential communication between appellant and his wife and therefore was privileged under Florida law. The attorney renewed the objection at the close of the testimony and, after an adverse ruling on that issue and appellant's ensuing conviction, asserted it as a ground of error on appeal. Appellant now argues that the defense attorney's failure to present evidence in support of the suppression motion violated his right to effective assistance of counsel.\n\nThe Florida Supreme Court affirmed the trial court's rejection of appellant's assertion of privilege. Appellant describes the court's holding as based on an absence of evidence supporting the alleged confidentiality of the conversation. He attributes this lack of evidence to his trial counsel and maintains that had the attorney put appellant or his wife on the stand or brought forth other available evidence, confidentiality would have been shown. We reject appellant's argument for two reasons. First, in contrast to appellant's characterization, the Florida Supreme Court not only found an absence of evidence that the statements were made in confidence; it found affirmative evidence in the record indicating that they were not. See Proffitt v. State, 315 So.2d 461, 465 (Fla.1975). Thus, even had the attorney presented contrary evidence the evidence would have been conflicting, and the likelihood that appellant would have prevailed on the privilege claim is not great. More importantly, appellant presents no convincing evidence that his attorney might have proffered to support the privilege claim. Appellant contends, for example, that he or his wife \"could have testified to their actual, subjective expectations of privacy.\" Such testimony would not have aided appellant, however, since Florida employs an objective standard of confidentiality. As the Florida Supreme Court stated on appellant's direct appeal, no privilege attaches to marital communications where the spouses knew or should have known that the communication was being overheard. Proffitt v. State, 315 So.2d at 464. The Florida court specifically found appellant and his wife \"were speaking in a manner and place where they had a reasonable chance of being overheard, and [] knew of that possibility at that time.\" Id. at 465. To the extent Mrs. Proffitt's testimony at the evidentiary hearing suggested different facts, the district court found her testimony incredible. Hence, even if appellant or his wife had testified and the court had believed they were unaware that Bassett could hear their conversation, such conversation would not have been privileged under Florida law. Nor does appellant's proffer of evidence that Bassett may have derived some of her information from conversations with appellant's wife or the police rather than by overhearing appellant convince us that his attorney failed him. The district court found the attorney had investigated fairly thoroughly how Bassett learned of the information about the killing and had eliminated the possibility that she had heard it from news reports, appellant's wife, or the police. These findings are not clearly erroneous. We therefore conclude that appellant received reasonably effective assistance at the guilt phase of his trial.\n\nB. Ineffective Assistance of Counsel at Penalty Phase\n\nAppellant's claim that he was denied effective legal assistance at the penalty phase of his trial rests on arguments substantially similar to those he made to the district court. We begin our analysis by considering the standard governing our review of the district court's holding and, in turn, of the performance rendered by appellant's trial attorney. As to the former, the Fifth Circuit has held that \"whether a defendant has enjoyed effective assistance of counsel is a mixed question of fact and law\" as to which \"the court of appeals must make an independent evaluation based on [the district court's] subsidiary findings.\" Washington v. Watkins, 655 F.2d 1346, 1354 (5th Cir. 1981).\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e In other words, the district court's conclusion on this question is entitled to no special deference; rather this court must review the record of counsel's \"actual performance [in] conducting the defense\" and determine independently whether the constitutional standard was met. Id. at 1355. Once having reviewed the record, the sixth amendment standard we must apply in assessing counsel's performance is that of \"reasonably effective assistance.\" This standard is not to be viewed as a guarantee of \"errorless counsel\"; nor may counsel's performance be judged by benefit of hindsight. Id. Rather, the assistance rendered must be evaluated \"from the perspective of counsel, taking into account all of the circumstances of the case, but only as those circumstances were known to him at the time in question.\" Id. at 1356. We note further that the constitutional standard for effective counsel is no more stringent in capital cases than in cases where less severe punishments are imposed. Nonetheless, the seriousness of the charges against the defendant is a factor that must be considered in assessing counsel's performance. Id. at 1357. With this standard in mind, we now consider the alleged defects that appellant claims rendered his trial counsel's representation inadequate.\n\n1. Failure to Present Character Witnesses\n\nAppellant argues that his attorney should have called character witnesses to testify on his behalf at the sentencing hearing. The magistrate agreed that the attorney erred by not presenting \"humanizing information [] [] to counteract the dramatic impact of [Dr. Crumbley's] testimony.\" We do not dispute that the jury's impression of appellant, based on the evidence introduced by the prosecution at the guilt and penalty stages of his trial, was possibly unbalanced. We further agree that a cogent presentation of character evidence could have influenced the jury to recommend a life sentence.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e We do not agree, however, with the magistrate's conclusion that the attorney's failure to introduce such non-statutory mitigating evidence rendered his assistance ineffective. Even accepting arguendo appellant's allegation that character witnesses willing to testify in his favor were available at the time of his trial, we cannot say that the attorney's performance, evaluated \"from the perspective of counsel, taking into account the circumstances . . . known to him at the time,\" Washington v. Watkins, 655 F.2d at 1356, was not reasonably effective.\n\nAt the time of appellant's trial in 1974, the law concerning capital sentencing was in a state of reformation. The Supreme Court's holding in Lockett v. Ohio, 438 U.S. 586, 98 S. Ct. 2954, 57 L. Ed. 2d 973 (1978), that the sentencer in a capital case must be free to consider all relevant mitigating evidence had not yet been decided; nor was that result clearly foreshadowed by Furman v. Georgia, 408 U.S. 238, 92 S. Ct. 2726, 33 L. Ed. 2d 346 (1972) -- the only contemporary death-penalty case decided by the United States Supreme Court prior to appellant's trial. Moreover, Florida's capital sentencing statute was barely a year old at the time of appellant's trial, and the only Florida Supreme Court case addressing its constitutionality supported an interpretation of the statute as limiting the mitigating evidence that could be considered to that falling within the seven statutory factors.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e In view of these facts, the defense attorney's belief that he could not, under the Florida statute, introduce evidence of mitigating factors not listed in Fla.Stat. § 921.141(6) was entirely reasonable. His decision not to call witnesses at the penalty stage to testify about appellant's general character and background was therefore justifiable and fully within the sixth amendment standard of reasonably effective assistance.\n\n2. Failure to Request Presentence Investigation Report\n\nAppellant claims that his trial attorney's failure to request a presentence investigation report prior to sentencing \"left the court completely in the dark concerning petitioner's individual circumstances and constituted gross ineffectiveness of counsel.\" As noted above, the magistrate agreed with appellant but the district court did not. We agree with the conclusion reached by the district court for two reasons. First, appellant's argument and the magistrate's recommendation are predicated largely on the assumption that a presentence investigation, had it been conducted, would have revealed favorable evidence concerning appellant's character and background\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e that in turn could have served as the basis for a claim of mitigating circumstances. To the extent such investigation might have provided evidence of non-statutory mitigating circumstances, appellant's argument must fail for the same reason as his claim concerning the attorney's failure to present character witnesses; the attorney reasonably understood the law as limiting mitigating evidence to the statutory mitigating factors. Second, any claim that a presentence investigation would have revealed evidence of statutory mitigating factors, or evidence that would have rebutted the statutory aggravating factors, must also fail. Appellant has submitted no evidence demonstrating that a presentence investigation conducted at the time of his trial would have revealed evidence substantiating any statutory mitigating factors or repudiating any of the aggravating factors asserted by the prosecution. Moreover, having reviewed the testimony of defense counsel at the evidentiary hearing and the rules and cases relied on by the district court, we concur in the court's finding that at the time of appellant's trial Florida law did not provide for presentence investigations in capital cases.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e Under these circumstances, the attorney's failure to request such investigation cannot be viewed as falling below the level of reasonably effective assistance.\n\n3. Mishandling of Psychiatric Evidence\n\nAppellant discusses at length his attorney's handling of the psychiatric evidence at the sentencing phase of his trial. At the core of his argument is the fact that the attorney learned of the conversations between appellant and Dr. Crumbley by a telephone call from the doctor the night before the trial and, without requesting a continuance or further investigating this matter, relied solely on Crumbley's testimony to establish a mitigation defense at appellant's sentencing hearing. Appellant enumerates many ways in which the attorney failed him, arguing that he should have requested a continuance,\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e obtained expert psychiatric assistance,\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e and perhaps should not have allowed admission of Dr. Crumbley's testimony at all. While having reviewed the transcript of the evidentiary hearing and the record of appellant's sentencing proceeding we may in hindsight agree that the attorney's performance was less than stellar, we cannot conclude that it fell below the standard of reasonably effective assistance.\n\n4. Other Ineffective Assistance Arguments\n\nAppellant details a long list of other shortcomings in his trial counsel's performance to buttress his ineffective assistance claim, including the brevity of the attorney's sentencing argument and his failure to object to various arguments and evidence presented by the prosecution. As we have noted, the constitutional right to effective legal assistance is not a guarantee of errorless counsel, Herring v. Estelle, 491 F.2d 125, 127 (5th Cir. 1974) (quoting MacKenna v. Ellis, 280 F.2d 592, 599 (5th Cir. 1960), modified, 289 F.2d 928 (5th Cir.) (en banc), cert. denied, 368 U.S. 877, 82 S. Ct. 121, 7 L. Ed. 2d 78 (1961)); nor will we assess counsel's effectiveness \"through the finely ground lenses of 20/20 hindsight.\" Washington v. Watkins, 655 F.2d at 1356. We therefore find appellant's contentions without merit.\n\nC. Denial of Confrontation Rights in Using Information from Court-Appointed Psychiatrists\n\nAfter the jury rendered its advisory sentence of death the trial judge, in the presence of appellant and his counsel, suggested that appellant be examined by two court-appointed psychiatrists prior to the final sentence determination. Appellant's attorney agreed to the examinations,\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e and appellant was subsequently seen by Drs. Coffer and Sprehe. Both doctors submitted reports to the court, which stated that appellant was competent at the time of the examination and had been capable of distinguishing right from wrong when he committed the offense. Dr. Sprehe's report additionally opined that appellant's \"long standing compulsion to kill someone . . . did not involve a break in reality testing and did not involve psychosis. . . .\" Dr. Sprehe described appellant as having\n\na long standing sociopathic personality characterized by resort to violence as a solution to his life problems and [][] a rather chaotic life history with a lot of anti-social behavior including an Undesirable Discharge from the Armed Forces and numerous minor criminal convictions and other charges where he was not convicted. He had three rather chaotic marriages and has generally lived his life outside the usual standards of society.\n\nFollowing submission of the reports the judge ordered a hearing, at which the defense attorney waived appellant's right of presence. Dr. Coffer appeared and testified that he did not believe appellant committed the murder while under the influence of extreme emotional or mental pressure nor that appellant's capacity to conform his conduct to law was substantially impaired at the time of the offense.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e Dr. Sprehe was unable to attend, and defense counsel requested an opportunity to cross-examine him about the report. The judge indicated he would allow Sprehe's testimony to be taken and made part of the record at a later date but proceeded to sentence petitioner without it.\n\nAppellant raises two arguments with respect to the psychiatrists' reports and testimony. First, he claims the court's consideration of Dr. Sprehe's report without affording him an opportunity to confront and cross-examine Dr. Sprehe violated his rights to confrontation, due process, and freedom from cruel and unusual punishment. Second, appellant contends his constitutional right to be present at trial was violated by Dr. Coffer's testifying outside his presence and without his knowledge. The district court rejected these claims. The court held that appellant's rights were not violated by his not being afforded an opportunity to cross-examine Dr. Sprehe because the trial judge \"did not consider [Dr. Sprehe's] report in imposing sentence.\" Moreover, while accepting appellant's argument that his attorney's waiver of his right to be present during Dr. Coffer's testimony was ineffectual because not authorized by appellant personally, the court held that appellant's nonconsensual absence was harmless error.\n\n1. Use of Dr. Sprehe's Report Without Affording Appellant Opportunity for Cross-Examination\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e\n\nThe right to cross-examine adverse witnesses is guaranteed to criminal defendants by the confrontation clause of the sixth amendment. Douglas v. Alabama, 380 U.S. 415, 418, 85 S. Ct. 1074, 1076, 13 L. Ed. 2d 934 (1965); Pointer v. Texas, 380 U.S. 400, 404, 85 S. Ct. 1065, 1068, 13 L. Ed. 2d 923 (1965). Indeed, it has been said that\n\nthe primary object of the [confrontation clause] was to prevent depositions or ex parte affidavits . . . being used against the prisoner in lieu of a personal examination and cross-examination of the witness in which the accused has an opportunity, not only of testing the recollection and sifting the conscience of the witness, but of compelling him to stand face to face with the jury in order that they may look at him, and judge by his demeanor upon the stand and the manner in which he gives his testimony whether he is worthy of belief.\n\nDouglas v. Alabama, 380 U.S. at 418-19, 85 S. Ct. at 1076-77 (quoting Mattox v. United States, 156 U.S. 237, 242-43, 15 S. Ct. 337, 339-40, 39 L. Ed. 409 (1895)). Accord Davis v. Alaska, 415 U.S. 308, 315-16, 94 S. Ct. 1105, 1109-10, 39 L. Ed. 2d 347 (1974). Cross-examination has been placed on a par with the right to notice and an opportunity to be heard and the right to counsel, which are considered fundamental minimum requirements of a fair trial comporting with the due process clause. Chambers v. Mississippi, 410 U.S. 284, 294-95, 93 S. Ct. 1038, 1045, 35 L. Ed. 2d 297 (1973); Pointer v. Texas, 380 U.S. at 405, 85 S. Ct. at 1068 (both quoting In re Oliver, 333 U.S. 257, 273, 68 S. Ct. 499, 507, 92 L. Ed. 682 (1948)). So basic is the right that the Supreme Court has held that its denial, \"without waiver . . . would be constitutional error of the first magnitude and no amount of showing of want of prejudice would cure it.\" Smith v. Illinois, 390 U.S. 129, 131, 88 S. Ct. 748, 749, 19 L. Ed. 2d 956 (1968); Brookhart v. Janis, 384 U.S. 1, 3, 86 S. Ct. 1245, 1246, 16 L. Ed. 2d 314 (1966).\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e\n\nThe rights guaranteed by the sixth amendment, including the right to cross-examination, are only applicable to proceedings that constitute critical stages of the trial. See, e.g., United States v. Harris, 458 F.2d 670, 677-78 (5th Cir.), cert. denied, 409 U.S. 888, 93 S. Ct. 195, 34 L. Ed. 2d 145 (1972) (preliminary hearing); Ryan v. State of Montana, 580 F.2d 988, 992 (9th Cir. 1978), cert. denied, 440 U.S. 977, 99 S. Ct. 1548, 59 L. Ed. 2d 796 (1979) (probation revocation and deferred sentencing hearing); Polizzi v. United States, 550 F.2d 1133, 1138 (9th Cir. 1976) (judge's in camera questioning of jurors re possible improper influence); United States v. Mitchell, 540 F.2d 1163, 1165 n.1 (3d Cir. 1976), cert. denied, 429 U.S. 1099, 97 S. Ct. 1119, 51 L. Ed. 2d 547 (1977) (preliminary hearing). But cf. Gagnon v. Scarpelli, 411 U.S. 778, 790, 93 S. Ct. 1756, 1763, 36 L. Ed. 2d 656 (1973) (due process guarantees right of cross-examination in probation revocation hearing); Morrissey v. Brewer, 408 U.S. 471, 489, 92 S. Ct. 2593, 2604, 33 L. Ed. 2d 484 (1972) (limited right of cross-examination applies to probation revocation proceedings). Traditionally, sentencing hearings have not been accorded the significance of the guilt-determination portion of trial; by and large, sentencing has been left to the broad discretion of the judge or jury, United States v. Tucker, 404 U.S. 443, 447, 92 S. Ct. 589, 591, 30 L. Ed. 2d 592 (1972); McGautha v. California, 402 U.S. 183, 91 S. Ct. 1454, 28 L. Ed. 2d 711 (1971), and courts have declined to apply to sentencing most of the procedural rights guaranteed by the sixth amendment. E.g., Williams v. New York, 337 U.S. 241, 69 S. Ct. 1079, 93 L. Ed. 1337 (1949) (confrontation and cross-examination); United States v. Glick, 463 F.2d 491, 494 (2d Cir. 1972) (factfinding by jury). See also Hill v. United States, 368 U.S. 424, 82 S. Ct. 468, 7 L. Ed. 2d 417 (1962) (right of allocution at sentencing not of constitutional dimension). But see Mempa v. Rhay, 389 U.S. 128, 88 S. Ct. 254, 19 L. Ed. 2d 336 (1967) (right to assistance of counsel applies at sentencing); Specht v. Patterson, 386 U.S. 605, 87 S. Ct. 1209, 18 L. Ed. 2d 326 (1967) (due process guarantees hearing and confrontation in separate post-trial proceeding for indeterminate commitment of convicted sex offenders). See generally Note, The Constitutionality of Statutes Permitting Increased Sentences for Habitual or Dangerous Criminals, 89 Harv.L.Rev. 356, 359-73 (1975). The justification for the refusal to extend the procedural limitations of the trial to the sentencing hearing was in part historical and in part rested on the belief that modern penological policies, which favor sentencing based on the maximum amount of information about the defendant, would be thwarted by restrictive procedural and evidentiary rules. Williams v. New York, 357 U.S. at 246-50, 69 S. Ct. at 1082-84. The possibilities of delay in criminal administration and retrial of issues not relevant to the determination of guilt are additional considerations underlying the result in these cases. Id. at 250, 69 S. Ct. at 1084.\n\nAlthough the absence of procedural requirements designed to ensure fairness in sentencing has been widely criticized, Note, supra at 360; see, e.g., Kadish, Legal Norm and Discretion in the Police and Sentencing Processes, 75 Harv.L.Rev. 904, 926-29 (1962), such has remained the constitutional rule with respect to sentencing in non-capital cases. E.g., Farrow v. United States, 580 F.2d 1339, 1353-54 n.25 (9th Cir. 1978) (en banc); United States v. Fatico, 579 F.2d 707, 711-12 n.10 (2d Cir. 1978), appeal after remand, 603 F.2d 1053 (2d Cir. 1979), cert. denied, 444 U.S. 1073, 100 S. Ct. 1018, 62 L. Ed. 2d 755 (1980). The constitutional requirements governing capital sentencing, by contrast, have undergone substantial evolution in the wake of Furman v. Georgia. The thrust of Furman and its progeny is that the risk of arbitrary imposition of the death penalty inherent in sentencing determinations made without substantive and procedural standards conflicts with the eighth amendment prohibition on cruel and unusual punishment. Because the death penalty, unlike other punishments, is permanent and irrevocable, the procedures by which the decision to impose a capital sentence is made bring into play constitutional limitations not present in other sentencing decisions. See Enmund v. Florida, 458 U.S. 782,, 102 S. Ct. 3368, 3375-76, 73 L. Ed. 2d 1140 (1982); Lockett v. Ohio, 438 U.S. at 605, 98 S. Ct. at 2965; Gardner v. Florida, 430 U.S. 349, 357-58, 97 S. Ct. 1197, 1204, 51 L. Ed. 2d 393 (1977); Woodson v. North Carolina, 428 U.S. 280, 303-04, 305, 96 S. Ct. 2978, 2990-91, 49 L. Ed. 2d 944 (1976) (opinion of Stewart, Powell, and Stevens, JJ.); Gregg v. Georgia, 428 U.S. 153, 181-88, 96 S. Ct. 2909, 2928-32, 49 L. Ed. 2d 859 (opinion of Stewart, Powell, and Stevens, JJ.); Furman v. Georgia, 408 U.S. at 286-91, 92 S. Ct. at 2750-53 (Brennan, J., concurring); id. at 306, 92 S. Ct. at 2760 (Stewart, J., concurring); id. at 314-71, 92 S. Ct. at 2764-2793 (Marshall, J., Concurring). The Supreme Court has adhered to the traditional concept of individualized sentencing, see Lockett v. Ohio, 438 U.S. 586, 98 S. Ct. 2954, 57 L. Ed. 2d 973 (1978); Woodson v. North Carolina, 428 U.S. at 303-04, 96 S. Ct. at 2990, but has imposed procedural, as well as substantive, limitations on capital sentence decisionmaking. The view, once prevalent, that the procedural requirements applicable to capital sentencing are no more rigorous than those governing non-capital sentencing decisions, see, e.g., McGautha v. California, 402 U.S. at 217, 91 S. Ct. at 1472; Williams v. New York, 337 U.S. at 251-52, 69 S. Ct. at 1085, is no longer valid. Gardner v. Florida, 430 U.S. at 357-58, 97 S. Ct. at 1204.\n\nAlthough the Court has held capital sentencing proceedings must meet certain procedural requirements, it has not yet delineated the exact scope of constitutional procedural protection to which capital defendants are entitled. See Gardner v. Florida, 430 U.S. at 358 n.9, 97 S. Ct. at 1204 n.9. Whether the right to cross-examine adverse witnesses extends to capital sentencing proceedings has not been specifically addressed by the Supreme Court and is an issue of first impression in this Circuit. We must therefore decide this question in accord with the general principles articulated by the Supreme Court in its recent death penalty decisions.\n\nThe focus of the Court's current capital sentencing decisions has been toward minimizing the risk of arbitrary decisionmaking. See, e.g., Eddings v. Oklahoma, 455 U.S. 104,, 102 S. Ct. 869, 874-76, 71 L. Ed. 2d 1, 8-9 (1982); id. U.S. at, 102 S. Ct. at 878, 71 L. Ed. 2d at 13 (O'Connor, J., concurring); Godfrey v. Georgia, 446 U.S. 420, 427-28, 100 S. Ct. 1759, 1764-65, 64 L. Ed. 2d 398; Lockett v. Ohio, 438 U.S. at 605, 98 S. Ct. at 2965; Gardner v. Florida, 430 U.S. at 358, 97 S. Ct. at 1204; Gregg v. Georgia, 428 U.S. at 188, 96 S. Ct. at 2932 (opinion of Stewart, Powell, and Stevens, JJ.); id. at 189, 96 S. Ct. at 2932 (opinion of White, J., concurring); Furman v. Georgia, 408 U.S. at 248-49 \u0026 n.11, 92 S. Ct. at 2731 \u0026 n.11 (opinion of Douglas, J.); id. at 309-20, 92 S. Ct. at 2762-67 (opinion of Stewart, J.); id. at 313, 92 S. Ct. at 2764 (opinion of White, J.). Whereas earlier cases had focused on the quantity of information before the sentencing tribunal, recently the Court has shown greater concern for the quality of such information. Gardner v. Florida, 430 U.S. at 359, 97 S. Ct. at 1205. Thus, it has recognized the defendant's interest both in presenting evidence in his favor, Eddings v. Oklahoma, 455 U.S. 104, 102 S. Ct. 869, 71 L. Ed. 2d 1 (1982); Lockett v. Ohio, supra, and in being afforded the opportunity to explain or rebut evidence offered against him. Gardner v. Florida, 430 U.S. at 362, 97 S. Ct. at 1207. Reliability in the factfinding aspect of sentencing has been a cornerstone of these decisions. Id. at 359-60, 362, 97 S. Ct. at 1205; Woodson v. North Carolina, 428 U.S. at 305, 96 S. Ct. at 2991.\n\nIn Gardner v. Florida, supra, the Supreme Court held that a judge's reliance, in imposing the death penalty, on information not disclosed to the defendant or his attorney violated the defendant's rights to due process and freedom from cruel and unusual punishment. Gardner is premised on the principle that death sentences may not constitutionally be imposed on the basis of information that the capital defendant has been afforded no opportunity to rebut. See id. at 362, 97 S. Ct. at 1206. The holding in Gardner, narrowly viewed, simply prohibits the use of \"secret information\"; the Court did not in that case address the scope of the capital defendant's procedural rights in attempting to rebut information that has openly been presented to the sentencing tribunal. In reaching its decision in Gardner, however, the Court emphasized the unacceptability of the \"risk that some information accepted in confidence may be erroneous, or may be misinterpreted, by the . . . sentencing judge.\" Id. at 359, 97 S. Ct. at 1205. Moreover, the Court expressly recognized the importance of participation by counsel and adversarial debate to eliciting the truth and \"evaluating the relevance and significance of aggravating and mitigating\" evidence. Id. at 360, 97 S. Ct. at 1205. The Supreme Court's emphasis in Gardner and other capital sentencing cases on the reliability of the factfinding underlying the decision whether to impose the death penalty convinces us that the right to cross-examine adverse witnesses applies to capital sentencing hearings. The Supreme Court has recognized cross-examination as \"the 'greatest legal engine ever invented for the discovery of truth.'\" California v. Green, 399 U.S. 149, 158, 90 S. Ct. 1930, 1935, 26 L. Ed. 2d 489 (1970) (quoting 5 J. Wigmore, Evidence § 1367 (3d ed.1940)).\n\nThe right of cross-examination is more than a desirable rule of trial procedure. It is implicit in the constitutional right of confrontation, and helps assure the \"accuracy of the truth-determining process.\" It is, indeed, \"an essential and fundamental requirement for the kind of fair trial which is this country's constitutional goal.\" Of course, the right to confront and to cross-examine is not absolute and may, in appropriate cases, bow to accommodate other legitimate interests in the criminal process. But its denial or significant diminution calls into question the ultimate \"'integrity of the fact-finding process '\" and requires that the competing interest be closely examined.\n\nChambers v. Mississippi, 410 U.S. 284, 295, 93 S. Ct. 1038, 1045, 35 L. Ed. 2d 297 (1973) (citations omitted; emphasis added). Where expert witnesses are employed, cross-examination is even more crucial to ensuring accurate fact-finding. Since, as in this case (see note 36 and accompanying text supra), information submitted by an expert witness generally consists of opinions, cross-examination is necessary not only to test the witness's knowledge and competence in the field to which his testimony relates but also to elicit the facts on which he relied in forming his opinions.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e\n\nFinally, we note that the decision of the former Fifth Circuit in Smith v. Estelle, 602 F.2d 694 (5th Cir. 1979), aff'd, 451 U.S. 454, 101 S. Ct. 1866, 68 L. Ed. 2d 359 (1981), buttresses our conclusion that appellant had a constitutional right to cross-examine Dr. Sprehe before the doctor's report could be used in determining sentence. In Smith, we reversed a death sentence that was based in part on the testimony of a psychiatrist whose name the prosecution had intentionally omitted from its witness list. A primary basis for the decision in that case was that the prosecution's failure to disclose its intent to call the doctor prevented the defendant's counsel from conducting effective cross-examination. See id. at 699-701 \u0026 n.7.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e Although the court did not specifically address whether the defendant had a constitutional right to cross-examine the psychiatrist, it concluded that his testimony, \"not effectively cross-examined by the [defense attorneys,] [] carries no assurance of reliability whatever,\" id. at 701, and hence that its use in sentencing the defendant violated the principles set forth in Gardner v. Florida. The reasoning in Smith clearly supports the view that the right to cross-examine adverse witnesses applies to capital sentencing proceedings, at least where necessary to ensure the reliability of the witnesses' testimony.\n\nThe Supreme Court's analysis in Gardner indicates that abridgment of fundamental constitutional rights at capital sentencing may be justified in some instances where the state demonstrates a compelling interest. See Gardner v. Florida, 430 U.S. at 358-61, 97 S. Ct. at 1205-06. See also Smith v. Estelle, 602 F.2d at 701-02. Appellee suggests no cogent reason for denying appellant the opportunity to cross-examine Dr. Sprehe, however. Nor does any justification appear in the record, which indicates neither the reason for Sprehe's absence from the hearing nor why the judge chose to proceed with sentencing without his cross-examination. The most likely explanation of the judge's actions was that he wished to avoid further delay in sentencing appellant. As the Supreme Court noted in Gardner in a similar context:\n\nIn those cases in which the accuracy of a report is contested, the trial judge can avoid delay by disregarding the disputed material. Or if the disputed matter is of critical importance, the time invested in ascertaining the truth would surely be well spent if it makes the difference between life and death.\n\nGardner v. Florida, 430 U.S. at 359-60, 97 S. Ct. at 1205.\n\nThe district court did not address the merits of appellant's confrontation clause claim with respect to Dr. Sprehe's report because it found that \"the trial court did not consider Dr. Sprehe's report in imposing sentence.\" We are bound by this factual finding unless it is clearly erroneous. Baty v. Balkcom, 661 F.2d 391, 394 n.7 (5th Cir. 1981). The district court relied on statements by Judge Burnside, who presided at appellant's trial, to the effect that he did not use Dr. Sprehe's report in imposing sentence. A review of the judge's testimony reveals that he qualified his statement by explaining that he did receive and read Dr. Sprehe's report and considered it for the limited purpose of ascertaining whether it supported the psychiatric mitigating circumstances.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e After determining that the report did not support such mitigating factors, he did not consider it further. The court's reliance on this testimony is flawed in two respects. First, the district court should not have considered the trial judge's post-decision statements concerning the influence various facts had on his decision. The judge's testimony was not limited to matters of basic, historical fact but directly addressed the effect of the psychiatric evidence on his sentencing decision. Such post-decision statements by a judge or juror about his mental processes in reaching decision may not be used as evidence in a subsequent challenge to the decision. See Fayerweather v. Ritch, 195 U.S. 276, 25 S. Ct. 58, 49 L. Ed. 193 (1904); United States v. Crouch, 566 F.2d 1311, 1316 (5th Cir. 1978). Second, even had it been competent evidence, the judge's testimony does not support a finding that he made no use of the report. We therefore hold the district court's finding that the trial court did not consider Sprehe's report was clearly erroneous, and appellant was entitled to cross-examine Dr. Sprehe.\n\n2. Taking Dr. Coffer's Testimony in Appellant's Absence\n\nA defendant's right to be present at all stages of a criminal trial derives from the confrontation clause of the sixth amendment and the due process clause of the fourteenth amendment. Illinois v. Allen, 397 U.S. 337, 338, 90 S. Ct. 1057, 1058, 25 L. Ed. 2d 353 (1970); Hopt v. Utah, 110 U.S. 574, 579, 4 S. Ct. 202, 204, 28 L. Ed. 262 (1884).\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e This right extends to all hearings that are an essential part of the trial -- i.e., to all proceedings at which the defendant's presence \"has a relation, reasonably substantial, to the fulness of his opportunity to defend against the charge.\" Snyder v. Massachusetts, 291 U.S. 97, 105-06, 54 S. Ct. 330, 332, 78 L. Ed. 674 (1934). Compare Hopt v. Utah, supra (defendant has right to be present at impaneling of jurors); Bartone v. United States, 375 U.S. 52, 84 S. Ct. 21, 11 L. Ed. 2d 11 (1963) (court cannot impose sentence in absence of defendant); with United States v. Howell, 514 F.2d 710 (5th Cir. 1975), cert. denied, 429 U.S. 838, 97 S. Ct. 109, 50 L. Ed. 2d 105 (1976) (no right to be present at in camera conference concerning attempted bribe of juror); United States v. Gradsky, 434 F.2d 880 (5th Cir. 1970), cert. denied, 409 U.S. 894, 93 S. Ct. 203, 34 L. Ed. 2d 151 (1971) (right to presence does not extend to evidentiary hearing on suppression motion). We have already held that the penalty phase is an integral part of a capital trial for purposes of cross-examination. See text supra at 35-41. For similar reasons, we conclude that the capital defendant's interest in attending his sentencing hearing is as great as his interest in being present at the guilt-determining stage. Cf. Gardner v. Florida, 430 U.S. at 358, 97 S. Ct. at 1204 (sentencing is \"critical stage\" of capital trial). Hence we hold that the right to be present extends to the sentencing as well as the guilt portion of a capital trial.\n\nThe hearing at which Dr. Coffer testified, however, was not part of the statutory sentencing proceeding but rather was an ad hoc proceeding scheduled by the trial judge after completion of the formal sentencing hearing to allow cross-examination concerning court-ordered reports. The state argues that this \"post-trial hearing\" is analogous to a suppression hearing, to which the Fifth Circuit has held the defendant's right of presence does not extend. United States v. Gradsky, supra. Accord United States v. Bell, 464 F.2d 667 (2d Cir.), cert. denied, 409 U.S. 991, 93 S. Ct. 335, 34 L. Ed. 2d 258 (1972). The function of the proceeding and its significance with respect to the trial, rather than the timing or sequence of events, is dispositive of the presence question, however. The psychiatric reports were evidence ordered by the court for its consideration in determining appellant's sentence. The purpose of the hearing was obviously to allow the attorneys to question the authors of those reports about the factual premises on which the reports were based, to probe further into the conclusions drawn by the two doctors, and otherwise to test the accuracy of the reports and their relevance to appellant's sentence. That the judge did not request the reports until after the jury had completed its advisory sentencing does not refute their evidentiary function nor preclude the possibility that they critically affected the sentencing decision. The judge is the ultimate decisionmaker under Florida's capital sentencing scheme, and his role in sentencing is as important as that of the jury -- if not more so. See Proffitt v. Florida, 428 U.S. at 251-53, 96 S. Ct. at 2966-67.\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e We therefore hold that the hearing at which Dr. Coffer testified was a critical stage of appellant's trial at which he had a constitutional right to be present.\n\nThe state argues that even if appellant was entitled to attend the hearing, his attorney waived that right. We reject this argument for two reasons.\n\nFirst, our review of the relevant case law convinces us that presence at a capital trial is non-waivable. The only precedents directly ruling on the issue are early Supreme Court cases holding that the right to presence in capital cases is so fundamental that the defendant cannot waive it. Diaz v. United States, 223 U.S. 442, 455, 32 S. Ct. 250, 253, 56 L. Ed. 500 (1912); Hopt v. Utah, 110 U.S. 574, 579, 4 S. Ct. 202, 204, 28 L. Ed. 262 (1884). Accord Near v. Cunningham, 313 F.2d 929, 931 (3d Cir. 1963).\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e More recently, commentators have interpreted dictum in Illinois v. Allen, 397 U.S. 337, 90 S. Ct. 1057, 25 L. Ed. 2d 353 (1970) as authorizing a limited exception to the no-waiver rule for defendants who wilfully disrupt their trials, 3 C. Wright, Federal Practice and Procedure § 723 (Supp.1980 at 754 n.28); 8B J. Moore, Federal Practice para. 43.02[2] at 43-9 (2d ed. 1981).\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e The state does not claim that appellant disrupted or hindered any part of his trial, however; hence such exception is inapplicable to this case. Another contemporary decision -- Drope v. Missouri, 420 U.S. 162, 182, 95 S. Ct. 896, 909, 43 L. Ed. 2d 103 (1975) -- indicates that the Supreme Court may reconsider the issue of waiver of presence in a capital case. Until the Court expressly overrules its decisions in Diaz and Hopt, however, we are bound by the rule established in those cases that a capital defendant's right to presence is non-waivable.\n\nSecond, even were we to find sufficient support in the Allen and Drope cases for a departure from the no-waiver rule, we would at least adhere to the knowing-and-voluntary-consent requirement established in the non-capital context.\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e Appellee does not deny that appellant was neither apprised of the hearing with Dr. Coffer nor afforded an opportunity to assert his right to attend; hence appellant did not knowingly or voluntarily waive his right to presence.\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e\n\nThe state's final argument with respect to the Coffer testimony is that any error in denying appellant's right to hear that testimony was harmless.\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e In the district court, the state presented deposition testimony of the trial judge to the effect that he ordered the doctors' reports and testimony solely to determine the existence of mitigating factors. Relying on this testimony, the district court found that appellant could have benefited from this psychiatric evidence only if it had supported a finding of mitigating factors. Even had appellant been present at the hearing and able to aid his attorney's cross-examination of Dr. Coffer, the district court reasoned, the doctor would not likely have completely reversed his position to support the mitigating circumstances claimed by appellant; hence, appellant's absence did not prejudice him.\n\nWe cannot agree with the district court's approach.\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e We note again that the district court's consideration of the trial judge's testimony concerning his use of the psychiatrists' reports and their effect on his decision was improper. See text supra at 42. Thus, if the district court's finding that the psychiatrists' reports and testimony did not affect the trial judge's assessment of aggravating circumstances was supported solely by the latter's testimony, that finding could not stand. Review of the Coffer report and testimony in conjunction with the four aggravating factors found by the trial judge (see note 50 infra), however, provides independent support for the district court's finding. The only aggravating circumstance found by the trial judge to which Coffer's report and testimony were relevant was that the defendant \"has the propensity to commit the crime for which he was convicted.\" This factor was amply substantiated by appellant's own statements to Dr. Crumbley, which were related to the court at the sentencing hearing. Moreover, appellant has presented no evidence indicating that his presence at the Coffer hearing would have enabled him to rebut Coffer's testimony on that issue. Hence, whatever influence the Coffer testimony had on the trial judge's determination of aggravating factors was minimal and, in any event, harmless. We agree with the district court that appellant's absence from the Coffer hearing was significant only insofar as it may have prevented him from assisting his attorney in developing mitigating circumstances.\n\nWe must therefore address the district court's conclusion that the possibility appellant's absence affected the trial court's findings on mitigating factors was so insubstantial as to render his absence harmless beyond a reasonable doubt. Applied in the right-to-presence context, the harmless error rule has been stated as requiring that \"where there is any reasonable possibility of prejudice from the defendant's absence at any stage of the proceedings, a [judgment] cannot stand.\" United States v. Stratton, 649 F.2d 1066, 1080 (5th Cir. 1981) (quoting Estes v. United States, 335 F.2d 609, 618-19 (5th Cir. 1964), cert. denied, 379 U.S. 964, 85 S. Ct. 656, 13 L. Ed. 2d 559 (1965)). Thus, whether or not appellant's absence likely prejudiced him is not the standard we must apply; rather, if there is any reasonable possibility appellant's absence and inability to respond to Dr. Coffer's testimony affected the sentencing decision, we will not engage in speculation as to the probability that his presence would have made a difference. Cf. Davis v. Alaska, 415 U.S. 308, 317, 94 S. Ct. 1105, 1110, 39 L. Ed. 2d 347 (1974) (where trial judge violated accused's right to confrontation by preventing defense from impeaching credibility of prosecution witness, Court would not speculate whether trier of fact would have accepted defense's impeachment theory).\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e The district court concluded appellant's absence was harmless because appellant did not demonstrate that, had he been present and able to assist his attorney at the hearing, he would have been able to effectuate a \"complete reversal\" of Coffer's opinion concerning the psychiatric mitigating factors. The court found no evidence that such would have been the case. Having reviewed the record, we simply cannot agree. Appellant has shown that during the period when he was examined by Drs. Coffer and Sprehe he was receiving anti-psychotic medication and that neither his attorney nor the doctors were aware of that fact. Dr. Coffer's evaluation of appellant's mental state at the time of the offense was based in part on his observation that, at the time of the examination, appellant exhibited no psychotic tendencies. The doctor's opinion might have differed had he known appellant was under medication. Appellant has presented additional information, such as repeated suicide attempts, of which his attorney and the doctors were not informed at the time of the sentencing hearing. It is possible that none of these facts would have changed Dr. Coffer's opinion; however, we cannot with confidence eliminate the very reasonable possibility that they would have had such effect. We therefore conclude that the trial court's violation of appellant's right to presence was not harmless beyond a reasonable doubt.\n\nD. Unconstitutional Consideration and Application of Aggravating Circumstances\n\nIn support of his decision imposing the death penalty the trial judge listed four aggravating factors.\u003cspan class=\"fnref\"\u003e50\u003c/span\u003e Appellant contends that three of these factors were invalid and therefore that imposition of the death penalty in this case violated his eighth amendment right to be free from cruel and unusual punishment.\n\n1. Unsupported Aggravating Circumstances\n\nAppellant contends that two of the aggravating factors relied on by the judge -- that the murder was especially heinous, atrocious, and cruel, and that appellant created a great risk of serious bodily harm and death to many persons -- were unsupported by any evidence in this case. Appellant does not contend that it is the federal courts' function in habeas cases generally to review the state courts' findings for evidentiary sufficiency.\u003cspan class=\"fnref\"\u003e51\u003c/span\u003e Appellant relies on Godfrey v. Georgia, 446 U.S. 420, 100 S. Ct. 1759, 64 L. Ed. 2d 398 (1980), however, in urging that it is properly within the province of this court to review a claim that a state court's construction of an aggravating factor provision in a particular case is so vague or broad as to violate Furman's requirement that sentencing decisions be guided by clear, objective, rationally reviewable standards. On the basis of Godfrey, we conclude that the claim appellant presents is cognizable by this court.\u003cspan class=\"fnref\"\u003e52\u003c/span\u003e\n\nIn Godfrey, the Court considered the constitutionality of a death sentence imposed under the Georgia capital sentencing statute on the basis of the aggravating factor that the murder \"was outrageously or wantonly vile, horrible and inhuman in that it involved torture, depravity of mind, or an aggravated battery to the victim.\" Id. at 426, 100 S. Ct. at 1764. The defendant had been convicted of killing his wife and his mother-in-law by shooting each in the head with a shotgun. Notwithstanding the Court's prior decision holding that the same aggravating factor was not unconstitutionally vague, Gregg v. Georgia, 428 U.S. 153, 201, 96 S. Ct. 2909, 2938, 49 L. Ed. 2d 859 (1976),\u003cspan class=\"fnref\"\u003e53\u003c/span\u003e a plurality in Godfrey held that the jury's and state supreme court's application of the \"vile, horrible and inhuman\" aggravating factor absent any evidence of torture or aggravated battery to the victims was an \"unconstitutional construction\" of that provision. Although the Georgia courts previously had accorded a limiting construction to the aggravating factor at issue, the plurality found that such construction had not been followed in Godfrey's case.\u003cspan class=\"fnref\"\u003e54\u003c/span\u003e The plurality concluded that, \"in light of the facts and circumstances of the murders that Godfrey was convicted of committing,\" his crimes could not \"be said to have reflected a consciousness materially more depraved than that of any person guilty of murder.\" Godfrey v. Georgia, 446 U.S. at 432, 433, 100 S. Ct. at 1767. Since there was \"no principled way to distinguish [that] case, in which the death penalty was imposed, from the many cases in which it was not,\" id. at 433, 100 S. Ct. at 1767, the Georgia courts had failed to comply with Furman's requirement that any decision to impose the death sentence be based on clear, detailed, and objective standards reflecting \"reason rather than caprice or emotion.\" Id.\n\nThe aggravating factors challenged by appellant here were upheld by the Supreme Court as facially valid on appellant's direct appeal. Proffitt v. Florida, 428 U.S. at 255-56, 96 S. Ct. at 2968. The Court did not rule on the constitutionality of the provision as applied in this case,\u003cspan class=\"fnref\"\u003e55\u003c/span\u003e however; hence the issue is properly before this court. Before addressing the merits of appellant's claim, we deem it advisable to state the precise nature of the issue before us. The question is not whether we agree with the sentencing court that appellant should receive the death penalty. See note 51 supra. Nor is it within our province to judge the merits of the particular aggravating factors chosen by the Florida Legislature and interpreted by the Florida courts as justifying the imposition of death. Rather, the issue we must decide is essentially a procedural one: whether the construction of the eighth statutory aggravating factor evinced by the trial court's application of it to the facts of this case comports with the eighth amendment requirement that death sentences be based on clear, detailed, and rationally reviewable standards. See Godfrey v. Georgia, 446 U.S. at 427-33, 100 S. Ct. at 1764-67.\n\nAs the Supreme Court noted on Proffitt's direct appeal, the Florida court has accorded a limited interpretation to the \" heinous, atrocious, and cruel\" aggravating factor. Proffitt v. Florida, 428 U.S. at 255-56, 96 S. Ct. at 2968. The state court has required that the \"horror of the murder be accompanied by such additional acts as to set the crime apart from the norm.\" Cooper v. State, 336 So.2d 1133 (Fla.1976), cert. denied, 431 U.S. 925, 97 S. Ct. 2200, 53 L. Ed. 2d 239 (1977); State v. Dixon, 283 So.2d 1, 9 (Fla.1973). More specifically, the court has held that the murder must be \"conscienceless or pitiless\" in the sense that it is \"unnecessarily torturous to the victim.\" Id. The numerous cases in which the Florida Supreme Court has considered challenges to the application of this aggravating factor support the interpretation requiring acts of physical harm or torture to the murder victim prior to or accompanying the act resulting in death. Compare, e.g., Welty v. State, 402 So.2d 1159 (Fla.1981) (factor upheld where defendant robbed victim, later returned to victim's residence, struck sleeping victim several times in neck, and then set fire to his bed); Straight v. State, 397 So.2d 903 (Fla.), cert. denied, 454 U.S. 1022, 102 S. Ct. 556, 70 L. Ed. 2d 418 (1981) (factor upheld where defendant participated in murder inflicted by multiple stab wounds and bludgeoning); Thompson v. State, 389 So.2d 197 (Fla.1980) (factor upheld where victim died of wounds from gruesome series of torturous acts by defendant); Lucas v. State, 376 So.2d 1149 (Fla.1979) (factor upheld where defendant shot victim, pursued her into house, struggled with her, hit her, dragged her from house, and shot her to death while she begged for her life); Dobbert v. State, 375 So.2d 1069 (Fla.1979), cert. denied, 447 U.S. 912, 100 S. Ct. 3000, 64 L. Ed. 2d 862 (1980) (factor upheld where defendant tortured his child over a prolonged period and murdered her to prevent discovery of her battered condition); Washington v. State, 362 So.2d 658 (Fla.1978), cert. denied, 441 U.S. 937, 99 S. Ct. 2063, 60 L. Ed. 2d 666 (1979) (factor upheld where evidence showed bullet did not penetrate victim's skull and cause of death was four of nine stab wounds, none of which was instantly fatal) with Maggard v. State, 399 So.2d 973 (Fla.), cert. denied, 454 U.S. 1059, 102 S. Ct. 610, 70 L. Ed. 2d 598 (1981) (factor reversed where victim died quickly from single gunshot blast fired through window and victim was unware he was going to be shot); Armstrong v. State, 399 So.2d 953 (Fla.1981) (factor reversed where murderers were only at scene of crime for very brief period and shooting was precipitated by armed resistance); Williams v. State, 386 So.2d 538 (Fla.1980) (factor reversed where victim died almost instantaneously from gunshot wounds); Fleming v. State, 374 So.2d 954 (Fla.1979) (factor reversed where killing of policeman accomplished by single shot fired when hostage grabbed defendant's gun); Kampff v. State, 371 So.2d 1007 (Fla.1979) (factor reversed where defendant directed pistol shot straight to head of victim); Halliwell v. State, 323 So.2d 557 (Fla.1975) (factor reversed where mutilation of victim's body occurred only after victim's death). The Florida court has repeatedly rejected application of this factor to killings accomplished quickly by acts of shooting or stabbing involving no additional torturous acts to the victim. E.g., Lewis v. State, 398 So.2d 432 (Fla.1981); Demps v. State, 395 So.2d 501 (Fla.), cert. denied, 454 U.S. 933, 102 S. Ct. 430, 70 L. Ed. 2d 239 (1981); Kampff v. State, supra; Menendez v. State, 368 So.2d 1278 (Fla.1979); Riley v. State, 366 So.2d 19 (Fla.1978). Moreover, the court has expressly held that the fact that a murder is \"premeditated, cold and calculated\" does not render it especially heinous, atrocious, and cruel. Lewis v. State, 398 So.2d at 438. Nor does the commission of the killing in the presence of another family member bring it within the statutory factor, since, under the Florida court's construction of the factor, the atrocity must consist of an act done to the victim. Riley v. State, 366 So.2d at 21.\n\nIn this case, there was no evidence that appellant perpetrated any physical act on the victim other than the single stab in the chest that resulted in his death.\u003cspan class=\"fnref\"\u003e56\u003c/span\u003e Moreover, neither in his findings nor in his instructions to the jury as to the meaning of the eighth aggravating circumstance did the trial judge indicate that such factor requires proof of torturous acts to the victim.\u003cspan class=\"fnref\"\u003e57\u003c/span\u003e The finding made by the judge in this case therefore suggests no \"inherent restraint on the arbitrary and capricious infliction of the death sentence.\" Cf. Godfrey v. Georgia, 446 U.S. at 428, 100 S. Ct. at 1764 (instructions alone did not restrain jury's discretion). Finally, the Florida Supreme Court's decision affirming appellant's sentence does not indicate it even considered the propriety of the application of such factor in this case, see Proffitt v. State, 315 So.2d at 466-67, and thus that court's review \"in no way cured\" the exercise of \"uncontrolled discretion\" by the judge in this case. Godfrey v. Georgia, 446 U.S. at 429, 100 S. Ct. at 1765.\n\nApplying the same analysis to the trial court's finding that \"the defendant knowingly . . . created a great risk of . . . death to many persons,\" we conclude that application of that provision in the instant case implies a construction so broad that it cannot be viewed as a meaningful limitation on sentencer discretion. Appellant's act of killing, consisting of the infliction of a single knife wound in the chest of the victim, endangered only the victim himself. Although the facts indicate that appellant struck the victim's wife with his fists when she was awakened by her husband's moans, there was no evidence that the blows were of such force that they were likely to kill her.\u003cspan class=\"fnref\"\u003e58\u003c/span\u003e Even if appellant could reasonably be said to have threatened the woman's life, the sum of appellant's acts surrounding the killing, viewed in the light least favorable to him, at most could be said to have risked death to two persons. Application of this aggravating factor to the facts of this case is not only inconsistent with the Florida Supreme Court's construction of the provision;\u003cspan class=\"fnref\"\u003e59\u003c/span\u003e it also reflects an absence of control or guidance of the sentencing judge's discretion. We cannot say that the death sentence imposed on the basis of such factor was \"based on reason rather than caprice or emotion.\" Gardner v. Florida, 430 U.S. 349, 358, 97 S. Ct. 1197, 1204, 51 L. Ed. 2d 393.\n\n2. Non-statutory Aggravating Factors\n\nIn addition to the two aggravating factors discussed above, appellant challenges a third factor relied on by the judge because it does not accord with circumstances identified as aggravating in Fla.Stat. § 921.141(5). The judge's finding that appellant \"has the propensity to commit the crime for which he was convicted . . . and is a danger and a menace to society,\" on which he relied as one aggravating factor supporting the death penalty, bears no resemblance to any of the statutory aggravating factors.\n\nIn Henry v. Wainwright, 661 F.2d 56 (5th Cir. 1981), vacated on other grounds, 457 U.S. 1114, 102 S. Ct. 2922, 73 L. Ed. 2d 1326 (1982), the Fifth Circuit held that consideration by the sentencer of non-statutory aggravating factors violates the eighth and fourteenth amendments. Although the Henry decision has been vacated by the Supreme Court on procedural grounds not relevant to this case,\u003cspan class=\"fnref\"\u003e60\u003c/span\u003e we find its reasoning persuasive and therefore adopt its analysis. See Zant v. Stephens, 456 U.S. 410, 102 S. Ct. 1856, 1859-65, 72 L. Ed. 2d 222 (Marshall, J., dissenting); id. 102 S. Ct. at 1865 (Powell, J., dissenting).\n\nIn Henry, the court held that admission of evidence of aggravating factors not listed in the statute coupled with an instruction allowing the jury to consider non-statutory aggravating factors in rendering an advisory sentence was unconstitutional. Unlike Henry, appellant does not complain that the jury was allowed to consider evidence of non-statutory aggravating circumstances or that the jury's advisory sentence was based on such evidence;\u003cspan class=\"fnref\"\u003e61\u003c/span\u003e rather, he challenges the trial court's sentencing decision, which its findings indicate was based partly on non-statutory aggravating factors. In our view, the reasoning employed by the Henry court, with which we agree, is equally applicable to the advisory sentence decision of the jury and the ultimate sentence determination made by the trial judge.\u003cspan class=\"fnref\"\u003e62\u003c/span\u003e As the Henry court noted, Furman v. Georgia, 408 U.S. 238, 92 S. Ct. 2726, 33 L. Ed. 2d 346 (1972) held unconstitutional under the eighth amendment capital sentencing procedures that, by failing to limit and guide sentencer discretion, permitted arbitrary and selective imposition of the death penalty. Henry v. Wainwright, 661 F.2d at 58. In Furman's 1976 progeny, in which five post-Furman capital sentencing statutes were challenged, the Court upheld those statutes that provided specific and detailed standards to guide the sentencer in deciding whether to impose the death penalty. See Jurek v. Texas, 428 U.S. 262, 96 S. Ct. 2950, 49 L. Ed. 2d 929 (1976); Proffitt v. Florida, 428 U.S. 242, 96 S. Ct. 2960, 49 L. Ed. 2d 913 (1976); Gregg v. Georgia, 428 U.S. 153, 96 S. Ct. 2909, 49 L. Ed. 2d 859 (1976). The Court specifically approved the Florida statute because its aggravating and mitigating provisions appeared to provide such guidance. Proffitt v. Florida, 428 U.S. at 248-53, 96 S. Ct. at 2964-2967. In considering appellant's \"propensity to commit [murder]\" and the danger he posed to society, the trial court transcended the list of aggravating factors set forth in the Florida statute and substituted his own judgment of what circumstances justify capital punishment for that of the Florida Legislature. In so doing, the trial judge not only committed error under the state law, see Brown v. State, 381 So.2d 690, 696 (Fla.1980); Elledge v. State, 346 So.2d 998, 1002 (Fla. 1977); he also exceeded the federal constitutional limitations imposed by Furman on capital sentencing by increasing the risk that the death penalty would be imposed in an arbitrary and capricious manner. In short, we agree with the Henry court that because \"the limitations of the statute make the death penalty constitutional . . . ignoring those limitations [] implicates the constitution.\" Henry v. Wainwright, 661 F.2d at 60. For the reasons just stated, we conclude that the trial judge's reliance on non-statutory aggravating circumstances renders appellant's sentence unconstitutional under the eighth and fourteenth amendments.\n\nAs a fallback argument, the state contends that even if the trial judge erroneously considered non-statutory aggravating factors such error was harmless because in this case the judge found no mitigating circumstances. As long as some of the aggravating factors found by the sentencer are valid, the state argues, death is \"presumed proper\" in the absence of mitigating evidence. We cannot agree with this argument for several reasons. First, one premise of the state's argument -- that there were several valid aggravating factors supporting the sentence -- cannot be established in this case. Eliminating the non-statutory factor, we are left with three statutory aggravating circumstances found by the trial judge: that appellant committed the murder while in the course of committing the additional felony offense of burglary, that he created a great risk of death to many persons, and that the murder he committed was especially heinous, atrocious, and cruel. See note 50 supra. Although these factors fall within the statutory list, we have determined that the trial court's application of the \"heinous, atrocious and cruel\" and \"great risk of death to many persons\" factors in this case was unconstitutional under Godfrey. See section IV.D.1 supra. Hence, the only valid aggravating factor in this case is that appellant committed the murder in conjunction with a burglary. In some cases one statutory aggravating circumstance may be sufficient justification for imposing the death penalty. We cannot conclude, however, that appellant's entry of the victim's house, which he did for the purpose of committing the murder, was a circumstance \"sufficient[ly] aggravating\" in nature that the judge necessarily would have imposed the death penalty on that ground alone. See Fla.Stat.Ann. § 921.141 (3) (West Supp.1982) (judge must find \" sufficient aggravating circumstances\" exist to justify sentence of death). The second premise of the state's argument -- that there were no mitigating circumstances that might outweigh any aggravating ones -- presents similar difficulties. The trial court's findings do not unqualifiedly state that there are no mitigating circumstances but rather indicate the judge's conclusion that such factors \"are primarily negated\" and are \"outweigh[ed]\" by the aggravating factors he found.\u003cspan class=\"fnref\"\u003e63\u003c/span\u003e Thus, contrary to the state's characterization, this case does not present the situation in which there exist valid aggravating factors undoubtedly sufficient to justify a death sentence counterbalanced by no mitigating factors.\n\nAn even more substantial impediment to adopting the analysis suggested by the state is that the Fifth Circuit has already rejected it. In Henry, in addition to the non-statutory aggravating factors, the trial court had found several statutory aggravating factors and no mitigating ones. Although the Florida Supreme Court affirmed the sentence on this ground, the former Fifth Circuit disagreed and held that affirming a death sentence partially predicated on non-statutory factors violates the eighth amendment requirement of rational appellate review of capital sentencing decisions. Henry v. Wainwright, 661 F.2d at 58-60. The Florida Supreme Court's attempt \"to divine what motives impelled [this] death penalt[y],\" in the Henry court's view, had compounded rather than resolved the trial court's sentencing error. Id. at 59. Recognizing the importance of the appellate review aspect of Florida's capital sentencing scheme, which the Supreme Court emphasized in upholding the Florida statute,\u003cspan class=\"fnref\"\u003e64\u003c/span\u003e the Henry court declared:\n\nGuarding against the arbitrary and discriminatory imposition of the death penalty must not become simply a guessing game played by a reviewing court in which it tries to discern whether the improper non-statutory aggravating factors exerted a decisive influence on the sentence determination. The guarantee against cruel and unusual punishment demands more.\n\nId. We agree that the rational appellate review of capital sentencing decisions contemplated by Furman and its progeny requires more than mere speculation or conjecture as to what the sentencing tribunal would have decided had it correctly applied the law. Such post hoc justification of a sentencing decision, which depends on a rationale for imposing death distinct from that relied on by the sentencer, cannot fulfill the appellate court's constitutional responsibilities. Cf. Presnell v. Georgia, 439 U.S. 14, 99 S. Ct. 235, 58 L. Ed. 2d 207 (1978) (per curiam) (imposition of death penalty where appellate court rejected jury grounds for sentence but affirmed on different theory violated due process). Only where the factors supporting the death sentence are so clear that proper application of the statute by reasonable persons could produce no other result should a sentence be affirmed despite constitutional error. Such was not the case here. We conclude that the trial court's unconstitutional application of statutory aggravating factors and consideration of non-statutory ones entitled appellant to resentencing in the trial court.\n\nE. Unconstitutional Limitation of Mitigating Circumstances\n\nAppellant contends the trial court's instructions to the jury on aggravating and mitigating factors violated his right under Lockett v. Ohio, 438 U.S. 586, 98 S. Ct. 2954, 57 L. Ed. 2d 973 (1978) to have the sentencers consider non-statutory mitigating evidence concerning his character and the circumstances of his offense. The state asserts that appellant's failure to object to the jury instructions resulted in a waiver of such objection under Wainwright v. Sykes, 433 U.S. 72, 97 S. Ct. 2497, 53 L. Ed. 2d 594 (1977) and that in any event there was no Lockett violation in this case. Both the substantive Lockett issue and the waiver issue are currently before this court for en banc consideration in a case involving facts substantially similar to those presented by this case. See Ford v. Strickland, 676 F.2d 434 (11th Cir. 1982), rehearing granted (Apr. 28, 1982). Resolution of Proffitt's mitigating circumstances claim without benefit of the en banc court's decision in Ford would be premature. Because our disposition of the other issues raised by appellant entitles him to resentencing in the Florida courts, decision of the mitigating circumstances claim is unnecessary.\n\nV. Conclusion\n\nWe find appellant's procedural challenge to be without merit; the district court's decision not to conduct a second evidentiary hearing on appellant's ineffective assistance claims was a proper exercise of the court's discretion. On the merits, we affirm the decision of the district court insofar as it rejected appellant's claims of ineffective legal assistance at both the guilt and sentencing phases of trial. We disagree with the court's disposition of the confrontation and aggravating circumstances claims, however. Because the state court's use of psychiatric evidence that appellant had no opportunity to rebut and its consideration of non-statutory aggravating factors violated appellant's sixth, eighth, and fourteenth amendment rights, the decision of the district court is reversed and the case is remanded for proceedings not inconsistent with this opinion.\n\nAFFIRMED IN PART, REVERSED IN PART, and REMANDED.\n\nDisposition\n\nAFFIRMED IN PART, REVERSED IN PART, and REMANDED.\n\nJudge CLARK reserves the right to file a concurring or dissenting opinion.\n\n\u003cspan class=\"fn\"\u003e1. The facts of this case have been summarized twice already in the published opinions of the Florida Supreme Court, Proffitt v. State, 315 So.2d 461, 463-64 (Fla. 1975), and the United States Supreme Court, Proffitt v. Florida, 428 U.S. 242, 244-47, 96 S. Ct. 2960, 2963-64, 49 L. Ed. 2d 913 (1976). We therefore deem it sufficient for purposes of this opinion to set forth only a brief description of the procedural history of this case and such additional facts as are relevant to the specific issues raised in this appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The United States Supreme Court addressed only the constitutionality of the Florida death penalty statute on its face. Proffitt did not raise the issues of unconstitutional application of the statute or ineffective assistance of counsel on direct review in the Supreme Court, and the state does not argue that he waived them by failing to do so.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The state does not contend that appellant failed to exhaust state remedies with respect to any of the claims raised here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Appellant raised several other issues in the district court concerning both the guilt and sentencing phases of his trial, all of which were decided against him below. This appeal is limited to the claims described in the text of this opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The 1976 amendments to the Federal Magistrates Act authorize appointment of magistrates to conduct evidentiary hearings and submit proposed findings of fact and recommendations for disposition in federal habeas cases. See 28 U.S.C.A. § 636(b) (1) (B) (West Supp. 1982). These amendments were intended to overrule Wingo v. Wedding, 418 U.S. 461, 94 S. Ct. 2842, 41 L. Ed. 2d 879 (1974), which had held that the Magistrates Act did not authorize magistrates to hold evidentiary hearings in habeas cases. H.Rep.No. 1609, 94th Cong., 2d Sess. 5-6 (1976), reprinted in [1976] U.S.Code Cong. \u0026 Ad.News 6162, 6164-65. See United States v. Raddatz, 447 U.S. 667, 674, 100 S. Ct. 2406, 2411, 65 L. Ed. 2d 424 (1980); Nettles v. Wainwright, 677 F.2d 404, 406-407 (5th Cir. 1982) (en banc).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Both parties filed objections to the magistrate's report as required by 28 U.S.C. § 636(b) (1) and Rule 6.02, Local Rules of the United States District Court, Middle District of Florida. See Nettles v. Wainwright, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The current version of Florida's capital sentencing statute, which has been amended four times since appellant was sentenced, is at Fla.Stat.Ann. § 921.141 (West Supp.1982). The precise version of the statute in effect at the time of appellant's sentencing is no longer printed in the Florida Statutes. The only significant change made by the amendments is described in note 19 infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The aggravating circumstances that may be considered are expressly limited to the following: (a) The capital felony was committed by a person under sentence of imprisonment. (b) The defendant was previously convicted of another capital felony or of a felony involving the use or threat of violence to the person. (c) The defendant knowingly created a great risk of death to many persons. (d) The capital felony was committed while the defendant was engaged, or was an accomplice, in the commission of, or an attempt to commit, or flight after committing or attempting to commit, any robbery, rape, arson, burglary, kidnapping, or aircraft piracy or the unlawful throwing, placing, or discharging of a destructive device or bomb. (e) The capital felony was committed for the purpose of avoiding or preventing a lawful arrest or effecting an escape from custody. (f) The capital felony was committed for pecuniary gain. (g) The capital felony was committed to disrupt or hinder the lawful exercise of any governmental function or the enforcement of laws. (h) The capital felony was especially heinous, atrocious, or cruel. Fla.Stat.Ann. § 921.141(5) (West Supp.1982).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The mitigating circumstances enumerated in the statute include the following: (a) The defendant has no significant history of prior criminal activity. (b) The capital felony was committed while the defendant was under the influence of extreme mental or emotional disturbance. (c) The victim was a participant in the defendant's conduct or consented to the act. (d) The defendant was an accomplice in the capital felony committed by another person and his participation was relatively minor. (e) The defendant acted under extreme duress or under the substantial domination of another person. (f) The capacity of the defendant to appreciate the criminality of his conduct or to conform his conduct to the requirements of law was substantially impaired. (g) The age of the defendant at the time of the crime. Id. § 921.141(6).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The judge instructed the jury that, in determining whether aggravating or mitigating circumstances existed, it should consider \"the evidence which you have heard while trying the guilt or innocence of the defendant and evidence which has been presented to you in [the sentencing] proceedings.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Although the statute leaves the trial judge free to reject the jury's recommendation, the Florida Supreme Court has developed a strict standard of review in cases where a judge imposes the death penalty in the face of a jury recommendation favoring life imprisonment. See Tedder v. State, 322 So.2d 908, 910 (Fla. 1975).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Appellant apparently had asked to see the jail psychiatrist. See IV Trial Record 503.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The prosecuting attorney introduced evidence of appellant's prior conviction for breaking and entering in support of aggravating factor (b) (prior conviction of felony involving violence). He argued on the basis of the evidence presented at the guilt stage that factors (c) (great risk of death to many persons), (d) (felony-murder), (f) (felony committed for pecuniary gain), and (h) (offense especially heinous, atrocious, or cruel) had been established.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The prosecuting attorney argued that mitigating factor (a) (no significant history of prior criminal activity) had been rebutted by evidence of appellant's prior conviction for breaking and entering. He also contended that the defense attorney's attempt to establish factors (b) (crime committed while defendant was under extreme mental or emotional distress) and (f) (defendant's ability to appreciate criminality of conduct or to conform conduct to law substantially impaired) failed because Dr. Crumbley was not a practicing psychiatrist and had not performed any psychiatric testing of appellant. He argued that the other statutory mitigating factors were not present because no evidence had been presented in their favor.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Initially appellant's counsel argued that the felony-murder circumstance was inapplicable because appellant had entered the victim's house with the sole purpose of killing and not intending to commit any other crime. After the judge sustained the prosecution's objection to this argument on the ground that breaking and entering for any purpose constituted a burglary within the felony-murder circumstance, the defense attorney conceded that this factor might be established.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Defense counsel argued that the following mitigating circumstances were present: (a) (no significant history of prior criminal activity), (b) (crime committed while defendant was under influence of extreme emotional disturbance), (e) (defendant acted under extreme duress), and (f) (defendant's capacity to conform his conduct to the requirements of law was substantially impaired). Counsel also reminded the jury of the doctor's statement that there were institutions where appellant could be treated and emphasized that a life sentence would require appellant to serve a minimum jail term of 25 years.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. In the en banc decision of Bonner v. City of Prichard, 661 F.2d 1206 (11th Cir. 1981), the Eleventh Circuit adopted as precedent the decisions of the former Fifth Circuit.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Despite a contrary interpretation of the statute by the Florida Supreme Court in Cooper v. State, 336 So.2d 1133, 1139 (Fla.1976), cert. denied, 431 U.S. 925, 97 S. Ct. 2200, 53 L. Ed. 2d 239 (1977), the U.S. Supreme Court stated in Lockett v. Ohio, 438 U.S. 586, 606-07 \u0026 n.15, 98 S. Ct. 2954, 2965-66 \u0026 n.15, 57 L. Ed. 2d 973 (1978) and the Fifth Circuit held in Spinkellink v. Wainwright, 578 F.2d 582, 620-21 (5th Cir. 1978) that the Florida death penalty statute did not, at the time Proffitt was decided by the Supreme Court, \"operate[] . . . to prevent the sentencer from considering any aspect of the defendant's character and record or any circumstances of his offense as an independently mitigating factor.\" Id. at 621 (quoting Lockett v. Ohio, 438 U.S. at 607, 98 S. Ct. at 2966).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The statute prefaces the list of aggravating circumstances with the statement that they \"shall be limited to the following: . . .\" Fla. Stat. Ann. § 921.141(5) (West Supp.1982). The list of mitigating factors is preceded by the words: \"Mitigating circumstances shall be the following:. . .\" Id. § 921.141(6). After Lockett, the Florida Legislature amended the statute so that it now expressly allows presentation of evidence at the sentencing hearing \"as to any matter that the court deems relevant to the nature of the crime and the character of the defendant.\" 1979 Fla.Laws, c. 79-353. See Fla.Stat.Ann. § 921.141(1) \u0026 note (West. Supp. 1982).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. The attorney relied almost entirely on Dr. Crumbley's testimony, which was introduced by the prosecution, arguing that it established several of the statutory mitigating factors. See note 16 supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. During the evidentiary hearing, defense counsel described the portion of the pre-trial motion pertaining to mitigating evidence as \"a rather lengthy paragraph, [] basically [saying] that the matters ought to be dismissed because the circumstances to be considered in mitigation are inadequate, discretionary, arbitrary, insufficient and vague, in violation of certain provisions of the Constitution of the United States and the State of Florida.\" Transcript of Evidentiary Hearing 218-20.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. In the magistrate's view, counsel was \"confusing his client's disinterest in a plea bargain and the matter of adducing mitigating evidence.\" The magistrate found, moreover, that the attorney's attempt to introduce mitigating evidence through Dr. Crumbley's testimony and argument against the death penalty at the time of sentencing were inconsistent with his claim that he was operating under instructions from appellant not to seek mitigation of the sentence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. The magistrate noted: Levinson testified that he went into the trial assuming that he could not put on any evidence in mitigation except as set forth in the statute (H.T. 220). Levinson stated further that he did not engage in any separate and distinct preparation for the penalty phase, but prepared for that part of the trial in conjunction with his preparation of the case as a whole (H.T. 186). He also said that he had no strategy for the penalty stage, but that his approach to that stage was to depend upon what occurred during the guilt phase (H.T. 187). Since there was only a thirty-five minute recess between the first and second stages of the trial, Levinson had no additional opportunity to prepare for the sentencing hearing after the guilty verdict was rendered (IV R.492, 493).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. The Note states: The rule provides for the utilization of a presentence report as part of the sentencing process. While use of the report is discretionary in all cases, it is mandatory in two instances, the sentencing of a first felony offender and of a defendant under 18 years of age. Of course, no report is necessary where the specific sentence is mandatory, e.g., the sentence of death or life imprisonment in a verdict of first degree murder (emphasis added). At the time of appellant's trial, some Florida judges were ordering presentence reports in capital cases under Rule 3.710 notwithstanding the Committee Note's suggestion that the rule does not encompass such cases. See, e.g., Gardner v. State, 313 So.2d 675, 677 (Fla.1975) (opinion of Ervin, J.), rev'd, 430 U.S. 349, 97 S. Ct. 1197, 51 L. Ed. 2d 393 (1977). Although the Florida Supreme Court upheld the sentence in Gardner, that case indicates the doubtful status of presentence investigations in capital cases at the time. The defendant argued to the Florida Supreme Court that the trial judge had erred in considering the presentence report because it contained detrimental facts about him that did not fit within the aggravating circumstances enumerated in the capital sentencing statute. Id. at 677-78.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Complicating the question of presentence investigation reports even further, the Florida Legislature in 1974 enacted a statute purporting to make preparation of such reports mandatory in all felony cases in which a guilty verdict has been rendered and discretionary in misdemeanor cases. See Fla.Stat.Ann. § 921.231 (West Supp.1982). This statute did not become effective until July 1, 1974, and hence it had no effect on the law at the time of appellant's trial. As the district court noted, however, this later statute explains defense counsel's statement that presentence investigations are \"automatic now . . . by statutory authority.\" That the statute was enacted at a point in time so close to appellant's trial also tends to explain the attorney's inability to remember whether it was in effect at the time of the trial. (The Florida Supreme Court has held that, to the extent it conflicts with Rule 3.710 by making presentence investigations mandatory rather than discretionary in most felony cases, the statute unconstitutionally invades the rulemaking province of that court, and thus is to be construed as directory only. See Huntley v. State, 339 So.2d 194 (Fla.1976). It may be that trial courts in Florida have nonetheless continued to comply with the statute's directive by making presentence investigations \"automatic.\")\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Defense counsel also argued that Crumbley's testimony established the statutory mitigating circumstance that \"the defendant acted under extreme duress or under the substantial domination of another person,\" see Fla.Stat.Ann. § 921.141(6) (e) (West Supp.1982), but the trial judge sustained the prosecution's objection to this argument.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Specifically, appellant claims he was convicted after being found inside a restaurant eating a hotdog while intoxicated, without having done any damage to the property.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Prior to the Washington decision, the Fifth Circuit precedents set forth conflicting standards for review of district courts' conclusions concerning ineffective counsel claims. The Washington panel resolved this issue by adopting the independent-evaluation standard of review and rejecting the line of cases that had treated the determination of effectiveness as a purely factual finding to which the \"clearly erroneous\" standard applies. The court found the cases that applied an independent-judgment standard more persuasive and better supported than those applying the clearly-erroneous test. See Washington v. Watkins, 655 F.2d at 1351-56.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. See note 11 supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. The first case considering the constitutionality of the new Florida statute was decided prior to Proffitt's trial. That case -- State v. Dixon, 283 So.2d 1 (Fla.1973), cert. denied, 416 U.S. 943, 94 S. Ct. 1951, 40 L. Ed. 2d 295 (1974), includes a discussion of the statute's operation and the methods incorporated by the legislature for controlling sentencer discretion, see id. at 7-10, but does not decide the scope of admissible mitigating evidence. The majority and dissenting opinions in State v. Dixon, supra, reflect the two divergent interpretations of Furman prevailing at that time. The majority interpreted the rule of Furman as not abolishing discretion in capital sentencing entirely but rather as concerned with \"the quality of discretion and the manner in which it [is] applied.\" State v. Dixon, 283 So.2d at 6. The majority read Furman as requiring that the discretion exercised in capital sentencing be \"reasonable and controlled rather than capricious and discriminatory,\" id. at 7, but did not expressly state whether the state's mitigating circumstances provision was intended to be an exclusive list of the factors juries may consider in mitigation. The opinion's focus on the issue of control over sentencer discretion, coupled with its statement that \"the propounding of aggravating and mitigating circumstances\" is the \"most important safeguard\" the statute employs to restrain and guide such discretion, id. at 8-9, would have supported an interpretation of § 921.141 as limiting sentencer consideration of both aggravating and mitigating circumstances to the factors expressly described in the statute. The dissenting opinion of Justice Ervin, which leans toward a reading of Furman as condemning all discretion in capital sentencing, see id. at 13-14 (Ervin, J., dissenting), and concludes that § 921.141 allows more discretion than permissible under Furman, id. at 14, expressly interprets the statute as limiting the aggravating and mitigating circumstances judges and juries may consider to those enumerated in the statute. Id. at 17. The earliest case listed in Fla.Stat.Ann. § 921.141, Notes of Decisions (West 1973 \u0026 Supp.1982) specifically discussing the mitigating circumstances provision is a 1975 case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. Presentence reports typically contain information concerning the defendant's education, employment, and familial and medical history; the circumstances surrounding the offense; the environment to which the defendant will return after incarceration and the resources available to assist him; the defendant's prior criminal record; and the probation officer's view of his motivations. Black's Law Dictionary (5th ed. 1979). See, e.g., Fla.Stat.Ann. § 921.231 (West Supp.1982).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. See Part III.B supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. The magistrate specifically rejected appellant's contention that the attorney's failure to request a continuance after hearing from Dr. Crumbley, in order to determine whether appellant was incompetent to stand trial, constituted ineffective assistance of counsel. The magistrate found that neither the facts known to the attorney prior to Crumbley's call nor the information relayed by the doctor provided him with reason to believe appellant was incompetent. The magistrate also credited the attorney's later testimony that he had \"wanted the trial to begin without delay because on the morning of the trial a newspaper reporter had heard Dr. Crumbley's information and the attorney was concerned that newspaper publicity would prejudice the potential jurors. See Magistrate's Report and Recommendation 26; Transcript of Evidentiary Hearing 269-70, 301.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. We reject appellant's argument that his attorney should have requested expert assistance to aid him in preparing the mitigation defense. At the time of appellant's trial the law governing capital sentencing was undergoing significant change and the extent of capital defendants' procedural rights had not yet been clearly delineated. Now that cases such as Lockett v. Ohio, 438 U.S. 586, 98 S. Ct. 2954, 57 L. Ed. 2d 973 (1978) and Gardner v. Florida, 430 U.S. 349, 97 S. Ct. 1197, 51 L. Ed. 2d 393 (1977) have set forth specific constitutional procedural requirements for death penalty cases, the Fifth Circuit cases holding psychiatric assistance and investigation essential to effective legal assistance where a psychiatric defense is raised at the guilt phase of a criminal trial, e.g., Beavers v. Balkcom, 636 F.2d 114 (5th Cir. 1981); Davis v. Alabama, 596 F.2d 1214 (5th Cir. 1979), vacated as moot, 446 U.S. 903, 100 S. Ct. 1827, 64 L. Ed. 2d 256 (1980) United States v. Fessel, 531 F.2d 1275 (5th Cir. 1976); Hintz v. Beto, 379 F.2d 937 (5th Cir. 1967); Greer v. Beto, 379 F.2d 923 (5th Cir. 1967); see also United States v. Edwards, 488 F.2d 1154 (5th Cir. 1974), may be applied to psychiatric mitigation defenses raised at the sentencing phase of a capital trial. No case has yet addressed this issue, however, and in 1974 it could hardly have been said that such a rule was foreshadowed. Under the circumstances, we cannot say the defendant attorney's decision to raise the psychiatric mitigating factors without first obtaining expert assistance or undertaking further investigation rendered his assistance constitutionally defective.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Although the attorney qualified his agreement by stating that he had not discussed the matter with appellant, appellant was present in the courtroom at the time the judge suggested the examinations, and no objection was raised to the examinations at that time or at any later date.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. Dr. Coffer further testified that he believed appellant suffered from a \"personality disorder\" and that people with this type of disorder tended to \"get [] into repeated difficulties with the law.\" He stated that such difficulties reflected \"a lack of motivation,\" rather than an inability, to conform one's conduct to legal standards, however. IV Trial Record 547-49. 36a Although appellant's attorney asserted the right to cross-examine Dr. Sprehe at the hearing, the trial court's failure to afford appellant that opportunity was not raised as error on direct appeal. The state has not contended that appellant waived this issue, however, and we therefore will not decide the claim on that ground. See Washington v. Watkins, 655 F.2d at 1368.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. The reasoning for this rule is set forth in Alford v. United States, 282 U.S. 687, 692, 51 S. Ct. 218, 219, 75 L. Ed. 624 (1931): Counsel often cannot know in advance what pertinent facts may be elicited on cross-examination. For that reason it is necessarily exploratory; and the rule that the examiner must indicate the purpose of his inquiry does not, in general, apply. It is the essence of a fair trial that reasonable latitude be given the cross-examiner, even though he is unable to state to the court what facts a reasonable cross-examination might develop. Prejudice ensues from a denial of the opportunity to place the witness in his proper setting and put the weight of his testimony and his credibility to a test, without which the jury cannot fairly appraise them. To say that prejudice can be established only by showing that the cross-examination, if pursued, would necessarily have brought out facts tending to discredit the testimony in chief, is to deny a substantial right and withdraw one of the safeguards essential to a fair trial. In this respect a summary denial of the right of cross-examination is distinguishable from the erroneous admission of harmless testimony. (citations omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. Indeed, the Florida rule governing expert testimony, much like the corresponding federal rule, eliminates the requirement that expert witnesses disclose the facts and data underlying their opinion testimony and instead places the burden on opposing counsel to elicit such information through cross-examination. See Fed.R.Evid. 705; Fla.Stat.Ann. § 90.705 (West 1979); Jones v. State, 289 So.2d 725, 727 (Fla.1974). See also Brady v. State, 190 So.2d 607, 608 (Fla.App.1966) (court-appointed expert subject to cross-examination by state and defendant).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. The court noted that, had the defendant's attorneys been informed of the state's intent to have the psychiatrist testify at sentencing and of the nature of his testimony, they might easily have discovered information indicating the low reliability of predictions and conclusions such as those the psychiatrist made at the hearing and could have used such evidence to impeach the testimony. Smith v. Estelle, 602 F.2d at 699-700 n.7. Instead, however, \"their lack of preparation made them ineffective\" -- they were able to \"ask only broad, argumentative questions.\" Id. We further noted that, with advance preparation, the attorneys could have uncovered evidence of bias -- such as the psychiatrist's frequent testimony for the state, his not having acted as a defense witness, and his frequent declarations that persons whom he had examined only for competency were sociopaths -- which could have been used to impeach him.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. See Deposition of Judge Walter Burnside 13-14, 17, 30-32.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. Because Fed.R.Crim.P. 43 requires a defendant's presence \"at every stage of [a federal] trial, including the impaneling of the jury and the return of the verdict, and at the imposition of sentence,\" the federal courts have not often been called upon to consider the extent to which that rule is constitutionally based. See, e.g., Rogers v. Unites, 422 U.S. 35, 95 S. Ct. 2091, 45 L. Ed. 2d 1 (1975) (Rule 43 entitles defendant to be present when trial court responds to jury's request for instruction in mid-deliberation); United States v. Alessandrello, 637 F.2d 131 (3d Cir. 1980), cert. denied, 451 U.S. 949, 101 S. Ct. 2031, 68 L. Ed. 2d 334 (1981) (Rule 43 right to presence at jury impaneling is broader than constitutional right); Estes v. United States, 335 F.2d 609 (5th Cir. 1964), cert. denied, 379 U.S. 964, 85 S. Ct. 656, 13 L. Ed. 2d 559 (1965) (Rule 43 violated). Early Supreme Court cases addressing the right to presence spoke in constitutional terms, see Diaz v. United States, 223 U.S. 442, 455, 32 S. Ct. 250, 253, 56 L. Ed. 500 (1912); Hopt v. Utah, 110 U.S. 574, 579, 4 S. Ct. 202, 204, 28 L. Ed. 262 (1884), but one later opinion ambiguously treated the issue as one of proper procedure without addressing constitutional concerns, Shields v. United States, 273 U.S. 583, 588-89, 47 S. Ct. 478, 479, 71 L. Ed. 787 (1927), and another suggested the constitutional right of presence was more limited in scope than prior cases had indicated, Snyder v. Massachusetts, 291 U.S. 97, 107-08, 54 S. Ct. 330, 332-33, 78 L. Ed. 674 (1934) (defendant has no constitutional right to accompany jury on view of scene; due process guarantees right of presence only where defendant's absence would thwart fair and just hearing). The weight of modern authority supports a broad constitutional right of presence. See Illinois v. Allen, 397 U.S. 337, 338, 90 S. Ct. 1057, 1058, 25 L. Ed. 2d 353 (1970) (confrontation clause guarantees accused's right to be present in courtroom at every stage of his trial); United States v. Stratton, 649 F.2d 1066, 1080 \u0026 n.20 (5th Cir. 1981) (defendant has constitutional right to presence at all stages of trial where his absence might frustrate fairness of proceedings); Badger v. Cardwell, 587 F.2d 968, 969 (9th Cir. 1978) (same); Bustamante v. Eyman, 456 F.2d 269, 272-73 (9th Cir. 1972), appeal after remand, 497 F.2d 556 (9th Cir. 1974) (Allen reaffirms broad right under confrontation and due process clauses to presence at every stage of trial); United States v. Crutcher, 405 F.2d 239, 242 (2d Cir. 1968), cert. denied, 394 U.S. 908, 89 S. Ct. 1018, 22 L. Ed. 2d 219 (1969); Near v. Cunningham, 313 F.2d 929, 931 (4th Cir. 1963). The issue of the particular proceedings to which the right extends has continued to be litigated in recent cases in the Fifth and other circuits. E.g., United States v. Killian, 639 F.2d 206, 209-10 (5th Cir. 1981), cert. denied, 451 U.S. 1021, 101 S. Ct. 3014, 69 L. Ed. 2d 394 (1982) (no right to presence under Rule 43 at court's granting of continuance); United States v. Dominguez, 615 F.2d 1093, 1094-95 \u0026 n.4 (5th Cir. 1980) (inadvertent excusal of juror out of defendant's presence did not violate right to presence); United States v. Willis, 583 F.2d 203, 208-09 (5th Cir. 1978) (no absolute right to presence at plea bargaining conference between court, government, and alleged coconspirator); United States v. Benavides, 549 F.2d 392, 393 (5th Cir. 1977) (right to presence extends to communication between court and deliberating jury); United States v. Provenzano, 620 F.2d 985 (3d Cir.), cert. denied, 449 U.S. 899, 101 S. Ct. 267, 66 L. Ed. 2d 129 (1980) (no right of presence at conference that concerned solely questions of law); United States v. Walls, 577 F.2d 690, 697-98 (9th Cir.), cert. denied, 439 U.S. 893, 99 S. Ct. 251, 58 L. Ed. 2d 239 (1978) (absence of defendant at in-chambers conference between juror and judge, where both counsel present, not critical).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. We do not suggest that the jury's function under Florida's capital sentencing procedures is superfluous or insignificant. On the contrary, the Florida courts accord the jury's advisory sentence great weight, Proffitt v. Florida, 428 U.S. at 249-50 \u0026 n.7, 96 S. Ct. at 2965 \u0026 n.7 (citing Tedder v. State, 322 So.2d 908, 910 (Fla.1975); Thompson v. State, 328 So.2d 1, 5 (1976)); see note 11 supra, and the jury's recommendation may frequently be critical to the judge's decision. The judge is the ultimate decisionmaker under the Florida statute, however, and must independently weigh the aggravating and mitigating evidence. Fla.Stat.Ann. § 921.141(3) (West Supp.1982). Moreover, as the Supreme Court noted, \"a trial judge is more experienced in sentencing than a jury, and therefore is better able to impose sentences similar to those imposed in analogous cases.\" Proffitt v. Florida, 428 U.S. at 252, 96 S. Ct. at 2966.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. Subsequent Supreme Court cases have rejected the even broader rule suggested by dicta in the Hopt case that the right to presence cannot be waived in any felony case. Illinois v. Allen, 397 U.S. at 342-43, 90 S. Ct. at 1060; Snyder v. Massachusetts, 291 U.S. 97, 106, 54 S. Ct. 330, 332, 78 L. Ed. 674 (1934); Frank v. Mangum, 237 U.S. 309, 340-41, 35 S. Ct. 582, 592, 59 L. Ed. 969 (1915); Diaz v. United States, 223 U.S. 442, 458-59, 32 S. Ct. 250, 255, 56 L. Ed. 500 (1912). Snyder, which was a capital case, stated that the sixth amendment privilege of confrontation could \"be lost by consent or at times even by misconduct.\" Snyder v. Massachusetts, 291 U.S. at 106, 54 S. Ct. at 332. In so stating, however, the Snyder Court relied on Diaz, which expressly recognized a limitation on waiver to non-capital cases. Diaz v. United States, 223 U.S. at 455, 32 S. Ct. at 253. See also Frank v. Magnum, 237 U.S. at 341, 35 S. Ct. at 592. Moreover, in Snyder there was no allegation of waiver, and thus the Court was not specifically faced with the waiver issue in that case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. Allen was not a capital case. Apparently also in response to the Allen case, Congress in 1975 amended Fed.R.Crim.P. 43, which previously had limited waiver of presence and in absentia trial to non-capital cases. The amended rule includes no such limitation thus leaving the issue open for clarification by the courts. See 8B J. Moore, Federal Practice § 43.01[1] at 43-2, § 43.01[3] [a] at 43-4 (2d ed. 1981).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. Several courts have addressed waiver of presence in the non-capital context and have required the defendant's knowing and voluntary consent. Bustamante v. Eyman, 456 F.2d 269, 274 (9th Cir. 1972), appeal after remand, 497 F.2d 556 (9th Cir. 1974); United States v. Crutcher, 405 F.2d 239, 243 (2d Cir. 1968), cert. denied, 394 U.S. 908, 89 S. Ct. 1018, 22 L. Ed. 2d 219 (1969); Cross v. United States, 117 U.S. App. D.C. 56, 325 F.2d 629, 633 (D.C.Cir. 1963); Evans v. United States, 284 F.2d 393, 395 (6th Cir. 1960). See also United States v. Benavides, 596 F.2d 137, 139 (5th Cir. 1979) (although right to presence in non-capital case can be waived by accused's voluntary absence, court has \"narrow discretion\" in deciding whether to proceed in absentia). The Allen case supports retention of the knowing-and-voluntary waiver standard in right-to-presence cases. Allen authorized waiver where the defendant \" has been warned by the judge that he will be removed if he continues his disruptive behavior [and] he nevertheless insists on conducting himself in a manner so disorderly, disruptive, and disrespectful of the court that his trial cannot be carried on with him in the courtroom.\" Illinois v. Allen, 397 U.S. 337, 343, 90 S. Ct. 1057, 1060, 25 L. Ed. 2d 353 (emphasis added). Moreover, Allen cited Johnson v. Zerbst, 304 U.S. 458, 58 S. Ct. 1019, 82 L. Ed. 1461 (1938), which established the knowing-and-voluntary-waiver standard. Similarly, the Court's conclusion in Drope v. Missouri, 420 U.S. 162, 95 S. Ct. 896, 43 L. Ed. 2d 103 (1975), that there had been insufficient inquiry to afford a basis for deciding the waiver issue was based on cases applying a knowing-and-voluntary standard for waiver. Id. at 182, 95 S. Ct. at 909 (citing Westbrook v. Arizona, 384 U.S. 150, 86 S. Ct. 1320, 16 L. Ed. 2d 429 (1966); United States v. Silva, 418 F.2d 328 (2d Cir. 1969)). See also Gardner v. Florida, 430 U.S. 349, 361, 97 S. Ct. 1197, 1206, 51 L. Ed. 2d 393 (1977) (applying knowing-and-intelligent waiver standard in similar context).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. Although the defense attorney's waiver of appellant's presence during Dr. Coffer's testimony was therefore inoperative, it is unclear whether appellant may nonetheless have waived this claim by failing to raise it on direct appeal. Since the state has not argued such post-trial procedural default on the part of appellant, we do not consider it as a basis for denying appellant's claim. Washington v. Watkins, 655 F.2d at 1368.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. In Rogers v. United States, 422 U.S. 35, 40, 95 S. Ct. 2091, 2095, 45 L. Ed. 2d 1 (1975), the Supreme Court stated that denial of the right to presence can be harmless, and the former Fifth Circuit has applied the harmless error standard to denials of the right to presence on numerous occasions. United States v. Killian, 639 F.2d 206, 210 (5th Cir. 1981), cert. denied, 451 U.S. 1021, 101 S. Ct. 3014, 69 L. Ed. 2d 394 (1982); United States v. Dominguez, 615 F.2d 1093, 1096 n.4 (5th Cir. 1980); United States v. Bokine, 523 F.2d 767, 770 (5th Cir. 1975); United States v. Gradsky, 434 F.2d 880 (5th Cir. 1970), cert. denied, 409 U.S. 894, 93 S. Ct. 203, 34 L. Ed. 2d 151 (1971); United States v. Howard, 433 F.2d 1, 3 (5th Cir. 1970), cert. denied, 401 U.S. 918, 91 S. Ct. 900, 27 L. Ed. 2d 819 (1971); Estes v. United States, 335 F.2d 609, 618-19 (5th Cir. 1964), cert. denied, 379 U.S. 964, 85 S. Ct. 656, 13 L. Ed. 2d 559 (1965) (Rule 43, Fed. R.Crim.P., must be considered in conjunction with id. Rule 52(a) (harmless error rule)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. The standard we employ in reviewing the district court's factual findings is the clearly erroneous standard. United States v. Hughes, 635 F.2d 449 (5th Cir. 1981). In reviewing questions of law and mixed questions of fact and law, however, we are free to substitute our own judgment for that of the lower court. Baty v. Balkcom, 661 F.2d 391, 394 n.7 (5th Cir. 1981); Baker v. Metcalfe, 633 F.2d 1198, 1201 (5th Cir. 1981). Although a few prior cases may be read as suggesting otherwise, see St. Jules v. Estelle, 505 F.2d 656 (5th Cir. 1974); Lawrence v. Wainwright, 445 F.2d 281, 282 (5th Cir. 1971), we believe the determination whether a constitutional error is harmless presents a mixed question of fact and law. Cf. United States v. Dixon, 593 F.2d 626, 629 (5th Cir. 1979) (decision whether error is harmless requires examination of facts, context of error, and prejudice created thereby juxtaposed against strength of evidence of guilt). See also Napue v. Illinois, 360 U.S. 264, 79 S. Ct. 1173, 3 L. Ed. 2d 1217 (1959) (Supreme Court is not bound by state or lower courts' determination that constitutional error did not affect verdict and must make independent examination of record); Taylor v. Lombard, 606 F.2d 371, 375 (2d Cir. 1979) (court of appeals, confronted with claimed constitutional error, must review record and make its own determination of whether error occurred and, if so, whether there was reasonable likelihood it affected fairness of defendant's trial); United States ex rel. Washington v. Vincent, 525 F.2d 262, 267 (2d Cir. 1975) (although state court held state's misconduct did not affect outcome of trial and district court agreed, court of appeals would make its own independent examination of record). Hence, though we will defer to the district court's subsidiary findings absent clear error, we apply our own independent judgment to the question of whether the facts shown indicate appellant's absence from the Coffer hearing was harmless beyond a reasonable doubt.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. The right of a criminal defendant to be present at all critical stages of his trial is a fundamental constitutional right. See Dutton v. Evans, 400 U.S. 74, 79, 91 S. Ct. 210, 214, 27 L. Ed. 2d 213 (1970) (confrontation of adverse witnesses is a fundamental right); Illinois v. Allen, 397 U.S. 337, 338, 90 S. Ct. 1057, 1058, 25 L. Ed. 2d 353 (1970) (right to be present is \"one of the most basic rights guaranteed by the Confrontation Clause . . .\"). It is clear that once the defendant has established a violation of that right his conviction is unconstitutionally tainted and reversal is required unless the State proves the error was harmless beyond a reasonable doubt. See United States v. Stratton, 649 F.2d 1066, 1080 (5th Cir. 1981) (citing Rogers v. United States, 422 U.S. 35, 40, 95 S. Ct. 2091, 2095, 45 L. Ed. 2d 1 (1975)); cf. Wright v. Estelle, 572 F.2d 1071, 1081 (5th Cir. 1978) (en banc) (Godbold, J., dissenting) (violation of fundamental rights necessitates automatic reversal, even in face of arguably harmless error). We see nothing in the Supreme Court's recent decision in United States v. Valenzuela-Bernal, 458 U.S. 858, 102 S. Ct. 3440, 73 L. Ed. 2d 1193 (1982), that alters this mode of analysis in cases involving the defendant's right to be present at the critical stages of his trial. In Valenzuela-Bernal, the Court held that because the sixth amendment only guarantees a criminal defendant \"compulsory process for obtaining witnesses in his favor,\" the defendant must make a plausible showing that the witnesses whose testimony he seeks to compel would offer favorable testimony. Id. at, 102 S. Ct. at 3446 (emphasis in original). This decision may, but need not be read as requiring that a defendant demonstrate prejudice as a prerequisite to obtaining relief under the compulsory process clause. Because Valenzuela-Bernal concerns a criminal defendant's rights under the compulsory process clause, its arguable prejudice requirement does not govern this case, in which a different constitutional provision -- the confrontation clause -- is at issue. Even if we assume that the holding in Valenzuela-Bernal is so broad as to incorporate a prejudice requirement in confrontation clause cases, our result would be no different. In our view, the same evidence proffered by Proffitt to rebut the State's claim of harmless error conclusively establishes that the denial of his right to be present at the post-trial hearing seriously prejudiced him.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. The judge found AS TO AGGRAVATING CIRCUMSTANCES : (A) That the Defendant, CHARLES WILLIAM PROFFITT, murdered JOEL RONNIE MEDGEBOW from a premeditated design and while the Defendant, CHARLES WILLIAM PROFFITT, was engaged in the commission of a felony, to-wit: burglary. (B) That the Defendant, CHARLES WILLIAM PROFFITT, has the propensity to commit the crime for which he was convicted, to-wit: Murder in the First Degree and is a danger and a menace to society. (C) That the murder of JOEL RONNIE MEDGEBOW by the Defendant, CHARLES WILLIAM PROFFITT, was especially heinous, atrocious and cruel. (D) That the Defendant knowingly through his voluntary and intentional acts leading up to and during the course of the commission of the offense for which he was convicted created a great risk of serious bodily harm and death to many persons. I Trial Record 57-58.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. Under Jackson v. Virginia, 443 U.S. 307, 99 S. Ct. 2781, 61 L. Ed. 2d 560 (1979), it is clear that federal courts' responsibilities in reviewing habeas challenges to state court convictions encompass a limited evidentiary review aspect -- namely, the determination \"whether any rational trier of fact could have found the essential elements of the crime beyond a reasonable doubt.\" Id. at 313-18, 99 S. Ct. at 2785-88. We need not address whether a similar evidentiary review function must be exercised with respect to the facts underlying capital sentencing decisions, however, cf. Spinkellink v. Wainwright, 578 F.2d 582, 606 n.28 (5th Cir. 1978), cert. denied, 440 U.S. 976, 99 S. Ct. 1548, 59 L. Ed. 2d 796 (1979) (evidentiary review proper where application of § 921.141 in particular case is \"patently unjust and [] shock[s] the conscience\"), since appellant's claim is cognizable as a vagueness challenge to the statute as applied, see text infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. The state argues that the former Fifth Circuit decision in Spinkellink v. Wainwright, 578 F.2d 582 (5th Cir. 1978) precludes us from reviewing the Florida court's application of specific aggravating factors to the facts of this case. In Spinkellink, the court interpreted the Supreme Court's decision in Proffitt v. Florida, 428 U.S. 242, 96 S. Ct. 2960, 49 L. Ed. 2d 913 (1976) as holding that the aggravating and mitigating provisions of the Florida death-penalty statute \" conclusively remove[] the arbitrariness which Furman held violative of the Eighth and Fourteenth Amendments.\" See Spinkellink v. Wainwright, 578 F.2d at 604-06. The court therefore declined to review an attack on the statute as applied absent facts and circumstances \"so clearly undeserving of capital punishment that to impose it would be patently unjust and would shock the conscience.\" Id. at 605-06 \u0026 n.28. Two years after the former Fifth Circuit decided Spinkellink, the Supreme Court addressed an attack on a state court's application of an aggravating factor under its capital sentencing statute. See Godfrey v. Georgia, 446 U.S. 420, 100 S. Ct. 1759, 64 L. Ed. 2d 398 (1980). Four Justices joined in the plurality opinion, which accorded full review to this contention. Id. at 422, 100 S. Ct. at 1762. Two Justices concurred in the judgment both on the ground that the death penalty is under all circumstances unconstitutional and in agreement with the plurality's conclusion concerning the application of the statute. See id. at 433-42, 100 S. Ct. at 1767-72. (Brennan, J. and Marshall, J., concurring). In view of Godfrey, we can only conclude that the language in the Spinkellink opinion precluding federal courts from reviewing state courts' application of capital sentencing criteria is no longer sound precedent. In Williams v. Maggio, 679 F.2d 381, 386-90 (5th Cir. 1982), the former Fifth Circuit refused to consider a challenge to two statutory aggravating factors on grounds similar to those asserted here because the state appellate court had affirmed the sentence on the basis of a third valid aggravating factor. The court interpreted Godfrey as justifying reversal of a death sentence only where the sentence is based solely on the unsupported aggravating factor. Id. at 390. Williams, which was decided by Unit A of the former Fifth Circuit after October 1, 1981, is not controlling precedent in the Eleventh Circuit. Stein v. Reynolds Securities, Inc., 667 F.2d 33, 34 (11th Cir., 1982 as corrected June 28, 1982). Moreover, Williams is distinguishable because in that case the petitioner challenged only allegedly unsupported aggravating factors, whereas appellant here asserts that his sentence was based on unsupported and non-statutory factors. See section IV.D.2 infra. We need not decide whether appellant's claims of unsupported aggravating factors alone would merit reversal of his sentence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. In Gregg, the Court had rejected a challenge to the same aggravating circumstance on the ground \"that it is so broad that capital punishment could be imposed in any murder case,\" noting that \"it is, of course, arguable that any murder involves depravity of mind or an aggravated battery. But this language need not be construed in this way, and there is no reason to assume that the Supreme Court of Georgia will adopt such an open-ended construction.\" Gregg v. Georgia, 428 U.S. at 201, 96 S. Ct. at 2938.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. The plurality noted that \"there is nothing in these few words [\"outrageously or wantonly vile, horrible and inhuman\"], standing alone, that implies any inherent restraint on the arbitrary and capricious infliction of the death sentence,\" since \"[a] person of ordinary sensibility could fairly characterize almost every murder\" as meeting that definition. Because the judge had given the jury no instruction regarding the meaning of those terms, the plurality concluded that the jury's sentencing discretion was basically uncontrolled. Godfrey v. Georgia, 446 U.S. at 428-29, 100 S. Ct. at 1764-65. Moreover, the record evinced no evidence nor had the prosecution claimed that the defendant \"committed an aggravated battery upon his wife or mother-in-law, or in fact, caused either of them to suffer any physical injury preceding their deaths.\" Id. at 432, 100 S. Ct. at 1767. Finally, the Georgia Supreme Court's affirmance of the defendant's sentence did not, in the plurality's view, cure the broad construction that the jury apparently had accorded the aggravating factor, since that court had not disagreed with the trial judge's statement that the murders had not involved any torture. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. See Proffitt v. Florida, 428 U.S. 242, 254 n.11, 96 S. Ct. 2960, 2967 n.11, 49 L. Ed. 2d 913 (1976). Appellant attacked these aggravating factor provisions as impermissibly vague and broad. The challenge was directed toward, and was treated by the plurality as one questioning, the facial constitutionality of the statutory aggravating factors \"as they have been construed by the Supreme Court of Florida.\" Proffitt v. Florida, 428 U.S. at 255-56, 96 S. Ct. at 2968. In support of his challenge to the statute, appellant cited the application of the aggravating factor provisions to his own case as demonstrative of the broad interpretation accorded them by the Florida Supreme Court. With respect to the \"great risk of death to many persons\" factor, the plurality found that the Florida court had not relied on such factor in affirming appellant's sentence; the Court thus did not consider appellant's case as having any bearing on the construction of that provision. See Proffitt v. Florida, 428 U.S. at 256 n.13, 96 S. Ct. at 2968 n.13. The plurality, in concluding that the Florida court had consistently applied its limited construction of the \"heinous, atrocious, and cruel\" circumstance, did not specifically state whether the application of that provision to appellant's crime comported with the Florida court's constitutionally tailored definition of the eighth statutory factor.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. The trial judge's findings state only that the eighth statutory factor was established and not the particular facts on which such conclusion was based. Since the physician who conducted the autopsy of the victim testified that he discovered no injuries to the victim's body other than the stab wound that pierced his chest and heart, II Trial Record 229, there were no facts supporting the trial court's application of factor eight under the limiting construction adopted by the state supreme court. Nor was the higher court's construction of that provision unavailable to the trial court at the time of appellant's sentencing. State v. Dixon, 283 So.2d 1 (Fla. 1073), the seminal decision interpreting the new Florida death penalty statute and considering its constitutionality, was decided nearly one year before appellant's trial. That case stated that \"what is intended to be included [in the eighth statutory aggravating circumstance] are those capital crimes where the actual commission of the capital felony was accompanied by such additional acts as to set the crime apart from the norm of capital felonies -- the conscienceless or pitiless crime which is unnecessarily torturous to the victim.\" Id. at 9 (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57. The relevant portion of the judge's sentencing instructions provides: The aggravating circumstances which you may consider are limited to such of the following as may be established by the evidence: . . . Eighth, that the crime for which the defendant is to be sentenced was especially heinous, atrocious or cruel. You are instructed that \"heinous\" means extremely wicked or shockingly evil; and that \"atrocious\" means outrageously wicked and vile. \"Cruel\" means designed to inflict a high degree of pain; utter indifference to, or enjoyment of, the suffering of others; pitiless. IV Trial Record 531. This language, which is derived from State v. Dixon, supra, provides little more guidance than the statute's original terms to aid the jury in determining when this factor should be applied as a basis for imposing the death penalty. The modifiers in the instruction -- \"extremely,\" \"outrageously,\" and \"shockingly,\" like the term \"especially\" employed in the statute, signal that the crime should be in some respect worse than average. The difficulty with the various adjectives used in either the statute (heinous, atrocious, and cruel) or the instruction (wicked, evil, vile) is that they fail to indicate in what way the crime should be \"worse.\" While they indicate some sense of dimension or degree, they fail to state what is being measured. As the Supreme Court has noted, \"[a] person of ordinary sensibility could characterize almost every murder\" within such terms, Godfrey v. Georgia, 446 U.S. at 428-29, 100 S. Ct. at 1764-65, and the jury in this case could well have subscribed to such a view. Finally, although the definition of cruel provided by the trial judge is more specific than the rest of the instruction and hints of the \"additional [torturous] acts\" requirement set forth in Dixon, the instruction fell short of imposing such limitation since the cruelness feature of the aggravating factor is an alternative one. Hence, the jury's sentencing discretion was not significantly limited by this part of the instruction.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58. The trial court's findings stated this aggravating factor in terms that were arguably broader than the statutory terms; it found appellant had \"created a great risk of serious bodily harm and death to many persons,\" whereas the statutory factor encompasses only \" great risk of death.\" Compare Fla.Stat. § 921.141(5) (c) (reprinted in note 8 supra) with note 50 supra. Because the statute does not include as aggravating a risk of bodily harm other than death, appellant contends the judge's finding represents a non-statutory aggravating factor. The discrepancy between the judge's findings and the statute does not on its face appear significant, because the language used by the judge suggests his finding included both a risk of death and a risk of bodily harm to many persons. On the other hand, the facts surrounding appellant's offense, which do not support risk of death, may be viewed as an indication that the court included the reference to serious bodily harm precisely because it thought the evidence in this case did not support the \"great risk of death\" factor. In any event, we need not decide whether the trial court's finding, as stated, represents consideration of a non-statutory aggravating factor since we have already concluded that the application of § 921.141(5) (c) to this case renders the provision unconstitutionally vague and invalidates its use as a factor supporting appellant's sentence. See section IV.D.1 supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59. In Kampff v. State, 371 So.2d 1007 (Fla. 1979), the Florida Supreme Court reversed a trial court finding that the defendant, who had killed his victim by firing five shots at her at a retail store in the presence of two other persons, had created a great risk of harm to many persons within the meaning of the aggravating circumstance provision. The court stated: When the legislature chose the words with which to establish this aggravating circumstance, it indicated clearly that more was contemplated than a showing of some degree of risk of bodily harm to a few persons. \"Great risk\" means not a mere possibility but a likelihood or high probability. The great risk of death created by the capital felon's actions must be to \"many\" persons. By using the word \"many,\" the legislature indicated that a great risk of death to a small number of people would not establish this aggravating circumstance. Id. at 1009-10. Accord Lewis v. State, 398 So.2d 432, 438 (Fla.1981) (shooting of victim in total disregard for safety of two others present insufficient); Jacobs v. State, 396 So.2d 713, 718 (Fla.1981) (shooting of two persons, though near major highway, not sufficient where done with pistols at close range); Johnson v. State, 393 So.2d 1069, 1073 (Fla.1980), cert. denied, 454 U.S. 882, 102 S. Ct. 364, 70 L. Ed. 2d 191 (1981) (three others present besides victim at time of shootout not \"many persons\" within statutory aggravating factor); Williams v. State, 386 So.2d 538 (Fla.1980) (great risk of death to one other besides victim insufficient to trigger third aggravating circumstance); Brown v. State, 381 So.2d 690 (Fla.1980), cert. denied, 449 U.S. 1118, 101 S. Ct. 931, 66 L. Ed. 2d 847 (1981) (risk of death to victim only not sufficient though murder committed in public place); Lewis v. State, 377 So.2d 640, 646 (Fla.1979) (presence of victim's two children in possible path of defendant's bullets not sufficient to establish risk to \"many persons\"). See also Mines v. State, 390 So.2d 332, 337 (Fla.1980), cert. denied, 451 U.S. 916, 101 S. Ct. 1994, 68 L. Ed. 2d 308 (1981) (only conduct of defendant directly surrounding capital offense may be considered in applying third aggravating factor; defendant's acts after murder of flagging down motorist, striking him with machete, driving to real estate office at high rate of speed, taking woman hostage, and threatening her life could not be considered). Compare above cases with King v. State, 390 So.2d 315, 320 (Fla.1980), cert. denied, 450 U.S. 989, 101 S. Ct. 1529, 67 L. Ed. 2d 825 (1981) (factor upheld as applied to defendant's acts of arson, which foreseeably risked death to occupant of dwelling, neighbors, firefighters and police).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e60. In Henry, the petitioner had failed to object at trial to the jury instructions that were the subject of his habeas challenge. Henry v. Wainwright, 661 F.2d at 57. The state argued that by violating Florida's contemporaneous objection rule Henry had waived his claim of error in the instructions under Wainwright v. Sykes, 433 U.S. 72, 97 S. Ct. 2497, 53 L. Ed. 2d 594 (1977). The Henry court rejected this argument, however, on the ground that an objection would have been futile. The Supreme Court vacated the former Fifth Circuit decision in Henry for reconsideration in light of Engle v. Isaac, 456 U.S. 107, 102 S. Ct. 1558, 71 L. Ed. 2d 783 (1982). Wainwright v. Henry, 457 U.S. 1114, 102 S. Ct. 2922, 73 L. Ed. 2d 1326 (1982). In Engle, the Supreme Court held that \"the futility of presenting an objection to the state courts cannot alone constitute cause for a failure to object at trial.\" Id. at, 102 S. Ct. at 1572, 71 L. Ed. 2d at 802. The Supreme Court's decision to vacate Henry presumably was based on the Henry court's articulation of a standard for cause that may conflict with that adopted in Engle. The waiver issue involved in Henry is not present with respect to Proffitt's aggravating circumstances claims. Appellant's constitutional challenges are aimed not at the jury instructions but rather at the trial judge's findings on aggravating circumstances. Obviously no objection to the findings could have been raised at trial because the judge did not make the findings until after the trial. On his direct appeal to the Florida Supreme Court, appellant objected to the findings concerning at least two of the aggravating circumstances and asserted generally that the judge had exercised unfettered discretion in imposing the death sentence. See V Trial Record 561; VII Trial Record 615. In any event, the state has not argued that appellant waived his objections to the aggravating circumstances findings; hence, the state has waived any waiver argument it might have asserted. Cf. Hopkins v. Jarvis, 648 F.2d 981, 983 n.2 (5th Cir. 1981)(state's failure to raise lack of exhaustion requirement); Messelt v. Alabama, 595 F.2d 247, 250-51 (5th Cir. 1979) (same).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e61. The transcript of appellant's sentencing hearing indicates that the attorney for the state introduced evidence of, and directed part of his argument to establishing, non-statutory aggravating factors. He asked the jury to consider various factors, which he did not attempt to place within the statutory categories, such as the \"senselessness\" of the killing; the relative youth of the victim, the fact that he was well-liked, and the impact of the killing on his family; the dangerousness of the defendant and failure of the criminal justice system to rehabilitate him after his prior conviction; the frightening nature of the crime and the \"preciousness\" of people's right to be secure in their own homes; and the defendant's flight after the crime and five-month absence from the jurisdiction prior to extradition. Appellant does not challenge the court's admission of such evidence and argument -- presumably because his attorney's failure to object at the time waived his right to assert such a challenge.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e62. Indeed, in view of the special responsibility of the judge to ensure consistency in capital sentencing decisions by applying the statute \"in the light of judicial experience,\" State v. Dixon, 283 So.2d 1, 8 (Fla.1973); Proffitt v. Florida, 428 U.S. at 252, 96 S. Ct. at 2966, the judge's improper consideration of non-statutory aggravating factors in this case may be a more egregious violation of Furman than the jury's consideration of such evidence in Henry. See note 42 supra and accompanying text.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e63. Appellant's claim that the trial court's instructions precluded the jury from considering mitigating evidence he proffered that did not fall within the statutory mitigating circumstances, if accepted, would further undermine the state's characterization of this case as involving no mitigating factors. As noted in section IV.E infra, however, we do not decide appellant's mitigating circumstances claim because such decision is unnecessary to our resolution of this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e64. Proffitt v. Florida, 428 U.S. at 250-51, 253, 258-59, 96 S. Ct. at 2969. See also Henry v. Wainwright, 661 F.2d at 60 n.8 (\"Such a guessing game is the antithesis of the rational review of the jury's application of clear and objective standards contemplated by Furman and its progeny.\"); Stephens v. Zant, 631 F.2d 397, 406 (5th Cir. 1980), reh. denied and modified, 648 F.2d 446 (5th Cir. 1981), cert. granted, 454 U.S. 814, 102 S. Ct. 90, 70 L. Ed. 2d 82 (1981), certified to Georgia Supreme Court, 456 U.S. 410, 102 S. Ct. 1856, 72 L. Ed. 2d 222 (1982) (vacating death sentence based partly on unconstitutionally vague aggravating factor because it is \"impossible for a reviewing court to determine satisfactorily that the verdict in this case was not decisively affected by an unconstitutional statutory aggravating circumstance\").\u003c/span\u003e\n\n",
    "body_length": 170064,
    "citedas": [
      "685 F.2d 1227"
    ],
    "attorneys": "Kathryn Emmett, Stamford, Connecticut, David Golub, Connecticut, Deborah Fins, New York, New York, for Appellant. Jim Smith, Atty. Gen., Tampa, Florida, Charles Corces, Jr., AAG, Tampa, Florida, for Appellee.",
    "category": [
      "243",
      "36",
      "78",
      "75"
    ],
    "judges": "Vance, Kravitch and Clark, Circuit Judges. Judge Clark reserves the right to file a concurring or dissenting opinion.",
    "citation_count": 152
  }
}
