{
  "id": "EsXJXmYBTlTomsSBzjSn",
  "document": {
    "title": "In re Winczewski",
    "full_title": "IN THE MATTER OF THE MARRIAGE OF EILEEN WINCZEWSKI, AKA EILEEN ORDWAY AND STEPHEN WINCZEWSKI BELOW, AND OLIVER WINCZEWSKI AND BARBARA WINCZEWSKI .",
    "jurisdiction": "Court of Appeals of Oregon",
    "date": "2003-07-16T00:00:00.000Z",
    "docket": "A112079",
    "body": "En Banc\n\nArgued and Submitted October 3, 2002; resubmitted en banc June 4, 2003.\n\nAffirmed by an equally divided court.\n\nDeits, C. J., concurring.\n\nEdmonds, J., dissenting.\n\nBrewer, J., dissenting.\n\nSchuman, J., dissenting.\n\nDEITS, C. J., concurring.\n\nMother appeals from a judgment that awarded custody of two of her children to their paternal grandparents. On de novo review of the facts, ORS 19.415(3); State v. Wooden, 184 Or App 537, 57 P3d 583 (2002), I conclude the following: (1) ORS 109.119 (2001) applies to this case. (2) Grandparents have rebutted the statutory presumption that mother acts in the best interests of the children by demonstrating by a preponderance of the evidence that mother is unable to care adequately for the children and that circumstances detrimental to the children exist if grandparents are denied custody. (3) Because awarding custody to grandparents is also in the children's best interest, grandparents should be awarded custody under ORS 109.119. (4) Further, that application of the statute does not infringe on mother's federal constitutional right to the care, custody, and control of her children because grandparents have demonstrated by a preponderance of the evidence that mother is unable to care adequately for the children and that the children face an undue risk of physical or psychological harm in mother's custody. (5) That constitutional standard does not require that grandparents demonstrate that mother is unfit under the standards in the termination of parental rights statutes or demonstrate circumstances that present similarly grave risks of harm. Accordingly, I would affirm.\n\nI. PROCEDURAL HISTORY\n\nMother and father, who is now deceased, had two daughters, A and J. Mother and father's marriage was dissolved in 1995. They initially had joint custody of the children, and the children spent their time with father at grandparents' home.\n\nIn November 1996, father obtained sole custody. The judgment that awarded father custody of the children stated, in part, that \"[m]other has substantial emotional problems that impact her interactions with [father] and his parents, and her parenting[.]\"\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e After that judgment was entered, the court restricted mother's contact with the children because, as grandmother testified, mother was showing up inappropriately at the school. After father obtained sole custody in November 1996 and until his death in April 1999, the children lived with him in grandparents' home. During the time that the children lived in grandparents' home, they provided substantial assistance in caring for the children.\n\nIn 1998, grandparents intervened in the case involving mother and father's dissolution, the case that is now the subject of this appeal. The trial court's order stated, in part, that \"[grandparents] are granted intervenor status in the custody case involving [A] and [J] Winczewski, and shall be treated as parties in any future court proceedings involving these children.\"\n\nFather died of lymphoma in April 1999. Immediately after father's funeral, which was held several days after his death, mother took the children to live with her and her family. Mother is currently married to Paul Ordway, and they have two children, C and L. Also, after father's death, grandparents sought custody of A and J. The children lived with mother until the time of trial, although the children visited grandparents throughout that time period.\n\nThe trial took place in May and July 2000. In her trial memorandum, mother's attorney argued that \"[t]he 14th Amendment to the United States Constitution protects a natural parent's interest in the right to the care, custody and management of his/her children\" and that\n\n\"[a] constitutional application of ORS 109.119 requires more than a finding of 'best interests of the children,' it requires a finding of 'compelling reasons' or 'threat of harm' to the children. Hruby[ and Hruby, 304 Or 500, 509, 748 P2d 57 (1987)]. Awarding custody to a non-parent, even in the 'best interests of the children' is not 'appropriate' if it deprives the parent of a basic and substantive right, in the absence of a compelling state interest. It is not a compelling state interest to simply 'maximize every child's welfare[.]' [Id. at 511].\"\n\nDuring her closing argument in July 2000, mother's attorney argued that, under Troxel v. Granville, 530 US 57, 120 S Ct 2054, 147 L Ed 2d 49 (2000), \"there has to be * * * a significant showing of harm or a high risk of harm in order for the [s]tate, and therefore, the courts within the state, to interfere with the ordinary decision-making authority of a natural parent.\"\n\nAfter the parties' closing arguments, the trial court stated that, if the standard were the best interests of the children, grandparents would prevail. However, the court also indicated that, if it had to find \"a level of harm, if not equal to, close to that in which the [s]tate would be intervening, anyway, where the [s]tate would go in as a CSD or SOSCF matter * * * and take control of the children,\" mother should receive custody. In its judgment, the court stated, in part:\n\n\"THE COURT FINDS that a child-parent relationship exists between [A] and [J] Winczewski and their grandparents, Oliver and Barbara Winczewski; that the provisions of ORS 109.119 apply to this case; and that Oliver and Barbara Winczewski are intervenor grandparents under ORS 109.119.\n\n\"THE COURT FINDS that it is in the best interests of these children to reside with their grandparents, Oliver and Barbara Winczewski, because the children would receive better emotional support in the Winczewski home; their educational and psychological needs would be better met; their nutritional and health needs would be better met; and in all respects the children would be much better off living with their grandparents. Based on the testimony of Dr. Sabin, the educational and emotional factors overwhelmingly favor placement of these children with the Winczewski grandparents.\n\n\"THE COURT ALSO FINDS that the United States Supreme Court case of Troxel * * * can be distinguished from this case, in that the Oregon statute (ORS 109.119) requires the finding of a 'child-parent' relationship, while the Washington statute in Troxel did not require such a finding. Thus, Troxel did not require the [c]court in this case to make a finding of harm or unfitness on the part of the biological parent before awarding custody to grandparent intervenors. After reviewing the statutes and case law, the [c]court finds that the following language in Sleeper and Sleeper, 328 Or 504[, 982 P2d 1126] (1999)[,] applies to this case:\n\n\"'If the best interests of the child call for custody to the nonbiological parent, then the court must make such award, unless to do so would violate some supervening right belonging to the biological parent.' 328 Or [at] 511[.] * * *\n\n\"Applying the statutes and case law to the facts of this case, the [c]court finds that the law requires an order of custody to the Winczewski grandparents.\"\n\nSince the conclusion of the trial in July 2000, the children have lived with grandparents.\n\nOn appeal, mother makes three assignments of error: (1) \"The trial court erred in applying a 'best interests of the child' standard to a custody dispute between a natural parent and non-parents.\" (2) \"The trial court erred in holding that [grandparents'] status of having a 'parent-child relationship' alleviated the requirement that it find more compelling reasons than 'best interests of the child' to award custody to them.\" (3) \"The trial court erred in awarding custody to [grandparents] and placing restrictions on [m]other's parental rights when she is a fit parent and when the court found no threat of harm to the children.\" The gravamen of mother's assignments of error and arguments is the following: Because she has a liberty interest in the care, custody, and control of her children under the Due Process Clause of the Fourteenth Amendment to the United States Constitution, the trial court erred by applying a \"best interests\" standard and by awarding custody to grandparents without finding that mother is unfit or that there is a risk of harm to the children in mother's custody.\n\nGrandparents counter:\n\n\"While this appeal was pending, the Oregon legislature amended ORS 109.119 to include a rebuttable presumption that a legal parent acts in the best interest of his or her child. ORS 109.119(2)(a)[ (2001).] That presumption can be overcome by a preponderance of the evidence. If the court finds that the presumption has been rebutted, it is required to make findings of fact in support of the rebuttal. ORS 109.119(2)(b)[ (2001).]\n\n\"The amended statute allows the court to consider several factors in intervenor custody cases. One of those factors is whether the legal parent is able to adequately care for the child. ORS 109.119(4)(b)(A)[.] A second factor is whether the intervenor has recently been the child's primary caretaker. ORS 109.119(4)(b)(B)[.] A third factor is whether circumstances detrimental to the child would exist if relief is denied. ORS 109.119(4)(b)(C)[.] 'Circumstances detrimental to the child' includes circumstances that may cause psychological, emotional or physical harm. ORS 109.119(8)(b)[.]\n\n\"In light of changes in the law which have occurred since the time of trial, appellant mother is correct that the trial court should not have based its decision solely on the best interests of the children. * * *\n\n\"When the legal standard changes during the course of a custody appeal, the Court of Appeals should apply the new legal standard to the facts on de novo review. Frederiksen v. Ostermeier, 162 Or App 430, 986 P2d 1194 (1999); Harrington v. Daum, 172 Or App 188, 18 P3d 456 (2001); Newton v. Thomas, 177 Or App 670, 33 P3d 1056 (2001)[, overruled in part on other grounds by O'Donnell-Lamont and Lamont, 187 Or App 14, 67 P3d 939 (2003)]. In this de novo review, the appellate court needs to make findings about whether this mother is 'fit' and then decide whether awarding custody to the grandparents is in the best interests of the children.\"\n\nII. THE APPLICABLE STATUTE\n\nI agree with mother that the trial court erred in applying the \"best interests of the child standard.\" Thus, I must determine the applicable standard.\n\nWe have recently decided several cases involving custody disputes between parents and nonparents. Strome and Strome, 185 Or App 525, 60 P3d 1158 (2003); Wooden, 184 Or App 537; O'Donnell-Lamont and Lamont, 184 Or App 249, 56 P3d 929 (2002), modified on recons, 187 Or App 14, 67 P3d 939 (2003); Wilson and Wilson, 184 Or App 212, 55 P3d 1106 (2002); Newton, 177 Or App 670. In those cases, we did not apply the 2001 amendments to ORS 109.119. In Newton, we reasoned that, because the 2001 amendments became effective July 31, 2001, we would refer to the 1999 version of ORS 109.119. In Wilson, O'Donnell-Lamont, Wooden, and Strome, we relied on our reasoning in Williamson v. Hunt, 183 Or App 339, 343-44, 51 P3d 694 (2002), overruled in part by O'Donnell-Lamont and Lamont, 187 Or App 14, 67 P3d 939 (2003). In Williamson, we addressed whether the 2001 amendments to ORS 109.119 applied retroactively. We reasoned that the retroactivity section of the 2001 law applies only to petitions filed under ORS 109.119 (1999) or ORS 109.121 (1999) and that, when a petition was filed before the effective date of the pertinent 1999 statute, the 1997 version applies.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Because the parties in Wilson, O'Donnell-Lamont, Wooden, and Strome had initiated their requests for custody before ORS 109.119 (1999) became effective, we applied ORS 109.119 (1997), a statute that we had interpreted to incorporate the federal constitutional presumption that gives effect to a parent's fundamental due process right to the care, custody, and control of his or her children. However, on reconsideration in O'Donnell-Lamont, the grandparents in that case drew our attention to the fact that the parenthetical reference to the 1999 edition in the note compiled in the published statutes, on which we had based our holding in Williamson, did not appear in the original statute. Ultimately, we held on reconsideration that, \"[a]fter we delete the reference to the 1999 edition of the statutes, it is clear that the legislature intended * * * to make the 2001 amendments to ORS 109.119 applicable to all petitions filed before the effective date of the statute[.]\" O'Donnell-Lamont, 187 Or App at 18. Thus, the 2001 amendments apply to this case.\n\nAccordingly, in this case, it is necessary to examine the interplay between the 2001 amendments to ORS 109.119 and the decisions of this court, the Oregon Supreme Court, and the United States Supreme Court in order to determine whether mother or grandparents should receive custody.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e If I apply ORS 109.119 (2001) and determine that mother should receive custody, it will be unnecessary to address mother's argument concerning her federal constitutional right. However, if I apply the statute and determine that grandparents should receive custody, it will become necessary to determine whether the application of the statute infringes on mother's substantive due process right to the care, custody, and control of her children. With that analytical template in mind, I turn to the analysis of this case.\n\nIII. APPLICATION OF ORS 109.119 (2001)\n\nA. Mother's entitlement to the statutory presumption\n\nORS 109.119 (2001) provides, in part:\n\n\"(1) Any person, including but not limited to a related or non-related foster parent, stepparent, grandparent[\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e] or relative by blood or marriage, who has established emotional ties creating a child-parent relationship or an ongoing personal relationship with a child may petition or file a motion for intervention with the court having jurisdiction over the custody, placement, guardianship or wardship of that child, or if no such proceedings are pending, may petition the court for the county in which the child resides, for an order providing for relief under subsection (3) of this section.\n\n\"(2)(a) In any proceeding under this section, there is a presumption that the legal parent acts in the best interest of the child.[\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e]\n\n\"* * * * *\n\n\"(c) The presumption described in paragraph (a) of this subsection does not apply in a proceeding to modify an order granting relief under this section.[\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e]\n\n\"(3)(a) If the court determines that a child-parent relationship exists and if the court determines that the presumption described in subsection (2)(a) of this section has been rebutted by a preponderance of the evidence, the court shall grant custody, guardianship, right of visitation or other right to the person having the child-parent relationship, if to do so is in the best interest of the child.\"\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nHere, I understand that the following issues are not in dispute: (1) Grandparents are the legal parents of A and J's father. See ORS 109.119(1); ORS 109.119(8)(c), (d). (2) Grandparents have established a child-parent relationship with A and J. See ORS 109.119(1); ORS 109.119(8)(a). (3) Mother is the biological mother of A and J, and her rights have not been terminated pursuant to ORS 419B.500 to 419B.524. See ORS 109.119(8)(d). (4) There is a presumption that mother acts in the best interests of A and J. See ORS 109.119(2)(a). Thus, the remaining issues in this case are (1) whether grandparents have rebutted the statutory presumption in favor of mother by a preponderance of the evidence, see ORS 109.119(3)(a); (2) if grandparents have rebutted the presumption, whether awarding them custody is in the best interests of A and J, see id.; and (3) if grandparents should be awarded custody under ORS 109.119, whether that application of the statute infringes on mother's fundamental due process right to the care, custody, and control of her children.\n\nB. The relevant statutory factors for rebutting the presumption\n\nIn determining whether the statutory presumption has been rebutted, I turn to ORS 109.119(4)(b), which provides:\n\n\"In deciding whether the presumption described in subsection (2)(a) of this section has been rebutted and whether to award custody, guardianship or other rights over the objection of the legal parent, the court may consider factors including, but not limited to, the following, which may be shown by the evidence:\n\n\"(A) The legal parent is unwilling or unable to care adequately for the child;\n\n\"(B) The petitioner or intervenor is or recently has been the child's primary caretaker;\n\n\"(C) Circumstances detrimental to the child exist if relief is denied;[\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e]\n\n\"(D) The legal parent has fostered, encouraged or consented to the relationship between the child and the petitioner or intervenor; or\n\n\"(E) The legal parent has unreasonably denied or limited contact between the child and the petitioner or intervenor.\"\n\nIn this case, all of the factors are relevant to a determination of whether the presumption has been rebutted.\n\nC. The use of expert testimony\n\nIn evaluating the evidence that relates to each statutory factor, I caution that each case must be decided on its own facts. Generally, no single fact will be dispositive. Instead, I examine the totality of circumstances to determine whether the presumption has been rebutted.\n\nAs in many cases involving the issue of child custody, the evidence in this case includes the testimony and written reports of Dr. Charlene Sabin and the testimony of Gary MacKendrick, the children's therapist. After mother stipulated to the selection of Sabin, the court appointed her to conduct a custody study and psychological evaluation. She is a children's physician and behavioral pediatrician and has been conducting custody evaluations since 1983. She completes approximately 10 to 20 evaluations each year. In conducting this study, she met with all of the adults and children involved; observed adult-child interactions; consulted with teachers, therapists, a doctor, and dentists; reviewed the children's medical records; and had psychological testing done on all of the adults. She issued a report in November 1999 and completed a follow-up report in May 2000 after the custody hearing had been postponed.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nMacKendrick is a therapist who has had extensive involvement with the family over approximately five years. He began working with the children when J was three years old and A was five years old. He saw them two to three times per week at the beginning and eventually saw them approximately two to three times per month. He also had contact with mother, father, and grandparents. Mother apparently discontinued her involvement with the children's therapy with MacKendrick after he testified on father's behalf in the 1996 custody hearing.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nIn this case, the experts' ultimate conclusions are stated in terms of the best interests of the children. Nevertheless, in conducting their evaluations, the experts made detailed observations and factual findings that are relevant to the issues in this case and that are not dependent on their ultimate conclusion regarding the best interests of the children. Thus, contrary to the assertions in Judge Edmonds's dissent, the expert testimony in this record contains more than subjective conclusions.\n\nAdditionally, custody cases are difficult to resolve, in part because we are put in the position of having to evaluate human behavior based on our fairly limited knowledge of the people and circumstances involved. We are not physicians, psychologists, or therapists. The evaluations of experts, such as those in this case, may be helpful to us in making decisions because the experts have had the opportunity for direct interaction with the individuals involved in these cases and have had extensive training that allows them to evaluate meaningfully an individual's behaviors and the particular circumstances. In this case, although certainly not determinative, I conclude that Sabin's and MacKendrick's detailed findings and observations are helpful and persuasive evidence.\n\nD. Application of the statutory factors\n\nWith those principles in mind, I examine each of the factors in ORS 109.119(4)(b) in light of the evidence in this case. For ease of analysis, however, I do not discuss the factors in the order in which they appear in the statute. After applying the factors, I conclude that custody of A and J should be awarded to grandparents.\n\n1. \"The petitioner or intervenor is or recently has been the child's primary caretaker[.]\" ORS 109.119(4)(b)(B). \"The legal parent has fostered, encouraged or consented to the relationship between the child and the petitioner or intervenor[.]\" ORS 109.119(4)(b)(D). \"The legal parent has unreasonably denied or limited contact between the child and the petitioner or intervenor.\" ORS 109.119(4)(b)(E).\n\nThe children lived with father in grandparents' home for a substantial period of time. During the period between father's funeral and trial, the children lived with mother. Grandmother testified that she and mother do not have regular communication about the children. Mother and grandparents acknowledge that communication between them is sometimes difficult. While the children were living with mother, she allowed the children to visit grandparents. During a Thanksgiving vacation, mother allowed grandparents an extended visit with A and J so that grandparents could take them to Denver to visit their uncle. Mother also allowed the children to visit grandparents during other holidays and school vacations. Apparently, visitation with grandparents was not ordered by the court. Mother testified that she believes that A and J are attached to grandparents and that, if she is awarded custody, she \"would like them to visit regularly.\" Thus, grandparents have been involved in caring for A and J, and mother has consented to the continuing relationship between the children and grandparents and has not unreasonably denied grandparents contact with the children.\n\n2. \"The legal parent is unwilling or unable to care adequately for the child[.]\" ORS 109.119(4)(b)(A). \"Circumstances detrimental to the child exist if relief is denied[.]\" ORS 109.119(4)(b)(C).\n\na. The children's general needs and mother's emotional limitations\n\nThe evidence demonstrates that mother is unable to care adequately for the children, ORS 109.119(4)(b)(A), and that circumstances detrimental to the children exist if grandparents are denied custody, ORS 109.119(4)(b)(C). Specifically, the evidence demonstrates that mother is not able to satisfy A's and J's particular needs because of her own emotional limitations. Even though I focus my discussion on the issue of whether mother can meet A's and J's needs, much of that evidence also demonstrates that circumstances detrimental to the children exist if grandparents are denied custody.\n\nMacKendrick testified that A's and J's need for consistency and stability is important because,\n\n\"without that basis, the psychological container, whether you call it an ego or self or whatever, just simply does not have a chance to grow and to achieve and develop the various skills and work through the developmental processes that are normal in life, and indeed opens those children to confusion and to significant crises in their lives.\"\n\n(Emphasis added.)\n\nSabin also testified that the children \"need all the usual kind of parenting that we all need, in terms of structure, security, stability, predictability, regular schedules and consequences, regular places to sleep.\" However, according to Sabin, mother cannot provide for those general needs:\n\n\"The only clear strength in considering a placement with [mother] is that she is the girls' biologic mother, and this has some symbolic significance to them. This does not outweigh their needs for structure, boundaries, social skills, academic support, therapy, emotional communication, positive role modeling, and perhaps psychotropic medication, that she cannot provide.\"\n\n(Emphasis added.) Sabin also acknowledged that the attachment between siblings is an important consideration but that such attachment is \"not more important than health, safety, education, and emotional development.\" Sabin indicated that the environment in mother's home \"is not positive\" and \"is not healthy\" for A and J. Additionally, she testified, \"I don't feel that [the children's] relationship with their mother has been emotionally healthy for them, and I don't see that relationship as growing in a healthy way[.]\"\n\nIn addition to testifying about the children's general needs, Sabin also testified about mother's \"confusion in processing and understanding emotional issues\":\n\n\"My biggest concern, my biggest theme for these children, is probably in the area of emotional development. [Mother] has difficulty separating her needs, her emotional needs, from those of the children. She has difficulty promoting the children's separate physical development, even, in terms of wanting to home school them. She has difficulty trusting others outside the family to have positive relationships with the children.\n\n\"The children related to me a number of conflicts with the neighbors, such that the children had set a fire in the lot near the mother's home, and the neighbor had called the fire department, and the neighbor was angry. And [mother] became angry at her for calling the fire department, and [A] recounts all this, but the children don't learn positive ways of processing conflict; they learn more this negative way of always blaming others and being mad.\"\n\nAdditionally, although Sabin testified that the children were calmer during her last contact with them, she also testified that \"[mother's] emotional reactivity and her over-focus on certain issues and her inability to look at the children's needs in a larger way, there's been no change in that\" and that the calmness of the children was \"not an indicator in terms of their long-term emotional and educational needs being met in that home.\"\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nSabin arranged for psychological testing of mother, grandparents, and Ordway. The trial court admitted Sabin's statements about the testing \"in order for [the court] to understand the basis of the opinion.\" The court stated that the statements were \"not admissible in order to convince [the court] that they are inherently truthful, or for their truth.\" Thereafter, Sabin testified that mother's intellectual potential is in the average range, that personality testing indicated signs of depression and loneliness, and that mother has difficulty with perceptual issues such that she\n\n\"would focus on one detail and distort it and act upon it and overwork one detail without looking at the big picture, and * * * that also applied to social and visual cues, that she may react to issues that are not there or miss issues that are present, in terms of social and emotional issues.\"\n\nOf significance, Sabin noted that, although mother has had therapy, she is not a likely candidate for therapy nor is she likely to use therapy to change her parenting techniques or to better address the children's emotional needs:\n\n\"[Mother] has had a history of having therapy several times. She has not utilized therapy to deal with the past family of origin issues that continue to require her emotional energy to contain. She has used therapy to some extent for the crisis of the moment or to ventilate her confusion and angry feelings about relationships. She is not a likely therapy candidate now, as she sees no need of therapy, and she is not likely to utilize therapy to change her parenting techniques or her understanding of the children's emotional needs.\"\n\nb. Examples of the children's particular needs and mother's inability to meet them\n\nThe record contains numerous specific examples of the impact of mother's emotional limitations on her ability to satisfy A's and J's needs. In particular, I focus on examples concerning the following needs of A and J: (1) emotional needs; (2) needs relating to their physical well-being; (3) the need for therapy; (4) educational and social needs; and (5) the need for physical and behavioral boundaries.\n\n(1) The children's emotional needs\n\nA number of letters that mother wrote to the children, apparently during father's illness, demonstrate mother's lack of understanding of and confusion about A's and J's needs. In the letters, mother blamed the children's father for developing cancer. She wrote, \"Daddy Steve's personal choices have made it easier for him to develop disease with nobody to blame.\"\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e A few months before father died, mother promoted her home with her husband, \"Daddy Paul,\" because it was \"a family unit free from the emotional and physical impacts of living with someone who has a chronic and disabling disease.\"\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e Mother focused on her own grief to the exclusion of the children's grief. She wrote that she experienced grief by \"being blamed by [her] own biologic family members for the inappropriate behaviors of another\" and \"watching [her] father minimize his poor health and the emotional and physical impacts on his family unit\" and that her grief has healed.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e Finally, mother appeared to attempt to disrupt the children's relationship with grandparents. She wrote that \"[i]t is illegal\" for grandparents to \"state lies about [her] to other people\" and to \"state in any way that they have rights to make decisions pertaining to you and [A].\"\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nGrandmother testified that the correspondence came by registered mail, return receipt requested, approximately three times a week and that, \"at some point[, mother] quit sending them, and gave them to the kids when they were over there visiting.\" According to Sabin, the \"letters are confusing and were not always read to the children at the discretion of the Winczewskis.\" Mother now acknowledges that the letters were an awkward and inappropriate attempt to communicate with the children. She testified, in part, that \"[t]hey were letters to myself to vainly and awkwardly help, to get some openness in a very painful situation.\"\n\nThe letters are a concern because they reflect mother's inappropriate attempts to communicate with the children and respond to her perception of their emotional needs. Mother addressed her young children about adult issues using adult language.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e She appears to have focused on her own interests rather than the interests of her children, who, at the time they apparently received those letters, were dealing with the impending death of their father. Moreover, mother sent the letters to communicate with the children even though J had extremely poor reading skills.\n\nThe letters caused MacKendrick and Sabin to be concerned. MacKendrick testified that the correspondence of which he was aware\n\n\"was injurious to the children, and I think confusing, because it seemed to press for the death of that parent, and to prejudge situations that I felt were not really helpful and that the children really couldn't comprehend at all.\"\n\nAccording to Sabin, the letters \"are an opportunity to see some of the confusion in [mother's] thinking about the girls' emotional needs. [Mother] seems to consistently address them about inappropriate issues, using adult language, and confusing her own childhood experience with theirs.\"\n\n(2) The children's physical well-being\n\nWhile in mother's care, A suffered from extensive tooth decay; mother stopped giving A Paxil, an antidepressant, without consulting with A's psychiatrist, who had prescribed the medication; and J underwent unnecessary medical testing at mother's request. Mother's emotional limitations and extremely poor judgment as to the needs of her children are reflected in her responses and decisions relating to those events.\n\nA suffered from extensive tooth decay while in mother's care. Sabin consulted with Dr. Cain, A's dentist when she was in grandparents' home, and Dr. Breche, her dentist when she was in mother's home. Sabin testified to the following: A saw Cain in January 1999 while she was living with grandparents. Cain said that A had had a normal checkup and that he saw no evidence of decay. The hygienist made notes about A's good oral hygiene. A moved to mother's home in April 1999. When A saw Breche in November 1999, he found extensive and severe decay. Breche did substantial work on A's teeth, including work that might be considered root canals in an older person. Breche and Cain agreed that it was highly unusual to have such extensive decay in such a short period. Breche attributed the problem to poor oral hygiene and diet. According to Sabin, Breche indicated that \"he hadn't made any specific notes about oral hygiene, but he noticed that [A's] physical hygiene was less than optimal, and that that might carry over to difficulty with her oral hygiene.\"\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e In her 2000 report, Sabin indicated:\n\n\"The issues that have arisen regarding [A's] dental needs do not indicate that her previous care was neglectful, as she was followed by a reputable dentist who felt that her oral hygiene was good. The more recently seen dentist felt that her teeth had deteriorated. This deterioration occurred during the time she was in her mother's care primarily.\"\n\nWhen Sabin talked with mother about this problem, she blamed it on grandparents, asserting that they had neglected A's dental needs. Mother testified that the decay occurred before the children were in her custody. Sabin also testified that mother expressed concern to her that the reason the decay was not detected in prior dental examinations was that grandparents \"hadn't gotten [A's] teeth x-rayed enough.\" As indicated by Sabin's testimony above, ___ Or App at ___ (slip op at 16), mother's attempt to shift the blame is an example of her nonproductive and inappropriate way of dealing with the children's difficulties and reflects her general unwillingness to accept responsibility for the children's problems.\n\nAdditionally, at some point while MacKendrick was working with A, she \"seemed to develop a significant depression\" and was having \"explosive outbursts, losing control, clearly was depressed, physically, having nightmares, [and] a variety of other symptomatology of depression.\" A psychiatrist was contacted, and, according to MacKendrick, A began taking Paxil in late 1994 or 1995. MacKendrick testified that A \"seemed to almost immediately calm, and it was a help to her during that period.\" Nonetheless, after mother took custody of the children following father's death, and without consulting with the psychiatrist, mother discontinued administering Paxil because she believed that it was not safe.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e According to Sabin, the psychiatrist believed that that was a bad time for A to stop the medication.\n\nIn her 1999 report, Sabin indicated that mother's decision to discontinue administering Paxil to A reflected mother's emotional limitations:\n\n\"[A] has anxiety and depression that benefit[t]ed historically from the use of Paxil, which is both an antidepressant and an antianxiety medication. [Mother] did not choose to follow the advice of Dr. Gale, the child psychiatrist. [Mother] focuses on a small piece of information, that historically [A] had had difficulty sleeping, and she noted that [A] was sleeping well at her house, and she then assumed that the child should not take medication. In addition, [mother's] way of understanding the children's emotional needs is very limited, and consists of understanding through her own experiences. She indicates that [A] was acting these ways because she is grieving, as [mother] herself [had] done as [a] young child, or because [A] is preadolescent. I, like Dr. Gale, see [A] as clinically anxious, depressed, and likely to benefit from medication in modulating her affect.\"\n\nI emphasize that the issue in this case concerning Paxil is not whether A should or should not take Paxil or any other medication. Instead, the issue is mother's decision to abruptly discontinue administering Paxil to A without any attempt to confer with the persons who had been treating A to determine the advisability and possible effects of discontinuing the medication and without any effort to understand how the drug should be discontinued in a manner that would minimize possible effects.\n\nMother also had J undergo a vaginal examination and blood testing that concerned Sabin. She testified that, in 1996, the following behavior was reported to the Child Abuse Response and Evaluation Services (CARES):\n\n\"[J], who was five, and [a relative, who was older although close in age], were in a bedroom with an open door, and [A] saw them. They did not have their clothes on. They had blankets wrapped around them,[\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e] and they were jumping on the bed. And [A] related that [the relative] had wanted her to do that, but she hadn't wanted to.\"\n\nCARES completed physical and emotional assessments. After reviewing the CARES reports, Sabin testified that there was (1) no indication that J had been coerced by the relative, (2) no indication that there was \"damage to [J's] private parts,\" and (3) no indication that J had been touched by the relative. Sabin indicated that CARES's impression was \"that this sexual behavior falls within the spectrum of normal behaviors for children of this age.\" Sabin also said that, in her review of the CARES report, she did not find a recommendation that the children not have unsupervised contact with the relative but that mother had recently told her that the report contained such a recommendation. Sabin indicated that, based on her review of the CARES records, she would have no concerns about the girls having contact with that relative. I note that mother testified that, after the CARES evaluation, the court ordered that the relative be supervised around the children. However, the trial court did not specifically indicate the basis of its ruling in that regard.\n\nDespite the apparent resolution of the alleged abuse of J in 1996, approximately four years later, mother requested that J undergo another vaginal examination \"because [she] had heard [her] daughters' confusion about their [uncle who] was not letting his * * * children * * * be at Grandma and Grandpa's overnight if [the relative] was there. But he would let [his children] be there if [A] and [J] were there\" and because \"[A] and [J] have been very unfriendly and have not liked boys that are within 12 months of [the relative's] age.\" According to Sabin, in 2000, when mother took J to the emergency room for a sore throat, mother \"also mentioned that she was concerned about sexual abuse because she was concerned about lack of supervision with the [relative].\" Sabin testified that \"[t]he doctor talked to [J] separately and felt that [J] wasn't making statements about allegations, and her physical exam was normal. But because of the concern, the doctor referred her to the CARES unit again.\" Even though a CARES examination had been scheduled, mother testified that she canceled the appointment:\n\n\"I was contacted by CARES, and I really struggled with whether or not to do an appointment because, as I said, it's been so awkward, and just unsettled between me, [grandmother] and [grandfather] that after I made the appointment, I went ahead and I cancelled it.\"\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nWhen asked whether she was concerned about the CARES appointment, Sabin responded:\n\n\"Yes, I was concerned about the CARES appointment. I called you and asked you to perhaps appoint or have the [c]court appoint an attorney for the children because I felt that the children's needs were getting disregarded because of the high level of conflict about the custody issue, and that going to CARES after this issue had been discussed and settled in 1996, and with [J] making no new statements, was an abusive situation.\"\n\n(Emphasis added.)\n\nSabin learned about the CARES appointment when she called to talk to the emergency room doctor about \"[mother's] request that [J] have a blood test for a Paxil level because she suspected the Winczewski grandparents were administering Paxil on the weekends.\" Before having J's blood tested, mother did not ask J whether she had taken any pills. Mother also did not ask grandparents whether they had given Paxil to either child. When asked whether she was concerned about the blood testing, Sabin replied:\n\n\"[O]bviously a blood test is somewhat uncomfortable for a child, and it was based on suspicions and, for lack of a better word, paranoid concerns of [mother] that the grandparents would administer medicine without a doctor's authorization.\"\n\n(Emphasis added.) Sabin testified that the test results indicated that there was no Paxil in J's blood.\n\nIn her 2000 report, Sabin noted that the unnecessary medical testing was a consequence of mother's emotional limitations:\n\n\"The mother's way of understanding these children through the narrow interpretation of a few issues is a pattern seen in the previous assessment. This narrow and emotional focus on a few issues leads to potential ignoring of other issues that are also significant. In addition, when the narrow focus includes the resurgence of sexual abuse allegations, unnecessary interviews and examinations, this is harmful to the children and communicates the mother's mistrust of others to them.\n\n\"[Mother's] emotional responses continue to be out of context at times, and focused extensively on her perceptions of past events. These emotional responses do not help her integrate new information or to clearly see the children's needs aside from her own perceptions.\"\n\n(Emphasis added.)\n\n(3) The children's need for treatment of their emotional issues\n\nThe record demonstrates that A and J need therapy and grief counseling to deal with their emotional issues. The evidence also demonstrates that mother has not adequately recognized and responded to that need.\n\nSince the children were three and five, MacKendrick had been working closely with them in dealing with their behavioral and emotional difficulties resulting from their chaotic lives. MacKendrick testified that, in 1996,\n\n\"both children suffered from some anxieties. [A], being the oldest, seemed to demonstrate more symptomatology, with the exception of the fact that I always thought [J] was somewhat regressed, had some speech difficulties, but [A] seemed to be the child that was more clearly marked with depression.\n\n\"I saw [A] as taking on anger that I felt came from the mother. At times I would see [A] trying to comfort or care for her mother, which are typical indicators of what we call a parentified child, a child that is trying to take care of a parent, as opposed to the parent taking care of the child.\n\n\"And with [J], [J] was quickly becoming a caretaker and a peacemaker, in order to placate the conflict that seemed to exist at that time.\"\n\nAccording to MacKendrick, the parentification issue is \"significant because the child's development is impaired because that child is not able to play and learn and develop at [his or her] own pace because [he or she is] so worried and preoccupied about a particular parent.\"\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nAfter father died, mother terminated the children's personal therapy program with MacKendrick. However, he did see the children a few times after their father's death. MacKendrick testified that the week after their father died \"both the girls were regressed.\" He saw the children again in September 1999 and testified that \"[A] had gained a great deal of weight.[\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e] [J] was much more regressed. I felt both situations suggested to me a great deal of distress.\" MacKendrick also saw the children in January 2000 and testified that\n\n\"[J] seemed to be much more regressed, was using a lot of baby talk, and --I had seen her at the time of the death of her father being much more outgoing and being able to fend for herself and not be a caretaker to her sister. And at this case, she had really kind of returned almost to a fetal-type situation, and needed to be held in somebody's lap at that point.[\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e]\n\n\"[A] * * * was much more outgoing, and was eager to show me other things she was working on. She clearly had become more controlling and domineering, but that had been a trait off and on that we had worked on in therapy. But at this point I really think it was more of a meeting, and not trying to do therapy as much as to just see how the children were doing, and to be able to evaluate, you know, over the period of time what had happened to them since I had stopped regular therapeutic contact.\"\n\nBased on his knowledge and experience with the children, MacKendrick testified that\n\n\"both children have an ongoing need to be seen by some mental health professional, and I would highly recommend that, certainly with everything they've gone through, that they see such a person on a weekly basis for a period of the next several years, and that family situations be carefully monitored.\"\n\nWhen asked whether all children need therapy or whether there is a special reason that A and J need therapy, MacKendrick responded:\n\n\"I don't know that I think all children need as much therapy or structure as these children do, but their life has been relatively chaotic, by virtue of separation and a divorce, a contemptuous contentious custody situation, and ongoing battles that have embroiled them. And it needs to be resolved so that they can go on with their lives. The children are the victims here.\"\n\nAs noted above, other than some grief counseling, mother completely discontinued the children's personal therapy. ___ Or App at ___ (slip op at 28).\n\nThe children did receive grief counseling from Izetta Smith. Sabin spoke with Smith three times. Sabin noted that, if the children's grief issues are not resolved, \"it creates risk as they get older for depression and for resolving those issues in other ways through inappropriate relationships or self-injurious behavior.\" Sabin testified that, according to Smith,\n\n\"[the children's] grief issues have not really been dealt with because of their anxieties about where they're going to live.\n\n\"She was trying to help the parents -- or all the adults -- learn how to reassure them and how to not involve them with the adult issues, how to not talk to them about the grownup problems.\n\n\"She felt that was more difficult for [mother] than it was for the other parenting figures because it's hard for her to stop herself, it was hard for her to contain her feelings, and that [mother] herself has many historical emotional issues that kind of overflow into this, and [mother] has trouble separating her emotional issues from the children's emotional issues.\n\n\"She can't tell whether or not [mother is] making progress or not, and she feels that [mother] would do better with individual therapy, but that seems unlikely. She's made the recommendation about individual therapy before.\"\n\nSabin also testified that Smith had recommended that mother allow grandparents to participate with the children in two grief counseling groups because their grief issues are similar to the children's issues. However, mother did not allow that to happen. Apparently, mother accompanied the children to one grief counseling group, and grandparents had accompanied the children to a second group. Sabin indicated that, according to Smith, mother wanted to go with the children \"because she herself was grieving for her father, and that was her reason for not having the Winczewski grandparents go, in spite of * * * Smith's recommendation.\" (Emphasis added.) When asked whether it was significant that mother would want to accompany the children to grief counseling in order to help her understand their issues, Sabin replied:\n\n\"Well, [mother] is very interested in grief, and she * * * didn't say she wanted to go to help them. She said she wanted to go because of her own grief about her parental loss, is what * * * Smith related to me. So I was more concerned about her going for her own needs, as opposed to following the direction of the therapist when the therapist said it would be better if the grandparents went.\n\n\"Q: You don't think that it might help [mother] understand her children if she understands her own grief issues?\n\n\"A: Yes, I think it would, but I think she needs to resolve that in the context of individual therapy or in her own grief work, and let the children have their own opportunity to resolve their own grief separately.\"\n\n(4) The children's educational and social needs\n\nThe evidence demonstrates that J has significant learning problems that are unrelated to her vision problems, that she has developmentally delayed speech, that both children were excessively absent and tardy from school following the move to mother's home, and that mother has plans to home school the children. That evidence also demonstrates that mother's narrow focus on certain issues while disregarding others and her tendency to blame others for the children's problems have prevented her from adequately addressing the children's problems.\n\nJ struggled considerably in school. She was behind in all academic subjects and was going to have to repeat second grade. J was tested but did not qualify for special education services because her low achievement was consistent with her ability. J does have a vision problem, but the experts do not feel that her problem is severe. Further, the school psychologist did not believe that the vision problem was the cause of J's learning problems. Nevertheless, although mother was aware of the assessment that J's vision was not the cause of her learning difficulties, mother was convinced that the assessment of J's intellect was mistaken and that her learning difficulties were due to her vision problems. Mother also asserted that the problem with J's vision was caused by grandparents' neglect. At one point, mother believed that J had a \"severe vision problem in both eyes\" and thought that she might have a qualifying disability under the \"Federal Disabilities Act\" and that, if J's condition were disabling, the $1,400 monthly Social Security check that mother was presently receiving for the children would increase.\n\nAt times, mother referred to J's vision problem in J's presence. Sabin indicated that she is \"concerned about a child getting a message that she has a physical disability, when her vision is not a disability in that way.\" As Sabin indicated, such comments by a parent \"affects [the child's] self-esteem, and sometimes it becomes a self-fulfilling prophecy. It may keep the child more dependent on the parent longer. It may decrease the child's confidence.\"\n\nIn response to J's difficulties in school, mother hired a tutor to assist J. Mother and Ordway also worked with J to improve her reading and helped her with her homework. However, it was difficult for Sabin to evaluate the effectiveness of the tutoring because mother refused to \"release the tutor to talk with [her].\" Sabin noted that the tutoring schedule of four days each week for one and one-half hours each day \"sounds extremely unusual.\"\n\nAdditionally, J's speech is developmentally delayed, and she receives speech therapy in school. In her 1999 report, Sabin indicated:\n\n\"Both the Winczewskis and the Ordways are aware of this issue, and can facilitate the appropriate interventions in the school, but there are also appropriate interventions in the home that the Ordways will have difficulty facilitating. * * * The Ordway home life seems full of noise and chaotic emotionally and [J] is not making much noise herself. [J] further withdraws as a coping mechanism at times when faced with the overwhelming stimuli. She allows herself to be managed by [A] in her mother's presence. The Winczewskis are more likely to be in social and home situations where [J's] speech is listened and responded to appropriately.\"\n\nExcessive absenteeism was also a serious problem for the children after moving to mother's home. Immediately after the move, A was often absent and tardy and did not always complete her homework as she had before. However, A did not appear to have those problems the following school year. Additionally, during the last trimester of the 1998-99 school year, after having had good school attendance when she was living with grandparents, J was absent or tardy 28 and one-half days out of 44 days.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e The excessive absences continued through the next school year when J was absent 16 days and tardy 23 days. However, only two of those absences occurred after the school sent a letter to mother regarding J's poor attendance. The excessive absenteeism and tardiness is a particular concern because J was having difficulty in school and her speech therapy was generally the first thing in the morning.\n\nMother explained at trial that some of the absences had occurred after father's death, during the transition between homes, and that others occurred because J was reluctant to go to school. Mother's other explanation for the tardiness and absences was to blame father and grandparents for having given too much assistance to the children in getting ready for school. Mother explained that she and Ordway had a different approach; they wanted these 8- and 10-year-old children \"to do some self-starting\" and to get themselves going in the morning.\n\nMother's other response to the children's educational needs was her plan to home school the children even though she apparently had no training in education. She told Sabin that she would be doing this now if grandparents were not \"breathing down her neck.\" Sabin saw this possibility as inappropriate for these children:\n\n\"Well, I think they both have extensive needs that aren't going to be met in the home, and I think that the home environment here creates its own culture that's isolated and insulated from the larger culture that these children hopefully will come to live in. I don't think that home education would prepare them for social interactions and for getting along with others.\n\n\"[J] does have very special needs in terms of her education, and even a well-educated parent, I think, would have a hard time providing all that at home, and [mother] has no special training or education in education.\"\n\n(5) The children's need for physical and behavioral boundaries\n\nFinally, the children need physical and behavioral boundaries. The evidence demonstrates that mother's emotional limitations prevent her from meeting that need.\n\nThe lack of physical boundaries for the children concerns the sleeping arrangements at mother's house. According to Sabin, the children need \"to have their own bed and [to] know where they should be sleeping.\" J told Sabin that, although they have their own beds at mother's home, they \"'never use them because there's stuff on them.'\" There was evidence that Ordway had slept in the same bed with J. When asked whether mother and Ordway denied that that had occurred, Sabin responded:\n\n\"No. No. In fact, in [mother's] philosophy about parenting and sleeping together, she wasn't sure that there was anything wrong with the casual arrangement of whose bed is whose and the parents sleeping with the children.\"\n\nSabin testified that those sleeping arrangements are\n\n\"not healthy in terms of developing structure, predictability, boundaries. 'This is my own space, this is my own room, these are my own things, this is my own bedtime, this is where I belong.' It's emotionally a boundary issue, especially for children that are as old as these, I think, to be not knowing where you're going to sleep tonight.\"\n\nAlthough Sabin indicated that she did not have a safety concern about the issue of the children's sleeping arrangements, she did express serious concerns about that boundary issue and its reflection of mother's emotional limitations:\n\n\"Poor physical boundaries in the home are an additional emotional issue related to these children's development. The children have no consistent sleeping arrangement in their mother's home, but they usually sleep with one, two, or three other family members in the same bed. The parents usually do not sleep together, but rather each sleeps with various children. The mother[] as well as the children report this. The mother does not see having one's own sleeping space as a developmental need for the children. This issue is related to the ongoing ways that she sees the children as fulfilling her needs for companionship aside from their own developmental needs.\"\n\nIn her follow-up evaluation in 2000, Sabin learned from mother and Ordway that \"they had the sleeping arrangements more structured, where [A] would sleep with [L], and [J] would sleep with [C].\"\n\nConsistently with mother's general continued unwillingness to accept responsibility for the children's difficulties, mother and Ordway blamed grandparents for the sleeping arrangements. Mother asserted that the grandparents had been sleeping with the children, and, therefore, they had no choice but to continue the practice. Grandparents testified that the children had not slept with them. Grandmother testified that each child had her own bedroom and that, at times, she \"would probably go in with [A]. I wouldn't sleep with her. I might [lie] down with her till she went to sleep.\" Grandmother also testified that,\n\n\"when [father] first came home, [J] slept on a daybed, a little youth bed, that was in [father's] room because it just didn't work out with [J] and [A] sleeping together in the same bed. And then we made a second bedroom. I had to give up my office for a second bedroom for -- so that [J] could have her own bedroom. And [J] was really very good about sleeping. She just needed somebody during the time [father] was in the hospital, and after he died she had -- would have anxiety, and that's why we sat with her until she went to sleep.\"\n\nSabin indicated that there were times that the children would sleep with an adult in the Winczewski home, \"but that's not the tradition in their home[.]\" Additionally Sabin testified:\n\n\"Q: Did you see it as appropriate in [the Winczewski] home, and yet inappropriate in the Ordway home?\n\n\"A: I believe the inappropriateness that I was commenting on in the Ordway home is the fact that these children don't feel that they have a bed, and these children sleep in a different place every night. And in the Winczewski home, there were times the children would come into their bed related to the illness and grieving and impending loss of their father. There may be times when that's appropriate and times when it's not, but it's always appropriate for children to have their own bed and know where they should be sleeping.\"\n\nSabin also noted that mother is unable to set behavioral boundaries for the children:\n\n\"[Mother] does not parent the children in an active way. She tends to use words, talk slowly, and not act on her instructions. She portrays herself as feeling powerless to influence their behavior in some areas. Although when interviewed individually she can describe appropriate parenting interventions, she did not demonstrate those interventions in my presence, and the girls report more talking and yelling than any other sort of parental intervention. Any time * * * I have called her home, there is a chaotic noise of children yelling in the background, not the noise of children playing. Because [mother] feels powerless at times with the children, she can become angry with them.\"\n\nE. Conclusion\n\nThere is no doubt that mother and grandparents love A and J, and A and J love them. A and J are attached to both families and to their half-siblings. Mother has not abused her children. Nevertheless, this is not a case involving a choice between two adequate homes for A and J. Instead, the evidence demonstrates that mother is unable to provide adequate care for the children and that circumstances detrimental to the children exist in her care. As the experts in this case have explained, based on A's and J's experiences, they have particular needs that must be met for them to avoid serious physical and emotional problems and, because of mother's emotional limitations, she will be unable to meet the children's needs. Sabin discussed mother's \"emotional reactivity and her over-focus on certain issues and her inability to look at the children's needs in a larger way\" and mother's \"confusion in processing and understanding emotional issues.\" According to Sabin, mother's \"emotional responses do not help her integrate new information or to clearly see the children's needs aside from her own perceptions.\" Sabin indicated that mother's home \"is not positive\" and \"is not healthy\" for A and J, that the children's relationship with mother has not \"been emotionally healthy,\" and that she does not see the relationship \"as growing in a healthy way.\" Sabin described various behaviors and plans of mother as inappropriate, harmful, and based on mother's \"suspicions.\" As Sabin expressly indicated, mother is not capable of meeting A's and J's needs. Moreover, Sabin noted that, during her last contact with the children, there had been no change in mother's \"emotional reactivity\" and that mother is not a likely candidate for therapy to help her learn to better address the children's needs.\n\nAs I have already explained, each case is fact specific and the totality of circumstances must be examined to identify the particular needs of the child involved and the circumstances of the parent. Here, I have reviewed the entire record and, on de novo review, I find the facts consistently with the experts' findings. I have described in great detail several examples of the children's particular needs and mother's inability to satisfy them. See ___ Or App at ___ (slip op at 17-38). There is not one circumstance or event here that compels the result. Rather, taken together, the examples that I have described illustrate that (1) mother is unable to understand the needs of the children; (2) for the most part, she is unwilling to accept responsibility for the children's difficulties; and (3) she has exhibited very limited ability to take action that is helpful rather than potentially harmful to the children. For all of the above reasons, I conclude that grandparents have demonstrated by a preponderance of the evidence that mother is unable to care adequately for A and J and that circumstances detrimental to the children exist in her care. Thus, grandparents have overcome the statutory presumption that mother acts in the best interests of the children.\n\nBecause grandparents have rebutted the presumption, I must determine the best interests of the children. ORS 109.119(3)(a) (\"If the court determines that a child-parent relationship exists and if the court determines that the presumption described in subsection (2)(a) of this section has been rebutted by a preponderance of the evidence, the court shall grant custody * * * to the person having the child-parent relationship, if to do so is in the best interest of the child.\"). After considering all of the statutory factors discussed above in light of the evidence in this case, I conclude that granting grandparents custody is in the children's best interests. Because application of ORS 109.119 (2001) results in an award of custody to grandparents, I must determine whether that result infringes on mother's substantive due process right to the care, custody, and control of her children. IV. CONSTITUTIONAL ANALYSIS\n\nA. The constitutional standard\n\nIn Newton, Wilson, Wooden, and Strome, recent cases involving custody disputes between parents and nonparents, we applied prior versions of ORS 109.119, a statute that we had interpreted to incorporate the federal constitutional presumption that gives effect to a parent's fundamental due process right to the care, custody, and control of his or her children. In this case, I did not incorporate the federal constitutional principles into my interpretation of ORS 109.119 (2001). However, the constitutional principles that we identified in our earlier custody cases are instructive in determining whether the application of ORS 109.119 (2001) infringes on mother's fundamental right.\n\nIn his dissent, Judge Edmonds asserts that my application of those principles would turn us into social engineers who decide custody by our determination of what is in the best interests of the child. However, I have not articulated a best interests of the child standard. Instead, as I will explain, the standard articulated in our prior case law requires that, in order to obtain custody, a non-parent must demonstrate that a parent cannot or will not provide adequate love and care or that placement of the child in the parent's custody would cause the child an undue risk of physical or psychological harm. Also contrary to Judge Edmonds's assertion, my application of that standard is not equivalent to a personal value judgment about who will make the best parents. Rather, just as in many other types of cases, including termination of parental rights, our responsibility is to determine whether the legal standard has been satisfied based on the facts of the case. With that understanding, I summarize the established constitutional principles before turning to their application in this case.\n\nThe Due Process Clause of the Fourteenth Amendment to the United States Constitution protects \"the fundamental right of parents to make decisions concerning the care, custody, and control of their children.\" Troxel, 530 US at 66 (O'Connor, J., plurality opinion). As indicated by the Troxel plurality, we give force to \"the traditional presumption that a fit parent will act in the best interest of his or her child.\" Id. at 69. A parent who has established a sufficient relationship with a child has the fundamental right and is entitled to the presumption.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e Wooden, 184 Or App at 546-51. We have also held that a \"parent will presumptively prevail over a non-parent unless the non-parent presents compelling reasons to overcome that presumption[.]\"\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e Wilson, 184 Or App at 219; see also Strome, 185 Or App at 533; Wooden, 184 Or App at 551-52. In sum, our cases establish the following principle that operates in this case: An application of ORS 109.119 that results in an award of custody to a non-parent unconstitutionally infringes on a parent's fundamental right to the care, custody, and control of his or her children unless the non-parent has demonstrated by a preponderance of the evidence that there are compelling reasons that the parent should not receive custody.\n\nAs we have reasoned in our recent custody cases, in determining whether compelling reasons exist, we take guidance from Hruby, a case in which\n\n\"[t]he court noted expressly that nonparents could establish compelling reasons to obtain custody without proving that the parent was unfit. Rather, the proper inquiry was whether custody with the parent would be '\"highly detrimental\" to the child's welfare, regardless of the parent's fitness,' [304 Or at 508]; whether custody with the non-parent was necessary 'to protect the children from some compelling threat to their present or future well-being,' id. at 509; and whether there was 'good cause' or 'cogent' reasons, to place the child with the non-parent, id. at 510.\"\n\nWooden, 184 Or App at 551. At its core, Hruby stands for the following proposition: In a custody dispute between a parent and a non-parent, the court may award custody to a non-parent where grounds for termination of parental rights do not exist but where the child must be protected from \"some compelling threat to [his or her] present or future well-being.\" Hruby, 304 Or at 509.\n\nIn State ex rel Juv. Dept. v. Lauffenberger, 308 Or 159, 777 P2d 954 (1989), the Supreme Court, in an analogous context, reaffirmed its understanding that, in custody disputes between parents and nonparents, the \"compelling reason\" standard from Hruby is not equivalent to the standard necessary to terminate a parent's parental rights. In Lauffenberger, the child had become a ward of the court due to parental neglect. Thereafter, the Children's Services Division (CSD) filed petitions to terminate the parental rights of both parents. The petitions were denied. After a later dispositional hearing, the trial court vacated the child's commitment to the custody of CSD, retained its own jurisdiction over the child, and placed the child in the \"'care, custody and control'\" of her maternal grandparents. The court found that father was a fit parent but that it was in the child's best interest to be in the custody of her grandparents. We affirmed.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e The Supreme Court reversed our decision. The court indicated that it decided Hruby after the trial court had made its decision. It held that the parental preference articulated in Hruby applied in that case and noted that, under Hruby, a parent was entitled to custody of his or her children in the absence of compelling reasons.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e However, the court refused to order a change in custody, stating that \"[t]hat will be for the circuit court to decide on remand and on a new and more complete record, if the father still desires custody.\" Lauffenberger, 308 Or at 168. If the compelling reasons standard under Hruby were equivalent to the standard for termination of parental rights, there would have been no reason for the court in Lauffenberger to remand the case to the trial court to determine the issue of custody under the Hruby standard because the petition to terminate the father's parental rights had been denied and the court had already determined that he was a \"fit\" parent.\n\nSimilarly, our application of the Hruby standard in Fenimore v. Smith, 145 Or App 501, 930 P2d 892 (1996), rev den, 326 Or 389 (1998), and Cerda and Cerda, 136 Or App 104, 901 P2d 263 (1995), rev den, 322 Or 598 (1996), demonstrates that a parent's fundamental right is not absolute and that the compelling reasons standard is not equivalent to the standard necessary to terminate a parent's parental rights. In Fenimore, the child had suffered severe trauma resulting from the circumstances of her mother's death.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e We determined that \"[t]here is no question but that father loves child and can provide her physical needs,\" Fenimore, 145 Or App at 509; however, we concluded that the \"[c]hild has suffered a traumatic loss from which the testimony shows she is not likely to heal if she is forced from the only family situation she has ever known. Under the circumstances of this case, an award of custody to father would cause undue psychological harm to child,\" id. at 510. Although we noted that child had expressed a preference for living with stepfather, perceived father to have an alcohol problem, and did not feel safe in father's home, we based our holding that stepfather should be awarded custody on the fact that the expert opined that there \"'would be a very great risk'\" if the child were moved from stepfather's home. Id.\n\nIn Cerda, we held that there were compelling reasons to award custody to the grandparents:\n\n\"As the trial court found, father has had difficulty controlling his anger and has been abusive toward other family members, although none of those episodes involved the children. Father demonstrates a tendency to minimize his problems and, until he won the lottery, his life was aptly characterized as unstable. We are not persuaded that his newly found source of income will necessarily trigger a change in those behavior patterns. Moreover, the children have lived with their grandparents in a stable and emotionally healthy environment for eight years, which is most of their lives. Father has accepted that arrangement and made no attempt to change custody until pressured to pay an increased amount of child support. Also, father does not contradict [the expert's] testimony that the children are at a particularly vulnerable age and that a change in their custody would cause them to regress emotionally, academically and socially. * * * Because the evidence is that the children would be unduly harmed by changing their custody to father, we conclude that an award of custody to grandparents under ORS 109.119 is appropriate with reasonable visitation by both father and mother.\"\n\nCerda, 136 Or App at 109-10. In neither Fenimore or Cerda did we hold that a compelling reason for awarding custody to a non-parent was equivalent to a circumstance sufficient to terminate a parent's parental rights. Instead, we focused on whether the child would face an undue risk of harm in the parent's custody in light of the child's particular needs and the parent's abilities and limitations.\n\nConsistently with Hruby, Fenimore, and Cerda, we have established that, even if a parent has not been shown to be unfit, compelling reasons not to award custody to the parent exist where, in light of the child's particular needs, the parent cannot or will not provide adequate love and care for his or her child or placement of the child in the parent's custody would cause the child an undue risk of physical or psychological harm. See Strome, 185 Or App at 527. In other words, the application of ORS 109.119 resulting in an award of custody to a non-parent is an unconstitutional infringement on a parent's fundamental right to the care, custody, and control of his or her child unless the non-parent has demonstrated by a preponderance of the evidence that, in light of the child's particular needs, the parent cannot or will not provide adequate love and care for his or her child or that placement of the child in the parent's custody would cause the child an undue risk of physical or psychological harm.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nB. Application of the constitutional standard\n\nWith those principles in mind, I turn to this case. Mother has a fundamental due process right to the care, custody, and control of her children. Thus, the issue in this case is whether grandparents have demonstrated by a preponderance of the evidence that mother cannot or will not provide adequate care for A and J or whether placement of the children in mother's custody would cause them an undue risk of physical or psychological harm. For the reasons that I have already discussed, grandparents have demonstrated by a preponderance of the evidence that (1) based on A's and J's experiences, they have particular needs that must be met for them to avoid serious physical and emotional problems and (2) because of mother's emotional limitations, which are reflected in her inability to understand her children's needs and her limited ability to take action that helps rather than potentially harms them, and because of her apparent inability to improve, she is unable to adequately care for the children and they will face an undue risk of physical or psychological harm in her custody.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e Thus, an award of custody to grandparents under the statute does not infringe on mother's federal constitutional right.\n\nAccordingly, I now turn to the dissenting opinions. Judge Edmonds contends that he is not applying a strict scrutiny standard; however, in effect, the standard that he applies is strict scrutiny. Judge Edmonds also contends that, in order to satisfy his \"compelling state interest\" standard, a non-parent must clearly demonstrate that the parent is unfit under the standards in the termination of parental rights statutes or demonstrate circumstances that present similarly grave risks of harm. Although Judges Brewer and Schuman have dissented separately, they both contend that, although I have articulated the correct legal standard, the facts in this case do not demonstrate that that standard has been satisfied.\n\nIn his dissent, Judge Edmonds refers to numerous United States Supreme Court cases to support the proposition that mother has a fundamental constitutional right. See ___ Or App at ___ (Edmonds, J., dissenting) (slip op at 1-4). I do not disagree with Judge Edmonds that mother has an extremely important right, the fundamental constitutional right to the care, custody, and control of her children.\n\nAs I have explained, we have already articulated the legal standard for protecting that right in our recent custody cases. Judge Edmonds, however, disregards those cases and undertakes a \"new\" examination to determine the legal standard for determining when a non-parent may be awarded custody consistently with the parent's constitutional right. Although his reasoning is lengthy and complex, his position may be reduced to two points: (1) the state can interfere with a parent's right to the care, custody, and control of his or her children only if the state's infringement of the right is narrowly tailored to serve a compelling state interest, ___ Or App at ___ n 7 (Edmonds, J., dissenting) (slip op at 11 n 7), and (2) the legal standard that we have articulated in our recent custody cases (i.e., whether, in light of the child's particular needs, the parent cannot or will not provide adequate love and care for his or her child or that placement of the child in the parent's custody would cause the child an undue risk of physical or psychological harm) requires that a non-parent clearly demonstrate that the parent is unfit under the standards in the termination statutes or demonstrate circumstances that present similarly grave risks of harm.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e I address each of those points in turn.\n\nThe gravamen of Judge Edmonds's position is that the state cannot interfere with a parent's right to the care, custody, and control of his or her children unless the state's infringement of the right is narrowly tailored to serve a compelling state interest. See ___ Or App at ___, ___, ___ n 7 (Edmonds, J., dissenting) (slip op at 5, 9, 11 n 7). From that \"strict scrutiny\" standard, Judge Edmonds derives his \"compelling state interest\" standard that is to be applied in custody cases between a parent and a non-parent. ___ Or App at ___ (Edmonds, J., dissenting) (slip op at 9-10, 11-13). Judge Edmonds's reasoning is flawed because the Court in Troxel did not adopt the \"compelling state interest\" standard and we have expressly rejected that legal standard.\n\nThe plurality in Troxel acknowledged that it was not considering \"whether the Due Process Clause requires all nonparental visitation statutes to include a showing of harm or potential harm to the child as a condition precedent to granting visitation\" and that it was not defining \"the precise scope of the parental due process right in the visitation context.\" Troxel, 530 US at 73 (O'Connor, J., plurality opinion). Thus, the Court did not adopt the \"compelling state interest\" standard asserted by Judge Edmonds.\n\nMoreover, in our recent custody cases, we \"salvag[ed] the constitutionality\" of ORS 109.119 (1997) by incorporating the requirements of Troxel into the statute's interpretation. Wilson, 184 Or App at 218. In doing so, we expressly rejected the legal standard asserted by Justice Thomas in Troxel. Justice Thomas concurred in the judgment in Troxel. He reasoned:\n\n\"The opinions of the plurality, JUSTICE KENNEDY, and JUSTICE SOUTER recognize [a parent's] right, but curiously none of them articulates the appropriate standard of review. I would apply strict scrutiny to infringements of fundamental rights. Here, the State of Washington lacks even a legitimate governmental interest--to say nothing of a compelling one--in second-guessing a fit parent's decision regarding visitation with third parties. On this basis, I would affirm the judgment below.\"\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\n\nTroxel, 530 US at 80 (Thomas, J., concurring in the judgment). In Harrington, we expressly rejected the strict scrutiny standard asserted by Justice Thomas in Troxel and indicated that \"the plurality opinion [in Troxel] gives the best guidance on the effect of the constitution in this situation.\"\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e Harrington, 172 Or App at 197. We also noted that, under Justice Thomas's standard, the court's ability to award visitation to nonparents would be more difficult than it would be under the plurality's standard. Id. Nevertheless, Judge Edmonds articulates a \"compelling state interest\" standard that he derives from a legal standard that we have expressly rejected. In other words, Judge Edmonds is attempting to write anew on a slate that is far from clean.\n\nRelying on his constitutionally required \"compelling state interest\" standard, Judge Edmonds then asserts that we err by applying the \"compelling reason\" standard that is \"less exacting\" than the constitution requires.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e ___ Or App at ___ (Edmonds, J., dissenting) (slip op at 23). According to Judge Edmonds, \"[a]lthough a 'compelling reason' need not be identical to the standards set forth in the termination statutes, it must embody circumstances that present similarly grave risks of harm to a child's welfare either because of a parent's unfitness or because of the physical or psychological needs of the child.\"\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e ___ Or App at ___ (Edmonds, J., dissenting) (slip op at 25). However, regardless of the particular label that Judge Edmonds places on the legal standard, the point of contention between me and Judge Edmonds is whether the legal standard that we have articulated in our recent custody cases as being consistent with the constitution (i.e., whether, in light of the child's particular needs, the parent cannot or will not provide adequate love and care for his or her child or that placement of the child in the parent's custody would cause the child an undue risk of physical or psychological harm) requires a non-parent to demonstrate that the parent is unfit under the standards in the termination statutes or to demonstrate circumstances that present similarly grave risks of harm.\n\nAs I have already explained, ___ Or App at ___ (slip op at 40-48), we have not applied the standard used in termination cases to custody cases between parents and nonparents. In Hruby, the Supreme Court articulated a standard for determining whether a non-parent had demonstrated that he or she is entitled to custody. As the Supreme Court demonstrated in its opinion in Lauffenberger, the compelling reasons standard from Hruby is not equivalent to the standard for the termination of parental rights. We applied the Hruby standard in Fenimore and Cerda. Most importantly, in our recent custody cases in which we interpreted ORS 109.119 (1997) to salvage its constitutionality, we established that the Hruby standard provides guidance in determining whether a non-parent has established that he or she is entitled to custody consistently with the constitution and stated that, in Hruby, the court \"noted expressly that nonparents could establish compelling reasons to obtain custody without proving that the parent was unfit,\" Wooden, 184 Or App at 551. Additionally, we cited Fenimore and Cerda as examples of cases applying the Hruby standard. Thus, we have already determined that the Hruby standard, as applied in Fenimore and Cerda, is consistent with constitutional principles.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e\n\nIf Judge Edmonds were correct, a determination that a parent's rights are not subject to termination would result in an award of custody to the parent even in cases in which there is uncontroverted evidence that, because of the child's particular needs or the particular circumstances of the case, the child would suffer harm in the parent's custody. Although Judge Edmonds asserts that my understanding of his position is too narrow because a non-parent could receive custody if he or she demonstrates circumstances that present risks of harm that are as grave as those illustrated in the termination statutes, he provides no explanation as to when a risk of harm rises to that level. Essentially, Judge Edmonds would require a non-parent to demonstrate that the parent is \"unfit,\" as that term is used for purposes of termination, in order to obtain custody.\n\nJudge Edmonds also asserts that the facts of this case do not justify an award of custody to grandparents. According to Judge Edmonds, the \"instances of inattentive parenting followed by remedial measures by mother, even when considered along with mother's emotional limitations, simply do not amount to a compelling state interest that justifies taking custody away from mother.\" ___ Or App at ___ (Edmonds, J., dissenting) (slip op at 37). In support of that assertion, Judge Edmonds points to isolated incidents and short excerpts of testimony from the record.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e However, as I have discussed in detail in this opinion, mother's efforts and success have been very limited. My de novo review of the entire record reveals that mother's actions and her inaction have amounted to much more than inattentive parenting. Further, this is not a case such as Strome in which the father had engaged in inadequate parenting for a long period of time but then demonstrated remarkable improvement for the 10 months before the hearing. As I have already explained, the evidence in this case indicates that A and J have particular needs of a serious nature and that, because of her emotional limitations, mother is unable to meet those needs and that the children face an undue risk of harm in mother's custody.\n\nFinally, Judge Edmonds emphasizes that \"[n]o expert witness expressly testified that mother is incapable of providing adequate care for the children in the future.\"\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e ___ Or App at ___ (Edmonds, J., dissenting) (emphasis in original) (slip op at 33-34). I disagree. As noted above, Sabin stated that mother is unable to meet the children's needs:\n\n\"The only clear strength in considering a placement with [mother] is that she is the girls' biologic mother, and this has some symbolic significance to them. This does not outweigh their needs for structure, boundaries, social skills, academic support, therapy, emotional communication, positive role modeling, and perhaps psychotropic medication, that she cannot provide.\"\n\n(Emphasis added.) Additionally, Sabin testified that both children \"have extensive needs that aren't going to be met in [mother's] home\" and that the children's calm demeanor during her last visit with them was \"not an indicator in terms of their long-term emotional and educational needs being met in [mother's] home.\" Under Judge Edmonds's reasoning, I may not rely on those express statements about mother's inability to care adequately for the children in the future to support a change of custody. Judge Edmonds apparently would require a non-parent to produce an express statement from an expert that, in the future, the parent in fact and definitely cannot provide adequate care and love to the children or that the children in fact and definitely will be harmed in the parent's custody. That is not a requirement that we have imposed in our previous decisions. Moreover, such a requirement would be completely unrealistic. As a matter of common sense, it is not possible to demonstrate with certainty how a person will behave in the future. Of necessity, we must predict a person's future behavior based on his or her present and past behavior. In making that prediction, we often give weight to the assessments of experts who have had the opportunity to interact with and observe the person and who have expertise in evaluating that person's behavior. Mother's past conduct and present inability is indicative of her future ability to care for her children and the risks of harm that the children will face in her custody. See Cerda, 136 Or App at 109.\n\nUnlike Judge Edmonds, Judge Brewer agrees that I have properly articulated the legal standard to be applied in custody cases between parents and nonparents. See ___ Or App at ___ (Brewer, J., dissenting) (\"[W]e have adhered to the compelling reasons test and that is the lens through which the concurrence properly has examined the record in this case.\") (slip op at 13). However, Judge Brewer disagrees that, based on the facts of this case, compelling reasons exist. His argument reduces to two points: (1) The most significant consideration in this case is the children's emotional attachment to mother and her family. (2) Even though mother has been insensitive to the children's emotional needs, the evidence of that conduct relates, directly or indirectly, to father's death, and, for that reason, the evidence cannot be weighed \"as heavily in the balance as [it] would if it involved less stressful circumstances.\" ___ Or App at ___ (Brewer, J., dissenting) (slip op at 16). I address each of his points in turn.\n\nJudge Brewer is correct that the evidence demonstrates that the children are attached to both families and that Sabin testified that there is no \"differential attachment\" between the children and the two families. However, I understand Judge Brewer to assert that attachment to the parent is the most significant issue in custody cases between a parent and non-parent. I disagree. A determination that a child is attached to a parent does not preclude the determination that compelling reasons exist to award custody to a non-parent. Moreover, and as my conclusion in this case demonstrates, emotional attachment is not more important than issues such as health, safety, education, and emotional development.\n\nJudge Brewer also reasons that\n\n\"the evidence shows that mother has been insensitive to the children's emotional needs. However, much of the evidence to that effect involves conduct relating, directly or indirectly, to the death of the children's father and the present custody dispute. Although that evidence is troubling, I do not weigh it as heavily in the balance as I would if it involved less stressful circumstances. It is also true that the children's physical circumstances while in mother's care were not optimal. In that regard, the evidence concerning A's tooth decay is a cause for concern, but it does not necessarily suggest serious neglect on mother's part. In sum, although much of the evidence does not flatter mother, the overall quality of her parenting is no worse than that of thousands of Oregonians who struggle with their own limitations but ultimately succeed, without state intervention, in raising their children safely.\"\n\n___ Or App at ___ (Brewer, J., dissenting) (slip op at 15-16).\n\nAs I have discussed in exhaustive detail, this case is about much more than mother's insensitivity to A's and J's emotional needs. Moreover, no one related all of mother's conduct to father's death and this custody dispute with grandparents. With all due respect, this case concerns a mother with particular emotional limitations that are reflected in her long-term conduct and two children with particular needs that have arisen, at least in part, because of their life experiences. In determining whether mother cannot provide adequate care for A and J or whether placement of A and J in her custody would cause A and J an undue risk of physical or psychological harm, I do not compare her parenting to the parenting of other parents because such a comparison would disregard the children's particular needs. Instead, I evaluate mother's parenting to determine whether, in light of the children's particular needs, mother cannot provide adequate care or whether placement in her custody will cause an undue risk of physical or psychological harm. My approach is the same as the approach that we took in Fenimore. See ___ Or App at ___ (slip op at 45-46). In that case, the parent was capable of providing for the physical needs of his child; however, because the child had particular needs as a result of the loss of her mother, we concluded that an award of custody to the parent would have caused the child undue psychological harm.\n\nFinally, in his dissent, Judge Schuman also agrees with my legal analysis. Specifically, he concludes that the \"compelling state interest\" rule does not apply. However, Judge Schuman asserts that \"the harm that can justify abridging the parental right must be far, far more serious\" than what grandparents have demonstrated here. ___ Or App at ___ (Schuman, J., dissenting) (slip op at 1). I disagree. As I have already explained in my responses to the dissents of Judge Edmonds and Judge Brewer, grandparents have demonstrated that mother cannot adequately care for A and J and that placement of the children in her custody will cause an undue risk of physical or psychological harm. For all the reasons discussed above, I do not agree with the dissents that an award of custody to grandparents would infringe on mother's federal constitutional right to the care, custody, and control of her children.\n\nV. CONCLUSION\n\nIn sum, ORS 109.119 (2001) applies to this case. Grandparents have rebutted the statutory presumption that mother acts in the best interests of the children by demonstrating by a preponderance of the evidence that mother is unable to care adequately for A and J and that circumstances detrimental to A and J exist if grandparents are denied custody. Because awarding custody to grandparents is also in the children's best interest, grandparents should be awarded custody under ORS 109.119. Further, that application of the statute does not infringe on mother's federal constitutional right to the care, custody, and control of her children because grandparents have demonstrated by a preponderance of the evidence that mother is unable to care adequately for the children and that the children face an undue risk of physical or psychological harm in mother's custody. Thus, I would hold that the trial court did not err in awarding custody to grandparents.\n\nHaselton, Linder, Wollheim, and Kistler, JJ., join in this concurring opinion.\n\nEDMONDS, J., dissenting.\n\nThe concurrence's reasoning in this case results in an unconstitutional infringement of mother's fundamental right to raise her children under the Fourteenth Amendment to the United States Constitution. In this opinion, I will (1) explore the nature and extent of that right; (2) discuss, in light of that right, the type of circumstances that must be present before the state can lawfully deprive a parent of the custody of his or her child; and (3) explain why the application of the Due Process Clause to the facts of this case should have resulted in a decision in favor of mother.\n\nI. WHAT IS THE NATURE AND EXTENT OF MOTHER'S LIBERTY INTEREST IN THIS CASE UNDER THE FOURTEENTH AMENDMENT?\n\n\"[T]he relationship between parent and child is constitutionally protected.\" Quilloin v. Walcott, 434 US 246, 255, 98 S Ct 549, 54 L Ed 2d 511 (1978). \"[F]reedom of personal choice in matters of * * * family life is one of the liberties protected by the Due Process Clause of the Fourteenth Amendment.\" Cleveland Board of Education v. LaFleur, 414 US 632, 639-40, 94 S Ct 791, 39 L Ed 2d 52 (1974). Although the concurrence acknowledges that principle in this case, it fails to give it the efficacy required by the United States Supreme Court's jurisprudence.\n\nThe Due Process Clause of the Fourteenth Amendment protects the right of the individual to\n\n\"establish a home and bring up children, to worship God according to the dictates of his own conscience, and generally to enjoy those privileges long recognized at common law as essential to the orderly pursuit of happiness by free men.\"\n\nMeyer v. Nebraska, 262 US 390, 399, 43 S Ct 625, 67 L Ed 1042 (1923).\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e Consequently, parents have a liberty interest in raising their children as they see fit.\n\n\"It is cardinal with us that the custody, care and nurture of the child reside first in the parents, whose primary function and freedom include preparation for obligations the state can neither supply nor hinder. And it is in recognition of this that [the Court's] decisions have respected the private realm of family life which the state cannot enter.\"\n\nPrince v. Massachusetts, 321 US 158, 166, 64 S Ct 438, 88 L Ed 645 (1944).\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e Thus, the Court explained in Quilloin:\n\n\"We have little doubt that the Due Process Clause would be offended '[i]f a State were to attempt to force the breakup of a natural family, over the objections of the parents and their children, without some showing of unfitness and for the sole reason that to do so was thought to be in the children's best interest.'\"\n\n434 US at 255 (quoting Smith v. Organization of Foster Families, 431 US 816, 862-63, 97 S Ct 2094, 53 L Ed 2d 14 (1977) (Stewart, J., concurring)) (emphasis added; brackets in original).\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e\n\nThe concurrence's analysis offends those principles by declaring that custody of mother's children should be granted to the paternal grandparents in the absence of evidence of parental unfitness or similarly grave circumstances, the kind of evidence that the federal constitution requires. That is not to say that ORS 109.119, the statute under which the concurrence analyzes this case, is unconstitutional; rather, any lawful application of the statute necessarily incorporates due process. Although the concurrence gives lip service to mother's constitutional right to raise her own children, ___ Or App at ___ (Deits, C. J., concurring) (slip op at 41-43), the concurrence never engages with the understanding of what that constitutional requirement means in the context of the facts of this case and the legal standard it imposes. First, the concurrence's conclusions that mother cannot satisfy her children's needs because of her emotional limitations and that therefore they will face an undue risk of physical or psychological harm in the future is based on attenuated evidence, as will be demonstrated later in this opinion. Equally important, the concurrence's analysis is legally incorrect because it is unable to identify through its analysis a legally cognizable, compelling state interest that permits the statutory deprivation of custody from mother, nor does it make the \"delicate\" accommodation that the constitution requires between a parent's liberty interest and the interests of the state. Prince, 321 US at 165.\n\nII. WHAT KIND OF STATE INTEREST MUST EXIST BEFORE A PARENT CAN BE CONSTITUTIONALLY DEPRIVED OF CUSTODY?\n\nParents have a fundamental liberty interest in directing the upbringing of their children:\n\n\"The child is not the mere creature of the State; those who nurture him and direct his destiny have the right, coupled with the high duty, to recognize and prepare him for additional obligations.\"\n\nPierce v. Society of Sisters, 268 US 510, 535, 45 S Ct 571, 69 L Ed 1070 (1925).\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e On the other hand,\n\n\"[a]against these sacred private interests, basic in a democracy, stand the interests of society to protect the welfare of children[.] * * * It is the interest of youth itself, and of the whole community, that children be both safeguarded from abuses and given opportunities for growth into free and independent well-developed men and citizens.\"\n\nPrince, 321 US at 165. The accommodation of both interests in accordance with the constitution requires standards to define when the state is authorized to interfere with a parent's right to child custody. No matter how those standards are articulated, the fundamental nature of a parent's right to raise his or her children must be meaningfully reflected in their formulation.\n\nOnce a constitutional right has been so determined to be deeply rooted in our nation's history and tradition as to be classified as \"fundamental,\" the government may not interfere with that right \"at all, no matter what process is provided, unless the infringement is narrowly tailored to serve a compelling state interest.\" Reno v. Flores, 507 US 292, 302, 113 S Ct 1439, 123 L Ed 2d 1 (1993) (emphasis in original).\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e Thus, the substantive component of the Due Process Clause provides heightened protection against government interference with rights that have been determined to be fundamental. Washington v. Glucksberg, 521 US 702, 719-20, 117 S Ct 2258, 138 L Ed 2d 772 (1997). The right of a parent to direct the upbringing of his or her children is such a fundamental right. As the lead opinion in Troxel v. Granville, 530 US 57, 65, 120 S Ct 2054, 147 L Ed 2d 49 (2000), said, \"the interest of parents in the care, custody, and control of their children--is perhaps the oldest of the fundamental liberty interests recognized by this Court.\"\n\nIn Troxel, the Washington Supreme Court had invalidated on constitutional grounds a state statute that authorized grandparent visitation with a child over the parent's objection when a court found visitation to be in the \"best interests of the child.\" The grandparents did not allege, and no court found, that the parent was unfit. Troxel, 530 US at 68 (O'Connor, J., plurality opinion). The state court held the statute unconstitutional on two grounds: (1) the failure of the statute to require harm to the child and (2) the statute's authorization of \"any person\" at \"any time\" to petition for and to receive visitation rights based on the \"best interests of the child\" standard. Id. at 63. The United States Supreme Court granted certiorari.\n\nJustice O'Connor, writing for four members of the Court, explained that the Washington trial court's \"order was not founded on any special factors that might justify the State's interference with Granville's [the parent's] fundamental right to make decisions concerning the rearing of her two daughters.\" Id. at 68. She observed:\n\n\"[T]here is a presumption that fit parents act in the best interests of their children. * * * Accordingly, so long as a parent adequately cares for his or her children (i.e., is fit), there will normally be no reason for the State to inject itself into the private realm of the family to further question the ability of that parent to make the best decisions concerning the rearing of that parent's children.\"\n\nId. at 68-69 (citations omitted). Justice O'Connor concluded that the Washington statute, as applied, was an unconstitutional infringement on the parent's fundamental right to make decisions concerning the care, custody and control of her children:\n\n\"Because we rest our decision on the sweeping breadth of [the Washington statute] and the application of that broad, unlimited power in this case, we do not consider the primary constitutional question passed on by the Washington Supreme Court -- whether the Due Process Clause requires all nonparental visitation statutes to include a showing of harm or potential harm to the child as a condition precedent to granting visitation. We do not, and need not, define today the precise scope of the parental due process right in the visitation context. In this respect, we agree with JUSTICE KENNEDY that the constitutionality of any standard for awarding visitation turns on the specific manner in which that standard is applied and that the constitutional protections in this area are best 'elaborated with care.'\"\n\nId. at 73.\n\nJustice Souter concurred in the judgment. He would have affirmed the Washington Supreme Court on the basis that the statute was unconstitutional on its face. He explained, in part:\n\n\"We have long recognized that a parent's interest in the nurture, upbringing, companionship, care, and custody of children are generally protected by the Due Process Clause of the Fourteenth Amendment. * * * As we first acknowledged in Meyer, the right of parents to 'bring up children,' and 'to control the education of their own' is protected by the Constitution.\n\n\"* * * As the [Washington] court understood it, the specific best-interests provision in the statute would allow a court to award visitation whenever it thought it could make a better decision than a child's parent had done.\n\n\"Our cases, it is true, have not set out exact metes and bounds to the protected interest of a parent in the relationship with his child, but Meyer's repeatedly recognized right of upbringing would be a sham if it failed to encompass the right to be free of judicially compelled visitation by 'any party' at 'any time' a judge believed he 'could make a \"better\" decision' than the objecting parent had done. * * * Pierce, * * * [268 US] at 535 ('* * * The child is not the mere creature of the State; those who nurture him and direct his destiny have the right, coupled with the high duty, to recognize and prepare him for additional obligations.'). It would be anomalous, then, to subject a parent to any individual judge's choice * * * merely because the judge might think himself more enlightened than the child's parent.\"\n\nId. at 77-79 (Souter, J., concurring in the judgment) (footnotes and some citations omitted).\n\nJustice Thomas also concurred in the judgment. In part, he wrote:\n\n\"I write separately to note that neither party has argued that our substantive due process cases were wrongly decided and that the original understanding of the Due Process Clause precludes judicial enforcement of unenumerated rights under that constitutional provision. As a result, I express no view on the merits of this matter, and I understand the plurality as well to leave the resolution of that issue for another day.\n\n\"Consequently, I agree with the plurality that this Court's recognition of a fundamental right of parents to direct the upbringing of their children resolves this case. Our decision in Pierce * * *, holds that parents have a fundamental constitutional right to rear their children, including the right to determine who shall educate and socialize them. The opinions of the plurality, JUSTICE KENNEDY, AND JUSTICE SOUTER recognize such a right, but curiously none of them articulates the appropriate standard of review. I would apply strict scrutiny to infringements of fundamental rights. Here, the State of Washington lacks even a legitimate governmental interest -- to say nothing of a compelling one[.]\"\n\nId. at 80 (Thomas, J., concurring in the judgment) (footnote omitted).\n\nApparently, the concurrence and I hold significantly different views of the import of the Troxel opinions on this case. The concurrence explains its view:\n\n\"[I]n our recent custody cases, we 'salvag[ed] the constitutionality' of ORS 109.119 (1997) by incorporating the requirements of Troxel into the statute's interpretation. Wilson [and Wilson], 184 Or App [212, 218, 55 P3d 1106 (2002)]. In doing so, we expressly rejected the legal standard asserted by Justice Thomas in Troxel. * * * [We] indicated that 'the plurality opinion * * * gives the best guidance on the effect of the constitution in this situatioHarrington [v. Daum], 172 Or App [188, 197, 18 P3d 456 (2001)].\"\n\n___ Or App at ___ (Deits, C. J., concurring) (slip op at 51-52) (emphasis in original).\n\nThe concurrence's argument proves too much, both in terms of what Wilson and Harrington held and in the manner in which it characterizes Justice Thomas's opinion. I agree that, in Wilson and in Harrington we incorporated the rule of Troxel into the statute to preserve its constitutionality. However, the concurrence's assertion that \"we expressly rejected the legal standard asserted by Justice Thomas in Troxel\" misunderstands what we said in Harrington. The discussion that follows explains in more detail what underlies our statements with respect to the Troxel opinions in Harrington.\n\nThe plurality opinion, Justice Souter, and Justice Thomas all agreed in Troxel that the right of a parent to raise his or her children is a fundamental right. That agreement among the opinions is based on the line of cases that I have previously described.\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e The Fourteenth Amendment includes a substantive component that forbids the government from infringing on certain \"fundamental\" liberty interests \"at all * * * unless the infringement is narrowly tailed to serve a compelling state interest.\" Flores, 507 US at 302 (emphasis in original); see also California Democratic Party v. Jones, 530 US 567, 573 n 5, 582, 120 S Ct 2402, 147 L Ed 2d 502 (2000); Plyler v. Doe, 457 US 202, 216-17, 102 S Ct 2383, 72 L Ed 2d 786 (1982); Zablocki v. Redhail, 434 US 374, 386-88, 98 S Ct 673, 54 L Ed 2d 618 (1978); Carey v. Population Services, International, 431 US 678, 684-86, 97 S Ct 2010, 52 L Ed 2d 675 (1977). Our understanding of the constitutional right of a parent to have custody of his or her children and its attendant consequences is the underpinning of our decision in Harrington and our cases that have followed it.\n\nIt is correct that the plurality opinion in Troxel did not articulate a standard of review regarding infringements of the fundamental right to parent. Justice Thomas observed in his concurrence that, while the opinions of the plurality, Justice Kennedy, and Justice Souter recognized the fundamental nature of the constitutional right of parents to rear children, \"curiously none of them articulates the appropriate standard of review.\" Troxel, 530 US at 80 (Thomas, J., concurring in the judgment). Justice Thomas followed that statement by saying that he would apply a \"strict scrutiny\" standard of review. Id. Whether that statement is an assertion that the plurality is unwilling to articulate the applicable standard of review, and he is, or that he and the plurality hold different views as to the standard of review is debatable (see discussion below). It was not necessary in Harrington to address that issue, and the concurrence reads too much into our language in that case. Our statement in Harrington, which the concurrence now characterizes as an express rejection of Justice Thomas's view, merely communicated our view of a continuum on which the plurality and the two concurring opinions could be said to rest with regard to varying factual circumstances that might be presented to a court. However, there can be no reasonable debate that mother in this case holds a fundamental constitutional interest to have custody of her children and that that interest is subject to heightened protection.\n\nMoreover, the concurrence's assertion that we have expressly rejected Justice Thomas's \"strict scrutiny\" standard of review is confusing in the context of the issue in this case. In Troxel, the Washington Supreme Court invalidated the Washington statute based on the text of the statute alone. A \"strict scrutiny\" standard of review applied to a state statute means that the statute is not entitled to the usual presumption of validity; the state rather than the complainants carries a heavy burden of tailoring its regulation narrowly to serve legitimate objectives and it must demonstrate that it has selected the least drastic means for effectuating its objectives. San Antonio School District v. Rodriguez, 411 US 1, 16-17, 93 S Ct 1278, 36 L Ed 2d 16 (1973). I do not contend that ORS 109.119 is facially unconstitutional. As stated previously, the problem with the concurrence's view is that it does not afford due process to mother in its application of the statute. Consequently, in my view, there is no need to resolve whether or not we view ORS 109.119 with \"strict scrutiny.\"\n\nRegardless, for purposes of this case, the distinction that the concurrence draws is a distinction without a difference.\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e The plurality and the concurrences in Troxel are unanimous that a parent's right to parent his or her children is entitled to heightened protection because of the fundamental nature of that right. In this opinion, I assert no other principle of law than that agreed on by the concurrences and the plurality in Troxel, contrary to the efforts to characterize my analysis differently.\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e Because the Due Process Clause requires heightened protection for mother's right to have custody of her children and to direct the upbringing of her children and because that right cannot constitutionally be infringed upon by the state in the absence of a compelling state interest, the issue that must be resolved in this case is whether the circumstances present here permit the state to exercise its parens patriae power to protect the welfare of the children and to override mother's fundamental right to raise her children. It is clear from the United States Supreme Court's jurisprudence that a \"best interests of the children\" standard is not sufficient to justify government infringement of a parent's right to direct the upbringing of his or her children. See Troxel, 530 US at 69-70 (O'Connor, J., plurality opinion). Rather, in a case where a child is receiving minimally adequate care in a parent's custody, the parent is entitled, under the constitution, to retain custody. As the Court has uniformly held,\n\n\"'the best interests of the child' is not the legal standard that governs parents' * * * exercise of their custody: So long as certain minimum requirements of child care are met, the interests of the child may be subordinated to the interests of other children, or indeed even to the interests of the parents * * * themselves.\"\n\nFlores, 507 US at 304 (emphasis added).\n\nThe Troxel plurality avoided defining the precise scope of the parental due process right described above because it rested its holding on the breadth of the Washington statute. We cannot avoid that question here because our de novo standard of review requires us to consider the state of the evidentiary record. Consequently, it is helpful to think about other constitutional exercises of the state's parens patriae authority in our endeavor to give definition to the scope of mother's fundamental right. In my view, the constitutional standard of minimal parental adequacy also finds implicit expression in the requirements of Oregon statutes that permit the state to take permanent custody of a parent's child when the child's welfare is at stake. See, e.g., ORS 419B.365(4) (providing for permanent guardianship on the same grounds as required for the termination of parental rights); ORS 419B.502 (providing for termination of parental rights because of rape, sodomy, or sex abuse, intentional starvation or torture of the child by the parent, or abuse or neglect resulting in death or serious physical injury); ORS 419B.504 (providing for termination of parental rights because parents are unfit due to emotional illness, mental illness, mental deficiency, abusive, cruel, or sexual conduct toward any child, or addictive or habitual use of intoxicating liquors or controlled substances to the extent that parental ability has been substantially impaired and integration of the child into the home of the parent is improbable within a reasonable time due to conduct or conditions that are not likely to change); ORS 419B.506 (providing for termination of parental rights for the failure to provide for the basic physical and psychological needs of the child for six months prior to the filing of the petition); ORS 419B.508 (providing for termination of parental rights in the event of abandonment of the child by the parent). None of the above kinds of circumstances exists in this case.\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e\n\nI believe that due process requires that, before the state is constitutionally permitted to invade the private realm of family life, circumstances like those outlined in the above statutes or other similarly compelling circumstances must be present. We have previously held that the applicable standard in parent-non-parent custody disputes is whether the parent is unfit or whether the parent's custody presents \"an undue risk of physical or psychological harm in the parent's custody.\" O'Donnell-Lamont and Lamont, 184 Or App 249, 256, 56 P3d 929 (2002), modified on recons, 187 Or App 14, 67 P3d 939 (2003) (emphasis added); See also Strome and Strome, 185 Or App 525, 533, 60 P3d 1158 (2003); Wilson, 184 Or App at 220-21; Newton v. Thomas, 177 Or App 670, 674, 33 P3d 1056 (2001), overruled in part on other grounds by O'Donnell-Lamont and Lamont, 187 Or App 14, 67 P3d 939 (2003). In those cases, we understood that the rule of law governing those cases implicitly embodied the requirements of the Due Process Clause; the unfitness to parent or an undue risk of physical or psychological harm are the kinds of circumstances that evidence a compelling state interest that permits a state court to constitutionally deprive a parent of child custody in favor of a third party.\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e\n\nJust as the concurrence and I hold significantly different views about the meaning of Troxel, it appears we also disagree about what constitutes a compelling state interest for purposes of ORS 109.119 and whether there is such an interest in this case. This difference is more than a disagreement about whether the evidence suffices to meet a standard about which we both agree. Rather, it is a difference in opinion about what due process requires in the context of these facts. Discerning and then applying the proper legal standard is the necessary predicate to any analysis of the evidence. It is that difference that ultimately leads to our disagreement about the import of the facts in this case. The importance of that difference cannot be over-emphasized because of its due process implications.\n\nThe concurrence acknowledges the necessity of a constitutional underpinning to the state standards that it uses, and it relies on the Oregon Supreme Court's decisions in Hruby and Hruby, 304 Or 500, 748 P2d 57 (1987), and State ex rel Juv. Dept. v. Lauffenberger, 308 Or 159, 777 P2d 954 (1989), and the applicable statutes. So far so good. The problem arises, however, because the concurrence applies those standards in a way that disregards the admonition in Flores that the government is forbidden from infringing on a mother's fundamental liberty interest \"at all * * * unless the infringement is narrowly tailored to serve a compelling state interest.\" 507 US at 302 (emphasis in original). Just as the Washington statute, as applied, unconstitutionally infringed on Granville's fundamental parental right in Troxel, so too would the concurrence's application of the above standards in this case infringe on mother's constitutional right to parent her children because the concurrence fails to require that the standards, as used, comply with minimum federal constitutional standards. The result of that failure is as Justice Souter suggested in Troxel. The concurrence's employment of a less exacting standard than that required by the constitution permits grandparents, through the authority of the state, to obtain custody of mother's children because the concurrence believes that the grandparents will make better decisions regarding the children's welfare. That may be an \"enlightened\" approach by the concurrence, but it is not a constitutionally sound one.\n\nIllustrative of the concurrence's flaw in its analysis are its claims that I \"undertake[] a 'new' examination to determine the legal standard for determining when a non-parent may be awarded custody consistently with the parent's constitutional right[,]\" ___ Or App at ___ (Deits, C. J., concurring) (slip op at 50), and that, \"[i]n Harrington, we expressly rejected the strict scrutiny standard asserted by Justice Thomas in Troxel,\" ___ Or App at ___ (Deits, C. J., concurring) (slip op at 52). The concurrence also asserts:\n\n\"Judge Edmonds articulates a 'compelling state interest' standard that he derives from a legal standard that we have expressly rejected. In other words, Judge Edmonds is attempting to write anew on a slate that is far from clean.\"\n\n___ Or App at ___ (Deits, C. J., concurring) (slip op at 53).\n\nOf course, the concurrence's implicit disregard of a \"compelling state interest\" requirement, as shown by the above quotations, cannot be and is not correct as a matter of constitutional law, nor is that what our own cases such as Harrington and Wilson hold. No matter how the standard is articulated by a state rule of law, or what standard is adopted by a state as the basis for the deprivation of a child from the custody of a parent in order to award custody to a third party, the standard must afford heightened federal constitutional protection to the parent's fundamental right to custody. In other words, there must be a compelling state interest present before the state can constitutionally exercise its authority.\n\nThe concurrence's faulty premise is exacerbated by its misunderstanding of the significance of the holdings in Hruby and Lauffenberger.\u003cspan class=\"fnref\"\u003e50\u003c/span\u003e The Hruby court expressly declined to decide what state of facts will suffice to permit the state to usurp a natural parent's constitutional right to parent his or her own children. 304 Or at 510-11. Nonetheless, both Hruby and Lauffenberger are helpful in understanding why the phrase \"compelling reason,\" as used in those cases, necessarily embodies the federal constitutional standard.\n\nIn Hruby, the child's aunt intervened in a dissolution of marriage proceeding, seeking legal custody of the parties' child under the then recently enacted ORS 109.119 (1985). The court affirmed the award of custody to the natural father. First, it held that the statute \"does not grant substantive custodial rights and that a court must give custody of children to their natural parents unless there are compelling reasons for giving custody to another party. \" Hruby, 304 Or at 502. Thus, as the court later said in Lauffenberger, \"ORS 109.119 provides only procedural rights to persons who claim the specified emotional relationship with the child; the statute does not establish or change substantive custodial rights.\" 308 Or at 163.\n\nNext, the Hruby court commented on the fact that Oregon's provisional, territorial, and state governments adopted principles of common law in the mid-nineteenth century that recognized, in child custody determinations, the paramount right of parents to the care and custody of their children in the absence of abuse or an inability to care for them. The court observed:\n\n\"Apart from the implicit recognition in this [, referring to Or Laws 1880, p 7,  2,] and other Oregon statutes * * * of a natural parent's common law right to the custody of his (and now her) children, natural parents have custodial rights under the Fourteenth Amendment to the United States Constitution. Natural parents may also have custodial rights unenumerated in the Oregon Constitution. See Or Const, Art I,  33[.] * * * The extent to which other persons, such as those satisfying the requirements of ORS 109.119, have constitutional rights in the custody of children is unclear. Also unclear are the circumstances under which a state can constitutionally give persons other than natural parents custodial rights equivalent to those of natural parents. The parties, apart from a brief citation in the father's brief, have not raised these issues, and our resolution of the case makes it unnecessary for us to discuss them further.\"\n\nHruby, 304 Or at 505 n 3 (citations omitted).\n\nThe court then observed:\n\n\"[C]courts will deprive natural parents of the custody of their children only in order to protect the children from some compelling threat to their present or future well-being. Apart from these concerns, it is irrelevant to the court's custody determination that the children might have a better home or might have greater financial, educational or social opportunities in the custody of another.\"\u003cspan class=\"fnref\"\u003e51\u003c/span\u003e\n\nId. at 509.\n\nFinally, after reviewing a number of its decisions, the court summarized:\n\n\"We conclude from the foregoing that under the 'principles of common law and equity,' as further developed by legislation and the decisions of this court, a natural parent has the right to the custody of his or her children, absent a compelling reason for placing the children in the custody of another; the 'best interests of the child' standard applicable to custody disputes between natural parents in a marriage dissolution proceeding is not applicable to custody disputes between natural parents and other persons. We do not use the adjective 'compelling' in an effort to provide more precision to our holding through the use of that word in other contexts. * * * We use 'compelling' to emphasize that in a custody dispute between a natural parent and some other person, a court should not be concerned with attempting to maximize a child's welfare, but with determining whether the child will receive adequate care and love from its natural parent and whether the child will be otherwise unduly harmed, physically or psychologically, by giving custody to the natural parent.\"\n\nId. at 510-11 (citations omitted).\n\nIn Lauffenberger, the issue was whether the \"best interests of the child\" was the proper standard for a juvenile court to use when determining if a child should be placed with the child's parent or with third parties. 308 Or at 161. The child in Lauffenberger was within the jurisdiction of the juvenile court and had become a ward of the court due to parental neglect. The juvenile court, exercising its parens patriae responsibility pursuant to its statutory authority, placed the child, then age four, in the physical custody of her grandparents, while continuing to retain jurisdiction over her. After denying petitions to terminate the parental rights of the child's parents, the juvenile court held a dispositional hearing. It found that the father was a fit parent but determined that it was in the best interests of the child to remain in the custody of her grandparents. Id. at 162.\n\nThis court initially affirmed, holding that the best interests of the child dictated that she remain with her grandparents, despite the fitness of her natural parent. State ex rel Juv. Dept. v. Lauffenberger, 88 Or App 642, 646, 746 P2d 259 (1987). The father petitioned for reconsideration, which we allowed. State ex rel Juv. Dept. v. Lauffenberger, 93 Or App 757, 764 P2d 568 (1988). He argued that this court applied the wrong standard in light of Hruby's \"compelling reasons\" standard. A majority of this court rejected father's argument, reasoning that not to apply a \"best interests\" standard \"would be to change direction and run contrary to the course that the legislature has set.\" Lauffenberger, 93 Or App at 762. The majority distinguished Hruby because it involved a private custody dispute rather than a ward of the juvenile court. Four members of this court disagreed, observing that the father, as the natural parent, had a preferential right to custody even under ORS chapter 419 and that those rights had \"constitutional underpinnings.\" Id. at 768 (Newman, J., dissenting).\u003cspan class=\"fnref\"\u003e52\u003c/span\u003e It followed that to apply a \"best interests\" standard was error, in the dissent's view, in light of the fact that the trial court found that the father was fit. Id. at 770 (Newman, J., dissenting).\n\nOn review, the Supreme Court agreed with the dissent and reversed, holding that the preference for parental custody and the \"compelling reason\" standard from Hruby applied. The court reasoned:\n\n\"In sum, the broad goals stated in the juvenile court law to determine and further the child's welfare and best interests do not demonstrate a legislative rejection of the long-standing assumptions about parental custody that were reviewed in Hruby * * * assumptions that not only were longstanding at the time of Oregon's statehood but perhaps were thought to be of constitutional magnitude.\"\n\nLauffenberger, 308 Or at 165. The court then remanded, observing:\n\n\"The record of the present proceeding is sparse. The [dispositional] hearing * * * largely involved previous documents and oral summaries by counsel for the father and the [grandparents] of what various witnesses would say if they were called.\"\n\nId. at 166-67. Further, the court noted that,\n\n\"[d]eciding the case before Hruby, the court made no specific findings with respect to potential harm from parental custody that Hruby called for in ordinary private custody disputes nor with respect to any other factors that might play a role under the juvenile court statute.\"\n\nLauffenberger, 308 Or at 167. Finally, the court explained:\n\n\"Under the circumstances, although we reverse the decision of the Court of Appeals, we do not order a change of custody. That will be for the circuit court to decide on remand and on a new and more complete record, if the father still desires custody. [The child] now is nine years old and may have some opinions in the matter. CSD may have new recommendations in view of developments since 1986; objections to discontinuity standing alone do not override the preference for parental custody.\"\n\nId. at 168.\n\nThe concurrence's assertion that ORS 109.119 would permit an award of custody to grandparents based on a failure to provide adequate love and care or because placement of the child would cause the child undue physical or psychological harm, ___ Or App at ___ (Deits, C. J., concurring) (slip op at 48-49), without adherence to constitutional standards, causes the concurrence to repeat the error made by a majority of this court in Lauffenberger. \"Adequate love and care\" does not mean perfect care, and an \"undue\" risk of harm is more than just a risk of harm. In effect, the concurrence's application of the Hruby and Lauffenberger case law and statutory standards without adherence to the federal standard of \"a compelling state interest\" results in a less exacting standard than the federal constitution requires.\u003cspan class=\"fnref\"\u003e53\u003c/span\u003e As both the Hruby and Lauffenberger courts acknowledged in the above-quoted material, the substantive standard underlying ORS 109.119 is based on case law and legislative intent, but necessarily has constitutional underpinnings. So long as the state standard is not inconsistent with the federal constitution, no constitutional issue arises. That was the factual situation in both Hruby and Lauffenberger where the trial courts found the parents seeking custody to be capable of providing adequate care for their children. It is only when a state standard is applied to take children away from parents, and that standard fails to adhere to the minimum protections guaranteed by the constitution regarding a parent's fundamental right to raise his or her children, that the constitution is implicated. That, of course, was the unconstitutional effect of the Washington statute in Troxel. It is also what makes the \"inadequate love and care\" and \"undue physical or psychological harm\" standards in this case problematic unless they are applied with the understanding that mother's fundamental right to parent is entitled to heightened protection and cannot be infringed absent a compelling state interest.\n\nIn summary, for purposes of the Due Process Clause, there can be no substantive difference between the federal \"compelling state interest\" standard and the Hruby \"compelling reason\" standard. No matter how the state standard is phrased or characterized, it must satisfy the federal constitution before the state may constitutionally interfere with a parent's rights involving his or her children. Although a \"compelling reason\" need not be identical to the standards set forth in the termination statutes, it must embody circumstances that present similarly grave risks of harm to a child's welfare either because of a parent's unfitness or because of the physical or psychological needs of the child. The termination statutes illustrate the kinds of risks that authorize state intervention and therefore are helpful in understanding the scope of parental due process in the context of a custody award to a third party. Ultimately, it is that federal standard of minimal adequacy that must be met before a parent can lawfully be deprived of his or her fundamental right by an award of custody to a third party.\n\nIt is with the federal constitutional standard in mind that I proceed to analyze the evidentiary record in this case.\u003cspan class=\"fnref\"\u003e54\u003c/span\u003e\n\nIII. IS GRANDPARENTS' EVIDENCE CONSTITUTIONALLY SUFFICIENT TO PERMIT MOTHER TO BE DEPRIVED OF CUSTODY OF HER CHILDREN?\n\nIn major part, the discussion that follows is not a dispute with the concurrence over what the evidentiary record contains.\u003cspan class=\"fnref\"\u003e55\u003c/span\u003e Rather, it is the failure of the concurrence to apply due process standards with which I disagree. In effect, the concurrence's unwillingness to actually apply a federal constitutional standard to this case constitutes an implicit acknowledgment that the evidence in this case is insufficient to meet the requirements of due process. The evidence fails to show that mother is not a minimally adequate parent\u003cspan class=\"fnref\"\u003e56\u003c/span\u003e and, thus, does not support the result endorsed by the concurrence: that mother should be deprived of the custody of her children. The following is an effort to look at the facts objectively as they appear in the record and then evaluate whether their gravity evidences a compelling state interest that would permit infringement on mother's fundamental interest in parenting her own children, keeping in mind the required heightened protection given to mother's right. Some preliminary observations are germane to that discussion before a detailed evaluation of the evidence occurs.\n\nFirst, the trial court, unlike the concurrence, properly recognized that the evidence did not rise to the level that the constitution requires. After hearing the evidence and closing arguments, the court told the parties that it would take the case under advisement:\n\n\"I think this case is driven more by what I interpret the law to be than by the facts in this particular case. If it was driven by the facts, and all I had to decide is a -- what is in the best interests of the child, the answer is relatively easy for me to reach, and that is I would find that clearly the grandparents are -- would prevail. * * *\n\n\"I don't think that that necessarily ends my inquiry. I think I really need to look into seeing what they meant in Sleeper by that supervening right that exists. And [mother's counsel] may have hit upon that, and that's her supervening right being of a constitutional nature. It may be that the Court will have to find that there has to be a level of harm, if not equal to, close to that in which the State would be intervening, anyway, where the State would go in as a CSD or SOSCF matter nowadays and take control of the children. And if that is what I believe the law to be, then the right answer would be to allow the biological mother * * * to maintain custody of these children.\"\n\n(Emphasis added.) Subsequently, the trial court wrote a letter opinion in which it ruled that \"I do not believe Troxel required this court to find harm or unfitness before awarding custody to non-biological parties.\" The court incorporated nearly identical language into the judgment.\n\nSecond, a major flaw in the concurrence's reasoning is that it substantially relies on the subjective factual conclusions and opinions of two expert witnesses. Those witnesses evaluated mother and grandparents and made recommendations based solely on the best interests of the children. Necessarily, their subjective views of mother's psychological state and its effect on the children is colored by the wrong lens. Moreover, because the concurrence evaluates the expert witness evidence under a standard that the experts themselves did not apply, it takes their testimony out of context. For example, the concurrence uses Sabin's statement that the children \"have extensive needs that aren't going to be met in [mother's] home\" to support its rather damning conclusion that \"mother is unable to meet the children's needs[.]\" ___ Or App at ___ (Deits, C. J., concurring) (slip op at 58). However, in context, Sabin's testimony is quite different and does not have the significance that the concurrence gives it:\n\n\"[Counsel]: [Has mother] discussed her educational plans for the children?\n\n\"[Sabin]: Yes, she would plan on schooling them at home. She feels that they have separation issues, that they don't want to be away from home, and that they should be home-schooled.\n\n\"[Counsel]: And did she tell you that she would have liked to be doing that now, during the school year?\n\n\"[Sabin]: Yes, she said she would have liked to have been doing that now, but she felt that [grandparents'] were, quotes, breathing down her neck and would not have allowed that.\n\n\"[Counsel]: Do you think that home schooling would be appropriate for [J]?\n\n\"[Sabin]: No, I don't think home schooling's appropriate for either of these children.\n\n\"[Counsel]: And why is that?\n\n\"[Sabin]: Well, I think they both have extensive needs that aren't going to be met in the home, and I think that the home environment creates its own culture that's isolated and insulated from the larger culture that these children hopefully will come to live in. I don't think that home education would prepare them for social interactions and for getting along with others.\n\n\"[J] does have very special needs in terms of her education, and even a well-educated parent, I think, would have a hard time providing all that at home, and [mother] has no special training or education in education.\"\n\nConsequently, the concurrence finds itself in an awkward position. It disagrees with the trial court as to the import of the facts regarding unfitness to parent and undue risk of harm to the children, and it bases its conclusion on expert testimony that used a standard disapproved by the United States Supreme Court. In an effort to rescue itself from this dilemma, it invokes its de novo review of the facts underlying the subjective opinions of the experts and then applies its own value judgments regarding the state standards. See ___ Or App at ___ (Deits, C. J., concurring) (slip op at 57-58). There is no problem with that exercise so long as the analysis applies a minimal constitutional standard of care to mother's performance as a parent and identifies a compelling state interest at stake. But the concurrence appears unwilling to embrace such a constraint on its review. The state law standards, \"inadequate love and care\" and \"undue risk of physical or psychological harm,\" are by their nature subjective. Any minimally adequate parent could be found guilty of \"inadequate love and care\" or of creating an \"undue risk of physical or psychological harm\" merely because, in the words of Justice Souter, an \"enlightened\" judge believes that the care given by the parent on a particular occasion is \"inadequate\" or that the risk of harm is \"undue.\" The constitution requires more, as I have said previously in great detail.\u003cspan class=\"fnref\"\u003e57\u003c/span\u003e We, as judges, are not \"social engineers\"; rather our role is to apply the law, including the constitution as it exists.\u003cspan class=\"fnref\"\u003e58\u003c/span\u003e\n\nUltimately then, the purpose of this subsection is not to evaluate the evidence solely through the eyes of the expert witnesses but to examine it objectively in light of the constitutional requirement that there must be a compelling state interest before the children can be lawfully taken from their mother's care. To that end, I take into account both the expert testimony as described in the concurrence's opinion and also the evidence that reflects mother's parenting in a positive light to answer the question of whether the evidence rises to the level that permits the state to take custody away from a natural parent and award it to third persons.\n\nMother is remarried and works as an in-home child care provider. She and her current husband have two children in addition to A and J, the children who are the subject of this litigation. A and J are emotionally attached to their younger brother and sister as well as to mother and her husband and grandparents. Mother has no history of drug or alcohol abuse or violence. She has never been in trouble with the law and has not been involved with Services to Children and Families or any similar state agency.\n\nDue to J's difficulty in school, as described in detail by the concurrence, mother hired a tutor to assist J. As a result of the tutoring, J made significant academic improvement. Mother and her husband also worked with J to improve her reading and helped her with homework when necessary. Mother explained at trial that some of the absences, as described in the concurrence's description of the facts, ___ Or App at ___ (Deits, C. J., concurring) (slip op at 33-34), occurred after father's death and during the transition that had to be made as a result; other absences occurred because J was introverted and was reluctant to go to school. Mother also explained that she wanted the children to get themselves up in the morning with the help of an alarm clock and that J had a hard time accomplishing that task. A, in contrast to J, excelled in school. She got nearly straight As and consistently completed her homework. A's teacher for the 1999-2000 school year noted A's social progress. Although A was new to the school that year, she had a group of friends by the end of the school year and was described as being sensitive to other children.\n\nGrandparents also had concerns about the children's hygiene and grooming while they were under mother's care. J's first grade teacher noted that there were several occasions after the children went to live with mother when J came to school dirty or with her clothes sloppy or her hair uncombed. Sabin also observed that the first couple of times that the children came into her office with mother, they had dirty or uncombed hair or their clothes were mismatched. She also noted that A's teacher for the 1998-99 school year had reported that, after the move to mother's house in April 1999, A wore dirty clothes to school and that her hygiene was poor. In contrast to the previous year, the children's teachers for the 1999-2000 school year both said that the childrens' hygiene, grooming, and dress were appropriate.\n\nAs the concurrence emphasizes, a dental check-up of A in November 1999 revealed that she had extensive dental decay. However, there does not appear to have been obvious evidence of tooth decay. Grandmother testified that, when mother told her that A was going to have dental work done, she looked but \"there wasn't anything visible in [A's] mouth that [she] could see,\" and, when asked, A said that her teeth were not bothering her. Earlier examinations, including one in January 1999 while the children lived with grandparents, had not shown evidence of tooth decay. Although the dentist stated that \"possible\" causes were poor oral hygiene and drinking too much soda pop, mother testified that she believed that the decay occurred before A was in her custody. Sabin also testified that mother had expressed concern to her that the reason that the decay was not detected in prior dental exams was because no x-rays were taken.\n\nThe evidence of J's difficulty in school, her subsequent academic improvement, the children's poor hygiene and its subsequent improvement, and A's tooth decay, which cannot be clearly attributed to either mother's or grandparents' custody, is hardly the kind of evidence that permits the state to intervene into mother's private life. The uncontroverted evidence shows that mother has made efforts to change the quality of her parenting. As to J's academic problems, mother hired a tutor and worked with J to improve her performance. Further, tutoring improved J's academic abilities. While it is correct that, at the time of the trial, J was going to be held back a grade, it is unclear from the evidence that the absenteeism alone, rather than J's overall academic ability, caused that result. Although the concurrence appears to accept Sabin's conclusions about the cause of A's tooth decay as fact, on the record of this case as a whole, that evidence is conflicting. Further, once the problem was discovered, mother undertook to have the necessary dental work done. Finally, although mother discontinued the children's therapy with MacKendrick due to her personal animosity towards him, she continued the childrens' grief counseling with another counselor after father's death. Those actions demonstrate mother's willingness and ability to make decisions regarding her children's welfare. Although the concurrence disagrees with mother's decisions, it is clear from Troxel and the related Supreme Court jurisprudence that the constitution protects parents from the kind of second-guessing engaged in by the concurrence.\n\nI turn now to the substance of the testimony of the experts, mindful that it is appropriate to look behind their conclusions to the facts that they rely on to evaluate the weight their opinions should be given. No expert witness expressly testified that mother is incapable of providing adequate care for the children in the future. Rather, according to Sabin, it is in the best interests of the children that their custody be with grandparents because mother \"has difficulty separating her needs, her emotional needs, from those of the children.\" Sabin believes that the \"Winczewski children should not have to be part of this ongoing generational dysfunction since there are alternatives available for them.\" (Emphasis added.) Sabin agrees that mother's intellectual potential is in the average range. However, she suffers, according to Sabin, from depression and loneliness, causing her to \"focus on one detail * * * without looking at the big picture[.]\" By way of contrast, the expert witnesses do not opine that mother is mentally retarded or of limited intellectual ability or that she suffers from a psychosis or an entrenched personality disorder. The latter are the kinds of diagnoses that typically arise in a state proceeding to deprive a natural parent of custody. It is also important to note that there is no suggestion that mother has ever abused or wilfully neglected her children. Rather, Sabin suggests that there are \"alternatives available\" to having the children remain with mother, an \"emotionally limited\" parent. That is not a constitutionally appropriate standard under which natural parents can be deprived of the custody of their children by the state. Moreover, it can generally be said from common knowledge that many at least minimally adequate parents live in dysfunctional environments, may have difficulty separating their needs from the needs of their children, may be lonely, may suffer from occasional depression, and may fail to see the big picture, but none of those diagnoses constitutes a \"compelling circumstance\" sufficient to deprive mother or any parent of custody. Although retaining the children in mother's custody may not allow them to maximize their potential, courts cannot effectively sever parent rights just \"because the natural parents are unable to furnish surroundings which would enable the child to grow up as we would desire all children to do.\" State v. McMaster, 259 Or 291, 303, 486 P2d 567 (1971).\n\nOn the other hand, mother has not been a model parent. Certainly, no one would approve of the tone of the confusing letters that she wrote to her children while their father was dying, and perhaps mother should be faulted for causing J to undergo a blood test or having J evaluated for sexual abuse. But the fact remains that all of those actions occurred in the midst of a highly emotionally charged \"tug of war\" for the custody of the children. However improper, in the view of the concurrence, those decisions were, they are not the kind of actions that create compelling circumstances to permit the state constitutionally to intervene and award custody to a third party.\n\nUltimately, Sabin's and MacKendrick's testimony reduces to the following factors when balanced with the remaining evidence: (1) mother's relationship with the children has not always been emotionally healthy for them; (2) mother has suffered from confusion in understanding and processing emotional issues; (3) mother tends to over-focus on certain issues and ignore the big picture; (4) A has had serious tooth decay (mother had the problem corrected); (5) mother stopped giving Paxil, a psychotropic drug, to A because she decided it was unhealthy for her; (6) mother had a blood test administered to see if there was Paxil in J's system without first asking J if she had taken the medication; (7) mother terminated the children's therapy with MacKendrick (but continued their therapy in two grief counseling groups); (8) mother, in the furtherance of her own interests, attended one of the children's two grief counseling groups with them rather than allowing grandparents to attend both of them; (9) A gained weight in mother's custody; (10) mother planned to home school the children although she had no training or background in education; (11) mother referred to J's vision problem in J's presence, characterized it as severe, and blamed it for some of J's academic problems (however, A's academic performance was excellent while in mother's care); (12) the sleeping arrangements at mother's home were not stable and did not establish appropriate boundaries (mother later made adjustments in those arrangements); (13) mother, in her parenting activities, talks slowly and feels powerless to influence the children's behavior; (14) the children had excessive absences from school after the move to mother's house (according to the evidence, those problems were eventually corrected); and (15) no one disputes that mother cares deeply for the children.\n\nIV. CONCLUSION\n\nThe \"compelling interest\" standard imposed by the Due Process Clause is onerous. Even though the concurrence acknowledges mother's constitutional right, there is little suggestion in its analysis that it gives mother the heightened protection to which she is entitled. In its view, Hruby, Lauffenberger, Fenimore, Cerda, Wilson, and other cases establish a statutory standard of \"compelling reasons.\" Under that standard, the concurrence concludes that, on these facts, the heightened protection of mother's fundamental right to parent her children has been overcome.\n\nThere can be no less exacting standard applied in this case than what the Due Process Clause requires. No case previously decided by this court or the Oregon Supreme Court has taken custody from a natural parent and given it to a third person on the kind of evidence that exists in this case. More than a mere evidentiary presumption or a statutory standard is implicated by mother's right to custody of her children. Troxel and its predecessors make clear that the \"presumption\" in favor of granting custody to mother is of constitutional magnitude. For the presumption to be overcome, there must be a compelling state interest implicated and not merely that mother has, on some occasions, failed to act in her children's best interests. The evidence of instances of inattentive parenting followed by remedial measures by mother, even when considered along with mother's emotional limitations, simply do not amount to a compelling state interest that justifies taking custody away from mother. The most serious of mother's alleged offenses, the tooth decay issue and the failure on occasion to be sensitive to the childrens' emotional needs, even when viewed in the light most favorable to grandparents, do not constitute an \"undue\" risk of harm in the constitutional sense.\n\nAs long as mother is capable of providing minimally adequate care (and the evidence does not disprove that ultimate fact in this case) and her custody does not present a clear and undue risk (i.e., not just some risk, but rather, a constitutionally significant risk) of harm to the children, the state cannot constitutionally interfere with her right to the custody of her children by giving custody to grandparents. In sum, the concurrence fails to apply the test that is required under the federal constitution and thereby deprives mother of the custody of her children in violation of her constitutional rights.\n\nI respectfully dissent for the reasons expressed above.\n\nBREWER, J., dissenting.\n\nBoth the concurrence and dissent have eloquently staked out their respective positions in this case. I reluctantly wade into the fray for two reasons: (1) The opinions are so lengthy and complex that I fear they will further discourage a family law bench and bar that craves clarification in an already confusing and vexing area of the law; and (2) several legal principles are at play in this case, including the nature of the child's interest in the preservation of a child-parent relationship with a non-parent, which I discuss in the hope that the Oregon Supreme Court will accept review of our decision and bring greater clarity to the relationship between ORS 109.119 (2001) and the United States Supreme Court's decision in Troxel v. Granville, 530 US 57, 120 S Ct 2054, 147 L Ed 2d 49 (2000).\n\nMy first concern is fundamental: Troxel is not a poison pill decision that taints all state non-parent custody and parenting time statutes. Because the various opinions in Troxel prevented the Court from speaking with a clear and unified voice, its decision is subject to misinterpretation. However, certain core principles can be discerned. Although all of the justices, except Justice Scalia, agreed with the state court that the visitation order directly burdened the parent's \"fundamental right\" to raise her child free of undue governmental interference,\u003cspan class=\"fnref\"\u003e59\u003c/span\u003e Justice Thomas alone called for application of the strict-scrutiny standard usually employed in the protection of fundamental rights. See id. at 80 (Thomas, J., concurring in the judgment). That omission was no oversight; the alternative approach taken by at least six justices amounted, in fact, to an implicit rejection of strict scrutiny. Instead, at least seven justices accepted the proposition that the constitution requires a presumption that a fit parent is best able to assess what is good for his or her child.\u003cspan class=\"fnref\"\u003e60\u003c/span\u003e The same group also recognized that the presumption can be rebutted by a showing that the parent will not act in the child's best interests. That approach ascribes primacy to parental prerogatives but only within limits. Determining whether those limits have been transgressed, in turn, inevitably requires consideration of the circumstances of the family--including the strength and quality of pre-existing ties between the child and the non-parent contestant.\n\nMost of the members of the Court in Troxel understood that the evolving diversification of family structures cautions against a rigid constitutional analysis. The plurality began its analysis by referring to the \"changing realities of the American family,\" id. at 64, (O'Connor, J., plurality opinion) noting that \"[t]he demographic changes of the past century make it difficult to speak of an average American family,\" id. at 63. Justices Stevens and Kennedy made the point even more forcefully, and it led them to urge some qualification of parental rights. Id. at 98-99 (Kennedy, J., dissenting); accord, id. at 90 (Stevens, J., dissenting). Justice Kennedy, for example, stated that his \"principal concern\" with the Washington court's strict scrutiny analysis was\n\n\"that the holding seems to proceed from the assumption that the parent or parents who resist visitation have always been the child's primary caregivers and that the third parties who seek visitation have no legitimate and established relationship with the child.\"\n\nId. at 98 (Kennedy, J., dissenting). Justice Stevens, in turn, warned that\n\n\"[t]he almost infinite variety of family relationships that pervade our ever-changing society strongly counsel against the creation by this Court of a constitutional rule that treats a biological parent's liberty interest in the care and supervision of her child as an isolated right that may be exercised arbitrarily.\"\n\nId. at 90 (Stevens, J., dissenting).\n\nThe Court also appeared to recognize that child access cases have a greater potential than most other cases to present collisions of intersecting rights. Justice Stevens was the most direct in describing this as a potential clash of competing constitutional interests, id. at 88 (Stevens, J., dissenting), but Justice Kennedy, too, plainly thought that a parent's prerogative must be balanced against the competing interests of other family members. See id. at 100-01 (Kennedy, J., dissenting).\n\nThe Court's emphasis on changes in family structure, and the insistence of several justices that multiple constitutional rights are at stake in such cases, are inconsistent with the categorical analysis ordinarily associated with strict scrutiny.\n\n\"That doctrine entails an essentially categorical analysis. It asks, first, whether the state has intruded upon some conduct categorized as a 'fundamental right'; and, if so, whether the public interest served is properly categorized as 'compelling.' There is only a little room to maneuver here--generally the precise gradations of intrusion or justification are beside the point. This, of course, is largely why strict-scrutiny cases are presumed to be won or lost at the threshold issue of categorization as a 'fundamental right' or a 'suspect class,' rather than in any subsequent balancing of state and individual interests.\n\n\"Troxel, by contrast, plainly contemplates cases being won or lost later on in the analysis. Moreover, the outcome will depend not so much on a categorical assessment of the competing interests, as on fact finding into the nuances of particular family relationships or the manner in which a parent exercised her 'fundamental right.' In fact, rather than modern strict scrutiny, the Court's approach seems more reminiscent of the mushy 'reasonableness' standard which the Court employed in its very first family-privacy cases during the Lochner era.\"\n\nDavid D. Meyer, Constitutional Pragmatism for a Changing American Family, 32 Rutgers LJ 711, 716 (2001) (footnote omitted).\n\nWhen the competing rights of child and parent are pitted against each other, a balancing of interests is appropriate. That notion finds support in the Troxel test. As discussed, Troxel teaches that a court cannot award parenting time to a non-parent over the objection of a fit parent based solely on best interest considerations. Troxel, 530 US at 69 (O'Connor, J., plurality opinion). However, the presumption that must be applied before best interests are considered focuses solely on the parent's ability to act in the child's best interests. In other words, the presumption relates to the very factual determination that must be made if it is rebutted. Because, in a real sense, the Troxel presumption blends with the best interests test, there is a certain circularity to the Court's analysis. That circularity leaves one to wonder whether there is less to the presumption than initially meets the eye. As one commentator has observed:\n\n\"The significance of Troxel lies in its subtlety, not in any rigid analysis of recognized and established constitutional law doctrine. The opinion marks an evolution in parental autonomy protection by what it pronounces as well as by what it avoids. By balancing the State's interest in protecting the child with the parent's interest in making child-rearing decisions free from unnecessary State interference, the Court no longer accords blind, unquestioning deference to the decisions of presumptively fit parents. Ideally, when courts decide to balance the competing interests equally, the child's needs will be served and will prevail.\"\n\nSandra Martinez, The Misinterpretation of Troxel v. Granville: Construing the New\n\nStandard for Third-Party Visitation, 36 Fam LQ 487, 499 (2002). In sum, Troxel neither requires nor presages a strict scrutiny analysis of rights in non-parent custody and parenting time cases; instead, the deference to parental prerogative that it requires entails a balancing of distinct family interests.\n\nAssuming for the sake of argument, however, that a strict scrutiny analysis does apply under ORS 109.119, an element of \"harm\" in the traditional sense is not the only compelling state interest at issue where the welfare of children is concerned. For example, the state's compelling interest in requiring school attendance or restricting child labor does not derive exclusively from the state's interest in preventing \"harm\"; instead, it stems from the state's broader parens patriae interest in the well being of children. See Prince v. Commonwealth of Massachusetts, 321 US 158, 166-67, 64 S Ct 438, 88 L Ed 645 (1944); Pierce v. Society of Sisters of Holy Names, 268 US 510, 534, 45 S Ct 571, 69 L Ed 1070 (1925). Thus, although the threat of physical harm to a child is certainly sufficient to provide the state with a compelling interest, such harm is not a sine qua non for the existence of a compelling state interest.\n\nThe Maine Supreme Court, which follows the view that a compelling state interest is required for the state to intervene in the context of Maine's non-parent parenting time statute, has described the matter this way:\n\n\"The cessation of contact with a grandparent whom the child views as a parent may have a dramatic, and even traumatic, effect upon the child's well-being. The State, therefore, has an urgent, or compelling, interest in providing a forum for those grandparents having such a 'sufficient existing relationship' with their grandchildren. Here the [grandparents] have acted as parents for their grandchildren, and therefore may seek continued access to those children. This interest springs not from any common law right of the grandparent to visitation with the child, but from the child's significant need to be assured that he or she will not unnecessarily lose contact with a grandparent who has been a parent to that child. See Troxel, 530 US at ___, 120 S Ct at 2071 (Stevens, J., dissenting) ('There is at a minimum a third individual, whose interests are implicated in every case to which the statute applies--the child.').\n\n\"When a grandparent has been the 'primary caregiver and custodian' for a child over a significant period of time, the relationship between the child and the grandparent warrants application of the court's parens patriae authority on behalf of the child and provides a compelling basis for the State's intervention into an intact family with fit parents. Recently, this compelling interest has been recognized in several other contexts, based upon the reasoning that a parent's fundamental liberty interest must be balanced against a '[child's] interest in continuing to have access to the only adult who has acted as a parent to [the child].' Youmans v. Ramos, 429 Mass 774, 711 NE2d 165, 172 (1999); see also V.C. v. M.J.B., 163 NJ 200, 748 A2d 539, 548-49 (2000) (holding that the State may intervene to grant visitation over the objections of a parent where the child's psychological parent 'has stepped in to assume the role of the legal parent who has been unable or unwilling to undertake the obligations of parenthood'); American Law Institute, Principles of the Law of Family Dissolution  2.03 (Tentative Draft No. 4, 2000).\n\n\"Thus, the State has demonstrated that it has a compelling interest in providing a forum in which a grandparent, who has acted as a parent to the child at issue, may seek continuing contact with the child.\"\n\nRideout v. Riendeau, 761 A2d 291, 301-02 (2000) (footnotes omitted). Thus, even those states that follow a strict scrutiny methodology in analyzing non-parent child access statutes acknowledge the existence of a child's interest in the preservation and enjoyment of a child-parent relationship with a non-parent. I next consider the dimensions of that interest.\n\nIt is true, and sadly so, that for much of history children were treated by the legal system as little more than a form of chattel entirely within the control of their biological parents. See generally, Mary Beth Norton, Founding Mothers and Fathers: Gendered Power and the Forming of American Society (1996); Viviana A. Zelizer, Pricing the Priceless Child, the Changing Social Value of Children (1985). However, more recently, numerous courts have held that disruption of a child's pre-existing relationship with a nonbiological parent can potentially be harmful to the child and that such a relationship may be protected by the court over a fit parent's objection. See In re Marriage of Howard, 661 NW2d 183, 191 (Iowa 2003) (\"[W]hen a grandparent has established a substantial relationship with a grandchild, as required under our statute, an emotional bond can be created that, if severed, can inflict harm on the child\"); see also Roth v. Weston, 259 Conn 202, 226, 789 A2d 431, 445 (2002) (\"proof of a close and substantial relationship [with party seeking visitation] and significant harm should visitation be denied are, in effect, two sides of the same coin\"); Skov v. Wicker, 272 Kan 240, 246-48, 32 P3d 1122, 1126-27 (2001) (to uphold constitutionality of grandparent visitation statute, court added requirement that grandparent prove existence of \"a substantial relationship with the grandchildren\"); Blixt v. Blixt, 437 Mass 649, 658, 774 NE2d 1052, 1060 (2002), cert den, ___ US ___, 154 L Ed 2d 1022 (2003) (same); Youmans, 429 Mass at 782-83 (concluding that judge could order visitation between child and maternal aunt who was child's de facto parent after considering best interests of child).\n\nMoreover, it is now firmly established that children are persons within the meaning of the constitution and accordingly possess constitutional rights. See Meldrum v. Novotny, 640 NW2d 460, 470 (SD 2002) (Konenkamp, J., concurring) (\"Children are not property. They have rights of their own.\"). The United States Supreme Court has held that \"neither the Fourteenth Amendment nor the Bill of Rights is for adults alone.\" In re Gault, 387 US 1, 13, 87 S Ct 1428, 18 L Ed 2d 527 (1967). Specifically, the Court has held that minors are entitled to constitutional protection for freedom of speech, equal protection against racial discrimination, due process in the civil context, and a variety of rights of defendants in criminal proceedings. See Carey v. Population Services International, 431 US 678, 692 n 14, 97 S Ct 2010, 52 L Ed 2d 675 (1977).\n\nA legal commentator has described the effect of Troxel on children's constitutional rights theory as follows:\n\n\"Before Troxel, it was abundantly clear that under the U.S. Constitution children possessed rights to equal protection, to due process, and to privacy in a wide variety of settings. After Troxel, it appears that at least six of the justices would weigh children's interest in protection of intimate relationships in the balance of constitutional rights.\n\n\"* * * As the least powerful of groups and most vulnerable of persons, children are arguably most in need of rights. In a conceptual scheme in which adults have rights and children have mere interests, children's interests too often are trumped by the more powerful notion of rights. Judges and legislatures are increasingly unwilling to view the rights of parents as paramount. * * * The Supreme Court has recognized children's rights in many different settings, from juvenile justice to education. After Troxel, it seems clear that in a properly presented custody case, the Court can be expected to recognize children's rights to due process, equal protection, and privacy in the context of custody as well. The challenge for scholars (and for judges) is to acknowledge children's rights in custody cases in a manner that does not treat them like small adults, that takes account of their essential difference, and that respects their complex needs for nurture, protection, identity, and connection.\"\n\nBarbara Bennett Woodhouse, Talking About Children's Rights in Judicial Custody and Visitation Decision-Making, 36 Fam LQ 105, 113-14 (2002) (footnotes omitted).\n\nIn the wake of Troxel, courts are beginning to recognize that \"a child has an independent, constitutionally guaranteed right to maintain contact with a person with whom the child has developed a parent-like relationship.\" Webster v. Ryan, 189 Misc 2d 86, 729 NYS2d 315, 316 (NY Fam Ct 2001) (addressing right to visitation). Specifically, the court held in Webster that the child's right \"is constitutionally guaranteed because it is a fundamental liberty encompassed within the freedom of association right of the First Amendment of the United States Constitution * * *. This liberty is protected by the Due Process Clause of the Fourteenth Amendment * * *.\" Id. at 316-17. For its reasoning, the court relied on First Amendment case law\n\n\"guaranteeing the freedom of speech and the right to peaceably assemble includes a freedom of individuals to associate in intimate, personal relationships. See [Griswold v. Connecticut], 381 US 479, 85 S Ct 1678, 14 L Ed 2d 510 (1965); [National Asso. for the A.C.P. v. Alabama], 357 US 449, 78 S Ct 1163, 2 L Ed 2d 1488 (1958). The First Amendment association rights have been found to be protected from intrusion by the State by virtue of the Due Process Clause of the Fourteenth Amendment. See [De Jonge v. State of Oregon], 299 US 353, 57 S Ct 255, 81 L Ed 278 (1937).\"\n\nWebster, 189 Misc 2d at 316 n 3. The court held that such a right must be balanced against the unquestionable fundamental right of the biological parent to raise the child without undue state interference.\n\nAlthough not specifically relying on the First Amendment as the source of the child's constitutional right, the California courts have followed a similar set of principles. In In re Santos Y., 92 Cal App 4th 1274, 1314-15 (2001), the court held:\n\n\"While the United States Supreme court has reserved the issue of deciding the nature of a child's liberty interests in preserving established familial or family-like bonds (Michael H. v. Gerald D., 491 US 110, 130, [109 S Ct 2333, 2345-2346, 105 L Ed 2d 91] (1989)), our Supreme Court has declared that '[c]hildren .... have fundamental rights--including the fundamental right .... to \"have a placement that is stable, [and] permanent.'\" California recognizes that '[c]hildren are not simply chattels belonging to the parent, but have fundamental interests of their own' .... and that these interests are of constitutional dimension. California case law [has] '[a]dopt[ed] the proposition that a child has a constitutional right to a reasonably directed early life, unmarred by unnecessary and excessive shifts in custody ....'\"\n\n(Some internal citations omitted.)\n\nAn obstacle to the present enjoyment of a child's constitutional right to the preservation of a child-parent relationship with a nonbiological parent lies in the child's presumed inability to make a mature decision as to which relationships are most important to the advancement of her or his welfare. In that regard, some theorists posit that children have the same constitutional rights that adults have, subject only to the proviso that, depending on the nature of the right in question, its enjoyment lawfully may be deferred until a certain age has been attained. According to that theory:\n\n\"At least part of the strongest philosophy of government that could justify the classification of children as persons is the moral principle of individual autonomy, which I understand to be the right of a person to govern himself, to be free from any external control to which he has not consented. If this principle is part of the moral justification of our Constitution, then it becomes clear why we should include children under its provisions. Young children do not have the competence to make many of the choices that adults make on a regular basis in complex social systems, but they will in a few years develop many of these competencies. Hence, the right to be treated as a person is best understood as a right-in-trust. Once we acknowledge this, it becomes legitimate for children to complain if they are not provided with opportunities and conditions assuring their full enjoyment of their constitutional rights when they acquire the characteristics of persons. Moreover, the classification of children as persons as a right-in-trust is not only consistent with their being regarded as individuals in custody during their minority, but it defines the limits of our custodial duties. We must provide them 'the conditions for their becoming individuals who are able freely and in an informed way to choose and who are prepared themselves to assume responsibility for their choices.' And we must refrain from denying children the enjoyment of their rights if we cannot show that this is necessary to protect their future autonomy. Only in this way can we legitimately discharge our custodial duties toward children as persons.\"\n\nLawrence D. Houlgate, Three Concepts of Children's Constitutional Rights: Reflections on the Enjoyment Theory, 1 U Pa J Const L 77, 93-94 (1999) (footnotes omitted).\n\nAt bottom, the notion of a child's constitutional right to the preservation and enjoyment of a child-parent relationship with a nonbiological parent is both evolving and complex. In one respect, that right mirrors an adult's right to maintain valuable associations, which is a fundamental liberty interest protected by the Due Process Clause of the Fourteenth Amendment. To the extent that that right is limited, it is because of the presumptive prerogative of a fit parent to make decisions involving care and custody on behalf of his or her minor child. That limitation is embodied in Houlgate's enjoyment theory of children's constitutional rights. In a second respect, the state, acting through the courts, must safeguard the child from harm in the traditional sense, a role that implicates the child's right to protection. Parham v. J. R., 442 US 584, 603, 99 S Ct 2493, 61 L Ed 2d 101 (1979). That interest also can be cast in substantive due process terms as involving a fundamental liberty interest, but there is no plausible argument for deferring its enjoyment until majority. In fact, the state's parens patriae authority to protect minors from harm compels the opposite conclusion. In both of the respects discussed, the interests of the child have constitutional stature. Although the United States Supreme Court has not placed the enjoyment of those interests on an equal footing with the constitutional liberty interests of fit parents to make caregiving decisions, Troxel prescribes a particular form of balancing, in which a fit parent's liberty interest is given threshold primacy in the form of a presumption that he or she will act in the child's interests. Troxel, 530 US at 68 (O'Connor, J., plurality opinion). If the presumption is not rebutted, the Court must accord the parent's determination of custody or parenting time special weight. Id. at 69. However, if the Court determines that the presumption has been rebutted, the interests of the child are paramount. Id.\n\nWith that background, I turn to what appears to be the principal dispute between the concurrence and Judge Edmonds's dissent, namely, whether ORS 109.119 can be constitutionally applied, under the facts here, to permit an award of custody to grandparents. Although the correctness of the concurrence's application of the statutory standards to the facts of this case is subject to legitimate debate, it is far less clear that there is anything about the statute itself, as applied, that is unconstitutional.\n\nORS 109.119 literally follows the Troxel template for parenting-time cases but with a twist that matters here. That statute also provides for custody awards to nonparents under certain conditions. As discussed, the Troxel plurality carefully avoided adopting a strict scrutiny test for parenting time disputes involving a parent and non-parent. However, because a parent's loss of custody is a far greater intrusion on a fundamental liberty interest than is the loss of parenting time, it is unclear whether the Court would impose additional restrictions on an award of custody to a non-parent than it imposed in Troxel on non-parent parenting time awards. What does seem clear, though, is that the \"compelling reasons\" test followed by the concurrence in this case should be sufficient to save the statute, even as applied to a custody dispute.\n\nThe compelling reasons test is not expressed in ORS 109.119 or, for that matter, in Troxel. It is a holdover requirement from Sleeper and Sleeper, 328 Or 504, 982 P2d 1126 (1999), and Hruby and Hruby, 304 Or 500, 748 P2d 57 (1987), that this court has continued to apply to the statute in order to implement the presumption required by Troxel. Perhaps the presumption could have been implemented in another way. Its circularity, as discussed above, makes it somewhat difficult to apply in the first place.\u003cspan class=\"fnref\"\u003e61\u003c/span\u003e However, for want of a preferable constitutional buttress, we have adhered to the compelling reasons test and that is the lens through which the concurrence properly has examined the record in this case.\n\nIn his dissent, Judge Edmonds appears to take the position that the statute is constitutionally deficient because \"[t]he state law standards, 'inadequate love and care' and 'undue risk of physical or psychological harm,' are by their nature subjective. Any minimally adequate parent could be found guilty of 'inadequate love and care' or of creating an 'undue risk of physical or psychological harm.'\" ___ Or App at ___ (Edmonds, J., dissenting) (slip op at 29-30). I respectfully disagree. Those standards, found in ORS 109.119(4)(b)(A) and (C), may be imprecise, but they are not any more subjective than the factors that courts regularly apply in any custody determination. In fact, they effectuate the children's constitutionally grounded protective rights. Moreover, the parental shortcomings covered by those factors must be compelling in order to justify an award of custody to a non-parent; they cannot be trifling or insignificant.\u003cspan class=\"fnref\"\u003e62\u003c/span\u003e\n\nAccordingly, the question reduces to whether the record here shows compelling reasons to find that grandparents have rebutted the presumption and, if so, that the children's best interests will be served by an award of custody to grandparents. As the issues are framed in this case, that determination requires consideration of both the children's associational rights, ORS 109.119(4)(b)(B), and their rights to protection from harm, ORS 109.119(4)(b)(A) and (C).\n\nThe evidence shows that the children have a very close relationship with grandparents. Gary MacKendrick, who had provided psychological services to the children after their parents' separation and dissolution, opined that grandparents had \"always been the basis of consistency and nurturance to both of these children.\" The custody evaluator, Dr. Charlene Sabin, also concluded that the relationship between the children and grandparents was the more stable and nurturing. However, the evidence also shows that the children are very close to mother and their siblings who live in her home. In fact, Sabin testified that there was no \"differential attachment\" between the children and the two families. The record, then, leaves the impression that, although the children would be better off, from a \"best interests\" standpoint, in grandparents' custody, they are equally attached to both families.\u003cspan class=\"fnref\"\u003e63\u003c/span\u003e\n\nAs pertinent to the children's rights to protection, the evidence shows that mother has been insensitive to the children's emotional needs. However, much of the evidence to that effect involves conduct relating, directly or indirectly, to the death of the children's father and the present custody dispute. Although that evidence is troubling, I do not weigh it as heavily in the balance as I would if it involved less stressful circumstances. It is also true that the children's physical circumstances while in mother's care were not optimal. In that regard, the evidence concerning A's tooth decay is a cause for concern, but it does not necessarily suggest serious neglect on mother's part. In sum, although much of the evidence does not flatter mother, the overall quality of her parenting is no worse than that of thousands of Oregonians who struggle with their own limitations but ultimately succeed, without state intervention, in raising their children safely.\n\nIn my view, the evidence pertaining to the factors described in ORS 109.119(4)(A), (B), and (C) does not furnish one or more compelling reasons to award custody of the children to grandparents. It follows that grandparents have not rebutted the presumption, for custody purposes, that mother will act in the children's best interests.\n\nAccordingly, I respectfully dissent.\n\nLandau, J., joins in this dissenting opinion.\n\nSCHUMAN, J., dissenting.\n\nI agree with the concurrence that our recent cases interpreting Troxel v. Granville, 530 US 57, 120 S Ct 2054, 147 L Ed 2d 49 (2000), stand for the proposition that the state violates the Due Process Clause if it permits interference by a non-parent with a parent's right to the care, custody or control of his or her child unless the non-parent can establish by a preponderance of the evidence that the parent cannot or will not provide adequate love and care for the child or that state interference is necessary to avoid an undue risk of physical or psychological harm to the child.\n\nHowever, the harm that can justify abridging the parental right must be far, far more serious than what has been demonstrated here. In that respect, I agree with Judge Edmonds's able dissent. I do not fully subscribe to that dissent only because of the rule that Judge Edmonds uses to reach his conclusion--the \"fundamental right,\" \"compelling state interest\" rule familiar from federal Fourteenth Amendment law. The number of cases in which the United States Supreme Court has held that government action survives this level of heightened review can probably be counted on the fingers of two hands. Thus, under Judge Edmonds's standard, the line between tolerable and intolerable parenting is predestined to fall in such a way as to make the parental presumption virtually irrebuttable. That could not be what the Troxel plurality intended.\n\nI also agree with Judge Brewer that the resolution of cases involving disputes between parents and third parties requires a more sensitive evaluation of the child's interest than Troxel appears to acknowledge. I do not join Judge Brewer's dissent only because I see no need to label the child's interest as a free-standing fundamental substantive due process right instead of an interest protected by the state as parens patriae.\n\nArmstrong, J., joins in this dissenting opinion.\n\n\u003cspan class=\"fn\"\u003e1. . Mother was also ordered to pay child support; however, according to mother, she had been in arrears and a default judgment had been entered against her.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. . As we explained on reconsideration in O'Donnell-Lamont, \"[w]e based that holding on the version of Oregon Laws 2001, chapter 873, section 3 * * * that appears in the 2001 edition of the Oregon Revised Statutes. That provision, as Legislative Counsel compiled it in the published statutes immediately after ORS 109.119, reads: \"'The amendments to ORS 109.119 by section 1 of this 2001 Act apply to petitions filed under ORS 109.119 or 109.121 (1999 Edition) before, on or after the effective date of this 2001 Act [July 31, 2001].'\" 187 Or App at 17 (emphasis in O'Donnell-Lamont; second set of brackets in original).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. . In Austin and Austin, 185 Or App 720, 726, 62 P3d 413 (2003), we applied ORS 109.119 (2001). In Austin, the stepfather rebutted the statutory presumption in favor of a legal parent because the evidence showed that the \"mother has been and will be unable to adequately care for [the child] and that, as a result, [the child's] physical well-being has been jeopardized\" and because the stepfather had been awarded custody of his and mother's biological sons and his stepson had a close relationship with his brothers. 185 Or App at 728. However, in that case, we also noted that the parent \"does not contend that the 2001 version of the statute is inconsistent with the constitutional requirements imposed by Troxel. Accordingly, we do not consider that issue.\" Austin, 185 Or App at 727 n 1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. . \"'Grandparent' means the legal parent of the child's legal parent.\" ORS 109.119(8)(c).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. \"'Legal parent' means a parent as defined in ORS 419A.004 whose rights have not been terminated under ORS 419B.500 to 419B.524.\" ORS 109.119(8)(d). Under ORS 419A.004(17), parent includes \"the biological * * * mother of the child[.]\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. . ORS 109.119(2)(c) contemplates the modification of an award of custody under the statute. In Lear v. Lear, 124 Or App 524, 527, 863 P2d 482 (1993), we reasoned that the court could modify an award of permanent custody that had been granted under a prior version of ORS 109.119 even though the statute did not include an express procedure or standard for modification.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. . ORS 109.119(8)(a) provides, in part: \"'Child-parent relationship' means a relationship that exists or did exist, in whole or in part, within the six months preceding the filing of an action under this section, and in which relationship a person having physical custody of a child or residing in the same household as the child supplied, or otherwise made available to the child, food, clothing, shelter and incidental necessaries and provided the child with necessary care, education and discipline, and which relationship continued on a day-to-day basis, through interaction, companionship, interplay and mutuality, that fulfilled the child's psychological needs for a parent as well as the child's physical needs.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. . \"'Circumstances detrimental to the child' includes but is not limited to circumstances that may cause psychological, emotional or physical harm to a child.\" ORS 109.119(8)(b).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. . Sabin viewed the information gathered for the May 2000 report as being consistent with her earlier recommendations.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. . At trial, MacKendrick was asked to describe the issues that concerned him about mother and the children. He responded that he was concerned that answering that question might violate mother's confidentiality. Mother's attorney indicated that mother was not waiving any privilege. Consequently, the trial court told MacKendrick not to answer that question if it involved violating a privilege.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. . Sabin noted that mother's limitations in functioning are based, in part, on her past experiences: \"[Mother and Ordway] are clearly functioning as well as they can, under much external and internal stress. Their limitations in functioning are not entirely of their own making, having arisen out of their past history, but nevertheless the Winczewski children should not have to be part of this ongoing generational dysfunction since there are alternatives available for them.\" With regard to her past history, mother testified that her father died when she was nine and that she may have unresolved grief issues. Additionally, Sabin testified that she had received information that mother had been sexually abused as a child.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. . The text of the following letter was included in Sabin's report: \"Dear [J] \"Daddy Paul and Mommy Eileen celebrate that fact that we are a family of 5 gifted human beings. \"Daddy Paul and Mommy Eileen celebrate the fact that the judge recognized the bonds between you, sister [A], brother [C], Mommy Eileen, Daddy Paul, and Daddy Steve. \"Daddy Paul and Mommy Eileen recognize the fact that Daddy Steve's personal choices have made it easier for him to develop disease with nobody to blame.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. . The text of the following letter was included in Sabin's report: \"Dated December 9, 1998 \"Dear [A], \"Mommy and Daddy Paul are blessed to have a family unit free from the emotional and physical impacts of living with someone who has a chronic and disabling disease. \"Love, Mommy, Daddy Paul, (rest of names not readable)\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. . The text of the following letters was included in Sabin's report: \"Dated February 9, 1999 \"Dear [A] \"The grief from being blamed by my own biologic family members for the inappropriate behaviors of another has healed. \"Love, Mommy, Daddy Paul, [J], [C], and [L]. \"* * * * * \"Dated December 12, 1998 \"Dear [A], \"The grief from watching my father minimize his poor health and the emotional and physical impacts on his family unit has healed. \"Love, Mommy, Daddy Paul, [J], [C] (last line not readable due to copying).\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. . The text of the following letter was included in Sabin's report: \"[J]: \"Daddy Paul and I celebrate the fact that we are a family of 5 unique and gifted human beings full of life. \"It is illegal for grandma Barbara and grandpa Oliver to state lies about me to other people. \"It is illegal for grandma Barbara and grandpa Oliver to state in any way that they have rights to make decisions pertaining to you and [A]. (The letter is signed Mommy, Daddy Paul, Sister [J], and sister [A] and Brother [C])[.]\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. . A was born in 1990 and was only eight years old when some of the letters were dated. J was born in 1992.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. . Sabin also testified that, \"when the children were brought to my office the first couple times by the Ordway parents, they had dirty hair or uncombed hair, and their clothing * * * didn't look like a grownup had helped them choose it. * * * The last time they came, a few weeks ago, it was different than that, except that their hair was still dirty, but their clothes were more together.\" Sabin testified that poor hygiene is \"related to how other children deal with [A and J]\" and that she thinks \"sometimes cleanliness, hygiene and appearance are also metaphors for nurturance[.]\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. . Mother testified that she had read a \"fact sheet\" about Paxil indicating that its safety and effectiveness had not been established in the pediatric population.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. . Sabin thought each child had a separate blanket.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. . We note that, in a letter to Sabin in April 2000, mother wrote, in part, that it took the children being out of grandparents' care so that \"Paul and I could make sure [the relative] was supervised by us when he is around our children in our home.\" (Emphasis added.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. . In her 1999 report, Sabin also noted that, \"[i]n her family with her mother, [A] acts as a parentified child. She has some identity in taking care of younger children. This is not a healthy identity. The times I saw her acting parental she was actually filling a need in the family regarding the caretaking of the younger children, as well as feeling that she was getting more attention for doing so.\" (Emphasis added.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. . According to MacKendrick, weight gain had not been an issue for A and that \"[s]he'd been rather consistent, but this was somewhat alarming because it was a considerable gain of weight, and children will eat, will have food issues, when they feel anxious or when they feel life is out of control, to try to soothe or calm themselves in some way when they can do it no other way.\" By January 2000, MacKendrick reported that A \"was not as overweight.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. . According to MacKendrick, J's response suggested a \"[r]esponse to loss. She was at that critical age where abandonment, separation anxiety, fears rise up fairly significantly for a child her age. * * * I felt that she was simply removing herself from a situation that she had trouble adjusting to.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. . A few of the absences occurred immediately after father's death. J was absent from school April 19 through April 21 before mother took the children to live with her.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. . In Wooden, we reasoned: \"[W]hile a biological father does not have parental rights automatically and for that reason only, even a relatively uninvolved parent may, by virtue of his conduct, avoid losing them. Lehr[ v. Robertson, 463 US 248, 103 S Ct 2985, 77 L Ed 2d 614 (1983),] speaks of the father's opportunity to 'develop a relationship with his offspring' and declares that he may be entitled to assert parental rights '[i]f he grasps that opportunity and accepts some measure of responsibility for the child's future.' 463 US at 262.\" 184 Or App at 549-50 (third set of brackets in Wooden).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. . The Troxel plurality stated: \"[W]e do not consider the primary constitutional question passed on by the Washington Supreme Court--whether the Due Process Clause requires all nonparental visitation statutes to include a showing of harm or potential harm to the child as a condition precedent to granting visitation. We do not, and need not, define today the precise scope of the parental due process right in the visitation context. In this respect, we agree with JUSTICE KENNEDY that the constitutionality of any standard for awarding visitation turns on the specific manner in which that standard is applied and that the constitutional protections in this area are best elaborated with care. Because much state-court adjudication in this context occurs on a case-by-case basis, we would be hesitant to hold that specific nonparental visitation statutes violate the Due Process Clause as a per se matter.\" 530 US at 73 (O'Connor, J., plurality opinion) (internal quotation marks and citations omitted). Thus, the Court did not determine whether the Due Process Clause requires a showing of harm or potential harm.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. . In our original opinion in Lauffenberger, we applied the \"best interests of the child\" standard and affirmed the trial court's award of custody to the nonparents because the nonparents had provided a stable home and the parent had not demonstrated his commitment to providing a stable home. State ex rel Juv. Dept. v. Lauffenberger, 88 Or App 642, 746 P2d 259 (1987), adh'd to on recons, 93 Or App 757, 764 P2d 568 (1988), rev'd, 308 Or 159, 777 P2d 954 (1989). On reconsideration, a majority adhered to our former opinion, holding that the \"best interests of the child\" standard applied rather than the Hruby standard. Two members of the court concurred, asserting that, even if Hruby applied, the parent's \"lack of commitment to or interest in his child's well being for a substantial period constitutes a compelling reason not to give custody to him.\" Lauffenberger, 93 Or App at 765-66 (Deits, J., concurring). According to the concurrence, \"[t]he dissent errs in its application of the Hruby standard by deciding that, because the father in this case is presently 'fit,' there is no compelling reason not to award him custody. Parental fitness, however, is not the appropriate standard.\" Lauffenberger, 93 Or App at 766 n 3 (Deits, J., concurring). Four members of the court dissented, asserting that Hruby applied and that the parent should receive custody because the court found him to be \"fit\" and did not find that \"the child would not receive adequate care or love from father or would be unduly harmed by placement with him.\" Lauffenberger, 93 Or App at 770 (Newman, J., dissenting).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. . The court reasoned, in part: \"Deciding the case before Hruby, the court made no specific findings with respect to potential harm from parental custody that Hruby called for in ordinary private custody disputes nor with respect to any other factors that might play a role under the juvenile court statute. The Court of Appeals panel originally affirmed the order on de novo review before this court's opinion in Hruby, and two of the six-member majority in banc stated that they would affirm if Hruby's standards were applicable.\" Lauffenberger, 308 Or at 167-68. The court also noted that \"objections to discontinuity standing alone[, which served as the basis of our original decision,] d[id] not override the preference for parental custody.\" Id. at 168.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. . As we explained, \"[m]other suffered from arrhythmia, a heart irregularity. People who knew mother, including child, were aware of her condition. One Saturday morning, when stepfather was away from the home, child and her [half-sister] got into a quarrel about the toilet tissue not being on the roll. Mother became angry and commented that her heart had gotten out of rhythm. Shortly after, child heard her mother stumble and make a noise. Child called out to her mother, and, when her mother did not respond, child went to see what was happening. Child discovered her mother in a condition of 'virtual death.' Child tried to phone her stepfather, and, when he did not answer his cellular phone, child called a friend who, in turn, called 9-1-1. Before the ambulance arrived, child tried unsuccessfully to keep her sister from seeing her mother. Responders at 9-1-1 called child and asked if she wanted to try CPR but child did not, later telling her counselor that she was afraid she would not do the right thing. Mother was taken to the hospital but had suffered kidney failure and died early the next morning.\" Fenimore, 145 Or App at 504 (footnotes omitted). The child's counselor explained the impact of those circumstances on the child: \"'One of the problems is that [the child] was the only person there to take action. A second problem was that she had every reason to believe that she must have caused this because she had a quarrel with her little sister about the toilet paper. Another reason is that she called other people instead of [9-1-1] first. Another reason is that they offered her the opportunity to do CPR and she declined. I mean, if she had tried it and her mother had died anyhow, which she would have, she could say at least I tried, but now she can't even say that.'\" Id. at 508.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. . In Wilson, we reiterated our conclusion that ORS 109.119 (1997), as construed in Harrington, did not violate the fundamental constitutional right identified in Troxel. As we noted in Wilson, in our decision in Harrington, we \"salvag[ed] the constitutionality of the statute by integrating Troxel\" into the interpretation of the statute. Wilson, 184 Or App at 218. Thereafter, in Strome, we stated: \"The issue is whether grandmother has proved by a preponderance of the evidence that father cannot or will not provide adequate love and care for the children or that placement of them in his custody will cause an undue risk of physical or psychological harm to them. Encompassed within that burden of proof is a statutory and constitutional presumption in favor of father that grandmother must overcome.\" 185 Or App at 527. Thus, we have determined that it is constitutionally adequate to rebut the presumption in favor of the parent by a preponderance of the evidence. I continue to adhere to that understanding.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. . We do not decide whether the constitutional standard is coextensive with ORS 109.119(4)(b)(A), providing that \"[t]he legal parent is unwilling or unable to care adequately for the child[,]\" and ORS 109.119(4)(b)(C), providing that \"[c]ircumstances detrimental to the child exist if relief is denied[.]\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. . Although Judge Edmonds would require that nonparents demonstrate a clear and undue risk, that is not the standard that we have described in our recent custody cases. See ___ Or App at ___ (Edmonds, J., dissenting) (slip op at 37).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. . No other justice joined in Justice Thomas's concurrence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. . Judge Edmonds asserts that \"[i]t was not necessary in Harrington to address that issue, and the concurrence reads too much into our language in that case. Our statement in Harrington, which the concurrence now characterizes as an express rejection of Justice Thomas's view, merely communicated our view of a continuum on which the plurality and the two concurring opinions could be said to rest with regard to varying factual circumstances that might be presented to a court.\" ___ Or App at ___ (Edmonds, J., dissenting) (slip op at 10) (emphasis in original). However, when our reasoning in Harrington is read in context, it is evident that we concluded that we would not apply the standard articulated by Justice Thomas: \"Justice Thomas, after noting that neither party challenged the concept of substantive due process, agreed that the recognition of a fundamental right of parents to direct the upbringing of their children resolved the case. Because he would have held that fundamental rights are subject to strict scrutiny, and because the state lacked even a legitimate governmental interest--let alone a compelling one--to second-guess a fit parent's decision regarding visitation, he joined in affirming the judgment. [Troxel, 530 US] at 80 (Thomas, J., concurring [in the judgment]). \"It appears that Justice Souter would have imposed fewer restrictions on the court's authority to award visitation than would have the plurality, while Justice Thomas would have made such an award much more difficult. We conclude that the plurality opinion gives the best guidance on the effect of the constitution in this situation. That opinion emphasizes that a parent's decision on visitation is entitled to significant weight, but it does not describe precisely the extent to which it will control. It left that issue for development on a case-by-case basis.\" Harrington, 172 Or App at 197 (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. . In particular, Judge Edmonds reasons that the term \"compelling state interest\" is equivalent to the term \"minimal adequacy,\" which he has defined, for purposes of his opinion, as \"the constitutional line between the right of a parent to raise his or her own child and a compelling state interest that permits a child to be removed from the custody of his or her parent by the state in the exercise of its parens patriae function.\" ___ Or App at ___ n 17 (Edmonds, J., dissenting) (slip op at 26 n 17). According to Judge Edmonds, \"the constitutional standard of minimal parental adequacy also finds implicit expression in the requirements of Oregon statutes that permit the state to take permanent custody of a parent's child when the child's welfare is at stake.\" ___ Or App at ___ (Edmonds, J., dissenting) (slip op at 13). According to Judge Edmonds, \"for purposes of the Due Process Clause, there can be no substantive difference between the federal 'compelling state interest' standard and the Hruby 'compelling reason' standard. No matter how the state standard is phrased or characterized, it must satisfy the federal constitution before the state may constitutionally interfere with a parent's rights involving his or her children. Although a 'compelling reason' need not be identical to the standards set forth in the termination statutes, it must embody circumstances that present similarly grave risks of harm to a child's welfare either because of a parent's unfitness or because of the physical or psychological needs of the child. The termination statutes illustrate the kinds of risks that authorize state intervention and therefore are helpful in understanding the scope of parental due process in the context of a custody award to a third party. Ultimately, it is that federal standard of minimal adequacy that must be met before a parent can lawfully be deprived of his or her fundamental right by an award of custody to a third party.\" ___ Or App at ___ (Edmonds, J., dissenting) (emphasis in original) (slip op at 25).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. . Judge Edmonds equates the \"compelling state interest\" standard with the one necessary to terminate a parent's parental rights because, \"[f]or all practical purposes, an award of custody to a non-parent under ORS 109.119 operates as a final, nontemporary deprivation of the fundamental right of the parent to raise his or her children, similar in effect to the termination of parental rights or an order of permanent guardianship.\" ___ Or App at ___ n 9 (Edmonds, J., dissenting) (slip op at 14 n 9). However a parent's parental rights are not terminated by an award of custody to a non-parent, and the parent may be allowed to continue to participate significantly in the child's life. Further, an award of custody may be modified. See ___ Or App at ___ n 6 (slip op at 9 n 6). Additionally, citing to our original opinion in O'Donnell-Lamont and our opinions in Strome, Wilson, and Newton, Judge Edmonds indicates that we \"understood that the rule of law governing those cases implicitly embodied the requirements of the Due Process Clause; the unfitness to parent or an undue risk of physical or psychological harm are the kinds of circumstances that evidence a compelling state interest that permits a state court to constitutionally deprive a parent of child custody in favor of a third party.\" ___ Or App at ___ (Edmonds, J., dissenting) (slip op at 15). Judge Edmonds appears to rely on those opinions for the proposition that the standard that we articulated is equivalent to the standard necessary to terminate a parent's parental rights. See ___ Or App at ___ (Edmonds, J., dissenting) (slip op at 13-15). However, in those cases, we simply did not equate the standard that we articulated with the standard necessary to terminate a parent's parental rights.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. . Even Judge Edmonds notes that \"both Hruby and Lauffenberger are helpful in understanding why the phrase 'compelling reason,' as used in those cases, necessarily embodies the federal constitutional standard.\" ___ Or App at ___ (Edmonds, J., dissenting) (slip op at 19). Additionally, Judge Edmonds reasons that Fenimore and Cerda, cases in which we applied the Hruby standard and awarded custody to nonparents, are \"decisions that implicitly incorporate due process standards.\" ___ Or App at ___ n 14 (Edmonds, J., dissenting) (slip op at 24 n 14). He distinguishes Fenimore and Cerda merely because the facts are different. However, Fenimore and Cerda are consistent with the result in this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. . One example that illustrates Judge Edmonds's approach concerns A's serious dental problems. He downplays those problems by stating that there was no obvious evidence of tooth decay. In doing so, Judge Edmonds ignores the evidence that Sabin received from A's dentists and that she relayed to the court during her testimony. The dental work on A's teeth involved more than something typical, such as the filling of a cavity, and included work that was analogous to a root canal in an adult. Both dentists agreed that it was highly unusual to have such extensive decay in such a short period. Breche attributed it to poor oral hygiene and diet. Despite mother's many excuses and attempts to blame grandparents, because this deterioration occurred while A was primarily in her mother's care, I may and do reasonably infer that this condition was due to mother's care. Finally, contrary to Judge Edmonds's repeated assertions, the outcome of this case does not depend on A's dental problems. The dental problems were simply one illustration of mother's inability to care adequately for the children and the undue risk of harm that they will suffer in her care.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. . Although Judge Edmonds purports to \"take into account\" the expert testimony, he criticizes my use of the experts' observations and findings. ___ Or App at ___ (Edmonds, J., dissenting) (slip op at 30). Specifically, he states that, \"because the concurrence evaluates the expert witness evidence under a standard that the experts themselves did not apply, it takes their testimony out of context.\" ___ Or App at ___ (Edmonds, J., dissenting) (slip op at 28). However, for reasons that I have explained, the experts' detailed findings and observations are relevant to the issues in this case and provide persuasive evidence. Additionally, in conducting her study, Sabin spoke with many other individuals who had had contact with the adults and the children, and she testified about those individuals' observations.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. . In Meyer, the Court held unconstitutional a Nebraska statute that prohibited teaching a language other than English to children in school before the eighth grade. The Court reasoned that \"[t]he established doctrine is that this liberty [interest] may not be interfered with, under the guise of protecting the public interest, by legislative action which is arbitrary or without reasonable relation to some purpose within the competency of the State to effect.\" Meyer, 262 US at 399-400.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. . In Prince, the Court upheld the constitutionality of a statute that prohibited children of certain ages from selling or offering for sale newspapers on streets and other public places. The Court reasoned that the state's interest in combating the \"crippling effects of child employment, * * * especially in public places, and the possible harms arising from activities subject to all diverse influences of the street\" was sufficiently compelling to overcome the interest of parents in directing the upbringing of their children. Prince, 321 US at 168 (footnotes omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. . In Quilloin, as well as in Stanley v. Illinois, 405 US 645, 92 S Ct 1208, 31 L Ed 2d 551 (1972), the Court addressed the procedural rights of unwed fathers regarding adoption of their children. It observed in Stanley: \"The Court has frequently emphasized the importance of the family. The rights to conceive and to raise one's children have been deemed 'essential,' [and] 'basic civil rights of man,' * * *. The integrity of the family unit has found protection in the Due Process Clause of the Fourteenth Amendment, the Equal Protection Clause of the Fourteenth Amendment, and the Ninth Amendment.\" 405 US at 651 (citations omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. . Pierce, along with Meyer, are the seminal cases on this issue. In Pierce, the Court, in articulating the fundamental interest of parents to direct the upbringing of their children, held an Oregon statute that prohibited children from attending private schools unconstitutional in violation of the Fourteenth Amendment. 268 US at 534-35. After Pierce, several cases have reaffirmed the right of parents to direct the education of their children. Among those cases are West Virginia State Board of Education v. Barnette, 319 US 624, 63 S Ct 1178, 87 L Ed 1628 (1943) (holding unconstitutional a state statute requiring children to recite the Pledge of Allegiance in school over their parents' objection), and Wisconsin v. Yoder, 406 US 205, 92 S Ct 1526, 32 L Ed 2d 15 (1972) (holding a statute unconstitutional that required parents to keep their children in school until the age of 16). The Yoder Court explained, \"The history and culture of Western civilization reflect a strong tradition of parental concern for the nurture and upbringing of their children. This primary role of the parents in the upbringing of their children is now established beyond debate as an enduring American tradition.\" 406 US at 232.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. . In Flores, a class of alien juveniles arrested and held in custody pending deportation hearings argued, among other things, that substantive due process required that they be released into the custody of \"responsible adults\" while awaiting hearings. 507 US at 294. The Court held that the juveniles' fundamental rights were not implicated by the type of detention that occurred in that case. Id. at 302-03.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. . All three opinions cite Pierce. Troxel, 530 US at 65 (O'Connor, J., plurality opinion); id. at 77 (Souter J., concurring in the judgment); id. at 80 (Thomas J., concurring in the judgment). Both the plurality and Justice Souter cite Meyer. Id. at 65 (O'Connor, J., plurality opinion); id. at 77 (Souter, J., concurring in the judgment).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. . I can find no United States Supreme Court case law that suggests that there is a meaningful nuance in constitutional law between applying a \"strict scrutiny\" standard of review to a state regulation and discerning when a compelling state interest exists because of the heightened protection afforded to a fundamental liberty interest.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. . The opinions of the court in this case disagree about how to articulate the proper due process standard. According to the concurrence, the due process standard that I propose requires \"strict scrutiny.\" That characterization appears to be the \"lightning rod\" for its disagreements with my result and the source of the reluctance of the other dissents to agree with me regarding the applicable legal standard. The \"strict scrutiny\" characterization becomes the vehicle employed by the concurring opinion to label my view of the due process as a view not endorsed by a majority of the justices in Troxel in an effort to isolate it along with the view of Justice Thomas. I take exception to being credited for a view that is not necessary to my analysis. Such a tactic is reminiscent of \"false premise\" or \"straw man\" arguments for which we criticize lawyers when those arguments are made to us. I do not know how to explain more clearly than I already have that whatever the words used to describe the applicable due process standard--\"strict scrutiny, compelling state interest,\" \"compelling reasons,\" or \"minimal parental adequacy,\" the legal consequence of the facts in this case do not satisfy due process. Moreover, I do not know how to more accurately describe the holding of Troxel than to use the language of the opinions on which its reasoning relies. The reality is that some description of the applicable due process standard is necessary for analytical purposes. In an effort to describe that standard, I am content to say that the grandparents must demonstrate a compelling state interest before the constitution permits them to use state-sanctioned intervention as a vehicle to deprive mother of her fundamental liberty interest in parenting her children.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. . The circumstances outlined by the termination and juvenile court jurisdiction statutes provide clear, concrete, and nonexclusive examples of compelling circumstances and stand in stark contrast to the circumstances present in this case. The comparison of the effect of an award of custody to a non-parent under ORS 109.119 with the effect of the termination of parental rights is apt because of the consequences to the natural rights of a parent. For all practical purposes, an award of custody to a non-parent under ORS 109.119 operates as a final, nontemporary deprivation of the fundamental right of the parent to raise his or her children, similar in effect to the termination of parental rights or an order of permanent guardianship. The concurrence's unwillingness to acknowledge this comparison for purposes of an application of a federal constitutional minimal requirement for state interference with parental rights is puzzling. See, e.g., ___ Or App at ___ (Deits, C. J., concurring) (slip op at 54 n 36). No matter the statutory context, the constitutional standard applies across the board as a protection against unconstitutional state interference with child custody, and the task should be to merely identify whether the circumstances relied on satisfy that requirement.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. . I note also that, along with the substantive requirement on the state to show a compelling state interest in order to afford due process to mother, there is also a procedural due process component that may apply in cases like this one. In Santosky v. Kramer, 455 US 745, 753-54, 102 S Ct 1388, 71 L Ed 2d 599 (1982), the Court explained: \"The fundamental liberty interest of natural parents in the care, custody, and management of their child does not evaporate simply because they have not been model parents or have lost temporary custody of their child to the State. Even when blood relationships are strained, parents retain a vital interest in preventing the irretrievable destruction of their family life. If anything, persons faced with forced dissolution of their parental rights have a more critical need for procedural protections than do those resisting state intervention into ongoing family affairs. When the State moves to destroy weakened familial bonds, it must provide the parents with fundamentally fair procedures. \" (Footnote omitted.) The Santosky Court observed that, when the individual interests at stake in a state proceeding are both particularly important and more substantial than mere loss of money, the balance is struck in favor of the private interest by the imposition of heightened procedural protections. 455 US at 761. Consequently, it held that the use of a \"preponderance of the evidence\" standard in termination of parental rights cases violated due process and that at least a \"clear and convincing standard\" was constitutionally required because of the natural parent's fundamental interest in the custody of his or her children. Id. at 768-70. A standard of proof operates, within the concept of due process, to \"instruct the factfinder concerning the degree of confidence our society thinks he should have in the correctness of factual conclusions for a particular type of adjudication.\" Addington v. Texas, 441 US 418, 423, 99 S Ct 1804, 60 L Ed 2d 323 (1979) (quoting In re Winship, 397 US 358, 370, 90 S Ct 1068, 25 L Ed 2d 368 (1970) (Harlan J., concurring)) (internal quotation marks omitted). \"Clear and convincing\" evidence is evidence that makes the truth of the asserted fact \"highly probable.\" Riley Hill General Contractor v. Tandy Corp., 303 Or 390, 402, 737 P2d 595 (1987). Curiously, ORS 109.119(3)(a) provides for a \"preponderance of the evidence\" burden of proof in custody cases. In contrast, ORS 109.119(3)(b) and (6)(b)(B), regarding visitation rights and intervention by grandparents, provide for a \"clear and convincing\" standard. In light of the Court's decision in Santosky, and because the effect of depriving a parent of custody in favor of a third party is similar to the consequences of the termination of parental rights at issue in that case, procedural due process may require a \"clear and convincing\" standard of proof to be applied in cases like the one at issue. However, that question need not be resolved in this case because it is well settled that, for the state to interfere with a fundamental right, there must be compelling circumstances, and no such circumstances are present here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. . In Sleeper and Sleeper, 328 Or 504, 510-11, 982 P2d 1126 (1999), the Supreme Court recognized that the Hruby \"compelling reason\" standard was based on the version of ORS 109.119 under which Hruby was decided.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. . See also Sleeper, 328 Or at 511 (recognizing that, in some circumstances, giving custody to non-parent rather than parent might violate a \"supervening right belonging to the biological parent\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. . Quoting from Santosky, 455 US at 753, Judge Newman, writing for the dissent, observed that \"[t]he fundamental liberty interest of natural parents in the care, custody, and management of their child does not evaporate simply because they have not been model parents[.]\" Lauffenberger, 93 Or App at 768 (Newman, J., dissenting).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. . The concurrence also cites Fenimore v. Smith, 145 Or App 501, 930 P2d 892 (1996), rev den, 326 Or 389 (1998), and Cerda and Cerda, 136 Or App 104, 901 P2d 263 (1995), rev den, 322 Or 598 (1996), to support its application of a legal standard less onerous than the constitutional \"compelling state interest\" standard. ___ Or App at ___ (Deits, C. J., concurring) (slip op at 45-48). In Fenimore, the court emphasized that custody could be awarded to a non-parent over a parent where a child would be \"unduly harmed, physically or psychologically, by giving custody to the natural parent.\" 145 Or App at 509 (emphasis and internal quotation marks omitted). An expert witness testified in that case that his \"opinion [was] very clear and very emphatic that it would be a very great risk for [child] to be relocated in any other home than [stepfather's] home at [that] time.\" Id. at 510. Thus, the court determined that the Hruby compelling reasons test was met. In Cerda, the children had lived with their grandparents for most of their lives. The father had a history of drug abuse and violence. Further, an expert testified that changing custody of the children from the grandparents to father would \"cause them to regress emotionally, academically and socially.\" Cerda, 136 Or App at 110. The court held that, under the circumstances, the children \"would be unduly harmed by changing their custody to father[.]\" Id. Aside from being decided on the basis of facts that are not present in this case, both Fenimore and Cerda reflect decisions that implicitly incorporate due process standards.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. . What I would require in this case if I were writing for the concurrence is nothing more than compliance with federal constitutional requirements. Nonetheless, the concurrence asserts that, under my analysis, courts would be required to award custody to parents when \"the child would suffer harm in the parent's custody,\" ___ Or App at ___ (Deits, C. J., concurring) (slip op at 56), and that I \"apparently would require a non-parent to produce an express statement from an expert that, in the future, the parent in fact and definitely cannot provide adequate care and love to the children or that the children in fact and definitely will be harmed in the parent's custody,\" ___Or App at ___ (Deits, C. J., concurring) (slip op at 59) (emphasis in original). The concurrence can ascribe whatever \"parade of horribles\" it wishes to my reasoning. My desire is to do nothing more than be faithful to the constitution.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. . Admittedly, the concurrence's factual recitation is much lengthier than what follows. However, my effort has been to search the record for facts that could have constitutional implications and isolate them for purposes of scrutiny under due process standards.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. . In the context of this opinion, I have used the term \"minimally adequate\" for descriptive purposes in an effort to articulate the constitutional line between the right of a parent to raise his or her own child and a compelling state interest that permits a child to be removed from the custody of his or her parent by the state in the exercise of its parens patriae function. See e.g., Flores, 507 US at 304. The determination of whether particular circumstances rise to the level of demonstrating a compelling state interest necessarily will always be fact-specific. Thus, my conclusion that a compelling state interest is not present here is necessarily limited to the facts of this case, contrary to the speculations of the concurrence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57. . In his dissent, Judge Brewer responds to my comments regarding the subjective nature of the statutory standards by stating, based on those standards, that I \"appear[]\" to believe that the statute cannot be constitutionally applied. ___ Or App at ____ (Brewer, J., dissenting) (slip op at 14). As I have previously indicated and the above discussion so states, Judge Brewer's assumption is incorrect. The statutory standards can be constitutionally applied, so long as the statutory standards of \"inadequate love and care\" and \"undue risk of physical or psychological harm\" are understood to encompass the need to satisfy a due process (or in my view, a compelling state interest) standard.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58. . Nor are we \"physicians, psychologists, or therapists\" as the concurrence concedes. ___ Or App at ___ (Deits, C. J., concurring) (slip op at 13). It is difficult to understand how the concurrence could find the testimony of the experts, who based their opinions on an incorrect legal standard, \"helpful and persuasive,\" id., without assuming one of the above roles and drawing its own \"expert\" witness opinion from the \"facts\" testified to by the experts.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59. . See Troxel, 530 US at 66 (O'Connor, J., plurality opinion); id. at 77 (Souter, J., concurring in the judgment); id. at 80 (Thomas, J., concurring in the judgment); id. at 86-87 (Stevens, J., dissenting); id. at 95 (Kennedy, J., dissenting). Justice Scalia alone concluded that court-ordered visitation burdened no fundamental right of parents. See id. at 92 (Scalia, J., dissenting).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e60. . I include the four-member plurality and Justices Stevens, Kennedy, and Souter. See id. at 68-69 (O'Connor, J., plurality opinion); id. at 77-78, 78 n 2 (Souter, J., concurring in the judgment); id. at 86, 89-90 (Stevens, J., dissenting); id. at 98 (Kennedy, J., dissenting).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e61. . The circularity of the Troxel standard, discussed above, apparently led the legislature to adopt identical factors for consideration by the court in determining whether the presumption has been rebutted and, if so, whether the child's best interests would be served by an award of custody to the non-parent contestant.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e62. . Judge Edmonds's dissent also suggests that the statute erroneously prescribes a preponderance, rather than a clear and convincing evidentiary standard, for rebuttal of the statutory presumption. ___ Or App at ___ n 10 (Edmonds, J., dissenting) (slip op at 15 n 10). There is support for that proposition. See, e.g., In re Marriage of Harris, 92 Cal App 4th 499 (2001), rev allowed, 115 Cal Rptr 2d 191 (2002) (holding that, because the constitutional right of parents to care for their children as they see fit is afforded more protection than the statutory right to visitation of grandparents, it is appropriate to require the higher evidentiary standard of clear and convincing evidence under California's non-parent visitation statute); Greer v. Alexander, 248 Mich App 259, 639 NW2d 39 (2001), rev den, 465 Mich 971 (2002) (same). However, as the concurrence points out, we appear to have assumed that the preponderance standard is constitutionally sufficient. I believe that we were right to do so. A clear and convincing evidence standard arguably would be redundant to the underlying requirement that compelling reasons support rebuttal of the presumption that a fit parent will act in his or her child's best interests. More substantively, as discussed, children have important constitutional rights in actions under ORS 109.119 that must be weighed in the balance. To the extent that a heightened burden of proof would add a further barrier to non-parent custody or parenting time where a child-parent relationship exists, it would further skew the delicate balance of family interests toward the parent and away from the child.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e63. . I do not mean to suggest that \"attachment to the parent is the most significant issue in custody cases between a parent and non-parent.\" See ___ Or App at ___ (Deits, C. J., concurring) (slip op at 60). Rather, I part company with the concurrence's determination that the record shows compelling reasons, as opposed to a \"best interests\" basis, for an award of custody to grandparents.\u003c/span\u003e\n\n",
    "body_length": 228361,
    "citedas": [
      "72 P.3d 1012",
      "188 Or.App. 667"
    ],
    "attorneys": "Carol E. Jones argued the cause and filed the brief for appellant. Darcia Krause argued the cause and filed the briefs for respondents.",
    "category": [
      "158",
      "243",
      "36",
      "75"
    ],
    "judges": "Before Deits, Chief Judge, and Edmonds, Landau, Haselton, Armstrong,Linder, Wollheim, Kistler, Brewer, and Schuman, Judges.",
    "citation_count": 2
  }
}
