{
  "id": "JM_pYWYBTlTomsSBpRSd",
  "document": {
    "title": "07/27/90 STATE WEST VIRGINIA v. EDWARD CHARLES L.",
    "full_title": "STATE OF WEST VIRGINIA v. EDWARD CHARLES L., SR.",
    "jurisdiction": "West Virginia Supreme Court",
    "date": "1990-07-27T00:00:00.000Z",
    "docket": "No. 19004",
    "body": "1. Evidence of other crimes, wrongs, or acts is not admissible to prove the character of a person in order to show that he acted in conformity therewith. It may, however, be admissible for other purposes, such as proof of motive, opportunity, intent, preparation, plan, knowledge, identity, or absence of mistake or accident. W.Va. R. Evid. 404(b).\n\n2. Collateral acts or crimes may be introduced in cases involving child sexual assault or sexual abuse victims to show the perpetrator had a lustful Disposition towards the victim, a lustful Disposition towards children generally, or a lustful Disposition to specific other children provided such evidence relates to incidents reasonably close in time to the incident(s) giving rise to the indictment. To the extent that this conflicts with our decision in State v. Dolin, 176 W.Va. 688, 347 S.E.2d 208 (1986), it is overruled.\n\n3. \"'Where improper evidence of a nonconstitutional nature is introduced by the State in a criminal trial, the test to determine if the error is harmless is: (1) the inadmissible evidence must be removed from the State's case and a determination made as to whether the remaining evidence is sufficient to convince impartial minds of the defendant's guilt beyond a reasonable doubt; (2) if the remaining evidence is found to be insufficient, the error is not harmless; (3) if the remaining evidence is sufficient to support the conviction, an analysis must then be made to determine whether the error had any prejudicial effect on the jury. ' Syllabus Point 2, State v. Atkins, 163 W.Va. 502, 261 S.E.2d 55 (1979), cert. denied, 445 U.S. 904, 100 S. Ct. 1081, 63 L.E.2d 320 (1980)\" Syl. Pt. 3, State v. Maynard, No. 19135 (W.Va. March 30, 1990) (quoting Syl. Pt. 6, State v. Smith, W.Va. , 358 S.E.2d 188 (1987)).\n\n4. The following [is] . . . not excluded by the hearsay rule, even though the declarant is available as a witness: . . . (4) Statements for Purposes of Medical Diagnosis or Treatment. -- Statements made for purposes of medical diagnosis or treatment and describing medical history, or past or present symptoms, pain, or sensations, or the inception or general character of the cause or external source thereof insofar as reasonably pertinent to diagnosis or treatment. W.Va. R. Evid. 803(4).\n\n5. The two-part test set for admitting hearsay statements pursuant to W.Va. R. Evid. 803(4) is (1) the declarant's motive in making the statements must be consistent with the purposes of promoting treatment, and (2) the content of the statement must be such as is reasonably relied upon by a physician in treatment or diagnosis.\n\n6. \"The language of Rule 804(b)(5) of the West Virginia Rules of Evidence and its counterpart Rule 803(24) requires that five general factors must be met in order for hearsay evidence to be admissible under the rules. First and most important is the trustworthiness of the statement, which must be equivalent to the trustworthiness underlying the specific exceptions to the hearsay rule. Second, the statements must be offered to prove the material fact. Third, the statement must be shown to be more probative in the issue for which it is offered than any other evidence that the proponent can reasonably procure. Fourth, admission of the statement must comport with the general purposes of the rules of evidence and the interest of Justice. Fifth, adequate notice of the statement must be afforded the other party to provide that party a fair opportunity to meet the evidence.\" Syl. Pt. 5, State v. Smith, W.Va. , 358 S.E.2d 188 (1987).\n\n7. Expert psychological testimony is permissible in cases involving incidents of child sexual abuse and an expert may state an opinion as to whether the child comports with the psychological and behavioral profile of a child sexual abuse victim, and may offer an opinion based on objective findings that the child has been sexually abused. Such an expert may not give an opinion as to whether he personally believes the child, nor an opinion as to whether the sexual assault was committed by the defendant, as these would improperly and prejudicially invade the province of the jury.\n\n8. \"In the determination of a claim that an accused was prejudiced by ineffective assistance of counsel violative of Article III, Section 14 of the West Virginia Constitution and the Sixth Amendment to the United States Constitution, courts should measure and compare the questioned counsel's performance by whether he exhibited the normal and customary degree of skill possessed by attorneys who are reasonably knowledgeable of criminal law, except that proved counsel error which does not affect the outcome of the case, will be regarded as harmless error.\" Syl. Pt. 19, State v. Thomas, 157 W.Va. 640, 203 S.E.2d 445 (1974).\n\n9. \"Where a counsel's performance, attacked as ineffective, arises from occurrences involving strategy, tactics and arguable courses of action, his conduct will be deemed effectively assistive of his client's interests, unless no reasonably qualified defense attorney would have so acted in the defense of an accused.\" Syl. Pt. 21, State v. Thomas, 157 W.Va. 640, 203 S.E.2d 445 (1974).\n\nThis case is before the Court upon an appeal of the conviction of Edward Charles L. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e on May 28, 1987, in Mineral County, West Virginia, of two counts of first degree sexual assault and two counts of first degree sexual abuse. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e The appellant raises four assignments of error based on the proceedings which occurred before the lower court: 1) the trial court committed plain error in permitting the state to make references to unrelated sexual acts and tendencies of the appellant; 2) the trial court committed plain error in allowing the state to elicit secondhand accounts of the sexual offenses which constituted hearsay evidence; 3) the uncorroborated testimony of the child victims was inherently incredible and does not sustain the guilty verdicts; and 4) the appellant was denied effective assistance of counsel. We find that the lower court committed no reversible error in the proceedings and affirm the appellant's convictions.\n\nThe appellant was married to Sharon L. from October 1977 until July 1984. The couple had three children, twins, a boy and girl named C. L. and S. L. respectively, born on August 7, 1979, and another son D. L., born on September 4, 1983. When the events surrounding this case occurred in the fall of 1983, the family was living together in Mineral County, West Virginia. Mrs. L. would attend meetings of the Fountain Volunteer Firemen's Auxiliary or visit a neighbor while leaving the children in the care of her husband, the appellant. The twins were four-years-old when the alleged crimes against them occurred.\n\nOn occasions when Mrs. L. was not at home, C. L.'s testimony revealed that the appellant took him into a bedroom, took his clothes off, made the child lie on his stomach and then inserted his penis (identified at the trial by the child as his \"georgie\") into the boy's rectum. S. L. testified that she heard her brother cry out but that she was afraid to go to him because she was watching her younger brother, D. L., on the couch and he could have fallen off the couch had she left. C. L. further testified that his father had stuck his finger up the child's rectum and had placed his mouth on the boy's \"georgie\".\n\nThe appellant was accused of abuse against his daughter as well. The girl's testimony indicated that on a night in which her mother was away, she was abused by her father in the bathroom. She testified that while she and her father were in the bathroom, he stuck his finger up her vagina (identified at trial by the child as her \"tweetie\"). When the child screamed that this hurt her, the appellant desisted in his action. The appellant also attempted to force his penis into the girl's vagina but ceased in his attempt because it was not possible.\n\nAccording to the children's testimony at trial, the appellant was able to silence the children regarding the incidents by threatening to cut off the little boy's \"georgie\" and by threatening to cut open the girl's \"tweetie\" so that his penis would fit there if they told anyone.\n\nThe appellant and Mrs. L. were separated on December 26, 1983, and divorced in July 1984. The appellant maintained visitation with his children subsequent to the divorce.\n\nAccording to Mrs. L.'s testimony, it was not until October 1984 that she observed strange behavior \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e being exhibited by her son. When she asked the child about his behavior, he said his daddy told him to do it, because it would feel good. When the mother questioned the boy further, he began crying and said his father told him not to tell her. Mrs. L. then asked a close friend, to question her son about his behavior. The child told the friend about sexual acts performed on him by his father, and later told his mother as well. The friend was not called to testify at trial. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nSubsequently, the child began to display more behavior problems at home, including flushing his mother's keys down the toilet. The child, according to his mother's testimony, told her that the reason he did it was because \"my daddy had keys to get in our house, and daddy told me if I ever told you what he did to me, he would cut my 'georgie' off.\" In September 1985, C. L.'s first grade teacher reported to Mrs. L. that C. L. was inattentive in class to the point that the teacher would have to yell his name or smack a book on his desk to gain his attention. A school counselor referred the matter to a licensed psychologist, Greg Trainor. Trainor treated C. L. and S. L. for several months. From his treatment, he concluded that both children had been sexually abused by their father. Trainor conveyed his opinion about the children to Mrs. L. and urged her to contact the authorities. At Trainor's insistence, Mrs. L. contacted the prosecuting attorney's office.\n\nThe appellant was indicted in January 1987 and tried in May of that year. The prosecution's case rested on testimony of the two child victims, C. L. and S. L.; Trainor, the psychologist; an evidentiary deposition \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e of Dr. Ryland, a gynecologist, and the children's mother, Sharon L. The appellant's defense consisted of his own testimony, denying all the charges but stating he may have accidentally touched his son and daughter while bathing them; and the testimony of his fiance, which centered around the appellant's good relationship with his children. No expert witnesses were called on the appellant's behalf. At the close of all the evidence, the jury convicted the appellant of two counts of first-degree sexual assault and one count of first-degree abuse against his son and one count of first-degree sexual abuse against his daughter.\n\nI.\n\nThe appellant's first assignment of error concerns the trial court permitting the state to make reference to unrelated sexual acts and sexual tendencies of the appellant. Specifically, the appellant contends that the trial court permitted the state to introduce the following evidence over objections raised by appellant's trial counsel:\n\n1. The appellant fondled his infant baby boy through a diaper;\n\n2. The appellant made long distance telephone calls to sex clubs between 1980 and 1983 which he at times made the children listen to under the pretense that Mickey Mouse was on the phone;\n\n3. The appellant's wife found a bag of her daughter's underwear in the basement of their home which the wife claimed had been ejaculated on, presumably by the appellant;\n\n4. The appellant would frequently pat the front of his pants;\n\n5. The appellant would masturbate following sex with his wife;\n\n6. The appellant would lean against the washing machine during the spin cycle for sexual gratification;\n\n7. The appellant would masturbate in front of his son, while looking at what were described at trial as pornographic \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e magazines and stimulating himself rectally, and that the appellant also showed the magazines to the children.\n\nFurther, the defense counsel elicited evidence from Mrs. L. that the appellant had been accused by the child of having intercourse with the family dog in front of his son and pulling his vasectomy stitches out during masturbation. Both of these specific instances were brought out during the defense attorney's cross-examination of the appellant's ex-wife in an attempt to impeach her credibility, and will be examined more fully in our Discussion of the fourth assignment of error relating to ineffective assistance of counsel.\n\nThe appellant contends that the above-mentioned evidence was not only highly prejudicial but that none of the alleged acts or tendencies were remotely relevant to the offenses charged. The state, however, argued that several of the alleged evidentiary \"errors\" were elicited or used by the appellant himself.\n\nWest Virginia Rule of Evidence 404(b) provides that in addressing the issue of the admissibility of collateral crime evidence\n\nevidence of other crimes, wrongs, or acts is not admissible to prove the character of a person in order to show that he acted in conformity therewith. It may, however, be admissible for other purposes, such as proof of motive, opportunity, intent, preparation, plan, knowledge, identity, or absence of mistake or accident.\n\nFurther, in State v. Jackson, 181 W.Va.447, 383 S.E.2d 79, 82 (1989), this Court recognized that:\n\nWhere the state attempt(s) to introduce evidence of other crimes or wrongful acts on the part of a defendant to prove system, motive, intent or opportunity, as outlined in Rule [404(b)], known as the collateral crime rule, 'we have emphasized that [to be admissible, evidence of] the collateral crimes must [relate to crimes that] have occurred reasonably close in point of time to the present offense.' State v. Dolin, 176 W.Va. 688, 347 S.E.2d 208, 214 (1986). See, e.g., State v. Messer, 166 W.Va. 806, 277 S.E.2d 634 (1981) (per curiam); Syllabus Point 7, State v. Withrow, 142 W.Va. 522, 96 S.E.2d 913 (1957); Syllabus Point 3, State v. Gargiliana, 138 W.Va. 376, 76 S.E.2d 265 (1953); Syllabus Point 2, State v. Evans, 136 W.Va. 1, 66 S.E.2d 545 (1951); Syllabus Point 4, State v. Lewis, 133 W.Va. 584, 57 S.E.2d 513 (1949).\n\nThe significance of Rule 404(b) \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e was further explained by the Fourth Circuit Court of Appeals in United States v. Masters, 622 F.2d 83, 86 (4th Cir. 1980). In that case, the court stated that \"the circumstances under which such evidence may be found relevant and admissible under the Rule have been described as 'infinite.' Some of such circumstances are set forth in the Rule itself, but the cataloguing therein is merely illustrative and not exclusionary.\" Consequently, W.Va. R. Evid. 404(b) is an \"inclusive rule\" in which all relevant evidence involving other crimes or acts is admitted at trial unless the sole purpose for the admission is to show criminal Disposition. Masters, 622 F.2d at 86.\n\nIn our analysis of the collateral acts involved in the present case, we begin by first examining just those acts that occurred in the presence of the children close in time to the offenses charged. From a review of the record, it is evident that the phone calls to sex clubs to which the appellant would make the children listen under the pretense that Mickey Mouse was on the phone, the masturbation in front of the appellant's son and the viewing of graphic sexual magazines with the children, all occurred not only in the presence of one or more of the victims, but close in time to the alleged offenses charged.\n\nIn dealing with the admissibility of other sexual acts under Rule 404(b), courts have allowed such evidence to be introduced under a number of different circumstances. For instance, in United States v. Beahm, 664 F.2d 414 (4th Cir. 1981), a case in which the defendant was charged with two counts of taking indecent liberties with children involving the fondling of the boys' genitals on a United States military installation, the court upheld the admissibility of the testimony of two male juvenile witnesses, neither of whom were the victims in the case, that the defendant had approached and made sexual advances toward them some three years prior to the current offenses. Id. at 415-16. The witnesses' testimony revealed that there was similarity between the sexual advances made toward them and the acts constituting the offense charged, along with temporal proximity to the offense charged. Id. at 417. The court, in its decision, found that since the defendant was contesting whether the government sufficiently proved the lascivious intent as required by the Virginia statute, the admission of these other wrongs or acts was not in error since \"the burden was on the government to show that the defendant's acts were performed with lascivious intent and did not occur by accident.\" Id.\n\nThe Fourth Circuit has also allowed other specific crimes, acts or wrongs to be introduced because they are so closely connected with the offense charged that they are found to be part of the res gestae of the offense. See Masters, 622 F.2d at 86. In Masters, while not a sexual offense case, the defendant was charged with dealing in firearms or ammunition without a valid license. The court permitted the introduction of taped conversations between the defendant and undercover agents which tended to show that the defendant had sold guns of all types, including sawed-off shotguns and grenades, to other customers on occasions other than those charged and was willing to supply them to the agents. Id. at 84-5.\n\nSpecifically, the court reasoned that\n\none of the accepted bases for the admissibility of evidence of other crimes arises when such evidence, 'furnishes part of the context of the crime' or is necessary to a 'full presentation' of the case, or is so intimately connected with and explanatory of the crime charged against the defendant and is so much a part of the setting of the case and its 'environment' that its proof is appropriate in order 'to complete the story of the crime on trial by proving its immediate context or the 'res gestae' or the 'uncharged offense is so linked together in point of time and circumstances with the crime charged that one cannot be fully shown without proving the other . . . [and is thus] part of the res gestae of the crime charged.' And where evidence is admissible to provide this 'full presentation' of the offense, 'there is no reason to fragmentize the event under inquiry' by suppressing parts of the 'res gestae.'\n\nMasters, 622 F.2d at 86 (citing United States v. Smith, 446 F.2d 200, 204 (4th Cir. 1979); United States v. Weems, 398 F.2d 274, 275 (4th Cir. 1968), cert. denied, 393 U.S. 1099, 21 L. Ed. 2d 790, 89 S. Ct. 894 (1969); State v. Spears, 58 Ohio App. 2d 11, 387 N.E.2d 648, 651, 12 Ohio Op. 3d 26 (1978); United States v. Howard, 504 F.2d 1281, 1284 (8th Cir. 1974); United States v. Beechum; 582 F.2d 898, 912 n. 5 (5th Cir. 1978), cert. denied, 440 U.S. 920, 59 L. Ed. 2d 472, 99 S. Ct. 1244 (1979); United States v. Copeland, 295 F.2d 635, 637 (4th Cir. 1961), cert. denied, 368 U.S. 955, 7 L. Ed. 2d 388, 82 S. Ct. 398 (1962); United States v. Gano, 560 F.2d 990, 993-94 (10th Cir. 1977).\n\nThis reasoning seems particularly applicable to the transactions involved in a child sexual abuse or assault case. Certainly involving children in the process of viewing or listening to explicit sexual material or graphic sexual behavior is highly probative in presenting a full presentation of the circumstances surrounding the alleged offenses.\n\nFinally, the issue of other sexual acts and their admissibility arose in Morgan v. Foretich, 846 F.2d 941 (4th Cir. 1988). In that case, a four-year-old female child and her mother brought civil action against the child's father and his parents for damages arising out of alleged child sexual abuse. Specifically at issue was the admissibility of evidence which tended to prove that plaintiff child's sister had also been sexually abused while visiting with defendants. Id. at 944. This evidence was offered not only to identify the defendants as the perpetrators but also to disprove several defenses raised by the defendants including fabrication of the injuries and self-infliction. Id.\n\nThe court in upholding the admissibility articulated that as long as the prior acts were being admitted to disprove disputed issues involved in the case such as the defendant's identity, the absence of mistake or accident, or the intent of the defendant to commit the crimes with which he is charged, then there was no violation of the other crimes evidence rule. Id. (citing Comment, Other Crimes Evidence to Prove the 'Corpus Delicti' of a Child Sexual Offense, 40 U. Miami L. Rev. 217, 220 (1985)).\n\nWe therefore find that the acts which occurred in the presence of either one or both children or as part of the transactions with the children which constituted the basis for the indictment were admissible under W.Va. R. Evid. 404(b). These acts not only showed lascivious intent \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e or sexual gratification \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e on the part of this appellant towards his children to commit the crimes charged, but also that the acts did not occur accidentally as the appellant attempted to establish as part of his defense through his own testimony. Furthermore, the acts were so intrinsically related to the alleged offenses that they may be considered as part of the transactions with the children and so interwoven with his pattern of conduct toward the children that they are part of the res gestae of the crimes charged. Lastly, they were highly probative on the issue of whether this defendant committed sexual abuse against these children. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nWe now turn to a consideration of those acts directly involving the victims together with those acts in which the appellant allegedly fondled this infant boy and ejaculated on his daughter's underwear. We originally addressed the issue of collateral crimes evidence being admitted to show lustful Disposition in State v. Dolin, 176 W.Va. 688, 347 S.E.2d 208 (1986).\n\nIn Dolin, the defendant was accused of first degree sexual assault of his daughter who was under the age of eleven at the time the crime was committed. The crimes occurred within three years prior to the indictment. 347 S.E.2d at 211. At trial, the only evidence presented against the defendant was the uncorroborated testimony of his then sixteen-year-old daughter who was the victim of the crime charged. In her testimony, she was unable to recall specific details regarding the places and times of the incidents involved in the indictment. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e The daughter, in her testimony however, was able to recall specific activity involving six collateral acts which included:\n\n1. When she was seven years old, the defendant drove her in a van to a quarry, where he forced her to perform oral sex on him;\n\n2. When she was eight or nine years old, after shopping for a new bicycle, the defendant took her to a motel in St. Albans and rubbed his sex organ on her stomach until he ejaculated;\n\n3. In August of 1977, when she was ten years old, the defendant drove her to a remote location in South Charleston and rubbed his sex organ on her;\n\n4. When she was twelve years old, the defendant took her on a shopping trip to Parkersburg, where they spent the night in a motel. During that night, the defendant rubbed his sex organ on her;\n\n5. When she was twelve or thirteen years old, the defendant drove her to a hollow in South Charleston and forced her to perform oral sex on him; and\n\n6. When she was twelve years old, the defendant drove her to Tennessee, where they stayed in a motel and he rubbed his sex organ on her.\n\nId. n. 2.\n\nAlthough this Court noted that other jurisdictions did recognize a sexual propensity exception, we opined that\n\nto recognize a sexual propensity exception in addition to the numerous exceptions to the collateral crime rule would provide a convenient path to damage a defendant's character and would sweep additional sexual offenses into evidence which would obviously prejudice and confuse a jury in its consideration of the crime charged in the indictment. What renders the reasoning of those courts which have adopted a sexual propensity exception so anomalous is their failure to acknowledge that sexual crime cases are by their very nature likely to be highly offensive to the average jury. Thus, the ability to further prejudice the jury by admitting additional collateral sexual offenses is even more apparent.\n\nId. at 215. This Court further reasoned that since the uncorroborated testimony of the victim is sufficient evidence for a conviction in sexual offense cases, unless inherently incredible, \"courts should be particularly wary of collateral sexual offense evidence . . . .\" Id. (citing Syl. Pt. 5, State v. Beck, 167 W.Va. 830, 286 S.E.2d 234 (1981)). Finally, this Court specifically held \"it is impermissible for collateral sexual offenses to be admitted into evidence solely to show defendant's improper or lustful Disposition toward his victim.\" Id. at 210, Syl. Pt. 7. To the extent that the Dolin decision finds evidence introduced to show lustful Disposition to be impermissible in cases involving child victims, it is overruled.\n\nThe importance of allowing such evidence to be admitted under a lustful Disposition exception was noted in the Dissenting opinion to Dolin in which Justice McHugh, joined by Justice Brotherton, stated that\n\nthe victim's testimony as a crucial element of the State's case must be examined in context in order to establish a complete record of events, thereby reducing the incredibility of the victim's testimony. Therefore, carving out a sexual propensity exception allows the finder of facts to weigh the credibility of the victim's unabridged testimony.\n\n347 S.E.2d at 220. We find this rationale to be particularly applicable in cases involving child victims. This is evident since these cases generally pit the child's credibility against an adult's credibility and often times an adult family member's credibility. Since sexual abuse committed against children is such an aberrant behavior, most people find it easier to dismiss the child's testimony as being coached or made up or conclude that any touching of a child's private parts by an adult must have been by accident. In addition, children often have greater difficulty than adults in establishing precise dates of incidents of sexual abuse, not only because small children don't possess the same grasp of time as adults, \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e but because they obviously may not report acts of sexual abuse promptly, either because they are abused by a primary care-taker and authority figure and are therefore unaware such conduct is wrong, or because of threats of physical harm by one in almost total control of their life. In most cases of sexual abuse against children by a care-taker or relative, the acts of sexual abuse transpire over a substantial period of time, often several years. Consequently, under the existing collateral acts rule, a child victim is unable to present the complete record of events forming the context of the crime. Lastly, there is a common misconception that children have a greater propensity than adults to imagine or fabricate stories of sexual abuse. Research indicates, however, that absent coaching, children are far less likely to lie about matters in the sexual realm than adults, \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e and that absent sexual experience there is little means by which children can imagine sexual transactions. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e In consideration of all these factors, the probative value of such testimony far outweighs the potential for unfair prejudice.\n\nTherefore, collateral acts or crimes may be introduced in cases involving child sexual assault or sexual abuse victims to show the perpetrator had a lustful Disposition towards the victim, a lustful Disposition to children generally, or a lustful Disposition to specific other children, provided such acts occurred reasonably close in time to the incident(s) giving rise to the indictment. To the extent this conflicts with our decision in State v. Dolin, 176 W.Va. 688, 347 S.E.2d 208 (1986) it is overruled. In adopting such an exception to W.Va. R. Evid. 404(b) we follow a number of other jurisdictions which have permitted such evidence to be admitted in sexual assault or abuse cases on the theory that such evidence shows the accused's incestuous and lustful attitude toward that particular person, \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e and upon the theory that in cases involving child victims, a full Disposition of the facts forming the context of the crime presents a fairer opportunity for the triers of fact to assess the credibility of the witnesses.\n\nFinally, the evidence that the appellant patted the front of his pants, would masturbate after having sex, \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e and would lean against the washing machine during the spin cycle was not relevant to the issues at trial, and its admission was error. We reach this Conclusion because it appears this evidence was introduced solely for the purpose of proving the character of the defendant and his propensity for obtaining sexual gratification in unusual ways. There was no evidence that these particular instances either occurred in the presence of the children or as part of the transactions with them. We further find, however, that this error was harmless. We base our decision on the Fourth Circuit Court of Appeals decision in United States v. Davis, 657 F.2d 637 (4th Cir. 1981). In Davis, the court found harmless error where the lower court admitted testimony concerning alleged sales of heroin to twelve or thirteen-year-old children that were made some six to eleven years before the current offenses of conspiracy to distribute heroin were supposed to have begun.\n\nThe court stated that \"the test for harmlessness for nonconstitutional error is when it is probable that the error could have affected the verdict reached by the particular jury in the particular circumstances of the trial.\" Id. at 649 (emphasis added) (citing United States v. Nyman, 649 F.2d 208 (4th Cir. 1980)). The court further opined that it was proper to consider other evidence which tended to show the defendant's guilt and that in this case \"the evidence supporting Carter's [the defendant's] conviction was so conclusive that it is altogether unlikely that the error affected the verdict.\" Davis, 657 F.2d at 640.\n\nSimilarly, in West Virginia, we have held that the test for determining whether the introduction of improper evidence at trial constitutes harmless error is:\n\n'(1) the inadmissible evidence must be removed from the State's case and a determination made as to whether the remaining evidence is sufficient to convince impartial minds of the defendant's guilt beyond a reasonable doubt;\n\n(2) if the remaining evidence is found to be insufficient, the error is not harmless;\n\n(3) if the remaining evidence is sufficient to support the conviction, an analysis must then be made to determine whether the error had any prejudicial effect on the jury.'\n\nSyl. Pt. 3, in part, State v. Maynard, No. 19135 (W.Va. March 30, 1990) (quoting Syl. Pt. 6, State v. Smith, W.Va. , 358 S.E.2d 188 (1987); Syl. Pt. 2, State v. Atkins, 163 W.Va. 502, 261 S.E.2d 55 (1979), cert. denied, 445 U.S. 904, 63 L. Ed. 2d 320, 100 S. Ct. 1081 (1980)).\n\nIn the present case, the evidence which was properly introduced certainly constituted a sufficient basis to support the convictions. While obtaining sexual gratification from the movement of a washing machine is unusual, it certainly is not the sort of evidence which would have any real prejudicial effect against a defendant such as to cause a jury to convict him. Since the evidence of masturbation actually involved sexual activity with an adult, the defendant's wife, it would seem to indicate the defendant's normalcy in the sexual arena. In the face of such direct evidence as the testimony of the two victims, this evidence cannot seriously be considered to have had any prejudicial effect on the jury's consideration of the issues.\n\nIn cases of this sort, where the victims themselves testify and where the defendant testifies and denies the charges, it really comes down to whether the jury believes that the victims are telling the truth, or that they are lying, either because of their own motivations or as a result of having been coached or coerced. Thus, the likelihood that the improperly admitted evidence had any prejudicial effect whatsoever on the jury is minimal.\n\nII.\n\nThe appellant contends the trial court committed plain error when it permitted the victim's mother, Sharon L., and the psychologist, Greg Trainor, to testify concerning the children's extrajudicial statements which directly implicated the appellant. These statements were made between one and four years after these sexual assaults allegedly took place. The state contends that not only did the appellant fail to object to this testimony, but the appellant utilized the testimony to bolster his own theory of the case -- which was that the children were coached by their mother and thereby fabricated the alleged offenses against the appellant stemming from the parent's divorce -- and that Trainor's testimony was not offered solely to bolster the credibility of the child witnesses but was also offered to give his opinion as to whether the children fit the profile of child sexual abuse victims and whether they were sexually abused.\n\nIn order to address the issue of whether the psychologist's testimony and the victims' mother's testimony was properly admitted it is helpful to examine each of the witness' testimony separately. First, the psychologist's testimony included the following excerpts:\n\nYou know there's one description that Bubbie said his dad, I believe, it was in conjunction with some pornographic magazines, you know, masturbating in front of Bubby and while he was doing that and inserting his other, taking his other hand and inserting a finger in his rectum, again . . . .\n\nIn deciding whether the psychologist's testimony was properly introduced, the state contends that: (1) the statements were given to the medical health profession for the purpose of diagnosis and treatment \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e and are therefore admissible; and (2) the statements are not hearsay since they were not \"offered in evidence to prove the truth of the matter asserted,\" \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e but rather were cited only as support used by the psychologist in forming his opinion.\n\nWest Virginia Rule of Evidence 803(4) provides that:\n\nThe following . . . [is] not excluded by the hearsay rule, even though the declarant is available as a witness: . . . (4) Statements for Purposes of Medical Diagnosis or Treatment - Statements made for purposes of medical diagnosis or treatment and describing medical history, or past or present symptoms, pain, or sensations, or the inception or general character of the cause or external source thereof insofar as reasonably pertinent to diagnosis or treatment.\n\nEven though we have previously held in Syl. Pt. 3, State v. Murray, 180 W.Va.41, 375 S.E.2d 405, 407 (1988) that \"out-of-court statements made by the victim of a sexual assault may not be introduced by a third party unless the statements qualify as an excited utterance under Rule 803(2) of the West Virginia Rules of Evidence,\" that case is factually distinguishable from the instant case. It did not in any way concern W.Va. R. Evid. 803(4) or what is admissible thereunder.\n\nIn Murray, a nine-year-old girl, made statements to a secretary and a principal at her school and a child protective services worker to the effect that she had been sexually assaulted by the defendant some two weeks earlier. 375 S.E.2d at 408-09. The school principal and protective services worker were permitted to testify about these statements at trial. On appeal, this Court found that the statements were inadmissible because they failed to meet the criteria for the excited utterance exception found in W.Va. R. of Evid. 803(2). See Syl. Pt. 2, State v. Young, 166 W.Va. 309, 273 S.E.2d 592 (1980).\n\nIn contrast, in the present case, the statements made by the children regarding the sexual abuse by their father were made to the psychologist who the children were seeing in a therapeutic context. Similarly, in Matter of Lucas, 94 N.C. App. 442, 380 S.E.2d 563 (1989), the Court of Appeals of North Carolina was faced with determining whether statements made by a three-year-old child to a medical doctor when she was taken to a local hospital within fourteen days of an alleged sexual assault incident for medical attention were admissible. Matter of Lucas, 380 S.E.2d at 566.\n\nIn that case, the doctor was permitted to testify that while conducting an exam to determine whether there was evidence of sexual abuse, the child told him that the fourteen-year-old juvenile offender pulled his penis out and pulled the victim's pants down. The doctor was further permitted to testify:\n\nA. And then [child] said that he put a spring in me and I questioned her, 'Where was this spring?', 'On his whacker'. Did it hurt when he put this spring in you? She said yes. Did he tell you that he had a spring and she said yes. Then I asked her 'Where did he put it in you, can you show me?' Show me on the doll baby where he put it and I asked her to pull the doll baby's pants down and 'Where did he put it in?'; she pointed to the vaginal area of the female doll. Then I asked her, 'Did he do this one time?' and she indicated two times. She said that it was on two different days.\n\nA. . . . In obtaining the rectal culture, she stated that this was where Ronnie put his 'whacker'. When I did the vaginal exam, she said, 'This is not where Ronnie put his whacker.'. . .\n\nA. The rectal structure appeared to be normal. There were no tears, lacerations or other abnormalities or alteration than normal [word not audible] tone. It was a normal examination . . . .,\n\nId. at 565.\n\nThe court found that \"the trial court properly admitted Dr. Fisher's testimony as to the out-of-court statements of the child pursuant to Rule 803(4).\" Id. at 568. The North Carolina Court reasoned that the above-mentioned statements of the doctor were admissible since the doctor used those statements in making his diagnosis and on recommending follow-up treatment by a psychologist. Id. at 567.\n\nLikewise in Morgan v. Foretich, 846 F.2d 941 (4th Cir. 1988), the court considered whether the testimony of a psychologist who had spent over one hundred hours examining and working with the victim was permitted to testify about out-of-court statements made by the child. Id. at 948. In the Morgan case the trial court only permitted the psychologist to give his opinion as to the child's abuse and was excluded from testifying about out-of-court statements made by the child to him. Id.\n\nThe Fourth Circuit indicated that \"the two-part test set for admitting these hearsay statements is (1) 'the declarants motive in making the statement must be consistent with the purposes of promoting treatment'; and, (2) 'the content of the statement must be such as is reasonably relied upon by a physician in treatment or diagnosis.'\" Id. at 949 (footnotes omitted) (citing United States v. Renville, 779 F.2d 430, 436 (8th Cir. 1985)). The court, in its application of this test to the facts before it, found that the child's statements to her psychologist were properly admissible at trial. The court relied heavily upon the Renville decision which concluded that \"not only would the young victim have a motive consistent with the purpose of treatment, but also, 'statements by a child abuse victim to a physician during an examination that the abuser is a member of the victim's immediate household are reasonably pertinent to treatment.'\" Morgan, 846 F.2d at 949 (emphasis in original) (quoting Renville, 779 F.2d at 436).\n\nConsequently, we conclude that the statements made by the children to their treating psychologist, Trainor, were properly admitted at trial. In adopting the two-part test applied by the Fourth Circuit, we find that not only was the motive behind the statements made by the children consistent with promoting treatment, since the mother brought the children to the psychologist for the purpose of treatment at a time prior to any criminal action even being contemplated; but also, the statements were such that they would have been reasonably relied upon by Trainor in his diagnosis and treatment of the children.\n\nThe trial court also permitted the victims' mother to testify without objection regarding extrajudicial statements made by her son involving the sexual assaults. It is extremely important to note, however, that each child also testified regarding the matters contained in the statements made to the mother and to Dr. Trainor, and was subject to cross-examination by the appellant. These statements do not fall under the excited utterance exception to the hearsay rule found in W.Va. R. Evid. 803(2) because they were not statements made by the declarant \"relating to a startling event or condition . . . while the declarant was under the stress of excitement caused by the event or condition.\" Id. However, other courts have admitted statements like these made by child victims to a parent under other exceptions to the hearsay rule.\n\nIn Matter of Lucas, the court admitted statements made by a three-year-old child to her mother that a juvenile boy had sexually assaulted the little girl anally. 380 S.E.2d at 565. The court upheld the admissibility of these statements made several days after the incident under Rule 803(4) which involve statements made for the purposes of medical diagnosis or treatment. Matter of Lucas, 380 S.E.2d at 566. The court reasoned that \"the child's statements were pertinent to diagnosis and treatment as they suggested to the doctors, the nature of the problem which in turn directed the doctors in their examination of the child.\" Id. Likewise, in the instant case, the mother's testimony concerning her son's statements was presented primarily to explain why she took the children to the psychologist, not for the purpose of proving the matter asserted.\n\nOther courts have permitted hearsay statements, such as those present before the Court, under Rule 803(24). West Virginia Rule of Evidence 803(24) provides:\n\nThe following are not excluded by the hearsay rule, even though the declarant is available as a witness:\n\n(24) Other Exceptions: -- A statement not specifically covered by any of the foregoing exceptions but having equivalent circumstantial guarantees of trustworthiness, if the court determines that (A) the statement is offered as evidence of a material fact; (B) the statement is more probative on the point for which it is offered than any other evidence which the proponent can procure through reasonable efforts; and (C) the general purposes of these rules and the interests of Justice will best be served by admission of the statement into evidence. However, a statement may not be admitted under this exception unless the proponent of it makes known to the adverse party sufficiently in advance of the trial or hearing to provide the adverse party with a fair opportunity to prepare to meet it, his intention to offer the statement and the particulars of it, including the name and address of the declarant.\n\nIn Mitchell v. State, Miss. , 539 So. 2d 1366 (1989) the court indicated that the mother's and babysitter's testimony involving hearsay statements made by a five-year-old female child should be analyzed under Rule 803(24) exception on remand. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e In its instructions to the lower court, the Mississippi Supreme Court stated:\n\nWe note that, as other courts have applied the 'catch-all' to a child's out-of-court statement about an incident of sexual abuse, they have found that the statements did not fit under the excited utterance exception or under the exception for seeking medical treatment. In determining the equivalent guarantees of trustworthiness, these courts have considered the age of the child, under the rationale that young children do not possess enough sexual knowledge to fabricate such incidents. These courts further look at the length of delay in reporting the incident and the surrounding reasons for the delay, such as fear, threats, and lack of opportunity to report. They also consider the persons to whom the incident was reported -- family, social workers, law enforcement officers.\n\nMitchell, 539 So.2d at 1370 (citing U.S. v. Dorian, 803 F.2d 1439 (8th Cir. 1986); U.S. v. Renville, 779 F.2d 430 (8th Cir. 1985); State v. Robinson, 153 Ariz. 191, 735 P.2d 801 (1987); State v. Brown, 341 N.W.2d 10 (Iowa 1983)); See generally Note, A Comprehensive Approach to Hearsay Statements in Sex Abuse Cases, 83 Colum. L. Rev. 1745 (1983).\n\nIn examining the statements made to the mother by the child victim in the present case, we must look at the requirements this Court has set out in order for a statement to come in under W.Va. R. of Evid. 803(24). We have previously held that\n\nthe language of Rule 804(b)(5) of the West Virginia Rules of Evidence and its counterpart Rule 803(24) requires that five general factors must be met in order for hearsay evidence to be admissible under the rules. First and most important is the trustworthiness of the statement, which must be equivalent to the trustworthiness underlying the specific exceptions to the hearsay rule. Second, the statement must be offered to prove a material fact. Third, the statement must be shown to be more probative on the issue for which it is offered than any other evidence the proponent can reasonably procure. Fourth, admission of the statement must comport with the general purpose of the rules of evidence and the interests of Justice. Fifth, adequate notice of the statement must be afforded the other party to provide that party a fair opportunity to meet the evidence.\n\nSyllabus Point 5, State v. Smith,... W.Va. , 358 S.E.2d 188 (1987); See Syl. Pt. 1, State v. Bailey, 179 W.Va.1, 365 S.E.2d 46 (1987).\n\nThese factors were set forth with an obvious eye towards evaluating the reliability of hearsay evidence in light of what legal writers have described as the four dangers of hearsay: \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e misperception, faulty narration, inaccurate memory, and insincerity. If the likelihood of these dangers is slight, the reliability of the evidence is enhanced.\n\nFurthermore, it is important to bear in mind that most of the cases analyzing the admissibility of hearsay statements under Rule 803(24)(5) have been decided in contexts where the declarant was not present to testify in person. It is extremely important to recognize that in the defendant's trial, each child was present, testified in court, and was cross-examined by defense counsel. Furthermore, neither the mother nor the psychologist added anything substantive to the children's testimony. It would cause us grave concern as to the propriety of the mother's testimony if the children gave a barebones or sketchy account of what occurred, and then the mother was permitted to expand upon or add detail and substance to such testimony through the children's extra-judicial statements. Such was not the case here. Judge Weinstein and Professor Berger have written that \"the availability of the declarant at trial vitiates the main concern of the hearsay rule, which is the lack of any opportunity for the adversary to cross-examine the absent declarant.\" \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nNot only are hearsay dangers minimized by the presence of the declarant, but such appearance removes potential confrontation clause issues as well. \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e Furthermore, since the defendant claimed maternal coaching of the children, the mother's account of the child's statements to her gave the jury a fuller opportunity to observe her demeanor and her motivations in recounting such statements. The testimony of the mother and psychologist presented the defendant an opportunity to explore on cross-examination any coaching or motive on behalf of the mother or psychologist to help the children fabricate the accusations. When a child witness is present to testify, however, it would generally seem to be a better practice not to permit a parent to testify as to the child's extrajudicial statements unless such testimony clearly falls into one of the hearsay exceptions. But it is harmless when, viewed in the spectrum of all the evidence, it creates no prejudice to the defendant. The statements comport to this hearsay exception and the general rules of evidence because they not only meet the relevancy and probativeness requirements but the fact that the children testified at trial and were subject to cross-examination ameliorates the real risks of admitting hearsay. Finally, we examine the requirement of giving adequate notice to the opposing party. In this case, not only did the defendant have notice that Mrs. L. would be called as a witness, but the court ordered the state to provide the defendant with a copy of the written statement of Mrs. L. if she were called as witness. A review of the statement which was contained in the record indicates that the defendant did have notice as to the nature of the evidence the state would offer through Mrs. L.'s testimony.\n\nTherefore we conclude that the mother's testimony was properly admitted at trial by the lower court, since the children were present to testify and be cross-examined; the mother added nothing substantive to the children's direct testimony, and primarily related the child's statements not to prove the truth of the matter asserted, but to explain why she took them to the psychologist; and because the mother's motivations were an issue raised by the defense, and therefore her appearance on the stand provided the defendant an opportunity to cross-examine her and the jury a chance to observe her demeanor and assess her motivations and credibility.\n\nIII.\n\nThe appellant also argues that the trial court erred in permitting the family psychologist, Greg Trainor, to express his opinion that the children had been sexually assaulted by the appellant. The state argues that this case should be distinguished from cases involving the expert who is testifying about \"rape trauma syndrome.\"\n\nWest Virginia Rule of Evidence 702 states that \"if scientific, technical, or other specialized knowledge will assist the trier of fact to understand the evidence or to determine a fact in issue, a witness qualified as an expert by knowledge, skill, experience, training, or education may testify thereto in the form of an opinion or otherwise.\" Further, W.Va. R. Evid. 704 provides that \"testimony in the form of an opinion or inference otherwise admissible is not objectionable solely because it embraces an ultimate issue to be decided by the trier of fact.\"\n\nIn this case, the expert psychologist testified as followed: (By the prosecuting attorney):\n\nQ: Okay, do you have an opinion as to whether Bubby was sexually assaulted and sexually abused?\n\nA: Yes, it's my opinion that, that Bubby, little [E. L.], was, was sexually abused.\n\nThe expert at that point went on to give the basis for his opinion. \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e Later, in the expert's testimony, the prosecutor asked the following with regards to both children:\n\nQ: Your professional opinion then is that both of these children, were, in fact, abused and assaulted as they have reported to you?\n\nA: That's, that's my opinion, yes.\n\nIn State v. McCoy, 179 W.Va. 223, 366 S.E.2d 731 (1988) this Court was faced with the admissibility of expert testimony on post-rape behavior, i.e. testimony regarding rape trauma syndrome. 366 S.E.2d at 734. We held that:\n\nqualified expert testimony regarding rape trauma syndrome is relevant and admissible in a prosecution for rape where the defense is consent. The expert may testify that the alleged victim exhibits behavior consistent with rape trauma syndrome, but the expert may not give an opinion, expressly or implicitly, as to whether or not the alleged victim was raped.\n\nId. at 737. The reason for this holding was concern over \"the danger involved in permitting an expert to include that because a complainant suffers from rape trauma syndrome, the complainant was, therefore, raped . . . [since] '[such a] Conclusion vouches too much for the victim's credibility and supplies verisimilitude for her on the critical issue of whether defendant did rape her.'\" McCoy, 366 S.E.2d at 736 (footnote omitted) (citing State v. Taylor, 663 S.W.2d 235, 241 (Mo. 1984)); See State v. Jackson, 181 W.Va. 447; 383 S.E.2d 79 (1989). \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nWhile the facts of this case do not involve rape trauma syndrome, but rather sexual abuse and sexual assault on children, an analogy can be drawn in that children who are sexually abused or assaulted frequently display indications which may comport to a profile of child victims which has been developed by psychologists and social workers with experience in this area of expertise. In State v. Myers, Minn. , 359 N.W.2d 604 (1984) the Minnesota Supreme Court was asked to determine whether the trial court erred in admitting expert psychological testimony describing the behavior and symptoms typically exhibited by children who have been sexually abused and further, expressing an opinion that the child victim's allegations were not fabricated. 359 N.W.2d at 606. Specifically, the court addressed the issue of \"whether or not the emotional and psychological characteristics observed in sexually abused children is a proper subject of expert testimony.\" Id. at 609.\n\nThe court ruled that such testimony was admissible even though the indirect result was to bolster the credibility \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e of the victim witness finding that\n\nthe nature . . . of the sexual abuse of children places lay juror at a disadvantage. Incest is prohibited in all or almost all cultures, and the common experience of the jury may represent a less than adequate foundation for assessing the credibility of a young child who complains of sexual abuse. If the victim of a burglary failed to report the crime promptly, a jury would have good reason to doubt that person's credibility. A young child subjected to sexual abuse, however, may for some time be either unaware or uncertain of the criminality of the abuser's conduct. As . . . [the expert] testified, uncertainty becomes confusion when an abuser who fulfills a caring-parenting role in the child's life tells the child that what seems wrong to the child, is, in fact, all right. Because of the child's confusion, shame, guilt, and fear, disclosure of the abuse is often long delayed. When the child does complain of sexual abuse, the mother's reaction frequently is disbelief, and she fails to report the allegations to the authorities. By explaining the emotion antecedents of the victim's conduct and the peculiar impact of the crime on other members of the family, an expert can assist the jury in evaluating the credibility of the complainant.\n\nId. at 610; see State v. Middleton, 294 Or. 427, 657 P.2d 1215 (1983); see also State v. Kim, 64 Hawaii 598, 645 P.2d 1330 (1982).\n\nSimilarly, the Ohio Court of Appeals in State v. Timperio, 38 Ohio App. 3d 156, 528 N.E.2d 594 (1987) was faced with expert testimony offered at trial which was very similar to the expert's testimony in the present case. In Timperio, the expert psychologist testified about the symptoms sexually abused children exhibit and stated that in her opinion the child in that case had been sexually abused. 528 N.E.2d at 595. The court held that \"it is permissible to permit an expert to testify for the purpose of helping the jury to assess the credibility of a sexually abused child,\" and further, \"an expert may state her opinion that a child has been sexually abused.\" Id. at 595, Syl. Pts. 1 and 2; see State v. Humfleet, (Sept. 9th, 1985), Clermont App. Nos. CA84-04-031 and CA84-05-036, State v. Geyman, 224 Mont. 194, 729 P.2d 475 (1986); Middleton, 294 Ore. 427, 657 P.2d 1215.\n\nIn McCoy, this Court pointed out that rape trauma syndrome is a phrase coined to describe those physical and emotional symptoms and behaviors frequently experienced by rape victims. McCoy, 366 S.E.2d 731. Similarly, children who are the victims of sexual abuse or assault frequently manifest identifiable physical and emotional behaviors and characteristics. Certainly, then, qualified expert testimony may be taken regarding the behavioral and emotional indicia of child sexual abuse victims, and an expert may testify that an alleged victim exhibits behavior consistent with such a profile. There is no valid reason that a physician cannot give an opinion based on physical findings that a person has been sexually assaulted. Similarly, there is no valid reason a psychologist or psychiatrist should not be allowed to give an opinion based on objective findings as to whether an individual, most particularly a child, has been sexually assaulted. It is true that such an expert opinion aids the victim's verisimilitude, but it is a fair and proper basis for doing so and the probative value of such testimony far outweighs any potential for unfair prejudice. Furthermore, whether a person has been sexually assaulted is not the ultimate issue for a jury. The ultimate issue is whether the defendant committed the assault.\n\nConsequently, we adopt the holding and rationale of the courts which permit expert psychological testimony in cases involving incidents of child sexual abuse, and determine that an expert may state a Conclusion as to whether a child who is alleged to be the victim of sexual abuse or assault exhibits behavior consistent with being so victimized, and may give an opinion as to whether the child has been sexually abused. Such expert may not give an opinion on whether he personally believes the child, nor on the issue of whether the defendant was the perpetrator of the abuse or assault, for that would improperly and prejudicially invade the province of the jury. Thus, we find that the expert's testimony in this case was permissible and the trial court committed no error in allowing the testimony in evidence.\n\nIV.\n\nThe appellant next argues that the uncorroborated testimony of the children was inherently incredible and does not sustain the guilty verdict. The appellant based his contention on the time lapse from when the crimes actually occurred until they were reported approximately four years later, on the appellant's allegation that the children exhibited no unusual behavior during this time, and the fact that there was no physical evidence that either child had been sexually assaulted. \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nIn State v. McPhearson, 179 W.Va. 612, 371 S.E.2d 333 (1988) and State v. Humphrey, W.Va. , 351 S.E.2d 613 (1986), this Court dealt with the issue of inherently incredible testimony. In McPhearson, we held that \"inherent incredibility, . . . is more than contradiction and lack of corroboration.\" 371 S.E.2d at 338 (footnote omitted). Inherent incredibility thus requires \"a showing of 'complete untrustworthiness' . . . [testimony which] defies physical laws.\" Id.\n\nIn the present case, we find the children's testimony far from inherently incredible. We base this finding on the children's descriptions of what happened to them. Although they were obviously upset and embarrassed at testifying, they related the incidents clearly. Also, the children were subject to thorough cross-examination during which the children were consistent in maintaining their accounts of what transpired. The jury was able to Judge their demeanor and assess their credibility directly. Their testimony does sustain a guilty verdict.\n\nV.\n\nFinally, appellant's counsel on appeal raises an ineffective assistance of counsel argument based upon (1) the defense being a denial of any sexual conduct or misconduct; \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e (2) the failure to object to the assertion of the prosecuting attorney during opening statements that the appellant's divorce was the result of his fondling the four-month-old baby; (3) the defense counsel questioning defense \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e witnesses concerning improper sexual acts by the appellant; \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e (4) the failure to request that the lower court have the child victims examined by an independent psychologist for competency purposes; and (5) the failure to offer expert testimony concerning the lack of physical evidence of sexual assault or sexual abuse.\n\nIn Syl. Pt. 19, in part, State v. Thomas, 157 W.Va. 640, 203 S.E.2d 445 (1947), this Court held that\n\nin the determination of a claim that an accused was prejudiced by ineffective assistance of counsel . . . courts should measure and compare the questioned counsel's performance by whether he exhibited the normal and customary decree of skill possessed by attorneys who are reasonably knowledgeable of criminal law . . . .\n\nWe also held in Syl. Pt. 21, of Thomas, that\n\nwhere a counsel's performance, attacked as ineffective, arises from occurrences involving strategy, tactics, and arguable courses of action, his conduct will be deemed effectively assistive of his client's interests, unless no reasonably qualified defense attorney would have so acted in the defense of an accused.\n\n203 S.E.2d at 449.\n\nIn applying Thomas to the case at bar, thorough pre-trial motions were filed in defendant's behalf and the defendant's counsel at trial conducted thorough voir dire, gave an effective opening statement, provided affirmative evidence in defense of the appellant, including the appellant's current girlfriend who testified as to the appellant's relationship with his children, placed the defendant on the stand who testified that he did not sexually assault his children, made a closing argument based on defendant's theories of fabrication and coercion, and finally made appropriate objections and motions with specificity and vigor throughout the trial.\n\nWhile it is true that defense counsel did introduce the evidence relating to Sharon L.'s statements regarding the defendant having sex with the family dog and the defendant masturbating until he tore loose the surgical stitches from his vasectomy, it is necessary to read the cross-examination of Mrs. L. to discern trial counsel's strategy. First of all, the allegation concerning the dog supposedly took place as part of the transactions with the children, and therefore would have been admissible as part of the res gestae of the offense had the state attempted to introduce it. Secondly, defense counsel's question on cross-examination makes clear that the dog was such an extremely small animal that defense counsel was attempting to show that it would be patently unbelievable that a grown man could accomplish a sex act with it. Similarly, the former wife was questioned by defense counsel as to her previous statement on the incident relating to vasectomy stitches. The defense counsel was attempting to demonstrate that it was absurd to believe a person would derive sexual gratification from such a self-mutilating and painful act as that of tearing surgical stitches. The obvious strategy behind defense counsel's questions was to show what ludicrous stories Mrs. L. could concoct regarding her former husband's propensities. There is no doubt that defense attorney's strategy in attacking Mrs. L.'s credibility in this manner was arguable, and she obviously was not successful in the representation of her client in that he was not acquitted.\n\nFinally, regarding the failure of the defense counsel to request that the child victims be examined by an independent psychologist for competency purposes, we have already discussed the competency issue (supra) at note 27. There we concluded that trial court properly exercised its discretion on the competency issue. See State v. Stacy 179 W.Va. 686, 371 S.E.2d 614 (1988).\n\nThe primary difficulty defense counsel had at this trial was that she did not have much to go on in the way of evidence favorable to the defendant. As is frequently the case in this type of charge, it really was a credibility contest. When young children testify that a defendant has sexually abused them and the defendant testifies and denies such charges, defense counsel must attempt to elicit evidence and make argument as to why they would lie.\n\nIn this case, the defense counsel attempted throughout to demonstrate that the children had been coerced or coached by their mother or that either they or their mother was upset at the defendant's girlfriend's role in the defendant's life. The defendant's girlfriend testified, however, that she had accompanied the defendant to Sharon L.'s home on a number of occasions to visit the children, and that Mrs. L. always made her feel welcome. In addition, there was a lack of evidence which tended to show that the children had been coached since their mother did not pursue prosecution until some time after the allegations came to her attention. Even after she reported it to the prosecutorial authorities, it was approximately two years before the grand jury indicted. Nor was there any basis to believe Mrs. L. was acting out of any animosity toward her former husband, both because of the passage of time and because she reported the offenses only upon the urging of the psychologist. Also, the reason the victims stated that they didn't disclose these events sooner was due to threats of bodily harm made upon them by the appellant.\n\n'Judicial scrutiny of counsel's performance must be highly deferential. It is all too tempting for a defendant to second-guess counsel's assistance after conviction or adverse sentence, and is all too easy for a court, examining counsel's defense after it has proved unsuccessful, to conclude that a particular act or omission of counsel was unreasonable . . . .'\n\nState ex rel. Levitt v. Bordenkircher, W.Va. , , 342 S.E.2d 127, 137 (1986) (citing Strickland v. Washington, 466 U.S. 668, 689, 80 L. Ed. 2d 674, 104 S. Ct. 2052, (1984)). In reviewing the attorney's overall performance, we are hard pressed to conclude that it amounted to an ineffective assistance of counsel.\n\nTherefore, based on the foregoing opinion, we affirm the judgment of the Circuit Court of Mineral County.\n\nAffirmed.\n\nMiller, Justice, Dissenting:\n\nMy disagreement with the majority involves a wide variety of issues. The majority has not only overruled several settled points of law in our jurisdiction, but has done so with only the most meager authority to support its position. The principles it has adopted are clearly outside the mainstream.\n\nI.\n\nOn May 28, 1987, the defendant was convicted of two counts of first degree sexual assault and two counts of first degree sexual abuse. The defendant was sentenced to serve consecutive sentences of fifteen-to-twenty-five years for each of the two first degree sexual assault convictions with concurrent sentences of one-to-five years for the first degree sexual abuse convictions.\n\nThe events which led to these convictions allegedly occurred in the fall of 1983. During this period of time, the defendant resided with his wife, his four-year-old twins, a boy and a girl, and an infant son. In December of 1983, the defendant and his wife separated, at which time the defendant ceased living with his family. The divorce was finalized in July of 1984.\n\nApproximately two years later, the ex-wife reported to the authorities that her husband had sexually abused the twins during the fall of 1983. The defendant had visitation rights with the twins during this two-year period, and their relationship appeared to be normal. The twins received therapy and, after several sessions, both of them stated that their father had sexually abused them. There was no physical evidence which supported these allegations. Because I believe the majority has misapplied the law to the facts of this case, I respectfully Dissent.\n\nII.\n\nFirst, the majority's \"lustful Disposition\" exception to Rule 404(b) of the West Virginia Rules of Evidence \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e will permit admission of evidence of a particular character trait of a defendant accused of a sexual offense in order to show that the defendant acted in accordance with the trait. Nothing could be more directly contrary to the explicit admonition of W.Va.R.Evid. 404(a): \"Evidence of a person's character or a trait of his character is not admissible for the purpose of proving that he acted in conformity therewith on a particular occasion.\" The majority tacitly acknowledges the inconsistency of its \"exception\" and W.Va.R.Evid. 404(a) by its failure to cite or discuss this rule.\n\nIn order to establish its \"lustful Disposition\" exception, the majority had to overrule Syllabus Point 8 of State v. Dolin, W.Va. , 347 S.E.2d 208 (1986). \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e The majority opinion cites four cases from other jurisdictions which it represents as sanctioning a lustful Disposition collateral act exception. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Though four of the United States hardly represent most of the American jurisdictions, the prevalence of the majority's new view is even less than it asserts. Two of the jurisdictions, Ohio and Wisconsin, have abandoned their ill-conceived lustful Disposition exceptions. See State v. Curry, 43 Ohio St. 2d 66, 330 N.E.2d 720, 72 Ohio Op. 2d 37 (1975); State v. Fishnick, 127 Wis. 2d 247, 378 N.W.2d 272 (1985). The majority's position is against sound logic and the overwhelming weight of authority, which holds that collateral acts are inadmissible to show a lustful Disposition. Such evidence serves no purpose other than to prove that the defendant acted in conformity with a character trait and is, therefore, guilty of the crime charged. E.g., Johnson v. State, 727 P.2d 1062 (Alaska App. 1986); People v. Tassell, 36 Cal. 3d 77, 201 Cal. Rptr. 567, 679 P.2d 1 (1984); Getz v. State, 538 A.2d 726 (Del. 1988); Heuring v. State, 513 So. 2d 122 (Fla. App. 1988), decision quashed on other grounds, 559 So. 2d 207 (Fla. 1990); Pendleton v. Commonwealth, 685 S.W.2d 549 (Ky. 1985); People v. Major, 407 Mich. 394, 285 N.W.2d 660 (1979); State v. Schumann, 111 N.J. 470, 545 A.2d 168 (1988); State v. Curry, supra; Commonwealth v. Shively, 492 Pa. 411, 424 A.2d 1257 (1981); State v. Burchfield, 664 S.W.2d 284 (Tenn. 1984); State v. Harris, 36 Wash. App. 746, 677 P.2d 202 (1984). Cf. Lehiy v. State, 501 N.E.2d 451 (Ind. App. 1986), adopted and aff'd, 509 N.E.2d 1116 (Ind. 1987) (limiting prior acts showing depraved sexual instinct to acts of sodomy and incest).\n\nWe recognized in Dolin that there are occasions when prior sexual acts could be admissible under W.Va.R.Evid. 404(b). We cited State v. Pancake, W.Va. , 296 S.E.2d 37 (1982), where we held that prior forcible acts against the victim or other persons known to the victim could be shown to establish the victim's fear of her attacker. See also State v. Lucas, W.Va. , 364 S.E.2d 12 (1987); State v. Miller, W.Va. , 336 S.E.2d 910 (1985). Dolin also acknowledged the specific exceptions for admission of character evidence under W.Va.R.Evid. 404(b). Thus, there are several purposes for which evidence of collateral acts involving prior sexual episodes are properly admissible, but none approach the lustful Disposition exception adopted by the majority despite its rejection by almost every other jurisdiction.\n\nAnother point the majority ignores is the balancing test that has heretofore applied to the admission of W.Va.R.Evid. 404(b) evidence. In Syllabus Points 15 and 16 of State v. Thomas, 157 W.Va. 640, 203 S.E.2d 445 (1974), we outlined how to use the balancing test:\n\n\"15. In the proper exercise of discretion, the trial court may exclude evidence of collateral crimes and charges if the court finds that its probative value is outweighed by the risk that its admission will create substantial danger of undue prejudice or confuse the issues or mislead the jury or unfairly surprise a party who has not had reasonable ground to anticipate that such evidence would be offered.\n\n\"16. In the exercise of discretion to admit or exclude evidence of collateral crimes and charges, the overriding considerations for the trial court are to scrupulously protect the accused in his right to a fair trial while adequately preserving the right of the State to prove evidence which is relevant and legally connected with the charge for which the accused is being tried.\"\n\nWe have consistently followed Thomas and have recognized that the balancing test is now embodied in W.Va.R.Evid. 403. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e See, e.g., State v. Hanna, 180 W.Va. 598, 378 S.E.2d 640 (1989); State v. Stacy, , 371 S.E.2d 614 (1988); State v. Johnson, W.Va. , 371 S.E.2d 340 (1988); State v. Dolin, supra; State v. Nicholson, 162 W.Va. 750, 252 S.E.2d 894 (1979), overruled on other grounds, State v. Petry, 166 W.Va. 153, 273 S.E.2d 346 (1980). Other jurisdictions uniformly agree that before evidence of collateral acts is admissible, its probative value must be weighed against its prejudicial effect to the defendant. See, e.g., United States v. Johnson, 893 F.2d 451 (1st Cir. 1990); United States v. Scarfo, 850 F.2d 1015 (3rd Cir.), cert. denied, 488 U.S. 910, 102 L. Ed. 2d 251, 109 S. Ct. 263 (1988); United States v. Conners, 825 F.2d 1384 (9th Cir. 1987); United States v. Cuch, 842 F.2d 1173 (10th Cir. 1988); Getz v. State, supra; State v. Just, 184 Mont. 262, 602 P.2d 957 (1979); State v. Micko, 393 N.W.2d 741 (N.D. 1986).\n\nMoreover, as we held in Syllabus Point 3 of Dolin, the trial court should conduct an in camera hearing to determine whether the prejudicial effect of the collateral act evidence outweighs its probative value. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Furthermore, in Syllabus Point 9 of that opinion, we explained that it is customary to give a limiting instruction to the jury that the collateral evidence is not offered to prove guilt of the present crime, but is to be considered exclusively in determining the particular issue on which it is properly offered, e.g., identity, intent, motive, etc. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e The rule that evidence of collateral crimes is not admissible to prove guilt of the crime charged, but rather only to bear on subordinate issues such as system, motive, or intent, is black letter law and is explicitly stated in W.Va.R.Evid. 404(b). See United States v. Steele, 727 F.2d 580 (6th Cir.), cert. denied, Scarborough v. United States, 467 U.S. 1209, 81 L. Ed. 2d 353,, 104 S. Ct. 2396 (1984); United States v. Bartley, 855 F.2d 547 (8th Cir. 1988); State v. Ramirez Enriquez, 153 Ariz. 431, 737 P.2d 407 (App. 1987); State v. Walls, 541 A.2d 591 (Del. 1987), cert. denied, 493 U.S. 967, 107 L. Ed. 2d 377, 110 S. Ct. 412 (1989); State v. Guinn, 114 Idaho 30, 752 P.2d 632 (App. 1988); Commonwealth v. Madyun, 17 Mass. App. 965, 458 N.E.2d 745 (1983); State v. Paige, 316 N.C. 630, 343 S.E.2d 848 (1986).\n\nSeveral courts have suggested that admission of evidence of prior collateral acts of the defendant is best deferred until after the defendant's case, in order to see whether intent, motive, or identity are actually disputed. See, e.g., United States v. Benedetto, 571 F.2d 1246 (2d Cir. 1978). In this case, none of these safeguards were followed, mainly because defendant's trial counsel neglected to raise an objection to this inflammatory and prejudicial evidence. I will address this failure in Part VI(C).\n\nIII.\n\nAlso rather astounding to me is the majority's footnote 24 \"limiting\" (but for all intents overruling) State v. McCoy, 179 W.Va. 223, 366 S.E.2d 731 (1988). \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e In that unanimous two-year-old opinion, we held in Syllabus Point 2 that a qualified expert could opine that the victim of a sexual assault suffered from rape trauma syndrome, \"but the expert may not give an opinion, expressly or implicitly, as to whether or not the alleged victim was raped.\" \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nIn isolation, it is possible to read the majority's footnote 24 to apply only to a situation where the physician, after making a physical examination of the victim, states that there are physical findings that are consistent with a person having been raped or sexually assaulted. Such a Conclusion is entirely permissible. However, this rule would not require the limitation on McCoy.\n\nThe confusion springs from Syllabus Point 7 of the majority opinion which states, rather perplexingly, that \"an expert may state an opinion as to whether the child comports with the psychological and behavioral profile of a child sexual abuse victim, and may offer an opinion based on objective findings that the child has been sexually abused.\" \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e (Emphasis added). I cannot reconcile the majority's statement in footnote 24 that \"physical findings\" might enable a physician to conclude that sexual abuse had occurred with its shift to the broader phrase \"objective findings\" in Syllabus Point 7.\n\nIn this case, the psychologist, Mr. Trainor, did not see the children until two years after the alleged abuse incidents. He made no physical examination of the children and did not state that there were physical findings consistent with sexual abuse. Instead, Mr. Trainor's testimony about his observation of the children and their behavioral characteristics was quite similar to that condemned in McCoy. He gave his permissible opinion that the children suffered from child abuse syndrome. However, the State went beyond this point and asked Mr. Trainor directly if, in his opinion, the children had been sexually abused; he responded in the affirmative.\n\nIn McCoy, the conviction was reversed because the expert indicated that the victim had been raped. Not only does this type of unfounded opinion bolster the credibility of the victim's testimony, a point that we emphasized in McCoy, but where, as here, the identity of the perpetrator is undisputed, it purports to directly prove the ultimate issue of guilt. Furthermore, because of the expert's credentials, his opinion carries with it a stamp of scientific legitimacy which obviously will weigh heavily upon the jury.\n\nThe majority offers scant authority for its new position. It relies chiefly on State v. Myers, 359 N.W.2d 604 (Minn. 1984), in which the expert was not asked the ultimate question on whether in his opinion the child had been sexually abused. The expert testified only that the child exhibited characteristics consistent with sexual abuse. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Moreover, in footnote 25, W.Va. at , S.E.2d at (Slip op. at 30), the majority incorrectly suggests that the Minnesota court sanctioned the prosecutor's eliciting the expert's opinion as to the truthfulness of the victim. This line of questioning was only sanctioned because the defense challenged the victim's credibility during cross-examination. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nMyers only permitted expert testimony to explain the often erratic and ambivalent conduct of sexually abused children. Significantly, the Myers opinion cites with approval its earlier case of State v. Saldana, 324 N.W.2d 227 (Minn. 1982), where the Minnesota Supreme Court ruled that expert testimony regarding rape trauma syndrome was inadmissible because such \"testimony furnishes no assistance to jurors, who are as capable as the expert in assessing the credibility of the alleged adult rape victim.\" 359 N.W.2d at 610. The Minnesota Supreme Court in Myers simply did not adopt the rule, espoused by the majority, that a psychological expert can opine that a child victim had been physically abused.\n\nThe majority also cites State v. Kim, 64 Haw. 598, 645 P.2d 1330 (1982); however, this case dealt solely with expert testimony regarding the credibility of the child abuse victim. As in Myers, the Kim court permitted this testimony only after the defendant had attacked the victim's credibility. The same credibility issue was involved in State v. Middleton, 294 Or. 427, 657 P.2d 1215 (1983), and State v. Geyman, 224 Mont. 194, 729 P.2d 475 (1986), also cited by the majority. The same cases relied on by the majority were used by the Ohio Court of Appeals in State v. Timperio, 38 Ohio App. 3d 156, 528 N.E.2d 594 (1987), which talked about the credibility issue, but failed to discuss the implications of the expert's opinion that the child had been sexually abused.\n\nCertainly, the majority's reliance on Kim is misplaced. Indeed, the majority does not attempt any analysis of the credibility issue under the appropriate beginning point, W.Va.R.Evid. 608(a), which limits attacks on credibility \"by evidence in the form of opinion or reputation, but subject to these limitations: (1) the evidence may refer only to character for truthfulness or untruthfulness.\" \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e Indeed, the Utah Supreme Court in State v. Rimmasch, 775 P.2d 388, 392 (Utah 1989), was sharply critical of Kim's failure to properly analyze Rule 608(a):\n\n\"[Rule 608(a)] represents an important policy choice: it prevents trials from being turned into contests between what would amount to modern oath-helpers who would largely usurp the fact-finding function of Judge or jury. State v. Moran, 151 Ariz. 378, 382, 728 P.2d 248, 252 (1986). The overwhelming majority of courts have expressly or impliedly rejected Kim. We join these courts and hold that rule 608(a)(1) bars admission of an expert's testimony as to the truthfulness of a witness on a particular occasion.\" \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nIt is impossible from the majority's opinion to state with any degree of accuracy what its view is on this issue. I take some comfort from the last sentence of Syllabus Point 7 that the majority does not sanction an expert expressing an opinion as to the child's credibility: \"Such an expert may not give an opinion as to whether he personally believes the child, nor an opinion as to whether the sexual assault was committed by the defendant, as this would improperly and prejudicially invade the province of the jury.\" \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e Certainly, as illustrated by the Utah Supreme Court's careful analysis in Rimmasch, the expert should not be able to give an opinion as to the truthfulness of the victim.\n\nFinally, while some courts have permitted a qualified expert to testify that a child victim of sexual abuse displays symptoms of the typical child abuse profile, there is almost universal agreement that the expert is not entitled either to express an opinion as to the truthfulness of the victim or to state, in the absence of physical findings, that the child has been sexually abused. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e The majority's position is, simply put, wrong.\n\nIV.\n\nYet another point overlooked by the majority is the threshold question of whether the expert's testimony with regard to the child abuse syndrome had the necessary degree of scientific reliability to render it admissible. This issue was unfortunately not raised by defense counsel at trial and is part of the ineffective assistance of counsel claim that I discuss in Part VI, (infra).\n\nThe majority instead cites W.Va.R.Evid. 702, which generally permits expert testimony if it \"will assist the trier of fact to understand the evidence or to determine a fact in issue.\" \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e We have never interpreted W.Va.R.Evid. 702 as an open door to admit any supposed scientific testimony without some inquiry into its reliability. Before the adoption of W.Va.R.Evid. 702, we formulated two general rules on the admissibility of scientific tests in Syllabus Points 7 and 8 of State v. Clawson, 165 W.Va. 588, 270 S.E.2d 659 (1980):\n\n\"7. In order for a scientific test to be initially admissible, there must be general acceptance of the scientific principle which underlies the test.\n\n\"8. There are certain scientific tests that have been widely used over a long period of time, such that their general acceptance in the scientific community can be judicially noticed.\"\n\nSince the adoption of W.Va.R.Evid. 702, we have acknowledged that its adoption may have liberalized the admissibility of scientific tests. See State v. Armstrong, 179 W.Va. 435, 369 S.E.2d 870 (1988); State v. McCoy, 179 W.Va. 223, 366 S.E.2d 731 (1988). Our most recent case, State v. Woodall, 182 W.Va. 15, 385 S.E.2d 253 (1989), sets forth the approach used under W.Va.R.Evid. 702 in Syllabus Points 1 and 2:\n\n\"1. Under W.Va.R.Evid., Rule 702, expert testimony concerning generally recognized tests is presumptively admissible and the burden of excluding such testimony is upon the side seeking exclusion. However, when a test is novel or not generally accepted, that circumstance alone meets the threshold requirement of rebutting any presumption of admissibility under Rule 702 and, therefore, with regard to tests that are not generally accepted the burden of proof that the test is reliable remains on the proponent.\n\n\"2. When senior appellate courts have concluded that a test is generally accepted by the scientific community, a trial court may take judicial notice of a test's reliability.\"\n\nIn the present case, the State made no attempt to demonstrate the reliability of the so-called \"child sexual abuse profile.\"\n\nThe Utah Supreme Court addressed this precise issue in State v. Rimmasch, 775 P.2d 388, 400 (Utah 1989), and observed that there was an absence of any \"unanimity in the legal community as to the inherent reliability of a child sexual abuse profile to show that abuse has actually occurred with respect to a specific alleged victim.\" \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e The court in Rimmasch surveyed scientific literature in this area and came to these Conclusions in reversing the conviction:\n\n\"Not only is there a lack of any consensus about the ability of the profile to determine abuse, but the scientific literature raises serious doubts as to the reliability of profile testimony when used for forensic purposes to demonstrate that abuse actually occurred. Scholars acknowledge that no uniformly identifiable psychological profile applies to sexually abused children as a class. . . .\n\n\"Suffice it to say, then, that the literature in the area is disparate and contradictory and that child abuse experts have been unable to agree on a universal symptomology of sexual abuse, especially a precise symptomology that is sufficiently reliable to be used confidentially in a forensic setting as a determinant of abuse. See Cerkovnik, The Sexual Abuse of Children: Myths, Research, and Policy Implications, 89 Dick.L.Rev. 691, 705-08 (1985) (compilation of studies on victims of sexual abuse); [Note, The Unreliability of Expert Testimony on the Typical Characteristics of Sexual Abuse Victims, 74 Geo.L.J. 429) at 439-48 ((1985)).\" 775 P.2d at 401. (Footnote omitted). \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nIn this case, the State made no attempt to establish the reliability of the expert testimony under the Clawson-Woodall standard for admissibility. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nV.\n\nThe majority has also mishandled the mother's hearsay testimony recounting what her son told her. In addressing the mother's recitation of her son's out-of-court statement, the majority says it \"must look at the requirements . . . . under W.Va. R. Evid. 803(24)\" and then quotes the general language of Syllabus Point 5 of State v. Smith, W.Va. , 358 S.E.2d 188 (1987). \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e From its citation, I think that at least the majority agrees that the mother's recitation of her son's out-of-court statements was hearsay.\n\nThe age-old rule is that a witness' in-court testimony about an out-of-court statement, if offered to prove the truth of the matter asserted, is hearsay, and is not made admissible merely because the declarant testifies and is available for cross-examination. The Second Circuit Court of Appeals in United States v. Pedroza, 750 F.2d 187, 200 (2d Cir. 1984), cert. denied, Pelaes v. United States, 479 U.S. 842, 93 L. Ed. 2d 92, 107 S. Ct. 151 (1986), quoting from its earlier decision in United States v. Check, 582 F.2d 668, 675 (2d Cir. 1978), agreed with this analysis:\n\n\"'The federal courts do not recognize any exception to the hearsay rule, or, except in the limited circumstances set forth in Fed.R.Evid. 801(d), any exclusion from the definition of hearsay, which would permit testimony in court relating to the prior out-of-court statements of a witness merely because the witness is available at trial for cross-examination and subject to cross-examination concerning those statements.'\" \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nSee also People v. Davis, 130 Ill. App. 3d 41, 85 Ill. Dec. 19, 473 N.E.2d 387 (1984); Daly v. State, 99 Nev. 564, 665 P.2d 798 (1983); State v. Velasquez, 672 P.2d 1254 (Utah 1983).\n\nFurthermore, I believe that any attempt to utilize the hearsay residual exception in W.Va.R.Evid. 803(24) to shoehorn the mother's testimony into admissibility is unavailing. In Smith, where we discussed this exception and its counterpart, Rule 804(b)(5), we warned \"that Rule 803(24) and 804(b)(5) cannot be viewed as an open door to thrust hearsay statements into a trial.\" W.Va. at , 358 S.E.2d at 198. Our rule is identical to the corresponding federal rule of evidence. The notes of the Senate Committee on the Judiciary as to the intended scope of this residuary exception are telling:\n\n\"It is intended that the residual hearsay exceptions will be used very rarely, and only in exceptional circumstances. The committee does not intend to establish a broad license for trial Judges to admit hearsay statements that do not fall within one of the other exceptions contained in Rule 803 and 804(b). The residual exceptions are not meant to authorize major judicial revisions of the hearsay rule, including its present exceptions. Such major revisions are best accomplished by legislative action.\" Committee on the Judiciary, S. Rep. No. 93-1277, Note to Paragraph (24), 28 U.S.C.A. F.R.Evid. 583 (1975).\n\nE.g., United States v. Kim, 193 U.S. App. D.C. 370, 595 F.2d 755 (D.C. Cir. 1979); United States v. Bailey, 581 F.2d 341 (3rd Cir. 1978).\n\nIn this case the out-of-court declarant, the son, was available and did testify. Consequently, there was absolutely no necessity to have the mother testify as to the child's out-of-court statements. It is true that from a purely technical standpoint, W.Va.R.Evid. 803(24) does not require that the out-of-court declarant be unavailable, as does its counterpart in W.Va.R.Evid. 804(b)(5). Nevertheless, several courts that have had occasion to consider this particular point have held that there is an implied requirement of unavailability.\n\nThis implication arises from language in W.Va.R.Evid. 803(24) that the proponent of out-of-court statements must demonstrate that the statement \"is more probative on the point for which it is offered than any other evidence which the proponent can procure through reasonable efforts.\" Thus, in United States v. Mathis, 559 F.2d 294, 299 (5th Cir. 1977), the court found that the trial Judge erred in admitting an extrajudicial statement of an available witness under Rule 803(24):\n\n\"Although the introductory clause of Rule 803 appears to dispense with availability, this condition re-enters the analysis of whether or not to admit statements into evidence under the last subsection of Rule 803 because of the requirement that the proponent use reasonable efforts to procure the most probative evidence on the points sought to be proved. Rule 803(24), thus, has a built-in requirement of necessity. Here there was no necessity to use the statements when the witness was within the courthouse.\"\n\nSee also State v. Taylor, 684 F.2d 1193 (6th Cir. 1982), cert. denied, 460 U.S. 1053, 75 L. Ed. 2d 932, 103 S. Ct. 1501 (1983); Cummins v. State, 515 So. 2d 869 (Miss. 1987); Daly v. State, supra; State v. Smith, 315 N.C. 76, 337 S.E.2d 833 (1985); State v. Velasquez, 672 P.2d 1254 (Utah 1983).\n\nThe cases cited by the majority for the proposition that courts use the exception to W.Va.R.Evid. 803(24) to permit third parties to testify to child abuse victims' out-of-court statements are not persuasive. In United States v. Dorian, 803 F.2d 1439 (8th Cir. 1986), State v. Robinson, 153 Ariz. 191, 735 P.2d 801 (1987), and State v. Brown, 341 N.W.2d 10 (Iowa 1983), the child victims were found incompetent to testify and, therefore, \"unavailable.\" W.Va.R.Evid. 804(b)(5) would come into play in these circumstances. We must also remember that our rules of evidence are written for all cases and must be more narrowly construed in the criminal than in the civil arena. This is because in a criminal case where the victim does not testify, a Sixth Amendment Confrontation Clause consideration would arise. None of the majority's cases held that a Confrontation Clause violation had occurred, but none had the benefit of the United States Supreme Court's recent decision in Idaho v. Wright, 497 U.S. 805, 111 L. Ed. 2d 638, 110 S. Ct. 3139 (1990), which decided that in this type of situation the Confrontation Clause was violated.\n\nUnited States v. Renville, 779 F.2d 430 (8th Cir. 1985) typifies the confusion that can be encountered in addressing this issue. Renville involved testimony of a deputy sheriff who offered the out-of-court statement of the child victim identifying the defendant as the abuser. The victim also testified to this fact at trial. The defendant denied any responsibility for the act. The court, instead of finding that the out-of-court statement was one of identification and thus admissible under W.Va.R.Evid. 801(d)(1)(C), \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e proceeded to discuss only the trustworthiness of the statement under W.Va.R.Evid. 803(24).\n\nBesides confusion, the majority's opinion demonstrates that the majority fails to understand the extremely limited purpose of the residual hearsay exception. Where the out-of-court declarant is unavailable to testify, but his statement provides a key piece of evidence, it is absolutely crucial to determine whether the strictures of W.Va.R.Evid. 804(b)(5) can be met. Even then, it is gravely doubtful that the Sixth Amendment confrontation question can also be satisfactorily resolved. See Idaho v. Wright, supra.\n\nI cannot conceive that W.Va.R.Evid. 803(24) was designed to provide a means of corroborating the in-court testimony of a witness by permitting third parties to come forward at trial and testify that the witness had told them a similar story in a prior out-of-court conversation. Had that been the intent of the rule, it certainly could have been better expressed.\n\nI daresay that if a defendant sought to use this tactic, it would be rejected. This point is aptly illustrated in two Mississippi Supreme Court cases announced within one month of each other. In Clanton v. State, 539 So. 2d 1024 (Miss. 1989), the court rejected the defendant's efforts to introduce two out-of-court statements he made to police officers wherein he said that the victim had consented to have sex with him. The court rejected the statements because they were hearsay and were consistent with the defendant's trial testimony. \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e The defendant's reliance on Rule 803(24) was dismissed almost out of hand. \"Clanton overlooks 803(24)(B) which requires that 'the statement is more probative on the point for which it is offered than any other evidence which the proponent can produce through reasonable efforts.'\" 539 So.2d at 1028.\n\nOn the other hand, in Mitchell v. State, 539 So.2d 1366 (Miss. 1989), the issue was whether two witnesses to whom the child victim had related her story of abuse could testify as to these statements. The child victim testified at trial. The court concluded that these statements had been admitted under a wrong theory, but suggested that upon a proper analysis they might be admitted under Mississippi's counterpart to Rule 803(24). \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e I find this disparate treatment irrational and disturbing.\n\nFinally, I believe that even if we assume that W.Va.R.Evid. 803(24) is applicable, the evidence in this case does not meet the strictures of the rule. The majority overlooks the Supreme Court's opinion in Idaho v. Wright, supra, which dealt with Idaho's counterpart to Rule 803(24). The issue before the Supreme Court involved the Confrontation Clause because the child victim did not testify. \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e Her statements about the alleged sexual abuse were related at trial by a pediatrician. The Supreme Court's analysis bore a striking parallel to the requirements of W.Va.R.Evid. 803(24):\n\n\"The crux of the question presented is therefore whether the State, as the proponent of evidence presumptively barred by the hearsay rule and the Confrontation Clause, has carried its burden of proving that the younger daughter's incriminating statements to Dr. Jambura bore sufficient indicia of reliability to withstand scrutiny under the Clause.\" 497 U.S. at , 111 L. Ed. 2d at 652-53, 110 S. Ct. at 3147.\n\nThe United States Supreme Court began its analysis by recognizing that Rule 803(24) is not \"a firmly rooted hearsay exception . . . [that] satisfies the constitutional requirement of reliability because of the weight accorded long-standing judicial and legislative experience in assessing the trustworthiness of certain types of out-of-court statements.\" 497 U.S. at , 111 L. Ed. 2d at 653, 110 S. Ct. at 3147. (Citations omitted). The Supreme Court went on to determine that the State must show \"particularized guarantees of trustworthiness.\" 497 U.S. at , 111 L. Ed. 2d at 655, 110 S. Ct. at 3147. \"The circumstantial guarantees of trustworthiness on which the various specific exceptions to the hearsay rule are based are those that existed at the time the statement was made and do not include those that may be added by using hindsight.'\" 497 U.S. at , 111 L. Ed. 2d at 655, 110 S. Ct. at 3149, quoting Huff v. White Motor Corp., 609 F.2d 286, 292 (7th Cir. 1979).\n\nFollowing this point, the Supreme Court in Wright took pains to point out that the \"evidence . . . must possess indicia of reliability by virtue of its inherent trustworthiness, not by reference to other evidence at trial.\" 497 U.S. at , 111 L. Ed. 2d at 657, 110 S. Ct. at 3150. (Citations omitted). The majority's rejection in Idaho v. Wright of consideration of corroborating evidence to enhance the reliability of the out-of-court statement sparked the Dissent. The majority made this unequivocal statement:\n\n\"In short, the use of corroborating evidence to support a hearsay statement's 'particularized guarantees of trustworthiness' would permit admission of a presumptively unreliable statement by bootstrapping on the trustworthiness of other evidence at trial . . . .\" 497 U.S. at 111 L. Ed. 2d at 657, 110 S. Ct. at 3150.\n\nBecause the hearsay exception embodied in W.Va.R.Evid. 803(24) has no historical guarantee of trustworthiness, it is presumptively unreliable. In order to overcome this presumption, before a statement will be admitted under W.Va.R.Evid. 803(24), it must meet the strict test of Wright.\n\nAnother problem with the mother's recitation of the son's story is that no one attempted to elicit any coherent statement of what the child said to her. According to the mother's trial testimony, in October, 1984, she noticed her son, who was then five years of age, \"constantly bouncing on the floor, at times I'd catch him ridin' the chair arms, and, I just knew it wasn't natural.\"\n\nShe spoke about the behavior to a neighbor, who agreed to baby-sit her two other children. While giving her son a bath, the mother then asked why he was bouncing up and down, and he told her that \"daddy told me to do it, it feels good.\" She then inquired if daddy had said or done anything else. The mother testified that the child stated he could not tell her. She asked if he could tell the neighbor, \"Aunt Kika.\" According to the mother, the child's response was, \"well, daddy didn't say I couldn't tell nobody except you, mommy.\" The mother then asked \"Aunt Kika\" to come into the room, and, according to the mother, the child then disclosed the sexual abuse incident. \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nIf the analysis begins as suggested in Wright, that \"the Supreme Court of Idaho properly focused on the presumptive unreliability of the out-of-court statements,\" 497 U.S. at 111 L. Ed. 2d at 659, 110 S. Ct. at 3152, then there is little to lend any reliability to the declarant's statement. The statement was not made soon after the event. It was not spontaneous or even made in a volunteered sense, because it came about as a result of interrogation by the mother. The Supreme Court in Wright placed special emphasis on this latter point by stating that \"we note that it is possible that '[i)f there is evidence of prior interrogation, prompting, or manipulation by adults, spontaneity may be an inaccurate indicator of trustworthiness.'\" 497 U.S. at , 111 L. Ed. at 659-60, 110 S. Ct. at 3152, quoting State v. Robinson, 153 Ariz. 191, 201, 735 P.2d 801, 811 (1987).\n\nI am convinced that there is no evidence to compel the Conclusion that the child's statement to the mother had the \"particularized guarantee of trustworthiness\" necessary to admit it under Rule 803(24) as circumscribed by the Confrontation Clause. \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e This guarantee of trustworthiness is set out as the primary factor in Syllabus Point 5 of State v. Smith, supra, which outlines the requirement for admissibility under Rule 803(24): \"First and most important is the trustworthiness of the statement which must be equivalent to the trustworthiness underlying the specific exceptions to the hearsay rule.\"\n\nV.\n\nIn its rush to throw a blanket of approval over the hearsay testimony of the psychologist, Mr. Trainor, the majority misunderstands the purpose of W.Va.R.Evid. 803(4), involving statements made to a physician for purposes of medical diagnosis or treatment. The two-part test set out in Syllabus Point 5 of the majority opinion misconceives the requirements of the rule. \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e The initial language of W.Va.R.Evid. 803(4) is \"statements made for the purpose of medical diagnosis or treatment.\" \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\nAs this language indicates by the disjunctive \"or,\" there are two alternate grounds for permitting testimony by a physician of statements made to him by patients. A patient's statement to a treating physician as to present and past mental and physical conditions, including causative factors, have always been admitted, because the patient has a selfish interest to speak truthfully in order to receive appropriate treatment. This \"self interest\" guarantees the trustworthiness of the out-of-court statements. See generally E. Cleary, McCormick on Evidence  292 (3d ed. 1984); Annot., 37 A.L.R.3d 778 (1971 \u0026 Supp. 1990). We recognized this exception in Syllabus Point 8 of Sutherland v. Kroger Co., 144 W.Va. 673, 110 S.E.2d 716 (1959). \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nPrior to the adoption of W.Va.R.Evid. 803(4), courts consistently held that statements made by the patient to a nontreating physician who examined the patient for purposes of trial testimony were not admissible. See generally E. Cleary, (supra) at  293. We adhered to this view in Syllabus Point 9 of Sutherland. \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\n\nThe adoption of Fed.R.Evid. 803(4) and its accompanying committee note explanation has resulted in a broadening of this hearsay exception to include statements made to a physician consulted for the purpose of diagnosis when no treatment is anticipated by the declarant. \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e See generally, R. Mosteller, Child Sexual Abuse and Statements For the Purpose of Medical Diagnosis or Treatment, 67 N.C.L. Rev. 257 (1986). I think the majority has failed to grasp the separate, alternative grounds available under W.Va.R.Evid. 803(4). This failure stems from its reliance on Morgan v. Foretich, 846 F.2d 941 (4th Cir. 1988). Morgan followed the two-part test set out in United States v. Renville, 779 F.2d 430 (8th Cir. 1985), which joins the alternative grounds for admissibility to make a combined two-part test, \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e in which the physician may occupy both roles, i.e., as a treating physician and as one who also gives a diagnosis.\n\nAside from the majority's incorrect legal analysis, I doubt from my reading of Mr. Trainor's rambling account of his contact with the children that he was a treating physician. The State did not attempt to establish a foundation that he was a treating physician by showing what treatment he actually rendered. Likewise, the State did not attempt to isolate what statements the children actually made to him.\n\nMr. Trainor's testimony suggests that on his first contact with the case, the sexual abuse story was told to him by the mother. He then began to work with the children, particularly the son who was not able to talk about the abuse. \u003cspan class=\"fnref\"\u003e34\u003c/span\u003e Certainly, the mother's statements given to Mr. Trainor about what her son had told her do not qualify as a patient's statement under W.Va.R.Evid. 803(4). I cannot help but conclude that Mr. Trainor began his \"treatment\" with his \"diagnosis\" a foregone Conclusion.\n\nOther courts have expressed concern that where very young children are involved whose testimonial competence is questionable, and no physical findings of abuse are involved, the physician's testimony as to statements supposedly made by the children may not be admissible. At their young age, children can lack the maturity to appreciate the link between their statement and the treatment. Cassidy v. State, 74 Md. App. 1, 536 A.2d 666, cert. denied, 312 Md. 602, 541 A.2d 965 (1988). Colorado courts have required the State to demonstrate in camera that very young children understand the obligation to provide the doctor with accurate information in order for the statements to be admissible under its counterpart to W.Va.R.Evid. 803(4). See Oldsen v. People, 732 P.2d 1132 (Colo. 1986); W.C.L. v. People, 685 P.2d 176 (Colo. 1984).\n\nMr. Trainor was never specifically directed to define his role or to separate what the children actually told him from what their mother said that she had been told. Further confusion arose when he discussed general characteristics of the child abuse syndrome without explaining whether they were present in the case at hand. I discussed the foundation deficiency of his opinion in Part III, (supra) . Defense counsel made no pertinent objections on any of these points.\n\nVII.\n\nA.\n\nThe majority brushes aside the defendant's claim of ineffective assistance of counsel. However, the record is replete with incidents where counsel not only failed to object to evidentiary matters, but also to substantive issues that might well have produced a different result at trial or on this appeal. In addition, counsel questioned witnesses in such a faulty manner as to award the prosecution an erroneous and unwarranted advantage. I find it impossible to conclude that counsel's error can be washed away under the rubric of strategy and tactics.\n\nFirst, the record discloses that the two child victims were permitted to testify by way of a closed-circuit television. The child witness was placed in the Judge's office with a television camera. The defendant, attorneys, Judge, and jury were in the courtroom where they could view the television screen and hear the questions and the child's answers. They could not be seen by the child witness. For some unexplained reason, in the Judge's office with the witness was a state trooper who, according to the record, had participated in the investigation. This entire arrangement was by agreement between the prosecutor and defense counsel.\n\nThe Sixth Amendment guarantees that \"in all criminal proceedings, the accused shall enjoy the right . . . to be confronted with the witnesses against him.\" U.S. Const. amend. VI. As the United States Supreme Court explained in California v. Green, 399 U.S. 149, 157, 26 L. Ed. 2d 489, 496, 90 S. Ct. 1930, 1934 (1970): \"Our own decisions seem to have recognized at an early date that it is this literal right to 'confront' the witness at the time of trial that forms the core of the values furthered by the Confrontation Clause.\"\n\nIn Coy v. Iowa, 487 U.S. 1012, 101 L. Ed. 2d 857, 108 S. Ct. 2798 (1988), the Supreme Court found the Sixth Amendment right of confrontation was violated when the trial court permitted the sexually abused child witness to be screened from the defendant while testifying, even though the witness could be observed by the jury. We followed Coy's dictates in Syllabus Point 5 of State v. Murray, 180 W.Va. 41, 375 S.E.2d 405 (1988):\n\n\"Under Coy v. Iowa, 487 U.S. [1012], 487 U.S. 1012, 108 S. Ct. 2798, 101 L. Ed. 2d 857 (1988), and State ex rel. Grob v. Blair, 158 W.Va. 647, 214 S.E.2d 330 (1975), the right to confrontation assured by the Sixth Amendment and W.Va. Const. art. III,  14 is violated where a witness testifies at trial and the defendant is denied the opportunity to confront the witness face-to-face.\"\n\nWe acknowledged in Murray the Supreme Court's caveat in Coy that \"we leave for another day, however, the question whether any exceptions exist. Whatever they may be, they would surely be allowed only when necessary to further an important public policy.\" State v. Murray, W.Va. at n.3, 375 S.E.2d at 412 n.3, quoting 487 U.S. at 1021, 101 L. Ed. 2d at 867, 108 S. Ct. at 2803.\n\nThis issue is weighty and difficult. In any event, by failing to raise a Sixth Amendment right of confrontation objection, counsel made a grievous mistake. I recognize that, after this case was tried, the United States Supreme Court held in a 5-4 opinion that in certain instances live television testimony is permissible at trial by a child who is a victim of sexual abuse. Maryland v. Craig, 497 U.S. 836, 111 L. Ed. 2d 666, 110 S. Ct. 3157 (1990). However, Craig does not grant a blanket approval of this technique. In order to invoke the procedure, the Supreme Court decided that it must be shown that an important state interest could be furthered: \"We likewise conclude today that a State's interest in the physical and psychological well-being of child abuse victims may be sufficiently important to outweigh, at least in some cases, a defendant's right to face his or her accusers in court.\" 497 U.S. at , 111 L. Ed. 2d at 683, 110 S. Ct. at 3167. The Supreme Court went on in Craig to spell out in some detail how a requisite finding should be made:\n\n\"The requisite finding of necessity must of course be a case-specific one: the trial court must hear evidence and determine whether use of the one-way closed circuit television procedure is necessary to protect the welfare of the particular child witness who seeks to testify. . . . The trial court must also find that the child witness would be traumatized, not by the courtroom generally, but by the presence of the defendant. . . . Finally, the trial court must find that the emotional distress suffered by the child witness in the presence of the defendant is more than de minimus, i.e., more than 'mere nervousness or excitement or some reluctance to testify,' Wildermuth [v. State], 310 Md. [496], 524, 530 A.2d [275] at 289 [(1987)]; see also State v. Mannion, 19 Utah 505, 511-512, 57 P. 542, 543-544 (1899).\" 497 U.S. at , 111 L. Ed. 2d at 685, 110 S. Ct. at 3169. (Citations omitted).\n\nFurthermore, the Supreme Court took pains to emphasize that the procedures used must ensure\n\n\"the reliability of the evidence by subjecting it to rigorous adversarial testing and thereby preserving the essence of effective confrontation. Because there is no dispute that the child witnesses in this case testified under oath, were subject to full cross-examination, and were able to be observed by the Judge, jury, and defendant as they testified, we conclude that, to the extent that a proper finding of necessity has been made, the admission of such testimony would be consonant with the Confrontation Clause.\" 497 U.S. 836, 111 L. Ed. 2d at 686, 110 S. Ct. at 3170.\n\nIn the present case, no objection was made to the testimony by closed-circuit television, and there is no record of whether the initial requisite finding could be met. In Craig, there was expert testimony regarding the particular trauma that the child witnesses would have experienced if forced to confront the defendant face to face.\n\nA further critical point is embedded in this case which was not present in Craig. Here, the child witness was in the room with an adult who was one of the State's investigating officers. I do not believe that any court would sanction this type of procedure. With the officer not on camera, the potential for him to influence the child witness by head nodding or other signals without detection by the court or jury is available. In short, I do not believe that the procedure used in this case comports with Craig, and I believe that a violation of the Sixth Amendment right of confrontation has occurred.\n\nB.\n\nI have previously addressed the admissibility of the expert's testimony in Part IV, (supra) . Counsel made no objection to the reliability of the expert's so-called tests that led to his child abuse profile. As a consequence, the State was never required to prove this threshold issue. Moreover, no objection was made to Mr. Trainor's Conclusion that the children had been the victims of sexual abuse even though there were no physical findings of abuse. These omissions clearly demonstrate the inadequacy of trial counsel's representation.\n\nC.\n\nAs I discussed in Part II, defense counsel made no attempt to preclude the prosecution from offering evidence of collateral crimes under W.Va.R.Evid. 404(b). Counsel did not request an in camera hearing to determine if the prejudicial effect of this testimony outweighed the probative value under W.Va.R.Evid. 403 and as required by State v. Dolin, supra. Finally, counsel did not request a cautionary or limiting instruction to the jury that such collateral crimes could not be considered as evidence of guilt. Counsel was totally ineffective in this regard, and there can be no doubt that the defendant was severely prejudiced.\n\nD.\n\nDefense counsel's ill-conceived questioning of witnesses, coupled with the failure to object to the prosecutor's questions, led to devastating results for the defendant.\n\nFirst, the defendant's ex-wife testified that the defendant had made telephone calls to sex clubs. She was not present when the telephone calls were made and did not hear the conversations. Defense counsel made no objection.\n\nThe ex-wife also testified that the defendant had masturbated in front of his son. She did not witness these events, but testified that she had been informed of them by her son approximately two years afterwards. Again, counsel did not object, although it was clear from the very beginning of the ex-wife's testimony that she was going to relate not what she observed, but what was related to her by her son.\n\nDefense counsel's cross-examination of the defendant's ex-wife, who was the State's key witness, and who was hostile towards the defendant, led to some disastrous consequences. Despite defense counsel's failure to object to the direct testimony about the defendant's calls to sex clubs, there was no linkage of these calls to the children until defense counsel asked this question and received the following answer:\n\n\"Q So, that there doesn't appear to be any connection between these phone calls and any abuse of the children, isn't that correct?\n\n\"A That's not true, because my children said that their father made them listen to these phone calls.\"\n\nIn a bizarre attempt to impeach the ex-wife's credibility, defense counsel unaccountably brought into evidence another collateral act of the defendant which involved sex with a dog. Not only was this statement hearsay, but the ex-wife managed to expand on the statement to include the defendant's threat to the son. \u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\n\nFurther unenlightened cross-examination of the ex-wife by defense counsel brought to the jury's attention that the defendant had pulled out his vasectomy stitches because he had been \"playing with himself.\" \u003cspan class=\"fnref\"\u003e36\u003c/span\u003e Even with defense counsel's absence of objections, the State had not tried to introduce these acts on direct examination of the defendant's ex-wife.\n\nFinally, when defense counsel asked the ex-wife whether she and the defendant had a normal sex life, she responded: \"I thought it was normal up until the end, towards the end.\" On redirect, the prosecutor made several more pulverizing points based on defense counsel's \"opening the door\" about the defendant's normal sex life. The prosecutor was able to have the ex-wife describe the defendant's inability to have an orgasm without masturbating. The ex-wife also described the defendant's practice of leaning against the washing machine and masturbating when it was in the spin cycle.\n\nI cannot help but believe that all of this bizarre sexual information would cast the defendant as a monstrous sexual pervert who, in the eyes of the jury, was easily capable of accomplishing the sexual abuse of his children. For defense counsel to bring this information to the attention of the jury by direct and explicit questions defies any logic. In the words of Syllabus Point 21 of State v. Thomas, 157 W.Va. 640, 203 S.E.2d 445 (1974), \"no reasonably qualified defense attorney would have so acted in the defense of an accused.\" \u003cspan class=\"fnref\"\u003e37\u003c/span\u003e\n\nI am at a loss to account for the majority's glossing over of the ineffective assistance of counsel claim.\n\nConclusion\n\nI conclude on a rather elegiac note. Perhaps I have read more into the majority's opinion than was meant; perhaps it did not intend to stand the law in this area on its head. I trust that our circuit Judges and counsel will approach this area with a cautionary balanced view of the law as it exists elsewhere, as I hope it will exist here, and as I have attempted to outline.\n\n\u003cspan class=\"fn\"\u003e1. Consistent with our practice in cases involving sensitive matters, we use the victim's initials. Since, in this case, the victims are related to the appellant, we have referred to the appellant by his last name initial. See Benjamin R. v. Orkin Exterminating Company, Inc., 182 W.Va. 615, 390 S.E.2d 814 n. 1 (1990) (citing In re Jonathan P., 182 W.Va. 302, 387 S.E.2d 537, 538 n. 1 (1989); State v. Murray, 180 W.Va.41, 375 S.E.2d 405, 408 n. 1 (1988).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Appellant's motion for a new trial was denied by the lower court. Appellant was subsequently sentenced on February 2, 1988, to serve two consecutive 15 to 25 year terms on the first degree sexual assault charges and two one to five year terms on each of the first degree sexual abuse charges running concurrently with the assault sentence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. According to Sharon L.'s testimony, the strange behavior exhibited by the boy included constantly bouncing on the floor and riding the chair arms in a sexually suggestive manner.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Mrs. L. contacted Potomac Mental Health seeking counseling for her son based on the information disclosed to Carolyn Durst. They told her to observe him for a period of six months to one year, but did not take him into counseling at this time.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The gynecologist's testimony revealed that she \"found no medical indicators that would either confirm or rule out past sexual abuse,\" but when pressure was put on S. L.'s hymen, the child \"exclaimed that it hurt the same as when her daddy had touched her.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. According to the testimony of the defendant, the magazines were of all different kinds, including Hustler, and many of them \"showed everything,\" as he put it.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Both Fed. R. Evid. 404(b) and W.Va. R. Evid. 404(b) are virtually identical; therefore when discussing situations which involve both the federal and the West Virginia Rule 404(b), we refer to it simply as Rule 404(b).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. See United States v. Beahm, 664 F.2d 414 (4th Cir. 1981); see also Morgan v. Foretich, 846 F.2d 941 (4th Cir. 1988).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The jury had to find, according to the instructions given at trial, in three of the charges against the defendant that the reason the defendant committed the crimes was for the purpose of gratifying his sexual desire.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. See United States v. Masters, 622 F.2d 83, 86 (4th Cir. 1980).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The daughter did testify that between August, 1976, and August, 1978, she had performed oral sex on the defendant \"'maybe once or twice every three months. I can't say just exactly, you know.'\" Dolin, 347 S.E.2d at 211.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. \"Children, particularly those below age seven, conceptualize time differently than do older children and adults. Dates and times -- so important to schedule-bound adults -- are largely irrelevant to young children.\" Myers, Hearsay Statements by the Child Abuse Victim, 38 Baylor L. Rev. 775, 813 n. 120 (1986)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Id. at 901-02 n. 498.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. See Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Jurisdictions have termed such uses in different manners but still have permitted this evidence to show an accused's \"emotional propensity for sexual aberration,\" \"lewd Disposition,\" \"propensity to act out his sexual desires with young girls,\" or \"moral Disposition and perversity.\" See State v. Phillips, 102 Ariz. 377, 379, 430 P.2d 139, 141 (1967); State v. Maestas, 224 N.W.2d 248, 251 (Iowa 1974); State v. Tarrell, 74 Wis.2d 647, 648, 247 N.W.2d 696, 703 (1976); State v. Shively, 172 Ohio St. 128, 131, 174 N.E.2d 104, 107, 15 Ohio Op. 2d 211 (1961).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. The evidence concerning masturbation after sexual intercourse with his wife was elicited by the state from Sharon L. on re-direct. This question was permitted, however, because the defense opened up the issue of the marital sexual relationship. It was clear from the record, however, that in opening this line of inquiry, the defense was attempting to show that the appellant functioned perfectly normally in a marital context, which obviously was intended to dispel the notion that an adult male whose sexual functioning was normal would sexually abuse children.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. See W.Va. R. of Evid. 803(4).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. See W.Va. R. of Evid. 801(c).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The case was reversed and remanded to determine whether the hearsay statements of the victim were admissible under the Rules of Evidence, rather than evidentiary rules set out in case law. Mitchell, 539 So.2d at 1369. Further, the court found that even though Mississippi recognizes a lustful Disposition exception to Rule 404(b), that exception \"specifically limited evidence of other sexual relations to those between the defendant and the particular victim.\" Id. at 1371-72. Therefore, evidence that the defendant had exposed himself to children other than the victim was improperly admitted at trial. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Myers, (supra) note 13 at 896.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Id. at 896 n. 471. See also J. Weinstein and M. Berger, Weinstein's Evidence,  803(24)01, at 803-377 (1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Myers, (supra) note 13 at 896.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Although the defense attorney did not specifically object to the opinion given, she did object to the foundation not being properly laid for the opinion asked by the question.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. We clarify this holding in that McCoy is limited to the facts of that case. Hence, a physician can testify that in his or her opinion, based on physical findings, a particular victim was raped.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. The expert in Myers testified as to the characteristics generally exhibited by victims of sexual abuse and that he had observed those characteristics in the complainant. He further testified that it is extremely rare for children to fabricate incidents of sexual abuse and opined that the victim was truthful in her allegations. Myers, 359 N.W.2d at 609.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. The appellant also appears to question the competency of the children to testify at trial. However, we find that the trial court properly examined the truth-telling abilities of the children at trial and determined that they were competent to testify. We conclude therefore that the trial court properly exercised its discretion on this competency issue. See State v. Stacy, 179 W.Va. 686, 371 S.E.2d 614 (1988).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. We are unable to discern how appellant alleges that this constituted ineffective assistance. Appellant neither explains this assignment nor argues it further, and we therefore deem it to be without merit.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. It appears the appellant means to complain of such questions being propounded to state witnesses as well as defense witnesses, and we deal with this assignment as such. As to defense witnesses being questioned as to improper sexual acts, it certainly did not constitute ineffective assistance of counsel to elicit denials of such acts by the defendant once he decided to testify in his own defense.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. We do not need to address the admissibility from an evidentiary perspective of the two specific instances involving other sexual acts since both were brought in by the defendant, in this case to impeach the credibility of previous testimony. See W. Va: R. Evid. 404(a)(1). If the prosecution attempted to bring in these two instances, the family dog incident would have been admissible as part of the res gestae; however, the incident involving the vasectomy stitches would have been inadmissible.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1 W.Va.R.Evid. 404(b) provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Other Crimes, Wrongs, or Acts. -- Evidence of other crimes, wrongs, or acts is not admissible to prove the character of a person in order to show that he acted in conformity therewith. It may, however, be admissible for other purposes, such as proof of motive, opportunity, intent, preparation, plan, knowledge, identity, or absence of mistake or accident.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2 Syllabus Point 8 of Dolin states:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"To the extent that State v. Beacraft, 126 W.Va. 895, 30 S.E.2d 541 (1944), State v. Lohm, 97 W.Va. 652, 125 S.E. 758 (1924), and State v. Driver, 88 W.Va. 479, 107 S.E. 189 (1921), allow collateral sexual offenses to be admitted into evidence to show an improper or lustful Disposition toward the victim, they are overruled.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3 In note 15, W.Va. at , S.E.2d at (Slip op. 15), the majority states:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Jurisdictions have termed such uses in different manners but still have permitted this evidence to show an accused's 'emotional propensity for sexual aberration,' 'lewd Disposition,' 'propensity to act out his sexual desires with young girls,' or 'moral Disposition and perversity.' See State v. Phillips, 102 Ariz. 377, 379, 430 P.2d 139, 141 (1967); State v. Maestas, 224 N.W.2d 248, 251 (Iowa 1974); State v. Tarrell, 74 Wis. 2d 647, 648, 247 N.W.2d 696, 703 (1976); State v. Shively, 172 Ohio St. 128, 131, 174 N.E.2d 104, 107, 15 Ohio Op. 2d 211 (1961).\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4 W.Va.R.Evid. 403 states:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Exclusion of Relevant Evidence on Grounds of Prejudice, Confusion, or Waste of Time. Although relevant, evidence may be excluded if its probative value is substantially outweighed by the danger of unfair prejudice, confusion of the issues, or misleading the jury, or by considerations of undue delay, waste of time, or needless presentation of cumulative evidence.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5 Syllabus Point 3 of Dolin states:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Before a trial court can determine that evidence of collateral crimes is admissible under one of the exceptions, an in camera hearing is necessary to allow a trial court to carefully consider the admissibility of collateral crime evidence and to properly balance the probative value of such evidence against its prejudicial effect.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6 Syllabus Point 9 of Dolin provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"It is customary to give the jury a limiting instruction with regard to its consideration of a collateral crime. This instruction generally provides that the evidence of a collateral crime is not to be considered as proof of the defendant's guilt on the present charge, but may be considered in deciding whether a given issue or element relevant to the present charge has been proven. When a defendant requests this limiting instruction, it must be given.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7 Footnote 24 of the majority's opinion, W.Va. at , S.E.2d at (Slip op. at 29), states: \"We clarify this holding in that McCoy is limited to the facts of that case. Hence, a physician can testify that in his or her opinion, based on physical findings, a particular victim was raped.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8 The full text of Syllabus Point 2 of McCoy states:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Qualified expert testimony regarding rape trauma syndrome is relevant and admissible in a prosecution for rape where the defense is consent. The expert may testify that the alleged victim exhibits behavior consistent with rape trauma syndrome, but the expert may not give an opinion, expressly or implicitly, as to whether or not the alleged victim was raped.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9 The complete text of Syllabus Point 7 is:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Expert psychological testimony is permissible in cases involving incidents of child sexual abuse and an expert may state an opinion as to whether the child comports with the psychological and behavioral profile of a child sexual abuse victim, and may offer an opinion based on objective findings that the child has been sexually abused. Such an expert may not give an opinion as to whether he personally believes the child, nor an opinion as to whether the sexual assault was committed by the defendant, as these would improperly and prejudicially invade the province of the jury.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10 Syllabus Point 4 of Myers demonstrates this point:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"It is within the trial court's discretion to admit qualified expert testimony describing the psychological and emotional characteristics typically observed in sexually abused children and those observed in the complainant and giving other background data providing a relevant insight into the conduct and demeanor of the child complainant which the jury could not otherwise bring to its evaluation of her credibility.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11 In Syllabus Point 5 of Myers the Minnesota court stated: \"Defendant opened the door to opinion testimony regarding the truthfulness of complainant's allegations by eliciting the opinion of complainant's mother about the truthfulness of her daughter's allegations.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12 The full text of W.Va.R.Evid. 608(a) is:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Evidence of Character and Conduct of Witness. (a) Opinion and Reputation Evidence of Character. -- The credibility of a witness may be attacked or supported by evidence in the form of opinion or reputation, but subject to these limitations:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(1) the evidence may refer only to character for truthfulness or untruthfulness; and (2) evidence of truthful character is admissible only after the character of the witness for truthfulness has been attacked by opinion or reputation evidence or otherwise.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13 In note 2 of Rimmasch, 775 P.2d at 392, the Utah Supreme Court listed jurisdictions which have rejected Kim's credibility rule:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eE.g., United States v. Azure, 801 F.2d 336, 341 (8th Cir. 1986); United States v. Binder, 769 F.2d 595, 602 (9th Cir. 1985); State v. Moran, 151 Ariz. 378, 382-86, 728 P.2d 248, 252-56 (1986); Johnson v. State, 292 Ark. 632, 639-40, 732 S.W.2d 817, 819-21 (1987); People v. Roscoe, 168 Cal.App.3d 1093, 1098-99, 215 Cal.Rptr. 45, 49-50 (1985); Tevlin v. People, 715 P.2d 338, 341 (Colo. 1986); Wheat v. State, 527 A.2d 269, 275 (Del. 1987); Kruse v. State, 483 So.2d 1383, 1387-88 (Fla.Dist.Ct.App. 1986); Simmons v. State, 504 N.E.2d 575, 579 (Ind. 1987); State v. Myers, 382 N.W.2d 91, 97 (Iowa 1986); Commonwealth v. Carter, 9 Mass.App. 680, 681-82, 403 N.E.2d 1191, 1193 (1980), aff'd, 383 Mass. 873, 417 N.E.2d 438 (1981); People v. Walker, 150 Mich. App. 597, 389 N.W.2d 704, 707 (1985); State v. Jackson, 239 Kan. 463, 470, 721 P.2d 232, 238 (1986); State v. Myers, 359 N.W.2d 604, 611 (Minn. 1984); State v. Taylor, 663 S.W.2d 235, 239 (Mo. 1984); In re J.W.K., 223 Mont. 1; 724 P.2d 164, 166 (Mont. 1986); Townsend v. State, 103 Nev. 113, 734 P.2d 705, 709 (1987); People v. Reid, 123 Misc.2d 1084, 1087, 475 N.Y.S.2d 741, 743 (1984); State v. Staples, 120 N.H. 278, 281-82, 415 A.2d 320, 322 (1980); State v. Heath, 316 N.C. 337, 341 S.E.2d 565 (1986); State v. Milbradt, 305 Or. 621, 628-29, 756 P.2d 620, 624 (1988); Commonwealth v. Seese, 512 Pa. 439, 517 A.2d 920, 922 (1986); State v. Castore, 435 A.2d 321, 326 (R.I. 1981); State v. Fitzgerald, 39 Wash.App. 652, 656-57, 694 P.2d 1117, 1121 (1985); State v. Haseltine, 120 Wis.2d 92, 96-97, 352 N.W.2d 673, 676 (1984); Brown v. State, 736 P.2d 1110, 1115 (Wyo. 1987); see United States v. Earley, 505 F. Supp. 117 (S.D.Iowa 1981); State v. Black, 537 A.2d 1154, 1156-57 (Me. 1988); State v. Buell, 22 Ohio St.3d 124, 489 N.E.2d 795, 803-04, cert. denied, 479 U.S. 871, 107 S. Ct. 240, 93 L. Ed. 2d 165 (1986); State v. Logue, 372 N.W.2d 151, 157 (S.D. 1985); see also Feeney, Expert Psychological Testimony on Credibility Issues, 115 Mil.L.Rev. 121, 134-35 (1987) (discussing same prohibition in military courts).\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14 For the full text of Syllabus Point 7, see note 9, (supra) .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15 See cases cited in note 13, (supra) .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16 The complete text of W.Va.R.Evid. 702 states:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Testimony by Experts. If scientific, technical, or other specialized knowledge will assist the trier of fact to understand the evidence or to determine a fact in issue, a witness qualified as an expert by knowledge, skill, experience, training, or education may testify thereto in the form of an opinion or otherwise.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17 The Rimmasch court cited the following authorities for this statement:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Compare State v. Kim, 64 Haw. 598, 645 P.2d 1330, 1338-39 (1982) (admitting); Kruse v. State, 483 So.2d 1383, 1385-86 (Fla.Dist.Ct.App. 1986) (admitting); . . . . People v. Roscoe, 168 Cal.App. 3d 1093, 1098-1101, 215 Cal.Rptr. 45, 49-50 (1985) (excluding); State v. Hudnall, 293 S.C. 97, 100, 359 S.E.2d 59, 61-62 (1987) (excluding); People v. Pullins, 145 Mich.App. 414, 420-21, 378 N.W.2d 502, 505 (1985) (excluding); see State v. Taylor, 663 S.W.2d 235, 240-42 (Mo. 1984) (rape trauma syndrome evidence inadmissible to prove rape occurred); [J. Myers, Child Witness Law and Practice ]  4.16; Comment, Syndrome Testimony in Child Abuse Prosecutions: The Wave of the Future?, 8 St. Louis U.Pub.L.Rev. 207, 218 (1989); Comment, The Admissibility of Expert Psychological Testimony in Cases Involving the Sexual Misuse of a Child, 42 U. Miami L.Rev. 1033, 1048-50 (1988); McCord, Syndromes, Profiles and Other Mental Exotica: A New Approach to the Admissibility of Nontraditional Psychological Evidence in Criminal Cases, 66 Or.L.Rev. 19, 41 (1987).\" 775 P.2d at 400.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18 In footnote 10 of Rimmasch, 775 P.2d at 401, these authorities were given:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"The views of a number of these scholars are set out at length in McCord, Expert Psychological Testimony About Child Complainants in Sexual Abuse Prosecutions: A Foray into the Admissibility of Novel Scientific Evidence, 77 J.Crim.L. \u0026 Criminology 1, 18-24 (1986) [hereinafter McCord, 77 J.Crim.L. \u0026 Criminology]; Note, The Unreliability of Expert Testimony on the Typical Characteristics of Sexual Abuse Victims, 74 Geo.L.J. 429, 440-43 (1985) [hereinafter Georgetown Note); and in J. Myers, Child Witness Law and Practice  4.15, at 151-52 \u0026 n.107 (1987) [hereinafter Myers). See also Golding, [Mental Health Professionals and the Courts: The Ethics of Expertise], [ Int'l J.L. Psychiatry note 6, at 32 n. 8 [(1989)] ('Currently, absent certain strong physical signs (e.g. presence of venereal disease or blatant vaginal or anal trauma), there are no scientifically acceptable scientific data on \"sexual abuse profiles\" based upon psychological data.')\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19 In both Clawson and Woodall, we emphasized that even where the reliability of the test is generally recognized, it must also be shown that the test was conducted in a proper manner by a qualified expert. See Syllabus Point 3, State v. Woodall, supra; State v. Clawson, 165 W.Va. at 620, 270 S.E.2d at 677-78.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20 Syllabus Point 5 of State v. Smith states:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"The language of Rule 804(b)(5) of the West Virginia Rules of Evidence and its counterpart in Rule 803(24) requires that five general factors must be met in order for hearsay evidence to be admissible under the rules. First and most important is the trustworthiness of the statement, which must be equivalent to the trustworthiness underlying the specific exceptions to the hearsay rule. Second, the statement must be offered to prove a material fact. Third, the statement must be shown to be more probative on the issue for which it is offered than any other evidence the proponent can reasonably procure. Fourth, admission of the statement must comport with the general purpose of the rules of evidence and the interest of Justice. Fifth, adequate notice of the statement must be afforded the other party to provide that party a fair opportunity to meet the evidence.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21 We have the same provisions in our Rule 801(d) which provides that certain out-of-court statements are not hearsay. W.Va.R.Evid. 801(d) provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(d) Statements Which are not Hearsay. -- A statement is not hearsay if --\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(1) Prior Statement by Witness. -- The declarant testifies at the trial or hearing and is subject to cross-examination concerning the statement, and the statement is (A) inconsistent with his testimony, and was given under oath subject to the penalty of perjury at a trial, hearing, or other proceeding, or in a deposition, or (B) consistent with his testimony and is offered to rebut an express or implied charge against him of recent fabrication or improper influence or motive, or (C) one of identification of a person made after perceiving him; or\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(2) Admission by Party-Opponent. -- The statement is offered against a party and is (A) his own statement, in either his individual or a representative capacity, or (B) a statement of which he has manifested his adoption or belief in its truth, or (C) a statement by a person authorized by him to make a statement concerning the subject, or (D) a statement by his agent or servant concerning a matter within the scope of his agency or employment, made during the existence of the relationship, or (E) a statement by a co-conspirator of a party during the course and in furtherance of the conspiracy.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22 For the full text of W.Va.R.Evid. 801(d)(1)(C), see note 21, (supra) .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23 The court reasoned in Clanton, 539 So. 2d at 1028, as follows:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"These statements were hearsay. Ordinarily, under prerules decisions, they would have been inadmissible even if Clanton had testified, as an attempt to bolster his testimony. . . . This has been carried over into the Mississippi Rules of Evidence. Rule 613 recognizes that prior inconsistent statements may be used for impeachment purposes, but prior consistent statements cannot be used to bolster a witness. . . . And, when a witness testifies, prior consistent statements are likewise inadmissible, except in rare and special circumstances, none of which are present here.\" (Citations omitted.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24 The Court's remarks in Mitchell were: \"[On remand], it will be incumbent upon the trial Judge from the court proceeding before him to first determine and find that the hearsay testimony is not otherwise admissible under M.R.E. 803, but could qualify under 803(24).\" 539 So. 2d at 1371. (Citations omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25 From a technical standpoint, the trial court's finding that the child victim was incapable of testifying rendered the witness unavailable. In these circumstances, W.Va.R.Evid. 804(b)(5) would come into play. Both this rule and W.Va.R.Evid. 803(24), however, are identical as to the criteria that have to be met.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26 The child's story, as related by the mother, was:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"He opened up and said daddy had put his georgie in his butt and it hurt, and daddy had put his finger in his butt and it hurt, daddy had played with my georgie, meaning [E.L.]'s georgie, until daddy's georgie peed white, I'm tryin to get on a five year level to see if there was any, maybe oral sex, so I asked him, well [E.L.], did at any time did daddy put his mouth on your georgie, and he said but mommy, I told him not to with that brown stuff in his mouth, well, Ed used snuff, and he cried, at this point, I lost it, my only concern at that time was my God, my son needs help.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27 Part of the problem with admitting such statements from adults is that their testimony about what the child victim told them is usually much more elaborate than the victim is able to actually testify about. This is demonstrated by the record in this case where both children answered most of the questions with either yes or no.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28 Syllabus Point 5 of the majority opinion states:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"The two-part test set for admitting hearsay statements pursuant to W.Va. R. Evid. 803(4) is (1) the declarant's motive in making the statements must be consistent with the purposes of promoting treatment, and (2) the content of the statement must be such as is reasonably relied upon by a physician in treatment or diagnosis.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29 The full text of W.Va.R.Evid. 803(4) is:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"The following are not excluded by the hearsay rule, even though the declarant is available as a witness:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(4) Statements for Purposes of Medical Diagnosis or Treatment. Statements made for purposes of medical diagnosis or treatment and describing medical history, or past or present symptoms, pain, or sensations, or the inception or general character of the cause or external source thereof insofar as reasonably pertinent to diagnosis or treatment.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Syllabus Point 8 of Sutherland states:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"It is a well recognized exception to the hearsay rule that a doctor who examines a patient for the purpose of treatment may testify as to his medical Conclusions, which may be based on the history given to him by the patient with regard to subjective symptoms.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. Syllabus Point 9 of Sutherland states:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Where an examination by a doctor is not made within the doctor-patient relationship for the purpose of treatment but made solely for the purpose of using the doctor as a witness, the exception to the hearsay rule, that a doctor who examines a patient for purpose of treatment may testify as to his medical Conclusions based on the history given to him by the patient with regard to subjective symptoms, disappears.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. The Advisory Committee notes to Fed.R.Evid. 803(4) state in material part:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Conventional doctrine has excluded from the hearsay exception, as not within its guarantee of truthfulness, statements to a physician consulted only for the purpose of enabling him to testify. While these statements were not admissible as substantive evidence, the expert was allowed to state the basis of his opinion, including statements of this kind. The distinction thus called for was one most unlikely to be made by juries. The rule accordingly rejects the limitation. This position is consistent with the provision of Rule 703 that the facts on which expert testimony is based need not be admissible in evidence if of a kind ordinarily relied upon by experts in the field.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. The courts' confusion in this area is discussed in R. Mosteller, (supra) at 274 n.68:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"The error committed here of joining the two requirements is a relatively common one with courts, arising typically from the same mistake in two highly influential opinions from the United States Court of Appeals for the Eighth Circuit, United States v. Iron Shell, 633 F.2d 77 (8th Cir. 1980), cert. denied, 450 U.S. 1001, 68 L. Ed. 2d 203, 101 S. Ct. 1709 (1981), and United States v. Renville, 779 F.2d 430 (8th Cir. 1985). See, e.g., Morgan v. Foretich, 846 F.2d 941, 949-50 (4th Cir. 1988).\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. Mr. Trainor's testimony was:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Initially, I, when, when we had a, when I had my first contact with the case, much of the story had been told to a, to a family friend and it was repeated to me by, by Mrs. [L.]. When we first got started, [E.L.] had a great deal of trouble talking about it, one thing that commonly happens in sexual abuse cases is after a disclosure, there is a suppression phase.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. The questioning was as follows:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Q . . . you made another, other statements to the officer in the course of the investigation, do you want to maintain now that everything you said in that report is accurate and true?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"A Yes, I haven't lied to nobody.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Q Would you recall making a statement with respect to a dog?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"A Yes, I did.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Q Uh-huh is that statement true?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"A I didn't see it, that's what my son told me.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Q Wait a minute, you told the officer and I quote, 'she also indicated that he had sex with the poodle terrier in front of [E.L.] at some point in time,' is that statement true or false?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"A I stated that [E.L.] had told me that his daddy had let the dog, which was a poodle, her name was Mitzi, ride his georgie, and if he told mommy he would let the dog eat [E.L.]'s georgie off, I did not see that myself.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Q Uh-huh, how old was this dog?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"A Maybe a year and a half, two years old.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Q Uh-huh, how big is it?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"A I haven't seen it, he's got it.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Q Well, he had it when you lived in the house together, didn't you?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"A Oh, yeah, at that time, she was about this long, maybe stood about that high, (at this time, the witness showed the approximate length and height of the dog by showing with her hands).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Q What sex was the dog?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"A Female.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Q You sit there and you, you relay this statement that you, it's physically impossible for that to happen, isn't it?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"A I don't know, I wasn't there, I was just tellin you what my son told me.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. The exchange from the record is as follows:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Q In the course of your Discussions with Mr. Trainor, as in your Discussions with the police officer, you made a number of statements regarding your, your husband's sexual behavior, and at one point, you stated that he pulled vasectomy stitches.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"A I had company that came from the Auxiliary . . . there visiting me and the children, we were sitting there talking and Ed hollered to ask if I could come in the bathroom with him, and when I did, he showed me where the stitches had been pulled loose, what am I supposed to do, I said I guess you'll have to go back up to the emergency room, you've pulled 'em loose, so he did, I think [a neighbor] went and got him and brought him home, and he said that Dr. Khurana had prescribed a couple prescriptions so that there wouldn't be any infections, and I made the comment that it's not gonna do a world of good if you didn't have handcuffs on the bottom of the prescription because it came from playing with himself.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Q Now, are you going to maintain that that was the truth as seen by your own eyes?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"A I've seen him sit and pat the front of his pants more times than I would even want to try to estimate the amounts of time.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. The full text of Syllabus Point 21 of Thomas states:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Where a counsel's performance, attacked as ineffective, arises from occurrences involving strategy, tactics and arguable courses of action, his conduct will be deemed effectively assistive of his client's interests, unless no reasonably qualified defense attorney would have so acted in the defense of an accused.\"\u003c/span\u003e\n\n",
    "body_length": 150158,
    "citedas": [
      "398 S.E.2d 123",
      "183 W.Va. 641"
    ],
    "attorneys": "Clark B. Frame, William L. Frame, Wilson, Frame \u0026 Metheney, Morgantown, West Virginia, For: Edward Charles, L., Sr. Roger W. Tompkins, Attorney General, John E. Shank, Deputy Attorney General, Attorney General's Office, Charleston, West Virginia, For: State of West Virginia.",
    "category": [
      "242",
      "36",
      "75"
    ],
    "judges": "Workman, Justice. Chief Justice Neely and Justice Miller Dissent, and reserve the right to file Dissenting opinions.",
    "citation_count": 134
  }
}
