{
  "id": "coCePWYBTlTomsSBtUiT",
  "document": {
    "title": "United States v. J. B. Williams Co.",
    "full_title": "UNITED STATES OF AMERICA v. THE J. B. WILLIAMS COMPANY, INC., AND PARKSON ADVERTISING AGENCY, INC.",
    "jurisdiction": "Second Circuit",
    "date": "1974-05-02T00:00:00.000Z",
    "docket": "Docket No. 73-1624, No. 236 - September Term, 1973",
    "body": "FRIENDLY, Circuit Judge:\n\nOn November 28, 1969, the Federal Trade Commission made a certificate to the Attorney General pursuant to § 16 of the Federal Trade Commission Act, 15 U.S.C. § 56. The Commission's letter stated it had reason to believe The J. B. Williams Company (Williams) and Parkson Advertising Agency, Inc. (Parkson) were liable for penalties under § 5 (l) of the Act, 15 U.S.C. § 45 (l)\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e for violation of a cease and desist order for which the Sixth Circuit had granted enforcement, J. B. Williams Co. v. FTC, 381 F.2d 884 (1967), and recommended that the Attorney General institute \"appropriate proceedings . . . for recovery of civil penalties as prescribed in said section.\" The appropriate proceedings were described in a draft complaint, which alleged 100 violations and sought \"judgement against defendants in the total sum of $500,000.\"\n\nFive months later the Government began this action; the complaint alleged the same 100 violations, but unlike the Commission's draft complaint, demanded judgment for $500,000 against each defendant. The defendants answered and demanded a jury trial. Subsequently, the Government moved for summary judgment. Judge Motley granted this in the sum of $456,000 against Williams and $356,000 against Parkson with leave to Parkson to apply to pay its penalties in installments with interest, 354 F. Supp. 521 (S.D.N.Y. 1973). The defendants have appealed.\n\nI. The Facts.\n\nThe instant controversy began with the issuance of a complaint by the FTC in December 1962 relating to defendants' newspaper and television advertising for Geritol, an iron and vitamin product. The gist of the complaint was that the advertising gave the impression that Geritol was an effective general remedy for tiredness, loss of strength or a run-down feeling, whereas in fact it was effective only in the small minority of cases where these conditions were caused by a deficiency in iron or in the vitamins contained in Geritol. After proceedings which it is unnecessary here to detail, the FTC issued a cease and desist order on September 28, 1965. Paragraph 1(d), which both sides agree to be the broadest paragraph of the order, is set forth in the margin.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Williams and Parkson petitioned for review of the order under § 5(c) of the FTC Act, 15 U.S.C. § 45(c). In the review proceeding, the Sixth Circuit directed that the order be enforced except for a provision directing the petitioners to cease and desist from representing that iron deficiency or iron deficiency anemia can be self-diagnosed without a medical test. J. B. Williams Co. v. FTC, supra, 381 F.2d at 891. The FTC entered a modified order on November 24, 1967. Williams and Parkson did not seek certiorari.\n\nIn October 1968, after receiving appellants' first compliance report, the FTC directed a public hearing on compliance. At the hearing it viewed representative Geritol television commercials and heard argument. Subsequently it issued an opinion in which it concluded that the advertising continued \"to treat that portion of the population suffering from tiredness as equal to that portion of the population which experience tiredness due to iron deficiency anemia.\" The principal basis for that conclusion was that although the television commercials had dutifully announced that \"the great majority of tired people don't feel that way because of iron-poor blood and Geritol won't help them,\" the effect of this disclaimer was largely obliterated by the visual presentation and by such phrases as \"but it is a medical fact that many of the millions of people who have iron-poor blood are tired and need Geritol\" (emphasis in original) or \"but millions do have iron-poor blood and you could be one of the many who are tired for that reason and need Geritol.\" The FTC advised that \"in order to avoid future enforcement proceedings\" Williams and Parkson should immediately discontinue the broadcast of the television commercials provided the Commission or any similar ones. The Commission also directed Williams and Parkson to file a further compliance report by January 31, 1969.\n\nThe second compliance report stated that the company was currently using only three different television commercials (subsequently termed the \"AA\" advertisements), scripts of which were submitted with the report. These commercials warned viewers that they might be suffering from \"iron-poor blood\" and focused on Geritol's ability to cure iron deficiency. They spoke of Geritol's \"blood-building power\" and of its capacity to build \"iron power in your blood fast.\" The report also described and included scripts for five other commercials (subsequently termed the \"BB\" advertisements), which were no longer being disseminated but which the company believed to be in compliance. Williams and Parkson included in the report a request to meet promptly with Commission representatives in order to facilitate the preparation of new advertising themes. On May 8, 1969, the Chief of the FTC's Compliance Division wrote Williams' counsel that \"the Commission would be favorably disposed to accepting as compliance with its order to cease and desist the absolute discontinuance by J. B. Williams Company, Inc., of the BB advertisements submitted with your last report and the continued use of the AA advertisements only with deletion from them of all references to 'power'.\"\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e The letter also advised that Williams would have to eliminate all references in its labeling to prevention of tiredness. A week later, on May 15, counsel wrote that Williams and Parkson were willing to accept these conditions, although they did not concede either that the BB advertisements or the use of the word \"power\" in the AA advertisements violated the order. Counsel also agreed to the omission of all labeling references to Geritol's ability to prevent tiredness, although not conceding \"that the Commission's Order relates in any way to preventative claims.\" On June 6, the Commission wrote counsel,\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e acknowledging receipt of the May 15 letter, stating it was \"of the view that the 'AA' commercials will comply with the order if all references to 'power' are deleted,\" and requesting another report within 30 days.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nThe third compliance report, submitted on July 2, 1969, stated that Williams and Parkson had decided to stop using the AA commercials rather than revise them to eliminate the word \"power\"; that \"the process of removing these commercials from the air and substituting others for them was commenced promptly and was completed during June\"; and that the word \"power\" would be deleted if the AA commercials were to be used again. In accordance with the Commission's request, Williams submitted scripts of television commercials and other promotional materials currently in use.\n\nShortly thereafter a new ground for controversy arose. Counsel advised the Commission that Williams was test-marketing a new product called FemIron. The Compliance Division asked for the formula and for copies of all current and proposed advertising materials. The company promptly responded, noting that FemIron was a food supplement, not a drug or tonic; that it did not contain vitamins, as Geritol does; that it was intended not to treat iron deficiency but merely to provide a supplemental source of iron for women in the child-bearing years. The letter suggested that for these reasons FemIron was not within the provisions of the cease and desist order making the order applicable not only to Geritol but to \"any other preparation of substantially similar composition or possessing substantially similar properties, under whatever name or names sold.\" On July 16, a member of the Division of Compliance responded, indicating that the Commission's Division of Scientific Opinions believed that FemIron and Geritol possessed substantially similar properties. The letter indicated that the Commission would consider FemIron's status, whether the FemIron advertising violated the order, and, if so, \"what action should be taken.\" On September 3 the FTC formally rejected the third compliance report. The Commission concluded that several of the Geritol commercials violated the cease and desist order and that FemIron was subject to the order. The letter stated an investigation would be made to obtain evidence of violations \"for use in possible enforcement proceedings.\"\n\nThe draft complaint which the FTC submitted to the Attorney General and the complaint which he subsequently filed alleged violations of three different types. Counts 1 through 4 related to the use of several of the AA commercials, without deletion of the word \"power\", between June 10 and June 20, 1969. Treating each day's exhibition of a different commercial as the unit of violation, the draft complaint sought penalties under these counts totaling $80,000; the final complaint sought that sum from each defendant. Counts 5-9 related to commercials of a new type submitted in the third compliance report, referred to as the \"sad-glad\" commercials, which were aired at various times between June 2 and September 8, 1969. In Counts 5 through 7 the unit for determining what constituted a violation was the same as in Counts 1 through 4; the penalties sought for these totaled $220,000 from each defendant. However, in Counts 8 and 9 the complaint used a more severe system of calculating penalties. It counted each broadcast, on June 2, 3, 4 and 6, as a separate violation; apparently the reason for the greater severity was that these commercials used the terms \"blood-building power\" and \"iron power\", as the AA commercials had done. The Government demanded penalties of $45,000 from each defendant on these counts. Counts 10 and 11 concerned two different FemIron commercials that were disseminated on various dates between September 2 and October 1. Here the unit of violation reverted to that used in the earlier counts; the penalties against each defendant aggregated $155,000. For all counts the penalties sought were thus $500,000 from each defendant. As stated earlier, the court granted summary judgment for $456,000 against Williams and $356,000 against Parkson. Rather than summarize the court's opinion here, we will discuss each of its rulings in connection with the various points of appeal raised by defendants.\n\nII. Appellants' Sixth Amendment Claims.\n\nThe district court properly rejected appellants' claim that jury trial was required and summary judgment precluded because an action to recover penalties under § 5 (l) of the Federal Trade Commission Act is criminal in nature.\n\nIn many instances Congress has provided, as a sanction for the violation of a statute, a remedy consisting only of civil penalties or forfeitures; in others it has provided the usual criminal sanctions of a fine, imprisonment or both; in still others it has provided both criminal and civil sanctions. When Congress has characterized the remedy as civil and the only consequence of a judgment for the Government is a money penalty, the courts have taken Congress at its word. This seems to us the clear intendment of Hepner v. United States, 213 U.S. 103, 29 S. Ct. 474, 53 L. Ed. 720 (1909); United States v. Regan, 232 U.S. 37, 58 L. Ed. 494, 34 S. Ct. 213 (1914); and Helvering v. Mitchell, 303 U.S. 391, 398-405, 82 L. Ed. 917, 58 S. Ct. 630 (1938). Cf. United States v. St. Regis Paper Co., 355 F.2d 688, 693 (2 Cir. 1966).\n\nAppellants urge us to overlook Congress' express characterization of § 5 (l) as a \"civil\" action and to hold the sanction imposed in this case criminal because of its allegedly punitive purpose. While Congress could not permissibly undermine constitutional protections simply by appending the \"civil\" label to traditionally criminal provisions, the statute here at issue is plainly not of that class. In the face of a long line of contrary authority, appellants have not directed our attention to any civil penalty provision that has been held sufficiently \"criminal\" in nature to invoke the protections of the Sixth Amendment.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e Although appellants insist that the large size of the judgment entered below could have served no legitimate civil purpose, that argument is more fittingly addressed to the question whether the district court abused its discretion in assessing such a large penalty, see part VIII, infra.\n\nIII. Appellants' Right to a Civil Jury Trial of Disputed Issues of Fact.\n\nAppellants argue in the alternative that they were entitled to a jury trial under F.R. Civ. P. 38(a) which preserves inviolate \"the right of trial by jury as declared by the Seventh Amendment to the Constitution or as given by a statute of the United States.\" That claim would, of course, be academic if, as the district court held, there were no triable issues of fact. Hepner v. United States, supra, 213 U.S. at 112-15. Since, for reasons detailed in the following section of this opinion, we hold that there were triable fact questions and a remand will thus be required, it is convenient to deal with the civil jury trial issue here.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nApparently there is only one reported decision where a court has squarely faced this question under § 5 (l) of the FTC Act. In United States v. Hindman, 179 F. Supp. 926 (D.N.J. 1960), the court held that the defendant in a civil penalty suit under § 5 (l) has a right to have a jury determine whether he has violated the terms of an FTC order when there is a triable dispute on that question. Against this is dictum from a Third Circuit decision, United States v. Vulcanized Rubber \u0026 Plastics Co., 288 F.2d 257, 258-59 n. 2 (3 Cir. 1961), cert. denied, 368 U.S. 821, 7 L. Ed. 2d 26, 82 S. Ct. 38 (1961). The Vulcanized Rubber court affirmed a district court's grant of summary judgment to the Government in a § 5 (l) case where, as the court of appeals held, \"there was no issue of fact presented.\" However, in a footnote dictum two judges branded Hindman as erroneous. The criticism was based on two grounds: (1) that \"the sole issue before the court [in Hindman ] was whether or not the labeling practice was within the proscription of the order and not whether the labeling practice was deceptive,\" and (2) that \"creating an issue of fact as the court did in Hindman, would usurp the function exclusively vested by Congress in the Federal Trade Commission to determine the issue of whether a labeling practice is misleading or deceptive to the public.\" While the first proposition is true enough in itself, it manifests some confusion. The district judge in Hindman fully agreed that the only issue before him was whether the order covered the practice in question; as to that issue he held that there was a triable factual dispute.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e The second proposition seems unsound as applied to enforcement proceedings unless Congress has vested the FTC with power not only to make orders but to determine whether they have been violated -- a position which was not taken by the Government although it is approximated by the dissent. No decision has ever intimated such a view. In FTC v. Morton Salt Co., 334 U.S. 37, 54, 92 L. Ed. 1196, 68 S. Ct. 822 (1948), while insisting that the Commission has power to determine all issues essential to the issuance of an order subject only to judicial review on a substantial evidence standard, the Supreme Court recognized that \"the enforcement responsibility of the courts, once a Commission order has become final either by lapse of time or by court approval, 15 U.S.C. §§ 21, 45, is to adjudicate questions concerning the order's violation . . .\" Nothing was said in Morton Salt to indicate that the court's adjudication of violations of FTC orders, whether in contempt proceedings in a court of appeals or in penalty actions under § 21 (l) or 45 (l) in a district court, was to be more trammeled than in any other case where a court is given plenary powers of adjudication as distinguished from review of administrative action -- much less, as was seemingly indicated in the Vulcanized Rubber dictum, that the Commission's determination was conclusive. In any event a district court decision and a dictum of two judges of the court of appeals of another circuit adversely reflecting upon it are scarcely dispositive either way, and thorough examination of the problem is thus in order.\n\nThere can be no doubt that in general \"there is a right of jury trial when the United States sues . . . to collect a penalty, even though the statute is silent on the right of jury trial,\" 5 Moore, Federal Practice para. 38.31[1], at 232-33 (1971 ed.). The leading case supporting this proposition is Hepner v. United States, supra, 213 U.S. at 115, where the Court had no difficulty in concluding that in an action to collect a $1,000 penalty assessed for a violation of the Alien Immigration Act, \"the defendant was, of course, entitled to have a jury summoned.\" See also United States v. Regan, supra, 232 U.S. at 43-44, 47.\n\nMany cases, arising under a broad range of other civil penalty and forfeiture provisions, have reached the same conclusion. In The Sarah, 21 U.S. (8 Wheat.) 391, 5 L. Ed. 644 (1823), the Court held that when goods were seized on land, a statutory libel of information entitled the defendant to a jury trial. The Court has consistently held since then that forfeitures occurring on land are civil actions at law, entitling the parties to a jury unless it was waived. United States v. Winchester, 99 U.S. 372, 374, 25 L. Ed. 479 (1878); 443 Cans of Frozen Egg Product v. United States, 226 U.S. 172, 183, 33 S. Ct. 50, 57 L. Ed. 174 (1912); C. J. Hendry Co. v. Moore, 318 U.S. 133, 153, 87 L. Ed. 663, 63 S. Ct. 499 (1943). Similarly, actions for statutory penalties have been held to entail a right to jury trial, even though the statute is silent,\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e both where the amount of the penalty was fixed and where it was subject to the discretion of the court, see, e.g., Atchison, Topeka \u0026 Santa Fe Ry. v. United States, 178 F. 12 (8 Cir. 1910) (28-hour law); Connolly v. United States, 149 F.2d 666 (9 Cir. 1945) (penalty under 25 U.S.C. § 179); United States v. Jepson, 90 F. Supp. 983, 984-86 (D.N.J. 1950) (Emergency Price Control Act of 1942); United States v. Friedland, 94 F. Supp. 721 (D. Conn. 1950) (Housing and Rent Act of 1947); United States ex rel. Rodriguez v. Weekly Publications, 9 F.R.D. 179 (S.D.N.Y. 1949) (qui tam action to recover statutory penalty for making a false claim against the Government).\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Nothing to the contrary was determined in Wirtz v. Jones, 340 F.2d 901, 904-05 (5 Cir. 1965), on which the Government relies. There the court, speaking through our brother Anderson, held that, despite decisions that suits by employees or by the Secretary of Labor at their request under § 16(b) and (c) of the Fair Labor Standards Act for minimum wages and overtime pay entailed the right to jury trial, a different result ensued when the Secretary of Labor sued under § 17 \"to restrain violations of section 15 of this title, including in the case of violations of section 15(a) (2) of this title the restraint of any withholding of payment of minimum wages or overtime compensation found by the court to be due to employees under this chapter.\" Congress having made its intentions to have a court trial entirely clear, the court stated that \"the Seventh Amendment does not require Congress to blunt the most competent means of insuring general compliance with a key section of the Act by depriving the equity courts of a significant part of their inherent power.\"\n\nIn Curtis v. Loether, 415 U.S. 189, 94 S. Ct. 1005, 39 L. Ed. 2d 260, 42 U.S.L.W. 4259, 4261 (1974), the Supreme Court recently gave broad scope to the entitlement to a jury trial in actions for the enforcement of rights provided by twentieth-century statutes. The Court there held that the Seventh Amendment applies to actions for damages under § 812 of the 1968 Civil Rights Act, 42 U.S.C. § 3612, reasoning that the right to jury trial attaches generally to actions enforcing statutory rights, \"if the statute creates legal rights and remedies, enforceable in an action for damages in the ordinary courts of law.\" The statute there in question provided that \"the court may grant as relief, as it deems appropriate, any permanent or temporary injunction, temporary restraining order, or other order, and may award to the plaintiff actual damages and not more than $1000 punitive damages, together with court costs and reasonable attorney fees.\" Although the Court found the language and the legislative history of the statute ambiguous, it held the mandate of the Seventh Amendment squarely applicable. Administrative adjudications such as NLRB backpay awards are distinguishable, the Court wrote, because in administrative proceedings \"jury trials would be incompatible with the whole concept of administrative adjudication and would substantially interfere with the [agency's] role in the statutory scheme.\" When the district court rather than the agency is assigned the adjudicative responsibility, however, and there is \"obviously no functional justification for denying the jury trial right, a jury trial must be available if the action involves rights and remedies of the sort typically enforced in an action at law.\"\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nNot being able seriously to dispute that an action to recover a statutory penalty generally carries the right to a jury trial, the Government seeks to distinguish an action under § 5 (l) because the penalties are collected for violation not of a statute but of an order of an administrative agency.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e It is common ground that jury trial would not have been required if the FTC had sought an order of civil contempt in the Sixth Circuit.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e The Government argues that § 5 (l) was intended simply to provide an alternative means of enforcement and thus should not be read to invoke different procedures.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e A short and probably sufficient answer would be that if in authorizing a civil suit by the chief law officer of the Government, a procedure which had always been thought to entail a right of jury trial, Congress had wished to withhold it (assuming arguendo that it could), Congress would have said so in unmistakable terms and not left this as a secret to be discovered many years later. At the very least, such a conclusion would require evidence in the legislative history that Congress intended the procedure under § 5 (l) to be the same as in a civil contempt proceeding. A study of the development of the civil penalty provision in the FTC Act suggests just the opposite.\n\nSection 5 (l) was part of the Wheeler-Lea Act of 1938, 52 Stat. 111, which amended the original Federal Trade Commission Act of 1914. The Wheeler-Lea Act was directed mainly at extending the Commission's authority to reach all unfair and deceptive practices whether or not they had an anticompetitive effect, thereby overruling the restrictive interpretation given to the 1914 act in FTC v. Raladam Co., 283 U.S. 643, 75 L. Ed. 1324, 51 S. Ct. 587 (1931). In addition, the 1938 amendments added a number of provisions intended to make the FTC's orders more effective. They provided that an FTC order would become final either after review and approval by a court of appeals or after the time for seeking review had expired, § 5(g); the Commission would no longer be required to prove a second violation before obtaining judicial enforcement of its order. In addition, the Wheeler-Lea Act empowered the reviewing court to issue an injunction pendente lite to prevent harm to the public, § 5(c); it established criminal penalties for violation of the statute under certain limited circumstances, § 14(a); and it enabled the Commission to cause the institution of an action to recover a civil penalty for violation of the Commission's final orders, §§ 5 (l), 16. The civil penalty provision was devised to complement the circuit court's contempt power, which had previously been the sole means of remedying violations. If the party sought review of the Commission's order in the court of appeals and the order was enforced there, the Commission could seek to remedy any subsequent violation of the order either through contempt proceedings before the court that enforced the order or through an action for recovery of the civil penalty. If the party did not contest the order by seeking review in the court of appeals, the Commission's sole civil remedy for any subsequent violation would be through the penalty action.\n\nThe Wheeler-Lea bill underwent a number of false starts before it was finally enacted in 1938. The first version, S. 994, 74th Cong., 1st Sess., which was introduced in 1935, contained only the germ of the ultimate Act -- it did nothing more than extend the FTC's authority to include unfair or deceptive practices in or affecting commerce, whether or not they adversely affected competition. That bill died on the Senate calendar. By the next year, the bill had grown to approximately its final size, with the addition of many of the procedural revisions that survived to enactment. That bill, S. 3744, 74th Cong., 2d Sess. (1936), contained a civil penalty clause roughly similar to the one ultimately enacted, although the penalties were much smaller and were set as fixed sums. According to that provision, after the Commission's order had become final any violation of the order would subject the offender to \"a penalty of $500 for each such offense and of $25 for each day it continues, which shall accrue to the United States and may be recovered in a civil action brought by the United States.\" After passing the Senate, 80 Cong. Rec. 6603 (May 4, 1936), the bill died in the House Interstate and Foreign Commerce Committee. Two companion and successor bills, H.R. 10385, 74th Cong., 2d Sess. (1936), and H.R. 3143, 75th Cong., 1st Sess. (1937), also died in committee. Finally, a parallel House bill was proposed, H.R. 5854, 75th Cong., 1st Sess. (1937), which contained language very similar to that finally adopted, but provided variable rather than fixed penalties. For violation of a final order, the penalty clause in that bill would have required a violator to \"forfeit and pay to the United States a civil penalty of not more than $1000 and of not more than $50 for each day such failure continues, which shall accrue to the United States and may be recovered in a civil action brought by the United States.\" This bill also died in committee. Finally, in 1938 the sponsors introduced S. 1077, 75th Cong., 1st Sess., the bill that was ultimately enacted. The first version of S. 1077, however, contained the earlier civil penalty clause providing for a flat $500 penalty and an additional penalty of $25 per day for violation of Commission orders. See S. Rep. No. 221, 75th Cong., 1st Sess. (1937). The House Committee objected, apparently considering the penalty too small, and substituted its own version, H.R. Rep. No. 1613, 75th Cong., 1st Sess. (1937). Under the House proposal, the maximum penalty would be $5000, but the court could assess lower penalties if the circumstances warranted. The conference committee adopted the House's version without comment, H. Rep. No. 1774, 75th Cong., 3d Sess. (1938), and in that form S. 1077 became law.\n\nThe principal debate about § 5 (l) occurred in the House of Representatives between the bill's sponsor, Representative Lea, and Representative Kenney, who was urging that the bill be amended to include additional penalties, 83 Cong. Rec. 405-06 (Jan. 12, 1938). Representative Kenney's proposal would have provided for a flat $3000 civil penalty to be imposed on anyone violating § 12, the advertising section of the Act. Representative Lea objected to such a penalty on the basis that it would clog the courts and that it would risk punishing businessmen who inadvertently violated the law but were willing to conform if their violation was pointed out to them by the Commission. \"The man with good intentions,\" Representative Lea remarked, \"should not be penalized before he has had a chance to correct his mistake.\" 83 Cong. Rec. 392. Later in the debate, Representative Lea commented that the proposal to impose a civil penalty directly for violation of the statute \"is not the practical way to deal with businessmen. This is going to destroy the principal virtue of the Federal Trade Commission procedure, which is to give the honest businessman a chance to adjust his difference without harassing him or bringing him into court, with the expense involved by such proceedings.\" 83 Cong. Rec. 406.Representative Halleck was of a similar view, 83 Cong. Rec. 401:\n\nThe very fact that broad language is used [in the statute] should indicate to all of us, it seems to me, that we should not in every case inflict a criminal penalty or a civil penalty of a $3,000 fine upon any person who happens unintentionally to violate the act. It is my idea that the committee had in mind when drafting this penalty clause the fact, which I think is clearly evident, that honest business people who are trying to operate honestly and within the law may inadvertently violate provisions of this bill. Certainly those people should not be prosecuted, hauled into Federal court and immediately subjected to the criminal prosecution urged here by some.\n\nWe see nothing in any of this to indicate that, in utilizing the historic remedy of a civil penalty for violations of FTC orders, including orders that had become final without having been affirmed by a court, Congress intended to strip the remedy of any of its traditional accoutrements, including the right to a jury trial of fairly disputed issues of fact -- not, of course, as to the validity of the order but as to the fact of violation. Congress gravitated between small fixed penalties and a large maximum penalty, apparently without any thought that the difference would have any effect on the procedure to be followed in enforcement actions.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e If there is a word in the three years of legislative history suggesting that procedure under this penalty statute should differ from that which had been recognized in governmental forfeiture and penalty suits for over a century, we have not found it.\n\nThe conclusion that Congress did not intend a change in established practice is fortified by another bit of evidence. In both the reports and the debates, the sponsors of the Wheeler-Lea bill represented that the civil penalty provision was modeled on a similar provision in the Packers and Stockyards Act of 1921. See S. Rep. No. 1705, 74th Cong. 2d Sess. 7 (1936); H.R. Rep. No. 1613, 75th Cong. 1st Sess. 4 (1937); 80 Cong. Rec. 6594 (1936) (Sen. Wheeler); 83 Cong. Rec. 397 (1938) (Rep. Reece). The provision in the Packers and Stockyards Act is clearly criminal and would thus ensure the defendant of a jury trial on demand. Although the dissent argues that the reference to the Packers and Stockyards Act constitutes only a \"general reference to the fact that criminal sanctions were included in the Wheeler-Lea Amendments,\" that section was repeatedly cited as a model for § 5 (l). In addition, the sponsors referred to a \"similar provision\" in the Securities Exchange Act of 1934, on which § 5 (l) was modeled, 83 Cong. Rec. 397 (1938) (Rep. Reece). Despite the dissent's argument that the reference to the Securities Exchange Act was to the general review provisions, 15 U.S.C. § 78y(b), these would be so clearly irrelevant as to compel a conclusion that the reference was rather to the civil penalty provision, 15 U.S.C. § 78ff(b), added in 1936, establishing a $100 per day statutory penalty for any issuer of stock who failed to file with the Commission the information required in § 15(d) of the Act. Since it is incontrovertible that, under the Hepner line of cases, an issuer who denied liability would be entitled to a jury trial, this affords further evidence that the framers of the Wheeler-Lea amendments were not proposing anything different under § 5 (l). A much older and more detailed model for § 5 (l) was the civil penalty provision of the Hepburn Act of 1906, 49 U.S.C. § 16(8), which added to the Interstate Commerce Act a provision with language strikingly similar to § 5 (l):\n\nAny carrier, any officer, representative, or agent of a carrier . . . who knowingly fails or neglects to obey any order made under the provisions of sections 3, 13, or 15 of this title shall forfeit to the United States the sum of $5,000 for each offense. Every distinct violation shall be a separate offense, and in case of a continuing violation each day shall be deemed a separate offense.\n\nThe following section, 49 U.S.C. § 16(9), provides that the forfeiture shall be payable to the United States, and \"shall be recoverable in a civil suit in the name of the United States.\" While the question of jury trial under § 16(8) seems not to have arisen, courts applying similar civil penalty provisions in other contemporaneous railroad regulation statutes have granted jury trials without even questioning their availability. See, e.g., United States v. Atchison, Topeka \u0026 Santa Fe Ry., 163 F. 517 (8 Cir. 1908) (Safety Appliance Act); Atchison, Topeka \u0026 Santa Fe Ry. v. United States, 178 F. 12 (8 Cir. 1910) (28-hour law); United States v. Great Northern Ry., 220 F. 630 (7 Cir. 1915) (Hours of Service Law); United States v. Kansas City Southern Ry., 202 F. 828, 835 (8 Cir. 1913) (Hours of Service Law); United States v. Northern Pacific Ry., 293 F. 657 (9 Cir. 1924) (Safety Appliance Act). It is hard to believe that at a time, before the Hepner decision, when the courts were having difficulty in concluding that penalty provisions were not actually criminal in nature, see Johnson v. Southern Pacific Co., 117 F. 462 (8 Cir. 1902), rev'd on other grounds, 196 U.S. 1, 49 L. Ed. 363, 25 S. Ct. 158 (1904); Atchison, Topeka \u0026 Santa Fe Ry. v. United States, 172 F. 194 (7 Cir. 1909); United States v. Illinois Central R.R., 156 F. 182 (W.D. Ky. 1907), rev'd, 170 F. 542 (6 Cir.), cert. denied, 214 U.S. 520, 53 L. Ed. 1066, 29 S. Ct. 700 (1909), the civil penalty provision in § 16(8) of the Interstate Commerce Act was intended to deprive the defendant not only of his Sixth Amendment right to jury trial but of his Seventh Amendment right as well. Indeed, in the provision of the Hepburn Act for the enforcement of reparation orders, § 16(2), Congress had not gone further than to render the order prima facie evidence in an action where the defendant clearly had a right to jury trial, and the opinion sustaining this made it extremely doubtful the Court would have approved anything more drastic. See Meeker v. Lehigh Valley R.R., 236 U.S. 412, 430-31, 35 S. Ct. 328, 59 L. Ed. 644 (1915).\n\nSubsequent congressional enactments have shed no more light on the problem. In 1959 Congress extended the streamlined enforcement mechanism of the FTC Act to the Clayton Act. In revising § 11 of the Clayton Act, Congress followed the model of the Wheeler-Lea amendments almost to the letter, including the civil penalty provision, which became 15 U.S.C. § 21 (l). As in the case of § 5 (l), Congress apparently did not expressly confront the jury trial question, although in United States v. Beatrice Foods Co., 344 F. Supp. 104, 111 (D. Minn. 1972), aff'd, 493 F.2d 1259 (8 Cir. 1974), Judge Neville seemed to assume that factual disputes in penalty proceedings under both the Clayton Act and the FTC Act could be tried to a jury. Similarly, in amending § 5 (l) last year, see note 1, supra, Congress gave no indication that it had ever intended the civil penalty provision to deny a jury trial when the fact of violation was fairly disputed.\n\nThe dissent argues that according a jury trial would be inappropriate in a § 5 (l) proceeding, citing one of the three factors referred to in a footnote in Ross v. Bernhard, 396 U.S. 531, 538, n. 10, 24 L. Ed. 2d 729, 90 S. Ct. 733 (1970), \"the practical abilities and limitations of juries.\" The argument is that allowing a jury trial of disputed issues of fact would interfere with according appropriate deference to the FTC's determination that a violation had occurred. Reference is made to the recognized principle that much weight is to be given the judgment of the FTC in framing remedial orders, e.g., FTC v. National Lead Co., 352 U.S. 419, 429, 1 L. Ed. 2d 438, 77 S. Ct. 502 (1957); FTC v. Colgate-Palmolive Co., 380 U.S. 374, 385, 13 L. Ed. 2d 904, 85 S. Ct. 1035 (1965), a principle which, of course, is in no way unique to that agency, see, e.g., Phelps Dodge Corp. v. NLRB, 313 U.S. 177, 198, 85 L. Ed. 1271, 61 S. Ct. 845 (1941); American Power \u0026 Light Co. v. SEC, 329 U.S. 90, 115, 118, 91 L. Ed. 103, 67 S. Ct. 133 (1946); NLRB v. Seven-up Bottling Co., 344 U.S. 344, 346-50, 97 L. Ed. 377, 73 S. Ct. 287 (1953); NLRB v. J. H. Rutter-Rex Manufacturing Co., 396 U.S. 258, 263, 24 L. Ed. 2d 405, 90 S. Ct. 417 (1969).\n\nThe first point in response is that the footnote in Ross v. Bernhard was part of an argument for applying the Seventh Amendment right to a jury trial where it had not been recognized before the merger of law and equity -- not a suggestion that a type of statute which had uniformly been held to carry the right of jury trial should now be construed to eliminate it. A second is that while \"the practical abilities and limitations of juries\" may present problems in a complex action of accounting, see Dairy Queen v. Wood, 369 U.S. 469, 478, 8 L. Ed. 2d 44, 82 S. Ct. 894 (1962), or in estimating damages awarded in lieu of the injunction in an intricate securities suit, see Crane Co. v. American Standard, Inc., 490 F.2d 332 at 343-345 (2 Cir. 1973), those problems do not arise when the jury is asked to determine only whether a television commercial has made various forbidden representations. In any event, the \"limitations of juries\" is only one of three factors mentioned in the footnote, and the two others, custom before the merger of law and equity, and \"the remedy sought,\" here point strongly toward jury trial. A third answer to the dissent is that its argument proves too much; many actions under § 5 (l) could present the most elementary factual questions, such as whether the defendant did or did not commit the acts charged (e.g., if defendants here contended that a television station had broadcast commercials in the face of their disapproval.) These issues are the very sort which juries are traditionally called on to resolve.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e But the fundamental failing in the argument is that Congress has not required deference to an agency's claim that its order has been violated, NLRB v. Dell, 309 F.2d 867 (5 Cir. 1962) (Tuttle, Chief Judge); indeed, in contempt proceedings the burden on an agency claiming a violation is not the burden usual in civil cases but that of demonstrating a violation by \"clear and convincing evidence,\" NLRB v. Local 282, Teamsters, 428 F.2d 994, 1001-02 (2 Cir. 1970); NLRB v. Local 825, Operating Engineers, 430 F.2d 1225, 1229-30 (3 Cir. 1970), cert. denied, 401 U.S. 976, 28 L. Ed. 2d 326, 91 S. Ct. 1200 (1971). While Congress placed the usual substantial evidence rule in § 5(c) of the FTC Act, dealing with judicial review of orders, it made no similar provision in § 5 (l) with respect to determining the fact of violation.\n\nThis court's statement in United States v. St. Regis Paper Co., supra, 355 F.2d at 693, that \"the duty and responsibility for determining what business practices fall within the purview of Section 5 and for determining whether cease and desist orders issued to eliminate the anti-competitive effects of those practices have been complied with or violated was delegated solely to the FTC,\" must be read in context. The court was there discussing the division of authority between the Commission and the Attorney General, not the division of authority between the Commission and the judiciary. The next sentence in the opinion makes this abundantly clear:\n\nWhile one objective of the 1938 Wheeler-Lea amendment, including Section 5 (l), was to \"streamline\" the procedure for enforcing the Commission's cease and desist orders, it is nowhere indicated that Congress by providing a civil penalty enforcement procedure intended to transfer the responsibility for interpreting and investigating violations of such orders to the Attorney General.\n\nThe court was not saying that the FTC was to be judge as well as prosecutor or even that its ex parte determination of violation was entitled to weight in an adjudication proceeding before a court.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e Initiation of proceedings under § 5 (l) does not give the Commission's request a force it would not have in a petition for contempt. That being so, we see no practical difficulty in having a jury decide what television commercials mean -- a task for which they have more experience than most judges. See, Jaffee, supra note 8. Perhaps it would be wiser for Congress to allow the FTC to impose penalties for violations of its orders, subject to limited judicial review, as it has done in some other cases, see, e.g., § 271 of the Immigration and Nationality Act, 8 U.S.C. § 1321,\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e predecessors of which were held valid in Oceanic Steam Navigation Co. v. Stranahan, 214 U.S. 320, 53 L. Ed. 1013, 29 S. Ct. 671 (1909), and Lloyd Sabaudo Societa v. Elting, 287 U.S. 329, 77 L. Ed. 341, 53 S. Ct. 167 (1932). What is decisive is that, with that avenue known to be open, and with the Supreme Court having just sustained the provision in the National Labor Relations Act of 1935 authorizing the NLRB to award back pay, NLRB v. Jones \u0026 Laughlin Steel Corp., 301 U.S. 1, 48, 81 L. Ed. 893, 57 S. Ct. 615 (1937), Congress in enacting § 5 (l) took a course that had been uniformly held to entail a right to jury trial although, of course, only when there was a fair dispute over the fact of violation.\n\nIV. The Existence of Triable Issues of Fact.\n\nAs noted above, defendants' right to jury trial under F.R. Civ. P. 38(a) would be without consequence for this case if, as the district court held, the Government's suit presented no triable issues of fact.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e Determination of this question requires consideration of the nature of the issues presented and the proofs submitted.\n\nThe issues are of two somewhat different types. One is whether the commercials in question violated the cease and desist order. The other is whether FemIron was within the reach of the order, which applied to \"any other preparation of substantially similar composition or possessing substantially similar properties, under whatever name or names sold.\" The district court held both to be questions of law, 354 F. Supp. at 532, 535.\n\nIn actuality both inquiries involve a two-step process -- determining what the order means, concededly a task for the court, and deciding whether the accused commercials or product come within the order as so construed. As we said in Artvale, Inc. v. Rugby Fabrics Corp., 363 F.2d 1002, 1005 (2 Cir. 1966), \"the common approach seeking to dichotomize all decisions as either 'law' or 'fact' is too simplistic.\" See also In re Hygrade Envelope Corp., 366 F.2d 584, 588 (2 Cir. 1966). The different stance of the two issues here stems in part from the fact that with respect to the commercials there is no dispute concerning the meaning of the order; the commercials would clearly be in violation, for lack of the required affirmative statement as to the small proportion of people who suffer from iron deficiency, if they conveyed the impression that Geritol (or FemIron if within the order) would be beneficial generally for relief of tiredness, etc. That issue thus involved less and the FemIron issue more of what a court can determine better than a jury, perhaps about the only satisfactory criterion for distinguishing \"law\" from \"fact.\" See Traynor, J., dissenting in Loper v. Morrison, 23 Cal. 2d 600, 611-12, 145 P.2d 1, 6-7 (1944).\n\nIn determining whether the order applied to FemIron, the court was justified in giving a broad reading to the words \"or any other preparation [of substantially similar composition or] possessing substantially similar properties,\" 354 F. Supp. at 531. The order must be interpreted in light of its principal purpose, namely, to prevent the company from representing that a product useful only in overcoming problems arising from insufficient iron in the blood will be efficacious when the same symptoms are due to entirely different causes. The order is to be construed as an instrument to that end, not as a pharmacopoeia. It is undisputed that FemIron does not contain the vitamins present in Geritol and that it contains substantially less iron. Through their experts' affidavits, the defendants urged that because of these differences, FemIron was of only \"supplemental\" value -- it could serve only to prevent iron deficiency -- while Geritol was \"therapeutic\" -- it could remedy a current deficiency. These differences, however, are not significant in determining whether FemIron is subject to the order. The very argument that FemIron is too mild to treat the syndrome for which Geritol is intended demonstrates that the major difference between the two products is merely one of dosage. It would be senseless to hold that the defendants can avoid the Commission's order simply by a process of dilution and relabeling. For the purpose of determining whether FemIron was within the reach of the order, the defendants' affidavits were thus inapposite. If anything, the lower concentration of iron in FemIron would render any commercials suggesting that it will relieve tiredness even more misleading than similar Geritol commercials. We agree with the district court that defendants' claim that FemIron was not within the order raised no genuine issue of fact and was appropriately decided in the Government's favor on its motion for summary judgment.\n\nOn the other hand, while we agree with the court's premise that the FTC did not have the burden of showing that the accused commercials, if within the order, were false and deceptive, we are unable to see how this leads to the conclusion, 354 F. Supp. at 535, that:\n\nOnce the Commission establishes that a cease and desist order is in effect and that a particular advertisement has been disseminated which allegedly violates that order, it is for the court to determine as a matter of law whether the oral and/or visual content of the challenged advertisement falls within the scope of the prohibitions in the order.\n\nThe general rule is that when the meaning or effect of words or acts is fairly disputed, the question is for the trier of the facts, to be decided after hearing all material evidence, Washington Post Co. v. Chaloner, 250 U.S. 290, 293, 63 L. Ed. 987, 39 S. Ct. 448 (1919) (libel); Albert Dickinson Co. v. Mellos Peanut Co., 179 F.2d 265, 269 (7 Cir. 1950) (likelihood of confusion). The district court sought to counter this by saying, 354 F. Supp. at 535 n.11, that the issue was analogous to the interpretation of a writing in a contract action, which is considered to be an issue of law for the court, citing 4 Williston, Contracts, § 616, particularly at 648-49 (3d ed. 1961). However, we pointed out in Meyers v. Selznick Co., 373 F.2d 218, 221-23 (2 Cir. 1966), after referring to this very passage in Williston, that \"the traditional formulation goes considerably beyond the authorities, at least for the federal courts.\"\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e In addition, the Restatement of Contracts (Second) § 238(2) (Tent. Draft No. 5, March 1970), rejects the absolute position taken by Williston and states that even in the case of an integrated written agreement, interpretation is to be determined by the trier of fact if it depends on the credibility of extrinsic evidence or on a choice among reasonable inferences to be drawn therefrom. In any event, the interpretation of television commercials is not a subject on which a judge can do so much better than jurors that the issue should inevitably be taken from them as one of law. Neither is it an issue which, if triable to a judge, lends itself to summary judgment, unless, of course, the evidence would warrant a directed verdict. See Sartor v. Arkansas Natural Gas Corp., 321 U.S. 620, 624, 88 L. Ed. 967, 64 S. Ct. 724 (1944); Empire Electronics Co. v. United States, 311 F.2d 175, 180 (2 Cir. 1962); American Manufacturers Mutual Insurance Co. v. American Broadcasting-Paramount Theatres, Inc., 388 F.2d 272, 279 (2 Cir. 1967); 6 Moore, Federal Practice paras. 56.02[10], 56.04[2], 56.15.\n\nThe commercials, which we viewed in the presence of counsel,\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e can be divided into three groups: Counts 1-4, the AA commercials; Counts 5-9, the \"sad-glad\" commercials, with Counts 8 and 9 as a sub-group because of their use of the word \"power\"; and Counts 10-11, the FemIron commercials. Our consideration of these must be conducted in light of the admonition in FTC v. Colgate-Palmolive Co., 380 U.S. 374, 393, 13 L. Ed. 2d 904, 85 S. Ct. 1035 (1965):\n\nIf respondents in their subsequent commercials attempt to come as close to the line of misrepresentation as the Commission's order permits, they may without specifically intending to do so cross into the area proscribed by this order. However, it does not seem \"unfair to require that one who deliberately goes perilously close to an area of proscribed conduct shall take the risk that he may cross the line.\" Boyce Motor Lines, Inc. v. United States, 342 U.S. 337, 340, 72 S. Ct. 329, 96 L. Ed. 367.\n\nIn its letters of May 8 and June 6, the Commission indicated that it found nothing wrong with the AA commercials except that each of them twice used the word \"power.\" The first use was in a statement midway through each commercial that \"Geritol-iron enters your bloodstream fast carrying its blood-building power to every part of your body.\" The second, coming at the end of the commercials, was in the statement that Geritol builds \"iron power in your blood.\" The latter claim seems rather innocent; apparently Geritol is effective in combating iron-poor blood, and the cease and desist order does not prevent Williams from advertising this. The remark that Geritol builds \"iron power\" in the blood is so far from a representation that it is a generally effective remedy for tiredness that the Commission's objections on this score seem rather baseless. Both the Government and the court below relied more heavily on the earlier remark, that Geritol-iron carried its \"blood-building power\" to every part of the body. The district court stated, 354 F. Supp. at 537, \"to say that Geritol builds power in your blood is the effective equivalent of saying that Geritol builds power in you.\" While this inference may be conceivable, it certainly is not one that a jury would be compelled to draw. It is settled that on a motion for summary judgment a court must draw the inference most favorable to the party opposing the motion, United States v. Diebold, Inc., 369 U.S. 654, 8 L. Ed. 2d 176, 82 S. Ct. 993 (1962); Cali v. Eastern Airlines, Inc., 442 F.2d 65, 71-72 (2 Cir. 1971).\n\nTo our minds the only criticism that can fairly be made of the \"blood-building power\" phrase is that, taken alone, it did not convey with sufficient clarity that Geritol's \"blood-building power\" was limited to cases of iron deficiency. However, it is no more proper to take one line of a commercial out of context than it is with any other spoken or written utterance. The whole theme of the AA commercials was that Geritol could remedy \"iron-poor blood,\" and the claim of potency would almost certainly be taken in that sense.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e The serious question with respect to Counts 1-4 thus is not whether summary judgment in favor of the Government was proper, as we think it clearly was not, but whether the Government is entitled to have them submitted to a jury at all.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e However, defendants did not move for summary judgment on these counts and, although we could nevertheless direct it, see Abrams v. Occidental Petroleum Corp., 450 F.2d 157, 165-66 (2 Cir. 1971), aff'd, sub nom., Kern County Land Co. v. Occidental Petroleum Corp., 411 U.S. 582, 36 L. Ed. 2d 503, 93 S. Ct. 1736 (1973), we think it preferable to leave to the trial judge whether or not to direct a verdict on these counts in light of the evidence that will be presented.\n\nCounts 5 through 7 involve a commercial entitled \"Vacation\" and Counts 8 and 9 a commercial entitled \"Two Women.\" The appellants have termed these two commercials their \"sad-glad\" series. The common theme is of a woman who is \"sad\" because of having discovered, apparently from a medical examination of some kind, that she has \"iron-poor blood.\" She is told not to be sad on that account but to be glad for Geritol, which can remedy the deficiency. A later sequence shows her to be \"glad.\"\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nThe district court found that these commercials violated the cease and desist order, 354 F. Supp. at 539-41, on the following basis:\n\nHer smile may convey to viewers her happiness that she no longer has iron-poor blood, but it definitely conveys something else as well. It shows her in good spirits and makes her look stronger and healthier. The implication is that she was sad not simply because she had iron-poor blood, but because she was feeling run-down as a result of that fact. Now she is smiling not simply because she has iron-rich blood, but because she feels better as a consequence. Thanks to Geritol.\n\nWhile that is a possible inference, it is by no means the only one. We must confess we had thought that although the script did not demand the inference drawn by the district court, a viewing might well do so. To the contrary, the viewing led us to believe the defendants may well have succeeded in drawing the distinction the order demanded. Whether they did or not is for a jury to determine.\n\nWe reach a different conclusion with respect to Counts 10 and 11, relating to the FemIron commercials. Here the scripts did not sufficiently disclose that iron deficiency anemia was not present in most women; in fact they claimed \"that many healthy young women have little or no iron reserves,\" a vice similar to the one the Commission had properly found with respect to the commercials submitted in the first compliance report. The FemIron commercials then noted that \"some women even risk becoming anemic and tired,\" followed by a suggestion to take FemIron and \"maintain the supply you need to prevent iron shortage.\" The plain implication of the audio portion of the commercial was thus that FemIron is an effective remedy for tiredness and anemia -- a clear violation of the order. In addition, the scripts for the FemIron commercials each directed that the woman prior to taking FemIron should be depicted as a \"Tired Mother\"; the woman pictured at the end of the commercial is directed to display a \"Vital Look.\" Our viewing convinced us that the producers of the commercial had succeeded all too well in capturing the forbidden \"tired-vigorous\" dichotomy. We therefore sustain the grant of summary judgment on these counts.\n\nV. The Requirement of Notice.\n\nIn the interest of continuity, we have postponed consideration of certain arguments by defendants on the score of lack of advance notice of non-compliance and delay in giving such notice.\n\nAppellants' most extreme argument is that penalties under § 5 (l) do not begin to accrue until the defendant has been given notice that he is not in compliance and has had a reasonable time to bring himself into compliance. This contention is based on Continental Baking Co. v. Dixon, 283 F. Supp. 285 (D. Del. 1968), a 1959 statement by the FTC's Assistant General Counsel to a subcommittee of the House Committee on the Judiciary which we quoted in United States v. St. Regis Paper Co., supra, 355 F.2d at 695-96, and a remark by Chairman Dixon during the course of the hearing on the appellants' first compliance report.\n\nWe find nothing in § 5 (l) or in reason that would require such action by the FTC in every case. The statements by the Assistant General Counsel and by Chairman Dixon, if read literally, would be at variance with a public statement by the Commission, 33 F.R. 19097 (1968), that the obligation of firms to comply arises, and liability for penalties may be incurred, on the effective date of the orders and is not suspended or deferred pending the submission of compliance reports or action thereon. Very likely all that was meant was that, as a matter of good practice, the FTC ordinarily would make some effort to induce compliance before invoking the heavy sanctions of § 5 (l). Defendants received a full measure of consideration; indeed, the FTC took the rare step of according them a hearing and argument on the first compliance report. Acceptance of defendants' position would severely hamper the Commission in applying § 5 (l) to advertising cases generally, since every determination of non-compliance could be countered with some change in the advertising. Both the Eighth and Ninth Circuits have recently held that the Commission is not required to give notice before bringing suit for civil penalties. United States v. Beatrice Foods Co., 493 F.2d 1259 (8 Cir. 1974); United States v. Berkley, 1973-2 Trade Cas. (CCH) P74,695, No. 73-1070 (9 Cir. Sept. 5, 1973), cert. denied, 416 U.S. 970, 94 S. Ct. 1992, 40 L. Ed. 2d 558, 42 U.S.L.W. 3610 (1974). Defendants further contend that the Commission never actually stated that the AA commercials would be violative of the cease and desist order if the word \"power\" were left in the scripts. They also claim that the Commission's June 6 letter, with its request for a third compliance report, should be read as allowing appellants a reasonable time to remove the word \"power\" from the AA commercials that they were broadcasting at the time. However, the May 8 letter adequately conveyed the Commission's view that the AA commercials were unsatisfactory as long as they contained references to \"power.\" The June 6 letter formally assured the appellants that they could safely broadcast the AA commercials without the word \"power,\" but it in no way undercut the effect of the May 8 letter in informing appellants that the word \"power\" had met with Commission disapproval.\n\nRelying on dictum in United States v. ITT Continental Baking Co., No. C-1220 (D. Colo. Aug. 2, 1971) (Winner, J.), aff'd and remanded, 485 F.2d 16 (10 Cir. 1973), cert. granted, 416 U.S. 968, 94 S. Ct. 1990, 40 L. Ed. 2d 557, 42 U.S.L.W. 3610 (1974), defendants contend, as an alternative to the extreme position which we have rejected, that any liability on Counts 5-9 should be limited because, although the third compliance report was filed on July 7, 1969, Williams was given no response until September 5, despite the fact that the letter received on that date was prepared by the staff in July and early August. Appellants further contend that any liability on Counts 10 and 11 should be limited because the Commission never responded to the submission of the FemIron commercials on September 8. We agree with Judge Winner that \"it would seem unreasonable to permit the commission to knowingly let daily penalties accrue without giving notice of the commission's position at the earliest reasonable time.\" The difficulty lies in knowing when that occurs. It is undesirable for courts, unacquainted with the Commission's workload, to lay down lines that would necessarily be arbitrary. Although perhaps a case will arise which is so extreme as to demand judicial intervention, the present is not one.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e This is particularly true since, as we now hold, the Commission could have demanded even larger penalties than it did.\n\nVI. The $5,000-a-day Limitation.\n\nAs indicated in the statement of facts, for most of the counts the Commission considered all the broadcasts of a particular commercial on a particular day to constitute a single violation; for Counts 8 and 9, however, it charged that each separate broadcast of the commercial was a separate violation. Appellants object to both methods of calculating violations, and insist that $5,000 a day was the maximum, regardless of the number of different commercials or the number of broadcasts on that day.\n\nThe language of the statute, note 1 supra, argues against defendants' position. Although the maximum penalty has since been doubled, the version in effect at the time the complaint was filed imposed a penalty of $5,000 \"for each violation\" and added that \"each separate violation of such an order shall be a separate offense.\" The \"day\" concept entered only in a clause dealing with the situation where a defendant commanded to do some affirmative act has failed to do anything at all. Appellants say, with some force, that it is anomalous that a defendant who ignores a mandatory order of the Commission shall be liable for only $5,000 a day but one who affirmatively violates the order in 30 different places on the same day might be held for $150,000. The answer is that, as developed in the next point, Congress relied on the good sense of the FTC in making its certification to the Attorney General and, failing that, on the discretion of the court to prevent such an outrageous result.\n\nVII. Double Penalties Against Williams and Parkson.\n\nDefendants object, on two independent grounds, to the award of duplicate penalties against Williams and Parkson.\n\nIn the opinion accompanying the initial cease and desist order, the FTC said of Parkson, 68 F.T.C. at 536 n.2 (1965), \"in practicality it is Williams' advertising division. Parkson is completely owned by the stockholders of Williams and advertising Geritol is 95 percent of its business. The president of Parkson is also the vice-president and advertising director of Williams.\" An uncontradicted affidavit of the chief executive of Williams alleged that the two companies had the same principal officers; that Parkson acted as the advertising division of Williams and neither sought nor had any significant business for any other company; and that he had final authority over advertising for all Williams' products. A similarly uncontradicted affidavit of Williams' and Parkson's chief financial officer explained the raison d'etre of Parkson and the business relations between the two companies as follows: The media offer advertising agencies, whether independent or wholly-owned, a price 15% less than a direct-purchasing sponsor. Williams created Parkson to obtain this lower price. However, instead of retaining part or all the discount as would an independent agency, \"Parkson acts solely as an agent of Williams and as a conduit for the payment of Williams' advertising expenditures to the media.\" The officer added that Williams pays Parkson an amount sufficient to cover Parkson's operational expenses and to provide a profit of some $10,000 a year. Parkson's liquid assets as of June 30, 1971, were put at only $66,098, and its furniture, fixtures and leasehold improvements at $310,369.\n\nThe district court held that Parkson must nevertheless be treated as an entity separate from Williams. In so ruling, it relied on the letter of § 5 (l) which provides that \" any person, partnership, or corporation who violates an order of the Commission to cease and desist after it has become final\" (emphasis supplied) shall be liable for the statutory penalties and the fact that the Sixth Circuit had affirmed the order as to both defendants, 354 F. Supp. at 546.\n\nThis is not the way courts have dealt with the problem whether two legally separate corporate entities should be regarded as one. As we said in Bowater S.S. Co. v. Patterson, 303 F.2d 369, 372-73 (2 Cir.), cert. denied, 371 U.S. 860, 9 L. Ed. 2d 98, 83 S. Ct. 116 (1962), citing many cases:\n\nWhether a subsidiary corporation is to be considered a separate entity \"cannot be asked, or answered, in vacuo,\" Latty, The Corporate Entity as a Solvent of Legal Problems, 34 Mich. L. Rev. 597, 603 (1936); the issues in each case must be resolved in the light of the policy underlying the applicable legal rule, whether of statute or common law.\n\nWe there rejected the contention that a steamship company under common ownership with a timber operation was not engaged in the latter business and hence was outside the ambit of the Norris-LaGuardia Act, 29 U.S.C. § 113, in regard to a dispute between the timber operator and its employees. We said:\n\nAssuming, as we may, that plaintiff and Bowater's Newfoundland had sufficient independence to be regarded, in contract or tort litigation, as separate both from the ultimate parent, Bowater Paper Company, Ltd., and from each other, see Bartle v. Home Owners Cooperative, Inc., 309 N.Y. 103, 127 N.E. 2d 832 (1955), it does not follow that they ought be so regarded for application of the Norris-LaGuardia Act.\n\nWe did not think Congress meant the policies of that act \"to be defeated by the fragmentation of an integrated business into a congeries of corporate entities, however much these might properly be respected for other purposes.\" Still more instructive is Mr. Justice Douglas' opinion in NLRB v. Deena Artware, Inc., 361 U.S. 398, 402-04, 4 L. Ed. 2d 400, 80 S. Ct. 441 (1960), holding that in an enforcement proceeding the Board was entitled to show that a group of \"separate corporations are not what they appear to be, that in truth they are but divisions or departments of a 'single enterprise. '\"\n\nThe same considerations which allowed the Labor Board in Deena to treat as one what nominally were several here require that in decreeing penalties a court should treat as one what nominally are two. It is human beings who cause violations of cease and desist orders, but no one suggests that § 5 (l) contemplates a separate penalty against every person who had a hand in the offending commercials. What Congress intended was a single penalty from persons acting under single control. Under the district court's theory, if Williams had had five Parksons, each operating in a different region, there could have been a sextuple penalty for what in every practical sense was conduct by a single corporation. Naturally, a case of violation by a manufacturer and an independent advertising agency would present a different question.\n\nAlternatively, we hold that, under the circumstances of this case, where the FTC requested only a judgment against both defendants \"in the total sum of $500,000,\" the Attorney General was without authority to seek that amount against each under the fair implications of our decision in United States v. St. Regis Paper Co., supra, 355 F.2d 688. The Government seeks to distinguish St. Regis on the basis that although the FTC there requested action by the Attorney General, see 355 F.2d at 690 n.1, it had made no certificate at all, and that the statute, 15 U.S.C. § 56, speaks of certifying \"the facts\" and not the relief sought. This respects the St. Regis holding but rejects the reasoning that supported it. The thrust of the majority's decision, 355 F.2d at 695-98, was that Congress had placed the task of determining when and what penalties should be sought in the FTC and not in the Attorney General.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e The draft complaint forwarded in this case by the FTC to the Attorney General shows that the Commission took seriously its responsibilities concerning the amount of the penalty, notably by assessing penalties for each individual broadcast only in Counts 9 and 10. On the Government's theory the Attorney General would have been at liberty to apply this method to the other counts, as to which the Commission had chosen the more lenient course of charging each day of broadcasting as a single violation. This view is plainly at odds with the rationale of St. Regis. Again, the Chairman's letter referred to the opinion of Commissioner Elman that the defendants \"should be held liable for all violations of the order to cease and desist after it became final on December 31, 1967, and that the proceeding should not be limited in scope but should seek civil penalties for each advertisement.\" On the Government's view the Attorney General was free to take that line, although a majority of the Commission had decided that a lesser amount would serve the purposes of the Act. If the Attorney General could not take either of these courses -- and under St. Regis he could not -- we fail to see what authority he had to double the Commission's demand of $500,000.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\n\nVIII. The Request for an Evidentiary Hearing on the Amount of the Penalties.\n\nNot disputing that determination of the amount of penalties within the maximum is committed to the informed discretion of the district judge,\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e see United States v. ITT Continental Baking Co., 485 F.2d 16, 21 (10 Cir. 1973), appellants contend they were entitled to an evidentiary hearing on such relevant subjects as their good faith belief that the accused commercials did not violate the order and the degree of harm caused by any that did. They argue with force that such a hearing was an indispensable preliminary to the court's findings that broadcasting of the commercials in Counts 1-4 and 8-9 revealed \"a total lack of good faith with respect to the dissemination of these advertisements and, if not wilful violations of the order, at least reckless disregard of its prohibitions;\"\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e that the broadcast of the commercials in Counts 5-7 \"amounted to gross negligence and bordered on recklessness;\" and that the FemIron advertisements in Counts 10 and 11 \"were in wilful disregard\" of the order, 354 F. Supp. at 552-53. In view of our holding that summary judgment was proper only on Counts 10 and 11, it is only the denial of a hearing as to these counts that is now before us, although the issue may arise if the jury should find for the Government on other counts after a trial.\n\nWhile there appears to be no authority on the point, we would think it desirable that the court accord an evidentiary hearing on the amount of the penalty if this is reasonably and seasonably requested either by the defendants or by the Government. As the court below recognized, the size of the penalty should be based on a number of factors including the good or bad faith of the defendants, the injury to the public, and the defendants' ability to pay. 354 F. Supp. at 548. See United States v. Universal Wool Batting Corp., 1961 Trade Cases para. 70,168 (S.D.N.Y. 1961); United States v. Vitasafe Corp., 212 F. Supp. 397 (S.D.N.Y. 1962); United States v. Wilson Chemical Co., 1962 Trade Cases para. 70,478 (W.D. Pa. 1962), aff'd, 319 F.2d 133 (3 Cir. 1963); United States v. H. M. Prince Textiles, Inc., 262 F. Supp. 383, 389 (S.D.N.Y. 1966); United States v. Bostic, supra, 336 F. Supp. at 1321. The enormous range of penalties available to the district court in the usual civil penalty case renders it of critical importance that the court have adequate information on the issues to be considered in assessing the penalty. However, we are not disposed to reverse the judgments in this case on Counts 10 and 11 solely because of the denial of a hearing. These commercials would have been clear violations of the order if made with respect to Geritol, and the only possible mitigating circumstance could be defendants' belief that FemIron was not within it. Although on notice of the Commission's contrary view, the appellants proceeded to broadcast commercials for their new product that unquestionably transgressed the restrictions and disclosure requirements of the order. The court had a considerable amount of information about the dispute over FemIron, and it does not seem likely that an evidentiary hearing would have produced any different result.\n\nThe judgments against Williams on Counts 10 and 11 are affirmed; all judgments against Parkson are set aside; the judgments against Williams on Counts 1 through 9 are reversed and the cause is remanded for a jury trial on these counts as against Williams only. No costs.\n\nDisposition\n\nAffirmed in part, reversed in part, and remanded.\n\nOAKES, Circuit Judge (dissenting):\n\nI dissent, with all respect. My colleagues' decision today, of importance to the Federal Trade Commission and would be deceptive American advertisers generally, is a first at an appellate level. They hold that an advertiser subject to a reviewed and final order of the Federal Trade Commission to cease and desist from deception is entitled not only to a plenary trial, but one with a jury, on the question whether the order has been violated by a \"new\" commercial (see note 10 infra). They reach this decision not only despite lengthy administrative proceedings, at every step of which the advertiser participated adversarily, the proceedings culminating in the order which was finalized after review by another circuit court of appeals. They appear to me for all significant practical purposes to ignore extensive administrative proceedings, formal and informal, subsequent to the judicial upholding of the order, during the course of which additional proceedings the advertiser was given ample opportunity to modify its \"new\" commercials so as to comply with the outstanding order but chose instead -- in defiance of the Commission's warnings -- at the very least to skirt the edge of the order's terms. My colleagues give no weight whatsoever to the Commission's -- I may say long-restrained certification of facts of violation to the Attorney General, after a decade of administrative proceedings, in accordance with the prescribed statutory procedure. Their construction of the congressional purpose pulls the teeth of an enforcement statute enacted to ensure compliance with a judicially-reviewed cease and desist order, rendering the statute as ineffective as soft rubber dentures.\n\nI cannot believe that Congress could conceivably have intended to make it so easy to evade Trade Commission orders. I do believe that my colleagues have overlooked the statutory scheme and hence misconstrued the statutory purpose; they have done so, regrettably I think, without support in the legislative history or, with one minor exception discredited in its own circuit, among the judicial authorities. Their underlying rationale escapes me. Hence this dissent.\n\nI. THE \"RIGHT\" TO A JURY TRIAL.\n\nThe point of departure for examination of the question whether appellants have a right to a plenary, jury trial under Fed. R. Civ. P. 38(a), which preserves \"the right of trial by jury as declared by the Seventh Amendment to the Constitution . . .,\" is 15 U.S.C. § 45 (l),\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e the civil penalty provision under which the Government brought this action. But it is not to be viewed in isolation, as if it were some separate statutory entity. Rather it must be examined in the context of the Federal Trade Commission Act as a whole, taking care to note the statutory scheme and underlying congressional policies concerning the control of deceptive advertising to determine the role and the implementation function of § 45 (l). Aside from the general goal of seeking to divine the legislative purpose, there are three good reasons that force consideration of the role played by § 45 (l) in the overall regulatory scheme devised by Congress. The first of these is stated in the majority's opinion as follows: \"Congress apparently did not expressly confront the jury trial question [with respect to § 45(1)] . . . .\"\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Secondly, with only one exception, and that a case subsequently subjected to severe criticism by its own circuit court of appeals,\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e no case among the many cited in part III of the majority opinion holds that, in an action brought by the United States to recover civil penalties for violation of the valid order of an administrative agency, the defendant has a right to a jury trial as a matter of statutory or constitutional law. Thirdly, and perhaps most importantly, we must determine whether the recognition of the right to a plenary, jury trial would tend to subvert the entire statutory structure by which the FTC has been charged with the regulation of false and deceptive advertising.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e The majority opinion attempts to interpret § 45 (l) as if it existed in a statutory vacuum. I would reject that approach, relying on the Supreme Court's recent statement that \"our task in interpreting separate provisions of a single Act is to give the Act 'the most harmonious, comprehensive meaning possible ' in light of the legislative policy and purpose.\"\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nA. The Statutory Scheme and Administrative Proceedings.\n\nUnder 15 U.S.C. § 45, the FTC is responsible for making the initial determination that any party may be engaging in unfair or deceptive practices in commerce. Briefly, if the FTC deems a proceeding under § 45(b) \"would be to the interest of the public,\" the party in question is served with a notice, hearings are held, and if the FTC determines from the hearings that a violation has occurred, \"it shall make a report in writing in which it shall state its findings as to the facts and shall issue . . . an order [requiring that party] to cease and desist from using such method of competition or such act or practice.\" 15 U.S.C. § 45(b). Under 15 U.S.C. § 45(c), any party subject to such a cease and desist order may then obtain review of that order in a court of appeals. The standard of review set forth in the statute to be applied by the circuit courts of appeals is that the findings of the Commission as to the facts, if supported by evidence, shall be conclusive.\" Id.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e If either party desires to adduce evidence in addition to that adduced in the hearings, application may be made to the court of appeals which, if it grants the application, orders the evidence to be taken before the FTC.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e The court of appeals then enters a decree affirming, modifying or setting aside the FTC order and enforcing the order to the extent affirmed. Certiorari to the Supreme Court is available under 28 U.S.C. § 347.\n\nIn the case now before us, the above procedures were followed and culminated in the enforcement on review by the Sixth Circuit Court of Appeals, with some modification, of the FTC order directed against appellants here. The original complaint against appellants was issued in December of 1962; the court order granting enforcement was entered August 11, 1967, more than 4 1/2 years later. J. B. Williams Co. v. FTC, 381 F.2d 884 (6th Cir. 1967) (Williams I). Williams I in short represented the culmination by way of judicial review and sanction of an extended administrative process that had found Geritol commercials to be in violation of §§ 5 \u0026 12 of the Federal Trade Commission Act.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nAfter a cease and desist order is granted enforcement by a court of appeals, and only thereafter, can the FTC move to force compliance or exact penalties for noncompliance. In this case, as the majority opinion points out the FTC and appellants followed the administrative procedure, 16 C.F.R. § 3.61, whereby after issuance of a cease and desist order compliance reports are submitted by appellants to the FTC, and it reviews the reports or institutes proceedings to enforce compliance. The first such report on October 23, 1968, resulted in the calling of a further public hearing by the FTC which was held on November 14, 1968, in which it was determined that appellants' advertising was not in compliance with the cease and desist order.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e The FTC, rather than moving immediately to force compliance (by way of injunction) or to penalize noncompliance (by way of an action under § 45 (l), gave appellants what amounted to a \"second chance,\" a fair warning that future noncompliance would necessitate more drastic moves by the FTC.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e It published on December 2, 1968, an opinion which required the submission of a second compliance report. That report, submitted on January 31, 1969, by appellants, dealt with the \"AA\" commercials before us in counts 1-4 and included the scripts for what before us are the \"BB\" commercials, counts 5-9. The FTC studied this report and, without holding hearings but after consultation between the FTC staff and appellants' representatives, advised appellants by letter of what steps might be taken to achieve compliance with the order, viz., deleting all references to \"power\" in the \"AA\" commercials. By letter dated May 15, 1969, the appellants accepted the Commission's conditions and agreed to remove the word \"power \". The violations alleged in counts 1-4 occurred between June 10, 1969, and June 20, 1969, more than three weeks after appellants had agreed to stop using them. The \"sad-glad\" commercials referred to in counts 5-7 were used from and after June 14, 1969, and before they were submitted to the Commission in the third compliance report filed on June 7, 1969; appellants did not request advice from the Commission as to whether such use would constitute compliance. Counts 8-9 are based on \"sad-glad\" commercials which also use the word \"power,\" and these were disseminated between June 2 and June 6, 1969, over two weeks after the May 15, 1969, letter of appellants. As to counts 10-11, the FemIron counts, the Commission did not even know of FemIron advertising until it appeared on network television; the Commission staff advised on July 16, 1969, and the Commission itself on September 3, 1969, in rejecting the third compliance report, that FemIron was subject to the order. These procedures indicate that after a cease and desist order has been enforced by a court of appeals, the FTC plays the key role in determining whether its own order has been violated and in seeking sanctions for such violation, and its sound administrative practice as followed here gives a previously deceptive advertiser\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e who is subject to an outstanding order ample opportunity to demonstrate his belated good faith compliance with the Act. Even given some unasserted right of appellants to secure a narrow review by way of a declaratory judgment as to whether a specific commercial is in compliance with such an order,\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e it seems beyond dispute that the FTC is to use its expertise in construing the order and applying it to \"new\" advertising. n.13 (footnote omitted). Here indeed it did so. To the extent that the majority opinion is a substitution of judicial judgment for that exercise of administrative expertise, it is unsupportable.\n\nOn November 28, 1969, the FTC, apparently convinced at this point that appellants both had violated -- it did not use but could have used the word \"flouted\" -- the cease and desist order and could probably be expected to do so in the future, took the first step necessary to exact penalties for such noncompliance. This step was not, as seems to be suggested by the majority opinion, merely the submission of a \"draft complaint\" by the FTC for rubber-stamp approval and prosecution by the Attorney General. It was, rather a certification of facts previously found by the FTC transmitted to the Attorney General, \"whose duty it shall be to cause appropriate proceedings to be brought for the enforcement [of § 45 (l)].\" 15 U.S.C. § 56. The importance of the procedure to the functioning of the entire regulatory scheme has been the subject of extensive consideration by this court in United States v. St. Regis Paper Co., 355 F.2d 688 (2d Cir. 1966). There, in an opinion rejecting the claim that the Attorney General could himself bring a penalty action under § 45 (l) without having had the facts of an alleged violation certified to him by the FTC, the court went carefully into both the sparse legislative history and policy reasons supporting the conclusion that only the FTC has the statutory power to initiate proceedings under § 45 (l). The opinion is replete with numerous references to the agency's expertise involved in determining whether one of its orders has been violated, but the following passage stands out:\n\nTo relinquish jurisdiction to the Attorney General after the issuance of a cease and desist order would be most unrealistic, for the Commission alone knows the scope of its orders and has been \"provided with staffs to institute proceedings and to follow up decrees and police their obedience. . . .\"\n\nUnited States v. St. Regis Paper Co., 355 F.2d at 696 (emphasis added), quoting in part United States v. Morton Salt Co., 338 U.S. 632, 640, 94 L. Ed. 401, 70 S. Ct. 357 (1950). Again,\n\nThe duty and responsibility for determining . . . whether cease and desist orders issued to eliminate the anti-competitive effects of [certain] practices have been complied with or violated was delegated solely to the FTC.\n\nId. at 693 (emphasis added.) This quote is not, as intimated in the majority opinion, being used to support the proposition \"that the FTC was to be judge as well as prosecutor.\" The fact that 15 U.S.C. § 56 requires the FTC to proceed through the Attorney General after a fact certification is itself conclusive that the FTC is neither to be sole judge nor prosecutor. The majority's reference to \"ex parte\" determinations of violation is inexplicable, given the facts of this case, in which -- before the penalty action was initiated -- there was a full public hearing and argument on the first compliance report, as well as numerous meetings between the parties and the exchange of correspondence on the second and third compliance reports. And, contrary to the assertion that the agency's determination of violation is \"not entitled to weight in an adjudication proceeding before a court,\" it clearly emerges in the St. Regis opinion that the acknowledged expertise of the FTC in interpreting its own orders is to be given some weight in the § 45 (l) action. The underlying premise of the majority that no weight is to be accorded to the FTC's certification of facts in and of itself emasculates the penalty provisions of the Act.\n\nThe soundness of the St. Regis opinion has recently been reinforced by the decision of the Court of Appeals for the District of Columbia in Holloway v. Bristol-Myers Corp., 158 U.S. App. D.C. 207, 485 F.2d 986 (1973). There, plaintiffs asserted a private right of action to enforce 15 U.S.C. §§ 45(a), 52(a) (1) and 54(a), existing by implication from the statutory scheme. In rejecting this implied right Judge Leventhal addressed himself to the inseparability of the dual functions of the FTC in determining whether violations had occurred as well as acting in an enforcement capacity: \"the substantive prohibitions of the statute are inextricably intertwined with provisions defining the power and duties of a specialized administrative body [the FTC] charged with its enforcement. . . .\" Id. at 989 See also FTC v. Ruberoid Co., 343 U.S. 470, 473, 96 L. Ed. 1081, 72 S. Ct. 800 (1952). As pointed out by this court in St. Regis, what would be meat to the FTC might well be poison to the Attorney General. 355 F.2d at 695. The certification of facts by the Commission to the Attorney General is in and of itself a determination of violation of the cease and desist order.\n\nSection 45 (l) having been invoked in this case as one of three possible means of securing compliance with the cease and desist order, the statutory scheme has run full course. The question what right to a plenary or jury trial might exist under § 45 (l) cannot be treated, I repeat, without considering the question what weight must be accorded to the \"facts\" found by the FTC and certified to the Attorney General under 15 U.S.C. § 56.\n\nAppellants here do not claim any generalized right to a jury trial on all disputed issues of \"fact\" that may arise or did arise in the \"compliance\" phase of these 11-plus years of administrative and judicial proceedings. Rather, appellants claim a right to a jury trial on two issues which appellants choose to characterize as factual: (1) the meaning of the commercials and (2) the meaning of the word \"properties\" as applied to the product FemIron in counts 10-11. The majority ultimately concedes that the latter question is a purely legal question that was in the province of the court below to resolve. In my view, for reasons that will appear below, the court in making that determination should give great deference to the agency's own views on that question. The narrow question remains whether appellants were entitled to a trial de novo (indeed a jury trial) on the \"meaning\" of the 11 commercials.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nB. Expertise and the \"Meaning\" of Commercials.\n\nThe principal function performed by the FTC in the administration of the deceptive advertising provisions of the Federal Trade Commission Act is the determination of what advertising actually violates that Act. The FTC is also responsible for making broader policy that may affect the whole spectrum of advertising,\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e but the one area in which its expertise has never been seriously questioned is in determining whether a given advertisement is \"deceptive.\"\n\nThe case law on this \"expertise\" is unequivocal and so voluminous that it is necessary only to illustrate the point. As the District of Columbia Court of Appeals recently stated,\n\nThe Commission has developed a fund of knowledge as to the probable impact upon purchasers of particular advertising representations, and in recent years has been active in the evolution of new and innovative remedies to correct false advertising and to undo the effects of deceptive trade practices.\n\nHolloway v. Bristol-Myers Corp., 485 F.2d at 998-99.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e The Supreme Court had earlier stated its view on this precise question:\n\nThis statutory scheme necessarily gives the Commission an influential role in interpreting § 5 [15 U.S.C. § 45] and in applying it to the facts of particular cases arising out of unprecedented situations. Moreover, as an administrative agency which deals continually with cases in the area, the Commission is often in a better position than are courts to determine whether a practice is \"deceptive\" within the meaning of the Act. This Court has frequently stated that the Commission's judgment is to be given great weight by reviewing courts. This admonition is especially true with respect to allegedly deceptive advertising since the finding of a § 5 violation in this field rests so heavily on inference and pragmatic judgment.\n\nFTC v. Colgate-Palmolive Co., 380 U.S. 374, 385, 13 L. Ed. 2d 904, 85 S. Ct. 1035 (1965) (emphasis added).\n\nThere is no reason of which I am aware that this expertise is suddenly to be discarded once an order has been made and reviewed, as the majority does.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e Viewing the Federal Trade Commission Act as an integrated whole, see note 2 supra, which is the way Congress viewed it, I simply cannot agree that the storehouse of information acquired, and experience gathered by the FTC on the question of the effect of advertising on consumers, the \"meaning of commercials,\" is to be disregarded, or that Congress intended it to be disregarded, at what might be -- owing to the intransigence or greediness of an advertiser -- the most critical point of the entire process, that of penalizing those who would defy the will of Congress as expressed in the Act.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nC. The Legislative History.\n\nThis court has previously referred to the legislative history of § 45 (l) as \"sparse,\" United States v. St. Regis Paper Co., 355 F.2d at 692, and it is conceded by all that neither the statute itself nor the legislative history make any direct reference to the jury trial question. In such a situation we should be doubly aware of Justice Jackson's admonition in Schwegmann Brothers v. Calvert Distillers Corp., 341 U.S. 384, 395, 95 L. Ed. 1035, 71 S. Ct. 745 (1951), that \"to select casual statements from floor debates, not always distinguished for candor or accuracy, as a basis for making up our minds what law Congress intended to enact is to substitute ourselves for the Congress in one of its important functions.\"\n\nI do not draw the same inferences as the majority does from my examination of the legislative history as is available to guide us. The Wheeler-Lea Amendments of 1938 to the Federal Trade Commission Act had a tortured history of congressional inaction and compromise which has been thoroughly recounted elsewhere. See generally Holloway v. Bristol-Myers Corp., 485 F.2d at 992-94. It appears that some members of Congress successfully held up passage of the final bill by their strenuous advocacy of the position that control and regulation of deceptive advertising should be placed within the jurisdiction of the Food and Drug Administration. The opponents, who eventually prevailed, made the argument that the FTC, as a \"quasi-judicial\" body, was in a better position to deal with this category of practices.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nSection 5 (l) of the Amendments, now 15 U.S.C. § 45(l), was one of the provisions adopted to make cease and desist orders more effective. Prior to the adoption of the Amendments, enforcement of a cease and desist order could be had only after new proceedings, presumably full-blown hearings, had been instituted to ascertain whether the order had been violated. One of the purposes of new § 5(l) was to streamline the procedure as follows:\n\nThe order of the Commissioner would definitely become final as provided in Section 5 and become operative as to further transgressions without the initiation of new proceedings as now required after the violation occurs.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nH.R. Rep. No. 1613, 75th Cong., 1st Sess. 6 (1937). These \"new proceedings,\" at least in the mind of Representative Chapman, represented a frustration of the purposes of the administrative process because of the very nature of the advertising beast:\n\nAdvertising copy is frequently changed as a matter of good advertising technique. By the time the cease-and-desist order or an injunction becomes effective the advertiser, as a matter of course, will change his copy. He can continue this process indefinitely without running any risk whatever of penalty, and when he has run the gamut of all the claims he can plausibly make for his product, he can then change its composition, as patent-medicine manufacturers have so frequently done, and repeat the process over and over again.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\n83 Cong. Rec. 400 (1938).\n\nAt two points during the House debate, brief comments were made, although not directly referring to the jury trial question, that cast some light on the question why there was any need in the first place for a complex regulatory scheme to prevent and regulate deceptive advertising. Representative Sirovich, relatively early in the debate, made reference to \"the American gullible public.\" 83 Cong. Rec. 394 (1938). Later in the debate, Representative Coffee reiterated and fortified this prior statement by reference to \"the gullible people.\" Id. at 416. Congress, these remarks indicate, was supremely aware that the average American citizen was often unable to discern the false from the true when subjected to the sales pitches of the advertising industry. One might even group within the classification of \"gullible\" us federal judges.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e If this be true, it is certainly permissible to draw the inference that a jury would not have been considered by Congress to be the most useful tool to implement the purposes of the Federal Trade Commission Act had Congress directly considered the question.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nThe only other \"clue\" in the legislative history derives from a brief reference to the fact that the civil penalty provision was based on similar provisions in the Packers and Stockyards Act of 1921 and the Securities Exchange Act of 1934. See, e.g., S. Rep. No. 1705, 74th Cong., 2d Sess. 7 (1936). The provision of the former, 7 U.S.C.§ 195, is clearly criminal and therefore has no relevance here, unless it is seen as a general reference to the fact that criminal sanctions were included in the Wheeler-Lea Amendments. There is some question as to what provision of the Securities Exchange Act was being referred to, and for what purpose, by the Wheeler-Lea lawmakers in their reports and debate. H.R. Rep. No. 1613, 75th Cong., 1st Sess. 4 (1937), clearly indicates that the reference to the Securities Exchange Act of 1934 was to 15 U.S.C. § 78y(a), which is nothing more than the general provision under which decisions or orders of the SEC are subjected to judicial review, as opposed to 15 U.S.C. § 78ff(b) (referred to by the majority opinion). The reference to the Securities Exchange Act of 1934 may thus have been simply a general reference to features incorporated into the Wheeler-Lea Amendments. Specifically, the reference in the House Report goes to the inclusion of a provision making FTC orders final unless appealed within a 60-day period. Neither the remarks of Senator Wheeler, 80 Cong. Rec. 6594 (1936), nor those of Representative Reece, 83 Cong. Rec. 397 (1938), relied upon by the majority, make reference to any specific provision of the Securities Exchange Act of 1934. In S. Rep. No. 1705, 74th Cong., 2d Sess. 7, 8 (1936), specific reference is made to 15 U.S.C. § 78y(b) with respect to granting the courts of appeals the power to issue temporary injunctions, and 15 U.S.C. § 78y(a) with respect to the time for appeals. S. Rep. No. 221, 75th Cong., 1st Sess. 7 (1937), in pertinent part, is merely a reprint of S. Rep. No. 1705, and thus adds no reference to 15 U.S.C. § 78ff(b) or otherwise clarifies this question. None of the sources standing for the proposition that the Congress considered § 45(l) to be patterned on the Securities Exchange Act of 1934 make reference to the majority's § 78ff(b); they refer only to 15 U.S.C. § 78y(a) and (b).\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nD. Reasoning by Reference to Other Statutes.\n\nGiven the paucity of legislative history bearing on the issue before us, one is tempted to reason by analogy to other statutory provisions that may \"look like\" § 45(l). But as the foregoing has, I hope, made clear, to reason by analogy is at best dangerous where a statutory penalty provision was adopted as part of and integral to a complex regulatory scheme formulated by Congress with certain objectives in mind, and at worst looking to one's \"own heart for his decision\" as opposed to \"seeking to divine out of the confused, often conflicting and half-conscious aspirations which lie behind a statute some resultant of those forces in keeping with what was consciously contemplated.\" A. Cox, Hand and the Interpretation of Statutes, 60 Harv. L. Rev. 370, 373 (1947).\n\nThe analogy to the Interstate Commerce Act penalty section, 49 U.S.C. § 16(8), drawn in the majority opinion seems to me not in the least persuasive. This provision is said to be \"almost certainly\" \"the true model\" for § 45(l). If this were so, of course, one might have expected some reference to it in the legislative history of § 45(l), especially given the apparently inaccurate reference to provisions in the Stockyards Act of 1921 and the Securities Exchange Act of 1934. Nevertheless, two features of § 16(8) stand out most prominently: first, the question whether the right to a jury trial obtains under that section has never been either litigated or decided; second, the language of § 16(8) is itself sufficiently different from that of § 45(l) to render any analogy without significance.\n\nAs for \"other contemporaneous railroad regulation statutes,\" to which the majority refers, perhaps including 49 U.S.C. § 16(2), which deals with civil complaints by persons against carriers in reference to an ICC order for the payment of money, the only thing necessary to say is that what is or was good for the railroads probably has little or nothing to do with the control of deceptive advertising by the FTC.\n\nAs to the language of § 16(8) itself, that section differs, inter alia, in that it requires an ICC order to be knowingly violated. Not only does § 45(l) have no such requirement, but the Supreme Court has said flatly that specific intent is not a requisite to violation of an order issued by the FTC in a false advertising case. FTC v. Colgate-Palmolive Co., 380 U.S. at 393. It seems evident that the penalty provisions governing ICC orders are plums while here we have a different, if less sweet, fruit.\n\nOne analogy, completely neglected by the majority, remains to be explored which should at least theoretically be more fruitful because it involves the incorporation of § 45(l) as an enforcement tool in Clayton Act proceedings. This provision, now 15 U.S.C. § 21(l), as its legislative history shows, was patterned after § 45(l) because the FTC had shown a more than two-decade history of being unable effectively to enforce the Clayton Act with the limited means available. S. Rep. No. 83, 86th Cong., 1st Sess. 2 (1959). Without detailing the enforcement procedures then existing, suffice it to say that one of the specific objections to the earlier procedure was that \"enforcement of the court's order must be secured in a subsequent contempt proceeding, which requires proof that new activities of the respondent have violated the court's order.\" H.R. Rep. No. 580, 86th Cong., 1st Sess. (1959), U.S. Code Cong. \u0026 Ad. News 1805 (1959). Congress, although it did not confront the jury trial issue directly, can hardly be thought to have wanted to substitute, for an ungainly system of new hearings and review, a procedure that would require the agency in effect to try its whole case de novo before a court or a jury. Now Chief Judge Coffin of the First Circuit captured what I take to be the essence of § 21(l) when he said that \"Congress has provided that a final Commission order can be the unimpeachable basis of a Justice Department suit against a defendant for violation of such order, with fines up to $5,000 for each violation.\" Farmington Dowel Products Co. v. Forster Manufacturing Co., 421 F.2d 61, 75 (1st Cir. 1970). The point here is that once an order of the FTC is final, one subject to such an order has already had his \"day in court\" and is on notice thereafter that violations are subject to severe penalties without the interposition of renewed hearings and trials of issues that have been previously decided.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e The unsupported assumption of the district court in United States v. Beatrice Foods Co., 344 F. Supp. 104, 111 (D. Minn. 1972), aff'd, 493 F.2d 1259 (8th Cir. 1974), that jury trial is available where there is an issue of material fact, does not control the question. Indeed, in affirming the Beatrice judgment the Eighth Circuit paid no heed to the lower court's dicta regarding a jury trial and examined § 21(l) in much the same light as this dissent examines § 45(l). Slip op. at 11-13. Very clearly were there such an issue the district court could \"stay its hand\" pending a determination thereof by the agency. Cf. CIBA Corp. v. Weinberger, 412 U.S. 640, 644, 37 L. Ed. 2d 230, 93 S. Ct. 2495 (1973).\n\nE. Judicial Precedent, and, Parenthetically, Constitutionality.\n\nAs stated, there is only one case that has held that a right to a jury trial obtains in an action under § 45(l). In United States v. Hindman, 179 F. Supp. 926 (D.N.J. 1960), the question was whether an order issued by the FTC prohibiting the use of the label \"custom-made\" was sufficient to cover a label, \"custom-tailored,\" subsequently adopted for use by the defendant. The totally fallacious premise upon which the district court arrived at its conclusion that a jury trial was required was as follows:\n\nwe must bear in mind the principle that the meaning to be given such representations as these [presumably both \"custom-made\" and \"custom-tailored\"] is not the meaning which would be attached to them by experts, but by the average man who would be likely to purchase the articles in question and to whom those representations are thus made.\n\nId. at 927-28. The statement is a non sequitur in the first place: while the question of deceptiveness relates to laymen being deceived, expertise on what is deceptive is important. Beyond this, according to the Hindman court, neither \"expert\" testimony nor the expertise of the FTC itself plays any role whatsoever in determining what advertisements are or are not deceptive. One is forced to wonder what the district court thought the FTC was in business to do.\n\nNot surprisingly, the Hindman court's holding was categorically rejected, albeit in dictum, by its own court of appeals in United States v. Vulcanized Rubber \u0026 Plastics Co., 288 F.2d 257, 258-59 n.2 (3d Cir.), cert. denied, 368 U.S. 821, 7 L. Ed. 2d 26, 82 S. Ct. 38 (1961). After recounting the facts as presented to the Hindman court, the Third Circuit said that the Hindman court's holding\n\nwas erroneous, since the sole issue before the court was whether or not the labeling practice was within the proscription of the order and not whether the labeling practice was deceptive. . . . Moreover, creating an issue of fact as the court did in Hindman, would usurp the function exclusively vested by Congress in the Federal Trade Commission to determine the issue of whether a labeling practice is misleading or deceptive to the public.\n\n(Emphasis added.) As the text of Vulcanized makes clear, the court there based its statement concerning the \"sole issue before the court\" on its reading of FTC v. Morton Salt Co., 334 U.S. 37, 54, 92 L. Ed. 1196, 68 S. Ct. 822 (1948). In its petition for a writ of certiorari to the Supreme Court, Vulcanized conceded that to be the correct application of Mr. Justice Black's language in Morton Salt,\u003cspan class=\"fnref\"\u003e25\u003c/span\u003ea but nevertheless argued that the FTC had never passed on the labeling of its combs \"rubber-resin\"; rather, Vulcanized insisted, the order went only to combs labeled \"rubber\" or \"hard rubber.\"\n\nAlthough the Third Circuit remarks with respect to the Hindman case and a jury trial may be \"dictum,\" it is relevant to consider that the Government there had been awarded summary judgment by the district court, which award was affirmed and certiorari denied. Thus, what appellants here would certainly characterize as a \"factual\" dispute was resolved as a matter of law by all the courts which passed on that issue, even though Vulcanized characterized the dispute, one involving the meaning of an order, as a factual one.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nThere is, of course, a series of cases relied on heavily by the majority, the \"leading\" one of which we are told is Hepner v. United States, 213 U.S. 103, 53 L. Ed. 720, 29 S. Ct. 474 (1909). These cases generally hold jury trials to be available in actions for civil penalties or forfeitures. In my view they are totally inapposite for in none of them was there a prior administrative proceeding culminating in a judicially upheld administrative order, the violation of which was in issue; in all of them the question of violation of a statute was being tried for the first time and ab initio. Here, however, appellants were long ago found by the FTC, in turn upheld by the Sixth Circuit Court of Appeals on review, to have engaged in deceptive advertising; the only question is whether a \"new,\" ever so slightly changed commercial is within the reach of that order, not whether there was deceptive advertising in the first instance. Any intimation that Congress was in the Federal Trade Commission Act \"opting\" for \"the Hepner principle\" strikes me as, however sophisticated, wholly sophistical.\n\nThe most recent discussion by the Supreme Court of the right to trial by jury in civil cases is to be found in Pernell v. Southall Realty, 416 U.S. 363, 94 S. Ct. 1723, 40 L. Ed. 2d 198, 42 U.S.L.W. 4595 (1974). In Pernell, the Court held that an action to recover possession of real property brought in the District of Columbia pursuant to D.C. Code § 16-1501 entailed the right to a jury trial under the seventh amendment. The Court stated that it \"has long assumed that actions to recover land, like actions for damages to a person or property, are actions at law triable to a jury.\" Id. at 4597. The Court then went on to distinguish Block v. Hirsh, 256 U.S. 135, 65 L. Ed. 865, 41 S. Ct. 458 (1921), a case relied upon heavily by the lower court in denying a right to a jury trial, in the following way:\n\nBlock v. Hirsh merely stands for the principle that the Seventh Amendment is generally inapplicable in administrative proceedings, where jury trials would be incompatible with the whole concept of administrative adjudication. See Curtis v. Loether, 415 U.S. at. 194 See also NLRB v. Jones \u0026 Laughlin Steel Corp., 301 U.S. 1, 81 L. Ed. 893, 57 S. Ct. 615 (1937).\n\n42 U.S.L.W. at 4601. The Court pointed out that under the statutory scheme operative in the District of Columbia, no administrative agency was involved either as a fact-finder or as an adjudicator, each dispute coming fresh to the courts, and the Court said \"We may assume that the Seventh Amendment would not be a bar to a congressional effort\" to delegate the resolution of such disputes to an administrative agency without the right to a jury trial being granted. 42 U.S.L.W. at 4601. The majority opinion in this case finds \"further support\" for its holding on the seventh amendment issue in the Pernell decision by stating that § 45 (l) \"provides for just such a 'civil action. '\" Consistent with oversimplification of the application of the Hepner line of cases to this issue, however, the majority ignores the fact that § 45(l) is not an isolated \"civil action\" provision but rather is a provision conceived with and embedded in a complex statutory scheme that is the very foundation of an administrative agency's power.\n\nIn Curtis v. Loether, 415 U.S. 189, 94 S. Ct. 1005, 39 L. Ed. 2d 260, 42 U.S.L.W. 4259 (1974), the Court rejected an argument that a damage action brought under § 812 of the Civil Rights Act of 1968, 42 U.S.C. § 3612, was not to be tried to a jury if the defendant timely requested that it be so tried. The plaintiff in Curtis relied heavily on two cases, NLRB v. Jones \u0026 Laughlin Steel Corp., 301 U.S. 1, 81 L. Ed. 893, 57 S. Ct. 615 (1937), and Katchen v. Landy, 382 U.S. 323, 15 L. Ed. 2d 391, 86 S. Ct. 467 (1966), to support her claim that the seventh amendment was not applicable to her right of action. In Jones \u0026 Laughlin, note 23 supra, the Court had upheld the award of back pay in an NLRB proceeding, rejecting a seventh amendment claim; in Katchen, the Court upheld over a seventh amendment claim the Bankruptcy Act's grant of summary jurisdiction in a trustee's action to compel a claimant to surrender a voidable preference. In commenting in Curtis, Mr. Justice Marshall, writing for a unanimous Court, stated that Jones \u0026 Laughlin\n\nstands for the proposition that the Seventh Amendment is generally inapplicable in administrative proceedings, where jury trials would be incompatible with the whole concept of administrative adjudication and would substantially interfere with the [agency's] role in the statutory scheme.\n\n42 U.S.L.W. at 4261 (emphasis added). Mr. Justice Marshall then commented on both Jones \u0026 Laughlin and Katchen, writing that\n\nThese cases uphold congressional power to entrust enforcement of statutory rights to an administrative process or specialized court of equity free from the strictures of the Seventh Amendment. But when Congress provides for enforcement of statutory rights in an ordinary civil action in the district courts, where there is obviously no functional justification for denying the jury trial right, a jury trial must be available if the action involves rights and remedies of the sort typically enforced in an action at law.\n\nId. (emphasis added) (footnote omitted). The emphasized language above is apparently a reference to one of the three factors listed as critical to determining the \"legal\" nature of an issue by Mr. Justice White in Ross v. Bernhard, 396 U.S. 531, 538 n.10, 24 L. Ed. 2d 729, 90 S. Ct. 733 (1970). If one thing stands out from the discussion above of the legislative history of § 45(l), it is that Congress thought its constituents sufficiently \"gullible\" that to protect them from deceptive advertising, the FTC, as a \"quasi-judicial\" administrative agency, alone would have the expertise and resources to define and adjudicate what is or is not deceptive advertising. If any aspect of the FTC's role in the statutory scheme is made clear by the cases decided since 1938, it is that the FTC, and only the FTC, is in a position to deal with the question of deceptive advertising which \"rests so heavily on inference and pragmatic judgment.\"\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e Indeed, it is the law of this case as previously determined by the Sixth Circuit, Williams I, 381 F.2d at 890, that the FTC is not required to \"take a random sample to determine the meaning and impact of the advertisements.\" On the issue of meaning, what would a jury finding be other than a \"random\" sampling?\n\nThe argument is made that the two \"other\" factors listed in footnote 10 of Ross v. Bernhard, supra, i.e., \"the premerger custom\" and \"the remedy sought,\" are said here \"to point strongly to a jury trial.\" As for the former it is necessary only to reiterate that § 45(l) was and is one part of a complex regulatory scheme that, it so happens, was enacted almost contemporaneously with the merger of law and equity in the federal courts. Thus, the stark fact is that there is no \"pre-merger\" custom or practice to which we can look for guidance. As to the \"remedy sought,\" here it is a civil penalty, recently raised by Congress to a maximum of $10,000 per violation, that serves the purpose of punishing those who would defy the orders of the FTC. The question of the meaning of the commercials is, in conclusion, not a question for trial de novo, whether by court or jury. It is a question which Congress entrusted to an administrative process and where there is a functional justification for denying the jury trial right. As such the seventh amendment does not apply. NLRB v. Jones \u0026 Laughlin Steel Corp., supra. See Curtis v. Loether, supra.\n\nII. CONSIDERATION OF THE ELEVEN COUNTS.\n\nA. The Function of the District Court.\n\nThis opinion would be incomplete if I did not delineate what I believe to be the precise function to be played by the district court in a penalty proceeding under § 45(l). Although it could be argued that the underlying administrative law tests, now incorporated in the Administrative Procedure Act, might be read into § 45(l), we are confronted, as with the jury trial question, with the fact that Congress has never directly addressed this question. It would not be amiss to proceed with the words of Professor Llewellyn in mind:\n\nHere [where Congress did not directly consider a question in passing a statute that has been on the books for many years] the quest is not properly for the sense originally intended by the statute, for the sense sought originally to be put into it, but rather for the sense which can be quarried out of it in the light of the new situation.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\n\nThis \"situation\" is \"new\" only in the sense that no case has ever addressed itself directly to the question what weight is to be accorded the FTC's determination that its cease and desist order has been violated. I view it as nothing more or less than the traditional question of what the scope-of-review is and on what record it is to be based.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\nAs previously noted, see note 8 supra, Judge Motley stated that her consideration was to be based on the plain language of the cease and desist order, the Sixth Circuit's decision enforcing that order, and \"relevant proceedings before the FTC.\" This is eminently sound as a starting point. What, however, are \"relevant proceedings before the FTC\"? On what type of record is a § 45(l) proceeding brought in the district court to proceed?\n\nRelevant proceedings include, of course, the record generated in the administrative process which led to the enforcement of the cease and desist order, as modified, by the Sixth Circuit. The importance of this record cannot be overemphasized, because as I have recounted at some length both the FTC and appellants litigated, albeit in administrative proceedings, the very questions that are now before this court in the form of modified commercials. This record has already been subjected to \"substantial evidence\" review in the Sixth Circuit, whose decision binds any future consideration of the implications of that record and the reach of the cease and desist order.\n\nBut also before the district court (and hence before us on appeal) are the records of the administrative proceedings that were generated subsequent to the Sixth Circuit decision. These proceedings during the \"compliance\" phase consisted of public hearings, findings of the FTC, correspondence, meetings between representatives of the FTC and appellants, and the certification of facts by the FTC to the Attorney General along with transmittal of a draft complaint. It may be said that these proceedings are, on balance, informal, as opposed to the formal hearing procedures called for in § 45(c). As previously discussed relative to the adoption of 15 U.S.C. § 21(l), one feature of § 45(l) is to avoid the expense and delay of further formal proceedings after a cease and desist order has become final. At that point, justice must be swift as well as just. This point is nowhere better expressed than by Mr. Chief Justice Warren, writing for the Court in FTC v. Colgate-Palmolive Co.:\n\nIf respondents [subject to a final cease and desist order] in their subsequent commercials attempt to come as close to the line of misrepresentation as the Commission's order permits, they may without specifically intending to do so cross into the area proscribed by this order. However, it does not seem \"unfair to require that one who deliberately goes perilously close to an area of proscribed conduct shall take the risk that he may cross the line.\"\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nI take this passage to indicate the traditional standard of review for both the district courts and appellate courts in a § 45(l) proceeding: great deference is to be accorded to the FTC at this stage in the proceedings. As Mr. Chief Justice Warren made clear, the due process rights of those subject to cease and desist orders are largely protected by the compliance procedures themselves. 380 U.S. at 394 \u0026 n.22.\n\nThis type of deference has been the subject of very recent Supreme Court consideration in Camp v. Pitts, 411 U.S. 138, 36 L. Ed. 2d 106, 93 S. Ct. 1241 (1973). There a decision of the Comptroller based on informal procedures\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e was thought by the court of appeals to require de novo review by the district court. In reversing, the Supreme Court held that the review was not to be de novo but rather upon the informal administrative record compiled below, and that review on such a record was to be on the \"arbitrary, capricious\" standard of 5 U.S.C. § 706(2) (A) and not on the \"substantial evidence\" test of 5 U.S.C. § 706(2) (E) \"which is appropriate when reviewing findings made on a hearing record. . . .\" Id. at 141-42.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e The Court went on to hold that the district court had the power \"to obtain from the agency, either through affidavits or testimony, such additional explanation of the reasons for the agency decision as may prove necessary.\" Id. at 143.\n\nWhile Camp is not controlling, it serves to point the way.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e If the district court in a § 45(l) proceeding, after reviewing the record before it and hearing argument, deems the record inadequate for any purpose, there is no reason why it could not entertain a motion by either party for remand to the FTC to adduce the necessary facts and to have the FTC pass on those facts.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e Such a procedure is already explicitly available to the court of appeals on initial review, and we do no violence to the statutory scheme by \"quarrying\" out of it this flexible tool. Indeed, the only reason we can perceive for not doing so is that those subject to a cease and desist order might rightly be thought to have the burden ab initio to bring such facts to the attention of the FTC under 16 C.F.R. § 3.61 during the compliance procedure.\n\nIf any doubt remained as to whether the district court below was required or empowered to hold a plenary trial on the questions which appellants assert a right both to a plenary and jury trial, one need only look to the type of evidence appellants seek to have introduced at such a trial to recognize that the attempt is nothing more than one to secure formal hearings which have been denied by Congress. Appellants demand, inter alia, a trial \"in which its [sic] witnesses could be heard and in which it [sic] would have the opportunity to cross-examine Government witnesses taking contrary positions.\" Brief for Appellants at 23. It is difficult to see how such a proceeding would be anything less than equivalent to formal hearings, albeit before a judge presumably possessing no expertise whatsoever. Congress could have provided for formal hearings or plenary trials ad nauseum; it did not do so. See H.R. Rep. No. 1613, 75th Cong., 1st Sess. 6 (1937).\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\n\nB. The Function of the Appellate Court.\n\nTaking the position that the question whether these 11 commercials violated the cease and desist order is a question to be decided without plenary trial to judge or jury, I address briefly the question of what function we perform at the appellate level. As to questions of law decided by the district court, the court of appeals can exercise full powers of review as to the soundness of the conclusions reached. To the extent that any questions decided by the district court implicate the discretion of that court, e.g., the question of amount of penalty assessed, it is our obligation to defer to the decision of the district court unless that discretion has been abused or arbitrarily or capriciously exercised, such deference to be at least as great as in the case of, say, a criminal sentence of a youthful offender where reasons are required to be stated. See United States v. Kaylor, 491 F.2d 1133 (2d Cir. 1974) (en banc).\n\nC. The Order and the Sixth Circuit Decision.\n\nHaving set out the pertinent parts of the cease and desist order below,\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e it may not be amiss to quote at some length the Sixth Circuit's summary of that order, by which, of course, this court is bound:\n\nThe Commission's Order requires that not only must the Geritol advertisements be expressly limited to those persons whose symptoms are due to an existing deficiency [of vitamins or iron] . . ., but also the Geritol advertisements must affirmatively disclose the negative fact that a great majority of persons who experience these symptoms do not experience them because they have a vitamin or iron deficiency; that for the great majority of people experiencing these symptoms, Geritol will be of no benefit. Closely related to this requirement is the further requirement of the Order that the Geritol advertisements refrain from representing that the symptoms are generally reliable indications of iron deficiency.\n\n381 F.2d at 886-87 (footnotes omitted) (emphasis added). The Sixth Circuit's decision explained that its use of the word \"symptoms\" included the symptoms of tiredness, loss of strength, run-down feeling, nervousness or irritability. Id. at 886 n.3.\n\nIt is beyond dispute here that in the 11 commercials before this court, no commercial even purported to make the affirmative disclosure required by the order and the Sixth Circuit's reading of that order.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e At this point, it is obvious that appellants embarked upon a course of action which would, in all probability, bring them \"close[r] to the line,\" see text at note 30 supra, of violating the order than had they decided instead to make the affirmative disclosures required by the order and the Sixth Circuit opinion.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e Of course, such was their right, but they had been duly warned by the FTC of its determination to ensure that, absent affirmative disclosures, the commercials could not even by inference refer to the \"tiredness\" symptom.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e The absence of any such disclosures serves to sharpen focus on the words of the order itself, which forbade representation \"directly or by implication that the preparation is a generally effective remedy for tiredness, loss of strength, run-down feeling . . . .\" The precise question for this court, as it was for the court below, is whether appellants came so close to the line as to warrant deference to the FTC's conclusion that the line was crossed, \"directly or by implication.\"\n\nCounts 1-4 involve commercials denominated as the \"AA\" Commercials. The pertinent portion of the commercial that is the basis for count one is set out in the margin;\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e the Government's argument centers on the inclusion of the phrases \"iron power\" and \"blood-building power.\" Appellants were given notice by the FTC prior to the dissemination of these commercials that it was the opinion of the FTC that these commercials violated the cease and desist order and that they would be in compliance with the order if the reference to \"power\" were deleted. Instead of acceding to this opinion by discontinuing the commercials, or attempting to litigate the issue,\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e appellants assumed the risk that their interpretation of the FTC's cease and desist order would prevail over the interpretation of that order by the very agency that had framed it.\n\nUnless as an appellate court we sit to try de novo, the question before us on counts 1-\u003cspan class=\"fnref\"\u003e442\u003c/span\u003e is not, as the majority would have it, whether the inference drawn by the district court concerning the use of the word \"power\"\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e is either the \"most likely\" or \" one that a jury would be compelled to draw.\" As for the inference being the \"most likely,\" it is clear that such a standard would be in direct conflict with the idea that the FTC functions to protect \"the vast multitude which includes the ignorant, the unthinking and the credulous, who, in making purchases, do not stop to analyze but too often are governed by appearance and general impression.\" Aronberg v. FTC, 132 F.2d 165, 167 (7th Cir. 1942). The standard to be applied in a direct review proceeding is whether such an inference might reasonably be drawn by some members of the general public, not by either all members of the general public or by a majority of the public.\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e Neither judges nor jurors are in a position to second guess the FTC's opinion on this question. Again, the standard that should be applied here is whether the finding by the FTC, that some members of the general public would draw that inference, is arbitrary or capricious.\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e\n\nOn its face, the inference drawn by the district court below is unassailable under this standard. The relationship between the word \"power\" as used in the context of these commercials and the condemned practice of unqualified reference to \"tiredness,\" etc., in the cease and desist order clearly supports the district court's conclusion on these counts.\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e\n\nCounts 5-9 involve commercials that appellants term the \"sad-glad\" commercials. In counts 5-7, the theme is that a woman has been made \"sad\" because she has discovered that she has \"iron-poor blood.\" After taking Geritol, this same woman suddenly becomes glad. Appellants argued below that the \"sad-glad\" theme was essentially a play to \"basic human emotion\" and \"human interest,\" and that there were no inferences to be drawn between \"sadness\" and \"tiredness,\" etc. The district court, emphasizing the visual effect of the commercials, stated that the commercials\n\nmay be easily perceived as a contrast between feeling weak and run-down and feeling lively. The wife, who looks dreary and perhaps run-down in her \"sad\" state at the beginning of the advertisements, looks energetic when she gives a broad smile at the end of the advertisements.\n\nUnited States v. Williams, 354 F. Supp. 521, 539 (S.D.N.Y. 1973) (Williams II). The district court properly points out that\n\nThe common-sense respone of many viewers to the advertisements -- that the wife is not sad only because of the knowledge that she has iron-poor blood, but because of the effects that this condition has had and is having on her.\n\nId.\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e Having introduced into these commercials by implication the very symptoms that were the subject of the cease and desist order, appellants' argument that the commercials are without the order border on the frivolous.\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e\n\nThe commercials which are the subjects of counts 8-9 are of the same \"sad-glad\" motif as those in counts 5-7 and additionally involve the use of the word \"power.\" The district court held, and there can be no doubt, that these commercials clearly violated the order. See Williams II, 354 F. Supp. at 543.\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e\n\nThe commercials involved in counts 10-11 present two distinct questions. The first question is whether FemIron comes within the scope of the order as \"any other preparation . . . possessing substantially similar properties, under whatever name or names sold.\" I would affirm the district court's conclusion as well as its reasoning on this point, Williams II, 354 F. Supp. at 531-32, adding only the comment that the marketing of FemIron, in effect, to evade the reach of the order was a strategy addressed specifically by Representative Chapman during the debate over the Wheeler-Lea Amendments in 1938. See text accompanying note 22 supra.\n\nThus I join with the majority in agreement that the FemIron commercials violated the order. In these commercials, a \"tired mother\" was juxtaposed against the \"vital look\" of a woman who took FemIron, and to this visual counterpoint was added the comment, \"You see, some women even risk becoming anemic and tired.\" I would only add that the \"tired-vigorous\" dichotomy seen so clearly by the majority opinion in the FemIron commercials seems to this lay observer to be the very same sort of effect created by the \"sad-glad\" motif of the commercials in counts 5-9. There is perhaps a difference in the degree of success with which the dichotomy was drawn, but the visual impression in the FemIron commercials need not even have been fortified by the \"tired\" language to bring these commercials within the order, in my view as in the view of the FTC.\n\nThe conclusions I would reach are identical to those reached by the district court which apparently did not give any weight to the FTC's finding that the commercials violated the order. But as I have reiterated above, ignoring, as the majority does, the expertise of the FTC at a stage that can only be labeled as critical in the enforcement process runs counter to the entire regulatory scheme put forth in the Federal Trade Commission Act. Particularly with respect to the word \"power\" as used in counts 1-4, the benefit of the doubt, were there any, would have to go with the FTC in the light of the history of appellants' advertising. This is not because the FTC is the sole judge of the question, which it is not; it is rather because, assuming the good-faith application of agency expertise during the compliance phase of the proceedings, a good-faith application not directly challenged here by appellants, the FTC has worked closely with the advertising of Geritol for over a decade. If its conclusion as to the inference to be drawn from the word \"power\" is entitled to any less respect than others it makes during the course of carrying out its assigned tasks, this can only be because that decision was not made as the consequence of formal hearings, but as has been said, Congress intended this to be the case. That Congress has the \"leeway\" to establish such procedures is beyond dispute. Cf. Weinberger v. Hynson, Westcott \u0026 Dunning, 412 U.S. 609, 622, 37 L. Ed. 2d 207, 93 S. Ct. 2469 (1973). The FTC, as its press release of June 25, 1969, makes clear, was at that time and had been throughout the compliance phase unanimously of the view that the use of the word \"power\" violated the order. The only dissent within the FTC was expressed by Commissioner Elman, joined by Commissioner Nicholson, who criticized his three colleagues for their extraordinary efforts to encourage voluntary compliance rather than instituting court proceedings to force compliance. App. at 104-07. It is nothing other than this unanimous view of the commissioners of the FTC that the majority overturns by suggesting that appellants may be entitled to summary judgment on counts 1-4. This is pure and simple judicial usurpation of the administrative process.\n\nIII. NOTICE.\n\nAppellants make two arguments concerning notice: (1) that penalties under § 45 (l) do not accrue until one subject to an order has been notified by the FTC that he is not in compliance and until a reasonable time has been allotted to bring himself into compliance; (2) that liability on counts 5-11 should be limited because the FTC either failed to respond or delayed response to the submissions of appellants to the FTC in connection with the commercials involved in those counts.\n\nThe first argument is based on the language of Continental Baking Co. v. Dixon, 283 F. Supp. 285, 287-88 (D. Del. 1968) (application for stay of penalties under § 45 (l) denied), where it was said that penalties under § 45 (l) could not accrue until the FTC made a \"finding\" of noncompliance and this finding, indicating the extent of noncompliance, was communicated to the alleged violator. The court there reasoned that any other interpretation would raise \"serious questions of due process.\" Id. at 288. What these \"serious questions\" might be one is left to ponder, but the appellants' argument here is that a warning of noncompliance is required by the \"breadth of the Commission's orders.\" Brief for Appellants at 40.\n\nBut, of course, the Sixth Circuit found that this very order \"is not unduly vague and fairly apprises the Petitioners of what is required of them.\" Williams I, 381 F.2d at 891. This holding is itself dispositive of appellants' constitutional claim; there is no authority standing for the proposition that due process requires or could be thought to require any additional notice. Certainly if civil rights advocates must contest the constitutionality of a temporary injunction enjoining their demonstration through the courts before disobeying it, Walker v. City of Birmingham, 388 U.S. 307, 87 S. Ct. 1824, 18 L. Ed. 2d 1210 (1967), it can hardly be argued here that appellants' right to engage in activity not protected by the constitution, i.e., dissemination of false and misleading advertising, requires greater constitutional protection.\n\nAppellants' argument based on statutory grounds is equally without merit. The legislative history of § 45 (l) reveals that one purpose of that section was to render orders final so that they might \"become operative as to further transgressions. . . .\" H.R. Rep. No. 1613, 75th Cong., 1st Sess. 6 (1937). In floor debate, Representative Lea stated that § 45 (l) provided \"for making the order of the Federal Trade Commission automatically backed up by the court when it becomes final.\" 83 Cong. Rec. 392 (1938) (emphasis added). The statement of record by the FTC on this question, 33 Fed. Reg. 19097 (1968), is clearly consistent with § 45 (l) and the legislative history of that section.\n\nAppellants' other notice claim -- that the FTC failed to respond or delayed response to submissions by appellants to the FTC, thereby somehow exposing appellants to greater penalties than they would conceivably have been subject to had the FTC jumped through their hoop more quickly -- is in my view frivolous. It seeks to place on the agency the burden of leading an advertiser subject to a cease and desist order through the minefield laid by that advertiser's attempts to read the order for as little as it is worth. Taken as an allegation of bad faith on the part of the FTC, it is unsupported and I agree with the majority that we need not comment on what measures a district court might take to remedy such a situation, as where a delay of four years occurred. See generally United States v. American Greetings Corp., 168 F. Supp. 45 (N.D. Ohio 1958), aff'd on opinion below, 272 F.2d 945 (6th Cir. 1959).\n\nFinally, it puts the appellants' notice argument in its true light to recollect as the majority does -- I need not repeat here -- the facts of the administrative proceedings following the Sixth Circuit's denial of the petition to review the cease and desist order which had become final on December 31, 1967. See Part 1A supra. My only regret is that these proceedings were treated by the majority only in connection with the notice contentions.\n\nIV. PENALTIES.\n\nThe majority and I agree that § 45 (l) as written allows for the imposition of a $5,000 (now $10,000) penalty \"for each violation\" with each violation being a \"separate offense.\" Appellants argue that the \"day of continuance\" language should be read to limit penalties imposable on any given day to $5,000 regardless of how many times or in how many places a commercial is run during that day. The appellants point out that under this holding, one subject to a mandatory order of the Commission would be liable to a penalty of only $5,000 per day for disobedience, whereas one, like appellant, who violates an order in 30 different places on the same day might be subject to $150,000 in penalties. I am in complete agreement with the majority on this point when it states that \"Congress relied on the good sense of the FTC in making its certification to the Attorney General and, failing that, on the discretion of the court to prevent . . . an outrageous result.\"\n\nThis conclusion flows directly from the import of the statutory scheme and particularly 15 U.S.C. § 56, discussed supra. It is also relevant to our disposition of appellants' claims that (1) the Government is limited by the \"certification\" of the FTC in this case to collecting a maximum of $500,000 in penalties and (2) that the penalties are not assessable against both appellants becuase they essentially constitute the same entity for purposes of § 45 (l).\n\nAs for the first question, based on the interpretation of 15 U.S.C. § 56 supra, there is no answer to the proposition that the Government is bound by the FTC's certification of a $500,000 penalty, and no more, if that figure was so certified. My reading of St. Regis Paper Co., supra, almost requires such a result and is supported by Holloway v. Bristol-Myers Corp., supra. The dispute, then, centers on whether such a figure was in fact certified. The certification letter itself, App. at 296-301, indicated no figures for penalties except by reference to a draft complaint submitted by the FTC to the Attorney General, but that clearly limited the certification to \"Judgment against defendants in the total sum of $500,000.\" App. at 324. I do not think we have to accept the reasoning of the district court that the draft complaint \"was intended [merely] to facilitate the Attorney General's task.\" Williams II, 354 F. Supp. at 546. I thus can agree that FTC expertise and discretion were lodged in this decision to seek penalties limited to $500,000, and that this decision should be given force here, that is, that the total sum assessable against both appellants is $500,000.\u003cspan class=\"fnref\"\u003e50\u003c/span\u003e\n\nBecause the district court's order was against J. B. Williams for $456,000 and Parkson for $356,000, I would affirm so much of it as pertains to J. B. Williams. The question then would be whether Parkson is liable for the remaining $44,000. These two corporations have, since 1962, represented themselves as separate entities before the FTC and before the Sixth Circuit. The majority would pierce the corporate veil to provide Parkson with immunity. I would not. The reason for not doing so is not merely because J. B. Williams was seeking to avoid the 15 per cent advertising agency fee (taken in the form of a discount by the media to the agency from the price paid by the sponsor). Rather it seems to me that it was well within the exercise of FTC discretion on the basis of the course of appellants' conduct to charge Parkson with responsibility. Its role as a captive, wholly-owned agency was to work out the violative advertising. The \"pitch\" worked out would -- like that of the patent medicine salesman of years gone by -- imply a lot and say little and thereby convey a meaning deceptively appealing while hopefully leaving law enforcement holding the bag by little changes in the pitch at the last moment. While the ethics of the independent advertising agencies of Madison Avenue may not necessarily rival those of Calpurnia, particularly when it comes to keeping a big customer's account, one would suppose that their fear, were they in Parkson's situation, of personal (or corporate) liability would result in counsel to the client of moderation or restraint in dealing with the Commission's order. Here there was none since the \"agency\" is not just captive but slave. In Schenley Distillers Corp. v. United States, 326 U.S. 432, 437, 90 L. Ed. 181, 66 S. Ct. 247 (1946), the Supreme Court said:\n\nWhile corporate entities may be disregarded where they are made the implement for avoiding a clear legislative purpose, they will not be disregarded where those in control have deliberately adopted the corporate form in order to secure its advantages and where no violence to the legislative purpose is done by treating the corporate entity as a separate legal person. One who has created a corporate arrangement, chosen as a means of carrying out his business purposes, does not have the choice of disregarding the corporate entity in order to avoid the obligations which the statute lays upon it for the protection of the public.\n\nParkson was subject to the cease and desist order. It violated the order. It should not escape responsibility -- in my view to the extent of only $44,000 -- for that violation. Nor is it an answer to say that J. B. Williams might not have employed any agency; we are not here to deal in hypothetical exercises.\n\nV. THE EVIDENTIARY HEARING.\n\nThe question of the right of appellants to an evidentiary hearing on subjects such as their alleged \"good faith belief\" that the commercials did not violate the order is open in my view as to all counts. The question may be addressed in two ways: first, whether there is any right to such a hearing as a matter of law; second, if so, what is the appropriate forum for such a hearing?\n\nThe FTC's decision to seek penalties against appellants constituted a decision by it that appellants had not exercised good faith in its attempts to comply with the cease and desist order. In its statement released on June 25, 1969, a majority of the commissioners stated their belief that \"the end result of these compliance negotiations will be the cessation of deceptive advertising for Geritol. . . .\" App. at 102. The only inference to be drawn from the institution of this action under § 45 (l) is that the three-member majority of the FTC that ascribed to the statement above on June 25, 1969, over the vehement objection of Commissioner Elman, joined by Commissioner Nicholson, no longer saw appellants' efforts as exhibiting \"good faith\" on November 28, 1969, when the certification of facts to the Attorney General took place. Indeed, a review of the relevant documents in this case, including but not limited to that statement, the findings and opinion issued by the FTC on December 2, 1968, and the letter of certification itself, leave no doubt that the FTC exercised a patience toward appellants that in the history of administrative law must be rather remarkable.\n\nAgreeing with the majority's statement that the district court's function with respect to penalties is limited to the prevention of an \"outrageous result,\" there is not one scintilla of support in the evidence proffered by the appellants to be taken in a hearing that could possibly affect the outcome here. But even were this not so, the holding that the FTC exercised discretion in arriving at the $500,000 figure indicates that it is the FTC that is to pass in the first instance on the question upon which appellants now seek an evidentiary hearing in the district court. Who, better than the FTC, is in a position to determine the extent to which appellants exercise \"good faith\"? In a proper case, and this is not one, the district court has the power to order further evidence to be adduced before the FTC, and to review the FTC's conclusion under the \"arbitrary or capricious\" standard. As Judge Leventhal said in Holloway v. Bristol-Myers Corp., supra, there are\n\nfrequent references in the legislative history [of the Wheeler-Lea Amendments] to the Trade Commission's expertise in dealing with commercial practices, its abilities to act as a buffer in securing voluntary compliance through informal proceedings, and its sound discretion in determining when formal enforcement measures were necessary.\n\n485 F.2d at 995 (footnote omitted) (emphasis added). \u003cspan class=\"fnref\"\u003e51\u003c/span\u003e\n\nI would affirm as to J. B. Williams Co., Inc. I would modify, and as modified, affirm the judgment against Parkson Advertising Agency, Inc.\n\n\u003cspan class=\"fn\"\u003e1. Throughout this litigation, § 5 (l) read: (l) Any person, partnership, or corporation who violates an order of the Commission to cease and desist after it has become final, and while such order is in effect, shall forfeit and pay to the United States a civil penalty of not more than $5,000 for each violation, which shall accrue to the United States and may be recovered in a civil action brought by the United States. Each separate violation of such an order shall be a separate offense, except that in the case of a violation through continuing failure or neglect to obey a final order of the Commission each day of continuance of such failure or neglect shall be deemed a separate offense. Late last year § 5 (l) was amended, although the basic structure of the penalty provision remained unchanged. Introduced by Senator Jackson as a rider to the Trans-Alaska Pipeline Authorization Act, 87 Stat. 576 (Nov. 16, 1973), the amendment extended the penalty clause to all Commission orders rather than merely cease and desist orders, increased the maximum penalty per violation to $10,000, and empowered the district courts to grant injunctive relief in the enforcement of Commission orders.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. \"(d) which represents directly or by implication that the use of such preparation will be beneficial in the treatment or relief of tiredness, loss of strength, run-down feeling, nervousness or irritability, unless such advertisement expressly limits the claim of effectiveness of the preparation to those persons whose symptoms are due to an existing deficiency of one or more of the vitamins contained in the preparation, or to an existing deficiency of iron or to iron deficiency anemia, and further, unless the advertisement also discloses clearly and conspicuously that: (1) in the great majority of persons who experience such symptoms, these symptoms are not caused by a deficiency of one or more of the vitamins contained in the preparation or by iron deficiency or iron deficiency anemia; and (2) for such persons the preparation will be of no benefit;\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The Chief of the Compliance Division stated he was instructed to advise that Commissioner Elman dissented \"from the foregoing action.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The letter was received on June 9.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. On June 25 the Commission issued a formal statement, from which Commissioners Elman and Nicholson dissented. The former had filed an opinion arguing that the Commission should have requested the Attorney General to file an action for civil penalties.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Whatever doubts lower courts may have had about the quasi-criminal nature of the early penalty clauses in various railroad regulation statutes, see part III, infra, were resolved in Hepner v. United States, supra, and Chicago, Burlington \u0026 Quincy Ry. v. United States, 220 U.S. 559, 578, 55 L. Ed. 582, 31 S. Ct. 612 (1911).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. It is not altogether clear whether Judge Motley decided this issue. At one point she said, 354 F. Supp. at 529, that \"precedents in both the Supreme Court and the Court of Appeals for this circuit convince the court that the instant action is so analogous to a civil contempt proceeding that no jury trial can or should be required here.\" But later, 354 F. Supp. at 533 n. 6, after referring back to this passage, she stated, \"In any case, the court need not reach this question, since the court holds infra that no dispute of material fact remains to be resolved.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Professor Jaffe suggests that the court of appeals thus misunderstood what the district court had done in Hindman. He states, Judicial Control of Administrative Action 319 n.237 (1965): The jury was to decide whether in the opinion of purchasers the questioned phrase meant the same thing as the proscribed one. Who better than a lay customer to decide?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The cases since the adoption of the Federal Rules generally do not discuss whether the right accrues under the provision of F.R. Civ. P. 38(a) relating to the Seventh Amendment or the provision relating to a statute. This is natural in light of the settled principle that \"although a federal statute may not in express terms provide for a jury trial, it may create a cause of action, essentially legal, with an attendant right of trial by jury.\" See 5 Moore, Federal Practice para. 38.12, at 128.25 \u0026 n. 10 (1971). In that event the courts imply an intention to allow jury trial, see Damsky v. Zavatt, 289 F.2d 46, 52 (2 Cir. 1961).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Several of these cases were cited by this court in Damsky v. Zavatt, supra, 289 F.2d at 51, in support of the proposition that \"The right to jury trial exists in actions by the United States where it would in a similar action between private parties.\" There is some contrary district court authority under the Emergency Price Control Act of 1942, Creedon v. Arielly, 8 F.R.D. 265, 268 (W.D.N.Y. 1948), and the Housing and Rent Act of 1947, United States v. Shaughnessy, 86 F. Supp. 175 (D. Mass. 1949); United States v. Friedman, 89 F. Supp. 957, 961 (S.D. Iowa 1950). However, these cases and the reasoning behind them have been sharply criticized, see 5 Moore, Federal Practice paras. 38.11 [7], at 128.2, 38.37 [1], at 307-08 \u0026 nn. 11, 13: Tanimura v. United States, 195 F.2d 329 (9 Cir. 1952); Leimer v. Woods, 196 F.2d 828 (8 Cir. 1952); United States v. Hart, 86 F. Supp. 787 (E.D. Va. 1949); United States v. Strymish, 86 F. Supp. 999 (D. Mass. 1949); United States v. Mesna, 11 F.R.D. 86 (D. Minn. 1950); cf. Porter v. Warner Holding Co., 328 U.S. 395, 401-02, 90 L. Ed. 1332, 66 S. Ct. 1086 (1946).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Still further support for our position is found in the Supreme Court's decision in Pernell v. Southall Realty, 416 U.S. 363, 383, 94 S. Ct. 1723, 40 L. Ed. 2d 198 (1974), 42 U.S.L.W. 4595, 4601. The Court noted that while Congress could have chosen to entrust landlord-tenant disputes \"to an administrative agency,\" it instead provided that those disputes should be brought \"as ordinary civil actions\"; accordingly, the Court held, the Seventh Amendment required that a jury trial be available on demand. Section 5 (l) of the FTC Act provides for just such a \"civil action.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. We put it this way rather than \"order of a court\", see 15 U.S.C. § 45(c) [\"To the extent that the order of the Commission is affirmed, the court shall thereupon issue its own order commanding obedience to the terms of such order of the Commission\"], because § 5 (l) applies equally when a FTC order becomes effective through failure of the aggrieved party to seek review.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Very likely this would also be true in a proceeding for criminal contempt unless the Government sought imprisonment of more than six months. See Cheff v. Schnackenberg, 384 U.S. 373, 16 L. Ed. 2d 629, 86 S. Ct. 1523 (1966).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. We cannot forbear an expression of wry amusement at the Government's statement \"that Congress did not require the Government to bring a proceeding before the already overburdened Sixth Circuit Court of Appeals.\" We are at a loss to understand how judicial loads were in any way lessened by the Government's bringing a proceeding which must have required a great many hours of study by a busy district judge and has demanded many more by a court of appeals quite as \"overburdened\" as the Sixth Circuit, which already was familiar with the case and could have proceeded without being obliged to consider most of the difficult questions here presented.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. The Government attempts to distinguish Hepner v. United States, supra, on the ground that it involved a fixed penalty, while § 5 (l) permits the district judge to determine the proper penalty up to a statutory maximum. The legislative background, however, demonstrates that Congress replaced the proposed fixed penalty with a variable one in order to give the penalty provision more flexibility, not to avoid the requirement of a jury trial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. The district judge seemed to recognize that factual questions such as these would call for a jury. She cited two § 5 (l) cases from the District of Maryland in which juries had been empanelled, United States v. Americana Corp., Civ. No. 10858 (D. Md. 1960); United States v. Fire Safety Devices, Civ. No. 13254 (D. Md. 1962). She distinguished those cases, on the ground that \"they involved the factual question of what oral representations were made by employees of the companies being sued. . . . Here, in contrast, the actual advertisements sued upon are before the court and their dissemination is undisputed.\" 354 F. Supp. at 533 n. 7. However, when there is a right to a jury trial, it extends to all kinds of questions of fact, not simply to some.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. We fail to see what support for the dissent can be found in either Holloway v. Bristol-Meyers Corp., 158 U.S. App. D.C. 207, 485 F.2d 986 (D.C. Cir. 1973), or Farmington Dowel Prods. Co. v. Forster Mfg. Co., 421 F.2d 61 (1 Cir. 1970). In Holloway, the court refused to imply a private right of action to enforce the unfair or deceptive practices sections of the FTC Act. There is virtually no discussion of § 5 (l), and nothing in the court's opinion suggests that the Act should be read to bar a jury trial in a civil penalty suit. The dissent refers to a passage in which Judge Leventhal notes that the \"substantive prohibitions of the statute are inextricably intertwined with provisions defining the power and duties of [the FTC, which is] charged with its enforcement,\" 485 F.2d at 989, but we see nothing in that excerpt either alone or in context to suggest that the FTC's conclusion that a defendant has violated a final cease and desist order should be given controlling weight in a § 5 (l) proceeding. Similarly, the excerpt quoted from the Farmington Dowel case, 421 F.2d at 75, simply recites the settled principle that a defendant in a civil penalty suit cannot collaterally attack the validity of the underlying cease and desist order - a principle which we unqualifiedly accept despite the many contrary intimations in the dissent.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. See also Marine Mammal Protection Act, 16 U.S.C. § 1375(a); Occupational Safety and Health Act, 29 U.S.C. § 666(i); Natural Gas Pipeline Safety Act, 49 U.S.C. § 1678.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Since we hold that several of the counts presented triable issues of fact, we would be bound to reverse the award of summary judgment even if jury trial were not required, see 6 Moore, Federal Practice, para. 56.02[7], at 2040 (1972). The difference would simply be that the trial would be to a judge. There is no question that under F.R. Civ. P. 56, whether in a jury trial or a trial to the court, the party opposing the summary judgment motion has a right to a full evidentiary hearing on all genuine issues of material fact. In a bench trial, this means that if the party opposing summary judgment raises any triable fact questions, he has the right to adduce the expert testimony of live witnesses and cross-examine his opponent's witnesses rather than to have to rely on the affidavits submitted in opposition to the summary judgment motion. Colby v. Klune, 178 F.2d 872, 873-74 (2 Cir. 1949); Hycon Manufacturing Co. v. H. Koch \u0026 Sons, 219 F.2d 353, 355 (9 Cir.), cert. denied, 349 U.S. 953, 99 L. Ed. 1278, 75 S. Ct. 881 (1955); Hanley v. Chrysler Motors Corp., 433 F.2d 708, 711 (10 Cir. 1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. The traditional formulation may well have been founded on the illiteracy of juries and, later, on their inability to understand the complex vocabulary characteristic of many written instruments. See S. Weiner, The Civil Jury Trial and the Law -- Fact Distinction, 54 Calif. L. Rev. 1867, 1932 (1966). Such considerations obviously have no application to the viewing of television commercials.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Representative scripts will be found in the opinion of the district court, 354 F. Supp. at 536-43.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. We see no basis for the district court's conclusion, 354 F. Supp. at 537: While the advertisement only speaks of the transformation of a person's blood cells, the advertisement strongly implies that the same transformation from paleness, weakness and deformity to red-bloodedness, strength and shapeliness will take place in the person himself.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. The Government makes much of the fact that the FTC had conveyed its objections to use of the word \"power\" and that defendants had agreed to delete them. But the agreement was expressly without concession and the FTC's assertion that use of this word was a violation did not make it so. Whether Williams' continued use of the word for a few weeks was deliberate or negligent, it is entitled to have the fact of violation determined by a neutral tribunal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. As indicated above, the commercials in Counts 8 and 9 include the phrases \"blood-building power\" and \"iron power.\" Our discussion of these slogans in reference to Counts 1-4 is equally applicable to the later counts.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. A far more extreme case is United States v. American Greetings Corp., 168 F. Supp. 45, 50 (N.D. Ohio 1958), aff'd on opinion below, 272 F.2d 945 (6 Cir. 1959). There the Commission remained silent for four years after the defendant filed his compliance report before suing for statutory penalties relating to conduct described in the report. Although the court did not hold that the Commission was estopped to assert that the defendant's practice was a violation of the Commission's cease and desist order, it stated that the Commission's actions were \"certainly a circumstance to be considered in ascertaining the amount of the penalty to be imposed for violation of the Order.\" The court assessed only a nominal penalty for that violation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. The recent amendments to the enforcement provisions of the FTC Act have gone even further in placing responsibility for enforcement in the Commission's hands. Section 16 of the Act, 15 U.S.C. § 56, has been amended to provide: Whenever the Federal Trade Commission has reason to believe that any person, partnership, or corporation is liable to a penalty under section 14 or under subsection (l) of section 5 of this Act, it shall -- (a) certify the facts to the Attorney General, whose duty it shall be to cause appropriate proceedings to be brought for the enforcement of the provisions of such section or subsection; or (b) after compliance with the requirements of section 5(m), itself cause such appropriate proceedings to be brought. Section 5(m), another new addition, provides that the Commission can appear through its own attorneys in circumstances where the statute requires it to be represented by the Attorney General, if it notifies the Attorney General of its proposed action and gives him 10 days to take the action instead.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Appellants claim that the judgment entered below was \"enormous by current standards.\" While most reported judgments under § 5 (l) have been much smaller, see 3 CCH Trade Regulation Rptr. para. 9701.40, assessments in excess of $50,000 are not unknown.See, e.g., United States v. Americana Corp., 3 CCH Trade Regulation Rptr. para. 9701.40, at 17,483-3 (D. Md. 1965) ($100,000); United States v. Bostic, 336 F. Supp. 1312, 1321 (D.S.C.), aff'd on opinion below, 473 F.2d 1388 (4 Cir. 1972), cert. denied, 411 U.S. 966, 93 S. Ct. 2146, 36 L. Ed. 2d 686 (1973) ($80,000); United States v. Ancorp National Services, Inc., 367 F. Supp. 1221, 1973-2 CCH Trade Cases P74,822 (S.D.N.Y. 1973) ($204,200).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. There is no need to dispute that assessment of penalties is for the judge rather than the jury.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Not content with this, the judge added that these violations \"were only slightly less egregious than if defendants had disseminated the very advertisements relied upon by the FTC when it originally issued the order.\" 354 F. Supp. at 552. In light of our belief that the AA advertisements in Counts 1-4 would have been submittable to a jury barely, if at all, and that the commercials in Counts 8-9 raised a disputable issue of fact, we consider this, as well as the characterization quoted in the text to be clearly erroneous.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. Prior to its recent amendment, this section read as follows: Any person, partnership, or corporation who violates an order of the Commission to cease and desist after it has become final, and while such order is in effect, shall forfeit and pay to the United States a civil penalty of not more than $5,000 for each violation, which shall accrue to the United States and may be recovered in a civil action brought by the United States. Each separate violation of such an order shall be a separate offense, except that in the case of a violation through continuing failure or neglect to obey a final order of the Commission each day of continuance of such failure or neglect shall be deemed a separate offense. This section was recently amended, Act of Nov. 16, 1973, Pub. L. No. 93-153, § 408, 87 Stat. 591-92, for the purpose of ensuring the \"prompt enforcement of the laws the Commission administers.\" Id. at § 408(b), 87 Stat. 591. Although there is no legislative history on this particular amendatory Act, Congress was clearly expressing its dissatisfaction with both the speed and force by which FTC orders were being enforced. There is some indication that Congress viewed § 45 (l) proceedings as essentially equitable by importing into those proceedings the power to issue mandatory injunctive relief \"and further equitable relief,\" this power to be exercised by the district courts. Of course, such relief could previously be granted by the court of appeals granting enforcement of the cease and desist order, in this case the Sixth Circuit, so we must assume that Congress had some reason to lodge this same power in the district courts in § 45 (l) proceedings. One possible view is that Congress viewed the record in a § 45 (l) proceeding to be more amenable to review by a district court because of the nature of the informal proceedings that constitute a critical portion of that record. See part IIA infra. Regardless of what view is taken, it seems highly doubtful that Congress would have incorporated what are clearly equitable remedies into a § 45 (l) proceeding to increase the district court's power to deal with offenders if Congress had realized that § 45 (l) carried with it the right to a jury trial. Indeed, the inclusion of injunctive power in § 45 (l) as amended lends support to the Government's argument that civil penalties and injunctive relief are in fact alternate remedies.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The absence of direct evidence as to congressional intent leads to the conclusion that intent must be ascertained by examining the purposes and objectives of the FTCA [Federal Trade Commission Act] as a whole in terms of objective criteria, i.e., the relevant inquiry is \"how, one supposes, it [the legislative scheme] * * * would appear to a 'reasonable' interpreter.\" United States v. St. Regis Paper Co., 355 F.2d 688, 693 (2d Cir. 1966), quoting Bishin, The Law Finders: An Essay in Statutory Interpretation, 38 S. Cal. L. Rev. 1, 3 (1965). See also note 28 and accompanying text infra ; Holbrook v. United States, 284 F.2d 747, 752 (9th Cir. 1960) (\"a significant consideration . . . is a comparison between the results to which each such consideration would lead\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. United States v. Hindman, 179 F. Supp. 926 (D.N.J. 1960), criticized in United States v. Vulcanized Rubber \u0026 Plastics Co., 288 F.2d 257, 258-59 n.2 (3d Cir.), cert. denied, 368 U.S. 821, 7 L. Ed. 2d 26, 82 S. Ct. 38 (1961).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Reduced to its simplest terms, the point is that if a court or jury of 12 is given the power to decide de novo the question whether a given advertisement is deceptive, i.e., the \"meaning of the commercials,\" Brief for Appellants at 29, then the FTC, at least insofar as deceptive advertising is concerned, would be stripped of the major function presently performed by it in the regulatory scheme -- deciding what is and what is not deceptive advertising. See note 13 infra. Other considerations urged upon us by the Government, such as the need for streamlined procedures commented on by this court in United States v. St. Regis Paper Co., 355 F.2d at 693, are also important, but the nub of the problem remains whether the FTC on the one hand, or a judge or jury on the other, is to pass on whether specific advertisements are deceptive under the Federal Trade Commission Act.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Weinberger v. Hynson, Westcott \u0026 Dunning, 412 U.S. 609, 631-32, 37 L. Ed. 2d 207, 93 S. Ct. 2469 (1973), quoting Clark v. Uebersee Finanz-Korp., 332 U.S. 480, 488, 68 S. Ct. 174, 92 L. Ed. 88 (1947).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. This has generally been held to bind the court of appeals to the \"substantial evidence\" rule. Charles Pfizer \u0026 Co. v. FTC, 401 F.2d 574 (6th Cir.), cert. denied, 394 U.S. 920, 89 S. Ct. 1195, 22 L. Ed. 2d 453 (1968); Montgomery Ward \u0026 Co. v. FTC, 379 F.2d 666 (7th Cir. 1967).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. \"The Commission may modify its findings as to the facts, or make new findings, by reason of the additional evidence so taken. . . .\" 15 U.S.C. § 45(c).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Part III of the majority opinion purports to decide the question whether the 11 commercials which are the subjects of this action violated the cease and desist order without so much as a passing reference to the Sixth Circuit decision that gave that order the imprimatur of the judiciary. Regardless whether Judge Motley correctly defined the court's function, she cannot be faulted for her statement that \"correct interpretation of the order requires the court to consider not only its plain language, but relevant proceedings before the FTC and the Sixth Circuit's decision as well.\" United States v. J. B. Williams Co., 354 F. Supp. 521, 532 (S.D.N.Y. 1973) (Williams II).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Those specific advertisements are not the subject of this action, but the Findings and Opinion of the FTC concerning them is most relevant, since the present controversy may not properly be considered in an administrative vacuum. See part II infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. While the FTC questioned its own hesitation on this question at a later date, the legislative history of § 45 (l) indicates that Congress desired disputes between the FTC and advertisers to be worked out without resort to court action where possible. If the outcome of this case is to require the FTC, after 11 years of proceedings, to go before a judge or jury and prove to either, de novo, that certain commercials are false and deceptive, something that it has spent more than a decade and enormous public resources to do, it may well be that the FTC in the future will be forced to resort to the courts more quickly and as frequently as possible. There would appear to be no other way to deal with those advertisers who, as appellants here, can at best be described as intransigent. One cannot help but suppose that the burdens on the federal courts, see H. Friendly, Federal Jurisdiction: A General View Part II (1973), will be further exacerbated with the multiple review Judge Friendly's opinion would propose. Cf. Weinberger v. Bentex Pharmaceuticals, Inc., 412 U.S. 645, 653, 37 L. Ed. 2d 235, 93 S. Ct. 2488 (1973): \"The deluge of litigation that would follow if 'me-too' drugs and OTC drugs had to receive de novo hearings in the courts would inure to the interests of manufacturers and merchants in drugs, but not to the interests of the public that Congress was anxious to protect . . . .\" See also the remarks of Rep. Chapman quoted in the text at note 21, infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. There is substantial evidence to support the finding of the Commission that most tired people are not so because of iron deficiency anemia, and the failure to disclose this fact is false and misleading because the advertisement creates the impression that the tired feeling is caused by something which Geritol can cure. Williams I, 381 F.2d at 889.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. At least one court has held that the FTC's rejection of a compliance report is subject to review in a declaratory judgment action, but only at the risk of the petitioner, who cannot use that review to stay or otherwise jeopardize the public's interest in securing possible penalties. Floersheim v. Weinburger, 346 F. Supp. 950 (D.D.C. 1972). 14 As the majority opinion at footnote 16 suggests, Jude Motley's opinion below seems to acknowledge that certain factual questions arising out of the compliance phase of the proceedings might, in some instances, require a jury trial. Such a factual question might be on what date, or on how many occasions, a commercial was transmitted to the general public in violation of an order. Even if these issues -- which in no way resemble the issue of the meaning of the commercials -- were \"the very sort which juries are traditionally called on to resolve,\" Judge Friendly's opinion at 25, it would not mean that Congress did not delegate to the FTC the responsibility for determining such \"facts,\" subject only to review for lack of substantial supporting evidence. 5 U.S.C. § 706(2) (E). While due process might mandate that such facts not be determined on a completely ex parte basis, the compliance phase of the proceedings were not so conducted. As discussed in the body of this dissent at note 7 supra, there is no reason why a district court in a § 45 (l) proceeding could not grant a motion to adduce additional relevant evidence before the FTC, should a party in appellants' position assert such a due process deprivation. Cf. CIBA Corp. v. Weinberger, 412 U.S. 640, 644, 37 L. Ed. 2d 230, 93 S. Ct. 2495 (1973) (\"Cases may arise where there has been no formal administrative determination of the 'New drug ' issue, it being first tendered to a district court. Even then, however, the District Court might well stay its hand, awaiting an appropriate administrative determination of the threshold question\"). This question is not before us because appellants make no such claim. 15 See generally Holloway v. Bristol-Myers Corp., 158 U.S. App. D.C. 207, 485 F.2d 986 (D.C. Cir. 1973); United States v. St. Regis Paper Co., supra. 16 See also Niresk Indus. Inc. v. FTC, 278 F.2d 337, 341-42 (7th Cir.), cert. denied, 364 U.S. 883, 81 S. Ct. 173, 5 L. Ed. 2d 104 (1960); Carter Prods., Inc. v. FTC, 268 F.2d 461, 495 (9th Cir.), cert. denied, 361 U.S. 884, 80 S. Ct. 155, 4 L. Ed. 2d 120 (1959). See also the enormous amount of regulation of deceptive advertising by opinions, \"guides\" and rules in dozens of industries. 16 C.F.R. § 15.1-15.427; 16 C.F.R. Parts 17-253. 17 Their opinion makes passing reference to the \"weight\" to be accorded FTC findings of violations in framing remedial orders, but makes no attempt to explain why this expertise is irrelevant in a § 45 (l) proceeding. 18 The majority says that \"While Congress placed the usual substantial evidence rule in § 5(c) [15 U.S.C. § 45(c)] of the FTC Act, dealing with judicial review of orders, it made no similar provision in § 5 (l) [15 U.S.C. § 45 (l)].\" But review may be had under the Administrative Procedure Act. 5 U.S.C. §§ 701, 706. See Weinberger v. Bentex Pharmaceuticals, Inc., 412 U.S. at 653-54. 19 H.R. Rep. No. 1613, 75th Cong., 1st Sess. 5 (1937) (emphasis added): The Federal Trade Commission as an independent, quasi-judicial body, has a procedure better calculated to handle multitudinous types of advertising and to do its work to the greater confidence and satisfaction of the public than any purely administrative body. Its work carries with it the combined elements of searching investigation, orderly procedure, prevention rather than penalization in minor cases, and that judicial fairness essential to the enlistment of confidence by the public. 20 A similar \"streamlining\" occurred when Congress adopted the language of § 45(l) into 15 U.S.C. § 21(l), which now governs the enforcement of the Clayton Act. See infra. 21 This statement is clearly applicable to the court's disposition of the FemIron \"properties\" question. 22 I know of nothing to support the majority's assertion that jurors \"have more experience than most judges\" when it comes to deciding whether a commercial is \"deceptive.\" In the final analysis I suspect, and I believe Congress insists, that the FTC has the greater expertise and wherewithal to decide that question than \"the American gullible public,\" subject always to review for arbitrary, capricious or unlawful exercise of that function. 5 U.S.C. § 706(2) (A). 23 As will be discussed, the logic of the majority's position would probably compel reexamination of the Supreme Court's decision in NLRB v. Jones \u0026 Laughlin Steel Corp., 301 U.S. 1, 48, 81 L. Ed. 893, 57 S. Ct. 615 (1937) (jury trial right denied in back pay case), which was recently reaffirmed in Curtis v. Loether, 415 U.S. 189, 94 S. Ct. 1005, 39 L. Ed. 2d 260, 42 U.S.L.W. 4259, 4261 (1974). In Jones \u0026 Laughlin, the Court said: \"The instant case is not a suit at common law or in the nature of such a suit. The proceeding is one unknown to the common law. It is a statutory proceeding. Reinstatement of the employee and payment for time lost are requirements imposed for violation of the statute and are remedies appropriate to its enforcement. The contention under the Seventh Amendment is without merit.\" 301 U.S. at 48-49. 24 Assuming, arguendo, that the reference was in fact to 15 U.S.C. § 78ff(b), and assuming, arguendo, that a violator of that section would be entitled to a jury trial -- a question that so far as I know has never been litigated -- it is readily apparent that the question to be decided by the jury, i.e., whether certain documents required to be filed by 15 U.S.C. § 78o(d) had in fact been filed, does not involve any prior SEC findings made as the result of formal or informal hearings. 25 If a modified commercial is within the order, the issue of its \"deceptiveness\" or \"meaning\" has already been litigated before the FTC even though that precise commercial was never actually before the FTC prior to the compliance phase of the proceedings. Whether it is within the order is a question in the first instance for the exercise of agency discretion, subject only to review for abuse or if exercised arbitrarily, capriciously or contrary to law. 5 U.S.C. §§ 701, 706. Cf. CIBA Corp. v. Weinberger, 412 U.S. 640, 37 L. Ed. 2d 230, 93 S. Ct. 2495 (1973). See also note 10 supra and the text at note 21 supra. 25a Brief for Petitioner at 12. 26 Professor Jaffe, who is right in so many things but like the rest of us not in all, agrees with Hindman, asking \"Who better than a lay customer to decide?\" L. Jaffe, Judicial Control of Administrative Action 319 n.237 (1965). But like the Hindman court and my colleagues here, the good professor fails to give any weight to -- indeed, he does not mention -- whatever administrative proceedings, formal or informal, led up to the FTC's certification of facts to the Attorney General or the certification itself. This is what the court in Vulcanized saw, and with it I agree. 27 FTC v. Colgate-Palmolive Co., 380 U.S. 374, 385, 13 L. Ed. 2d 904, 85 S. Ct. 1035 (1965). The majority's statement that jury inadequacy is not a factor \"when the jury is asked to determine only whether a television commercial has made various forbidden representations\" is surprising. In Crane Co. v. American Standard, Inc., 490 F.2d 332 (2d Cir. 1973), in considering whether Standard should be accorded a jury trial on the amount of damages recoverable in an \"intricate\" securities case, Judge Friendly's opinion for the court stated that \"It would be hard to think of tasks less appropriate for performance by a jury. . . .\" 490 F.2d at 344. One such \"less appropriate\" task for a jury would be to decide a question that has, for all practical purposes, taken 11 years of hearings, meetings, litigation, a full-fledged judicial review, discussion and correspondence, and more hearings, plus the unquestioned application of agency expertise, all at great expense to the public treasury, to decide. It is most difficult to see appellants' claim for a plenary or jury trial as anything other than \"the tactics of delay and procrastination\" that the Supreme Court tells us have been the hallmark of another industry's efforts to thwart the regulatory efficacy of another agency. See Weinberger v. Hynson, Westcott \u0026 Dunning, 412 U.S. at 626-27. 28 K. Llewellyn, The Common Law Tradition -- Deciding Appeals 374 (1960), quoted in Farmington Dowel Prods. Co. v. Forster Mfg. Co., 421 F.2d 61, 73 (1st Cir. 1970). 29 As to which see, e.g., 4 K. Davis, Administrative Law chs. 29 \u0026 30; 5 U.S.C. §§ 701, 706. 30 380 U.S. at 393, quoting Boyce Motor Lines, Inc. v. United States, 342 U.S. 337, 340, 96 L. Ed. 367, 72 S. Ct. 329 (1952). 31 The procedures there were not unlike those used during the compliance phase of this case. Compare 12 C.F.R. § 4.12(d) (1967) and 12 C.F.R. § 5.4, with 16 C.F.R. § 3.61 and United States v. St. Regis Paper Co., 355 F.2d at 697. 32 Nothing in the Camp Court's reference, 411 U.S. at 142, to its decision in Citizens to Preserve Overton Park v. Volpe, 401 U.S. 402, 415, 28 L. Ed. 2d 136, 91 S. Ct. 814 (1971), is to the contrary. In Overton Park, the Court made clear that, under the Administrative Procedure Act, de novo review is authorized only \"when the action is adjudicatory in nature and the agency fact-finding procedures are inadequate . . . [or] when issues that were not before the agency are raised in a proceeding to enforce nonadjudicatory agency action.\" Id. (emphasis added). 33 It might be argued that Camp is irrelevant to the question here because review there is based on the Administrative Procedure Act and that it would be inappropriate to import into the Federal Trade Commission Act concepts of review that are of general applicability. While any such \"borrowing\" must of necessity be done with great care, I see no reason why it cannot be done as long as the result is consistent with and furthers the purposes of the Federal Trade Commission Act. Moreover, it is not as if the Administrative Procedure Act sprang into life full-blown like Minerva; rather it was the embodiment of an extensive structure of administrative law which the courts and commentators had been constructing, albeit with some confusion and inconsistency, for several decades. As previously noted, see note 12 and accompanying text supra, at least one federal court has asserted jurisdiction under the Administrative Procedure Act, 5 U.S.C. § 704, to review the FTC's rejection of a compliance report submitted by a party subject to a valid cease and desist order. Floersheim v. Weinburger, 346 F. Supp. at 955. That court took jurisdiction on the basis that an order of the FTC issued in the compliance phase \"may have the effect of a supplemental Cease and Desist Order without the benefit to the petitioner of judicial review.\" Id. Passing the question of the validity of the district court's assertion of jurisdiction, it is still noteworthy that the court sharply restricted its review in a § 45(l) proceeding: Review here is confined to a determination whether substantial evidence on the entire record . . . supports the Commission's response to the Report of Compliance so that the response cannot be said to have been arbitrary or clearly wrong. Id. at 957 (emphasis added). In a penalty action based on the Floersheim violations would not that action be res judicata? 34 See note 14 supra; cf. CIBA Corp. v. Weinburger, 412 U.S. at 644. 35 Appellants elaborate on the true purpose of this plenary trial by suggesting that the Government has an obligation at this stage in the proceedings to present \"experts in advertising, surveys of viewers, or poll or sample evidence.\" Brief for Appellants at 37. Passing the fact that the law of this case, in that the FTC is under no obligation at any time to take a \"random sample,\" Williams I, 381 F.2d at 890, I am struck by the trial envisioned by appellants and the statement by the majority that deciding the question whether these 11 commercials make \"forbidden\" representations is a rather easy one after all and quite appropriate for a jury. Maybe my brethren saw something in the commercials we viewed that I did not, but I was impressed by my lack of expertise on the subject of meaning and deceptiveness. 36 Appellants were prohibited, inter alia, from: 1. Disseminating or causing to be disseminated by means of the United States mails or by any means in commerce, as \"commerce\" is defined in the Federal Trade Commission Act, any advertisement (b) which represents directly or by implication that the preparation is a generally effective remedy for tiredness, loss of strength, run-down feeling, nervousness or irritability; (c) which represents directly or by implication that the preparation is an effective remedy for tiredness, loss of strength, run-down feeling, nervousness or irritability in more than a small minority of persons experiencing such symptoms; (d) which represents directly or by implication that the use of such preparation will be beneficial in the treatment or relief of tiredness, loss of strength, run-down feeling, nervousness or irritability, unless such advertisement expressly limits the claim of effectiveness of the preparation to those persons whose symptoms are due to an existing deficiency of one or more of the vitamins contained in the preparation, or to an existing deficiency of iron or to iron deficiency anemia, and further, unless the advertisement also discloses clearly and conspicuously that: (1) in the great majority of persons who experience such symptoms, these symptoms are not caused by a deficiency of one or more of the vitamins contained in the preparation or by iron deficiency or iron deficiency anemia; and (2) for such persons the preparation will be of no benefit; (e) which represents directly or by implication that tiredness, loss of strength, run-down feeling, nervousness or irritability are generally reliable indications of iron deficiency anemia. . . . In re J. B. Williams Co., FTC No. 8547 (Nov. 24, 1967) (modified order to cease and desist). 37 Appellants' use of the affirmative disclosure, \"The great majority of tired people don't feel that way because of iron poor blood, and Geritol won't help them,\" in commercials run prior to the 11 commercials before this court was rejected as insufficient by the FTC in an opinion handed down on December 2, 1968. In re J. B. Williams Co., FTC No. 8547 (Dec. 2, 1968). That decision is not subject to challenge here, but is part of the compliance phase record that was appropriately before the court below and is before this court on appeal. 38 The Sixth Circuit described the affirmative disclosure provisions as being the \"main thrust\" of the FTC's order, Williams I, 381 F.2d at 888. Given this interpretation of the order, it can fairly be said that adoption of a strategy that totally ignored the \"main thrust\" of the order would necessarily incur a greater risk of noncompliance unless radical changes were made not only in the appearance but in the substance of the commercials themselves. 39 See In re J. B. Williams Co., FTC No. 8547 (Dec. 2, 1968) at 7. 40 The stage directions and text of this commercial are as follows: 1. MS ON TED MACK IN LIBRARY, 1. MACK: (O.C.): STANDING NEXT TO LIGHT Hello, I'm Ted BOX. Mack. Your blood stream HE FLIPS SWITCH, LIGHTING has been UP LEFT HALF OF SHADOW called your lifeline. Look! You BOX TO SHOW BAD BLOOD could have iron-poor CELLS AND TITLE: \"IRON- blood cells like POOR BLOOD BEFORE GERI- these . . . pale, few in TOL.\" number, bad- ly shaped.2. DISSOLVE TO FILM CLIP OF 2. If that's so, take \"POOR\" \u0026 \"RICH\" CELLS. IN Geritol to build THIS SEQUENCE WE WILL USE more blood cells OUR FILM OF THE BLOOD . . . better CELLS FRAMES 2 AND 3. shaped . . . rich in iron . . . like these.3. CUT BACK TO SHOW MACK 3. There's no finer, more STANDING BY LIGHT BOX. effective way HOLDS UP BOTTLE OF TAB- to build iron-rich, LETS. red blood than with Geritol.4. CUT TO TWO BOTTLES. BACK 4. Geritol-iron enters TO MACK. your blood- stream fast carrying its blood-build- ing power to every part of your body.5. TITLE: \"TWICE THE IRON IN 5. Just 2 Geritol tablets A POUND OF CALF'S LIVER.\" or two table spoons of Geritol liquid contain twice the iron in a pound of calf's liver.6. CUT TO BOTTLES SHOT. TI- 6. Take Geritol. It builds TLE: BUILDS IRON POWER iron power FAST. in your blood fast! Geritol really works!41 See notes 12 \u0026 33, supra. 42 The commercials involved in counts 2-4 are set out in the appendices to the district court opinion, Williams II, 354 F. Supp. at 554-56; the similarities between those three commercials and the commercial in count 1 are such that they can be considered under the same analysis that applies to count 1. The word \"power\" is the key to the discussion of all four. 43 \"To say that Geritol builds power in your blood is the effective equivalent of saying that Geritol builds power in you.\" Id. at 537. 44 The argument might be made that we do violence to the standard rule relating to summary judgment that a court must draw the inference most favorable to the party opposing the motion, and the majority's reference to this rule seems to put the argument in those terms. But this argument is based on the erroneous assumptions that the court in a § 45 (l) proceeding has been given the authority to draw the \"most likely\" inference in the first place and that the Government must show, to prevail on its motion for summary judgment, that no other reasonable inferences might be drawn. As demonstrated in the text above, neither of these assumptions is true. The Supreme Court has recently had occasion to comment on the increased flexibility of the use of the summary judgment procedure in a case involving review of an administrative decision where no jury trial right obtained. See Weinburger v. Hynson, Westcott \u0026 Dunning, 412 U.S. at 621-22. 45 Again, the fact that this \"finding\" was not made after formal hearings is completely irrelevant unless appellants can make an argument that such denial rises to the level of violation of constitutional due process, as to which see note 14 supra. 46 The majority's opinion at footnote 23 states perfunctorily that \"the FTC's assertion that use of this word [power] was a violation did not make it so . . .\" amounts to a complete negation of agency expertise in the compliance phase of the proceedings and is a substitution of judgment on a mixed question of law and fact. If a court is dissatisfied with the reasoning, or lack of it, tendered by an agency to support its findings where only informal proceedings have been utilized to produce a record, that court has the power to demand such further evidence as is required for the execution of the court's limited responsibilities. See Camp v. Pitts, supra. 47 To have \"iron-poor blood,\" as an abstract proposition, would seem to have little or no meaning other than that condition might be thought by the layman suffering from it to affect his life through the symptomatic expression of that condition. This is not to say that some people might not be \"sad\" merely because a label had been attached to them as the result of a medical examination (which is presumably the only way one would be made aware of one's \"condition\"). It is to say that the layman's focus is apt to be on the symptoms of the underlying condition rather than on the condition itself. As has been said, \"The physician may . . . need to exert the full prestige of his position to induce an asymptomatic individual to alter his habits . . . or to follow a therapeutic program throughout the rest of his life.\" Harrison's Principles of Internal Medicine 7 (6th ed. 1970). It goes without saying that questions of effect on the viewing public long subjected to deceptive advertising by a particular advertiser are best resolved by the FTC on the basis of its intimate knowledge of and experience in such matters. 48 Appellants' claim that they thought the \"sad-glad\" theme would be acceptable to the FTC is quite curious in light of the FTC's prior decision, see note 39 supra, which went out of its way to point out that the \"before-and-after\" technique employed by appellants was considered to be in violation of the order. App. at 58-59. This finding has never been challenged by appellants, and is one that should be taken into consideration by the district court and this court in judging how close these commercials came to the \"border line\" of the FTC order. Even in the de novo review engaged in by the majority the December, 1968, decision is relevant. 49 With respect to counts 5-9, the majority argues that the conclusion of the district court represents only \"a possible inference [but] by no means the only one.\" Supra at 3180. Under the logic of the majority opinion, as discussed supra, an advertiser would always escape penalties for violation of a cease and desist order if more than one plausible inference could be drawn from a given commercial. This argument is untenable. 50 The logic in the majority's reliance on the certification in this regard but in no other is beyond my capacity to follow. 51 While the FTC's special expertise may not be raised as a barrier inhibiting . . . judicial review . . . it does and should inhibit the notion that a court may be injected into the pertinent subject-matter directly, without the benefit of FTC consideration. Holloway v. Bristol-Myers Corp., 485 F.2d at 998 (footnote omitted) (emphasis added).\u003c/span\u003e\n\n",
    "body_length": 192535,
    "citedas": [
      "498 F.2d 414"
    ],
    "attorneys": "Charles A. Horsky, Esq., Washington, District of Columbia (John Vanderstar, Esq., Michael Boudin, Esq., Covington \u0026 Burling, Washington, District of Columbia; Powell Pierpoint, Esq., Hughes Hubbard \u0026 Reed, New York, New York; and Henry Edward Schulty, Esq., New York, New York, of Counsel), for Appellants. Patricia M. Hynes, Assistant United States Attorney (Paul J. Curran, United States Attorney for the Southern District of New York, of Counsel), for Appellee.",
    "category": [
      "252"
    ],
    "judges": "Friendly, Feinberg and Oakes, Circuit Judges.",
    "citation_count": 80
  }
}
