{
  "id": "nKJ5R2YBTlTomsSBGFr0",
  "document": {
    "title": "People v. Lucas",
    "full_title": "THE PEOPLE AND v. LARRY DOUGLAS LUCAS AND .",
    "jurisdiction": "California Supreme Court",
    "date": "1995-12-29T00:00:00.000Z",
    "docket": "No. S004788",
    "body": "LUCAS, C.J.:\n\nDefendant Larry Douglas Lucas appeals from the judgment of the Los Angeles County Superior Court imposing the death penalty following his conviction by jury of two counts of first degree murder (Pen. Code, § 187; all further statutory references are to this code unless otherwise indicated), and burglary ( § 459), as well as two special-circumstance findings: multiple murder ( § 190.2, subd. (a)(3)), and burglary murder (id., subd. (a)(17)(vii)). After the jury's death penalty verdict, the trial court denied defendant's motion for new trial and the automatic motion to modify penalty. ( § 190.4, subd. (e).) Appeal to this court is automatic. ( § 1239, subd. (b).)\n\nI. FACTS\n\nOn October 15, 1986, a letter carrier saw victim Edwin Marriott alive and well. The next day when she tried to deliver mail, the screen door of his house covered the mail slot and no one came to the door to answer her ring, both unusual circumstances. The letter carrier became concerned when the Marriotts failed to come to the door to receive their mail for several days thereafter. She contacted a neighbor, who called the victims' daughter. Inspection of the home disclosed the bodies of the victims, Edwin and Mary Marriott, aged respectively 85 and 75. They had suffered multiple stab wounds and blunt force traumas.\n\nMary Marriott was found in her nightgown in the south bedroom. There was blood along the east wall of the bedroom and four bloody finger marks on her bedroom door. A bloody folding knife with a bent tip was found under a pile of bedding and debris. Edwin Marriott was found in the doorway of the north bedroom. There was a bloodstain in the center of the door and bloodstains on a drawer found on the floor of the bedroom. A lamp base and shade on the bedroom floor had bloodstains on them, as did clothing found in the closet. There was a bloody residue in the sink in the sole bathroom of the house and there was also a bloody footprint on the floor.\n\nThe Marriott home, usually kept in impeccable order, was strewn with upturned drawers and blood-smeared objects. In the hallway between the bedrooms was a jewelry box with costume jewelry nearby. A window shade in the front of the house, stained with blood, was folded back, affording a view of the street.\n\nA kitchen drawer was pulled out and stained with blood, as were some of the kitchen cabinets. There were bloody footprints in the kitchen. A small tack hammer with a broken head was found in the kitchen. A key ring with keys was found in a planter outside the kitchen door. The back door of the home, leading into the kitchen, was open and glass from the door was broken out. The back door had a deadbolt requiring a key to open it from either side. There was broken glass both inside the kitchen and outside on the porch area and lawn. The screen door on the back porch was torn above the lock and handle. Blood drops led from the kitchen to the driveway of defendant's residence next door. There were blood drops on the sidewalk, a smear of blood on the wall of defendant's garage and some blood on the gate latch leading toward the back yard of defendant's home.\n\nA search of defendant's home produced a pair of jeans and boxer shorts with blood on them. Defendant's fingerprints matched those on the jewelry box and another small cardboard box found inside the Marriott home. Blood found on various items in the Marriott home was consistent with defendant's blood but not with that of the victims. Blood on the jeans found in defendant's home was consistent with defendant's blood, while the blood on the boxer shorts found inside the jeans was consistent with Edwin Marriott's blood but not with defendant's.\n\nDefendant produced evidence that he was arrested for being under the influence of drugs on the day the bodies were discovered. At that time he had multiple puncture marks on his arm, some fresh, some older. Defendant also produced the testimony of his employer, who saw him around 10 p.m. on October 15, 1986, the date of the murder. The employer, Mr. Perez, testified he saw defendant with two unfamiliar men, clearly \"under the influence of something.\" Defendant's hands were shaking as if he were dribbling a basketball and he seemed \"hyperactive.\"\n\nDefendant testified that he had lived next door to the Marriotts for many years. He stated that on October 15, 1986, having received a cash payment from his employer, he spent the day with two men, Croffoot and Sandoval, injecting crystal methamphetamine, cocaine and finally heroin in large quantities. Ultimately defendant passed out, and could only recall standing in a dark hall, with faces like \"waxy fright masks\" coming at him. He tried to push them away and struck at them. He ran, looking over his shoulder. He remembered driving, but could not recall where. He woke up at the beach. His hand was stuck to the seat of the car with blood. He washed his hands. The right hand was cut across the first knuckle of the index finger and on the heel of the palm. He had no recollection of receiving these injuries. He continued to ingest drugs, returning home on one occasion to obtain funds from his wife. He had no recollection of any \"problem\" with the Marriotts. He had no reason or desire to kill the Marriotts, and no need to enter their home to obtain money for drugs. He identified the jeans found in his home as his, but was not sure the boxer shorts found inside them were his.\n\nIn rebuttal, officers who interrogated defendant after his arrest testified that defendant identified the bloody folding knife found at the Marriotts' home as his own. He also attempted to hide his wounded hand during the interview. When asked how the Marriotts' back door window was broken, defendant told the officers he broke the window and took the glass out of the panel. He admitted cutting himself inside the Marriott home, but did not admit killing the victims.\n\nIn surrebuttal, defendant said he kept his hands in his pockets during the jail interview in compliance with jail rules. He stated that the officers' questioning focused on a man named Randy Norris, and that one officer threatened him with the death penalty when he requested an attorney. He merely stated the knife found at the scene was similar to one of his own. He did not admit breaking the window of the back door of the Marriott house and cutting his hand there. He was sick during the interview because he was withdrawing from drugs and had a kidney infection.\n\nIn further rebuttal, the interrogating officers denied threatening defendant with the death penalty and said the interview stopped when defendant asked for an attorney. Defendant told them \"they\" (apparently referring to himself and an accomplice) had used a key to unlock the deadbolt on the Marriotts' back door.\n\nAt the penalty trial, the People offered evidence that when a baby-sitter defendant had employed approached him about being paid, defendant accused her of stealing his marijuana, punched her, and knocked her off his porch. He also threatened to hire someone to kill her. This conduct resulted in a conviction for assault with a deadly weapon.\n\nDefendant offered no evidence at the penalty trial, having called only his wife, who invoked the marital privilege. The trial court expressed great concern over this development, and caused defendant and counsel to present their tactical reasons for the decision to present no evidence at an ex parte hearing before another Judge, the transcript of which was ordered sealed. The trial court confirmed that the court in the closed hearing had determined that counsel had consulted 12 or 13 witnesses, and had a tactical reason not to call any witnesses at the penalty trial. The court also obtained defendant's personal, on-the-record waiver of his right to testify at the penalty trial as well as his statement that he concurred in counsel's decision to present no evidence at that phase of trial.\n\nThe jury returned a verdict of death.\n\nII. GUILT TRIAL ISSUES\n\nA. Ineffective assistance of counsel.\n\nDefendant claims he was deprived of the right to effective assistance of counsel, as guaranteed by the Sixth Amendment to the federal Constitution and by article I, section 15 of the California Constitution. He cites several instances of alleged incompetence.\n\nThe law governing defendant's claim is settled. \"A criminal defendant is guaranteed the right to the assistance of counsel by both the state and federal Constitutions. (U.S. Const., 6th Amend.; Cal. Const., art. I, § 15.) 'Construed in light of its purpose, the right entitles the defendant not to some bare assistance but rather to effective assistance.'\" ( People v. Wharton (1991) 53 Cal. 3d 522, 575, 280 Cal. Rptr. 631, 809 P.2d 290, quoting People v. Ledesma (1987) 43 Cal. 3d 171, 215, 233 Cal. Rptr. 404, 729 P.2d 839, italics in original.) It is defendant's burden to demonstrate the inadequacy of trial counsel. ( People v. Pope (1979) 23 Cal. 3d 412, 425, 152 Cal. Rptr. 732, 590 P.2d 859 (Pope).) We have summarized defendant's burden as follows: \"'In order to demonstrate ineffective assistance of counsel, a defendant must first show counsel's performance was \"deficient\" because his \"representation fell below an objective standard of reasonableness . . . under prevailing professional norms.\" ( Strickland v. Washington (1984) 466 U.S. 668, 687-688, 80 L. Ed. 2d 674, 104 S. Ct. 2052 (Strickland); Pope, supra, 23 Cal. 3d at pp. 423-425.) Second, he must also show prejudice flowing from counsel's performance or lack thereof. ( Strickland, supra, 466 U.S. at pp. 691-692.) Prejudice is shown when there is a \"reasonable probability that, but for counsel's unprofessional errors, the result of the proceeding would have been different. A reasonable probability is a probability sufficient to undermine confidence in the outcome.\"'\" ( In re Harris (1993) 5 Cal. 4th 813, 832-833, 855 P.2d 391.)\n\nReviewing courts defer to counsel's reasonable tactical decisions in examining a claim of ineffective assistance of counsel (see People v. Wright (1990) 52 Cal. 3d 367, 412, 276 Cal. Rptr. 731, 802 P.2d 221), and there is a \"strong presumption that counsel's conduct falls within the wide range of reasonable professional assistance.\" ( Strickland, supra, 466 U.S. at p. 689.) Defendant's burden is difficult to carry on direct appeal, as we have observed: \"'Reviewing courts will reverse convictions [on direct appeal] on the ground of inadequate counsel only if the record on appeal affirmatively discloses that counsel had no rational tactical purpose for [his or her] act or omission.'\" ( People v. Zapien (1993) 4 Cal. 4th 929, 980, 846 P.2d 704.)\n\nWith these rules in mind, we examine defendant's claims of ineffective assistance.\n\n1. Motion to exclude defendant's statements.\n\nDefendant claims counsel performed incompetently because, although they moved to exclude his statements to the police on the ground those statements were taken in violation of Miranda v. Arizona (1966) 384 U.S. 436, 16 L. Ed. 2d 694, 86 S. Ct. 1602 (Miranda), they improperly waived the additional claim that the statements were involuntary or unreliable. Defendant also argues counsel erred in calling him to the stand to testify at trial, observing that because the incriminating statements had not been offered in the prosecutor's case-in-chief, defendant's trial testimony subjected him to impeachment with the pretrial statements.\n\nThe record discloses the following factual basis for defendant's claim. Los Angeles County Deputy Sheriff Kushner testified that at the time of defendant's confinement at the Santa Ana County jail, defendant admitted he broke the rear door window of the Marriott house and cut his hand inside the home. He also said a photograph of the murder weapon depicted his own knife. Defendant moved, pursuant to section 402 of the Evidence Code, to exclude these statements. As discussed below, the court denied the motion, and the statements were introduced in rebuttal after defendant testified that he had no recollection of being in the Marriott home.\n\nDefendant's written motion to exclude the statements asserted he was questioned in violation of Miranda, supra, 384 U.S. 436 and People v. Fioritto (1968) 68 Cal. 2d 714, 68 Cal. Rptr. 817, 441 P.2d 625. Defendant testified at the hearing on the motion, asserting that the deputies did not warn him of his rights under Miranda until they had interrogated him for some time. Further, he claimed that they failed to heed his invocation of his right to counsel. He also asserted that the deputies threatened him with the death penalty and that he was undergoing drug withdrawal during the interrogation. On cross-examination, the People sought to question defendant on his pattern of drug use in the weeks before the interrogation, asserting that this evidence was necessary to rebut defendant's claim that he was undergoing drug withdrawal during the interview. Defense counsel strenuously objected to this line of questioning, asserting that it provided improper discovery for the People. Counsel instructed defendant not to answer the questions.\n\nThe trial court's Discussion of the issue is somewhat obscure. At one point the court overruled defendant's objection and threatened to strike defendant's testimony unless he answered the questions. Alternatively, the court suggested it would force counsel to withdraw the exclusion motion. Defense counsel responded that the issue of defendant's drug use before the interrogation had nothing to do with the question whether the officers advised him of his rights or heeded his request to cease the questioning until counsel could be appointed. Rather, counsel asserted the prosecutor's questions were intended to provide discovery regarding defendant's drug use. Counsel suggested the issue be limited to the question of the asserted Miranda violation, and that counsel would abandon any voluntariness claim rather than require defendant to answer questions regarding his drug use. Although defense counsel disagreed with the court's ruling on the scope of questioning open to the prosecutor, counsel said they would abide by the ruling, but \"suggested to your honor that any testimony that he gave or any consideration of the issue of whether or not his sickness prevented him from making a valid waiver, that that not be considered or that that be deemed withdrawn.\"\n\nThe court suggested defendant's entire testimony should be stricken because defendant could not insulate himself from questioning about his state of mind and ability to recall once he put those matters in issue. By asserting that he recalled that the deputies did not advise him of his rights under Miranda before interrogating him, defendant opened the door to the prosecutor's questioning. The court accepted the prosecutor's suggestion that an expert in the field of narcotics addiction be called to testify whether it would be necessary to know the pattern of defendant's drug use for some period before the interrogation in order to know whether his drug withdrawal during the interrogation deprived him of the ability to voluntarily waive his Miranda rights. The court also vacated its earlier rulings.\n\nThe court heard the testimony of such an expert regarding the effects of drug withdrawal. Because the expert testified that drug withdrawal would have no effect on a person's ability to perceive and recollect, the court concluded the question of drug withdrawal was entirely irrelevant to the question of the voluntariness of defendant's statement. Therefore, the court sustained the defense objection to the People's questions regarding defendant's drug use before the interrogation.\n\nNonetheless, the prosecutor suggested, without making a particular motion, that he thought there was authority that would allow him to ask defendant about his drug use in order to explore defendant's memory of the interrogation. The court apparently was still troubled by defendant's refusal to testify on the question of his drug use, for a little later in the proceedings, referring to the motion pursuant to Evidence Code section 402, the court noted it had asked counsel to review the case law regarding a witness's refusal to answer questions on cross-examination. \"Mr. Lucas has refused to answer certain questions regarding substance abuse, the question becomes whether the court strikes any of his testimony, part of his testimony, or all of his testimony.\" Referring to cases in which courts refused to strike the witness's testimony when the questions the witness failed or refused to answer on cross-examination were not material, the court decided to strike a limited portion of defendant's direct examination for the purpose of ruling on the motion to exclude the statements. \"It would be the court's intended ruling to strike from any consideration of the free and voluntariness of the confession anything relating to alleged illness, under the influence of any kind of controlled substance, any nausea, anything whatsoever that would be related to or affected by the use of controlled substances and that in fact subject to either counsel arguing would be the court's ruling, leave the balance of the testimony going to whether or not the defendant was properly advised at a certain stage of the proceedings. . . . In other words, anything relating to his state of mind because of the alleged use of narcotics is stricken because the defense - Mr. Lucas is refusing to answer those questions. . . . \" The court concluded it \"did what [defense counsel] asked\" - apparently referring to counsel's decision to waive the voluntariness claim rather than direct defendant to answer questions regarding his drug use in the period before his interrogation.\n\nOn appeal, defendant concedes defense counsel waived his claim that the statements to the police were involuntary, but he argues that the decision to waive the claim was incompetent. He maintains that counsel should not have objected to the prosecutor's questions regarding his earlier drug use, and that counsel should have pursued the claim that defendant's statements were involuntary as the product of drug withdrawal. He argues there could be no rational tactical basis for counsel's waiver of the voluntariness claim, as any evidence produced regarding defendant's earlier drug use could only have supported defendant's defense at trial that he killed in a drug-induced stupor.\n\nEvidently trial counsel thought otherwise. The record clearly demonstrates counsel feared that an exploration of defendant's use of drugs before the interrogation could provide the prosecution with damaging evidence. Although the court assured counsel that broad questions about defendant's activities and companions in the weeks before the crime would not be permitted under the guise of questioning about drug use, counsel reasonably may have feared that even narrow questions would produce damaging evidence. Counsel might have feared, for example, that such questioning would provide the prosecution with information leading to evidence that would be useful to rebut defendant's claim that he was under the influence of drugs or alcohol at the time of the crime - evidence that would undercut his defense. Further, upon reflection, counsel may reasonably have concluded that a claim that defendant was under the influence of drugs or drug withdrawal at the time of the interrogation was an expendable or even counterproductive argument. Such an argument actually tended to undercut defendant's claim that his statement was the product of a Miranda violation, because it would throw doubt on the reliability of his testimony that he recalled that the officers failed to provide the Miranda warnings and failed to heed his invocation of his right to counsel. In addition, although there was some evidence defendant's pupils were dilated at the time of the interview, a circumstance consistent with narcotics withdrawal, defendant's own testimony did not suggest his mind was clouded by drug withdrawal during that time.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Nor does it appear from the appellate record that counsel's waiver was based on ignorance or misinterpretation of applicable law. (Cf. In re Wilson (1992) 3 Cal. 4th 945, 949-950, 838 P.2d 1222 [on collateral attack, defendant demonstrated counsel's failure to object based on misunderstanding of Massiah v. United States (1964) 377 U.S. 201, 12 L. Ed. 2d 246, 84 S. Ct. 1199].) We cannot conclude on this record that counsel's fears were unfounded, or that no rational tactical basis supported the decision to waive the voluntariness claim. (See People v. Zapien, supra, 4 Cal. 4th at p. 980.)\n\nDefendant also argues trial counsel should have pursued a claim that defendant's statements were involuntary because they were induced by a threat of the death penalty, pointing to defendant's testimony regarding such threats, and Detective Kushner's testimony that he might have told defendant it was a death penalty case and that it was conceivable, though doubtful, that he told defendant he was going to the gas chamber. Our reading of the record indicates that although counsel initially did seek to exclude the statements on the ground they were involuntary because they occurred during drug withdrawal, counsel never made the argument that they should be suppressed because they were the product of a threat of the death penalty.\n\nThe question remains whether counsel's failure to make the argument was incompetent representation. A statement extracted by official coercion or threat is involuntary and inadmissible under the due process clauses of the state and federal Constitutions. ( People v. Benson (1990) 52 Cal. 3d 754, 778, 802 P.2d 330, 276 Cal. Rptr. 827.) The statement is involuntary only if the threat actually induces defendant to make the statement. (52 Cal. 3d at pp. 778-779.) Had counsel challenged the statement on the ground it was induced by threat, it would have been the People's burden to establish the voluntariness of the statements. ( People v. Markham (1989) 49 Cal. 3d 63, 71, 260 Cal. Rptr. 273, 775 P.2d 1042.)\n\nThe record is silent as to counsel's reasons for failing to challenge the statements on the ground they were induced by threat of the death penalty. Reviewing courts reverse convictions on direct appeal on the ground of incompetence of counsel only if the record on appeal demonstrates there could be no rational tactical purpose for counsel's omissions. ( People v. Zapien, supra, 4 Cal. 4th at p. 980.) Here, the record does not demonstrate there could be no rational tactical reason for the omission. Counsel may have concluded there was little or no basis for the claim because it did not appear from defendant's testimony that defendant made any statements to the police after the alleged references to the death penalty, other than asking to go to the bathroom.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Nor did defendant claim the alleged threats overrode his will to resist or indeed, caused him any particular concern. Although the People would have the burden to prove voluntariness, an attorney naturally must assess his or her client's account of the interrogation in order to determine the plausibility of a claim that statements were involuntarily obtained. Counsel here may have concluded their client's account would not support such a claim in this instance.\n\nFurther, in the context of the hearing, counsel were faced with the court's threat to strike defendant's entire testimony unless counsel abandoned the voluntariness claim. As we have noted above, counsel could reasonably decide it was more important to preserve the Miranda claim than it was to pursue the voluntariness claim on either ground asserted here. On the basis of the appellate record, we cannot say that counsel's decision not to pursue the voluntariness claim on this basis was an incompetent one.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nDefendant next claims that the failure of the deputies who questioned him to make a contemporaneous record of the interrogation, along with the paucity of the rest of the record on the voluntariness claim, would have prevented the prosecution from carrying its burden of proving voluntariness, had counsel pursued the motion to suppress the statements on that ground. Counsel were incompetent for failing to make the motion, he urges, under this state of the evidence.\n\nThe police, however, had no obligation to make a tape recording of the Miranda advisements or the rest of the interrogation, or to take notes of the interrogation, and their failure to do so did not deprive the People of the ability to establish the voluntariness of any statements. (See People v. Marshall (1990) 50 Cal. 3d 907, 925, 269 Cal. Rptr. 269, 790 P.2d 676 [waiver of Miranda rights not ineffective merely because Miranda advisements and waivers not memorialized]; see also People v. Marquez (1992) 1 Cal. 4th 553, 571, 822 P.2d 418 [same].)\n\nMore significantly, we disagree with defendant's premise that an attorney is necessarily incompetent for failing to raise the issue of voluntariness if the appellate record fails to establish the voluntariness of a statement by a preponderance of the evidence. The sparseness of the record on appeal reflects not the merits of defendant's voluntariness claim but the reality that the issue was not fully litigated below and that the People were not put to their burden of proof. On appeal, we do not examine the existing record to attempt to divine whether the People could have carried their burden of proof had they been put to the test. Defendant fails to recognize that the silence of the record works against him when the claim we review on appeal is not whether the statement was involuntary, but whether counsel was incompetent for failing to claim it was involuntary. Our decisions recognize counsel's omission legitimately may have been based in part on considerations that do not appear on the record, including confidential communications from the client. ( People v. Jenkins (1975) 13 Cal. 3d 749, 755, 119 Cal. Rptr. 705, 532 P.2d 857.) Accordingly, we presume counsel's decision not to raise the claim was a reasonable, tactical one unless the record affirmatively demonstrates otherwise. ( Pope, supra, 23 Cal. 3d at p. 426; see also People v. Zapien, supra, 4 Cal. 4th at p. 980; People v. Fosselman (1983) 33 Cal. 3d 572, 581, 189 Cal. Rptr. 855, 659 P.2d 1144.) Defendant fails to persuade us that the record demonstrates counsel had no reasonable tactical basis for the decision to waive the voluntariness claim.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nDefendant next argues his counsel were incompetent in deciding to call him as a witness at trial. Because the prosecutor chose not to introduce defendant's statements to the police in the People's case-in-chief, defendant claims that counsel should have kept him from testifying at trial in order to avoid later impeachment with the statements. Evidence of defendant's intoxicated state could have been presented to the jury through other witnesses, defendant asserts, if only counsel had not made \"mistakes of law regarding the admissibility of testimony of witnesses other than Mr. Lucas. . . . \"\n\nWe disagree. Defense counsel have no power to prevent their clients from testifying. ( People v. Lucky (1988) 45 Cal. 3d 259, 281, 247 Cal. Rptr. 1, 753 P.2d 1052; People v. Robles (1970) 2 Cal. 3d 205, 215, 85 Cal. Rptr. 166, 466 P.2d 710.) We cannot tell from the record on appeal whether or not counsel advised defendant to take the stand. In any event, such advice goes to the heart of trial tactics (see People v. Frierson (1985) 39 Cal. 3d 803, 814, 218 Cal. Rptr. 73, 705 P.2d 396; People v. Trotter (1984) 160 Cal. App. 3d 1217, 1224-1225, 207 Cal. Rptr. 165), and for that reason rarely would support a claim of ineffective assistance of counsel.\n\n2. Boxer shorts.\n\nDefendant contends trial counsel were incompetent in failing to move to exclude from evidence a pair of bloody boxer shorts found inside some blue jeans that were seized from defendant's residence pursuant to a search warrant. Defendant claims counsel should have moved to exclude the evidence on the ground an inadequate chain of custody had been established.\n\nThe rules for establishing chain of custody are as follows: \"'The burden on the party offering the evidence is to show to the satisfaction of the trial court that, taking all the circumstances into account including the ease or difficulty with which the particular evidence could have been altered, it is reasonably certain that there was no alteration. [P] The requirement of reasonable certainty is not met when some vital link in the chain of possession is not accounted for, because then it is as likely as not that the evidence analyzed was not the evidence originally received. Left to such speculation the court must exclude the evidence. [Citations.] Conversely, when it is the barest speculation that there was tampering, it is proper to admit the evidence and let what doubt remains go to its weight.'\" ( People v. Diaz (1992) 3 Cal. 4th 495, 559, 834 P.2d 1171, quoting People v. Riser (1956) 47 Cal. 2d 566, 580-581, 305 P.2d 1; see also People v. Williams (1989) 48 Cal. 3d 1112, 1134, 259 Cal. Rptr. 473, 774 P.2d 146.)\n\nThe decision whether to object to evidence at trial is a matter of tactics and, because of the deference accorded such decisions on appeal, will seldom establish that counsel was incompetent. ( People v. Rodrigues (1994) 8 Cal. 4th 1060, 1121, 885 P.2d 1; People v. Freeman (1994) 8 Cal. 4th 450, 490-491, 882 P.2d 249.)\n\nThe record shows that at trial, Detective Kushner testified that he personally recovered the blue jeans and boxer shorts from defendant's house when he executed the search warrant. He noted that he only listed the jeans in the return to the search warrant, and that when he examined the jeans at the crime lab, he discovered the boxer shorts inside them. As defendant points out, however, at the preliminary hearing, Kushner testified that he did not personally seize the jeans during the search of defendant's residence. Rather, Kushner testified that during the search of defendant's home, another deputy handed him a paper bag containing the jeans found in defendant's residence, and Kushner found the boxer shorts inside the jeans when he and Detective Morck delivered the paper bag to the crime lab. A written sheriff's department report stated that Detective Morck submitted to the crime lab a bag containing the jeans and boxer shorts, and the receipt number given these items matched the receipt on the jeans and boxer shorts. A criminalist testified that the blood on the boxer shorts was consistent with the blood of victim Edwin Marriott, but not with defendant's blood.\n\nWe do not see a strong claim that counsel would have prevailed in excluding the shorts on chain of custody grounds. Although the identity of the deputy who actually seized the blue jeans from defendant's home is somewhat uncertain on this record, there does not appear to be much question that the sheriff's deputies seized the jeans from defendant's home during the search and that thereafter deputy Kushner found the bloodstained boxer shorts inside the jeans when he turned the evidence over to the crime lab. Defendant identified the jeans as his.\n\nEven if we concluded defendant is correct that there was a flaw in the chain of custody, the record does not establish that counsel were incompetent in failing to object on this ground to the admission of the evidence. \"The mere fact that counsel, had he [or she] chosen another path, 'might' have convinced the court to issue a favorable evidentiary ruling, is not enough to carry defendant's burden of demonstrating [incompetence]. . . . \" ( People v. Jennings (1991) 53 Cal. 3d 334, 379, 279 Cal. Rptr. 780, 807 P.2d 1009.) Rather, as we have explained, a conviction will not be reversed unless the record on appeal demonstrates counsel had no rational purpose for the failure to object, and the failure was prejudicial. ( People v. Rodriguez, supra, 8 Cal. 4th at p. 1121; People v. Zapien, supra, 4 Cal. 4th at p. 980.)\n\nAs we observed in People v. Diaz, supra, 3 Cal. 4th 495, it is common and proper for counsel to stipulate to the chain of custody. ( Id. at p. 560.) Flaws in the chain are often mere technical omissions that competent counsel may consider unworthy of extended debate. (Id.) In fact, an objection on chain of custody grounds may be less productive for defendant than a decision to permit the prosecutor to establish a shoddy chain of custody that can be pointed out to the jury in the hope of giving rise to a reasonable doubt. We conclude defendant has failed to show counsel were incompetent for omitting to move to suppress the boxer shorts on chain of custody grounds.\n\nDefendant also faults counsel for failing to argue to the jury that the evidence of the boxer shorts was unreliable. We reject the claim. Counsel did seek to undermine the impact of the boxer shorts evidence during cross-examination of prosecution witnesses by establishing that the shorts were actually discovered in the crime lab, not in defendant's home, and by eliciting testimony that the blood on the shorts was consistent with the blood of four million residents of Los Angeles County. The impeachment value of these points was relatively slight, however. We cannot fault defense counsel for failing to argue the matter in closing, when the primary defense was that defendant committed the homicides but lacked the mental state necessary to establish murder because of gross excess in ingesting drugs. (See People v. Freeman, supra, 8 Cal. 4th at p. 499 [difficult to defend simultaneously on grounds of total innocence and lack of intent].)\n\n3. Closing argument.\n\nDefendant claims counsel's closing argument at the guilt trial was incompetent, because counsel conceded that circumstantial evidence was as good as direct evidence, and because counsel admitted there was no other evidence available to support the defense, admitted defendant was at the crime scene and probably committed the murders, and admitted the jury's revulsion against defendant was justified. He claims counsel could not concede defendant's guilt without defendant's express waiver of rights.\n\nDefense counsel must not argue against his or her client ( People v. Lang (1974) 11 Cal. 3d 134, 139, 113 Cal. Rptr. 9, 520 P.2d 393), but it is settled that it is not necessarily incompetent for an attorney to concede his or her client's guilt of a particular offense. ( People v. Cain (1995) 10 Cal. 4th 1, 30, 892 P.2d 1224; People v. Freeman, supra, 8 Cal. 4th at p. 498; People v. Mayfield (1993) 5 Cal. 4th 142, 177, 852 P.2d 331.) It is also settled that counsel's concession of guilt on one or more charges at the guilt phase of a capital trial is not the equivalent of a guilty plea, requiring defendant's express waiver. ( People v. Cain, supra, 10 Cal. 4th at p. 30; People v. Griffin (1988) 46 Cal. 3d 1011, 1029, 251 Cal. Rptr. 643, 761 P.2d 103.)\n\nWe cannot say on this record counsel made an incompetent tactical choice to admit that defendant was at the scene and probably committed the homicides, but to argue his intoxication negated the mental elements necessary for felony murder or premeditated murder. After all, defendant's bloody fingerprint was found at the scene, defendant's hand was cut, blood consistent with his blood, but not with the victims' was found in their home, and a trail of blood led from the scene of the crime to defendant's home. In addition, the bloody knife found at the scene was a knife like one defendant had owned, and blood on defendant's clothing was consistent with the blood of one of the victims. Finally, when he was interrogated by the police, defendant admitted cutting his hand inside the victims' house and identified the murder weapon as his own.\n\nGiven this evidence, \"'it is entirely understandable that trial counsel . . . made no sweeping declarations of his client's innocence but instead adopted a more realistic approach . . . . As stated in a recent case, \"good trial tactics demanded complete candor\" with the jury. [Citations.] Under the circumstances we cannot equate such candor with incompetence.'\" ( People v. Wright, supra, 52 Cal. 3d at p. 415; see also People v. Jones (1991) 53 Cal. 3d 1115, 1150, 282 Cal. Rptr. 465, 811 P.2d 757 [within permissible range of tactics for counsel to recognize weakness of defense in closing argument]; People v. Wade (1988) 44 Cal. 3d 975, 988-989, 244 Cal. Rptr. 905, 750 P.2d 794 [counsel may reasonably concede guilt and emphasize mental defenses].)\n\nDefendant claims counsel argued against him by admitting there was no \"mitigating\" evidence other than that presented at trial, as follows: \"Do you believe for a minute if there wasn't something very favorable to defendant that I wouldn't have presented it to you?\" The statement does not seem to be an argument against defendant, and in any case, defendant takes the statement out of context. Counsel was arguing that both defense counsel's and the prosecutor's arguments were only their own views based on the same evidence available to the jury. Counsel pointed out that neither the prosecutor nor defense counsel had additional evidence, or they would have presented it. In this context, the challenged statement is innocuous.\n\nDefendant also claims counsel argued against him by admitting that the photographs of the victims were gruesome and that the jury would not be human if these photographs did not cause them to feel \"revulsion for what happened or an anger toward [defendant].\" Again, defendant takes the statement out of context. Counsel made two legitimate points: that the jury should not allow itself to be swayed by its emotion upon viewing the photographs, and that the frenzied attack depicted in the photographs supported the mental defense counsel had offered.\n\nDefendant also faults counsel for stating that circumstantial evidence could be more persuasive than direct evidence. Again, the context shows counsel made a proper argument that although circumstantial evidence may be reliable, if there are two reasonable inferences to be drawn from such evidence, the jury is bound to follow the inference pointing to the defendant's innocence.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nIn sum, the record does not support the claim that counsel's closing argument was incompetent.\n\nAccordingly, we reject all the above claims of ineffective assistance of counsel.\n\nB. Admission of photographs.\n\nDefendant claims the trial court erred in admitting 21 photographs of the victims' bodies, over defense objection, without adequately performing the weighing process required by Evidence Code section 352. He also argues the court erred in admitting the photographs, taken at the scene of the crime and at the morgue, because they were of little probative value, but were highly inflammatory. He argues finally that admission of the photographs was a violation of his right to a fair trial under the Fourteenth Amendment to the federal Constitution.\n\nDefendant claims that the trial court responded to his motion to exclude the photographs by focusing only on the question whether the photographs were material evidence. He argues that Evidence Code section 352, under which he made the motion to exclude, requires the court to balance, on the record, the probative value of challenged evidence against its prejudicial impact. He also claims the record shows the court gave undue deference to the testimony of a prosecution expert regarding the relevance of the evidence to the prosecution case.\n\nDefendant is mistaken. As we have stated, \"the trial [court] need not expressly weigh prejudice against probative value - or even expressly state that [it] has done so.\" ( People v. Mickey (1991) 54 Cal. 3d 612, 656, 286 Cal. Rptr. 801, 818 P.2d 84.) Here, as to the challenged evidence, the court heard extensive argument on both prejudice and probative value. The court was initially of the view that several of the photographs were \"inflammatory and unduly prejudicial\", and ultimately decided that two of the photographs could be admitted only if the victim's face was excised. The record demonstrates that the trial court \"understood and fulfilled its responsibilities under Evidence Code section 352. Nothing more was required.\" ( People v. Garceau (1993) 6 Cal. 4th 140, 182, 862 P.2d 664.)\n\nThe record does not disclose that the court unduly deferred to the opinion of the expert. The expert, the coroner who performed the autopsies on the victims, testified outside the presence of the jury that photographs in which the images were obscured by blood would be less useful to \"illustrate\" his trial testimony than images in which the blood had been wiped away. He indicated that each photograph would be valuable to demonstrate what injuries had been inflicted and how much blood was lost over what period of time. Thus, the expert offered testimony tending to show the probative value of the photographs. The court did not err in relying on the expert's testimony for the purpose of fact finding, and it is clear from the record that the court drew its own Conclusions on the ultimate question of law presented to it.\n\nDefendant argues the evidence should have been excluded because it was cumulative to the testimony of the coroner. He adds that the evidence must have been unnecessary to illustrate the coroner's testimony because it was admitted and submitted to the jury eight days after the coroner's testimony. He also urges the photographs were irrelevant to the charged torture-murder special circumstance because they \"merely depicted the [victims'] bodies at the crime scene.\" Finally, he argues that the photographs were gruesome, graphic and inflammatory.\n\nWe review the trial court's order denying defendant's motion to exclude the photographs pursuant to Evidence Code section 352 for abuse of discretion. ( People v. Ashmus (1991) 54 Cal. 3d 932, 973, 820 P.2d 214.) As we have explained, \"a trial court has broad discretion in determining the admissibility of murder victim photographs in the face of a claim . . . they are unduly gruesome or inflammatory.\" ( People v. Wilson (1992) 3 Cal. 4th 926, 938, 838 P.2d 1212.)\n\nWe see no abuse of discretion here. We have viewed the photographs. The photographs admitted at trial are small. They are rather clinical in appearance, and are not unduly gruesome. Both the prosecutor and defense counsel cautioned the jury against being swayed by passion upon viewing the photographs. We do not believe that their number, though relatively large, created a such a cumulatively prejudicial impact that it was an abuse of discretion to admit them. The photographs were relevant to corroborate and illustrate the testimony of the coroner concerning the number and nature of the wounds and to corroborate the testimony of other witnesses regarding the location and placement of the bodies. ( People v. Allen (1986) 42 Cal. 3d 1222, 1256, 232 Cal. Rptr. 849, 729 P.2d 115.) Though the photographs were not actually shown to the jury during the coroner's testimony, they were independently admissible on the issues of identity, intent to kill, deliberation and the torture element of the torture-murder special circumstance. (See, e.g., People v. Cain, supra, 10 Cal. 4th at p. 29 [photographs of victims' wounds relevant to identity, intent to kill, and murder in commission of robbery and rape; People v. Wash (1993) 6 Cal. 4th 215, 245-246, 861 P.2d 1107 [photographs relevant to show deliberation and rape; not cumulative of testimony of crime scene expert and pathologist]; People v. Garceau, supra, 6 Cal. 4th at p. 181 [photographs of victims' wounds relevant to show malice]; People v. Pride (1992) 3 Cal. 4th 195, 243, 833 P.2d 643 [same].) They were also useful in the jury's evaluation of the coroner's testimony ( People v. Cain, supra, 10 Cal. 4th at p. 29), whether or not they were shown to the jury during his testimony. That they may have been somewhat cumulative is not determinative: \"we repeatedly have rejected the argument photographs of a murder victim should be excluded as cumulative if the photographs are offered to prove facts established by testimony.\" (Ibid.) As the photographs were relevant and admissible, their admission in evidence does not support defendant's due process claim. (Ibid.)\n\nC. Preclusion of defense evidence.\n\nDefendant claims a combination of incompetence of counsel, judicial error and prosecutorial misconduct deprived him of crucial defense evidence in violation of his right to due process, a fair trial and a reliable verdict under the Sixth, Eighth and Fourteenth Amendments of the federal Constitution and parallel provisions of the California Constitution. Specifically, he claims that defense witnesses Croffoot and Sandoval would have testified and presented evidence of his intoxication and unconsciousness at the time of the crimes had not incompetence of counsel and prosecutorial intimidation caused them to invoke their privilege against self-incrimination. Once the witnesses invoked the privilege, he claims, the court should have extended judicial immunity to assure defendant a fair trial. Finally, defense counsel should have offered the witnesses' out-of-court statements to a defense investigator, statements defendant claims were admissible under the hearsay exception for statements against penal interest. Defendant also claims that as a matter of due process, the evidence should have been admitted even if it was hearsay. He alleges his defense was severely compromised by the loss of independent evidence of his intoxication, evidence he claims was needed to show he lacked the specific intent necessary to establish first degree murder and burglary felony murder.\n\nWe review the factual background of the claim. The record indicates during the defense case, counsel called witness Sandoval, who began to testify that he had met defendant on the day of the crime. When counsel asked Sandoval whether he had been in possession of a controlled substance, namely cocaine, at the time, the court interrupted and asked whether the witness should be advised of his privilege against self-incrimination. The prosecutor noted that he had some \"additional information\" that should be discussed outside the presence of the jury. Defense counsel offered to ask the witness whether he had counsel with whom he had discussed his testimony.\n\nOutside the presence of the jury, defense counsel stated the witness had been advised by the public defender, and the court asked that the public defender be present. The prosecutor added, \"Your honor, it's also my information, hearsay but my information nonetheless that Mr. Sandoval was convicted on January the 20th of this year of sale of PCP and sentenced to four years in state prison. [P] I don't know if that's true or not. I notice he came in the public door rather than the private door. I don't know if that case is back - \" Defense counsel interjected: \"You know those early parole problems.\" The prosecutor continued: \"I also have a copy of the police report [in] which he is one of the named suspects in a conspiracy to defraud by means of bad checks. At one point it was our belief there was a warrant for his arrest on that and I don't know if there is a warrant in the system now or not.\"\n\nThe court noted that the witness's counsel was unavailable until the following week. The prosecutor suggested: \"Why don't we excuse ourselves, you and Mr. Sandoval have a little chat. It may be that Mr. Sandoval voluntarily can convince you there's no danger of him implicating himself . . . .\" The court accepted the suggestion and spoke with the witness in an in camera session the transcript of which was sealed. After this Discussion, the court ordered the witness to consult with an attorney in the public defender's office and return the following day.\n\nSandoval failed to appear the following day and therefore the court issued a bench warrant for his arrest. The prosecutor asked for a copy of the warrant to enable local police to try to secure Sandoval's appearance in court. Defense counsel accepted the prosecutor's offer of police assistance. Apparently Sandoval failed to appear because he was arrested on an outstanding warrant (not the bench warrant) the day he was to appear.\n\nNext, defense counsel proposed to call Croffoot to testify about being with defendant for part of the evening of the crime and either using narcotics or seeing them being used. The court had expressed some concern that this witness, too, should have independent counsel, and secured counsel for the witness. At an in camera hearing, the court announced that counsel had been procured for Croffoot, noting that he was speaking euphemistically in stating that Counsel Ayers had \"volunteered\" to advise Croffoot. Defendant claims the attorney was dragooned from those waiting in the courtroom, but the record sheds no further light on the subject.\n\nThe following colloquy ensued:\n\n\"The Court: [Mr. Ayers has volunteered to advise Mr. Croffoot] regarding his constitutional rights as he is the next intended witness and he was going to testify as I kind of surmise that he was with Mr. Lucas part of the evening in question and was either using narcotics or saw narcotics being used or something to that nature, without going into it in detail. [P] Have you had a chance to interview him?\n\n\"Mr. Ayers: Yes.\n\n\"Mr. Watson [the prosecutor]: Can I interrupt the court and counsel, and I apologize. I think the record should further reflect I had a chance to talk to Mr. Ayers in the presence of both defense attorneys to impart to him some information about the status of our case, where we are, what's going on. I told him a little about [Sandoval] and then the defense attorneys had a chance to consult with him without me being present, and I didn't tell them one thing that I should tell him, and he may already know it, I don't know.\"\n\nThe prosecutor then informed Croffoot's counsel that evidence received at trial indicated Croffoot may have been with defendant up to half an hour before the crimes. He added: \"there is no evidence more than one person did it, but, you know, that's obviously open to speculation.\"\n\nThe court asked Ayers whether he had consulted with Croffoot, and Ayers responded: \"I have talked to Mr. [Croffoot]. From things he has told me about his personal situation I have advised him to invoke [the privilege against self-incrimination].\"\n\nCroffoot was called to the stand, and outside the presence of the jury, defense counsel asked him whether he had seen Sandoval and defendant on the date of the crime. He refused to answer. He also invoked the privilege as to questions about what he did all that day, and about the use of controlled substances on that day with defendant and Sandoval. He also invoked the privilege as to questions regarding his activities with Sandoval and defendant up to 10 or 11 o'clock on the night of the crime. The court sustained the exercise of the privilege.\n\nDefense counsel moved for a mistrial. Counsel noted that the court had an interview with Sandoval out of counsel's presence, assigned him a new public defender, and that Sandoval had disappeared. Croffoot was on probation for a misdemeanor. Defense counsel argued that these witnesses were critical to the defense, that if a mistrial were declared, Sandoval could be apprehended and Croffoot could finish his probationary period. Counsel also pointed out the prosecutor could grant immunity, and claimed the witnesses were unlikely actually to be prosecuted for material in their testimony.\n\nThe prosecutor responded that the witnesses might incriminate themselves, not for drug charges, but for being accomplices, since an independent witness saw them with defendant near the time of the crime.\n\nThe court found both witnesses had exercised their Fifth Amendment right to remain silent, Sandoval partly by \"footwork.\" The court denied the motion for mistrial, saying defendant would not benefit from any delay because no competent attorney would advise these witnesses to testify, as they apparently were with defendant up until moments before the crime.\n\nThen Sandoval appeared, and outside the presence of the jury, responded to defense counsel's question whether he could answer a series of questions relating to his activities on October 15, 1986, in the company of Croffoot and defendant, and about the use of drugs and \"various other activities\" that day. Sandoval announced that he would refuse to answer on the ground the answers would tend to incriminate him.\n\n1. Defense counsel's questioning.\n\nDefendant claims his counsel were incompetent because they failed to secure the admission of the testimony of witnesses Sandoval and Croffoot regarding defendant's drug use in the hours before the crime. As noted above, these defense witnesses asserted the Fifth Amendment privilege against self-incrimination. Defendant faults counsel for failing to demonstrate to the trial court that the defense could propound specific questions regarding the witnesses' observation of defendant's drug and alcohol use on the day of the crimes that would not have focused on the witness's activities and hence would not have implicated the witnesses' Fifth Amendment rights. Through such a course, he claims, counsel could have secured essential evidence in support of defendant's claim of intoxication and unconsciousness.\n\nDefendant's claim depends on the assumption the court would have required the witnesses to answer questions regarding their observation of defendant's activities. His claim is speculative. He does not state what questions should have been asked, nor can he, on the appellate record, establish what the answers would have been to more specific questions. Moreover, he cannot demonstrate the court would have or should have required the witnesses to answer questions directed to their observations of defendant, as opposed to those directed to the witnesses' own activities. As we explain, the court could reasonably conclude the proposed testimony might tend to incriminate the witnesses.\n\nDefendant's claim depends upon an unduly restrictive view of the privilege against self-incrimination. Witnesses may refuse to answer questions calling for a potential link in a chain of evidence of guilt, as well as questions calling for clear admissions against penal interest. ( People v. Cudjo (1993) 6 Cal. 4th 585, 616, 863 P.2d 635; People v. Ford (1988) 45 Cal. 3d 431, 441, 247 Cal. Rptr. 121, 754 P.2d 168.) Although the court should make a particularized inquiry as to whether or not a claim of privilege is well founded ( Blackburn v. Superior Court (1993) 21 Cal. App. 4th 414, 428), in order to approve invocation of the privilege \"'it need only be evident from the implications of the question, in the setting in which it is asked, that a responsive answer to the question or an explanation of why it cannot be answered might be dangerous because injurious disclosure could result.'\" ( People v. Cudjo, supra, 6 Cal. 4th at p. 617, quoting Hoffman v. United States (1951) 341 U.S. 479, 486, 95 L. Ed. 1118, 71 S. Ct. 814.) Innocent persons, as well as the guilty, are entitled to invoke the privilege. As the high court has declared, \"'the privilege serves to protect the innocent who otherwise might be ensnared by ambiguous circumstances.'\" ( Grunewald v. United States (1957) 353 U.S. 391, 421, 1 L. Ed. 2d 931, 77 S. Ct. 963; see also Ratner, Consequences of Exercising the Privilege Against Self-Incrimination (1957) 24 U.Chi.L.Rev. 472, 472-473.)\n\nFurther, as we have noted, \"our Evidence Code provides that when a witness grounds refusal to testify on the privilege against self-incrimination, a trial court may compel the witness to answer only if it 'clearly appears to the court' that the proposed testimony 'cannot possibly have a tendency to incriminate the person claiming the privilege.' (Evid. Code, § 404.)\" ( People v. Cudjo, supra, 6 Cal. 4th at p. 617.)\n\nHere, defendant proposed to ask the witnesses a series of questions regarding their activities with him on the date of the crime, including their use of controlled substances, their observations regarding his use of controlled substances, and their other activities together with defendant that day. Even if counsel had limited the questions to the witnesses' observations of defendant, we cannot say on this record the court would or should have refused to permit the witnesses to invoke the privilege against self-incrimination. Naturally, any testimony regarding the witnesses' observation of defendant's condition would call for cross-examination directed at the witnesses' opportunity and ability to observe. Such questions would subject the witnesses to the same danger of self-incrimination as the questions of defense counsel of which defendant now complains.\n\nMoreover, the prosecutor made it clear that independent witnesses placed Sandoval and Croffoot with defendant at a time close to the time of the crimes, and placed Croffoot with defendant as little as half an hour before the murders. The prosecutor also explained that the physical evidence did not rule out the possibility that more than one person perpetrated the murders. Thus, not only could any question about the witnesses' observations regarding defendant's drug ingestion provide a link in the chain of evidence establishing their own illegal use of drugs, but, as the prosecutor chillingly pointed out, any testimony useful to establish defendant's state of intoxication near the time of the crime could provide a link in the chain of evidence tending to incriminate the witnesses as accomplices or accessories in a double murder. (See People v. Ford, supra, 45 Cal. 3d at p. 442, fn. 7 [if no alibi defense, witness may invoke privilege regarding association with defendant prior to crime because of risk of inference of aiding and abetting the defendant].) The possibility is at best remote that had defense counsel framed their questions differently, the court would have required the witnesses to answer questions regarding their activities with defendant on the night of the crimes. Nor can we evaluate whether any alleged incompetence was prejudicial, without a record that establishes the answers to such questions.\n\nDefendant's reliance on Brown v. United States (1958) 356 U.S. 148, 2 L. Ed. 2d 589, 78 S. Ct. 622, for the proposition that a witness may testify as to certain matters but may invoke the privilege on cross-examination before the reliability of his testimony has been tested fully, is misplaced. In Brown, the court held that a defendant who took the stand in her own defense could not refuse, on the ground of the privilege against self-incrimination, to answer questions on cross-examination relevant to her testimony on direct examination. The court reasoned that such a witness voluntarily waives the privilege when she volunteers to testify. The high court distinguished a case in which a witness compelled by subpoena to testify in a bankruptcy proceeding was permitted to invoke the privilege for the first time in cross-examination. The court pointed out that in such a case, the witness had no occasion to invoke the privilege until testimony was sought that would tend to incriminate. At that point, the invocation had to be respected, though it would permit the witness to \"withdraw from the cross-fire of interrogation before the reliability of his testimony has been fully tested.\" ( Id. at p. 155.) This observation is inapposite here, where our review of the record indicates that in fact, any question relevant to defendant's defense would present a clear danger of incriminating the witnesses.\n\nThe People argue defense counsel had no obligation to ask specific questions and require the witnesses to invoke the privilege as to each, citing People v. Cornejo (1979) 92 Cal. App. 3d 637, 658-659, 155 Cal. Rptr. 238.) In that case, the Court of Appeal determined the court had no obligation to require the \"meaningless ritual\" of asking a litany of specific questions of a witness who had made it clear he would answer no questions and would invoke the privilege as to any relevant question. In Cornejo, the court had information before it making it plain that the witness's federal parole prohibited him from acting as an informant, but that \"all relevant questions which would have been posed to [the witness] could only have related to his activities as an informant.\" ( Id. at p. 658; see also People v. Hill (1992) 3 Cal. 4th 959, 991, 839 P.2d 984 [no need to conduct meaningless ritual of requiring witness to invoke privilege before jury].) The Cornejo case is of limited relevance, however, because there was no claim, as here, that counsel was ineffective for failing to pursue a certain line of questioning that would not present a danger of incriminating the witness. To the extent it was clear to counsel in this case, however, that the witnesses intended to invoke the privilege as to any question regarding their activities with defendant on the night of the crimes, such a circumstance does undermine defendant's claim that counsel should have put other questions to the witnesses.\n\n2. Prosecutorial misconduct.\n\nThe state and federal Constitutions guarantee the defendant a meaningful opportunity to present a defense. ( Crane v. Kentucky (1986) 476 U.S. 683, 690, 90 L. Ed. 2d 636, 106 S. Ct. 2142; In re Martin (1987) 44 Cal. 3d 1, 30, 241 Cal. Rptr. 263, 744 P.2d 374.) As we have observed, \"[a] defendant's constitutional rights to compel the attendance of witnesses, as guaranteed by the Sixth Amendment, and to due process, as guaranteed by the Fourteenth Amendment, are violated when the prosecution interferes with the defendant's right to present witnesses.\" ( People v. Mincey (1992) 2 Cal. 4th 408, 460, 827 P.2d 388; see also Crane v. Kentucky, supra, 476 U.S. at p. 690; United States v. Lopez-Alvarez (9th Cir. 1992) 970 F.2d 583, 588, fn. 4 [noting confusion whether right to present defense derives from right of confrontation or right of due process].)\n\nDefendant alleges such interference took place in this case. To prevail in such a claim, as we have explained, he must establish three elements. \"First, he must demonstrate prosecutorial misconduct, i.e., conduct that was 'entirely unnecessary to the proper performance of the prosecutor's duties and was of such a nature as to transform a defense witness willing to testify into one unwilling to testify.\" ( In re Williams (1994) 7 Cal. 4th 572, 603, 870 P.2d 1072.) Second, he must establish the prosecutor's misconduct was a substantial cause in depriving the defendant of the witness's testimony. (Ibid.) The defendant, however, \"is not required to prove that the conduct under challenge was the 'direct or exclusive' cause. [Citations.] Rather, he need only show that the conduct was a substantial cause. [Citations.] The misconduct in question may be deemed a substantial cause when, for example, it carries significant coercive force [citation] and is soon followed by the witness's refusal to testify.\" ( In re Martin, supra, 44 Cal. 3d at p. 31.) Finally, the defendant must show the testimony he was unable to present was material to his defense. (44 Cal. 3d at p. 32.)\n\nDefendant claims that through intimidation and threats, the prosecutor transformed Sandoval from a willing witness into one who refused to testify. He points out that when the court first raised the question whether Sandoval should be represented by independent counsel, the prosecutor interjected the assertedly irrelevant information, in Sandoval's presence, that Sandoval had a recent conviction for narcotics violations and was a suspect in another matter involving bad checks and might be subject to an arrest warrant. Defendant claims this amounted to a threat that if the witness should testify for the defense, \"the full force of the People's prosecutorial mechanism\" would be used against him. Defendant also refers to Sandoval's arrest by the Whittier police, without, however, pointing to anything in the record suggesting that the prosecutor had anything to do with the arrest.\n\nThe People counter that defendant waived the issue when he failed to object on the same basis below. (See People v. Benson, supra, 52 Cal. 3d at p. 794 [claim of misconduct waived if no objection, unless harm could not have been cured].) Defendant argues that any failure to object establishes ineffective assistance of counsel. Further, the claim involves a question of fundamental fairness, and any misconduct, had it existed, could not readily have been cured by the trial court's intervention, in contrast to other instances of prosecutorial misconduct in the course of trial. Accordingly, we may reach the merits of the claim. (See, e.g., People v. Hawkins (1995) 10 Cal. 4th 920 at 921, 948-949, 897 P.2d 574; People v. Wash, supra, 6 Cal. 4th at pp. 270-271; People v. Clark (1993) 5 Cal. 4th 950, 1013, 857 P.2d 1099.)\n\nDefendant is unable to carry the first part of his burden, that is, to show that the prosecutor acted improperly. Contrary to defendant's argument, it is clear that the court, not the prosecutor, was the moving force in raising the issue of Sandoval's possible self-incrimination. The court was concerned that Sandoval might incriminate himself by discussing his drug use with defendant; the prosecutor merely offered information relevant to this concern when he said the witness might have a recent narcotics conviction. Any evidence of illegal drug use, of course, could subject such a witness to parole or probation violations. Further, the prosecutor's comments were not threats directed to the witness. (Cf. People v. Warren (1984) 161 Cal. App. 3d 961, 971-976, 207 Cal. Rptr. 912 [threat that witness would be prosecuted for any crimes revealed in testimony]; People v. Robinson (1983) 144 Cal. App. 3d 962, 970, 193 Cal. Rptr. 92 [threat that charges will be filed]; United States v. Hammond (5th Cir. 1979) 598 F.2d 1008, 1012-1013 [threat of \"untoward consequences\" if witnesses testified].) Nor is there any evidence the witness was arrested in connection with this case or that his arrest on an unrelated warrant was engineered by the prosecutor, or indeed, that the prosecutor even knew about it. Thus the case is not like In re Martin, supra, 44 Cal. 3d 1, in which we said the prosecutor acted improperly causing a defense witness to be arrested as he left the stand, in an evident effort to intimidate him and prevent further testimony. (44 Cal. 3d at p. 35.) In sum, as the prosecutor's comments evidently responded to a concern of the court's, we see no indication on this record the prosecutor engaged in conduct \"wholly unnecessary to the proper performance of [his] duties and of such a character as 'to transform [the witness] from a willing witness into one who would refuse to testify.'\" (44 Cal. 3d at p. 31.)\n\nSimilarly, with respect to witness Croffoot, it was the court that initiated inquiry into his exercise of the privilege against self-incrimination and insisted that he consult independent counsel on the point. The prosecutor did not address the witness or threaten prosecution, but merely pointed out to the witness's counsel the rather obvious point that although there was no evidence that more than one person was involved in the crime, a witness who testified he was with the defendant up to half an hour before the crime could not be ruled out absolutely as an accomplice. As the court later said, no competent attorney would have advised either witness to testify. Again, we see no evidence the prosecutor acted improperly.\n\nIn any event, whether or not it was proper for the prosecutor to point out in front of the witness that the latter could not be ruled out as an accomplice under the facts of the case, it is clear that the prosecutor's comment was not a substantial cause of the witness's decision to refuse to testify. Rather, the record demonstrates that before the prosecutor made the allegedly coercive statement, Croffoot's counsel had already advised Croffoot to invoke his privilege against self-incrimination because of information Croffoot related about his \"personal situation.\"\n\nDefendant also claims the prosecutor committed misconduct in willfully mischaracterizing the evidence, causing Croffoot and Sandoval to refuse to testify. Specifically, defendant claims the prosecutor argued to the court that an unidentified fingerprint at the scene of the murders might belong to Sandoval or Croffoot, whereas in opening statement he had already told the jury there was no evidence that anyone besides defendant was present during the crimes.\n\nThe statement occurred in the prosecutor's argument to the court against the defendant's alternative motions for a grant of immunity to Croffoot and Sandoval for possible drug offenses or a mistrial. The court had already determined the witnesses would be permitted to invoke their privilege against self-incrimination when the prosecutor made the statement defendant complains of, so it is difficult to see how the statement can have caused the witnesses to become unavailable. Further, the prosecutor's point to the court was that immunity for drug offenses would not suffice to secure the witnesses' testimony because they might face liability as accomplices to the murder. He correctly argued that although there was no evidence of their participation, they could not be ruled out as participants. We see no mischaracterization of the evidence. Further, the court had heard the prosecution evidence and was quite capable of evaluating it.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nDefendant may be understood to argue the prosecutor's refusal to grant Sandoval or Croffoot immunity for murder charges was also misconduct, as it was allegedly unconscionable and interfered with defendant's right to present a defense. As we have observed, the defendant has no power to force the prosecution to grant immunity to defense witnesses. ( In re Williams, supra, 7 Cal. 4th at p. 609.) In any event, defendant did not request such immunity below, but only requested that the prosecutor offer immunity for any drug charges arising from the witnesses' testimony. The issue is not preserved for review. ( People v. Cudjo, supra, 6 Cal. 4th 585, 619 [barring issue and noting lack of authority requiring prosecutor to offer immunity to defense witnesses].) No claim of ineffective assistance of counsel appears in this connection.\n\n3. Failure to grant judicial immunity.\n\nDefendant argues the trial court should have extended judicial immunity to Croffoot and Sandoval for any potential drug offenses in order to vindicate defendant's right to present a defense. He argues the issue was preserved below because defendant requested that the prosecutor immunize Sandoval and Croffoot for any liability for drug offenses in order to secure their testimony.\n\nHere, defendant did not request judicial immunity in the trial court. He failed to direct the court's attention to any authority in support of such immunity, and he did not attempt to meet the standards expressed in the one federal case recognizing such judicial power. ( Government of Virgin Islands v. Smith (3d Cir. 1980) 615 F.2d 964, 972 (Smith).) We conclude he waived the claim. ( People v. Cudjo, supra, 6 Cal. 4th at p. 619 [failure to request immunity from either prosecutor or court waives issue on appeal].)\n\nFurther, even if the issue were preserved for appeal, we have pointed out that \"the vast majority of cases, in this state and in other jurisdictions, reject the notion that a trial court has 'inherent power' to confer immunity on a witness called by the defense.\" ( In re Williams, supra, 7 Cal. 4th at p. 610.) The one jurisdiction that recognizes such a power, we have observed, also recognizes that \"'the opportunities for judicial use of this immunity power must be clearly limited; . . . the proffered testimony must be clearly exculpatory; the testimony must be essential; and there must be no strong governmental interests which countervail against a grant of immunity . . . . [P] The defendant must make a convincing showing sufficient to satisfy the court that the testimony which will be forthcoming is both clearly exculpatory and essential to the defendant's case. Immunity will be denied if the proffered testimony is found to be ambiguous, not clearly exculpatory, cumulative or it is found to relate only to the credibility of the government's witnesses.'\" ( People v. Hunter (1989) 49 Cal. 3d 957, 974, 264 Cal. Rptr. 367, 782 P.2d 608, quoting Smith, supra, 615 F.2d at p. 972.)\n\nIn several recent cases in which this claim has been raised, we have found the defendant failed to meet the stringent offer of proof requirements of the Smith case, even assuming arguendo the doubtful proposition that the trial court has inherent authority to grant immunity. (See, e.g., In re Williams, supra, 7 Cal. 4th at p. 610; People v. Cudjo, supra, 6 Cal. 4th at p. 619; People v. Hunter, supra, 49 Cal. 3d at p. 974.) Again, we conclude defendant did not meet the stringent standards of Smith, supra, 615 F.2d 964. Although he asserted that the witnesses would provide crucial exculpatory evidence and made an offer of proof regarding their testimony, it seems evident that immunity for drug offenses would not have sufficed to procure the testimony of Sandoval and Croffoot, who faced a danger their testimony might lead to charges of accomplice liability for the murders of which defendant stood accused. As the prosecutor declared in arguing that a grant of immunity for drug offenses would not procure the witnesses' testimony: \"It's not the theory of our case they were involved but I cannot exclude that. I might grant one of these people immunity [for murder] or both and they might say, 'I did it, thanks for the immunity, Mr. Watson, I appreciate it, I wanted to get off these charges and you've done it for me,' so that's never going to happen. The final judgment would not be mine, but even with the people that run my office I can't believe them making a decision that stupid. . . . \"\n\nFurther, defendant cannot meet another element of the Smith standard, that is, \"there must be no strong governmental interests which countervail against a grant of immunity.\" ( Smith, supra, 615 F.2d at p. 972, fn. omitted.) Obviously, as the prosecutor stated, it was contrary to the People's interest to grant immunity to one potentially involved in a double murder. Defendant failed below, and fails now, to show that immunity for any drug offenses would have been effective in procuring the testimony of the witnesses, or that any broader grant of immunity would not have countervailed a strong governmental interest in the prosecution of serious crimes such as murder. Accordingly, assuming arguendo that the issue was preserved and that there is any judicial authority to grant immunity, we reject the claim.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\n4. Exclusion of defense investigator's testimony.\n\nDefense counsel asked to call Lupori, the defense investigator, to testify as to what Sandoval and Croffoot told Lupori about their activities with defendant on the day of the crimes, claiming the constitutional guarantee of due process required the application of an exception to the hearsay rule. Defendant's offer of proof was that the investigator would testify that Croffoot and Sandoval stated they were continuously with defendant on the day of the crimes, ingesting drugs. The court sustained the prosecutor's hearsay objection to Lupori's testimony, also rejecting defendant's claim that the evidence was admissible despite the hearsay rule as a matter of due process. After trial, defendant moved for a new trial in part on the ground that Lupori's testimony was admissible because Croffoot and Sandoval's statements to Lupori were admissible as statements against penal interest under Evidence Code section 1230.\n\nOn appeal, defendant argues Lupori's testimony was admissible because Croffoot and Sandoval's statements were admissible under Evidence Code section 1230. He also argues the testimony should have been admitted as a matter of due process, citing Chambers v. Mississippi (1973) 410 U.S. 284, 35 L. Ed. 2d 297, 93 S. Ct. 1038. He claims that trial counsel's argument that the testimony was admissible as a matter of due process preserved the claim the testimony was admissible under the hearsay exception for statements against penal interest. (Evid. Code § 1230.) Alternatively, he argues counsel's failure to offer the proper hearsay exception violated his right to the effective assistance of counsel.\n\nEvidence Code section 1230 provides that the out-of-court declaration of an unavailable witness may be admitted for its truth if the statement, when made, was against the declarant's penal interest. The proponent of such evidence must show \"that the declarant is unavailable, that the declaration was against the declarant's penal interest, and that the declaration was sufficiently reliable to warrant admission despite its hearsay character.\" ( People v. Cudjo, supra, 6 Cal. 4th 585, 607.) A trial court determining whether the proffered evidence is sufficiently reliable \"' may take into account not just the words but the circumstances under which they were uttered, the possible motivation of the declarant, and the declarant's relationship to the defendant.'\" (Ibid.)\n\nWe conclude the claim of error under Evidence Code section 1230 was waived. Defense counsel's failure to proffer the evidence under that section deprived the trial court of the opportunity to perform this determination. The claim that the evidence must be admitted as a matter of due process is distinct, and did not serve to preserve the issue. (Cf. People v. Fauber (1992) 2 Cal. 4th 792, 854, 831 P.2d 249 [counsel's offer of evidence for impeachment did not preserve claim evidence was admissible to show state of mind].) Counsel's argument on the motion for new trial that the court had erred under Evidence Code section 1230 in excluding the evidence came too late; in any event, we see no abuse of discretion in the trial court's refusal to grant a new trial on this ground. The court could reasonably conclude that any error in excluding the evidence was not prejudicial, as we shall explain below in connection with the claim of ineffective assistance of counsel. (See People v. Clair (1992) 2 Cal. 4th 629, 667-668, 828 P.2d 705 [trial court ruling on motion for new trial subject to review for abuse of discretion; court may grant motion when prejudicial error in admission of evidence has occurred]; see also 6 Witkin \u0026 Epstein, Cal. Criminal Law (2d ed. 1989) Judgment and Attack in Trial Court, § 3055, pp. 3779-3780.)\n\nWith respect to the claim of ineffective assistance of counsel, we cannot say on the appellate record that defendant would or should have prevailed had he offered the testimony as a statement against penal interest, as nothing on the record indicates the trustworthiness or reliability of the witnesses' statements to Lupori. Secondly, assuming the evidence was admissible as a statement against penal interest, defendant fails to demonstrate the loss of that evidence was prejudicial at the guilt trial.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Defendant's offer of proof merely stated the two witnesses would testify they had been with defendant for much of the day of the crimes, using illicit drugs. Another defense witness, however, namely defendant's employer, testified that he saw defendant within an hour of the crimes, and he appeared very much under the influence of drugs. The circumstances of defendant's arrest for possession of cocaine were introduced, and tended to show through the characteristic scarring of his arms that defendant was an habitual drug abuser. Thus Croffoot and Sandoval's statements to the investigator were cumulative to the extent they would have shown that defendant had used drugs before the crimes and was under the influence of drugs shortly before the crimes. Defendant's claim that they would have provided crucial support for his unconsciousness defense is unfounded; the offer of proof did not suggest either prospective witness would testify that defendant was unconscious or near to unconsciousness close to the time of the crimes.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nDefendant now claims Croffoot and Sandoval's statements to Lupori would have shown the vast amount of drugs defendant absorbed in the day before the crime, and would also have shown how extremely impaired defendant was by this overindulgence. Defendant did not include in his offer of proof to the court, either when the evidence was offered or when the motion for new trial was made, the material he cites now. This material consists of an unsworn memorandum by defense counsel, apparently addressed to the prosecutor, relating what the defense investigator told counsel that Sandoval and Croffoot had told the investigator. We cannot rely on unverified hearsay that was never offered on the record at trial as an appropriate or reliable basis for evaluating on direct appeal whether any error on the part of counsel in failing to secure the admission of Lupori's testimony was prejudicial. In any event, this material does not suggest that either Sandoval or Croffoot stated that defendant was nearing unconsciousness; on the contrary, it demonstrates a great deal of purposeful activity on defendant's part and could even show motive for the felony murders, as it indicates defendant obtained his drugs on credit upon an agreement to pay for them the next day.\n\nWe also reject defendant's argument that the trial court erred in refusing to permit Lupori's testimony regarding statements made to him by Croffoot and Sandoval under the authority of Chambers v. Mississippi, supra, 410 U.S. 284. In that case the trial court excluded defense evidence relating to a witness's out-of-court confessions because Mississippi law excluded hearsay without any exception for statements against penal interest. State law also precluded cross-examination of non-adverse witnesses, so defendant was unable to cross-examine the witness regarding his prior confession when the witness denied complicity on the stand. The high court explained that evidence of the out-of-court confessions was critical to the defense but was excluded despite overwhelming indicia of reliability. (410 U.S. at pp. 302-303.) It declared that the exclusion of this evidence, along with limitations on the defendant's ability to cross-examine the witness, were a denial of due process in that they deprived defendant of the right to present a defense. (410 U.S. at pp. 294, 297-298, 302; see also People v. Hawthorne (1992) 4 Cal. 4th 43, 56, 841 P.2d 118 [interpreting Chambers as holding, in particular circumstances of case, that combined effect of state rules of evidence violated defendant's right to present defense by \"excluding potentially exculpatory evidence crucial to the defense.\"].)\n\nDefendant asks us to hold that the application of the general rule excluding hearsay evidence amounted to a denial of due process in his case. We have observed that: \"'as a general matter, the ordinary rules of evidence do not impermissibly infringe on the accused's right to present a defense.'\" ( People v. Hawthorne, supra, 4 Cal. 4th at p. 58.) Defendant does not point to a rule of evidence peculiar to California jurisprudence, nor one that is considered archaic or otherwise subject to scholarly criticism. (Cf. Chambers v. Mississippi, supra, 410 U.S. at pp. 296, fn. 8, 300; People v. Hawthorne, supra, 4 Cal. 4th at p. 57, and cases cited.) Moreover, defendant did not demonstrate at trial that application of the general rule excluding hearsay would deprive him of crucial evidence bearing persuasive assurances of trustworthiness. As we have noted, other evidence was available to defendant to show that he was under the influence of drugs on the day of the murder. Moreover, he did not allege that Sandoval or Croffoot was with him at the time of the crimes, so their ability to describe his state of intoxication or possible unconsciousness at the relevant period was limited. Nor was there evidence before the court establishing the trustworthiness of the declarants' statements to Lupori - in fact nothing in defendant's offer of proof described the circumstances under which they had made their statements. Accordingly, we see no violation of defendant's due process rights as established by Chambers v. Mississippi, supra, 410 U.S. 284.\n\nD. Admission of evidence of condition of defendant's car.\n\nDefendant contends the trial court erred in permitting the prosecutor to cross-examine defendant on an irrelevant matter, namely the condition of his car before and after his arrest.\n\nDefendant testified that as he was somewhat estranged from his wife and family because of his drug abuse, he lived periodically in his car. He testified that on the night of the crimes, he passed out and recalled being in a hall where he was pursued by long faces he thought looked like \"fright masks.\" He struck out at the faces, then ran off. He next vaguely remembered driving, then woke up in his car which was then parked at the beach. His hand was stuck to the seat with blood, but there was no other blood on his person.\n\nOn cross-examination, defendant testified his car was messy. He explained he believed his car had been impounded, but that it had been found far from the beach. He had no idea how it got there. He had heard that when the car was recovered, it was completely clean, and had nothing in it. When the prosecutor asked how this occurred, defense counsel objected on the ground of lack of foundation. The court did not rule on the objection but asked defendant if he knew how the car got moved and cleaned, and defendant said he had no idea. Defendant identified photographs of the car. Defense counsel objected at the bench \"to this entire line of questioning, particularly the photographs, and apparently there is in [the prosecutor's] mind some way of laying a foundation for it, but apparently this is the car that was taken after he was arrested and found some miles away some days away [sic], and his cross-examination is seeking to hold him responsible for it in some fashion. [P] I object to this whole line of questioning and the photographs.\" The court asked the prosecutor: \"Without any further foundation how is it relevant?. . . You have basically a car that's being introduced that's been cleaned by somebody.\" The prosecutor explained that although the car looked lived in when defendant was arrested, \"It's my opinion out of guilty knowledge of what he did he called from the Orange County Jail to somebody, told them where the car was, told them to go get it and clean it up and that's what happened. . . . I think I can argue that circumstance.\" Defense counsel countered that the prosecutor was merely speculating. The court overruled the objection. The prosecutor asked defendant whether he called somebody up and asked them to move the car and clean it up because it might link him to the killings. Defendant denied doing so. Defense counsel began to object, but was cut off by the court, which told him to \"just sit down.\" Counsel again objected to the entire line of questioning. Evidently the prosecutor was finished; no further questions on the subject were forthcoming.\n\nThe People contend defendant cannot now claim the court erroneously admitted irrelevant evidence because defendant objected to the line of questioning on the ground of lack of foundation, not irrelevance. As we have noted, however, the trial court evidently understood the objection as encompassing a relevancy claim, so we will reach the merits.\n\nOf course, only relevant evidence is admissible. (Evid. Code, § 350.) Sometimes the relevance of evidence depends on the existence of a preliminary fact. (Evid. Code § 403, subd. (a); 3 Witkin, Cal. Evidence (3d ed. 1986) § 1718, p. 1677; see, e.g., People v. Collins (1975) 44 Cal. App. 3d 617, 118 Cal. Rptr. 864 [identity of person who made threatening telephone call to witness is preliminary fact proponent of offered testimony has burden of establishing before fact of phone call is relevant].) The court should exclude the proffered evidence only if the \"showing of preliminary facts is too weak to support a favorable determination by the jury.\" (3 Witkin, Cal. Evidence, supra, § 1716, p. 1675; see Evid. Code, § 403, subd. (a); People v. Simon (1986) 184 Cal. App. 3d 125, 131, 228 Cal. Rptr. 855.) The decision whether the foundational evidence is sufficiently substantial is a matter within the court's discretion. ( Alvarado v. Anderson (1959) 175 Cal. App. 2d 166, 178, 346 P.2d 73; see also People v. Rowland (1992) 4 Cal. 4th 238, 264, 841 P.2d 897 [admission of evidence challenged on relevancy grounds reviewed for abuse of discretion].)\n\nThe trial court has the preliminary but not the final authority to determine the question of existence of the preliminary fact. Unlike in other situations (see, e.g., People v. Alcala (1992) 4 Cal. 4th 742, 787, 842 P.2d 1192 [preliminary fact of competence of witness question for court under Evidence Code sections 402 and 405]), under Evidence Code section 403, \"the preliminary fact questions listed in subdivision (a) [of Evidence Code section 403] . . . are not finally decided by the Judge because they have been traditionally regarded as jury questions. The questions involve the credibility of testimony or the probative value of evidence that is admitted on the ultimate issues. It is the jury's function to determine the effect and value of the evidence addressed to it. . . . The Judge's function on questions of this sort is merely to determine whether there is evidence sufficient to permit a jury to decide the question. The 'question of admissibility . . . merges imperceptibly into the weight of the evidence, if admitted.'\" (Legis. committee com., 29B, pt.1 West's Ann. Evid. Code (1995 ed.) foll. § 403, p. 361.)\n\nIn the present case, the prosecutor was entitled to show, if he could, that defendant's testimony at trial that he was unconscious and had no recollection of the crimes was not credible. Accordingly, if the prosecutor had evidence that defendant actually had some guilty knowledge or recollection of the crimes, he would be entitled to present it. Evidence that defendant arranged to have his car, which the trial evidence indicated could well contain bloody evidence of the crimes, moved and cleaned before the police could inspect it, would tend to prove such guilty knowledge. The prosecutor had several potentially incriminating facts: defendant periodically lived in his car and it was messy when he was arrested; by defendant's testimony he left the scene of his \"fright mask\" nightmare in his car; the crime was a bloody one; and the car disappeared after defendant's arrest and was very clean when it was discovered. In order for the first and last of these facts to be relevant to show defendant's guilty knowledge, the prosecutor needed to present some evidence of a preliminary fact, that is, that defendant was responsible for the removal and cleaning of the car. Thus, as long as he had a good faith belief in the existence of the preliminary fact (see People v. Warren (1988) 45 Cal. 3d 471, 480, 247 Cal. Rptr. 172, 754 P.2d 218 [improper for prosecutor to ask questions of witness suggesting facts harmful to defendant, absent good faith belief such facts exist]), the prosecutor was entitled to ask defendant this question in an attempt to establish a foundation for the relevance of the other evidence to defendant's guilty knowledge. (Evid. Code, § 403, subd. (a).) He was unable to establish this foundation through an admission from the defendant, but he was entitled to try.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nDefendant denied causing the car to be moved and cleaned, however, and no other evidence was forthcoming to establish the preliminary fact of his involvement. Unless the court concluded the jury could find it was more likely that defendant, who presumably had the keys, was responsible for having the car moved and cleaned, than that a car thief did so, the court probably should have instructed the jury to disregard the proffered evidence regarding the condition of defendant's car. (Evid. Code, § 403, subd. (c)(2) [duty to instruct jury to disregard evidence when court determines jury could not find existence of preliminary fact]), see also LeGrand v. Yellow Cab Co. of San Gabriel Valley (1970) 8 Cal. App. 3d 125, 87 Cal. Rptr. 292 [witness's denial of knowledge defeats proponent's claim of preliminary fact of knowledge].) No such instruction was given here. Nonetheless, we see no reasonable probability of prejudice to defendant. We conclude the jury was able to determine the weight - if any - to be accorded to the proffered evidence. The very irrelevance of the evidence that the car was moved and cleaned, without proof or even evidence of the preliminary fact that it was defendant who arranged for this activity, militates against finding this error prejudicial. This was not inherently prejudicial evidence, the admission of which may require reversal. (Compare People v. Simon, supra, 184 Cal. App. 3d at pp. 130-132 [prejudicial error to admit evidence of prior similar crime to show motive in charged crime without proof of preliminary fact of motive involved in first crime].)\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e We conclude any error was harmless. ( People v. Watson (1956) 46 Cal. 2d 818, 836, 299 P.2d 243.)\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nE. Claims of instructional error.\n\n1. Unconsciousness.\n\nDefendant claims the trial court erred prejudicially by misstating the unconsciousness instruction. (CALJIC No. 4.30.) The pattern instruction states in relevant part: \"Evidence has been received which may tend to show that the defendant was unconscious at the time and place of the commission of the alleged offense for which he is here on trial. If, after a consideration of all the evidence you have a reasonable doubt that the defendant was conscious at the time the crime was committed, he must be found to be unconscious.\"\n\nDefendant points out that the original reporter's transcript of the court's delivery of the jury instructions reflects that the court interjected the word \"No\" at the beginning of the instruction, so that it appeared the jury was instructed that no evidence of unconsciousness had been presented. An instruction that no evidence of unconsciousness had been presented would be in error, of course, given defendant's testimony.\n\nThe People claimed the reporter's transcript was in error, and we remanded the matter to the trial court for a hearing on a motion to correct the record. At that hearing, the court reporter testified she could tell she had accidentally hit the \"no\" key, that the word \"no\" did not appear in her notes, and that the computer transcription device detected the faint lettering and transcribed the word \"no.\" The trial court granted defendant's request a continuance for an opportunity to obtain a court reporter of his choosing to review the original court reporter's transcript, and to consider producing other evidence. When the time elapsed for this review, defendant asked the court to defer ruling \"in order to give defendant a chance to first explore and then present all relevant evidence regarding what was actually said to the jury during your honor's unconsciousness instruction.\" The court denied the motion, observing that defendant had had his opportunity to present evidence and that \"this is the time and place for the hearing.\" The court determined that the original transcript was in error and ordered the word \"no\" stricken from the record. It based its decision upon the court reporter's testimony, as well as on the clerk's transcript, which contained a correct copy of the instruction initialed by the court.\n\nDefendant contends that the People's motion to correct the record was untimely, that the trial court based its ruling on a misunderstanding of the court reporter's testimony and that we should remand the matter for a full evidentiary hearing.\n\nIt is true that the People's motion was untimely under rules 39.5(d) and 35(c) of the California Rules of Court, governing motions to correct the record on appeal. Sufficient justification for relief from default existed, however, as the error consisted of the omission of a single word in a transcript of thousands of pages, and would only be noticed by the People after the defendant raised the matter in his opening brief. Further, defendant does not show how this tardy application to correct the record prejudices him or denies him the right to an effective appeal. Contrary to defendant's contention, the court reporter was confident, despite the passage of time, simply from a review of the physical appearance of her original notes, that her finger had mistakenly brushed the key on her machine for the word \"no\" during the giving of the relevant instruction. She was certain that the computer that transcribed her notes mistakenly entered the word, although it was obvious she had not intentionally stricken the key. She explained that her notes, and indeed, any s, were filled with these \"shadow\" keystrokes, which usually but not always are corrected when the reporter proofreads the computer transcription. The reporter was absolutely confident there was an error in the transcription, and that the court did not utter the word \"no.\"\n\nWe see no indication the trial court misunderstood the reporter's testimony at the hearing on the correction of the record. We also see no basis for the claim that a further evidentiary hearing was needed. Defense counsel stated that within the seven-day continuance allowed by the court, he would either file further evidence for the court's consideration in declaration form or advise the court no further evidence was forthcoming. Defense counsel then informed the court by letter that a further hearing \"'would not be productive.'\" Without explanation, counsel asked, nonetheless, for a full hearing to \"explore and then present all relevant evidence regarding what was actually said to the jury during your honor's unconsciousness instruction.\"\n\nWe see no abuse of discretion in denying the request for further continuance. The court continued the matter once to give defendant an opportunity to gather evidence. He failed to do so, and though he asked for a full hearing, failed to explain what further evidence was needed or why it would be forthcoming only after further continuance.\n\nWe conclude the record demonstrates that the court did not misinstruct the jury with respect to the defense of unconsciousness.\n\n2. Flight instruction.\n\nDefendant claims the court erred in instructing on flight pursuant to CALJIC No. 2.52. In addition, he claims the prosecutor induced the court to commit this error by mischaracterizing the evidence of defendant's flight.\n\nCALJIC No. 2.52 informed the jury that \"the flight of a person immediately after the commission of a crime, or after he is accused of a crime, is not sufficient in itself to establish his guilt, but is a fact which, if proved, may be considered by you in the light of all other proved facts in deciding the question of his guilt or innocence. The weight to which such circumstance is entitled is a matter for the jury to determine.\"\n\nWe have observed that \"[a] flight instruction is proper whenever evidence of the circumstances of defendant's departure from the crime scene or his usual environs, . . . logically permits an inference that his movement was motivated by guilty knowledge.\" ( People v. Turner (1990) 50 Cal. 3d 668, 694, 268 Cal. Rptr. 706, 789 P.2d 887.) Here, defendant's testimony itself suggested he fled in panic from the scene, though he claimed he fled from what he assumed were nightmare visions. There was evidence he was away from his home for several days after the crime. In addition, the evidence of the bloody jeans and boxer shorts found in his home could support the inference he left home with guilty knowledge. Finally, his employer's testimony that he had instructed defendant to be ready for work on October 16, but that when he called defendant's home on the morning of October 16, defendant's wife said he had not been home, suggested defendant had departed from his usual environs. Sufficient evidence of flight existed to warrant the giving of the disputed instruction.\n\nDefendant's claim that his departure belonged to a pattern of drug binges and was not occasioned by guilty knowledge merely suggests an alternative interpretation of the evidence. There was sufficient evidence, nonetheless, from which a jury could infer he fled out of guilty knowledge. The instruction properly left it to the jury to determine which inference was more reasonable.\n\nDefendant claims the prosecutor misled the trial court on the question whether it should deliver the flight instruction by claiming the instruction should be given because defendant's employer testified that defendant was \"home every night all the time but didn't come home the night of the killings and wasn't there the following morning.\" The claim of prosecutorial misconduct was not raised below and was therefore waived. ( People v. Rowland, supra, 4 Cal. 4th at pp. 274-275.) Defendant claims counsel's failure to object was ineffective assistance of counsel. We disagree. The court was quite capable of considering the evidence in support of the instruction itself, and in fact, was not convinced by the prosecutor's allegation, but reserved its ruling on the propriety of the instruction. When the matter came up again, the prosecutor claimed the instruction was appropriate, relying on evidence of the bloody pants in defendant's home, and on the testimony of employer Perez that defendant was regularly employed on October 15 but did not check in for work on the 16th, that when Perez called defendant's home, he found defendant had not spent the night at home and that defendant did not reappear for work. This was not a mischaracterization of the record.\n\nF. Alleged prosecutorial misconduct in closing argument.\n\nDefendant claims the prosecutor committed misconduct in mischaracterizing the serological evidence in closing argument. We first review the factual background of the claim.\n\nThe prosecutor's criminalist analyzed the genetic make up of enzymes and proteins in blood samples he received from Edwin and Mary Marriott and from defendant. He testified that only .000099 percent of the population have genetic markers like Edwin Marriott, while .00042 have genetic markers consistent with Mary Marriott's. He testified that .000047 percent of the population have blood with genetic markers consistent with defendant's. The expert analyzed bloodstains found at the scene of the crime, and testified that blood on a paper towel and shirt, and in the victim's bathroom and kitchen, was consistent with defendant's blood but could not belong to either victim. The expert also analyzed the pair of jeans and boxer shorts seized from defendant's home and concluded the bloodstain on the jeans could have been defendant's but could not have belonged to either victim. The expert stated the defendant was one of .000047 percent of the population who could have left the bloodstain. The bloodstains on the underwear, on the other hand, could have originated from Edwin Marriott but did not originate with the defendant or Mary Marriott.\n\nOn cross-examination, the expert testified that not all the relevant genetic markers were present in the bloodstains on the jeans and boxer shorts. Accordingly, he could only say that the blood on the jeans could have been contributed by 900,000 persons out of the Los Angeles population of 8 million - including defendant. Similarly, because some of the genetic markers could not be ascertained as to the blood on the boxer shorts, the expert could only say that the blood could have been left by anyone in half the population of Los Angeles - including Edwin Marriott. He could not testify that the blood on the jeans belonged to defendant.\n\nOn redirect, the expert said in none of his analyses of the items found at the crime scene did he find any indication there was a fourth donor of blood. If it were assumed that only Edwin and Mary Marriott and defendant bled on the items analyzed, he testified that only defendant could have bled on the jeans and only Edwin Marriott could have bled on the boxer shorts. On recross-examination, the expert said that he had no basis for assuming only three people contributed the blood \"specimens,\" and that he did not collect the jeans and boxer shorts from the scene.\n\nDefendant complains the prosecutor mischaracterized the evidence by asserting in closing argument that it was certain who bled on the articles recovered from the Marriott and Lucas homes and who bled in certain places within the Marriott home. He claims the prosecutor misled the jury about the statistical significance of the serological evidence, mischaracterizing his own expert's testimony. Specifically, he points to the prosecutor's argument that the serological evidence proved that the \"paper towel had Mr. Lucas['s] blood on it, for sure a hundred percent\" and that \"the blood on the plaid shirt hanging in the closet is the defendant's\" and \"the blood in the bathroom where he washed his hands . . . and the blood in the kitchen . . . Larry Lucas'[s] blood.\" Defendant also complains that the prosecutor said: \"the blood on the blue jeans, Larry Lucas'[s] blood; the blood on the underwear, Edwin Marriott's blood, and \"he washes his hands in the sink and leaves his own blood there which is what the serologist told you,\" and \"he exits and leaves droplets of blood, boom, boom, boom across that kitchen [P] Why the droplets? It's his hand at his side as he's walking out dripping blood because he has cut himself. The blood samples were taken up,\" and \"how did Edwin Marriott's blood come to be on these undershorts?\"\n\nDefendant also complains that the prosecutor based the above arguments on the erroneous assumption that only three persons were present and contributed the bloodstains, arguing that the jury was \"bound by the evidence, and the only evidence you've heard is that blood came from Edwin Marriott, blood came from Mary Marriott, and blood came from the defendant when he cut his hands. That's it. There's no evidence first of all that anybody else was even present, but if there was anybody else present there's no evidence that anybody else bled. The serologist said he saw no blood samples suggesting that there was a fourth type of blood, so you only have three to pick from.\"\n\nDefendant acknowledges that he failed to object to the prosecutor's argument at trial (see People v. Hardy (1992) 2 Cal. 4th 86, 171, 825 P.2d 781 [failure to object to misconduct generally waives claim]), but argues that his failure to object should not operate as a waiver of the claim because the harm could not have been cured by a prompt objection and admonition to the jury. (See People v. Ledesma, supra, 43 Cal. 3d at pp. 240-2411 [recognizing exception to waiver rule]; People v. Carrera (1989) 49 Cal. 3d 291, 320, 261 Cal. Rptr. 348, 777 P.2d 121 [same]; see also People v. Benson, supra, 52 Cal. 3d at p. 794 [same].) In addition, he argues that the asserted misrepresentation of the serological evidence \"'so infected the trial with unfairness as to make the resulting conviction a denial of due process.'\" ( Darden v. Wainwright (1986) 477 U.S. 168, 181, 91 L. Ed. 2d 144, 106 S. Ct. 2464.) In the alternative, he asserts the failure to object was ineffective assistance of counsel.\n\nWe see no reason why a prompt objection and admonition could not have cured the asserted harm of these remarks. (See People v. Wharton, supra, 53 Cal. 3d at p. 566; People v. Kaurish, supra, 52 Cal. 3d at p. 677.) The claim is waived.\n\nIn any event, we see no misconduct. Prosecutors have wide latitude to discuss and draw inferences from the evidence at trial. ( People v. Kaurish, supra, 52 Cal. 3d at p. 567; see also People v. Bell (1989) 49 Cal. 3d 502, 538, 262 Cal. Rptr. 1, 778 P.2d 129.) We find it obvious that the prosecutor was engaged in asking the jury to draw permissible inferences from the evidence. (See, e.g., People v. Raley (1992) 2 Cal. 4th 870, 917, 830 P.2d 712; People v. Edwards (1991) 54 Cal. 3d 787, 839, 819 P.2d 436; People v. Wharton, supra, 53 Cal. 3d at p. 592.) The expert testified that the blood on the shirt, the paper towel and in the bathroom and kitchen in the victim's home were consistent with defendant's blood and inconsistent with the blood of the victims, and that a minuscule portion of the population would have genetic markers matching those in defendant's blood. The expert was somewhat inconsistent about how many unique markers were found on the bloodstain on the jeans, but the prosecutor did not mischaracterize this evidence. He argued that assuming that the only three blood donors were defendant and the victims, it was certain the blood on the jeans belonged to defendant. It was not a misstatement of the evidence to point out the uniqueness of Edwin Marriott's genetic markers. And contrary to defendant's argument, the prosecutor was entitled to argue that it was a reasonable assumption that only three persons bled at the scene of the crime, given the lack of serological evidence suggesting any fourth person was present. ( People v. Kaurish, supra, 52 Cal. 3d at p. 680 [prosecutor entitled to comment on lack of defense serological evidence].) He was entitled to argue that given that assumption, the blood on the jeans the prosecutor asserted were worn during the crime could only be defendant's and the blood on the boxer shorts could only be that of Edwin Marriott.\n\nWhether the inferences drawn by the prosecutor were reasonable was a question for the jury to decide. ( People v. Edwards, supra, 54 Cal. 3d at p. 839.) The jury was able to evaluate whether the absence of evidence that others were present and bled at the scene demonstrated to their satisfaction that no one else actually was present and bled, or whether additional blood could have been deposited on the items while they were in defendant's home. Further, the jury was instructed that the attorneys' arguments were not evidence (see People v. Raley, supra, 2 Cal. 4th at p. 917 [pointing to this instruction in rejecting claim prosecutor mischaracterized evidence]), and that it was for the jury to decide whether facts assumed in hypothetical questions to experts have been proven. In sum, we find no misconduct, and therefore reject defendant's constitutional and state law claims.\n\nDefendant also claims the prosecutor committed misconduct during argument by inviting the jury to disregard the law of unconsciousness. He refers to the following two statements: \"Intoxication can come into effect in one more area and that is it can make you unconscious. I don't know what your reaction is when you hear that there's a rule that says that if you're so intoxicated that you're unconscious, that you're not guilty of these crimes.\" Further,\"an unconscious man would probably stumble through the front door, assuming unconscious people even commit burglaries. I think the whole notion is silly . . . . \"\n\nDefendant waived the claim by failing to object below and to request an admonition. ( People v. Rowland, supra, 4 Cal. 4th at pp. 274-275.) We see no basis for his claim that his failure to object should be overlooked because a prompt admonition could not have cured the harm. To the extent defendant claims any failure to object was ineffective assistance of counsel, we disagree, as no misconduct appears, as we shall explain.\n\nWhen we examine the statements in context, it appears that the prosecutor was making a permissible argument that defendant's claim of unconsciousness was implausible in light of the physical evidence that whoever broke into the Marriott home did so methodically. That is, the first statement to which defendant now objects appeared in the context of the following argument: \"When you sit and think about what was done, how the house was entered, glass was broken, defendant climbed in, murdered these people, searched their house, tore it apart, when you look at all that went on - I think sometimes you have to think you're in a dream world if somebody says to you an unconscious person did this, you've got to ask yourself what are they talking about, unconscious? You hear these words, to me you almost have got to think you're in the wrong courtroom.\" As for the second statement to which defendant objects, it was extracted from the following statement: \"The first thing we have is the theft. He's sitting there in his car making up his mind, 'I want more money or more dope, I'm going to steal.' There's circumstantial evidence of that; he's using his head. [P] The door he picks. Would an unconscious man go around to the back where he couldn't be seen in a secret location? No, that's a conscious man. An unconscious man would probably stumble through the front door, assuming unconscious people even commit burglaries. I think the whole notion is silly, but he picks the best door, the smart door where he's out of sight.\"\n\nViewing the statements in the context of the argument as a whole (see People v. Gonzalez (1990) 51 Cal. 3d 1179, 1224, fn. 21, 275 Cal. Rptr. 729, 800 P.2d 1159 [\"'arguments of counsel . . . must be Judged in the context in which they are made'\"]), we do not believe the prosecutor argued that the jury should disregard the law on the defense of unconsciousness. Moreover, viewing the challenged statements in context, we do not believe there is a reasonable likelihood that the jury understood him to be making such an argument. (See People v. Berryman (1993) 6 Cal. 4th 1048, 1072, 864 P.2d 40.)\n\nG. Cumulative error.\n\nDefendant claims the cumulative prejudice of the asserted judicial error, prosecutorial misconduct, and ineffective assistance of counsel requires reversal of his convictions. We have considered each claim on the merits, and neither singly nor cumulatively do they establish prejudice requiring the reversal of the convictions.\n\nIII. PENALTY TRIAL ISSUES\n\nA. Capital charging decision.\n\nAt trial, defendant sought discovery pursuant to Murgia v. Municipal Court (1975) 15 Cal. 3d 286, 124 Cal. Rptr. 204, 540 P.2d 44, in an effort to show the prosecutor charged special circumstances and was seeking the death penalty due to purposeful, invidious discrimination. The trial court directed the district attorney's office to provide discovery regarding its capital charging policies, and there was a hearing on the matter. The prosecutor's supervisor in the district attorney's office also testified regarding the office's charging practices and his reasons for deciding whether to seek the death penalty in this and a number of other recent cases. Much of this testimony occurred at a hearing held after the guilt verdicts were rendered, but before the penalty trial. The court concluded the district attorney's office had specific guidelines for making a capital charging decision which it had followed without caprice in this case. The court declared the capital charging decision to have been \"fair and equitable.\"\n\nOn appeal, defendant does not claim invidious discrimination or vindictive prosecution. Rather, relying on the state and federal Constitutions, he now claims he was \"deprived of procedural due process in the charging decision because the factors deemed by the [district attorney] to be essential in determining [whether to charge special circumstances and seek the death penalty] were not properly applied in his case.\" Specifically, he claims the trial prosecutor committed misconduct in providing his supervisors in the district attorney's office with misleading or erroneous information that may have influenced the charging decision under the office's internal charging standards. For example, defendant claims the prosecutor told his supervisor one of the victims was killed with her sleeping mask on, although neither the crime reports nor the trial evidence contained any evidence she was wearing a sleeping mask. Without such misleading or false information, defendant claims, the district attorney's office might not have elected to charge special circumstances and seek the death penalty in this case. He relies on Hicks v. Oklahoma (1980) 447 U.S. 343, 65 L. Ed. 2d 175, 100 S. Ct. 2227 for the proposition that he had a due process right to have the prosecutor's charging decision made on the basis of all available evidence and upon accurate evidence.\n\nDefendant did not allege prosecutorial misconduct in this connection at the trial court. Accordingly, the claim of misconduct was waived. (See People v. Hardy, supra, 2 Cal. 4th at p. 171.) Further, to the extent defendant is claiming a violation of due process in the charging decision, defendant did not make a motion to dismiss or to strike the special circumstances on this basis, and should not be permitted to raise the matter for the first time here. ( People v. Edwards, supra, 54 Cal. 3d at p. 827 [claim of vindictive prosecution not preserved for appeal unless basis for motion to dismiss in trial court].)\n\nIn any event, even if we were to reach the merits, we find no legal support for defendant's claim that he had a right to have the charging decision based upon all the evidence reasonably available to the district attorney's office and upon an accurate presentation of the evidence. Prosecutors have broad discretion to decide whom to charge, and for what crime. As we have observed, \"it is well established, of course, that a district attorney's enforcement authority includes the discretion either to prosecute or to decline to prosecute an individual when there is probable cause to believe he has committed a crime.\" ( Davis v. Municipal Court (1988) 46 Cal. 3d 64, 77, 249 Cal. Rptr. 300, 757 P.2d 11; see also Bordenkircher v. Hayes (1978) 434 U.S. 357, 364, 54 L. Ed. 2d 604, 98 S. Ct. 663.) Absent proof of invidious or vindictive prosecution, as a general matter a defendant who has been duly convicted of a capital crime under a constitutional death penalty statute may not be heard to complain on appeal of the prosecutor's exercise of discretion in charging him with special circumstances and seeking the death penalty. (See Gov. Code, § 26501; People v. Pinholster (1992) 1 Cal. 4th 865, 971, 824 P.2d 571[courts generally do not review capital charging decision unless there is invidious discrimination in prosecution]; People v. Morris (1991) 53 Cal. 3d 152, 235, fn. 25, 279 Cal. Rptr. 720, 807 P.2d 949 [prosecutor's exercise of charging discretion generally \"not pertinent to a review of a capital sentence\"]; People v. Keenan (1988) 46 Cal. 3d 478, 506, 250 Cal. Rptr. 550, 758 P.2d 1081 [prosecutor's exercise of discretion in capital charging not unconstitutional]; Murgia v. Municipal Court, supra, 15 Cal. 3d at pp. 297, 300 [defendant may seek relief from invidious discrimination in prosecution]; see also In re Bower (1985) 38 Cal. 3d 865, 874-877, 215 Cal. Rptr. 267, 700 P.2d 1269 [vindictive prosecution barred]; Twiggs v. Superior Court (1983) 34 Cal. 3d 360, 369-374, 194 Cal. Rptr. 152, 667 P.2d 1165 [same].) Accordingly, the factual predicates for the prosecutor's charging decision should not be subject to scrutiny unless there is a claim of invidious discrimination or vindictive prosecution.\n\nDefendant seems to argue that the guaranty of due process assures his right to have the prosecutor make the initial capital charging decision according to certain standards, and that the alleged misconduct of the trial deputy undermined the ability of the district attorney's office to apply such standards. He cites Hicks v. Oklahoma, supra, 447 U.S. 343, in support. In that case, the high court decided that when a state vests the jury with sentencing discretion, and the jury imposes sentence under an unconstitutional statute, the defendant has a due process right to resentencing, though the second jury might impose as harsh a sentence as that mandated by the invalidated statute. The defendant \"has a substantial and legitimate expectation that he will be deprived of his liberty only to the extent determined by the jury in the exercise of its statutory discretion, [citation], and that liberty interest is one that the Fourteenth Amendment preserves against arbitrary deprivation by the state.\" (447 U.S. at p. 346.)\n\nAlthough defendant does not explain his citation to Hicks, we surmise that he wishes to draw a parallel between the function of the jury in that case and that of the prosecutor vested with the charging decision in his case. In Hicks, the defendant had a right to a jury that properly exercised its sentencing discretion, and presumably defendant is claiming he has a due process right to have the prosecutor properly exercise his charging discretion in this case.\n\nDefendant's claim that he has a right to have the prosecutor make the initial charging decision according to certain nonarbitrary standards has been rejected. ( People v. Keenan, supra, 46 Cal. 3d at p. 505.) Putting aside claims of invidious discrimination in prosecution or vindictive prosecution, which are not at stake here, we do not review the prosecutor's standards for seeking the death penalty to assure that they are fair and nonarbitrary. (Ibid.) Rather, we have determined that the \"requisite 'standards' are those minimum standards set forth in a constitutional death penalty statute. By acceptably narrowing the circumstances under which capital punishment may be sought and imposed, such a law satisfies the constitutional prohibition against arbitrary and capricious exaction of the death penalty.\" (46 Cal. 3d at p. 506.) We have similarly concluded that prosecutorial discretion in selecting the cases to be subject to a capital charge does not amount to a due process violation. (46 Cal. 3d at p. 505.) If we do not review the prosecutor's standards for making the capital charging decision, we certainly do not attempt to determine whether there was an accurate factual basis for the charging decision pursuant to the prosecutor's own internal charging standards. Defendant's claim that the prosecutor's alleged misstatements of the evidence caused the supervising deputy vested with ultimate charging discretion to fail to follow internal office charging policies is simply not subject to review in the absence of a claim of invidious discrimination or vindictive prosecution.\n\nB. Issues affecting composition of jury.\n\n1. Denial of right to impartial jury-limitation on examination of juror Bojorquez.\n\nThe court conducted sequestered voir dire of prospective jurors, limiting its initial examination to \"death qualification,\" that is, a determination whether each prospective juror had such conscientious or religious scruples about capital punishment that would \"prevent or substantially impair the performance of his duties as a juror in accordance with his instructions and his oath.\" ( Adams v. Texas (1980) 448 U.S. 38, 45, 65 L. Ed. 2d 581, 100 S. Ct. 2521; see also Wainwright v. Witt (1985) 469 U.S. 412, 424, 83 L. Ed. 2d 841, 105 S. Ct. 844.) The court asked each prospective juror whether he or she believed the death penalty should be imposed automatically after conviction of the charged crimes. The court permitted counsel to conduct voir dire on these points, as well.\n\nDefendant argues he was not afforded an adequate opportunity to examine Juror Bojorquez, in violation of the right secured by the Fourteenth Amendment to the federal Constitution to exercise his challenges for cause intelligently. ( Morgan v. Illinois (1992) 504 U.S. 719, 733-734, 119 L. Ed. 2d 492, 112 S. Ct. 2222.) The result, he claims, was that a juror biased in favor of imposing the death penalty sat on his jury.\n\nIn a capital case, of course, the court must permit counsel to ask each juror whether he or she believes the death penalty should be imposed automatically upon conviction of a capital offense. ( Morgan v. Illinois, supra, 504 U.S. at pp. 735-736.) As a general matter, however, as we have recently declared, \"'The scope of the inquiry permitted during voir dire is committed to the discretion of the court.'\" ( People v. Champion (1995) 9 Cal. 4th 879, 908, 891 P.2d 93, quoting People v. Visciotti (1992) 2 Cal. 4th 1, 48, 825 P.2d 388.) We recognize the \"'considerable discretion of the trial court to contain voir dire within reasonable limits.'\" ( People v. Wash, supra, 6 Cal. 4th at p. 253.)\n\nIn this case, contrary to defendant's claim, the trial court did not prevent inquiry into the juror's beliefs regarding automatic imposition of the death penalty for capital crimes. The question was posed more than once. Nor did the court abuse its discretion by unduly restricting voir dire of Juror Bojorquez. (See People v. Chapman (1993) 15 Cal. App. 4th 136, 141 [abuse of discretion if questioning allowed is not reasonably sufficient to test the jury for bias or partiality]; People v. Chaney (1991) 234 Cal. App. 3d 853, 861, 286 Cal. Rptr. 79 [same].) Defense counsel's questions of this juror regarding her attitudes toward the death penalty cover several pages of transcript. The prosecutor, too, covered some of the same ground, trying to establish the juror was committed to being fair to defendant and would listen to the evidence presented at the penalty trial before making a decision regarding penalty. When defense counsel then asked permission to ask \"one or two questions\" along the same lines, the court denied the request because the subject had been exhausted. We see no abuse of discretion.\n\nDefendant argues that even if the court did not improperly limit voir dire, it erred in refusing to grant his challenge for cause as to Juror Bojorquez. The People correctly argue defendant waived the claim because he failed to exhaust his peremptory challenges. Defendant's right to a fair and impartial jury is not compromised as long has he could have secured the juror's removal through the exercise of a peremptory challenge. \"To preserve a claim of error in the denial of a challenge for cause, the defense must either exhaust its peremptory challenges and object to the jury as finally constituted or justify the failure to do so.\" ( People v. Kirkpatrick (1994) 7 Cal. 4th 988, 1005, 874 P.2d 248; see also People v. Bittaker (1989) 48 Cal. 3d 1046, 1087-1088, 259 Cal. Rptr. 630, 774 P.2d 659.) Defendant did not exhaust his peremptory challenges nor did he object to the jury as finally constituted. Nor does he justify his failure to do so. Accordingly, the point is waived and will not be considered on the merits. ( People v. Kirkpatrick, supra, 7 Cal. 4th at p. 1005.)\n\nDefendant claims in the alternative that any failure to exhaust peremptory challenges was ineffective assistance of counsel. The claim is meritless; the decision whether to accept a jury as constituted is obviously tactical, and nothing on the appellate record demonstrates counsel's tactical choice here was either unreasonable or prejudicial. In fact, were we to reach the merits of the claim that the court should have granted defendant's motion to exclude Juror Bojorquez for cause, we would reject it. Although at one point the juror stated she thought she \"probably\" would vote for the death penalty for any multiple murder, she also protested that she could not say she would impose the death penalty in every such case, that she would \"have to listen to everything that went on,\" that she realized jurors \"have to listen to the circumstances,\" and that she would be willing to listen to evidence regarding the defendant's background and keep an open mind in making the penalty determination. She did not express views \"indicative of an unalterable preference in favor of the death penalty\" ( People v. Crittenden (1995) 9 Cal. 4th 83, 123, 885 P.2d 887), such that her protestations that she would listen to all the evidence with an open mind and be fair to defendant could not rehabilitate her. (Ibid., citing Morgan v. Illinois, supra, 504 U.S. at pp. 734-735.) Resolving any ambiguity in the juror's responses in favor of the trial court's ruling below ( People v. Mincey, supra, 2 Cal. 4th at pp. 456-457 [if juror's responses are conflicting or equivocal, trial court's determination binding on reviewing court]), we conclude the juror did not express views that \"would 'prevent or substantially impair' the performance of the juror's duties as defined by the court's instructions and the juror's oath.\" ( People v. Crittenden, supra, 9 Cal. 4th at p. 121, quoting Wainwright v. Witt, supra, 469 U.S. 412 at p. 424; see also Adams v. Texas, supra, 448 U.S. at p. 45.)\n\nDefendant also argues in conclusory terms that the trial court should have excused eight other jurors for cause on its own motion. He claims these jurors were biased in favor of the death penalty, because they responded in the affirmative to a questionnaire asking whether they thought the state should execute anyone convicted of an intentional murder during a burglary. As we have noted above, however, defendant did not exhaust his peremptory challenges or express dissatisfaction with the jury, and his claim may be rejected because he fails to demonstrate the court's inaction prejudiced him. ( People v. Kirkpatrick, supra, 7 Cal. 4th at p. 1005; see also People v. Bittaker, supra, 48 Cal. 3d at pp. 1087-1088.)\n\nAssuming arguendo the issue was preserved, we reject the claim on the merits. Defendant's claim of juror bias is so insubstantial that we need not determine the extent of the trial court's power or obligation to excuse jurors on its own motion.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e The jurors of whose jury questionnaire responses defendant now complains all stated on voir dire that they would not automatically impose the death penalty. It is clear their initial statements in the juror questionnaire, suggesting they would automatically impose the death penalty for certain crimes, did not reflect the views they ultimately expressed during voir dire. None of these jurors stated such views regarding the death penalty during voir dire as would necessarily subject them to excusal for cause. That is, none expressed views that \"would 'prevent or substantially impair' the performance of the juror's duties as defined by the court's instructions and the juror's oath.\" ( People v. Crittenden, supra, 9 Cal. 4th at p. 121, quoting Wainwright v. Witt, supra, 469 U.S. at p. 424.) Accordingly, the claim is rejected.\n\n2. Request for new penalty jury.\n\nAfter the guilty verdict was entered, defendant moved that a new jury be impaneled for the penalty trial, arguing that the court had conditioned the jury during voir dire to expect that defendant would present evidence in mitigation - an expectation the defense would disappoint, as it had determined to present no evidence. Defendant argues that the trial court's refusal to impanel a new jury for the penalty trial was an abuse of discretion, particularly as it was the court's error during voir dire that caused the potential for prejudice.\n\nThe record discloses that during sequestered voir dire of several panels of prospective jurors and of two individual prospective jurors, the court explained the procedure involved in a capital trial, including the penalty phase of trial, noting that the prosecution would present evidence in aggravation, the defense would offer evidence in mitigation, and the court would instruct the jury as to the rules that would guide their penalty determination. Seven of the jurors who sat on defendant's jury heard this description. Defendant claims he objected to the court's characterization directly, but points to a portion of the record in which defendant objected to the prosecutor's use of questions that assumed defendant would present evidence in mitigation. The court explained, in response, that both counsel had a great deal of leeway in framing their questions. Defense counsel repeated he might or might not present evidence in mitigation, and the court directed him to prepare a typed statement signed by both counsel stating their reasons for not putting on any evidence in mitigation. Soon thereafter, defense counsel observed that the court had talked to two of the jurors about evidence in mitigation, and pointed out, \"that may or may not be presented.\" The trial court simply called the next juror. Defendant claims he repeatedly objected to the court's repetition of his early explanation of penalty phase procedure but he offers no citations to the record in support, nor do we observe any further objections.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nWe review the trial court's decision not to impanel a second jury for the penalty trial under an abuse of discretion standard. ( People v. Rowland, supra, 4 Cal. 4th at p. 268.) Section 190.4, subdivision (c), directs that the same jury shall consider the penalty as considered the guilt verdict, unless good cause is shown for separate juries. The section \"reflects the long-standing legislative preference for a single jury to determine both guilt and penalty.\" ( People v. Fauber, supra, 2 Cal. 4th at p. 845; People v. Nicolaus (1991) 54 Cal. 3d 551, 574, 286 Cal. Rptr. 628, 817 P.2d 893.) In order to establish good cause, more than speculation or the desire of counsel is necessary. ( People v. Rowland, supra, 4 Cal. 4th 238, 268; People v. Pride, supra, 3 Cal. 4th at pp. 252-253; People v. Fauber, supra, 2 Cal. 4th at p. 846.) A new jury is not required, for example, simply because there is a deviation between defense strategy at the guilt trial and the penalty trial ( People v. Pride, supra, 3 Cal. 4th 195, 252; People v. Taylor (1990) 52 Cal. 3d 719, 737-738, 276 Cal. Rptr. 391, 801 P.2d 1142), or because the penalty jury may be disturbed by evidence of the capital crimes ( People v. Pride, supra, 3 Cal. 4th at p. 252, People v. Balderas (1986) 41 Cal. 3d 144, 204, 222 Cal. Rptr. 184, 711 P.2d 480).\n\nHere, defendant claimed he needed a new jury to avoid the potential for prejudice caused by the trial court's statements during voir dire that the defense would present evidence in mitigation at the penalty trial. He feared the jury would \"hold it against defendant\" that he presented no mitigating evidence. Defendant arguably could have avoided this potential by making a clearer contemporaneous objection to the court's statements. In any event, the potential for prejudice arising from the court's statements on voir dire is minimal.\n\nAs in other cases in which we have analyzed the harm of misstatements of law during voir dire, the statements on voir dire long preceded the penalty phase, when the jury's attention would be focused on its sentencing responsibility. (See People v. DeSantis (1992) 2 Cal. 4th 1198, 1242, 831 P.2d 1210 [district attorney's misstatements harmless in part because of time elapsed between voir dire and penalty trial]; People v. Pinholster, supra, 1 Cal. 4th at p. 915 [same]; People v. Morris, supra, 53 Cal. 3d at p. 182 [same].) In context, such statements would not be seen as instruction on the jury's function at the penalty trial, but merely as a brief introductory description or overview of the course of the trial. (See, e.g., People v. Morris, supra, 53 Cal. 3d at p. 182 [misstatement on voir dire small part of larger statement giving overview of voir dire procedure].) Any potential for prejudice was obviated by the jury instructions, which did not suggest that defendant had any obligation to present evidence at the penalty trial. (See, e.g., People v. DeSantis, supra, 2 Cal. 4th at p. 1243 [defects in voir dire cured by instructions and argument]; People v. Pinholster, supra, 1 Cal. 4th at pp. 915-916 [same]; People v. Morris, supra, 53 Cal. 3d at pp. 182-183 [same].)\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e And, of course, counsel could stress this point with the jury, and in fact, counsel here drew the jury's attention to the trial evidence as evidence in mitigation under section 190.3, factor (k). The prosecutor also listed defendant's guilt phase testimony about his condition on the night of the crimes as evidence that could be considered in mitigation. Under these circumstances, it was within the court's discretion to conclude that good cause had not been shown and to deny the motion for a second jury.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nC. Ineffective assistance of counsel.\n\n1. Failure to challenge juror Melba Thompson for cause.\n\nDefendant contends trial counsel provided ineffective assistance because they failed to challenge Juror Melba Thompson for cause. Defendant claims that the juror's views on capital punishment were so extreme that they would substantially impair her performance as an impartial juror. He also claims she disclosed she would be excessively deferential to the testimony of experts. He complains that instead of moving to excuse the juror, counsel \"in effect rehabilitated Ms. Thompson by getting her to change some of her answers.\"\n\nDefendant was entitled to trial by an impartial jury, \"made up of jurors who will not automatically vote for the death penalty, but who will consider the mitigating evidence presented.\" ( People v. Crittenden, supra, 9 Cal. 4th at p.121; see Morgan v. Illinois, supra, 504 U.S. at pp. 729, 735-736.) Those eligible to serve, however, include those who may favor the death penalty. ( Lockhart v. McCree (1986) 476 U.S. 162, 173-177, 90 L. Ed. 2d 137, 106 S. Ct. 1758 [federal Constitution]; Hovey v. Superior Court (1980) 28 Cal. 3d 1, 63, 168 Cal. Rptr. 128, 616 P.2d 1301 [those who favor the death penalty, are indifferent to it or oppose it are eligible to serve in capital trial]; see also People v. Ashmus, supra, 54 Cal. 3d at p. 956, fn. 2.)\n\nAs we have noted above, a juror is subject to challenge for cause because of his or her views on the death penalty \"only if those views would 'prevent or substantially impair' the performance of the juror's duties as defined by the court's instructions and the juror's oath.\" ( People v. Crittenden, supra, 9 Cal. 4th at p.121, quoting Wainwright v. Witt, supra, 469 U.S. at p. 424.)\n\nDefendant is unable to show reasonably competent trial counsel would have challenged Ms. Thompson for cause. Defendant asserts that Ms. Thompson indicated on the written jury questionnaire filled out before voir dire that she thought the death penalty should be enforced, that she believed in \"an eye for an eye,\" and that the death penalty should be imposed for every intentional killing or burglary felony murder. Nonetheless, she also stated she would hear and review all the circumstances before deciding whether the death penalty should be imposed. She also stated she would be able to put aside her personal feelings as to what the law should be and follow the law as the trial court explained it. She said she would not automatically vote for a death verdict. On voir dire, she explained she had made a mistake in stating on the jury questionnaire that she thought death should be automatic for intentional killings. In fact, she misunderstood the written question, and did not believe that the death penalty should be imposed for every intentional homicide. She said she considered life without possibility of parole to be an appropriate punishment.\n\nConsidering these responses, counsel could competently conclude that the juror's views on the death penalty would not \"'prevent or substantially impair' the performance of the juror's duties as defined by the court's instructions and the juror's oath.\" ( People v. Crittenden, supra, 9 Cal. 4th at p. 121.) Certainly, she did not express such an unalterable preference for the death penalty that her claims to be able to put her views aside and follow the court's instructions must be rejected as hypocrisy or self-deception. ( Id. at p. 123, cf. Morgan v. Illinois, supra, 504 U.S. at p. 735.)\n\nDefendant also fails to show that the record \"affirmatively discloses\" there was no rational tactical purpose for accepting Ms. Thompson on the jury despite her favorable views on the death penalty and her deferential regard for expert opinion. ( People v. Cox (1991) 53 Cal. 3d 618, 658-659, 280 Cal. Rptr. 692, 809 P.2d 351 [defendant failed to demonstrate manner of conducting capital voir dire resulted from other than informed strategic decision].)\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e Defendant disparages counsel for \"rehabilitating\" the juror. Yet counsel's efforts suggest they had tactical reasons for wanting to retain the juror. She had moderated the uncritical views she expressed regarding the death penalty in her questionnaire, and this new thoughtfulness, in addition to counsel's observation of the juror's demeanor, may have persuaded them that the defense should accept her as a juror. (See People v. Tuilaepa (1992) 4 Cal. 4th 569, 587, 842 P.2d 1142 [recognizing counsel may base tactics at voir dire on observation of prospective jurors' demeanor].) Defendant fails to demonstrate on this record that there was no rational basis for counsel's decision to accept Juror Thompson.\n\nDefendant also argues in summary terms that counsel were incompetent for failing to move to exclude eight other jurors for cause. We have already rejected the claim the court should have removed the jurors on its own motion, concluding there was little basis for concluding the jurors had expressed views that \"would 'prevent or substantially impair' the performance of the juror's duties as defined by the court's instructions and the juror's oath.\" ( People v. Crittenden, supra, 9 Cal. 4th at p. 121, quoting Wainwright v. Witt, supra, 469 U.S. at p. 424.) Counsel, like the court, could competently conclude the jurors were not subject to exclusion for cause.\n\n2. Failure to assert claim of jury misconduct.\n\nDefendant asserts defense counsel should have moved to excuse Juror Thompson from the jury for misconduct. The record reflects that after the guilt verdict, just before the prosecutor presented evidence at the penalty trial, a person approached Juror Thompson in the hall outside the courtroom and started talking about a \"boy\" and said that he was a \"bad boy\" who had a violent temper. He said there had been a trail of blood around the house after the crime, and at this point, Ms. Thompson realized he was talking about the case in which she was a juror. She surmised that he was a neighbor of defendant's. She told him she could not discuss the case, and terminated the conversation.\n\nThe court examined Thompson about this incident. She assured the court that she did not hear anything that would cause her to have an adverse reaction toward either side in this case, and that the conversation did not affect her thinking about the case. She told defense counsel she was bothered by the conversation because she knew it was against the rules. The court admonished her not to discuss the matter with any other juror. The court asked counsel if there was any challenge, and counsel said no, though counsel \"might want to raise it later when we find out who this individual is.\" No later challenge ensued.\n\nIt is true that a juror's \"inadvertent receipt of information outside the court proceedings is considered 'misconduct' and creates a presumption of prejudice, which, if not rebutted, requires a new trial.\" ( People v. Zapien, supra, 4 Cal. 4th 929, 994.) The issue here, however, is not jury misconduct but a claim of ineffective assistance of counsel for failing to raise the issue of juror misconduct at trial. (See People v. Billings (1981) 124 Cal. App. 3d 422, 433, 177 Cal. Rptr. 392 [claim of juror misconduct waived if not raised in trial court], overruled on other grounds in People v. Karis (1988) 46 Cal. 3d at p. 642, fn. 22; see also People v. Wisely (1990) 224 Cal. App. 3d 939, 947, 274 Cal. Rptr. 291.) Obviously, counsel did not merely forget to challenge the juror, but decided not to do so. The choice was tactical; the question is whether, on this record, the decision not to challenge the juror was an incompetent tactical choice. Given the juror's assurance that the conversation had not affected her, and the court's admonition not to discuss the matter with the other jurors, we cannot say that the record establishes any incompetence.\n\nDefendant claims counsel also failed to act reasonably diligently because, ignoring the stage of trial and the aggravating evidence Ms. Thompson had just heard, defense counsel failed to probe the impact of the characterization of defendant as \"bad\" and \"violent.\" Our review of the record, however, indicates counsel did examine the juror on the impact of her conversation. That counsel did not use particular words in doing so does not establish incompetence.\n\nD. Court's discharge of Juror Noone.\n\nDefendant argues the court abused its discretion in excusing Juror Noone before the commencement of the penalty trial. The record shows that after the guilt verdict the court announced the penalty trial would not start for two days. Juror Noone reminded the court she had a vacation planned, as she had mentioned during voir dire. It seemed likely the penalty trial would require the juror to cancel her vacation. Defense counsel said they could not stipulate to excusing the juror, as they did not know whether she had paid for tickets or whether she could change her reservations, but that if the court thought after questioning that she should be excused, \"that would be your decision.\" Upon questioning, the juror said she would forfeit some money if the vacation were canceled, though she could not say how much. She also said her vacation could not be rescheduled for many months because of her work and school schedule. She said she could be fair even if she had to cancel her vacation. The court \"excused\" the juror, explaining \"clearly she meets the criteria that the court has used throughout excusing jurors. More importantly, in terms of financial loss and previous commitments, I am somewhat concerned about the fact that although she says it will not impact her deliberation, this is her only break in an otherwise rather full work/school schedule, and it seems to me that it really can't help but impact her particularly if the jury deliberations begin to take any kind of extensive period of time because in essence not only does she lose this trip, she would lose in essence her vacation. . . .\" Defense counsel objected without stating any basis for the objection. The court ruled as follows: \"The court makes a specific finding of fact that based upon previously stated reasons in this session and her previous statement at the time she was initially seated in the box that there is grave doubt she can be fair and impartial in the penalty phase in view of the unique circumstances of her vacation and the fact that it is lost in essence forever and the unique circumstances of her particular obligation of a juror in deciding what the penalty should be; therefore I am going to find good cause to excuse her.\" The court added that the juror's demeanor and distress when she brought up the problem of her vacation on other occasions without being asked was \"critically important\" in making its determination.\n\nDefendant claims it was an abuse of discretion to excuse the juror so late in the proceedings for such a trivial cause.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e The People argue the claim is barred for failure to make this precise objection in the trial court.\n\nThe parties have framed the issue as one involving the court's discretion to excuse a juror for personal hardship, a determination that is reviewed for abuse of discretion. (See Code Civ. Proc., § 204, subd. (b); People v. Mickey, supra, 54 Cal. 3d at p. 665.) It seems evident, however, that the court was actually discharging the juror, who had already been sworn, rather than excusing her from service. The court has authority to discharge a juror who has been sworn under section 1089, which provides: \"If at any time, whether before or after the final submission of the case to the jury, a juror dies or becomes ill, or upon other good cause shown to the court is found to be unable to perform his duty, or if a juror requests a discharge and good cause appears therefor, the court may order him to be discharged and draw the name of an alternate, who shall then take his place in the jury box . . . .\"\n\nAs the People point out, defendant did not argue at trial that it was too late in the proceedings to discharge Ms. Noone for hardship. We have held that \"[a] defendant may properly raise in this court a point involving an allegedly improper excusal for undue personal hardship only if he made the same point below. The requirement of a contemporaneous and specific objection promotes the fair and correct resolution of a claim of error both at trial and on appeal, and thereby furthers the interests of reliability and finality.\" ( People v. Mickey, supra, 54 Cal. 3d at p. 664.) The same concerns obviously apply to a determination that a juror should be discharged during trial, but due to the ambiguity of the record on the basis for counsel's objection, we reach the merits. (See People v. Fudge (1994) 7 Cal. 4th 1075, 1099, fn. 6, 875 P.2d 36.)\n\nThe court's decision whether to discharge a juror under section 1089 is reviewed for abuse of discretion. ( People v. Beeler (1995) 9 Cal. 4th 953, 975, 891 P.2d 153; People v. Fudge, supra, 7 Cal. 4th at p. 1099; People v. Johnson (1993) 6 Cal. 4th 1, 21, 859 P.2d 673; People v. McPeters (1992) 2 Cal. 4th 1148, 1176, 832 P.2d 146; People v. Price (1991) 1 Cal. 4th 324, 400, 821 P.2d 610.) The juror's inability to perform must appear as a \"demonstrable reality\" and will not be presumed. ( People v. Johnson, supra, 6 Cal. 4th at p. 21; see also People v. Fudge, supra, 7 Cal. 4th 1099 [no abuse of discretion to discharge juror anxious about paperwork involved in termination of employment]; People v. Halsey (1993) 12 Cal. App. 4th 885, 891 [noting few cases have found abuse of discretion].)\n\nWe find no abuse of discretion. Although the juror stated the cancellation of her vacation would not affect the discharge of her duties as a juror, her behavior and demeanor supplied substantial evidence to the contrary. She had repeatedly brought the problem of the vacation to the court's attention, exhibiting concern and agitation over it. The court determined that the juror's demeanor indicated her ability to deliberate fairly would be substantially impaired if the penalty trial caused her to cancel her vacation. (See People v. Beeler, supra, 9 Cal. 4th at p. 989 [recognizing importance of court's observation of juror's demeanor in reviewing decision to discharge].) We also observe that the juror would have felt some pressure to bring the penalty deliberations to a speedy close in order to preserve her planned vacation. It was not an abuse of discretion to discharge her.\n\nE. Gruesome photographs.\n\nDefendant claims the trial court erred in admitting at the penalty trial the same assertedly gruesome photographs of the victims' bodies that were admitted at the guilt trial. He also claims the photographs were wholly irrelevant at the penalty trial, as the torture-murder special circumstance had been found not true. He claims the admission of this evidence was a violation of Evidence Code section 352 and a violation of his right to due process and to a reliable penalty determination under the Eighth and Fourteenth Amendments of the federal Constitution.\n\nDefendant waived his claim that photographs of the victims' bodies should not have been admitted at the penalty trial by failing to renew his objection at the penalty phase. ( People v. Wash, supra, 6 Cal. 4th at p. 266.) His Eighth Amendment claim is waived for the same reason. ( People v. Benson, supra, 52 Cal. 3d at p. 786, fn.7.) In any event, as we have seen, we do not believe the photographs were unduly prejudicial. Further, they were relevant at the penalty trial to show the circumstances of the crime, a factor the jury may consider in determining penalty. (52 Cal. 3d at p. 786; see also People v. Wash, supra, 6 Cal. 4th at p. 266; People v. Raley, supra, 2 Cal. 4th at p. 914.)\n\nF. Assertion of marital privilege.\n\nDefendant's wife, Darlene Lucas, invoked the marital privilege and refused to testify at the penalty trial. Defendant argues (1) the court erred in permitting her to invoke the privilege, and (2) defense counsel provided ineffective assistance of counsel in failing to point out that the marital privilege only permits the spouse to refuse to give testimony against his or her spouse. His wife's testimony, defendant claimed, would have supported his defense.\n\nAlthough a person generally has no privilege to refuse to testify in favor of his or her spouse in a criminal proceeding, Evidence Code section 970 provides that a married person has a privilege not to testify against his or her spouse who is a party in any proceeding. The privilege belongs to the married person, not the spouse who is the party. (Cal. Law Revision Com. com., Deerings Ann. Evid. Code (1986 ed.) foll. § 970, p. 139; see also People v. Chavez (1968) 262 Cal. App. 2d 422, 429, 68 Cal. Rptr. 759.) Accordingly, defendant's claim that defense counsel mistakenly \"permitted\" defendant's wife to invoke the privilege not to testify against her husband is misplaced.\n\nUnder Evidence Code section 973, subdivision (a), if a married person chooses to testify in a proceeding in which his or her spouse is a party, the person waives the privilege and must answer potentially damaging questions on cross-examination. \"[A] married person cannot call his spouse as a witness to give favorable testimony and have that spouse invoke the privilege provided in Section 970 to keep from testifying on cross-examination to unfavorable matters . . . . \" (Law Rev. Com. com., Deerings Ann. Evid. Code, supra, foll. § 973, p. 146; see also People v. Resendez (1993) 12 Cal. App. 4th 98, 107-109; 2 Witkin, Cal. Evidence, supra, § 1177, pp. 1122-1123.) The trial court may have concluded defendant's wife was invoking the privilege to avoid such an eventuality, even if her testimony on direct examination would have been favorable to defendant, for the record indicates she may have been a percipient witness on the night of the crime. In fact, she invoked the marital privilege when called by the prosecution at the preliminary hearing, and defendant does not contend this was error.\n\nBut even assuming judicial error, defendant is unable to demonstrate prejudice, because the record contains no offer of proof regarding the content of Darlene Lucas's proposed testimony. As for the claim counsel were incompetent for conceding Mrs. Lucas had the right to invoke the privilege, the claim is based on the unsupported assumption that counsel must have made the concession under a mistake of law regarding the scope of the privilege. Further, as noted above, prejudice cannot be demonstrated on this silent record. It should be recalled that, depending on the nature of the proposed testimony, the witness's favorable testimony might have opened her to damaging cross-examination which could not be fended off under a claim of marital privilege.\n\nG. Asserted prosecutorial misconduct.\n\nDefendant claims that various comments of the prosecutor in closing argument were misconduct, and that this misconduct violated his rights to a fair trial, a reliable verdict and due process under the Sixth, Eighth and Fourteenth Amendments to the federal Constitution and under article 1, sections 7, 15, and 17 of the California Constitution. He also argues that to the extent his claims are barred for counsel's failure to make timely objections, he was deprived of the right to effective assistance of counsel under the state and federal Constitutions.\n\n1. Claimed Davenport error.\n\nSection 190.3 sets out the factors in aggravation and mitigation that the jury may consider in determining the appropriate penalty. We have held that it is improper for a prosecutor to argue that the absence of evidence of a statutory factor in mitigation permits or requires that the factor be considered in aggravation. ( People v. Davenport (1985) 41 Cal. 3d 247, 289, 221 Cal. Rptr. 794, 710 P.2d 861.) Defendant argues, and the People concede, the prosecutor erred in arguing to the jury that the absence of evidence of certain factors in mitigation was a factor in aggravation.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nIn this post-Davenport trial, defendant failed to object to these statements, and the claim was waived. ( People v. Champion, supra, 9 Cal. 4th at p. 939; People v. Webb (1993) 6 Cal. 4th 494, 533, 862 P.2d 779.) Defendant claims that any failure to object was ineffective assistance of counsel. We disagree. As we have said before, \"mere failure to object to argument seldom establishes counsel's incompetence.\" ( People v. Douglas (1990) 50 Cal. 3d 468, 539, 268 Cal. Rptr. 126, 788 P.2d 640.) We have repeatedly held that the prosecutorial comment to which defendant now objects is nonprejudicial. ( People v. Champion, supra, 9 Cal. 4th at p. 939; People v. Montiel (1993) 5 Cal. 4th 877, 937, 855 P.2d 1277.) Here, as we explain, defendant is unable to show there is a reasonable probability that but for counsel's failure to object, defendant would have received a more favorable determination. ( Strickland, supra, 466 U.S. at p. 694.)\n\nWe have said that \"the transgression must be viewed in the context of both the prosecution and defense arguments and the court's instructions to determine whether we can 'be confident that the jury properly understood the nature of the weighing process and its relation to the appropriateness determination . . . .'\" ( People v. Cox, supra, 53 Cal. 3d at pp. 683-684.)\n\nIn the present case, contrary to defendant's claim that the prosecutor's main argument in aggravation was the asserted absence of evidence of the factors in mitigation, the prosecutor stressed the aggravated nature of the charged crimes, relevant under section 190.3, factor (a), as the main basis for a determination that the verdict should be death. Given the evidence of the circumstances of the charged crime, as well as the other evidence of defendant's prior violent conduct, relevant under section 190.3, factor (b), we cannot accept defendant's claim that had the jury not been told to treat the absence of evidence in mitigation in aggravation, there would have been little evidence upon which to base a death judgment. Further, as in the similar case of People v. Gonzalez (1990) 51 Cal. 3d 1179, 275 Cal. Rptr. 729, 800 P.2d 1159, the prosecutor assured the jury it was free to reject his characterization of the evidence and the weight to be applied to the statutory factors. Defense counsel properly argued that certain factors in mitigation were inapplicable, and strongly urged the jury to look at the totality of the circumstances rather than mechanically adding up the factors. Nor are the mere number of potential mitigating factors mentioned in the argument suggestive of prejudice. (See People v. Gonzales, supra, 51 Cal. 3d at p. 1234.)\n\nFurther, the jury was instructed to consider only those sentencing factors it deemed applicable, to weigh the statutory factors and assess whatever value it deemed appropriate to them, to reach a determination of what penalty it deemed appropriate without a process of mechanical weighing of factors, and to impose the death penalty only if each juror determined the aggravating evidence was so substantial in comparison with the mitigating circumstances that it warrants death. These instructions helped assure that the jury was not misled ( People v. Montiel, supra, 5 Cal. 4th at p. 937; People v. Gonzales, supra, 51 Cal. 3d at p. 1234), and permit us to assume the jury understood how to evaluate the absence of a particular mitigation factor ( People v. Whitt (1990) 51 Cal. 3d 620, 654, 274 Cal. Rptr. 252, 798 P.2d 849). Such properly instructed jurors were \"unlikely to give substantial aggravating weight to the absence of obviously mitigating factors, such as victim participation or consent, belief in moral justification, or extreme duress or domination, which are rarely present in capital homicides.\" ( People v. Turner, supra, 50 Cal. 3d at p. 714.) Because we conclude there is no reasonable possibility the jury was misled, we see no reasonable probability that but for counsel's omission, defendant would have received a more favorable determination.\n\n2. Claimed Brown error.\n\nIn People v. Brown (1985) 40 Cal. 3d 512, 540, 220 Cal. Rptr. 637, 709 P.2d 440, reversed on other grounds sub. nom. California v. Brown (1987) 479 U.S. 538, 93 L. Ed. 2d 934, 107 S. Ct. 837, we held that \"the jury must be free to reject death if it decides on the basis of any constitutionally relevant evidence or observation that it is not the appropriate penalty. (Fn. omitted.)\" We said further, the jurors cannot be required to \"render a death verdict on the basis of some arithmetical formula, or . . . to impose death on any basis other than their judgment that such a verdict was appropriate under all the facts and circumstances of the individual case. (Fn. omitted.)\" (Ibid.; see also Caldwell v. Mississippi (1985) 472 U.S. 320, 329, 86 L. Ed. 2d 231, 105 S. Ct. 2633; Eddings v. Oklahoma (1982) 455 U.S. 104, 71 L. Ed. 2d 1, 102 S. Ct. 869.)\n\nDefendant argues the prosecutor misled the jury regarding its function in weighing the factors under section 190.3. Defendant points to the analogy the prosecutor drew between the jury's function and that of an umpire in a baseball game who must follow the rules of the game, and claims the prosecutor thereby encouraged the jury to make its decision mechanically by counting up factors. He also complains the prosecutor referred to a chart upon which the statutory factors were written, reducing the jury's weighing function to a mere outline.\n\nAgain, there was no objection to the argument on this basis, nor do we see any indication the jury was misled by the prosecutor's argument. (See People v. Gonzales, supra, 51 Cal. 4th at pp. 1228-1231.) The prosecutor told the jury that like an umpire, it had to follow the rules already established in making its determination, but explicitly acknowledged that the jury's function was \"not that automatic,\" and \"not that mechanical.\" The prosecutor also clearly acknowledged that the jury's function was a normative one and that it was free to reject his view of the weight to be accorded the various factors. In addition, the court specifically instructed the jury that the weighing process was not mechanical.\n\nDefendant also argues the prosecutor misled the jury by arguing that the only possible verdict was for death, that any other sentence was illogical and unreasonable. Defendant claims the reference to logic and rules in the prosecutor's argument misinformed the jury regarding its inherently subjective decision whether to impose the death penalty, and indicated the existence of a mechanical formula requiring the imposition of a death sentence. Again, there was no objection and the point was waived. On the merits, we do not think it improper to refer to logic in connection with an argument that the only proper verdict was one for death. (See People v. Clark (1992) 3 Cal. 4th 41, 166, 833 P.2d 561 [proper to urge jury to follow \"the law\" as long as appropriateness of penalty is paramount].) The prosecutor clearly indicated the jury's decision was not automatic but personal and subjective and that the jury could impose a life without parole sentence even if it found nothing but circumstances in aggravation. We see no indication the jury was misled. (See People v. Gonzales, supra, 51 Cal. 3d at pp. 1228-1231.)\n\n3. Claimed Boyd error.\n\nWe have held that evidence of a defendant's background and character is admissible under section 190.3, factor (k), only to mitigate the gravity of the crime, and that it is improper for the prosecutor to urge that such evidence should be considered in aggravation. ( People v. Boyd (1985) 38 Cal. 3d 762, 775-776, 215 Cal. Rptr. 1, 700 P.2d 782; see also People v. Edelbacher (1989) 47 Cal. 3d 983, 1033, 254 Cal. Rptr. 586, 766 P.2d 1.)\n\nDefendant claims the prosecutor committed misconduct in arguing that the evidence of defendant's intoxication, offered in mitigation, was actually a factor in aggravation. Again, however, there was no objection here, so the issue was waived. The failure to object was not ineffective assistance of counsel, as no prejudicial prosecutorial misconduct occurred. The prosecutor did not engage in the argument condemned in Boyd, supra, 38 Cal. 3d 762, but argued simply that because the jury had rejected defendant's mental defense based on intoxication, the absence of evidence in mitigation under section 190.3, factor (d) [extreme mental disturbance] was a factor in aggravation. As we have concluded above, this argument, though improper under People v. Davenport, supra, 41 Cal. 3d 247, was not prejudicial.\n\nWe have held that \"aggravating factors under the 1978 death penalty law are limited to those expressly set forth in the statute.\" ( People v. Keenan, supra, 46 Cal. 3d at p. 510; see also People v. Boyd, supra, 38 Cal. 3d at p. 773.) Defendant argues the prosecutor referred to nonstatutory aggravating factors by arguing that defendant is a bad person.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e He asserts that because none of the statutory factors pertains to defendant's character traits, such an argument is improper unless defendant's good character evidence has opened up rebuttal to show bad character.\n\nAgain, the claim was waived for lack of objection. ( People v. Noguera (1992) 4 Cal. 4th 599, 644, 842 P.2d 1160.) In any event, the prosecutor did not argue defendant should receive the death penalty because of evidence of poor character other than that clearly evinced by proper evidence regarding the charged crimes and defendant's other violent misconduct. (See People v. Douglas, supra, 50 Cal. 3d at pp. 535-536 [such argument directed at evidence under § 190.3, factor (b) proper]; People v. Clark, supra, 3 Cal. 4th at p. 171 [defendant's selfishness, explosiveness and violence properly considered under § 190.3, factor (a)]; People v. Gonzalez, supra, 51 Cal. 3d at p. 1231[remorseless quality of crime proper consideration under § 190.3 factor (a)].)\n\nDefendant relies on People v. Noguera, supra, 4 Cal. 4th 599 for the proposition that the prosecutor may never argue the defendant's bad character unless the defendant's character has been put in issue by the offer of good character evidence in mitigation. His reliance is misplaced. Noguera simply held that when the defendant has offered good character evidence in mitigation under section 190.3, factor (k), such evidence may be rebutted by further bad character evidence, and that the rebuttal evidence may be relied upon in argument. ( Id. at p. 644.) We observe, of course, that a defendant's good character evidence offered under section 190.3, factor (k) is admissible only to extenuate the gravity of the crime, and cannot be used as a factor in aggravation. ( People v. Edelbacher, supra, 47 Cal. 3d at p. 1033; People v. Boyd, supra, 38 Cal. 3d at pp. 775-776.) The prosecutor, however, did not argue that evidence under factor (k) should be considered in aggravation.\n\nThe prosecutor was entitled to argue that the circumstances of the crime, a factor in aggravation under section 190.3, factor (a), were relevant to show defendant's brutality, and were to be considered in determining the appropriate penalty. Given the essentially normative quality of the jury's penalty determination, requiring an \"understanding and appreciation of the gravity of the ultimate punishment\" and a \"personal Conclusion from the evidence that death was appropriate under the circumstances for the offense and the offender\" ( People v Edelbacher, supra, 47 Cal. 3d at pp. 1038, 1041), the prosecutor's argument was not improper.\n\nFinally, defendant argues the prosecutor relied upon nonstatutory aggravating factors in arguing that prison would be an inadequate punishment for defendant, as his brutality was such that he \"would not even see the bars.\" We disagree that such argument is inappropriate, as it was based on evidence relevant under section 190.3, factors (a) and (b) and was directed to the jury's \"'\"individualized assessment of the crucial issue whether the death penalty is appropriate for the particular defendant on trial.\"'\" ( People v. Fudge, supra, 7 Cal. 4th at p. 1124.) The prosecutor did not direct the jury's attention to any specific evidence regarding prison conditions, but merely argued that defendant's coarseness and brutality, as evidenced by the charged offenses and other acts of violence, were such that he would be impervious to suffering in prison.\n\nAs we have found no instances of prejudicial misconduct, we reject defendant's state law and constitutional claims.\n\nH. Limitation on defense argument.\n\nThe prosecutor argued pursuant to section 190.3, factor (a), that the circumstances of the charged crimes warranted the imposition of the death penalty. In the course of this argument, he made statements such as: \"if not this case, then what case?\"\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e In response to this argument, the defendant began to argue that this case was not an appropriate one for the death penalty, as other multiple murders had been punished with life in prison without the possibility of parole. The prosecutor objected, and the court sustained the objection and instructed the jury to disregard defense counsel's comments on this point.\n\nDefendant asserts the trial court improperly limited the scope of his argument to the jury in violation of his state and federal constitutional right to due process and a reliable verdict. He argues he had a due process right to deny, rebut or explain the basis offered by the People for the imposition of the death penalty. Because the People opened up the issue of comparing the punishment for a crime such as defendant's to the punishment in other cases, he claims he was entitled to rebut the People's argument with comparisons of his own. In support, he cites Simmons v. South Carolina (1994) 512 U.S. [129 L. Ed. 2d 133, 145, 114 S. Ct. 2187 ] (Simmons).\n\nIn Simmons, supra, 512 U.S. [129 L. Ed. 2d 133, 114 S. Ct. 2187], the court was faced with a question of proper jury instruction in a capital penalty trial. The prosecutor had made much of defendant's potential for future violence, an issue that the high court explained it has permitted to be raised in capital trials. ( Id. at pp. [129 L. Ed. 2d at pp. 141-142] (plur. opn. by Blackmun, J.).) The defense introduced rebuttal evidence that defendant only posed a danger to elderly women, who would not be subject to his depredations if he were in prison. The court, however, refused to instruct the jury that defendant was statutorily ineligible for parole should they elect to impose a life term in prison rather than the death penalty. The plurality opinion reversing the judgment opened with the observation that \"the Due Process Clause does not allow the execution of a person 'on the basis of information which he had no opportunity to deny or explain.'\" ( Id. at p. [129 L. Ed. at p. 141] (plur. opn. by Blackmun, J.).) It held that in a capital penalty trial, when the People put the issue of defendant's future dangerousness in issue and the defendant is legally ineligible for parole, it is a denial of due process to reject the defendant's request to instruct the jury on a natural question raised by the issue of future dangerousness, that is, whether defendant is legally eligible for parole should the jury elect to impose a term of life in prison. (Ibid.) Justice O'Connor, writing for herself and two other Justices, concurred in the judgment, indicating that in a case of statutory ineligibility for parole, when future dangerousness had been put in issue, due process requires that the jury be informed, either through argument or instruction, of the defendant's ineligibility for parole. (Id., at pp. __ [ 129 L. Ed. 2d at pp. 149-151] (conc. opn. by O'Connor, J.).)\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nUnlike in Simmons, in which the court stated future dangerousness may be a permissible consideration in determining penalty, the question of the punishment meted out to persons other than the defendant is generally not relevant to the penalty determination. As we have explained in rejecting the claim that the evidence of the punishment imposed on an accomplice should be admitted and considered at a penalty trial, such evidence bears \"no relevance to the jury's properly guided function at the penalty phase. '\" In capital cases the fundamental respect for humanity underlying the Eighth Amendment . . . requires consideration of the character and record of the individual offender and the circumstances of the particular offense as a constitutionally indispensable part of the process of inflicting the penalty of death (italics added).\"'\" ( People v. Belmontes (1988) 45 Cal. 3d 744, 811, 248 Cal. Rptr. 126, 755 P.2d 310, quoting Lockett v. Ohio (1978) 438 U.S. 586, 604, 57 L. Ed. 2d 973, 98 S. Ct. 2954; and Woodson v. North Carolina (1976) 428 U.S. 280, 49 L. Ed. 2d 944, 96 S. Ct. 2978; see also People v. Cain, supra, 10 Cal. 4th at p. 63; People v. Fudge, supra, 7 Cal. 4th at p. 1124.) The proper focus of a penalty trial is the character or record of the individual offender and the circumstances of his particular offense. ( Woodson v. North Carolina, supra, 428 U.S. at p. 304.) In accord with this rule, this state's capital sentencing scheme requires the jury to make an assessment of the defendant's background and culpability and to make an individualized determination of the appropriate punishment. ( People v. Brown supra, 40 Cal. 3d 512, 540-545; People v. Fudge, supra, 7 Cal. 4th at p. 1124.)\n\nTo the extent that defendant claims, on the basis of Simmons, supra, 512 U.S. [129 L. Ed. 2d 133, 114 S. Ct. 2187], that regardless of the relevance of the prosecutor's point, once it was made, defendant was entitled to rebut it, we reject that claim as well. In such a situation, it would seem defendant's proper remedy would be to object to the argument and secure an admonition to the jury to disregard it, rather than to use the argument as a wedge to introduce an irrelevant factor into his own argument. In any event, defendant's comparative culpability was not placed in issue in this case in the way future dangerousness was in Simmons. There, it appears both the prosecutor and the defense presented evidence on the issue, the prosecution dwelt on the issue in argument, and a question propounded by the jury established it had focused on the problem. Here, by contrast, no evidence was presented on the question of comparative culpability. The prosecutor made only a brief, oblique and rhetorical reference to the point when he said - without objection - \"if not this crime, then what crime?\" It is clear that far from intending to open up the issue of comparative culpability, the prosecutor wished to focus the jury's attention on the horror of defendant's crimes in an effort to stress defendant's individual culpability for these particular crimes. No jury question indicated any interest in the issue of comparative culpability, and defendant did not request any special instruction on the point. Under the circumstances, we do not think that principles of fundamental fairness or due process required the court to permit the defendant to argue regarding his comparative culpability - an issue that is basically unrelated to the jury's function at the penalty trial.\n\nI. Viewing San Quentin.\n\nBefore the penalty trial began, defendant moved to have the jury view the facilities at San Quentin prison, either in person or by film, including the gas chamber, death row and the cells where prisoners serving life terms are housed. The trial court denied the motion, regarding the method of incarceration or execution to be irrelevant under Woodson v. North Carolina, supra, 428 U.S. 280, 304.\n\nDefendant argues the prosecutor opened the door to such evidence by arguing defendant would not be adequately punished by imprisonment. This argument had not been made when the trial court ruled on the motion, and defendant did not renew the motion to view San Quentin after the prosecutor's argument. Accordingly, he can not charge the court with an abuse of discretion for failing to protect his right to fair rebuttal. In any event, the prosecutor did not argue that the particulars of confinement at San Quentin prison made it an inadequate punishment for defendant, but that defendant was so coarsened and brutal that he would not be disturbed or adequately punished by incarceration. Accordingly, defendant's claim that he was entitled to have the jury view San Quentin as a matter of fair rebuttal must fail.\n\nDefendant concedes we have consistently held evidence regarding the facilities on death row and the manner of carrying out the death penalty to be irrelevant to our capital sentencing scheme. (See, e.g., People v. Fudge, supra, 7 Cal. 4th at pp. 1123-1124 and cases cited; People v. Daniels (1991) 52 Cal. 3d 815, 877-878, 277 Cal. Rptr. 122, 802 P.2d 906; People v. Harris (1981) 28 Cal. 3d 935, 962, 171 Cal. Rptr. 679, 623 P.2d 240.) He argues we have been consistently wrong. We decline to revisit the issue.\n\nJ. Cumulative error.\n\nDefendant contends a combination of judicial error, prosecutorial misconduct and ineffective assistance of counsel requires reversal of the death judgment. We have rejected each of his claims on the merits and accordingly find no possibility of any cumulative prejudicial impact on the penalty trial.\n\nIV. CONCLUSION\n\nBased on the foregoing, we conclude the judgment should be affirmed in its entirety.\n\nARABIAN, J., BAXTER, J., GEORGE, J. and WERDEGAR, J., Concurring.\n\nKENNARD, J.; Concurring:\n\nI concur in the judgment and in the majority opinion. I write separately to explain why the trial court erred in sustaining the assertion of the marital testimonial privilege by defendant's wife when defendant attempted to call her as a witness at the penalty phase.\n\nThe marital testimonial privilege is codified in Evidence Code section 970, which provides: \"Except as otherwise provided by statute, a married person has a privilege not to testify against his spouse in any proceeding.\" (Italics added.)\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nEvidence Code section 970 replaced other code provisions that had conferred a broader privilege. Under former section 1881 of the Code of Civil Procedure and former section 1322 of the Penal Code, a party to an action could prevent his or her spouse from testifying either for or against the spouse who was a party, and in criminal prosecutions a defendant's spouse could decline to testify for or against the defendant. Evidence Code section 970 gives the testimonial privilege exclusively to the nonparty spouse and limits the privilege to testimony \"against\" the spouse who is a party. A Law Revision Commission comment explains the rationale for eliminating the testimonial privilege entirely as to testimony \"for\" a party spouse, as follows:\n\n\"The Commission has concluded that the marital testimonial privilege provided by existing law as to testimony by one spouse for the other should be abolished in both civil and criminal actions. There would appear to be no need for this privilege, now given to a party to an action, not to call his spouse to testify in his favor. If a case can be imagined in which a party would wish to avail himself of this privilege, he could achieve the same result by simply not calling his spouse to the stand. Nor does it seem desirable to continue the present privilege of the nonparty spouse not to testify in favor of the party spouse in a criminal action. It is difficult to imagine a case in which this privilege would be claimed for other than mercenary or spiteful motives, and it precludes access to evidence which might save an innocent person from conviction.\" (Cal. Law Revision Com. com., 20 West's Ann. Code Civ. Proc. (1983 ed.) former § 1881, p. 322.)\n\nHere, defendant called his wife as a witness to testify for him at the penalty phase of his capital trial. Because the proposed testimony was to be \"for\" rather than \"against\" the party spouse, defendant's wife could not claim the testimonial privilege of Evidence Code section 970, and the trial court erred in sustaining her claim of privilege.\n\nThe majority states that the trial court \"may have concluded\" that defendant's wife invoked the privilege to avoid \"potentially damaging questions on cross-examination.\" (Maj. opn., ante, at p. 81.) This may be true (although it is speculative on the present record), but it is irrelevant. When a defendant in a criminal proceeding calls his or her own spouse as a witness, the spouse is not testifying \"against\" the defendant within the meaning of Evidence Code section 970. Therefore, the testimonial privilege of that section is not available, regardless of the spouse's reason for asserting the privilege and regardless of the opinion of the spouse or of the trial court that the testimony on both direct and cross-examination would, on balance, be unfavorable to the defendant. As a respected commentator on California law explains: \"Our former law allowed a witness spouse to refuse to testify even though the party spouse sought the testimony for his own benefit. This aspect of the privilege was abolished by the Code for both civil and criminal actions.\" (2 Witkin, Cal. Evidence (3d ed. 1986) Witnesses, § 1171, p. 1119.)\n\nAlthough the trial court erred in sustaining defendant's wife's assertion of the marital testimonial privilege, the record fails to establish that defendant was prejudiced by the trial court's error because defendant made no offer of proof as to his wife's proposed testimony. (See maj. opn., ante, at p. 81.) Therefore, with the understanding that the majority is not holding that the marital testimony privilege may apply when one spouse calls the other spouse as a witness, I join the majority opinion in affirming the judgment.\n\nMOSK, J.; Concurring and Dissenting:\n\nI concur in the judgment in all respects save one: I would vacate the sentence of death.\n\nAt the penalty phase, defendant's jury, like all others, was instructed to weigh the aggravating and mitigating circumstances against each other and thereby determine whether death or life imprisonment without possibility of parole was the appropriate penalty. How could the jurors have possibly discharged their obligation when, as here, the prosecutor presented substantial evidence in aggravation but defense counsel did not present any evidence in mitigation? The answer is obvious: they could not.\n\nTherefore, I would set aside the death sentence as unreliable under the Eighth Amendment to the United States Constitution and article I, section 17 of California Constitution. (See In re Ross (1995) 10 Cal. 4th 184, 216, fn. 1, 892 P.2d 1287 (dis. opn. of Mosk, J.) [implying that any sentence of death should be set aside as unreliable under the Eighth Amendment and article I, section 17 if defense counsel introduced no available mitigating evidence]; People v. Stansbury (1995) 9 Cal. 4th 824, 835, 889 P.2d 588 (conc. \u0026 dis. opn. of Mosk, J.), reiterating People v. Stansbury (1993) 4 Cal. 4th 1017, 1073-1075, 846 P.2d 756 (conc. \u0026 dis. opn. of Mosk, J.) [same], revd. sub nom. Stansbury v. California (1994) U.S. [128 L. Ed. 2d 293, 114 S. Ct. 1526]; People v. Diaz (1992) 3 Cal. 4th 495, 577, 834 P.2d 1171, 11 Cal. Rptr. 2d 353 (conc. \u0026 dis. opn. of Mosk, J.) [same]; see also People v. Howard (1992) 1 Cal. 4th 1132, 1197, 824 P.2d 1315 (conc. \u0026 dis. opn. of Mosk, J.) [finding a verdict of death unreliable under the Eighth Amendment and article I, section 17 when available mitigating evidence was not introduced]; People v. Sanders (1990) 51 Cal. 3d 471, 531-533, 273 Cal. Rptr. 537, 797 P.2d 561 (dis. opn. of Mosk, J.) [same]; People v. Lang (1989) 49 Cal. 3d 991, 1059-1062, 264 Cal. Rptr. 386, 782 P.2d 627 (conc. \u0026 dis. opn. of Mosk, J.) [same]; People v. Williams (1988) 44 Cal. 3d 1127, 1158-1161, 245 Cal. Rptr. 635, 751 P.2d 901 (conc. \u0026 dis. opn. of Mosk, J.) [to similar effect under the Eighth Amendment]; People v. Deere (1985) 41 Cal. 3d 353, 360-368, 222 Cal. Rptr. 13, 710 P.2d 925 [same].)\n\n\u003cspan class=\"fn\"\u003e1. In his testimony at the hearing, defendant stated the interview began with the deputies asking him when he had last seen Randy Norris. He responded that he didn't recall. The interview continued: \"Q: What is the next thing that was said? [P] A: Something to do with my tow truck, I forgot about something, about he had stole it or where it was, if he stole the truck or something to that effect. [P] Q: What is the next thing that was said? [P] A: Anyway after the tow truck conversation was - well, he says I will show you a picture. [P] Q: Did someone show you a picture? [P] A: Yes sir. [P] Q: Who showed you a picture? [P] A: Deputy Kushner [P] Q: What did he show you? [P] A: He showed me a photograph of a body. [P] Q: Did he say anything when he showed you the photograph? [P] A: He says - He pulled it out. He showed it to his partner. First he says it is not as pretty as the tow truck but - you know - it will have to do and he threw that in front of me. [P] Q: What did you say, if anything? [P] A: I says well what the hell is this? [P] Q: What was said? [P] A: He says you don't recognize them? And I says no, am I supposed to? And he said something to the effect we believe something - we believe that you and Randy entered that house and killed those people. [P] Q: What did you say? [P] A: And I said no way, so he reaches into his little folder, looks a lot like that one there, and pulled out another photograph, showed it to his partner and threw that in front of me. It was a knife. It was a picture of a folding knife, black folding knife, approximately three and half inch blade. [P] Q: Was something said about that knife? [P] A: Yes. He says do you recognize that knife? [P] Q: What did you say? [P] A: I says it looks a lot like the one I have. [P] Q: Up to that point, had anybody advised you of your rights? [P] A: No, sir. [P] Q: Had you up to that point asked anything about an attorney? [P] A: At this point is when I said - well - They said well, we believe this is your knife. I says well fine, I want an attorney right there and then. [P] Q: What was said? [P] A: He says something about well, whichever one of you talks to us is going to be the one that gets off or something, and that's when they presented me with Randy's jacket and his picture on it. [P] Q: Talking about Randy Norris? [P] A: Right [P] Q: Was something said about Randy Norris at that time? [P] A: Yes. He says well they were going to go question him next, that they had him in custody - you know - they had a picture of him and it had a robbery on the caption for the charges [P] Q What did you say, if anything? [P] A: And then I said well - What did I say after that? I don't recall offhand. [P] Q: Was something additional said about Randy Norris? [P] A: I believe so, but I can't remember at the moment. [P] Q: Now did you ask to see an attorney on more than one occasion or just one occasion? [P] A: No. I asked again. I said well I want to see an attorney now or I am not talking. [P] Q: What was said in response? [P] A: Response was Deputy Morck started threatening me with the gas chamber. Well, you're going to get the gas and that line up. [P] Q: After that line up, what was said? [P] A: He said to me well, we think you killed those people and you know you are going to get gassed. Then you talk to us or your partner does - whatever one doesn't is going to go to the gas chamber. [P] Then there was something to do, oh, there is blood found in the house - there was - you have cuts on your hand. We believe that's your blood because it leads over to your house. [P] Q: Were you eventually advised of your rights? [P] A: I think it was just before I was getting sick from - I was starting to get real sick from coming down from heroin. [P] Q: Did - [P] A: I had - I told them - said I got to leave or there's going to be a hell of a mess here. [P] Q: Do you mean you were nauseated? [P] A: Yes sir. [P] Q: And it was at that time that you were advised of your rights? [P] A: Right about that time, yes, sir. [P] . . . . Q: The questioning then effectively terminated? Was it over after you got sick? [P] A: Yeah. [P] The Court: Did you get sick? [P] A: Asked to be taken to the bathroom and I was - [P] The Court: Did you get sick: [P] The Witness: Yes, sir, I did. . . . Santa Ana police officers escorted me to the nearest restroom, and there I got sick.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. See footnote 1, ante.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. We also reject defendant's related argument that counsel were incompetent for failing to move to suppress the statements pursuant to Evidence Code section 352, on the ground they were unreliable or untrustworthy as the result of the detectives' threats and the defendant's medical condition, even if the statements were not technically involuntary. As we have seen, the omission was a reasonable tactic, and the record does not establish that defendant gave the statement as the result of any threat or that his medical condition affected his ability to make a reliable statement.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. In addition, counsel's acquiescence in the admission into evidence of a card such as is used to prompt deputies giving Miranda warnings was not incompetent, though the card was not the one used in defendant's interrogation. The record on appeal does not demonstrate or even suggest that the card used in defendant's own interrogation would have provided any evidence in support of his motion to exclude his statements.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. We reject defendant's claim that counsel should not have conceded that the blood and fingerprint evidence was damning without consulting defense experts. Defendant points to no prejudice arising from this failure to contact defense experts, and he must do more than surmise that defense experts might have provided more favorable testimony. ( People v. Kaurish (1990) 52 Cal. 3d 648, 689, 276 Cal. Rptr. 788, 802 P.2d 278.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Defendant also claims the prosecutor's misconduct deprived him of the right to a reliable determination of guilty and penalty under the \"Sixth, Eighth and Fourteenth Amendments to the United States Constitution and their California analogs.\" We need not reach the claim, as no argument or authority is offered in support. In any event, finding no misconduct, we reject it.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Defendant claims any failure to preserve the claim by making the appropriate motion below or by failing to make an adequate showing was ineffective assistance of counsel. Defendant cannot demonstrate prejudice on the appellate record, however. As we have noted, it is unlikely immunity for drug offenses would have procured the testimony of the witnesses, who faced some danger of liability as defendant's accomplices, and defendant cannot show on this record there were no strong governmental interests against a grant of immunity for any accomplice liability.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Defendant argues any error in excluding Lupori's testimony was federal constitutional error requiring reversal unless the jury's verdict was \"surely unattributable\" to the error, citing Sullivan v. Louisiana (1993) 508 U.S. [124 L. Ed. 2d 182, 189, 113 S. Ct. 2078] [holding error in instructing on reasonable doubt not subject to review for harmless error, but explaining harmless error standard].) The standard is inapplicable; any claim of denial of the right to effective assistance of counsel is Judged by the standard set out in Strickland, supra, 466 U.S. at pages 691-692; we have found no other possible federal constitutional error.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Defendant's cursory claim he was also prejudiced at the penalty trial is rejected. The jury had the evidence alluded to above regarding defendant's defense of unconsciousness. The offer of proof at trial did not indicate Croffoot or Sandoval could supply other general character or background evidence regarding defendant that would have been relevant to the jury's penalty determination.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. We note that defendant did not move to strike the evidence of the condition of the car once the prosecutor failed to establish the preliminary fact through defendant's testimony.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Defendant claims the jury was prejudiced by the prosecutor's argument to the court in favor of admission of the evidence, but we observe that the prosecutor's argumentative statements regarding his entitlement to present the evidence were made at sidebar, and could have had no effect on the jury.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. We reject the People's claim the evidence was admissible under Evidence Code section 403, subdivision (c)(4) [proffered evidence is statement or conduct of particular person and preliminary fact is whether that person made the statement or so conducted himself]. The proffered evidence was not conduct, but evidence of the condition of a car. This evidence was relevant only if the People could sufficiently establish the preliminary fact that defendant was responsible for the condition of the car.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. See, e.g., Morgan v. Illinois, supra, 504 U.S. at pages 728-729. We have observed that \"the duty to examine prospective jurors and to select a fair and impartial jury is a duty imposed on the court . . . . (Code Civ. Proc., § 223, subd. (a); former Pen. Code, § 1078.)\" ( People v. Mattson (1990) 50 Cal. 3d 826, 845, 268 Cal. Rptr. 802, 789 P.2d 983.) One court has interpreted this language as vesting in the trial court the power and obligation to excuse biased prospective jurors on its own motion. ( People v. Jiminez (1992) 11 Cal. App. 4th 1611, 1621 [rejecting argument Code of Civ. Proc., § 225 deprives court of such power].) The Jiminez court cautioned, however, that trial courts do not and should not habitually exercise this power. ( People v. Jiminez, supra, 11 Cal. App. 4th at p. 1621, fn. 3.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. We have stated that counsel must object to the trial court's misstatements on voir dire in order to preserve the claim for appeal. ( People v. Freeman, supra, 8 Cal. 4th 450, 577-578.) Whether defendant adequately objected is somewhat unclear, so we may reach the merits. (See People v. Champion, supra, 9 Cal. 4th 879, 908, fn. 6, and cases cited.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Defense counsel rejected the prosecutor's suggestion that the court give a pinpoint instruction not to speculate about witnesses who did not testify.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Defendant claims that the court's failure to impanel a new jury violated his rights under the Eighth and Fourteenth Amendments of the United States Constitution. He failed to make such an argument below and may not raise it for the first time here. In any event, we see no constitutional violation. ( People v. Rowland, supra, 4 Cal. 4th at p. 269, fn. 7.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Nor can defendant establish any ineffective assistance in failing to challenge the juror was prejudicial, especially since counsel did not exhaust his peremptory challenges. Failure to challenge a juror for cause is not prejudicial if the juror could have been removed by peremptory challenge. (See People v. Kirkpatrick, supra, 7 Cal. 4th at p. 1005; see also People v. Bittaker, supra, 48 Cal. 3d at pp. 1087-1088.) Presumably, when no such peremptory challenge has been exercised, the defendant would have to show that counsel's failure in that regard was also incompetent and prejudicial. As we have already observed, counsel's decision to accept the jury without exercising further peremptory challenges is a tactical decision it is unlikely the reviewing court will second-guess on appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Defendant also claims he was deprived of his \"state law right to a unitary jury,\" a claim he raised in his motion for new trial. He offers no authority or argument in support. In fact, defendant had a unitary trial before a single jury. To the extent he may be understood to claim he had a right to have the same jurors decide guilt and penalty, we have already rejected such a claim. ( People v. Cain, supra, 10 Cal. 4th at pp. 66-67 [excusal of juror for good cause between guilt verdict and penalty trial does not necessitate retrial of guilt phase]; People v. Fields (1983) 35 Cal. 3d 329, 351, fn. 9, 197 Cal. Rptr. 803, 673 P.2d 680 [same].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The prosecutor separately discussed section 190.3, factors (e) [victim participant], (f) [moral justification], (g) [extreme duress], (j) [defendant accomplice], and (k) [circumstances extenuate gravity of crime] and declared that the absence of evidence in mitigation under these factors made each factor one in aggravation. In addition, he argued that he believed the jury had rejected defendant's evidence of mental impairment due to intoxication, and that defendant's use of drugs and lack of mental impairment was a circumstance in aggravation under section 190.3, factor (h) [impaired mental state]. He also argued that evidence was lacking as to section 190.3, factor (d) [extreme emotional disturbance], so that this was to be used as a factor in aggravation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. The prosecutor argued: \"You're sitting in judgment of an uncaring, violent, compulsive, brutal remorseless killer. [P] That's what you're sitting in judgment of. And that must be evident from the facts.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. This statement occurred in the course of the following argument: \"But I ask you, talking about [factor (a)], ladies and gentlemen, if the death penalty is not warranted in this crime, in what crime is it: What are you waiting for if you don't vote for the death penalty in this case? It defies logic and reason to think that the murder of these two elderly people by their next door neighbor does not call for that punishment. [P] Now, nothing you do, very obviously, is going to give life back, to Edwin and Mary Marriott. But you can give them something. You can give them a just verdict. You can give them a verdict called for by the evidence, not because you're mad at anybody, not because you want revenge, not for any base thing. You can just say that we've looked at what's been presented to us and what's warranted; what there is reasonable ground for is the punishment of death. [P] And I repeat to you. If it's not this case, then what case [?]\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Simmons, supra, 512 U.S. [129 L. Ed. 2d 133, 114 S. Ct. 2187], does not provide support for defendant's claim that the limitation on his argument violated his right to a reliable penalty determination under the Eighth Amendment to the federal Constitution. In Simmons, only the separate Concurring opinion of Justice Souter, in which Justice Stevens joined, indicated a concern that the court's refusal to instruct the jury as requested implicated the defendant's right to a reliable penalty determination. ( Simmons, supra, 512 U.S. [129 L. Ed. 2d at pp. 147-149] (conc. opn. by Souter, J.).) As defendant provides no further relevant authority on this point, the claim is rejected. His offhand claim that the prosecutor undermined the reliability of the verdict by asking the jury to do Justice for the victims is unsupported by the record, which shows the prosecutor asked for a just verdict based upon the record and not upon anger, a motivation for revenge or other \"base thing.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. A companion provision, Evidence Code section 971, states: \"Except as otherwise provided by statute, a married person whose spouse is a party to a proceeding has a privilege not to be called as a witness by an adverse party to that proceeding without the prior express consent of the spouse having the privilege under this section unless the party calling the spouse does so in good faith without knowledge of the marital relationship.\" A third provision, Evidence Code section 972, lists situations in which the testimonial privileges of Evidence Code section 970 and 971 are not available.\u003c/span\u003e\n\n",
    "body_length": 201091,
    "citedas": [
      "12 Cal.4th 415",
      "12 Cal.4th 825A",
      "907 P.2d 373",
      "48 Cal.Rptr.2d 525"
    ],
    "attorneys": "Paul A. Renne and Betty Ann Durham, under appointment by the Supreme Court, Cooley, Godward, Castro, Huddleson \u0026 Tatum, James R. Batchelder, David J. Estrada, Steven L. Friedlander, Kristin K. Croft, Jeffrey N. Hyman, Deborah J. Kanarek, Philip M. Guess and Christopher E. Stretch for Defendant and Appellant. Daniel E. Lungren, Attorney General, George Williamson, Chief Assistant Attorney General, Carol Wendelin Pollack, Assistant Attorney General, John R. Gorey, Susan Lee Frierson and Mary Sanchez, Deputy Attorneys General, for Plaintiff and Respondent.",
    "category": [
      "243",
      "36",
      "78"
    ],
    "judges": "Lucas, C.J.; Arabian, J., Baxter, J., George, J. and Werdegar, J., Concurring. Kennard, J.; Concurring separately. Mosk, J.; Concurring and Dissenting separately.",
    "citation_count": 1252
  }
}
