{
  "id": "woAqHJQBep42eRA9VNAq",
  "document": {
    "title": "Wood v. State",
    "full_title": "Hubert Allen WOOD v. STATE of Maryland",
    "jurisdiction": "Court of Special Appeals of Maryland",
    "date": "2012-12-21T00:00:00+0000",
    "docket": "No. 1635",
    "body": "WATTS, J. Following a trial from June 13, 2011, through June 16, 2011, a jury in the Circuit Court for Cecil County convicted Hubert Allen Wood, appellant, of first-degree murder.1 See Md.Code Ann., Crim. Law Art. (“C.L.”) § 2-201 (first-degree murder). On August 24, 2011, the circuit court sentenced appellant to life imprisonment, with all but eighty years suspended.2 Appellant noted an appeal raising five issues, which we quote: *254Did the [circuit] court fail to comply with Maryland Rule 4-215(e)? I. Did the [circuit] court err in failing to determine, on evidence presented on the record, whether [a]ppellant was competent to stand trial? II. Did the [circuit] court err in failing to instruct the jury on the defenses of legally adequate provocation and voluntary intoxication? III. Is the evidence insufficient to sustain a conviction for first[-]degree murder? IV. Did the [circuit] court err in excluding hearsay evidence that the victim identified persons other than [a]ppellant as those responsible for assaulting the victim shortly before he was killed? V. For the reasons set forth below, we answer each question in the negative. We, therefore, affirm the judgment of conviction. We remand the case to the circuit court, however, for the limited purpose of reimposition of the sentence followed by a period of probation in accordance with Criminal Procedure Article § 6-222. FACTUAL AND PROCEDURAL BACKGROUND On February 17, 2010, Deputy Jesse Alexander of the Cecil County Sheriffs Office responded to a call reporting a death at 1720 East Old Philadelphia Road in Elkton, Cecil County, Maryland. Upon entering the residence located at 1720 East Old Philadelphia Road, Deputy Alexander found Daniel Cur-ran deceased. Dr. Zabiullah Ali, an assistant medical examin*255er, performed an autopsy on Curran, and reported finding stab wounds to Curran’s head, neck, upper chest, hand, and leg. Dr. Ali determined that Curran died as a consequence of “multiple sharp force injuries” and that the manner of death was homicide. On September 22, 2010, appellant was indicted in connection with Curran’s death. (1) Pretrial Proceedings (a) Appellant’s Counsel On October 13, 2010, Thomas E.L. Klenk, Assistant Public Defender, entered his appearance in the case on behalf of appellant. On April 17, 2011, appellant wrote a letter to the circuit court, stating, as follows: I am writing because I have been incarcerated since October 1, 2010 and still have[not] received a Discovery, which I know was filed [October 13, 2010, and] entered [October 15, 2010,] and the Motion complied back [January 21, 2011], with Rule 4-263. I[have] been having problems with my Defense Attorney Thomas Klenk and I believe he has[not] issued me [ ] my copy of the Discovery. Please issue me a copy of this Discovery. On May 6, 2011, at a pretrial hearing, another attorney appeared in place of Klenk, and the following exchange occurred between appellant and the circuit court: [APPELLANT]: Your Honor, I have not been issued discovery. For seven months I have been incarcerated.... I’ve only seen my lawyer twice since I’ve been incarcerated the past seven months. And to be honest with you, he hasn’t really—I don’t know how to say this. THE COURT: You don’t think he’s effectively representing you. [APPELLANT]: There we go, yes. THE COURT: Well, again, that’s something that you need to talk to [Klenk] about on Tuesday. [APPELLANT]: Well, I just want to know why I’ve been incarcerated. *256THE COURT: Because you’re charged with first[-]degree murder. * * * [APPELLANT]: Right. But I don’t have any evidence shown towards me. THE COURT: [Prosecutor], does the [S]tate have any evidence against this gentlem[a]n? [PROSECUTOR]: Oh, the [S]tate has overwhelming evidence against this gentleman.... [Discovery was provided to [Klenk] in December of 2010[.] ... [Discovery was f]airly extensive, your Honor, as you would imagine in a first-in a second[-]degree murder case. THE COURT: Yeah, I would. So it appears that the [S]tate has given the discovery to [Klenk]. Now if he hasn’t shared it with you you have to ask him why, [appellant], but I can’t answer that question. Certainly if you don’t think he’s representing your interests you have the right to take a number of courses of action. You can keep him as your attorney. You can dismiss him as your attorney. But if [you do] that the public defender is not going to provide you with another lawyer. So if you wanted to represent yourself—which, you know, we have a saying in the law, one who represents himself, even if that person’s an attorney, has a fool for a client. So if you have problems with Mr. Klenk’s representation of you, you can certainly address them by way of a letter to ... the district public defender.... And I would put your complaints in a letter [to the district public defender], after you share them with Mr. Klenk. I think you ought to give Mr. Klenk an opportunity to address your concerns first. Maybe he has some plans for doing that. If you are not satisfied, then contact [the district public defender] and tell [the district public defender] what’s going on. Ask him to intervene for you. Does that make sense? A VOICE: Yeah. THE COURT: Okay. So the matter is set in for next Tuesday. Hopefully Mr. Klenk, who is sick, will be well *257enough to attend next week, and you will be able to talk to him about these matters; and you’ll be before a judge, [appellant]. If you want to address the court with regard to any of these concerns you can certainly do that. [APPELLANT]: Thank you. Klenk continued to represent appellant throughout pretrial hearings of May 10, 2011, May 20, 2011, and May 26, 2011, the trial, from June 13, 2011, through June 16, 2011, and at sentencing on August 24, 2011, and appellant did not raise an issue as to Klenk’s representation again. (b) Competency to Stand Trial On January 21, 2011, at a pretrial hearing, appellant’s counsel advised the circuit court that appellant's mother had informed him that appellant had “a history of some admissions in the hospitals[,]” which raised an issue he wanted to pursue. On January 28, 2011, appellant’s counsel filed a “Suggestion of Incompetency,” formally requesting a competency evaluation and the circuit court granted the request. On the same day, the circuit court issued an Order for In Custody Competency Evaluation, ordering the Department of Health and Mental Hygiene to examine appellant “to determine whether [appellant] is able to understand the nature or object of the proceedings and to assist in his defense[.]” On April 11, 2011, Andrew W. Donohue, DO, a forensic psychiatrist, submitted a letter to the circuit court, stating as follows: Pursuant to [the] order under Criminal Procedure § 3-105 of January [2]8, 2011,1 attempted to examine [appellant]. I was unable to complete the evaluation because [appellant] refused to participate, stating that he did not think that the examination was necessary and he expressed concern that to take part would potentially incriminate him. If [appellant] changes his mind and agrees to take part in the evaluation, I would be happy to see him. On May 10, 2011, at a pretrial hearing, appellant’s counsel informed the circuit court of appellant’s refusal to participate *258in the competency evaluation.3 On May 26, 2011, at a pretrial hearing, appellant’s counsel advised the circuit court that the request for a competency evaluation was being withdrawn. The following exchange occurred: [APPELLANT’S COUNSEL]: Your Honor we are here for an issue of competency to stand trial. And after further discussions with [appellant], both substantively and about this particular issue, I have come to the conclusion that I should withdraw my request. And that is with [appellant’s concurrence. Is that correct, [appellant]? [APPELLANT]: Yes, sir. THE COURT: Okay. And you understand the consequences of withdrawing that motion? [APPELLANT]: Yes. [APPELLANT’S COUNSEL]: And the consequences are there will be no such evaluation? [APPELLANT]: Yes. [APPELLANT’S COUNSEL]: All right. THE COURT: Because it’s my understanding they attempted to perform an evaluation and they wrote back that at that time you refused to participate, so that’s why we were going to send you for further evaluation at Clifton T. Perkins. But you are withdrawing the motion? [APPELLANT]: Yes, Your Honor. THE COURT: And that’s all moot. On June 13, 2011, the case proceeded to trial. (2) Trial Proceedings (a) Witness Testimony Because our resolution of the instant appeal involves the sufficiency of evidence, we set forth the lengthy and detailed *259facts of the case. The facts are set forth below in the order the witnesses testified at trial. As a witness for the State, Michael Martin, a friend of the deceased, testified that he had known Curran, whom he thought of as a “brother,” for approximately sixteen years, and that he saw Curran twice a week. Martin described Curran as follows: “He was an old guy. Pretty feeble. Dying of cancer, ... and liver was shot and [his] kidneys were gone, and [he was] on [ ] medications and he drank and smoked.”4 Martin testified that, in February 2010, Curran lived alone in a two-room house with his dog. According to Martin, Curran stored “his pills, bottles of pills, medication” and money in a dresser drawer in his bedroom. Martin testified that he drove Curran to the doctor’s office and the pharmacy to fill his prescriptions because Curran “could barely walk.” Martin testified that he last saw Curran on Tuesday, February 9, 2010. Martin last spoke with Curran by telephone on Fridays February 12, 2010, around 5:00 p.m., but was unable to see him that day due to a snowstorm. Martin testified that, on Wednesday, February 17, 2010, he went to visit Curran to “[c]heek in on him.” When he arrived at Curran’s house, Martin discovered that the door, although closed, was already unlocked. According to Martin, he walked to the bedroom and “saw the dresser drawer on the floor upside down.” Martin testified that the house was “[t]rashed[,]” clothes were laying all over the floor, the “nightstand was pulled apart[,]” and a lamp was “knocked over, leaning[.]” Martin found Curran lying on his side on the bed. Martin testified that Curran was “gray[,]” “rock hard and cold as ice.” Martin drove to Wright’s Country Deli (the “Deli”) and told Carol Wright to call the police. Wright called 911 and law enforcement officers arrived at the Deli. On cross-examination, Martin testified that during questioning by law enforcement officers, he provided a list of names of *260people who had recently visited Curran. The list Martin provided to law enforcement officers included the names Archie Nunley, Archie’s brother, John Nunley, Archie’s nephew, “Mikey,”5 and Robert “Tex” Archer. According to Martin, these men visited with Curran and drank beer, and some of them used drugs, but “they basically took care of’ Curran when they were at Curran’s house. As a witness for the State, Wright testified that she works at the Deli and that Curran had been a customer since 1993. Wright testified that Curran mostly “bought alcohol and cigarettes” and sandwiches from the Deli. According to Wright, Curran received all of his mail at the Deli, the Deli “ran a tab for him, and once a month [Curran] would pay his tab.” Wright testified that the Deli had a note system with Curran, such that if Curran was unable to stop by the Deli to pick something up, he would write notes and send friends to the Deli to get what he needed at the time. Wright testified that when Curran “was sober, he was awesome. If he wasn’t sober, we didn’t let him in the store.” According to Wright, on Thursday, February 11, 2010, Curran visited the Deli to buy two packs of cigarettes. Wright never spoke to or saw Curran again. Wright testified that she knew appellant, who lived next door to the Deli with his mother, Candace Carpenter. Wright testified that, on Friday, February 12, 2010, around 7:00 p.m., appellant visited the Deli with a note signed by Curran authorizing the purchase of a twelve-pack of beer. Wright testified that she gave the twelve-pack of beer to appellant, charged the beer to Curran’s tab, and placed the note into a “bill box” with the other notes signed by Curran. Later that night, on February 12, 2010, appellant came back to the Deli and asked for more beer for Curran. Because appellant did not have another note from Curran, Wright told him that she could not help him. Wright testified that the February 12, *2612010, note delivered by appellant was the last note the Deli received from Curran. On cross-examination, when asked by appellant’s counsel to describe Curran’s condition in February, 2010, Wright testified that Curran had just been released from the hospital because he “had been beaten very badly[,]” and had “[b]lack eyes, swollen face, busted lip, [and] scrapes all over his face.” As a witness for the State, Antonio Buckland, Curran’s neighbor, testified that the last time he saw Curran was on Wednesday, February 10, 2010, when he took pizza to Curran. Buckland testified that, on that date, Curran appeared to have been “[b]adly beaten[.]” During direct examination of Buck-land, the prosecutor presented State’s Exhibit 5 to Buckland, which Buckland identified as a photograph of a calendar he had given to Curran. According to Buckland, Curran marked off each day on the calendar, and the last time he visited Curran, February 10 had been marked off on the calendar. State’s Exhibit 5, a photograph of the calendar, was admitted into evidence. State’s Exhibit 5 showed that the calendar had been marked off through February 11, 2010. During cross-examination, Buckland testified that he—like Martin—provided law enforcement with the names of recent visitors to Curran’s house, including Tex, “Robbie,” Archie, “James,” John, and Mike (John’s son). As a witness for the State, Samuel Ingram, a friend of Curran’s for thirteen or fourteen years, testified that he last saw Curran in February 2010, a little over a week before Curran’s body was found on February 17, 2010. According to Ingram, on that visit, appellant was at Curran’s house, sitting in a chair next to Curran’s bed, where Curran was propped up against the wall. Ingram testified that Curran had been “beat up pretty bad. He was black and blue, still bloodied up.” Ingram testified that appellant told him “Tex was involved with it [the beating]” and that he (appellant) had seen Tex walk out of Curran’s house, get into a black truck and drive off. Ingram testified that he responded to appellant’s statement by saying, “[r]eally, Tex drove off? [Appellant] said, *262Yes. I said, Well, I said, Really? He said, Well, I’m sorry, it was a neon colored truck. I said, That’s funny because Tex don’t drive.” According to Ingram, he had seen Tex a week before his visit to Curran’s house and he had dropped Tex off at the train station in Wilmington, Delaware. Ingram testified that on the day of his last visit to Curran’s house, he went to the Deli with appellant to buy Curran a six-pack of beer. According to Ingram, appellant “tried to get a 12 pack of beer” on Curran’s tab, but the Deli would not permit appellant to do so. Ingram testified that, after picking up the beer for Curran—which he (Ingram) purchased—he and appellant returned to Curran’s house. When Ingram left Curran’s house that evening, appellant was still there. Ingram never saw or heard from Curran again. As a witness for the State, Detective Chris Lewis of the Cecil County Sheriffs Office testified that, on February 17, 2010, he responded to Curran’s house, where he observed Curran deceased, lying on a bed, with blood on his clothing as well as on the bed. Detective Lewis testified that Curran was wearing “what appeared to be a hospital gown,” and that he observed “apparent stab wounds” on Curran’s leg and chest. Around 3:00 a.m. on February 18, 2010, Detective Lewis spoke with appellant in a recorded interview at the Sheriffs Office. Appellant told Detective Lewis that, on February 17, 2010, he (appellant) had been with Alicia Brown and Helen Morris6 at Steele’s Motel helping Brown move from the Motel to another residence. Appellant stated that he knew Curran, who was a friend, and that he had last seen him during “the first snowstorm[,]” which Detective Lewis believed was a week or two weeks before Curran’s body was discovered. As a witness for the State, Matthew Morris testified that he was Martin’s step-son, that he knew Curran as one of Martin’s friends, and that he had met appellant once through his brother, Miles Morris. According to Matthew, he met appel*263lant when he took Miles and Helen, Miles’s wife, to ask Carpenter to lend them rent money. Matthew testified that he drove Miles and Helen to Carpenter’s residence, and he stayed in the car with Miles while Helen went inside to speak with Carpenter. While Matthew was waiting in the car, appellant walked up to the car and tried to sell him “Seroquel,” a “depression medication].” Matthew testified that, at that time, appellant “talk[ed] about robbing the guy up the street[,]” to “steal his pills[.]” According to Matthew, appellant meant Curran when he said “the guy up the street” because Curran “was the only one that lived up near that way.” Matthew testified that appellant told him and Miles, “You don’t need to borrow money, we can rob this guy.” Matthew testified that he said “no” to appellant’s offer, and appellant left. As a witness for the State, Miles testified that he knew Curran as a friend of his stepfather, Martin, and that, when Curran “stay[ed] with” his mother and Martin, he saw Curran “about every Friday.” Miles testified that he and his wife, Helen, visited Carpenter “[o]nce or twice” for Helen to borrow money from Carpenter. According to Miles, on one occasion, Matthew drove him and Helen to Carpenter’s, and Helen went into Carpenter’s house. Appellant came outside and approached him and Matthew while they were waiting in the car. Miles testified that appellant asked if the brothers wanted to buy Seroquel, which they refused. According to Miles, appellant stated that he knew “where to get some Percocets at, [and that] we got to go get the man drunk down at the shacks” and “take his medicine.” Miles testified that he believed appellant was referring to Curran. As a witness for the State, Thomas Allen testified that in February 2010, he lived at Steele’s Motel with his mother. At some point in mid-February, at around 10:00 p.m., there was a knock at his motel room door, and a young man was at the door. Allen testified that he did not know the young man. Allen testified that the young man “asked if he could just come in” and acted “real nervous and he was crying, he was upset.” Allen let the young man enter his room, and observed *264that the young man was “crying” and “shaking[,]” and that he “kept saying that he didn’t kñl nobody[.]” Allen identified appellant as the young man. According to Allen, appellant stated that he had been in the neighboring room at the Motel and that the people in that room “had the idea that he had committed a murder” of “an older guy that was his friend.” Allen testified that appellant said he was scared and requested that he (Allen) accompany him to the room next door. Allen walked with appellant to the neighboring room, nobody was there, so they went back to Allen’s room. Allen testified that appellant asked to call his mother, Carpenter, and that he overheard appellant asMng Carpenter “if the cops had been by the house at all, and he [appellant] was scared to go back to the house.” On the phone call, appellant “was just crying uncontrollably, repeating that he didn’t Mil nobody.” Allen testified that his encounter with appellant ended when he walked appellant to the neighboring room and saw appellant go inside. As a witness for the State, Michael McDonald7 testified that in February 2010, he lived across the street from the Deli and approximately one quarter mile from Curran’s house. According to McDonald, he had known Curran “very well” since around 1993. McDonald testified that he first met appellant in either late January 2010 or early February 2010, in the driveway of Curran’s house. McDonald testified that he and appellant conversed about “pills” and that he “ended up buying a few [Seroquel] pills” from appellant. McDonald testified that he saw appellant frequently after this first encounter and that he considered himself and appellant friends. According to McDonald, in February 2010, he moved to Delaware. McDonald testified that, in March 2010, he returned to Maryland to go camping. During this visit, McDonald saw appellant. McDonald testified that appellant invited him to *265his house to “hang out.” McDonald took a twelve-pack of beer (with “eight or nine beers” remaining) to appellant’s house, and appellant drank a beer while the two men sat talking. McDonald testified that the conversation “turned to [how appellant] ... worried that his mom was talking to detectives or something like that.” According to McDonald, prior to that day, the only thing he had heard appellant say concerning Curran’s death was that he “was being persecuted [ ] by the local sheriff[’]s department” and had been forced to view autopsy photographs. When asked by the prosecutor whether appellant told him “anything specific about [] Curran’s murder[,]” McDonald replied “[y]es,” and testified as follows: On the last day I seen [appellant] when he was still drinking the beer, I had two—I actually had four Suboxones, I gave him one and I took one, and I don’t know how long after that, but he told me a little bit about being up at [Curran]’s house that day and they were drinking, some kind of argument started, and that he snapped, I believe it was over pills, and he stabbed [Curran] in the temple and in the neck or something like that. He said more than that, but after I heard that, I really lost track of what was going on[.] On cross-examination, McDonald testified that he had been at Curran’s house twice on the day Curran’s body was discovered. According to McDonald, he went to visit Curran early in the morning, knocked on the door and, receiving no answer, left. As to the second visit, McDonald testified that he went to visit Curran around 11:00 a.m., opened the door, took a step inside the house and called for Curran. Receiving no response and not seeing anything unusual, McDonald left. McDonald testified that, in his August 30, 2010, conversation with detectives, he told detectives that he had brought up the topic of Curran during his March 2010 conversation with appellant. McDonald admitted that, during the March 2010 conversation with appellant, he had begun to suspect appellant and was “trying to butter [appellant] up” to get appellant to *266tell him about Curran’s death. When asked by defense counsel why he waited until August 2010, to tell detectives about his conversation with appellant, McDonald testified that he was wanted in Maryland for the violation of parole, and was afraid to return to Maryland to talk to law enforcement officers. As a witness for the State, Dr. Ali, the medical examiner who performed an autopsy on Curran, testified that he observed “a total of ten stab wounds and three cutting wounds” on Curran. Dr. Ali described the wounds to Curran’s chest as follows: “[t]wo of the stab wounds injured [Curran’s] heart, perforated the heart, and caused significant bleeding in the chest cavity[,]” and another “cluster of three stab wounds to the right side of the chest” injured the heart and passed through the liver “causing] bleeding in the abdominal cavity or inside the belly.” Dr. Ali testified that another stab wound perforated Curran’s left leg-or “entered and exited the other side of the leg[.]” As to the wound to Curran’s head, Dr. Ali testified that a stab wound to the left temple “fractured the skull and went through the brain[.]” Dr. Ali testified that he observed a cutting wound to the neck and two cutting wounds on Curran’s right hand. Dr. Ali opined that the cutting wound “injuries to the right hand are typical of defense-type injuries,” and that the injuries to the leg “could be consistent with defense injuries.” As to the stab wound to Curran’s temple, Dr. Ali opined that “[b]reaking into the temple requires some force but the bone in the temple area is not very thick” and he could not “tell exactly how much force” was used, but it was more force “than penetrating the belly or arm[.]” On cross-examination, Dr. Ali acknowledged that he could not determine the order the wounds were inflicted or whether different instruments were used to inflict the wounds. Dr. Ali testified that he could not determine exactly when Curran died, but testified that the wounds were consistent with the use of a knife. A copy of the autopsy report, which included a toxicology report, was admitted into evidence as State’s Exhibit 7. According to the toxicology report, Curran’s blood and *267urine tested positive for ethanol and various other substances, such as acetaminophen,- oxycodone, and quietiapine. As a witness for the State, Carpenter, appellant’s mother, testified that she had known Curran for approximately seven years, and that she had lived at Curran’s house when she was homeless after her divorce. According to Carpenter, she knew Curran to be a drinker and user of recreational drugs, and that Curran also took prescription medication as a result of being diagnosed with cancer. Carpenter testified that between August 2009 and November 2009, appellant lived with her, and that prior to August 2009, she had not seen appellant in seven years. According to Carpenter, appellant met Curran on February 1, 2010. Carpenter testified that appellant and Curran “hit it off real well[,]” that the two men watched movies and drank together, and appellant delivered meals to Curran. Carpenter did not know whether appellant and Curran had ever used recreational drugs or prescription medicine together, but testified that she knew appellant used recreational and prescription drugs. Carpenter testified that in February 2010, she had been prescribed medication, and that she “started realizing that the medication in the bottles ... were disappearing” and thought appellant was stealing her medication. Carpenter testified that on February 12, 2010, appellant was residing with her. According to Carpenter, appellant went to Curran’s house that day and was gone for around five hours, returning at approximately 9:20 p.m. Carpenter testified that upon his return, appellant “seemed lethargic[,]” was “very drunk[,]” and went to his room. Carpenter followed appellant into his room to discuss his late arrival—which was past his 9:00 p.m. curfew—and appellant “said he thought he had hurt [Curran]” and then appellant “fainted or passed out.” Carpenter testified that appellant had been sitting on the end of his bed and then “just collapsed” and “fell off the end of the bed.” Carpenter “started pouring water on [appellant], slapping him in the face, trying to talk to him” and “[t]he only thing that [appellant] was really able to tell [her] was that he *268thought he had hurt [Curran].” According to Carpenter, she wanted to go check on Curran, but she was not able to do so because appellant “was incapacitated.” Carpenter testified that she was interviewed by detectives on September 8, 2010, and, she participated in a recorded interview with detectives on September 9, 2010. Carpenter initially testified that she did not tell detectives that appellant told her he killed Curran. The prosecutor refreshed her recollection with the transcript of the interview. As a result, Carpenter acknowledged that, during the interview,, she advised detectives twice that appellant told her that he thought he had killed Curran. Carpenter testified that, during her September 9, 2010, interview with detectives, she informed detectives that appellant stated that Curran “had been stabbed in each lung and in the head.” Carpenter insisted at trial that, on February 12, 2010, appellant told her only that he thought he had “hurt” Curran, not that he had killed Curran. Carpenter testified that she told detectives that appellant “hurt” Curran because Curran “had said something inappropriate about [her].” A redacted transcript of Carpenter’s September 9, 2010, interview was admitted into evidence as substantive evidence pursuant to Maryland Rule 5-802.1 as State’s Exhibit 15. In the interview, Carpenter told detectives that on February 12, 2010, appellant came home around 11:00 p.m. “a lot more than intoxicated[,]” “totally disoriented,” and told her that “he thought that he had killed [Curran].” Carpenter informed detectives that appellant told her that “he had stabbed [Cur-ran] on either side of the chest and then, uh, put a blade through his skull.” Carpenter advised detectives that appellant told her, around the time law enforcement was executing a search warrant of her home, that “there wasn’t anything in the house[,]” and that after the search warrant was executed, appellant told her that he had thrown the knife in a dumpster. As a witness for the State, Captain Wayne Kessler of the Santa Fe, Texas, Police Department testified that on September 2, 2010, he arrested appellant in Texas. When arrested, *269appellant “appeared to be under the influence of alcohol or drugs[,]” so Captain Kessler postponed his interview of appellant for approximately two hours. Captain Kessler testified that, during his interview with appellant, appellant stated that he knew Curran through his mother, and that Curran “would occasionally give him medicine.” Appellant informed Captain Kessler that he last saw Curran on February 12, 2010. According to Captain Kessler, appellant was coherent during the interview and aware of what they were discussing. Captain Kessler testified that, at one point during the interview, appellant asked to speak with a district attorney, and he (Captain Kessler) “explained to [appellant] that the district attorneys in [his] jurisdiction [in Texas] had nothing to do with th[e] case and that they couldn’t be involved with any kind of deal[.]” Captain Kessler testified that, at other points in the interview, appellant called himself a “psychopath,” stated he wanted the death penalty, and joked that he should have gone to Mexico. Captain Kessler testified that he ended the interview after he realized that he was not “going to get anywhere.” On cross-examination, Captain Kessler acknowledged that, during the interview, appellant stated several times that he did not hurt or kill anyone. The State’s last witness, Detective William Sewell, the lead investigator, testified that law enforcement officers did not release any information about the location and number of stab wounds inflicted on Curran. Detective Sewell testified that he never showed Curran’s autopsy photographs to appellant because the Sheriffs Office “actually did not receive any autopsy photos.” Detective Sewell testified that, as part of the investigation, he discovered that Curran had been to the hospital in February 2010, and he retrieved the hospital report concerning Curran’s visit. Five pages of the hospital report were admitted into evidence as Defense Exhibit 1. The hospital report showed that Curran visited Union Hospital on February 12, 2010, at approximately 10:30 a.m. because he was “beat up[.]” In a section labeled “Suieidal/Homicidal Behavior Assessment,” a nurse recorded that Curran stated he would “like to *270kill the person who beat [him] up[.]” According to the report, when asked whether he had any history of aggressive behavior or whether he had threatened anyone physically or verbally, Curran stated, “yeah when I’m drunk or high[.]” The report showed that Curran responded “yes” when asked if he had current and past substance abuse problems and stated he used cocaine, hallucinogens, and amphetamines “anytime [he] can get [them.]” As a witness for the defense, Jamie McFalls testified that in February 2010, she lived next door to the Deli and had known Curran for approximately four years. McFalls testified that she last saw Curran on Thursday, February 11, 2010, but agreed that she had told detectives that she last saw Curran on Tuesday, February 16, 2010. Ultimately, McFalls testified that she last saw Curran at the Deli on February 16, 2010, between 5:00 p.m. and 7:00 p.m. as she and Cody Gilbert were driving to Blockbuster to return a movie, and that she recognized Curran from his distinctive walk. On cross-examination, McFalls admitted that she told detectives that it was “definitely dark” on February 16, 2010, and that Curran was “[a]bout a field away.” McFalls acknowledged that she did not go over and offer Curran a ride or say hello, and that she could not see Curran’s face. As a witness for the defense, Gilbert testified that in February 2010, he lived next door to the Deli and had known Curran, whom he considered a friend, for ten to fifteen years. Gilbert could not remember the date that he last saw Curran, but testified that it was only “two days before he was discovered” on February 17, 2010. Gilbert testified that, as he was backing out of his driveway around 5:30 p.m. or 6:00 p.m. to go to Blockbuster to return a movie, he last saw Curran “walking down the road right by the” Deli. Gilbert testified that he could see Curran’s face, that Curran was roughly 80 to 100 yards away, and he was sure it was Curran he saw that night. According to Gilbert, it was “[g]etting dark but not black” and there were lights on in the Deli parking lot area. Gilbert acknowledged that he told detectives that he was about 150 to 200 yards away from Curran when he saw him, but testified *271that he was “[a] hundred percent” sure it was Curran he saw on this occasion. On cross-examination, Gilbert admitted that, in contrast to his in-court testimony, he had told detectives that he had not seen Curran’s face. (b) Exclusion of Curran’s Statements to Martin and Buckland Prior to the State calling Martin to testify, appellant’s counsel requested a bench conference to discuss “an issue about some of [] Martin’s testimony.” Appellant’s counsel explained as follows: Curran apparently was beat up rather severely a couple of days before the 12th when the State believes he was last seen, and [ ] Martin had some contact with [ ] Curran about the individuals who were involved. There is [ ] Martin and actually [ ] Buckland, and I suppose the issue is the same with respect to both of them. [ ] Curran indicated to both these individuals, and I believe [ ] Buckland is on the State’s list as well, who beat him up rather severely, fractured his face, caused him great pain, and it is going to be my attempt to get from those individualsr[8] on cross[-]examination those statements from [ ] Curran. I understand they are ordinarily hearsay. The importance to [appellant] cannot be underestimated here. This is a question about ... who killed [ ] Curran. And I believe the police will—1 mean, initially these people were suspects. They have all been talked to. And I think it is, again, it’s crucial that that evidence gets out. There is no other way to get it out. And it is I think inherently reliable under the conditions in which it was given with respect to [ ] Curran fearing for his own safety at that point in time, his natural responses to tell the truth to his friends about what happened. Even though he wasn’t talking to *272everybody about what happened and he didn’t identify individuals to everybody, but with respect to this individual who’s apparently a good friend of his and the other individual, [] Buckland, who apparently lives close[]by and was very well about as good a friend as [] Curran had I suppose. Again, these individuals were identified and I would like to get that out. Appellant’s counsel acknowledged that Curran’s statements were not admissible under a specific hearsay exception, but argued that they were admissible under the “catch-all exception” set forth in Maryland Rule 5-803(b)(24). In arguing that the statements were admissible under the “catch-all exception,” appellant’s counsel relied on the “Foster case[,]” as a case in which “due process considerations in being able to present the defendant’s case” required the admission of certain statements. The State opposed the admission of Curran’s statements, arguing that they were hearsay and did not fit any of the exceptions to the hearsay rule. The circuit court agreed with the State, ruling as follows: “Well, the Court’s not going to allow it. The Court does find that it’s hearsay. [The Court does not] find that it falls within any exceptions under [Maryland Rule] 5—803[.]” Appellant’s counsel urged the circuit court to “consider perhaps due process,” but the circuit court ruled that appellant’s counsel could not ask either Martin or Buckland about Curran’s statements because the circuit court “just think[s] it’s hearsay.” (c) Motion for Judgment of Acquittal At the close of the State’s case, appellant’s counsel moved for judgment of acquittal, arguing, in full, as follows: I guess I would be making a motion, Your Honor, and indicate, again, with respect to what the state of the evidence is, it is that we have expert medical testimony indicating maybe a couple of days before—anywhere from a couple days before February 18[th] to February 12[th] this individual might have died. *273The evidence directly implicating [appellant] is two witnesses, one of whom has a criminal background, apparently pending criminal matters, and his mother, who was kind of all over the map with respect to what she was saying, how she was saying it, how she was focused, and describing an event that seems incredible on its face to have gone that way. And on direct what [ ] Carpenter ended up saying is that, I’m a nurse and I’ve done all these classes and I’ve done all the continuing education and so on and so forth, even though I’m not able to work at this point in time. And when she sees the condition of anybody, much less her son on the evening of the 12[th] when he falls unconscious, stops breathing, and has to do things, not to describe any nurse-related activities in terms of trying to revive him—she described water-boarding first of all—nor calling 911, again, the Court has to believe it for that to carry weight. And given those circumstances, I think it’s extremely difficult to say that she makes much sense. The rest of the evidence about who saw [Curran] last, there’s pizza in the microwave that was apparently delivered on the ... 10th. So we know while he was alive it lasted until at least the 12[th] under the State’s theory. Whether he would rather drink a couple beers than eat a couple pieces of pizza, nobody knows. I mean, clearly I know what they want the inferences to be, what they want the conclusions to be, but it doesn’t get us there. Other evidence: There’s pictures of a calendar with dates X’d out. There is no evidence of character and that he did it every morning when he got up or every evening when he went to bed, he X’d the next day out. The circuit court denied the motion, ruling from the bench that: [T]here is evidence here, if the jury believed it, that could convince them beyond a reasonable doubt. If they believe the mom and they believe ... McDonald. If they believe those two witnesses, in the Court’s view there is sufficient *274evidence for the jury to find [appellant] guilty of this murder, first degree, beyond a reasonable doubt. Appellant’s counsel interjected, stating that he thought there was “still some minimal assessment of credibility that the Court must exercise.” The circuit court reiterated that the motion was denied, stating: Again, I think there is more than enough evidence, if the jury believes it and if the jury is convinced beyond a reasonable doubt, based on all of this evidence taken in the light most favorable to the State, where they could find [appellant] guilty of the charges that he faces. So, the Court is going to deny the motion at this time. At the close of all the evidence, appellant’s counsel moved for judgment of acquittal, arguing, in entirety, as follows: I would make a motion for judgment of acquittal, incorporate the argument I made last time, and ask the Judge again to assess credibility with respect to the further witnesses that have been introduced in evidence with respect to what I think is a greatly-expanded period of time that harm could have been done to [ ] Curran. The State has laid a significant foundation that this was done by [appellant] on the 12th. We’ve got two people who have not been impeached in any way, not been to Court at any time, and were clearly nervous, but said distinctly, I know it was [Curran]. I know who he is. I recognized him and it was him. I’m a hundred percent sure. On the 16[th], within days. Now, the other aspect of that is that the medical examiner said a couple days. Now, he saw [ ] Curran on the 18[th]. It still fits the framework even for the medical testimony. The 18th to the 16th is a couple days. THE COURT: Within a day and a half. If you believe the—if the jury believes the last two or those two witnesses, the young lady and the man, they said they saw [Curran] around 5:30, 6 or so.... So it would have been a day and a half by the time the medical examiner got the body then. *275[APPELLANT’S COUNSEL]: Okay. And again, what the doctor said was those were his estimates. There is no exact timeframe. Two days was within his own estimation of when this could have happened. So again, given all of that, I would ask Your Honor, I guess—well, one other thing. Even assuming that this individual was involved in an altercation that ended [] Curran’s life, the circumstances are completely unknown. The character of [ ] Curran is known to a certain extent, and that is he is a disagreeable sort and someone prone to violence if he’s been drinking. He’s hard to get along with. Even [ ] Wright said, you know, Look, I mean, he’s been nasty with me when I’ve asked him to leave. And so, again, the State has to have established, even prima facie at this point, the elements of first and second degree. To the extent that Your Honor is satisfied at this point that there is agency here, intent I think is still something completely open, especially given [] Curran’s state of mind as established by the hospital records that were introduced. So those are my arguments. Agency at first, intent second. The circuit court denied the motion, ruling from the bench: Well, again, the jury can—obviously they can believe any witness, they can believe all of their testimony, part of their testimony, or none of their testimony. But at this point, I think there is, again, if the jury were to believe it, I think there is more than enough evidence for the jury to find that the State has proved beyond a reasonable doubt that [appellant] did in fact commit the charges which he faces. I think it’s a matter for the trier of fact with regard to credibility. It’s not for me to decide at this point. So again, for that reason, the Court is going to deny the motion. (d) Jury Instructions At the conclusion of all of the evidence in the case, appellant’s counsel requested that the circuit court instruct the jury as to legally adequate provocation and voluntary intoxication. *276As to voluntary intoxication, appellant’s counsel argued that there was “clear evidence of voluntary intoxication[,]” demonstrated in part by Carpenter’s testimony that appellant seemed lethargic and “very drunk” when he returned home. As to legally adequate provocation, appellant’s counsel argued that evidence of an altercation between appellant and Curran, as well as Curran’s self-assessment “that when he gets drunk and high he can go off, [leads to] an inference that can be drawn that [Curran] could be the aggressor.” In response to the request for a jury instruction on voluntary intoxication, the State argued that “[t]here is no evidence of [appellant’s intoxication at the time of th[e] incident. There is some evidence of [appellant’s] impairment when he goes home at 11:00 o’clock; but there is zero evidence of his intoxication at the time of this incident. And it’s not he has some beers. It’s not he smoked some dope.” As to legally adequate provocation, the State argued that “there wasn’t any evidence generated” regarding the issue. The circuit court refused to give the requested instructions. As to voluntary intoxication, the circuit court ruled from the bench, in pertinent part, as follows: Okay. Well let’s say [appellant] popped four pills on his way home from the victim’s house to his house. How do we know when? I don’t know. There hasn’t been any evidence as to whatever he—what he consume and when. I mean [appellant] didn’t testify, and obviously he doesn’t have to testify, and that’s his right, obviously. But no other witnesses have come forward and presented any evidence as to what if anything [appellant] consumed and when. He was never taken to a doctor, a hospital. They never did any type of tests. So I don’t know. We’d all be guessing as to— * * * Well, as I indicated, again, the court is not inclined to give those instructions with regard to [] the voluntary intoxication. Again, the way the court recalls the evidence—I mean, again, I don’t recall any evidence that’s been present*277ed here to show what if anything, any drugs and/or alcohol, [appellant] had consumed at the time this murder occurred. There was testimony from the mother [Carpenter] that when he arrived home later that evening he seemed to be under the influence of something, and which caused her concern, and she made attempts to try to sober him up or whatever; but, again, I don’t recall anything—any evidence with regard to [appellant] ingesting any alcohol and/or drags at the time of this offense. As to legally adequate provocation, the circuit court ruled as follows: And then looking at the other issues that we talked about, again, the court just doesn’t find there was any legal—any evidence to demonstrate any legally adequate provocation for the voluntary manslaughter. Again, the only statement we have I think came again from the mother [Carpenter], who indicated that [appellant] stated that the victim [Cur-ran] made a derogatory comment about her, but that was the extent of it. I don’t know what the statement was, whether it would rise to any level that would justify or fit into possibly one of the factors that would warrant the voluntary manslaughter [instruction]. So, again, for those reasons the court will not give those instructions, but your objection is noted. The circuit court instructed the jury as follows on first-degree murder as follows: First degree murder. First degree murder is the intentional killing of another person with willfulness, deliberation, and premeditation. In order to convict the defendant of first degree murder the state must prove that the conduct of the defendant caused the death of [ ] Curran, and that the killing was willful, deliberate and premeditated. Willful means that the defendant actually intended to kill the victim. Deliberate means that the defendant was conscious of the intent to kill. Premeditated means that the defendant thought about the killing, and there was enough time before the killing, though it may have only have been a *278brief—or may have only been brief, for the defendant to consider the decision whether or not to kill, and enough time to weigh the reasons for or against the choice. The premeditated intent to kill must be formed before the killing. After instructing the jury, the circuit court asked if counsel had any exceptions “other than what was previously noted[.]” Appellant’s counsel responded: “No, your Honor, just what was previously noted.” (e) Jury Note 1 During deliberations, the circuit court received a note from the jury. The jury note asked the following: During a heated argument, a knife is picked up [and] used— would this be considered [fírst-]degree murder? Would those few seconds from the time that he grabbed the knife be considered premeditated? After discussing a proposed response with the parties, the circuit court sent back the following response: “You have to rely upon the jury instructions you have been provided. That it is an issue for you to decide based upon the facts and the law (jury instructions).” DISCUSSION I. (1) Contentions Appellant contends that at the pretrial conference of May 6, 2011, the circuit court failed to comply with Maryland Rule 4-215(e) by not: (1) inquiring as to whether he wanted to discharge his counsel; (2) eliciting and considering an explanation for his dissatisfaction with his counsel; and (3) determining whether the reasons were meritorious, and thereby warranting discharge. Appellant argues that his letter of April 17, 2011, stating, “I’ve been having problems with my Defense Attorney Thomas Klenk[,]” and his remark at the pretrial conference of May 6, 2011, that he believed he was not being *279represented effectively, “were obvious statements of dissatisfaction with counsel and were sufficient to trigger the [court’s] requirements under Rule 4-215(e).” Appellant asserts that his failure to raise the issue again at trial does not excuse the circuit court’s error as Maryland Rule 4-215(e) does not require a defendant to repeat the request to discharge counsel at trial. The State responds that the circuit court properly complied with Maryland Rule 4-215(e) as appellant’s written and oral communications were not requests to discharge counsel and, thus, the circuit court was not required to undertake an inquiry pursuant to Maryland Rule 4-215(e). The State argues that appellant’s April 17, 2011, letter to the circuit court was simply a complaint about not being provided discovery. The State maintains that at the May 6, 2011, hearing appellant’s oral response, “[t]here we go, yes[,]” to the circuit court’s question about effective representation of counsel “did not intimate a desire, much less make a request, to discharge” Klenk. The State asserts that Maryland Rule 4-215(e) was not triggered because nothing in appellant’s statements could reasonably have led the circuit court to conclude that he wished to discharge his counsel. The State points out that the circuit court informed appellant that if, after discussing his concern about discovery with Klenk, he wanted to address the court further he could “certainly do that,” but that appellant never again raised an issue as to his representation by Klenk. (2) Standard of Review In State v. Hardy, 415 Md. 612, 621-22, 4 A.3d 908 (2010), the Court of Appeals set forth the following standard of review for issues concerning the discharge of counsel: When applicable, Rule 4-215(e) demands strict compliance. “The provisions of the rule are mandatory” and a trial court’s departure from them constitutes reversible error. Where a motion to discharge counsel is made during trial, however, Rule 4-215(e) does not apply, and we evalu*280ate the trial court’s ruling on a motion to discharge counsel under the far more lenient abuse of discretion standard.[9] (Citations omitted). (3) Law “A defendant in a criminal prosecution has a constitutional right to the effective assistance of counsel and the corresponding right to reject that assistance and represent himself.” Alford v. State, 202 Md.App. 582, 607, 33 A.3d 1004 (2011) (citation omitted). Maryland Rule 4-215(e), concerning discharge of counsel, provides: If a defendant requests permission to discharge an attorney whose appearance has been entered, the court shall permit the defendant to explain the reasons for the request. If the court finds that there is a meritorious reason for the defendant’s request, the court shall permit the discharge of counsel; continue the action if necessary; and advise the defendant that if new counsel does not enter an appearance by the next scheduled trial date, the action will proceed to trial with the defendant unrepresented by counsel. If the court finds no meritorious reason for the defendant’s request, the court may not permit the discharge of counsel without first informing the defendant that the trial will proceed as scheduled with the defendant unrepresented by counsel if the defendant discharges counsel and does not have new counsel. If the court permits the defendant to discharge counsel, it shall comply with subsection (a)(l)-(4) of this Rule if the docket or file does not reflect prior compliance. In Gonzales v. State, 408 Md. 515, 531-32, 970 A.2d 908 (2009), the Court of Appeals discussed the procedures set forth in Maryland Rule 4-215(e) as follows: Under the Rule, when a defendant requests permission to discharge an attorney whose appearance has been entered *281in his or her case, the court must provide the defendant an opportunity to explain why the defendant wishes to discharge that attorney. Next, the trial court must make a determination about whether the defendant’s desire to discharge counsel is meritorious. Finally, ...: Where the trial [court] finds a defendant’s reasons to be meritorious, [it] must grant the request and, if necessary, give the defendant an opportunity to retain new counsel. When a defendant makes an unmeritorious request to discharge counsel, the trial judge may proceed in one of three ways: (1) deny the request and, if the defendant rejects the right to represent himself and instead elects to keep the attorney he has, continue the proceedings; (2) permit the discharge in accordance with the Rule, but require counsel to remain available on a standby basis; (3) grant the request in accordance with the Rule and relieve counsel of any further obligation. (Citations omitted). In State v. Davis, 415 Md. 22, 31, 997 A.2d 780 (2010), the Court of Appeals described what constitutes a request to discharge counsel as follows: A petition for new counsel need not be made in writing or even formally worded. See State v. Campbell, 385 Md. 616, 632, 870 A.2d 217, 226 (2005) (“[Defendant’s] request did not need to be a talismanic phrase or artfully worded to qualify as a request to discharge, so long as a court could reasonably conclude that [he] sought to discharge his counsel.”); Snead [v. State], 286 Md. [122], 127, 406 A.2d [98], 101 [ (1979) ] (“[A]ny statement by the defendant from which the court could reasonably conclude that the defendant desired self-representation would be sufficient.”). Rather, the statement must simply express to the court that the defendant is dissatisfied with his or her current attorney. See Campbell, 385 Md. at 632, 870 A.2d at 226 (“[Defendant’s] statement regarding his dissatisfaction with his attorney, if timely, should have triggered an inquiry by the court as to whether [he] wanted to discharge his counsel.”). *282(Some alterations in original). In Hardy, 415 Md. at 623, 4 A.3d 908 the Court of Appeals stated: A defendant makes such a request [to discharge counsel] even when his or her statement constitutes more a declaration of dissatisfaction with counsel than an explicit request to discharge. See, e.g., Campbell, 385 Md. at 632, 870 A.2d at 226 (finding request to discharge counsel when defendant stated “I don’t like this man as my representative.... We had conflicts way before this ever started”); Fowlkes v. State, 311 Md. 586, 607, 536 A.2d 1149, 1160 (1988) (treating as request to discharge counsel defendant’s statement that “[i]f possible I would rather get rid of her [my attorney], get new [sic] attorney”); Leonard [v. State ], 302 Md. [111], 125, 486 A.2d [163], 170 [ (1985) ] (declaring request to discharge counsel “obvious” where defendant said “can I get appointed another counsel? ... Well, he’s not representing me then”); Snead, 286 Md. at 131, 406 A.2d at 103 (finding request to discharge counsel when defendant said “I don’t want no attorney then”). (Some alterations in original). In Davis, 415 Md. at 33, 997 A.2d 780, the Court of Appeals held that an inquiry under Maryland Rule 4-215(e) is “not mandated unless counsel or the defendant indicates that the defendant has a present intent to seek a different legal advisor[.]” In Davis, id. at 25-27, 997 A.2d 780, the Court of Appeals held that defense counsel’s statement to the county administrative judge on the morning of trial that the defendant had told him “he didn’t like [defense counsel’s] evaluation” and that he “[w]anted a jury trial and new counsel” constituted a request to discharge counsel triggering the procedures set forth in Maryland Rule 4-215(e). In Davis, id. at 28, 997 A.2d 780, after defense counsel’s statement, the county administrative judge ordered that the case proceed to trial. The Court of Appeals held that the defendant’s request to discharge counsel, relayed through his attorney, was an adequate request. Id. at 33, 997 A.2d 780. The Court of Appeals pointed out that defense counsel “explicitly reported [the defendant’s dissatisfaction to the court” followed by the *283defendant’s request for new counsel. Id. at 34-35, 997 A.2d 780. The Court stated that the dissatisfaction and request, taken together, “reasonably indicate[d] that [the defendant] found fault with his representation, and thus the court was obligated to ascertain the defendant’s reasons.” Id. at 35, 997 A.2d 780. In Davis, id. at 36, 997 A.2d 780, the Court of Appeals allayed the State’s fears that its decision would place an undue burden upon trial judges, stating: “We do not suggest that a mere hint of discord within the defense’s ranks from any source demands investigation.” (Emphasis in original). In State v. Northam, 421 Md. 195, 197, 26 A.3d 344 (2011), the Court of Appeals held that the defendant was not entitled to a new trial based on the contention that the trial court failed to comply with the procedures of Maryland Rule 4-215(e). In Northam, id. at 198-99, 26 A.3d 344 shortly after his arrest, the defendant \"wrote two letters, one addressed to the clerk of the trial court and one addressed to the District Court of Maryland, expressing his dissatisfaction with his assigned public defender and stating that he was “dropping” the public defender and requesting a pro bono lawyer. At a pretrial hearing, the defendant verbally expressed his dissatisfaction with the public defender and the public defender’s office. Id. at 199-201, 26 A.3d 344. Six months later, at a motions hearing, the defendant was still represented by his assigned public defender. Id. at 201, 26 A.3d 344. Less than two months after the motions hearing, the defendant filed a motion for a change in venue in the form of a letter captioned “For a Change of Venue,” stating at the end of the letter that his public defender had not contacted him even though trial was three weeks away and requesting “a Court appointed attorney and Change of Venue.” Id. at 202-03, 26 A.3d 344. In Northam, id. at 206, 26 A.3d 344 the Court of Appeals agreed with the State that the defendant’s change of venue letter was “ ‘sufficient only to alert the prosecutor and the trial court that [the defendant] desired a change of venue ... and [the] vague request that he wanted a “Court appointed attorney,” buried in the final sentence of the final paragraph *284of what was captioned and pled ... solely as a change of venue motion stands in stark contrast to other cases where 4-215 inquiries were mandated.’ ” (Omission in original). The Court of Appeals pointed out that, after filing the change of venue letter, the defendant had the opportunity to request permission to discharge his assigned public defender at two separate pretrial hearings as well as prior to the start of trial itself. Id. at 207, 26 A.3d 344. The Court of Appeals held: “Because no such request was presented to [the trial judge] on any of these occasions, we agree with the State’s argument that ... ‘Rule 4-215(e) was not implicated, much less violated, by the trial court.’ ” Id. In Hardy, 415 Md. at 615-16, 4 A.3d 908 the Court of Appeals held that the defendant’s statement during jury voir dire that he was “thinking about changing [his] attorney or something” constituted a request to discharge counsel, but that the procedures of Maryland Rule 4-215(e) were not applicable as voir dire, a meaningful trial proceeding, had begun. During voir dire, the defendant informed the trial court that he had not changed his mind about “wanting a trial” and that he was “thinking about changing the attorney or something.” Id. at 618, 4 A.3d 908 (emphasis omitted). The Court of Appeals concluded that the defendant’s statement about changng his attorney qualified as a request to discharge counsel because “a trial court reasonably should have interpreted it as such.” Id. at 622, 4 A.3d 908. The Court explained that the defendant’s statements “communicated [ ] his unhappiness (albeit a passing state of mind at the time) with his trial counsel clearly enough to constitute a request to discharge counsel.” Id. at 623, 4 A.3d 908. The Court rejected the State’s argument that the defendant’s statement was “too vague and indecisive to amount to a request to discharge” his counsel, stating: “Even if [the defendant] did not intend to make such a request definitively, however, the fact that he was considering the possibility of discharging counsel suggests that some consideration by the court into his rationale was appropriate.” Id. at 623 n. 8, 4 A.3d 908. *285In Joseph v. State, 190 Md.App. 275, 288, 988 A.2d 545 (2010), we held that the trial court violated Maryland Rule 4-215(e) when it “was made aware of [the defendant’s desire to discharge counsel but did not ask for or consider [the defendant’s reasons for wanting to do so before denying the request.” At a motions hearing the evening before trial, the prosecutor informed the trial court that the defendant had “stated something to [him] about the release of his counsel.” Id. at 280, 988 A.2d 545 (alteration in original). The trial court immediately stated “[t]hat’s not going to happen” and told the defendant that he could either retain a new attorney by the next morning (the start of trial) or represent himself. Id. At the end of the hearing, defense counsel raised the issue about the defendant’s “[inability to have the counsel of his choice.” Id. at 281-82, 988 A.2d 545. The trial court responded that the defendant could have any attorney he wanted as long as the attorney was present for the start of trial the following day. Id. at 282, 988 A.2d 545. This Court held that the prosecutor and defense counsel clearly made known the defendant’s desire to discharge his counsel. Id. at 287-88, 988 A.2d 545. We pointed out that, in order to trigger an inquiry under Maryland Rule 4-215(e), case law indicated that the requirement was that a defendant’s desire to discharge counsel be made known to the trial court. Id. at 288, 988 A.2d 545. In Campbell, 385 Md. at 632, 870 A.2d 217, the Court of Appeals held that the defendant’s statement regarding his dissatisfaction with his attorney, if timely, should have triggered an inquiry by the court as to whether [the defendant] wanted to discharge his counsel. [The defendant] made several statements to the court about his dissatisfaction with his attorney: “I don’t like this man as my representative;” “We had conflicts way before this ever started, man in the first trial;” “The man told me he ain’t going to represent me;” “He ain’t have my best interest at heart;” “You all wouldn’t let me fire him.” ... Based upon [the defendant’s expressed dissatisfaction with his attorney, a court reasonably could deduce that [the defendant] sought to discharge his counsel. *286In Campbell, id. at 634, 870 A.2d 217, however, because the defendant’s expression of dissatisfaction occurred during trial—at the close of the State’s case-in-chief-the Court of Appeals held that the procedures of Maryland Rule 4-215(e) were not applicable as “‘meaningful trial proceedings’ definitely had begun[.]” (4) Analysis Returning to the case at hand, we conclude that a Maryland Rule 4-215(e) inquiry as to discharge of counsel was not triggered by appellant’s letter of April 17, 2011, or his remarks at the May 6, 2011, pretrial hearing because neither constituted a request to discharge counsel. In both instances, appellant’s specific complaint concerned a “lack of discovery” rather than an attempt to discharge counsel. In the April 17, 2011, letter to the circuit court, appellant stated he had not been issued a copy of the discovery and requested that the circuit court “[p]lease issue [him] a copy of this Discovery.” At the May 6, 2011, pretrial hearing, appellant reiterated his concern about the lack of discovery, stating, “I have not been issued discovery.” To be sure, the circuit court interjected: “You don’t think [your counsel is] effectively representing you,” and appellant responded: “There we go, yes.” At no point did appellant indicate that he wished to discharge counsel or independently raise the issue of a lack of effective representation. At this juncture, it is readily apparent from the record that appellant sought only to receive discovery from the attorney. As a result, the circuit court suggested that appellant talk to the attorney about why he had not received the discovery materials. The circuit court advised appellant that if he continued to have concerns which he wanted to address before the court, he could “certainly do that” at the next upcoming pretrial hearing, which was scheduled for May 10, 2011. After the letter of April 17, 2011, and the May 6, 2011, hearing, appellant had the opportunity to request permission to discharge Klenk at three separate pretrial hearings held in May, 2011—on May 10, May 20, and May 26—as well as prior *287to the start of and during trial in June 2011, and at sentencing on August 24, 2011. Appellant was aware, based on the circuit court’s advisement to him at the May 6, 2011, pretrial hearing, that the court had provided an opportunity for him to resolve the discovery issue with Klenk, and that the court was willing to address the matter again should he still have “any of these concerns[.]” The record reflects, however, that appellant never raised the issue of discovery—or any other problems with Klenk—again. Because appellant did not request to discharge Klenk as counsel—but instead sought discovery and never raised an issue as to Klenk’s representation of him at additional pretrial hearings, trial or sentencing—under the circumstances of this case, appellant’s communications with the court did not trigger the discharge of counsel inquiry required by Maryland Rule 4-215(e). See Northam, 421 Md. at 202-03, 207, 26 A.3d 344 (Where a defendant earlier made a vague request for a new attorney in a multi-part motion and did not request to discharge counsel at subsequent pretrial hearings, the Court of Appeals held that Maryland Rule 4-215(e) was not implicated.). Applying principles gleaned from relevant case law, we are satisfied that appellant’s written and oral communications were not “statements that would reasonably apprise [the circuit] court of [his] wish to discharge [Klenk as his] counsel.]” Davis, 415 Md. at 32, 997 A.2d 780. As set forth above, at no point did appellant or anyone else state that he was “thinking about changing [his] attorney or something[,]” Hardy, 415 Md. at 618, 4 A.3d 908 (emphasis omitted), that he “[w]anted ... new counsel[,]” Davis, 415 Md. at 25, 997 A.2d 780 (first alteration in original), that he “stated something [ ] about the release of his counsel[,]” Joseph, 190 Md.App. at 280, 988 A.2d 545, that he did not like Klenk “as [his] representative^]” Klenk “told [him] he [was not] going to represent him” or Klenk did not “have [his] best interest at heart[,]” Campbell, 385 Md. at 632, 870 A.2d 217, or anything of a similar nature that would have indicated to the circuit court that he was attempting to discharge Klenk as his counsel. Appellant’s statement that he had been “having *288problems” with Klenk and his agreement with the circuit court that he did not feel Klenk was effectively representing him did not rise to the level of mandating a Maryland Rule 4-215(e) inquiry because nothing about appellant’s statements “indicate[d] that [he] ha[d] a present intent to seek a different legal advisor[.]” Davis, 415 Md. at 33, 997 A.2d 780.10 All of appellant’s statements about Klenk were rooted in his request to obtain a copy of the State’s discovery. Although appellant is correct that nothing within Maryland Rule 4-215(e) requires a defendant to renew the request to discharge counsel at trial, the Rule clearly requires that to trigger its application a request to discharge must be made. In expressing a concern over the lack of discovery, appellant did not explicitly request to discharge Klenk, or notify the circuit court in any manner of the desire to seek different counsel. Compounding the lack of notification to the court of a desire to seek different counsel, appellant accepted Klenk’s representation without complaint at three additional pretrial hearings, trial, and sentencing. For all of these reasons, we conclude that the circuit court properly addressed appellant’s concerns over the lack of discovery and did not violate the procedures set forth in Maryland Rule 4-215(e).11 *289II. (1) Contentions Appellant contends that the circuit court erred in failing to determine, based upon evidence presented on the record, whether he was competent to stand trial. Appellant argues that there is no provision “for withdrawing an allegation of incompetence and thereby obviating the court’s obligation to make a determination regarding incompetency.” Appellant asserts that the circuit court erred in concluding that his counsel’s withdrawal of the motion “rendered ‘moot’ the issue” of his competence to stand trial. Appellant contends that, in failing to determine whether he was competent to stand trial, the circuit court violated his right to due process under the United States and Maryland Constitutions because both prohibit the criminal prosecution of an incompetent defendant. *290The State responds that the circuit court properly assessed appellant’s competency to stand trial. The State argues that criminal defendants are “ ‘presumed to be competent to stand trial’ ” until evidence presented on the record “is of such character that the trial judge is unable to determine beyond a reasonable doubt that the accused is able to understand the nature or the object of the proceeding against him or to assist in his defense.” The State maintains that after appellant’s withdrawal of the request for a competency evaluation, the circuit court had an obligation to address appellant’s competency sua sponte only “to the extent that [appellant] appeared to the court to be incompetent to stand trial.” In a reply brief, appellant reiterates the allegation that the circuit court failed to determine whether he was incompetent to stand trial once his competency was called into question by his attorney. (2) Standard of Review “Once the issue of competency [to stand trial] has been raised, a ‘determination that an accused is competent to stand trial must be found beyond a reasonable doubt.’ Additionally, competency to stand trial is a factual determination which will not be reversed unless it is clearly erroneous.” Peaks v. State, 419 Md. 239, 252, 18 A.3d 917 (2011) (quoting Jolley v. State, 282 Md. 353, 365, 384 A.2d 91 (1978)). (3) Law Due process substantively prohibits the criminal prosecution of a defendant who is incompetent to stand trial. Peaks, 419 Md. at 251, 18 A.3d 917; see also Medina v. California, 505 U.S. 437, 439, 112 S.Ct. 2572, 120 L.Ed.2d 353 (1992) (“It is well established that the Due Process Clause of the Fourteenth Amendment prohibits the criminal prosecution of a defendant who is not competent to stand trial.” (Citations omitted)). A criminal defendant, however, is presumed to be competent to stand trial. Peaks, 419 Md. at 251, 18 A.3d 917 (citing Ware v. State, 360 Md. 650, 703, 759 A.2d 764 (2000)). Maryland Code Annotated, Criminal Procedure Arti*291ele (“C.P.”) § 3—101(f) defines “incompetent to stand trial” as not being able “(1) to understand the nature or object of the proceeding; or (2) to assist in one’s defense.” On the other hand, a defendant is competent to stand trial where the defendant has a “ ‘present ability to consult with his lawyer with a reasonable degree of rational understanding—and ... a rational as well as factual understanding of the proceedings against him.’ ” Thanos v. State, 330 Md. 77, 85, 622 A.2d 727 (1993) (quoting Dusky v. United States, 362 U.S. 402, 402, 80 S.Ct. 788, 4 L.Ed.2d 824 (1960)) (omission in original). C.P. § 3-104, titled “Court to determine competence,” provides: (a) In general.—If, before or during a trial, the defendant in a criminal case or a violation of probation proceeding appears to the court to be incompetent to stand trial or the defendant alleges incompetence to stand trial, the court shall determine, on evidence presented on the record, whether the defendant is incompetent to stand trial. (b) Court action if defendant found competent.—If, after receiving evidence, the court finds that the defendant is competent to stand trial, the trial shall begin as soon as practicable or, if already begun, shall continue. (c) Reconsideration.-—At any time before final judgment, the court may reconsider the question of whether the defendant is incompetent to stand trial. In Roberts v. State, 361 Md. 346, 364-66, 761 A.2d 885 (2000), the Court of Appeals explained the statutory procedures set forth in C.P. § 3-104(a),12 stating: *292The language of [8-104](a) mandates actions to be undertaken by a trial court, if an accused’s competency is properly called into question. These actions can be broken down into three distinct and simple steps: (1) First, a determination of competency may be made at any time before or during a trial; (2) Second, such a determination must be made if the defendant in a criminal case appears to be incompetent to stand trial or the defendant alleges incompetence to stand trial; and (3) Finally, the court must make its determination on the evidence presented on the record. The second step [ ] creates a mandate from the Legislature to the trial judge. If the court’s duty to determine the competency of the accused to stand trial has been triggered, “the court shall determine ... whether the defendant is incompetent to stand trial.” ... The mandatory language of [the statute] indicates that the Legislature intended for every accused, whose competency was called into question, to have at least one guaranteed review of his or her competency status. (Emphasis and some omissions in original). As to the trial court’s determination concerning a criminal defendant’s competency, in Peaks, 419 Md. at 252, 18 A.3d 917 the Court of Appeals stated: Additionally, the determination of the court need not be in the form of a formal hearing. A judge with no jury present is not “required to use any magic words to designate as a separate hearing the presentation to him of testimony and evidence for his determination of the competency of the accused to stand trial. It is sufficient if the testimony and evidence are on the record.” Further, once the trial court has determined that the defendant is competent to stand trial, “the court is not required to hold an additional hearing merely because [the defendant] again alleges he is incompetent.” (Citations omitted) (alteration in original). In Pate v. Robinson, 383 U.S. 375, 386, 384, 86 S.Ct. 836, 15 L.Ed.2d 815 (1966), the Supreme Court held that the defen*293dant’s “constitutional rights were abridged by his failure to receive an adequate hearing on his competence to stand trial” and that the defendant did not waive the defense of incompetence to stand trial. At trial, the defendant’s counsel alleged that the defendant was insane at the time of the offense—a shooting—and incompetent to stand trial. Id. at 376, 86 S.Ct. 836. During trial, four defense witnesses testified extensively as to the defendant’s long history of “disturbed behavior.” Id. at 378, 86 S.Ct. 836. Medical records demonstrated that the defendant had been admitted to the hospital as a result of mental illness symptoms, and that the defendant stated he imagined hearing voices and seeing things. Id. at 379-80, 86 S.Ct. 836. In the medical records, a notation read: “I am wondering possibly [if] he isn’t schizophrenic.” Id. at 380, 86 S.Ct. 836. A few years prior to trial, the defendant shot and killed his eighteen-month-old son and then twice attempted suicide by shooting himself in the head and by jumping into a lagoon. Id. at 381, 86 S.Ct. 836. In committing the shooting for which he was on trial, the defendant entered a restaurant and fired a gun at his common law wife, never speaking “a word during the three-to-four-minute episode.” Id. at 382, 86 S.Ct. 836. At trial, four defense witnesses “expressed the opinion that [the defendant] was insane.” Id. at 383, 86 S.Ct. 836. Based on these circumstances, the Supreme Court stated: The State insists that [the defendant] deliberately waived the defense of his competence to stand trial by failing to demand a sanity hearing as provided by Illinois law. But it is contradictory to argue that a defendant may be incompetent, and yet knowingly or intelligently “waive” his right to have the court determine his capacity to stand trial. In any event, the record shows that counsel throughout the proceedings insisted that [the defendant’s present sanity was very much in issue. He made a point to elicit [the defendant’s mother’s opinion of [the defendant’s “present sanity.” And in his argument to the judge, he asserted that [the defendant] “should be found not guilty and presently insane on the basis of the testimony that we have heard.” *294Moreover, the prosecutor himself suggested at trial that “we should have Dr. Haines’ testimony as to his opinion whether this man is sane or insane.” With this record we cannot say that [the defendant] waived the defense of incompetence to stand trial. Id. at 384, 86 S.Ct. 836 (citation omitted). See also Kibert v. Peyton, 383 F.2d 566, 569 (4th Cir.1967) (The United States Court of Appeals for the Fourth Circuit stated that “[t]he Supreme Court has held categorically that the defense of incompetency to stand trial cannot be waived by the incompetent, Pate v. Robinson, 383 U.S. 375, 86 S.Ct. 836, 15 L.Ed.2d 815 (1966), and it ineluctably follows that his counsel cannot waive it for him by failing to move for examination of his competency.”). In Peaks, 419 Md. at 245, 18 A.3d 917 the Court of Appeals held that the trial court did not violate C.P. § 3-104 by determining that the defendant was competent to stand trial even though trial had begun. In Peaks, id., prior to trial, defense counsel requested an evaluation of the defendant’s competency to stand trial, and the trial court ordered an evaluation. Prior to the start of trial, the trial court determined that the defendant was competent to stand trial. Id. at 246-47, 18 A.3d 917. At the start of trial two weeks later, the defendant began to “act out,” complain of chest pains, “curse and act erratically[.]” Id. at 247-48, 18 A.3d 917. The next day, the defendant was brought to the court to schedule a new trial date, and the trial court stated that it was concerned about the defendant’s behavior and ordered another competency evaluation because it was “not certain” that the defendant was competent to stand trial. Id. at 248, 18 A.3d 917. The trial court found on the record, after voir dire, that it was “satisfied” the defendant was competent to stand trial. Id. at 250, 18 A.3d 917. In Peaks, id. at 251, 18 A.3d 917 the Court of Appeals observed that there was no substantive challenge to the defendant’s competency because the defendant had not alleged that he was incompetent to stand trial, but rather that the defendant challenged an alleged procedural error by the trial *295court—namely, that the trial court failed to determine the competency issue prior to the start of trial. The Court of Appeals held that, because the issue involved reconsideration of a prior determination of competency, the matter was not controlled by C.P. § 3-104(a), and the reconsideration could be made, “within the court’s discretion, at any time before final judgment.” Id. at 259, 18 A.3d 917. In reaching its decision, the Court of Appeals pointed out that, “[ojn the day of trial, defense counsel did not make a motion with respect to competency or challenge the lack of a completed evaluation. Had defense counsel considered the issue still outstanding, he had every opportunity to object to the characterization and bring the issue to the court’s attention at that time.” Id. at 262, 18 A.3d 917. In Roberts, 361 Md. at 356-57, 761 A.2d 885, the Court of Appeals held that the trial court erred by finding that a competency examination was not necessary and failing to hold a competency hearing. In Roberts, id. at 354, 761 A.2d 885, defense counsel filed a motion requesting a mental examination to determine the defendant’s competency to stand trial. The State filed an answer to the motion the following day. Id. at 355, 761 A.2d 885. The day after that, the trial court denied the motion without a hearing, and approximately a month later, trial commenced. Id. at 356, 761 A.2d 885. Upon review, the Court of Appeals stated that: once the issue of competency has been triggered, a trial court has an affirmative duty to determine an accused’s competency on evidence presented on the record. Under circumstances, such as the facts of the case at bar, where there is no evidence on the record concerning [the defendant’s competency, a hearing to present evidence is appropriate to put evidence on the record from which a valid determination of competency can be made. Id. at 367, 761 A.2d 885 (emphasis in original). The Court observed that defense counsel triggered the requirement for a competency determination by filing a motion for an evaluation. Id. at 369, 761 A.2d 885. As such, the Court of Appeals held that the trial court erred by failing to make such a determina*296tion based on evidence on the record as there was no evidence from which such a determination could be made nor were the parties provided an opportunity to present any evidence concerning the defendant’s competency. Id. (4) Analysis Returning to the case at hand, we begin by noting that appellant contends that the circuit court erred by failing to determine whether he was competent to stand trial despite the fact that he withdrew his request for a competency evaluation. Based on the circumstances of the case, we conclude that the circuit court properly addressed the issue of appellant’s competency to stand trial, implicitly finding that appellant was competent to stand trial and permitting appellant to withdraw his request for a competency evaluation. Appellant’s withdrawal of the request for a competency evaluation is dispositive of the issue under C.P. § 3-104(a)—i.e. once the request was withdrawn, the circuit court was no longer under an obligation to determine, as a result of the request, whether appellant was competent or incompetent to stand trial. Withdrawal of the request for a competency evaluation is not prohibited by statute or Maryland case law, and given the facts in this case, the circuit court properly permitted appellant to withdraw the request for a competency evaluation. The record reflects that, on January 28, 2011, appellant’s counsel requested a competency evaluation. The request was based on information communicated to appellant’s counsel by appellant’s mother and not based on any conduct by appellant before the circuit court. The circuit court granted the request and promptly issued an order on the same date for an in-custody competency evaluation. Appellant refused to participate in the competency examination. At the May 26, 2011, pretrial hearing, appellant’s counsel withdrew the request for a competency evaluation, stating that the decision to withdraw the request was arrived at with appellant’s consent and came “after further discussions with [appellant], both substantively and about this particular issue[.]” The circuit court informed appellant on the record that, as a result of withdrawing the request, there would be no competency evalu*297ation. Appellant stated twice that he understood and was withdrawing the request. The circuit court then stated: “And that’s all moot.” Contrary to appellant’s contention, the circuit court’s remark that the matter was “moot” was not the equivalent of a finding that the issue of appellant’s competency, independent of the withdrawal of the request, was rendered moot-indeed, the issue of competency may be raised by either party or the court at any time pursuant to C.P. § 3-104(a). Rather, the circuit court observed that the matter at hand—appellant’s request for a competency evaluation—was “moot” because the request had been withdrawn. As such, there was nothing further for the circuit court to consider as to appellant’s request. The record is devoid of any indication that, after appellant withdrew the request for a competency evaluation, appellant’s behavior at trial or sentencing was such that it triggered either appellant, appellant’s counsel, or the circuit court to re-raise the issue of his competency. In Roberts, 361 Md. at 364, 761 A.2d 885, the Court of Appeals stated that “a trial court’s duty to determine the competency of the accused is triggered in one of three ways: (1) upon motion of the accused; (2) upon motion of the defense counsel; or (3) upon a sua sponte determination by the court that the defendant may not be competent to stand trial.” (Citation omitted). There is no indication in the record that the circuit court lacked an understanding of its duty or departed from its duty. Judges are presumed to know the law. State v. Chaney, 375 Md. 168, 179, 825 A.2d 452 (2003) (It is a “well-established principle that ‘trial judges are presumed to know the law and to apply it properly.’ ” (Citation omitted)). Here, appellant and his counsel withdrew the request for a competency evaluation, ending the court’s obligation to determine competency based on their request. After withdrawal of the request, appellant exhibited no conduct that gave rise to a sua sponte determination by the circuit court that he may not be competent to stand trial. At oral argument, the State agreed with appellant’s position that where a substantive challenge as to a defendant’s compe*298tency to stand trial is made, the trial court is required to make a determination on competency, even if the defendant withdraws the request. Without directly expressing an opinion as to the State’s position—that a defendant’s substantive challenge to. competency may not be withdrawn—we conclude that, in this case, to the extent that appellant raised a substantive challenge to his competency to stand trial, the circuit court implicitly determined that appellant was competent to stand trial and permitted withdrawal of the request for a competency evaluation.13 In so concluding, we observe: (1) the record is completely silent as to any behavior or conduct on the part of appellant giving rise to a concern by the circuit court as to his competence; (2) appellant’s counsel’s request for a competency evaluation was based on information received from appellant’s mother, not his own independent observations of appellant’s conduct and behavior; (3) the record contains no information from appellant’s mother concerning his prior hospitalizations, i.e. when appellant was hospitalized, the duration of the hospitalizations, or any information about whether appellant had been diagnosed with a psychiatric condition;14 (4) in informing the circuit court of appellant’s failure to participate in a scheduled competency evaluation, the forensic psychiatrist stated that appellant refused to participate because he believed that “to take part would potentially incriminate him[,]” demonstrating that, although not legally correct in his thinking, appellant’s refusal to participate was *299not the result of a psychiatric condition but rather based on a rational choice; and (5) when the request for a competency evaluation was withdrawn, appellant coherently responded to the circuit court’s question. Given these facts, there was no basis on the record for the circuit court to conclude that appellant was anything other than competent. It is evident from the record that the circuit court was satisfied that appellant was competent to stand trial. Contrary to appellant’s position at oral argument, the circuit court was not required to specifically question appellant as to his competence, i.e. to engage in a question and answer colloquy with appellant on the issue of competence, where the evidence of record demonstrated that he was, indeed, competent to stand trial. Both on brief and at oral argument before this Court, appellant relied upon Pate for the proposition that a defendant may not withdraw his request for a competency evaluation. Although the Supreme Court in Pate, 383 U.S. at 384, 86 S.Ct. 836, held that a defendant who is incompetent cannot “knowingly or intelligently ‘waive’ his right to have the court determine his capacity to stand trial[,]” Pate is readily distinguishable. In Pate, id. at 378-83, 86 S.Ct. 836 four defense witnesses testified extensively at trial as to the defendant’s long history of troubled behavior, each expressing the opinion that the defendant was insane, medical records documenting the defendant’s mental health issues were admitted in which one practitioner noted that the defendant was possibly schizophrenic, and a few years prior to trial, the defendant shot and killed his eighteen-month-old son and then twice attempted suicide by shooting himself in the head and by jumping into a lagoon. Unlike in Pate, id. at 384, 86 S.Ct. 836 there was nothing in the record demonstrating that throughout the trial proceedings despite the withdrawal of the request for a competency evaluation, the issue of appellant’s competency to stand trial warranted further examination.15 *300Under the circumstances of this case, we conclude that the circuit court properly permitted the request for a competency evaluation to be withdrawn and, in permitting the withdrawal, the court implicitly determined that appellant was competent to stand trial. We observe that, after withdrawing the request for a competency evaluation, appellant made no further motion or request concerning his competency to stand trial. As the Court of Appeals stated in Peaks, 419 Md. at 262, 18 A.3d 917 “[h]ad [appellant’s] counsel considered the issue still outstanding [or had he desired an explicit statement as to appellant’s competency to stand trial], he had every opportunity to ... bring the issue to the court’s attention” at the time he withdrew the request or at any point during trial. III. (1) Contentions Appellant contends that the circuit court abused its discretion in failing to give jury instructions on legally adequate provocation and voluntary intoxication because the evidence was sufficient to generate such instructions. Appellant argues that “multiple sources of evidence[,]” including—(1) his statement to McDonald that he and Curran were drinking and arguing over pills when he “snapped” and stabbed Curran; (2) Curran’s statements to medical personnel that he wanted to kill the person who assaulted him; (3) Curran’s history of aggressive behavior and making physical and verbal threats when he was “drunk or high”; (4) Wright’s testimony that Curran was not permitted in the Deli if he was not sober; (5) testimony from other -witnesses, such as Martin, Buckland, *301and Carpenter, that Curran drank and used illegal drugs; and (6) the autopsy toxicology report showing that Curran tested positive for “ethanol” and drugs—sufficiently generated an instruction on legally adequate provocation. Appellant asserts that the question from the jury concerning whether stabbing someone during a heated argument constituted first-degree murder demonstrated that an instruction on legally adequate provocation was generated by the evidence. Appellant maintains that the circuit court committed plain error by failing to give an instruction on legally adequate provocation after receiving the jury question. Appellant contends that the following evidence was sufficient to generate an instruction as to voluntary intoxication: (1) McDonald’s testimony that he (appellant) told McDonald that he and Curran were drinking the night of the argument; and (2) Carpenter’s testimony that he appeared very drunk and passed out after returning home from Curran’s. The State responds that the circuit court properly denied appellant’s request for jury instructions concerning legally adequate provocation and voluntary intoxication because the defenses were not generated by the evidence. The State contends that, in requesting an instruction as to legally adequate provocation, appellant’s counsel admitted there was a lack of evidence to support the giving of such an instruction. The State argues that McDonald’s testimony about appellant and Curran arguing over pills does not establish sufficient evidence to warrant giving an instruction on provocation. As to Carpenter’s testimony that Curran made a “derogatory statement” concerning her, the State maintains that the circuit court properly determined that there simply was not enough information about the alleged statement to generate an instruction on legally adequate provocation. As to an instruction on voluntary intoxication, the State contends that the circuit court properly refused to give such an instruction because there was no evidence from which “a jury [could] rationally conclude that [appellant] was intoxicated, and that that intoxication was to such [an] extent as to *302make him incapable of forming the intent necessary to constitute the crime.” (2) Standard of Review We review a “trial court’s refusal or giving of a jury instruction under the abuse of discretion standard.” Stabb v. State, 423 Md. 454, 465, 31 A.3d 922 (2011) (citation omitted). In considering whether a trial court abused its discretion in declining to give a particular jury instruction, we consider the following factors: “(1) whether the requested instruction was a correct statement of the law; (2) whether it was applicable under the facts of the case; and (3) whether it was fairly covered in the instructions actually given.” Id. (citation omitted). (3) Law (a) Jury Instructions Generally Maryland Rule 4-325(c) provides, in pertinent part, that “[t]he court may, and at the request of any party shall, instruct the jury as to the applicable law and the extent to which the instructions are binding.” In Bazzle v. State, 426 Md. 541, 550, 45 A.3d 166 (2012), the Court of Appeals stated that a “requested jury instruction is applicable if the evidence is sufficient to permit a jury to find its factual predicate.” As to that determination—whether the evidence is sufficient to permit a jury to find its factual predicate—the Court of Appeals explained: The threshold determination of whether the evidence is sufficient to generate the desired instruction is a question of law for the judge. The task of this Court on review is to determine whether the criminal defendant produced that minimum threshold of evidence necessary to establish a prima facie case that would allow a jury to rationally conclude that the evidence supports the application of the legal theory desired. (Citations omitted). Id. (quoting Dishman v. State, 352 Md. 279, 292-93, 721 A.2d 699 (1998)). *303In Dykes v. State, 319 Md. 206, 216, 571 A.2d 1251 (1990), the Court of Appeals observed that a defendant need only produce initially “some evidence” to support the giving of a requested instruction. The Court described “some evidence” as follows: Some evidence is not strictured by the test of a specific standard. It cálls for no more than what it says—“some,” as that word is understood in common, everyday usage. It need not rise to the level of “beyond a reasonable doubt” or “clear and convincing” or “preponderance.” The source of the evidence is immaterial; it may emanate solely from the defendant. It is of no matter that the [] claim is overwhelmed by evidence to the contrary. If there is any evidence relied on by the defendant which, if believed, would support his claim ..., the defendant has met his burden. Then the baton is passed to the State. It must shoulder the burden of proving beyond a reasonable doubt to the satisfaction of the jury that the defendant [acted in the manner set forth in the specific jury instruction requested]. Id. at 216-17, 571 A.2d 1251 (emphasis in original). In determining whether competent evidence was produced to generate the giving of the requested instruction, an appellate court views the evidence in the light most favorable to the defendant. Bazzle, 426 Md. at 551, 45 A.3d 166 (citation omitted). (b) Legally Adequate Provocation In State v. Rich, 415 Md. 567, 582, 3 A.3d 1210 (2010), the Court of Appeals explained the four elements of the defense of legally adequate provocation as follows: 1. There must have been adequate provocation; 2. The killing must have been in the heat of passion; 3. It must have been a sudden heat of passion—that is, the killing must have followed the provocation before there had been a reasonable opportunity for the passion to cool; [and] 4. There must have been a causal connection between the provocation, the passion, and the fatal act. *304(Citation and internal quotation marks omitted). The Court of Appeals stated that “[i]t is well settled that provocative words—even if accompanied by some physical contact—do not constitute adequate provocation to mitigate a murder to a manslaughter.” Id. at 581, 3 A.3d 1210; see also Sims v. State, 319 Md. 540, 552, 573 A.2d 1317 (1990) (“Insulting words or gestures, [even racial and derogatory comments,] no matter how opprobrious, do not amount to an affray, and standing alone, do not constitute adequate provocation”). In Christian v. State, 405 Md. 306, 323, 951 A.2d 832 (2008), the Court of Appeals observed that appellate courts have recognized the defense of adequate provocation “in cases involving mutual affray, assault and battery, discovering one’s spouse in the act of sexual intercourse with another, resisting an illegal arrest, witnessing, or being aware of, an act causing injury to a relative or third party, and anything the natural tendency of which is to produce passion in ordinary men and women.” (Citation and footnote omitted). In Sims, 319 Md. at 551-52, 573 A.2d 1317, the Court of Appeals discussed the circumstance of mutual combat and adequate provocation, stating: Mutual combat has been recognized as a possible source of adequate provocation. The rule of provocation will apply when persons enter into angry and unlawful combat with a mutual intent to fight and, as a result of the effect of the combat, the passion of one of the participants is suddenly elevated to the point where he resorts to the use of deadly force to kill the other solely because of an impulsive response to the passion and without time to consider the consequences of his actions. (Internal citations omitted). In Sims, id. at 547-48, 573 A.2d 1317, the defendant requested an instruction on manslaughter, and the trial court denied the request. The Court of Appeals observed that, although there was evidence of words and gestures exchanged between the defendant and the victim, and evidence that the victim had “directed racial and derogatory comments toward” *305the defendant, “there was no evidence of a mutual affray” and the victim’s comments “did not constitute adequate provocation.” Id. at 552, 573 A.2d 1317. In discussing the evidence presented at trial, the Court of Appeals stated that, even assuming arguendo that there was sufficient evidence of an adequate provocation, there [was] not a shred of evidence showing the state of mind of the defendant at the moment of the shooting. [The defendant’s] testimony shed[] no light on this because he testified he was not there. No one else saw his facial expressions or heard his speech at the time critical to this determination. Assuming that there might be a case where evidence of that type could demonstrate the sudden onset of hot-blooded passion that produced the mortal blow or shot, this [was] not such a case. The blood must indeed be hot, and under some circumstances only the hot-blooded killer can attest to that. Id. at 553, 573 A.2d 1317 (citations omitted). The Court of Appeals noted that, although the ultimate burden rests with the State to prove the absence of a legally adequate provocation, a defendant bears the initial burden of producing “some evidence” to warrant giving a jury instruction on legally adequate provocation. Id. In McKay v. State, 90 Md.App. 204, 207, 600 A.2d 904 (1992), this Court held that, given the facts of the case, there was sufficient evidence to warrant the giving of an instruction on adequate provocation. Two witnesses testified that they saw the defendant shoot the victim twice “following an affray between the two combatants.” Id. One witness testified that he saw the victim yell at the defendant and them jump on the defendant and start fighting him. Id. The victim “pounded” the defendant’s head “several times into metal steps along the sidewalk,” and the fight between the two men lasted several minutes until the defendant withdrew a revolver from his waistband and fired at the victim. Id. The defendant requested a jury instruction as to legally adequate provocation, which was denied by the trial court. Id. at 209-11, 600 A.2d 904. We concluded that “there was evidence from which the jury *306could have found [the defendant] acted in the heat of passion” and that the defendant had met the “burden of presenting sufficient evidence of mitigation to satisfy the ‘some evidence’ test.” Id. at 211, 217, 600 A.2d 904. Accordingly, we held that the trial court should have instructed the jury as to legally adequate provocation. Id. at 217, 600 A.2d 904. (c) Voluntary Intoxication The Court of Appeals has held that “[voluntary intoxication as a defense to some criminal charges is clearly recognized in Maryland.” Shell v. State, 307 Md. 46, 58, 512 A.2d 358 (1986). Indeed, as early as 1888, the Court of Appeals “noted as a general principle that evidence of intoxication was admissible to negate the mens rea required for a first degree murder conviction.” Id. at 59, 512 A.2d 358 (citation omitted). Stated otherwise, “[voluntary intoxication can have [an] exculpatory effect on any crime requiring specific intent. Thus, voluntary intoxication could negate guilt for criminal homicide of the specific-intent-to-kill variety at all levels of blameworthiness— first-degree murder, second[ ]degree murder, and voluntary manslaughter.” Bey v. State, 140 Md.App. 607, 631, 781 A.2d 952 (2001) (last alteration in original); see also State v. Gover, 267 Md. 602, 606, 298 A.2d 378 (1973) (“Generally, voluntary drunkenness is no defense to a criminal charge. The only exception to this occurs when a defendant, charged with a crime requiring a specific intent, is so drunk that he is unable to formulate that mens rea. His intoxication then will excuse his actions and serve as a defense.” (Citations omitted)); Lewis v. State, 79 Md.App. 1, 8-9, 555 A.2d 509, cert. denied, 316 Md. 549, 560 A.2d 1118 (1989) (“[V]oluntary intoxication does not excuse murder, but it may reduce murder in the first degree to murder in the second degree.” (Citation omitted)). As to the degree of intoxication, in Gover, 267 Md. at 607-08, 298 A.2d 378, the Court of Appeals stated: [T]he degree of intoxication which must be demonstrated to exonerate a defendant is great. Evidence of drunkenness which falls short of a proven incapacity in the accused to form the intent necessary to constitute the crime merely *307establishes that the mind was affected by drink so that he more readily gave way to some violent passion and does not rebut the presumption that a man intends the natural consequence of his act. (Citation omitted). In Lewis, 79 Md.App. at 12-13, 13 n. 4, 555 A.2d 509, as to evidence of intoxication, this Court stated: [T]he single fact that one has consumed what some may consider to be an inordinate amount of alcohol, standing alone, with no evidence as to the [ejffect of that alcohol on the defendant, would not permit a jury reasonable to conclude that he had lost control of his mental faculties to such an extent as to render him unable to form the intent[.] [Tjhere was no attempt in this case to offer expert opinions as to the [e]ffect on the defendant of the ingestion of those quantities of alcohol and drugs[.] ... Without knowing the -level of one’s tolerance, no good correlation can be observed between the amount of alcohol consumed and the degree of drunkenness displayed. In short, it is not the amount consumed but the effect on the consumer that is important. (Internal citations omitted). In Bazzle, 426 Md. at 545, 45 A.3d 166 the Court of Appeals held that “the evidence did not generate an instruction on voluntary intoxication because it was insufficient to allow a jury to rationally conclude that [the defendant] was so intoxicated that he was unable to form the intent necessary to constitute his crimes.” The defendant “got drunk with his friends[,]” consuming at least three 40-ounce containers of beer and then consuming more alcohol. Id. at 546, 45 A.3d 166. The victim testified that he had been sitting in a truck at a gas station when the defendant approached, told him to get out, and then stabbed him multiple times. Id. The defendant, who had also been stabbed, was taken to the hospital, where his blood alcohol content was measured at .157 and .137. Id. A friend testified that the defendant was bleeding and about to pass out. Id. Testifying on his own behalf at trial, the *308defendant denied that he attacked the victim and stated “he was unable to recall some of his own behavior on the night he was attacked.” Id. The defendant requested a voluntary intoxication jury instruction, which the trial court denied. Id. at 547, 45 A.3d 166. In Bazzle, id. at 555-56, 45 A.3d 166 the Court of Appeals held as follows: In this case, the evidence is insufficient to allow a jury to rationally conclude that [the defendant] was so severely impaired that he could not form the intent necessary to constitute his crimes. To be sure, [the defendant’s blood alcohol content of. 157 was nearly twice the legal driving limit. Illogical behavior and memory loss are also generally associated with excessive alcohol consumption. Yet [the defendant] has not shown that such phenomena, which are undoubtedly “some evidence” that he was drunk, are also “some evidence” that he was unable to form a specific intent. Essentially, all [the defendant] has shown is that he was drunk and exhibited the typical characteristics of being drunk. This is not evidence that he was unable to form a specific intent, and is therefore insufficient to raise a jury issue on voluntary intoxication as a defense to a specific intent crime. (Citation omitted). The Court of Appeals observed that some of the defendant’s actions were inconsistent with being intoxicated, including that he was able to recognize the gender of his two attackers, escape by running from the attackers, locate his friend’s house at night, and “speak intelligibly while allegedly intoxicated[.]” Id. at 556-57, 45 A.3d 166. Although acknowledging that the defendant “was indeed drunk on the night the crimes were committed,” the Court of Appeals noted that voluntary drunkenness alone (i.e. not to the “degree of intoxication which must be demonstrated to exonerate a defendant”) is no defense to a crime. Id. at 559, 45 A.3d 166 (citation omitted). As such, the Court held that the trial court did not abuse its discretion in refusing to give an instruction on voluntary intoxication. Id. See also Sutton *309v. State, 139 Md.App. 412, 428-29, 776 A.2d 47, cert. denied, 366 Md. 249, 783 A.2d 223 (2001) (We held that “the issue of voluntary intoxication was not generated for purposes of requiring a jury instruction” because “no evidence was established at trial of any impairment to [the defendant’s] ability to form the specific intent to commit robbery at the time of the murder.”); Myers v. State, 58 Md.App. 211, 219, 472 A.2d 1027, cert. denied, 300 Md. 484, 479 A.2d 373 (1984) (We held that the trial court properly refused to instruct the jury on voluntary intoxication because, in part, a witness’s testimony— that drinking was “going on” but that she, the defendant, and another man were not “falling down” and had been “in much worse shape”—“would not permit a jury reasonably to conclude that [the defendant] lost control to such an extent as to render him unable to appreciate the consequences of his actions.”); Mock v. State, 2 Md.App. 771, 775, 237 A.2d 811 (1968) (This Court held that the evidence—that “over approximately a ten-hour period the [defendant] consumed two vodka drinks and eight draft beers[,]” the defendant’s fiancé’s testimony that the defendant appeared to her to be drunk, and the defendant’s testimony that he was “feeling the beer” and “high” but not drunk—did “not constitute evidence of drunkenness sufficient to support” a voluntary intoxication jury instruction.). (4) Analysis Returning to the case at hand, we observe that the parties do not dispute that the requested instructions constitute correct statements of the law not covered by other instructions given by the circuit court. Rather, the question is whether instructions as to legally adequate provocation and voluntary intoxication were generated by the facts of the case. For the reasons set forth below, we conclude that the instructions were not warranted based on the evidence, and the circuit court properly declined to give the instructions. (a) Legally Adequate Provocation Given the evidence presented in the case, we find no merit in appellant’s contention that there was at least “some *310evidence” establishing either a mutual affray, or words and conduct on Curran’s part that provoked him.16 Contrary to appellant’s contention, there is simply no evidence of a mutual affray. When requesting the instruction, appellant’s counsel admitted that there was a lack of evidence of a mutual affray, acknowledging that the issue of self-defense [or legally adequate provocation] is generally generated either by a statement of the defendant about some kind of altercation, or of witnesses, of viewing some kind of altercation. We don’t have that in this case in either statement by the witnesses, who report a confession. Appellant’s attempt to cast Curran as the physical aggressor—based on: (1) Curran’s statements to medical personnel that he would like to kill those responsible for beating him; (2) Wright’s testimony that Curran was not a good customer when drunk; and (3) the toxicology report showing Curran tested positive for ethanol and other substances—fails on multiple levels to establish facts sufficient to warrant an instruction on legally adequate provocation. First, appellant’s characterization of Curran as capable of a physical affray is at odds with evidence presented at trial. Multiple witnesses testified that Curran was in poor physical condition before his death, having been “beaten very badly[,]” in Wright’s words. Martin testified that Curran was an “old guy. Pretty feeble. Dying of cancer[.]” According to Martin, Curran “could barely walk” and relied on him for transportation to and from the doctor’s office and the pharmacy. *311Dr. Ali testified that Curran had several “defense-type injuries” on his right hand and leg. Next, whether Curran was drunk at the time of his death or had a history of becoming verbally and physically aggressive when drunk or intoxicated was not sufficient to demonstrate that, on this occasion, Cur-ran was the physical aggressor or that Curran physically or verbally threatened appellant, thereby provoking appellant to respond in hot blood. In Sims, 319 Md. at 551-52, 573 A.2d 1317 we stated: [t]he rule of provocation will apply when persons enter into angry and unlawful combat with a mutual intent to fight and, as a result of the effect of the combat, the passion of one of the participants is suddenly elevated to the point where he resorts to the use of deadly force to kill the other solely because of an impulsive response to the passion and without time to consider the consequences of his action. (Citations omitted). Although in a reply brief, appellant contends that “[t]he conditions for Curran physically threatening [him] right before [he] allegedly killed [Curran] were all in placet,]” the record is devoid of any indication that Curran and appellant entered into a mutual physical fight on the evening of February 12, 2010. Appellant never confessed to having had such a fight—indeed, he indicated only that he and Curran had argued—nor did Carpenter testify that, upon arriving home, she observed signs that appellant had been in a fight, such as scratches, bruises, dried blood, or torn clothing. We agree with the State that Curran and appellant’s alleged argument over medication does not alone establish sufficient evidence of provocation to warrant giving the requested instruction. Finally, there was no evidence presented demonstrating appellant reacted with impulse or lacked time to consider the consequences of his actions. In other words, there was no indication that appellant was provoked or experiencing a “hotblooded” response at the time he killed Curran. As the Court of Appeals stated in Sims, 319 Md. at 553, 573 A.2d 1317: “The blood must indeed be hot, and under some circumstances *312only the hot-blooded killer can attest to that.” (Citations omitted). In sum, there is a complete lack of evidence as to either words or conduct sufficient to constitute legally adequate provocation. At trial, Carpenter testified that appellant “hurt” Curran because Curran “had said something inappropriate about [her].” No further information was provided about Curran’s allegedly inappropriate statement—such as, the content of the statement, i.e. what the allegedly inappropriate comment was, the time at which the comment was allegedly made, or the circumstances under which Curran made the comment. Even if Curran made a derogatory comment about Carpenter, words alone, “no matter how opprobrious, do not amount to an affray, and standing alone, do not constitute adequate provocation.” Sims, 319 Md. at 552, 573 A.2d 1317. There was no evidence presented that Curran made any physical contact with appellant, prior to appellant killing him. Testimony from McDonald demonstrates that appellant and Curran argued, not that they had a physical altercation. Further, “[i]t is well settled that provocative words—even if accompanied by some physical contact—do not constitute adequate provocation to mitigate a murder to a manslaughter.” Rich, 415 Md. at 581, 3 A.3d 1210.17 *313For all of these reasons, we perceive no abuse of discretion in the circuit court’s refusal to instruct the jury as to legally adequate provocation, as appellant failed to demonstrate that “some evidence” generated such an instruction. (b) Voluntary Intoxication Similarly, in this case, we conclude that appellant failed to produce evidence sufficient to permit the jury to conclude that he was intoxicated to such a degree that he was unable to form the specific intent necessary to commit first-degree murder. Appellant identifies only two pieces of evidence as supporting his request for an instruction on voluntary intoxication—(1) McDonald’s testimony that appellant confided to him that he and Curran had been drinking; and (2) Carpenter’s testimony that appellant appeared “very drunk” and passed out when he returned home from Curran’s house. The circuit court properly refused to give the instruction on voluntary intoxication, finding that there had been no evidence demonstrating what appellant consumed or when he consumed it, ie. before, at the time of, or after the murder. Viewed generously, the evidence demonstrates merely that, on the day of the offense, appellant drank alcohol at some time at Curran’s house, and appeared drunk and passed out later after he returned home.18 Appellant failed to generate evi*314dence that he was intoxicated or exhibiting the effects of alcohol while at Curran’s house, and, most importantly, at the time he killed Curran. In Bazzle, 426 Md. at 553, 45 A.3d 166 the Court of Appeals clearly stated that “mere intoxication is insufficient to negate a specific intent[.]” We agree with the State that the evidence falls short of establishing that, at the time of the offense, “[appellant] was intoxicated, and that that intoxication was to such [an] extent as to make him incapable of forming the intent necessary to constitute the crime.” In Bazzle, id. at 546-47, 555-56, 45 A.3d 166 a case in which the Court of Appeals held that the evidence was insufficient to raise a jury issue as to voluntary intoxication, there was evidence concerning the amount of alcohol the defendant drank, the defendant’s blood alcohol content, and the defendant’s testimony that he was unable to recall some of his behavior the night of the crime. In Smith v. State, 69 Md.App. 115, 119-21, 516 A.2d 985 (1986), a case where we held that the evidence was sufficient to generate an instruction on voluntary intoxication, there was evidence presented as to the quantity and type of alcohol and drugs the defendant consumed, the timeframe in which the defendant consumed the substances, and witness testimony that the defendant was slurring, unbalanced when walking, falling, and “out of it.” Here, there is no evidence concerning what appellant consumed, how much he consumed, when he consumed it, or what effect—if any—such consumption had upon him, sufficient to demonstrate that he was intoxicated to the point that he was unable to form a specific intent to kill Curran.19 As to the effect of alcohol on appellant, with evidence only that appellant appeared drunk at his own house and passed out, we are *315unable to conclude that there was “some evidence,” which, if believed, would support a finding that appellant’s degree of intoxication negated his ability to form a specific intent at the time of the offense. Simply put, an instruction on voluntary intoxication was not generated by the facts of the case.20 IV. (1) Contentions Appellant contends that the evidence is insufficient to support his conviction for first-degree murder. Appellant concedes that, in the light most favorable to the State, the evidence was sufficient for a rational trier of fact to conclude beyond a reasonable doubt that he stabbed Curran with the intent to kill him, but that the evidence is not sufficient for a rational trier of fact to conclude beyond a reasonable doubt that he “killed Curran deliberately and premeditatively,” ie. that he committed first-degree murder. Appellant argues that there is “abundant evidence” that the stabbing occurred as a result of his rashness and impulsive anger, but little or no evidence that he killed Curran deliberately and with premeditation. Appellant maintains that evidence concerning the manner in which Curran was killed and the wounds that were inflicted is “ambiguous.” Appellant asserts that, assuming there is evidence supporting a finding that he deliberately and with premeditation killed Curran, there is an equal amount of evidence to support a finding to the contrary. Appellant maintains that where “ ‘the evidence equally supports two versions of events, and a finding of guilt requires speculation as to which of the two versions is correct, a conviction cannot be sustained.’ ” *316The State responds that the evidence is sufficient to support appellant’s conviction for first-degree murder. The State contends that the elements of premeditation and deliberation were established by evidence that Curran was stabbed ten times, sustained injuries to different locations of his body, and by appellant’s admission to stabbing Curran in the head and lungs. The State maintains that the intent to kill may be inferred from the use of a deadly weapon aimed at a vital body part, and that the evidence in the instant case demonstrated that, appellant stabbed Currán “multiple times in vital parts of the body[.]” (2) Standard of Review In Morris v. State, 192 Md.App. 1, 30-31, 993 A.2d 716 (2010), this Court explained the standard of review for the sufficiency of evidence to support a conviction. This Court stated: In reviewing a challenge to the sufficiency of the evidence to support a conviction, we view the evidence in the light most favorable to the prosecution in order to determine whether any rational trier of fact could have found the essential elements of the crime beyond a reasonable doubt. We defer to the fact-finder’s decisions on which evidence to accept and which inferences to draw when the evidence supports differing inferences. In other words, we give deference to all reasonable inferences [that] the fact-finder draws, regardless of whether ... [we] would have chosen a different reasonable inference. In our independent review of the evidence, we do not distinguish between circumstantial and direct evidence because [a] conviction may be sustained on the basis of a single strand of direct evidence or successive links of circumstantial evidence. Id. (alterations, emphasis, and omission in original) (internal citation and quotation marks omitted). In Pinkney v. State, 151 Md.App. 311, 338-39, 827 A.2d 124, cert. denied, 377 Md. 276, 833 A.2d 32 (2003), we noted that, in reviewing an issue as to the sufficiency of the evidence to support a conviction, “our task is not to determine whether there were other permissible *317inferences that the jury could have made. Instead, we must ensure that the evidence supports a finding that the elements of the crime existed beyond a reasonable doubt.” In Taylor v. State, 346 Md. 452, 458, 697 A.2d 462 (1997), the Court of Appeals explained that “when the evidence equally supports two versions of events, and a finding of guilt requires speculation as to which of the two versions is correct, a conviction cannot be sustained. This, of course, does not preclude a conviction based on a credibility determination emanating from disputed evidence.” (Internal citations omitted). (3) Law First-degree murder is “a deliberate, premeditated, and willful killing[.]” C.L. § 2-201. In Pinkney, 151 Md.App. at 332, 827 A.2d 124, this Court reiterated the elements necessary to support a conviction for first-degree murder, stating that first-degree murder “requires that the defendant possess the intent to kill (willful), that the defendant have conscious knowledge of the intent to kill (deliberate), and that there be enough time for the defendant to deliberate, i.e., time enough to have thought about that intent (premeditate).” (Citation and internal quotation marks omitted). See also Tichnell v. State, 287 Md. 695, 717, 415 A.2d 830 (1980) (“For a killing to be ‘willful’ there must be a specific purpose and intent to kill; to be ‘deliberate’ there must be a full and conscious knowledge of the purpose to kill; and to be ‘premeditated’ the design to kill must have preceded the killing by an appreciable length of time, that is, time enough to be deliberate.”). Because “most defendants do not announce their intent to kill to witnesses or other third partes, [appellate courts] are forced to look to other factors as reflecting the defendant’s intent to kill.” Pinkney, 151 Md.App. at 332, 827 A.2d 124. Maryland appellate courts have found evidence of a defendant’s specific intent and design to kill based on facts such as the number of times a defendant shoots a victim at point-blank range, the use of a defendant’s hands to strike fatal blows to a baby’s head, a defendant’s motive for murder, and a defen*318dant’s version of events being contradicted by other witnesses. Id. at 333-34, 827 A.2d 124 (citations omitted). As stated above, an intent to kill need not—and most likely will not—be announced by the defendant. “In Maryland, it is well established that ‘under the proper circumstances an intent to kill may be inferred from the use of a deadly weapon directed at a vital part of the human body.’ ” Buck v. State, 181 Md.App. 585, 642, 956 A.2d 884 (2008) (citations omitted). Indeed, “ ‘it is permissible to infer that “one intends the natural and probable consequences of his act.” ’ ” Smallwood v. State, 343 Md. 97, 106, 680 A.2d 512 (1996) (“When a deadly weapon has been fired at a vital part of a victim’s body, the risk of killing the victim is so high that it becomes reasonable to assume that the defendant intended the victim to die as a natural and probable consequence of the defendant’s actions.”). As to the elements of “premeditation” and “deliberation,” this Court has noted that the two elements are often reviewed together. Pinkney, 151 Md.App. at 335, 827 A.2d 124. In Willey v. State, 328 Md. 126, 133, 613 A.2d 956 (1992), superseded by statute on other grounds as noted in State v. Wischhusen, 342 Md. 530, 534 n. 4, 677 A.2d 595 (1996), the Court of Appeals stated that “an appreciable length of time” has been equated “with any amount of time sufficient to convince the trier of fact that the purpose to kill was not ‘the immediate offspring of rashness and impetuous temper,’ but was the product of a mind ‘fully conscious of its own design.’ ” (Citations omitted). The Court of Appeals further explained that “ ‘[i]f the killing results from a choice made as the result of thought, however short the struggle between the intention and the act, it is sufficient to characterize the crime as deliberate and premeditated murder.’ ” Id. (citations omitted) (emphasis and alteration in original). Importantly, “premeditation may be established circumstantially from the facts of a particular murder.” Pinkney, 151 Md.App. at 336, 827 A.2d 124 (citation and internal quotation marks omitted). *319In Smith v. State, 41 Md.App. 277, 317-18, 398 A.2d 426 (1979), with Judge Charles E. Moylan speaking for the Court, we discussed the elements of deliberation and premeditation at length as follows: Deliberation and premeditation may be instantaneous. The period of time required for premeditation and deliberation in first-degree murder is only that which is necessary for one thought to follow another. For a killing to be premeditated there need be no appreciable space of time between the intention to kill and the killing—they may be as instantaneous as successive thoughts of the mind.... If there be sufficient deliberation to form a design to take life, and to put that design into execution by destroying life, there is sufficient deliberation to constitute murder, no matter whether the design be formed at the instant of striking the fatal blow or whether it be contemplated for months. It is enough that the intention precedes the act although that follows instantly. The [diminution of the time interval virtually to the vanishing point] has been inexorably at work in Maryland. The evidence was found to be legally sufficient to support deliberation and premeditation in the following questionable circumstances: [ ] a street fight where the defendant only turned upon the victim at the moment when the victim attempted to dissuade him from killing another[]; [] an unexplained killing following a drunken quarrel[]; [] a drunken quarrel with the time interval being represented by the time necessary to walk across the room, pick up a gun, raise it and fire it[ ]; [ ] a drunken and jealous quarrel with the time for premeditation being represented by a walk to the kitchen to pick up a knife and the use of it a minute or two later[ ]; [ ] a drunken and jealous quarrel[.] The classic instance of this erosion is Chisley v. State, 202 Md. 87, 95 A.2d 577 (1953). Chisley had been drinking and was riding home with his father, the father’s brother-in-law and the victim. Chis[]ley was sleeping. When the car arrived home, the father got out first, followed by the father’s *320brother-in-law. At that point, the brother-in-law told the father that the father had dropped some cigarettes. This was the onset of trouble. Chisley said the cigarettes were his and the victim said that they were not. The father described what followed that exchange: “That’s all there was to it. He gets out the gun and shot him; there wasn’t any argument to it.” A second shot later followed the first shot. Ignoring the very real possibility that the first shot may well have been the fatal one, the Court of Appeals held that the time interval between the two shots was sufficient to permit a finding of deliberation and premeditation. (Internal quotation marks and most citations omitted). In Colvin v. State, 299 Md. 88, 107-08, 472 A.2d 953, cert. denied, 469 U.S. 873, 105 S.Ct. 226, 83 L.Ed.2d 155 (1984), the Court of Appeals held that, assuming as argued by the defendant that “the number of wounds ... without more” cannot “constitute legally sufficient proof of premeditation[,]” there was “other evidence from which the jury could find premeditation.” The victim was found stabbed to death in her daughter’s house, entry to which “apparently had been gained through a basement door.” Id. at 95, 472 A.2d 953. A glass pane of the door was broken, the chain locks unhinged, and jewelry was missing. Id. The investigation revealed that latent fingerprints from the glass basement door matched known prints of the defendant, and that the defendant had pawned the jewelry taken from the house. Id. In Colvin, id. at 109, 472 A.2d 953, the Court of Appeals stated: “In this case there was evidence of a protracted assault and an effort by the victim to defend herself. Twenty eight stab wounds were inflicted to various parts of the victim’s body. Some of these wounds were defense-type wounds found on the victim’s hands.” Based on these circumstances, in Colvin, id. at 110, 472 A.2d 953, the Court of Appeals determined that the jury “was entitled to conclude that the time during which [the defendant] carried the knife from the kitchen to the stairway, compounded by the protracted nature of the assault, was sufficient time for him to have *321chosen, after thought and deliberation, to kill.” In Pinkney, 151 Md.App. at 343, 827 A.2d 124 this Court stated: We [ ] do not adopt a bright line rule of legal sufficiency for first degree murder, based solely on the number of blows delivered. We merely hold that the evidence was legally sufficient to convict [the defendant] of first degree murder for the death of a six-month-old child based on the totality of the evidence, including evidence as to the number, severity, and brutality of the blows, the circumstances leading up to the beatings, and [the defendant’s version of events. (4) Analysis To begin, we observe that appellant concedes that “the evidence is sufficient for a rational trier of fact to conclude beyond a reasonable doubt that [he] stabbed Curran with the intent to kill him, i.e., that the killing was wi[llful].” The issue is whether the evidence was sufficient to permit a rational trier of fact to conclude beyond a reasonable doubt that appellant killed Curran with deliberation and premeditation as required for a conviction of first-degree murder. Although not raised by the State on brief, we conclude that, on appeal, appellant advances an argument as to the sufficiency of the evidence that he failed to bring in the circuit court on motion for judgment of acquittal, i.e. that the evidence failed to demonstrate the deliberation and premeditation sufficient for first-degree murder. Accordingly, the issue is not preserved for appellate review. See Tetso v. State, 205 Md.App. 334, 383, 45 A.3d 788 cert. denied, 428 Md. 545, 52 A.3d 979 (2012) (“The issue of sufficiency of the evidence is not preserved when appellant’s motion for judgment of acquittal is on a ground different than that set forth on appeal.” (Citation omitted)). Before the circuit court, in the motion for judgment of acquittal made at the close of the State’s case, appellant’s counsel argued that the evidence—namely, Carpenter’s and McDonald’s testimony—was confusing, contradictory, and not credible, and that it was not clear what date Curran was *322killed, i.e. it was not clear that Curran was killed on February 12, 2010. At the close of all the evidence, appellant’s counsel moved for a judgment of acquittal, asking the circuit court “to assess credibility with respect to the further witnesses” and arguing that the evidence demonstrated that Curran was killed on February 16, 2010, not February 12, 2010. Appellant’s counsel stated that he thought intent was “something completely open, especially given [ ] Curran’s state of mind as established by the hospital records that were introduced.” Appellant’s counsel failed to argue—at all or with any specificity as required by Maryland Rule 4-324—that there was insufficient evidence of premeditation and deliberation, thus failing to preserve the issue for review. Nonetheless, we address the merits of appellant’s contention. Viewing the evidence in the light most favorable to the State, we are satisfied that the evidence was sufficient for a rational trier of fact to determine beyond a reasonable doubt that appellant acted with premeditation and deliberation in stabbing and killing Curran. For premeditation and deliberation, the law requires only that “the defendant have conscious knowledge of the intent to kill (deliberate), and that there be time enough for the defendant to deliberate, i.e., time enough to have thought about that intent (premeditate).” Pinkney, 151 Md.App. at 332, 827 A.2d 124 (citation and internal quotation marks omitted). Indeed, “[d]eliberation and premeditation may be instantaneous[,]” Smith, 41 Md.App. at 317, 398 A.2d 426, as long as there is sufficient time for the trier of fact to determine that the purpose to kill “was the product of a mind fully conscious of its own design[,]” Willey, 328 Md. at 133, 613 A.2d 956 (citations internal quotation marks omitted), and “premeditation may be established circumstantially from the facts of [the] particular murder.” Pinkney, 151 Md.App. at 336, 827 A.2d 124 (citation and internal quotation marks omitted). We have no difficulty concluding that the evidence was sufficient for a rational trier of fact to determine beyond a reasonable doubt that appellant acted with deliberation and *323premeditation in killing Curran. The record reflects that the following evidence more than establishes beyond a reasonable doubt that appellant acted with deliberation and premeditation: (1) On one occasion, shortly before the murder, appellant approached Matthew and Miles as they were sitting in a vehicle, and “talk[ed] about robbing the guy up the street” to “steal his pills[.]” (2) During this discussion, appellant stated that he knew “where to get some Percocets at, [and that Matthew and Miles had] to go get the man drunk down at the shacks” and “take his medicine.” (3) Both Matthew and Miles believed appellant was referring to Curran. (4) McDonald testified that appellant admitted that he and Curran argued over pills, and that “he stabbed [Curran] in the temple and in the neck or something like that.” (5) Carpenter testified that appellant confessed that he had hurt or killed Curran. According to Carpenter, appellant stated that Curran “had been stabbed in each lung and in the head.” (6) During Carpenter’s September 9, 2010, interview with detectives, she informed detectives that appellant told her that “he had stabbed [Curran] on either side of the chest and then, uh, put a blade through his skull[,]” and that he had thrown away the knife in a dumpster. (7) The autopsy performed on Curran revealed that he suffered a total of ten stab wounds and three cutting wounds. (8) According to Dr. Ali, “two of the stab wounds injured the heart, perforated the heart, and caused significant bleeding in the chest cavity[,]” another “cluster of three stab wounds to the right side of the chest” injured the heart and passed through the liver “causing bleeding in the abdominal cavity or inside the belly[,]” another stab wound perforated the left leg—or “entered and exited the other side of the leg[,]”—and a stab wound to the left temple “fractured the skull and went through the brain[.]” Curran had a cutting wound to the neck and two cutting wounds on his right hand. Dr. Ali opined that the cutting wound “injuries to the right hand are typical of defense-type injuries, when you start to ... try to grab a knife[,]” and that the injuries to Curran’s leg “could be consistent with defense injuries.” Dr. Ali testified that the wounds were consistent with the use of a knife. (9) *324Detective Sewell testified that law enforcement did not release any information to the public about the location and number of stab wounds inflicted on Curran, yet appellant was aware Curran had been stabbed in the head and chest. (10) Cur-ran’s residence was ransacked, and the drawer in which he stored his pills, medication, and money was turned over on the floor upside down. The above evidence was more than sufficient to permit a rational trier of fact to conclude that appellant acted with deliberation and premeditation. The jury was well within its province to resolve any factual disputes in favor of the State. In addition to other facts, the evidence demonstrated that appellant’s suggestion to Matthew and Miles to rob Curran of his pills, the ransacking of Curran’s house, including the dresser drawer in which Curran stored his pills and medication, as well as the length and nature of the assault— ten stab wounds, including wounds that pierced Curran’s heart and brain and three cutting wounds—constituted deliberation and premeditation. Taking the evidence in the light most favorable to the State, the facts are more than sufficient to support the conclusion beyond a reasonable doubt that appellant committed first-degree murder.21 *325Y. (1) Contentions Appellant contends that the circuit court erred in excluding evidence that Curran made statements to Martin and Buck-land identifying other people as those responsible for assaulting him shortly before he was killed. Appellant argues that, procedurally, the circuit court failed to make findings concerning the admissibility of Curran’s statements under Maryland Rule 5-803(b)(24). Appellant maintains that Curran’s statements are admissible under Maryland Rule 5-803(b)(24) because: (1) the statements had “ ‘circumstantial guarantees of trustworthiness’ ” and indicia of reliability; (2) the statements were evidence of a material fact, i.e. who killed Curran, as the “persons who recently assaulted Curran are reasonable suspects in his killing”; (3) the statements were “more probative than any other evidence which [] could have been procured through reasonable efforts”; and (4) he had provided prior notice to the State of his intention to offer the statements into evidence. Appellant asserts that Curran’s statements are admissible “as a matter of due process.” Appellant contends that the circuit court’s error in not admitting the statements was not harmless as there was no physical evidence linking him to Curran’s murder and the State’s case “rested on alleged confessions and random statements all of dubious import.” The State responds that the circuit court properly excluded Curran’s statements to McDonald and Buckland on the grounds of relevancy and hearsay. The State contends that the hearsay testimony appellant sought to introduce—i.e. information concerning those Curran identified as his assailants in a “prior beating”—was unrelated to the instant offense. *326The State argues that the statements appellant attempted to elicit were not related to Curran’s murder, but rather were statements identifying “three individuals as being involved in an earlier, unrelated assault on the victim several days before the murder.” The State asserts that appellant’s counsel’s proffer that Curran, in one instance, identified two individuals, and in another instance, identified three individuals, “refuted any suggestion that the victim’s statements contained ‘equivalent circumstantial guarantees of trustworthiness’ as [] required[.]” In sum, the State maintains that the criteria for admissibility of the statements under Maryland Rule 5-803(b)(24) was not satisfied. The State asserts that any error by the circuit court was harmless beyond a reasonable doubt, and points out that appellant was not precluded from calling as witnesses the people about whom he sought to elicit information. (2) Standard of Review In Bernadyn v. State, 390 Md. 1, 7-8, 887 A.2d 602 (2005), the Court of Appeals explained the standard of review for hearsay determinations as follows: We review rulings on the admissibility of evidence ordinarily on an abuse of discretion standard. Review of the admissibility of evidence which is hearsay is different. Hearsay, under our rules, must be excluded as evidence at trial, unless it falls within an exception to the hearsay rule excluding such evidence or is “permitted by applicable constitutional provisions or statutes.” Md. Rule 5-802. Thus, a circuit court has no discretion to admit hearsay in the absence of a provision providing for its admissibility. Whether evidence is hearsay is an issue of law reviewed de novo. (Emphasis in original) (one internal citation omitted). See also Walker v. State, 107 Md.App. 502, 517, 668 A.2d 990 (1995), aff'd, 345 Md. 293, 691 A.2d 1341 (1997) (“We ... hold that in reviewing a trial court’s admission of hearsay under a residual exception [i.e. Maryland Rule 5—803(b)(24) ] we will decide whether the trial judge erred as a matter of law.”). *327(3) Law (a) Maryland Rule 5-803(b)(24) Maryland Rule 5-801(c) defines “hearsay” as “a statement, other than one made by the declarant while testifying at the trial or hearing, offered in evidence to prove the truth of the matter asserted.” Maryland Rule 5-802, the “hearsay rule,” provides: “Except as otherwise provided by these rules or permitted by applicable constitutional provisions or statutes, hearsay is not admissible.” Maryland Rule 5-803 outlines numerous hearsay exceptions. Maryland Rule 5-803(b)(24), a “residual” or “catch-all” exception, provides: The following are not excluded by the hearsay rule, even though the declarant is available as a witness: Other exceptions. Under exceptional circumstances, the following are not excluded by the hearsay rule: A statement not specifically covered by any of the hearsay exceptions listed in this Rule or in Rule 5-804, but having equivalent circumstantial guarantees of trustworthiness, if the court determines that (A) the statement is offered as evidence of a material fact; (B) the statement is more probative on the point for which it is offered than any other evidence which the proponent can procure through reasonable efforts; and (C) the general purposes of these rules and the interests of justice will best be served by admission of the statement into evidence. A statement may not be admitted under this exception unless the proponent of it makes known to the adverse party, sufficiently in advance of the trial or hearing to provide the adverse party with a fair opportunity to prepare to meet it, the intention to offer the statement and the particulars of it, including the name and address of the declarant.[22] *328The Committee Note to Maryland Rule 5-803(b)(24) provides as follows: The residual exception provided by Rule 5-803(b)(24) does not contemplate an unfettered exercise of judicial discretion, but it does provide for treating new and presently unanticipated situations which demonstrate a trustworthiness within the spirit of the specifically stated exceptions. Within this framework, room is left for growth and development of the law of evidence in the hearsay area, consistently with the broad purposes expressed in Rule 5-102. *329It is intended that the residual hearsay exception will be used very rarely, and only in exceptional circumstances. The Committee does not intend to establish a broad license for trial judges to admit hearsay statements that do not fall within one of the other exceptions contained in Rules 5-803 and 5-804(b). The residual exception is not meant to authorize major judicial revisions of the hearsay rule, including its present exceptions. Such major revisions are best accomplished by amendments to the Rule itself. It is intended that in any case in which evidence is sought to be admitted under this subsection, the trial judge will exercise no less care, reflection, and caution than the courts did under the common law in establishing the now-recognized exceptions to the hearsay rule. In Walker v. State, 107 Md.App. 502, 526, 668 A.2d 990 (1995), aff'd, 345 Md. 293, 691 A.2d 1341 (1997), this Court held that the trial court erred in admitting hearsay statements pursuant to Maryland Rule 5-804(b)(5) without analyzing whether the statements met the requirements of the Rule. The prosecutor called the defendant’s wife as a witness, and she invoked the spousal privilege not to testify against the defendant. Id. at 510, 668 A.2d 990. The prosecutor moved to admit written, signed statements that the wife had given to law enforcement officers before she married the defendant. Id. The trial court granted the motion, ruling that the wife’s statements were admissible pursuant to Maryland Rule 5-804(b)(5) because they were “reliable.” Id. at 511, 668 A.2d 990. This Court reviewed the legislative history of Maryland Rule 5-804(b)(5), noting that the Court of Appeals intended the “ ‘exceptional circumstances’ requirement [of the Rule] to be followed strictly.” Id. at 524, 668 A.2d 990. We stated that, “although the Court of Appeals ultimately decided to adopt a residual exception, the introductory limiting language and the Committee note should be interpreted in a manner that requires the trial judge to [give] careful and thoughtful consideration on the record of all of the rule’s limiting requirements before admitting evidence under the residual exception.” Id. at 526, 668 A.2d 990. In admitting the wife’s *330statements to detectives, we observed that the trial court failed to determine whether: (1) the statements possessed sufficient circumstantial guarantees of trustworthiness; and (2) there were exceptional circumstances justifying admission of the statements. Id. In State v. Walker, 345 Md. at 296, 330, 691 A.2d 1341, the Court of Appeals affirmed this Court’s decision, concluding that the wife’s statements were wrongfully admitted “because there was no exceptional circumstance justifying admission under the residual exception provided for in Rule 5-804(b)(5).” The Court of Appeals set forth six conditions that must be satisfied for evidence to be admissible under Maryland Rule 5-804(b)(5), stating: (1) the witness must be “unavailable,” as defined in § (a) of the rule [ (this is not a requirement under Maryland Rule 5—803(b)(24)) ]; (2) there must be “exceptional circumstances”; (3) the statement must not be specifically covered by any of the other exceptions; (4) it must have “equivalent circumstantial guarantees of trustworthiness”; (5) the court must determine that (i) the statement is offered as evidence of a material fact, (ii) the statement is more probative on the point for which it is offered than any other evidence which the proponent can produce through reasonable efforts, and (iii) the general purposes of the rules and the interests of justice will best be served by admission of the statement into evidence; and (6) the proponent of the statement has given the requisite advance notice of its intention to use the statement. Id. at 318-19, 691 A.2d 1341 (footnotes omitted). (b) Harmless Error In Dorsey v. State, 276 Md. 638, 659, 350 A.2d 665 (1976), the Court of Appeals discussed harmless error, stating: [W]hen [a defendant], in a criminal case, establishes error, unless a reviewing court, upon its own independent review *331of the record, is able to declare a belief, beyond a reasonable doubt, that the error in no way influenced the verdict, such error cannot be deemed “harmless” and a reversal is mandated. Such reviewing court must thus be satisfied that there is no reasonable possibility that the evidence complained of—whether erroneously admitted or excluded— may have contributed to the rendition of the guilty verdict. (Footnote omitted). “The harmless error standard is highly favorable to the defendant, and ‘the burden is on the State to show that [the error] was harmless beyond a reasonable doubt’ and did not influence the outcome of the case.” Perez v. State, 420 Md. 57, 66, 21 A.3d 1048 (2011) (alteration in original) (internal citations omitted). In Perez, id. at 76, 21 A.3d 1048 the Court of Appeals instructed that in “[a]pplying Dorsey and its progeny, we must determine, based on the record, whether the error possibly influenced the verdict in this case.” (4) Analysis In this case, we conclude that the circuit court properly excluded Curran’s statements to Martin and Buckland, finding that the statements were hearsay not admissible under any hearsay exception. Based on the circumstances in this case, as well as appellant’s counsel’s proffer concerning the statements, we see no error in the circuit court’s exclusion of the statements. We explain. Appellant contends that, procedurally, the circuit court failed to make any findings concerning the admissibility of the statements under Maryland Rule 5-803(b)(24). Neither the Rule nor case law, however, requires that a trial court procedurally make findings as to each factor of the Rule in excluding the admission of a hearsay statement. Rather, the Rule and case law mandate only that a trial court procedurally address each factor when it admits the hearsay statement. Maryland Rule 5-803(b)(24) simply states that a statement, not otherwise covered by a hearsay exception, is not excludable by the hearsay rule if the trial court determines that the statement meets the criteria set forth in the Rule, i.e. the trial *332court must determine that the criteria are satisfied before admitting—not excluding—a statement. In Walker, 107 Md. App. at 526, 668 A.2d 990, we held that the trial court erred when it admitted hearsay statements pursuant to a residual exception without determining whether the requisite criteria were satisfied.23 Similarly, upon the grant of certiorari, in Walker, 345 Md. at 318, 691 A.2d 1341, the Court of Appeals discussed that certain “conditions need to be satisfied for evidence to be admissible under” a residual exception. The Court of Appeals also stated: “We do not agree ... that the failure to announce subsidiary findings and conclusions necessarily requires reversal.” Id. at 324, 691 A.2d 1341. Neither we nor the Court of Appeals discussed or mandated a procedure which trial courts must follow when excluding a hearsay statement. Accordingly, we hold that the circuit court in this case did not err in excluding Curran’s statements to Martin and Buckland, finding that the statements were inadmissible hearsay. Although a\"trial court is certainly free to address each factor and make findings concerning the admissibility of a statement pursuant to Maryland Rule 5-803(b)(24), we discern no error where the trial court—as the circuit court did in this instance—excludes a statement as hearsay without further ado. We conclude that Curran’s statements were inadmissible hearsay because there were no exceptional circumstances justifying their admission pursuant to Maryland Rule 5-803(b)(24). We are guided by the Committee Note accompanying Maryland Rule 5-803(b)(24), which states that the residual hearsay exception is intended to “be used very rarely, and only in exceptional circumstances” where there are “new and presently unanticipated situations[.]” Before the circuit court and on brief before this Court, appellant fails to allege that exceptional circumstances exist warranting admission of the hearsay statements. Appellant has neither offered nor de*333scribed any exceptional circumstance warranting admission of the statements. The only circumstance which we discern from the record as possibly being an exceptional circumstance in this case is that Curran is dead and not available to testify as to who assaulted him. We, therefore, examine whether that circumstance qualifies as “exceptional.” The Maryland Rules clearly contemplates situations in which a declarant is deceased and yet his or her statement is admissible pursuant to a hearsay exception. “Unavailability as a witness” is defined, in pertinent part, as “situations in which the declarant ... is unable to be present or to testify at the hearing because of death[.]” Maryland Rule 5-804(a)(4). Thus, death of a declarant is not a “new and [ ] unanticipated situation[ ]” for which the residual hearsay exception in Maryland Rule 5-803(b)(24) should be applied. As “[t]here is nothing ‘unique’ or exceptional” about Curran having made statements prior to his death, we hold that the circuit court properly excluded the statements. See Walker, 345 Md. at 329, 691 A.2d 1341 (“There is nothing ‘unique’ or exceptional about a spouse invoking his or her statutory privilege.”). Because we determine that there were no exceptional circumstances justifying admission of Curran’s statements pursuant to Maryland Rule 5-803(b)(24)—and that Curran’s death was not an exceptional circumstance—we need not address the other factors required for admission of a statement under the Rule as outlined by the Court of Appeals in Walker, 345 Md. at 318-19, 691 A.2d 1341. Appellant mistakenly relies upon Foster v. State, 297 Md. 191, 193, 464 A.2d 986 (1983), a case decided before the Maryland Rules contained the residual exception for hearsay, in which the Court of Appeals held that the trial court erred in refusing to admit “exculpatory hearsay testimony critical to [the defendant’s] defense.” The defendant was sentenced to death for murdering the manager of a motel in which the defendant and her husband resided. Id. At trial, the defendant sought to demonstrate that her husband committed the murder. Id. at 195, 464 A.2d 986. The defendant offered *334testimony from the victim’s friend that the victim had called her (the friend) in a “highly agitated state” and advised that she had asked the husband for past-due rent, that she was afraid for her life, and that the husband had threatened her. Id. at 200-01, 464 A.2d 986. The trial court determined “that the proffered testimony [from the victim’s friend] was hearsay, and that ... it was not sufficiently reliable to be admitted.” Id. at 201, 464 A.2d 986. On appeal, in Foster, id. at 202, 464 A.2d 986, the defendant contended that “the application of the hearsay rule, which prevented her from presenting a portion of her defense, rendered her trial fundamentally unfair and deprived her of due process of law.” Relying on Green v. Georgia, 442 U.S. 95, 99 S.Ct. 2150, 60 L.Ed.2d 738 (1979),24 and Chambers v. Mississippi 410 U.S. 284, 93 S.Ct. 1038, 35 L.Ed.2d 297 (1973),25 the Court of Appeals agreed with the defendant, concluding that “[r]egardless of whether the proffered testi*335mony [was] inadmissible because of Maryland’s hearsay rule, under the facts of th[e] case, its exclusion deprived the [defendant] of a fair trial in violation of the Due Process Clause of the Fourteenth Amendment.” Foster, 297 Md. at 210, 464 A.2d 986. At trial, when arguing against admitting Curran’s statements, the prosecutor stated that appellant’s counsel had informed her that he “intend[ed] to call them [the people Curran had named as his assailants].” Appellant’s counsel responded: “And I will.” Thus, appellant’s counsel acknowledged that there were other means of eliciting the sought after information. Because appellant could have called the individuals as witnesses, he was not deprived of fair trial such that his right to due process was violated. The rule against hearsay was not “applied mechanistically to defeat the ends of justice[,]” Chambers, 410 U.S. at 302, 93 S.Ct. 1038indeed, appellant had every opportunity to present a full and complete defense, but, for reasons not clear from the record, chose not to do so. Alternatively, we conclude that any error in the exclusion of testimony concerning Curran’s statements was harmless beyond a reasonable doubt. Testimony at trial—including confessions to two State’s witnesses—established overwhelming evidence of appellant’s identity as the killer. On brief before this Court, appellant concedes that “the evidence is sufficient for a rational trier of fact to conclude beyond a reasonable doubt that [he] stabbed Curran with the intent to kill him[.]” As the State points out, although appellant had no duty to present evidence, he was not precluded from calling as witnesses those individuals about whom he sought to elicit testimony through Curran’s statements to Martin and Buck-land. Nor was appellant precluded from eliciting information about the assault from others who may have witnessed the assault. In this case, given the overwhelming evidence of guilt, as well as the other circumstances described above, we are satisfied that any error, if at all, was harmless beyond a reasonable doubt. *336JUDGMENT OF THE CIRCUIT COURT FOR CECIL COUNTY AFFIRMED. CASE REMANDED TO THE CIRCUIT COURT FOR REIMPOSITION OF THE SENTENCE FOLLOWED BY SOME PERIOD OF PROBATION IN ACCORDANCE WITH CRIMINAL PROCEDURE ARTICLE § 6-222. COSTS TO BE PAID BY APPELLANT. . Appellant was also charged with second-degree murder and first-degree assault. Pursuant to instructions on the verdict sheet—which advised the jury not to consider whether appellant was guilty of second-degree murder or first-degree assault if it found appellant guilty of first-degree murder—the jury did not render a verdict as lo the charges of second-degree murder and first-degree assault. . Appellant was sentenced to life imprisonment, with all but eighty years suspended for first-degree murder, and no period of probation. Criminal Procedure Article § 6-222(a), provides, in pertinent part, that a circuit court may: (1) impose a sentence for a specified time and provide that a lesser time be served in confinement; (2) suspend the remainder of the sentence; and (3) (i) order probation for a time longer than the sentence but, subject to subsections (b) and (c) of this section, not longer than: 1. 5 years if the probation is ordered by a circuit court. In imposing a suspended sentence, the circuit court must order a period of probation as outlined in subsection (a)(3)(i)(l). See Cathcart v. State, 397 Md. 320, 327, 916 A.2d 1008 (2007) (\"[T]he court may impose a life sentence (assuming a life sentence is permissible for the crime) and suspend all but a fixed part of it and direct execution of only that fixed part. If a court chooses to use that approach, however, it must comply with the requirements of [ (a)(3)(i)(l) ], one of which is that there must be a period of probation attached to the suspended part of the sentence.” (Emphasis added)). *254Maryland Rule 4-345(a) provides: \"The court may correct an illegal sentence at any time.” \"Rule 4-345(a) does not preclude action by the trial court on its own initiative, and [the Court of Appeals has] in the past ex mero motu directed the trial court to correct an illegal sentence upon remand.” State v. Griffiths, 338 Md. 485, 496, 659 A.2d 876 (1995) (citations and footnote omitted). Independent of the issues raised on appeal, we remand the case to the circuit court for the limited purpose of reimposition of the sentence for first-degree murder, followed by a period of probation as required by Criminal Procedure Article § 6-222(a). . In recounting what led to the request for a competency evaluation, appellant’s counsel stated: \"I had some questions about [appellant’s] competency based on a history of prior admissions to psychiatric facilities and also after talking with [appellant's] mother and her familiarity with her son.” . According to Martin, Curran drank beer, vodka, and whiskey, and “[s]moked marijuana. Did a little cocaine. Smoked some crack.” . Due to the common surname, we shall refer to the Nunleys by their first names as needed. . The record reflects that Helen was also known as \"Liz.” For consistency, we shall refer to her as Helen. . McDonald’s name appears in the record as both \"McDonald” and \"MacDonald.” For consistency, we shall use \"McDonald.” . According to appellant’s counsel, Curran \"named three individuals” as those responsible for the assault. Appellant’s counsel stated: \"At one time [Curran] named two individuals and then a third.” . \"Rule 4-215(e) does not apply after 'meaningful trial proceedings’ have begun.” Marshall v. State, 428 Md. 363, 372, 51 A.3d 641 (2012) (citation omitted). . In a reply brief, appellant contends that his agreement at the May 6, 2011, hearing—that he believed his attorney was not effectively representing him—was a declaration of dissatisfaction from which the circuit court \"could reasonably conclude that [he] desire[d] to discharge that ineffective counsel.” We disagree. Although declarations of dissatisfaction with counsel may be sufficient to trigger an inquiry under Maryland Rule 4—215(e), as explained above, none of appellant’s statements demonstrated he had a present intent to discharge Klenk and obtain another attorney. Indeed, after agreeing with the circuit court that he believed Klenk was not effectively representing him, appellant reiterated his actual concern about the lack of discovery, asking to know why he was incarcerated and again complaining that he did not \"have any evidence shown towards” him. . We discern no merit in appellant’s contention that the circuit court \"improperly indicated” that he should first address his complaints with Klenk and the district public defender, and \"misinformed” him of the consequences of dismissing Klenk. A review of the record reveals that the circuit court did not order appellant to speak with Klenk or the district public defender first concerning his complaint about discovery. *289The circuit court stated: \"I think you ought to give Mr. Klenk an opportunity to address your concerns first. Maybe he has some plans for doing that” [i.e. addressing the discovery issue]. The circuit court's suggestion to talk to Klenk was entirely reasonable under the circumstances. In Northam, 421 Md. at 207, 205, 26 A.3d 344 the Court of Appeals stated that the trial court’s \" 'talk to your lawyer’ response is the proper response to a criminal defendant who is represented by counsel” where the defendant attempted to speak directly to the trial court about an issue rather than speaking with his attorney. We, accordingly, find no merit in appellant’s argument that the circuit court improperly required that he first address his issues with Klenk. As to appellant’s contention that the circuit court \"misinformed” him of the consequences of dismissing Klenk, the record reveals that the circuit court stated that if he thought Klenk was not representing his best interests, appellant could keep or dismiss Klenk, and that if he dismissed Klenk, he would not receive representation from another public defender, but would rather be required to obtain another lawyer or represent himself. These options, as set forth by the circuit court, properly outline the possible courses of action appellant could take if the circuit court found that there was no meritorious reason for a request to discharge Klenk pursuant to Maryland Rule 4-215(e). In so stating, the circuit court implied that it would not find the lack of discovery alone a meritorious reason for discharging Klenk. The circuit court was not required to inform appellant of the converse—the courses of action available if a request to discharge was meritorious— because appellant did not request to discharge counsel and the circuit court was not ruling on a request to discharge counsel pursuant to the procedures set forth in Maryland Rule 4-215(e). . Roberts interpreted the precursor to § 3-104, Md.Code (1982, 2000 Repl.Vol.), § 12-103 of the Health-General Article. Section 3-104 is substantially the same, the only changes being the change of the heading of (a) from “Hearing” to “In general” and the addition in (a) of the phrase, “or a violation of probation proceeding.” As we stated in Gregg v. State, 377 Md. 515 n. 4, 533, 833 A.2d 1040, 1050 n. 4 (2003), § 12-103 was recodified in § 3-104 of the Criminal Procedure article without substantive change. Peaks, 419 Md. at 251 n. 4, 18 A..3d 917. . Although we do not necessarily agree with the State’s concession, we need not decide the issue because whether the request for a competency evaluation was a substantive or procedural request was not an issue raised in or decided by the circuit court. The circuit court accepted the withdrawal of the request and, it is clear from the record, was confident that appellant was competent to stand trial. . Appellant's counsel informed the circuit court at a pretrial hearing on May 10, 2011, that appellant’s history of hospital admissions were admissions into “psychiatric facilities.” Appellant’s counsel failed, however, to provide any information about the admissions or appellant’s medical record which indicated appellant’s prior hospitalizations in any way affected his competence to stand trial. . At oral argument, appellant contended that identifying himself as a “psychopath” to Captain Kessler during his interview demonstrated *300that he was incompetent to stand trial. The record reflects that, although Captain Kessler testified at trial that appellant referred to himself as a \"psychopath” during their interview, at the time the request for a competency evaluation was made, the circuit court had no information concerning the matter and neither appellant nor his counsel informed the circuit court that such a comment had been made. Additionally, at oral argument, appellant failed to explain how a comment made to a law enforcement officer in an interview nine months prior to trial showed that appellant was incompetent—at the time of trial—to stand trial. . In a reply brief, appellant takes issue with the circuit court’s ruling refusing to give an instruction on legally adequate provocation, arguing that the circuit court only considered Carpenter's testimony—that he told her that Curran made a derogatory remark about her—and failed to consider \"other highly relevant evidence,” thereby abusing its discretion. The record reflects the contrary—that the circuit court listened to extensive argument from both parties concerning the request for an instruction on legally adequate provocation before ruling that there was no \"evidence to demonstrate any legally adequate provocation for the voluntary manslaughter [instruction].” While the circuit court focused on Carpenter’s testimony, as set forth below, it is evident that the circuit court properly considered argument from counsel and exercised its discretion appropriately in refusing to give the instruction. . We find no merit in appellant’s contention that the jury question concerning whether stabbing someone during a heated argument is first-degree murder demonstrates that an instruction on legally adequate provocation generated by the evidence, and that the circuit court committed plain error by failing to instruct the jury as to legally adequate provocation after receiving the juiy question. The record reflects that the jury submitted a note to the circuit court, asking the following: During a heated argument, a knife is picked up [and] used-would this be considered [first-]degree murder? Would those few seconds from the time that he grabbed the knife be considered premeditated? The jury’s inquiry demonstrates that at most it questioned whether “during a heated argument” use of a knife is sufficient to constitute first-degree murder. A heated argument is a circumstance that, as discussed above, is legally insufficient to generate an instruction on provocation. *313As to the circuit court's alleged failure to instruct the jury as to legally adequate provocation after receiving the jury note, we observe that the circuit court and counsel discussed and agreed upon the appropriate response to the jury note. In response to the proposed response to the jury note, appellant’s counsel stated: “Okay. I have no objection to that.” Given that appellant's counsel agreed with the circuit court's response and failed to request an instruction as to legally adequate provocation at that point, any issue as to the court’s failure to give the instruction after the jury's question is not preserved for appellate review. As to plain error, the circumstances fail to satisfy the first prong of the plain error review test, i.e. there is no indication of any error by the circuit court. State v. Rich, 415 Md. 567, 578, 3 A.3d 1210 (2010). . At trial, Carpenter testified that appellant arrived home at approximately 9:20 p.m. on February 12, 2010. In the interview with detectives, Carpenter advised that appellant came home at 11:00 p.m. on February 12, 2010. . Although appellant is correct that \"some evidence” of voluntary intoxication does not mean that \"specific evidence of what intoxicating substance the defendant consumed” is required, we observe that, in this case, other than McDonald’s testimony that appellant said he was drinking and Carpenter’s testimony that appellant appeared \"very drunk,” there is absolutely no evidence as to the type or amount of substances appellant consumed and whether they had any effect upon him, i.e. whether they made him so intoxicated as to negate any specific intent to kill. . In a reply brief, appellant reiterates that there was evidence that he “consumed alcohol and/or drugs on the alleged date of the offense!,]” thus warranting an instruction as to voluntary intoxication. Appellant misses the point entirely, though. The issue is not whether he was intoxicated, as mere intoxication is not a defense, but whether he was intoxicated to such a degree at the time of the offense that he was be unable to form the intent necessary to commit the crime. . Appellant's contention that, because there is an equal amount of evidence supporting a finding that he \"snapped” and killed Curran without premeditation and deliberation, the evidence is insufficient to support a conviction for first-degree murder is without merit. To support his contention, appellant misguidedly quotes case law piecemeal out of context, arguing that \" ‘when the evidence equally supports two versions of events, and a finding of guilt requires speculation as to which of the two versions is correct, a conviction cannot be sustained.’ ” A review of the case law, and in particular, Taylor, 346 Md. at 458-59, 697 A.2d 462, reveals that the Court of Appeals placed the following caveat on the holding to which appellant cites—\"This, of course, does not preclude a conviction based on credibility determination emanating from disputed evidence.” Thus, taken as a whole, the Court of Appeals has stated that, where a finding of guilt requires speculation as between two equally supported versions of events, a conviction cannot stand, but that a conviction based on credibility determinations arising from disputed evidence are not precluded. Here, as appellant’s counsel pointed out in both of the motions for judgment of acquittal, the witnesses' credibility was a key issue. As *325much of the case rested upon the jury’s determination as to the witnesses’ credibility, and as we give deference to the juty’s decisions and inferences, Morris, 192 Md.App. at 30-31, 993 A.2d 716, we decline to address appellant’s contention further and observe that, as stated above, the jury was well within its province to find beyond a reasonable doubt that appellant committed first-degree murder based on the evidence adduced at trial. . The other \"residual” or \"catch-all” exception for hearsay was contained in Maryland Rule 5-804(b)(5), which provided as follows: Under exceptional circumstances, the following are not excluded by the hearsay rule, even though the declarant is unavailable as a *328witness: A statement not specifically covered by any of the foregoing exceptions but having equivalent circumstantial guarantees of trustworthiness, if the court determines that (A) the statement is offered as evidence of a material fact; (B) the statement is more probative on the point for which it is offered than any other evidence which the proponent can procure through reasonable efforts; and (C) the general purposes of these rules and the interests of justice will best be served by admission of the statement into evidence. A statement may not be admitted under this exception unless the proponent of it makes known to the adverse party, sufficiently in advance of the trial or hearing to provide the adverse party with a fair opportunity to prepare to meet it, the intention to offer the statement and the particulars of it, including the name and address of the declarant. It should be noted that, prior to 1994, when Maryland Rule 5-803(b)(24) and Rule 5-804(b)(5) were adopted, the Court of Appeals, \"though on rare occasions allowing hearsay statements that did not fall within any of the recognized categorical exceptions to be admitted, had never formally or directly recognized a general residual exception to the hearsay rule[J” State v. Walker, 345 Md. 293, 304, 691 A.2d 1341 (1997). By a Rules Order issued by the Court of Appeals on November 8, 2005, effective January 1, 2006, Maryland Rule 5-804(b)(5) was amended. The Rules Order deleted the existing language of Maryland Rule 5-804(b)(5) and replaced it with the current exception allowing hearsay statements by witnesses in criminal cases to be admitted where the witness is unavailable due to a party's wrongdoing. Maryland Rule 5-803(b)(24) was amended to its present form. Thus, after the amendment became effective on January 1, 2006, Maryland Rule 5-803(b)(24) was the only residual exception for hearsay. In a case decided prior to the amendment, this Court stated that Maryland Rule 5-803 (b)(24) and Rule 5-804(b)(5) “are the same but for one difference[—]Rule 5-803(b)(24) does not require that the witness be unavailable.” Nixon v. State, 140 Md.App. 170, 183 n. 1, 780 A.2d 344 (2001). Accordingly, the analysis used to determine the applicability of Maryland Rule 5-804(b)(5) shall guide our analysis of the applicability of Maryland Rule 5-803(b)(24). . On brief, appellant recognizes this distinction, and his parenthetical to this Court’s decision in Walker states \"findings pertinent to Rule 5-803(b)(24) must be made on the record when admitting hearsay!.]” (Emphasis added). . In Green, 442 U.S. at 97, 99 S.Ct. 2150, the Supreme Court held that, given the \"unique circumstances” of the case, the trial court erroneously excluded testimony in violation of the Due Process Clause of the Fourteenth Amendment, and that \"the hearsay rule may not be applied mechanistically to defeat the ends of justice” and deprive the defendant of a fair trial. (Citation omitted). . In Chambers, 410 U.S. at 302, 93 S.Ct. 1038, the Supreme Court stated: New rights are more fundamental than that of an accused to present witnesses in his own defense. In the exercise of this right, the accused, as is required of the State, must comply with established rules of procedure and evidence designed to assure both fairness and reliability in the ascertainment of guilt and innocence. Although perhaps no rule of evidence has been more respected or more frequently applied in jury trials than that applicable to the exclusion of hearsay, exceptions tailored to allow the introduction of evidence which in fact is likely to be trustworthy have long existed. The testimony rejected by the trial court here bore persuasive assurances of trustworthiness and thus was well within the basic rationale of the exception for declarations against interest. That testimony also was critical to Chambers’ defense. In these circumstances, where constitutional rights directly affecting the ascertainment of guilt are implicated, the hearsay rule may not be applied mechanistically to defeat the ends of justice. (Citations omitted).\n\n",
    "body_length": 177234,
    "citedas": [
      "209 Md. App. 246",
      "58 A.3d 556",
      "2012 WL 6652745",
      "2012 Md. App. LEXIS 158"
    ],
    "attorneys": "Jeffrey M. Ross (Paul B. DeWolfe, Public Defender, on the brief), Baltimore, MD, for appellant., Mary Ann Ince (Douglas F. Gansler, Atty. Gen., on the brief) Baltimore, MD, for appellee.",
    "category": [],
    "judges": "Watts",
    "citation_count": 1
  }
}
