{
  "id": "FoH3PWYBTlTomsSBj4EJ",
  "document": {
    "title": "Neely v. Club Med Management Services",
    "full_title": "EILEEN ANNE NEELY IN NO. 93-2069 v. CLUB MED MANAGEMENT SERVICES, INC.; CLUB MED SALES, INC.; CLUB MED, INC., THIRD-PARTY ; HOLIDAY VILLAGE (ST. LUCIA), LTD. V. JOSEPH LEMAIRE, THIRD-PARTY CLUB MED MANAGEMENT SERVICES, INC. AND HOLIDAY VILLAGE (ST. LUCIA) INC. IN NO. 93-2102",
    "jurisdiction": "Third Circuit",
    "date": "1995-07-26T00:00:00.000Z",
    "docket": "Nos. 93-2069, 93-2102",
    "body": "TABLE OF CONTENTS\n\nIntroduction\n\nI. Facts and Procedural History\n\nII. The Lauritzen Triad and Subject Matter Jurisdiction\n\nA. The Non-Jurisdictional Nature of the Lauritzen Choice-of-Law Analysis\n\nB. Federal Question and Admiralty Jurisdiction\n\n1. Federal Question Jurisdiction Under 28 U.S.C. § 1331\n\n2. Admiralty Jurisdiction Under 28 U.S.C. § 1333\n\nIII. Applicability of American Law Under the Lauritzen Triad\n\nA. Introduction\n\nB. Purposes of and Problems with the Lauritzen Analysis\n\nC. The Two Steps of the Lauritzen Choice of Law Inquiry\n\n1. Do the Contacts Show a Basis for Prescriptive Jurisdiction?\n\n2. Are the Contacts Such That Application of American Law Would Be Reasonable?\n\na. Inaccessibility of a Foreign Forum\n\nb. Law of the Forum\n\nc. Place of the Wrongful Act\n\nd. Place of Contract\n\ne. Law of the Flag\n\nf. Defendants' Allegiance, Bases of Operations, and Other Contacts with the United States\n\ng. Domicile or Allegiance of the Injured Seaman\n\nh. Summary and Conclusion\n\nIV. The Molding of the Verdict\n\nA. Waiver of Comparative Causation on the Unseaworthiness Claim\n\nB. Lack of Authority to Mold the Verdict\n\nC. Joint and Several Liability\n\nV. Conclusion\n\nOpinion OF THE COURT\n\nBECKER, Circuit Judge.\n\nINTRODUCTION\n\nPlaintiff Eileen Anne Neely, a young American employed at a Club Med resort in St. Lucia, was seriously injured when she was sucked into the propellers of a scuba diving vessel, the Long John. Plaintiff was a member of the crew of the vessel, which was in St. Lucian coastal waters at the time of the accident. She brought suit in the District Court for the Eastern District of Pennsylvania, and a jury there, responding to special interrogatories, found her employers negligent and the vessel unseaworthy, and awarded plaintiff a large verdict on her Jones Act, general maritime law, and maintenance and cure claims. Molding the verdict in response to post-trial motions, the court modified and substantially reduced the verdict by applying to the unseaworthiness claim the percentage of contributory negligence found by the jury with respect to the Jones Act claims. Then, on cross-appeals, a panel of this court, invoking Lauritzen v. Larsen, 345 U.S. 571, 73 S. Ct. 921, 97 L. Ed. 1254 (1953), vacated the entire judgment for the plaintiff on the ground that the district court had lacked subject matter jurisdiction over the action. We granted rehearing in banc and vacated the panel opinion and judgment.\n\nWhile the appeals present a large number of questions, we address only the subject matter jurisdiction, choice of law, and verdict molding issues.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e With respect to subject matter jurisdiction, we conclude that the multi-factored analysis established by Lauritzen, Romero v. International Terminal Operating Co., 358 U.S. 354, 79 S. Ct. 468, 3 L. Ed. 2d 368 (1959), and Hellenic Lines Ltd. v. Rhoditis, 398 U.S. 306, 90 S. Ct. 1731, 26 L. Ed. 2d 252 (1970) (together, the \"Lauritzen triad\"), governs choice of law, not subject matter jurisdiction, in Jones Act and American general maritime law claims. Then, applying the usual analyses for federal question and admiralty jurisdiction, we conclude that the district court had subject matter jurisdiction over this suit.\n\nTurning our attention to the multi-factored \"substantial contacts\" test of the Lauritzen triad, we adopt a two-stage interpretation of that test, subjecting the Lauritzen factors to a relatively simple sufficiency test followed by a more involved reasonableness inquiry. We first find American maritime law potentially applicable in this case because the plaintiff is an American citizen. Accordingly, we consider whether applying American law is reasonable under the circumstances. Because the defendants did not inform the district court of the content of St. Lucian law, any interests St. Lucia might have in this case are undefined and, consequently, do little to render application of American law unreasonable. Additionally, in considering the significance of the various Lauritzen factors, we pay heed to the non-traditional context of this suit. By this we do not mean that the vessel involved here was unlike those in traditional, international shipping cases; rather, the activity here was non-traditional, for the Long John did not take its crew from sea to sea in pursuit of international commerce but rather only from beach to reef in aid of scuba diving adventures.\n\nThe accident occurred in St. Lucian waters, which as we explain is an important consideration in non-shipping contexts. And one of the defendants is a corporation organized under the laws of St. Lucia, a factor that also reflects some interest on the part of St. Lucia in applying its law. But these factors do not mean that American law may not be reasonably applied under the circumstances. Even when we add to these some evidence that the Long John, the vessel that injured plaintiff, was registered in St. Lucia, we cannot conclude that St. Lucia's interests, whatever they may be, are so threatened or so strong that America's interests must be ignored.\n\nAs our opinion explains, the United States has an overriding interest in assuring adequate compensation for its injured seamen. In the non-shipping context of this case, the significance of plaintiff's American allegiance is an especially important factor, and the relevance of the plaintiff's having entered into her employment contract in the United States is also enhanced. Conversely, the law of the flag of the Long John is of diminished importance in the non-traditional context, and, at all events, the law of the flag would be entitled to virtually no significance here both because there was no evidence that the Long John actually flew the flag of St. Lucia (or any other nation) and because the district court was presented with no information as to the content of St. Lucian law.\n\nAdditionally, two of the defendants are American corporations, the Long John was built in America to American specifications, and the St. Lucian defendant, whose operations are in large measure run by one of its affiliated American co-defendants, derives the majority of its income from American tourists booked by another affiliated American co-defendant. Because the connections between this incident and the United States implicate significant American interests, and because consideration of all the circumstances confirms the reasonableness of applying United States law, we conclude that the contacts with the United States are \"substantial,\" and American laws, both the Jones Act and our general maritime law, apply to this suit.\n\nWe also conclude that the district court erred in molding the verdict to apply the percentage of comparative negligence found by the jury with respect to the Jones Act claim to the unseaworthiness claim. We so hold because the defendants waived the issue, and because the court, which did not submit it to the jury, lacked authority to later make the omitted factual determinations sua sponte. We will therefore affirm the order of the district court holding two of the defendants liable under American law, but will vacate the district court's order of January 26, 1993, and direct it, on remand, to enter judgment for the plaintiff against Club Med Management and Holiday Village in the full amount of damages found by the jury, as more fully explained below.\n\nI. FACTS AND PROCEDURAL HISTORY\n\nThe defendants in this action are Club Med, Inc., Club Med Sales, Inc., and Club Med Management Services, Inc., all of which have offices in New York, and Club Med, Inc.'s wholly owned subsidiary Holiday Village (St. Lucia) Ltd. Of the 10,000 to 15,000 people per year who vacation at the Club Med Holiday Village resort, approximately seventy to eighty percent come from the United States. Seventy to eighty percent of Holiday Village's annual income of approximately fifteen million dollars is generated by Holiday Village's American sales bureau, Club Med Sales.\n\nPlaintiff is an American citizen domiciled in Telford (Montgomery County), Pennsylvania. After vacationing at a Club Med resort, she applied to Club Med for a position as a scuba diving instructor. Plaintiff was interviewed in New York by Club Med Management, a New York corporation. Following the interview, plaintiff received a letter of interest from the defendants, followed several months later by a phone call, initiated in New York by Club Med Management, offering her a position at Holiday Village, which she accepted. In early May of 1991, the defendants arranged and paid the travel expenses for her to go to Holiday Village in St. Lucia.\n\nPlaintiff was hired to work as an \"au pair\" for a six-week period. She was not given a cash salary, but rather received room and board in exchange for her work. Once at Holiday Village, she served as either Scuba Diving Instructor or Divemaster on approximately thirteen or fourteen voyages from May 13 to May 23, 1991. She typically had trips twice in the morning and once in the afternoon. She was responsible for checking and preparing all equipment (which was stored aboard scuba diving boats) for each voyage. During the trips, she provided instruction and warnings to the Club Med guests who would be diving.\n\nThe scuba expeditions on which plaintiff worked were conducted by a small fleet operated by Holiday Village. The fleet consisted of the Blue Lagoon, owned by Club Med, and the Long John, chartered by Holiday Village for use as a diving vessel from its title owner Joseph LeMaire (who lives in Miami, Florida but is not a United States citizen). A declaration executed by LeMaire claimed that the Long John, which was built in the United States, was \"registered\" in St. Lucia, but the charter left blank the state of registry.\n\nOn May 23, 1991, plaintiff served Club Med guests on a scuba diving excursion on the Long John, which was captained by Philipe Le Cann. When the boat arrived at the dive site in coastal waters off St. Lucia, the passengers and dive crew prepared to enter the water. The boat was put in neutral, and, after donning her gear, plaintiff entered the water.\n\nIt was disputed whether Stephane Gaudry, the Divemaster, had given the signal to enter the water before plaintiff jumped in: the uncontroverted testimony was that Gaudry made no entry of plaintiff's dive time on the dive log. Whatever the precise sequence of events, after plaintiff had entered the water, the captain put the ship's engines into reverse. The churning propellers of the twin 350 horsepower diesel engines sucked plaintiff under the boat and into the ship's propellers, which were not shielded by propeller guards, and she emerged on the starboard side with extremely serious injuries to various parts of her body. She was brought on board the ship, taken immediately to shore, and thereafter to a clinic and then a hospital.\n\nAfter being treated, plaintiff was out of work for approximately five and one half months. During this time, she convalesced at her parents' home in Telford, where they cared for her on a daily basis. Despite two surgeries for nerve damage, her use of her right arm was permanently restricted; she also will require plastic surgery for her numerous conspicuous scars.\n\nPlaintiff eventually brought suit in the District Court for the Eastern District of Pennsylvania, pleading the federal question and admiralty statutes, 28 U.S.C. §§ 1331 and 1333 (1988), as bases for subject matter jurisdiction. She alleged that her injuries were caused by negligence in violation of the Jones Act, and by the unseaworthy condition of the vessel in violation of the general maritime law. The defendants interposed a host of defenses, including contributory negligence and, relying on Lauritzen v. Larsen, 345 U.S. 571, 73 S. Ct. 921, 97 L. Ed. 1254 (1953), and Hellenic Lines Ltd. v. Rhoditis, 398 U.S. 306, 90 S. Ct. 1731, 26 L. Ed. 2d 252 (1970), the claim that the district court lacked subject matter jurisdiction to apply American law. Although they argued that St. Lucia had a greater interest in having its law applied, the defendants did not present the court with any information concerning the law of St. Lucia.\n\nThe district court denied defendants' motion to dismiss for lack of subject matter jurisdiction and failure to state a claim, and allowed the suit to go to trial. During trial, the court ruled, without objection from the defendants, that contributory negligence was not a defense to the unseaworthiness claim. At the close of trial, the court instructed the jury and provided it with a special verdict form, the first draft of which had been prepared by defense counsel. The form required the jury to answer a number of specific questions, grouped and captioned as we now describe.\n\nThe first set of questions were presented under the heading \"Jones Act Claim.\" In these, the jury was asked whether plaintiff was employed by one or more of the defendants; if so, which defendant or defendants were her employer; whether her employer or employers were negligent; whether any such negligence was a substantial factor in bringing about plaintiff's injuries; whether plaintiff was contributorily negligent; whether any such contributory negligence was a substantial factor in bringing about her injuries; and how the causal negligence should be allocated (totalling 100%) among the employer or employers and, if appropriate, the plaintiff.\n\nThe second set of questions were grouped under the caption \"General Maritime Claim.\" In this section of the form the jury was required to answer whether any of the defendants owned or sufficiently controlled the Long John to qualify as owner or owner pro hac vice ; if so, which defendant(s) controlled the vessel; whether the plaintiff had shown that the vessel was unseaworthy; and if so, whether the unseaworthiness was a substantial factor contributing to plaintiff's injuries. This section asked no questions about contributory responsibility.\n\nThe third section of the special verdict sheet was labeled \"Damages.\" The jury was there directed to \"state the amount of damages, if any, sustained by the Plaintiff as a result of the accident, without regard to and without reduction by the percentage of causal negligence, if any, that you have attributed to the plaintiff.\"\n\nThe fourth and final portion of the verdict sheet was captioned \"Maintenance.\" There, the jury was asked whether it found the plaintiff entitled to maintenance, and whether any of the defendants (and, if so, which) acted unreasonably in denying maintenance to her.\n\nOn the Jones Act questions, the jury found that plaintiff was employed by Club Med Management and by Holiday Village, that those defendants had been negligent, and that their negligence was a substantial factor in causing the plaintiff's injuries. The jury also found, however, that the plaintiff was contributorily negligent. It allocated the total causal negligence thirty percent to Club Med Management, ten percent to Holiday Village, and sixty percent to the plaintiff. In answer to the General Maritime Law questions, the jury found that Holiday Village exercised sufficient control over the Long John to be its owner pro hac vice. It also found the Long John to have been unseaworthy, and that the unseaworthiness was a substantial factor causing plaintiff's injuries.\n\nOn the remaining questions, the jury found the plaintiff's total damages sustained from the accident, without regard to any causal negligence on her own part, to be $545,000. It also found that the plaintiff was entitled to maintenance, but that none of the defendants had acted unreasonably in withholding payment. Thereupon, the district court molded the verdict to reflect plaintiff's comparative negligence: On the Jones Act claim, the court entered judgment against Club Med Management and Holiday Village in the amount of forty percent of $545,000, that is, $218,000. On the maintenance claim, the court entered judgment against the same defendants for $11,700, but denied attorney's fees to plaintiff because the jury had found that the denial of maintenance was not unreasonable. On the unseaworthiness claim, the court entered judgment in plaintiff's favor against Holiday Village in the full amount of $545,000.\n\nA week later the defendants moved the district court to mold the verdict on the unseaworthiness claim. Relying upon case law holding that comparative fault is a partial defense to general maritime law unseaworthiness claims, the defendants urged the district court to reduce the unseaworthiness verdict by sixty percent, the percentage of the plaintiff's contributory negligence on the Jones Act claim. Over plaintiff's objection, the district court entered an order so modifying the judgment.\n\nPlaintiff filed a timely appeal, and defendants cross-appealed. Under 28 U.S.C. § 1291 (1988), we have appellate jurisdiction over the final orders of the district court.\n\nII. THE LAURITZEN TRIAD AND SUBJECT MATTER JURISDICTION\n\nBeginning with their initial answer in the district court, the defendants have argued that, pursuant to the multi-factored analysis developed in Lauritzen v. Larsen, 345 U.S. 571, 73 S. Ct. 921, 97 L. Ed. 1254 (1953), and Hellenic Lines, Ltd. v. Rhoditis, 398 U.S. 306, 90 S. Ct. 1731, 26 L. Ed. 2d 252 (1970), the district court lacked subject matter jurisdiction over plaintiff's Jones Act and general maritime law unseaworthiness claims. Because subject matter jurisdiction restrictions impose a limit on the power of the federal courts to entertain an action, we must first consider whether the district court had subject matter jurisdiction over plaintiff's suit. If the district court lacked such jurisdiction, it would be our duty to vacate the judgments in plaintiff's favor and direct the district court to dismiss her action.\n\nWe hold that the district court had subject matter jurisdiction over this suit. This ruling primarily reflects a disagreement with defendants' premise that the Lauritzen triad (composed of Lauritzen, Rhoditis, and Romero v. International Terminal Operating Co., 358 U.S. 354, 79 S. Ct. 468, 3 L. Ed. 2d 368 (1959)) provides the framework for determining whether a district court has subject matter jurisdiction in Jones Act or general maritime law cases.\n\nA. The Non-Jurisdictional Nature of the Lauritzen Choice-of-Law Analysis\n\nIn Lauritzen v. Larsen, 345 U.S. 571, 73 S. Ct. 921, 97 L. Ed. 1254 (1953), the Supreme Court enunciated a number of factors to be considered by courts evaluating whether a plaintiff may sue under the Jones Act. These factors include:\n\n(1) the place of the wrongful act,\n\n(2) the law of the flag,\n\n(3) the allegiance or domicile of the injured plaintiff,\n\n(4) the allegiance of the defendant,\n\n(5) the place of contract,\n\n(6) the inaccessibility of a foreign forum, and\n\n(7) the law of the forum.\n\nSee Lauritzen, 345 U.S. at 583-92, 73 S. Ct. at 928-33. The Court reiterated the relevance of these factors in Romero, see 358 U.S. at 383, 79 S. Ct. at 486, and in Hellenic Lines, Ltd. v. Rhoditis, 398 U.S. 306, 90 S. Ct. 1731, 26 L. Ed. 2d 252 (1970), it added the defendant's base of operations to this list, id. at 309, 90 S. Ct. at 1734.\n\nDefendants believe that this inquiry determines whether the district court has subject matter jurisdiction. This view was not challenged in the district court, which considered the factors and found subject matter jurisdiction, or before the panel, which reconsidered them but found no jurisdiction. Moreover, a number of cases in various jurisdictions so hold. However, after granting rehearing in banc, we sua sponte directed the parties to prepare supplemental briefing on the question whether the Lauritzen -Romero -Rhoditis factors (henceforth referred to as the \"Lauritzen factors\" for simplicity) in fact go to subject matter jurisdiction. With the benefit of counsel's briefing and argument, and after studying the Supreme Court's opinions and numerous cases interpreting them, we conclude that the Lauritzen factors are not a test for subject matter jurisdiction, but rather constitute a non-exhaustive list of contacts for choice of law analysis in suits for maritime injuries with foreign connections.\n\nIn Lauritzen, the Supreme Court was called on to answer a question of the extraterritorial applicability of the Jones Act. While in New York, Larsen, a Danish seaman, had signed onto a ship of Danish flag and registry owned by Lauritzen, another Danish citizen. The ship's articles that Larsen signed were written in Danish and specified that Danish law would govern the crewmembers' rights. After being injured in the course of his employment while in Havana harbor, Larsen brought suit against Lauritzen in the District Court for the Southern District of New York, seeking to recover damages under the Jones Act. Over Lauritzen's objection that Danish law rather than American law governed, the district court allowed the case to go to the jury under the Jones Act, which rendered a verdict in Larsen's favor. The Court of Appeals for the Second Circuit affirmed, and the Supreme Court granted certiorari.\n\nThe Court formulated the \"key issue\" as \"whether statutes of the United States should be applied to this claim of maritime tort.\" Lauritzen, 345 U.S. at 573, 73 S. Ct. at 923. As did the defendants herein, Lauritzen had framed his objection in terms of subject matter jurisdiction, but the Court quickly disposed of this argument:\n\nThe question of jurisdiction is shortly answered. . . . As frequently happens, a contention that there is some barrier to granting plaintiff's claim is cast in terms of an exception to jurisdiction of subject matter. A cause of action under our law was asserted here, and the court had power to determine whether it was or was not well founded in law and in fact.\n\nId. at 574, 73 S. Ct. at 924. Thus, the Court's later analysis introducing the now-famous Lauritzen factors was directed to choice of law, see id. at 583, 73 S. Ct. at 928, not subject matter jurisdiction, which the Court had already determined was present.\n\nSimilarly, in Romero v. International Terminal Operating Co., 358 U.S. 354, 79 S. Ct. 468, 3 L. Ed. 2d 368 (1959), the Court faced suit brought under American law by a foreign sailor. Romero, a Spanish seaman, had signed onto the crew of a vessel of Spanish registry that sailed under the Spanish flag and was owned by a Spanish corporation. After departing from a Spanish port, the ship made numerous stops, including one in Hoboken, where Romero was injured when struck by a cable on the ship's deck. He filed suit in the District Court for the Southern District of New York, contending inter alia that the shipowner (\"Compania\") was liable to him under the Jones Act and under the general maritime law of the United States for unseaworthiness of the ship, maintenance and cure, and maritime tort. The alleged bases for jurisdiction were the Jones Act, federal question jurisdiction, and diversity jurisdiction.\n\nThe district court dismissed the complaint after a pre-trial hearing. It concluded that the Jones Act provided no right of action to an alien seaman under the circumstances involved, and thus that the court lacked jurisdiction over the Jones Act claim against Compania. The court dismissed the general maritime claim against the corporation because the company was not of diverse citizenship from Romero and because of its Conclusion that the federal question statute did not embrace general maritime law claims.\n\nThe Court of Appeals affirmed the dismissal of the complaint, and the Supreme Court granted certiorari. In Part I of its opinion, entitled \"Jurisdiction,\" id. at 359, 79 S. Ct. at 473, the Court concluded that the district court possessed subject matter jurisdiction of the claims. With respect to the Jones Act claims, it noted:\n\nThe question whether jurisdiction exists has been confused with the question whether the complaint states a cause of action. Petitioner asserts a substantial claim that the Jones Act affords him a right of recovery for the negligence of his employer. Such assertion alone is sufficient to empower the District Court to assume jurisdiction over the case and determine whether, in fact, the Act does provide the claimed rights.\n\nId. (internal quotation marks and citation omitted). The Court then affirmed Lauritzen 's holding that the usual federal question approach to subject matter jurisdiction governs Jones Act suits. See id.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nImportantly, the Romero Court turned to the Lauritzen factors (in Part II of its opinion, entitled \"The Claims Against Compania Transatlantica--The Choice-of-Law Problem,\" id. at 381, 79 S. Ct. at 485) only after concluding that the district court had erred in dismissing Romero's suit for lack of subject matter jurisdiction. Thus, the Court's decision in Romero confirms that the Lauritzen factors are not a test for subject matter jurisdiction but rather govern choice of law. The innovation in Romero was its pronouncement that the Lauritzen analysis should govern not only Jones Act claims but also claims under the general maritime law for personal injury damages. Id. at 382, 79 S. Ct. at 485.\n\nOur understanding of these precedents is confirmed by a leading admiralty treatise. See GRANT GILMORE \u0026 CHARLES L. BLACK, JR., THE LAW OF ADMIRALTY § 6-63 (2d ed. 1975) [hereinafter LAW OF ADMIRALTY]. Discussing \"Choice of Law in Actions Brought in the United States by Seamen Injured on Foreign-Flag Ships,\" the authors explain that when \"a seaman brings an action to recover for personal injuries, the court must initially decide whether it has jurisdiction and, if it has, whether United States law or the law of a foreign nation is applicable.\" Id. at 471. They go on to discuss Lauritzen and Romero as follows:\n\nThe majority of the Court concluded that neither the situs of the injury nor Romero's treatment in this country made a case, under the Lauritzen criteria, for application of American law in Romero's action against his employer, the Spanish Line. Justice Frankfurter's opinion emphasized that the issue was one of choice of law and not of subject matter jurisdiction. That is, the District Court, having decided that Romero's action against his employer was not governed by American law, could have retained jurisdiction of the action and decided it under Spanish law.\n\nId. at 473 (emphasis supplied).\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nThe Supreme Court's third and latest pronouncement on the role of the Lauritzen factors came in 1970. While the Court's opinion in Hellenic Lines, Ltd. v. Rhoditis, 398 U.S. 306, 90 S. Ct. 1731, 26 L. Ed. 2d 252 (1970), is partially opaque, it does not signal a change in the purpose and use of the Lauritzen analysis. Rhoditis concerned a suit under the Jones Act by a Greek seaman for injuries he suffered aboard a ship in the Port of New Orleans. Because the Supreme Court agreed with the trial and appellate courts that the Jones Act applied, the Court did not need to differentiate between subject matter jurisdiction and the plaintiff's entitlement to proceed under the Jones Act--both were present. But the opinion's description of the Lauritzen analysis makes clear that the Court viewed the factors as bearing on applicability of the Act, rather than subject matter jurisdiction.\n\nThe Court explicitly endorsed the description of the Lauritzen analysis offered by Judge Medina, who in Bartholomew v. Universe Tankships, Inc., 263 F.2d 437 (2d Cir. 1959), had written:\n\nThe decisional process of arriving at a Conclusion on the subject of the application of the Jones Act involves the ascertainment of the facts or groups of facts which constitute contacts between the transaction involved in the case and the United States, and then deciding whether or not they are substantial.\n\nId. at 441 (quoted in Rhoditis, 398 U.S. at 309 n.4, 90 S. Ct. at 1734 n.4) (emphasis supplied here). Furthermore, in adding the shipowner's base of operations to the analysis, the Court characterized it as \"another factor of importance in determining whether the Jones Act is applicable.\" Rhoditis, 398 U.S. at 309, 90 S. Ct. at 1734 (emphases supplied).\n\nIt is true that the Court's opinion in Rhoditis twice used the word \"jurisdiction.\"\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e However, the presence of two occurrences of the word \"jurisdiction\" is too ambiguous to mandate a change in the jurisprudence,\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e particularly since the Court likely meant to refer to \"legislative jurisdiction,\" see id. at 314 \u0026 n.2, 90 S. Ct. at 1736-37 \u0026 n.2 (Harlan, J., Dissenting) (which is also known as prescriptive jurisdiction, see RESTATEMENT (THIRD) OF FOREIGN RELATIONS LAW Pt. IV, at 230 (1987)). Moreover, subject matter jurisdiction was not presented in the Questions for Review in the petition for certiorari. See Petition for Writ of Cert. at 2-3, Hellenic Lines Ltd. v. Rhoditis, 412 F.2d 919 (5th Cir. 1969) (No. 661), cert. granted, 396 U.S. 100, 90 S. Ct. 554 (1970). Rather, the first Question, which is characteristic, was:\n\nWere the lower courts correct in applying the Jones Act to an action by a Greek seaman, himself a resident of Greece, against a Greek corporate owner for injury occurring aboard a Greek flag vessel, solely on the ground that the majority stock holder of the corporate ship owner, although himself a Greek citizen, resided in the United States as a representative of Greece to the United Nations.\n\nId. (emphasis supplied).\n\nMoreover, treating the Lauritzen analysis as going to subject matter jurisdiction would be out of keeping with the approach of most jurisdictional inquiries, which tend to be straightforward threshold questions. \"The dangers of a totality-of-the-circumstances approach to jurisdiction would be obvious. An undefined test requires courts and litigants to devote substantial resources to determine whether a federal court may hear a specific case.\" Jerome B. Grubart, Inc. v. Great Lakes Dredge \u0026 Dock Co., 130 L. Ed. 2d 1024, 115 S. Ct. 1043, 1057 (1995) (Thomas, J., Concurring in the judgment). The federal judiciary \"pursues clarity and efficiency in other areas of federal subject-matter jurisdiction, and it should demand no less in admiralty and maritime law.\" Id. at 1059.\n\nThus, we conclude that the multi-factored analysis of Lauritzen, Romero, and Rhoditis is not to be used to determine whether a district court has subject matter jurisdiction over suits brought under the Jones Act or the general maritime law. Insofar as Matute v. Lloyd Bermuda Lines, Ltd., 931 F.2d 231 (3d Cir. 1991), holds that the Lauritzen factors govern subject matter jurisdiction over Jones Act or general maritime law claims, it is overruled. In so ruling, we agree with the cases from other circuits that have used the Lauritzen analysis to determine choice of law, not subject matter jurisdiction. See, e.g., Schexnider v. McDermott Int'l, Inc., 817 F.2d 1159 (5th Cir. 1987) (affirming district court's determination that Lauritzen dictated applicability of Australian law but requiring that district court retain jurisdiction and try the case); cf. also supra note (citing Concurring and Dissenting opinions that correctly apprehend the issue). Concomitantly, we necessarily disagree with those cases from other circuits holding (without addressing the clear force of Romero) that the Lauritzen analysis may be used to dismiss a Jones Act claim for lack of subject matter jurisdiction. See, e.g., Gutierrez v. Diana Investments Corp., 946 F.2d 455, 456-57 (6th Cir. 1991) (per curiam) (affirming dismissal of suit for lack of subject matter jurisdiction flowing from non-applicability of American law under Lauritzen analysis); Dracos v. Hellenic Lines, Ltd., 762 F.2d 348, 349-50 (4th Cir. 1985) (en banc) (same);\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e Rodriguez v. Flota Mercante Grancolombiana, S.A., 703 F.2d 1069, 1071-72 (9th Cir. 1983) (same).\n\nB. Federal Question and Admiralty Jurisdiction\n\nAlthough we have demonstrated that the Lauritzen inquiry is non-jurisdictional in nature, there remains the question whether the district court had subject matter jurisdiction over plaintiff's claims, which the defendants have contested throughout this litigation. We conclude that it did, under both the federal question and the admiralty jurisdiction statutes.\n\n1. Federal Question Jurisdiction Under 28 U.S.C. § 1331\n\nIn its first Jones Act case, the Supreme Court held that the Jones Act, as a federal statute providing remedies for injured seamen, is subject to the usual rule for \"arising-under\" jurisdiction. See Panama R.R. Co. v. Johnson, 264 U.S. 375, 383-84, 44 S. Ct. 391, 392, 68 L. Ed. 748 (1924) (\"This case arose under a law of the United States [i.e., the Jones Act] and involved the requisite amount, if any was requisite; so there can be no doubt that the case was within the general jurisdiction conferred on the district courts by [the federal question statute] . . . .\"); see also Hartford Fire Ins. Co. v. California, 125 L. Ed. 2d 612, 113 S. Ct. 2891, 2917 (1993) (Scalia, J., Dissenting in part) (discussing Lauritzen and distinguishing subject matter jurisdiction from applicability of American law).\n\nSection 1331 provides that the federal \"district courts shall have original jurisdiction of all civil actions arising under the Constitution, laws, or treaties of the United States.\" 28 U.S.C. § 1331 (1988). \"The question of whether the district court had subject matter jurisdiction pursuant to [the Jones Act] is not whether [plaintiff] had a valid cause of action against the [defendants] under federal . . . law. Rather, the subject matter jurisdiction analysis is one of whether the determination of the existence vel non of that cause of action is a question 'arising under the . . . laws . . . of the United States.'\" Airco Indus. Gases, Inc. v. Teamsters Health \u0026 Welfare Pension Fund, 850 F.2d 1028, 1032 (3d Cir. 1988). Plaintiff clearly meets that standard, for whether she could assert claims under the Jones Act and general maritime law is a question of federal law. The district court clearly had jurisdiction over plaintiff's Jones Act claims.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\n2. Admiralty Jurisdiction Under 28 U.S.C. § 1333\n\nPlaintiff's remaining claims against the defendants allege violations of the general maritime law duty to provide a seaworthy vessel. Again, although the Lauritzen factors are to be used in determining the applicability of substantive American maritime law, they do not go to subject matter jurisdiction. Rather, for non-statutory causes of action, we apply the customary admiralty jurisdiction analysis of Executive Jet Aviation, Inc. v. City of Cleveland, 409 U.S. 249, 93 S. Ct. 493, 34 L. Ed. 2d 454 (1972), Foremost Ins. Co. v. Richardson, 457 U.S. 668, 102 S. Ct. 2654, 73 L. Ed. 2d 300 (1982), and Sisson v. Ruby, 497 U.S. 358, 110 S. Ct. 2892, 111 L. Ed. 2d 292 (1990), as recently reaffirmed in Jerome B. Grubart, Inc. v. Great Lakes Dredge \u0026 Dock Co., 130 L. Ed. 2d 1024, 115 S. Ct. 1043 (1995).\n\n\"[A] party seeking to invoke federal admiralty jurisdiction pursuant to 28 U.S.C. § 1333(1) over a tort claim must satisfy conditions both of location and of connection with maritime activity.\" Id. at 1048. For tort claims, the locality test requires that \"the tort occurred on navigable water or . . . injury suffered on land was caused by a vessel on navigable water.\" Id. Here, the locality test is \"readily satisfied,\" id. at 1049, for plaintiff's injuries occurred in navigable waters and were caused there by a vessel, see id. at 1048.\n\nThe maritime connection inquiry is two-fold. First, we \"assess the general features of the type of incident involved to determine whether the incident has a potentially disrupting impact on maritime commerce.\" Id. (internal citations and quotation marks omitted). Second, we \"determine whether the general character of the activity giving rise to the incident shows a substantial relationship to traditional maritime activity.\" Id. (internal citations and quotation marks omitted).\n\nWith respect to the potential disruption prong, we describe the incident \"at an intermediate level of possible generality.\" Id. at 1051. Following the Supreme Court's lead, the \"general features of the incident at issue here may be described as damage by a vessel in navigable water to [a seaman].\" Id.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e \"So characterized, . . . this is the kind of incident that has a potentially disruptive impact on maritime commerce.\" Id. Injury to a seaman in navigable waters \"could lead to restrictions on the navigational use of the waterway,\" id., during necessary investigations into the accident, which could be especially lengthy in a case where the seaman's injuries proved fatal. Additionally, a vessel's need to replace an incapacitated seaman could lead to delays in commercial shipping. Although this case involves a pleasure boat rather than a vessel engaged in commercial shipping, that fact does not affect the jurisdictional result. In Sisson v. Ruby, the features of the incident were described as \"a fire on a vessel docked at a marina on navigable waters,\" 497 U.S. at 363, 110 S. Ct. at 2896, even though the \"vessel\" was a pleasure boat.\n\nThe second prong of the maritime connection test is also easily met here. \"In the second Sisson enquiry, we look to whether the general character of the activity giving rise to the incident shows a substantial relationship to traditional maritime activity.\" Jerome B. Grubart, Inc., 115 S. Ct. at 1051. \"Navigation of boats in navigable waters clearly falls within the substantial relationship . . . .\" Id. Thus, the travels of the Long John qualify despite the short distances involved in its voyages. Cf. Sinclair v. Soniform, Inc., 935 F.2d 599, 600 (3d Cir. 1991) (upholding admiralty jurisdiction over claim arising from failure of crew of vessel that transported plaintiff to detect symptoms of and administer proper care for decompression sickness suffered during scuba diving investigation in navigable waters); see also 1 STEVEN F. FREIDELL, BENEDICT ON ADMIRALTY § 171, at 11-22 to -23 nn.54-56 (7th ed. rev. 1995) (citing cases finding admiralty jurisdiction over claims that navigation errors or negligent operation of vessel injured others) [hereinafter BENEDICT ON ADMIRALTY]. Since the locality and maritime connection tests were clearly met, the district court had admiralty jurisdiction over plaintiff's claims.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nIII. APPLICABILITY OF AMERICAN LAW UNDER THE LAURITZEN TRIAD\n\nA. Introduction\n\nThe questions whether American law actually applies under the Lauritzen triad, and if so whether the facts entitle the plaintiff to recover, arise only when, as here, a district court has subject matter jurisdiction over a Jones Act or American general maritime law claim. Moreover, Lauritzen analysis is a choice of law methodology, and, like a plaintiff's need to prove one or more of the specific statutory elements of his or her claims, choice of law issues may be waived.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Thus, if defendants do not argue that American law is inapplicable as a matter of choice of law, the court will not analyze the Lauritzen factors. The plaintiff would need only to prove the particular elements of the cause of action, such as seaman status, employer status, negligence, causation, and damages (for a Jones Act case).\n\nWhen a defendant does raise the Lauritzen issue, a plaintiff suing for personal injury damages under American maritime law must, as with any other cause of action, both establish the applicability of the law under which the case was brought and prove the elements of the cause of action. See, e.g., Larry Kramer, Rethinking Choice of Law, 90 COLUM. L. REV. 277, 290 (1990); cf. G.E.J. Corp. v. Uranium Aire, Inc., 311 F.2d 749, 751 (9th Cir. 1962) (\"Generally a party must establish a fact which is essential to his claim or defense . . . .\"). If American law is not applicable, or if the plaintiff fails to prove one of the specific elements of the cause of action, the suit would, in the ordinary course, fail on the merits.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nB. Purposes of and Problems with the Lauritzen Analysis\n\nDetermining whether or not American maritime law (statutory or general) applies with respect to a given incident entails a choice of law analysis, mandated by the Supreme Court as a matter of statutory construction. The Court adverted to choice of law principles because of the facial universality of the Jones Act, whose terms offer a remedy to \"any seaman.\" 46 U.S.C. § 688(a) (1988). In Lauritzen --which involved a lawsuit by a Danish sailor (for injuries suffered in the coastal waters off Cuba) against his employer, a Danish shipowner with whom he had contracted (in Danish)--the Court was concerned with restricting the \"literal catholicity,\" Lauritzen, 345 U.S. at 576, 73 S. Ct. at 925, of the Jones Act's language to ensure that it would not apply to situations where \"the seaman, the employment [and] the injury [lack] the slightest connection with the United States.\" Id. at 577, 73 S. Ct. at 925. Thus, the first aim of Lauritzen analysis is to assure that American maritime law is not applied to incidents that lack any significant American connection.\n\nThe second, related purpose of the analysis is to resolve and avoid conflicts with the maritime laws of other nations.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e See Lauritzen, 345 U.S. at 582, 73 S. Ct. at 928. To this end the Court invoked a presumption that in the absence of specific direction to the contrary, statutes of Congress would not be interpreted to violate international law. See 345 U.S. at 577, 581, 73 S. Ct. at 926, 927-28. Applying this presumption to the Jones Act, the Court in Lauritzen adopted a form of interest analysis to cabin the sweep of the Jones Act. See id. at 582, 73 S. Ct. at 928 (\"The criteria, in general, appear to be arrived at from weighing of the significance of one or more connecting factors between the shipping transaction regulated and the national interest served by the assertion of authority.\") (emphasis supplied); id. at 577, 73 S. Ct. at 925 (extolling expertise of \"courts long accustomed to dealing with admiralty problems in reconciling our own with foreign interests\"). Courts ruling on the reach of American law were thus directed to consider seven factors that were, in part for pragmatic reasons, accorded various degrees of importance.\n\nIn Romero v. International Terminal Operating Co., 358 U.S. at 354, 79 S. Ct. at 468, the Supreme Court emphasized that the Lauritzen factors were gleaned not from the terms of the Jones Act but rather from more general maritime law choice of law principles, and that they were intended to guide courts generally in applying maritime law regarding personal injury claims to incidents with foreign connections. See 358 U.S. at 382, 79 S. Ct. at 485.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e Finally, in Hellenic Lines Ltd. v. Rhoditis, the Supreme Court elaborated upon the Lauritzen analysis. In particular, the Court added an eighth factor for consideration, see 398 U.S. at 309, 90 S. Ct. at 1734, and attached a label to the types of contacts with the United States necessary to sustain applicability of American law in light of the aims of the Lauritzen analysis: \"substantial\" contacts. Id. at 309 n.4, 90 S. Ct. at 1734 n.4.\n\nIn adopting this terminology, the Court placed its focus primarily, though not myopically, on whatever American contacts the transaction may have. See id. (\"The decisional process . . . involves the ascertainment of the factors or groups of facts which constitute contacts between the transaction involved in the case and the United States, and then deciding whether or not they are substantial.\") (quoting Bartholomew v. Universe Tankships, Inc., 263 F.2d 437, 441 (2d Cir. 1959)); id. at 310, 73 S. Ct. at 1734 (\"The [foreign contacts present] are in the totality of the circumstances of this case minor weights in the scales compared with the substantial and continuing contacts that this alien owner has with this country.\").\n\nDespite these developments, Lauritzen interest analysis remained a somewhat amorphous process. The Supreme Court stressed in Rhoditis that Lauritzen 's choice of law interest analysis is not mechanical, that the significance of each factor is variable, and that the enumerated factors are not exhaustive of potentially relevant considerations. See 398 U.S. at 308, 90 S. Ct. at 1734. The analysis is consequently imbued with a flexibility that permits courts to take account of the context of any incident that American law is alleged to govern, but this malleability has not always proven the surest guide. Indeed, one troubled trial court remarked that the case law applying the Lauritzen triad had \"made the relative significances of the 'factors' almost infinitely variable,\" and it feared \"that each 'factor's' significance is sufficiently obscure or variable to justify any judicial Conclusion.\" Munusamy v. McClelland Engineers, Inc., 579 F. Supp. 149, 153 (E.D. Tex.), mandamus denied (with request for certification), 742 F.2d 837 (5th Cir. 1984), order vacated, 784 F.2d 1313 (1986). Academic commentary has been similarly critical. See, e.g., Michael Boydston, Cruz v. Chesapeake Shipping and the Choice-of-Law Problem in Admiralty Actions, 27 TEX. INT'L L.J. 419, 434 (1992); Symeon Symeonides, Maritime Conflicts of Law from the Perspective of Modern Choice of Law Methodology, 7 MAR. LAW. 223, 242-43 (1982) [hereinafter Symeonides, Maritime Conflicts ].\n\nC. The Two Steps of the Lauritzen Choice of Law Inquiry\n\nThe solution to the lack of guidance lies in approaching the Lauritzen analysis in a way that is faithful to its nature as a specialized form of interest analysis designed to ensure that American maritime law of personal injuries applies only where significant American interests are implicated and only in conformity with international law. Specifically, we interpret the notion of \"substantial contacts\" to embody these twin concerns in a two-step inquiry derived from international law. We conclude below that, in a Jones Act or general maritime law case, a court deciding whether American contacts are \"substantial\" (so that American law applies) must at the threshold ask whether one of the following factors is involved in the incident, in which case there is a basis for prescriptive jurisdiction (which, we explain infra subsection 1, means that significant American interests are implicated): injury to an American seaman or a seaman with American dependents, injury in American territory, American defendants, an American flagged ship, or a contractual choice-of-law clause specifying American law. If so, the second step in the substantial contacts inquiry is for the court to ascertain whether application of American law is reasonable under the circumstances, in which case (as subsection 2 describes) international law is satisfied.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nIn this case, as we explain below, the plaintiff succeeds on both steps of the inquiry. Her American citizenship satisfies the threshold requirement of a basis for prescriptive jurisdiction, and consideration of the Lauritzen factors reveals that the American interests at stake here are such that American law may be reasonably applied. Hence, the American contacts are \"substantial\" and the plaintiff was entitled to sue under American law.\n\nIn the following analysis, we \"rely on the Restatement (Third) of Foreign Relations Law for the relevant principles of international law. Its standards appear fairly supported in the decisions of [the Supreme] Court construing international choice-of-law principles ([e.g.,] Lauritzen, Romero, and McCulloch [v. Sociedad Nacional de Marineros de Honduras, 372 U.S. 10, 83 S. Ct. 671, 9 L. Ed. 2d 547 (1963)]) . . . .\" Hartford Fire Ins. Co. v. California, 125 L. Ed. 2d 612, 113 S. Ct. 2891, 2920 (Scalia, J., Dissenting in part). A primary reason for relying on the Restatement of Foreign Relation Law is that one of the Court's chief motives for cabining the potentially unlimited scope of the Jones Act in Lauritzen was a concern that the legislation not violate norms of international law. While the Dissent argues that the sections we rely on \"were not meant to apply in a tort case such as this,\" Dissenting op. infra at 4 (quoting RESTATEMENT Pt. IV, Ch. 1, Introd. Note, at 237), the passage it quotes reveals that the Restatement's rules are not unconditionally irrelevant to tort cases: they only \"do not necessarily apply.\" Id. at 5 (different emphasis supplied). However, \"in some circumstances, issues of private international law may also implicate issues of public international law, and many matters of private international law have substantial international significance and therefore may be considered foreign relations law [.]\" RESTATEMENT § 101, cmt. c, at 23 (emphasis supplied). The Jones Act and American maritime law more generally are examples of just such matters, as is reflected by the Supreme Court's concern in Lauritzen about the prospect of violating international law.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e See also infra note (discussing difference between maritime laws and conventional tort law). Furthermore, the views of Lea Brilmayer, one of the leading authorities in the area, support use of the Restatement of Foreign Relations Law here. Professor Brilmayer has analyzed conflict of laws as \"the domestic counterpart of the international law issue of the extraterritorial application of American law.\" Lea Brilmayer, The Extraterritorial Application of American Law: A Methodological and Constitutional Appraisal, 50 L. \u0026 Contemp. Probs. 11, 11 (Summer 1987). Of particular relevance here, she has noted the unhelpfulness of the public/private distinction as regards international law: \"Whether or not that distinction is viable, it does not describe the different roles of the two Restatements. Some private law cases, such as Lauritzen v. Larsen, fall under the Restatement of Foreign Relations Law. \" Id. at 12 (footnote observing that Lauritzen is mentioned in the Restatement of Foreign Relations Law § 403, reporters' note 2 omitted; emphasis supplied).\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\n1. Do the Contacts Show a Basis for Prescriptive Jurisdiction?\n\nThe first essential question in Lauritzen analysis is whether the suit implicates significant interests of the United States. In accordance with Lauritzen 's direction to construe American maritime law so as not to violate international law, we identify this preliminary inquiry with the question whether there is a basis for the United States to exercise prescriptive jurisdiction over the incident at issue.\n\n\"International law has long recognized limitations on the authority of states to exercise jurisdiction to prescribe in circumstances affecting the interests of other states.\" RESTATEMENT (THIRD) OF FOREIGN RELATIONS LAW Pt. IV, Introd. Note, at 230 (1987) [hereinafter RESTATEMENT]. The Restatement defines prescriptive jurisdiction--which is not to be confused with subject matter jurisdiction--as the authority of a state \"to make its law applicable to the activities, relations, or status of persons, or the interests of person in things . . . .\" RESTATEMENT § 401(a). It lists several alternative bases for prescriptive jurisdiction. As a general matter (subject to restrictions we discuss below), nations may prescribe law\n\nwith respect to\n\n(1) (a)\n\nconduct that, wholly or in substantial part, takes place within its territory;\n\n(c) conduct outside its territory that has or is intended to have substantial effect within its territory; [and]\n\n(2)the activities, interests, status, or relations of its nationals outside as well as within its territory[.]\n\nRESTATEMENT § 402. Additionally, the Restatement recognizes the authority of a state to apply its law to activities connected with vessels flying its flag. See id. § 502.\n\nThe Lauritzen factors directly provide the answer to the first question in the Lauritzen choice of law interest analysis--whether (in the terminology of the Restatement) the United States has a basis for prescriptive jurisdiction with respect to the incident. When an American worker or a worker with American dependents is injured, application of United States law will affect the interests and relations of Americans, and there are likely to be substantial effects within the United States. Hence, application of American maritime law in suits for personal injuries to American seamen or seamen with American dependents affects the interests of nationals of the United States, thus providing a basis for prescriptive jurisdiction pursuant to Restatement § 402(2) and § 402(1)(c).\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e Next, by definition, injuries occurring in American territory (including waters) fall within § 402(1)(a), which thus recognizes that the United States has a basis for prescriptive jurisdiction over such incidents. Where the defendants are American, a basis for prescriptive jurisdiction to apply United States law exists pursuant to § 402(2). Where the ship involved flies the American flag, § 502 of the Restatement recognizes prescriptive jurisdiction on the part of the United States.\n\nFinally, parties may generally consent to application of American law to govern their relations, as evidenced by a choice of law clause. Cf. National Ass'n of Sporting Goods Wholesalers, Inc. v. F.T.L. Mktg. Corp., 779 F.2d 1281, 1285 (7th Cir. 1985) (citing Casio, Inc. v. S.M. \u0026 R., Co., 755 F.2d 528, 531 (7th Cir. 1985)). In such cases it may be technically imprecise to speak of prescriptive jurisdiction, for American law applies not by virtue of the sovereign power of the United States but rather by the choice of the parties. However it is styled, a reasonable, mutual, ex ante choice of American law would create an American interest in applying the Jones Act or American general maritime law sufficient to meet the threshold requirement.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nIn sum, then, we hold that a plaintiff generally must establish one of the following to demonstrate a basis for prescriptive jurisdiction, which under the Lauritzen analysis is a threshold requirement for American maritime law to apply:\n\n(a) injury to an American seaman or a seaman with American dependents,\n\n(b) injury in American territory,\n\n(c) American defendants,\n\n(d) an American flagged ship, or\n\n(e) a contractual choice-of-law clause specifying American law.\n\nSee also Bailey v. Dolphin Int'l, Inc., 697 F.2d 1268, 1278 n.25 (5th Cir. 1983) (\"[A] sufficient American interest in a particular transaction can rest on the presence of even one substantial contact between the transaction and this country . . . .\"), overruled on other grounds by In re Air Crash Disaster Near New Orleans, 821 F.2d 1147 (5th Cir. 1987) (en banc).\n\nThe plaintiff's threshold burden of proving one of these contacts with the United States arises when a defendant alleges that American law is inapplicable under the Lauritzen triad. The plaintiff must proffer evidence from which a jury might conclude that one of the specified factors supporting prescriptive jurisdiction exists, and if the evidence introduced by either side (as to the existence vel non of one of the pertinent United States contacts) as a whole does not establish by a preponderance that such a factor exists, the court must hold American law inapplicable.\n\nIn the present case, the Lauritzen factors clearly exhibit a basis for prescriptive jurisdiction. It is uncontested that Neely, the injured seaman, is an American citizen. This American contact is among those we have identified as implicating significant American interests, and we turn therefore to the second step of the inquiry.\n\n2. Are the Contacts Such That Application of American Law Would Be Reasonable?\n\nWhere plaintiffs have shown that there is a basis for prescriptive jurisdiction, significant American interests are implicated, and courts must consider the second goal of the Lauritzen analysis in determining whether American law is applicable. The second step in the Lauritzen choice of law inquiry is concerned with resolving or avoiding conflicts with foreign law by construing American law in harmony with international law. We identify the pertinent inquiry primarily with the restriction on prescriptive jurisdiction described by § 403(1) of the Restatement. Section 403(1) expresses a limitation on the exercise of prescriptive jurisdiction. It specifies that \"even when one of the bases for jurisdiction under § 402 is present, a state may not exercise jurisdiction to prescribe law with respect to a person or activity having connections with another state when the exercise of such jurisdiction is unreasonable,\" RESTATEMENT § 403(1); in determining whether it is reasonable to apply American law, courts are to consider \"all relevant factors,\" id. § 403(2), which includes the American contact that provided a basis for prescriptive jurisdiction.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nThus, the plaintiff's burden of proving the applicability of American law translates at this step to a burden of proving reasonableness. This burden does not require the plaintiff to show the absence of foreign contacts, or to bear a burden of proof with respect to each of the Lauritzen factors, as the defendants urge, see Reply Br. of Appellees/Cross-Appellants, at 3. While there is a dearth of precedent concerning the scope of the plaintiff's burdens when the defendant invokes the Lauritzen triad, logic dictates that the plaintiff need adduce evidence concerning only those factors that he or she believes support the reasonableness of applying American law. The individual factors are not required elements of a Jones Act or general maritime law claim--the Supreme Court has made clear that no particular factor need reflect a contact with the United States for a plaintiff to have a claim under American law, see, e.g., Rhoditis, 398 U.S. 306, 90 S. Ct. 1731, 26 L. Ed. 2d 252 (applying American law despite foreign employer, foreign-flag ship, foreign plaintiff, and contract in foreign language specifying foreign law)--but rather are subsidiary indicia of the reasonableness of applying American law. Moreover, general choice of law analyses do not deem a plaintiff responsible for bringing forth information on all circumstances--whether helpful or harmful to the plaintiff's case--that might inform the choice of law. For all these reasons, we decline to impose such a requirement here.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nInstead, once the plaintiff has established the existence of a basis for prescriptive jurisdiction, it is incumbent upon defendants to prove the existence of foreign contacts. This allocation of burdens comports with the remedial policies behind the Jones Act (and the unseaworthiness cause of action), which is designed for the protection of seamen. Information relevant to a great variety of the circumstances that could figure in a Lauritzen analysis may be in the hands of defendants. We therefore believe that it would be at odds with Congress's solicitous intent for courts to require seamen to make a negative showing with respect to factors on which they do not rely in establishing the reasonableness of applying American law.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nIf the court concludes that the evidence as a whole does not establish the existence of any foreign contacts that would provide a foreign nation with a basis for prescriptive jurisdiction, the plaintiff immediately prevails on the choice of law issue: a preponderance of--indeed, all--the evidence shows that the application of American law in such a case is reasonable. As long as the plaintiff has shown a basis for prescriptive jurisdiction, cf. De Mateos v. Texaco, Inc., 562 F.2d 895, 900 (3d Cir. 1977) (\"Due process requires the identification of significant American interests before an American sovereignty . . . [may] export its laws to foreign transactions . . . .\"), American interests are implicated, and maritime law may apply unless concerns about conflicts with the law of other interested nations compel the Conclusion that this would not be reasonable. Where there are no significant foreign contacts, the court cannot conclude that any other nation is interested in the relevant sense. And since the plaintiff has by this step of the inquiry established an American contact that implicates significant American interests, this in turn establishes that application of American law is reasonable and proper.\n\nForeign contacts standing alone, however, are of extremely limited value, for \"the actual conflict before the court is a conflict between competing laws, not between physical contacts. Such conflicts can be resolved intelligently and rationally only by ascertaining and evaluating the policies underlying the competing laws.\" Symeonides, Maritime Conflicts, 7 MAR. LAW. at 245; see also Romero, 358 U.S. at 383, 79 S. Ct. at 486 (\"The controlling considerations are the interacting interests of the United States and of foreign countries . . . .\") (emphasis supplied). Indeed, Lauritzen analysis generally seems to presuppose that the court has information concerning the substantive content of foreign law. See, e.g., Lauritzen, 345 U.S. at 575-76, 73 S. Ct. at 924-25 (developing at outset the conflict between American and Danish law); id. at 582, 73 S. Ct. at 928 (\"The criteria, in general, appear to be arrived at from weighing of the significance of one or more connecting factors between the shipping transaction regulated and the national interest served by the assertion of authority.\") (emphasis supplied).\n\nConsequently, where the substance of foreign law is unknown, the Lauritzen inquiry could at most be used prophylactically, to steer clear of potential but unknown conflicts. Because holding American law inapplicable at this point would do so without a textual mandate--and with significant American interests present--such judicially imposed restraint should not be de rigueur. A court typically should not hold that the United States' exercise of prescriptive jurisdiction is unreasonable in a case where the substance of relevant foreign law is unknown, unless it concludes that the basis for prescriptive jurisdiction is exceedingly weak and that virtually all other contacts likely implicate policies of the foreign nation.\n\nMoreover, the plaintiff generally has no responsibility to demonstrate the content of potentially applicable foreign law.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e At this step of the inquiry, a defendant's continued insistence that the established American contacts are not \"substantial\" amounts to the argument that American law should be interpreted not to apply in order to accommodate the policies served by some foreign law.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e In effect, then, the defendant seeks to rely on foreign law to set up an obstacle to American law. For the same or similar reasons that plaintiffs need not establish Lauritzen factors that do not support their case,\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e the responsibility for demonstrating the content of foreign law rests with the defendants who wish to use it to defeat a claim under American law.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e To hold otherwise would be at odds with congressional intent, for where Congress does want to impose upon a seaman the onus of establishing the content of foreign law in order to proceed under American law, it knows how to draft an appropriate provision: In the 1982 amendments to the Jones Act, Congress denied the benefit of the Act to foreign seamen in certain circumstances unless they show that foreign law offers them no remedy. See 46 U.S.C.A. § 688(b)(2).\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nIn this case, the evidence presented at trial establishes the existence of foreign contacts, but the defendants have presented no information concerning what potentially applicable St. Lucian law might provide. Indeed, even at in banc reargument before this court they were unable to state what the law of St. Lucia provided (and they have made no post-argument submissions). Accordingly, we cannot calibrate the extent of foreign interests at stake, and unless virtually all of the Lauritzen factors point away from the United States, application of American law will be reasonable in light of the American interests that the plaintiff has shown to be implicated. With this in mind, we now consider the various factors.\n\na. Inaccessibility of a Foreign Forum\n\nWe regard the potential inaccessibility of a foreign forum as a relatively insignificant factor in favor of the law of any jurisdiction, American or St. Lucian. As the Supreme Court explained in Lauritzen, inaccessibility of a foreign forum is a consideration more appropriate to a forum non conveniens-type analysis than to the question of the extraterritorial reach of a statute. See Lauritzen, 345 U.S. at 589-90, 73 S. Ct. at 932. Accordingly, we do not think that the degree to which a forum in St. Lucia might be inaccessible to Neely particularly supports application of American law in this case. Nor, however, does it count against the reasonableness of applying American law, and especially so because the defendants have presented the court with no information about what remedies St. Lucian law might or might not offer the plaintiff.\n\nb. Law of the Forum\n\nWe do know what American law provides, but the law of the forum (the seventh factor) was considered by the Supreme Court in Lauritzen to be a very weak consideration in favor of application of American law:\n\nThe purpose of a conflicts-of-laws doctrine is to assure that a case will be treated in the same way under the appropriate law regardless of the fortuitous circumstances which often determine the forum. Jurisdiction of maritime cases in all countries is so wide and the nature of its subject matter so far-flung that there would be no justification for altering the law of a controversy just because local jurisdiction of the parties is available.\n\nLauritzen, 345 U.S. at 591, 73 S. Ct. at 932. Despite this disparagement of the law of the forum, the Court treated it as a relevant factor in Rhoditis. See Rhoditis, 398 U.S. at 308, 90 S. Ct. at 1733. Thus, albeit weakly, the law of the forum supports application of American law.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\n\nc. Place of the Wrongful Act\n\nIn conducting the Lauritzen reasonableness inquiry, courts must attend to the context of the incident at the heart of the suit. Where seamen are not plying the world's seas in traditional international shipping activity, some contacts take on heightened significance and others diminished significance, for some of the rationales concerning the significance of the factors articulated in the Lauritzen opinion do not apply with the same force in all circumstances. See, e.g., Zipfel v. Halliburton Co., 832 F.2d 1477, 1482-83 (9th Cir. 1987); Chiazor v. Transworld Drilling Co., 648 F.2d 1015, 1019 (5th Cir. 1981), overruled on other grounds by In re Air Crash Disaster Near New Orleans, 821 F.2d 1147 (5th Cir. 1987) (en banc). Although some of the cases recognizing the variability of the Lauritzen factors' significance refer to the type of vessel at issue, see, e.g., Zipfel, 832 F.2d at 1482 (\"cases involving atypical vessels\"), the basis for the distinctions is not the nature of the vessel but rather, as our Discussion below illustrates, the nature of the activity, see, e.g., Fogleman v. ARAMCO, 920 F.2d 278, 282 (5th Cir. 1991) (\"The significance of each factor in a nontraditional maritime context like offshore oil production may vary from that in the traditional shipping context in which the Lauritzen -Rhoditis test arose.\") (emphases supplied); Phillips v. Amoco Trinidad Oil Co., 632 F.2d 82, 86 (9th Cir. 1980) (distinguishing the case before the court from \"a typical maritime case involving a vessel sailing in international commerce \") (emphasis supplied). Common sense confirms that this is a non-traditional Jones Act case. The activity here took the Long John and its crew not from sea to sea in pursuit of international commerce but rather from beach to reef in aid of scuba diving adventures. This case is thus the antithesis of a traditional international shipping case, and we treat it accordingly.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\n\nIn traditional international shipping contexts, the place of the wrongful act is accorded little importance in the choice of law inquiry. International shipping vessels journey through the waters of many different nations, and the local law might therefore change frequently, see Lauritzen, 345 U.S. at 585, 73 S. Ct. at 930, rendering difficult the protection or even the formation of justified expectations about the law governing seamen's employment relations if the place of the injury were a significant factor. Cf. Romero, 358 U.S. at 384, 79 S. Ct. at 486 (\"an unduly speculative burden\"). Moreover, the site of the injury will largely be fortuitous when the seaman is exposed to the same risks throughout the course of the journey and an accident happens to occur in a particular locale. See, e.g., id. ; Fogleman, 920 F.2d at 282 (\"The place of the wrongful act is accorded little weight in traditional maritime cases, in which the locality of the ship changes constantly.\").\n\nIn non-traditional contexts, however, the vessels at issue do not ply the waters of multiple seas. It may be predicted at the outset that any injuries will likely occur, non-fortuitously, in the locale where the vessel is stationed. Thus, the justified expectations would not be thwarted if the place of the act were considered a significant choice of law factor. See, e.g., Fogleman, 920 F.2d at 282 (\"When the injury stems from work on a permanently situated offshore oil rig or work platform, however, the place of the wrong assumes greater importance.\").\n\nThis \"shift\" is relevant in this case, which did not arise in a traditional international shipping context. Admittedly, the Long John, the ship that injured plaintiff, was a sixteen metric ton vessel capable of plying the high seas, unlike the drilling platforms that have been involved in many non-traditional cases. But as we have already explained, it is the nature of the activity, not of the vessel, that matters. The Long John was used at the time of plaintiff's accident solely for Club Med scuba diving expeditions in the waters off St. Lucia. Similarly, plaintiff, an American citizen, contracted in the United States to serve as a scuba instructor, specifically to take Club Med guests on scuba diving expeditions off the coast of St. Lucia. She was a crewmember of a fleet (which included the Long John) used solely for this purpose. Thus, the location of this accident was not \"fortuitous\" in the same way as that of a shipboard tort against a traditional seaman. Due to the non-traditional context of this suit, the place of the wrongful act would normally take on greater significance.\n\nAll parties now agree that the injury occurred in St. Lucian waters, and there is no suggestion that the allegedly improper training complained of by the plaintiff in her Jones Act count occurred in the United States. The location of this accident presumably implicates, with more force than it might in cases involving traditional sea-going vessels, whatever regulatory interests St. Lucia may have in applying its law to this accident. But because St. Lucia's interests are undefined in this case, this factor does not strongly suggest that application of American law would not be reasonable.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\nd. Place of Contract\n\nAnother factor whose significance shifts in non-traditional contexts is the place of contract. In Lauritzen, the Supreme Court discounted the importance of the place of contract for choice of law. It reasoned that \"[a] seaman takes his employment, like his fun, where he finds it; a ship takes on crew in any port where it needs them.\" 345 U.S. at 588, 73 S. Ct. at 931. However, although the place of contracting is \"of little import due to its 'fortuitous' occurrence for the traditional seaman, [it] becomes a substantial factor in nontraditional maritime employment aboard a vessel more or less permanently located off the coast of a particular country.\" Fogleman, 920 F.2d at 283 (footnotes omitted). See also Chiazor, 648 F.2d at 1019.\n\nThe relatively stationary nature of the employment setting allows the ex ante formation of reasonable beliefs about the locale of likely work-related injuries, and there are therefore fewer unforeseen contingencies to detract from the importance of the site of contracting. The Court downplayed this factor in Lauritzen largely because of the fortuity of the place of contracting, when international shippers took on crew as needed in various nations' ports. However, with a non-traditional operation such as the one here, employers need not (and do not) take on crewmembers at random ports as hiring needs dictate; rather, they may (and do) select employees in advance, wherever they choose.\n\nIn this case, the place of contracting was the United States. After interviewing in the United States, plaintiff received a letter of interest from the defendants before their need for another scuba instructor at Holiday Village even arose. Several months later she formed an oral contract to work for Club Med Management and Holiday Village in St. Lucia for six weeks, with offer and acceptance occurring during a telephone call between New York and either Washington, D.C. or Pennsylvania. Thus, since the parties contracted in America for employment in a determinate, fixed locale, the significance of the place of contracting--the United States--is not discounted as it would be in a traditional setting, thus supporting the reasonableness of applying American law.\n\ne. Law of the Flag\n\nIn contrast to both the place of the wrongful act and the place of contract, the law of the flag is less important in non-traditional contexts. See, e.g., Zipfel, 832 F.2d at 1482-83. We have previously recognized that application of the law of the flag in maritime cases \"is not an inflexible rule.\" Cruz v. Chesapeake Shipping, Inc., 932 F.2d 218, 228 (3d Cir. 1991) (Rosenn, J., announcing the judgment of the court). In cases where the vessel at issue does not ply the open seas but stays essentially in one location, the pragmatic basis for according the law of the flag great significance, see, e.g., Zipfel, 832 F.2d at 1482, is diminished, and it has frequently been accorded less weight, see, e.g., Cuevas v. Reading \u0026 Bates Corp., 770 F.2d 1371, 1378-79 (5th Cir. 1985) (discounting law of the flag of a jack-up drilling ship and holding American law inapplicable), overruled on other grounds by In re Air Crash Disaster Near New Orleans, 821 F.2d 1147 (5th Cir. 1987) (en banc); Koke v. Phillips Petroleum Co., 730 F.2d 211 (5th Cir. 1984) (same, concerning a semi-submersible platform for oil-field support service), overruled on other grounds by In re Air Crash Disaster Near New Orleans, 821 F.2d 1147 (5th Cir. 1987) (en banc); Zipfel, 832 F.2d at 1483 (same, concerning a floating oil-drilling rig).\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nSince the plaintiff did not show that the vessel flies the American flag, the second Lauritzen factor does not aid her. Nor, however, does the law of the flag hurt her case for the reasonableness of applying American law. First, as we have noted, the law of the flag is of less significance in a non-traditional case such as this one. Second, the defendants presented no testimony as to what flag, if any, the Long John flew. There was only a declaration of the Long John 's un-cross examined title owner averring that the vessel was \"registered\" in St. Lucia. The charter between the title owner and Holiday Village conspicuously left blank the registration number and place of registry.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\n\nMoreover, in order for the law of the flag appreciably to diminish the reasonableness of applying American law, the defendant would have had to demonstrate both what the law of the flag was and that it conflicts in some respect with American law, which the defendants here have failed to do. Where the content of foreign law is unknown, this factor should be accorded little significance in the Lauritzen inquiry. After all, the Supreme Court included among the Lauritzen factors \"the law of the flag,\" rather than merely \"the flag.\" Absent knowledge of the contours of foreign laws, a court cannot identify what foreign interests are relevant, and it would then be impossible to discern any conflict between American law and foreign law. Thus, unthinking deference to the flag of the ship at issue would disserve the American interests that we know are implicated at this stage of the analysis without any assurance that foreign interests would otherwise be threatened. In short, while the law of the flag has in the past been justified as a highly significant contact on pragmatic grounds (although less so in cases where there is a \"flag of convenience,\" see, e.g., Hellenic Lines, Ltd. v. Rhoditis, 412 F.2d 919, 923-24 (5th Cir. 1969) (relying on Lauritzen), aff'd, 398 U.S. 306, 90 S. Ct. 1731, 26 L. Ed. 2d 252 (1970)), it is basically insignificant when the court does not know what that law is, or where there is no conflict between American law and the law of the flag. Here, the defendants did not make the required showing, and we therefore accord this factor no particular significance in deciding whether the application of American law is reasonable in this case.\n\nf. Defendants' Allegiance, Bases of Operations, and Other Contacts with the United States\n\nTurning to the \"allegiance of the defendant shipowner\" and the defendants' bases of operations, the vessel Long John was found at trial to be owned (pro hac vice) by Holiday Village, a St. Lucian corporation. The Lauritzen triad discussed the liability of the defendant shipowner; the Court was not addressing situations where a defendant employer is not the shipowner. The Jones Act, however, provides a right of compensation for injuries negligently caused by the seaman's employer. Cf. Fogleman, 920 F.2d at 282-83 (\"Since this is not a traditional shipping case, however, Fogleman's alleged employers--and therefore the defendants in this case--are Fluor Arabia and ARAMCO, rather than the shipowners.\"). Thus, with respect to the Jones Act claim, we must consider the allegiance and bases of operations of both Holiday Village and Club Med Management, plaintiff's employers,\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e and with respect to unseaworthiness, Holiday Village, the vessel owner pro hac vice. Moreover, because we are inquiring into the substantiality of contacts with the United States, we consider both the base of daily operations of the vessel (the Long John) and the corporate bases of the defendants. See, e.g., Nicol v. Gulf Fleet Supply Vessels, Inc., 743 F.2d 289, 296 (5th Cir. 1984).\n\nHoliday Village is apparently a St. Lucian corporation, although there was scant evidence of that at trial, and it apparently operated the Club Med resort in St. Lucia. The Long John was operated solely in St. Lucia for the benefit of Holiday Village and its guests. These connections do give rise to an interest on the part of St. Lucia in applying its law to incidents involving Holiday Village--but only weakly.\n\nBecause the Lauritzen factors are not exclusive or etched in stone, and because we determine choice of law by considering the reasonableness of applying American law, we consider not just the formal legal status of Holiday Village but also its operational contacts with the United States. This analysis does not amount to piercing the corporate veil as the defendants argue in an attempt to forestall our considering Holiday Village's contacts with the United States. We are not looking at Holiday Village's connections to the United States for the purpose of reaching the personal assets of its shareholders. Rather, we are examining the substance of the connections for the purpose of determining the reasonableness of applying American law under the circumstances. See Bartholomew v. Universe Tankships, Inc., 263 F.2d 437, 442 (2d Cir. 1959).\n\nWe believe that the defendants' continual and quite substantial commercial invitation of American tourists to Holiday Village (St. Lucia) implicates interests of the United States that supports application of American law to this case. Holiday Village advertises widely in American media and uses an American corporation, Club Med Sales, to solicit business in the United States, and another, Club Med Management, to oversee many of the resort's operations. The overwhelming majority of Holiday Village's income derives from the defendants' purposeful, directed solicitation of American tourism. In light of these contacts, we do not think that the incorporation of Holiday Village in St. Lucia strongly suggests that applying American law would not be reasonable. Moreover, Club Med Management and Club Med Sales are American corporations, and their allegiance and bases of operations are in the United States. This demonstrates a substantial connection with the United States and these factors contribute greatly to American interests, and hence to the reasonableness of applying American law in this case.\n\nFurthermore, these connections support application of American law because plaintiff's injuries were directly related to the defendants' American tourism operations. She was hired to be a scuba diving instructor to the tourists who patronize Holiday Village, and her injuries were suffered in the course of doing just that. These American tourists would have been (and may continue to be) at least as vulnerable to the lack of propeller guards on the Long John as was Neely, who was after all a scuba instructor. The United States has a great interest in assuring adequate protection for the life and health of Americans who are solicited in the United States to vacation or work at Club Med or other foreign spots, an interest which in these circumstances supports the application of American law. This interest is enhanced where, as here, the unseaworthy vessel substantially responsible for the injuries was built in the United States, apparently to American specifications. (See ACA Investigation Rpt.; C. Colby, Trial Tr. Day 5, at 28; Day 4, at 84-86.)\n\ng. Domicile or Allegiance of the Injured Seaman\n\nFinally, several cases hold that the seaman's allegiance is of increased importance in non-traditional contexts. See, e.g., Zipfel, 832 F.2d at 1483; Ali v. Offshore Co., 753 F.2d 1327, 1331 (5th Cir. 1985), overruled on other grounds by In re Air Crash Disaster Near New Orleans, 821 F.2d 1147 (5th Cir. 1987) (en banc); Zekic v. Reading \u0026 Bates Drilling Co., 536 F. Supp. 23, 25 (E.D. La. 1981), affirmed in part, vacated in part on other grounds, 680 F.2d 1107, 1108 (5th Cir. 1982), overruled on other grounds by In re Air Crash Disaster Near New Orleans, 821 F.2d 1147 (5th Cir. 1987) (en banc). As we have seen, the law of the flag is less important in non-traditional settings, for there is less need for it as a pragmatic device for avoiding conflicts. This attenuates the duty of allegiance that the seaman owes the flag state, and the allegiance to his or her home state is accordingly more important in the reasonableness inquiry. In the present non-traditional context, therefore, plaintiff's American citizenship implicates an even higher degree of American interest than it would in a traditional setting.\n\nFurthermore, in both non-traditional and traditional contexts, an injured seaman's connection to the United States is one of the most important of the Lauritzen factors tending to show the reasonableness of applying American law. In Lauritzen, the Supreme Court noted that the history of the Jones Act began \"with the 1915 enactment of the comprehensive LaFollette Act, entitled, 'An Act To promote the welfare of American seamen in the merchant marine of the United States; . . . and to promote safety at sea.'\" Id. at 579, 73 S. Ct. at 927 (emphasis supplied). The negligence guarantee for injured seamen was revised in 1920, pursuant to a measure entitled, \"An Act To provide for the promotion and maintenance of the American merchant marine.\" Id. These origins strongly suggest that the primary object of Congress's concern was the American seaman. So too do the 1982 amendments to the Jones Act, which restrict the rights of foreign seamen but not those of American seamen. 46 U.S.C. § 688(b) (1988); see also supra note and accompanying text (examining amendments). Indeed, Congress enacted the Jones Act out of heightened concern for American seamen in the wake of the Titanic disaster in 1912. See Peter Beer, Keeping Up with the Jones Act, 61 TUL. L. REV. 379, 384 (1986) (\"Iin the wake of public reaction to that tragedy, Congress began to face what it perceived to be its duty to the American seaman.\"). See also id. at 389; Symeonides, Maritime Conflicts, 7 MAR. LAW. at 236-37 (\"American seamen are the intended primary beneficiaries of the act . . . .\").\n\nIn discussing the injured seaman's nationality (i.e., Danish), which did not count in favor of applicability of the Jones Act, the Lauritzen Court recognized, without unreservedly endorsing, the venerable rule that imputed the nationality of the ship to its crewmembers. 345 U.S. at 586, 73 S. Ct. at 930. While the Court affirmed that seamen serving under foreign flags owed \"some duty of allegiance,\" id., the Court stressed that \"each nation has a legitimate interest that its national and permanent inhabitants not be maimed or disabled from self-support.\" Id. It further noted that some (though not all) courts had \"been prompted to apply the Jones Act by the fact that the wrongful act or omission alleged caused injury to an American citizen or domiciliary.\" Id. (citing Uravic v. F. Jarka Co., 282 U.S. 234, 51 S. Ct. 111, 75 L. Ed. 312 (1931), Shorter v. Bermuda \u0026 West Indies S.S. Co., 57 F.2d 313 (S.D.N.Y. 1932), and Gambera v. Bergoty, 132 F.2d 414 (2d Cir. 1942), but contrasting The Oriskany, 3 F. Supp. 805 (D. Md. 1933), and Clark v. Montezuma Transp. Co., 217 A.D. 172, 216 N.Y.S. 295 (App. Div. 1926)).\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\n\nThis Discussion has prompted many commentators to assert that the Jones Act applies to all American seamen regardless of all other circumstances of the case. See, e.g., LAW OF ADMIRALTY § 6-63, at 475-76 (\"American law will be applied in any personal injury or death case in which the action is brought by (or on behalf of) a citizen (or, in all probability, a long-term or permanent resident) of the United States. . . . American law applies to American citizens as well as to American 'domiciliaries' whether they serve on American-flag or foreign-flag ships and no matter where they may be injured. . . . There is no doubt that American harbor workers, repairmen and the like are also entitled to the application of American law.\"); Lewis E. Lamb III, Cruz v. Chesapeake Shipping, Inc.: Statutory Construction or Nonstatutory Choice of Laws--What Is the Proper Juristic Standard When International Political Objectives and Federal Law Intersect?, 17 N.C. J. INT'L L. \u0026 COM. REG. 339, 369 (1992); Symeonides, Maritime Conflicts, 7 MAR. LAW. at 237, 245; cf. Jack L. Albritton, Choice of Law in a Maritime Personal Injury Setting: The Domestic Jurisprudence, 43 LA. L. REV. 879, 910 (1983) (discussing cases); id. (predicting frequent application of American law).\n\nWe do not, however, go so far as to adopt a per se lex Americana rule for choice of law in Jones Act or unseaworthiness suits brought by injured Americans. Cf. Kenneth W. Dam, Extraterritoriality in an Age of Globalization: The Hartford Fire Case, 1993 SUP. CT. REV. 289, 315 (criticizing approach of Justice Souter's opinion in Hartford Fire Insurance Co. v. California, 125 L. Ed. 2d 612, 113 S. Ct. 2891 (1993), as effecting \"the certainty of absolutism, a Lex Americana\"). Nevertheless, while the Supreme Court has made clear that the Jones Act protects foreign as well as American seamen, the fact remains that American seamen were the subject of Congress's particular concern. See supra at 63-63; see also Bainbridge v. Merchants \u0026 Miners Transp. Co., 287 U.S. 278, 282, 53 S. Ct. 159, 160, 77 L. Ed. 302 (1932) (\"The Jones Act, being an addition to the Seamen's Act, was intended to be consistent with the spirit of that legislation, which was directed to promote the welfare of American seamen.\").\n\nThus, when evaluating the Lauritzen factors to decide whether an incident implicates sufficient American interests to justify applying American law, courts should consider claims brought by American seamen as manifesting by definition much of the necessary substantiality of connection.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e Hence, were there any doubt remaining that application of American law in this case is reasonable, plaintiff's American citizenship would eliminate them. In conjunction with the foregoing Discussion, the plaintiff's citizenship clearly demonstrates that the United States has more than enough interest in this incident for American law to apply.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\n\nh. Summary and Conclusion\n\nWhile the accident occurred in St. Lucian waters, one of the defendants found liable is a corporation organized under the laws of St. Lucia, and there was some evidence that the Long John was registered in St. Lucia, these circumstances are overshadowed in the Lauritzen choice of law analysis because the United States has an overriding interest in assuring adequate compensation for its injured seamen, the plaintiff is an American citizen, she was hired in the United States, and one of the defendants found liable was a United States corporation. Additionally, the Long John was built in America to American specifications, and the St. Lucian defendant derives the vast majority of its income from American tourists booked by an affiliated American co-defendant. The law of the flag carries virtually no significance here, for there was no evidence that the Long John actually flew any flag and the defendants did not provide the district court with information concerning the substance of St. Lucian law, absent which we cannot discern the contours of St. Lucia's interests in this case.\n\nUnder these circumstances, consideration of the Lauritzen factors amply shows that application of American law is reasonable. Indeed, compared to the American interests involved in Romero, 358 U.S. at 354, 79 S. Ct. at 468, where American law was found inapplicable, and those in Rhoditis, 398 U.S. at 306, 90 S. Ct. at 1731, where American law applied, see supra note, the American interests in this case easily suffice for American law to apply. This Conclusion is also borne out by consideration of the factors identified in the Restatement for use in the totality-of-the circumstances reasonableness inquiry, see id., as we explain in the margin.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e Accordingly, we hold that the district court correctly ruled that plaintiff was entitled to proceed under the Jones Act and general American maritime law.\n\nIV. THE MOLDING OF THE VERDICT\n\nA week after the jury returned its damage award, the district court molded the verdict to reflect the fact that the jury found plaintiff to be sixty percent comparatively negligent on the Jones Act count. Aside from her evidentiary sufficiency argument, plaintiff agrees that on the Jones Act claim she is entitled to recover (from either or both defendants) at most 40% of her total damages, i.e., $218,000. There is also no dispute (aside from the evidentiary contentions we have rejected) that plaintiff is entitled to recover an additional $11,700 maintenance award. However, plaintiff appeals the court's subsequent grant of the defendants' post-trial motion to further modify the verdict. What the district court did was to apply the Jones Act comparative negligence percentage to reduce the damage award on plaintiff's general maritime law unseaworthiness claim. Plaintiff maintains that on the unseaworthiness claim, she is entitled to recover from Holiday Village the full $545,000 damages found by the jury. She also submits that the defendants' Jones Act liability must be joint and several, rather than several only as the district court's order might be read to suggest. We agree with both of these contentions.\n\nIt is no longer contested by the parties that notions of comparative causation apply to both Jones Act claims and unseaworthiness claims brought under the general maritime law. See, e.g., 1B BENEDICT ON ADMIRALTY § 25 \u0026 cases cited therein (\"Whether an action is brought for Jones Act negligence or for unseaworthiness, the rule of comparative negligence applies.\"). Rather, the parties argue over whether the defendants ever raised or waived the defense of contributory causation as to the general maritime law claim, and whether, even if the defense was waived, the district court had independent authority to apply it.\n\nA. Waiver of Comparative Causation on the Unseaworthiness Claim\n\nIn each defendant's Answer and Affirmative Defenses to Plaintiff's Amended Complaint, and in the Amended versions thereof, in addition to alleging that plaintiff's injuries were entirely caused through her own fault, defendants aver as their second affirmative defense that\n\nif Defendants are liable to Plaintiff, the same being specifically denied, any liability is reduced by the comparative negligence of the plaintiff.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e\n\nThe district court ruled that comparative causation was not a defense to the unseaworthiness claims. While this ruling was erroneous, we hold that the defendants, by not objecting to the ruling, or to the jury charges implementing it, have waived the defense of comparative causation on the unseaworthiness claims.\n\nThe defendants concede that separate special verdict questions about the allocation of responsibility could have been submitted for each claim. Br. of Appellees/Cross Appellants at 13. Indeed they acknowledge that they did not request that the jury be given a special verdict form concerning the question of the proper allocation of causative fault on the unseaworthiness claim. They nevertheless insist that they did not need to, and that they did not waive the defense by failing to do so. Id. at 13, 15. More precisely, they argue as follows:\n\nThe jury was charged on contributory negligence and the jury answered a special verdict question on contributory negligence. There was therefore never any need or occasion for defendants to raise objections to the charge or to the verdict form.\n\nId. at 15.\n\nA careful reading of this argument reveals that the defendants avoid discussing the context in which the jury was charged and specially queried regarding contributory negligence. As plaintiff points out, the defendants do not deny that it was both sides' and the district court's intent not to present the jury with the question of comparative causation with respect to the unseaworthiness claim; nor do the defendants deny that they never objected to the verdict sheet or jury charge; nor did they request that the jury be asked any further clarifying questions after the verdict was returned. Reply Br. of Appellant/Cross-Appellee at 1; Br. of Appellant/Cross-Appellee at 12-13, 16-17.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e\n\nIn support of her waiver argument, Neely points out, and the defendants do not contest, that it is always the defense's burden to plead and prove a plaintiff's comparative fault under any theory of liability. Br. of Appellant/Cross-Appellee at 18 (citing Benson v. American Export Isbrandtsen Lines, Inc., 478 F.2d 152, 154 (3d Cir. 1973)). Having failed to present this issue to the jury, the defendants failed to meet their burden. This Conclusion is buttressed by the fact that counsel approved the special interrogatory form in its entirety without requesting that the specific issue of comparative causation on the unseaworthiness claim be presented.\n\nFinally, where a defendant fails to object to the form and language of special verdict forms or to the jury charges, before closing arguments or at the close of charging before the jury retires to deliberations, and the form had been submitted to counsel, objections are waived. See FED. R. CIV. P. 51; see also, e.g., Tose v. First Penn. Bank, N.A., 648 F.2d 879, 900 (3d Cir. 1981); Hoffman v. Sterling Drug, Inc., 485 F.2d 132, 138-39 (3d Cir. 1973); Callwood v. Callwood, 233 F.2d 784, 788 (3d Cir. 1956); Kopczynski v. The Jacqueline, 742 F.2d 555, 560 (9th Cir. 1984); Simien v. S.S. Kresge, Co., 566 F.2d 551, 555 (5th Cir. 1978); Murphy v. Overlakes Freight Corp., 177 F.2d 342, 343 (2d Cir. 1949).\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e Under these circumstances, we believe that the defendants have waived the defense of comparative causation as concerns the general maritime law unseaworthiness claim.\n\nThe defendants' response to plaintiff's waiver argument misses the mark. They concede that they \"did not and do not now object to the form or language of the special verdict questions,\" Br. of Appellees/Cross-Appellants at 16, which were first drafted by defense counsel. Nor do they argue that \"there was [any] impropriety or error in the form.\" Id. Instead, they maintain that\n\nthere was, in fact, no need to give any additional charges or pose any other special verdict questions. A separate question on contributory negligence with respect to the General Maritime claim was not necessary because the special verdict interrogatories 5, 6 and 7 were not worded in a manner that in any way implied that they were limited to plaintiff's Jones Act claim.\n\nId. at 15.\n\nWere defendants' description of the special verdict sheet accurate, we might be less quick to reject their contention that there was no waiver. However, as plaintiff quite persuasively argues in reply, \"the location of those questions, the heading under which they are set, . . . and the entire context of the Discussion and the intent of all parties is totally to the contrary.\" Reply Br. of Appellant/Cross-Appellee at 3; see also supra at 10-11 (discussing structure of verdict form).\n\nSearching for something to support their contentions, the defendants call our attention to a remark that the trial Judge made when discussing the charge with the parties after the verdict was returned: \"I told them quite specifically in the charge, when they got into the comparative negligence, don't worry about that, put the percentage down and we will figure it out.\" (App. at 475.) However, considering the relevant portions of the record, including the entire jury charge, we conclude that the trial Judge's statement on which the defendants rely clearly meant that the court would reduce any award--under the Jones Act claim only --by the amount of comparative negligence. Indeed, the district court explained to counsel:\n\nI put one damages question there obviously applying to both claims, and with the understanding that it would be molded according to the percentage, comparative percentage under the first [i.e., Jones Act] claim. Under the other [i.e., the unseaworthiness claim] it would stand tall on its own. . . . I think it was pretty clearly set forth to the jury, . . . under strict liability there is no . . . contrib [sic] reduction . . . .\n\n(App. at 473.) Moreover, based on our review of the entire charge given, we believe that this is the understanding that the trial court conveyed to the jury. The jury simply was not asked to determine the allocation of responsibility with respect to the unseaworthiness cause of action.\n\nThe defendants seek to minimize the significance of the verdict form and jury charge. In their submission, \"the common issue that led to molding the verdict was the degree to which plaintiff's negligence contributed to the accident.\" Reply \u0026 Principal Br. of Appellee/Cross-Appellant at 13. This is so, they maintain, because in both the Jones Act and the unseaworthiness claims, the defense of comparative causation involves \"the degree to which plaintiff's own negligence contributed to the injury.\" Id.\n\nThis argument overlooks an important point. The plaintiff's share of causal responsibility compared only to the defendants' allegedly negligent acts might be larger than the plaintiff's share compared only to the conditions that made the ship unseaworthy. The distinction stems in part from the different factual bases on which Jones Act and unseaworthiness liability were predicated at trial.\n\nPlaintiff's Jones Act claims were largely predicated on alleged improper procedures followed by the defendants and negligent acts in signalling her to enter the water. She alleged that the defendants improperly failed to train their scuba diving employees and that they never properly instructed their employees in the operation of the scuba diving vessel.\n\nHer general maritime law unseaworthiness claims, in contrast, were based upon many physical defects in the Long John. She alleged that the Long John lacked propeller guards and shrouds, that the vessel's propeller blades extended too far below the bottom of the Long John, that the ship lacked a warning device to signal when it was being put into reverse, that it lacked a rear operating station, and that it was configured in a fashion that would not allow the captain to see the divemaster from the (forward) operating station.\n\nThus, the causal elements that the jury considered in assessing responsibility under the Jones Act claims were in many respects different from those the jury considered with respect to the unseaworthiness claims. Moreover, since the parties to whom the jury explicitly allocated liability on the Jones Act claim (i.e., Club Med Management, Holiday Village, and Neely) differ from the sole party that the jury explicitly found liable on the unseaworthiness claim (Holiday Village), we agree with plaintiff that the defendants would have needed to submit a separate jury interrogatory about the allocation of responsibility under the general maritime law claim if they wanted to use comparative causation as a defense thereto. Br. of Appellant/Cross-Appellee at 27. Given this factor and the others already noted, combined with the fact that comparative causation is an affirmative defense, we conclude that the Jones Act comparative negligence percentage simply cannot apply directly to the unseaworthiness claim as a matter of law.\n\nIn sum, the defendants waived their comparative causation defense by not submitting it to the jury (and not objecting to the verdict sheet and charge, which both failed to present the defense to the jury). Therefore, we hold that the defendants were not entitled to assert this affirmative defense in a post-trial motion after the jury had been dismissed.\n\nB. Lack of Authority to Mold the Verdict\n\nWe must still consider whether, despite the waiver, the district court had authority to modify the verdict. The defendants argue that Federal Rule of Civil Procedure 49(a) so authorizes the district court. They rely on Fontenot v. Teledyne Movible Offshore, Inc., 714 F.2d 17 (5th Cir. 1983), for the proposition that a district court may apply a single contributory fault finding to both negligence and unseaworthiness claims. In the alternative, they argue that Rule 49(a) provides the district court with the discretion to make a particularized finding of contributory negligence with respect to the general maritime claim. For this proposition they rely on Kinnel v. Mid-Atlantic Mausoleums, Inc., 850 F.2d 958, 965-66 (3d Cir. 1988). We believe, however, that defendants' reliance on these cases is misplaced, and we hold that the district court possessed no such authority.\n\nIn Fontenot, the sole plaintiff had sued a single defendant, alleging both Jones Act negligence and general maritime unseaworthiness. The district court molded a verdict by applying Jones Act comparative negligence principles to the plaintiff's unseaworthiness claim, and the court of appeals affirmed. Although there was Fifth Circuit precedent stating that special interrogatories in cases alleging both Jones Act negligence and general maritime unseaworthiness should assign separate findings of contributory responsibility to the two causes of action, see Fontenot, 714 F.2d at 19 (citing Comeaux v. T.L. James \u0026 Co., 702 F.2d 1023, 1025 (5th Cir. 1983)), the court of appeals upheld the trial court's decision to apply the single comparative negligence finding to both causes of action.\n\nWhether or not we would accept the reasoning of Fontenot, the facts of that case are considerably different than the facts at bar. Fontenot involved a single set of liability allegations. See, e.g., id. at 20 (\"Neither party has made an effort on brief to distinguish the injury attributable to this accident from the injury attributable to the situation that gave rise to the accident.\"). And there was but one defendant, which was held liable on both legal theories (Jones Act negligence and general maritime law unseaworthiness). More significantly, in dramatic contrast to what transpired at trial here, in Fontenot \"neither the form of the interrogatories nor the court's accompanying instructions assigned contributory negligence to one cause of action or the other,\" id. at 19, and it does not appear that the trial court in Fontenot had previously ruled that the defendant was not entitled to a contributory fault defense on the unseaworthiness claim. Accordingly, even if we were to follow Fontenot, it would not help the defendants.\n\nNor can the defendants take succor from Kinnel, which holds that Rule 49(a) only permits trial courts to supply \"an omitted subsidiary finding.\" 850 F.2d at 965. Here, however, the defendants urge the permissibility of a trial court's entering a \"consistent supplementary finding.\" Reply \u0026 Principal Br. of Appellees/Cross-Appellants at 17. They maintain that Kinnel shows that Rule 49(a) allows the trial court to enter a consistent \"finding\" that Neely was sixty percent responsible for her injuries under the unseaworthiness claim.\n\nHowever, we explained in Kinnel that \"Rule 49(a) . . . was designed to have the [trial court] supply an omitted subsidiary finding which would complete the jury's determination or verdict.\" 850 F.2d at 965 (emphases supplied). Thus, Rule 49(a) might allow the district court to find the existence of an individual element of a misrepresentation claim where the properly charged jury had found the defendant guilty of misrepresentation, for such element was \"subsumed within\" that ultimate finding of liability. Id. Such elements would be necessary for, and therefore are subsumed within, a finding of liability.\n\nHere, in contrast, a \"finding\" that the plaintiff was partially responsible on the unseaworthiness claim is in no way essential to \"complete\" the factual finding that Holiday Village had provided an unseaworthy vessel that was a substantial cause of plaintiff's injuries. A plaintiff's comparative causation is a discrete affirmative defense (not subsumed under a defendant's unseaworthiness liability), and one that these defendants did not present at trial. Rather, by determining Neely's share of causative fault and liability on the general maritime claim, the district court here, like the trial court we reversed in Kinnel, appears instead to have \"in the absence of a jury verdict[] determined the ultimate liability of a party.\" Id.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e This it may not do.\n\nDefendant argues that the district court made no new findings, that it merely applied the jury's negligence allocations to the general maritime claim, and thus did not deprive plaintiff of the right to a jury trial on the issue of her comparative liability on the unseaworthiness claim. Reply \u0026 Principal Br. of Appellees/Cross-Appellants at 17. But we have held that the defendants waived this defense to the unseaworthiness cause of action, and this argument is simply a reformulation of their claim that the same legal standards and factual findings govern both the negligence and the unseaworthiness claims. As we have explained, this supposition is mistaken under the circumstances of this case. See supra at 75-77.\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e\n\nIn sum, we hold that the defendants waived the affirmative defense of comparative causation on the general maritime claim by not objecting to the district court's ruling on the defense, and by not objecting to the consequent special verdict form and charge. We further hold that the district court had no authority to determine for itself in this jury trial that Neely should be charged with any share of the liability under the unseaworthiness claim.\n\nC. Joint and Several Liability\n\nFinally, we agree with plaintiff that the defendants' liability on the Jones Act and maintenance claims is joint and several. The district court's order might be misread as treating the Jones Act liability as strictly several, in which case Club Med Management would be required to pay at most $163,500 on the Jones Act claim, and Holiday Village no more than $54,500.\n\nWe believe that this allocation is incorrect. On the Jones Act and maintenance claims, Club Med Management and Holiday Village were joint tortfeasors. As such, their liability under well established principles of law is joint and several. See, e.g., Simeon v. T. Smith \u0026 Son, Inc., 852 F.2d 1421, 1428-31 (5th Cir. 1988) (Jones Act liability is joint and several; Jones Act liability is joint with maritime negligence liability); id. at 1428 (citing joint liability admiralty cases); Self v. Great Lakes Dredge \u0026 Dock Co., 832 F.2d 1540, 1545-48 (11th Cir. 1987) (Jones Act tortfeasors jointly and severally liable); Joia v. Jo-Ja Service Corp., 817 F.2d 908, 915-18 (1st Cir. 1987) (same); cf. Edmonds v. Compagnie Generale Transatlantique, 443 U.S. 256, 261 n.8, 99 S. Ct. 2753, 2756 n.8, 61 L. Ed. 2d 521 (1979) (\"Under traditional tort law, a plaintiff obtaining a judgment against more than one concurrent tortfeasor may satisfy it against any one of them.\") (citing RESTATEMENT (SECOND) OF TORTS § 886).\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e\n\nThus, the plaintiff may recover her total $218,000 award on the Jones Act--Club Med Management's thirty percent share of her $545,000 damages plus Holiday Village's ten percent share--from either defendant. On the general maritime law claim, she may recover her full $545,000 damages, unreduced, from Holiday Village. She may also recover her $11,700 maintenance award from either defendant. In any event, no double recovery is authorized: the maximum amount that she may recover is $556,700, the sum of her damages and her maintenance and cure award.\n\nV. CONCLUSION\n\nFor the foregoing reasons, we will vacate the district court's order of January 26, 1993, and remand for further proceedings. On remand, the district court should enter judgment in favor of plaintiff on the Jones Act and maintenance claims in the amount of $229,700 jointly and severally against both defendants, of which $54,500 represents Holiday Village's share of liability on the Jones Act claim, $163,500 represents Club Med Management's share of Jones Act liability, and $11,700 represents the shared maintenance liability. The district court should enter judgment on the unseaworthiness claim in favor of plaintiff against Holiday Village in the full amount of $545,000. The maximum total judgment recoverable by plaintiff under these claims is $556,700.\n\nSLOVITER, Concurring.\n\nI join in all of the majority's opinion except for Part III. As to that, I concur in the holding that the district court correctly ruled that plaintiff was entitled to proceed under the Jones Act and general American maritime law.\n\nMy reluctance to join in Part III does not stem from disapproval of any particular language or factor that the majority uses in its remarkable exegesis of the issue of choice of law in Jones Act cases. Instead, I write separately because I believe that the steps that the majority imposes on the district courts, and of course on the lawyers who must present their respective positions to those courts, are simply too cumbersome to be workable. I believe that they are entitled to something more direct and straightforward from us, even at the risk that the analysis set forth in the opinion might not cover every case in the foreseeable future. After all, we will have other opportunities to return to this issue as new cases present new facts.\n\nAs I understand the majority opinion, a district court would have to perform the following choice-of-law analysis to determine if United States law applies. First, as a threshold inquiry, the district court must determine \"if there is a basis for prescriptive jurisdiction\" by ascertaining whether at least one of the following five factors is present: (1) injury to an American seaman or a seaman with American dependents; (2) injury in American territory; (3) American defendants; (4) an American flagged ship; (5) a contractual choice-of-law clause specifying American law. In connection with this threshold, the majority opinion refers to sections 402(2), 402(1)(a), 402(1)(c), and 502 of the Restatement (Third) of Foreign Relations Law as instructive.\n\nAt the second stage, the district court must ascertain whether application of American law is reasonable under the circumstances. Instead of proceeding to an application of the factors from the triad of Lauritzen v. Larsen, 345 U.S. 571, 97 L. Ed. 1254, 73 S. Ct. 921 (1953), Romero v. International Terminal Operating Co., 358 U.S. 354, 3 L. Ed. 2d 368, 79 S. Ct. 468 (1958), and Hellenic Lines Ltd. v. Rhoditis, 398 U.S. 306, 26 L. Ed. 2d 252, 90 S. Ct. 1731 (1970), as has been the practice of this court and the Supreme Court, the majority first sets forth an eight-factor test derived from section 403 of the Restatement (Third) on Foreign Relations requiring district courts to evaluate, inter alia, (a) the link of the activity to the territory of the regulating state, i.e., the extent to which the activity takes place within the territory, or has substantial, direct and foreseeable effect upon or in the territory; (b) the connections, such as nationality, residence, or economic activity, between the regulating state and the person principally responsible for the activity to be regulated, or between that state and those whom the regulation is designed to protect; (c) the character of the activity to be regulated, the importance of regulation to the regulating state, the extent to which other states regulate such activities, and the degree to which the desirability of such regulation is generally accepted; (d) the existence of justified expectations that might be protected or hurt by the regulation; (e) the importance of the regulation to the international political, legal, or economic system; (f) the extent to which regulation is consistent with the traditions of the international system; (g) the extent to which another state may have an interest in regulating the activity; and (h) the likelihood of conflict with regulation by another state. While there may be some overlap with elements of the Lauritzen factors, the inquiry required is different. Under this stage of the analysis, Romero and Rhoditis are to serve as \"benchmarks.\" Majority Typescript Op. at 43 n.19.\n\nIt is only after the majority engages in a lengthy explication of these presumably preliminary considerations, with its lengthy, albeit learned, commentary on numerous issues, including the complicated burden shifting with which the Dissent takes issue, does the majority analyze the circumstances of Neely's accident under the factors identified by the Supreme Court in Lauritzen /Romero /Rhoditis. It lists the Lauritzen factors in the following order: 1) inaccessibility of a foreign forum; 2) law of the forum; 3) place of the wrongful act; 4) place of contract; 5) law of the flag; 6) defendants' allegiance, bases of operations and other contacts with the United States; and 7) domicile or allegiance of injured seaman.\n\nI fail to see any justification for adding layers of complexity to the Lauritzen inquiry which already had sufficient flexibility to take into account additional factors when needed or to permit adaption of the listed factors, when appropriate. In fact, in its own analysis of the Lauritzen factors the majority uses that flexibility to take into consideration the fact that Neely was involved in a \"nontraditional\" maritime activity, employed as a scuba instructor at the exclusive Club Med resort rather than as a seaman engaged in international shipping.\n\nI can glean only two possible explanations within the majority's opinion for its having added the additional layers. One appears to be the majority's concern about \"the lack of guidance\" provided by the Supreme Court in its opinions. The majority notes that a trial court in Texas was \"troubled\" and \"academic commentary has been similarly critical\" of the flexibility of the Lauritzen factors. See Majority Typescript Op. at 32. However, Justice Douglas emphasized in Rhoditis that the Lauritzen factors were \"not intended as exhaustive.\" 398 U.S. at 309. The Supreme Court apparently intended just that flexibility that the majority seeks to curb.\n\nThe other basis for the majority's bifurcated inquiry may be to ensure that exercising prescriptive jurisdiction over the claim does not offend due process. Later in the opinion the majority refers to our earlier opinion in De Mateos v. Texaco, Inc., 562 F.2d 895, 901 (3d Cir. 1977), cert. denied, 435 U.S. 904, 55 L. Ed. 2d 494, 98 S. Ct. 1449 (1978), where we stated, \"The underlying purpose for identifying and weighing factors is . . . to determine whether within the limits of due process [the Jones] Act could, and within the limits of the assumed congressional deference to the conventions of international law [the Jones] Act should, be applied to the transaction in question.\".\n\nWhile I do not discount the need to assure that the contacts with United States interests are sufficiently substantial to warrant application of United States law, particularly because such questions intersect with concerns of foreign nations and their nationals, I believe that such assurance is afforded by application of the flexible Lauritzen factors. If a balancing of the Lauritzen factors in the persuasive manner employed by the majority opinion leads to a Conclusion that application of United States law is reasonable, I think it is inevitable that such application will comport with due process. Indeed, that may be true because many of the factors the majority enunciates in its bifurcated analysis are already included among the Lauritzen factors. Many of the additional factors discussed by the majority in its threshold and second step inquiries can appropriately be weighed among or in addition to the Lauritzen factors in a given case without imposition of its formalistic and multifaceted inquiries. These include some of the factors listed in the Restatement (Third) of Foreign Relations, to the extent relevant to the ultimate question whether application of United States law is reasonable.\n\nInasmuch as I believe that the Jones Act cases decided by the Supreme Court already provide a workable set of non-exhaustive factors capable of responsible implementation through the sound exercise of judgment by the district court, with review by the appellate courts, I find the imposition of yet additional tests and lists of factors superfluous for the question at hand. I would focus primarily on the Lauritzen factors, as does the Dissent.\n\nHowever, I do not join the Dissent because I am satisfied that Neely met her burden of demonstrating the substantiality of relevant factors such that United States law might reasonably apply to this suit. The issue of the weighing of the factors in this case is a close one, and I have little to add to the respective analyses. As the district court recognized, the instruction of the Supreme Court in Lauritzen was that it is a \"venerable and universal rule of maritime law\" to give \"cardinal importance to the law of the flag,\" 345 U.S. at 584, and that \"the weight given to the ensign overbears most other connecting events in determining applicable law.\" Id. at 585. Although the district court initially found that \"the diving vessel flies the flag of St. Lucia,\" after considering plaintiff's allegations the court concluded that there were \"serious questions\" whether the diving vessel flew a \"flag of convenience,\" and chose to treat the law of the flag as a neutral factor.\n\nAs I suggested above, I believe the majority's Lauritzen weighing is more compelling than that of the Dissent.\n\nIndeed, I believe that the district court, notwithstanding its confusion of the issue of subject matter jurisdiction and choice of law under the Lauritzen inquiry, gave appropriate weight to the factors upon which there was sufficient evidence and treated those as neutral upon which there was insufficient evidence to render an informed Conclusion. Plaintiff does bear the ultimate burden of proving which law should apply, but I believe that there are sufficient factors that tilt toward United States law, as both the majority and the district court concluded, to make application of that law reasonable. Thus I concur in that holding.\n\nCOWEN, Circuit Judge, Concurring and Dissenting.\n\nI concur with the result reached in part II of the majority opinion. However, because the majority has muddied the waters by creating a new choice-of-law test that rejects binding Supreme Court precedent,\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e and has consequently improperly balanced the Lauritzen\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e factors, I am compelled to Dissent from part III of the opinion. Because of my Conclusion that United States\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e law does not apply to this controversy, I find it unnecessary to discuss the issue raised in part IV of the majority opinion. Nonetheless, were I required to reach the issue of the molding of the verdict, I would concur with the majority.\n\nPart I of my Dissent will focus on how the majority has misapplied Lauritzen and, in so doing, has shifted the burden to the defendants to prove that United States law does not apply. Part II of my Dissent will discuss and apply the proper balancing approach and burden of proof as set forth in Lauritzen and show that the majority's Conclusion that United States law applies can be reached only by redrafting the Lauritzen balancing test.\n\nI.\n\nThe majority begins part II by correctly noting that a maritime choice-of-law controversy must be resolved by examining the eight factor test as set forth, reiterated, and expanded in the Lauritzen triad. Maj. op. at __ [Typescript at 13-14]. It then recognizes that a plaintiff suing under United States law must \"establish the applicability of the law under which the case was brought,\" Maj. op. at __ [Typescript at 28], that is, it is the plaintiff's burden to prove that United States law should govern this maritime controversy. The majority, according to the mandate of the Lauritzen triad, should next have turned to the eight factors and conducted a balancing inquiry to determine whether the plaintiff has proven that United States law applies. See Discussion infra part II.\n\nHowever, before arriving at the balancing inquiry, the majority, apparently not content with the law in its current state, decides to treat Lauritzen merely as persuasive authority and proceeds to create a new test to govern maritime choice-of-law disputes. Instead of applying the eight factor test as set forth in Lauritzen, the majority veers off course and employs a two-step analysis. In the first step, only four of the eight factors from Lauritzen are analyzed: domicile of the injured seaman, place of the injury, allegiance/domicile of the defendant, and law of the flag. A fifth factor, a contractual choice-of-law clause, which is a factor not present in Lauritzen, is also considered under the majority-created test. After analyzing half of the Lauritzen factors in step one, if any of the factors are present, the majority then proceeds to step two of the analysis. In step two, the court must now consider all eight factors in order to determine whether the application of United States law would be reasonable. Maj. op. at __ [Typescript at 33].\n\nI have searched the Lauritzen triad in vain and have been unable to locate in any of the opinions where the Supreme Court states or even implies that a two-step inquiry, such as the one utilized by the majority, should be undertaken. I must conclude, therefore, that Lauritzen does not contain any such test and the majority is acting beyond the scope of Lauritzen. The majority acknowledges, as it must, the lack of authority for its proposed two-step reasonableness inquiry. In an attempt to garner support for its position, the majority relies on the Restatement (Third) of Foreign Relations Law. Maj. op. at __ n.14 [Typescript at 36 n.16] (stating that \"relying on current versions of the Restatement to interpret both general maritime law and the Jones Act -- even though it was adopted long after the Supreme Court announced the Lauritzen factors -- is permissible\"). I do not agree that such reliance is appropriate.\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e\n\nFirst, although an earlier version of the Restatement of Foreign Relations Law was available to the Supreme Court when it wrote Romero v. International Terminal Operating Co., 358 U.S. 354, 79 S. Ct. 468, 3 L. Ed. 2d 368 (1959) and Hellenic Lines Limited v. Rhoditis, 398 U.S. 306, 90 S. Ct. 1731, 26 L. Ed. 2d 252 (1970), the Supreme Court did not rely on this source.\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e Second, a close reading of the Introductory Note to the Restatement sections relied upon by the majority indicates that sections 402 and 403 were not meant to apply in a tort case such as this. The Introductory Note to the subchapter in which these provisions appear states:\n\nIn a number of contexts the question of jurisdiction to prescribe resembles questions traditionally explored under the heading of conflict of laws or private international law. This chapter, however, concentrates on so-called public law -- tax, antitrust, securities regulation, labor law, and similar legislation. The issues addressed may arise in private litigation, but the rules stated in this chapter do not necessarily apply to controversies unrelated to public law issues.\n\n1 Restatement (Third) of the Foreign Relations Law of the United States 237 (1987) (emphasis added). Third, such wholesale judicial activism should be discouraged, especially where the Supreme Court has already adequately detailed the proper approach to resolve such controversies.\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e\n\nGiven that the Supreme Court has already created a suitable test for governing maritime choice-of-law disputes, I question why the majority deems it necessary to create a new test. Apparently, the majority adopts this approach to effectuate a shift in the burden of proof: rather than require the plaintiff to prove that the factors weigh in favor of the application of United States law, the majority forces the defendants to show that United States law does not apply. Maj. op. at __ [Typescript at 45] (\"Once the plaintiff has established the existence of [one of the five factors from part one of the two step test] . . ., it is incumbent upon defendants to prove the existence of foreign contacts.\"). Only by shifting the burden of proof can the majority reach its desired result -- the application of United States law.\n\nThe majority itself notes the inherent weakness of this burden shift. The majority concedes that the plaintiff must prove that United States law applies. Maj. op. at __, __ [Typescript at 28, 43]. Moreover, the majority admits that its holding is not supported by established precedent. Maj. op. at __ [Typescript at 43] (\"While there is a dearth of precedent concerning the scope of the plaintiff's burdens when the defendant invokes the Lauritzen triad, logic dictates that plaintiff need adduce evidence concerning only those factors that he or she believes support the reasonableness of applying American law.\") (emphasis added). I disagree. Both precedent and logic dictate that we not deviate from Lauritzen. By placing the burden on the defendants to prove that United States law should not apply, the majority has broadened the scope and applicability of the Jones Act despite a concerted effort on part of the Supreme Court in Lauritzen to restrict its scope. See generally Maj. op. at __ [Typescript at 29-30] (explaining that the Supreme Court created the balancing test in Lauritzen in order to limit the scope of the Jones Act).\n\nUnder the majority's holding, if the plaintiff proves she is a United States citizen (or she has United States dependents or she was injured in United States territory or the defendants were domiciled in America or the vessel flew a United States flag or a contractual choice-of-law clause specifying United States law existed) and the defendants fail to prove any of the eight factors, then United States law will always apply. The majority has adopted a broad reading of the Jones Act, a reading that the Supreme Court frowned upon in Lauritzen. See Lauritzen, 345 U.S. at 576-78, 73 S. Ct. at 925-26. The rule of law handed down today has the following practical effect: so long as the injured plaintiff is a United States citizen, he or she will almost always have the benefit of suing under the Jones Act, Lauritzen notwithstanding.\n\nIn order for United States law to apply, Lauritzen requires that the factors weigh in favor of application of United States law. Thus, under the Lauritzen test, the plaintiff must prove that a simple majority or preponderance of the factors weighs in favor of United States law.\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e In shifting the burden of proof to the defendants, the majority goes a long way towards ensuring that \"all seamen\" who are injured will be able to proceed under United States law.\n\nTo further ensure this result, the majority also substantially increases the burden on the defendants. Not yet content with the stacked deck employed against the defendant, the majority, in addition to requiring the defendant to bear the new burden of showing that the balancing weighs in favor of foreign law, also requires the defendant to prove that the application of United States law is \"unreasonable.\" Lauritzen has no such reasonableness requirement. As a result of the majority's analysis, even if the defendants were to prove that more of the factors weigh in favor of the application of foreign law, the court would still have to apply United States law unless the defendants also show that the application of United States law is unreasonable. See Maj. op. at __ [Typescript at 50] (\"Unless virtually all of the Lauritzen factors point away from the United States, application of American law will be reasonable . . . .\"). Clearly, it will always be more difficult if not impossible to prove that the application of United States law is unreasonable as opposed to simply proving that the balancing weighs against the application of United States law. Stated differently, even if the balancing weighs against the application of United States law, it is not necessarily the case that the application of United States law would be unreasonable. Whereas the burden shift made it extremely likely that United States law would apply, the heightening of the burden makes the application of United States law almost inevitable. Indeed, rare will be the case under the majority's analysis where United States law does not apply.\u003cspan class=\"fnref\"\u003e50\u003c/span\u003e\n\nThe majority has adopted a reasonableness standard which has shifted the burden of proving that United States law applies from the plaintiff to the defendant and has come dangerously close to creating a per se rule that the Jones Act applies to all United States seamen. In contrast, Lauritzen does not require the defendant to prove that foreign law applies nor does it require the defendant to prove that the application of United States law would be unreasonable; Lauritzen requires the plaintiff to prove that United States law applies.\n\nII.\n\nInasmuch as the majority rejects Lauritzen, the balancing portion of the majority opinion is necessarily wrong because it improperly shifts and heightens the burden of proof, thus making it more likely for the factors to point towards the application of United States law. The majority compounds this error by attributing too much significance to some of the factors and additionally downplaying the importance of some of the historically recognized significant factors.\n\nAs mentioned previously, the eight factors to be considered in Jones Act and maritime choice-of-law disputes are (1) law of the flag; (2) shipowner's base of operations; (3) allegiance of the defendant shipowner; (4) inaccessibility of a foreign forum; (5) place of the wrongful act; (6) place of the employment contract; (7) allegiance or domicile of the injured party; and (8) law of the forum. Lauritzen, 345 U.S. 583-92, 73 S. Ct. at 928-33; Rhoditis, 398 U.S. at 308-09, 90 S. Ct. at 1733-34. I now turn to a proper analysis of those factors.\n\n1. Law of the Flag\n\nThe nationality of the vessel's flag is the single most important factor in the Jones Act choice-of-law analysis. The Supreme Court stated in Lauritzen that \"the most venerable and universal rule of maritime law relevant to our problem is that which gives cardinal importance to the law of the flag.\" 345 U.S. at 584, 73 S. Ct. at 929. With respect to this factor, the district court found that \"the diving vessel flies the flag of St. Lucia.\" Neely v. Club Med Sales, Inc., No. 91-7416, 1992 WL 398378, at * 3 (E.D. Pa. Dec. 31, 1992). Neely maintains that there was no evidence presented before or during trial to establish that the vessel Long John actually flies the flag of St. Lucia. However, the defendants point out that the finding of the district court was based on the pre-trial declaration of vessel owner, Joseph LeMaire (\"LeMaire\"), which was submitted in support of his successful motion to dismiss the third-party complaint against him. LeMaire stated that the Long John is registered in St. Lucia, and his sworn declaration has not been contradicted.\n\nDefendants argue that registration of a vessel in a particular country is equivalent to \"flagging\" the vessel. Although no authority explicitly states that registration and flagging a vessel are one and the same, there is authority which indicates that \"[a] ship navigating the seas may sail only under the flag of the nation in which it is registered . . . .\" 1 Thomas J. Schoenbaum, Admiralty and Maritime Law § 2-21, at 46 n.1 (2d ed. 1994) (citation omitted). Thus, since the Long John was registered in St. Lucia, it was required to fly a St. Lucian flag.\n\nBecause the plaintiff bears the burden of proving the flag as well as law of the flag, cf. Maj. op. at __ [Typescript at 58], it would even be insufficient if Neely proved that the Long John was not flying a St. Lucian flag. The plaintiff still has the additional hurdle of proving that the vessel was flying a United States flag in order for this factor to weigh in favor applying United States law. Since the only evidence pertaining to law of the flag adduced in the district court indicates that the vessel was a St. Lucian flagged vessel, I conclude that this factor weighs heavily against applying United States law to this controversy.\n\nThe majority maintains that the law of the flag is less important in non-traditional maritime contexts and concludes that the vessel Long John was involved in a non-traditional maritime activity. Maj. op. at __ [Typescript at 56-57]. In support of this proposition, it relies on a number of cases from other courts of appeals which hold that law of the flag should not be given controlling weight when dealing with a vessel engaged in nontraditional maritime activity. See Zipfel v. Halliburton Co., 832 F.2d 1477, 1483 (9th Cir. 1987) (law of the flag accorded less weight when vessel was a floating oil drilling rig which \"was unable to move under its own power, had to be towed by other vessels when moved, and had remained for long periods of time prior to the accident at only a few drilling locations\");\u003cspan class=\"fnref\"\u003e51\u003c/span\u003e Cuevas v. Reading \u0026 Bates Corp., 770 F.2d 1371, 1373, 1379 (5th Cir. 1985) (same, involving a semi-stationary, jack-up drilling ship); Koke v. Phillips Petroleum Co., 730 F.2d 211, 213, 219 (5th Cir. 1984) (same, concerning a semi-submersible platform that: rested on columns attached to floatation chambers; performed its work while anchored; and although it could move under its own power, was towed to its current location and remained there for a year before the incident). The majority has unhesitatingly adopted the reasoning set forth in the aforementioned cases while failing to ask whether the vessel Long John (\"a sixteen metric ton vessel capable of plying the high seas,\" Maj. op. at __ [Typescript at 54]), was engaged in activity more akin to a floating/semi-submersible/semi-stationary oil drilling rig or more akin to an ocean-going vessel. It borders on the incredible to suggest that this case which involves an ocean-going marine craft should be governed by cases which involve semi-stationary oil drilling rigs.\n\nIn support of its assertion that the Long John was engaged in non-traditional maritime activity, the majority also notes that the Long John maneuvered from \"beach to reef,\" and not from \"sea to sea.\" Maj. op. at __ [Typescript at 52]. I am intrigued by the new \"sea to sea\"\"beach to reef\" dichotomy created by the majority, because it is the clearest indication of how the majority has misapplied the Lauritzen test in arriving at its result that American law should be applied to this controversy. The majority must acknowledge that the cases upon which it relies to downplay the importance of the law of the flag factor do not involve vessels that travel from \"beach to reef.\" Rather, those cases involve vessels that are engaged in activity so far removed from any shipping context that it defies reality to even refer to them as vessels or to consider their activity maritime in nature. Thus, to complete the majority's analogy, we must not only consider \"sea to sea\" and \"beach to reef,\" but we must also consider \"oil drilling platforms.\"\u003cspan class=\"fnref\"\u003e52\u003c/span\u003e The majority implicitly holds that the law of the flag factor should be accorded little or no weight because the vessel Long John engaged in activity more analogous to that of an oil drilling platform. I cannot agree.\n\nFurther, I am puzzled by the majority's Conclusion that the vessel Long John was engaged in non-traditional maritime activity in light of the majority's earlier assertions to the contrary. In assessing whether jurisdiction existed in the district court to entertain this suit, the majority notes that the accident involving Neely and the Long John \"is the kind of incident that has a potentially disruptive impact on maritime commerce.\" Maj. op. at __ [typescript at 25] quoting Jerome B. Grubart, Inc. v. Great Lakes Dredge \u0026 Dock Co., __ U.S. __, __, 130 L. Ed. 2d 1024, 115 S. Ct. 1043, 1051 (1995). Next, the majority concludes that although the Long John made voyages of relatively short distances, nonetheless, \"the general character of the activity giving rise to the [accident] shows a substantial relationship to traditional maritime activity.\" Maj. op. at __, [typescript at 25-26] (quoting Grubart, __ U.S. at __, 115 S. Ct. at 1051). See also Grubart, __ U.S. at __, 115 S. Ct. at 1052 (\"The substantial relationship test is satisfied when at least one alleged tortfeasor was engaging in activity substantially related to traditional maritime activity.\"). Because the majority adopts inconsistent positions when discussing the traditional or nontraditional character of the activity in which the Long John was engaged, I find no reason to downplay the importance of law of the flag in this case.\n\nThe majority concedes that plaintiff has failed to prove that the Long John flies a United States flag. Maj. op. at __ [Typescript at 57]. Nonetheless, the majority concludes that this factor does not subtract from the plaintiff's argument because the defendants failed to prove what flag the Long John flew. As stated above, I believe there is ample, credible, uncontradicted evidence to suggest that the Long John was a St. Lucian flagged vessel. Moreover, the district court made a specific factual finding that the Long John flies the flag of St. Lucia, see Neely, 1992 WL 398378, at * 3, and this finding cannot be disturbed unless it is clearly erroneous.\u003cspan class=\"fnref\"\u003e53\u003c/span\u003e In addition, because the plaintiff must prove that United States law applies, see Discussion supra part I, the majority is incorrect in concluding that this factor is insignificant and should be accorded little weight.\n\n2. Shipowner's Base of Operations\n\nThe district court, looking at the base of operations of the shipowner, LeMaire, concluded that this factor was unclear, and thus favored neither the application of United States nor St. Lucian law. Neely, 1992 WL 398378, at * 3. Plaintiff argues, and the record supports the Conclusion, that Holiday Village chartered this vessel from the actual shipowner in a manner consistent with a bareboat or demise charter. Appellant/Cross-Appellee's Reply/Answering Brief at 40-47. A \"bareboat\" charter or \"demise\" charter exists whenever the:\n\nvessel is chartered or \"leased\" to another who takes possession, custody and control of the vessel. The master is hired and paid by the charterer and becomes the agent and representative of the charterer. The operating expenses of the vessel, such as wages, fuel, subsistence, wharfage charges, etc., are paid by the charterer. The owner surrenders entire control and possession of the vessel and subsequent control over its navigation to the bareboat charterer, who becomes the owner pro hac vice.\n\n2 Martin J. Norris, The Law of Seamen § 30:14, at 372 (4th ed. 1985). Thus, by contracting a demise charter with the actual shipowner, Holiday Village became the owner pro hac vice of the Long John.\u003cspan class=\"fnref\"\u003e54\u003c/span\u003e Since we look to Holiday Village (a St. Lucian corporation), rather than LeMaire of Miami, as the owner of the vessel, I would hold that this factor weighs in favor of applying St. Lucian law and against applying United States law.\n\nRelying on Fogleman v. ARAMCO, 920 F.2d 278 (5th Cir. 1991), the majority contends that this is not a traditional shipping case and therefore, we should not look to the base of operations of the defendant shipowner, but rather to that of the defendant employer. Maj. op. at __ [Typescript at 59] (\"We must consider the . . . bases of operations of both Holiday Village and Club Med Management.\") (emphasis in original). In that case, involving personal injuries sustained on a fixed oil platform, the Court of Appeals for the Fifth Circuit held that the significance of each Lauritzen factor may vary in a non-traditional shipping case. Fogleman, 920 F.2d at 282. First, the majority analogizes this case to one involving an offshore oil rig or work platform. To the extent that the majority's argument relies on the notion that the Long John was engaged in activity more analogous to that of an oil rig rather than an ocean-going vessel, it must again fail. Second, in Fogleman, the Court of Appeals for the Fifth Circuit held that:\n\nParticularly when non-traditional maritime activities with relatively permanently based vessels are involved, \"it is the base from which the rig is operated on a day-to-day basis rather than the base of operations of the corporate or ultimate owner of the rig which is important for choice of law purposes.\" We look to the location of the day-to-day operations even when the employer is a wholly-owned subsidiary of an American corporation, so long as the foreign subsidiary was not formed specifically to evade obligations of the parent corporation under American law.\n\nFogleman, 920 F.2d at 284 (citations and footnotes omitted).\u003cspan class=\"fnref\"\u003e55\u003c/span\u003e Thus, even if we were to follow the reasoning of Fogleman, it mandates that we should look to St. Lucia (the base from which the vessel is operated on a day-to-day basis), rather than to New York (the base of operations of Club Med Management).\n\nThe majority concedes that the Long John was operated exclusively in St. Lucia and that Holiday Village is a St. Lucian corporation. Predictably, however, the majority concludes that this factor only weakly favors the application of St. Lucian law. Instead it argues that we should look to the activity of Club Med Management and Club Med Sales. However, any activity conducted by Club Med Sales is irrelevant to this dispute because it was never determined to be an employer of Neely.\u003cspan class=\"fnref\"\u003e56\u003c/span\u003e Even if we were to examine the activities of Club Med Management because it was found by the jury to be Neely's employer, we should not ignore St. Lucia's paramount interest in having its law applied to this controversy.\n\n3. Allegiance of the Defendant Shipowner\n\nThe district court made no definitive finding as to the allegiance of the defendant shipowner. Because the Long John was the subject of a demise charter to Holiday Village, and Holiday Village is the owner pro hac vice of the vessel, the allegiance or domicile of Holiday Village controls. Holiday Village's allegiance is to St. Lucia. For the reasons stated above, see supra part II.2., this factor also weighs against applying United States law and points to the application of St. Lucian law.\n\n4. Inaccessibility of a Foreign Forum\n\nPlaintiff argues that St. Lucia is an inaccessible forum because she is in no financial position to travel to St. Lucia, hire St. Lucian counsel, and pursue an action against the defendants in the St. Lucian courts. Additionally, she claims that St. Lucia is an inconvenient forum. Similar to Neely, the plaintiff in Rodriguez v. Flota Mercante Grancolombiana, S.A., 703 F.2d 1069 (9th Cir.), cert. denied, 464 U.S. 820, 104 S. Ct. 84, 78 L. Ed. 2d 94 (1983), argued that a foreign forum was not convenient to him because his physicians and medical records were in the United States and because he had retained United States counsel who would not represent him in Colombia. Id. at 1075 n.3. The Court of Appeals for the Ninth Circuit, in rejecting the plaintiff's argument, stated:\n\nConvenience of the witnesses and attorney are not factors cited by the Court in Lauritzen and Rhoditis as determinators of the Jones Act jurisdiction. Although these factors \"might be a persuasive argument for exercising a discretionary jurisdiction to adJudge a controversy . . . it is not persuasive as to the law by which it shall be Judged.\" Lauritzen, 345 U.S. at 589-90, 73 S. Ct. at 931-932. Thus, the costs and loss of time entailed in deposing the medical witnesses and sending the records and the American attorney to . . . [a foreign forum] while relevant to the issue of forum non conveniens are not relevant factors in determining whether [United States law should be applied].\n\nId.\n\nI agree with the Court of Appeals for the Ninth Circuit that the Supreme Court in Lauritzen did not intend the \"inaccessibility of a foreign forum\" factor to require a forum non conveniens analysis. The Supreme Court in Lauritzen rejected the argument \"that Justice requires adjudication under American law to save seamen expense and loss of time in returning to a foreign forum.\" 345 U.S. at 589, 73 S. Ct. at 932. Lauritzen indicates that inaccessibility of the forum and forum non conveniens are two separate and distinct matters. Therefore, discounting any claim of inconvenience by Neely in bringing this suit in a foreign forum, it is not clear why a forum in St. Lucia would be inappropriate. Neely has offered no credible evidence to indicate that St. Lucia will not entertain such a suit or that there are other barriers to her being heard in that jurisdiction.\u003cspan class=\"fnref\"\u003e57\u003c/span\u003e\n\nThe majority treats this factor as neutral, \"especially . . . because the defendants have presented the court with no information about what remedies St. Lucian law might . . . offer the plaintiff.\" Maj. op. at __ [Typescript at 50]. When one recognizes the fallacy of assigning the burden to the defendant, the majority's argument does not hold water. Because plaintiff bears the burden of proof, this factor weighs against applying United States law to this dispute.\n\n5. Place of the Wrongful Act\n\nPlaintiff concedes that the accident took place within two-hundred meters of the St. Lucian shoreline. This factor, therefore, favors application of St. Lucian law rather than United States law. However, Neely contends that this factor should be accorded little weight because of the fortuity of the sailing vessel being in the particular place where the accident occurred. Indeed, in Lauritzen, the Supreme Court stated that, \"the test of location of the wrongful act or omission, however sufficient for torts ashore, is of limited application to shipboard torts, because of the varieties of legal authority over waters she may navigate.\" Lauritzen, 345 U.S. at 583, 73 S. Ct. at 929.\n\nNormally, the place of accident might well be fortuitous. Here, however, the vessel was chartered by Holiday Village to be used specifically by diving parties in and around St. Lucia. St. Lucia has set its territorial waters at a breath of 12 nautical miles. 6B Benedict on Admiralty Doc. 10-3A, at 10-62, 10-62.2 (Frank L. Wiswall, Jr., ed., 6th ed. 1994). Rarely, if ever, during its demise charter did the Long John leave the territorial waters of St. Lucia. It is true that the vessel had the capability of traveling vast distances, and even worldwide. However, when analyzing whether the location of the accident in St. Lucian waters was fortuitous, it becomes clear that if the vessel never left the territorial waters, then an accident in St. Lucian waters was not simply by chance. In fact, anyone sailing aboard the Long John, whether as crew or otherwise, would reasonably conclude (as occurred in this case), that any accident would occur in the territorial waters of St. Lucia. This factor weighs strongly in favor of applying St. Lucian law to this dispute.\n\nThe majority agrees with this analysis, but concludes that \"this factor does not strongly suggest that application of American law would not be reasonable.\" Maj. op. at __ [Typescript at 54-55]. Notwithstanding the fact that this accident occurred in, and could only have occurred in, St. Lucian waters, the majority seeks to minimize the impact of this important factor. It asserts that even though the accident occurred in St. Lucian waters, St. Lucia's regulatory interests are undefined, and this Conclusion does not point toward application of St. Lucian law. Again, this reasoning contradicts an earlier portion of the majority opinion where it concluded the accident involving Neely and the Long John \"is the kind of incident that has a potentially disruptive impact on maritime commerce.\" Maj. op. at __ [typescript at 25] quoting Jerome B. Grubart, Inc. v. Great Lakes Dredge \u0026 Dock Co., __ U.S. __, __, 130 L. Ed. 2d 1024, 115 S. Ct. 1043, 1051 (1995). Clearly, in a situation where an accident occurs within two-hundred meters of the St. Lucian coastline, we need not be familiar with the complexities of St. Lucian law in order to conclude that St. Lucia has an interest in preventing or investigating any accident which may have a detrimental effect on maritime commerce in its territorial waters. Because the place of wrongful act was not fortuitous, and St. Lucia has a cognizable interest in accidents which occur off its shores, this factor weighs strongly against applying United States law to this controversy.\n\n6. Place of Employment Contract\n\nThe district court made a factual finding that the oral employment contract entered into between Club Med and Neely, by virtue of a phone call from Club Med's offices in New York to Neely's residence in Pennsylvania, was situated in Pennsylvania. Neely, 1992 WL 398378, at * 4. Defendants do not challenge the district court's finding as clearly erroneous, but instead argue that the factor should be given diminished weight since the employment services were to be performed outside the United States. The Supreme Court in Lauritzen has explained that, \"the place of contracting in this instance, as is usual to such contracts, was fortuitous . . . . We do not think the place of contract is a substantial influence in the choice between competing laws to govern a maritime tort.\" Lauritzen, 345 U.S. at 588-89, 73 S. Ct. at 931-32.\n\nThe majority maintains, notwithstanding the language in Lauritzen, the place of contract takes on heightened significance in the context of non-traditional maritime employment. While I agree that the situation at hand is not the same type of employment arrangement contemplated by the Court in Lauritzen, I do so for different reasons.\n\nBecause I do not consider Neely's employment situation to be non-traditional in nature, I do not believe that this factor should be accorded additional significance, but rather, it should be treated with the same weight as the other factors. I acknowledge that there is less fortuity in the place of contracting here simply because hiring Neely was not an unforeseen contingency like that alluded to in Lauritzen. However, the vessel on which Neely worked was akin to an ocean-going vessel, thus putting her in the realm of traditional maritime activity. See Discussion supra part II.1. Additionally, Neely was paid in a similar manner to the traditional ocean-travelling maritime worker -- room and board provided by the employer.\n\n7. Allegiance or Domicile of the Injured Party\n\nNeely is a United States citizen who lived permanently in Pennsylvania until she was hired by Club Med. She returned immediately to the United States for medical attention and rehabilitation after the accident. Thus, this factor clearly weighs in favor of applying United States law. However, because I do not believe that this case involves a non-traditional shipping context, I believe that this factor should be accorded normal significance. To the extent that the majority relies on language in the Jones Act and its amendments (which refers to \"American seaman\") to support its proposition that this factor takes on heightened significance here, the majority is simply engaging in double counting of the factors. The Supreme Court in Lauritzen already contemplated situations where seamen are of differing national origins. If the plaintiff is a United States seaman, this factor weighs towards applying United States law and if the plaintiff is not a United States citizen/domiciliary, this factor points towards applying some other law. It is unclear why the majority thinks that this factor should carry more weight in addition to that already provided for by the Supreme Court. The majority, despite its assertions to the contrary, comes exceedingly close to creating a per se lex Americana rule (United States law always applies to injured United States seaman).\u003cspan class=\"fnref\"\u003e58\u003c/span\u003e\n\n8. Law of the Forum\n\nThe district court found that the law of the forum factor did not weigh in favor of either the United States or St. Lucia, Neely, 1992 WL 398378, at * 4, and neither party contends on appeal to the contrary. In discussing the relevance of the law of the forum factor in a maritime choice-of-law dispute, the Supreme Court noted that \"because a law of the forum is applied to plaintiffs who voluntarily submit themselves to it is no argument for imposing the law of the forum upon those who do not.\" Lauritzen, 345 U.S. at 591-92, 73 S. Ct. at 933. A close reading of Lauritzen indicates that the Supreme Court did not think this a relevant factor to consider when a defendant is haled into court against his will and involuntarily subjected to the law of that forum. The majority, in analyzing this factor, cites language from Lauritzen that states the forum available should not dictate the substantive law to be applied. Maj. op. at __ [Typescript at 51] (quoting Lauritzen, 345 U.S. at 591, 73 S. Ct. at 932). However, the majority then concludes \"albeit weakly, the law of the forum [factor] supports application of American law.\" Maj. op. at __ [Typescript at 51]. I am unable to comprehend how the language cited by the majority even \"weakly\" supports such a Conclusion. The law of the forum is a neutral factor and does not weigh towards the application of either United States or St. Lucian law.\n\nIII. Conclusion\n\nNeely has failed to prove that substantial links with the United States exist: (1) the law of the flag, the most important factor, points to the application of St. Lucian law; (2) the shipowner's base of operations clearly indicates that St. Lucia is the appropriate forum; (3) the allegiance of the defendant shipowner points to St. Lucia; (4) there is no indication that a St. Lucian court is inaccessible to the plaintiff; and (5) the wrongful act occurred in St. Lucian territorial waters. The only factors that weigh in favor of applying United States law are: (1) the plaintiff is a citizen of the United States; and (2) the place of the employment contract was the United States. The law of the forum is a neutral factor. Based on the totality of these eight factors, I conclude that United States law should not be applied to this controversy.\n\nBecause plaintiff has neither pled nor proven St. Lucian law, this suit must fail on the merits. However, as alluded to by the majority, see Maj. op. at __ n.11 [Typescript at 28 n.11], I do not rule out the possibility of the district court upon remand granting plaintiff leave to plead and prove foreign law in light of my Conclusion that United States law does not apply. Such leave to re-plead, of course, should be without prejudice to the right of the defendant to assert forum non conveniens.\n\nEarlier the majority lamented that the eight-factor balancing test \"is sufficiently obscure or variable to justify any judicial result.\" Maj. op. at __ [Typescript at 32] (quoting Munusamy, 579 F. Supp. 149 at 153). The majority has certainly proven this to be true. Yet, the majority reaches its result today not only by misapplying the Lauritzen factors, but also by adding a new and confused choice-of-law analysis. Because the majority has deviated from Lauritzen, I must Dissent.\n\nJudges Mansmann, Greenberg and McKee join in this Concurring and Dissenting opinion.\n\n\u003cspan class=\"fn\"\u003e1. We find without merit and without need for Discussion the defendants' contentions that there was insufficient evidence to support the jury's findings: (1) that defendant Club Med Management employed plaintiff; (2) that defendant Holiday Village was the owner pro hac vice of the Long John ; and (3) that the unseaworthy condition of the Long John was a proximate cause of plaintiff's injuries. The same is true of plaintiff's contentions: (1) that the district court erred in submitting the issue of her contributory negligence to the jury (on the grounds of insufficient evidence); (2) that the court erred in its charge with respect to the defendants' denial of certain maintenance payments; and (3) that a new trial should have been granted because of the cumulative effect of discovery rule violations, prejudicial conduct by defense counsel, and \"judicial misconduct.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The issue of subject matter jurisdiction over the unseaworthiness and general maritime law tort claims was more complicated due to the procedural posture of the case, which preceded the 1966 procedural unification of the civil and admiralty \"sides\" of federal district court. We note here only that the Supreme Court held that where plaintiffs properly alleged a Jones Act claim, the district court might exercise \"pendent jurisdiction\" to determine whether they also properly stated a general maritime law cause of action, even if the complaint was not filed as a libel in admiralty. For further Discussion, see GRANT GILMORE \u0026 CHARLES L. BLACK, JR., THE LAW OF ADMIRALTY § 6-62 (2d ed. 1975).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The district court had chosen as a matter of discretion not to exercise admiralty jurisdiction over any claims that Romero might have under Spanish law. See id. at 358, 79 S. Ct. at 472. See also infra note .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. \"Of these seven factors, it is urged that four are in favor of the shipowner and against jurisdiction.\" Id. at 308, 90 S. Ct. at 1733. See also id. at 309, 90 S. Ct. at 1734 (referring to \"the national interest served by the assertion of Jones Act jurisdiction\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. One district court has suggested that perhaps the Supreme Court's reference to \"Jones Act jurisdiction\" was not \"intended to overrule Lauritzen and Romero,\" but rather was \"merely an unguarded and passing dictum.\" Karvelis v. Constellation Lines SA, 608 F. Supp. 966, 968 n.2, aff'd, 806 F.2d 49 (2d Cir. 1986). In this regard, we take special note of Rodriguez v. Flota Mercante Grancolombiana, S.A., 703 F.2d 1069 (9th Cir. 1983), which is one of very few reported cases to attempt a careful analysis of the nature of the Lauritzen inquiry. In Rodriguez, the court of appeals rejected a Colombian seaman's attempt to sue his employer (a Colombian corporation based in Colombia) under the Jones Act. But, as then-Judge Kennedy recognized in a separate concurrence, the majority went astray when it read Rhoditis as authorizing a district court to dismiss a Jones Act case for lack of subject matter jurisdiction when the Lauritzen factors do not support application of American law. See id. at 1072. Judge Kennedy agreed that the plaintiff failed to state a claim under the Jones Act but wrote separately \"to call attention to a conceptual problem in these cases, namely, whether to characterize an unsuccessful Jones Act claim as lacking in subject matter jurisdiction or as failing to state a cause of action.\" Id. at 1075. Judge Kennedy believed that the Supreme Court's reference in Rhoditis to \"jurisdiction\" was \"only a passing and unguarded remark.\" Id. at 1076. After reviewing Lauritzen, Romero, and several Court of Appeals cases, Judge Kennedy concluded that Lauritzen analysis does not go to subject matter jurisdiction, for \"the issue is whether or not there is a failure to state a claim, and we resort to choice of law principles to answer the question.\" Id. See also Dracos v. Hellenic Lines Ltd., 705 F.2d 1392, 1397-98 \u0026 n.1 (4th Cir. 1983) (Murnaghan, J., Dissenting) (properly analyzing Lauritzen factors as choice of law contacts, not subject matter jurisdiction factors), on reh'g, 762 F.2d 348 (1985) (en banc).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. While Dracos did cite Romero, the en banc majority read it as merely holding that federal courts have jurisdiction to consider their own jurisdiction. See Dracos, 762 F.2d at 350 (citing Romero, 358 U.S. at 359, 79 S. Ct. at 473). As our foregoing Discussion shows, this is not what Romero holds.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Defendants do not contend, nor could they, that the district court lacked subject matter jurisdiction on the ground that plaintiff's Jones Act claim \"clearly appears to be immaterial and made solely for the purpose of obtaining jurisdiction or [that her] claim is wholly insubstantial and frivolous.\" Bell v. Hood, 327 U.S. 678, 682-83, 66 S. Ct. 773, 776, 90 L. Ed. 939 (1946).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. On appeal, the defendants did not challenge plaintiff's seaman status, which flowed from her being a crewmember of the vessels in the Club Med fleet, and which we accordingly take as given for purposes of this case. Cf. Chirinos de Alvarez v. Creole Petroleum Corp., 613 F.2d 1240, 1245 n.5 (3d Cir. 1980).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. In so holding we note that the Supreme Court has not been receptive to defendants' arguments that \"virtually every activity involving a vessel on navigable waters would be a traditional maritime activity sufficient to invoke maritime navigation.\" Jerome B. Grubart, Inc., 115 S. Ct. at 1052 (internal quotation marks omitted). Nor has the Court departed far from the situs test for admiralty jurisdiction, see id. at 1052-53, but rather has \"simply . . . rejected a location rule so rigid as to extend admiralty to a case involving an airplane, not a vessel, engaged in an activity far removed from anything traditionally maritime.\" Id. at 1053. Although not \"every tort involving a vessel on navigable waters falls within the scope of admiralty jurisdiction no matter what, . . . ordinarily that will be so.\" Id. This case lacks any exceptional circumstances that could take it out of the ordinary run. Accordingly, plaintiff's general maritime law claims come within the federal courts' admiralty jurisdiction. Additionally, although diversity or alienage were not pled as bases for the district court's jurisdiction over Neely's claims against Club Med Management and Holiday Village, the amount in controversy has at all times easily exceeded $50,000, and so the facts show that the district court had diversity jurisdiction, 28 U.S.C. § 1332(a)(1) (1988), over the claims of Neely (a Pennsylvania citizen) against Club Med Management (a New York corporation), and Club Med Sales (a Delaware corporation), and alienage jurisdiction, 28 U.S.C. § 1332(a)(2) (1988), over the claims against Club Med, Inc. (a Cayman Islands corporation) and Holiday Village (a St. Lucian corporation). By statute, we are authorized to permit amendment to the complaint to correct defective allegations. See 28 U.S.C. § 1653 (1988) (\"Defective allegations of subject matter jurisdiction may be amended, upon terms, in the trial or appellate courts.\"). Thus, if we had doubts whether the plaintiff's general maritime law claims fell within the district court's admiralty jurisdiction, we could permit amendment (as plaintiff has requested) to avoid the great waste of judicial resources that would otherwise attend the plaintiff's having alleged only two bases for jurisdiction (federal question and admiralty), rather than three (those plus diversity). Cf. Local No. 1 (ACA) Broadcast Employees of Int'l Bhd. of Teamsters v. International Bhd. of Teamsters, 614 F.2d 846 (3d Cir. 1980) (allowing plaintiff to amend complaint to cure defective jurisdictional allegations). We therefore need not rely on the doctrine that where plaintiffs invoke federal question jurisdiction to bring a Jones Act suit, federal district courts have \"pendent\" jurisdiction over parallel unseaworthiness claims. See, e.g., Romero, 358 U.S. at 380-81, 79 S. Ct. at 484-85; Hagans v. Lavine, 415 U.S. 528, 548 n.14, 94 S. Ct. 1372, 1385 n.14, 39 L. Ed. 2d 577 (1974) (recognizing existence of this doctrine); 28 U.S.C. § 1367 (Supp. V 1993) (generally granting district courts \"supplemental jurisdiction over all other claims that are so related to claim in the action within [the district courts'] original jurisdiction that they form part of the same case or controversy under Article III of the United States Constitution\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. See, e.g., Mellon Bank, N.A. v. Aetna Business Credit, Inc., 619 F.2d 1001, 1005 n.1 (3d Cir. 1980); Bagdon v. Bridgestone/Firestone, Inc., 916 F.2d 379, 383 (7th Cir. 1990); Corrugated Paper Prods., Inc. v. Longview Fibre Co., 868 F.2d 908, 910 n.2 (7th Cir. 1989); R.L. Clark Drilling Contractors, Inc. v. Schramm, Inc., 835 F.2d 1306, 1308 (10th Cir. 1987); Gilchrist v. Jim Slemons Imports, Inc., 803 F.2d 1488, 1497 (9th Cir. 1986); Bilancia v. General Motors Corp., 538 F.2d 621, 622-23 (4th Cir. 1976). See also Larry Kramer, Rethinking Choice of Law, 90 COLUM. L. REV. 277, 284 (1990) (\"It is the parties' responsibility to call a choice of law issue to the court's attention. If plaintiff bases his claim on inapplicable law (i.e., a law that does not give plaintiff a right to relief), the defendant must notify the court in a motion to dismiss or a motion for directed verdict. Failure to make a timely motion waives any claim--however meritorious--that plaintiff is not entitled to recover as a matter of law.\"); id. at 291.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. If the plaintiff has also pled in the alternative the applicability of foreign law (which Neely has not done here), the court may of course adjudicate any such claims over which there is a basis for subject matter jurisdiction. Where the locality and maritime connection tests are met, see supra at 24-26 (discussing admiralty jurisdiction tests), 28 U.S.C. § 1333 will provide such a basis. We note also that some courts have not required a plaintiff affirmatively to plead the applicability of foreign law at the outset, but instead have applied foreign law after concluding that American law does not apply. See, e.g., Schexnider v. McDermott Int'l, Inc., 817 F.2d 1159, 1160-61, 1164 (5th Cir. 1987). Where American law does not apply and the plaintiff and defendant are both foreign, however, admiralty courts sometimes decline to exercise jurisdiction. See 1 BENEDICT ON ADMIRALTY § 128, at 8-40 to -41 \u0026 n.9.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The two identified purposes are not unrelated, for if American law were held to apply in situations where the United States has no appreciable interest, it would invite other nations to construe their laws in a similar fashion, cf. Lauritzen, 345 U.S. at 582, 73 S. Ct. at 928 (discussing reciprocity concerns), inevitably escalating the number of true conflicts in international maritime contexts to an unacceptably high level.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Courts are of course, subject to explicit congressional directives as to choice of law, see Lauritzen, 345 U.S. at 579 n.7, 73 S. Ct. at 926 n.7, where they are constitutional, see Cruz v. Chesapeake Shipping, Inc., 932 F.2d 218, 234 (3d Cir. 1991) (Cowen, J., Concurring in the judgment).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The Dissent rejects our analysis, suggesting that \"under the Lauritzen test, the plaintiff must prove that a simple majority or preponderance of the factors weighs in favor of United States law.\" Dissenting op. infra at 7-8 (emphasis supplied). While the meaning of this is somewhat unclear (for it seems a hybrid of a counting test and a balancing test), it does not constitute an accurate rendering of the \"substantial contacts\" formulation adopted in Rhoditis. The \"substantial contacts\" concept was borrowed from Judge Medina, who explained that \"something between minimal and preponderant contacts is necessary if the Jones Act is to be applied.\" Bartholomew, 263 F.2d at 440 (emphases supplied). This articulation of the \"substantial contacts\" standard occurs in the paragraph of Judge Medina's opinion immediately preceding the paragraph that the Supreme Court quoted. Judge Medina's explanation of \"substantial contacts\" is thus crucial to understanding the approach adopted by the Court in Rhoditis, and it shows that the American contacts must be more than minimal but need not be preponderant. Hence, the Dissent's proposed standard is too stringent.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. While the Restatement of Conflict of Laws is by its terms applicable to cases with foreign elements, see RESTATEMENT (SECOND) OF CONFLICT OF LAWS § 10 (1971) [hereinafter RESTATEMENT OF CONFLICTS], this is only \"usually\" the case, see id. § 10, cmt. c, and \"there are significant differences between interstate and international cases,\" see id. § 10, cmt. d. Additionally, to the extent that the Restatement of Foreign Relations Law might seem inapplicable, and the Restatement of Conflicts applicable, we note that these two Restatements in many respects do not fundamentally differ. The Restatement of Foreign Relations Law explains that \"the concepts, doctrines, and considerations that inform private international law also guide the development of some areas of public international law, notably the principles limiting the jurisdiction of states to prescribe, adjudicate and enforce law.\" RESTATEMENT § 101, cmt. c, at 23. The Restatement of Conflicts provides that \"[a] court may not apply the local law of its own state to determine a particular issue unless [that] would be reasonable in the light of the relationship of the state and of other states to the person, thing or occurrence involved.\" RESTATEMENT OF CONFLICTS § 9, at 31. This is the same sort of analysis employed in our opinion. Indeed, the reasonableness factors of § 403 of the Restatement of Foreign Relations Law, see infra note and accompanying text, incorporate the general choice of law factors of § 6 of the Restatement of Conflicts, see RESTATEMENT § 403, reporters' note 10, at 254; the latter are used to determine the state with the most significant relationship to the occurrence and the parties, the law of which state governs (under the Restatement of Conflicts) the rights and liabilities of the parties with respect to tort issues, see RESTATEMENT OF CONFLICTS § 145, at 414. Additionally, although \"[]public international law is dealt with only incidentally\" in the Restatement of Conflicts, the rules of the Restatement of Conflicts \"do conform . . . to the requirements of public international law.\" Id. § 2, cmt. d, at 6. There is thus important congruence between the Restatement of Foreign Relations Law and the Restatement of Conflicts with respect to the issues before this court. However, the Restatement of Conflicts rule for personal injury actions specifies that \"the local law of the state where the injury occurred determines the rights and liabilities of the parties, unless . . . some other state has a more significant relationship . . . to the occurrence and the parties . . . .\" Id. § 146, at 430. This rule gives far too much general significance to the place of the wrongful act to constitute a satisfactory interpretation of Lauritzen. See infra at 51-55 (discussing the variable significance of this factor). Indeed its very formulation seems alien to Lauritzen -type analysis, which is the touchstone of Part III of our opinion; this suggests the inappropriateness of the Restatement of Conflicts to this case, whatever the declarations of the drafters. Thus, despite the Dissent's comments, we are convinced that our reliance on the Restatement of Foreign Relations Law is proper.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Cf. also Mary B. McCord, Responding to the Space Station Agreement: The Extension of U.S. Law into Space, 77 GEO. L.J. 1933, 1945 (1989) (suggesting combining the Lauritzen and Restatement of Foreign Relations Law factors to determine propriety of applying American law to incidents aboard hypothetical multinational space station). Additionally, we believe that relying on current versions of the Restatement to interpret both general maritime law and the Jones Act--even though it was adopted long after the Supreme Court announced the Lauritzen factors--is permissible because the Jones Act was not locked rigidly into place when adopted, see, e.g., McAllister v. Magnolia Petroleum Co., 357 U.S. 221, 225 n.6, 78 S. Ct. 1201, 1204 n.6, 2 L. Ed. 2d 1272 (1958) (discussing change in Jones Act statute of limitations upon amendment of FELA after enactment of Jones Act); the Act was relatively recently amended, see Pub. L. 97-389, Title V, § 503(a), 96 Stat. 1955 (Dec. 29, 1982); when the Court in Rhoditis adopted the concept of \"substantial contacts\" in 1970, it did not specify how to determine whether a case in fact involves such contacts with the United States; as we have stated, see supra note, the Restatement of Foreign Relations Law factors on which we rely below derive from the general choice of law factors of the Restatement (Second) of Conflicts of Law, which was adopted and promulgated by the American Law Institute in 1969; and \"United States courts have considered [rules of international law as to prescriptive jurisdiction], and interpreted the known or presumed intent of Congress, in the light of changing understandings,\" RESTATEMENT (THIRD) OF FOREIGN RELATIONS LAW Pt. IV, Ch. 1, at 236-37 (1987) (emphasis supplied).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Since Neely is undisputedly an American domiciliary and citizen, we do not need to decide here what is necessary for a seaman to be treated as an American for purposes of Lauritzen analysis. Cf. Brian Jay Corrigan, The Status of the Quasi-American Bluewater Seaman in the American Courts, 10 MAR. LAW. 269 (1987). But cf. 46 U.S.C. § 688(b)(2) (1988) (placing conditions on availability of Jones Act to brownwater seamen not citizens or permanent resident aliens of the United States). Additionally, we acknowledge that the \"passive personality principle,\" which \"asserts that a state may apply law--particularly criminal law--to an act committed outside its territory by a person not its national where the victim of the act was its national[,] . . . . has not been generally accepted for ordinary torts or crimes . . . .\" RESTATEMENT § 402 cmt. g. However, the Jones Act and the general maritime law unseaworthiness cause of action are primarily \"concerned with prescribing particular remedies, rather than . . . regulating commerce or creating a standard for conduct.\" Rhoditis, 398 U.S. at 313, 90 S. Ct. at 1736 (Harlan, J., Dissenting). Moreover, these causes of action are civil, not criminal, and thus represent a lesser potential intrusion on the prescriptive jurisdiction of other sovereigns. See RESTATEMENT § 403 8 (\"In applying the principle of reasonableness, the exercise of criminal (as distinguished from civil) jurisdiction in relation to acts committed in another state may be perceived as particularly intrusive. . . . It is generally accepted by enforcement agencies of the United States government that criminal jurisdiction over activity with substantial foreign elements should be exercised more sparingly than civil jurisdiction over the same activity, and only with strong justification.\"). Finally, where seamen are injured in the course of their employment, torts are not \"ordinary,\" for seamen have long been considered wards of admiralty entitled to special protection different from that afforded by conventional tort law. See, e.g., Seas Shipping Co. v. Sieracki, 328 U.S. 85, 104, 66 S. Ct. 872, 882, 90 L. Ed. 1099 (1946) (Stone, C.J., Dissenting) (\"The seaman has been given a special status in the maritime law as the ward of the admiralty, entitled to special protection of the law not extended to land employees.\"); Socony-Vacuum Oil Co. v. Smith, 305 U.S. 424, 430-31, 59 S. Ct. 262, 266, 83 L. Ed. 265 (1939) (citing cases); id. at 431, 59 S. Ct. at 266 (\"Seamen are the wards of the admiralty, whose traditional policy it has been to avoid, within reasonable limits, the application of rules of the common law which would affect them harshly because of the special circumstances attending their calling.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. In contrast, however, the mere making of a contract in the United States, without a provision agreeing to American law and without other American contacts, would generally be insufficient by itself to meet the threshold requirement of a significant American interest in applying American law. Since international commercial shippers customarily have taken on help where they have needed it, see Lauritzen, 345 U.S. at 588, 73 S. Ct. at 931, the happenstance of a contract's being made in an American port cannot reasonably be presumed to reflect consent to application of American law to any injuries to the bluewater seaman, nor would it (without more) ground prescriptive jurisdiction over an injury abroad pursuant to § 402(1)(a), for it would not in our view constitute a \"substantial part\" of the relevant conduct.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. For determining whether application of American law is reasonable, the Restatement directs courts to evaluate all relevant factors, including where appropriate: (a) the link of the activity to the territory of the regulating state, i.e., the extent to which the activity takes place within the territory, or has substantial, direct, and foreseeable effect upon or in the territory; (b) the connections, such as nationality, residence, or economic activity, between the regulating state and the person principally responsible for the activity to be regulated, or between that state and those whom the regulation is designed to protect; (c) the character of the activity to be regulated, the importance of regulation to the regulating state, the extent to which other states regulate such activities, and the degree to which the desirability of such regulation is generally accepted; (d) the existence of justified expectations that might be protected or hurt by the regulation; (e) the importance of the regulation to the international political, legal, or economic system; (f) the extent to which the regulation is consistent with the traditions of the international system; (g) the extent to which another state may have an interest in regulating the activity; and (h) the likelihood of conflict with regulation by another state. RESTATEMENT § 403(2); see also Republic of Philippines v. Westinghouse Elec. Corp., 43 F.3d 65, 76 n.1 (3d Cir. 1994) (noting usefulness of these factors). Romero and Rhoditis provide benchmarks by which to gauge this reasonableness. In both of these cases there was a basis for prescriptive jurisdiction, for the injuries occurred in American waters. In Romero, where the injured seaman was Spanish, the ship was of Spanish registry and sailed under the Spanish flag, the shipowner was a Spanish corporation, and the seaman's employment contract was entered into in Spain, the Supreme Court held that the contacts with the United States (the place of the seaman's injury and treatment and the largely immaterial law of the forum) were not sufficient to justify application of American law, 358 U.S. at 383-84, 79 S. Ct. at 486; we take this to mean that the application of American law would not have been reasonable in those circumstances. In Rhoditis, in contrast, the Court determined that the American contacts--the place of the wrongful act, law of the forum, and defendant's base of operations--were in combination substantial, 398 U.S. at 310, 90 S. Ct. at 1734; application of American law was reasonable.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. The Dissent misapprehends the nature of our analysis, believing that our opinion requires \"defendants to show that United States law does not apply.\" Dissenting op. infra at 6. This inference is unsupported by the quoted passage, which only requires defendants to prove the existence of foreign contacts to avoid an adverse judgment once plaintiffs have proven that there are significant American interests implicated, and which does not relieve plaintiff of the ultimate burden of showing the applicability of American law. Similarly, the Dissent's bald assertion that under our analysis, defendants who show that \"more of the factors weigh in favor of the application of foreign law\" still must \"show that the application of United States law is unreasonable,\" Dissenting op. infra at 8, divorces the statement on which it relies (\"Unless virtually all of the Lauritzen factors point away from the United States, application of American law will be reasonable . . . .\") from the actual framework of the analysis. Unlike the Dissent, our opinion clearly states that the quoted proposition is limited to cases where there appear no foreign contacts. In such a case, where significant American interests are implicated and no foreign interests (so far as the court can tell) are threatened, the plaintiff has met his or her burden of showing that application of American law is reasonable because only American interests have been shown to be at risk. Moreover, the Dissent apparently believes that a plaintiff's burden of proving that the American contacts are \"substantial\" implies that individual Lauritzen factors count against the plaintiff until she or he proves otherwise. See, e.g., Dissenting op. infra at 21 (\"Because plaintiff bears the burden of proof, this factor [inaccessibility of a foreign forum, which the majority opinion treats as neutral] weighs against applying United States law to this dispute.\"). For this reason the Dissent's approach and ours are fundamentally at odds. In metaphorical terms, the majority opinion starts with a normal scale, one in balance, and requires the plaintiffs to bring it down onto the American side; we compare whatever weights the defendants put in the scale against whatever weights the plaintiffs put in the scale; and if the scale remains down on the foreign side or if it remains in balance at the end of all this, the plaintiffs have not made out their burden of proof as to the substantiality of American contacts and thus have not prevailed. The Dissent, in contrast, apparently would start with a skewed scale, one pre-positioned down on the foreign side, and require plaintiffs first to bring the scales back to equipoise and then further to move the American pan beyond that point. This goes beyond placing the burden of proof on the plaintiffs by building in a presumption (albeit in theory rebuttable) that in each case the Lauritzen factors come stacked against application of American law. That approach is itself unsupported by case law. In rejecting the Dissent's position, we do not suggest that the significance of foreign contacts is irrelevant to the question whether American contacts are \"substantial\" enough for American law to apply; nevertheless, courts should not uniformly presume from the outset that every Jones Act or general maritime law suit implicates important foreign interests that will be compromised by application of American law. If the defendant in a case does not urge that American law is inapplicable under the Lauritzen triad, the court need not even engage in the analysis, regardless of what foreign interests could be implicated. If the defendant does not put on evidence that foreign interests are indeed implicated, courts should not presume otherwise.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Cf. infra note and accompanying text.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. But see infra note and accompanying text (discussing burden on foreign plaintiffs in Jones Act cases).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. In construing the Jones Act in Lauritzen, the Supreme Court observed that the Act was enacted with regard to a seasoned body of maritime law developed by the experience of American courts long accustomed to dealing with admiralty problems in reconciling our own with foreign interests and in accommodating the reach of our own laws to those of other maritime nations. 345 U.S. at 577, 73 S. Ct. at 925 (emphasis supplied).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. See also Lauritzen, 345 U.S. at 584, 73 S. Ct. at 929 (referring to the many \"varieties of legal authority\" through whose territorial jurisdiction a seaman might pass).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. This holding also accords with Federal Rule of Civil Procedure 44.1, which provides that \"[a] party who intends to raise an issue concerning the law of a foreign country shall give notice by pleadings or other reasonable notice.\" Cf. 9 CHARLES A. WRIGHT \u0026 ARTHUR R. MILLER, FEDERAL PRACTICE AND PROCEDURE: CIVIL § 2443, at 642 (2d ed. 1994) (\"Notice normally will be given by the party whose claim or defense is based on foreign law. It would be contrary to the purpose of the rule, however, to allow the other party to remain silent if no notice has been given and claim at the last moment that the opposing party, who has relied irretrievably on domestic law, is required to look to foreign law.\") (emphasis supplied).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. See also Symeonides, Maritime Conflicts, 7 MAR. LAW. at 225-26 (\"Congressional delineation of the transnational reach of American maritime legislation should be very useful in resolving conflicts problems in those areas of admiralty law where Congress has not spoken or has spoken with insufficient clarity, such as in the area of the general maritime law or the Jones Act.\"). As Symeonides notes, the explicit reach of those Congressional statutes affecting seamen that do address the choice of law issue may suggest that the Jones Act and general maritime law unseaworthiness causes of action should be given broad sweep: In all of the above cases where Congress has specifically addressed the choice-of-law problem, it has delineated the reach of American legislative jurisdiction in such an expansive way as to include many essentially foreign cases which would normally fall outside the reach of American law. Thus, although all other factors may be foreign, the temporary physical presence of the seaman in American waters at the time of the filing of the suit suffices for the application of the Seamen's Act. Similarly, the beginning or the termination of the voyage at an American port, without any other American connection, suffices for the application of the Limitation of Liability Act and COGSA. American law is thus made applicable on the showing of only a minimum connection with the American legal order. . . . This overreach of American legislative jurisdiction is less than commendable from an internationalist view point; nevertheless, it is the only congressional directive we have to delineate the transnational reach of American maritime law in general. Nationalistic or not, the spirit of this legislation should provide a guideline in resolving choice-of-law problems in those areas where Congress has not spoken, or has spoken with insufficient clarity as in the area of general maritime law, the Jones Act and the Death on the High Seas Act (DOHSA). Id. at 234-35 (footnotes omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. While the Dissent correctly characterizes the passage we quote from Lauritzen as signifying that the law of the forum factor \"should not dictate the substantive law to be applied,\" Dissenting op. infra at 27 (emphasis supplied), it is incorrect in suggesting that the law of the forum is irrelevant : there is a difference between being irrelevant and being non-dispositive. Hence our Conclusion is that the law of the forum factor favors the plaintiff here only \"weakly.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. The Dissent believes that the majority opinion \"adopts inconsistent positions when discussing the traditional or nontraditional character of the activity in which the Long John was engaged . . . .\" Dissenting op. infra at 15. However, there is no inconsistency. Our jurisdictional Conclusion in Part II supra was that the activity of the Long John was \"substantially related to traditional maritime activity.\" Jerome B. Grubart, Inc. v. Great Lakes Dredge \u0026 Dock Co., 130 L. Ed. 2d 1024, 115 S. Ct. 1043, 1051 (1995) (quoted without alteration or emphasis supra at 25). The Supreme Court itself has distinguished between vessels actually \"engaged in commercial maritime activity\", Foremost Ins. Co. v. Richardson, 457 U.S. 668, 674, 102 S. Ct. 2654, 2658, 73 L. Ed. 2d 300 (1982), and ones whose activity \"bears a substantial relationship to traditional maritime activity,\" id. at 675 n.5, 102 S. Ct. at 2658 n.5. Only the latter is necessary for admiralty jurisdiction, but more than that is presupposed at some points in the reasoning of Lauritzen. In this case, the Long John 's expeditions, involving navigation of a vessel in navigable waters, bore a substantial relationship to traditional maritime activity, but the vessel was not engaged in commercial maritime activity. Here, the salient fact, that to which we refer by the designation \"non-traditional activity,\" is that the Long John did not travel the world's seas engaged in commercial shipping. As our opinion explains, it is this substantive factor of traveling or lack thereof -- and not any purported formal similarity of the Long John to various oil-drilling rigs or supposed resemblance of the Long John 's scuba diving missions to oil-drilling operations -- that bears upon some of the rationales in Lauritzen and thus upon the significance of some of the Lauritzen factors.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. The Dissent asserts that this Conclusion contradicts our earlier Conclusion that the accident here is the sort with a potential for disrupting maritime commerce. See Dissenting op. infra at 23. There is no contradiction. We do not doubt the possibility that St. Lucia could have interests in investigating incidents such as this one or in preventing unseaworthy conditions such as those involved here. However, without knowing the content of St. Lucian law, we have no basis for concluding that application of American law threatens whatever St. Lucia's interests may be, and thus the place of the wrongful act in this case presents little reason to \"accommodate the reach\" of American maritime laws to those of St. Lucia. See supra note and accompanying text.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. The Dissent misleadingly asserts that \"the majority implicitly holds that the law of the flag factor should be accorded little or no weight because the vessel Long John engaged in activity more analogous to that of an oil drilling platform.\" Dissenting op. infra at 14. We are not suggesting any equivalence between scuba diving and petroleum production. Rather, the relevant aspect of the activity that forms the metric for our comparison is whether or not the activity at issue takes the \"vessel\" through the waters of multiple nations.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. While the district court did state in one order that the Long John \"flies the flag of St. Lucia,\" there was no basis for this Conclusion, for, as we have explained, the defendants put on no testimony or exhibits showing what flag the Long John actually flew, or even that it flew any flag. Indeed, the district court later explained that \"in my earlier order, I considered all of these factors, noting that there was insufficient evidence at the time to determine the law of the flag . . . . No evidence has been adduced at trial regarding these factors which persuades me to change my ruling on subject matter jurisdiction.\" App. at 4 (emphasis supplied).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. Rather than analyze the American contacts of this transaction, this plaintiff, and these defendants, the Dissent mechanically invokes the Lauritzen factors as they were labeled in the Supreme Court's cases, where the plaintiffs' employers happened to be the shipowners. Aside from this fortuity, the Dissent's refusal to consider the connections between defendant Club Med Management and the United States amounts to sheer ipse dixit. See, e.g., Dissenting op. infra at 19 (not bothering to \"examine the activities of Club Med Management\"); id. (ignoring Club Med Management when discussing defendants' allegiance).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. The Court did not further analyze this factor (allegiance or domicile of the injured) in either Romero or Rhoditis.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. This approach is also supported by Justice Harlan's position in Rhoditis. In Rhoditis, Chief Justice Burger and Justice Powell joined Justice Harlan in protesting the Court's extension of the Jones Act to the foreign plaintiff. A majority of the Rhoditis Court rejected the Dissent's narrow view of congressional policy and the situations in which the United States has a legitimate interest in applying American maritime law, and the range of American interests that could support application of American maritime law thus is wider than the Dissent envisioned. Justice Harlan's analysis, however, still sheds important light on the dual role of the Lauritzen factors (assuring American interest and avoiding and resolving conflicts with foreign law) in determining the applicability of the Jones Act and general maritime law in cases involving American seamen. Justice Harlan thought that the first question in any Jones Act case was whether Congress intended the Jones Act to apply to the plaintiff. See Rhoditis, 398 U.S. at 314, 90 S. Ct. at 1736 (Harlan, J., Dissenting). Where American seamen were concerned, the Dissent would have looked to the Lauritzen factors (other than seaman's allegiance) to determine whether there was \"an adequate nexus between this country and [the] defendant to assert jurisdiction in a case where congressional policy is otherwise furthered.\" Rhoditis, 398 U.S. at 314-15, 90 S. Ct. at 1736-37 (Harlan, J., Dissenting). Thus, where there is such a nexus in a case involving an American seaman, even Justice Harlan's approach in Rhoditis (less generous than that of the majority) would apply American law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. One final note on this point: Despite the Dissent's prediction that the majority opinion will \"almost always [lead to an American seaman suitor's obtaining] the benefit of suing under the Jones Act,\" see Dissenting op. infra at 7, it is not hard to conceive how in a case brought by an American seaman but with different showings by the defendant -- for example, a showing like that in Lauritzen v. Larsen, 345 U.S. at 575-76, 73 S. Ct. at 924-25, or Romero v. International Terminal Operating Co., 358 U.S. at 358, 79 S. Ct. at 472, that foreign law offered the plaintiff significantly different remedies than American law -- the majority opinion would yield a different choice of law result.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. First, it would have been foreseeable that where the defendants' negligence and failure to provide a seaworthy vessel injured an American seaman (as it did), she would return to the United States (as she did), and thus that her injuries would have substantial and direct effect here (as they have). Second, there is a critical and direct connection between the United States and those whom the Jones Act and American maritime law are designed to protect the most--Americans (such as plaintiff). Third and relatedly, the protection of and assurance of compensation for injured (or killed) Americans is of vital importance to the United States. Most nations have a body of maritime law providing similar (although usually not identical) protection. Similarly, deterrence of unseaworthy conditions is also generally considered desirable. In this case the United States has a particular interest in the seaworthiness of the Club Med fleet to which the Long John belonged, since most of its passengers are Americans. The passengers of the Long John were as at least as vulnerable as its crewmembers to injury from its unseaworthiness. Fourth, we believe that as we have interpreted the Lauritzen analysis, it protects rather than harms justified expectations. Where an American is injured in a situation such as this with its additional nexus with the United States, parties should expect that the sweeping terms of the Jones Act (and by analogy, America's non-statutory general maritime law) may apply to protect the injured American. Absent a freely-bargained for, reasonable choice of law clause whose operation does not contradict a strong public policy of the United States--which would typically be enforced under federal maritime law, see, e.g., Milanovich v. Costa Crociere, S.p.A., 293 U.S. App. D.C. 332, 954 F.2d 763, 766-68 (D.C. Cir. 1992) (interpreting M/S Bremen v. Zapata Off-Shore Co., 407 U.S. 1, 92 S. Ct. 1907, 32 L. Ed. 2d 513 (1972), and Carnival Cruise Lines, Inc. v. Shute, 499 U.S. 585, 111 S. Ct. 1522, 113 L. Ed. 2d 622 (1991)); see also Lauritzen, 345 U.S. at 588-89, 73 S. Ct. at 931-32 (approving reasonable choice of law clause not violating public policy), and might give rise to justifiable expectations that American law would not be applied--party expectations should not be injured. Here, there was no such choice of law provision, for the defendants orally contracted with the plaintiff without ever requesting that she agree to be governed by the law of St. Lucia. Fifth and sixth, legal protection of those injured at sea has historically been quite important in international political and economic systems. As we have mentioned, most sea-faring nations have laws providing compensation for injured seamen. While remedial American maritime laws may in many cases be more generous to injured Americans, application of American law to American seamen will not generally be inconsistent with the traditions of the international system, which treats seamen as the wards of admiralty entitled to special protection. See supra note 17. Similarly, to the extent that St. Lucia might have an interest in the remedies afforded to this American injured at sea by negligence or unseaworthiness, RESTATEMENT § 403(2)(g), those interests will not generally be hindered by application of American law, and thus there is little likelihood of conflicting regulation, id. § 403(2)(h). One foreign interest potentially vulnerable to impairment, which accordingly raises the specter of \"conflict with regulation by another state,\" would be an interest in restricting defendants' liabilities. We do not mean to denigrate this interest, but we think that it does little to render unreasonable the application of American law to compensate this American seaman who was injured by unseaworthy vessels and negligence (including the negligence of an American defendant), particularly where we do not know what limits St. Lucian law might place on defendants' liability. American maritime law may be generous, but it is not unreasonably favorable to plaintiffs. Comparative negligence or contributory causation is still available in appropriate cases to mitigate damages, and hence defendants who interpose this defense will not be required to pay a seaman plaintiff for injuries properly attributable to the seaman's own negligence. Certainly, if an American defendant were responsible for injuring a foreign seaman through the defendant's negligence or provision of an unseaworthy vessel, the United States could not take umbrage if the law of the seaman's nation called upon the defendant to make the seaman whole. Cf. Lauritzen, 345 U.S. at 582, 73 S. Ct. at 928 (discussing reciprocity concerns). Considering all the circumstances of this case, giving special attention as the Restatement directs to the considerations noted in this footnote, we cannot say that application of American law would not be reasonable here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. Plaintiff argues that comparative negligence applies only to the Jones Act negligence claims while comparative fault applies to the unseaworthiness claims. We agree that \"comparative negligence\" is not the most apt nomenclature to apply to unseaworthiness claims, which, after all, are not grounded in negligence. But federal practice requires only notice pleading, and we do not believe that the technical distinction raised by plaintiff may be used to construe the above defense in so limited a fashion. Courts have used both \"comparative negligence\" and \"comparative fault\" to describe what goes on in unseaworthiness cases. Compare, e.g., Miles v. Melrose, 882 F.2d 976, 984 (5th Cir. 1989) (\"comparative negligence\"), aff'd sub nom. Miles v. Apex Marine Corp., 498 U.S. 19, 111 S. Ct. 317, 112 L. Ed. 2d 275 (1990) and Kulukundis v. Strand, 202 F.2d 708, 711 (9th Cir. 1953) (\"comparative negligence\") with Lewis v. Timco, Inc., 716 F.2d 1425, 1427 (5th Cir. 1983) (\"comparative fault\") and Pan-Alaska Fisheries, Inc. v. Marine Constr. \u0026 Design Co., 565 F.2d 1129, 1138 (9th Cir. 1977) (\"comparative fault\"). The underlying principles are mostly indistinguishable. And since plaintiff's unseaworthiness claims are technically a form of liability without fault, Seas Shipping Co. v. Sieracki, 328 U.S. 85, 94, 66 S. Ct. 872, 877, 90 L. Ed. 1099 (1946), comparative \"fault\" is also not precise. We believe that \"comparative causation\" may be conceptually more precise than \"comparative fault,\" \"since fault alone without causation does not subject one to liability. But whether we use the term comparative fault or comparative causation, we are merely beating around the semantical bush seeking to achieve an equitable method of allocating the responsibility for an injury or loss.\" Chotin Transp., Inc. v. United States, 819 F.2d 1342, 1353 n.1 (6th Cir. 1987) (in banc) (Milburn, J., Concurring in part and Dissenting in part) (internal quotation marks and citations omitted and emphasis supplied). Thus, courts might do well to refer to the defense at issue as \"comparative causation\" or perhaps \"comparative responsibility.\" Be that as it may, we believe that the defense was in the first instance adequately raised with respect to the unseaworthiness claims.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. We note our agreement with plaintiff that the defendants' proffered post-verdict question whether \"it was [the jury's] intention that this lady would receive $545,000\" was clearly not a proper question on the issue. Br. of Appellant/Cross-Appellee at 17. The district court correctly refused to ask this question, for the jury's duties under the special verdict form were only to assess damages and to allocate responsibility; the court was to make the calculations as to what plaintiff would receive based on the jury's findings. The defendants have not contended otherwise. We note also that Rule 49(b) has no application here, for it applies only where the jury is asked both to render a general verdict and to answer interrogatories on factual issues necessary to the verdict. See FED. R. CIV. P. 49(b). That was not done here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. Although Rule 51 admits a narrow exception where review is necessary to avoid a gross miscarriage of Justice, see, e.g., Callwood, 233 F.2d at 788, the defendants have not argued that it applies to their failure to object to the verdict form and charge.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. In Kinnel, no questions concerning the individual defendant's liability were included among the written interrogatories submitted to the jury, which found the corporate defendant liable, yet the district court entered judgment against both defendants. See id. at 959, 964.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. We also reject the defendants' suggestion that the district court's molding of the verdict was necessary to render the jury's factual findings consistent. While we agree that the case law would generally allow this, the principle does not help the defendants, for there is no inconsistency in holding the plaintiff 60% responsible for her injury under the Jones Act claim as a result of her contributory negligence and holding Holiday Village entirely responsible for the same set of injuries under the unseaworthiness claim. As we have explained, under the two different causes of action, the jury was apportioning responsibility among different actors based on different factual predicates. Moreover, as long as plaintiff's negligence was consistent with the jury's explicit finding that the unseaworthy conditions attributable to Holiday Village substantially caused her injuries--and we believe that it is--the jury's factual findings are consistent. The key point is that it is largely irrelevant what plaintiff's share of the responsibility is here: since the defendants waived the contributory fault defense on the unseaworthiness claim, Holiday Village may not reduce its liability by Neely's fault, whatever percent it may be (so long as the unseaworthiness was a substantial cause of her injuries). That is, one cannot presume factual inconsistency merely from the finding of contributory negligence on the Jones Act claim and the lack of verdict reduction on the unseaworthiness claim when the defendants waived the right to reduce their liability on the unseaworthiness claim.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. The liability under the Jones Act, however, is not joint with that under the general maritime law in this case, for plaintiff's general maritime law claim was not grounded in negligence but in unseaworthiness, which, as we have mentioned, see supra note, is a form of liability without fault. See Seas Shipping Co. v. Sieracki, 328 U.S. 85, 89, 66 S. Ct. 872, 875, 90 L. Ed. 1099 (1946) (holding negligent defendants not jointly liable with tortfeasor whose liability was based in unseaworthiness); see also Cooper Stevedoring Co. v. Fritz Kopke, Inc., 417 U.S. 106, 114-15, 94 S. Ct. 2174, 2179, 40 L. Ed. 2d 694 (1974) (distinguishing situations where joint liability is and is not available).\u003c/span\u003e\n\n",
    "body_length": 208945,
    "citedas": [
      "63 F.3d 166"
    ],
    "attorneys": "M. KELLY TILLERY, ESQUIRE (ARGUED), MICHAEL V. TINARI, ESQUIRE, BARRY L. COHEN, ESQUIRE, Leonard, Tillery \u0026 Sciolla, 1515 Market Street, 18th Floor, Philadelphia, PA 19102, Attorneys for Eileen Anne Neely. BETTINA B. PLEVAN, ESQUIRE (ARGUED), JOHN SIEGAL, ESQUIRE, MONIQUE A. TUTTLE, ESQUIRE, Proskauer, Rose, Goetz \u0026 Mendelsohn, 1585 Broadway, New York, New York 10036, Attorneys for Club Med Management, Services, Inc.; Club Med Inc.;, Holiday Village (St. Lucia), Ltd.. LOUIS BELL, Marshall, Dennehey, Warner, Coleman \u0026 Goggin, 1845 Walnut Street, Philadelphia, PA 19103, Attorneys for Club Med Management, Services, Inc.; Holiday Village, (St. Lucia), Ltd.... .",
    "category": [
      "124",
      "3",
      "197"
    ],
    "judges": "Argued: August 8, 1994 Before: Mansmann, Cowen, and McKEE, Circuit Judges. Reargued in banc February 7, 1995 Before: Sloviter, Chief Judge, Becker, Stapleton, Mansmann, Greenberg, Hutchinson, Scirica, Cowen, Nygaard, Alito, Roth, Lewis, McKEE, and Sarokin, Circuit Judges.",
    "citation_count": 72
  }
}
