{
  "id": "-6FVR2YBTlTomsSBnuNP",
  "document": {
    "title": "People v. Allen",
    "full_title": "THE PEOPLE AND v. CLARENCE RAY ALLEN AND",
    "jurisdiction": "California Supreme Court",
    "date": "1986-12-31T00:00:00.000Z",
    "docket": "Crim. No. 22879",
    "body": "This is an automatic appeal from a judgment imposing death under the 1978 death penalty legislation. (Pen. Code, §§ 190-190.5.)\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e We\n\naffirm the verdict of guilt, the finding of special circumstances, and the judgment of death.\n\nI. Facts and Procedure\n\nThe sordid events leading to the charges that underlie this appeal go back to 1974 and include a large cast of characters: Numerous victims and third party witnesses, various prison witnesses, and at least 10 members of defendant's \"crime family.\" For reasons that will appear below, it is necessary to outline the sequence of events in detail.\n\nIn June 1974, defendant, then 44 years old, decided to burglarize Fran's Market in Fresno. He had known the owners of the market, Ray and Frances Schletewitz, for over a decade. He enlisted the assistance of his son Roger, Carl Mayfield, and Charles Jones; the latter two were ostensibly employees in defendant's security guard business and worked for him and his son in various criminal pursuits.\n\nRoger Allen invited the Schletewitz's 19-year-old son, Bryon, to an evening swimming party at defendant's house. While he was swimming, the Fran's Market keys were taken from his pants pocket. Later that night, while Bryon was on a date arranged by defendant with 17-year-old Mary Sue Kitts, defendant, Mayfield and Jones used Bryon's keys to burglarize his parents' market. They removed a safe and took it to the house of Jones' wife, Charlotte, where they opened it and divided the booty -- $500 in cash and over $10,000 in money orders.\n\nDefendant, with help from his son Roger, Mary Sue Kitts, defendant's girlfriend Shirley Doeckel, and two additional persons -- Barbara Carrasco and her stepson, Eugene Furrow -- cashed the stolen money orders at southern California shopping centers by using false identifications. Thereafter Mary Sue Kitts contacted Bryon Schletewitz and tearfully confessed defendant had burglarized Fran's Market and that she had been helping to cash the stolen money orders with a fake identification and a wig provided by defendant.\n\nBryon went to Roger Allen's house to confront him with this story. Roger admitted the Allen family had burglarized the store, and Bryon confirmed to Roger that Mary Sue Kitts had confessed to him. When Roger Allen told his father, defendant, of Bryon's accusation based on Mary Sue Kitts' confession, defendant responded that they (Bryon and Mary Sue Kitts) would have to be \"dealt with.\"\n\nDefendant subsequently told Ray and Frances Schletewitz he had not burglarized their store and that he loved Bryon like his own son. He threatened\n\nthe Schletewitzes, however, by hinting to them that someone was planning to burn down their house. He also intimidated them by having his son Roger pay Eugene Furrow $50 to fire several gunshots at their home one midnight.\n\nAround this same time defendant called a meeting at his house and told Charles Jones, Carl Mayfield, and Eugene Furrow that Mary Sue Kitts had been talking too much and should be killed. Defendant called for a vote on the issue of Mary Sue's execution; it was unanimous that she should be killed. One reason for the unanimous vote was that those present feared defendant if they did not go along with his plans: He had previously told criminals working with him that he would kill snitches and that he had friends and connections to do the job for him even if he was locked up; he had stated that the \"secret witness program\" was useless because a good lawyer could always discover an informant's name and address; finally, he had numerous times referred to himself as a Mafia hitman. He kept a newspaper article about the murder of a man and woman in Nevada, and claimed he had blown them in half with a shotgun.\n\nAfter the vote, defendant developed a plan to poison Mary Sue Kitts by tricking her into taking cyanide capsules at a party to be held at Shirley Doeckel's apartment in Fresno. He sent Carl Mayfield and Eugene Furrow to a winery (one of his security guard clients) to pick up the cyanide for the job. Defendant also put some stepping stones from his house in the back of Charles Jones' truck, to be used to weigh down Mary Sue Kitts' body, which was to be dumped into a canal after the murder.\n\nWhen discussing the plan to murder Mary Sue Kitts, defendant overruled Charles Jones' suggestion that she be sent somewhere until \"things died down.\" He also dismissed Shirley Doeckel's objection to a murder being committed in her apartment. Shortly before the party started at Shirley Doeckel's apartment, defendant also told Eugene Furrow that it was just as easy to get rid of two persons as one if he (Furrow) did not take Mary Sue's life.\n\nDefendant left Shirley Doeckel's apartment shortly before Mary Sue Kitts arrived, having first arranged for his operatives to call him from a nearby phone booth to report on the progress of the execution plan. When Mary Sue Kitts arrived she refused to take the \"pills\" without wine, and Mayfield and Jones so informed defendant by phone; defendant told Furrow to kill Mary Sue one way or the other because he just wanted her dead. The partygoers later brought wine, beer and \"reds\" to the apartment but Mary Sue still did not take the cyanide. Defendant subsequently met Furrow outside the apartment and stressed that \"he didn't care how it was done but do it.\" Defendant told him he had people surrounding the apartment and\n\nthat he (Furrow) would be killed if he tried to leave. Thereafter, when Furrow and Mary Sue Kitts were left alone in the apartment, he began to strangle her only to be interrupted by a call from defendant asking if he had killed her yet. Furrow answered, \"no\"; defendant ordered, \"do it\" and hung up. Furrow then strangled Mary Sue to death.\n\nFurrow called defendant and told him to come pick up the body. Charles Jones, who was with the defendant when he received the call, then announced he wanted nothing to do with the murder. Defendant told him it was already done and that he was equally involved with the others. Defendant, Shirley Doeckel and Jones then went to pick up the body, which they wrapped and put in defendant's Cadillac trunk. He again warned Jones that they were all equally involved.\n\nDefendant and Shirley Doeckel, in the Cadillac, led Jones and Furrow, in Jones' car, to defendant's house, where they transferred the body to Jones' car and then drove, defendant in the lead, to the mountains. They stopped after passing over a canal. Furrow and Jones tied the stones with wire to the body pursuant to defendant's instructions and, while defendant watched for traffic, threw the body into the canal.\n\nDefendant variously threatened and bragged to all of his cohorts after the murder. When Carl Mayfield asked defendant how \"everything went\" a few days later, defendant said, \"everything went okay,\" meaning that Mary Sue Kitts had been killed.\n\nWhen Mayfield later asked how Furrow was doing, defendant said he was no longer in existence, explaining it is easy to go to Mexico, get someone killed, and have the body disposed of for only $50. About six months after the murder, when Mayfield asked defendant if he was worried about others talking, defendant said he was not afraid, that \"things would be taken care of\" if that happened, that he would have snitches killed, and that he would take care of \"secret witness\" informers even if he was locked up.\n\nHe told Charles Jones and others that \"talking was a spreading disease and that the only way to kill it was to kill the person talking.\" When Jones and others gathered at defendant's house, defendant stated that \"none of [these] people talked,\" that \"they first took what was coming,\" and that, if they did not, \"he would get them from inside or outside prison.\" When Jones's home was burglarized some time after the murder and Jones told defendant about the burglary, defendant told Jones the burglary showed he could be easily reached. He later gave Jones a key that Jones discovered fit his residence, and told Jones in front of Jones's five-year-old son he knew Jones \"would like his kids to grow up without harm.\"\n\nDefendant made several statements to Shirley Doeckel after Mary Sue's murder, telling her, among other things, that Furrow was no longer around and repeating his claim that he had killed a woman in Las Vegas. He also spoke often with Barbara Carrasco, telling her he had \"offed Mary Sue Kitts because she was opening her mouth about the money orders,\" that he involved Furrow in the murder because \"he wanted to get him in deep so he couldn't talk about the armed robberies and other things that he knew,\" and that \"he would have put Furrow in the same hole if Furrow didn't go along with the murder.\" Speaking about Mary Sue Kitts herself, defendant told Barbara Carrasco that they \"had to ride her up, wet her down and [feed] her to the fishes.\"\n\nDespite his boasts, defendant had not killed Furrow. In fact, he thereafter used him -- along with Charles Jones -- to rob an elderly couple at their jewelry store in August 1974. Unhappy with Furrow's performance, however, defendant told him he would have shot him a long time ago if not for Barbara Carrasco (Furrow's adoptive mother).\n\nIn early 1977 defendant brought some new employees, Allen Robinson and Benjamin Meyer, into his crime family. He told Meyer he previously \"had a broad helping them who got mouthy so they had to waste her\" and that \"she sleeps with the fishes.\" He warned Meyer, \"If you bring anybody in my house that snitches on me or my family, I'll waste them. There's no rock, bush, nothing, he could hide behind . . . .\" When Meyer asked what would happen if defendant was arrested and could not make bail, defendant replied, \"you've heard of the long arm of the law before? Well don't underestimate the long arm of this Indian. I will reach out and waste you.\"\n\nSome time later, defendant told Meyer about Ray Schletewitz, stating that he kept $50,000 to $75,000 in a second safe in Fran's Market. He mentioned he had robbed Fran's Market by taking the first safe and that Ray Schletewitz was mad at him for the robbery, but that \"the stupid son-of-a-bitch (Ray Schletewitz) don't have no proof so he shouldn't be upset.\"\n\nAfter holding meetings with his new men and his son, Roger, defendant drove them to \"case\" their first robbery project, a K-Mart store in Tulare. After the robbery, he phoned Meyer to congratulate him on a fine job and to chastise Allen Robinson for making mistakes. He told Meyer, \"we are not going to have anything else to do with [Robinson] anymore, and we just might waste him,\" and that he would \"be back to [him] for other robberies.\" Defendant's son Roger later contacted Larry Green to replace Robinson as the \"inside man\" for a number of robberies planned by defendant.\n\nThey committed an armed robbery in March 1977 that proved to be the beginning of the end. At the K-Mart store in Visalia, Larry Green shot a\n\nbystander and the police arrested him along with Meyer and defendant. Defendant was tried and convicted in 1977 of robbery, attempted robbery, and assault with a deadly weapon for his part in this crime. His arrest also led to his second 1977 trial, this one for the Fran's Market burglary, conspiracy, and the murder of Mary Sue Kitts -- a trial at which numerous witnesses, including Bryon Schletewitz, Carl Mayfield, Charles Jones, Eugene Furrow, Shirley Doeckel, Barbara Carrasco and Benjamin Meyer testified for the prosecution. Defendant was convicted of burglary, conspiracy, and the first degree murder of Mary Sue Kitts, and was sentenced to prison.\n\nFrom Folsom prison defendant called his second son, Kenneth Allen, asking for several copies of a magazine article about Mary Sue Kitts' murder. Defendant explained he wanted them to send to other prisons to solicit help to retaliate against those who had testified against him. He repeated this request in a letter to Kenneth.\n\nDefendant soon met Billy Ray Hamilton, a fellow inmate and convicted robber who was housed nearby and who worked with defendant in the prison's kitchen for two months in mid-1980. Hamilton, who was nicknamed \"Country,\" became defendant's \"dog,\" running errands and taking care of various problems in return for cash. Defendant, who had access to inmate photographs, would give Hamilton photos of inmates and tell Hamilton to locate them for him as one of Hamilton's chores. Another inmate, Gary Brady, would assist Hamilton occasionally in running errands for defendant. Brady was scheduled to be paroled July 28, 1980; Hamilton was scheduled for parole one month later.\n\nAfter Hamilton and Brady had been helping him for some time, defendant said he had an appeal coming up and wanted certain people taken \"out of the box, killed,\" because \"they had been onto his appeal,\" and \"messed him around on a beef.\" Defendant mentioned the names \"Bryant,\" (Bryon), Charles Jones and \"Sharlene\" (Charlotte) as witnesses to be killed, and offered Hamilton $25,000 for the job. Defendant confided to another Folsom inmate, Joseph Rainier, that he had been convicted of first degree murder on the basis of the testimony of \"the guy who did the actual killing,\" and that he would like to see this individual as well as four other witnesses who testified against him killed.\n\nRainier saw defendant and Hamilton talking together in the prison yard bleachers and on the track every day for the four to six weeks before Hamilton's release on parole in late August 1980. Hamilton and defendant usually huddled close together when they were talking -- both men would straighten up, separate and stop talking whenever Rainier approached. After Rainier repeatedly asked defendant what was going on, defendant stated\n\n\"he's [Hamilton] going to take care of some rats [i.e., informants] for me.\" He later told Rainier, in front of Hamilton, that Hamilton was going to \"get paid for the job\" and that \"Kenny was going to take care of transportation\" for Hamilton after Hamilton's release. Defendant said that he could probably \"win his appeal\" if the witnesses were killed and offered to kill witnesses who had testified against Rainier as well.\n\nDefendant asked his eldest son, Kenneth, and Kenneth's wife, Kathy, to visit him, and they did so with their baby on August 15. He told Kenneth that both Ray and Bryon Schletewitz were going to be murdered and that the other witnesses against him would also be eliminated so that he would prevail on retrial if he won his appeal. He added that Shirley Doeckel had agreed to change her testimony were he granted a new trial.\n\nDefendant explained that Hamilton -- whom he referred to as \"Country\" -- would do the killing (and simultaneously commit a robbery so he could have some money to tide himself over) and that he expected Kenneth to supply \"Country\" with guns and transportation. He stated that \"Country\" was a professional who would \"do what you told him to do,\" and gave Hamilton's mug shot to Kenneth, telling him to burn it after memorizing Hamilton's face. Kenneth agreed to find guns for Hamilton with help from his wife Kathy, who would evidently trade drugs for the guns, and he smuggled Hamilton's picture out of prison in his baby's diapers. Thereafter, he received a series of letters from his father detailing the evolving plan.\n\nIn the first letter, written the day after the visit, defendant told Kenneth, \"I rapped to my dog when I jammed back in here . . . . [He] is looking forward to meeting you all and it's okay with him to smoke to your pad.\" Defendant asked Kenneth to \"send me the name of that dude that got off with such a light sentence, okay? . . . and that lawyer, that sounds like just might be the play I have been looking for . . . . I know with the right lawyer I could beat this beef I am riding. Keep the Allen faith because there is good times ahead.\" Kenneth got another letter dated August 20, 1980, telling him of a second short visit from Shirley Doeckel, who was \"willing to help me in court and tell it like it really was.\" Defendant also wrote: \"Hey, I hear a country music show is coming to town around September 3rd.\" \"Show,\" Kenneth testified, was a code word for murder. Kenneth received a third letter dated August 26, stating, \"remember September 3, around that date y'all be listening to a lot of good old 'country' music, okay? Just for me. You know how I like 'country.'\" Yet another letter dated August 27, stated \"now remember around September 3rd, have everything ready so y'all can go to that 'country' music show. I know y'all really 'enjoy' yourselves. I know you kids never liked 'country' music before. But I bet when you hear that dude on the 'lead' guitar you'll be listening\n\nto it at least once a week, ha. Anyway, forget about rock and roll and get lost in the country. Ha, ha.\"\n\nSoon after Hamilton was paroled Kenneth wired him transportation money and thereafter met him at the Fresno bus depot. At Kenneth's house, Hamilton confirmed he was there to murder Bryon and Ray Schletewitz, and asked to see the weapons he would be using. He explained he would not kill Shirley Doeckel as yet because she was helping him locate the other hit list witnesses.\n\nHamilton's girlfriend, Connie Barbo, joined him in Fresno. During the next few days, she told acquaintances she had a chance to get a few thousand dollars and a hundred dollars worth of \"crank\" for \"snuffing out a life.\"\n\nOn Thursday, September 4, Hamilton went to Kenneth's house and got a sawed-off shotgun, a .32 caliber revolver, and seven shotgun shells from Kenneth, all to be used to murder Ray and Bryon Schletewitz at Fran's Market. Hamilton discussed the market and said he knew there were two safes there, one in the wall and the other in the freezer. He left in the evening with Connie Barbo, telling Kenneth he was going to murder Ray and Bryon Schletewitz. They returned about 9:45 p.m., however, explaining they aborted the execution because Connie objected to killing a 15-year-old Mexican boy who was in the store that night.\n\nThe next evening Hamilton took from Kenneth 13 additional shotgun shells, 6 more cartridges, and went with Connie Barbo back to Fran's Market. When they arrived at 8 p.m., just before closing time, Bryon Schletewitz and employees Douglas Scott White, Josephine Rocha and Joe Rios were there. Shortly after they entered Hamilton brandished the sawed off shotgun and Barbo produced the .32 caliber revolver. Hamilton led Doug White, Josephine Rocha, Joe Rios and Bryon Schletewitz toward the stockroom and ordered them to lie on the floor.\n\nHamilton told Doug White to get up and walk to the freezer, warning White he knew there was a safe inside. When White told Hamilton there was no safe there, Hamilton responded, \"get out 'Briant.'\" At that point Bryon Schletewitz volunteered, \"I am Bryon.\" Following Hamilton's demand, Bryon gave up his keys and assured Hamilton he would give him all the money he wanted.\n\nWhile Barbo guarded the other employees, Bryon led Hamilton to the stockroom where, from seven to twelve inches away, Hamilton fatally shot him in the center of his forehead with the sawed-off shotgun. Hamilton emerged from the stockroom and asked White, \"Okay, big boy, where's\n\nthe safe?\" As White responded, \"honest, there's no safe,\" Hamilton fatally shot him in the neck and chest at pointblank range. As Josephine Rocha began crying, Hamilton fatally shot her through the heart, lung and stomach from five to eight feet away. Meanwhile, Joe Rios had taken refuge in the women's restroom. Hamilton found him, swung open the restroom door, pointed the shotgun at Rios' face, and shot him from three feet away. Rios, however, put up his arm in time to take the blast in the elbow, saving his life. Assuming Rios was dead, Hamilton told Connie Barbo, \"let's go baby,\" and they fled through the front door, only to be spotted by a neighbor, Jack Abbott, who had come to investigate after hearing the shooting. As Connie Barbo retreated into the restroom, Hamilton and Abbott traded fire: Although hit, Abbott nevertheless managed to shoot Hamilton in the foot as he ran to his getaway car. Barbo was apprehended by officers at the scene.\n\nHamilton phoned Kenneth Allen later that evening and said that \"he lost his kitten\" and that \"things went wrong at the store.\" They arranged to meet and exchange cars, after which Hamilton drove to the Modesto home of Gary Brady, the Folsom inmate who had been paroled one month before Hamilton. While staying there for about five days, Hamilton told Brady he had \"done robbery\" and he had \"killed three people for Ray,\" referring to defendant as \"the old Man.\" He also had Brady's wife write a letter to defendant asking him for the money he was owed for the job. The letter, signed \"Country,\" gave Brady's Modesto address as the return address.\n\nShortly thereafter Hamilton was arrested after robbing a liquor store across the street from Brady's apartment. The police seized from Hamilton an address book containing a list of names and addresses of those who had testified against defendant at the 1977 murder trial, i.e., Eugene Furrow, Barbara Carrasco, Benjamin Meyer, Charles Jones, Carl Mayfield, Shirley Doeckel and Ray and Bryon Schletewitz. When investigators visited Kenneth Allen's home at about the same time, they were handed Hamilton's mug shot by Kathy Allen.\n\nAfter an article about the Fran Market murders appeared, defendant asked fellow inmate, Joe Rainier, \"why don't you testify against me . . . and see if you can help yourself or get some time off\"? When Rainier said he could not do that, defendant patted him on the back and said, \"you wouldn't want to do that anyway because you do have a lovely daughter.\"\n\nShortly after the Fran Market murders, Kenneth Allen was arrested on drug charges and was interviewed about his knowledge of the murders. A week later, he contacted the police to offer his testimony in return for protective custody and his choice of prisons. As will be fully explained\n\nbelow, he eventually entered an agreement whereby he promised to testify \"truthfully and completely\" in all proceedings against Hamilton, Barbo and defendant in exchange for which he would be allowed to plead to specified charges. (See post, pp. 1248-1249.) A complaint was filed in June 1981 against defendant for the Fran's Market murders and conspiracy and Kenneth Allen thereafter testified at defendant's preliminary hearing.\n\nDefendant was held to answer. An information filed in June 1981 charged him with murdering Bryon Schletewitz (§ 187) (count 1), murdering Douglas Scott White (count 2), murdering Josephine Rocha (count 3), and conspiring to murder Bryon Schletewitz, Ray Schletewitz, Eugene Furrow, Barbara Carrasco, Benjamin Meyer, Charles Jones and Carl Mayfield (§ 182, subd. 1) (count 4). The information further alleged eleven special circumstances: five under count 1, three under count 2, and three under count 3.\n\nAs to count 1, it was alleged defendant solicited the murder under that count (§ 190.2, subd. (b)), (i) for the purpose of preventing testimony (§ 190.2, subd. (a)(10)); (ii) in retaliation for prior testimony (ibid.); (iii) and (iv) in addition to the murders charged in counts 2 and 3 (§ 190.2, subd. (a)(3)) and (v) having previously been convicted of murder in 1977 (§ 190.2, subd. (a)(2)). As to count 2, it was alleged defendant solicited the murder under that count (§ 190.2, subd. (b)) (i) and (ii) in addition to the murders charged in counts 1 and 3 (§ 190.2, subd. (a)(3)), and (iii) having previously been convicted of murder in 1977 (§ 190.2, subd. (a)(2)). As to count 3, it was alleged defendant solicited the murder under that count (§ 190.2, subd. (b)) (i) and (ii) in addition to the murders charged in counts 1 and 2 (§ 190.2, subd. (a)(3)), and (iii) having previously been convicted of murder in 1977 (§ 190.2, subd. (a)(2)).\n\nThereafter, as will be explained fully below, the prosecutor terminated Kenneth's plea agreement after discovering Kenneth had written to defendant promising to change his testimony at trial in order to exculpate him. Nevertheless, stating he wanted to testify truthfully, and having been fully advised of his rights and the fact that the previous plea agreement was terminated, Kenneth testified for the prosecution at a trial conducted in Glenn County.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nThe jury heard 58 witnesses over 23 days. In addition to the evidence outlined above, defendant took the stand in his own defense. He denied any involvement in the Fran's Market murders or in the conspiracy to execute the witnesses who testified against him in his previous trial.\n\nHe admitted on cross-examination, however, that he had told his \"good dog,\" Hamilton (\"Country\"), to go to Fresno. He admitted writing all the various letters received into evidence and conceded they referred to Hamilton's impending visit to Fresno. He confirmed that the letters referred to Ben Meyer, Carl Mayfield, and Chuck Jones, and admitted that the phrase \"taken care of\" meant to kill. He acknowledged that he had access to mug shots where he worked with Hamilton in Folsom Prison, and admitted talking to Hamilton in the bleachers at the prison. After being confronted with a tape recording, he also admitted ordering Kathy Allen to call the Schletewitzes to impersonate Mary Sue Kitts, and to pretend to be the mother of Bryon's baby in order to induce the family to call off the Kitts murder investigation.\n\nDefendant also confirmed many of the details about his former acts and convictions about which Charles Jones, Carl Mayfield, Eugene Furrow, Benjamin Meyer, Shirley Doeckel and Barbara Carrasco had all testified. Among other things, he described how he helped transport and dispose of Mary Sue Kitts' body; he described in great detail his formula for executing \"fool-proof\" armed robberies of various K-Mart stores with his son Roger, Ben Meyer, and Allen Robinson; he described in detail his role in the Tulare K-Mart robbery; he maintained that \"when a guy puts a rat jacket on himself [i.e., becomes a \"snitch\"], killing them would do them a favor\"; he described how he brought Larry Green from Oklahoma to participate in the Visalia K-Mart robbery, and how they had planned to execute three or four additional robberies to make money for summer expenses; and he generally confirmed myriad other details of his role in the former acts and crimes testified to by the above witnesses.\n\nDefendant's daughter-in-law, Kathy, tried to exculpate him and implicate her husband as a drug-crazed, hallucinogenic mastermind of the Fran's Market murder. She recalled, however, that Kenneth had discussed getting guns for witnesses with his father at Folsom Prison, and that Connie Barbo had told her that she and Hamilton could not leave any witnesses. She admitted that she had previously testified for defendant, that she had tried to falsify evidence about the murders, and that she had transmitted messages to Hamilton for defendant.\n\nExpert witness Dr. Vincent Mirkil testified about the effects of methamphetamine, but admitted that he had never examined Kenneth Allen and did not know how much of such a drug Kenneth had taken.\n\nThree prison inmate witnesses, John Frazier, Henry Borbon, and Andrew Thompson testified that Hamilton, Allen, and Brady could not have met together in the Folsom yard. Thompson admitted that he called defendant\n\n\"Dad\" and would lie to protect him; Borbon's testimony was impeached by another witness, Dexter Lasher, and a rebuttal witness, Eugene Rose.\n\nDefendant was found guilty as charged after three days of deliberation. He thereafter admitted he had previously been convicted of murder.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nThe People's evidence presented at the seven-day penalty trial showed defendant masterminded the following armed robberies: The August 12, 1974, armed robbery at the Safina Jewelry Store in Fresno in which $18,000 worth of jewelry was taken from the store safe; the September 4, 1974, armed robbery at Don's Hillside Inn in Porterville in which $3,600 was taken from the safe and hundreds of dollars in cash and credit cards were taken from patrons at the scene; the February 12, 1975, residential armed robbery of William and Ruth Cross, an elderly Fresno couple, in which a coin collection valued at $100,000 was taken; the June 18, 1975, attempted robbery at Wickes Forest Products in Fresno, resulting in defendant's arrest; the October 21, 1976, armed robbery at Skagg's Drug Store in Bakersfield, in which Raoul Lopez (another stepson of Barbara Carrasco who was recruited by defendant) accidentally shot himself; the November 20, 1976, armed robbery at a Sacramento Lucky's market, in which grocery clerk Lee McBride was shot by robber Raoul Lopez and sustained permanent damage to his nervous system as a result; the February 10, 1977, robbery at the Tulare K-Mart, in which over $16,000 in cash was taken; the March 16, 1977, Visalia K-Mart robbery, in which Larry Green held a gun to the head of employee Bernice Davis and subsequently shot employee John Attebery in the chest, permanently disabling him.\n\nThe evidence also showed that while in the Fresno County jail on June 27, 1981, defendant called a \"death penalty\" vote for inmate Glenn Bell (an accused child molester) and directed an attack on Bell during which inmates scalded Bell with over two gallons of hot water, tied him to the cell bars and beat him about the head and face, and thereafter shot him with a zip gun and threw razor blades and excrement at him while he huddled in his blanket in the corner of the cell.\n\nThe People's evidence established defendant repeatedly threatened that anyone who \"snitched\" on the Allen gang would be \"blown away\" or killed, and that defendant thwarted prosecution of the attempted robbery at Wickes Forest Products by threatening the chief prosecution witness and his family.\n\nIn addition, defendant's prior convictions of (i) conspiracy, first degree murder and first degree burglary and his prior convictions of (ii) first degree robbery, attempted robbery and assault with a deadly weapon were introduced into evidence at the penalty phase. It was also stipulated that the guilt phase testimony of Ray Schletewitz, Carl Mayfield, Charles Jones, Eugene Furrow and Benjamin Meyer concerning the prior conspiracy to murder and the first degree murder of Mary Sue Kitts in August 1974, the robbery at the Safina Jewelry Store on August 12, 1974, the burglary and robbery of the Tulare K-Mart Store on February 10, 1977, and the assault with a deadly weapon, burglary, conspiracy to commit robbery, and attempted robbery at the Visalia K-Mart Store on March 16, 1977, could be considered by the jury at the penalty phase without recalling these witnesses.\n\nDefendant put on two witnesses. His former girlfriend, Diane Harris, testified to his good character. She explained that defendant had helped her financially both before and after her marriage to Jerry Harris, that he helped rush her to the hospital for surgery on one occasion, that he was good to children and that he wrote poetry. She did admit, however, that he had threatened to kill her husband, Jerry Harris.\n\nDefendant's second penalty witness, San Quentin inmate John Plemons, testified he had instigated the assault on accused child molester, Glenn Bell, and that defendant had nothing to do with it, but had merely sat by while the incident occurred. This was rebutted by Correctional Officer Delma Graves who testified Bell told her immediately after the incident that defendant had instigated the assault.\n\nThe vast majority of the prosecutor's penalty argument was devoted to recounting the details of defendant's present and prior convictions and uncharged crimes as aggravating factors militating in favor of the death penalty. After deliberating one day, the jury returned a verdict of death. The court subsequently denied defendant's \"statutory motion for a new trial\" and sentenced him to death.\n\nII. Guilt Phase Issues\n\n1. Kenneth Allen's Plea Bargain\n\nDefendant claims he was denied a fair trial because of an allegedly unlawful plea bargain between the district attorney's office and his son Kenneth -- a key witness for the prosecution.\n\nOn September 9, 1980, Kenneth Allen was arrested on drug charges. That same day, the police conducted a tape-recorded interview with Kenneth\n\nconcerning the Fran's Market incident. Kenneth initially maintained that during the first week in September his cousin had stayed one night with Kenneth and his family. After continued questioning, Kenneth eventually admitted the visitor was not his cousin but a man named Billy. He also admitted defendant had told him to expect a call from Billy, who would be coming to town and would need a place to stay. Kenneth insisted that Billy had spent only two nights with him and that he had driven Billy to the bus depot early in the morning of September 5.\n\nSix days later, after Kenneth learned that Billy Hamilton had been arrested, he asked for another interview with the police. At the outset of the tape-recorded interview Kenneth said he had certain information about defendant's participation in the Fran's Market incident and that, in exchange for this information, he wanted protective custody, release on his own recognizance and his choice of prisons. The district attorney agreed to Kenneth's demands on the condition he agree to testify truthfully at the preliminary hearing of Hamilton and Barbo. It was made clear to Kenneth that no \"deal\" was being made concerning either the drug charges or possible homicide charges against him and that he would not be given immunity from prosecution for anything he told the police.\n\nWith his attorney present, Kenneth agreed to the district attorney's terms and was advised of his Miranda rights. Kenneth explained that during a visit with his father at Folsom Prison on August 17, 1980, defendant told him Hamilton would be coming to Fresno to \"get some things done for me,\" including the robbery of Fran's Market and the murder of Ray and Bryon Schletewitz. Kenneth admitted he did not take Hamilton to the bus depot as he had earlier claimed, but insisted he did not provide Hamilton with the shotgun used in the killings.\n\nApproximately three weeks later, on October 7, 1980, Kenneth initiated a third interview with law enforcement officials. After consulting with his attorney by phone, and having again been advised of his Miranda rights, Kenneth told the police that during his August 17 prison visit defendant told him Hamilton was going to kill everyone who testified against defendant in his 1977 murder trial so that, in the event defendant's pending appeal was successful, there would be no witnesses to testify against him on retrial. Kenneth further stated that he was supposed to provide Hamilton with weapons for the Fran's Market killings and did, in fact, provide Hamilton with transportation, money, a shotgun and a revolver.\n\nOn October 15 and 16, Kenneth testified at the Hamilton-Barbo preliminary hearing in exchange for release on his own recognizance and his choice of prisons. His testimony was generally consistent with his third statement\n\nto police and implicated defendant, Hamilton and Barbo in the Fran's Market killings.\n\nFour months later, in February 1981, Kenneth entered into a plea agreement under which he agreed to testify truthfully and completely in all proceedings against Hamilton, Barbo and defendant, in exchange for which he would be allowed to plead to a violation of section 32 (accessory to murder) and Health and Safety Code section 11377, subdivision (a) (possession of a controlled substance).\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e It was Kenneth's understanding that the district attorney would recommend a three-year sentence for each offense to run concurrently and that, with time off for good behavior, he would be out of prison in two years.\n\nIn mid-May 1981 Kenneth testified at defendant's preliminary hearing. As with the Hamilton-Barbo preliminary hearing, Kenneth's testimony was generally consistent with the statement he gave to police on October 7, 1980.\n\nOn July 10, 1981, however, Kenneth sent a letter to defendant in prison. The letter, which was intercepted by prison officials, stated in part: \"Dad Ive been doing a lot of thinking about all this shit and I'm still confused but I believe things will work out okay for everybody but me but that's okay I haven't got anything to live for anyway, but you do so I'm going to tell them the real truth the next time we go to court, and that should clear you but I want the death penalty. But I don't want the gas chamber. I want to donate my body to people who can use the parts. Like my heart, lung, kidneys, eyeball, and all that stuff, if I can die that way I'll feel okay about death in the Bible it say no greater deed can a man do than to give his life, so another may live so after I clear you with the truth, and give my organs to people who need them maybe one of you will live and God might have grace on me for what I'm doing with my life . . . . [ para. ] I would do anything just for the chance to make our marriage work just so I could then grow up like a real dad should do but its not in the stars for me to get that chance\n\nso maybe this way they will remember me as the man who gave them back there grandfather and that way you wont let them forget me will ya. I hope not at least everything they see or hear, from you they may think of me from time to time I sure hope so. Dad we both know these people just want an Allen so after I tell them the truth they will have one, that way they may lighten up on you I sure hope so.\"\n\nOn July 22, 1981, Deputy District Attorney Jerry Jones and Investigator William Martin confronted Kenneth with the letter. He admitted writing it and stated his testimony at defendant's preliminary hearing had been untruthful in a number of respects. Specifically, he told Martin and Jones that Hamilton had come to Fresno not to execute anyone, but to help Kenneth \"fence\" some guns. He claimed that he and Hamilton had discussed the robbery but no killing was ever mentioned or planned. Thereafter Jones told Kenneth that in his opinion, Kenneth had violated the plea agreement and the agreement was therefore terminated. Kenneth was then read his Miranda rights and, when he asked to speak with his attorney, the questioning ceased. Kenneth was subsequently charged with the Fran's Market killings.\n\nA week later, while being transported to his arraignment, Kenneth told Martin that his testimony in the preliminary hearings of Hamilton, Barbo and defendant was in fact truthful, that he intended to testify to the same story in the future, and that what he had written in the July 10 letter to his father was not true.\n\nIn late August Kenneth's attorney requested a meeting with Martin. With his attorney present, and having been advised of his Miranda rights, Kenneth explained he wrote the July 10 letter because of pressure from his wife, Kathy, who had a very close relationship with defendant. Kenneth told Martin that in exchange for writing the letter, his wife resumed giving him sexual favors during \"contact visits,\" he was able to receive some drugs while in jail, and conditions had generally improved for him as a result of writing the letter. He assured Martin the story he told at the preliminary hearings was the truth. Nevertheless, the district attorney's office maintained the plea agreement with Kenneth was terminated.\n\nBefore defendant's trial, a hearing was held to determine whether Kenneth would testify. In response to questions from both the prosecution and the court, Kenneth stated repeatedly that he knew it was the district attorney's position there was no plea agreement and that he would receive nothing for his testimony in defendant's case, and that by testifying he would waive his privilege against self-incrimination. Nevertheless, Kenneth stated, he wanted to testify truthfully and honestly at defendant's trial.\n\nKenneth testified at trial for the prosecution. His testimony regarding defendant's involvement in the Fran's Market killings was consistent with the testimony he had given at defendant's preliminary hearing and at the preliminary hearing of Hamilton and Barbo. Kenneth also testified at length concerning his three tape-recorded statements to the police, his agreement to testify at the Hamilton-Barbo preliminary hearing in exchange for release on his own recognizance and his choice of prisons, and his plea agreement with the district attorney's office. He testified he wrote the July 10 letter at his wife's request in an attempt to confuse law enforcement officials and to discredit his own testimony. He explained he believed his testimony was indispensable to the prosecution's case against his father and that by discrediting his own testimony he might help defendant escape a murder conviction. Kenneth further testified that he wrote the July 10 letter believing it would have no legal effect on his plea agreement and that as long as he testified truthfully and willingly at defendant's trial, the plea agreement would be binding.\n\nOn both direct and cross-examination, Kenneth made clear he understood it was the position of both the district attorney's office and the attorney general's office that no plea agreement then existed. Nevertheless, Kenneth testified he believed the February plea agreement was still in effect, and that by testifying at defendant's trial he was trying to comply with the agreement. He denied, however, that he was fabricating his trial testimony in an attempt to induce the district attorney's office to honor the agreement. Defense counsel asked Kenneth whether he felt the district attorney's office would have to abide by the plea agreement if Kenneth testified at trial as he had testified at defendant's preliminary hearing, to which Kenneth answered, \"Yes.\"\n\nDefendant argues Kenneth's plea agreement was conditioned on his trial testimony conforming to the statement he gave the police on October 7, 1980. Because this placed Kenneth under a strong compulsion to testify in conformance with his October 7 statement, defendant argues, the plea agreement and his son's highly incriminating testimony denied him a fair trial.\n\n\"[A] defendant is denied a fair trial if the prosecution's case depends substantially upon accomplice testimony and the accomplice witness is placed, either by the prosecution or the court, under a strong compulsion to testify in a particular fashion.\" (People v. Medina (1974) 41 Cal. App. 3d 438, 455 [116 Cal. Rptr. 133].) Thus, when the accomplice is granted immunity subject to the condition that his testimony substantially conform to an earlier statement given to police (id., at p. 450), or that his testimony result in the defendant's conviction (People v. Green (1951) 102 Cal. App. 2d 831, 837-839\n\n[228 P.2d 867]), the accomplice's testimony is \"tainted beyond redemption\" (Rex v. Robinson (1921) 30 B.C.R. 369) and its admission denies the defendant a fair trial.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e On the other hand, although there is a certain degree of compulsion inherent in any plea agreement or grant of immunity, it is clear that an agreement requiring only that the witness testify fully and truthfully is valid. (People v. Fields, supra, 35 Cal. 3d 329, 361; People v. Lyons (1958) 50 Cal. 2d 245, 266 [324 P.2d 556].)\n\nDefendant repeatedly asserts the record discloses Kenneth's testimony was immutably tied to his pretrial statement of October 7, 1980. He appears to argue that because the district attorney's office offered Kenneth a plea bargain only after his October 7 statement, it was implicitly made clear to him that his testimony at trial was expected to be the same as his statement to the police on October 7. This, defendant argues, is indistinguishable from People v. Medina, supra, 41 Cal. App. 3d 438, in which the court held the defendant was denied a fair trial because two key witnesses had testified pursuant to a plea agreement requiring that they not \"materially or substantially change\" their testimony from the tape-recorded statements they had earlier given to police. On the contrary, we believe this case is much more similar to People v. Fields, supra, 35 Cal. 3d 329, in which we upheld the plea agreement.\n\nIn Fields, defendant's sister, Gail, entered into a plea agreement under which she agreed to testify \"as to the truth\" of certain events in exchange for her plea of guilty to being an accessory to murder. In response to questions by defense counsel, Gail stated she agreed to testify in accord with her last statement to the police, but in response to the district attorney's questions, she stated that she had agreed only to tell the truth. After noting that Gail's statements concerning the terms of the plea agreement were not necessarily inconsistent,\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e we held these statements were insufficient to demonstrate either that the plea bargain required her to testify in conformance with her earlier statement to police or that she so understood the agreement. \"We\n\nrecognize that a witness in Gail Fields' position is under some compulsion to testify in accord with statements given to the police or the prosecution. The district attorney in the present case obviously believed that Gail's last statement was a truthful account, and if she deviated materially from it he might take the position that she had breached the bargain, and could be prosecuted as a principal to murder. But despite this element of compulsion, it is clear, and the cases so hold, that an agreement which requires only that the witness testify fully and truthfully is valid, and indeed such a requirement would seem necessary to prevent the witness from sabotaging the bargain. We believe the requirements of due process, as explained in Medina, are met if the agreement thus permits the witness to testify freely at trial and to respond to any claim that he breached the agreement by showing that the testimony he gave was a full and truthful account.\" (Id., at p. 361, citation omitted.)\n\nThe plea agreement between Kenneth and the Fresno County District Attorney's office, like the plea bargain in Fields, was conditioned only on Kenneth's truthful and complete testimony in all proceedings against defendant, Hamilton and Barbo. The fact that he, like Gail Fields, may have felt some compulsion to testify in accord with his earlier statement to the police does not, in itself, render the agreement invalid. There is nothing in the record to suggest Kenneth was ever told or led to believe he would receive the benefit of the plea bargain only if his testimony conformed with his October 7 statement.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Furthermore, contrary to defendant's contention, Kenneth was not placed \"under a strong compulsion to testify in a particular fashion\" merely because he was offered the plea agreement only after his October 7 statement. Surely, law enforcement officials cannot be expected to offer plea agreements only to those individuals who have made no prior statements and expressed no views concerning the events in question. Such a rule would have the practical effect of prohibiting all plea agreements -- \"a result neither required by reason nor compelled by precedent.\" (People v. Meza (1981) 116 Cal. App. 3d 988, 994 [172 Cal. Rptr. 531].)\n\nDefendant alludes to, but does not clearly articulate, two other arguments in support of his contention that the plea agreement was unlawfully coercive. The first argument concerns the terms of the agreement itself. Under the agreement, Kenneth agreed to testify truthfully and completely in all future proceedings against defendant, including both the preliminary hearing and the trial. Thus, once Kenneth testified against defendant at the preliminary\n\nhearing, it could be argued he was under a strong compulsion to testify the same way at trial; if he told a different story at defendant's trial he would necessarily have given untruthful testimony in one of the two proceedings and the plea agreement could be terminated by the district attorney's office. In this respect, it could be argued the plea agreement did not permit Kenneth \"to testify freely at trial and to respond to any claim that he breached the agreement by showing that the testimony he gave was a full and truthful account.\" (People v. Fields, supra, 35 Cal. 3d at p. 361.)\n\nAlthough there is superficial appeal to this view, ultimately it is unpersuasive. The agreement required only that Kenneth testify truthfully and completely, and it is clear that under the agreement, he was free to testify in any manner at defendant's preliminary hearing. Assuming Kenneth nevertheless lied in his preliminary hearing testimony, any pressure on him to repeat the lie at defendant's trial arose from his own conduct in giving perjured testimony -- not from the agreement or any conduct of the district attorney's office. Neither logic nor precedent suggests that an otherwise proper agreement conditioned only on truthful testimony suddenly becomes improper when the witness breaches the agreement by committing perjury.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nThe second argument alluded to is that the district attorney's repudiation of the agreement in response to Kenneth's July 10 letter somehow created an undue compulsion on Kenneth to testify in conformance with his earlier statements. The government's repudiation, however, sent no message to Kenneth and created no compulsion that did not already exist. Even in the absence of the government's repudiation, Kenneth must have known that if he changed his testimony at trial to completely exculpate defendant, the district attorney's office might take the position that the agreement had been violated and that Kenneth could be fully prosecuted.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nThe fact that, because of Kenneth's conduct, the district attorney's office expressed this position before Kenneth's testimony, does not render the agreement or its repudiation unlawfully coercive. Moreover, at the time of the repudiation, Kenneth had already testified at defendant's preliminary hearing and therefore knew that any significant change in his testimony at trial would constitute a violation of the agreement because it would necessarily mean that his testimony on one of the two occasions was untruthful. As we have already explained, this alone does not make the plea agreement unlawful. We note that the situation might be different if, after intercepting the letter, the district attorney had threatened to repudiate the agreement if Kenneth changed his testimony at defendant's trial, or if the district attorney had repudiated the agreement immediately but offered to reinstate it if Kenneth would stand by his original version of the facts. Here, however, the district attorney's office repudiated the agreement immediately and made it clear that as far as it was concerned, there was no agreement, no matter what Kenneth did or testified to in the future. Under these circumstances, the district attorney's repudiation cannot reasonably be viewed as a coercive threat.\n\nFor the foregoing reasons, we conclude that neither the timing of the plea agreement, nor its terms, nor its repudiation by the government placed Kenneth under such a strong compulsion to testify in a particular fashion as to deny defendant a fair trial.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\n2. Photographs of Victims\n\nOver defendant's objection, the trial court admitted into evidence nine color photographs of the murder victims. Six of the photographs were taken at the scene of the crime and depict the location and position in which each of the victims was found; most of these show the victims lying in a pool of blood. The other three photographs were apparently taken in the coroner's office before the autopsies were performed. Two of these latter three photographs are of Josephine Rocha's naked upper torso, showing in detail the shotgun wound to her left side. Rocha's bloody face, with open eyes, is visible in both photographs. The third photograph is a closeup of the large hole left in Doug White's neck by the shotgun blast.\n\n\"'The admission of photographs of victims lies primarily within the discretion of the trial judge who determines whether their probative\n\nvalue is outweighed by their prejudicial effect.'\" (People v. Fields, supra, 35 Cal. 3d at p. 372, quoting People v. Frierson (1979) 25 Cal. 3d 142, 171 [158 Cal. Rptr. 281, 599 P.2d 587], opn. of Richardson, J.) \"[A] trial court's refusal to exclude otherwise admissible photographs under [Evidence Code] section 352 will not be disturbed on appeal unless the prejudicial effect clearly outweighs the photos' probative value. (See People v. Pierce (1979) 24 Cal. 3d 199, 211 [155 Cal. Rptr. 657, 595 P.2d 91]; People v. Murphy (1972) 8 Cal. 3d 349, 363 [105 Cal. Rptr. 138, 503 P.2d 594].)\" (People v. Ramos (1982) 30 Cal. 3d 553, 576-577 [180 Cal. Rptr. 266, 639 P.2d 908].)\n\nIn admitting the photographs, the trial court stated that they \"illustrate and are supportive of the testimony of the autopsy physician, the testimony of Mr. Rios [the lone surviving victim], and the testimony of others as to the manner in which these killings were done . . . and supportive of the theory of the prosecution that this was not a robbery, this was not an isolated crime. This was a crime committed for specific purposes. It was an execution.\" Although the court noted the photographs \"generally depict a certain amount of gore and . . . unpleasant circumstances,\" it concluded their \"substantial relevance\" outweighed any prejudicial effect that might result from admission. In so holding, the court noted the nine photographs were not overly gruesome when compared to photographs the court had seen in other cases or when compared to other photographs of the same victims that had been marked as exhibits but not offered into evidence by the prosecution.\n\nThe nine photographs were clearly relevant to corroborate and illustrate the testimony of the autopsy surgeon, Dr. Nelson, concerning the nature and extent of the wounds (see, e.g., People v. Murphy (1972) 8 Cal. 3d 349, 365 [105 Cal. Rptr. 138, 503 P.2d 594]; People v. Terry (1970) 2 Cal. 3d 362, 403 [85 Cal. Rptr. 409, 466 P.2d 961]; People v. Brawley (1969) 1 Cal. 3d 277, 295 [82 Cal. Rptr. 161, 461 P.2d 361]) and to corroborate the testimony of Joe Rios and others concerning the location and manner in which the victims were shot. (People v. Ramos, supra, 30 Cal. 3d at p. 577; People v. Atchley (1959) 53 Cal. 2d 160, 168 [346 P.2d 764].) In addition, the nature of the wounds and the location of the bodies depicted in the photographs, when considered in conjunction with the explanatory testimony of Dr. Nelson and Rios, do lend some support to the prosecution's theory that the victims were shot at close range, in an \"execution-style fashion.\" (See People v. Ramos, supra, 30 Cal. 3d at p. 576.) Defendant argues, however, that even if the photographs were relevant, the photographic evidence was cumulative and therefore was unnecessary to establish any disputed issue.\n\nDr. Nelson testified in great detail concerning the nature, extent and location of each wound, the cause of death of each victim, and the probable position of the assailant and the shotgun at the moment the wounds were inflicted. The prosecutor twice used the bailiff and an assistant prosecutor as models to help illustrate Dr. Nelson's testimony. Dr. Nelson was asked no questions on cross-examination and defendant offered no evidence to challenge his testimony.\n\nRios testified to the sequence of events from the time Hamilton and Barbo entered Fran's Market until the time they left. He explained that the victims were all told to lie down on the floor, that White was shot from three feet away while still on the floor, and that Rocha was apparently shot in the same manner. Rios used a diagram to indicate the relative positions of Hamilton, Barbo, the victims and himself.\n\nAlthough photographic evidence may properly be admitted even if largely cumulative (People v. Murphy, supra, 8 Cal. 3d at pp. 364-365; People v. Terry, supra, 2 Cal. 3d at p. 403; People v. Harrison (1963) 59 Cal. 2d 622, 627 [30 Cal. Rptr. 841, 381 P.2d 665]; People v. Love (1960) 53 Cal. 2d 843, 853 [3 Cal. Rptr. 665, 350 P.2d 705] but cf. People v. Smith (1973) 33 Cal. App. 3d 51, 69 [108 Cal. Rptr. 698]), the necessity of admitting such evidence is a relevant factor in assessing its probative value (People v. Love, supra, 53 Cal. 2d at p. 856; People v. Logan (1953) 41 Cal. 2d 279, 285 [260 P.2d 20]; People v. Smith, supra, 33 Cal. App. 3d at p. 69; People v. Burns (1952) 109 Cal. App. 2d 524, 542 [241 P.2d 308]). Here, the photographs were not only cumulative but the testimony they were offered to corroborate was itself detailed and essentially uncontested. Furthermore, to the extent this testimony needed clarification or illustration, this was already accomplished through the use of models and diagrams.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Although the nature of the wounds and the location of the bodies depicted in the photographs provide some support for the prosecution's theory that these were \"execution-style\" slayings, the photographs appear to add nothing to the testimony of Dr. Nelson and Rios in this regard.\n\nOn the other hand, the photographs are relatively small and, although quite unpleasant to view, they are not exceptionally gruesome.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e The photographs were all taken either at the scene of the crime shortly after it occurred or at the coroner's office before the autopsies. Thus, unlike the\n\nphotographs in some cases, these photographs do not show the victim's bodies in a badly decomposed condition (People v. Cavanaugh (1955) 44 Cal. 2d 252 [282 P.2d 53]) or after they had been grossly disfigured during autopsy. (Compare People v. Redston (1956) 139 Cal. App. 2d 485, 490 [293 P.2d 880] and People v. Burns, supra, 109 Cal. App. 2d 524, 541-542, with People v. Atchley, supra, 53 Cal. 2d at p. 168.) We note also that in admitting the photographs, the trial court indicated it had reviewed many photographs in many other cases and that, in comparison to those, as well as to other photographs of the Fran's Market slayings not offered into evidence by the prosecution, the nine photographs to which defendant objects are not especially gory.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nAlthough the photographs were of limited probative value and could properly have been excluded, it is not clear the trial court abused its discretion in admitting them into evidence. In any event, any error was plainly harmless. There was overwhelming evidence to support the prosecution's version of what transpired at Fran's Market that evening and the evidence linking defendant to the slayings was certainly substantial, if not overwhelming. Moreover, as the People argue in their reply brief, the inflammatory nature of the photographs was relatively slight in comparison with the heinous nature of the crime presented to the jury through the testimony of witnesses. We therefore conclude it is not reasonably probable the jury would have reached a different result had the photographs been excluded. (People v. Watson (1956) 46 Cal. 2d 818, 836 [299 P.2d 243].)\n\n3. New Trial Motion\n\nDefendant contends he is entitled to a new trial because, he claims, the court failed to rule on his motion for new trial before pronouncing judgment. (§ 1202.)\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nOn November 22, 1982, a hearing was held to consider the presentencing report, the statutory application for modification of verdict (§ 190.4, subd.\n\n(e)) and defendant's motion for new trial, as well as for the pronouncement of sentence. Before the hearing, defendant had submitted a memorandum of points and authorities in support of his motion for new trial, based on the allegedly unlawful plea agreement between his son and the government.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e At the beginning of the hearing the court stated: \"[There] has been filed in this case a memorandum of points and authorities in support of a motion for new trial. Now there is a statutory motion for new trial which, of course, the court would have to take up and consider. In any event I have and will consider those points and authorities and the arguments made both for and in opposition under the statutory motion. I will, however, if counsel desires give you a further opportunity at this time to voice your motion.\" (Italics added.) Defense counsel and the prosecutor then presented their arguments concerning the legality of the plea agreement with Kenneth Allen and its effect on the fairness of defendant's trial. At the conclusion of their argument, the trial court stated: \"Gentlemen . . . I will reserve ruling on the matter, I will consider these comments incidental to the ruling that I will make on the statutory application.\" (Italics added.) The trial court went on to explain why it felt defendant's arguments lacked merit.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nFollowing this explanation, the court once again said it would consider counsel's remarks \"incidentally\" to its ruling \"on the statutory application for a new trial and modification of verdict under section 190.4.\" The court then independently reviewed each count against defendant, finding the verdict on each to be \"supported by abundant and convincing evidence\" and \"consistent, in accord with and not contrary to, the law of the State of California.\" The court found each special circumstance \"to be true beyond a reasonable doubt and to a moral certainty\" and, following a detailed\n\nreview of the relevant considerations and evidence, concluded that \"this is one of the most serious cases ever presented to this or, possibly, any other court in California\" and that, under these facts, no modification was warranted. The court therefore denied the statutory application under section 190.4, subdivision (e). Having denied the statutory application, the court asked whether there was \"any legal cause why judgment and sentence of the court should not now be pronounced.\" Both defense counsel and the prosecutor answered \"No,\" and defendant was then sentenced to death.\n\nDefendant now contends the trial court never ruled on his motion for new trial and, therefore, he is entitled to a new trial under section 1202. It is true the court never expressly denied defendant's motion for new trial. It is abundantly clear from the record, however, that the court treated the statutory application under section 190.4 and defendant's motion for new trial essentially as a single motion,\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e and that in denying the statutory application, the court intended to deny defendant's motion for a new trial as well. The court repeatedly referred to the statutory application as a \"statutory motion for new trial\" and repeatedly stated it would consider defendant's points and authorities and oral argument \"under the statutory motion,\" and \"incidental to the ruling\" on the statutory application. Although it would have been preferable for the court to have expressly ruled on the two motions individually, under the circumstances of this case the court's ruling on the statutory application was tantamount to a ruling on defendant's motion for new trial. Thus, the trial court did not \"neglect to determine\" defendant's motion, and he is not entitled to a new trial under section 1202.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\n4. Restraint of Defense Witness\n\nAs explained above, Folsom Prison inmate John Frazier was called as a witness for the defense. After a hearing outside the presence of the jury to determine whether Frazier should be restrained while testifying, and over the strenuous objection of defense counsel, Frazier was restrained during his testimony by a nylon strap, approximately one-half inch wide, placed around his ankles and secured to the legs of his chair. He was seated in the witness chair and the restraints were applied before the jury was brought into the courtroom; following his testimony the court called a recess so that the restraints could be removed out of the jury's presence. Defendant claims the court erred in ordering Frazier be restrained during his testimony.\n\n\"[A] defendant cannot be subjected to physical restraints of any kind in the courtroom while in the jury's presence, unless there is a showing of manifest need for such restraints.\" (People v. Duran (1976) 16 Cal. 3d 282, 290-291 [127 Cal. Rptr. 618, 545 P.2d 1322, 90 A.L.R.3d 1], fn. and citations omitted.) When this \"manifest need\" appears on the record, the court is vested with discretion to order the physical restraint most suitable for a particular defendant under the circumstances. (Id., at p. 291.) Nevertheless, \"[the] imposition of physical restraints in the absence of a record showing of violence or a threat of violence or other nonconforming conduct will be deemed to constitute an abuse of discretion.\" (Ibid.) These rules apply to defense witnesses as well as defendants. (Id., at p. 288, fn. 4.)\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nAt the hearing held before Frazier testified, the prosecution presented numerous documents to support its claim that restraints were necessary. The first of these documents is a 14-page report of the California Board of Prison Terms prepared in connection with a parole consideration hearing. It details the bizarre circumstances surrounding the five murders\n\nfor which Frazier was convicted,\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e and summarizes the findings of a number of psychiatric evaluations. The most recent psychiatric evaluation had been conducted eight months previously, at which time the examining psychiatrist diagnosed Frazier as having a \"paranoid personality disorder with antisocial behavior manifestation,\" and noted that \"the prognosis would be guarded regarding his adjustment in the free community at this time.\" In an earlier evaluation, conducted in March 1971, the examining psychiatrist reported a diagnosis of \"schizophrenia, paranoid type with antisocial behavior\"; noted that Frazier's behavior \"must be considered unpredictable\"; and observed that \"in the outside community setting, the behavioral prognosis appears extremely poor and it seems rather obvious that he would constitute an exceedingly high risk in an uncontrolled setting.\"\n\nThe other documents relied on by the prosecution include a report listing Frazier's disciplinary violations while in prison; correspondences between Frazier and prison officials regarding a number of the disciplinary violations; and a series of memoranda from prison officials explaining to Frazier why he would not be allowed to receive various martial arts publications sent to him in prison. From the disciplinary report and related correspondences, it appears Frazier committed 13 disciplinary violations over 10 1/2 years. The most recent violation, and apparently the one officials considered the most serious, involved spitting in a prison guard's face and allegedly threatening to \"get\" the guard and to \"hit a cop.\" Frazier denied making the threats and maintained he spit at the guard only after the guard hit and spit on him.\n\nIn addition to these documents, the prosecutor recounted a recent phone conversation he had with Dr. Fort -- a psychiatrist who apparently was involved in Frazier's murder prosecution. Dr. Fort told the prosecutor that when he had last examined Frazier three years earlier, Frazier was a \"paranoid schizophrenic, psychotic.\" According to the prosecutor, in Dr. Fort's opinion Frazier was extremely dangerous, very resentful of authority figures, and quite probably would \"fly off the handle\" if challenged in court by an authority figure; therefore, Dr. Fort recommended some form of restraint be used on Frazier.\n\nBased on the information provided by the prosecution, the court ordered that Frazier be restrained during his testimony. The court stated that \"if we were dealing with a person who was stable, who I felt was stable, I wouldn't consider shackling for a moment.\" The court stated, however, it believed Frazier was a \"dangerously unbalanced\" individual who, as a paranoid schizophrenic, might well become \"agitated\" under the stress of cross-examination. The court observed Frazier had committed five murders under bizarre circumstances and expressed concern over Frazier's apparent \"expertise\" in martial arts. The court also noted the sheriff's office had indicated, through the Attorney General, it believed Frazier was very dangerous. In ordering Frazier restrained, the court stated it was concerned not only for the safety of those in the courtroom but also about the effect a violent outburst might have on defendant's right to a fair trial.\n\nAs we stated in Duran, when the court's determination is made in accordance with the guidelines established in that opinion the court's decision \"cannot be successfully challenged on review except on a showing of a manifest abuse of discretion.\" (16 Cal. 3d at p. 293, fn. 12.) The trial court here conducted a special hearing to determine the need for restraints, carefully considered the arguments of both counsel, and explained in some detail on the record its reasons for ordering restraints. Furthermore, the restraints used were minimally obtrusive\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e and were placed around, and removed from, Frazier's ankles outside the jury's presence.\n\nThe Courts of Appeal have generally read Duran as holding that \"it is the defendant's conduct in custody, now or at other times, or his expressed intention to escape or engage in nonconforming conduct during the trial that should be considered in determining whether there is a 'manifest need' for shackles.\" (People v. Jacla (1978) 77 Cal. App. 3d 878, 884 [144 Cal. Rptr. 23], citations omitted; see also People v. Valenzuela (1984) 151 Cal. App. 3d 180, 192-193 [198 Cal. Rptr. 469], and cases cited therein.) With the exception of the disciplinary report -- not expressly relied on by the trial court -- none of the evidence presented by the prosecution relates to Frazier's present or past conduct in custody or in the courtroom, and most of the evidence seems of limited value in predicting Frazier's future conduct in the courtroom. On the other hand, it is questionable whether these factors should be controlling when, as the record shows here, the court's finding of manifest need is based primarily on its belief that because\n\nof the witness's psychological instability, his conduct is inherently unpredictable.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e Considering the evidence as a whole, the careful consideration given to the evidence by the trial court, and the unobtrusiveness of the restraints used, we conclude there was no \"manifest abuse of discretion\" in this case.\n\nIn any event, any error was clearly harmless. As already noted, a recess was taken before and after Frazier's testimony so the jury would not see the restraints being placed on him or being removed. Indeed, there is no evidence that any of the jurors actually saw the restraints. (See, e.g., People v. Valenzuela, supra, 151 Cal. App. 3d at p. 196; People v. Zatko (1978) 80 Cal. App. 3d 534, 551 [145 Cal. Rptr. 643].)\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nFurthermore, contrary to defendant's contention, Frazier was not a \"key defense witness\" whose testimony was \"very crucial evidence to [defendant's] case.\" Defendant claims Frazier's testimony was \"crucial\" because it directly contravened the testimony of a prosecution witness, \"Joe Rainier . . . [who] testified that Rainier, Billy Ray Hamilton and [defendant] had met together on many . . . occasions.\" Rainier, however, did not testify he had met with defendant and Hamilton many times. In fact, he testified that defendant and Hamilton excluded him from most of their conversations and that on the \"very few\" occasions when the three of them talked together, the conversation lasted for only a short time because Hamilton always left shortly after Rainier approached. Furthermore, nothing in Frazier's testimony conflicts with Rainier's testimony concerning Rainier's meetings with defendant and Hamilton. Indeed, Frazier was never asked and never testified about whether he had seen Rainier, defendant and Hamilton together at Folsom.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nFinally, we note Frazier was a defense witness -- not a defendant. As we stated in Duran, although the limitation on physical restraints applies\n\nto defense witnesses as well as defendants, \"the prejudicial effect of shackling defense witnesses is less consequential since 'the shackled witness . . . [does] not directly affect the presumption of innocence.'\" (16 Cal. 3d at p. 288, fn. 4, italics added.)\n\nFor these reasons, we conclude that any error in restraining Frazier during his testimony was harmless.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\n5. Juror Misconduct\n\nAfter the prosecution finished its rebuttal argument to the jury in the late afternoon, the court informed the jurors they would be sequestered for the evening but would not receive instructions and begin deliberations until the following day. While discussing the jury's activities for the evening, the court said: \"As far as your dinner and whatnot, of course, that is all taken care of and paid for. [ para. ] There was a question by some who might like a slight glass of wine or a small beer or something like that. The State of California, and properly so, doesn't buy liquor. Now, if you want to have something to drink, that's up to you. Let your conscience be your guide.\" Solely on the basis of this comment, defendant now contends the jury engaged in misconduct by drinking intoxicating liquor.\n\nThe consumption of alcoholic beverages by jurors, whether during the presentation of evidence or during deliberation, is clearly to be discouraged. The defendant as well as the People have a right to the reasoned, dispassionate and considered judgment of the jury. Because the consumption of alcoholic beverages may impair one's ability to perceive and judge, use of such intoxicants by jurors threatens both the fairness of the trial and the integrity of the entire judicial process. Nonetheless, although some older cases held that any consumption of alcoholic beverages by the jury is reversible error per se (see, e.g., People v. Lee Chuck (1889) 78 Cal. 317, 332\n\n[20 P. 719]), the rule is now fairly well established that a verdict will not be set aside in the absence of some showing or some reasonable ground to suspect that the consumption of alcohol actually affected the jurors' capacity to competently perform their duties. (See, e.g., Hasson v. Ford Motor Co. (1982) 32 Cal. 3d 388, 412 [185 Cal. Rptr. 654, 650 P.2d 1171]; People v. Crooker (1956) 47 Cal. 2d 348, 356 [303 P.2d 753]; People v. Leary (1895) 105 Cal. 486, 493 [39 P. 24]; Annot. (1966) 7 A.L.R.3d 1040, 1040-1044.)\n\nThere is absolutely no evidence in this case that any of the jurors consumed alcohol at any time during the trial, let alone that any of the jurors became so intoxicated they were unable to competently perform their duties.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e Defendant submits no affidavits -- from jurors, trial counsel or court officials -- to support his claim of juror misconduct. Instead, he relies solely on the trial court's comment to the jury that \"if you want to have something to drink, that's up to you.\" This falls far short of the kind of showing necessary to establish juror misconduct. (See, e.g., People v. Manson, supra, 61 Cal. App. 3d 102, 215.)\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\n\nDefendant's reliance on People v. Lee Chuck, supra, 78 Cal. 317, is clearly misplaced. In Lee Chuck it was undisputed the jury began deliberations in the mid-afternoon, recessed for dinner three hours later, spent approximately one hour at dinner during which time the jurors consumed a total of six quarts of wine and a half bottle of cognac, resumed deliberations immediately after dinner, and reached a verdict against the defendant within two hours. A number of affidavits submitted by the defendant indicated not only that the jurors had consumed alcohol but that the appearance and conduct of several of the jurors suggested they were intoxicated when they resumed deliberations after dinner. Under these circumstances, we held that \" where the proof of the drinking is clear and undisputed, and that it was\n\ndone while the jury were actually deliberating upon their verdict in capital case, a verdict of conviction should not be allowed to stand.\" (Id., at p. 332, italics added.) Whatever the continued vitality of the holding in Lee Chuck (see, e.g., People v. Leary, supra, 105 Cal. at p. 493), it clearly has no application to a case such as this, in which there is absolutely no evidence that any juror consumed any alcohol at any time during the trial.\n\nGiving defendant every possible benefit of the doubt, at the very most one might infer from the court's comments to the jury that at least some of the jurors did in fact have \"a slight glass of wine or a small beer or something like that\" during dinner on the night before their deliberations began. As we have explained, this alone would not constitute juror misconduct entitling defendant to a new trial. (See People v. Crooker, supra, 47 Cal. 2d at p. 356.)\n\nWe conclude defendant has failed to establish juror misconduct or that he was denied a fair trial.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\n\n6. Cross-examination of Joseph Rainier\n\nDefendant next contends the court improperly restricted his cross-examination of prosecution witness Joseph Rainier regarding the details of Rainier's first degree murder conviction.\n\nBefore Rainier was called to testify, a conference was held outside the presence of the jury. The prosecutor informed the court that he had shown defense counsel a document entitled \"Impeachable Prior Felony Convictions (Joseph Rainier),\" and that he and defense counsel had agreed the four felony convictions listed in the document were the only felony convictions that could be used to impeach Rainier. One of the listed felonies involved the first degree murder of a small child. Because of the sensitive nature of this offense, the prosecutor asked the court for a ruling that defense counsel not be allowed to cross-examine Rainier on the specific facts of the murder conviction. Defense counsel objected to any such limitation, stating that if the fact that the murder victim was a small child became relevant during cross-examination, he planned to ask Rainier about this and other details of the offense.\n\nThe court stated that although the existence of the prior murder conviction was clearly relevant for impeachment purposes, the court at that time could see no relevance to the specific circumstances surrounding the conviction. The court therefore ruled that, absent some showing of relevance, defense counsel should limit his cross-examination to establishing the type of felony for which Rainier was convicted and the date and place of the conviction. The trial court made clear, however, that if at any point defense counsel believed the details of the murder were relevant to an issue in the case, the court would allow defense counsel to explore the matter on cross-examination, provided he made some suggestion or showing of relevance to the court outside the presence of the jury. In response to the trial court's ruling, defense counsel stated only: \"If I do intend to ask questions that go to the factual background . . . it might be appropriate to make an offer of proof. But I don't even know if I'm going to get to that.\" At no time during the conference on the matter or during the subsequent cross-examination of Rainier, did defense counsel ever suggest to the court a theory of relevance. Nor did he at any time indicate even that he believed the details of Rainier's prior conviction were relevant or that he wished to question Rainier on the subject. Defense counsel told the court only that if at some point during cross-examination he believed the facts underlying the conviction were relevant, he wanted to be able to ask Rainier about them.\n\nDefendant now contends for the first time on appeal that the details of Rainier's first degree murder conviction were relevant to establish his motive for testifying and, therefore, evidence regarding the details of the murder was admissible under Evidence Code section 780, subdivision (f).\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e While serving a life sentence in Folsom Prison, Rainier received information that his life was in danger, apparently because his fellow inmates looked unfavorably on the fact that he had murdered a small child. Without explaining the reason his life was threatened, Rainier testified on direct examination that after learning his life was in danger, he became so concerned for his safety that he asked prison officials to put him in \"lock up.\" As Rainier later explained, being placed in \"lock up\" meant he was locked in his cell 24 hours a day with no access to the yard or educational facilities and no visiting privileges. Rainier further testified on direct examination that because of fear for his safety and his discontent with being locked in a cell 24 hours a day, he contacted the Attorney General's office and agreed to testify against defendant in exchange for protective custody in another institution. Rainier testified he also expected to receive a letter in his file\n\nindicating that he had cooperated with law enforcement officials; he hoped this letter would be helpful if he ever became eligible for parole or a clemency hearing. Defense counsel cross-examined Rainier at great length regarding his motivation for testifying.\n\nDefendant now contends the jury could not fully appreciate the depth of Rainier's desire for protective custody and, therefore, the depth of his motivation to testify against defendant, without understanding the reason Rainier's life had been threatened -- i.e., because he had murdered a small child. Thus, defendant argues, evidence concerning the details of the murder were relevant and the trial court erred in \"precluding\" defense counsel from exploring this subject on cross-examination. There is no merit to defendant's contention.\n\nFirst, and contrary to defendant's view, it is far from clear that details of Rainier's murder conviction were relevant under Evidence Code section 780, subdivision (f). Although the fact that Rainier feared for his life and apparently believed his safety could be assured only by obtaining protective custody was clearly relevant to the issue of his motivation to testify for the prosecution, it is difficult to see how the underlying reason for his fear was relevant. Defendant appears to suggest that the circumstances surrounding Rainier's murder conviction were relevant because they tend to demonstrate he had good reason to fear for his life. But whether Rainier's fear was objectively reasonable would appear to be irrelevant to the issue of motivation. By definition, one's motivation to act depends upon one's own perception of the various risks and benefits involved. Rainier made it clear on direct examination that he had a sincere and profound concern for his safety -- so profound that he asked to be placed in \"lock up\" and refused to leave his cell -- and that it was this profound fear that motivated him to contact the Attorney General's office and agree to testify in exchange for protective custody. The fact that Rainier's subjective fear was well founded or objectively reasonable simply has no \"tendency in reason to prove or disprove any disputed fact that is of consequence to the determination\" of Rainier's credibility as a witness. (Evid. Code, § 210.)\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\n(See fn. 31.) Moreover, it is patently clear from the record that the court did not \"preclude\" counsel from asking Rainier about the details of his murder conviction. The court went to great lengths to explain to defense counsel that if at any time he could suggest any relevance to such evidence, the court would permit him to pursue the subject on cross-examination.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e At the time of the court's ruling and, indeed, throughout the trial, it appears both the court and defense counsel believed evidence concerning Rainier's conviction was relevant only to establish an \"impeachable\" prior felony conviction. (Evid. Code, § 788.) Evidence of prior felony convictions offered for this purpose is restricted to the name or type of crime and the date and place of conviction. (People v. Schader (1969) 71 Cal. 2d 761, 773 [80 Cal. Rptr. 1, 457 P.2d 841]; People v. Smith (1966) 63 Cal. 2d 779, 790 [48 Cal. Rptr. 382, 409 P.2d 222]; People v. Terry (1974) 38 Cal. App. 3d 432, 446 [113 Cal. Rptr. 233].) Thus, the trial court was correct in ruling that, unless and until defense counsel could suggest some other theory of relevance, inquiry into the details of Rainier's conviction would not be permitted.\n\nWe conclude the trial court did not improperly restrict defendant's right to cross-examination.\n\n7. Other Crimes Evidence\n\nDefendant claims error because his former associates -- Charles Jones, Carl Mayfield, Eugene Furrow, Benjamin Meyer, Shirley Doeckel, and Barbara Carrasco -- testified as to the details of his prior convictions of burglary (of Fran's Market), murder (of Mary Sue Kitts), subsequent robberies (both convictions and uncharged crimes involving all of the above\n\nand others), and frequent boasts that he previously had, and could then order, people killed. He seems to concede the evidence was relevant to ultimate facts actually in dispute (People v. Tassell (1984) 36 Cal. 3d 77, 84 [201 Cal. Rptr. 567, 679 P.2d$1]), namely, intent and identity. He maintains, nevertheless, there was prejudicial error because the witnesses' testimony was not limited to the bare fact that prior acts and crimes occurred and that they had witnessed them or testified against defendant in former trials, but they were allowed to testify to the details of the prior acts and crimes and defendant's involvement in them.\n\nDefendant suggests the details of his role in the former acts and crimes were relevant only to show his propensity to commit crime -- an obviously improper use of such evidence (Evid. Code, § 1101, subd. (a)) -- and therefore the court erred in not limiting the witnesses' testimony accordingly.\n\nThis claim cannot be asserted now, because it was not raised below as required by Evidence Code section 353, subdivision (a).\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e (People v. Stuller (1970) 10 Cal. App. 3d 582, 590-599 [89 Cal. Rptr. 158, 41 A.L.R.3d 712]; People v. Ferrel (1972) 25 Cal. App. 3d 970, 976 [102 Cal. Rptr. 372].) In any event, on the facts of this case, such an objection would have been meritless.\n\nIt cannot be reasonably argued that details of the former acts and crimes were not relevant to establishing defendant's identity as the mastermind of the murders and conspiracy and his intent in those crimes: Only by hearing details of the witnesses' former testimony (and hence defendant's role in those events) could the jury properly put in perspective the significance of the former testimony and thus understand defendant's motive in ordering them killed.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e (See fn. 34.) Nor is it apparent on these facts that the court would or should have precluded testimony of details as to defendant's actions under Evidence Code section 352, or that failure to do so resulted in a miscarriage of justice. (Cal. Const., art. VI, § 13; People v. Watson, supra, 46 Cal. 2d 818, 836.)\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\n\n8. Prosecutorial Misconduct\n\nDefendant finally claims his conviction must be set aside because the prosecutor, at closing argument, allegedly stated defendant had killed Eugene Furrow in Mexico, that he was a hit man for the Mafia, that he had murdered two people in Las Vegas \"to keep everyone in line,\" and that he created a mystique among those around him that he was capable of and had committed murder. Defendant neither objected to this alleged misconduct nor did he request an appropriate admonition. Assuming this claim is properly before us (People v. Green (1980) 27 Cal. 3d 1, 34 [146 Cal. Rptr. 1, 609 P.2d 468]), we reject it as unfounded. The record shows clearly that although the prosecutor discussed the above subjects -- all of which had previously been testified to by defendant's former \"employees\" -- he carefully characterized them as being not statements of fact, but \"boasts\" and \"threats\" used repeatedly by defendant to create a mystique to keep those working for him from talking.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e We conclude the prosecutor's argument was proper and fully supported by the record.\n\nIII. Special Circumstances Issues\n\nDefendant claims it was error for the prosecution to submit, and for the jury to find true, six \"multiple murder\" special circumstances instead of one, two \"killing of a witness\" special circumstances instead of one, and three \"prior murder conviction\" special circumstances instead of one.\n\n1. Multiple-murder Special Circumstances\n\nSection 190.2, subdivision (a)(3), defines as a special circumstance a situation in which \"[the] defendant has in this proceeding been convicted of more than one offense of murder in the first or second degree.\" A plurality held in People v. Harris (1984) 36 Cal. 3d 36 [201 Cal. Rptr. 782, 679 P.2d 433], \"alleging two special circumstances for a double murder improperly inflates the risk that the jury will arbitrarily impose the death penalty, a result also inconsistent with the constitutional requirement that the capital sentencing procedure guide and focus the jury's objective consideration of the particularized circumstances of the offense and the individual offender. (Jurek v. Texas (1976) 428 U.S. [262] at pp. 273-274 [49 L.Ed.2d 929, 96 S.Ct. 2950].)\" (36 Cal. 3d at p. 67.) Pursuant to our reasoning in Harris, appropriate charging papers should allege one multiple-murder special circumstance separate from the individual murder counts. (Ibid.) It follows that five of the six multiple-murder special circumstances should be set aside, and only one should have been found true.\n\n2. Witness-killing Special Circumstances\n\nSection 190.2, subdivision (a)(10), defines as a special circumstance (i) the intentional killing of a victim to prevent his testimony in any criminal proceeding (when the killing was not committed during the commission, or attempted commission of the crime to which he was a witness) \"or\" (ii) the intentional killing of a victim who was a witness to a crime in retaliation for that witness's testimony in any criminal proceeding. The section obviously addresses two separate situations in which a witness-related killing will be a special circumstance. Nothing suggests that evidence supporting findings on both theories permits the People to charge and the jury to find two separate special circumstances. Indeed, the opposite seems better to reflect the drafters' probable intent: a defendant who is shown to have violated a particular special circumstance in more than one way is \"guilty\" of no more than one of such a special circumstance violation. Of course, evidence supporting the alternative theories of violation would be properly before the jury in any event; we therefore reject the People's suggestion that our construction of the statute forces the People to promote one societal interest over the other simply because both are established by\n\na single course of conduct. The presence of evidence supporting both theories of violation can properly be emphasized by the prosecutor in order to stress to the jury the extent to which societal interests that underlie the witness-killing special circumstance have been violated. We conclude that only one witness-killing special circumstance should have been found true.\n\n3. Prior-murder-conviction Special Circumstances\n\nSection 190.2, subdivision (a)(2), defines as a special circumstance the situation in which \"[the] defendant was previously convicted of murder in the first degree or second degree.\" Pursuant to our reasoning in Harris, supra, 36 Cal. 3d 36, two of the three prior-murder-conviction special circumstances should be set aside, and only one should have been found true.\n\nDefendant argues that even this remaining special circumstance finding should be set aside because it was not properly pleaded. Instead of alleging the prior-murder-conviction special circumstance pursuant to defendant's present first degree murder convictions under section 190.2, subdivision (a)(2), the introductory clause of each of the three disputed pleading paragraphs erroneously alleged the special circumstance under section 190.2, subdivision (b), which subdivision does not support a prior murder special circumstance. This technical omission, however, does not invalidate the special circumstance finding. Defendant was clearly on notice that he was on trial for first degree murder and that his prior murder conviction was therefore being alleged as a special circumstance. Indeed, each of the challenged pleading paragraphs concluded with the express allegation that defendant was previously \"convicted in the Superior Court of the State of California, County of Fresno, of first degree murder in violation of Penal Code section 187, within the meaning of Penal Code section 190.2 [, subdivision] (a)(2).\" (Italics added.) In any event, we would conclude that any defect in the pleading was waived by defendant's failure to object below. (§ 1012.) Accordingly, the prior-murder-conviction special circumstance was properly found true.\n\nIV. Penalty Phase Issues\n\n1. Witherspoon Error\n\nDefendant claims his death sentence must be reversed because one prospective juror, Mr. Millar, was allegedly excused contrary to the rule in Witherspoon v. Illinois (1968) 391 U.S. 510 [20 L.Ed.2d 776, 88 S.Ct. 1770], under which exclusion is proper only if a juror makes it \"unmistakably clear . . . that [he] would automatically vote against the imposition of capital\n\npunishment without regard to any evidence that might be developed at the trial of the case . . . .\" (Id., at p. 522, fn. 21 [20 L.Ed.2d at p. 785, fn. 21]; People v. Velasquez (1980) 26 Cal. 3d 425, 436 [162 Cal. Rptr. 306, 606 P.2d 341].) As the People point out, the United States Supreme Court has since apparently retreated from this standard. In Wainwright v. Witt (1985) 469 U.S. 412 [83 L.Ed.2d 841, 105 S.Ct. 844], the court \"clarified\" the \"proper standard for determining when a prospective juror may be excluded for cause because of his or her views on capital punishment. That standard is whether the juror's views would 'prevent or substantially impair the performance of his duties as a juror in accordance with his instructions and his oath.' We note that, in addition to dispensing with Witherspoon's reference to 'automatic' decisionmaking, this standard likewise does not require that a juror's bias be proved with 'unmistakable clarity.' This is because determinations of juror bias cannot be reduced to question-and-answer sessions which obtain results in the manner of a catechism. What common sense should have realized experience has proved: many veniremen simply cannot be asked enough questions to reach the point where their bias has been made 'unmistakably clear'; these veniremen may not know how they will react when faced with imposing the death sentence, or may be unable to articulate, or may wish to hide their true feelings. Despite this lack of clarity in the printed record, however, there will be situations where the trial judge is left with the definite impression that a prospective juror would be unable to faithfully and impartially apply the law. For reasons that will be developed more fully infra, this is why deference must be paid to the trial judge who sees and hears the juror.\" (Id., at pp. 424-426 [83 L.Ed.2d at pp. 851-853, 105 S.Ct. at pp. 852-853], fns. omitted, quoting Adams v. Texas (1980) 448 U.S. 38, 45 [65 L.Ed.2d 581, 589-590, 100 S.Ct. 2521].)\n\nAfter reviewing the voir dire transcript of prospective Juror Millar we conclude that even under the more stringent Witherspoon standard he was properly excused. His answers to questions were conflicting and demonstrate a substantial reluctance to impose the death penalty. Unlike the prospective juror improperly excluded in Velasquez -- who \"went no further than to affirm that she would 'most likely' vote against death unless the case was 'really heinous'\" (26 Cal. 3d at p. 443) -- Mr. Millar made it unmistakably clear he would automatically oppose a death verdict. His final exchange with the trial court summarized his position:\n\n\"The Court: All right. . . . As I understand your answer, Mr. Millar, . . . you are telling us that in every case where you were given the opposition of life imprisonment or death, that you would in every case without regard to the facts that justify or might be considered relative to punishment you would in every case vote for life imprisonment without parole?\n\n\"R.T. Millar: That is correct.\n\n\"The Court: Under the circumstances I feel the challenge is proper. I will accept the challenge. Thank you, Mr. Millar, you are excused, we appreciate your candor.\"\n\n2. Former CALJIC Nos. 8.84.1 and 8.84.2\n\nDefendant next notes: (i) the jury was instructed pursuant to former CALJIC No. 8.84.1 on the factors it was to consider in determining defendant's penalty and it was not given the \"expanded factor 'k'\" instruction subsequently prescribed in People v. Easley (1983) 34 Cal. 3d 858 [196 Cal. Rptr. 309, 671 P.2d 813], nor was it otherwise instructed that it might consider \"sympathy\" factors favoring defendant; and (ii) the jury was instructed pursuant to former CALJIC No. 8.84.2, that it was to impose a sentence of death if it found aggravating circumstances outweighed mitigating circumstances, and it was not given further instructional clarification as to the scope of its discretion pursuant to People v. Brown (1985) 40 Cal. 3d 512, 545, footnote 17 [220 Cal. Rptr. 637, 709 P.2d 440], certiorari granted on another ground U.S. [90 L.Ed.2d 717, 106 S.Ct. 2274].\n\nViewing the first defect in light of the evidence and arguments presented, we conclude the penalty verdict need not to be reversed on the basis of that defect alone. Despite the absence of an expanded factor k instruction, the jury was presented with \"sympathy\" evidence in the penalty phase: Defendant's witness, Diane Harris, testified he was good to children, that he helped her in an emergency, and that he wrote poetry. Significantly, the prosecutor said nothing to suggest the jury should not consider such evidence; on the contrary, the thesis of his argument was that it was quite proper for the jury to consider such evidence, but that defendant's mitigating evidence was \"as good as nothing . . . . If anything, it's just the most pathetic, almost invisible mitigating evidence that you have ever seen.\"\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e\n\nAs to the second defect, we explained in People v. Brown, supra, that the statute's \"weighing process\" described in former CALJIC No. 8.84.2, is the method by which \" the jury. . . determines under the relevant evidence which penalty is appropriate in a particular case.\" (40 Cal. 3d at p. 542, italics added.) Our concern in Brown was that the unadorned statutory instruction might in two interrelated ways lead the jury to misapprehend its discretion and responsibility.\n\nFirst, we pointed out that the jury might be confused about the nature of the weighing process. As we observed: \"[The] word 'weighing' is a metaphor for a process which by nature is incapable of precise description. The word connotes a mental balancing process, but certainly not one which calls for a mere mechanical counting of factors on each side of the imaginary 'scale,' or the arbitrary assignment of 'weights' to any of them. Each juror is free to assign whatever moral or sympathetic value he deems appropriate to each and all of the various factors he is permitted to consider.\" (40 Cal. 3d at p. 542.)\n\nSecond, we were concerned in Brown that the unadorned instruction's phrase, \"the trier of fact . . . shall impose a sentence of death if [it] concludes that the aggravating circumstances outweigh the mitigating circumstances\" (italics added), could mislead the jury as to the ultimate question it was called on to answer in determining which sentence to impose. Although the quoted phrase could be understood to require a juror (i) to determine whether \"the aggravating circumstances outweigh the mitigating circumstances\" without regard to the juror's personal view as to the appropriate sentence, and then (ii) to impose a sentence of death if aggravation outweighs mitigation even if the juror does not personally believe death is the appropriate sentence under all the circumstances, we concluded in Brown that the statute was not intended to, and should not, be interpreted in that fashion. Instead we stated: \"By directing that the jury 'shall' impose the death penalty if it finds that aggravating factors 'outweigh' mitigating, the statute should not be understood to require any juror to vote for the death penalty unless, upon completion of the 'weighing' process, he decides that death is the appropriate penalty under all the circumstances. Thus the jury, by weighing the various factors, simply determines under the relevant evidence which penalty is appropriate in the particular case.\" (40 Cal. 3d at p. 542, italics added, fn. omitted; see also id., fn. 13.)\n\nAlthough we called for clarifying instructions in future cases, we stated we would examine each prior case \"on its own merits to determine whether, in context, the sentencer may have been misled to defendant's prejudice about the scope of its sentencing discretion under the 1978 law.\" (Id., at p. 545, fn. 17.)\n\nWhile quite properly arguing to the jury that it should consider and be persuaded by the character of aggravating factors, the prosecutor not once suggested the weighing process was a mechanical function. Indeed, he effectively told the jury just the opposite, and attempted to give guidelines that could be applied by each individual juror to first value and then weigh the respective factors. In discussing defendant's violent criminal activities, he stated \"[ How ] do you really weigh, I mean even on the surface it's\n\nobvious that these are very aggravating circumstances. But, how do you really weigh the amount of aggravation caused by the circumstances of the murders on which you found the defendant guilty of these prior violent crimes? How do you really weigh that ? [ para. ] Well, again, what is [defendant's] responsibility? We have to keep coming back to that.\" (Italics added.)\n\nThereafter, the prosecutor discussed with the jury the problem of \"quantifying\" the seriousness of defendant's crime. It is clear that the prosecutor was again discussing the crime from a qualitative or moral standpoint (People v. Haskett (1982) 30 Cal. 3d 841, 863-864 [180 Cal. Rptr. 640, 640 P.2d 776]): \"How do we quantify, how do we measure the human suffering, the severity, the seriousness of these crimes we are now talking about? Ten different criminal transactions. We are talking about the three murders in this case, the executions, I shouldn't call them murders, executions in this case, conspiracy to commit the executions. How do we quantify that? How do we measure that when we are trying to weight these aggravating circumstances ? [ para. ] One way to do it, ladies and gentlemen, is to just, considering both these crimes and the executions in our case and the prior crime, is . . . to look at it through the perspective of some of the victims.\"\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e Turning to the mitigating circumstances, the prosecutor (as noted above) recognized the propriety of such evidence and argued forcefully that defendant's mitigating evidence was unpersuasive.\n\nAll of this discloses that the prosecutor did nothing to mislead the jury about its weighing discretion and that he in fact left it with the understanding that the value to be assigned to the aggravating and mitigating factors was a matter to be decided by each individual juror.\n\nNor can we conclude from our review of the record that the jury was misled by the unadorned instruction about its sole responsibility to determine, based on its individualized weighing discretion, whether death is appropriate in this case. The prosecutor's argument here was unlike that in other cases in which the People may have left a jury with the impression that its responsibility was merely to weigh aggravating and mitigating factors without regard to its view of the appropriateness of the alternative penalties, and that it was \"required\" to return a sentence of death if \"aggravation outweighed mitigation\" without, or even despite, each juror's personal conclusion from the evidence, about whether a sentence of death was appropriate under the circumstances for the offense and offender. Instead, the exclusive focus of the prosecutor's argument here was aimed at convincing\n\nthe jury that death, and not life in prison without possibility of parole, is the appropriate penalty for this defendant. The prosecutor made this explicit in the closing words of his argument: \"How can life in prison without the possibility of parole be an appropriate punishment for a man who masterminded the murder of three young people from behind prison walls while serving a term with a maximum life sentence?\" The prosecutor's message was that the jury, and the jury alone, was charged with the duty to determine whether death or life imprisonment without possibility of parole is, under all the circumstances, the appropriate punishment in this case.\n\nWe reach this conclusion despite the fact that, as defendant observes, the prosecutor in one reference emphasized the mandatory wording of the statutory instruction. He told the jury it would be instructed that \"'if you conclude that the aggravating evidence outweighs the mitigating evidence, you shall return a death sentence.' [ para. ] Shall, not may, not might, not maybe. It is very explicit. If the aggravating evidence outweighs the mitigating evidence you shall return a verdict of death.\" (Italics added.) The crucial question is whether, having heard the statutory instruction, and having heard the prosecutor's emphasis on that instruction, the jury may have been misled as to its sole responsibility and authority to determine what penalty is appropriate. The record shows that, viewed in context, the instruction and the prosecutor's remark could not reasonably have so misled the jury.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e\n\nDuring voir dire the prosecutor had carefully questioned each juror about whether he could faithfully and impartially apply our state's death penalty law and return a verdict of death even if the evidence showed defendant was not the actual killer. Each selected juror responded that he could and would so follow the law if the evidence supported such a verdict.\n\nIn his closing argument, immediately after quoting and commenting on the \"shall\" language, the prosecutor returned the jury to his voir dire questions: \"[Going] back to the jury selection process, we asked each of you whether or not, under the appropriate circumstances, you could return a death penalty even though the defendant never pulled the trigger. And each of you said you could if that's what the law said and the evidence justified it.\" The prosecutor then argued that a person who orders executions,\n\nas opposed to one who actually commits the murders, is in many cases, \"the most morally culpable,\" and that defendant \"deserves the maximum penalty that the law allows.\" Shortly thereafter, the prosecutor argued that the jury should not be persuaded by a defense argument \"that by voting for the death penalty in this case you are committing murder.\" He reminded the jury that \"if you vote for the death penalty in this case you will not be doing anything unlawful. You will simply be following the law and giving the defendant his just desserts.\" His final words to the jury were these: \"The defense is mentioning God. They may call upon God to show mercy on the defendant. And, as I said before, you know what mercy he has shown to all these victims in this case. If ever there was a case, ladies and gentlemen, for capital punishment, this is the case. If there is no death penalty in this case, there should be no death penalty. [ para. ] What we are asking you to do, ladies and gentlemen, is follow the law. Consider the evidence, render a just verdict, do your duty, follow your oath. What we are asking for is justice. The defendant may ask you for God's mercy, ladies and gentlemen. And after you have rendered a just verdict, let God have mercy on the soul of Clarence Ray Allen.\" (Italics added.)\n\nViewed in the context of the People's argument, it is apparent that a reasonable juror would have interpreted the statutory \"shall\" language, and the prosecutor's emphasis on that language, not as suddenly divesting him of his discretion to determine whether death or life without parole is the appropriate penalty in this case, but instead as directing him to abide by his voir dire representations, and, in the prosecutor's words, \"do [his] duty, [and] follow [his] oath\" to impose the death penalty if, after considering all the aggravating and mitigating evidence, he concluded death was the appropriate penalty. A contrary understanding by any juror would have been unreasonable, because such an interpretation of the prosecutor's remark would contradict the thesis of the prosecutor's entire argument and it would render meaningless his express plea that the jury find death to be \" appropriate \" and \" justified \" in this case.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e\n\nFor these reasons we conclude it is not likely the jury was \"misled to defendant's prejudice about the scope of its sentencing discretion under the 1978 law.\" (Brown, supra, 40 Cal. 3d at p. 545, fn. 17.)\n\n3. Prejudicial Effect of Excessive Special Circumstances\n\nDefendant next claims the death penalty must be set aside because the jury was erroneously allowed to consider 11 special circumstances as aggravating factors when, as we have noted (ante, pp. 1273-1274), only 3 special circumstances (multiple murder, killing a witness to prevent testimony or for retaliation, and prior-murder conviction) were properly to be considered as aggravating factors.\n\nOf course, any \"substantial error\" at the penalty phase of a capital case requires reversal of a judgment of death. (People v. Robertson (1982) 33 Cal. 3d 21, 54 [188 Cal. Rptr. 77, 655 P.2d 279] (plur. opn.) \u0026 63 (Broussard, J., conc.).) Whether an error concerning the evidence used by a jury in its sentencing decision is \"substantial,\" requires \"a careful consideration whether there is any reasonable possibility that [the] error affected the verdict.\" (33 Cal. 3d at p. 63 (Broussard, J., conc.); People v. Davenport (1985) 41 Cal. 3d 247, 280 [221 Cal. Rptr. 794, 710 P.2d 861] (plur. opn.) \u0026 295 (Broussard, J., conc.); People v. Phillips (1985) 41 Cal. 3d 29, 83 [222 Cal. Rptr. 127, 711 P.2d 423] (plur. opn.), 84 (Kaus, J., conc.) \u0026 85-89 (Bird, C. J., conc. \u0026 dis.).) Furthermore, as Justice Broussard observed, \"[we] cannot . . . avoid that analysis on the grounds that no one knows what seemingly insignificant factor might have tipped the scales in the mind of a single juror.\" (People v. Robertson, supra, 33 Cal. 3d at p. 63.)\n\nThe jury was instructed to consider all of the evidence, and to be guided by the statutory factors, among which were \"[the] circumstances of the crime of which the defendant was convicted in the present proceeding and the existence of any special circumstances admitted or found to be true.\" These instructions, which permitted the jury to consider the five excessive multiple-murder special circumstances, the one excessive witness-killing special circumstance, and the two excessive prior-murder-conviction special circumstances (ante, pp. 1273-1274), did not permit consideration of any evidence that was not otherwise admissible and relevant to the penalty decision. The jury was fully aware of the three murders of which defendant had been convicted in the same proceeding (one of which was also a witness-killing murder), and of the single first degree murder for which defendant had been previously convicted. The jury was therefore fully aware that the multiple-murder special circumstances involved three and only three murders, that the witness-killing special circumstances involved one and only one such killing, and that the prior-murder-conviction special circumstances involved one and only that one prior murder. Indeed, these facts were emphasized by the prosecutor during his penalty phase argument, in which he first discussed the single murder that underlay the two witness-killing\n\nspecial circumstances, and proceeded to explain \"how we arrived at\" the remaining special circumstances. Those nine special circumstances, the prosecutor explained, \"are the result of the fact that [defendant] has been, either in this proceeding or in the 1977 trial, convicted of four separate counts of first degree murder. Any time someone who has been convicted of a first degree murder and has another murder conviction in the same proceeding or in an earlier proceeding, that is a special circumstance. So, for instance, as to Bryon Schletewitz, [defendant] was convicted of the first degree murder of Bryon Schletewitz and the murder of Josephine Rocha, that's one, and the murder of Douglas White, that is the second, and the prior murder of Mary Sue Kitts, that is three special circumstances. And similarly . . . you have found . . . [defendant] was convicted of the first degree murder of Douglas Scott White in this proceeding, and he also has three other murder convictions, the Schletewitz murder, the Rocha murder, and the Mary Sue Kitts murder. So [that is] the way we arrive at the eleven special circumstances . . . . So, you see, that is how we arrived at the eleven special circumstances which the law tells us you must consider.\"\n\nThat the prosecutor, both in the above statement and twice immediately before\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e mentioned the number of special circumstances as 11 instead of 3 cannot, on the facts of this case, reasonably be said to constitute substantial error requiring reversal of the penalty. As noted above, the clear thrust of the prosecutor's penalty phase argument was aimed not at the special circumstance findings, but at establishing defendant's present and prior convictions and uncharged crimes as aggravating factors militating in favor of the appropriateness of the death penalty: Although he discussed the special circumstances in rather summary fashion in merely two pages of the reporter's transcript, he spent over fifty-eight pages emphasizing and detailing the present and prior convictions and uncharged crimes as aggravating circumstances. In view of the fact that, as discussed above, we are confident the jury understood the scope of its sentencing role, and that it knew of its exclusive discretion to determine whether death is appropriate in this case -- and in the face of the People's overwhelming penalty evidence, and the comparatively slight emphasis put on the special circumstances as aggravating factors and concomitant major emphasis on defendant's present and\n\nformer convictions and uncharged crimes as aggravating factors -- it cannot be said there is any reasonable possibility the complained-of error affected the penalty verdict.\n\n4. Age as an Aggravating Factor\n\nPursuant to former CALJIC No. 8.84.1, subdivision (i), the jury was instructed to consider defendant's age at the time of the crime in its weighing of aggravating and mitigating factors. In People v. Rodriguez, ante, pages 730, 789 [230 Cal. Rptr. 667, 726 P.2d 113], we held that age \"should not of itself be deemed an aggravating factor.\" (Italics in original.)\n\nHere, without objection, the prosecutor three times during his lengthy penalty argument told the jury that defendant's age was an aggravating factor. At the beginning of his argument he stated: \"Just to give you the overview . . . you should consider prior felony convictions here. We have proven nine prior felony convictions. We will talk in more detail about that later. Also, age is an aggravating factor in this case in the sense that these are sophisticated crimes, the defendant was not immature when he got himself involved in these criminal activities, so the age is also an aggravating circumstance. Later on, I will talk about the possible mitigating factors.\" (Italics added.) Shortly thereafter he mentioned age again, apparently as an afterthought: \"However, before we get into the discussion of how we proved those ten prior crimes and the facts of those prior crimes beyond a reasonable doubt, I have already mentioned age as an aggravating factor. I think I should [now mention] the prior felony convictions because that is fairly simple and straight forward and not very time consuming. . . .\" (Italics added.)\n\nFinally, near the conclusion of his argument, he mentioned age as the last factor in the \"mountain of aggravating factors\": \"[Ladies] and gentlemen, we have a veritable mountain of evidence. The circumstances of the crime we have just been through, the horror suffered by the victims, the premeditated nature of the crime, the prior violent criminal activity, ten prior violent crimes with numerous victims, people who were shot, people who were robbed, people murdered, prior felony convictions, nine prior felony convictions. Age is an aggravating factor because of the sophistication, because of the maturity of the defendant, so we have a mountain of aggravating circumstances. . . .\" (Italics added.)\n\nThe prosecutor in Rodriguez did not suggest to the jury that age was an aggravating factor; instead, he merely argued that the defendant's age in that case was not a mitigating factor. (Ante, at p. 789.) Although the prosecutor's\n\nargument here is contrary to the rule expressed in Rodriguez, we do not consider this to be reversible misconduct, because a timely objection and admonition could have cured any harm. (People v. Green, supra, 27 Cal. 3d 1, 27.)\n\nIn any event, we would conclude it is not reasonably possible that the prosecutor's statements about age as an aggravating factor affected this verdict. As noted above, we are confident that the jury understood the scope of its sentencing role and its exclusive discretion to determine whether death is appropriate in this case. Given this, and given the extraordinarily massive amount (and potentially influential character) of aggravating evidence properly before this jury, it would require unwarranted speculation on our part to hold that the above quoted rather fleeting references to defendant's age as an aggravating factor reasonably possibly affected the verdict.\n\nOur conclusion remains the same even when we consider the \"cumulative effect\" of the seven excessive special circumstance findings together with the present defect: on the facts of this case, it simply cannot be said there is any reasonable possibility the complained-of errors affected this jury's penalty verdict.\n\n5. Other-crimes Evidence\n\nDefendant claims for the first time on appeal the admission of other uncharged crimes involving force or violence was \"error\". He recognizes that section 190.3, subdivision (b) specifically provides for such evidence, but argues that the statute denies due process insofar as it permits a jury that has already decided guilt to also consider such crimes on the issue of penalty. We rejected the identical claim in People v. Balderas (1985) 41 Cal. 3d 144, 204-206 [222 Cal. Rptr. 184, 711 P.2d 480].\n\n6. Exclusion of Mitigating Evidence\n\nJust as section 190.3 permits the People to introduce certain other-crimes evidence at the penalty phase, it also permits the defendant to present mitigating evidence relating to his character, background, history and mental condition. (Id., subd. (k); People v. Easley, supra, 34 Cal. 3d 858, 878; People v. Brown, supra, 40 Cal. 3d 512, 541.) In this regard, defendant put on a single character witness, his ex-girlfriend, Diane Harris. He complains now that the court erred in its exercise of discretion under Evidence Code section 352 in sustaining objections to three questions posed to witness Harris. The first asked Harris to describe what she meant when she had answered a previous question by stating that when defendant's niece lived with him, the niece's bedroom was furnished \"beautifully.\" The second\n\nasked Harris if the niece underwent a personality change while living with defendant. The third inquired \"what was [defendant's] attitude toward children?\"\n\nWe perceive no error. As to the first question, the court was well within its discretion under Evidence Code section 352, because the witness had already testified the bedroom was furnished beautifully and because descriptions of furnishings would have been irrelevant and would have unduly consumed time and misled the jury. As to the second question, we hold that absent an explanation from counsel about what he meant by \"personality change,\" the objection was properly sustained.\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e Finally, as to the third question we note that the witness was, in fact, allowed to testify that defendant liked children and was always good to them.\n\n7. Constitutional Challenge to the 1978 Statute\n\nDefendant asserts the 1978 statute is unconstitutional because it fails to (1) specifically enumerate separately aggravating and mitigating factors; (2) exclude nonstatutory aggravating factors as a basis for the death penalty; (3) require written findings on the aggravating factors; (4) require that aggravating factors be proved beyond a reasonable doubt; (5) require that the aggravating factors supporting a death verdict be found unanimously; (6) require the jury find beyond a reasonable doubt that aggravating factors outweigh those in mitigation and that death is the appropriate punishment; and (7) require \"intercase\" proportionality review. We rejected an essentially identical constitutional attack in People v. Rodriguez, supra, ante, pp. 730, 777-779. For the reasons expressed therein we conclude the 1978 statute is not unconstitutional on the asserted grounds.\n\nDefendant additionally argues that his sentence cannot stand under People v. Dillon (1983) 34 Cal. 3d 441, 477-482 [194 Cal. Rptr. 390, 668\n\nP.2d 697], and In re Lynch (1972) 8 Cal. 3d 410, 423-429 [105 Cal. Rptr. 217, 503 P.2d 921]. In view of the facts set out ante, at pages 1236-1247, defendant simply cannot credibly assert that the punishment imposed is disproportionate to his individual culpability. Nor is there merit in any assertion that the punishment prescribed for the offense in question is more severe than that prescribed for less serious crimes, or that the death penalty for defendant's crime is disproportionate to the punishment prescribed for the same offense in other jurisdictions.\n\nDefendant further claims capital defendants are denied equal protection unless they receive the benefits of the \"disparate sentence\" statute, section 1170, subdivision (f). We cannot agree.\n\nSection 1170, subdivision (f) was adopted to promote the uniform-sentence goals of the determinate sentencing law (DSL). (People v. Martin (1986) 42 Cal. 3d 437, 442 [229 Cal. Rptr. 131, 722 P.2d 905].) The statute requires the Board of Prison Terms (BPT) to review every sentence imposed pursuant to the DSL within one year to determine, by statistical simulation and review of comparable cases, whether it is \"[substantially] [different]\" from the expectable range of \"'sentences imposed on other offenders committing the same offense under similar circumstances.'\" (Id., at p. 441, see 60 Ops.Cal.Atty.Gen. 143, 147 (1977).) Within 120 days after the BPT notifies the sentencing judge that a sentence is \"disparate,\" he must conduct a new sentence hearing, in which he gives \"great weight\" to the board's finding. Thus, he must accept the finding of \"disparity\" unless he determines on substantial evidence that the board selected the wrong comparison group, or that it erred in finding a \"significant\" difference from sentences in comparable cases. Further, if the finding of \"disparity\" is upheld, he must recall his sentence \"unless there is substantial evidence of [subjective] countervailing considerations which justify a disparate sentence. . . .\" (Martin, supra, 42 Cal. 3d at pp. 446-448.)\n\nBearing in mind the fundamental liberty interests implicated by such a classification, the Legislature could properly conclude that this statutory scheme, fashioned for use under the DSL, is entirely unsuited to the separate premises on which capital sentencing proceeds. First, although the trial judge in a capital case has authority to modify a death judgment (§ 190.4, subd. (e)), or even to strike special circumstance findings so as to render a defendant eligible for parole (see People v. Williams (1981) 30 Cal. 3d 470, 489 [179 Cal. Rptr. 443, 637 P.2d 1029]), the primary sentencing authority in a capital case, unless waived, is a jury. This lay body represents and applies community standards in the capital-sentencing process under principles not extended to noncapital sentencing. Once the jury has exercised its function, it is discharged and cannot conveniently be recalled to reconsider\n\na sentence that the BPT might determine to be disparate. It would contravene the jury's proper sentencing role to place in a judge's hands the responsibility for deciding whether the long-discharged jury would adhere to its sentence on \"substantial evidence\" if confronted with a finding of \"disparity.\"\n\nSecond, the \"disparate sentence\" law is designed to isolate sentences that are beyond the \"normal range\" for similar offenses. (Martin, supra, 42 Cal. 3d at p. 445, fn. 5.) Even under the DSL, that range may be broad, because it can be affected by consecutive sentencing and by various statutory enhancements, employed in different ways by different judges. By contrast, when one stands convicted of first degree murder with one or more special circumstances, the \"range\" of possible punishments narrows to death or life without parole. The defendant becomes eligible for the law's two most severe penalties and for no others. By definition, therefore, either is within the \"normal range\" of expected sentences for offenses such as those the death-eligible defendant has committed.\n\nThird, although subjective factors play a role in noncapital sentencing, and in the BPT's determination of \"disparity\" (see Martin, supra, 42 Cal. 3d at p. 445), the \"nonquantifiable\" aspects of capital sentencing are much greater. A capital sentencing jury must be allowed to weigh all personal information about the defendant, however unrelated to his crimes, which suggests he should not suffer the unique and irreversible penalty of death. (Eddings v. Oklahoma (1982) 455 U.S. 104, 113-114 [71 L.Ed.2d 1, 10-11, 102 S.Ct. 869]; Lockett v. Ohio (1978) 438 U.S. 586, 605 [57 L.Ed.2d 973, 990, 98 S.Ct. 2954].) As the community's representative, the jury has ultimate responsibility for determining if death is the appropriate penalty for the particular offense and offender. In exercising this essentially normative task, it may apply its own moral standards to the aggravating and mitigating evidence presented. (Caldwell v. Mississippi (1985) 472 U.S. 320, 328-341 [86 L.Ed.2d 231, 239-247, 105 S.Ct. 2633, 2639-2646]; Brown, supra, 40 Cal. 3d at pp. 540-541.) It may reject death if persuaded to do so on the basis of \" any \" constitutionally relevant evidence or observation.\" (Brown, supra, at p. 540, italics in original.)\n\nThus the \"evidence or [observations]\" that persuaded juries in apparently \"comparable\" cases not to assess the death penalty may not be immediately apparent from the record. (See Caldwell, supra, 472 U.S. at p. 330 [86 L.Ed.2d at p. 240, 105 S.Ct. at p. 2640].) Under these circumstances, the Legislature could properly conclude that superficial factual similarities among capital cases with opposite sentencing results establish no presumption that the cases in which the more severe sentence was imposed are \"disparate.\" For all these reasons, we cannot accept the notion that\n\nequal protection principles mandate that the \"disparate sentencing\" procedure of section 1170, subdivision (f) must be extended to capital cases.\n\nThe judgment of guilt, the finding of three special circumstances, and the judgment of death are affirmed.\n\nDisposition\n\nThe judgment of guilt, the finding of three special circumstances, and the judgment of death are affirmed.\n\nPANELLI, J. Although I do not necessarily agree with the majority's analysis concerning the standard of review for penalty phase error, I fully agree that in the instant case the asserted errors, by any standard, were harmless. For this reason I concur in the majority's judgment.\n\nBROUSSARD, J., Concurring and Dissenting. I agree with the majority opinion insofar as it affirms the judgment of guilt and the finding of three of eleven special circumstances, but dissent from the affirmance of the penalty.\n\nIn People v. Brown (1985) 40 Cal. 3d 512 [220 Cal. Rptr. 637, 709 P.2d 440], the defendant contended that the 1978 California death penalty law enacted a \"mandatory\" death penalty and hence was unconstitutional. We rejected that contention. The law, we said, did not require the jury to add up the weights assigned to aggravating and mitigating factors, and to return a death verdict if the aggravating factors were the weightier. Instead, we determined, the weighing process serves to guide a normative judgment -- whether death is the appropriate penalty in the case at hand. Here, the penalty jury was instructed in the language of the 1978 death penalty statute that \"if you conclude that the aggravating evidence outweighs the mitigating evidence, you shall return a death sentence.\" As we observed in People v. Brown (1985) 40 Cal. 3d 512 [220 Cal. Rptr. 637, 709 P.2d 440], this language may lead a jury to believe that once it concludes that aggravating factors outweigh mitigating factors, it has no further decision to make; it is obligated to return a death verdict even if it does not believe that death is the appropriate penalty in the case before it. Whether the giving of such an instruction is reversible error, Brown said, must be determined by examination of the record of each case. (40 Cal. 3d 512, 545, fn. 17.)\n\nAccordingly, the majority examine the record in the present case and discover that the prosecutor, addressing the jury at closing argument, made clear his view that the instruction confines the jury's discretion. He told the jury that it would be instructed that \"'if you conclude that that aggravating\n\nevidence outweighs the mitigating evidence, you shall return a death sentence.' Shall, not may, not might, not maybe. It is very explicit. If the aggravating evidence outweighs the mitigating evidence you shall return a verdict of death.\" There is nothing ambiguous, nothing equivocal in this language, and no freedom for the jury to make the normative decision envisioned by Brown.\n\nThe majority, however, go on to find in other parts of the prosecutor's argument phrases which to them suggest that he did not mean what he said in the language quoted above. They note that both at voir dire and in closing argument he reminded the jury that the law permitted a death penalty even though the defendant was not the actual killer. The majority then quote the prosecutor's exhortation asking the jurors to \"follow the law. Consider the evidence, render a just verdict, do your duty, follow your oath.\" In an illogical leap, they assert that by \"follow the law\" he meant only the law relating to the culpability of persons who engage others to commit murder, not the law relating to the weighing of aggravating and mitigating factors; and even though he had explained to the jurors their duty to return a death verdict if aggravating evidence was the weightier, \"do your duty\" did not mean this duty.\n\nThe majority further note that the prosecutor argued that defendant \"deserved\" the death penalty, language which seems to recognize the power of the jury to make a normative decision. But neither judge nor prosecutor ever told the jury that it was their right to make such a decision. The prosecutor's argument boils down to two assertions: Because the aggravating evidence outweighs the mitigating, it is your duty as jurors to return a verdict of death. And do not feel guilty about doing your duty, because defendant deserves that penalty. Nowhere is there anything to suggest that the jury could, consistently with its duty, return a life verdict on the ground that despite the relative weights of the factors death was not the appropriate penalty.\n\nI conclude that the penalty jury in this case was not properly made aware of its responsibility to make the basic normative decision whether death was the appropriate penalty. The failure to so advise the jury is substantial, and reversible, error.\n\nBIRD, C. J., Concurring and Dissenting. I concur fully in Justice Broussard's concurring and dissenting opinion and agree that the trial court's failure to clarify the \"shall\" language of the penalty phase instruction, together with the prosecutor's arguments, constituted prejudicial error. I\n\nwrite separately to express my views on the proportionality review issue discussed in the majority opinion.\n\nAs my colleagues indicate, there is no requirement under the Eighth Amendment that states undertake proportionality review of the sentences imposed in capital cases. (See Pulley v. Harris (1984) 465 U.S. 37, 50-51 [79 L.Ed.2d 29, 40-41, 104 S.Ct. 871].) However, it remains an open question whether some form of proportionality review is required, either under the state Constitution or other provisions of the federal Constitution. In my view, condemned individuals are at the least entitled, as a matter of state constitutional equal protection (Cal. Const., art. I, § 7, subd. (a)), to the comparative sentencing review guaranteed by statute to other felons in this state.\n\nI.\n\nThe United States Supreme Court has held that the Eighth Amendment to the federal Constitution does not require \"comparative proportionality review by an appellate court . . . in every case in which the death penalty is imposed and the defendant requests it.\" (Pulley v. Harris, supra, 465 U.S. at pp. 50-51 [79 L.Ed.2d at p. 40].)\n\nPulley does not preclude the states, either by legislation or judicial decision, from requiring proportionality review as \"an additional safeguard against arbitrarily imposed death sentences . . . .\" (Id., at p. 50 [79 L.Ed.2d at p. 40].) Even the majority in Pulley admonished that proportionality review is \"a matter that the state courts should consider, if they are so inclined . . . .\" (Id., at p. 42 [79 L.Ed.2d at p. 35].) As Justice Brennan's dissent in Pulley noted, \"over 30 States now require . . . some form of comparative proportionality review before any death sentence may be carried out.\" (Id., at p. 71, fn. omitted [79 L.Ed.2d at p. 54].)\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e In spite of the\n\nPulley holding, \"each State of course remains free to continue the practice.\" (Ibid., fn. 6.)\n\nThis case is the first automatic appeal since Pulley to consider in any detail whether proportionality review is required under constitutional principles not at issue in that decision. By holding that there is no credible basis for concluding that appellant's sentence is disproportionate -- at least insofar as that term has been elucidated in past decisions of this court -- the majority implicitly recognize that some form of proportionality review is required for capitally condemned individuals.\n\nHowever, the majority go on to hold that equal protection principles do not require \"disparate sentencing review\" for such individuals, even though that review procedure is given to all persons sentenced under the uniform determinate sentencing law (hereafter DSL). It is this latter holding with which I take issue.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nSome seven years ago, a plurality of this court in People v. Frierson, supra, 25 Cal. 3d 142 announced its intention to conduct a limited form of\n\nproportionality review. Writing for the court, Justice Richardson noted that the principles derived from In re Lynch (1972) 8 Cal. 3d 410 [105 Cal. Rptr. 217, 503 P.2d 921] \"demonstrate our awareness of a constitutionally derived responsibility to assess the proportionality of a particular punishment in criminal cases generally to assure that justice is dispensed in a reasonably evenhanded manner. Such a responsibility and commitment borne in criminal cases which invoke a more modest sanction can be no less when the penalty is the most extreme.\" (People v. Frierson, supra, 25 Cal. 3d at p. 183.)\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nAlthough the Frierson plurality observed that \"not all of [the Lynch ] tests of disproportionality may be appropriate in reviewing a sentence of death in a particular case\" (25 Cal. 3d at p. 183), it did recognize this court's duty to conduct such review. In fact, only one year later, a majority of this court read the Frierson dicta as \"[assuring] [that such] review will be available\" under Lynch. (People v. Jackson, supra, 28 Cal. 3d at p. 317.)\n\nIt is comforting that today's majority correctly acknowledge their responsibility in this regard and address appellant's claim under Lynch. (See maj. opn., ante, at p. 1286.) I frankly find no fault with their conclusion that in view of the circumstances of appellant's offense and the comparison with other offenses in California and elsewhere, appellant cannot credibly assert that his punishment is disproportionate within the meaning of Lynch. (Maj. opn., ante, at p. 1286.)\n\nUnfortunately, the majority's proportionality analysis is limited to the Lynch inquiry. They reject appellant's contention that equal protection principles demand, at a minimum, the same form of sentence review given to individuals sentenced under the DSL. Both that conclusion and the analysis on which it is based are severely flawed.\n\nII.\n\nThis state already has in place an elaborate form of statewide comparative review of sentences in noncapital felony cases prosecuted under the DSL. As I shall demonstrate, state equal protection principles demand no less in capital cases.\n\nWhen the Legislature enacted the DSL in 1976, it found that the purpose of punishment \"is best served by terms proportionate to the seriousness of the offense with provision for uniformity in the sentences of offenders committing the same offense under similar circumstances.\" (Pen. Code, § 1170, subd. (a)(1).\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e) With this legislation, detailed statutory guidelines for the initial determination of sentences were enacted. (See §§ 1170, subd. (a)(2)-1170.6.)\n\nThe DSL also directed the Judicial Council to \"seek to promote uniformity in sentencing under Section 1170, by . . . [the] adoption of rules providing criteria for the consideration of the trial judge at the time of sentencing. . . .\" (§ 1170.3.) The Judicial Council responded by adopting a detailed set of rules to be utilized by trial judges in pronouncing sentence. (See Cal. Rules of Court, rules 401-453.) A stated objective of the sentencing rules is to \"[achieve] uniformity in sentencing.\" (Id., rule 410(g).)\n\nEven with these directives, the Legislature remained concerned that sentencing disparity might continue unless a statewide comparative review mechanism were established. (See People v. Martin (1986) 42 Cal. 3d 437, 442-443 [229 Cal. Rptr. 131, 722 P.2d 905].) It therefore mandated a procedure known as \"disparate review\" to ensure uniformity of state prison sentences imposed under DSL. Within one year after the commencement of a defendant's term of imprisonment, the Board of Prison Terms (hereafter BPT or board) is required to review his or her sentence \"to determine whether [it] is disparate in comparison with the sentences imposed in similar cases.\" (§ 1170, subd. (f)(1).)\n\nThe disparate review process \"concerns itself with the statistical uniformity of DSL sentences imposed on those convicted of similar crimes under similar circumstances.\" (People v. Herrera (1982) 127 Cal. App. 3d 590, 597 [179 Cal. Rptr. 694].) \"The board has acquired data on over 75,000 cases, including, in each case, the prisoner's criminal history, his social background, the circumstances of each offense, and the actual sentence. When it receives a new case, the board conducts a preliminary screening (an Automated Sentence Review) to determine the range of possible sentences and the relative likelihood of each. A computerized simulation generates 10,000 theoretical sentences for the cases. The computer then determines the percentage of simulated sentences which are equal to or higher than the actual sentence imposed, and provides a statistical measure of the difference between the expected sentence and the actual sentence. If both criteria exceed an established threshold, the case is identified as one requiring further analysis.\n\n\"In the secondary screening process, the board's staff obtains a list of cases comparable to the subject case. The staff examines the file in the subject case and each comparable case to determine if there are facts which would justify a statistically disproportionate sentence. If the staff finds none, it refers the matter to a panel of two board members and a hearing representative. The panel reexamines the subject cases and comparable cases. If it also finds no justification for a disproportionate sentence, it directs the board's counsel to notify the court that, in its opinion, the sentence is disparate.\" (People v. Martin, supra, 42 Cal. 3d at p. 443.)\n\nThe notification process takes the form of a motion to the trial court by the board that the court resentence the defendant. At that point, the court \"must undertake a two-step analysis. 'First, [it] must determine whether the sentence imposed was indeed disparate.' Second, if [it] [finds] the sentence disparate, the court[] must then decide whether to recall the sentence. [Citation.]\" (Martin, supra, 42 Cal. 3d at p. 445.) As to the first step, the trial court \"must not only seriously consider the information provided by the board; it must give weight to the finding of the board.\" (Id., at p. 446.)\n\nMartin held that the trial court must give \"great weight\" to the board's finding of disparity \"unless based upon substantial evidence it finds that the board erred in selecting the appropriate comparison group or in determining that defendant's sentence differs significantly from that imposed upon most members of that group. If there are unique elements in the case which render it unsuitable for comparison with other cases, or subjective factors which distinguish it from other cases, such matters can be considered in the second part of the analysis when the court considers whether a disparate sentence is justified.\n\n\"In the second stage, the trial court must again give great weight to the board's finding of disparity, a finding it upheld in the first stage of the analysis. . . . [Giving] great weight to the finding . . . [requires] the court to recall its sentence unless there is substantial evidence of countervailing considerations which justify a disparate sentence.\" (Martin, supra, 42 Cal. 3d at pp. 447-448, fns. omitted.) Finally, \"the trial court [must] state on the record its reasons for finding that a sentence is or is not disparate; if it finds disparity but nevertheless declines to reduce the sentence to a nondisparate term, it should explain the reasons which justify a disparate sentence.\" (Id., at p. 450.)\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nIII.\n\nTen years ago, this court unanimously concluded that \"personal liberty is a fundamental interest, second only to life itself, as an interest protected under both the California and the United States Constitutions.\" (People v. Olivas (1976) 17 Cal. 3d 236, 251 [131 Cal. Rptr. 55, 551 P.2d 375].) A state may not create a classification scheme which affects a fundamental interest without showing that it has a compelling interest which justifies the classification and that the distinctions drawn are necessary to further that purpose. (Ibid.; People v. Saffell (1979) 25 Cal. 3d 223, 228 [157 Cal. Rptr. 897, 599 P.2d 92]; In re Moye (1978) 22 Cal. 3d 457, 465 [149 Cal. Rptr. 491, 584 P.2d 1097].)\n\n\"Some decisions speak of an initial constitutional inquiry to determine whether the groups affected are similarly situated with respect to the purpose of the legislation or other state action. [Citation.] To ask whether two groups are similarly situated in this context, however, is the same as asking whether the distinction between them can be justified under the appropriate test of equal protection. Obvious dissimilarities between groups will not justify a classification which fails strict scrutiny (if that test is applicable) or lacks a rational relationship to the legislative purpose. [Citations.]\" (Fullerton Joint Union High School Dist. v. State Bd. of Education (1982) 32 Cal. 3d 779, 798, fn. 19 [187 Cal. Rptr. 398, 654 P.2d 168].)\n\nAlthough felons sentenced to a fixed term of imprisonment and individuals condemned to die possess \"obvious dissimilarities,\" this dissimilarity is not significant enough to preclude equal protection scrutiny of the state's reasons for treating them so profoundly differently with respect to disparate review. Several classes of persons who possess \"obvious dissimilarities\" have been held similar enough to warrant scrutiny under the equal protection clause. (In re Hop (1981) 29 Cal. 3d 82, 89 [171 Cal. Rptr. 721, 623 P.2d\n\n282] [developmentally disabled and mentally ill persons]; Newland v. Board of Governors (1977) 19 Cal. 3d 705, 710-711 [139 Cal. Rptr. 620, 566 P.2d 254] [felons and misdemeanants]; In re Moye, supra, 22 Cal. 3d 457, 465-468 [mentally disordered sex offenders and insanity defendants]; People v. Olivas, supra, 17 Cal. 3d 236 [youthful offenders and adults].) Far fewer differences exist between condemned individuals and felons sentenced to a fixed term of imprisonment than between the classes of persons held to be similarly situated in this court's past decisions.\n\nCalifornia has afforded the overwhelming majority of felons the guarantee that their prison terms will be reviewed to determine if such terms are disproportionate to those imposed for similar conduct in similar cases throughout the state. Certainly, an individual condemned to death has as much right to review as a \"common\" felon.\n\nThe illogic of denying disparate review to a capitally condemned individual becomes apparent when one realizes that similar conduct may lead to vastly different sentencing results. Compare, for example, the individual convicted of voluntary manslaughter for a killing during a robbery with another individual convicted and sentenced to death for a similar crime. The former faces a maximum prison term of 11 years (see § 193) and receives the benefit of the board's disparate review procedure. The latter, condemned to die, does not.\n\nDoes the mere fact that the latter defendant acted with malice and the intent to kill (see Carlos v. Superior Court (1983) 35 Cal. 3d 131 [197 Cal. Rptr. 79, 672 P.2d 862]), while the former did not, provide a sufficient reason for failing to give him the benefit of this review procedure? I think not. To paraphrase the United States Supreme Court in Skinner v. Oklahoma (1942) 316 U.S. 535, 541 [86 L.Ed. 1655, 1660, 62 S.Ct. 1110], \"[when] the law lays an unequal hand on those who have committed intrinsically the same quality of offense and [gives disparate review to one] and not the other, it has made as invidious a discrimination as if it had selected a particular race or nationality for oppressive treatment.\"\n\nJustice Tobriner once observed that \"[although] the due process clause does not require a state to provide an appeal from a criminal conviction, nevertheless, when the state does provide such an appeal it cannot sanction procedures which render that appeal meaningless or deprive one class of convicted defendants of the opportunity to secure redress for an incorrect application of the law to them. [Citations.]\" (In re Anderson (1968) 69 Cal. 2d 613, 645, fn. 8 [73 Cal. Rptr. 21, 447 P.2d 117] (conc. \u0026 dis. opn.).) His observation applies with similar force in an equal protection context\n\nwhere the state has given the benefit of disparate sentencing review to one group of convicted individuals but denied it to another.\n\nI have previously observed that this court is not presently equipped to perform meaningful proportionality review. (People v. Jackson, supra, 28 Cal. 3d at p. 362 (dis. opn. of Bird, C. J.).) In the absence of such a structure, the BPT's mechanism for reviewing sentences to ensure their statewide proportionality should be extended to capitally sentenced individuals under the equal protection clause of our state charter. (Cal. Const., art. I, § 7, subd. (a).) To the extent practicable, the disparate review procedures embodied in section 1170, subdivision (f) should be utilized.\n\nThe majority offer three reasons why disparate review would be inappropriate in capital cases. First, they argue, the \"primary sentencing authority\" is the jury, not the trial judge. (Maj. opn., ante, at p. 1287.) Since the jury cannot be recalled to reconsider a disparate sentence, it would, according to the majority, \"contravene the jury's proper sentencing role to place in a judge's hands the responsibility for deciding whether the long-discharged jury would adhere to its sentence on 'substantial evidence' if confronted with a finding of 'disparity.'\" (Ibid., italics in original.)\n\nNo one has ever suggested, of course, that by adapting the disparate review procedure to capital cases, the original sentencing jury would have to be reconvened to \"reconsider\" the BPT's finding that a death sentence was disparate. Certainly nothing in the disparate review procedures now in place compels a trial court to reconvene all of the participants -- attorneys, witnesses, probation officers, and the like -- who were present at the initial sentencing hearing. Obviously, a carbon-copy replay of the sentencing hearing in either context is impossible.\n\nBeyond this, it is fallacious to assume that placing in the judge's hands the responsibility and authority to reconsider a jury's disparate sentence would somehow trespass on the jury's function. There is, according to the United States Supreme Court, no federal constitutional right to a capital sentencing jury; thus, for example, there is no federal constitutional impediment to a judge's decision to overrule a capital jury's determination that the defendant's life should be spared. (Spaziano v. Florida (1984) 468 U.S. 447 [82 L.Ed.2d 340, 104 S.Ct. 3154] [upholding Florida's procedure whereby a trial judge may impose a death sentence despite jury's contrary verdict].) A fortiori, there is no bar to a judge overruling a jury's death verdict.\n\nSignificantly, our death penalty statute expressly gives the trial judge the discretion to modify a jury's death verdict. Indeed, a defendant whom a\n\njury has sentenced to death is \"deemed to have made an application for [such] modification . . . .\" (§ 190.4, subd. (e).) And, it is reversible error for the trial court to fail to review independently the weight of the evidence presented at penalty phase and determine whether to reduce the verdict. (People v. Rodriguez (1986) 42 Cal. 3d 730, 792-794 [230 Cal. Rptr. 667].) In light of these facts, the disparate sentence review procedure cannot be avoided on the ground that a reduction of the jury's verdict by the trial judge would \"interfere\" with the jury's function.\n\nThe majority also claim that the disparate sentence law is \"designed to isolate sentences that are beyond the 'normal range' for similar offenses.\" (Maj. opn., ante, at p. 1287.) According to the majority, the \"normal range\" for defendants convicted of murder with special circumstances is life without the possibility of parole or death. Since \"either is within the 'normal range' of expected sentences for offenses such as those the death-eligible defendant has committed\" (id., at p. 1287), the disparate review procedure would, in their view, be an exercise in futility.\n\nThis reasoning misses the mark. One goal of disparate review of a death sentence would be to discover whether there are similarly culpable individuals with similar criminal backgrounds who had received sentences of life without the possibility of parole rather than death. A death sentence may be disproportionate -- and therefore \"abnormal\" -- in some circumstances even though that sentence marks the outer boundary of the \"normal range\" in the capital sentencing scheme. The fact that there is no punishment greater than death does not render such a sentence intrinsically incapable of being compared to lesser sentences.\n\nFinally, the majority claim that the \"'nonquantifiable' aspects of capital sentencing are much greater\" than in the DSL context. (Maj. opn., ante, at p. 1287.) From this premise, they reason that the Legislature could properly conclude that \"superficial factual similarities among capital cases with opposite sentencing results\" (id., at p. 1287) establish no presumption of disparateness. Therefore, they conclude, the disparate review procedures are ill-suited to capital cases.\n\nIt is true that the range of information the capital sentencer takes into account must, as a matter of constitutional imperative, be far reaching. (See Lockett v. Ohio (1978) 438 U.S. 586, 604-605 [57 L.Ed.2d 973, 989-990, 98 S.Ct. 2954].) It is also true that the capital jury must be permitted to apply its own moral standards to its sentencing determination. (Cf. Caldwell v. Mississippi (1985) 472 U.S. 320, 328-335 [86 L.Ed.2d 231, 239-243, 105 S.Ct. 2633, 2639-2642].)\n\nHowever, one cannot ignore that in this state, \"nonquantifiable information\" constitutes only a part of the evidence the capital jury must consider. Contrary to the majority's implication, there are several \"quantifiable\" circumstances on which the sentencer bases its determination. The first 10 of the 11 aggravating and mitigating circumstances listed in section 190.3 (i.e., subds. (a) through (j)) which the sentencer must \"take into account and be guided by\" in making its sentencing choice are factors based to a large extent on \"quantifiable\" information. Many of these factors closely parallel the aggravating and mitigating circumstances on which a trial judge may rely in imposing the upper or lower term in a noncapital case. (See Cal. Rules of Court, rules 421 \u0026 423.)\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nEven subdivision (k) of section 190.3, which, as construed in People v. Easley (1983) 34 Cal. 3d 858, 878, footnote 10 [196 Cal. Rptr. 309, 671 P.2d 813], directs the jury to consider \"'any other circumstance which extenuates the gravity of the crime even though it is not a legal excuse for the crime' and any other 'aspect of [the] defendant's character or record . . . that the defendant proffers as a basis for a sentence less than death'\" contemplates the introduction of \"quantifiable\" evidence. As several automatic appeal records before this court indicate, the defendant often relies on subdivision (k) to present not only evidence that he has never \"been in trouble\" with the law but other objective evidence of exemplary conduct, in order to persuade the sentencer to vote in favor of life.\n\nThere are many \"nonquantifiable\" aspects to noncapital sentencing as well. The factors on which a trial judge may base a sentence choice under the DSL include (1) the \" high degree of cruelty, viciousness, or callousness\" of the offense (Cal. Rules of Court, rule 421(a)(1), italics added), (2) the fact that the \"victim was particularly vulnerable\" (rule 421(a)(3), italics added), (3) the fact that the offense involved an \"attempted or actual taking or damage of great monetary value\" (rule 421(a)(10), italics added), (4) the existence of a \"pattern of violent conduct which indicates a serious danger to society\" (rule 421(b)(1), italics added), and (5) any \" unusual circumstance\" of the crime (rule 423(a)(3), italics added).\n\nThese factors do not preclude disparate review even though they tend toward subjectivity. Indeed, it may be precisely because the Legislature believed that \"nonquantifiable factors\" might produce nonuniform sentences that it deemed the disparate review process necessary.\n\nFinally, it must be remembered that a finding of disparateness by the BPT does not automatically result in a lower sentence. Such a finding is only the first step in a procedure designed to ensure closer scrutiny of the sentencing decision. Adapting the procedure to capital cases would not preclude a trial judge from letting a death sentence stand despite the board's finding of disparateness. (See People v. Martin, supra, 42 Cal. 3d at pp. 447-448; see also ante, fn. 5.)\n\nIn sum, no compelling reasons have been offered which persuade me that capital and noncapital sentencing proceedings are so vastly different as to justify the absence of disparate review in capital cases. Equal protection demands similar treatment here.\n\nWhile disparate review is the minimum guarantee to which condemned individuals are entitled under the state equal protection clause, it is by no means the only form of review which this state could adopt. In this regard, I refer the majority to a prototype proportionality review system developed for states to use in conducting the review of death sentences. (Duizend et al., Proportionality Review Project, User Manual for Prototype Proportionality Review Systems (1984) National Center for State Courts.) The manual contains prototype questionnaires and outlines both a manual and automated similar case selection system, either of which could be adapted for use in this state.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nIV.\n\nThe comparative review of death sentences should be required in California. Although the majority's willingness to engage in Lynch -type review on appeal is commendable, the refusal to accord individuals sentenced to\n\ndie a right which common felons have had for nearly 10 years is regrettable. It is for that reason that I decline to join the majority's opinion.\n\n\u003cspan class=\"fn\"\u003e1. Unless otherwise indicated, all statutory references are to this code.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The Court of Appeal had previously granted defendant a writ of mandate ordering a change of venue.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. These three special circumstance allegations had been bifurcated from the other charges. (§ 190.1, subd. (b).)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The agreement provided in pertinent part: \"Kenneth Ray Allen hereby agrees that he will testify truthfully and completely in all proceedings where his testimony is needed in the case of the People of the State of California vs. Billy Ray Hamilton and Connie Lee Barbo, and he further agrees that he will testify truthfully and completely in any and all proceedings instituted by the People of the State of California against his father, Clarence Ray Allen, including any preliminary hearings, grand jury proceedings, trials, parole hearings or any other legal proceedings in exchange for the following considerations by the People of the State of California: [ para. ] 1. The People of the State of California shall allow Kenneth Ray Allen to plead to violation of Penal Code section 32 and Health and Safety Code section 11377a, and in exchange for this plea, the People shall agree to a concurrent sentence. [ para. ] 2. Whatever time Kenneth Ray Allen serves will be at an institution where his security can be guaranteed. [ para. ] . . . . Should Kenneth Ray Allen . . . fail to comply with the terms of this agreement, then all commitments by the People will be null and void.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Although we have never directly addressed the issue, it seems clear these principles are equally applicable when the accomplice testimony is obtained pursuant to a plea agreement rather than a grant of immunity. (See, e.g., People v. Fields (1983) 35 Cal. 3d 329, 360-361 [197 Cal. Rptr. 803, 673 P.2d 680]; People v. Manson (1976) 61 Cal. App. 3d 102, 134-135 [132 Cal. Rptr. 265].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. As we observed, \"if the last statement she gave the police was the truth, then by agreeing to testify truthfully she has in fact agreed to testify in accord with that statement. Moreover, even if we were to view her testimony as inconsistent, the inconsistency arises not from her own words, but from her failure to dispute leading questions as put by counsel for both sides.\" (Id., at pp. 360-361.) For similar reasons, we find it insignificant that Kenneth answered in the affirmative when asked by defense counsel whether he believed the district attorney's office would have to honor the agreement if he testified at trial the same way he had testified at defendant's preliminary hearing.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Indeed, it appears defendant himself was the only one who ever told Kenneth that he must stand by his original story in order to escape the murder charge. Defendant testified that when Kenneth suggested changing his testimony to exculpate him, he told Kenneth, \"not to be a damn fool; stick with the same story he told originally. That is the only chance he had [of] getting out.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. There are also strong policy reasons for rejecting such a holding. Plea bargains would be of little, if any, value to law enforcement officials if the agreements could be conditioned only on truthful testimony in a single proceeding. Such an agreement would leave the witness free to \"sabotage\" the bargain by impeaching his own testimony at subsequent proceedings.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. See, e.g., People v. Fields, supra, 35 Cal. 3d at page 361. In People v. Meza, supra, 116 Cal. App. 3d 988, the court held that a bargain conditioned on the witness providing testimony that is beneficial or valuable to the prosecution does not alone constitute such an inducement as to place the witness under the kind of compulsion condemned in Medina, supra, 41 Cal. App. 3d 438, and Green, supra, 102 Cal. App. 2d 831, because \"the very nature of the agreement described contemplates that something of assistance to the prosecution will be forthcoming from the informant, else what would be its purpose so far as the former is concerned. [ para. ] What is improper, in our view, is not [the expectation that] . . . the informant's testimony . . . will be favorable to the People's case, but that the testimony must be confined to a predetermined formulation or rendered acceptable only if it produces a given result, that is to say, a conviction. If it were otherwise, no evidence of the sort obtained here could ever be produced, a result neither required by reason nor compelled by precedent.\" (116 Cal. App. 3d at p. 994.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Of course, the existence of the plea agreement and the circumstances surrounding the agreement are highly relevant to the issue of Kenneth's motivation for testifying, and, therefore, to the issue of his credibility. We note that the facts surrounding the plea agreement and their relevance to Kenneth's credibility were fully presented to the jury both through the testimony of witnesses and by counsel in their closing arguments.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The photographs would appear to be of only limited value in \"illustrating\" Dr. Nelson's testimony regarding the nature and location of the wounds, in light of the fact that Dr. Nelson did not refer to the photographs during his testimony. In fact, the photographs were not admitted into evidence until the close of the People's case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Indeed, in some respects, the photographs are less revolting than Dr. Nelson's detailed description of some of the wounds.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Of course, the question of prejudice ultimately depends on what this jury was shown -- not on what the trial court has seen in other cases or what the prosecution in this case could have, but did not offer into evidence. The trial judge's experience in other cases, however, is relevant to his ability to assess how a jury is likely to respond to photographs of this nature. In addition, in arguing to the trial court that the nine photographs should be admitted, the prosecution stated the photographs were not selected for their shock value but, rather, were selected by Dr. Nelson to help illustrate his testimony. The fact that there were other more gruesome photographs that the prosecution did not offer into evidence lends credence to the prosecutor's comment and to the court's determination that the photographs were, in fact, helpful to illustrate Dr. Nelson's testimony.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. That section provides: \"If the court shall refuse to hear a defendant's motion for a new trial or when made shall neglect to determine such motion before pronouncing judgment or the making of an order granting probation, then the defendant shall be entitled to a new trial.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. In addition, defendant argued that the special circumstance findings must be reversed because the court failed to instruct the jury, sua sponte, that a finding of special circumstances could not be based on the uncorroborated testimony of an accomplice.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. \"I see a substantial difference between bargaining for the testimony of a witness and by that I mean, 'I want you to testify in the specific way,' which our law probably says is improper and bargaining for the truthful testimony of a witness, whatever that testimony may be. I think that is the status of the law in this state, that one is proscribed and rightly so because it is almost suborning a type of perjury, if you testify previously you better testify that way again because that is what you bargained for. However, if it is a bargain for your truthful testimony and cooperation, that is substantially different. Then, if there is an error or discrepancy or difference in the testimony the measure isn't inconsistency with prior testimony but the measure is, is it truthful in this case. [Of] course, with the number of inconsistencies and with all the circumstances alluded to by counsel, the court felt that the testimony of Kenneth Allen viewed alone and by itself was of course suspect, highly suspect. But, that is, of course, not the manner that the evidence is presented to the jury in their deliberation. At that time they have the entire testimony before them as far as the court has had it before. The jury has before it, and the court has before it, . . . the other evidence . . . which in this case [consists of] the corroborating evidence primarily . . . through . . . [defendant's] letters and statement[.] [This evidence] is overwhelming and supportive of the truthful testimony of Kenneth Allen.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Indeed, at one point, in referring to defendant's memorandum of points and authorities in support of the motion for new trial, the court stated: \"I believe [defense counsel] has filed a motion in this matter, . . . and points and authorities to assist the court in connection with the statutory review of the verdict and findings in this case.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Even if the court's failure to expressly deny defendant's motion constitutes a failure to \"determine\" the motion under section 1202, defendant is not entitled to a new trial. In People v. Teddie (1981) 120 Cal. App. 3d 756 [175 Cal. Rptr. 49] the court held that notwithstanding the mandatory language of section 1202, a trial court's failure to rule on a motion for new trial is reversible error only if the defendant can show prejudice. (Id., at p. 764.) In Teddie, the trial court had dismissed a timely motion for new trial on the mistaken belief it was untimely and, therefore, had never ruled on the merits of the motion. The trial court had indicated on the record, however, that were it to rule on the merits it would deny the motion. Based on the trial court's remarks and the fact that, in any event, the motion had no legal merit, the Court of Appeal concluded there was no prejudice to defendant and therefore no reversible error. As we have already explained, even if the trial court's denial of the statutory application did not constitute a determination of defendant's motion for new trial within the meaning of section 1202, it is clear from the record that in denying the statutory application the court intended to deny defendant's motion as well. Thus, here, as in Teddie, it is apparent that, had the court ruled separately on defendant's motion for new trial, it would have denied the motion. The court's remarks to counsel concerning the merits of the motion (ante, fn. 16), further suggest \"it was not in the cards that [the court] would have granted the motion\" (People v. Teddie, supra, 120 Cal. App. 3d at p. 764). Therefore, even if we were to conclude that the trial court technically failed to comply with Penal Code section 1202, the error was harmless.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The reasons for limiting the use of physical restraints were outlined in Duran : \"We believe that it is manifest that the shackling of a criminal defendant will prejudice him in the minds of the jurors. When a defendant is charged with any crime, and particularly if he is accused of a violent crime, his appearance before the jury in shackles is likely to lead the jurors to infer that he is a violent person disposed to commit crimes of the type alleged. The removal of physical restraints is also desirable to assure that 'every defendant is . . . brought before the court with the appearance, dignity, and self-respect of a free and innocent man.' Finally, the United States Supreme Court has acknowledged that physical restraints should be used as a last resort not only because of the prejudice created in the jurors' minds, but also because 'the use of this technique is itself something of an affront to the very dignity and decorum of judicial proceedings that the judge is seeking to uphold.'\" (Id., at p. 290, citations omitted.) In addition, we noted in Duran that limitations on the use of physical restraints were further supported by the \"effect such restraints have upon a defendant's decision to take the stand.\" (Ibid.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Frazier was convicted of killing Victor Ohta, a prominent eye surgeon; Virginia Ohta, his wife; the couple's two children; and Dr. Ohta's secretary. All five victims were found dead in the family swimming pool, each having been shot in the head. After killing the five victims, Frazier set the Ohta's home on fire and left a note on the windshield of the family car that read: \"Halloween 1970. Today World War III has begun as brought to you by the people of the Free Universe. From this day forward anyone and/or company who misuses the environment or destroys the same will suffer the penalty of death. I and my comrades will fight until death or freedom. Materialism must die or mankind will. (Signed) The Knight of Wands; the Knight of Cups; the Knight of Pentocols; the Knight of Swords.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. In ordering Frazier restrained the court stated: \"[The] restraints are very minimal . . . I feel this is the minimal restraint consistent with the security available in the courtroom.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. We note a number of other prison inmates were called to testify, both by the People and the defense. None of these witnesses was restrained. Thus, unlike in Duran, it is clear the trial court's decision to restrain Frazier was not made pursuant to a \"general policy of shackling all inmate\" witnesses (16 Cal. 3d at p. 293), but rather was made as part of a case-by-case determination, as required by Duran. (Ibid.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. The only suggestion in the record that the restraints may have been visible is a comment made by defense counsel. After Frazier was seated and restrained, but before the jury was brought in, defense counsel stated: \"Your Honor, it is quite apparent to me as defense counsel, as barely walking away, that the [view] that a typical juror would take especially if he approached the front row, . . . even if he approached to the back row seat, [he would see] that the bindings would be visible to the respective jurors.\" In response, the trial court stated he \"did not share defense counsel's concern,\" the restraints were very minimal, and that he did not believe the jurors were going to be looking at Frazier's feet.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Frazier did testify that he never saw defendant, Hamilton and Gary Brady together, although he saw defendant and Hamilton together and may have seen Hamilton and Brady together. It is not clear however what, if any, relevance defendant might attribute to this testimony or in what way this testimony would \"directly [contravene] the testimony\" of any prosecution witness.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. In a related contention, defendant argues the court erred in failing to instruct the jury sua sponte that the restraints should have no bearing on the jury's determination of defendant's guilt. In Duran we held that, \"[in] those instances when visible restraints must be imposed the court shall instruct the jury sua sponte that such restraints should have no bearing on the determination of the defendant's guilt. However, when the restraints are concealed from the jury's view, this instruction should not be given unless requested by defendant since it might invite initial attention to the restraints and thus create prejudice which would otherwise be avoided.\" (16 Cal. 3d at pp. 291-292, fn. omitted.) After Frazier was seated in the witness chair defense counsel stated to the court he believed the restraints would be visible to the jurors (ante, fn. 23). Although the trial judge disagreed, he offered to instruct the jury to disregard the restraints. Defense counsel expressly rejected the trial court's offer, noting, \"[if] you admonish them, then obviously those [who] possibly have not seen Mr. Frazier's confinement will become aware of it.\" Thus, defense counsel made a conscious tactical decision not to have the jury instructed -- a decision with which the trial court expressed its agreement. Under these circumstances, the court most certainly did not err in failing to instruct the jury sua sponte.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Indeed, throughout the course of this lengthy trial, the trial court repeatedly commented on the fact that the jury was unusually punctual, attentive, cooperative and serious-minded.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. In an attempt to explain his failure to produce any evidence of misconduct, defendant contends he was precluded from questioning jurors about their conduct because the court, in its comments to the jury at the trial's end, \"very subtly and inferentially warned the jurors that it would be best for them not to discuss the case with anyone following their discharge.\" There is no merit to defendant's contention. The court did tell the jurors that a number of people might be asking them questions about the case, that they should be careful not to make irresponsible or flip remarks; and that they need not respond to questions if they chose not to. The court made it clear, however, that jurors were free to discuss the case with anyone they chose, and that \"[of] course, if there were any improprieties I would be the first one who would want to know . . . .\" The trial court's comments to the jury were perfectly proper and in no way precluded defendant from questioning the jurors. Defendant's contention appears particularly disingenuous in light of the fact that apparently neither defendant's trial counsel nor his appellate counsel made any attempt whatsoever to contact or question the jurors concerning their alleged consumption of alcoholic beverages.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Our conclusion is further supported by the fact that defendant did not object to the trial court's comment and, indeed, never raised the issue of juror misconduct below, even though his claim on appeal is based solely on \"evidence\" that was available and known to him before the jury ever began its deliberations. Under these circumstances it is certainly arguable that defendant waived any objection he might otherwise have had. (See, e.g., People v. Orchard (1971) 17 Cal. App. 3d 568, 576 [95 Cal. Rptr. 66]; People v. Martinez (1968) 264 Cal. App. 2d 906, 912-913 [70 Cal. Rptr. 918].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Section 780 provides: \"Except as otherwise provided by statute, the court or jury may consider in determining the credibility of a witness any matter that has any tendency in reason to prove or disprove the truthfulness of his testimony at the hearing, including but not limited to any of the following: . . . . [ para. ] (f) The existence or nonexistence of a bias, interest, or other motive.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Defendant contends the details of Rainier's conviction were also relevant to his desire to have a favorable letter placed in his file and, therefore, were relevant to his motivation to testify. Defendant's theory appears to be that because of the nature of his crime, Rainier knew he had little chance of ever being released on parole or having his sentence reduced and, therefore, needed all the help he could get. Hence, the theory goes, a favorable letter from the prosecution was particularly important to Rainier and his desire to obtain the letter provided a strong motivation to cooperate with the prosecution. Whatever relevance there might be to Rainier's belief that he had little chance of ever being released from prison, the fact is defense counsel was permitted to inquire into this very subject. With the court's express consent and without objection from the prosecution, defense counsel asked Rainier the following question: \"Isn't it true that because of the nature of your case, that is the nature of your murder case, that at the time that you entered into this agreement with the attorney general's office, isn't it true you felt that your chances of having your sentence lowered were not too good?\" Rainier answered, \"Yes,\" to this question and defense counsel then moved on to another line of inquiry.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. For this reason, there is no merit to defendant's argument that it would have been futile for defense counsel to make an \"offer of proof\" once the court ruled it would permit no cross-examination on the subject. As we have explained, the court expressly and repeatedly invited such an offer and made clear it would permit cross-examination if such an offer was made. Under these circumstances, it would hardly have been futile for defense counsel to make an offer of proof. We note that counsel ordinarily need not make an offer of proof in order to challenge on appeal the trial court's ruling sustaining an objection to a question asked on cross-examination. (Evid. Code, § 354; People v. Coleman (1970) 8 Cal. App. 3d 722, 729 [87 Cal. Rptr. 554]; Witkin, Cal. Evidence (2d ed. 1966) § 1314, p. 1214.) This rule, however, does not apply (even if the proposed question is an \"exploratory\" one) when it is clear the trial court has overlooked the question's probable relevance (People v. Burton (1961) 55 Cal. 2d 328, 344-345 [11 Cal. Rptr. 65, 359 P.2d 433]; People v. Coleman, supra, 8 Cal. App. 3d at pp. 729-731); even less should the general rule that an offer of proof is not required apply when, as here, the court expressly states it sees no relevance to the question and repeatedly invites counsel to suggest a theory of relevance.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. We reject defendant's attempt to avoid section 353, subdivision (a)'s requirement here. Unlike the exception to that rule described in People v. Cabrellis (1967) 251 Cal. App. 2d 681 [59 Cal. Rptr. 795], there is nothing in this record suggesting the prosecutor overstepped his bounds and improperly presented or discussed the other acts and former crimes in this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. The record suggests defense counsel recognized this and decided to make the best of the situation: He went to great lengths to impeach these witnesses about their previous testimony in an effort to demonstrate bias and to show their prior testimony was false.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. In this regard, we note the court properly instructed the jury that evidence of crimes other than those for which defendant was on trial, if believed, could not be considered to prove defendant was a person of bad character or that he had a disposition to commit crimes, but rather could be considered only for the limited purpose of determining if such evidence tended to show intent, identity, or motive. The prosecutor also emphasized this point in his argument.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. The relevant portion of the prosecutor's argument is as follows: \"What about what [defendant] told Mr. Mayfield about what happened to Mr. Furrow? What does that tell you about his way of thinking? About whether the idea of murdering Eugene Leland Furrow ever crossed his mind? 'Yeah, Mr. Furrow has been taken care of in Mexico. For $25 a security guard will dispose of the body.' [ para. ] Also, ladies and gentlemen, quite apart from the threats, implied by these statements to Mr. Mayfield and Mr. Furrow, also I think you can probably see something else going on here. And that is the Ray Allen mystique that he intended to build up among his people, how he wanted to keep everybody in line. You tell them you are capable of murdering. In fact you have demonstrated. You tell them this is what happens to people. [ para. ] What did he tell -- getting back to Chuck Jones, what did he tell when he told Chuck that he had Lee Furrow murdered in Mexico? Why did he say he had him murdered? Because he might talk. That sure will help to keep people in line. [ para. ] That is why we get into the mystique of Ray Allen, Ray the hit man, Ray Allen who writes these poems [defendant testified he wrote poems about, inter alia, 'contract men': 'I am a contract man, so they say/Dusting off people for those who pay.'] Ray Allen who murdered two people in Las Vegas; keep everybody in line. [ para. ] Then we get to the statement made by Mr. Mayfield, even back in 1977 before it really seemed all that relevant. Now it seems very relevant in light of the murder of Bryon Schletewitz and in light of this hit list. But then Mr. Mayfield testified in 1977 that Allen told him, 'Even if he were locked up' -- tell me if this wasn't prophetic, Allen told Mr. Mayfield in 1974, that, 'Even if he were locked up and put away, that he had connections and friends who would murder anybody who cooperated with the authorities against him,' who would take care of anybody that, who testified against him. I believe that was a very prophetic statement. Mr. Mayfield made that statement in 1977 before Bryon Schletewitz was murdered even before this hit list, it might have existed in his mind, but before it existed on this piece of paper. [ para. ] Another discussion where Mr. Mayfield testified that he had asked Allen, again this goes to the Ray Allen mystique and also a threat toward Carl Mayfield, Mr. Allen asked if he was worried about people talking about, talking, he wasn't worried about them talking because if they did they would be taken care of. If they talked, he would take care of them. . . . [ para. ] Mr. Furrow also testified that the defendant told him about, again about, I think it would fit into the area of threats and fit into the Ray Allen mystique, that Ray Allen told him he was a hit man for the Mafia, showed him a clipping for a mafia-type murder for which the Defendant took credit for killing two people.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. Having reached this conclusion, we also reject defendant's claim that the trial court erred in failing to instruct the jury sua sponte that it could consider sympathy in reaching its penalty decision.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. Finally, the prosecutor suggested yet another way to weigh the aggravating factors: \"Another way to look at the aggravating factors in this case, ladies and gentlemen, is to look at it from the standpoint of deliberation and premeditation. . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. We did not hold in Brown that it is per se improper to instruct the jury that it \"shall\" impose death; indeed, by implication, we suggested otherwise. \"By directing that the jury 'shall' impose the death penalty if it finds that aggravating factors 'outweigh' mitigating, the statute should not be understood to require any juror to vote for the death penalty unless, upon completion of the 'weighing' process, he decides that death is the appropriate penalty under all the circumstances.\" (40 Cal. 3d at p. 542, italics added.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. Nothing in defense counsel's closing argument gave a contrary interpretation of the jury's sentencing discretion that was likely to confuse the jury on this point. Indeed, although not framed expressly in terms of the jury's discretion to determine whether death or life in prison is the appropriate penalty for defendant, defense counsel's argument carried that message implicitly. His thesis was that the People's case was based on the testimony of shady characters who were manipulated by the prosecution against his client, and that under these unfair circumstances, his client did not deserve to be found guilty of the charges, let alone be sentenced to death. The entire argument is clearly an appeal to the jury's assumed authority to determine whether the death penalty, although \"technically permissible,\" was in fact justified or appropriate under the circumstances.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. In opening his penalty argument the prosecutor reminded the jury \"we are here because you have found, beyond a reasonable doubt, that the defendant . . . has committed three first degree murders. Also, there have been eleven special circumstances found to be true. Eight by the jury, by you ladies and gentlemen, and three by the admissions of the defendant about which the judge has previously informed you.\" Immediately thereafter he explained the jury would consider and weigh the aggravating and mitigating circumstances of the case, and mentioned the special circumstances as one category of aggravating circumstances: \"[The] second aggravating circumstance which you may consider is a fact in circumstance of the crime which you must consider and a fact in circumstance of the crime are the eleven special circumstances.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. The record shows that after the question was asked, the witness immediately answered \"yes,\" whereupon the following exchange occurred: \"Mr. Prager [prosecutor]: Objection. Irrelevant. Calling for an opinion on the part of the witness. Ask that the answer be stricken. \"The Court: All right. I will sustain the objection. The answer will be stricken, the jury instructed to disregard it. Treat it as though it has not been said. \"Mr. Bumanglag [defense counsel]: Your Honor, I believe Penal Code Section 190.3 provides for the introduction of evidence regarding the Defendant's character, history, [mental] condition and physical condition. On that basis, I believe that all this evidence should be admitted. We are talking about background. \"Mr. Prager: I don't see how the possible personality change, assuming this witness could give an opinion like that, which may be the subject of an expert witness -- how would that be relevant to the character of the Defendant? \"The Court: The degree of relevance is insignificant. In light of due consumption of time, the provisions of the Evidence Code and Section 352, weighing the two considerations, I feel that the answer should be stricken. It's just not relevant to this inquiry.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. Some state high courts have mandated sentence review in capital cases. In State v. Simants (1977) 197 Neb. 549 [250 N.W.2d 881, 890], quoted with approval in the lead opinion in People v. Frierson (1979) 25 Cal. 3d 142 [158 Cal. Rptr. 281, 599 P.2d 587], the Nebraska Supreme Court stated that it would \"perform its function of death sentence review\" even in the absence of a statutory directive to do so. Thus, in Nebraska, \"every capital case where there can be the slightest question will be considered in comparison with other capital cases.\" (250 N.W.2d at p. 890.) This procedure is intended to guarantee that the court will reach a \"similar [results] to [those] reached under similar circumstances in another case.\" (Ibid.) The Arkansas Supreme Court has made similar strides. In Collins v. State (1977) 261 Ark. 195 [548 S.W.2d 106], the court recognized that even in the absence of a \"specific requirement that this court compare sentences in other cases,\" the scope of permissible appellate review of a death sentence \"would necessarily require that we consult prior cases as precedent for our determining whether there was error in the sentencing procedure, whether the evidence was sufficient to support any finding made by the jury, whether any of the findings was the result of passion or prejudice or any other arbitrary factor and whether there had been an abuse of the discretion of either the jury or the trial judge in imposing the sentence.\" (Id., at p. 121.) A similar guarantee exists in Mississippi. There, the supreme court examines similar cases to ascertain whether a given death sentence is the product of arbitrary or capricious decisionmaking. (See Jackson v. State (Miss. 1976) 337 So.2d 1242, 1256.) And, in Delaware, the supreme court requires that each death penalty case be reviewed by comparing it \"'to the penalty recommended or imposed in similar cases . . . .'\" (State v. White (Del. 1978) 395 A.2d 1082, 1096.) In order to perform that task, counsel for the state, \"together with amicus curiae and such other person as may be appointed by the Court, at State expense [is required to] furnish to [the] Court such assistance as [the] Court may require in order to fulfill the statutory comparative analysis underlying the [proportionality review] requirement . . . .\" (Id., at pp. 1095-1096.) The review mandated by these courts is somewhat imperfect, since no comparison of death sentences with lesser sentences imposed in murder cases is required. (See People v. Jackson (1980) 28 Cal. 3d 264, 362 [168 Cal. Rptr. 603, 618 P.2d 149] (dis. opn. of Bird, C. J.).) Nevertheless, the cases do demonstrate that other state high courts recognize the importance of undertaking some form of proportionality review.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Appellant has not raised the claim that intracase proportionality review, which may be necessary where similarly culpable individuals charged in the same case have received more lenient sentences, mandates a sentence less than death here. (See People v. Dillon (1983) 34 Cal. 3d 441, 488-489 [194 Cal. Rptr. 390, 668 P.2d 697]; cf. People v. Gleckler (1980) 82 Ill.2d 145 [411 N.E.2d 849, 861]; State v. McIlvoy (Mo. 1982) 629 S.W.2d 333, 341-342; Sumlin v. State (1981) 273 Ark. 185 [617 S.W.2d 372, 375].) Appellant has also not raised the claims that the death penalty is imposed with disproportionate frequency on (1) Black male defendants (an issue pending before this court in In re Jackson, Crim. 22165) or (2) male defendants or defendants whose victims were White (see Harris v. Pulley (9th Cir. 1982) 692 F.2d 1189, 1197-1199, vacated and remanded on other grounds, Pulley v. Harris, supra, 465 U.S. 37, remanded (9th Cir. 1984) 726 F.2d 569; see also McCleskey v. Kemp (11th Cir. 1985) 753 F.2d 877, cert. granted, July 7, 1986, U.S. [92 L.Ed.2d 737, 106 S.Ct. 3331] [involving what statistical showing is necessary to establish prima facie case that the death penalty is applied disproportionately to defendants whose victims are White and Black defendants whose victims are White]).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Lynch requires a three-step analysis. The court first examines \"the nature of the offense and/or the offender, with particular regard to the degree of danger both present to society.\" (8 Cal. 3d at p. 425.) The court then ascertains whether more serious crimes are punished in this state less severely than the offense in question. If so, \"the challenged penalty is to that extent suspect.\" (Id., at p. 426.) Finally, the court compares the penalty imposed with punishments imposed for the same offense in other jurisdictions. (Id., at p. 427.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. All statutory references are to the Penal Code unless otherwise specified.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The disparate review procedure has resulted in few findings of disparity. Among the approximately 17,000 determinately sentenced individuals received in state prison during fiscal year 1982-1983 (July 1, 1982, through June 30, 1983) the board found that disparately high sentences had been imposed in only 42 cases. (Board of Prison Terms, Rep. on Sentencing Practices, Determinate Sentencing Law (Feb. 28, 1985) pp. 1, 7.) Of the 38 cases acted upon by trial court which were final at the time of the board's report, the trial courts followed the board's resentencing recommendation on 15 occasions; on 23 occasions they did not. (Id., at p. 7.) Although this opinion compares the disparate review procedures mandated by the DSL to the lack of any similar guarantee in capital sentencing proceedings, it is noteworthy that individuals sentenced to indeterminate terms also receive some degree of comparative review of their terms by the board. These individuals, who for the most part stand convicted of first or second degree murder or kidnapping for robbery, are given a maximum terms of life with the possibility of parole. (See §§ 190, 209, subd. (b).) Even they are entitled to have their parole release dates \"set in a manner that will provide uniform terms for offenses of similar gravity and magnitude in respect to their threat to the public, and that will comply with the sentencing rules that the Judicial Council may issue and any sentencing information relevant to the setting of parole release dates. \"(§ 3041, subd. (a).) The board has promulgated regulations implementing this guarantee. (See, e.g., Cal. Admin. Code, tit. 15, § 2400 et seq. [applicable to individuals convicted of first or second degree murder].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Indeed, the \"circumstances of the crime\" factor (§ 190.3, subd. (a)) encompasses some 20 facts relating to the crime which the trial judge may consider in choosing the upper or lower term. (See Cal. Rules of Court, rules 421(a) \u0026 423(a).) For example, the \"extreme duress\" factor in section 190.3, subdivision (g) is nearly identical to the \"coercion or duress\" mitigating circumstance in rule 423(a)(4). The \"presence or absence of any prior felony conviction\" factor (§ 190.3, subd. (c)) is similar to the \"no prior record or an insignificant record of criminal conduct\" mitigating circumstance (rule 423(b)(1)). And, the \"extreme mental or emotional disturbance\" that the penalty sentencer may consider (§ 190.3, subd. (d)) is similar to the fact that \"[the] defendant was suffering from a mental . . . condition that significantly reduced his culpability for the crime\" mitigating circumstance (rule 423(b)(2)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. If such review procedures were put in place and a disproportionate death sentence were discovered, either the trial court or this court would have the power under section 1181, subdivision 7 to modify it. That statute gives the courts the power to modify a jury-selected punishment without granting or ordering a new trial. In addition, section 1260 empowers an appellate court to reduce a punishment. This power could be invoked if, during the pendency of an appeal, a condemned individual's sentence were discovered to be disproportionate.\u003c/span\u003e\n\n",
    "body_length": 196775,
    "citedas": [
      "232 Cal. Rptr. 849",
      "42 Cal. 3d 1222",
      "729 P.2d 115"
    ],
    "attorneys": "William M. Lyons, under appointment by the Supreme Court, for Defendant and Appellant. John K. Van de Kamp, Attorney General, Steve White, Chief Assistant Attorney General, Arnold O. Overoye, Assistant Attorney General, Ward A. Campbell and Garrett Beaumont, Deputy Attorneys General, for Plaintiff and Respondent.",
    "category": [
      "75"
    ],
    "judges": "Opinion by Grodin, J., with Mosk, J., concurring. Separate concurring opinion by Panelli, J., with Lucas, J., concurring. Separate concurring and dissenting opinion by Broussard, J., with Bird, C. J., and Reynoso, J., concurring. Separate dissenting opinion by Bird, C. J.",
    "citation_count": 2
  }
}
