{
  "id": "SIpqQGYBTlTomsSB-hBs",
  "document": {
    "title": "United States v. McVeigh",
    "full_title": "UNITED STATES OF AMERICA v. TIMOTHY JAMES MCVEIGH .",
    "jurisdiction": "Tenth Circuit",
    "date": "1998-09-09T00:00:00.000Z",
    "docket": "No. 97-1287",
    "body": "PUBLISH\n\nAppeal from the United States District Court for the District of Colorado\n\nDefendant-appellant Timothy J. McVeigh (\"McVeigh\") was tried, convicted, and sentenced to death on eleven counts stemming from the bombing of the Alfred P. Murrah Federal Building (\"Murrah Building\") in Oklahoma City, Oklahoma, that resulted in the deaths of 168 people. McVeigh appeals his conviction and sentence on the grounds that (A) pre-trial publicity unfairly prejudiced him, (B) juror misconduct precluded his right to a fair trial, (C) the district court erred by excluding evidence that someone else may have been guilty, (D) the district court improperly instructed the jury on the charged offenses, (E) the district court erred by admitting victim impact testimony during the guilt phase of trial, (F) the district court did not allow him to conduct adequate voir dire to discover juror bias as to sentencing, (G) the district court erred by excluding mitigating evidence during the penalty phase that someone else may have been involved in the bombing, (H) the district court erred by excluding mitigating evidence during the penalty phase showing the reasonableness of McVeigh's beliefs with regard to events at the Branch Davidian compound in Waco, Texas, and (I) the victim impact testimony admitted during the penalty phase produced a sentence based on emotion rather than reason. We affirm.\n\nBACKGROUND\n\nAt 9:02 in the morning of April 19, 1995, a massive explosion tore apart the Murrah Building in Oklahoma City, Oklahoma, killing a total of 168 people and injuring hundreds more. On August 10, 1995, a federal grand jury returned an eleven-count indictment against McVeigh and Terry Lynn Nichols (\"Nichols\") charging: one count of conspiracy to use a weapon of mass destruction in violation of 18 U.S.C. § 2332a and 18 U.S.C. § 2(a) \u0026 (b); one count of use of a weapon of mass destruction in violation of 18 U.S.C. § 2332a and 18 U.S.C. § 2(a) \u0026 (b); one count of destruction by explosives in violation of 18 U.S.C. § 844(f) and 18 U.S.C. § 2(a) \u0026 (b); and eight counts of first-degree murder in violation of 18 U.S.C. §§ 1111 \u0026 1114 and 18 U.S.C. § 2(a) \u0026 (b). On October 20, 1995, the government filed a Notice of Intent to Seek the Death Penalty. On December 1, 1995, this court granted a Petition for Writ of Mandamus by Nichols to recuse Judge Wayne Alley of the Western District of Oklahoma. In a December 4, 1995, Order, the Chief Judge of this court designated Chief Judge Richard P. Matsch of the District of Colorado to preside over future proceedings.\n\nOn February 19, 1996, the district court granted McVeigh's and Nichols' Motion for Change of Venue and transferred the case to Denver, Colorado. On October 25, 1996, the district court granted a Motion for Severance by McVeigh and Nichols and ordered that McVeigh's trial would proceed first. McVeigh's trial began with voir dire of prospective jurors on March 31, 1997. A jury of twelve with six alternates was sworn in by the district court on April 24, 1997, and opening statements commenced that same day. The government began presenting evidence the following day.\n\nAt the guilt phase of trial, which encompassed twenty-three days of testimony, the government proved the following set of facts. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e The destruction of the Murrah Building killed 163 people in the building and five people outside. Fifteen children in the Murrah Building day care center, visible from the front of the building, and four children visiting the building were included among the victims. Eight federal law enforcement officials also lost their lives. The explosion, felt and heard six miles away, tore a gaping hole into the front of the Murrah Building and covered the streets with glass, debris, rocks, and chunks of concrete. Emergency workers who reported to the scene made heroic efforts to rescue people still trapped in the building.\n\nThe Murrah Building was destroyed by a 3,000-6,000 pound bomb comprised of an ammonium nitrate-based explosive carried inside a rented Ryder truck. In the fall of 1994, McVeigh and Nichols sought, bought, and stole all the materials needed to construct the bomb. First, on September 30, 1994, and October 18, 1994, McVeigh purchased a total of 4,000 pounds of ammonium nitrate from the McPherson branch of the Mid-Kansas Cooperative using the alias \"Mike Havens.\" Second, in October of 1994, McVeigh and Nichols stole seven cases of Tovex explosives and a box of Primadet nonelectric blasting caps from the Martin Marietta rock quarry near Marion, Kansas. Third, on October 21, 1994, McVeigh purchased three drums of nitromethane at a race track outside of Dallas, Texas. Prior to the nitromethane purchase, McVeigh had sought bomb ingredients, including nitromethane, both in person and through the use of a prepaid telephone calling card under the name \"Daryl Bridges.\" Using various aliases, McVeigh and Nichols rented a number of storage lockers in Kansas where they stored the bomb components. In order to fund their conspiracy, McVeigh and Nichols robbed a gun dealer in Arkansas in November of 1994.\n\nIn a letter to Michael and Lori Fortier written around September of 1994, McVeigh disclosed that he and Terry Nichols had decided to take some type of positive offensive action against the federal government in response to the government's siege of the Branch Davidians in Waco, Texas in 1993. On a subsequent visit to their home, McVeigh told the Fortiers that he planned to blow up a federal building. McVeigh later informed the Fortiers that he wanted to cause a general uprising in America and that the bombing would occur on the anniversary of the end of the Waco siege. McVeigh rationalized the inevitable loss of life by concluding that anyone who worked in the federal building was guilty by association with those responsible for Waco.\n\nMcVeigh stated that he had figured out how to make a truck into a bomb using fifty-five-gallon drums filled with ammonium nitrate combined with explosives stolen from the quarry. McVeigh demonstrated the shaped charge he intended to use for the bomb by arranging soup cans on the floor in the same triangle shape in which he was going to place fifty-five-gallon barrels filled with ammonium nitrate combined with nitromethane in the truck. McVeigh also diagramed the truck, barrels, and fusing system on a piece of paper, and stated that he intended to use a Ryder truck. McVeigh told the Fortiers that he chose the Murrah Building as the target because he believed that (1) the orders for the attack at Waco emanated from the building, (2) the building housed people involved in the Waco raid, and (3) the building's U-shape and glass front made it an easy target. On a later trip through Oklahoma City, McVeigh showed Michael Fortier the Murrah Building, asking Fortier whether he thought a twenty-foot rental truck would fit in front of the building.\n\nAlso, towards the end of 1994, McVeigh typed a number of letters discussing the justified use of violence against federal agents as retaliation for the events in Waco. McVeigh told his sister and one of his friends that he had moved from the propaganda stage to the action stage in his dispute with the federal government. McVeigh then warned his sister that \"something big\" was going to happen in April, and asked her to extend her April 1995 Florida vacation. He also instructed her not to write to him any more lest she incriminate herself. The manner in which the bombing was carried out closely tracked several books bought by McVeigh, which he often encouraged his friends to read, describing how to make a powerful bomb mixing ammonium nitrate with nitromethane and romanticizing self-declared patriots who blow up federal buildings. McVeigh was familiar with explosives and had detonated a pipe bomb prior to the attack on the Murrah Building.\n\nFrom April 14 to 18, 1995, McVeigh stayed at the Dreamland Motel located in Junction City, Kansas. On April 14, 1995, McVeigh purchased a 1977 yellow Mercury Marquis from Junction City Firestone in Junction City, Kansas. While waiting to take possession of the car from the dealer, McVeigh made a phone call using the Bridges calling card to Elliott's Body Shop (\"Elliott's\") in Junction City, Kansas, seeking a twenty-foot Ryder truck for a one-way rental to Omaha. McVeigh also called Nichols.\n\nDuring the search of the blast site, the FBI located the rear axle of the Ryder truck used to carry the bomb. The vehicle identification number from the axle matched that of the Ryder truck rented to McVeigh by Elliott's on April 15, 1995, and picked up by McVeigh two days prior to the blast. McVeigh rented the truck under the name \"Robert Kling\" using a phony South Dakota drivers license that Lori Fortier had helped McVeigh create.\n\nMcVeigh drove to Oklahoma City in the rented Ryder truck, which he had made into a bomb, parking the vehicle in front of the Murrah Building and running to the yellow Mercury that he and Nichols had stashed as a getaway car in a nearby alley a couple of days before the bombing. A Ford key fitting the Ryder truck was found in an alley near where McVeigh had told Michael Fortier that the getaway car would be parked. McVeigh hand-printed a sign inside the yellow Mercury, \"Not Abandoned; Please do not tow; will move by April 23 (Needs Battery \u0026 Cable).\" McVeigh deliberately parked the car so that a building would stand between the car and the blast, shielding McVeigh from the explosion. The bomb then exploded.\n\nJust 77 minutes after the blast, Oklahoma State Trooper Charles Hanger (\"Hanger\") stopped the yellow Mercury driven by McVeigh because the car had no license tags. The stop occurred between mile markers 202 and 203 on Interstate 35, just before the exit for Billings, Oklahoma, precisely 77.9 miles north of the Murrah Building. Before he was stopped by Hanger, McVeigh was headed northbound away from Oklahoma City towards Kansas. A person driving the posted speed limit would have reached the point of the stop 75 minutes after leaving the Murrah Building. If McVeigh had left the Murrah Building right after the bombing, he would have arrived at the Billings exit around 10:17 a.m., the approximate time of the stop.\n\nHanger arrested McVeigh upon discovering that he was carrying a concealed, loaded gun. Hanger transported McVeigh to Noble County Jail in Perry, Oklahoma, where McVeigh was booked and incarcerated for unlawfully carrying a weapon and transporting a loaded firearm. Noble County authorities took custody of McVeigh's clothing and property, including earplugs, and issued him prison garb. Two days later, on April 21, 1995, the federal government filed a Complaint against McVeigh for unlawful destruction by explosives. Oklahoma then transferred McVeigh to federal custody on the federal bombing charges. An FBI test performed later found that McVeigh's clothing and the earplugs contained explosives residue, including PETN, EGDN, and nitroglycerine - chemicals associated with the materials used in the construction of the bomb.\n\nA subsequent inventory search of the yellow Mercury uncovered a sealed envelope containing documents arguing that the federal government had commenced open warfare on the liberty of the American people and justifying the killing of government officials in the defense of liberty. Finally, three days after the arrest, Hanger found a Paulsen's Military Supply business card on the floor of his cruiser bearing McVeigh's fingerprints. McVeigh had written on the back of the card, \"TNT at $5/stick Need more\" and \"Call After 01, May, See if I can get some more.\"\n\nClosing arguments were made on May 29, 1997, and the district court charged the jury on May 30, 1997. On June 2, 1997, after four days of deliberations, the jury returned guilty verdicts on all eleven counts charged in the Indictment. The penalty phase of trial commenced on June 4, 1997, and concluded with summations and jury instructions on June 12, 1997. The jury deliberated for two days before returning special findings recommending that McVeigh be sentenced to death. After denying McVeigh's motion for a new trial, the district court accepted the jury recommendation on August 14, 1997, sentencing McVeigh to death on all eleven counts. McVeigh filed a timely notice of appeal that same day. We have jurisdiction pursuant to 28 U.S.C. § 1291, 18 U.S.C. §§ 3742(a) \u0026 3595, and Fed. R. App. P. 4(b).\n\nDiscussion\n\nA. PRETRIAL PUBLICITY\n\nMcVeigh claims that he was denied due process of law under the Fifth Amendment and his right to trial by an impartial jury under the Sixth Amendment because the jury pool was flooded with negative pretrial publicity, especially media reports that he had confessed to his lawyers that he had committed the Oklahoma City bombing. McVeigh argues that the pretrial publicity amounted to both presumed and actual prejudice.\n\n1. Standard of Review\n\nThe two different types of prejudice claimed by McVeigh are subject to different standards of review. Presumed prejudice requires this court to evaluate the complained-of publicity, as well as the circumstances surrounding that publicity, and to determine whether a reasonable juror exposed to such publicity could remain impartial, or whether the publicity was of such a nature as to render impartiality impossible. See Sheppard v. Maxwell, 384 U.S. 333, 351-52 (1966); United States v. Abello-Silva, 948 F.2d 1168, 1176-77 (10th Cir. 1991). The court of appeals undertakes this review of the overall circumstances of the publicity de novo. See Sheppard, 384 U.S. at 362.\n\nA claim of actual prejudice is subjected to a more deferential standard of review. See Stafford v. Saffle, 34 F.3d 1557, 1567 (10th Cir. 1994); Abello- Silva, 948 F.2d at 1177. The determination of whether the seated jury could remain impartial in the face of negative pretrial publicity, and the measures that may be taken to ensure such impartiality, lay squarely within the domain of the trial court. See Mu'Min v. Virginia, 500 U.S. 415, 427 (1991); Patton v. Yount, 467 U.S. 1025, 1039 (1984); Stafford, 34 F.3d at 1567. Therefore, we review the trial court's rulings in this regard for abuse of discretion. See Mu'Min, 500 U.S. at 427; Abello-Silva, 948 F.2d at 1177.\n\n2. Background\n\nAs with the bombing itself, news of McVeigh's arrest received a great deal of attention in the media, and was ubiquitously reported on television, radio, and in print. The image of McVeigh being led, wearing orange jail clothing, through an angry crowd into a van by authorities appeared in print and electronic media nationwide. See United States v. McVeigh, 918 F. Supp. 1467, 1471 (W.D. Okla. 1996). In its ruling granting McVeigh's motion for change of venue the district court noted that it had considered the alternative of moving the trial to Tulsa, Oklahoma, but because of the intensity of the emotional impact of the bombing, and its attendant publicity, on all Oklahomans, it would be impossible for McVeigh to receive a fair jury trial anywhere in the State of Oklahoma. See id. at 1470-74. The district court decided to move the trial to Denver, a large metropolitan area where a \"large jury pool is available.\" See id. at 1474. In this ruling the district court implicitly found that the Denver jury pool was not as intensely affected by the bombing or the subsequent publicity as was the Oklahoma jury pool.\n\nOn February 14, 1997, the district court sent out jury summons to hundreds of people living in the Denver area, notifying them that they had been randomly selected as potential jurors for the McVeigh trial. The notification admonished its recipients to avoid publicity concerning the case that might interfere with their ability to remain impartial. The notification advised the potential jurors that \"[t]here have been many things written and said about the explosion in Oklahoma City. Much of it may be speculation, rumor and incorrect information.\" The notification further stressed the need for all potential jurors to be impartial and willing to base their decision solely on the law and the evidence. The notification concluded with a short, preliminary questionnaire which included a question asking if \"there is any . . . reason that would prevent you from serving on this jury.\"\n\nTwo weeks later, on February 28, the Dallas Morning News published an article on its Internet home page claiming that it was in possession of internal, confidential defense documents that revealed McVeigh had confessed to his own lawyers that he had indeed bombed the Murrah Building in Oklahoma City. See Pete Slover, McVeigh saw `body count' as best way to make statement in Oklahoma City bombing, defense reports state, (visited Feb. 28, 1997) . This story was picked up and reported by both the national and Denver news media. According to the reports, McVeigh had told his lawyers that he deliberately set off the bomb during the daytime in order to obtain a higher \"body count\"; that he had committed the bombing out of a desire to make a point to the federal government, presumably that the government mishandled the 1993 siege of the Branch Davidian compound near Waco, Texas; and that he was assisted in the bombing by Terry Nichols, with whom McVeigh had participated in a number of robberies in order to obtain money and supplies needed to create the bomb. See id.\n\nOn March 4, a chambers conference was held at which the court and parties discussed this development and whether the trial date, originally set for March 31, should be delayed. At this conference, McVeigh's counsel told the court that McVeigh did not want a continuance, but rather desired to go forward with voir dire and seating a jury. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nOn March 11, Playboy Magazine published on its Internet web site an article that claimed to contain information from documents \"lawfully obtained\" from McVeigh's counsel. See Ben Fenwick, The Road to Oklahoma City (visited March 11, 1997) . This article differed from the Dallas Morning News article mainly in the scope of detail with which it describes McVeigh's alleged activities during the time leading up to the bombing and the alleged motivation for the crime. See id. As with the Dallas Morning News story, information contained within the Playboy article was widely disseminated in the national media, as well as in the Denver media. Soon after this, McVeigh filed a motion to dismiss the indictment or, in the alternative, to postpone the trial for a minimum of one year, due to the \"presumed effects of recent publication . . . of stories\" that McVeigh had made incriminating statements. United States v. McVeigh, 955 F. Supp. 1281, 1281 (D. Colo. 1997). The district court dismissed this motion, holding that \"fair-minded persons\" would not be \"so influenced by anything contained in this recent publicity\" that they could not remain impartial. Id. at 1283.\n\nOn March 19, 352 prospective jurors were summoned to the Jefferson County Fairgrounds to fill out an extended questionnaire. Before filling out the questionnaire the court commented that news reports of events are often inaccurate, that most people remain skeptical about such reports, and admonished the potential jurors to set aside all publicity surrounding the case as well as any \"impressions or opinions\" that they may have formed based upon media reports. The court also observed that the constitutional right to a fair trial \"depends on the willingness of citizens to decide the case based entirely on the evidence that they see and hear at the trial . . . . That requires a commitment to set aside any preconceived impressions or opinions.\" After the potential jurors had completed the questionnaires, the court informed them that from that moment on they were required to follow \"the same instructions that will be given to the jury selected in this case.\" The court ordered the prospective jurors \"beginning right now to avoid any news reports of any kind or any communication or publication of any kind that concerns any issues related to the charges in this case.\"\n\nMcVeigh filed an interlocutory writ of prohibition with this court seeking an order \"directing the district court to continue the trial for an indefinite period on grounds of prejudicial pretrial publicity.\" In re McVeigh, No. 97-1117, at 1 (10th Cir. Mar. 28, 1997) (unpublished order). We denied his petition, holding that because voir dire had not yet taken place any ruling on pretrial publicity was premature, given the trial court's \"broad discretion in gauging the effects of allegedly prejudicial publicity and in taking responsive measures to ensure a fair trial.\" Id. at 3.\n\nVoir dire commenced on March 31. Four of the seated jurors indicated either on the questionnaire or during voir dire that they had seen headlines or casually overheard reports of McVeigh's alleged confession, but in each case they indicated that their exposure was only superficial and that they were skeptical of the accuracy of the report. None of the rest of the seated jurors indicated that they had even heard about the alleged confession. Each of the seated jurors affirmed that he or she could remain impartial and decide the case based only on the facts presented in court. 3. Analysis a. Presumed Prejudice\n\nAs this court has held, the claim of presumed prejudice is \"rarely invoked and only in extreme situations.\" Abello-Silva, 948 F.2d at 1177; see also Nebraska Press Ass'n v. Stuart, 427 U.S. 539, 551-54 (1976). Moreover, \"[t]he defendant bears the burden of establishing that prejudice should be presumed.\" Stafford, 34 F.3d at 1566.\n\nIn order for the reviewing court to reach a presumption that inflammatory pretrial publicity so permeated the community as to render impossible the seating of an impartial jury, the court must find that the publicity in essence displaced the judicial process, thereby denying the defendant his constitutional right to a fair trial. See Sheppard, 384 U.S. at 342-45, 352-57 (noting that \"bedlam reigned at the courthouse during the trial\" due to media's intrusive and pervasive presence in the courtroom, inflammatory news reports, often broadcast live from the courtroom, and media hounding of jurors and the defendant); Estes v. Texas, 381 U.S. 532, 577-80 (1965) (Warren, C.J., concurring) (media invasion of courtroom pierced the constitutional shield normally provided to the defendant by destroying \"the dignity and integrity of the trial process\"); Rideau v. Louisiana, 373 U.S. 723, 725-27 (1963) (repeated broadcast in defendant's small community of defendant's video taped \"confession\" to local authorities resulted in a \"kangaroo court\" that derailed due process and quashed any hope of fair trial in that locale); see also Stafford, 34 F.3d at 1566 (evaluating, on the issue of presumed prejudice, whether there was evidence of a \"circus atmosphere or lynch mob mentality\"); Abello-Silva, 948 F.2d at 1177 (\"In cases like Estes, Rideau, and Sheppard, prejudice was presumed because the news media influence pervaded the proceedings, igniting extensive prejudice in the community.\") (quotation omitted). In such cases, we simply cannot rely on \"`jurors' claims that they can be impartial'\" and declare the publicity to be prejudicial as a matter of law. Mu'Min, 500 U.S. at 429 (quoting Patton, 467 U.S. at 1031).\n\nHowever, the bar facing the defendant wishing to prove presumed prejudice from pretrial publicity is extremely high. See Stafford, 34 F.3d at 1566 (\"[Defendant] must establish that `an irrepressibly hostile attitude pervaded the community.' This is a difficult standard, even in cases in which there has been extensive media coverage . . . .\") (quoting Abello-Silva, 948 F.2d at 1176); see also Coleman v. Kemp, 778 F.2d 1487, 1537 (11th Cir. 1985) (\"[T]he presumptive prejudice standard recognized in Rideau is only rarely applicable, and is reserved for an extreme situation. In short, the burden placed upon the petitioner to show that pretrial publicity deprived him of his right to a fair trial before an impartial jury is an extremely heavy one.\") (quotations and citations omitted); United States v. Cooper, 464 F.2d 648, 655 (10th Cir. 1972) (\"`[T]he mere fact of unfavorable publicity does not of itself raise a presumption of prejudice . . . . The prejudice must have manifested itself so as to corrupt due process.'\") (quoting Dennis v. United States, 302 F.2d 5, 8 (10th Cir. 1962)). Indeed, despite the proliferation of the news media and its technology, the Supreme Court has not found a single case of presumed prejudice in this country since the watershed case of Sheppard.\n\nMcVeigh's claim of presumed prejudice fails to clear this high hurdle. The circumstances that led the Court to presume prejudice in Sheppard, Estes, and Rideau simply do not exist in this case. First, McVeigh's attempt to show presumed prejudice is substantially weakened by the fact that, unlike the defendants in Sheppard and Rideau, he did receive a change in venue, removing his trial from the eye of the emotional storm in Oklahoma to the calmer metropolitan climate of Denver. Second, mere television images of the defendant in prison garb being led through an angry crowd do not come close to the type of inflammatory publicity required to reach the disruptive force seen in Sheppard, Estes, and Rideau. For this reason, we focus, as does McVeigh in his briefs before this court, mainly on the prejudicial effect on the Denver jury pool of the publication of reports that McVeigh confessed the crime to his attorneys. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nThe disclosure and publication of information obtained from documents purporting to contain confidential communications between an individual and his attorneys indicates a lack of self-restraint and ethical compass on the part of those individuals responsible for doing so. However, the fact that McVeigh's attorneys denied the validity of the confessions gave rise to publicly aired doubts of the accuracy of the reports, a fact that somewhat lessened the reports' prejudicial impact on the public mind. Indeed, the Dallas Morning News Internet article includes in its headline the following words: \"Suspect's attorney disputes reliability of documents.\" Unlike Rideau, here there was no video taped broadcast of an actual confession. Nor was there a reproduction of a printed confession signed by McVeigh. In short, the publicity here did not contain an actual confession but only the second-hand or perhaps even third-hand or more unattributed hearsay report of a confession. Such an indirect report of a confession will have far less impact than the situation where the actual confession is broadcast. Cf. Mu'Min, 500 U.S. at 418, 430-31 (press reports of \"indications that [defendant] had confessed\" did not preclude seating of an unbiased jury); Patton, 467 U.S. at 1029, 1040 (same). The hearsay nature of the reports of McVeigh's confession, the publicized denial of the accuracy of those reports, the strong admonitions given by the court both before and after the publicity about the purported confession, the fact that a large number of the venirepersons summoned were not even aware of the reports of McVeigh's alleged confession, and the change of venue, all persuade us that the pretrial publicity of which McVeigh complains in this case did not \"manifest[ ] itself so as to corrupt due process.\" Cooper, 464 F.2d at 655. Thus, it does not warrant a presumption of prejudice. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nb. Actual Prejudice\n\nIn reviewing for actual prejudice, we examine the circumstances of the publicity and the voir dire, and merely determine \"whether the Judge had a reasonable basis for concluding that the jurors selected could be impartial.\" Abello-Silva, 948 F.2d at 1177-78 (quotation omitted). Moreover:\n\nImpartiality does not mean jurors are totally ignorant of the case. Indeed, it is difficult to imagine how an intelligent venireman could be completely uninformed of significant events in his community. \"It is sufficient if the juror can lay aside his impression or opinion and render a verdict based on the evidence presented in court.\"\n\nId. (quoting Irvin v. Dowd, 366 U.S. 717, 723 (1961)). What we must decide here is whether the district court abused its discretion in determining that the seated jury could disregard the adverse pretrial publicity and render an impartial verdict. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nWe do not believe that the district court abused its discretion. Here, the district court went to great lengths to admonish all potential jurors to ignore the publicity surrounding the issues of the case. In fact, McVeigh does not argue that the district court failed to take strong measures to ensure juror impartiality, but rather takes the position that the district court's admonitions had the unintended effect of increasing the jury pool's interest in publicity about the case and informed potential jurors of the answers that would be expected of them if they hoped to get on the jury. The assertion that the court's admonitions had the unintended effect of increasing the venirepersons' interest in publicity may be tested by asking if an abnormally large number of venirepersons indicated having knowledge of the alleged confession. To the contrary, a significant number of venirepersons indicated that they had not heard the news of McVeigh's alleged confession, suggesting that the court's earlier admonitions to avoid publicity associated with the case had the desired effect. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e McVeigh's claim that the court's admonitions served to instruct already prejudiced would-be jurors how to mask that prejudice in order to get onto the jury calls for pure speculation. We could equally speculate that the court's admonitions - that it is normal for people to be affected by publicity, and that a \"good juror\" is expected to put any conclusions based upon that publicity aside - might encourage those who had formed an opinion based upon pretrial publicity to disclose that fact without fear of shame and to encourage them to agree to set those opinions aside. McVeigh's claim fails.\n\nMoreover, each of the seated jurors in this case was asked if he or she could put aside media reports and decide the case only on evidence presented in court. Each responded that he or she could. Voir dire was by no means a hurried affair; each seated juror's voir dire accounted for an average of forty-eight transcript pages, or a period of an hour or so. The members of the jury pool were subjected to two screening questionnaires, individual questioning by the court, and questioning by counsel for both the government and McVeigh. Questioning by the court and the parties goes a long way towards ensuring that any prejudice, no matter how well hidden, will be revealed.\n\nFinally, each of the four seated jurors who mentioned having heard something about McVeigh confessing also unequivocally stated that he or she nonetheless could keep an open mind about the case and would adjudicate it on its merits. Granted, the fact that potential jurors declare that they can remain impartial in the face of negative pretrial publicity is not always dispositive of the question. See Irvin, 366 U.S. at 727-28. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e However, we give due deference to jurors' declarations of impartiality and the trial court's credibility determination that those declarations are sincere. See Mu'Min, 500 U.S. at 420-21, 431-32; Patton, 467 U.S. at 1036-40; Stafford, 34 F.3d at 1567-68; Abello-Silva, 948 F.2d at 1177-78; Cummings v. Dugger, 862 F.2d 1504, 1510 (11th Cir. 1989). Unlike an appellate court, the trial court has the opportunity to make a first-hand evaluation of a juror's demeanor and responsiveness to voir dire questions in deciding impartiality issues. See Rosales-Lopez v. United States, 451 U.S. 182, 188-89 (1981) (plurality opinion).\n\nBecause the district court repeatedly stressed the importance of avoiding the pretrial publicity concerning the case, because each of the seated jurors was individually questioned about his or her ability to set aside the effects that any exposure to pretrial publicity may have had, because each juror declared that he or she could remain impartial and decide the case on its merits, and because the district court was satisfied that each juror seated was sincere in that declaration, we hold that the district court did not abuse its discretion in determining that this jury could and would decide the case in a fair and impartial manner.\n\nB. JUROR MISCONDUCT\n\nMcVeigh contends that one of the jurors committed misconduct by deciding his guilt before the case was submitted to the jury. In analyzing this issue, we must decide two questions: first, whether the district court erred in not holding a hearing on this allegation of juror misconduct, and second, whether the district court erred in not dismissing the juror for the alleged misconduct.\n\n1. Standard of Review\n\nThe government has suggested that we review for plain error the question whether the district court should have held a hearing on the allegations of juror misconduct because the defense did not specifically request a hearing but instead asked only that the juror be excused. However, during a conference with counsel the court made it plain that it would not hold a hearing. Under the circumstances, the defense was not obligated to ask for a hearing. Consequently, we review for abuse of discretion the court's decision on how to handle the allegation of juror misconduct. See United States v. Bornfield, 145 F.3d 1123, 1132 (10th Cir. 1998); United States v. Bradshaw, 787 F.2d 1385, 1390 (10th Cir. 1986).\n\nWe also review for abuse of discretion the question whether this juror should have been excused from service. See Anderson v. Dun \u0026 Bradstreet, Inc., 543 F.2d 732, 734 (10th Cir. 1976). However, the decision whether to excuse a juror rests on whether the juror can remain impartial, a matter of fact uniquely within the observation of the trial court. See United States v. Barone, 114 F.3d 1284, 1307 (1st Cir.), cert. denied, 118 S. Ct. 614 (1997).\n\n2. Background\n\nDuring the morning of Monday, May 12, 1997, an alternate juror reported to the Clerk of the district court the substance of a discussion that had taken place in the jury room the previous Friday, May 9. The jurors had been conversing about who might be the alternates, and one juror said, \"I hope I'm not the hold-out juror.\" In response, another juror said, \"It wouldn't be very hard. I think we all know what the verdict should be.\" \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nAt the noon recess, after receiving the Clerk's report of the conversation, the Judge gave the following instructions to the jury: Members of the jury, we're going to recess again as usual for the hour-and-a-half lunch period. And I want to reemphasize what I've been saying each time when we recess about the extreme importance here of each of you maintaining an open mind with respect to the case and all aspects of it.\n\nI know that at times that's difficult to do, because you're together and we keep you in a relatively confined area. And naturally, you talk about a lot of things, sometimes lightheartedly, bantering about this and that. And I suppose sometimes it's tempting to talk about the case and where we are in the case, what progress we have or have not made, when it may be given to you for decision.\n\nAll of those things are off limits, and I want you to know that. I can't tell you where we are in the case. This isn't a computer program. This is a human event, a trial. We can't tell you how long particular witnesses will be. And you can't at this point - and nobody else can - fit the testimony of any one witness into the case as a whole. Remember that we are hearing witnesses called by the Government. Defense has an opportunity to call witnesses. Some witnesses may seem to you as we go along more important than others. Don't let that happen, even in your own thinking. You have got to, every time we break here, put it at rest.\n\nThe reason for these breaks in part, of course, is of course to take lunch but also to give you some time to relax. Don't use that time to talk about anything in connection with this case. Don't speculate about it. Don't talk about it. Keep open minds. If you don't, you're violating the oath that you've taken to decide this case based on all of the evidence presented to you.\n\nSo even in jest, say nothing about in case [sic] among yourselves.\n\nAt the end of the day's proceedings, the Judge again cautioned the jury, saying:\n\nMembers of the jury, we're going to recess, as usual, this being 5:00; and again, during the time of this recess, of course, you must be very careful to avoid anything that may appear in radio, television, newspapers, magazines, whatever, concerning the trial, today's testimony, anything that relates to the trial, knowing, of course, the importance of your holding true to your oath to be able to decide this case based on what happens in this room and also hold true to your obligation to keep open minds until you've heard it all. You recall back as long ago as the time that we talked with you during jury selection of the importance of this, and we have to hold you to that and your honor in following that. You're on an honor system.\n\nAnd, you know, the honor system is all that I can rely on so that I don't sequester you. So it's very important. And a part of the honor system is that if any of you violate that in any way, others of you will tell me about it.\n\nAfter the jury had been dismissed for the day, the Judge then held a conference with counsel and informed them of the juror's report. The defense moved that the juror who commented \"I think we all know what the verdict should be\" be stricken from the jury. The government said it was satisfied with the court's curative instructions. It suggested, however, that if the court felt further measures were necessary it should first \"call in\" the juror. The court decided not to hold a hearing on the allegation and effectively denied the defense's motion to strike the juror.\n\n3. Analysis\n\na. Should the district court have held a hearing?\n\nMcVeigh first contends that the district court abused its discretion when it refused to hold a hearing on the alternate juror's allegations. Although this is a fairly close question, we conclude that the district court's refusal to hold a hearing was not an abuse of discretion.\n\nAs the case law makes evident, there are varying degrees of juror misconduct. The most serious cases of misconduct involve extraneous influences on the jury, such as jurors becoming privy to prejudicial information not introduced into evidence or having improper contacts with parties, witnesses, or third parties. See United States v. Resko, 3 F.3d 684, 690 (3d Cir. 1993); see also Fed. R. Evid. 606(b) (allowing juror to testify after verdict only on question whether extraneous information was brought to jury's attention); United States v. Wacker, 72 F.3d 1453, 1466 (10th Cir. 1995) (doubting that presumption of prejudice which applies to extraneous contacts would apply to communications among venirepersons). Generally, allegations of extraneous influences require the district court to hold a hearing. See Remmer v. United States, 347 U.S. 227, 229-30 (1954); United States v. Thompson, 908 F.2d 648, 651 (10th Cir. 1990); United States v. Hornung, 848 F.2d 1040, 1045 (10th Cir. 1988). However, even in cases involving such allegations, we have held that on rare occasions it is within the district court's discretion to refuse to hold a hearing when it can clearly be established that a hearing would not be useful or necessary. See United States v. Davis, 60 F.3d 1479, 1483-84 (10th Cir. 1995) (hearing unnecessary when district court already had sufficient facts to know the extent of the extraneous contact); United States v. Rosales, 680 F.2d 1304, 1306 (10th Cir. 1981) (no abuse of discretion to decline to hold a hearing when there was no evidence that any juror other than the one discharged heard the extraneous remarks).\n\nUnlike cases concerning extraneous influences, this case involves an allegation of intrajury misconduct, specifically the allegation that a juror had reached a premature Conclusion regarding McVeigh's guilt. Although premature Discussions among jurors may prejudice the defendant, see Resko, 3 F.3d at 689-90, intrajury misconduct generally has been regarded as less serious than extraneous influences on the jury. See United States v. McClinton, 135 F.3d 1178, 1186 (7th Cir.), cert. denied, 118 S. Ct. 2308 (1998), petition for cert. filed (U.S. June 30, 1998) (No. 98-5078); United States v. Williams-Davis, 90 F.3d 490, 505 (D.C. Cir. 1996), cert. denied, 117 S. Ct. 986, 988 (1997); United States v. Bertoli, 40 F.3d 1384, 1394 (3d Cir. 1994); Resko, 3 F.3d at 690; United States v. Tierney, 947 F.2d 854, 869 (8th Cir. 1991); United States v. Harris, 908 F.2d 728, 733 (11th Cir. 1990); United States v. Webster, 750 F.2d 307, 338-39 (5th Cir. 1984). Consequently, an allegation of intrajury misconduct may or may not warrant a hearing. See Bradshaw, 787 F.2d at 1389-90 (declining to adopt per se rule that a hearing was required and finding no abuse of discretion in declining to hold a hearing); see also United States v. Abrams, 137 F.3d 704, 708 (2d Cir.) (per curiam) (holding no abuse of discretion in dealing with alleged intrajury misconduct by means of a curative instruction rather than a hearing and noting the risk that a hearing might unduly emphasize the problem), petition for cert. filed, 66 U.S.L.W. 3791 (U.S. May 26, 1998) (No. 97-1979); United States v. Stafford, 136 F.3d 1109, 1112 (7th Cir.) (same), petition for cert. filed (U.S. June 8, 1998) (No. 97-9408); Harris, 908 F.2d at 733-34 (deferring to trial Judge's decision in one instance to hold only a limited hearing and in another not to hold a hearing due to ambiguity of juror remarks); United States v. Read, 658 F.2d 1225, 1241 (7th Cir. 1981) (strong cautionary instruction to jury that had seemingly made up its mind prior to Conclusion of trial was proper exercise of discretion); United States v. Panebianco, 543 F.2d 447, 457 (2d Cir. 1976).\n\n\"Courts face a delicate and complex task whenever they undertake to investigate reports of juror misconduct or bias during the course of a trial.\" United States v. Thomas, 116 F.3d 606, 618 (2d Cir. 1997). In determining whether the allegation is sufficiently serious to warrant a hearing, the district court must consider \"the content of the allegations, including the seriousness and likelihood of the alleged bias, and the credibility of the source.\" United States v. Jones, 707 F.2d 1169, 1173 (10th Cir. 1983) (citation omitted). Ultimately, the court must weigh the benefits of having a hearing, including the ability perhaps to ascertain more fully the extent and gravity of the possible prejudice, against the risks inherent in interrupting the trial and possibly placing undue emphasis on the challenged conduct. See Bertoli, 40 F.3d at 1395; Harris, 908 F.2d at 734; United States v. Chiantese, 582 F.2d 974, 980 (5th Cir. 1978).\n\nHere, the district court already knew much of the information that a hearing would have provided, including who made the statement, what was said, and the general circumstances surrounding the statement. Cf. Resko, 3 F.3d at 690-91 (holding that the district court abused its discretion in failing to hold a hearing where the presence or absence of juror prejudice could not be determined on the existing record). The only facts that the Judge did not know here was what exactly the juror meant by the statement, who overheard the statement, and how it was interpreted by any juror who may have overheard it. These are admittedly important considerations. However, in United States v. Day, 830 F.2d 1099, 1104 (10th Cir. 1987), we held that a district court \"armed only with the undisputed content of the conversation . . . had an adequate basis to find, as a matter of law, that no prejudice resulted\" without having examined the juror who participated in the conversation.\n\nHere, several factors probably influenced the district court in its decision not to hold a hearing, but rather to address the problem with strong curative instructions. Foremost, such a proceeding may have drawn undeserved attention to the remark. Further, the court, from its own observations, was under the impression that the juror who allegedly made the remark generally followed the court's instructions and typically nodded his head in agreement while instructions were given, so that the court's alternative remedy of giving strong curative instructions was reasonably calculated to correct the problem. We are less likely to find an abuse of discretion where a district court implements reasonably effective alternative measures even though it does not hold a hearing. See Abrams, 137 F.3d at 708-09; Read, 658 F.2d at 1241; Panebianco, 543 F.2d at 457. The district court's curative instructions reminded the jurors that they had the duty to report any juror misconduct. The record does not suggest that the court received any further reports of misconduct, so it would appear that the instructions were effective.\n\nWe hold that under these circumstances the district court did not abuse its discretion in declining to hold a hearing on the allegation of juror misconduct. As a caveat to the courts of this circuit, though, we note that \"[w]hen a party's suggestion that a jury is biased is not frivolous, the district court ordinarily should undertake an adequate inquiry into the questions of whether the bias actually existed and whether it was prejudicial.\" Bradshaw, 787 F.2d at 1390 (quotation omitted). Here, holding a hearing would have been preferable so that the record would be clear whether the juror even made the comment, and if so, what he meant by it and who heard it. However, we are limited to reviewing the district court's decision for abuse of discretion, rather than de novo, and thus we decline to find reversible error.\n\nb. Should the juror have been excused?\n\nRegardless of whether it held a hearing, the district court also had to decide whether the juror was so tainted as to deny the defendant his constitutional right to an impartial jury. See Davis, 60 F.3d at 1484.\n\nThe remark \"I think we all know what the verdict should be\" is on its face ambiguous. The district court interpreted the comment as a non-serious remark, but the statement may also reflect a premature conclusion regarding McVeigh's guilt. In any event, the very ambiguity of the remark is a reason to defer to the trial court's superior ability to evaluate the demeanor and conduct of the juror in gauging impartiality. See Harris, 908 F.2d at 734. On this record, we cannot find that the trial court was clearly erroneous in concluding that, upon receiving the curative instructions, the members of the jury remained impartial. See Wacker, 72 F.3d at 1467; Read, 658 F.2d at 1241. Thus, we find no abuse of discretion in allowing the juror to remain seated.\n\nC. EVIDENCE OF ALLEGED ALTERNATIVE PERPETRATORS\n\nMcVeigh challenges the district court's decision to exclude two lines of evidence that McVeigh argues would suggest that persons connected with a white-supremacist, anti-government organization in Stillwell, Oklahoma, known as \"Elohim City,\" were involved in the conspiracy to destroy the Murrah Building. McVeigh contends that the district court abused its discretion \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e when it excluded as \"not sufficiently relevant\" both the proffered testimony from Carol Howe (\"Howe\"), an undercover government informant at Elohim City, and other proffered evidence that McVeigh argues would have shown the government suspended its independent investigation of Elohim City in the wake of McVeigh's arrest.\n\nMcVeigh argues that this ruling was based solely on the relevance standard of Rule 401. The government, however, argues that the court's ruling incorporates both the relevance standard of Rule 401 and the balancing required in Rule 403. The text of the court's ruling appears to favor the government's position, indicating that the court found some \"relevance\" under Rule 401, but not enough to be \"sufficient\" under Rule 403.\n\n1. Standard of review\n\nGenerally, we review a district court's ruling on the relevance and potential prejudice of proffered evidence under the abuse-of-discretion standard. See United States v. Call, 129 F.3d 1402, 1405 (10th Cir. 1997), cert. denied, 118 S. Ct. 2064 (1998). Furthermore, this circuit has never found a per se abuse of discretion simply because a trial court failed to make explicit, on-the-record findings for a decision under Federal Rule of Evidence 403 other than when the disputed evidence is offered pursuant to one of the specialized character evidence rules. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e See generally Navarro de Cosme v. Hospital Pavia, 922 F.2d 926, 931 (1st Cir. 1991) (explaining that \"it is understood that in Rule 403 decisions explicit findings need not always be made\") (quotation omitted); 22 Charles Alan Wright \u0026 Kenneth W. Graham, Jr., Federal Practice \u0026 Procedure § 5224, at 321 (1978) (noting that on-the-record findings are not required by Rule 403, but encouraged by commentators). See also Brown v. Southeastern Penn. Transp. Auth. (In re Paoli R.R. Yard PCB Litig.), 113 F.3d 444, 457 n.8 (3d Cir. 1997) (holding that Rule 403 \"normally require[s] a district court to make explicit its reasoning,\" and that the rule imposes an \"obligation\" on trial courts \"to perform this weighing process on the record,\" but excusing the lack of explicit findings in that case because of the procedural posture in which the court's ruling occurred).\n\nAlthough the trial court should, of course, always make explicit findings to support its Rule 403 rulings, there may be occasions when the record is such that we can do our own de novo balancing of the Rule 403 factors without requiring a remand of that issue to the district court. See, e.g., Glass v. Philadelphia Elec. Co., 34 F.3d 188, 191 (3d Cir. 1994) (holding that when a trial court fails to articulate its balancing of probativity and prejudice under Rule 403, an appellate court may, under appropriate circumstances, either \"decide the trial court implicitly performed the required balance; or, if we decide the trial court did not, we undertake to perform the balance ourselves\") (quotation omitted); Black v. Ryder/P.I.E. Nationwide, Inc., 15 F.3d 573, 587 (6th Cir. 1994); see also United States v. Graham, 83 F.3d 1466, 1473 (D.C. Cir. 1996), cert. denied, 117 S. Ct. 993 (1997).\n\nHere, the district court failed to make an explicit record of its balancing of the Rule 403 factors. However, we may conduct a de novo balancing because the record contains a colloquy between the court and counsel that sheds considerable light on how the district court viewed the evidence. We conclude that even if there was probative value to McVeigh's proffered evidence, it was \"substantially outweighed by the danger of unfair prejudice, confusion of the issues, or misleading the jury. . . .\" See Fed. R. Evid. 403. Thus, there was no error in excluding such evidence.\n\n2. Background\n\nNear the end of the trial's guilt phase, McVeigh's defense counsel made an oral proffer during an in-chambers hearing concerning the defense's evidence of alternative perpetrators. This proffer focused on Howe's expected testimony concerning her various visits to Elohim City in 1994-1995.\n\nHowe allegedly would have testified that during her trips to Elohim City, she met Dennis Mahon (\"Mahon\"), one of Elohim City's leaders, and that Mahon was a violent opponent of the federal government. Howe would have testified that Mahon instructed her in the preparation of napalm and had shown her various bomb components at Elohim City, including a tap, green fuse, black powder, bolts, a funnel, and a grenade shell. Mahon also discussed the availability and cost of the explosive Semtex, as well as his experience in building and exploding a 500-pound ammonium nitrate bomb under a truck in Michigan.\n\nHowe's proffered testimony also promised to discuss Andreas Strassmeir (\"Strassmeir\"), another leader at Elohim City, who allegedly discussed acquiring bomb components for Elohim City. Howe was to testify that Mahon and Strassmeir had discussed targeting a federal building in either Oklahoma City or Tulsa, or an IRS building. Howe also was to testify about the appearance at Elohim City in the spring of 1995 of James Ellison, who had developed plans to bomb the Murrah Building in 1983 before he was imprisoned on unrelated charges. Furthermore, Howe would have testified about the affinity of the Elohim City members for the people killed in the government's siege of the Branch Davidian compound in Waco, Texas. Finally, two days after the bombing, Howe told federal agents that she allegedly had seen two brothers at Elohim City before the bombing who resembled the composite drawings of \"John Doe 1\" and \"John Doe 2,\" the suspects originally sought by the government in the immediate aftermath of the bombing. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nSeparately from Howe's testimony, McVeigh's counsel also offered to introduce copies of FBI and ATF reports that McVeigh argued would establish that the federal investigation into Elohim City was suspended after McVeigh was arrested.\n\nMcVeigh contends that this proffered evidence was relevant to two separate propositions: first, that there were other perpetrators of the bombing, and second, that the government's investigation of the bombing was \"shoddy and slanted,\" with investigators allegedly overlooking exculpatory evidence after they became satisfied that McVeigh was the principal perpetrator.\n\nAfter hearing the proffer, the district court ruled, \"Well, we've had a number of disclosures concerning Mahon, Strassmeir, Elohim City and now some additional information from Carol Howe. But my ruling is that it's excluded, not sufficiently relevant to be admissible.\"\n\n3. Analysis\n\na. Relevance under Rule 401\n\nUnder the Federal Rules of Evidence, \"[a]ll relevant evidence is admissible,\" subject to the limitations provided by the Federal Rules and other laws; any evidence \"which is not relevant is not admissible.\" See Fed. R. Evid. 402. Thus, the threshold to admissibility is relevance. The scope of relevancy is bounded only by the liberal standard of Rule 401, which provides that evidence is relevant if it has \"any tendency to make the existence of any fact that is of consequence to the determination of the action more probable or less probable than it would be without the evidence.\" See Fed. R. Evid. 401. As commentators have noted, Rule 401's definition of relevancy incorporates notions of both materiality and probativity. See 1 Kenneth S. Broun, et al., McCormick on Evidence § 185, at 774-75 (John William Strong ed., 4th ed. 1992); Wright \u0026 Graham, supra, §§ 5164, 5165, at 37-38, 48-50.\n\nAs for materiality, under Rule 401 a fact is \"of consequence\" when its existence would provide the fact-finder with a basis for making some inference, or chain of inferences, about an issue that is necessary to a verdict. See Wright \u0026 Graham, supra, § 5164, at 42-43. As for the degree of probative value required under Rule 401, the rule sets the bar very low. See Daubert v. Merrell Dow Pharmaceuticals, Inc., 509 U.S. 579, 587 (1993); Amoco Rocmount Co. v. Anschutz Corp., 7 F.3d 909, 919 (10th Cir. 1993). The rule establishes that even a minimal degree of probability - i.e., \"any tendency\" - that the asserted fact exists is sufficient to find the proffered evidence relevant. See Fed. R. Evid. 401. The Advisory Committee explained that the \"any tendency\" language establishes that the \"standard of probability under the rule is `more . . . probable than it would be without the evidence.'\" See id. Adv. Comm. Notes (1972 Proposed Rules) (quoting Fed. R. Evid. 401).\n\nb. Balancing under Rule 403\n\nEven though evidence may meet the relevancy standard of Rule 401, a trial court still may exclude it on the grounds that its probative value - the evidence's probability of establishing a fact of consequence - is \"substantially outweighed\" by certain negative factors. See Fed. R. Evid. 403. Those factors include \"unfair prejudice,\" \"confusion of the issues,\" and \"misleading the jury.\" See id.\n\nThe danger of \"unfair prejudice\" under Rule 403 is not simply the tendency of evidence to undermine a party's position. Rather, the prejudice that is \"unfair\" is prejudice arising from the tendency of proffered evidence to suggest to the jury that it should render its findings \"on an improper basis, commonly, though not necessarily, an emotional one.\" See Fed. R. Evid. 403, Adv. Comm. Notes (1972 Proposed Rules).\n\nThe danger of \"confusion of the issues\" and \"misleading the jury\" arises when circumstantial evidence would tend to sidetrack the jury into consideration of factual disputes only tangentially related to the facts at issue in the current case. See United States v. Guardia, 135 F.3d 1326, 1331-32 (10th Cir. 1998). The classic explanation of this danger comes from Dean Wigmore: \"The notion here is that, in attempting to dispute or explain away the evidence thus offered, new issues will arise as to the occurrence of the instances and the similarity of conditions, [and] new witnesses will be needed whose cross examination and impeachment may lead to further issues.\" 2 John Henry Wigmore, Evidence § 443, at 528-29 (James H. Chadbourn rev., 1979).\n\nIn the course of weighing probative value and adverse dangers, courts must be sensitive to the special problems presented by \"alternative perpetrator\" evidence. Although there is no doubt that a defendant has a right to attempt to establish his innocence by showing that someone else did the crime, a defendant still must show that his proffered evidence on the alleged alternative perpetrator is sufficient, on its own or in combination with other evidence in the record, to show a nexus between the crime charged and the asserted \"alternative perpetrator.\" See Matthews v. Price, 83 F.3d 328, 332 (10th Cir. 1996). It is not sufficient for a defendant merely to offer up unsupported speculation that another person may have done the crime. Such speculative blaming intensifies the grave risk of jury confusion, and it invites the jury to render its findings based on emotion or prejudice.\n\nFinally, after identifying the degree of probative value and adverse danger, courts exclude relevant evidence if the adverse dangers \"substantially outweigh\" the probative value. See Fed. R. Evid. 403.\n\nc. Admissibility of Carol Howe's proffered testimony\n\nEven if we assume that the proffered evidence had some marginal relevance, the Howe testimony cannot survive the balancing under Rule 403. First, we conclude that the probative value of such proffered testimony was slight because of its highly generalized and speculative nature. The fact that another group held similar anti-government views as did McVeigh and that some of its members expressed vague threats to bomb a variety of potential targets in Oklahoma, possibly including a federal building in Oklahoma City, says very little about whether this group actually bombed the Murrah Building. That others shared McVeigh's political views is a slender reed upon which to vault the dangers of unfair prejudice and jury confusion. Howe's alleged identification of \"John Doe 1\" and \"John Doe 2\" arguably increases the probative value of her other testimony. However, the composite sketches included no particular identifying features that would strengthen the significance of Howe's allegation of two matches. In fact, there are undoubtedly thousands of men across America who resembled the government's composite sketches. Finally, there was no evidence in this proffer, or in the record, that would establish a probative nexus between the alleged Elohim City conspiracy and the bombing of the Murrah Building.\n\nIn the face of the speculative probative value of Howe's testimony, we must confront the very real dangers of unfair prejudice and confusion of the issues. The Howe testimony presented a great threat of \"confusion of the issues\" because it would have forced the government to attempt to disprove the nebulous allegation that Elohim City was involved in the bombing. This side trial would have led the jury astray, turning the focus away from whether McVeigh - the only person whose actions were on trial - bombed the Murrah Building. It also presented a threat of \"unfair prejudice\" as it would invite the jury to blame absent, unrepresented individuals and groups for whom there often may be strong underlying emotional responses.\n\nThus, the district court did not err in excluding this testimony.\n\nd. Admissibility of suspension of Elohim City investigation\n\nMcVeigh's additional claim of error involves the exclusion of FBI and ATF reports pertaining to the activities of the Elohim City group. McVeigh contends that the reports show that the government's investigation of Elohim City was \"shoddy\" and \"slanted\" because they allegedly show that the government failed to investigate other potential suspects once it focused on McVeigh.\n\nMcVeigh's argument runs aground on both his factual and legal premises. Factually, these reports simply do not support his claim that the government's investigation of Elohim City was shoddy or that the government prematurely terminated the investigation. To the contrary, the proffered reports suggest that the government actively pursued the potential connection between Elohim City and the bombing, and that this aspect of the bombing investigation remained open well after McVeigh became the primary focus. The reports suggest that the government was unwilling to send Howe back into Elohim City, as a confidential informant, because leaders of that group had begun to suspect her status and she had received warnings that she would be in danger if she returned to Elohim City. These details in the ATF and FBI reports do not in the slightest offer any probative evidence for McVeigh's unfounded speculation that the government's investigation was shoddy or prematurely terminated.\n\nThe legal premise of McVeigh's claim - that the quality of the government's investigation was material to his defense - also founders. Admittedly, the quality or bias of a criminal investigation occasionally may affect the reliability of particular evidence in a trial, and hence, the facts surrounding the government's investigation may become relevant. See Lowenfield v. Phelps, 817 F.2d 285, 291-92 (5th Cir. 1987) (holding that it was a reasonable trial strategy to attempt to argue that \"sloppy police work\" tainted the chain of custody for certain guns seized by police and \"set the stage for an argument that others were implicated in the murders\"), aff'd on other grounds, 484 U.S. 231 (1988). However, in McVeigh's case, he failed to establish the requisite connection between the allegedly \"shoddy\" and \"slanted\" investigation and any evidence introduced at trial. There was no trial evidence whose reliability would have been undercut had McVeigh been able to prove his contentions about the Elohim City investigation. To have allowed McVeigh to put the government on trial because there might have been something more the government perhaps could have done with respect to the activities of the Elohim City group would inevitably divert the jury's attention from the issues of the trial. See United States v. Veal, 23 F.3d 985, 989 (6th Cir. 1994) (upholding a trial court's refusal to allow a defendant to show that the government's investigation had been \"sloppy\" because \"the jury would not be called upon to determine whether the government's investigation had been good or bad\").\n\nUnder our system of criminal Justice, the issue submitted to the jury is whether the accused is guilty or not guilty. The jury is not asked to render judgment about non-parties, nor is it normally asked to render a verdict on the government's investigation. The district court did not abuse its discretion, but rather is to be commended, in keeping the focus of the trial upon the issues properly before the jury.\n\nD. CRIMINAL INTENT AND LESSER-INCLUDED OFFENSES\n\nMcVeigh argues that the district court improperly instructed the jury regarding the intent elements of the mass destruction crimes with which he was charged and that the district court erred in refusing to instruct the jury on lesser-included offenses for the mass destruction offenses and the first-degree murder charges. In particular, he contends that: (1) 18 U.S.C. § 2332a (1994) and 18 U.S.C. § 844(f) (1994) require the government to prove a specific intent to kill as an element of those crimes and the district court erred in failing to instruct on that element; (2) the district court erred in concluding that there are no lesser-included offenses to § 2332a and § 844(f) involving an intent of something less than a specific intent to kill; and (3) the district court erred in concluding that the evidence did not warrant giving instructions on second-degree murder as a lesser-included offense of first-degree murder.\n\n1. Standard of Review\n\nWhether § 2332a and § 844(f) have as an element the specific intent to kill are questions of statutory construction, and so are reviewed de novo. See United States v. Agnew, 931 F.2d 1397, 1407 (10th Cir. 1991). Whether § 2332a and § 844(f) have any lesser-included offenses are also questions of law and will be reviewed de novo. See United States v. Duran, 127 F.3d 911, 914 (10th Cir. 1997), cert. denied, 118 S. Ct. 1389 (1998). We review for abuse of discretion whether the evidence warranted an instruction regarding second-degree murder as a lesser-included offense of first-degree murder. See id.\n\n2. Analysis\n\na. Criminal Intent on Mass Destruction Offenses\n\nMcVeigh contends that one of the elements of the mass destruction offenses charged in Counts I, II, and III is a specific intent to kill when the charge is that deaths were caused by a bombing. He argues that the district court should have construed 18 U.S.C. § 2332a and 18 U.S.C. § 844(f) as containing two levels of criminal intent, comparable to first-degree and second-degree murder, and as a result, the government should have been required to prove a specific intent to kill as an element of the crimes charged.\n\ni. 18 U.S.C. § 2332a\n\nCount I charged McVeigh with conspiring to use a weapon of mass destruction against persons in the United States and against property that was owned and used by the United States and by an agency of the United States, in violation of 18 U.S.C. § 2332a. Count II charged McVeigh with using and aiding and abetting the use of a weapon of mass destruction against persons in the United States, in violation of 18 U.S.C. § 2332a and 18 U.S.C. § 2.\n\nThe version of 18 U.S.C. § 2332a(a) in effect at the time of the bombing provided: Offense.-A person who uses, or attempts or conspires to use, a weapon of mass destruction - (1) against a national of the United States while such national is outside of the United States;\n\n(2) against any person within the United States; or\n\n(3) against any property that is owned, leased or used by the United States or by any department or agency of the United States,\n\nwhether the property is within or outside of the United States, shall be imprisoned for any term of years or for life, and if death results, shall be punished by death or imprisoned for any term of years or for life. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nFrom the plain language of the statute, it is clear that \"intent to kill\" is not a statutorily required element of § 2332a(a). In fact, no level of intent is specified.\n\nWhen Congress fails to specify the degree of criminal intent required for a statutory offense, courts will either read in a level of intent or hold that the statute creates a strict liability crime. See 1 Wayne R. LeFave \u0026 Austin W. Scott, Jr., Substantive Criminal Law § 3.8(a), at 342 (1986). \"[S]ilence on this point by itself does not necessarily suggest that Congress intended to dispense with a conventional mens rea element, which would require that the defendant know the facts that make his conduct illegal.\" Staples v. United States, 511 U.S. 600, 605 (1994). \"On the contrary, we must construe the statute in light of the background rules of the common law, in which the requirement of some mens rea for a crime is firmly embedded.\" Id. (citation omitted); see also Morrisette v. United States, 342 U.S. 246, 263 (1952) (\"[M]ere omission . . . of any mention of intent will not be construed as eliminating that intent from the crimes denounced.\").\n\nIn light of the nature of the offense at issue and the severity of the prescribed punishments, we do not believe that § 2332a is a strict liability crime. See Staples, 511 U.S. at 606-07 (interpretation of statutes silent as to mens rea as imposing strict liability is generally limited to \"public welfare\" or \"regulatory\" offenses); Morrisette, 342 U.S. at 251-61 (reviewing history of the common law and the rise of regulatory offenses); LaFave \u0026 Scott, supra, at 342-44. Thus, we must decide the appropriate level of intent to read into the statute.\n\nIn United States v. Bailey, 444 U.S. 394, 406 (1980), the Supreme Court indicated that we should consider the mental state necessary for each separate element of a statute. We find two elements in §§ 2332a(a)(2) and (a)(3) as they existed at the time of the bombing: first, using, or attempting or conspiring to use, a weapon of mass destruction, and second, doing so against persons in the United States or against \"any property that is owned, leased or used by the United States or by any department or agency of the United States . . . .\"\n\nWe conclude that the intent standard of \"knowingly\" is appropriate for each of the elements of a § 2332a violation. See Bailey, 444 U.S. at 408 (\"[E]xcept in narrow classes of offenses, proof that the defendant acted knowingly is sufficient to support a conviction.\"); see also Staples, 511 U.S. at 619 (adopting \"knowingly\" standard in face of congressional silence as to intent); Posters `N' Things, Ltd. v. United States, 511 U.S. 513, 523 (1994) (same); Agnew, 931 F.2d at 1408 (same); United States v. Swindler, 476 F.2d 167, 169-70 (10th Cir. 1973) (same); 1 Edward J. Devitt et al., Federal Jury Practice \u0026 Instructions § 17.02, at 606 (4th ed. 1992) (\"Most federal criminal statutes . . . require proof that a defendant act knowingly or wilfully or have knowledge with regard to one or more essential elements of the crime defined by that statute.\"). Thus, we conclude that § 2332a(a)(2) requires the government to prove that McVeigh (1) knowingly used, or attempted or conspired to use, a weapon of mass destruction, and (2) knowingly did so against persons in the United States. Section § 2332a(a)(3) requires the government to prove that McVeigh (1) knowingly used, or attempted or conspired to use, a weapon of mass destruction, and (2) knowingly did so against \"any property that is owned, leased or used by the United States or by any department or agency of the United States.\"\n\nThe fact that the statute authorizes the death penalty \"if death results\" from the use of the weapon of mass destruction does not persuade us that the statute incorporates \"intent to kill\" as an element. Looking at the plain language and structure of the statute, we conclude that the phrase \"if death results\" is a sentencing factor rather than an element of the offense. Cf. United States v. Oliver, 60 F.3d 547, 552 (9th Cir. 1995) (construing \"if death results\" as sentence enhancement under 18 U.S.C. § 2119), cert. granted sub nom. Jones v. United States, 118 S. Ct. 1359, amended, 118 S. Ct. 1405 (1998); United States v. Williams, 51 F.3d 1004, 1009 (11th Cir. 1995) (same); United States v. Ryan, 9 F.3d 660, 669 (8th Cir. 1993) (construing \"if death results\" as sentence enhancement under 18 U.S.C. § 844(i)), modified on other grounds, 41 F.3d 361 (8th Cir. 1994) (en banc); see also Almendarez-Torres v. United States, 118 S. Ct. 1219, 1224 (1998) (construing 8 U.S.C. § 1326(b)(2) as sentence enhancement for a deported alien returning to the United States without permission). The natural reading of the text of § 2332a(a) is that subsections (a)(1), (a)(2), and (a)(3) define the elements of the crime, i.e., the use of a weapon of mass destruction against specified targets. The penalties follow separately - any term of years, life imprisonment, and in some cases, the death penalty. The proof needed to trigger the death penalty, however, is not necessary to prove a violation of the statute. Sentencing enhancements generally are not treated as elements and do not increase the government's burden of proof during the guilt phase of a trial. See Almendarez-Torres, 118 S. Ct. at 1230-32.\n\nFurther, even if the phrase \"if death results\" were to be construed as an element of the offense rather than a sentencing enhancement, it would not be an intent element but only an element of factual consequences. Nothing in § 2332a(a) links the \"if death results\" language of the statute to any scienter whatsoever. Cf. United States v. Woodlee, 136 F.3d 1399, 1405 (10th Cir.) (\"[18 U.S.C. §] 245(b) expressly provides the government need only show the defendants' illegal conduct resulted in bodily injury; not that the defendants intended bodily injury.\"), petition for cert. filed (U.S. May 22, 1998) (No. 97-9239). \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nMcVeigh also contends that § 2332a must require the government to prove intent to kill because it authorizes the death penalty, which cannot be imposed absent proof of intent to kill. We are well aware that the government may not secure a death sentence without proving a certain level of criminal intent. See Enmund v. Florida, 458 U.S. 782, 797 (1982) (Eighth Amendment prohibits imposing death penalty on robber who did not himself kill or intend to kill or to employ lethal force); Tison v. Arizona, 481 U.S. 137, 158 (1987) (\"[M]ajor participation in the felony committed, combined with reckless indifference to human life, is sufficient to satisfy the Enmund culpability requirement.\"). However, the Supreme Court recently reiterated that Enmund did not establish any new substantive elements of a capital crime, and that these necessary findings may be made at any stage of the proceedings, including during sentencing or on appeal. See Hopkins v. Reeves, 118 S. Ct. 1895, 1902 (1998); see also Cabana v. Bullock, 474 U.S. 376, 392 (1986). Thus, \"intent to kill\" need not be incorporated into the jury instructions during the guilt phase of a capital case if it is not an element of the charged crime. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nWe also reject McVeigh's contention that, even if \"intent to kill\" is generally not an element of the charged offenses, in this case the government was still bound to prove such intent because it was charged in the indictment. This argument disregards Supreme Court and Tenth Circuit authority. Surplusage in an indictment need not be proved, see United States v. Miller, 471 U.S. 130, 144 (1985); United States v. Smith, 838 F.2d 436, 439 (10th Cir. 1988); United States v. Harper, 579 F.2d 1235, 1239 (10th Cir. 1978) (\"When the language of the indictment goes beyond alleging the elements of the offense, it is mere surplusage, and such surplusage need not be proved.\"), and we have held that allegations of criminal intent that go beyond the elements of the crime are surplusage, see United States v. Kilburn, 596 F.2d 928, 934 (10th Cir. 1978). \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nThe instructions given the jury regarding the intent elements of Counts I and II were more than adequate. For Count I, which charged conspiracy to violate § 2332a, the jury was instructed it had to find beyond a reasonable doubt \"[t]hat the defendant, Timothy James McVeigh, knowingly and voluntarily became a member of the conspiracy, with the intent to advance or further its objectives.\" We have held that the intent elements of conspiracy are that the defendant \"knew the essential objectives of the conspiracy\" and \"knowingly and voluntarily took part in the conspiracy.\" United States v. Ailsworth, 138 F.3d 843, 850 (10th Cir.), petition for cert. filed (U.S. July 15, 1998) (No. 98-5276). The district court's instructions adequately conveyed those elements and ensured that to convict McVeigh, the jury would have to find that McVeigh knowingly conspired to use a weapon of mass destruction against persons or property in violation of §§ 2332a(2) and (a)(3).\n\nFor Count II, the court charged the jury that to convict it must find that McVeigh used a weapon of mass destruction against persons and that he acted \"knowingly, intentionally, willfully, and maliciously.\" This instruction also ensured the jury would have to find the proper criminal intent. Further, beyond instructing the jury on the proper standard of \"knowingly,\" the instruction added an element not required by § 2332a, the element of malice. However, this addition certainly did not prejudice McVeigh.\n\nii. 18 U.S.C. § 844(f)\n\nCount III charged the malicious destruction of federal property by means of an explosive, in violation of 18 U.S.C. §§ 844(f) and 2(a) \u0026 (b). The version of 18 U.S.C. § 844(f) in effect at the time of the bombing provided:\n\nWhoever maliciously damages or destroys, or attempts to damage or destroy, by means of fire or an explosive, any building, vehicle, or other personal or real property in whole or in part owned, possessed, or used by, or leased to, the United States, any department or agency thereof, or any institution or organization receiving Federal financial assistance shall be imprisoned for not more than 20 years, fined the greater of the fine under this title or the cost of repairing or replacing any property that is damaged or destroyed, or both; and if personal injury results to any person including any public safety officer performing duties as a direct or proximate result of conduct prohibited by this subsection, shall be imprisoned not more than 40 years, fined the greater of the fine under this title or the cost of repairing any property that is damaged or destroyed, or both; and if death results to any person, including any public safety officer performing duties as a direct or proximate result of conduct prohibited by this subsection, shall be subject to imprisonment for any term of years, or to the death penalty or to life imprisonment. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nThus, the plain language of the statute indicates that the required criminal intent is \"maliciously.\" See McFadden v. United States, 814 F.2d 144, 145 (3d Cir. 1987).\n\nOne acts maliciously if he or she acts \"intentionally or with willful disregard of the likelihood that damage or injury will result.\" McFadden, 814 F.2d at 146; see also United States v. Gullett, 75 F.3d 941, 947-48 (4th Cir.) (same, construing 18 U.S.C. § 844(i)), cert. denied, 117 S. Ct. 134 (1996); United States v. Corona, 108 F.3d 565, 571 (5th Cir. 1997) (same). Consequently, to prove a violation of § 844(f) the government must show both a knowing use of the explosive and a malicious intent in doing so. For the reasons discussed above, we do not believe that to secure a conviction under § 844(f) the government must show an intent to kill. McVeigh's arguments to the contrary fail for the reasons discussed above. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nHere, the court charged the jury that to convict on Count III it must find that McVeigh acted \"knowingly, intentionally, willfully, and maliciously.\" This instruction covered the necessary intent elements.\n\nb. Lesser-included Offenses - 18 U.S.C. §§ 2332a, 844(f)\n\nMcVeigh argues that the district court erred in not instructing the jury on lesser-included offenses of 18 U.S.C. § 2332a and 18 U.S.C. § 844(f).\n\nIn Hopkins, the Supreme Court made it clear that the Constitution does not require a court to instruct the jury on lesser-included offenses that do not exist under the law. See 118 S. Ct. at 1901. McVeigh's request for lesser-included offense instructions was based upon his argument that § 2332a and § 844(f) incorporated multiple offenses graduated by levels of intent, comparable to first-degree and second-degree murder. We reject that argument, and therefore, we find that the district court properly denied the requests for lesser-included offense instructions for these counts.\n\nMcVeigh, relying on Beck v. Alabama, 447 U.S. 625 (1980), suggests that it was unconstitutional for the court to force the jury into an \"all-or-nothing\" decision whether to convict him of a capital offense or acquit him altogether. This case is unlike Beck, however, because the jury here was not compelled to impose the death penalty on McVeigh if it convicted him of the charged offenses; rather, it had the opportunity to reject the death penalty during the sentencing phase. See Hopkins, 118 S. Ct. at 1901-02.\n\nc. Lesser-included Offenses - 18 U.S.C. §§ 1114, 1111\n\nMcVeigh contends that the district court abused its discretion in not instructing the jury on second-degree murder as a lesser-included offense of first-degree murder. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nThe killings at issue here were charged under 18 U.S.C. § 1114, which specifically criminalizes the killing of an officer or employee of the United States government. Under § 1114, we are directed back to the general federal murder statute, 18 U.S.C. § 1111, which states:\n\nMurder is the unlawful killing of a human being with malice aforethought. Every murder perpetrated by poison, lying in wait, or any other kind of willful, deliberate, malicious, and premeditated killing; or committed in the perpetration of, or attempt to perpetrate, any arson, escape, murder, kidnaping, treason, espionage, sabotage, aggravated sexual abuse or sexual abuse, burglary, or robbery; or perpetrated from a premeditated design unlawfully and maliciously to effect the death of any human being other than him who is killed, is murder in the first degree.\n\nAny other murder is murder in the second degree.\n\nSecond-degree murder is a recognized lesser-included offense of first-degree murder. See United States v. Lofton, 776 F.2d 918, 918 (10th Cir. 1985); David E. Rigney, Annotation, Propriety of Lesser-Included-Offense Charge to Jury in Federal Homicide Prosecution, 101 A.L.R. Fed. 615 § 3 (1991 \u0026 Supp. 1997). For the purposes of this case, the only relevant difference between first-degree and second-degree murder is the existence of premeditation, which we have defined as: The act of meditating in advance; deliberation upon a contemplated act; plotting or contriving; a design formed to do something before it is done. Decision or plan to commit a crime, such as murder before committing it. A prior determination to do an act, but such determination need not exist for any particular period before it is carried into effect.\n\nUnited States v. Jenny, 7 F.3d 953, 957 (10th Cir. 1993) (quoting Black's Law Dictionary 1062 (5th ed. 1979)).\n\nThe district court held that the evidence did not warrant giving a second-degree murder instruction because to convict McVeigh of murder the jury would necessarily have to find premeditation. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e \"`The decision of whether there is enough evidence to justify a lesser-included offense charge rests within the sound discretion of the trial Judge.'\" United States v. Hatatley, 130 F.3d 1399, 1403 (10th Cir. 1997) (quotation omitted). \"The trial Judge does not abuse his discretion by refusing to instruct on a lesser-included offense when the evidence before him provides no rational basis upon which the jury could find the defendant guilty of the lesser offense.\" Id. \"Only when an appellate court is convinced that the evidence issues are such that a rational jury could acquit on the charged crime but convict on the lesser crime may the denial of a lesser included offense charge be reversed.\" United States v. Moore, 108 F.3d 270, 272 (10th Cir. 1997); see also Hopper v. Evans, 456 U.S. 605, 610 (1982) (defendant entitled to lesser-included offense instruction only when such instruction is supported by the evidence).\n\nWe agree with the district court that a rational jury here could not have convicted McVeigh of second-degree murder while acquitting him of first-degree murder. In this case, to convict of any murder, either first or second degree, the jury would have to find an unlawful killing done with malice aforethought. \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e See 18 U.S.C. § 1111. Once it had made those findings, based upon the record in this case, a rational jury would have to find premeditation, simply because the method of murder employed - the bombing - could not have been implemented without an enormous amount of planning. Once premeditation was established, the only applicable homicide offense was first-degree murder. \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nE. GUILT PHASE VICTIM TESTIMONY\n\nThe government presented a number of witnesses during the guilt phase of the trial who identified deceased victims of the blast and described the impact of the explosion, including the carnage and destruction caused by the bombing. McVeigh divides this testimony into four categories: (a) detailed personal and professional histories of the witnesses; (b) accounts of witness activities prior to the explosion; (c) accounts of the explosion and its immediate aftermath as experienced or observed by the witnesses; and (d) long-term impacts of the bombing. McVeigh argues that the district court erred by admitting this testimony under Federal Rule of Evidence 403 and that the introduction of the testimony unconstitutionally allowed passion to overwhelm reason in the jury's determination of guilt. 1. Standard of Review a. Rule 403\n\nThe admission of evidence under Federal Rules of Evidence 401 and 403 generally is reviewed for an abuse of discretion. See United States v. McIntosh, 124 F.3d 1330, 1338 (10th Cir. 1997). McVeigh argues that we should adopt a more exacting standard of review because of the heightened concern for reliability in death penalty cases, citing Stringer v. Black, 503 U.S. 222, 230 (1992); Beck v. Alabama, 447 U.S. 625, 637-38 (1980); and Woodson v. North Carolina, 428 U.S. 280, 305 (1976). \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e We reject this contention.\n\nStringer and Woodson deal with rulings affecting the penalty phase of a trial, ensuring that each defendant in a capital punishment case receives an individualized sentencing determination. Those cases are inapposite to McVeigh's proposition regarding consideration of guilt phase determinations. As for Beck, the Court only focused on fundamental challenges to the charging process and did not establish a heightened standard of review for evidentiary rulings or other similar discretionary rulings by the trial court. See Beck, 447 U.S. at 637-38. Appeals courts after Beck have continued to apply a traditional abuse of discretion standard of review to discretionary rulings by a trial Judge in a capital case. See United States v. McCullah, 76 F.3d 1087, 1099 (10th Cir. 1996) (applying abuse-of-discretion standard to juror impartiality ruling), cert. denied, 117 S. Ct. 1699 (1997); see also Wise v. Bowersox, 136 F.3d 1197, 1205 (8th Cir. 1998); cf. Herrera v. Collins, 506 U.S. 390, 405 (noting that federal habeas corpus in death penalty cases is reviewed under same standard as non-death penalty cases).\n\nb. Continuing Objections and Plain Error Review\n\nMcVeigh first challenged the victim evidence at issue during a lunch break midway through the testimony of Hunt, the fifth victim witness, by objecting to \"extensive conversations and things not related to what the witness saw, heard, experienced during the relevant time period.\" The district court granted McVeigh a \"continuing objection\" to testimony dealing with the \"long-range effects\" of the bombing that went beyond the \"immediate effects\" of the blast. \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e Because McVeigh made no objections to the testimony of the first four witnesses (Lou Klaver, Michael Norfleet, Phil Monahan, and Richard Williams), we review the admission of that testimony for plain error. See United States v. McDonald, 933 F.2d 1519, 1524 (10th Cir. 1991). Similarly, we review for plain error that portion of Susan Hunt's testimony presented before McVeigh lodged his continuing objection.\n\nWe have serious doubts as to whether McVeigh's continuing objection was a proper form of objection for the victim testimony that followed. In certain circumstances, a continuing objection has been allowed as a specific, timely objection under Federal Rule of Evidence 103. See United States v. Fortenberry, 919 F.2d 923, 924 (5th Cir. 1990); United States v. Blackman, 904 F.2d 1250, 1256 (8th Cir. 1990); United States v. Ladd, 885 F.2d 954, 958 (1st Cir. 1989); United States v. Vinson, 606 F.2d 149, 153 (6th Cir. 1979); 21 Charles Alan Wright \u0026 Kenneth W. Graham, Jr., Federal Practice \u0026 Procedure § 5037, at 191-92 (1977).\n\nHowever, continuing objections generally are considered inappropriate for preserving error on appeal under Rule 403. In United States v. Mangiameli, 668 F.2d 1172, 1177 (10th Cir. 1982), this court cautioned that \"in our view, the considerations bearing upon a decision whether to admit or exclude evidence under Rules 404(b) and 403 are sufficiently complex that ordinarily neither counsel nor the trial court should rely on a standing objection with respect to evidence coming within the purview of these rules.\" See also People v. Smith, 203 Cal. Rptr. 196, 231 (Cal. Ct. App. 1984). But see United States v. Gomez-Norena, 908 F.2d 497, 500 n.2 (9th Cir. 1990) (allowing continuing objection under Rule 404(b)); Ladd, 885 F.2d at 958 (allowing continuing objection under Rule 403).\n\nWe believe that the question of whether a continuing objection under Rule 403 was effective to preserve the objection for later testimony should be reviewed under the same standards used for determining whether a pretrial motion in limine to exclude evidence preserved an objection to later-admitted evidence. A motion in limine will not preserve an objection if it is not renewed at the time the evidence is introduced unless \"the issue (1) is fairly presented to the district court, (2) is the type of issue that can be finally decided in a pretrial hearing, and (3) is ruled upon without equivocation by the trial Judge. . . . [M]ost objections will prove to be dependent on trial context and will be determined to be waived if not renewed at trial.\" United States v. Mejia-Alarcon, 995 F.2d 982, 986-88 (10th Cir. 1993) (citations omitted). McVeigh never identified specific statements that he believed were unduly prejudicial. Given the sheer number of witnesses involved and the variety of factual contexts presented, the admissibility of victim testimony would not ordinarily be an issue that could be decided in a pretrial hearing or by means of a continuing objection. \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nNevertheless, in this case the district court explicitly granted a continuing objection to McVeigh on this issue. Thus, we feel it would be unfair to hold that McVeigh could not rely on his continuing objection. As a result, we review for abuse of discretion the district court's decision to admit testimony covered by McVeigh's continuing objection. However, \"a standing objection should not be given broader scope than is found in its establishing statement.\" United States v. Lawson, 507 F.2d 433, 437 n.2 (7th Cir. 1974). A party may not rely on a continuing objection lodged on one evidentiary ground to argue a different ground for exclusion on appeal. See Gomez-Norena, 908 F.2d at 500 n.2; United States v. Gillette, 189 F.2d 449, 453 (2d Cir. 1951). Thus, our abuse-of-discretion review is restricted to evidence within the scope of McVeigh's objection, as ruled on by the district court. The court's ruling allowed testimony regarding the \"immediate effects\" but \"not the long-range effects\" of the bombing. The continuing objection does not fairly cover witness histories, pre-explosion witness activities, or descriptions of the bombing and its immediate aftermath, and thus we review claims of error pertaining to those categories of testimony only under a plain error standard. We also review for abuse of discretion the decision by the district court overruling a specific objection lodged by McVeigh to Garrett's testimony describing the activities of the children present at the Murrah Building day care center before the explosion.\n\n2. Relevance Versus Prejudice\n\nMcVeigh concedes in his brief on appeal that the challenged testimony was relevant, although he argues that it was only minimally so. He also concedes that ascertaining the line between factual and emotional descriptions of the bombing \"is not always an easy task, and Mr. McVeigh's counsel were faced with the very difficult task of discerning when the testimony crossed the line sufficiently to object.\" However, McVeigh focuses his argument on the claim that the challenged victim testimony was so laden with emotionally prejudicial content that its admission violated Rule 403 and created a significant risk that the jury reached its verdict based on emotion rather than reason. Having reviewed the record, we find no plain error in the introduction of any of the guilt phase victim testimony challenged by McVeigh on appeal. Even if the district court abused its discretion in allowing the introduction of certain long-range-impact testimony during the guilt phase, we hold such error would be harmless.\n\na. Personal Histories\n\nMcVeigh identifies the following personal history testimony as objectionable: Norfleet's description of his career as a Marine Corps pilot in Desert Storm and various drug interdiction missions and the irony of his decision to accept a recruiting job in Oklahoma in order to placate his wife's desire that he avoid dangerous combat duty; Hunt's pre-continuing objection testimony about her educational and employment history and her reference to her \"grandchild and beautiful daughter-in-law and an almost second daughter-in-law\"; Helena Garrett's explanation for the reason that her son was in the day care center; Donna Weaver's description of her deceased husband's involvement in their sons' sports teams and her regular lunches and meetings with him downtown; and Dr. Brian Espe's, Capt. Lawrence Martin's, and Mike Shannon's detailed highlights of their personal and professional histories. McVeigh complains that this testimony \"allowed the jury to get to know [the witnesses] as individuals and to be more receptive to the stories that followed.\" However, reasonable background information about a witness is always admissible, precisely because it allows the jury to make better informed judgments about the credibility of a witness and the reliability of that witness' observations. See 2 Jack B. Weinstein \u0026 Margaret A. Berger, Weinstein's Federal Evidence ¶ 401.04[4][a], at 401-37 (Joseph M. McLaughlin, ed., 1997). The evidence McVeigh challenges served this proper purpose. The defense asked similar personal history questions during direct examination of its witnesses. The personalization of witnesses through descriptions of their individual histories is inevitable. Although personalizing a witness can be overdone, the question of whether the district court erred in this case is not even close. We find no error by the district court under either an abuse of discretion or plain error review.\n\nb. Pre-Explosion Activities\n\nMcVeigh challenges the following pre-explosion activity testimony: Norfleet's attendance at a \"leadership prayer breakfast\" the morning of the blast; Hunt's pre-continuing objection description of her encounters with various co-workers who died in the explosion, including one ordering the flowers for her wedding, one who offered her candy, and one who diligently made coffee; Garrett's recollection of her son Tevin's endearing interactions with his sister and of Tevin's tears when Garrett dropped him off at the day care center and the efforts of other children to console him; Martin's notation that Sergeant Bill Titsworth was killed because he chose the day of the blast as his first day of work even though he could have reported for work any other day over the next two weeks; and Regina Bonny's account of her reaction to ultrasound pictures brought in by Carrie Lenz, a pregnant co-worker who died in the blast.\n\nFor many of the same reasons discussed above, this testimony was proper. This evidence places the witnesses at the scene of the crime, demonstrates how they knew the deceased victims, and sets a foundation for their testimony describing the explosion, identifying the specific location of deceased victims in the building before the explosion, and explaining why individual victims were present in the building. See United States v. Wilson, 107 F.3d 774, 781 (10th Cir. 1997) (upholding relevance of background information); cf. United States v. Sarracino, 131 F.3d 943, 949 (10th Cir. 1997) (approving the admission of evidence providing context to the crime charged under Rule 404(b)). The testimony allowed the jury to evaluate the accuracy of each witness' memory and determine whether the related details formed a consistent whole. For example, Norfleet's testimony about his attendance at a prayer breakfast explains why he came to the Murrah Building the day of the explosion (he generally did not work at the building) and why he took a specific route to the building that allowed him to notice the Ryder truck parked out front. The evidence also formed part of the res gestae of the crime, providing proof that the bomb interfered with interstate commerce and with government officials performing government business. See United States v. Kimball, 73 F.3d 269, 272 (10th Cir. 1995) (approving the admission of res gestae evidence).\n\nIn only one case do we find any potential prejudice: Bonny's testimony about the ultrasound pictures shown by Carrie Lenz. Nevertheless, the testimony was in response to a single question, and Bonny's answer comprised less than four lines out of fourteen pages of testimony. The prejudicial effect of the evidence did not substantially outweigh its relevance. Thus, we find no plain error. Even if we were to review the admission of the testimony under an abuse-of-discretion standard, we still would find no error.\n\nc. Immediate Impacts\n\nMcVeigh challenges almost all of the testimony presented on this subject by the various witnesses, \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e including, for example: Norfleet's loss of his eye, fractured skull, and near-death experience, and his description of following a trail of blood out of the building; Hunt's post-continuing objection account of assisting a survivor who had lost an eye but who had not yet realized it and helping hold parents back as rescue workers brought out dead children from the day care center; Garrett's frantic search to find her son and her description of the dead children lined up on the street covered with glass combined with her pleas to \"please don't lay our babies on this glass\" because she did not realize that the babies were \"already dead\"; Weaver's search for her husband and her intuitions that he was dead; John Avera's rescue efforts, including finding a baby he heard choking, comforting a woman trapped in the rubble, and collapsing from his efforts; Luke Franey's remembrance of \"running down the stairwell holding on the handrail and it being covered in blood\"; Martin's substantial injuries and hearing wailing sounds from two female co-workers; Priscilla Salyers' panic while trapped under the rubble for four and a half hours; and Shannon's account of the rescue effort.\n\nIn order to prove the elements of the various offenses charged, the government had to prove, inter alia, that the bomb was a weapon of mass destruction used against persons and property, that the explosion substantially interfered with interstate commerce, which could be established by showing disruption of government operations, that the bomb foreseeably would result in death, and that use of the bomb evidenced a malicious intent to kill. \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e The bulk of the contested testimony showed either the magnitude of the destruction or identified the victims and the cause of death.\n\nThe description of the destruction and carnage following the explosion is the most emotionally powerful of the evidence presented during the guilt phase. Hunt's and Garrett's descriptions of the dead children from the day care center are particularly powerful. Nevertheless, even \"[g]raphic depictions\" of a murder are relevant to support \"other evidence about how the crime occurred . . . even when the element is uncontested - indeed, even when the defendant offers to admit to the element. . . .\" Gonzalez v. DeTella, 127 F.3d 619, 621 (7th Cir. 1997), cert. denied, 118 S. Ct. 1325 (1998).\n\nMoreover, McVeigh concedes that testimony establishing the identity of the victims and the cause of death was appropriate, and that even the testimony he considers beyond the scope of any legitimate purpose was inextricably \"intertwined with proper evidence.\" Because this evidence was legitimately part of the res gestae of the crime, there was no error in its admission.\n\nd. Long-Term Effects\n\nMcVeigh identifies portions of the testimony of eight witnesses that he claims amounted to overly prejudicial Discussions of the long-term impacts of the bombings, including: Norfleet's loss of his pilot status and of his \"pride and joy\" gold aviator wings on his license plate and his explanation that Sergeant Benjamin Davis died without learning about his acceptance into a Marine Corps officer training program; Hunt's testimony that she attended twenty-two funerals; Garrett's inability to kiss the body of her son above his waist because of his \"severe head injury\"; Weaver's testimony that her husband was \"buried two years ago today\" and that she felt fortunate to be able to identify the body; Martin's medical discharge from the Army as a result of his injuries just as he was slated for a possible promotion; and Cooper's attendance at two funerals and his description of the deceased men. \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\n\nMost of this evidence was not particularly relevant to the issues presented during the guilt phase. In addition, some of it had emotional content. See United States v. Copple, 24 F.3d 535, 545-46 (3rd Cir. 1994) (finding overly prejudicial the \"victim impact testimony\" regarding collateral effects of financial losses on the health and lifestyles of fraud victims that \"went beyond anything that was reasonable to prove\" the specific intent element of the fraud charge). However, even if the district court abused its discretion by admitting some of this evidence, \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e we believe such error was harmless. As for the admission of Norfleet's pre-continuing objection testimony, we find no plain error given the fine line between appropriate and inappropriate evidence under Rule 403.\n\nA trial court's admission of inadmissible evidence will disturb a defendant's conviction only if the error is not harmless. The erroneous admission of evidence . . . is harmless unless it had a substantial influence on the outcome or leaves one in grave doubt as to whether it had such an effect . . . Further, cautionary instructions are ordinarily sufficient to cure any alleged prejudice to the defendant. Given the strength of the prosecution's case as a whole, and the cautionary instruction, we find the error harmless.\n\nUnited States v. Cass, 127 F.3d 1218, 1225 (10th Cir. 1997) (citations and quotations omitted), cert. denied, 118 S. Ct. 1101 (1998). The government bears the burden of proving the harmlessness of any error. See United States v. Flanagan, 34 F.3d 949, 955 (10th Cir. 1994).\n\nWe review the record as a whole to evaluate harmless error, see Kotteakos v. United States, 328 U.S. 750, 764 (1946); United States v. Tome, 61 F.3d 1446, 1455 (10th Cir. 1995), and find that the properly admissible evidence presented at trial that McVeigh carried out the bombing was direct and compelling, see Copple, 24 F.3d at 546 (finding error in admitting prejudicial victim impact testimony to be \"harmless because of the overwhelming evidence\" of the defendant's guilt). The evidence of the long-term effects of the bombing did not add much in terms of emotional impact to the emotional elements that necessarily flowed from the proper description of the crime itself and it occupied only a tiny fraction of the trial time. In addition, the district court delivered strong cautionary instructions to the jury, \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e which we presume the jury followed, see United States v. Hatatley, 130 F.3d 1399, 1405 (10th Cir. 1997). Consequently, this long-term-effects testimony could not have affected the outcome of the trial.\n\n3. Constitutional Error\n\nMcVeigh complains that even if the district court did not err by admitting the testimony of each of the eighteen witnesses individually, the overall effect of so many witnesses describing the impact of the bombing allowed passion to overwhelm reason, rendering the guilt determination constitutionally unreliable. \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e McVeigh characterizes his argument as an Eighth Amendment issue. However, a claim that admitted evidence injected an intolerably high degree of emotion into the guilt phase of trial more properly involves an alleged violation of the Due Process Clause. See, e.g., Estelle v. McGuire, 502 U.S. 62, 75 (1991) (evaluating a claim that introduction of evidence \"so infused the trial with unfairness\" as a denial of \"due process of law\"). Thus, we address McVeigh's charge of error as a due process claim.\n\nThe testimony of the eighteen witnesses totals only 456 pages out of more than six thousand pages of trial transcript. More importantly, it is to be expected that such a large-scale crime will produce more powerful evidence than a smaller-scale crime. The emotional impact of the testimony stemmed directly from the enormity of the crime itself. We also note that the government in this case exercised considerable restraint in avoiding overly emotional testimony. The government did not introduce any post-mortem pictures of victims nor did it dwell excessively on the heart-wrenching devastation caused by the blast. On several occasions, the prosecution engaged in self-control by skipping over testimony it thought would cross the line or repeat testimony already delivered by another witness. Here, the overwhelming nature of the crime necessarily allowed the government to introduce testimony reflecting the magnitude of the act. Thus, we find no constitutional error.\n\nF. DEATH PENALTY VOIR DIRE\n\nMcVeigh argues that the district court unconstitutionally restricted his ability to question prospective jurors regarding their willingness to impose the death penalty, violating the principles set forth in Morgan v. Illinois, 504 U.S. 719 (1992), Mu'Min v. Virginia, 500 U.S. 415 (1991), and Irvin v. Dowd, 366 U.S. 717 (1961). Specifically, he complains that the district court prevented him from ascertaining whether prospective jurors would automatically vote for the death penalty and from determining whether prospective jurors' exposure to prejudicial pretrial publicity had biased them on the issue of punishment.\n\n1. Standard of Review\n\nThe district court has wide discretion in conducting voir dire, including the type and breadth of questions regarding the death penalty and pretrial publicity. See Morgan, 504 U.S. at 729; Mu'Min, 500 U.S. at 427; Sellers v. Ward, 135 F.3d 1333, 1342 (10th Cir. 1998); United States v. McCullah, 76 F.3d 1087, 1113 (10th Cir. 1996), cert. denied, 117 S. Ct. 1699 (1997). Although our review is deferential to the trial court, we will find an abuse of discretion if the court unconstitutionally restricted McVeigh's questioning during voir dire.\n\nOnce again, we are required to determine the effect of a continuing objection requested by McVeigh and granted by the court. \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e During voir dire of several prospective jurors, McVeigh attempted to ask whether, given the extensive coverage of the bombing's horrific effects, they were biased regarding the appropriate punishment for the bombing's perpetrator. The district court sustained the government's objection to these questions. During voir dire of the juror who eventually occupied seat 6, the following colloquy ensued:\n\n[Defense]:I believe you've acknowledged that is really an accumulation of everything that you've seen and heard, you have at least some suspicion and perhaps a little more that Mr. McVeigh might be guilty; is that right?\n\n[Juror]: Yes.\n\n[Defense]:Do you have any sense of - sort of parallel to that that if he is guilty, what ought to happen to him? Do you have any kind of preDisposition toward that that you would want us to know about?\n\n[Court]: That - I'll sustain the objection to that just like I have always throughout here. I wish we wouldn't be repeating questions that I've ruled out.\n\n[Defense]:Your Honor, may we have the record reflect that that would be a continuing question and that would be your continuing ruling?\n\n[Court]: Yes.\n\n[Defense]:Thank you, your Honor.\n\nFrom our reading of the transcripts, it appears that the defense objected to the court's refusal to allow it to ask prospective jurors whether the facts of the bombing already known to them as a result of pretrial publicity predisposed them to vote in favor of the death penalty. Because during oral argument the government conceded the validity of this continuing objection, \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e we again accept the efficacy of using a continuing objection although that is a debatable proposition.\n\nThe jurors were seated in the order in which voir dire was conducted, so the continuing objection is effective as to the jurors in seats 6-12. \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e However, the objection does not cover the jurors in seats 1-5, so for those jurors we review for abuse of discretion only those specific questions the court prevented McVeigh from asking them.\n\n2. Analysis\n\nMcVeigh sought to ask questions regarding jurors' preDisposition to the death penalty, especially any such preDisposition resulting from the extensive publicity given to the horrific effects of the bombing. We first must determine whether the district court's refusal to allow McVeigh's questions was improper under Morgan v. Illinois, and then we determine whether the refusal was improper under Mu'Min v. Virginia.\n\na. Morgan v. Illinois\n\nIn Morgan v. Illinois, the Supreme Court held that a juror who would automatically impose the death penalty if a defendant were convicted of a capital offense is not an impartial juror and must be removed for cause. See 504 U.S. at 729. \"A juror who will automatically vote for the death penalty in every case will fail in good faith to consider the evidence of aggravating and mitigating circumstances as the instructions require him to do. Indeed, because such a juror has already formed an opinion on the merits, the presence or absence of either aggravating or mitigating circumstances is entirely irrelevant to such a juror.\" Id. The issue resolved by Morgan is often referred to as the \"reverse-Witherspoon\" situation, because Morgan arose from the line of death penalty voir dire cases exemplified by Witherspoon v. Illinois, 391 U.S. 510 (1968), and Wainwright v. Witt, 469 U.S. 412 (1985), in which the Court determined that a juror who would never vote for capital punishment is not an impartial juror and must be excused for cause.\n\n\"[P]art of the guarantee of a defendant's right to an impartial jury is an adequate voir dire to identify unqualified jurors.\" Morgan, 504 U.S. at 729. General questions regarding prospective jurors' fairness and ability to follow the law, however, do not necessarily reveal jurors who would vote for the death penalty regardless of the facts and circumstances of the case. See id. at 734-36. Consequently, upon a defendant's request, a trial court is obligated to ensure that prospective jurors are asked sufficient questions to allow the court and parties to determine whether, should the defendant be convicted, the jurors have already decided to apply the death penalty, or whether they would truly weigh any mitigating and aggravating factors found at the penalty phase of the trial. See id. at 736.\n\nMcVeigh contends that the trial court violated Morgan by restricting his ability to question prospective jurors regarding their willingness to impose the death penalty. We have identified two types of Morgan questions McVeigh was not allowed to ask during voir dire. The first category consists of non-context-specific questions that generally seek to determine a juror's core value system, i.e., whether the juror would automatically impose the death penalty if McVeigh were convicted of a capital offense. We have called these questions \"general Morgan questions.\" The second category consists of context-specific questions that focus on whether the facts of the bombing, as revealed through pretrial publicity, had predisposed prospective jurors toward imposing the death penalty on anyone convicted of this particular crime. This category we shall term \"specific Morgan questions.\"\n\ni. General Morgan Questions\n\nAccording to our review of the record, only once during the voir dire of a seated juror did the court deny a general Morgan question:\n\n[Defense]:If the allegations did - if you served on the jury and heard all the evidence in the guilt/innocence part of the trial and the jury voted that Mr. McVeigh was guilty, would you feel in that instance that the death penalty automatically should apply?\n\n[Court]: I'm going to exclude that question, because it isn't just a matter of the allegations. It's what the evidence altogether shows, which includes any possible role in the offense, so that's an inappropriate question. Move on.\n\nThe district court did not abuse its discretion in excluding the question. Morgan does not require courts to permit improperly phrased questions, such as questions that misstate the law or confuse the jurors. See Travis v. State, _So.2d_, 1997 WL 187121, at *5-7 (Ala. Crim. App. Apr. 18, 1997); Foster v. State, 639 So.2d 1263, 1274-75 (Miss. 1994); State v. Kreutzer, 928 S.W.2d 854, 864 (Mo. 1996), cert. denied, 117 S. Ct. 752 (1997); State v. Bishop, 472 S.E.2d 842, 850 (N.C. 1996), cert. denied, 117 S. Ct. 779 (1997). Here, the district court obviously interpreted the defense's question to be predicated on the pretrial \"allegations\" made against McVeigh and it ruled that question to be objectionable because it asked the juror to speculate as to her opinion based on allegations not even in evidence. Although the question is admittedly ambiguous and susceptible of more than one interpretation, it followed a series of earlier questions about pretrial allegations, and we cannot say that the district court's interpretation of that question, as it was orally asked and in the context in which it was asked, was erroneous. As phrased, that question was improper, and therefore it was properly excluded.\n\nFurther, the question is susceptible of an interpretation asking the juror how she would vote on the evidence presented at trial. That is a question broader than the scope of inquiry Morgan requires. The question approved in Morgan was the following: \"If you found [the defendant] guilty, would you automatically vote to impose the death penalty no matter what the facts are?\" Morgan, 504 U.S. at 723 (emphasis added). The Supreme Court felt such a question was necessary to identify jurors who would always impose the death penalty upon conviction of a capital offense \"regardless of the facts and circumstances of conviction.\" Id. at 735. Here, by contrast, the question was predicated on the assumption that the juror had heard the evidence and was asked, given that evidence and a finding of guilt, how she would vote on the question of penalty. Since the juror had not yet heard the evidence, the question improperly called for speculation and sought a precommitment from the juror. Numerous courts have held Morgan-type questions objectionable when the question was predicated on facts specific to the case at issue or upon speculation as to what facts may or may not be proven at trial. See Ex Parte Taylor, 666 So.2d 73, 81-82 (Ala. 1995); People v. Brown, 665 N.E.2d 1290, 1303 (Ill.), cert. denied, 117 S. Ct. 398 (1996); State v. Kreutzer, 928 S.W.2d 854, 864 (Mo. 1996), cert. denied, 117 S. Ct. 752 (1997); State v. Kandies, 467 S.E.2d 67, 78-79 (N.C.), cert. denied, 117 S. Ct. 237 (1996); Clagett v. Commonwealth, 472 S.E.2d 263, 269 (Va. 1996), cert. denied, 117 S. Ct. 972 (1997). Morgan was written as the reciprocal case to Witherspoon, and it is designed to identify potential jurors who would automatically impose the death penalty for conviction of a capital offense. When a defendant seeks to ask a juror to speculate or precommit on how that juror might vote based on any particular facts, the question strays beyond the purpose and protection of Morgan.\n\nii. Specific Morgan Questions\n\nIn contrast to the single excluded general Morgan question, the district court denied several inquiries that we have termed \"specific Morgan questions\" - that is, case-specific questions on whether prospective jurors had been so influenced by the facts of the bombing, as revealed by pretrial publicity, that they believed death was the only appropriate punishment for anyone convicted of the bombing. The court's refusal to permit these questions was the subject of McVeigh's continuing objection, and similar questions were refused during voir dire of the jurors who eventually sat in seats 3 and 5. \u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\n\nWe find no abuse of discretion in the district court's refusal to allow the questions. As discussed above, Morgan does not require courts to allow questions regarding the evidence expected to be presented during the guilt phase of the trial. Further, we have held that Morgan does not require a court to allow questions regarding how a juror would vote during the penalty phase if presented with specific mitigating factors. See Sellers, 135 F.3d at 1341-42; McCullah, 76 F.3d at 1114. Other courts have issued similar rulings, holding that Morgan does not require questioning about specific mitigating or aggravating factors. See United States v. Tipton, 90 F.3d 861, 879 (4th Cir. 1996), cert. denied, 117 S. Ct. 2414 (1997); People v. Jackson, 695 N.E.2d 391, 407 (Ill. 1998); Evans v. State, 637 A.2d 117, 124-25 (Md. 1994); Holland v. State, 705 So.2d 307, 338-39 (Miss. 1997), petition for cert. filed (U.S. Apr. 13, 1998) (No. 97-8681); Witter v. State, 921 P.2d 886, 891-92 (Nev. 1996), cert. denied, 117 S. Ct. 1708 (1997); State v. Fletcher, 500 S.E.2d 668, 679 (N.C. 1998); State v. Wilson, 659 N.E.2d 292, 300-01 (Ohio), cert. denied, 117 S. Ct. 129 (1996); State v. Hill, 501 S.E.2d 122, 127 (S.C. 1998). In fact, some of these courts have held that such questions not only are not required by Morgan, but are also simply improper. See Evans, 637 A.2d at 125 (explaining why `stake-out' questions are impermissible); Witter, 921 P.2d at 892 (same); Fletcher, 500 S.E.2d at 679 (same).\n\nLike the general Morgan question discussed above, the questions McVeigh attempted to ask jurors 3 and 5, and the question subject to the continuing objection beginning with juror 6, went beyond the scope of Morgan. Essentially, the questions were designed to ascertain whether the jurors felt that the circumstances of the bombing were so aggravating that no mitigating factor could compensate. Thus, these were case-specific questions seeking to determine what prospective jurors thought of the death penalty in regards to this particular case, rather than the jurors' core value system regarding imposition of the death penalty. Morgan, however, is designed to illuminate a juror's basic beliefs \"regardless of the facts and circumstances of conviction,\" Morgan, 504 U.S. at 735, not to allow defendants to pre-determine jurors' views of the appropriate punishment for the particular crime charged. Morgan does not require that the questions at issue be asked.\n\niii. \"Life Qualifying\" the Jury\n\nWe believe that McVeigh's right to \"life qualify\" the jury was adequately protected in this case. First, all prospective jurors were asked to fill out an extensive questionnaire prior to voir dire. The questionnaire contained a specific inquiry regarding prospective jurors' attitudes toward the death penalty, whether the death penalty was justified in all cases, and what they felt were the best reasons generally for imposing a death penalty and for not imposing a death penalty. Each seated juror responded that he or she could consider punishment less than death for a criminal act in which someone is killed. Consequently, the defense was able to ascertain even before voir dire whether the prospective jurors had an inclination toward automatically imposing the death penalty. Second, the court explained to prospective jurors that the law required the jury to give consideration to mitigating circumstances before deciding whether to impose the death penalty, and it asked prospective jurors if they had any \"personal, moral, or religious views either against or in favor of the death penalty\" and if they would be able to \"give fair and impartial consideration to all of the facts and circumstances about this case and about Mr. McVeigh, before deciding what the sentence should be . . . .\" Each of the jurors answered that he or she could. Third, each juror during questioning either by the government or by the defense indicated that he or she would be fair and impartial in deciding on a penalty. Finally, defense counsel was allowed to ask appropriately phrased Morgan questions of many of the jurors, and we see no reason why the identical questions would not have been allowed during voir dire of all the jurors. McVeigh was not denied his right to \"life qualify\" the jury by the district court's denial of his questions. See Ramsey v. Bowersox, 149 F.3d 749, 1998 WL 300520, at *5-6 (8th Cir. June 10, 1998) (although defendant's requested questions were denied, trial court asked sufficient questions to determine whether prospective juror would automatically vote for death penalty); Mackall v. Angelone, 131 F.3d 442, 451 (4th Cir. 1997) (same), cert. denied, 118 S. Ct. 907 (1998); McQueen v. Scroggy, 99 F.3d 1302, 1329-30 (6th Cir. 1996) (same), cert. denied, 117 S. Ct. 2422 (1997); Tipton, 90 F.3d at 878-79 (same); United States v. Flores, 63 F.3d 1342, 1354 (5th Cir. 1995) (same), cert. denied, 117 S. Ct. 87 (1996).\n\nb. Mu'Min v. Virginia\n\nMcVeigh also contends that the district court's refusal to allow the questions subject to his continuing objection - those regarding whether the extensive pretrial publicity about the bombing predisposed jurors to vote for the death penalty in this case - violated his right to inquire about bias resulting from pretrial publicity. Essentially, he seeks to transport the principle that the Constitution requires inquiry into whether prospective jurors had \"`such fixed opinions that they could not Judge impartially the guilt of the defendant,'\" Mu'Min, 500 U.S. at 430 (quoting Patton v. Yount, 467 U.S. 1025, 1035 (1984)), from the guilt phase to the punishment phase of a capital case.\n\n\"Voir dire plays a critical function in assuring the criminal defendant that his Sixth Amendment right to an impartial jury will be honored.\" Rosales-Lopez v. United States, 451 U.S. 182, 188 (1981) (plurality opinion). However, \"[t]o be constitutionally compelled, . . . the trial court's failure to ask these questions must render the defendant's trial fundamentally unfair.\" Mu'Min, 500 U.S. at 425-26.\n\nIn Mu'Min, the defendant had escaped from a prison work crew during his lunch break and murdered a woman. The murder resulted in a large number of articles discussing the case and giving detailed information about Mu'Min and his criminal history. See id. at 418. At voir dire, Mu'Min sought to question prospective jurors in detail regarding the contents of the news items to which they had been exposed, but the trial court refused; instead, it asked the jurors generally whether \"the information that you heard, received, or read from whatever source, would that information affect your impartiality in this case?\" See id. at 419-20. The Supreme Court held that Mu'Min's constitutional rights were not violated by the trial court's refusal to voir dire prospective jurors more specifically regarding the contents and detail of the publicity to which they had been exposed. See id. at 422, 431-32. It emphasized that the Constitution requires not ignorant jurors, but jurors who can lay aside any preconceived notions and judge the defendant impartially, see id. at 430, and that, in making a determination of impartiality in cases involving pretrial publicity, appellate courts should place \"primary reliance on the judgment of the trial court,\" id. at 427. In short, the Constitution is satisfied when the defendant is afforded an impartial jury which will decide the case on the evidence presented in court rather than on information gained from publicity. See id. at 425-26; Patton, 467 U.S. at 1035; Irvin, 366 U.S. at 723.\n\nMcVeigh is correct that the principle of juror impartiality should be applied equally to the penalty phase as well as to the guilt phase. See Morgan, 504 U.S. at 729. However, Morgan did not abrogate Mu'Min's holding that the Constitution does not mandate specific inquiries regarding publicity; at least one court has held that \"Morgan does not create a constitutional right to ask voir dire questions about the specifics of juror exposure to pretrial publicity and the content of that publicity.\" State v. Moseley, 449 S.E.2d 412, 426-27 (N.C. 1994).\n\nWe do not believe that McVeigh's right to an impartial jury was infringed by his inability to ask the particular questions at issue. We readily acknowledge that some of the questions posed by McVeigh might have helped the court and parties better determine whether the prospective jurors were impartial as to both guilt and penalty. However, because peremptory challenges are not constitutionally required, \"this benefit cannot be a basis for making `content' questions about pretrial publicity a constitutional requirement.\" See Mu'Min, 504 U.S. at 424-25. Rather, such questions are required only if not asking them results in a fundamentally unfair trial. See id. at 425-26. In this case, the record reveals sufficient indicia of safeguards for us to conclude that each prospective juror was impartial as to punishment, and thus that McVeigh's trial was not fundamentally unfair.\n\nFirst, during voir dire the trial court emphasized to each juror that he or she must approach the case with an open mind, must not have any preconceptions about either guilt or punishment, and must make his or her own independent decision on the basis of the facts and the law presented in court. The court received from each juror an assurance that he or she could and would do so. \u003cspan class=\"fnref\"\u003e35\u003c/span\u003e Further, the government and McVeigh were able to ask a number of questions regarding the prospective jurors' ability to set aside the effect of any publicity they had seen. Some jurors were asked and specifically stated that they could set aside the effect of any publicity when deciding on an appropriate penalty, and others stated more generally that they could set aside the effect of any publicity in their role as jurors in deciding the case. Even though the defense was not allowed to ask some specific questions regarding publicity and the death penalty of jurors 3, 5, and 6-12, every seated juror stated his or her willingness and ability to set aside the effect of publicity and to approach the case with an open mind. Finally, the voir dire questioning was reinforced during trial and during the penalty phase with instructions that the jury was to consider only the evidence presented in court and that jurors must disregard anything they had read, seen, or heard outside of the courtroom.\n\nMoreover, the factors we identified in our Discussion of Issue A above, in which we concluded that the jury pool was not prejudiced by pretrial publicity regarding the alleged confession, also indicate that the jury pool was not unconstitutionally tainted by pretrial publicity in terms of determining the proper penalty upon conviction. The change of venue, for example, removed the trial from a locality in which \"the opinions expressed in recent televised interviews of citizens of Oklahoma emphasiz[ed] the importance of assuring certainty in a verdict with an evident implication that upon such a verdict death is the appropriate punishment.\" United States v. McVeigh, 918 F. Supp. 1467, 1474 (W.D. Okla. 1996). In addition, there was nearly a two-year lag between the graphic images of the bombing and the start of the trial, allowing time for memories to fade.\n\nFinally, we note that the jury obviously was open to considering mitigating factors, because the jurors unanimously found seven of the thirteen mitigating factors McVeigh presented, including the sincerity of his beliefs regarding the government's actions at Waco, Texas, and Ruby Ridge, Idaho; that he received the Bronze Star for his Army service; that \"he is a patient and effective teacher when he is working in a supervisory role\"; and that he had no prior criminal record. Only two mitigating factors were not found by any juror.\n\nIn sum, although asking at least some of McVeigh's requested questions might have been the better course, the questions were not constitutionally required to ensure an impartial jury and thus we find no abuse of discretion in excluding them.\n\nG. HOWE TESTIMONY AS MITIGATING EVIDENCE\n\nMcVeigh challenges the district court's decision during the penalty phase to bar the re-proffered testimony by Carol Howe. McVeigh contends that Howe's testimony about the activities and beliefs of individuals at the Elohim City compound in Stillwell, Oklahoma, would have shown that McVeigh was less culpable for the Murrah Building bombing because other people were leaders and organizers of the conspiracy. The court's decision to exclude this evidence, McVeigh argues, violated his right to individualized sentencing under both the Eighth Amendment and the Federal Death Penalty Act of 1994, 18 U.S.C.A. §§ 3591-98 (West Supp. 1997). We reject this claim because McVeigh failed to establish the relevance of the Howe testimony in the penalty phase.\n\n1. Standard of review\n\nMcVeigh's claim on this issue implicates both constitutional and statutory standards for the reception of mitigating evidence during the penalty phase of a capital trial. Under the Eighth Amendment, \"the sentencer in capital cases must be permitted to consider any relevant mitigating factor.\" Eddings v. Oklahoma, 455 U.S. 104, 112 (1982); see also Dutton v. Brown, 812 F.2d 593, 601-02 (10th Cir. 1987) (en banc). Similarly, under the federal death penalty statute, \"The defendant may present any information relevant to a mitigating factor.\" 18 U.S.C.A. § 3593(c).\n\nWe review de novo the question of whether a particular set of facts may be considered a mitigating factor. See Lockett v. Ohio, 438 U.S. 586, 604 (1978) (plurality opinion). On the other hand, the abuse-of-discretion standard applies to whether the Howe evidence was relevant to McVeigh's proffered mitigating factor. See General Elec. Co. v. Joiner, 118 S. Ct. 512, 517 (1997).\n\n2. Background\n\nMcVeigh's proffered evidence on Elohim City during the penalty phase, this time in the form of a written proffer, largely tracked the oral proffer presented during the guilt phase. The penalty phase proffer repeated the information concerning anti-government sentiments at Elohim City and the interest of Elohim City individuals in acquiring and using explosives. The principal difference between the two proffers was the new allegation in the penalty phase proffer that two Elohim City leaders, Dennis Mahon and Andreas Strassmeir, had made three trips to Oklahoma City in the winter of 1994-1995 specifically for the purpose of \"casing\" the Murrah Building as one of several potential targets for a bombing.\n\nThe defense submitted its revised proffer shortly before the close of evidence for the penalty phase. During an in-chambers conference, the district court again excluded the evidence. The district court offered no reasoning except to say that it would \"stand on its ruling\"; thus, it appears that the court continued to believe that the Howe testimony was \"not sufficiently relevant to be admissible.\" \u003cspan class=\"fnref\"\u003e36\u003c/span\u003e\n\n3. Analysis\n\na. Mitigating nature of playing a \"lesser role\" in a crime\n\nThe first question we must address is whether McVeigh's claim that he played a lesser role in the conspiracy to destroy the Murrah Building can even be properly classified as a mitigating factor. McVeigh's contention here relies on the \"catch-all\" mitigating factor in the Federal Death Penalty Act that allows a defendant to assert any other \"factors in the defendant's background, record, or character or any other circumstance of the offense that mitigate against imposition of the death sentence.\" See 18 U.S.C.A. § 3592(a)(8). \u003cspan class=\"fnref\"\u003e37\u003c/span\u003e McVeigh's assertion of the \"catch-all\" factor implicitly, and correctly, acknowledges that he cannot meet the elements of the explicit statutory factor for \"minor participation.\" See 18 U.S.C.A. § 3592(a)(3). \u003cspan class=\"fnref\"\u003e38\u003c/span\u003e For its part, the government apparently believes that because McVeigh cannot meet the elements of the \"minor participation\" mitigating factor, he is barred from presenting mitigating evidence to support his claim of a \"lesser role\" in the offense. See id. We disagree.\n\nIt has been the law of the land for more than twenty years that a capital defendant is constitutionally entitled to present any aspect of his character, record, or offense in mitigation of his culpability for the crime. In Woodson v. North Carolina, a controlling plurality of the Supreme Court held that \"in capital cases the fundamental respect for humanity underlying the Eighth Amendment requires consideration of the character and record of the individual offender and the circumstances of the particular offense as a constitutionally indispensable part of the process of inflicting the penalty of death.\" Woodson v. North Carolina, 428 U.S. 280, 304 (1976) (plurality opinion) (citation omitted). Another plurality of the Court reiterated this view in Lockett, holding that \"the Eighth and Fourteenth Amendments require that the sentencer, in all but the rarest kind of capital case, not be precluded from considering, as a mitigating factor, any aspect of a defendant's character or record and any of the circumstances of the offense that the defendant proffers as a basis for a sentence less than death.\" Lockett, 438 U.S. at 604. And finally, in Hitchcock v. Dugger, 481 U.S. 393, 398-99 (1987), a unanimous Court held that its prior case law renders unconstitutional any death penalty procedure that prevents a capital sentencer from considering non-statutory mitigating factors.\n\nCongress recognized the import of this case law when it drafted the Federal Death Penalty Act, including the catch-all mitigating category under § 3592(a)(8). Any contention that the \"minor participation\" mitigating factor in § 3592(a)(3) precludes a mitigation claim based on evidence of a \"lesser role\" in the offense ignores the plain language of § 3592(a)(8). Any other Conclusion would run afoul of the precept in Lockett that a capital defendant is constitutionally entitled to offer in mitigation any aspect of his character, record, or offense. See Lockett, 438 U.S. at 604.\n\nb. Relevance of Carol Howe testimony to mitigation\n\nWe conclude that the appropriate relevance standard in a federal capital sentencing hearing is the same standard used throughout the federal courts under Federal Rule of Evidence 401, i.e., whether the evidence has any tendency to make a fact of consequence more or less probable. As a result, in light of the catch-all mitigating factor in § 3592(a)(8), we must determine whether the proffered testimony from Carol Howe had any tendency to show something about Timothy McVeigh's character, record, or offense that would mitigate against the imposition of a death sentence.\n\nWe conclude that the Howe testimony was not relevant under this standard because there was a crucial hole in the logic of McVeigh's proffer. McVeigh contended that the Howe testimony would show that there \"truly were `others unnamed' involved in different aspects of the broader conspiracy,\" and that therefore McVeigh was less culpable. However, McVeigh never presented any evidence showing that he was connected to this putative Elohim City conspiracy, and Howe's proffered testimony made no connection between McVeigh and Elohim City. \u003cspan class=\"fnref\"\u003e39\u003c/span\u003e Without any evidentiary link between McVeigh and Elohim City, there simply was no basis for the jury to conclude that McVeigh had a \"lesser role\" in a broader Elohim City conspiracy to bomb the Murrah Building. This hole in McVeigh's chain of inferences renders the Howe testimony not relevant to this proceeding. \u003cspan class=\"fnref\"\u003e40\u003c/span\u003e\n\nH. WACO EVIDENCE\n\nDuring the penalty phase, McVeigh presented, and the district court allowed, evidence relevant to the opinion he held at the time of the Oklahoma City bombing pertaining to the events that occurred during the standoff between the federal government and the Branch Davidians at Waco, Texas, from February 28, 1993, to April 19, 1993. This evidence consisted mainly of the testimony of experts familiar with materials, such as video tapes, magazine articles, and pamphlets, that McVeigh had likely seen prior to the bombing which were critical of the government's actions at Waco. However, McVeigh also sought to present evidence to which he had not been exposed prior to the bombing that he claims tended to show that the actions of the federal government during Waco were objectively wrongful and outrageous. In particular, McVeigh sought to introduce expert testimony, documentary films, and government reports critical of the government's actions at Waco. Much of this material was not even generated until after the Oklahoma City bombing had occurred. McVeigh argues that this evaluative Waco evidence was necessary for the jury to understand that his opinions regarding the events at Waco were objectively reasonable. It is this second category of Waco evidence that the district court refused to allow into the record.\n\nThere is no hint in the appellate record that the district court limited McVeigh's ability to present evidence regarding what he actually knew or thought of the events at Waco, up to the time of the Oklahoma City bombing, or that the district court denied him the opportunity to present to the jury his views regarding Waco. McVeigh's attorneys were allowed to argue that the events at Waco were both a motivating factor for the commission of the crime and a mitigating factor with regards to punishment. In short, the district court allowed evidence regarding the incident at Waco to be admitted, but only that evidence which tended to show what McVeigh knew of the Waco incident and his subjective perceptions of it as of April 19, 1995. In the words of the court:\n\nI don't intend to try Waco here at this trial . . . it is one thing as to what Mr. McVeigh may understand and his view of it . . . . And somewhere you have to draw the line between, okay, we're not going to try what actually happened at Waco, but we are going to receive evidence about what is perceived to have happened.\n\nThis admonition to the parties is reflected in the penalty-phase opening statement in which McVeigh's counsel asked the jury to:\n\ntake a look at . . . the reality of what Mr. McVeigh believed happened at Waco. Now, we will not be presenting to you a trial about Waco. We are not doing that. What we are presenting to you and will be presenting to you is what Mr. McVeigh believed happened at Waco, because that's what's important in the calculus that is before you.\n\nSeveral times during the penalty phase, the court provided a cautionary instruction to the effect that the events at Waco were \"admitted only for the limited purpose of explaining Timothy McVeigh's views, perceptions and beliefs . . . . You are not here to determine what actually happened at Waco or to make your own evaluation of the Government's conduct in that or any other law enforcement activities.\" The jury was then presented, inter alia, with the following mitigating factors:\n\n2. Timothy McVeigh believed that the ATF and FBI were responsible for the deaths of everyone who lost their lives at Mt. Carmel, near Waco Texas, between February 28 and April 19, 1993.\n\n4. Timothy McVeigh believed that the increasing use of military-style force and tactics by federal law enforcement agencies against American citizens threatened an approaching police state.\n\n5. Timothy McVeigh's belief that federal law enforcement agencies failed to take responsibilities for their actions at Ruby Ridge and Waco, and failed to punish those persons responsible, added to his growing concerns regarding the existence of a police state and a loss of constitutional liberties.\n\nThe jury unanimously found each of these mitigating factors to be present. McVeigh claims on appeal that the district court erred in refusing to allow the jury to hear his proffered evidence on the objective wrongfulness of the government's actions at Waco.\n\n1. Standard of Review\n\nWe review a district court's determination that evidence is not relevant to a mitigating factor for abuse of discretion. However, because as a matter of law the sentencer must be allowed to consider all mitigating factors, see Eddings v. Oklahoma, 455 U.S. 104, 113-14 (1982); Lockett v. Ohio, 438 U.S. 586, 604 (1978) (plurality opinion), we review de novo a trial court's decision to prevent the jury from considering a mitigating factor.\n\n2. Analysis\n\nUnder the federal death penalty statute, a defendant has the right to present mitigating evidence pertaining to \"the defendant's background, record, or character or any other circumstances of the offense that mitigate against imposition of the death sentence.\" 18 U.S.C.A. § 3592(a) (West Supp. 1997); cf. Lockett, 438 U.S. at 604 (the sentencer must \"not be precluded from considering, as a mitigating factor, any aspect of a defendant's character or record and any of the circumstances of the offense that the defendant proffers as a basis for a sentence less than death\").\n\nEvaluative evidence of the events at Waco that was unknown to McVeigh at the time of the bombing, including expert opinion evidence of the government's handling of that crisis, is not an aspect of McVeigh's character, McVeigh's record, or a circumstance of the offense of which he was convicted, nor does it meet the definition of any other statutorily enumerated mitigating factor. McVeigh was not involved in the events at Waco; thus what actually happened there, and what experts think of what happened, is not part of his character. Nor is it part of the bombing, which occurred two years later. Rather, only what McVeigh subjectively knew and believed as of the time of the Oklahoma City bombing about the events at Waco and the government's actions there qualify as mitigating factors. Thus, we find no error here.\n\nHaving determined that the proffered Waco evidence unknown to McVeigh at the time of the bombing was not in and of itself a mitigating factor, we must next determine whether it was nonetheless relevant to an enumerated mitigating factor, and whether the district court thereby abused its discretion in disallowing it. Two Supreme Court cases are somewhat instructive on this point. First, in Skipper v. South Carolina, 476 U.S. 1 (1986), the trial court denied the defendant's request to present evidence to the jury as to his good behavior in jail during the time before trial as relevant mitigating evidence. The Supreme Court held that this was reversible error because \"a defendant's disposition to make a well-behaved and peaceful adjustment to life in prison is itself an aspect of his character that is by its nature relevant to the sentencing determination.\" Id. at 7. Under Skipper, any evidence that tends to shed light on the defendant's character is relevant mitigating evidence, and the defendant must be allowed to present it to the jury. See id. at 8; see also Dutton v. Brown, 812 F.2d 593, 601-02 (10th Cir. 1987) (en banc) (mother's proffered testimony as to defendant's family background, medical history, education, and personality traits relevant to defendant's character). Second, in Simmons v. South Carolina, 512 U.S. 154, 163-64, 168-69 (1994) (plurality opinion), the Supreme Court concluded that relevant penalty stage evidence included evidence that the defendant would be ineligible for parole if given a life sentence, once the government put at issue the defendant's future dangerousness.\n\nTaken together, Skipper and Simmons stand for the proposition that proffered evidence is relevant to death penalty sentencing if (1) it is probative of an enumerated mitigating factor, especially some aspect of the defendant's character, or (2) it is offered in rebuttal to an evidentiary showing made by the prosecution in support of conviction or an aggravating factor. The second prong is supported by the Court's recent opinion in O'Dell v. Netherland, 117 S. Ct. 1969, 1973-74 (1997), in which the Court examined Simmons and reiterated the Simmons rule that the prosecution's showing of a defendant's future dangerousness gives rise to a due process right to \"deny or explain\" that showing.The objective Waco evidence proffered by McVeigh has no relevance to any aspect of McVeigh's character, or record, or the circumstances of the crime, or any other enumerated mitigating factor. Information about what actually happened at Waco and the opinion of experts, including experts working for the government, that the government mishandled the siege sheds no light on McVeigh's character, his record, or the circumstances of his crime, to the extent that the information was not within McVeigh's knowledge at the time of the bombing. Thus, the district court did not err in excluding such evidence.\n\nNext, we ask whether McVeigh had a right to present this evidence in response to a prosecutorial \"showing\" that his beliefs about the events at Waco were objectively unreasonable. McVeigh points to the following: (1) in its guilt-phase closing argument, counsel for the government stated that McVeigh's reliance on the events at Waco as justification for his acts was \"poorly reasoned\"; (2) during cross-examination of penalty phase witness Dick Reavis, counsel for the government asked the witness if one of the video tapes on Waco viewed by McVeigh before the bombing was produced by a biased and potentially paranoid anti-government individual, suggested that some of the videos viewed by McVeigh on the topic of Waco featured statements by members of the Branch Davidians who are \"convicted felons,\" and asked the witness whether the videos seen by McVeigh could have been inaccurate and deliberately misleading; and (3) at the penalty phase closing arguments, a government prosecutor opined that McVeigh entertained \"misperceptions\" about the Waco siege and that his explanation for his anger towards the government was \"pathetic.\" Counsel for McVeigh did not object to these statements.\n\nWe find that these isolated incidents did not rise to the level of a \"showing\" by the government that McVeigh's beliefs about Waco were unreasonable. The objective validity of McVeigh's beliefs was never submitted as an issue for the jury to determine at the guilt phase, nor was the objective unreasonableness of his beliefs presented as an aggravating factor at the penalty phase. At no time did the government present any evidence tending to show that McVeigh's beliefs were objectively unreasonable.\n\nIn short, the three incidents at issue were nothing more than argument of, and examination by, government counsel. Because McVeigh's counsel did not object to them, we review for plain error. \u003cspan class=\"fnref\"\u003e41\u003c/span\u003e See United States v. Oberle, 136 F.3d 1414, 1421 (10th Cir.), petition for cert. filed (U.S. June 29, 1998) (No. 98-5084); United States v. Nichols, 21 F.3d 1016, 1019 (10th Cir. 1994). Even if such statements by government counsel may have been improper, we must determine if they warrant overturning McVeigh's sentence. See United States v. Ivy, 83 F.3d 1266, 1288 (10th Cir.), cert. denied, 117 S. Ct. 253 (1996). \"[R]eversal is appropriate only if, after reviewing the entire record, we conclude that the error is obvious and one that would undermine the fairness of the trial and result in a miscarriage of Justice.\" Oberle, 136 F.3d at 1421 (quotation omitted); see Hoxsie v. Kerby, 108 F.3d 1239, 1245 (10th Cir.), cert. denied, 118 S. Ct. 126 (1997); Ivy, 83 F.3d at 1288.\n\nAt the beginning of McVeigh's trial the court instructed the members of the jury that statements by counsel during opening and closing statements are not evidence. This prophylactic instruction, coupled with the broad scope of this trial, the vast amount of evidence presented to the jury at both the guilt and penalty phases, and the insignificance of the few isolated incidents in which the government disparaged the reasonableness of McVeigh's Waco views, lead us to the conclusion that these statements were clearly harmless and did not amount to plain error. The isolated statements by the government prosecutors at issue here simply do not qualify as \"`circumstances in which a miscarriage of Justice would otherwise result'\" in the face of this court's inaction. Nichols, 21 F.3d at 1019 (quoting United States v. Young, 470 U.S. 1, 15 (1985)).\n\nI. PENALTY PHASE VICTIM IMPACT TESTIMONY\n\nDuring the penalty phase of the trial, the government presented the testimony of thirty-eight witnesses who described the impact of the bombing. These witnesses consisted of twenty-six relatives of deceased victims, three injured survivors, one employee of the Murrah Building day care center, and eight rescue and medical workers. Although significant in number, these witnesses comprised an extremely small percentage of the number of potential witnesses the government might have called to testify about the 168 victims who died in the blast and the impact of the explosion on the numerous injured victims. McVeigh challenges the testimony of twenty-seven of these witnesses, arguing that their testimony injected a constitutionally intolerable level of emotion into the proceeding \u003cspan class=\"fnref\"\u003e42\u003c/span\u003e and resulted in the imposition of a capital sentence based on passion rather than reason in violation of Payne v. Tennessee, 501 U.S. 808 (1991).\n\n1. Payne v. Tennessee\n\nOverruling Booth v. Maryland, 482 U.S. 496 (1987), the Supreme Court in Payne held that the Eighth Amendment does not bar the admission of victim impact testimony in the sentencing phase of a capital trial: \"[V]ictim impact evidence . . . is designed to show . . . each victim's uniqueness as an individual human being.\" Payne, 501 U.S. at 823 (internal quotations omitted).\n\nVictim impact evidence is simply another form or method of informing the sentencing authority about the specific harm caused by the crime in question. . . . [A] state may properly conclude that for the jury to assess meaningfully the defendant's moral culpability and blameworthiness, it should have before it at the sentencing phase evidence of the specific harm caused by the defendant. Id. at 825.\n\n[E]vidence about the victim and about the impact of the murder on the victim's family is relevant to the jury's decision as to whether or not the death penalty should be imposed. There is no reason to treat such evidence differently than other relevant evidence is treated. Id. at 827. Thus, Payne allows the prosecution to introduce evidence during the penalty phase that provides \"a quick glimpse of the life petitioner chose to extinguish\" in order to show the value of the victim's loss to society. Id. at 830 (O'Connor, J., Concurring) (quotation omitted). However, Payne did not overrule the prohibitions in Booth against the admission of \"information concerning a victim's family members' characterization of and opinions about the crime, the defendant, and the appropriate sentence.\" \u003cspan class=\"fnref\"\u003e43\u003c/span\u003e Id. at 835 n.1 (Souter, J., Concurring). In addition, the Supreme Court provided that \"[i]n the event that evidence is introduced that is so unduly prejudicial that it renders the trial fundamentally unfair, the Due Process Clause . . . provides a mechanism for relief.\" Id. at 825 (citing Darden v. Wainwright, 477 U.S. 168, 179-83 (1986)). We review de novo alleged violations of the Eighth Amendment and constitutional due process. See Nguyen v. Reynolds, 131 F.3d 1340, 1355 (10th Cir. 1997) (Eighth Amendment), petition for cert. filed (U.S. May 8, 1998) (No. 97-9448); United States v. One Parcel of Real Property Described as Lot 41, 128 F.3d 1386, 1391 (10th Cir. 1997) (due process).\n\nPayne allows the introduction of victim impact testimony to aid the jury in making a \"reasoned moral response\" when imposing sentence upon a defendant convicted of a capital offense. See Penry v. Lynaugh, 492 U.S. 302, 319 (1989) (quotation and emphasis omitted). First, the sentence must be the result of a reasoned decision. The evidence must not be so unduly prejudicial that its admission allows emotion to overwhelm reason. Second, the sentence must be based on moral considerations. Because the consequences of the crime are an important ingredient in the moral equation, the government can present testimony demonstrating the harm caused by the defendant's actions. Third, the sentence must reflect the jury's judgment. The jury must balance all of the relevant mitigating and aggravating factors in determining an appropriate sentence.\n\n2. McVeigh's Objection\n\nOn appeal, McVeigh challenges the introduction of the following six categories of victim impact testimony: (a) last contacts with a deceased victim; (b) efforts to learn the fate of a victim; (c) thoughts on learning of a victim's death; (d) life history of a victim; (e) pure love and innocence of children killed by the explosion; and (f) efforts to cope with loss by the family and relatives of a deceased victim. McVeigh also contends that the cumulative impact of the challenged testimony inevitably influenced the jury to render a sentence based on passion rather than reason in violation of Payne.\n\nHowever, McVeigh's only direct objection to victim impact testimony during the penalty phase of the trial came when the jury was in recess after the first nine victim impact witnesses (David Klaus, Diane Leonard, Mathilda Westberry, John David Florence, Teresa Brown, Sharon Medearis, Dora Reyes, Pamela Sue Whicher and Kathleen Treanor) had already testified. As a result, we review the admission of the testimony of these nine witnesses for plain error. See United States v. Hollis, 971 F.2d 1441, 1454 (10th Cir. 1992) (\"We apply a plain error analysis even when the error to which the defendant failed to object is of constitutional dimension.\"). We note that several of the key witnesses specifically challenged by McVeigh on appeal were included among those first nine witnesses. In addition, McVeigh's objection to the remaining testimony at issue only took the form of a continuing objection. \u003cspan class=\"fnref\"\u003e44\u003c/span\u003e The record reveals no further objections lodged by McVeigh to any particular testimony. \u003cspan class=\"fnref\"\u003e45\u003c/span\u003e Once again, we observe that a continuing objection was not appropriate in this situation. The precise nature of McVeigh's continuing objection was not clear, nor was it obvious how such objection was to be applied to each successive victim witness.\n\nNevertheless, because the district court granted the objection and clarified its precise scope, we deem the continuing objection to have preserved the issue for appeal. However, the district court only granted a continuing objection covering \"testimony that . . . goes beyond the impact on the lives of the witnesses,\" and thus we limit the objection to the precise scope outlined by the district court. The limited scope of the objection, at most, could be argued to cover the testimony regarding the life history of a victim and the pure love and innocence of children killed by the explosion. Giving McVeigh the benefit of the doubt that this objection was couched in constitutional terms, we review de novo the introduction of those two categories of testimony, except for the testimony of the first nine witnesses. We review the admission of the remainder of the contested victim impact testimony for plain error. We will also assume that McVeigh adequately raised below his claim that the cumulative impact of the testimony violated his due process rights. Thus, we review de novo the question of the cumulative impact of the testimony. We find that most of the challenged testimony did not go \"beyond the impact on the lives of the witnesses\" because the impact on the life of a witness certainly includes the impact on that witness' family as observed by the witness.\n\n3. Analysis\n\nWe find no constitutional error in the admission of the challenged victim impact testimony. \u003cspan class=\"fnref\"\u003e46\u003c/span\u003e The devastating effects that the deaths of the victims had on their families and loved ones is \"certainly part and parcel of the circumstances\" of the crime properly presented to the jury at the penalty phase of trial. Bonin v. Vasquez, 807 F. Supp. 589, 613 (C.D. Cal. 1992), aff'd, 59 F.3d 815 (9th Cir. 1995).\n\na. Last Contacts\n\nMcVeigh criticizes the introduction of testimony about witnesses' last contacts with deceased family members, including Whicher's pre-continuing objection description of her last contacts with her husband and her children's feelings of regret at not hugging their father good-bye that morning, Treanor's pre-continuing objection account of her now deceased daughter's giving \"me a real hard kiss on the lips and hugg[ing] me again and . . . rubb[ing] noses,\" and Gary Campbell's pride in watching his daughter who died in the blast show him her office and talking about her desires to succeed in her career. All of this testimony was properly admitted under Payne as relevant to understanding the uniqueness of the life lost and the impact of the death on each victim's family.\n\nb. Efforts to Discover the Fate of Victims\n\nMcVeigh challenges the admission of testimony describing witnesses' often agonizing efforts to find out what happened to their loved ones. For example, McVeigh highlights the following pre-continuing objection testimony: Leonard's searches of various hospitals looking for her husband; Florence's week-long wait to learn the fate of his wife; and Treanor's realization that her in-laws and her young daughter were at the Murrah Building for an appointment at the Social Security office the morning of the explosion. This type of testimony is well within the limits set by Payne, as even McVeigh's counsel admitted during the penalty phase.\n\nc. Impact on Learning of Death\n\nMcVeigh contests the following pre-continuing objection testimony: Westberry's description of her grandson's uncontrollable crying on hearing of her husband's death; Whicher's recollection of \"screaming out that I wanted to die\" and frightening her children; and Treanor's recounting of the recovery and return of her deceased daughter's hand six months after the explosion. McVeigh also takes exception to Gregory Sohn's testimony about breaking down upon learning of his wife's death and Sharon McCullough's account of her son's cries of \"I don't want my dad to be dead\" as he saw pictures of the remains of the Murrah Building on television and the prayer he offered later when he calmed down. Payne explicitly allows for the introduction of this kind of evidence describing the impact of a victim's death on a witness and his or her family. See Payne, 501 U.S. at 827; Gretzler v. Stewart, 112 F.3d 992, 1009 (9th Cir. 1997) (evidence about \"the impact of the murder on the victim's family is relevant and admissible at a death penalty sentencing proceeding\"), cert. denied, 118 S. Ct. 865 (1998).\n\nd. Victim Histories\n\nNumerous witnesses, both pre- and post-continuing objection, testified about the professional and personal histories of victims who perished in the bombing, including reflections on the admirable qualities of the deceased. McVeigh argues that this testimony impermissibly allowed witnesses to eulogize their loved ones. We disagree. Although victim histories arguably were covered by McVeigh's continuing objection, the unique qualities of a murdered individual and his or her life accomplishments constitute the core impact evidence describing a victim's \"uniqueness as an individual human being\" allowed by Payne. Payne, 501 U.S. at 823; see also Wiley v. Puckett, 969 F.2d 86, 105 (5th Cir. 1992) (victim's wife properly testified about places she and her husband had lived and her husband's character).\n\ne. Pure Love and Innocence of Children\n\nIn discussing the suffering of children affected by the bombing, McVeigh contends that the government's witnesses prejudicially described the innocence and unconditional love manifested by children. For example, Don Browning related the story of a little girl from the day care center who had been outside the building when the bomb exploded. The girl approached a police officer and his dog, hugged the dog, and said, \"Mr. Police Dog, will you find my friends?\" Also, Glenn Seidl recalled his son Clint's counselor telling him that Clint was concerned because \"Clint has never seen you cry. He's never seen you scared. He thinks the people that have done this are after you and him . . . and this very professional lady gets a tear in her eye and says that . . . [Clint] wants to pay\" the counselor the $180 he has saved in his bank account to help his father. Even though covered by McVeigh's continuing objection, we do not see how the admission of this testimony violated Payne. If love and innocence are particular qualities of the affected children, then informing the jury of that fact is not improper. See, e.g., Payne, 501 U.S. at 814-815, 827 (allowing grandmother's testimony that grandson who lost his mother and his sister \"cries for his mom,\" \"doesn't seem to understand why she doesn't come home,\" misses his sister and worries about her); Washington v. Murray, 952 F.2d 1472, 1480 (4th Cir. 1991) (mother's testimony about \"the impact of the victim's death on her small children\" analogized to evidence properly admitted under Payne).\n\nf. Impact on Families\n\nDiscussions of the impact of the blast on the families of the victims represents the bulk of the testimony challenged by McVeigh. A few examples of this evidence include: Leonard's adult son, who was married some time after the bombing, came to her at 3:00 a.m. one morning \"crying very hard. And he said: `I want my dad back. I want him to see me graduate from college. I want him to meet my wife and be at my wedding. I want him to see my first child.'\" One of Whicher's daughters told her: [S]he has learned to hate, which is a horrible thing to hear coming from your 16-year-old baby. . . . She wrote a paper for school. The topic was a day that changed her life. . . . The paper said that \"I never knew such a dark, horrible place existed until I had to go there; and I'm crawling my way out as best I can.\" Todd McCarthy testified, \"I am now charged with teaching my son love and compassion when all he sees is hate. And that's a job I don't think anybody would want to have.\" Michael Lenz, whose wife and unborn child were killed, nearly committed suicide: [T]here was a point where I actually stuck a pistol in my mouth. I couldn't pull the trigger, thank God. . . . [W]hen I reached that low point in my life, there is nothing, nothing more dangerous than a man who has no reason to live. I've been there.\n\nSohn stated:\n\nI have my wife's coffee cup that the children bought for her that says \"No. 1 Mommy.\" Inside of that is our marriage license, two rings, and a death certificate. Sitting across the top of the table . . . is the cap that they were able to salvage that was her headgear while in uniform. . . . [I take these items] everywhere I go.\n\nPoignantly, Sharon Coyne described the loss of her fourteen-month-old daughter:\n\nI think that my fears of her dying when she was first born being confirmed was the very worst thing for me. When we drove home that night, the highway overlooked the Murrah Building; and by that time, it was very dark and it was raining and it was cold. And I truly, truly believed that my daughter was alive. You know, you don't ever think-you don't ever think that your own child is dead. And at this point, I thought that maybe she was in fact still in the building. And I think my biggest fear at that point was that she sat there in this building and she'd been there for 12 hours, she was in a dirty diaper, she didn't have a bottle, she didn't have me to hold her, and she was afraid. And I could picture her just saying \"Momma,\" and I felt so guilty leaving this place.\n\nPayne specifically allows witnesses to describe the effects of the crime on their families. See Payne, 501 U.S. at 827. All of the evidence challenged by McVeigh served that purpose. Thus, we find no error.\n\ng. Cumulative Impact\n\nTaken as a whole, this evidence is poignant and emotional. The question before us, then, is whether allowing such a substantial amount of victim impact testimony reflecting the magnitude of such a large-scale crime violates the limits on such testimony set forth in Payne. We conclude that it does not.\n\nPayne allows the introduction of victim impact evidence in order to allow the jury to understand the consequences of the crime committed. See Payne, 501 U.S. at 825-26 (\"[T]here is nothing unfair about allowing the jury to bear in mind [the specific] harm [caused by the defendant] at the same time as it considers the mitigating evidence introduced by the defendant.\") (emphasis added); see also Williams v. Chrans, 945 F.2d 926, 947 (7th Cir. 1991) (holding that the prosecution \"should not be required to present victim impact evidence . . . that [is] devoid of all passion. Such sterile prosecution of heinous crimes cannot be expected, let alone required.\").\n\nThe bombing of the Murrah Building was the deadliest act of domestic terrorism in the history of the United States. The magnitude of the crime cannot be ignored. It would be fundamentally unfair to shield a defendant from testimony describing the full effects of his deeds simply because he committed such an outrageous crime. The sheer number of actual victims and the horrific things done to them necessarily allows for the introduction of a greater amount of victim impact testimony in order for the government to show the \"harm\" caused by the crime. In addition, the jury could not have been shocked to learn that some victims had exemplary backgrounds and poignant family relationships, nor that they left behind grief-stricken loved ones. As justice Souter eloquently wrote:\n\nMurder has foreseeable consequences. When it happens, it is always to distinct individuals, and, after it happens, other victims are left behind. Every defendant knows, if endowed with the mental competence for criminal responsibility, that the life he will take by his homicidal behavior is that of a unique person, like himself, and that the person to be killed probably has close associates, \"survivors,\" who will suffer harms and deprivations from the victim's death. Just as defendants know that they are not faceless human ciphers, they know that their victims are not valueless fungibles. . . . The fact that the defendant may not know the details of a victim's life and characteristics, or the exact identities and needs of those who may survive, should not in any way obscure the further facts that . . . harm to some group of survivors is a consequence of a successful homicidal act so foreseeable as to be virtually inevitable.\n\nPayne, 501 U.S. at 838 (Souter, J., Concurring).\n\nWe also observe that in this case the government deliberately limited the victim impact testimony it chose to present, saying nothing about the vast majority of the 168 people who died in the blast. Nor did the government attempt to introduce any gruesome post-mortem photographs of the deceased. The testimony of the government's witnesses occupied only about two days during the penalty phase of trial. In addition to the government's self-restraint, the district court took a number of steps that significantly minimized the overall impact of the testimony. First, the district court issued a number of rulings prior to the commencement of the penalty phase on various motions in limine to restrict evidence by the government such as photographs and exhibits, a significant portion of which the district court excluded. \u003cspan class=\"fnref\"\u003e47\u003c/span\u003e Second, at the Conclusion of those rulings, the district court stated that it would allow \"objective\" evidence describing the \"fact\" of \"the loss of . . . people to an agency and . . . the loss of a family member . . . the empty chair, but not the emotional aspect of that, the grieving process, the mourning process.\" \u003cspan class=\"fnref\"\u003e48\u003c/span\u003e The government followed this instruction, and we have found few instances where the type of non-objective emotional testimony described by the district court was admitted. \u003cspan class=\"fnref\"\u003e49\u003c/span\u003e Third, at the close of the penalty phase, the Judge instructed the jury not to be swayed by emotion, \u003cspan class=\"fnref\"\u003e50\u003c/span\u003e and we presume that the jury honored those instructions. See United States v. Hatatley, 130 F.3d 1399, 1405 (10th Cir. 1997). Finally, the jury deliberated for two days and made specific findings in McVeigh's favor on a number of mitigating factors. We consider all of these factors persuasive evidence that the jury made a reasoned, moral judgment.\n\nViewed in its entirety, we are well satisfied that the victim impact testimony did not move the jury to impose a sentence based on passion rather than reason and that the jury based its decision on a reasoned, moral judgment.\n\nCONCLUSION\n\nFor the foregoing reasons, Timothy McVeigh's conviction and sentence are AFFIRMED.\n\n\u003cspan class=\"fn\"\u003e1. On appeal, we review the evidence - both direct and circumstantial, together with the reasonable inferences to be drawn therefrom - in the light most favorable to the government. See United States v. Copus, 110 F.3d 1529, 1534 (10th Cir. 1997).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. McVeigh's counsel, Stephen Jones, told the court, \"Just so the record is clear, our position is that we think that the Court should proceed; that we'll do the voir dire, and if we can seat a jury, then we seat a jury. . . . That will be [the] acid test.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. After the release of the Playboy story McVeigh changed course and requested a continuance. See McVeigh, 955 F. Supp. at 1281. The government urges us to limit our review of the publicity to the incremental prejudice caused by the release of the Playboy story. In short, the government seems to argue that by failing to ask for a continuance immediately after the release of the Dallas Morning News story, McVeigh waived all claims to prejudice stemming from that story. Because the information reported in the Dallas Morning News story was amplified by the media after the time McVeigh chose to go ahead and up until the time he requested a continuance, we do not deem McVeigh's earlier decision to go forward in the face of the Dallas Morning News story to qualify as a waiver as to all of the influences of that story upon the media and the public. Thus, we review all of the publicity, including the Dallas Morning News report, for its cumulative effect on the jury pool. However, we do find the decision by McVeigh and his legal team to go forward with jury selection despite the publicity following in the immediate wake of the Dallas Morning News story to be relevant evidence that the nature of the reports was not such, at least at that time, that would preclude seating a fair and impartial jury.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. McVeigh urges this court to compare the circumstances of this case with those of Coleman v. Kemp, one of the extremely rare cases in recent history in which a federal court of appeals has found presumed prejudice. See Coleman v. Kemp, 778 F.2d 1487, 1538 (11th Cir. 1985). However, the circumstances and nature of the publicity of the case before us are a far cry from those in Coleman, both in pitch and character. Before Coleman's trial, highly prejudicial pretrial publicity was widely disseminated in the sparsely populated rural county where the violent murders occurred and from which the jury pool was drawn. Moreover, the victims were well-known and well-liked in the community from which the jury pool was selected, and it was revealed at voir dire that several of the seated jurors personally knew the victims, and one had attended the funeral of five of the victims. See id. at 1539. At an evidentiary hearing held on remand, there was testimony by local citizens and reporters that the community had irrevocably made up its mind as to the guilt of the defendants and the appropriate penalty. See id. In short, \"everyone\" in the close-knit community from which the jury was drawn \"knew that [the defendants] were guilty and everyone knew they should be electrocuted.\" Id. The impact of the pretrial publicity in that case upon the seated jurors was much more pervasive than was the case with the McVeigh jurors.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. In his brief before this court, McVeigh argues, at some length, that if news of a \"confession\" were brought to the attention of the jury during a criminal trial, the court would have no choice but to grant a new trial. The case cited by McVeigh, United States v. Thompson, 908 F.2d 648 (10th Cir. 1990), involved publication during trial in a local newspaper of the defendant's aborted guilty plea. This court held that the trial court's failure to question the jury about possible exposure to the publicity and to take measures to ensure that it had no effect on the outcome of the trial constituted abuse of discretion and necessitated a new trial. See id. at 650-52. McVeigh relies on Thompson to urge this court to equate the situation where the prejudicial reports are published during trial to situations where they are published before trial. In effect, McVeigh argues that the trial begins at the moment summons notices are sent out to potential jurors. This argument ignores the fact that when such publicity occurs before voir dire, the court and the defendant still have available powerful mechanisms to ensure juror impartiality, namely voir dire and the potential of a change in venue. For this reason, inter alia, we find that the two situations are readily distinguishable. See, e.g., United States v. Aragon, 962 F.2d 439, 441 n.3 (5th Cir. 1992) (distinguishing between pretrial publicity and midtrial publicity and noting that a stricter standard applies to the latter).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. According to the government, only forty out of the ninety-nine venirepersons reported hearing about the alleged confession. McVeigh does not dispute this calculation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The facts of Irvin can easily be distinguished from those before us here. In Irvin, eight of the twelve seated jurors indicated during voir dire that they had already made up their minds that the defendant was guilty. See Irvin, 366 U.S. at 727. Given that circumstance, the Supreme Court held that \"[w]here so many, so many times, admitted prejudice . . . [jurors'] statement[s] of impartiality can be given little weight.\" Id. at 728. To the contrary, none of the seated jurors in the case before us indicated that he or she had already made up his or her mind as to McVeigh's guilt, and all indicated that they could and would remain impartial until the end of the trial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Although there may be some doubt whether this statement was actually made, for the purposes of this appeal the government concedes we must treat the report as true.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. In the caption of McVeigh's brief, he characterizes this issue in constitutional terms, contending that the exclusion of his proffered evidence denied him \"A Fundamentally Fair Trial.\" McVeigh's Discussion, however, is almost entirely devoted to evidentiary considerations under the Federal Rules of Evidence. Only at the end of his argument does McVeigh contend that the denial of his proffered evidence resulted in a constitutionally defective trial, relying on Richmond v. Embry, 122 F.3d 866, 872 (10th Cir. 1997), cert. denied, 118 S. Ct. 1065 (1998). In Richmond, we held that the exclusion of evidence can result in a fundamentally unfair trial only if the excluded evidence was so \"material\" that it would have created \"reasonable doubt that did not exist without the evidence.\" See id. We have no difficulty in concluding on this record that McVeigh has failed to make an adequate showing under Richmond to sustain a constitutional claim.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. This circuit has required on-the-record findings for a trial court's balancing under Rule 403 when the disputed evidence is offered pursuant to one of the specialized character evidence rules. See United States v. Castillo, 140 F.3d 874, 884 (10th Cir. 1998) (remanding for on-the-record Rule 403 balancing of evidence offered pursuant to Rule 414); United States v. Guardia, 135 F.3d 1326, 1331 (10th Cir. 1998) (requiring \"a clear record of the reasoning behind\" a trial court's Rule 403 balancing of evidence offered pursuant to Rule 413); United States v. Kendall, 766 F.2d 1426, 1437 (10th Cir. 1985) (requiring a trial court to provide \"specific and clear reasoning and findings in the trial record\" to support a decision under Rules 403/404(b)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The government responded that it had followed up Howe's report of seeing the \"John Doe\" suspects, and its investigators concluded that these brothers were not involved in the Oklahoma City bombing.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. In 1996 Congress revised § 2332a(a)(2) to include the element (which previously had only been implied) that \"the results of such use affect interstate or foreign commerce, or, in the case of a threat, attempt or conspiracy, would have affected interstate or foreign commerce.\" See Pub. L. 104-132, § 725(1)(C). Because this bombing took place in 1995, we address the statutory text as it existed at that time. However, we note that the district court identified the jurisdictional element of effect on interstate commerce as an implicit requirement of the pre-amendment statute and required the government to prove that the bombing had an effect on interstate commerce.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. In an argument raised for the first time on appeal, McVeigh urges us to analogize § 2332a to 18 U.S.C. §§ 924(c) \u0026 (j). Section 924(j) apportions punishment according to intent by providing: A person who, in the course of a violation of subsection (c), causes the death of a person through the use of a firearm, shall - (1) if the killing is a murder (as defined in section 1111), be punished by death or by imprisonment for any term of years or for life; and (2) if the killing is a manslaughter (as defined in section 1112), be punished as provided in that section. Even if this argument were not waived for failure to raise it in the district court, see Tele-Communications, Inc. v. Commissioner of Internal Revenue, 104 F.3d 1229, 1233 (10th Cir. 1997), we would find it unpersuasive because this is not a § 924(c) case. Further, the wording of § 924(j) actually works against McVeigh, because it shows that Congress is capable of differentiating permissible punishments on the basis of intent when it chooses to do so.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The requirements articulated by Tison and Enmund for imposing the death penalty are satisfied. The penalty phase jury verdict form instructed the jury: For each of the following, answer \"Yes\" or \"No\" as to whether you, the jury, unanimously find that the government has established beyond a reasonable doubt that the defendant, Timothy James McVeigh, acted with the specified criminal intent to cause death: (A) The defendant intentionally killed the victims. (B) The defendant intentionally inflicted serious bodily injury that resulted in the death of the victims. (C) The defendant intentionally participated in an act, contemplating that the life of a person would be taken or intending that lethal force would be used against a person, and the victim(s) died as a result of that act. (D) The defendant intentionally and specifically engaged in an act of violence, knowing that the act created a grave risk of death to a person, other than a participant in the offense, such that participation in the act constituted a reckless disregard for human life and the victim(s) died as a direct result of the act. The jury answered \"Yes\" to each of the four propositions. These findings support the imposition of the death penalty. See Tison, 481 U.S. at 158; Enmund, 458 U.S. at 797.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. The removal of the \"intent to kill\" allegations from Counts I and II of the indictment does not mean that the criminal intent elements of those crimes were not alleged in the indictment. The indictment specifically alleges for each of the mass destruction offenses that McVeigh acted \"knowingly, intentionally, willfully, and maliciously.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Section 844(f) was also amended in 1996. See Pub. L. 104-132, § 708(a)(2). As with § 2332a, we address the text of the statute as it existed in 1995.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. The structure of the redrafted version of § 844(f) makes it even more clear that the phrase \"if death results\" is a sentence enhancement rather than a substantive offense. See 18 U.S.C.A. § 844(f) (West Supp. 1997).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. McVeigh does not argue that he was entitled to instructions on lesser-included offenses other than second-degree murder, and the record does not indicate that he requested instructions on any offenses other than second-degree murder.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The court stated: [T]his is an all-or-nothing verdict on the murder counts, because I don't see how the jury could rationally say, given the view of the evidence they'd have to take to reach a guilty verdict, that Timothy McVeigh was involved in this bombing [but] that there wasn't any premeditation in it.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. The government here did not charge McVeigh with felony murder.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. We are not persuaded by the hypothetical argument presented by McVeigh on appeal, in which he suggests that even if he premeditated the use of the bomb, he may not have known that the bomb would be detonated at a time at which it was likely that persons would be killed, and thus the jury could have had a reasonable doubt whether he premeditated murder. Without any evidence affirmatively present in the record to support such a theory, the question was not sufficiently in dispute that it obligated the district court to give instructions on second-degree murder. See United States v. Haar, 931 F.2d 1368, 1372 (10th Cir. 1991); see also United States v. Wright, 131 F.3d 1111, 1112 (4th Cir. 1997), cert. denied, 118 S. Ct. 2309 (1998); United States v. Parker, 32 F.3d 395, 401 (8th Cir. 1994).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Although the caption to McVeigh's argument states that the admission of guilt phase victim testimony violated Rule 403 and \"Rendered the Guilt Determination Constitutionally Unreliable,\" the only constitutional argument raised by McVeigh is that the Eighth Amendment requires a heightened standard of review under Rule 403 for death penalty cases. On appeal, McVeigh does not bring a Due Process challenge to the introduction of this evidence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. The objection was made in the following manner: Mr. Nigh [counsel for McVeigh], did you have something before the jury returns? MR. NIGH: I did, your Honor. I wanted to interpose an objection to testimony in the nature of victim impact evidence during the first stage. It's my understanding that two of the witnesses coming up are also witnesses in the second stage; and rather than interrupt during the examination, I wanted to impose -- or interpose the objection now. What are you characterizing as victim impact? The type of testimony we've had from this witness and also from Mr. Norfleet? MR. NIGH: Yes, your honor. Some of the previous witnesses, in terms of extensive conversations and things not related to what the witness saw, heard, experienced during the relevant time period. Well, I haven't considered that we've gone beyond the bounds of what the immediate effects were; so as long as we're staying with the immediate effects and not the long-range effects, I think it's permissible; and you can have a continuing objection to it.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Before trial, McVeigh offered to stipulate to the identity of all the persons killed in the bombing, that all died as a result of the bombing, and that the eight federal law enforcement officers who were the subject of the individual murder counts in the indictment were killed while engaged in the performance of their duties. Relying on Old Chief v. United States, 117 S. Ct. 644 (1997), McVeigh filed a pretrial motion in limine to compel acceptance of the proposed stipulation and to exclude evidence offered by the government to prove the facts included in the stipulation as overly prejudicial under Federal Rule of Evidence 403. The district court denied McVeigh's motion. McVeigh argues that his motion in limine preserved a Rule 403 objection to the challenged testimony. We disagree. \"[F]act-bound determinations dependent upon the character of the evidence introduced at trial\" are inappropriate for final Disposition through motions in limine. Mejia-Alarcon, 995 F.2d at 987. In addition, McVeigh's motion in limine only objected to testimony identifying the victims and the cause of death - the very testimony McVeigh concedes on appeal was \"appropriately admitted\" - and did not seek to exclude other evidence under Rule 403.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. At one point in his brief, McVeigh complains that the government did not present this evidence in a way to minimize its emotional impact. However, the government has no obligation to minimize the emotional impact of testimony. Rule 403 is designed to insure only that the prejudicial effects of emotional testimony do not overwhelm the jury.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. The district court ruled that the deaths of individuals other than the law enforcement officers that resulted from the explosion were not elements of the crime charged for purposes of establishing criminal intent but rather served as relevant conduct to enhance the penalty. However, the district court made clear that proof of the deaths could be admitted to show use of a weapon of mass destruction or substantial interference with interstate commerce.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. McVeigh also challenges Espe's testimony regarding the recovery of some of the bodies two weeks after the bombing, Matthew Cooper's testimony about removing the body of Captain Guzman from the rubble, and Florence Rogers' testimony concerning the recovery of bodies after the implosion of the remaining structure, as long-term effect evidence. However because this evidence deals with identifying deceased victims, we treat this testimony as covered by our prior Discussion regarding immediate impact evidence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. We again caution that we accept the efficacy of McVeigh's continuing objection. McVeigh did not object specifically to the testimony of the eight witnesses challenged on appeal. Had McVeigh objected to this evidence, the district court may well have been alerted to exclude portions of it. This illustrates the danger of granting a continuing objection in an area as nebulous as this.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. The jury instructions stated in relevant part: Under your oath as jurors, you are not to be swayed by sympathy. You are to be guided solely by the evidence in this case; and the crucial, hard-core question that you must ask yourselves as you sift through the evidence is has the government proven the guilt of the defendant beyond a reasonable doubt. It is for you alone to decide whether the government has proven that the defendant is guilty of the crime charged based solely on the evidence and subject to the law as I give it to you in these instructions. It must be clear to you that once you let fear or prejudice or bias or sympathy interfere with your thinking, there is a risk that you will not arrive at a true and just verdict according to the law and the evidence. If you have a reasonable doubt as to a defendant's guilt, you should not hesitate for any reason to return a verdict of not guilty; but on the other hand, if you should find that the Government has met its burden of proving the defendant's guilt beyond a reasonable doubt, you should not hesitate because of sympathy or any other reason to return a verdict of guilty.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. At one point in his brief, McVeigh suggests that the sequence of the witnesses and the placement of their testimony in the course of the trial was improper. There is no legal basis for such an objection. The government can order the appearance of its witnesses in any way it so chooses.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. See our Discussion above under Issue E.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. While making his appellate argument the government's counsel stated, \"[W]e would say that there's no valid continuing objection to the guilt phase testimony but there is one [pertaining to voir dire on the death issue]. Because it is a predominantly legal issue under Morgan, that is a valid continuing objection and it brings in with it the general issue, can we ask case specific questioning [that] if you found 168 people were intentionally murdered by this defendant, would you really be open to mitigation.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. We need only consider the voir dire of the twelve jurors who decided McVeigh's case, because the bias of unseated jurors is irrelevant to whether McVeigh had an impartial jury. See Ross v. Oklahoma, 487 U.S. 81, 86 (1988) (\"Any claim that the jury was not impartial . . . must focus . . . on the jurors who ultimately sat.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. Juror 3 was asked: [Defense]:What about - do you remember was the most touching to you that really got to you the most? [Juror]: About the children. . . . [Defense]: Did you - do you remember thinking when you realized what had happened and especially about the children - do you remember having any thoughts about what ought to happen to whoever did that? [Prosecutor]: Your Honor, I'll object to this. [Court]: Sustained. Juror 5 was asked: [Defense]: Based upon - or let me put it another way. As a result of the - the scenes of destruction that you have seen and the horrors that are associated with the bombing, did you form any opinion about the punishment that should be imposed? [Prosecutor]: Objections, your Honor. We've been over this - [Court]: Yes. I've been sustaining that objection. We note that besides being objectionable as beyond the scope of Morgan (as discussed in the text), these questions are not compelled by Morgan because they ask about a bias or prejudice prospective jurors may have felt at the time of the bombing, not at the time of trial. Jurors who previously were affected by publicity may be able to be impartial by the time of trial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Morgan held that generic impartiality and follow-the-law questions were insufficient to determine if a prospective juror was impartial as to the death penalty. See Morgan, 504 U.S. at 734-36. However, the trial court's colloquy in this case was much more detailed than the general questions which Morgan held were insufficient. See Tipton, 90 F.3d at 878-79. In any event, in terms of a pretrial publicity inquiry, the trial courts have great discretion to decide in what manner the subject should be covered. See Mu'Min, 500 U.S. at 427.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. After the court announced this ruling, the government challenged the foundation in McVeigh's proffer for his allegation that Mahon and Strassmeier had made three trips to Oklahoma City to \"case\" the Murrah Building. However, the court made no comment or ruling on this aspect of the proffer.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. The text of the catch-all mitigating factor provides, (a) Mitigating factors. - In determining whether a sentence of death is to be imposed on a defendant, the finder of fact shall consider any mitigating factor, including the following: . . . (8) Other factors. - Other factors in the defendant's background, record, or character or any other circumstance of the offense that mitigate against imposition of the death sentence. 18 U.S.C.A. § 3592(a).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. The text of the \"minor participation\" mitigating factor provides: (3) Minor participation. - The defendant is punishable as a principal in the offense, which was committed by another, but the defendant's participation was relatively minor, regardless of whether the participation was so minor as to constitute a defense to the charge. 18 U.S.C.A. § 3592(a)(3). McVeigh could not meet the elements of this statutory mitigating factor because the jury's verdict during the guilt phase precluded him from arguing that the bombing was \"committed by another.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. The record includes one bit of evidence from the government indicating that a phone card attributed to McVeigh was used at a motel in Kingman, Arizona, to call the spiritual leader of Elohim City, David Millar, in Muldrow, Oklahoma. However, before the district court, McVeigh never argued that this evidence connected him to Elohim City, and in fact, McVeigh never even alluded to this evidence during the proffers of the Howe testimony.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. As a result of our Conclusion that the Howe testimony was not relevant, we need not, and do not, address either the district court's failure to make a record of its apparent balancing of probativity versus prejudice under § 3593(c) or the substantive merit of that balancing. We note that the Federal Death Penalty Act provides a different balancing standard for weighing probativity and prejudice than does Federal Rule of Evidence 403. Compare 18 U.S.C.A. § 3593(c) with Fed. R. Evid. 403. In light of our decision on relevance, we decline to express any opinion on the issue of whether the probativity/prejudice balancing of § 3593(c) comports with the holding in Eddings that the Eighth Amendment requires the consideration of \"any relevant mitigating evidence.\" See Eddings, 455 U.S. at 114 (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. Counsel for McVeigh did request that the court reconsider its ruling on objective Waco evidence in light of the government's cross-examination of Reavis, which the court refused to do. However, asking the court to reconsider its evidentiary ruling is not the same thing as objecting contemporaneously to an opponent's questions. Because counsel for McVeigh did not contemporaneously object to the government's cross-examination of Dick Reavis, we review it for plain error. See United States v. Nichols, 21 F.3d 1016, 1019 (10th Cir. 1994).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. McVeigh does not argue that the admission of the evidence violated any statutory or evidentiary rules, nor does he contest the relevance of the disputed evidence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. McVeigh does not claim that the admission of the challenged victim impact testimony violated the limitations in Booth left untouched by Payne.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. The objection was made in the following manner: [Defense]: I know how difficult this is, but I must object. I thought that the testimony in the second stage was to be the impact of the empty chair. Instead, what we are spending our time on, 80 percent of it, is how these people found out their loved one died. And while I think that might be admissible, perhaps-but that's all it's becoming; and it is taking these most dramatic incidents, and that's the testimony. One or two, I could understand; but we're now into the teens on this list and it is coming in. And I think that we're exceeding the court's instructions. There has to be some balance and proportionality to this for the sentencing stage to keep the jurors' minds open until they've heard everything, and all I ask is some restraint and some balance. . . . [Prosecution]: We can restrict their [future witnesses] testimony from this point forward to traditional impact, if the Court wants. Yes. I think-these-this testimony about last kisses on the lips, and so forth, is excessive. . . . [Defense]: The other place that I'm at, your Honor, is I can't expect the Court to be co-counsel to Mr. McVeigh and impose objections. And yet if I object, it seems to me I hurt my client more; but if I don't, I'm waiving valid points. But I don't know what a continual objection is under these circumstances; and I'll just do as my conscience dictates, I guess. Well, I'm not going to expect you to object in front of the jury. You have a continuing objection to the testimony that you say goes beyond the impact on the lives of the witnesses. That's your- [Defense]: Yes. That's the basis of my objection. And I think that we do have to exercise more discipline. As I say, particularly-I think that it's legitimate as to how they found out about the-their loved ones. That's part of the impact. [Defense]: Sure. But I can't-I can't accept more of this-as this last witness about the little child and hugging and kissing and so forth. I don't think that's part of it. (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. McVeigh also made a motion in limine to exclude the victim impact testimony. However, because the determination of the admissibility in terms of both relevance and prejudice of each successive victim impact witness depended on the context of the specific testimony during the penalty phase, we do not believe the motion in limine preserved for appellate review an objection to the specific testimony of any single witness. See our Discussion of United States v. Mejia-Alarcon, 995 F.2d 982, 986-88 (10th Cir. 1993), under Issue E.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. Even if we found error, it would not rise to the level of plain error given the lack of clear guidance on the appropriate limits of victim impact testimony under Payne that existed at the time of the trial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. For example, the district court prohibited the introduction of wedding photographs and home videos.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. In fact, McVeigh states that he does not fault the standard for reviewing testimony under Payne set forth by the district court. In addition, McVeigh did not object at the pre-trial hearing to any of the proffered victim impact testimony. Although he expressed opposition to the testimony of two of the rescue workers, he did not even lodge a formal objection to that evidence, ending the discussion on the subject by stating, \"We'll try to work that out.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. The district court's admonitions were stricter than those we have found to be required by Payne. Thus, even though some of the emotional accounts of learning about the fate of a loved one might have violated the district court's standard, the admission of that limited amount of testimony did not run afoul of Payne.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. The district court instructed the jury in relevant part: Your role in this process is to be the conscience of the community in making a moral judgment about the worth of a specific life balanced against the societal value of what the government contends to be - or is the deserved punishment for these particular crimes. Your decision must be a reasoned one free from the influence of passion, prejudice or any other arbitrary factor. (emphasis added).\u003c/span\u003e\n\n",
    "body_length": 201411,
    "citedas": [
      "153 F.3d 1166"
    ],
    "attorneys": "Sean Connelly, Special Attorney to the United States Attorney General, Denver, Colorado (Patrick M. Ryan, United States Attorney, Oklahoma City, Oklahoma, Joseph H. Hartzler, Larry A. Mackey, Aitan Goelman, James Orenstein and Beth A. Wilkinson, Special Attorneys to the United States Attorney General, Denver, Colorado, with him on the briefs), for Plaintiff-Appellee. Robert Nigh, Jr., Tulsa, Oklahoma, and Richard Burr, Houston, Texas, for Defendant-Appellant.",
    "category": [
      "242",
      "243",
      "36",
      "75"
    ],
    "judges": "Before Ebel, Kelly, and Murphy, Circuit Judges.",
    "citation_count": 231
  }
}
