{
  "id": "g4UdP2YBTlTomsSBkou8",
  "document": {
    "title": "In re Hoffman",
    "full_title": "IN RE: BENDECTIN LITIGATION. SARAH ANN HOFFMAN; ET AL. (85-3858), ELIZABETH ANN DAVIS; ET AL. (85-3876), SHANE ROSS WOOD; ET AL. (85-3877) v. MERRELL DOW PHARMACEUTICALS, INC., (FORMERLY KNOWN AS) RICHARDSON-MERRELL, INC.",
    "jurisdiction": "Sixth Circuit",
    "date": "1988-08-30T00:00:00.000Z",
    "docket": "Nos. 85-3858, 85-3876, 85-3877",
    "body": "ENGEL, Chief Judge.\n\nThese actions were brought on behalf of children with birth defects against Merrell Dow Pharmaceuticals, Inc., alleging that their birth defects were caused by their mothers' ingestion during pregnancy of defendant's anti-nausea drug Bendectin. Immediately involved are eleven hundred eighty claims in approximately eight hundred forty-four multidistrict cases.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e These cases represent only a part of the Bendectin cases which have been brought in numerous federal and state courts around the nation.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Although there are some differences among the complaints, most are virtually identical, requesting relief on the grounds of negligence, breach of warranty, strict liability, fraud, and gross negligence, and asserting a rebuttable presumption of negligence per se for defendant's alleged violation of the misbranding provisions of the federal Food, Drug and Cosmetic Act (FDCA), 21 U.S.C. § 301 et seq.\n\nAfter twenty-two days of trial on the sole question of causation, the jury answered the following interrogatory in the negative: \"Have the plaintiffs established by a preponderance of the evidence that ingestion of Bendectin at therapeutic doses during the period of fetal organogenesis is a proximate cause of human birth defects?\" In re Richardson-Merrell Inc., Bendectin Products, 624 F. Supp. 1212, 1269 (S.D. Ohio 1985). Had the jury answered this question in the affirmative, it then would have answered a second question concerning the particular categories of birth defects that Bendectin caused when administered at therapeutic doses: musculoskceletal defects, central nervous system defects, heart and circulatory defects, head defects, respiratory defects, gastrointestinal defects, genitourinary defects, and death. Id. Accordingly, the district judge entered judgment for defendant.\n\nOn appeal, plaintiffs argue that the federal district court did not have jurisdiction over actions brought by Ohio plaintiffs, actions originally filed in state courts, or actions originally filed in the federal district courts in any of the fifty states and later transferred to the United States District Court for the Southern District of Ohio. Other issues raised on appeal concern various aspects of the trial, including certain evidentiary rulings and the district court's decision to create the Plaintiffs' Lead Counsel Committee, to prevent withdrawal from the common issues trial while permitting new transfers into the case, to apply Ohio law to all plaintiffs, to trifurcate on the causation question, and to exclude visibly deformed plaintiffs.\n\nWe direct the dismissal without prejudice of those thirteen actions brought by Ohio citizens in federal court in which Merrell Dow has conceded that no federal question jurisdiction was invoked and has further conceded that the district court was therefore without jurisdiction to render judgment on the merits against those plaintiffs.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e As to all other suits brought by Ohio citizens in federal courts and subject to this appeal, we hold that the district court did have federal question jurisdiction and thus the adverse jury verdict is binding on those plaintiffs. Finally, we do not disturb the district court's post-trial order remanding all cases brought by Ohio citizens in state courts back to the courts from which they were removed. In all other respects, we affirm.\n\nI. BACKGROUND OF THE CASE\n\nThe unusually large number of individual cases involved here found their way to the United States District Court for the Southern District of Ohio in a variety of ways. Eight hundred thirty-four of these claims were filed either in the Northern or Southern Districts of Ohio, while seventy-three claims, originally filed in Ohio state courts, were removed to Ohio federal courts. Only twenty-nine of the cases were initially filed in Ohio by Ohio citizens. The remainder included sixty-two plaintiffs from California, five from Texas, six from Pennsylvania, and sixty-six from other states or foreign countries. Two hundred seventy-three claims were filed or removed to federal district courts outside Ohio and were transferred to the Southern District of Ohio by the Judicial Panel on Multidistrict Litigation. In addition to these cases, the Judicial Panel on Multidistrict Litigation referred, pursuant to 28 U.S.C. § 1407, forty-seven cases under MDL 486 for consolidated pretrial discovery. Between 1982 and the completion of the trial in 1985, 582 additional cases were referred by the panel and 557 cases were filed in the Southern District of Ohio.\n\nThe court designated a five-member Plaintiffs' Lead Counsel Committee to act as the counsel for all plaintiffs. After the completion of discovery, on November 16, 1983, the district court consolidated under Rule 42(a) of the Federal Rules of Civil Procedure all Bendectin cases originally filed in the Southern District of Ohio or transferred in MDL 486 from the Northern District of Ohio and set those cases for trial beginning June 4, 1984 on all common issues of liability. The original decision was to bifurcate the trial, and if the plaintiffs were successful in obtaining a verdict finding liability, the court would schedule individual damages trials. While consolidation for trial was mandated for all cases pending in federal court in Ohio, the trial judge also permitted consolidation upon the liability issues for any case which had been transferred to the Southern District of Ohio under MDL 486. 28 U.S.C. § 1404. Those cases would be returned to the originating district if the verdict in the first portion of the bifurcated trial was for the plaintiffs. The district judge indicated that under Erie Railroad Co. v. Tompkins, 304 U.S. 64, 82 L. Ed. 1188, 58 S. Ct. 817 (1938), all claims which had been originally brought or removed to federal court in Ohio would necessarily be governed by Ohio law, and that plaintiffs who had originally filed in other districts and who voluntarily chose to participate in the common issues trial would consent to application of the law of Ohio by so agreeing to participate. A number of plaintiffs chose to leave the consolidated proceedings after the completion of discovery and this order, and the district court accordingly returned those suits to the district in which they had been originally filed.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nIn this order, the judge continued to allow additional plaintiffs to \"opt in\" to the trial, whether they had filed originally in the Southern District of Ohio or had filed in other districts and wished to have their cases transferred pursuant to 28 U.S.C. § 1404, so that by the date opt-ins were barred on March 1, 1985, 557 cases originating in the Southern District of Ohio and 261 transferred cases were subject to the jury decision. A total of 368 cases assigned by the Judicial Panel on Multidistrict Litigation did not go to trial, either because of failure to opt in or because they were otherwise disposed of. One set of plaintiffs who opted in after the district court ordered a bifurcated trial on the issues of liability and damages were the Davis plaintiffs, who had originally filed in Arizona federal court, and who opted into the joint liability trial on February 1, 1984.\n\nThe district court asked counsel to stipulate as to all common issues of liability that could be tried during the first phase of the trial. Defendant suggested a trial only on the issue of whether Bendectin was an unreasonably dangerous product imposing upon Merrell Dow a duty to warn about such dangers. It argued that substantive law differences among the various jurisdictions represented by plaintiffs prevented consolidation as to any other issue, regardless of whether the cases had been originally filed in Ohio or had been subsequently transferred there. The plaintiffs requested a trial of all common interrelated issues of law and fact, including whether Bendectin increased the risk of birth defects in the children of pregnant mothers who ingested the drug. They also indicated that the liability issues were inextricably interwoven and needed to be tried together with causation. Because the parties could not agree which issues should be tried during the first phase of trial, the court itself decided that the common issues to be tried beginning on June 11, 1984, would be whether: (1) taken as prescribed, Bendectin caused any of a list of birth defects; (2) Bendectin was unreasonably dangerous as defined by Ohio courts; and (3) Merrell Dow provided to the medical profession adequate warnings of the danger of the product. On April 12, 1984, the district court amended this order. Rather than bifurcating the trial on issues of liability and damages, the court instead decided to trifurcate the case, or bifurcate the liability question into liability and causation. Initially, a jury determination would be made on the causation question. If plaintiffs prevailed on the causation question, the jury would then consider the other liability questions. Conversely, if defendant received a favorable verdict on the causation issue, the trial would cease. Because the case would now be trifurcated rather than bifurcated, the district judge allowed any plaintiffs whose cases had been brought originally in courts outside Ohio to rescind their agreement to participate in the trial, provided that they notify the court of their decision by May 1, 1984.\n\nAfter a jury had been selected for the June 1984 trial, settlement negotiations between the parties reached a successful conclusion. The district judge certified a class for purposes of settlement. However, on appeal, another panel of this court held that class certification was inappropriate and issued a writ of mandamus vacating the district court's order. In re Bendectin Products Liability Litigation, 749 F.2d 300 (6th Cir. 1984).\n\nOn December 19, 1984, the district court then rescheduled the trial to begin in February, 1985 and ordered that it proceed in the same manner and with the same issues as had been indicated in the trifurcation order of April 1984. The district judge then said that while, as before, cases originally brought in Ohio would necessarily be part of the common issues trial, new cases originating in any other district and transferred under MDL 486 would have the option of electing to participate in the February 1985 trial, provided the plaintiffs did so by February 1, 1985. The court would not allow any plaintiff whose case had been filed in any state other than in Ohio and had been voluntarily consolidated in the common issues trial prior to the date of that order, December 19, 1984, to rescind the decision to participate.\n\nThe trifurcated trial commenced in February, 1985. Fearing undue prejudice to defendant, the trial judge, without actually viewing any plaintiffs, granted defendant's motion in limine to exclude all visibly deformed plaintiffs as well as all plaintiffs below the age of ten, whether or not they displayed birth defects. In another room in the courthouse, the court provided video arrangements to enable any excluded plaintiff to view the course of trial, as well as communications equipment so that plaintiffs could assist counsel. Further, the jurors and the deformed plaintiffs used different elevator banks so as to preclude the possibility of even accidental contact. Following trial, judgment was entered for defendant upon the jury's negative answer to the question whether plaintiffs had proven that ingestion of Bendectin proximately causes birth defects.\n\nOn August 27, 1985, after the entry of judgment and during the pendency of plaintiffs' motion for judgment NOV or new trial, the district court issued an order concerning its jurisdiction over those plaintiffs who were citizens of Ohio. This order was prompted by litigation involving two foreign plaintiffs whose claims were before the district court but are not before us on this appeal. In that related litigation, the defendant had sought to dismiss, on the ground of forum non conveniens, two cases which Merrell Dow had removed to the Southern District of Ohio from state courts in Ohio. The plaintiffs opposed this motion, and instead filed a motion to remand under 28 U.S.C. § 1447(c) for lack of subject matter jurisdiction, as the district court would not have had original jurisdiction to hear the cases under its grant of federal question jurisdiction. The trial judge granted defendant's motion to dismiss, but this court reversed, Thompson v. Merrell Dow Pharmaceuticals, Inc., 766 F.2d 1005 (6th Cir. 1985), aff'd, 478 U.S. 804, 106 S. Ct. 3229, 92 L. Ed. 2d 650 (1986). The parties agreed that the FDCA did not create a private right of action for its violation, and our court said that federal question subject matter jurisdiction would thus exist only if the plaintiffs' right to relief depended \"necessarily\" on a substantial question of federal law. Finding that recovery would not \"necessarily\" be barred by a failure to establish a violation of the FDCA, we held that plaintiffs' motion to remand to state court should have been granted on the ground that the district court did not have federal question jurisdiction.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Similarly, in this case, reasoning that Merrell Dow's status as an Ohio citizen prevented removal on the basis of diversity jurisdiction in cases brought in state court by Ohio residents, 28 U.S.C. § 1441(b), and that there was no subject matter jurisdiction over Ohio plaintiffs' complaints alleging causes of action under the FDCA because the statute does not create an implied right of action, the district court remanded all complaints brought by Ohio plaintiffs in Ohio state courts under 28 U.S.C. § 1441(c) and dismissed without prejudice the Ohio resident complaints that had been brought in federal court in Ohio pursuant to 28 U.S.C. § 1331. It then issued a stay of this order pending appeal. Plaintiffs' motion for judgment NOV or new trial was denied on September 17, 1985, and these appeals followed.\n\nII. MATTERS AFFECTING ONLY SOME PLAINTIFFS\n\nA. PLAINTIFFS' LEAD COUNSEL COMMITTEE\n\nOn April 30, 1982, the district judge appointed a Lead Counsel Committee, selecting only some of the plaintiffs' attorneys, but only after counsel for a majority of the plaintiffs agreed to the formation of this Committee. He gave plaintiffs' attorneys time to object or propose others to serve on it The Wood plaintiffs claimed that this decision denied them the right freely to choose counsel, in that the four counsel that the trial judge chose did not include their own attorney. No plaintiff responded to the district judge's order to show cause why such appointment should not be confirmed. In complex cases, it is well established that the district judge may create a Plaintiffs' Lead Counsel Committee. Vincent v. Hughes Air West, Inc., 557 F.2d 759, 773-74 (9th Cir. 1977); In Re Air Crash Disaster at Florida Everglades, 549 F.2d 1006, 1014-15 (5th Cir. 1977); Farber v. Riker-Maxson Corp., 442 F.2d 457, 459 (2d Cir. 1971). We find no error in creating such a committee in this case, especially given the failure below to object to such a procedure.\n\nB. JURISDICTION\n\nFor most of the plaintiffs in this case, there is no question that both the district court and this court have jurisdiction. The defendant, because it is incorporated in Delaware but has its principal place of business in Ohio, is for diversity purposes a citizen both of Ohio and Delaware, 28 U.S.C. § 1332(c), and most of the plaintiffs are citizens of other states or foreign countries. Since all of such plaintiffs allege damages of a sum exceeding $10,000, there is diversity jurisdiction over all of their cases. The more difficult question concerns federal jurisdiction over Ohio plaintiffs. The only basis for these plaintiffs to assert jurisdiction in this court is federal question jurisdiction, 28 U.S.C. § 1331. Under 28 U.S.C. § 1441(b), the defendant may remove cases to federal court only if there is federal question jurisdiction. For federal courts to exercise jurisdiction over Ohio cases, the cases must \"arise under\" the constitution, laws or treaties of the United States. The district judge found as a result of this court's opinion in Thompson v. Merrell Dow, 766 F.2d at 1005, that there was no basis for federal question jurisdiction. Accordingly, he dismissed without prejudice cases originally filed by Ohio residents in Ohio federal court, and remanded to state court those cases which had been originally filed in Ohio state courts and removed by defendant.\n\nWe modify the district court order insofar as we find that the district court did have federal question jurisdiction over those Ohio plaintiffs who filed their complaints in federal court. Thus, with the exception of those few cases noted infra, the Ohio plaintiffs who initially brought suit in federal court and went to trial on the issue of causation are bound by the jury's verdict. As to them, Merrell Dow is entitled to the entry of judgment on the merits in its favor. An exception exists for those thirteen cases filed by Ohio plaintiffs in federal court which are properly conceded by defendants not to allege any substantial federal question in their complaints. In all other respects, we affirm.\n\nIn explanation of the above holding, it is necessary first to consider whether the district court had jurisdiction over those Ohio citizens who filed their original actions in federal court. The crux of this inquiry necessarily turns on whether these plaintiffs alleged a substantial federal question in their complaints. Absent diversity there was, as noted earlier, no basis other than the allegation of a federal question for the trial court to exercise authority over these controversies.\n\nAlthough more than 800 complaints were filed and consolidated in this appeal, many of the causes of action are identical among the complaints. In the typical complaint, the first cause of action sounds in negligence; the second cause of action is for breach of warranty; the third pleads strict liability; and the sixth alleges willful and wanton behavior. There is no question that these four causes of action are completely state created and do not support federal question jurisdiction. The fourth and fifth causes of action are the only two that could possibly be considered federal causes of action. Typical is the complaint in Basalyga v. Merrell Dow Pharmaceuticals, Inc., No. C-1-84-1497. That complaint alleges jurisdiction based on both federal question and diversity jurisdiction:\n\nFOURTH CAUSE OF ACTION\n\n17. The Plaintiffs reallege and restate as if fully incorporated herein Paragraphs 1 through 16 and for their Fourth Cause of Action state as follows.\n\n18. That the applicable Federal law covering the manufacturing and distributing of drugs during the time period in controversy was the Federal Food, Drug and Cosmetics [sic] Act passed by the 7th [sic] Congress on June 25, 1938, and cited as 52 Stat 1040, as amended.\n\n19. That the purpose of 52 Stat 1040, among other purposes, was to prohibit the movement in Interstate Commerce of misbranded drugs.\n\n20. That per § 201(n) of 52 Stat 1040, the determination as to whether a drug is misbranded includes \"not only representations made or suggested by statement, word, design, device, or any combination thereof, but also the extent to which the labeling fails to reveal facts material in the light of such representations or material with respect to consequences, which may result from the use of the article to which the labeling relates under the conditions of use prescribed in the labeling thereof, or under such conditions of use as are customary and usual.\"\n\n21. That Defendant did not at any time during the time period in controversy, reveal or attempt to reveal any facts material to consequences which may result in the unborn offspring of mothers receiving the drug in question for indications relating to pregnancy.\n\n22. That pursuant to § 502(a) of 52 Stat 1040, a drug is deemed misbranded if its labeling is false or misleading in any particular.\n\n23. That pursuant to § 502(f)(2) of 52 Stat 1040, a drug is deemed misbranded unless its labeling bears \"such adequate warning against use in those pathologic conditions or by children where its use may be dangerous to health, or against unsafe dosage or methods, or duration of administration or application, in such manner and form, as are necessary for the protection of users.\"\n\n24. That pursuant to § 502(j) of 52 Stat 1040, a drug is deemed misbranded if it is \"dangerous to health when used in the dosage, or with the frequency of duration prescribed, recommended or suggested in the labeling thereof.\"\n\n25. That the promotion of said drug, Bendectin, by the Defendant for the use in females during the time period in controversy, without revealing or attempting to reveal any facts material to consequences which may result in the unborn offspring of mothers receiving the drug, constituted misbranding of said pharmaceutical drug per subsections (a), (f)(2) and (j) of § 502 and (n) of § 201 of 52 Stat 1040.\n\n26. That violation of said Federal Statutes in the promotion of said drug, Bendectin, by the Defendant herein enumerated, constitutes a rebuttable presumption of negligence.\n\n27. That the Defendant's violation of said Federal Statutes directly and proximately caused the injuries suffered by said Minor Plaintiffs and directly and proximately caused and will cause said Minor Plaintiffs to suffer considerable pain and suffering and to undergo continuous medical treatment, and the Adult Plaintiffs, as parents of the Minor Plaintiffs, were and will be caused to incur considerable medical and other expenses and to suffer anxiety and anguish, all to which the Adult Plaintiffs, as Next Friends and Guardians of the Minor Plaintiffs, have been damaged in the amount of Ten Million ($10,000,000.00) Dollars compensatory damages, and the Adult Plaintiffs Individually, have been damaged in the amount of Five Million ($5,000,000.00) Dollars compensatory damages.\n\nFIFTH CAUSE OF ACTION\n\n28. The Plaintiffs reallege and restate as if fully incorporated herein Paragraphs 1 through 27 and for their Fifth Cause of Action state as follows.\n\n29. The Defendant has made false and fraudulent representations of fact as to the safety, nontoxicity, and freedom from side effects of its product Bendectin and those representations were made under circumstances that the said Defendant knew or should have known that they were false, or alternatively, were represented to be true while said Defendant had no knowledge as to the truth thereof and the said Defendant stood to benefit financially by its misrepresentations, active and constructive. These representations were made in promotional literature, product inserts and by detailmen to prescribing physicians. By these representations the Defendant worked a fraud and deceit upon the consuming public, and more particularly, upon the Plaintiffs.\n\n30. The Defendant deliberately pursued a policy of non-disclosure with regard to adverse reactions attributable to the product Bendectin, especially, but not limited to, a number of reporting physicians, each reporting that a number of mothers who used Bendectin during pregnancy gave birth to physically deformed babies. The said Defendant thereby deprived the medical community and the public and the Plaintiffs of significant facts which, if known, would have permitted an informed judgement [sic] of the drug in light of the grave risks attending its use.\n\n31. The Defendant failed to submit all relevant data bearing on the safety of the drug Bendectin to the Food and Drug Administration, as required by law.\n\n32. That the acts and omissions of the Defendant, as aforementioned, directly and proximately caused the injuries suffered by said Minor Plaintiffs and directly and proximately caused and will cause said Minor Plaintiffs to suffer considerable pain and suffering and to undergo continuous medical treatment, and the Adult Plaintiffs, as parents of the Minor Plaintiffs, were and will be caused to incur considerable medical and other expenses and to suffer anxiety and anguish, all to which the Adult Plaintiffs, as Next Friends and Guardians of the Minor Plaintiffs, have been damaged in the amount of Ten Million ($10,000,000.00) Dollars compensatory damages, and the Adult Plaintiffs Individually, have been damaged in the amount of Five Million ($5,000,000.00) Dollars compensatory damages.\n\nMerrell Dow argues that plaintiffs employing this language did in fact allege a substantial federal claim based on an implied private right of action under the FDCA, even though later developments in the federal case law might have led to a contrary conclusion. Following a careful examination of the complaints and the record, including portions of the trial memorandum and pretrial conference transcript cited by plaintiffs, we agree. A straightforward reading of plaintiffs' complaints gives the undeniable impression that plaintiffs intended to allege an implied cause of action under the FDCA. As the Basalyga's complaint states: \"This Court has jurisdiction based on [28 U.S.C. § 1331] inasmuch as liability arising under a federal statute is alleged. . . . The Defendant failed to submit all relevant data bearing on the safety of the drug Bendectin to the Food and Drug Administration, as required by law, [which] . . . directly and proximately caused [plaintiffs'] injuries.\" Identical or similar express assertions of section 1331 jurisdiction appear in most if not all of the complaints in question. Moreover, unlike the parties in Merrell Dow v. Thompson, 106 S. Ct. at 3233; 106 S. Ct. at 3241 n.4 (Brennan, J., dissenting), the parties in the instant suit never conceded that there was no implied cause of action under the FDCA. In fact, contrary assertions were made by some of plaintiffs' counsel at various points during trial. Although strategically it may be profitable for plaintiffs' counsel now to argue that they never intended to plead an implied cause of action, the language of their complaints leads to an opposite conclusion. These plaintiffs went to trial in federal court intending to take full advantage of any ruling that an implied cause of action existed, no doubt intending as well to take advantage of a favorable verdict on the issue of causation if the jury could be persuaded by the evidence to return it.\n\nIn summary, we have concluded that, with the exception of the thirteen cases previously noted, all Ohio plaintiffs who originally filed their actions in federal court intended to invoke federal question jurisdiction based, at least in part, on an implied cause of action under the FDCA. It is also evident that under existing case law a sufficient basis for section 1331 jurisdiction existed to make binding on those plaintiffs the adverse verdict which actually resulted.\n\nAs the case law indicates, a substantial federal question is presented as long as the pleadings invoking federal question jurisdiction are not \"so attenuated and unsubstantial as to be absolutely devoid of merit,\" \"wholly insubstantial,\" \"obviously frivolous,\" \"plainly unsubstantial,\" or \"no longer open to discussion.\" Hagans v. Lavine, 415 U.S. 528, 536-37, 39 L. Ed. 2d 577, 94 S. Ct. 1372 (1974) (quoting Newburyport Water Co. v. Newburyport, 193 U.S. 561, 579, 48 L. Ed. 795, 24 S. Ct. 553 (1904); Bailey v. Patterson, 369 U.S. 31, 33, 7 L. Ed. 2d 512, 82 S. Ct. 549 (1962); Hannis Distilling Co. v. Baltimore, 216 U.S. 285, 288, 54 L. Ed. 482, 30 S. Ct. 326 (1910); Levering \u0026 Garrigues Co. v. Morrin, 289 U.S. 103, 105, 77 L. Ed. 1062, 53 S. Ct. 549 (1933); and McGilvra v. Ross, 215 U.S. 70, 80, 54 L. Ed. 95, 30 S. Ct. 27 (1909)). See Mt. Healthy City School District Board of Education v. Doyle, 429 U.S. 274, 279, 50 L. Ed. 2d 471, 97 S. Ct. 568 (1977) (\"jurisdiction is sufficiently established by allegation of a claim under the Constitution or federal statutes, unless it 'clearly appears to be immaterial and made solely for the purpose of obtaining jurisdiction'\") (emphasis added, citations omitted). The standard \"is easily met--an arguably plausible claim must be allowed to proceed.\" Robbins v. Reagan, 250 U.S. App. D.C. 375, 780 F.2d 37, 43 (D.C. Cir. 1985) (emphasis added). The test, according to Wright and Miller, is \"whether there is any legal substance to the position the plaintiff is presenting.\" 13B C. Wright, A. Miller \u0026 E. Cooper, Federal Practice and Procedure § 3564, at 67 (2d ed. 1984) (emphasis added, footnote omitted). Until this court or the Supreme Court holds that there is no implied private right of action under the FDCA, the opposite position cannot be deemed either frivolous or unsubstantial.\n\nA different analysis, however, may apply to those Ohio plaintiffs who originally brought suit in state courts. Since these plaintiffs invoked the jurisdiction of state and not federal court, it is perhaps unlikely, even where the language might arguably include an implied cause of action under the FDCA, that these plaintiffs intended to plead such a cause of action.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e In any case, even had the Ohio citizens filing in state court intended to plead an implied cause of action under the FDCA, 28 U.S.C. § 1447(d) precludes this court from reviewing the district court's remand on direct appeal. Gravitt v. Southwestern Bell Telephone Co., 430 U.S. 723, 52 L. Ed. 2d 1, 97 S. Ct. 1439 (1977) (per curiam).\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nFinally, defendant has conceded that thirteen cases filed by Ohio citizens in federal court are unique insofar as these plaintiffs failed to allege any substantial federal question in their complaints. See cases listed supra note 3. Since no federal question is alleged, we dismiss these thirteen cases without prejudice for lack of federal jurisdiction. Fed. R. Civ. P. 12(b)(1).\n\nIn summary, the thirteen cases brought by Ohio plaintiffs in which it is conceded that no federal question was alleged are dismissed without prejudice; and the cases brought by Ohio plaintiffs in federal court must be considered on the merits since we hold that the district court did have federal question jurisdiction.\n\nC. DAVIS PLAINTIFFS' DECISION TO OPT OUT\n\nThe Davis plaintiffs make the argument that they, too, are not bound by the district court judgment. Originally, these four plaintiffs brought suit in Arizona federal court. On February 1, 1984, these plaintiffs chose to participate in the joint trial in the Southern District of Ohio. On December 19, 1984, the district court, while allowing additional plaintiffs to opt in to the consolidated trials until February 1, 1985, ruled that previous decisions by out-of-state plaintiffs to participate in the common issues trial would be deemed binding. On January 25, 1985, these plaintiffs sought to opt out of the joint issues trial. The district court, consistent with its December 19 order, refused to allow plaintiffs to do so. Judgment was thus entered against them when the jury returned the verdict for defendant, despite their having indicated a desire to opt out. No doubt these parties would have fought to stay in had the jury finding been favorable to them.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nAfter the jury verdict, these defendants filed a motion to set aside the judgment because of their earlier expressed desire to opt out. The grounds for this motion were that the court could not enter judgment against them as a result of a trial that they had participated in without their consent. They argued that their decision to opt out was based on changes in the manner in which the court planned to try the common issues trial, including the exclusion of visibly deformed plaintiffs, trifurcation, prohibition of references to Thalidomide, and other issues of which they were not informed before the court's December 19 order making their previous election to participate binding. The district court denied this motion, in part because each of these plaintiffs had an opportunity to withdraw after the court changed its decision to trifurcate rather than bifurcate the case in May of 1984. The court also rejected plaintiffs' other arguments. These included some statements regarding the exclusion of plaintiffs that the court denied were ever made, and on the exclusion of references to Thalidomide. The plaintiffs could not have been ignorant of these matters when they made their decision to stay in the case after 1984. The district judge also noted that plaintiffs cited no legal authority to support their claim of entitlement to a second opportunity to opt out.\n\nOn appeal, these plaintiffs argue that had the court enabled them to opt out, the defendant would have suffered no prejudice. Therefore, it was an abuse of discretion for the district judge to refuse to allow them to opt out, especially since the court was willing to allow new plaintiffs to enter into the case after the opt-out date. Thus, the district judge would not know until after the opt-in process subsequently ceased, indeed until the trial itself, how many plaintiffs would be participating. The plaintiffs also argue that in the particular case of Davis, his alleged defect was dwarfism, which was not one of the specific defects the jury was to address if it found for plaintiffs on the first issue. This argument was raised for the first time in this appeal. It is in all events mooted by the jury's verdict that Bendectin did not cause any birth defects. Further, Davis continued to participate long after Judge Rubin indicated which specific defects the jury would decide Bendectin caused. Judge Rubin in fact provided these plaintiffs an opportunity to opt out of the trial after the trifurcation decision was made and held the option open for an additional eight months and until only a few months before the trial. Under such circumstances we cannot find that the district judge abused his discretion in denying this untimely motion.\n\nThe Davis plaintiffs also argue that the district judge could not apply Ohio law to them, because, since their complaints had been brought in Arizona federal court, only Arizona law could govern them. They maintain it would be impermissible to allow the court's procedural rule denying their opting out to cancel their substantive right to have the law of Arizona apply. Similarly, the Wood plaintiffs argue that the district court was required to apply the law of Texas to their claims. Although the Wood plaintiffs never filed a petition to opt out at any time, they argued that they should have been able to opt out because the district court could not apply Ohio law in deciding their claims. These arguments are not jurisdictional. If correct, the Davis and Wood plaintiffs would be entitled to a new trial, not dismissal. Further, the choice of law question applies to all non-Ohio plaintiffs. We therefore defer consideration of this conflict of laws argument to the next section.\n\nIII. GOVERNING LAW OF PROXIMATE CAUSATION IN CONFLICT OF LAWS CONTEXT\n\nBefore determining whether proximate causation should properly be considered a separate issue for purposes of Rule 42(b), it is necessary first to determine under which jurisdiction's law of proximate causation we are operating, At trial Judge Rubin applied the substantive law of Ohio to any case brought in Ohio, citing Erie, 304 U.S. 64, 82 L. Ed. 1188, 58 S. Ct. 817, and required all plaintiffs who transferred their cases to the Southern District of Ohio under MDL 486 and 28 U.S.C. § 1404 also to consent to have the liability issues tried in accordance with the substantive law of Ohio. Since the question of proximate causation was tried under the law of Ohio for all cases, and since the judge determined that the law of Ohio considered causation a separate issue from fraud, he prohibited the plaintiffs from introducing evidence that defendant had committed fraud in its submission to the FDA of test results regarding the safety of Bendectin. Because he found that fraud, even if proved, had no relation to the causation question under Ohio law, he concluded that the trifurcated case could proceed on the separate issue of causation.\n\nWhile we are in agreement with the result reached by Judge Rubin, our course of reaching that decision differs from his in one important respect which requires closer analysis. On appeal, those plaintiffs not represented by Plaintiffs' Lead Counsel Committee argue that Judge Rubin could not assign to them the burden of proof on the proximate causation question because the law of their home states would place this burden on the defendant. They argue that had the law of Ohio not been applied, and had there not been trifurcation, they could have proved a rebuttable presumption of negligence because of the defendant's violation of the FDCA, and the proof of that statutory violation would shift to the defendant the burden of proof regarding causation. They also argue that, as under Ohio law, the law of their home states would shift the burden of proof because of defendant's fraud. The alleged fraud they assert consisted of defendant's failure to report to the FDA the results of animal and human studies concerning Bendectin's propensity to cause birth defects. Even if Ohio law did not recognize this doctrine, it is argued by the Wood plaintiffs that the district judge was obligated to apply the law of Texas because Ohio's choice of law rules dictate that Texas law governs their claims, notwithstanding that the Wood plaintiffs originally filed their case in Ohio federal court. Since the law of Texas does not consider causation and liability to be separate issues in this type of case, they argue that the district court abused its discretion in trifurcating the claims brought by these Texas plaintiffs. They ask us to allow them to opt out of the common issues trial, presumably permitting them to have their case transferred to Texas and tried under the law of Texas, with the burden of proof upon the defendant.\n\nThe Davis plaintiffs, who filed originally in other states and then transferred their cases to the multidistrict litigation in the Southern District of Ohio, raise a slightly different argument. Rather than merely arguing, as do the Wood plaintiffs, that the district court could not force them to have their cases tried by the law of any state other than that which the conflicts rules of Ohio dictate, they assert that the district judge could not require that they submit to the law of any state other than that where the complaint was originally filed. The Davis plaintiffs claim that the law of Arizona should govern their case, and that since the district judge applied Ohio law, their case should be returned to Arizona to be tried under the law of Arizona, with the burden of proof upon the defendant in at most a bifurcated trial.\n\nIn response, defendant contends that the plaintiffs never argued at trial that they could not prove that Bendectin caused birth defects because the defendant concealed evidence of teratorgenicity.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Rather, defendant asserts that plaintiffs' argument was that the evidence was sufficient to prove that the drug caused all varieties of birth defects. Likewise, at trial the plaintiffs' own proposed instructions placed the burden of proof on themselves, contrary to lead counsel's assertion on appeal. Further, the plaintiffs themselves urged the district judge to apply the law of Ohio to this case, and never argued that any other law should apply. Those plaintiffs who transferred into the common issues trial had the unfettered discretion to accept the Ohio forum and the district court's previously announced decision to apply Ohio law, or to return their cases to the district in which they were originally filed.\n\nWe agree with Judge Rubin's conclusion that under Fed. R. Civ. P. 51 any objections that the instructions on causation were not couched in terms of Arizona or Texas law were waived when not made before the jury retired. Even if such a claim were construed as plain error, we observe that there was no showing that the law of these states differed in any material respect from that of Ohio. Out of caution, however, we inspect this issue more closely.\n\nThe Supreme Court has long held that a federal district court exercising diversity jurisdiction must apply the same conflict of laws rulcs that the state court would apply.\n\nThe conflict of laws rules to be applied by the federal court in [a state] must conform to those prevailing in [that] state['s] courts. Otherwise, the accident of diversity of citizenship would constantly disturb equal administration of justice in coordinate state and federal courts sitting side by side. . . . Any other ruling would do violence to the principle of uniformity within a state, upon which the Tompkins decision is based.\n\nKlaxon Co. v. Stentor Electric Manufacturing Co., 313 U.S. 487, 496, 85 L. Ed. 1477, 61 S. Ct. 1020 (1941) (citations omitted). \"[T]he conflict-of-laws rules to be applied by a federal court in Texas must conform to those prevailing in the Texas state courts. A federal court in a diversity case is not free to engraft onto those state rules exceptions or modifications which may commend themselves to the federal court, but which have not commended themselves to the State in which the federal court sits.\" Day \u0026 Zimmermann, Inc. v. Challoner, 423 U.S. 3, 4, 46 L. Ed. 2d 3, 96 S. Ct. 167 (1975) (per curiam).\n\nApplying Klaxon here, it is apparent that it is Ohio's conflict of laws rules that must normally determine which substantive state law should govern the rights of the parties. Although determining what law should apply is not altogether without doubt, the Ohio Supreme Court appears to have clarified the issue substantially in this past decade. In the most recent of a series of cases, Morgan v. Biro Mfg. Co., 15 Ohio St. 3d 339, 474 N.E.2d 286 (1984) (per curiam), the Ohio Supreme Court reaffirmed its intention to abandon a strict adherence to the traditional rule of lex loci delicti in favor of a more flexible rule based on which state has \"a more significant relationship to the lawsuit,\" id. at 289, in light of the factors set forth in section 145 of 1 Restatement (Second) of Conflict of Laws § 145 (1971).\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Morgan involved a product liability action against the manufacturer of a meat grinder. There the court concluded that even though the product was manufactured in Ohio and the defendant manufacturer was incorporated in Ohio, Kentucky had the most significant relationship to the parties since that is the state where the injury occurred, the plaintiff resided, and the workers' compensation benefits were determined, and § Kentucky was the state responsible for inspection of the condition and safety of the product for use in that state. As a basis for its holding, the court quoted both section 145 and section 6,\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e as incorporated in section 145, of the Restatement of Conflicts. It is thus apparent that the Supreme Court of Ohio recognizes the limitations of the lex loci delicti rule that are imposed by the broader considerations of sections 145 and 6 of the Restatement, since it quotes both of these sections in full. Morgan, 474 N.E.2d at 289 n.56.\n\nApplying here the flexible approach adopted in recent Ohio case law and codified in sections 145 and 6 requires an inquiry into which state possesses the most significant relationship. If this question cannot be determined, the law of the place of the injury controls. Id. at 289; 1 Restatement (Second) of Conflict of Laws § 146 (1971).\n\nThroughout this litigation there has been some discussion of the law of states in which non-Ohio plaintiffs are domiciled. We, however, see the law of the state of manufacture of the product as being more significant in this type of case than that of the state where an individual plaintiff happens to live. Merrell Dow manufactured and distributed a uniform drug internationally. The company issued a uniform set of warnings and instructions for use. The regulations governing the labeling, research, and distribution of the drug were governed either by Ohio law or by the federal Food, Drug and Cosmetic Act. Standards against which defendant's wrongful or negligent conduct may be measured are also set by Ohio and federal law.\n\nIn contrast, plaintiffs seem to allege either that their domicile states have a more substantial interest in the outcome of this litigation or that no state has a particularly substantial interest, and thus the law of the state of the place of injury should prevail. Both of these arguments fail, however. Domicile states do have a strong interest in the protection and well-being of their citizens, and the Restatement plainly regards domicile as one consideration in determining the existence of a substantial state interest. See id. § 145. Those plaintiffs who seek to apply the law of their state of domicile may also do so on the assumption that this is where the injury occurred. Such an assumption, however, is not at all clear, for the state of domicile at the time of suit may bear little or no relation to where a mother may have taken a morning sickness drug years before. A plaintiff presently residing in Arizona, for example, might nonetheless be found to have taken Bendectin while traveling in many different states. In short, it is difficult if not impossible to perceive any meaningful relationship to the subject matter of the lawsuit for the law of the state of domicile at the time of the suit, or the state in which the drug may have been prescribed, dispensed, ingested, or the state in which the child may have been conceived, or born. This is far different from the circumstances which led the Ohio Supreme Court to apply Kentucky law in Morgan. The application of the same principles which led the court to Kentucky law in Morgan points unmistakably to Ohio law here. The State of Ohio is responsible for regulating local aspects of the marketing, manufacture, distribution, and labeling of the drug, and thus the relationship between the parties is essentially centered in Ohio, where the tortious conduct and the safety of the product are regulated. The fact that federal regulation through the FDCA impacts pervasively upon the development and approval of the drug in question tends further to minimize the significance of the law of other states and to focus emphasis upon the state of manufacture as the state in which application of the federal standards and oversight is most likely to occur.\n\nThe choice of Ohio law is even more persuasive when we apply, as we must under Morgan, the factors set forth in section 6 of the Restatement: \"The needs of the interstate and international systems\"; \"the protection of justified expectations\"; \"the basic policies underlying the particular field of law\"; \"certainty, predictability and uniformity of result\"; and \"ease in the determination and application of law to be applied\" provide, in our judgment, a persuasive basis for holding that the more significant relationships were those of the place of manufacture. We therefore conclude that under Ohio conflicts law as applied to the circumstances of these cases, the substantive law of Ohio was properly applied to those parties over whom the district court had jurisdiction.\n\nOne final choice of law problem, however, remains. When a defendant transfers a case to another district under 28 U.S.C. § 1404, the Erie doctrine requires that the court apply the choice of law rules of the transferor state. Van Dusen v. Barrack, 376 U.S. 612, 637-39, 11 L. Ed. 2d 945, 84 S. Ct. 805 (1964). The holding of Van Dusen is that when a plaintiff files suit in a federal court with proper venue, and the defendant transfers it to a new federal court for convenience, the transferor state's law (including its conflicts law) applies. The Supreme Court noted that section 1404(a) was not designed to defeat the plaintiff's right to obtain the state law advantages that might accrue from the exercise of the venue privilege. Id. at 635. \"A change of venue under § 1404(a) generally should be, with respect to state law, but a change in courtrooms.\" Id. at 639 (footnote omitted). The Court expressly reserved the question whether section 1404(a) would require the application of the law of the transferor state when the plaintiff, rather than the defendant, seeks transfer under that statute. That is the situation here for the plaintiffs who voluntarily transferred their cases to the Southern District of Ohio after they had been originally filed in federal courts in other states.\n\n\"Although much can be said for applying the law of the transferee state when it is plaintiff who has moved, the cases increasingly seem to be applying the law of the transferor court regardless of which party moved for transfer if that court was proper in terms of venue and personal jurisdiction.\" 15 C. Wright, A. Miller \u0026 E. Cooper, Federal Practice \u0026 Procedure § 3846 at 367 (footnotes omitted). We have adopted the majority position on this issue.\n\nOnce a plaintiff has exercised his choice of forum by selecting a permissible forum, the state law of that forum should govern the action, regardless of the wisdom of the plaintiff's selection. Thus, no matter who seeks to transfer the action to a more convenient forum under § 1404(a), the state law of the forum in which the action was originally commenced remains controlling. In this manner, the outcome in the transferee district court will be the same as the outcome would have been in the state courts of the state where the action was originally brought.\n\nAccordingly, we conclude that the choice of law is dependent upon the nature of the transfer. If an action is transferred under § 1404(a), the state law of the transferor court should be applied.\n\nMartin v. Stokes, 623 F.2d 469, 473 (6th Cir. 1980). No true conflict exists, however, where another state's choice of law rules would have applied the substantive law of Ohio to this case.\n\nRather than attempting to analyze the conflict of laws rulcs of every state in the union, we will assume that the only state laws that could apply to any individual suit would be that of the state where the injury occurred or the plaintiff was domiciled, or that of Ohio, as those would be the only places with interests sufficient to have their law govern under prevailing conflict of laws theory. In short, the district court would not have committed error if the pertinent state choice of law rules commanded that the substantive law of Ohio apply. Likewise, if the laws of any other state were the same as Ohio's on the issue of proximate causation in this case, any error on the conflict question would be harmless, for it could not have adversely affected the court's decision of the plaintiffs' rights. Instead of analyzing each state's law, then, we consider whether the district court properly concluded that the plaintiffs must prove proximate causation in these cases under Ohio law, and then determine whether any case that the plaintiffs have cited to us, or any other source of law in other jurisdictions, holds that on the facts alleged here, proximate causation was not a separate issue. Because this issue is intimately interwoven with the challenge to the trifurcation order, we discuss it in the section that follows.\n\nIV. TRIFURCATION\n\nThe plaintiffs challenge the district judge's decision to trifurcate this case by trying only the issue of proximate causation. They maintain that trifurcation violates their due process rights and Seventh Amendment right to trial by jury, and thus renders the decision an abuse of discretion. While defendant argues that the plaintiffs cannot raise this challenge on appeal because they made no objection to trifurcation at trial, the record supports a finding that plaintiffs timely preserved their objection to this procedure.\n\nPlaintiffs raise many different arguments to support their claim that the district court judge abused his discretion in ordering trifurcation. First, they maintain that under the law of proximate causation as applied in this case, causation is not an issue capable of separation from issues of defendant's fraud, wrongful conduct, or negligence. Second, they object to the ruling because: the court's trifurcation decision came as a surprise and only after discovery had been completed; a different jury would have heard later stages of trial; proximate cause was a particularly difficult and improper issue to be independently decided by a lay jury; and trifurcation resulted in a sterile trial removed from plaintiffs' actual injuries. Third and finally, plaintiffs assert that the trifurcation ruling resulted in the exclusion of evidence that was vital to the determination of the single, causation issue.\n\nOf all the issues on appeal, the validity of the trifurcation ruling has been most troubling to us. We reiterate that the standard of review is abuse of discretion. \"The district court ha[s] broad discretion to order separate trials; the exercise of that discretion will be set aside only if clearly abused.\" United States v. 1071.08 Acres of Land, 564 F.2d 1350, 1352 (9th Cir. 1977). See also Parmer v. National Cash Register Co., 503 F.2d 275, 277 (6th Cir. 1974) (per curiam). \"The decision whether to try issues separately is within the sound discretion of the court. . . . Abuse of discretion exists only where there is 'definite and firm conviction that the court below committed a clear error of judgment in the conclusion it reached upon a weighing of the relevant factors.'\" Yung v. Raymark Industries, 789 F.2d 397, 400 (6th Cir. 1986) (citation omitted).\n\nThe standards for separating issues is set forth in the language of Fed. R. Civ. P. 42(b):\n\nThe court, in furtherance of convenience or to avoid prejudice, or when separate trials will be conducive to expedition and economy, may order a separate trial of any claim, cross-claim, counterclaim, or third-party claim, or of any separate issue or of any number of claims, cross-claims counterclaims, third-party claims, or issues, always preserving inviolate the right of trial by jury as declared by the Seventh Amendment to the Constitution or as given by a statute of the United States.\n\n\"The Advisory Committee Note to the 1966 amendment, though cryptic, suggests that . . . the changes in Rule 42 were intended to give rather delphic encouragement to trial of liability issues separately from those of damages, while warning against routine bifurcation of the ordinary negligence case.\" 9 C. Wright, A. Miller \u0026 F. Elliott, Federal Practice \u0026 Procedure, § 2388 at 280 (1971 \u0026 Supp. 1987). It cannot seriously be argued that this is a routine case.\n\nThe principal purpose of the rule is to enable the trial judge to dispose of a case in a way that both advances judicial efficiency and is fair to the parties.\n\nThe provision for separate trials in Rule 42(b) is intended to further convenience, avoid delay and prejudice, and serve the ends of justice. It is the interest of efficient judicial administration that is to be controlling, rather than the wishes of the parties. The piecemeal trial of separate issues in a single suit is not to be the usual course. It should be resorted to only in the exercise of informed discretion when the court believes that separation will achieve the purposes of the rule.\n\nId. at 279 (footnotes omitted). Neither Rule 42(b) nor the textual elaboration cited gives any precise guidelines for the trial judge in considering the propriety of ordering separate trials, probably because of the wide variety of circumstances in which it might come into play. Consequently, courts have adopted a case-by-case approach. \"Essentially, the question is one that seems to depend on the facts of each case, a matter to be determined by the trial judge exercising a sound discretion.\" Southern Ry. Co. v. Tennessee Valley Authority, 294 F.2d 491, 494 (5th Cir. 1961). \"In deciding whether one trial or separate trials will best serve the convenience of the parties and the court, avoid prejudice, and minimize expense and delay, the major consideration is directed toward the choice most likely to result in a just final disposition of the litigation.\" In re Innotron Diagnostics, 800 F.2d 1077, 1084 (Fed. Cir. 1986) (citation omitted). Courts, including our own, have measured trial court decisions to try issues separately by whether fairness was advanced in the particular case:\n\nWe add the caveat expressed in Frasier v. Twentieth Century-Fox Film Corp., 119 F. Supp.495, 497 (D.Neb. 1954) that separation of issues \"should be resorted to only in the exercise of informed discretion and in case and at a juncture which move the court to conclude that such action will really further convenience or avoid prejudice\" and observe further that \"[a] paramount consideration at all times in the administration of justice is a fair and impartial trial to all litigants. Considerations of economy of time, money and convenience of witnesses must yield thereto.\" Baker v. Waterman S.S. Corp. 11 F.R.D. 440, 441 (S.D.N.Y. 1951).\n\nMoss v. Associated Transport Inc., 344 F.2d 23, 26 (6th Cir. 1965).\n\nIn our case this same test applies to whether the decision is to try only one or more than one issue separately. Our opinion in In re Beverly Hills Fire Litigation, 695 F.2d 207 (6th Cir. 1982), approving trifurcation on the causation question, did not indicate any different standard of review than that applicable to bifurcation nor has our research led us to authority suggesting such a distinction. While few cases appear to have been trifurcated on the issue of causation,\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e there are nonetheless numerous cases that have tried an individual issue separately under circumstances that, had the issue been decided in favor of the plaintiff, the trial would have had more than two phases to it.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e In affirming a trial solely on the issue of the defense of statute of limitations, Yung v. Raymark, 789 F.2d at 400, we quoted Wright \u0026 Miller and held that \"Rule 42(b) is sweeping in its terms and allows the court, in its discretion, to grant a separate trial of any kind of issue in any kind of case.\" C. Wright, A. Miller \u0026 F. Elliott, supra, § 2389 at 284. It follows, therefore, that a decision to try an issue separately will be affirmed unless the potential for prejudice to the parties is such as to clearly demonstrate an abuse of discretion. Beverly Hills, 695 F.2d at 216.\n\nOf course, the subject for review is not the abstract question of trifurcation generally, but the appropriateness of trifurcation in the context of the litigation at hand. It is to the specific facts of this case that we must apply the 42(b) standards for separating issues.\n\nA. PROXIMATE CAUSATION AS A SEPARABLE ISSUE\n\nFundamental to plaintiffs' challenge of the trifurcation decision is their argument that the causation question in this case was not an issue which could be tried separately. In support of their claim, plaintiffs rely heavily on Gasoline Products Co. v. Champlin Refining Co., 283 U.S. 494, 500, 75 L. Ed. 1188, 51 S. Ct. 513 (1931). There, the Court held that \"where the practice permits a partial new trial, it may not properly be resorted to unless it clearly appears that the issue to be retried is so distinct and separable from the others that a trial of it alone may be had without injustice.\" The Court noted that the issue in that case could not be submitted independently of the others without creating jury confusion and uncertainty that would \"amount to a denial of a fair trial.\" Id. Many courts consider the issue's ability to be tried separately, and without injustice, to be the standard for determining whether the Seventh Amendment has been violated by conducting a trial only on that one issue. Thus, they apply the Gasoline Products standard to initial determinations whether a district judge properly ordered a separate trial in the first instance. Franchi Construction Co. v. Combined Insurance Co. of America, 580 F.2d 1, 7 (1st Cir. 1978). While Beverly Hills did not cite Gasoline Products, our court in Helminski v. Ayerst Laboratories, 766 F.2d 208, 212 (6th Cir. 1985), cited Gasoline Products as the standard for determining whether the issues of liability and damages in that case were sufficiently separable to justify a separate trial. See also In re Innotron Diagnostics, 800 F.2d at 1086 (separate jury trials appropriate where issues to be tried are \"distinct and separable\"). We affirm the appropriateness of the Gasoline Products standard to the context of Rule 42(b).\n\nUnder this standard, many courts have upheld cases bifurcated between liability and damages because the evidence pertinent to the two issues is wholly unrelated, and as a logical matter, liability must be resolved before the question of damages. See C. Wright, A. Miller \u0026 F. Elliott, supra, § 2390 at 296-97. By the same token, courts have refused to permit even bifurcation of liability and damages where these issues could not be tried separately. In C. W. Regan, Inc. v. Parsons, 411 F.2d 1379, 1388 (4th Cir. 1969), the court disapproved bifurcation because under the law of Virginia, liability and damages could not be divided when the separate and unconnected actions of several people may have produced the total damage.\n\nIn the present case, plaintiffs argue that the Gasoline Products standard is violated because under the current standards and presumptions set forth in Ohio law, the issue of causation cannot be separated from the issue of defendant's tortious conduct. In their assertion of the nonseparability of these two issues, plaintiffs cite various tort theories that shift the burden of proof to defendants before causation has been proven more probable than not or weaken plaintiffs' burden of proof with regard to causation.\n\nFirst, plaintiffs contend that in cases involving multiple possible causes, the courts must abandon any \"but for\" causation test in favor of the \"substantial factor\" test to be applied where plaintiff seeks to prove that the defendant's wrongful act is only one of several substantial factors bringing about the injury. Thus, it is argued, because the determination of wrongdoing affects which standard plaintiffs need prove, liability must be tried either before or contemporaneously with the determination of causation. Moreover, plaintiffs argue that the court should have charged the jury that the plaintiff need only show that Bendectin is a substantial contributing factor in causing birth defects and the burden of proof would then shift to the defendant to prove that Bendectin was not such a substantial factor.\n\nIn his decision denying plaintiffs' motion for judgment NOV or new trial, however, Judge Rubin held that the \"substantial factor\" test was not recognized in Ohio and refused to apply it under Erie. Instead, Judge Rubin instructed the jury in the following language:\n\nThe question you must answer is whether the plaintiffs established by a preponderance of the evidence that the ingestion of Bendectin at therapeutic doses during the period of fetal organogenesis is a proximate cause of birth defects?\n\nThe term \"proximate cause\" is defined as that which in a natural and continuous sequence produces an injury which would not have otherwise occurred.\n\nThis does not mean that the law recognizes only one proximate cause of an injury. Thee [sic] may be more than one proximate cause. There may be other factors that operate at the same time, either independently or together, to cause an injury. In such a case, each factor may be a proximate cause.\n\nIn order to conclude that Bendectin in therapeutic doses caused a specific category of birth defects, it is not necessary for you to find that all women who ingested Bendectin delivered children with birth defects.\n\nThe ingestion of Bendectin by a pregnant women [sic] in therapeutic doses and the subsequent delivery of a child with a specific birth defect standing alone is not evidence that Bendectin caused that defect.\n\nAt all times in your deliberations on causation, you must assume that Bendectin was ingested only in doses prescribed by physicians.\n\nIn re Richardson-Merrell, Inc. Bendectin Products, 624 F. Supp. 1212, 1263 app. D (S.D. Ohio 1985) (footnotes omitted).\n\nIn arguing that Judge Rubin's instructions were erroneous and that the substantial factor test should have been applied to the causation issue, plaintiffs cite various cases which they assert support the use of the test by Ohio courts, such as Cascone v. Herb Kay Co., 6 Ohio St. 3d 155, 451 N.E.2d 815 (1983). However, Cascone does not address the \"but for\" versus \"substantial contributing factor\" issue, but the quite different question whether an initial actor should be held liable for injuries caused by an intervening or superseding actor. The court there held that the initial actor could still be held liable if his conduct remained a substantial contributing factor to the injury. In this context, that is all \"substantial contributing legal cause\" refers to. Thropp v. Bache Halsey Stuart Shields, Inc., 650 F.2d 817, 821 (6th Cir. 1981). Under Cascone, even where there is an intervening actor, however, the first step of the proximate cause analysis is whether the original tortfeasor's negligence was an actual cause or a \"cause in fact\" of the injury. Id. at 821. Plaintiffs also cite Utzinger v. United States, 432 F.2d 485 (6th Cir. 1970), but again that case states the rule for an intervening agent. Cf. Hupp v. United States, 563 F. Supp. 25, 30 (S.D. Ohio 1982). To this we must add the observation that the plaintiffs never argued that Merrell Dow was an initial tortfeasor whose drug Bendectin caused birth defects because of the act of any intervening third party. The plaintiffs affirmatively alleged in their complaint and argued at trial that the drug itself was a direct cause of birth defects without the interference of any third party. Insofar as we can ascertain, the district judge's denial of plaintiffs' proposed instruction would have been proper under the law of any state.\n\nPlaintiffs also point to the substantial factor theory in section 432(2) of the Restatement (Second) of Torts, which holds that when \"two forces are actively operating, one because of the actor's negligence, the other not because of any misconduct on his part, and each of itself is sufficient to bring about harm to another, the actor's negligence may be found to be a substantial factor in bringing it about.\" Prosser and Keeton describe the substantial factor test as applied to two actors: \"When the conduct of two or more actors is so related to an event that their combined conduct, viewed as a whole, is a but-for cause of the event, and application of the but-for rule to them individually would absolve all of them, the conduct of each is a cause in fact of the event.\" W. Prosser \u0026 R. Keeton, The Law of Torts, § 41 at 268 (5th ed. 1984) (footnotes omitted). A review of the Restatement's own comment to section 432(2) indicates that it has no application here, however. The third illustration of that section's comment concerns two fires negligently set by the separate acts of two railroads. The two fires coalesced before reaching and subsequently setting fire to a third party's property. The normal spread of either fire would have been sufficient to burn the property, and the third party barely escaped from his house. Although in that situation the plaintiff would not need to prove \"but for\" causation, because he could not definitely say which of the railroads had caused the fire that damaged his house, he would have to prove that both fires could have caused the damage. In fact, the requirement under the substantial factor test of section 432(2) that plaintiff first prove that the conduct of each defendant, acting alone, was sufficient to be a possible proximate cause of the injury was set forth clearly in an Ohio case cited by plaintiffs themselves. Minnich v. Ashland Oil Co., 15 Ohio St. 3d 396, 398, 473 N.E.2d 1199, 1201 (1984) (\"no determination has been made as to whether either defendant committed a tortious act, or whether either defendant's act was the proximate cause of appellant's injuries. These issues must be decided by a trier of fact in order to apply the Restatement rule [433B].\").\n\nHere, plaintiffs' witness, Dr. Swan, testified that in some cases, a woman might have taken Bendectin while exposed to another agent that independently causes birth defects. Although this other agent might have been present, she testified that would not mean that the contribution of Bendectin to that birth defect would have been any less. She also testified that Bendectin might act synergistically with other drugs to produce birth defects. However, section 432(2) has no relevance to the case unless the plaintiffs can show that Bendectin by itself caused birth defects, which the jury verdict indicates they did not do. Had it been established that Bendectin could bring about the harm individually and had there been cases in which Bendectin had been administered while other independent causes of birth defects were operating, then section 432(2) could apply.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nWe conclude therefore that even if the cited Ohio cases were applied to the present case, plaintiffs would still have to prove \"but for\" causation rather than some weaker \"substantial factor\" standard.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e The substantial factor standard applies only to initial negligent actors in determining their liability in the face of action by a subsequent actor, or in determining causation between simultaneous actors, both of whose acts could have been \"but for\" causes of plaintiffs' injuries. For the same reasons that the plaintiffs' complaint would not have justified this instruction under the law of Ohio, it also would not have justified this instruction under the law of any other state, and we have been led to no other persuasive authority to the contrary.\n\nPlaintiffs also raise the argument that if causation had been tried simultaneously with their claims for breach of warranty and failure to warn, they would have had to prove merely that Bendectin increased the risk of birth defects, and not that it was a \"but for\" cause of them. They cite Tinnerholm v. Parke Davis \u0026 Co., 285 F. Supp. 432 (S.D.N.Y. 1968), aff'd, 411 F.2d 48 (2d Cir. 1969), in support of this position. However, Tinnerholm is distinguishable. There, a child received a vaccine which contained four antigens, one of which was whooping cough. He subsequently suffered a degenerative disease. At a bench trial the judge found with reasonable medical certainty that the whooping cough vaccine was a cause in fact of this degenerative disease. But to find liability under the breach of warranty, it was not sufficient that the degenerative disease could be caused by the vaccine. Rather, an implied warranty breach could occur only because by manufacturing the vaccine as it did, defendant increased the chances of contracting the disease. In short, the increased risk standard came into play only after it had been determined that the vaccine could have caused the disease. Similarly, plaintiffs here could not prevail on a breach of warranty claim absent proof that Bendectin could in fact have caused their birth defects. Even if defendant failed to warn potential users that Bendectin caused birth defects, such failure to warn would be inconsequential if Bendectin could not have in fact caused birth defects:\n\nAn act or an omission is not regarded as a cause of an event if the particular event would have occurred without it. . . . The failure to install a proper fire escape on a hotel is no cause of the death of a man suffocated in bed by smoke. The omission of crossing signals by an approaching train is of no significance when an automobile driver runs into the sixty-eighth car.\n\nW. Prosser \u0026 R. Keeton, supra, § 41 at 265 (footnotes omitted). Trifurcation did not deny plaintiffs the right to have the jury consider the increased the risk standards, because that standard could have applied only had the jury affirmatively answered the question that the district court posed.\n\nAt oral argument on appeal, counsel raised yet another argument: that the trifurcation order prevented the plaintiffs from showing alternate causation. Under alternate causation, the burden would have shifted to the defendant to prove that its negligence was not a proximate cause of the birth defects. If this argument applies, the district judge would have been bound to instruct the jury that defendant had the burden of proof, since a federal court in a diversity case must apply the state court's burden of proof rules. Palmer v. Hoffman, 318 U.S. 109, 117, 87 L. Ed. 645, 63 S. Ct. 477 (1943). According to the plaintiffs' complaints, however, not only would plaintiffs not have been entitled to an alternate liability instruction with the shifted burden of proof in a trifurcated trial; they would not have been entitled to such an instruction even at a unitary trial. The doctrine of alternate liability simply does not apply to the facts alleged here. Cases that apply this doctrine, such as Sindell v. Abbott Laboratories, 26 Cal. 3d 588, 163 Cal. Rptr. 132, 607 P.2d 924 (1980), and Summers v. Tice, 33 Cal. 2d 80, 199 P.2d 1 (1948), do so only when two or more defendants have been at fault, and one and only one caused the injury. Rather than dismissing for plaintiff's inability to show causation by a preponderance of evidence against any individual plaintiff, courts in this situation shift the burden of proof to the defendant to prove that he was not the negligent actor that caused the injury. This is codified in section 433B(3) of the Restatement:\n\nWhere the conduct of two or more actors is tortious, and it is proved that harm has been caused to the plaintiff by only one of them, but there is uncertainty as to which one has caused it, the burden is upon each such actor to prove that he has not caused the harm.\n\nAs the Restatement's comments to this subsection show, see for example comment (g), the rule is not applicable unless more than one defendant has been negligent. Here, however, the plaintiffs have sued only one defendant, Merrell Dow. That is the only actor whose conduct was alleged to have been negligent. Therefore, the doctrine of alternate liability, even if it has been adopted in states such as Texas, as Wood's attorney contends, does not apply to the one-defendant case.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nPlaintiffs raise an additional argument for shifting the burden of proof to defendant regarding proximate cause. They claim that proof of a violation of the FDCA would give rise to negligence per se under Toole v. Richardson-Merrell, 251 Cal. App. 2d 689, 60 Cal. Rptr. 398 (1967), and shift the burden to defendant to prove that Bendectin did not cause their injuries. Without trifurcation, they allege that some plaintiffs could have demonstrated negligence per se which would have enabled them to rely on a rebuttable presumption of causation based upon the violation of a statute designed to protect their safety. A cited example in support of this negligence per se argument is Haft v. Lone Palm Hotel, 3 Cal. 3d 756, 91 Cal. Rptr. 745, 478 P.2d 465 (1970), in which a father and son drowned in a motel swimming pool, cause unknown. Contrary to the requirements of a California statute, the motel owner had failed either to place a lifeguard on duty at the pool, or post a sign indicating that no lifeguard was on duty. The court allowed plaintiffs to sustain their initial burden of proof on the issue of causation by proving that the violation of the statutory lifeguard requirement had occurred. Then, the burden shifted to the defendant to show that its violation did not proximately cause the death. Since defendant had been negligent by violating the statute, and since the failure to provide a lifeguard greatly increased the chances that the drownings would occur, and since the facts suggested that a competent lifeguard would have prevented the deaths, the plaintiffs according to the court, had done all that they could to prove the requisite causal connection between the negligence and the accidents. When there exists a substantial probability that a defendant's negligence caused an accident, and \"when the defendant's negligence makes it impossible, as a practical matter, for plaintiff to prove 'proximate causation' conclusively, it is more appropriate to hold the defendant liable than to deny an innocent plaintiff recovery, unless the defendant can prove that his negligence was not a cause of the injury.\" Id., 478 P.2d at 476 n.19.\n\nOnce again, the negligence per se argument is inapplicable to the facts of this case. The case law and legal commentary on application of the negligence per se standard in similar cases reveal that to shift the burden of proof to defendants plaintiffs must not only prove that defendant violated a statute, but also must prove that plaintiffs harm fell within the risk proscribed by the statute, or that there is a substantial probability (not necessarily more probable than not, but at least reasonably conceivable) that the violation and injuries are causally related.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e In the present case we find that the plaintiffs' proof of causation between certain types of birth defects and defendant's misrepresentations and/or omissions in conducting research and labelling Bendectin is beyond the realm of common experience,\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e and thus plaintiffs would have been unable to shift the burden under the negligence per se standard even if violation of the FDCA was proved. While it is theoretically possible to envision a case where fraudulent research and mislabelling of a drug could, within the realm of common experience, be seen to cause serious injuries to purchasers following consumption, plaintiffs here have simply failed to present sufficient evidence to indicate substantial probability of a causal link between ingestion of the mislabelled drug and plaintiffs' injuries.\n\nAn additional issue that arises in considering the negligence per se argument, but which we do not address here, concerns whether Congress intended the FDCA to be used as a behaviorial standard in such cases. It is clear that whether a state chooses to recognize violations of its own statutes as negligence per se is purely a question of state law. Therefore, states like Ohio are perfectly free to apply the negligence per se doctrine to violations of its own pure food and drug law, Ohio Revised Code sections 3715.52 and 3715.64. Taugher v. Ling, 127 Ohio St. 142, 187 N.E. 19 (1933); Portage Markets Co. v. George, 111 Ohio St. 775, 146 N.E. 283 (1924); Schell v. Du Bois, 94 Ohio St. 93, 113 N.E. 664 (1916). However, the determination that a violation of a federal statute such as the FDCA will create state tort liability is not a matter solely of state law. A state's ability to use a federal statute violation as a basis for state tort liability and negligence per se depends on the intent of Congress, and not merely on the intent of the state. See W. Prosser and R. Keeton, supra, § 36 at 220-21. Thus, the congressional decision not to provide a private cause of action under the FDCA becomes quite important in considering the propriety of a state negligence per se action for violation of the FDCA. \"It may be that a decision by Congress not to create a private remedy is intended to preclude all private enforcement. If that is so, then a state cause of action that makes relief available to private individuals for violations of the FDCA is pre-empted.\" Merrell Dow v. Thompson, 106 S. Ct. at 3245 (Brennan, J., dissenting). The majority in that case also recognized that preemption might be a potential problem. Id. at 3236-37 (majority opinion). We recognize that a mere congressional intent to preclude a private right of action at the federal level for violations of the FDCA would not necessarily indicate that Congress intended to preclude a state remedy under a theory of negligence per se. We only observe that preemption could be yet another obstacle to plaintiffs' reliance on a theory of negligence per se.\n\nFinally, plaintiffs argue that the proximate cause standard itself was wrong, even if trifurcation of the issue was acceptable. It is alleged that under section 433B of the Restatement plaintiffs need not prove conclusively that Bendectin was \"but for\" cause of their injuries. Comment (b) to that section notes that the plaintiff is not required to prove his case beyond a reasonable doubt and that, therefore, he need not eliminate all possibility that the defendant's conduct did not cause his injury. He need only introduce sufficient evidence for a reasonable person to decide that it was more likely that the injury was caused by the defendant than that it was not. If, as a matter of ordinary experience, a particular act would be expected to produce a particular result, and that result has in fact occurred, the jury might be justified to conclude that the causal connection exists. This would be so even though the plaintiff has not proven that but for the defendant's act, his particular injury would not have occurred.\n\nSection 433B has its roots in Judge Learned Hand's opinion in Zinnel v. United States Shipping Board Emergency Fleet Corp., 10 F.2d 47, 49 (2d Cir. 1925). That case involved the death by drowning of a seaman. The owner of the ship did not provide ropes in the ship that might have been used to rescue drowning sailors. The circumstances of death were such that the plaintiff could not prove that had the defendant provided the rope the decedent would have survived. Although the plaintiff could not prove \"but for\" causation of the injury by the defendant's negligence, Judge Hand allowed recovery because the jury could rely on its common experience that had the rope been provided the result would have been more likely than not that the sailor would not have drowned.\n\nIn comment b of section 433B of the Restatement, three illustrations demonstrate the circumstances under which an alternate jury instruction for causation may be employed. In each of these examples, the element of common experience is vital to the finding of causation. In the present case, however, the linkage between ingestion of the drug and the birth defects is simply not supplied by common experience, and thus the implicit prerequisite for an alternate jury instruction under section 433B is missing. Furthermore, our review of the case law reveals no court that has extended comment b of section 433B to allow for an alternate jury instruction in toxic tort cases.\n\nB. TRIFURCATION AS A POTENTIAL SOURCE OF UNFAIR PREJUDICE\n\nPlaintiffs also argue that the decision to trifurcate the trial was an abuse of discretion because the ruling unfairly prejudiced presentation of their case in a variety of ways. First, one of the plaintiffs' attorneys alleges that the decision to trifurcate was rendered after discovery had been completed and allowed him only two months to reorganize depositions and videotape testimony for a trial limited to the issue of proximate causation. Factually, this claim is inaccurate. Plaintiffs actually had ten months to revise the videotape depositions. The trial was postponed from June 1984, two months after the decision to trifurcate, to February 1985 because of the settlement negotiations. Plaintiffs argue that not all of this additional eight months could be used to reorganize the materials for trial, due to the settlement negotiations. While settlement discussions often dull the edge of advocacy, they do not provide a legal excuse for failure to continue preparations for trial. Had counsel for plaintiffs genuinely feared prejudice, they could have made a request to reopen discovery. While they claim on appeal that they did make such a request, the record does not support it. The plaintiffs further argue on appeal that the testimony of their witness, Theirsch, became unintelligible as a result of the removal of noncausation liability evidence. Our examination of Theirsch's testimony, including the specific page references cited to us, satisfies us that his testimony was intelligible despite its editing to eliminate references to liability. Plaintiffs had ample time in which to rearrange their proof, and they never requested more. The care and legal skill demonstrated in their advocacy leads us to conclude that they perceived no prejudice in fact from the amount of time available to them to reform their strategy. Neither do we.\n\nThe plaintiffs also challenge the trifurcation order because even had they won this stage of the trial, the court gave no assurance that the same jury that heard the evidence on causation, and rendered them a favorable verdict, would decide the question of liability. Plaintiffs' attorney Chesley specifically repeated this assertion at oral argument. The facts are otherwise. In Mr. Chesley's presence, the district judge indicated \"that if the plaintiffs prevailed . . . the same jury [would] be used for the next phase of the trial.\" Judge Rubin did, however, offer to impanel a new jury if both sides so requested. No objection was raised to either comment, and, in fact Mr. Chesley explicitly indicated that it would \"not [be] impossible to seat a new jury.\" Even had such a procedure been contemplated, and we emphasize that it was not, the party challenging such a procedure was willing to accept it below. In his argument on behalf of plaintiffs on appeal, Professor Arthur Miller acknowledged that there is no constitutional prohibition against trying these issues before different juries. Cf. 9 C. Wright, A. Miller \u0026 F. Elliott, supra, § 2391 at 302.\n\nPlaintiffs' next challenge the decision to trifurcate on the proximate causation question because the issue trifurcated was the one which a lay jury would be least qualified to understand, evaluate, and decide. The district judge offered to try the case before a blue ribbon jury, but the plaintiffs rejected the idea. This was, of course, their right. In any event we conclude that if the issues were indeed difficult, their resolution was not rendered more difficult due to trifurcation. If anything, the narrowing of the range of inquiry through trifurcation substantially improved the manageability of the presentation of proofs by both sides and enhanced the jury's ability to comprehend the causation issue.\n\nPlaintiffs' primary argument against trifurcation as unfairly prejudicial is that trying the question alone prejudiced plaintiffs by creating a sterile trial atmosphere. In Beverly Hills, we addressed similar concerns that trifurcation could possibly prevent the plaintiffs from exercising their right to present to the jury the full atmosphere of their cause of action, including the reality of injury:\n\nA strong argument can, it is true, be made against the bifurcation of a trial limited to the issue of causation. There is a danger that bifurcation may deprive plaintiffs of their legitimate right to place before the jury the circumstances and atmosphere of the entire cause of action which they have brought into the court, replacing it with a sterile or laboratory atmosphere in which causation is parted from the reality of injury. In a litigation of lesser complexity, such considerations might well have prompted the trial judge to reject such a procedure. Here, however, it is only necessary for us to observe that the occurrence of the fire itself, a major disaster in Kentucky history by all standards, was generally known to the jurors from the outset. Further, the proofs themselves, although limited, were nonetheless fully adequate to apprise the jury of the general circumstances of the tragedy and the environment in which the fire arose. As a result, we hold that the trial judge did not abuse his discretion in severing the issue of causation here.\n\nBeverly Hills, 695 F.2d at 217. Judge Rubin considered this language when he denied the plaintiffs' motion for a new trial. On appeal plaintiffs also rely heavily on the same language.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e Sterility is not necessarily the inevitable consequence in a trifurcated trial merely because the jury may not hear the full evidence of defendant's alleged wrongdoing. It more properly refers to the potential danger that the jury may decide the causation question without appreciating the scope of the injury that defendant supposedly caused and without the realization that their duties involve the resolution of an important, lively and human controversy. It is with respect to this latter concern that the plaintiffs urge that they were unfairly prejudiced by the trifurcation. The record reveals that the district judge consciously worked to avoid the potential for unfair prejudice. For example, he instructed the jury:\n\nLet me suggest to you that what you are about to do may be one of the most important things you will ever do in your entire entire [sic] life. This is a significant case. It involves a lot of people. It involves not only the plaintiffs who are individuals, it involves people, scientists, people who have done experiments, people who are employees of the defendant company. The totality of this case involves people and while you will hear technical evidence, I do point out to you that at all times, you should keep in mind that on both sides, there are people involved.\n\nThe court was not alone in efforts to avoid the dangers of sterility. In his final argument, plaintiffs' attorney Eaton told the jury that the trial was not an academic exercise, and that the case involved many real people who sought justice, and who would, as children, be affected by the jury's verdict well into the next century.\n\nFinally, plaintiffs argue that Judge Rubin failed to consider the caveats of Rule 42(b) in his trifurcation decision, and instead justified trifurcation only upon unsubstantiated claims of judicial efficiency, thus unduly prejudicing plaintiffs' case without good reason. We believe, however, that the district judge carefully made the necessary inquiry. In his final order the trial judge noted that Bendectin litigation could \"substantially immobiliz[e] the entire Federal Judiciary. There have been only four cases involving Bendectin which have been individually tried. They required an average of 38 trial days.\" In re Bendectin, 624 F. Supp. at 1221. Judge Rubin calculated that if all 1100 cases were tried at that average length on an individual basis, they would be able to keep 182 judges occupied for one year. Id. at n.6. Contrary to the plaintiffs' claims that Judge Rubin never considered the language of Rule 42(b), he did correctly require plaintiffs to prove that the defendant's drug caused their injury, and would not allow plaintiffs to buttress a weak causation case with a strong negligence case. Thus, in line with the language of Rule 42(b), the trial judge considered the causation question to be a separate issue.\n\nIn reviewing the district court's decision to trifurcate we further note Rule 42 which \"giv[es] the court virtually unlimited freedom to try the issues in whatever way trial convenience requires.\" C. Wright, A. Miller \u0026 F. Elliott, supra, § 2387 at 278. Thus, a court may try an issue separately if \"in the exercise of reasonable discretion [it] thinks that course would save trial time or effort or make the trial of other issues unnecessary.\" Richmond v. Weiner, 353 F.2d 41, 44 (9th Cir. 1965). In this case, the district judge considered the time savings in trying this case in this fashion, and surmised that if the plaintiffs won on this issue, another eight weeks of trial would be necessary to resolve the other questions.\n\nMany courts have in fact permitted separate issue trials when the issue first tried would be dispositive of the litigation. The courts do so because the efficiency of the trial proceedings is greatly enhanced when a small part of the case can be tried separately and resolve the case completely. For example, in Yung v. Raymark,789 F.2d at 401, we recently approved the separate trial of the issue of statute of limitations because if that issue were resolved to bar recovery, the court would be spared the necessity of trying liability and damages. \"Whether resolution of a single issue would likely dispose of an entire claim is extremely relevant in determining the usefulness of a separate trial on the issue. This procedure should be encouraged because court time and litigation expenses are minimized.\" Id. (citation omitted). The defendant relies heavily on language like this. As the defense correctly observed: \"The plaintiffs can never win a case if they can't prove the drug, caused the problem. That is the central issue in this case.\" And later, \"all claims depended upon the answer to a single question. Does Bendectin, taken in therapeutic doses cause birth defects?\" Plainly, Judge Rubin had a massive case management problem to resolve, and chose to do so by trying the case on a separate issue that would be dispositive.\n\nC. CLAIMS OF PREJUDICE RESULTING FROM EXCLUSION OF EVIDENCE BEARING ON CAUSATION\n\nWhile we have held that proximate causation is a separate legal question, that trifurcation did not unfairly prejudice more general aspects of plaintiffs' case, and that trifurcation furthered economy in this case, we must still consider whether trifurcation unduly prejudiced plaintiffs by restricting the evidence they could bring forth in proving the proximate causation issue.\n\nFirst, plaintiffs argue that this format prejudiced them because it precluded them from introducing evidence about the individual circumstances of different plaintiffs concerning their ingestion of the drug. Although the record on this point is not completely free of doubt, the court did not exclude all evidence of the effect of the drug on individual plaintiffs. The plaintiffs stated that they intended to have Dr. Done testify about individual cases, and it is significant in our view that the court denied the defendant's motion to preclude such testimony. The plaintiffs never offered such testimony, and they were not precluded from doing so. Thus, there was no evidence offered that individual circumstances in ingesting Bendectin had any causal relationship to birth defects, even though the district judge allowed plaintiffs to introduce evidence of individual differences. Plaintiffs' argument, asserted repeatedly at oral argument and in their briefs, that the district judge precluded factual testimony is also not supported by the record. Factual testimony was permitted on rebuttal, and plaintiffs chose to subpoena only one factual witness. We can only conclude that their decision was tactical. We perceive no reversible error in this regard.\n\nPlaintiffs also assert on appeal that they were unable to argue that there was a genetic susceptibility to Bendectin that varied among individuals, and that the jury should have been so instructed. The plaintiffs were not precluded from arguing that there was an individual susceptibility to Bendectin, but all their witnesses testified only that there were individual genetic susceptibilities to drugs in general. No one testified that there was such a susceptibility to Bendectin. Judge Rubin therefore correctly advised counsel that if the plaintiffs argued to the jury that there was such an individual susceptibility to Bendectin, he would have to instruct the jury that there was no evidence to that effect.\n\nProbably the plaintiffs' most serious charge is that the trifurcation format prevented them from challenging the validity of various studies that the defendant relied on in support of its position that Bendectin did not cause birth defects. For example, at oral argument plaintiffs' counsel represented that while plaintiffs could attack part of the Bunde-Bowles study defendant had used to justify the safety of Bendectin, most of the study could not be criticized because of limitations placed upon counsel by the court. Also, co-counsel alleged at oral argument that when the defendants relied on a particular study, the plaintiffs tried to cross-examine these studies' methodology and biases, but the district judge prevented this line of inquiry because of the trial's limitation to causation. These assertions would be potentially serious except that they are not supported by the record.\n\nFor example, the plaintiffs complain that they could not show criminal conduct and fraud in the preparation of the Bunde-Bowles study. It is true that the district judge would not allow testimony going to the fraudulent preparation of this study, but he did not preclude proof affecting the accuracy of test results indicating that Bendectin did not cause birth defects. Although a fraudulent motive might be more dispositive of the value of a study, it is also in most cases a prejudicial and inaccurate gauge of how incomplete a scientific study actually is. Instead the most effective way to discredit these studies is through a critique of their technical flaws, as was done here.\n\nSimilarly, plaintiffs challenge the inadmissibility of a portion of a letter prepared by one of the testers in Merrell's 1970's study, the Smithells study. Specifically, the plaintiffs wanted to introduce a letter written by Smithells to Merrell Dow that mentioned his hope that publication of his study would save the defendant large sums of money defending California litigation. The district judge refused to admit this letter. He said that this went to classical bias of the person conducting the study, and not scientific bias that would go to whether the study was actually accurate. As long as the methodology was correct, the fact that somebody might have intended to use the results in a particular way would be of no consequence. Additionally, the trial judge held that any reference to this sort of bias could create the potential for undue prejudice to defendant. We see this narrow ruling as merely a careful balancing of the factors of relevancy and prejudice under Fed. R. Evid. 403.\n\nMoreover, while plaintiffs were unable to introduce the letter from Smithells regarding assistance to the defendant in its California litigation, they remained free to attack any methodological flaws of that study, and they did. Dr. Swan testified that the Smithells study had no internal control group, and did \"not contribute meaningfully to the body of literature.\" She further testified, despite the inadmissibility of the letter, that the Smithells letter itself would lead her to remove the study on the grounds of bias. Plaintiffs' attorney Bleakley also cross-examined defendant's witness Dr. Hall regarding the Smithells study.\n\nPlaintiffs were similarly afforded broad latitude in their efforts to prove that various other studies by the defendant were false. Much of plaintiffs' efforts in this regard were focussed on discrediting the Bunde-Bowles study. For example, Dr. Done testified that Bunde-Bowles was \"a poorly designed study, and one really destined not to be likely to provide very useful information.\" He indicated that the numbers in the Bunde-Bowles samples were too small, that the controls were not matched for age or for other drugs, and that the study suffered from poor record keeping. Dr. Done also testified that the Bunde-Bowles data were suspect because the test found fewer malformations in the treated group which might suggest a protective effect for the drug, while there was no reason that a pharmacist would expect this to happen. He further testified that patients who were supposed to have used Bendectin, i.e., the experimental group, may not have in fact ingested it because there was nothing to record that they had ever been administered the drug. He testified that from looking at the original patient records, he could not be sure whether the patients alleged to have taken Bendectin actually did. Moreover, some patients were included as both Bendectin takers and controls. \"There were enough of them to make the entire contribution from that particular practice to this study have [sic] to be very seriously questioned.\" Dr. Done stated that if someone were to eliminate what he thought were the suspect data in Bunde-Bowles, instead of producing a 50% greater relative risk for birth defects among the control group than among Bendectin users, there would be rather a 30% higher risk for those who had taken Bendectin. Dr. Done further testified that the Bunde-Bowles study may not have used a normal population group and that this might have been particularly a problem if the control group was not similar in its preselection criteria. He highlighted the fact that many of the survey participants had come from one doctor's practice. Finally, he said \"that from the scientific standpoint, the [Bunde-Bowles] study is totally worthless.\" Dr. Swan also criticized the study. She said that the study was incapable of detecting a relative risk for limb reductions that was smaller than sixfold. She also criticized the sample size in the Bunde-Bowles study. Defendant, of course, vigorously contested these assertions.\n\nJudge Rubin specifically told the plaintiffs that, \"if a witness has relied upon a study and it is demonstrably inaccurate, false, you are entitled to develop that in cross-examination.\" Thus the plaintiffs not only attacked Bunde-Bowles in direct examination of their own witnesses, but they also attacked Bunde-Bowles when cross-examining the defendant's witnesses. For example, plaintiffs' attorney Skinner cross-examined defendant's witness Dr. McClain about the Bunde article. The plaintiffs also criticized Bunde-Bowles in their closing arguments. For example, one of plaintiffs' attorneys, Mr. Eaton, admitted that plaintiffs had been able to criticize the Bunde-Bowles study:\n\nTHE COURT: The Bunde-Bowles study you have done in great detail to show its unreliability. This isn't brand new.\n\nMR. EATON: We haven't even started to show how unreliable the study is, because we haven't been allowed toe.\n\nTHE COURT: I don't think that's true. Look, Mr. Eaton, be very careful what you are saying, because the Bunde-Bowles study has been referred to in this case, and I am unaware of any portions of it that you weren't allowed to use. I think there's an inference in the record here that I don't appreciate.\n\nMR. EATON: Please, forgive me, Your Honor, I certainly -- the only thing I was referring to yesterday, we -- this is all I was taxing about -- that weren't allowed to introduce the actual evidence, and I don't want you to think for a moment, Your Honor, that there was anything inferred [sic] beyond that.\n\nIn the context of the record, Mr. Eaton was only referring to the Court's prior ruling disallowing introduction of the original patients' records used in the Bunde-Bowles study due to a lack of foundation with the expert witness. Nonetheless, on appeal, the plaintiffs seek to create the same impression that the district judge so objected to below. It is quite clear that the plaintiffs were able to thoroughly attack the methodology and technical inadequacies of the Bunde-Bowles study.\n\nThere were also criticisms of various other studies defendant had relied on to show that Bendectin did not cause birth defects. Dr. Done criticized the animal studies, as \"not sufficient enough or adequate enough for me to accept them as indicating the lack of showing of teratogenicity.\" He also criticized the Research Triangle study, the McBride study, and the Hendricks study. Dr. Swan commented that the Correy and Newman study lacked an internal control group. She noted that the Milkovich and Vandenburg study was unable to detect a minimum risk smaller than twelvefold. She made a similar criticism of the Heinonen-Shapiro publication, and said that most of this study was inconclusive. Dr. Melnick criticized the methodology of the Staples study. While defendant objected, on the ground that \"what they are really doing is attempting to show negligence in regard to the way that this test was done,\" the district judge overruled this objection. Dr. Melnick also criticized animal studies that the defendant conducted in 1966 and 1975. The plaintiffs cross-examined defendant's witness Dr. Holmes about the study that he undertook with Dr. Jick. On rebuttal, plaintiffs' factual witness Petrow criticized a 1963 rabbit study, the Staples study, and 1966, 1967, and 1975 animal studies. And, in his closing argument, Eaton criticized various studies of the defendant, including Staples, and the 1966 animal studies. In sum, plaintiffs would have us hold that their failure to persuade the fury resulted from the district judge's improper preclusion of evidence. It did not. The issue of causation was thoroughly and skillfully presented by both sides.\n\nD. CONCLUSION\n\nTo summarize, the three considerations we apply in reviewing a decision to try an issue separately are (1) whether the issue was indeed a separate issue, (2) whether it could be tried separately without injustice or prejudice, and (3) whether the separate trial would be conducive to judicial economy, especially if a decision regarding that question would be dispositive of the case and would obviate the necessity of trying any other issues. We hold that since the initial trial on the proximate causation issue was a separate issue, promoted efficiency, and did not unduly prejudice plaintiffs, trifurcating this case on the separate issue of proximate causation was proper. We need not decide whether this was the best or even the only good method of trying this case. We need only determine whether, under all of the circumstances before him, the trial judge's decision to trifurcate was an abuse of discretion.\n\nWhile Ohio tort law does govern all suits originally filed in Ohio state courts or in federal courts located in Ohio, under our previous conflict of laws analysis, it is not clear that Ohio tort law would apply to those claims filed initially in other states or federal courts outside of Ohio, which were subsequently transferred to Ohio. Based on the cases cited by plaintiffs and a thorough search of the literature on causation however, we are not persuaded that the law in any American jurisdiction would preclude separation of the issues of causation and culpability in such complex cases as the present one. Therefore, we conclude that the district judge did not abuse his discretion in determining to try causation as a separate issue as to all plaintiffs over which that court had jurisdiction.\n\nV. GENERAL EVIDENTIARY QUESTIONS\n\nAlthough the district judge's decision to trifurcate the case on the issue of causation was proper, plaintiffs raise specific evidentiary objections to his rulings regarding the admissibility of certain evidence, or the preclusion of their ability to make certain references at trial. The range of discretion contemplated by Rule 42(b) makes such issues inevitable where less than the entire lawsuit is tried.\n\nOne evidentiary challenge that the plaintiffs raise concerns the defendant's ability to argue that it has complied with all FDA statutory and regulatory requirements, while the plaintiffs were precluded from introducing evidence tending to show that the defendant deceived the FDA regarding the validity of their test results. Despite plaintiffs' allegations, however, FDA approval of Bendectin was not allowed to be admitted. The trial judge indicated this was to benefit plaintiffs, because they did not have to make an additional argument that the tests that the FDA relied on were inadequate. Nonetheless, defense attorney Woodside did say in his opening argument, \"Now, it's important to understand that Merrell followed the rules completely as it pertains to the submission of the MDA and submission of data to the Food and Drug Administration.\" In fact, that issue had already been injected by plaintiffs' attorney Eaton when he mentioned that the FDA had not effectively monitored the testing of this drug. Eaton also asserted that the FDA would not have approved it had they known the facts of the testing. However, at trial, Judge Rubin scrupulously indicated that he would not allow either side to address the issue of FDA approval. For example, when defendant's witness Newberne, unprompted by the defense attorney, referred to the FDA a few times, the district judge twice told the defendant's attorney, \"tell your witness not to refer to the Food and Drug Administration.\" The plaintiffs also challenged introduction of testimony by defense witness Goddard, a former FDA commissioner, because this would allegedly imply that he and the FDA had approved the safety of the drug. The judge, however, drew a distinction, and said he would not allow testimony regarding FDA approval or lack of approval. He told the defense attorney to let him know if FDA compliance would come up in the testimony. However, the plaintiffs asked this witness about the FDA anyway. They introduced his appointment book as FDA commissioner, and then the judge indicated that they had opened the FDA door:\n\nMr. Eaton, any reference to the FDA is potentially harmful to you and helpful to the defendant. It was in an effort to protect the plaintiffs that I have ruled that that could not be admitted, that the FDA is a collateral matter. . . . I thought I was protecting the plaintiffs against any inference that the FDA assisted Bendectin or that they can gain benefit from it. This is a witness that I recognized had some dangers, and I thought I was being very careful. But if you elect to raise the question, as you are doing, of his services with the FDA on a day-to-day basis, then the shield no longer exists, and I will take their questions on redirect on a question-by-question basis.\n\nThus, the district judge carefully prevented any references to FDA approval from entering the trial itself, and neither side raised the FDA until the plaintiffs did so late in the course of the trial. The record offers no support for plaintiffs' claim that a one-sided advantage was given to the defendant to argue that the FDA had approved its drug, while the plaintiffs could not argue to the jury that this approval had been procured through fraud.\n\nThe plaintiffs also challenged the district judge's prevention of references to the drug Thalidomide. This was a drug tested in the early 60's by the defendant, although it did not produce it. The drug was administered to pregnant women, and produced large numbers of birth defects, specifically fin-like structures on many babies. The public outcry from this drug led to strict amendments to the FDCA in 1962. See S. Rep. No. 1744, 87th Cong., 2d Sess., reprinted in 1962 U.S. Code Cong. \u0026 Admin. News 2884, 2905-2907 (views of Senators Estes Kefauver, John A. Carroll, Thomas J. Dodd, Philip A. Hart, and Edward V. Long). The district judge determined to exclude any reference to Thalidomide by name at trial because the potentiality for creating prejudice substantially outweighed any relevancy considerations. The plaintiffs claim that many of their experts obtained their credentials in the field of teratogenicity from dealing with Thalidomide, and the preclusion of reference to this fact harmed their case. Plaintiffs further argue that many of the tests that the defendants relied on to prove that Bendectin did not cause birth defects also failed to show that Thalidomide caused them, and thus they should have been allowed to refer to Thalidomide by name.\n\nThe objections of the plaintiffs and the trial court's response to them are set forth in detail in its published opinion denying plaintiffs' motions for judgment NOV and for new trial. In Re Richardson-Merrell, Inc. Bendectin Products, 624 F. Supp. 1212, 1236-1237 (S.D. Ohio 1985). The record demonstrates that the trial court administered its Fed. R. Evid. 403 ruling evenhandedly. For example, Judge Rubin instructed the jury to disregard the question and answer when defendant's counsel Woodside questioned Dr. McMahon about an analogous drug (referring to Thalidomide), even though no reference had been made to that drug. Early in the trial the judge showed some willingness to permit reference to Thalidomide by plaintiffs' attorneys who told him that an article that the defendant wanted to introduce said that Thalidomide was not a teratogen. The judge indicated he would allow this reference, but that he would not allow Merrell Dow to be tied to Thalidomide since it had not manufactured it (it had, however, researched and tested it). The judge then learned that the article did not actually say that Thalidomide was not a teratogen, however, and he thereupon refused to allow the plaintiffs to refer to Thalidomide in that context. Moreover, Judge Rubin allowed references to the defendant's studies' inability to detect that Thalidomide was a teratogen, although he would not allow reference to Thalidomide by name. For example, Dr. Newman testified for the plaintiffs that some of the studies had failed to miss \"very powerful substances, maybe the most powerful teratogen known to man.\" Dr. Melnick testified that one of the studies did not indicate that \"the most devastating teratogen that we know\" was missed by rat studies until the defects were found later in humans.\n\nWe review the judge's decision to exclude a reference to Thalidomide on Fed. R. Evid. 403 grounds under the following standard:\n\n\"If judicial self-restraint is ever desirable, it is when a Rule 403 analysis of a trial court is reviewed by an appellate tribunal. . . . The draftsmen intended that the trial judge be given a very substantial discretion in 'balancing' probative value on the one hand and 'unfair prejudice' on the other, and that he should not be reversed simply because an appellate court believes that it would have decided the matter otherwise. . . .\"\n\nUnited States v. Zipkin, 729 F.2d 384, 390 (6th Cir. 1984), quoting United States v. Long, 574 F.2d 761, 767 (3d Cir. 1978). Under this standard of review, we uphold Judge Rubin's determination that references to Thalidomide would be extremely prejudicial. We do not believe that plaintiffs were hindered by prohibition of references to Thalidomide. The credentials of the plaintiffs' expert were presented to the jury in the same manner as the defendant's experts were.\n\nAnother objection concerns the district judge's repeated references to defendant's attorney as \"Dr.\" Woodside. The plaintiffs argue that this gave an unfair credibility advantage to the defendants. It should be noted that Dr. Woodside has a medical degree and is indeed a doctor as well as an attorney. Thus, the judge was not calling Dr. Woodside a doctor when in fact he had a Ph.D. or no doctorate at all. We agree that a better course would have been to address Woodside in the capacity in which he was then acting, as an attorney. We note, however, that during the trial, plaintiffs' counsel Mr. Skinner elicited from Dr. McClain, one of the defendant's experts, that the latter had taught Dr. Woodside medicine. We find no legal error in either respect.\n\nFinally, the plaintiffs challenge the fact that Judge Rubin instructed the jury that the defendant was an \"honest drug company,\" even though the plaintiffs were not able to raise any prior fraud or criminal conduct that the defendant or its employees had committed. In fact, the district judge never instructed the jury that the defendant was an honest drug company. The actual instruction given was:\n\nThe fact that the plaintiffs are individuals and the defendant is a corporation must not enter into or affect your verdict. This case should be considered and decided by you as an action between persons of equal standing in the community, of equal worth and holding the same or similar station in life.\n\nA corporation is entitled to the same fair trial as a private individual. The law is no respecter of persons. All persons including corporations stand equal before the law and are to be dealt with as equals in a Court of justice.\n\nThe claim of counsel for the plaintiff that the trial judge referred to defendant as \"an honest drug company\" is wholly without foundation.\n\nVI. EXCLUSION OF ALL PLAINTIFFS UNDER 10 AND ALL PLAINTIFFS OVER 10 WHO WERE VISIBLY DEFORMED.\n\nThe plaintiffs challenge on Fifth and Seventh Amendment grounds the district judge's decision to exclude from the courtroom all plaintiffs under 10, and those who were over 10 but were visibly deformed. The district judge did this upon defendant's motion, without actually having observed any of the plaintiffs. A separate room was set up for those plaintiffs who were interested in being in the courthouse. They were provided with closed circuit television of the proceedings as well as communications equipment to assist their attorneys if the situation arose in which they were willing and able to do so. There was nothing in the record that indicates that the plaintiffs in this separate room ever contacted their attorneys to assist them. The plaintiffs argue that the defendant did not show how the presence of any plaintiffs would substantially impair the jury's performance of its duties. They maintain that the plaintiffs would have been of assistance to counsel because they could have exhibited injuries that supported the testimony of the experts. Further, plaintiffs claim the jury did not even see photographs of what the injuries were. There was also no determination made that the younger plaintiffs could not comprehend the proceedings. In fact, the jury only saw plaintiffs without injuries, at least that were visible, and this hurt the credibility of the plaintiffs' case.\n\nIn response, the defendant argues that the plaintiffs do not have standing to challenge the exclusion. We disagree.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e In any case, the defendant argues that the excluded plaintiffs who did want to attend could view the trial and could communicate with counsel and that those plaintiffs who were excluded could not educate counsel given the scope of this trial. Also, the defendant argues that the plaintiffs wanted the children to be present during the entire trial, and not for a short period of time, and that the presence of large numbers of deformed persons would unfairly prejudice and inflame the jury.\n\nIn considering both parties' arguments we are also cognizent of a very similar case decided by our court, Helminski v. Ayerst Laboratories, 766 F.2d 208 (6th Cir. 1985). In Helminski, the minor plaintiff, who suffered arrested neurological development and was autistic, was called as a witness for five minutes. The defendant objected on the ground that the jury had already been graphically told about the plaintiff's condition, and the defendant argued that the plaintiff's presence in the courtroom would prejudice the jury. We recognized there that neither the Due Process Clause of the Fifth Amendment nor the Seventh Amendment's guarantee of a jury trial granted a civil litigant the absolute right to be present during the trial of his case. We did, however, hold that \"consistent with due process, a plaintiff who can comprehend the proceedings and aid counsel may not be excluded from any portion of the proceedings absent disruptive behavior or a knowing and voluntary waiver. Thus, a plaintiff with a solely physical abnormality may not be excluded involuntarily, absent disruptive behavior, even when the abnormality is due allegedly to the defendant's wrongful conduct.\" Id. at 216-17. We noted that a hearing on the potential jury prejudice issue, in which the court observes the injured party, will best protect the litigant's right to be present, as well as the other side's right to a fair trial. At the hearing, the defendant who claims that a plaintiff's mere presence will prejudice the jury must bear the burden of persuasion on this issue. Id. at 217. We refused to permit a presumption that an injured party's mere presence will always deter the jury from deciding the case on the facts. Id. \"The issue which the district court must resolve at the hearing is whether the party's presence would 'prevent or substantially impair' the jury from performing its duties 'in accordance with [its] instructions and [its] oath.'\" Id. at 217 (citation omitted). The defendant must establish that the plaintiff's appearance or conduct is likely to prevent the jury from performing its duty. At the hearing, the plaintiff's ability to comprehend the proceedings or assist counsel is not the relevant inquiry. Id. at 218. If after the hearing, the district court determines the threshold inquiry, that a party's mere presence would be prejudicial, the court must next consider whether the party can assist counsel and understand the proceedings. If the court concludes that the party can so assist and comprehend, then the party may not be involuntarily excluded regardless of prejudicial impact. Id. at 218. In those cases, cautionary instructions can be read that would protect the interests of the defendant. If the party can aid counsel and comprehend the proceedings, due process requires that he be present. In Helminski, we decided that the injured minor party was improperly excluded from the courtroom because the district court never observed him to see whether his appearance or behavior would create prejudice. However, because it was evident the minor plaintiff had been unable to comprehend the proceedings or aid counsel, we did not reverse. Id. at 218-19.\n\nWhile we shall address later the question of retroactivity, we note initially that at the time the district judge set the rules governing the trial here, our decision in Helminski, had not yet issued. Moreover, based on the numerosity of plaintiffs, it was evident that the facilities of the courtroom would be totally inadequate to contain all of the parties at interest, whether parents or injured children. Therefore, it was not unreasonable, in our judgment, for the trial judge to provide at least some rules for the allocation of courtroom space. It is also to his credit, as we have already noted, that he provided separate facilities from which the proceedings could be observed through closed-circuit television by those who could not for one reason or another attend at trial. When the objections to his orders of exclusion were renewed in post-trial motions, Judge Rubin correctly observed that no claim had ever been advanced that the excluded children could themselves have meaningfully assisted counsel in the presentation of the phase of the trial which was then underway and that this ruling was never tested by plaintiffs' counsel to seek an exception which they might have considered to be justified under the particular circumstances.\n\nMore important, the verdict in this case was returned in March of 1985, and Helminski was not decided until the following June. Denial of plaintiffs' motion for judgment NOV or new trial did not occur until September 1985. Concerning retroactivity Chevron Oil Co. v. Huson, 404 U.S. 97, 106-07, 30 L. Ed. 2d 296, 92 S. Ct. 349 (1971), has this to say:\n\nFirst, the decision to be applied nonretroactively must establish a new principle of law, either by overruling clear past precedent on which litigants may have relied, or by deciding an issue of first impression whose resolution was not clearly foreshadowed. Second, it has been stressed that \"we must. . . weigh the merits and demerits in each case by looking to the prior history of the rule in question, its purpose and effect, and whether retrospective operation will further or retard its operation.\" Finally, we have weighed the inequity imposed by retroactive application, for \"where a decision of this Court could produce substantial inequitable results if applied retroactively, there is ample basis in our cases for avoiding the 'injustice or hardship' by a holding of nonretroactivity.\" (citations omitted).\n\nIn Chevron itself, the Court held that the decision whose retroactivity was at issue would not be applied retroactively because the case was one of first impression and it overruled a long line of decisions in that particular circuit. See id. at 107-08. In fact, the retroactivity analysis was applied to all aspects of that decision, even though the case was only in discovery at the time that the decision whose retroactivity to be analyzed was handed down. See id. at 99.\n\nWe noted in Cochran v. Birkel, 651 F.2d 1219, 1223 n.8 (6th Cir. 1981), that under Chevron the presumption is that a newly announced rule will apply retroactively and that the burden of persuasion is upon the party asserting prospective-only application. Applied here, the fact that a twenty-two day trial had already been concluded, and a jury verdict rendered, before the Helminski decision came down is certainly a factor to be considered in determining whether or not it would be equitable to apply Helminski retroactively. Pitts v. Frito-Lay, Inc., 700 F.2d 330, 334 (6th Cir. 1983). Further, the rule announced in Helminski, requiring a hearing to determine prejudice and permitting a plaintiff to attend despite that prejudice if he or she may assist or aid counsel, was not supported by any specific Sixth Circuit or Supreme Court cases. The cases relied upon were state cases from places such as New York and Florida. In short, Helminski was a case of first impression in this circuit, and the result was not clearly foreshadowed. Thus, we conclude that the burden of establishing the nonretroactivity of Helminski was met. There is no pre- Helminski law in this circuit that would prohibit the district court's decision.\n\nEven if Helminski were to apply here, we doubt that the trial judge's decision would have been significantly different, given the proportions of the trial. Although counsel argues that individual plaintiffs could have assisted counsel by showing examples of particular birth defects, the same counsel indicated at the August 2, 1985 hearing that the one thing that the plaintiffs could have supplied had they been present would have been \"the humanistic aspect of this litigation,\" not that they would have been able to aid or assist counsel.\n\nPossessed of no case law in our circuit on the subject, and concerned that the presence of dozens or even hundreds of deformed plaintiffs in his courtroom might unfairly deter the jury from deciding the issue at hand in accordance with the evidence, Judge Rubin instead allowed the plaintiffs who were interested to view the trial on closed-circuit television and to assist counsel through communicative devices if they were so willing and able. This, in our view, was a reasonable way to balance the rights of the plaintiffs and the defendants in the absence of hindsight. It is true that in Helminski the jury, although unable to view the minor plaintiff, had received a fair amount of evidence concerning his physical condition. In this case, plaintiffs correctly observe that there was no evidence admitted as to the physical condition of individual plaintiffs. However, that was not because the judge was unwilling to let it in. At trial, attorney Chesley recognized that he was not precluded from introducing photographs, diagrams, or skeletons.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nFinally, we note that Helminski deals not with the cause of action at issue nor with the evidence to prove it but with the important but not controlling question of trial conduct. As such, it is here believed to be subject to the harmless error provision of Fed. R. Civ. P. 61. Helminski will, of course, be retroactive as to any pending cases which have yet to be tried or retried in this circuit.\n\nConclusion\n\nIn reviewing the record and in making the determination as to the extent to which the decisions of the district court should be upheld or reversed, it is helpful to the perspective to realize, as we observed earlier, that the jury verdict following trial here might have been for the plaintiffs instead of for the defendant. Thus, where judicial discretion is to be reviewed, it must be from the perspective of a trial judge faced with many difficult choices and without the benefit of hindsight. Likewise, where there have been issues which are purely legal in nature, their resolution requires an objective adherence to sound legal and constitutional principles. In a trial of this length and complexity, it is virtually certain that at specific points of the trial one or all of us might have ruled differently on a certain procedure or on the admissibility or inadmissibility of a certain piece of evidence. It is with this realization in mind that we defer in large part to the wisdom and discretion of the trial judge who is provided with a superior vantage point from which he is able to exercise this discretion in organizing the course of trial in a meaningful and practical way. In upholding the result here to the extent we have, it is at least deserving of note that a careful examination of the trial record itself reveals the management of the trial by a judge who does not appear at any time throughout to have sought consciously or unconsciously to have unfairly tipped the scales in favor of one side or the other, but who instead in his rulings appeared to be genuinely concerned with producing a trial that was as fair and free from error as human endeavor could make it. While we must always be conscious of the potential danger of making the trial a sterile exercise of scientific investigation by limiting issues and evidence too narrowly, it is quite evident, through several thousand pages of testimony, that the jury was presented with and bound to appreciate the seriousness of a very real issue of great importance to the parties at suit. In fact, to have broadened the issues beyond that of causation would have occasioned a real risk of overencumbering the jurors and impairing their ability to reach a knowledgeable and intelligent verdict based upon the evidence and upon the law applicable under the appropriate instructions. The result of these proceedings, and of our decision here, will of course mean that for some parties the litigation is concluded, but that for others it may be resumed and continued elsewhere. The reasons for this we have already set forth at length in this opinion and to those we can only observe that such would have been the case in any event had efforts at joinder and then trifurcation not been attempted. This litigation has been substantially advanced by the efforts of the district judge and, we hope, by this decision. We can expect no more at this juncture.\n\nThat portion of the district court's order dated August 27, 1985 which remands all cases brought by Ohio citizens originally in state courts is not disturbed. The remainder of that order, which dismisses without prejudice Ohio citizens who brought suit in federal court, is vacated and those cases are remanded to the district court with instructions to enter judgment on the merits and in favor of the defendant. Finally, those thirteen cases brought by Ohio citizens in federal court over which it is conceded there is no federal jurisdiction shall be dismissed without prejudice.\n\nThe judgment of the district court is otherwise AFFIRMED.\n\nJONES, Circuit Judge, concurring in part and dissenting in part. I write separately today for two reasons. First, I write to point out my disagreement with the majority on the exclusion, by the district court, of certain plaintiffs from the courtroom during the twenty-two day jury trial on causation. Secondly, I write to express a few of my concerns regarding the district court's trifurcation order. My opinion, however, is both narrow and focused as I examine only these two issues; issues which possess both great value and import in the functioning of our judicial system. As to all remaining issues raised by this appeal, I concur in the very thorough and well-written majority opinion.\n\nI.\n\nAlthough I concur in the final result of the majority opinion [Text Deleted by Court Emendation] with regard to the district court's trifurcation order, I do so reluctantly and with serious reservation. However, pursuant to the applicable standard of review, i.e., an abuse of discretion standard which favors the district court's ability and judgment to fairly and expeditiously handle its docket, and to case law within this circuit where such a procedure has previously been approved, i.e., In re Beverly Hills Fire Litigation, 695 F.2d 207 (6th Cir. 1982), I agree with the majority that, in this instance, the district court did not abuse its discretion in trifurcating the issues of causation, liability and damages. However, I do express my concerns about the fairness of this mechanism as a tool for handling complex cases such as this. In so doing, I do not re-analyze all of the relevant factors to which courts look in making their decisions as to trifurcation; Chief Judge Engel has quite thoroughly analyzed those factors. See supra pp. 30-59. Instead, I point out potential problems and prejudiced that can arise by the use of this procedure.\n\nWhile it is clear that a trifurcation order such as the one here is not unprecedented, it is equally clear that trifurcated trials are a rarity and have only been approved in the most extreme cases. The fact that trifurcation has rarely taken place, however, does not mean that it is without merit. Rather, since so many potential prejudices loom, trifurcation of issues is limited to rare occasions.\n\nAlthough I have no problem with the approved trifurcation order in this court's Beverly Hills decision, I do become hesitant when that decision is applied, seemingly without reservation, to [Text Deleted by Court Emendation] a case, such as this one, which is complex in nature. Because I find several distinctions between this case and Beverly Hills, I am reluctant to apply such reasoning wholesale. Thus, I find that if Beverly Hills is narrowly construed, several problems become apparent with the majority opinion.\n\nFirst, all of the victims in the Beverly Hills litigation were affected by the same event, a disastrous and tragic fire. Thus, the issue of causation could, quite competently, be tried separately from the issues of liability and damages with only a small chance that the plaintiffs would be prejudiced. This was simply because all plaintiffs were affected in the same manner by a unique, single event. [Text Deleted by Court Emendation] Individual facts about the individual plaintiffs would therefore, have had little significance in regard to the question of causation.\n\nThe Bendectin litigation, however, is quite different. Over eight hundred plaintiffs, whose mothers took the drug at different times and places and under different circumstances, are involved. As such, a single, unique event such as a fire is replaced by over eight hundred distinct events that, in all likelihood, affected the individual plaintiffs in different ways. Although each distinct event involved the ingesting of the same drug, it is hard to believe that all eight hundred plus claims can be tied neatly into one package and satisfactorily resolved by the answering of one question, i.e., did Bendectin cause the relevant birth defects? In tying all of these claims together, an argument could certainly be made as to prejudice. That is, by not allowing the plaintiffs to present evidence as to how they were individually affected by the drug could have resulted in prejudice to them in their attempt to establish the required elements of their case. Indeed, although I concur in the majority's end result, I disagree with the language used in reaching the conclusion. The majority opinion refers to the fact that the plaintiffs were not \"unduly\" prejudiced by the court's trifurcation order. I do not agree that this is the burden plaintiffs must meet to establish an abuse of discretion by the lower court with regard to a trifurcation order. Rather, my suggestion is that any prejudice to a plaintiff in the litigation of his or her case should be enough to hold that the lower court has abused its discretion. I do not agree with the majority that absent a showing of unduly or excessive prejudice, the court's order should be upheld. Indeed, this court should define the amount of prejudice that must be demonstrated to establish that a trifurcation order was an abuse of discretion. Such a discussion in this case, however, is without utility. Plaintiffs here simply failed to meet their burden to demonstrate any prejudice. That is, plaintiffs lost their case because they failed to establish any link between their birth defects and the drug Bendectin, not because of any prejudice to them resulting from the trifurcation order.\n\nIn conclusion, trifurcation orders present fundamental problems of fairness simply because the typical procedure in litigation does not involve the splitting up of a case, element by element, and trying each point to the jury separately. Rather, the plaintiff's entire case is presented to the jury at once, thereby preventing the isolation of issues in a sterile atmosphere. Simply because a litigant shares his complaint with eight hundred other claimants is not a reason to deprive him of the day in court he would have enjoyed had he been the sole plaintiff. However, as the majority points out, a trifurcation order is authorized and necessitated at some point so as to allow a district court [Text Deleted by Court Emendation] to manage and control the complexities and massive size of a case. The duty of this court, however, is to prevent such a case-management tool from becoming a penalty to injured plaintiffs seeking relief via the legal system.\n\nIn this case, after all of these concerns have been considered and accounted for, I agree with the majority that the district court did not abuse its discretion in trifurcating the issue of causation.\n\nII.\n\nWhile, on the whole, Judge Rubin conducted the potentially mammoth proceedings at issue with great caution, I find that his decision to exclude certain plaintiffs from the courtroom, without first conducting a hearing, was clearly erroneous. By relying upon representations made by the defendant's attorneys, the district court excluded all plaintiffs under ten years of age and certain plaintiffs over ten, i.e., those with noticeable deformities, from the courtroom during the jury trial on causation. To make such a decision without first observing or speaking to those plaintiffs is certainly a violation of the principles of due process. Although, as recognized by the majority in this case and this court in Helminski v. Ayerst Laboratories, 766 F.2d 208, 213 (6th Cir. 1985), a civil litigant does not have an \"absolute right to be present personally during the trial of his [or her] case,\" a decision to exclude a plaintiff from the trial of his or her action must be consistent with due process principles. Id. at 216. To be consistent with due process, such a decision must be an informed one. This is necessary to ensure that an excluded party receives a fundamentally fair trial. In meeting this requirement, a district court must take that extra step and conduct a hearing, thereby allowing such plaintiffs to be seen and heard. Such a procedure prevents any arbitrary exclusion of a party from the courtroom. In this case, the lower court did not follow such procedures, but instead relied upon representations of the defendant's attorneys. I simply cannot sanction such an action.\n\nChief Judge Engel, in the majority opinion, correctly notes the above principles and the fact that this court has now required that such procedures be adhered to so as to protect plaintiffs from arbitrary exclusion from the courtroom during the trial of their action. The majority opinion also notes that such procedures were not followed by the district court in this case. Chief Judge Engel points out, however, that the case establishing these procedures, Helminski, was not decided until after the district court had made its decision to exclude certain plaintiffs and after Judge Rubin had already conducted a twenty-two day jury trial on the issue of causation. While I concur in the praise offered by the majority of the district court's efforts to manage this complex action, I disagree with the majority as to this issue. Rather, I find that the trial court, in this regard, violated the plaintiffs' constitutional due process rights. Furthermore, I disagree with the majority's proposition that Helminski, a case which would quickly dispose of this issue, was an unprecedented decision and thus should not be applied retroactively to this case. Indeed, this is the bulk of my disagreement since all three judges on this panel would seemingly agree that the record shows that the district court certainly did not follow the required Helminski procedures, discussed in depth in the majority opinion and not repeated here. See supra pp. 64-70.\n\nBecause I disagree with the majority's finding that no case law existed within this circuit or the Supreme Court, prior to Helminski, which would have placed the district court on notice as to its duties vis-a-vis the exclusion of plaintiffs from the courtroom, thereby precluding the application of Helminski to this case because of the applicable Chevron [Chevron Oil Co. v. Huson, 404 U.S. 97, 30 L. Ed. 2d 296, 92 S. Ct. 349 (1971)] rules on retroactivity, I respectively offer my dissent.\n\nA.\n\nI believe that prior to Helminski authority and precedent existed which required lower courts to at least allow a plaintiff, prior to being excluded from the courtroom during his or her trial, the opportunity to be seen and heard. Indeed, I not only find that Helminski was not unprecedented, I also find that that decision was simply a continuation and affirmation of the prior case law setting forth principles of procedural due process. Thus, these principles not only were in existence, but also required lower courts to do more than simply rely upon representations made by opposing parties in such important and fundamental decisions. Accordingly, the excluded plaintiffs' due process rights were violated by the lower court's actions with regard to this issue.\n\nI specifically find support for my conclusion [Text Deleted by Court Emendation] in Helminski. Although the majority opinion correctly notes that the decision in Helminski is basically supported by decisions from state courts, it fails to note that the Helminski court cited as support for the fundamental notions of due process set forth within that opinion, decisions from this circuit and the Supreme Court. Although the district court in this instance should not be held to a standard where it should have known all the nuances of what due process required before it could exclude a party from the courtroom during the trial of his or her action, it certainly must be held to a standard requiring it to follow and respect a litigant's due process rights to a fundamentally fair trial.\n\nNo language in Helminski is indicative of the fact that this decision is one of first impression within this circuit. Rather, the opinion draws from a variety of Supreme Court and circuit courts of appeals' due process opinions in holding, ultimately, that a hearing is necessary prior to the time a party may be excluded from the courtroom. Indeed, the court cites to a prior Sixth Circuit opinion, Drayton v. Jiffee Chemical Corp., 591 F.2d 352 (6th Cir. 1978), for the proposition that:\n\nExclusion of a party who is able to comprehend the proceedings and aid his attorney would infringe upon the \"fundamental standards of fairness which every litigant before a federal court has a right to expect,\" and hence, would constitute a deprivation of due process which could be remedied only by granting a new trial.\n\nHelminski, 766 F.2d at 218 (citing Drayton, 591 F.2d at 361).\n\nBased upon the Helminski court's language and its cited precedent, I find nothing that would allow me to hold that that decision was such a break from past law [Text Deleted by Court Emendation] as to prevent its retroactive application to this case. Rather, I find that the district court should have been on notice as to the fact that its particular actions were Unconstitutional.\n\nB.\n\nThe majority also lists several equitable reasons why Helminski should not be applied to this case, i.e., a twenty-two day jury trial had been completed and a verdict rendered before Helminski was decided. Surely such reasoning must hold to the fundamental due process rights of litigants to receive a fair trial. Indeed, because it is not evident that all excluded plaintiffs could not have understood the proceedings and could not have aided their counsel in presenting their case, i.e., Helminski requirements, the excluded plaintiffs' due process rights to a fundamentally fair trial were violated. [Text Deleted by Court Emendation] The plaintiffs were thereby prejudiced by the court's failure to make the necessary findings regarding their ability to comprehend and aid in the presentation of their case to the jury. Because I find that it is not evident that the plaintiffs would have been excluded from the courtroom if the proper procedures had been adhered to by the district court, I find that such error is not harmless and therefore constitutes reversible error.\n\n[Text Deleted by Court Emendation] Because, in my judgment the decision in Helminski was a continuation of this court and the Supreme Court's prior due process analyses, it should be applied retroactively to this case, thereby resulting in a finding that the lower court erred in arbitrarily excluding certain plaintiffs from the courtroom without the benefit of an opportunity to be heard and seen As noted by the majority, the presumption is that a newly announced rule of law will apply retroactively and the burden of persuasion to demonstrate that such an application is unjust is on the party asserting prospective-only application. See Cochran v. Birkel, 651 F.2d 1219, 1223 n. 8 (6th Cir. 1981). Here, that burden has not been met. The lower court made no findings, with support, as to whether the plaintiffs' presence would prejudice the jurors or as to whether the excluded plaintiffs would have been able to comprehend the proceedings and aid their counsel in presenting their case. Such findings are requirements of due process. [Text Deleted by Court Emendation] I find that the district court's error in this regard should allow those plaintiffs who were arbitrarily excluded from the courtroom during the trial of their action an opportunity to have another day -- a fundamentally fair one -- in court. Therefore, I respectfully dissent.\n\n\u003cspan class=\"fn\"\u003e* The Honorable Albert J. Engel assumed the duties of Chief Judge effective April 1, 1988.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. The discrepancy between the number of claims and number of cases is due to some case numbers containing more than one family and some plaintiffs having filed lawsuits in both state and federal court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. See, e.g., Merrell Dow Pharmaceuticals, Inc., v. Thompson, 478 U.S. 804, 106 S. Ct. 3229, 92 L. Ed. 2d 650 (1986); Richardson-Merrell Inc., v. Koller, 472 U.S. 424, 86 L. Ed. 2d 340, 105 S. Ct. 2757 (1985); Watson v. Merrell Dow Pharmaceuticals, Inc., 769 F.2d 354 (6th Cir. 1985); Dowling v. Richardson-Merrell, Inc., 727 F.2d 608 (6th Cir. 1984); Mekdeci, by and through Mekdeci v. Merrell National Laboratories, 711 F.2d 1510 (11th Cir. 1983); Shelhamer v. Merrell Dow Pharmaceuticals, Inc., Civ. A. No. 87-0782 (W.D. Pa. 1987); Engel v. Merrell Dow Phamaceuticals, Inc., No. Civ. 83-1189E (E.D.N.Y. 1987); Richardson v. Richardson-Merrell, Inc., 649 F. Supp. 799 (D.D.C. 1986); Lynch v. Merrell - National Laboratories, 646 F. Supp. 856 (D. Mass. 1986), aff'd, 830 F.2d 1190; Will v. Richardson-Merrell, Inc., 647 F. Supp. 544 (S.D. Ga. 1986); Raynor v. Richardson-Merrell, Inc., 643 F. Supp. 238 (D.D.C. 1986); Haddad v. Richardson-Merrell, Inc., 588 F. Supp. 1158 (N.D. Ohio 1984); Chambers v. Merrell Dow Pharmaceuticals, Inc., No. C-850888 (Hamilton County, Ohio, Court of Appeals, Dec. 24, 1986); Dralle by Dralle v. Ruder, 148 Ill.App.3d 961, 500 N.E.2d 514, 102 Ill. Dec. 621 (1986); Oxendine v. Merrell Dow Pharmaceuticals, Inc., 506 A.2d 1100 (D.C. 1986); Albertson v. Richardson-Merrell, Inc., 441 So.2d 1146 (Fla. Dist. Ct. App. 1983).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. These cases are as follows: C-1-84-0504 Joseph Glen LaPaglia et al. C-1-83-2141 C-2-83-2140 Carrie Blue Fletcher C-1-84-1499 Michael R. Oliver et al. C-1-84-1500 Melissa Bill et al. C-1-84-1501 Billy J. Watkins et al. C-1-84-1502 Deborah A. Jones C-1-84-1503 Aric McKee C-1-85-0309 Kyle Dart C-1-85-0310 Bethany Blaha C-1-85-0311 Heather Black C-1-85-0312 Scott Herskovic C-1-85-0313 Victoria Sanayoa C-1-85-0342 Lynne G. Gamble C-2-85-0072 Mark R. Mitchell C-1-85-0279 Michelle Meckanics\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. See, e.g., McFeggan v. Merrell Dow Pharmaceuticals, Inc., No. 87 C 70 (N.D. Ill. 1987); Whelan v. Merrell Dow Pharmaceuticals, Inc., Civ. A. No. 83-3108 (D.D.C. 1987).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. On appeal the Supreme Court assumed that the FDCA did not create a private right of action but carefully avoided any definitive ruling on that question. 106 S. Ct. at 3233.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. While the same logic would appear to apply to any cases brought by Delaware citizens in state court given Merrell Dow's status as a Delaware citizen due to its incorporation in that state, 28 U.S.C. § 1332(c), we are aware of no such cases brought before the district court and our attention has been called to none.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Review might be possible by way of mandamus, but no mandamus proceedings have been instituted.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. We make this observation merely to point out the critical need, so evident here, that the decisions in this appeal be principled and uninfluenced by the hindsight of what later transpired. A different result by the jury undoubtedly would have reversed the position on appeal of all the parties.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Teratogenic is defined as: \"Tending to produce deformities of the body, especially teratism; causing the development of monsters or monstrosities (deformed fetuses or infants).\" 4 Smidt's Attorneys' Dictionary of Medicine T-33 (1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Section 145 provides: (1) The rights and liabilities of the parties with respect to an issue in tort are determined by the local law of the state which, with respect to that issue, has the most significant relationship to the occurrence of the parties under the principles stated in § 6. (2) Contacts to be taken into account in applying the principles of § 6 to determine the law applicable to an issue include: (a) the place where the injury occurred, (b) the place where the conduct causing the injury occurred, (c) the domicile, residence, nationality, place of incorporation and place of business of the parties, and (d) the place where the relationship, if any, between the parties is centered. These contacts are to be evaluated according to their relative importance with respect to the particular issue.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Section 6 states: (1) A court, subject to constitutional restrictions, will follow a statutory directive of its own state on choice of law. (2) When there is no such directive, the factors relevant to the choice of the applicable rule of law include (a) the needs of the interstate and international systems, (b) the relevant policies of the forum, (c) the relevant policies of other interested states and the relative interest of those states in the determination of the particular issue, (d) the protection of justified expectations, (e) the basic policies underlying the particular field of law, (f) certainty, predictability and uniformity of result, and (g) ease in the determination and application of law to be applied.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. See Marder v. G. D. Searle \u0026 Co., 630 F. Supp. 1087 (D.Md. 1986), aff'd sub. nom., Wheelahan v. G.D. Searle and Co., 14 F.2d 655 (4th Cir. 1987); Beverly Hills, 695 F.2d at 207.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Beeck v. Aquaslide 'N' Dive, Corp., 562 F.2d 537 (8th Cir. 1977) (trial limited to whether defendant had manufactured the product); Rossano v. Blue Plate Foods, Inc., 314 F.2d 174, 176 (5th Cir. 1963) (separate trial on issue of agency in negligence case); Bowie v. Sorrell, 209 F.2d 49 (4th Cir. 1953) (separate trial on question of validity of release; tried before two juries).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. While we agree with the trial judge that Dr. Swan's testimony would not support application of section 432(2), it was nevertheless consistent with the court's instruction as given. It is important to observe that the jury, if it credited Dr. Swan's testimony, would plainly have understood that it could return a verdict for the plaintiffs where Bendectin was one of the proximate causes of the defects.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Ohio law also rejects the related, but somewhat distinct \"increased the risk\" standard in these circumstances. Cooper v. Sisters of Charity of Cincinnati, Inc., 27 Ohio St. 2d 242, 272 N.E.2d 97 (1971).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Alternative liability also does not apply under the law of Ohio. For a plaintiff to shift the burden, he must prove that two or more defendants committed tortious acts, and that he was proximately injured as a result of the wrongdoing of one of the defendants. \"This doctrine does not apply in cases where there is no proof that the conduct of more than one defendant has been tortious.\" Minnich, 473 N.E.2d at 1200.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. See e.g., Wright, Causation in Tort Law, 73 Cal. L. Rev. 1735, 1772-74 (1985). In Stanton by Brood v. Astra Pharmaceutical Products, Inc., 718 F.2d 553 (3d Cir. 1983), the court applied the negligence per se standard specically to a claim of violation of the FDCA. Although in that case the court permitted plaintiffs to rely on negligence per se for defendant's violation of the FDCA and then shifted the burden of proof to defendant, it was already resolved that the cardiac arrest that plaintiff suffered was in fact caused by the drug which defendant manufactured. The question was whether defendant was liable for plaintiff's injury for failing to provide the FDA with information on the drug after the agency had approved it. In this case, even if the doctors would have considered Merrell Dow's wrongful withholding of information from the FDA to be sufficient to stop them from prescribing Bendectin, the fact that they continued to do so despite the statutory violation would be irrelevant if Bendectin does not in fact cause birth defects. The Fourth Circuit has also allowed negligence per se upon proof of a violation of the FDCA, even though it admitted that there was no express private civil remedy. Orthopedic Equipment Co. v. Eutsler, 276 F.2d 455, 460-61 (4th Cir. 1960).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. At trial, the proof adduced by plaintiffs to prove causation consisted of highly technical scientific studies, including texicity studies on laboratory animals, chemical studies of the biochemical properties of Bendectin, and epidemiological studies or case histories of persons exposed to the drug.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Plaintiffs maintain that the exclusion of all visibly deformed plaintiffs from the courtroom, as well as all children under ten, whether or not visibly deformed, also contributed to sterile or laboratory conditions. We address this argument in part VI, infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Merrell Dow argues that the real plaintiffs in this case are the parents and that therefore no plaintiff, i.e. parent, has standing to raise the exclusion of the children. This argument is without merit. Plaintiffs generally must assert their own legal rights and interests and cannot base their claim to relief on legal rights or interests of third parties. See Warth v. Seldin, 422 U.S. 490, 499, 45 L. Ed. 2d 343, 95 S. Ct. 2197 (1975). Where, however, \"as a result of the very litigation in question, the constitutional rights of one not a party would be impaired, and where he has no effective way to preserve them himself, the Court may consider those rights as before it.\" United States v. Raines, 362 U.S. 17, 22, 4 L. Ed. 2d 524, 80 S. Ct. 519 (1960). Thus, the only way for the rights of these plaintiffs to be protected, assuming that they have been violated, is for the parents to be able to raise their children's due process rights. Additionally, \"the minor is the real party in interest in a suit brought by a next friend.\" Helminski v. Ayerst Laboratories, 766 F.2d 208, 213 (6th Cir. 1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Of course, if exclusion were improper, only those plaintiffs who were excluded, the visibly deformed and those younger than ten, would have standing to challenge the exclusion and, if successful, would be the only plaintiffs entitled to a new trial on this ground.\u003c/span\u003e\n\n",
    "body_length": 157509,
    "citedas": [
      "857 F.2d 290"
    ],
    "attorneys": "James G. Butler, argued, Ray Henke, Butler, Dan, Allis \u0026 Reback, Los Angeles, California for Appellant Shane Ross Wood. Stanley M. Chesley, Argued, Allen T. Eaton, George A. Kokus, Thomas H. Bleakey, Cincinnati, Ohio; George A. Kokus, Miami, Florida; Allen T. Eaton, Washington, D.C., for Appellant Sarah Ann Hoffman. Richard W. Langerman, Langerman, Begam, Lewis \u0026 Marks, Phoenix, Arizona, for Appellant Elizabeth Ann Davis. Frank C. Woodside, III, Argued, Dinsmore \u0026 Shohl, Cincinnati, Ohio, Vincent Stamp, for Appellee.",
    "category": [
      "251"
    ],
    "judges": "Engel, Chief Judge;*fn* Jones and Nelson, Circuit Judges.",
    "citation_count": 204
  }
}
