{
  "id": "OoqTQGYBTlTomsSBY5p5",
  "document": {
    "title": "First Alabama Bank of Montgomery",
    "full_title": "FIRST ALABAMA BANK OF MONTGOMERY, N.A. -CROSS-APPELLANT v. FIRST STATE INSURANCE COMPANY, INC., A CORPORATION AND CAMERON AND COLBY COMPANY, INCORPORATED, A/K/A CAMERON AND COLBY CO., INCORPORATED, A MASSACHUSETTS CORPORATION . JOHNSON \u0026 HIGGINS OF GEORGIA, INC., A CORPORATION, 1ST ST. INS. \u0026 CAMERON \u0026 COLBY -CROSS-APPELLEES",
    "jurisdiction": "Eleventh Circuit",
    "date": "1990-04-27T00:00:00.000Z",
    "docket": "No. 88-7387",
    "body": "ESCHBACH, Senior Circuit Judge:\n\nDefendants-Appellants First State Insurance Company (\"First State\"), Cameron and Colby Company, Inc. (\"Cameron \u0026 Colby\"), and Johnson \u0026 Higgins appeal from the trial court's award of compensatory and punitive damages in favor of plaintiff-appellee First Alabama Bank (\"First Alabama\") in a diversity action for fraud and breach of contract.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Plaintiff filed this diversity action in federal district court against First State\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e seeking both to recover on a bank trust department errors and omissions (\"E \u0026 O\") insurance policy and to recover damages for fraud. First Alabama also sued Johnson \u0026 Higgins in both tort and contract for failure to provide expertise and skill as plaintiff's exclusive insurance broker in the procurement of E \u0026 O insurance and for fraud.\n\nFollowing a bench trial, the court entered judgment in favor of First Alabama on its fraud and contract claims against First State and awarded First Alabama compensatory and punitive damages, together with costs. The court also found in favor of First Alabama on its contract claim against Johnson \u0026 Higgins and awarded the plaintiff compensatory damages. The court specifically stated that the liability of Johnson \u0026 Higgins is secondary to that of the other defendants. The court, however, entered judgment against plaintiff on its fraud and negligence claims against Johnson \u0026 Higgins.\n\nFrom these various rulings, defendants now appeal, raising a total of seven issues. First State first argues that the court erred in concluding that First Alabama's fraud claims are not barred by the applicable statute of limitations. Second, it contends that the court's finding that it committed fraud against First Alabama is clearly erroneous. Third, the company argues that the court erred in granting First Alabama's motion for partial summary judgment and in striking its affirmative defense of failure to give timely notice of a claim. Fourth, it asserts that the court erred in concluding that the claims made policy without prior acts coverage, which it sold to First Alabama, violates public policy. Fifth, First State claims that the court erred in entering allegedly inconsistent judgments against it on both the fraud and contract claims. Finally, it argues that the court erred in awarding First Alabama prejudgment interest on the compensatory damage award. Johnson \u0026 Higgins also appeals, claiming that the court erred in construing First Alabama's tort claims as contract ones and in holding that the merger doctrine does not apply to bar First Alabama's contract action. Finally, First Alabama cross-appeals arguing that the court erred in denying it attorneys' fees from Johnson \u0026 Higgins for its litigation expenses against First State. Without deciding the public policy issue we affirm the district court's award of compensatory and punitive damages. However, because we believe that the contract was an indemnity policy, and not a liability one, we remand this case for the court to determine the proper amount of prejudgment interest.\n\nI. Statement of Facts\n\nAlthough the record and the briefs in this case are voluminous, the basic facts are not unusually complex. We will attempt to describe the events that transpired as simply as possible. In the fall of 1975, First Alabama decided to consolidate the insurance coverage of its affiliate banks into a centralized program. In order to accomplish this goal, it appointed an insurance committee to study the banks' insurance needs. The committee was composed of four members: the bank's president, Lynn Mosley, its corporate auditor, James Bohannon, and two stockholder-directors, who were local insurance agents in Alabama. The committee decided to appoint an exclusive insurance broker and invited several major national brokerage firms, including Johnson \u0026 Higgins, to submit written proposals and to make oral presentations on the services they offered.\n\nOn November 5, 1975, Johnson \u0026 Higgins made its oral presentation to members of First Alabama's insurance committee. In its presentation, Johnson \u0026 Higgins stressed that it had \"specialists\" to meet the bank's needs and that it would \"function as an arm of management.\" Tr. at 37-38. Bohannon testified at trial that Johnson \u0026 Higgins also emphasized that \"they would shop the market to make sure that [the bank] got the best insurance coverage for the premium [the bank] paid.\" Id. at 38. Along with its oral presentation, Johnson and Higgins distributed copies of a written proposal entitled \"A Proposal of Risk Management Services for First Alabama Bancshares, Inc.\" to members of the committee. In its proposal, Johnson \u0026 Higgins states that one of its strengths is \"its knowledge of insurance markets.\" Plaintiff's Exhibit No. 13 at 15. Besides stressing that Johnson \u0026 Higgins serves as a broker for \"large financial institutions,\" id. at 30, the proposal states that \"we review the competitive positions of insurance carriers in the marketplace . . .\" and \"once the quotes are in, we prepare a comparison sheet of premiums, coverage and service, and present alternative insurance plans to you,\" id. at 16-17. In addition to this proposal, Johnson \u0026 Higgins had also sent a letter to Jim Bohannon, which mentions that the company has a number of banks as clients and that this allows the company to \"have personnel particularly skilled in the handling of insurance problems for banks.\" Plaintiff's Exhibit No. 7 at 1. Based on the presentation and proposal that Johnson \u0026 Higgins submitted, the committee in November 1975 selected it as First Alabama's exclusive insurance broker.\n\nAfter being appointed as First Alabama's exclusive insurance broker, Johnson \u0026 Higgins recommended to the bank that it obtain trust department E \u0026 O insurance because none of its affiliates had this type of coverage. Trust E \u0026 O insurance is a specialized form of coverage which insures against losses and related expenses incurred from claims arising from negligent acts, errors, or omissions in the administration of trusts or estates. Trust E \u0026 O coverage is usually written by insurers on a \"claims made\" basis. That is, subject to the coverage limit and other restrictions of the policy, the insured is protected against risks to the extent that a claim is made upon the insured within the period of the policy as defined, regardless of when the acts giving rise to the claim occurred. In contrast, occurrence policies provide coverage only for losses, acts, or omissions occurring during the current policy period. On May 25, 1976, at a meeting between representatives of First Alabama and Johnson \u0026 Higgins, Bohannan testified that First Alabama voiced its desire to obtain E \u0026 O insurance. On June 22, 1976, Johnson \u0026 Higgins wrote Cameron \u0026 Colby for a quotation on E \u0026 O coverage. Shortly thereafter, Johnson \u0026 Higgins presented a proposed \"claims made\" policy to First Alabama. The policy, which would be issued by First State, contained a provision entitled exclusion (b) which specifically excludes \"prior acts coverage,\" or losses \"arising out of events committed prior to the Retroactive Date\" of the policy. Affidavit of Bette E. Mahoney, Rec. 55 (Exhibit B).\n\nAfter reviewing the policy, Mosley testified that representatives of First Alabama met with Pat Green of Johnson \u0026 Higgins and told him that they wanted the insurance with prior acts coverage. Mosley also testified that he asked Johnson \u0026 Higgins to see whether First State would be willing to issue the policy with prior acts coverage for a higher premium. Subsequently, Johnson \u0026 Higgins arranged a meeting in October 1976 in Boston between representatives of First Alabama, Johnson \u0026 Higgins, and First State. At the meeting, Bohannon testified that he reiterated First Alabama's desire to obtain the E \u0026 O insurance with prior acts coverage. First State responded by saying it would bring the matter up with its London reinsurers and that it was \"up to London where [sic] [the bank] could get prior acts or not.\" Tr. at 102.\n\nShortly after this meeting, Francis Vincent, First State's underwriter in charge of trust E \u0026 O insurance, wrote to Pat Green of Johnson \u0026 Higgins about the availability of the coverage. In his letter, Vincent states that his firm had obtained the necessary reinsurance, but it was \"unable to offer any prior acts coverage.\" Affidavit of Francis J. Vincent, Rec. 53 (Exhibit A). Johnson \u0026 Higgins then relayed this information to Kurt Grinstead, an administrative assistant with First Alabama. Johnson \u0026 Higgins did not attempt to contact any other insurers to obtain prior acts coverage for its client and Pat Green told representatives of First Alabama that \"there was only one company that was writing the coverage, that being First State.\" Tr. at 91. After First Alabama was informed that such coverage was not available because London would not approve the coverage and because other markets did not exist, First Alabama accepted the First State policy without the prior acts coverage. First State issued the policy to First Alabama in the amount of $3,000,000 for one year effective December 14, 1976. Identical policies were issued for five successive years, including policies effective December 14, 1977, and 1978 respectively. Each subsequent policy had the same retroactive date, December 14, 1976, as the inception date of the first policy.\n\nJohnson \u0026 Higgins arranged the renewals of the policies for First Alabama in subsequent years, including 1977 and 1978. James Bohannon of First Alabama testified at trial that the bank continued to want prior acts coverage in the later years and communicated this desire to its broker in a 1977 meeting and possibly in a 1978 meeting.\n\nOn December 28, 1978, First Alabama was served with the summons and complaint in class action litigation known as the Martin-Gerson litigation. The complaint against First Alabama, which underlies the present litigation, was filed during the effective period of the 1978 E \u0026 O policy which First State issued to First Alabama. However, all the acts from which the class action claim against First Alabama arose occurred prior to December 14, 1976, the retroactive date of the 1978 policy. On June 24, 1981, the Martin-Gerson court entered an order finding that First Alabama, as trustee, had made imprudent investments which violated its fiduciary duty to the trust beneficiaries. The class action resulted in a final judgment against First Alabama for approximately $7,000,000. First Alabama appealed the decision, but the Alabama Supreme Court affirmed the judgment. First Ala. Bank of Montgomery, N.A. v. Martin, 381 So. 2d 32 (Ala.1980) (appeal on class certification), 425 So. 2d 415 (Ala.1982), cert. denied, 461 U.S. 938, 103 S. Ct. 2109, 77 L. Ed. 2d 313 (1983) (appeal on merits), and 471 So. 2d 1238 (Ala.1985) (appeal on award of attorneys' fees). On June 29, 1981, First Alabama notified First State that it claimed coverage for Martin-Gerson, but First State denied coverage of First Alabama's claim based on the prior acts exclusion in the policies.\n\nIn 1983, after reviewing the insurance policies of one of its new affiliates, Merchants National Bank of Mobile (\"Merchants\"), employees of First Alabama discovered that this affiliate had a trust E \u0026 O policy with prior acts coverage from First State for the 1976-1977 policy year. Based on this information, First Alabama researched and discovered that other insurers had been providing E \u0026 O insurance with prior acts coverage. Acting on this information, on September 1, 1983, First Alabama filed suit in federal district court against First State and Johnson \u0026 Higgins for breach of contract and negligence. In August 1984, First Alabama moved for leave to file an amended complaint to add Cameron \u0026 Colby as a party defendant and to add a fraud count against defendants First State and Cameron \u0026 Colby, which the court granted.\n\nSubsequently, the court on September 30, 1985, held a pretrial conference in this case and entered its pretrial order on October 17, 1985. In March 1986, First Alabama filed a motion for partial summary judgment seeking to strike First State's late notice defense, which the court granted on April 16, 1986. The bench trial in this case began on April 21, 1986, and lasted until April 30, 1986. At the conclusion of the plaintiff's case, Johnson \u0026 Higgins, pursuant to Federal Rule of Civil Procedure 41(b), orally moved the court for dismissal of the three claims against it for negligence, fraud, and breach of contract. Likewise, Cameron \u0026 Colby moved for a dismissal of the contract claim against it. Cameron \u0026 Colby and First State then moved for dismissal of the public policy claim, the contract claims, except those relating to the 1978-1979 policy period, and the fraud claims that the plaintiff had asserted against them. The court granted Cameron \u0026 Colby's motion for dismissal of the contract claim against it, but denied the rest of the defendant's motions.\n\nAfter the trial ended, on May 8, 1986, the court entered an order bifurcating the case on the issue of the reasonableness of attorneys' fees and expenses which First Alabama had incurred in litigating this suit and in defending the Martin-Gerson suit. Thereafter, on February 20, 1987, the court entered its memorandum opinion and order. In its opinion, the court found in favor of First Alabama on the fraud claims against First State and Cameron \u0026 Colby and in favor of First Alabama on its public policy contract claim against First State. The court awarded plaintiff $3,000,000 in compensatory damages and $3,000,000 in punitive damages. The court also entered judgment in favor of First Alabama on its contract and negligence claims against Johnson \u0026 Higgins, but against First Alabama on the fraud claim. The court granted judgment for plaintiff against Johnson \u0026 Higgins for $3,000,000 in compensatory damages with the liability of Johnson \u0026 Higgins being secondary to that of the other defendants.\n\nShortly thereafter, First Alabama filed a motion to amend the court's findings and to alter or amend the judgment. First State and Cameron \u0026 Colby also filed motions to alter or amend the judgment and to make additional findings of fact. Likewise, Johnson \u0026 Higgins filed a motion to amend the findings of fact and to alter or amend the judgment or, in the alternative, for a new trial. While these post-trial motions were pending, the court, on March 25, 1987, held a hearing on First Alabama's contention that it was entitled to recover from Johnson \u0026 Higgins attorneys' fees incurred in prosecuting the action against First State and Cameron \u0026 Colby. The court, on June 30, 1987, entered its judgment in favor of Johnson \u0026 Higgins on First Alabama's claims for attorneys' fees. The court held that since First Alabama asserted separate claims against First State and Cameron \u0026 Colby, \"the presence of these claims prevents the application of [ Elegante Inns ] in the instant case.\" District Court's Memorandum Opinion (June 30, 1987), Rec. 201, at 5. Following this, the plaintiff filed a motion to alter or amend the court's June 30, 1987 final order, which the district court denied on September 1, 1987.\n\nSubsequently, on May 26, 1988, the court issued a second memorandum opinion which addressed the plaintiff's and defendants' motions to alter or amend the judgment. The court granted First Alabama's post-judgment motion in part by ruling that its fraud claim against First State was not barred by the applicable statute of limitations and by holding that the bank was entitled to recover prejudgment interest on the compensatory damages award. The court also reconsidered its holding on the public policy claim in light of the Alabama Supreme Court's decision in Langley v. Mutual Fire, Marine \u0026 Inland Insurance Co., 512 So. 2d 752 (Ala.1987) overruled on other grounds, 551 So. 2d 259 (Ala.1989). After a thorough review of the cases discussing the public policy issue, the court affirmed its earlier conclusion that the retroactive restriction in the policy was unenforceable because it violates Alabama public policy. In light of Langley, the district court, however, held that First Alabama's negligence claim against Johnson \u0026 Higgins was barred by the applicable statute of limitations, but denied Johnson \u0026 Higgins' motion for a new trial. From these decisions, First State, Cameron \u0026 Colby, and Johnson \u0026 Higgins filed timely notices of appeal. First Alabama also filed a timely cross-appeal.\n\nFirst State first argues that the court erred in concluding that First Alabama's fraud claims are not barred by the applicable statute of limitations. Second, it contends that the court's finding that it committed fraud against First Alabama is clearly erroneous. Third, it argues that the court erred in granting the bank's motion for partial summary judgment and in striking its affirmative defense of failure to give timely notice of a claim. Fourth, the company asserts that the court erred in concluding that the claims made policy without prior acts coverage, which it sold to First Alabama, is unenforceable because it violates Alabama public policy. Fifth, First State claims that the court erred in entering allegedly inconsistent judgments against it on the fraud and contract claims. Finally, it contends that the court erred in awarding First Alabama prejudgment interest on its compensatory damage award. Johnson \u0026 Higgins also appeals arguing that the court erred in construing First Alabama's negligence claims as contract ones and in holding that the merger doctrine does not apply to bar First Alabama's contract claim. In its cross-appeal, First Alabama raises one issue. It argues that the court erred in denying it attorneys' fees from Johnson \u0026 Higgins for its litigation expenses against First State. The parties have raised numerous issues, and we discuss each issue separately.\n\nII. Statute of Limitations\n\nFirst State first contends that the district court erred by concluding that First Alabama's fraud claim is not barred by the applicable statute of limitations. We disagree.\n\nAt the time plaintiff filed this suit in 1983, the statute of limitations for a fraud action, ALA.CODE § 6-2-39 (1975) (repealed 1985), was one year from the date of the fraud.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e The Alabama Code, however, also contains § 6-2-3 which \"operates as a 'saving clause' by tolling the limitations period in fraud cases until the fraud is discovered.\"\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Lampliter Dinner Theater, Inc. v. Liberty Mut. Ins. Co., 792 F.2d 1036, 1042 (11th Cir.1986). At the time First Alabama brought this cause of action, this statute provided:\n\nIn actions seeking relief on the ground of fraud where the statute has created a bar, the claim must not be considered as having accrued until the discovery by the aggrieved party of the fact constituting the fraud, after which he must have one year within which to prosecute his claim. ALA.CODE § 6-2-3 (1975) (amended 1985).\n\nUnder this provision, the statute of limitations is tolled and \"the time period for bringing an action extended when there has been a fraudulent concealment by the party guilty of fraud.\" Parsons Steel, Inc. v. Beasley, 522 So. 2d 253, 256 (Ala.1988) (per curiam) (citing Ryan v. Charles Townsend Ford, Inc., 409 So. 2d 784 (Ala.1981)). According to the saving clause, a claim of fraud accrues when the injured party discovers the fact constituting the fraud. Id. at 256. In Alabama, fraud is \"'deemed to have been discovered when it ought to have been discovered; that is, at the time of the discovery of facts which would provoke inquiry by a person of ordinary prudence and which, if followed up, would have led to the discovery of the fraud.'\" Ramp Operations, Inc. v. Reliance Ins. Co., 805 F.2d 1552, 1554-55 (11th Cir.1986) (quoting Papastefan v. B \u0026 L Constr. Co., 385 So. 2d 966, 967 (Ala.1980)). A party seeking to rely on § 6-2-3 to toll the statute of limitations has the burden of proving fraudulent concealment. Sellers v. A.H. Robins Co., 715 F.2d 1559, 1561 (11th Cir.1983) (per curiam); see Kelly v. A.L. Williams Corp., 669 F. Supp. 1058, 1063 (N.D.Ala.1986). While the plaintiff bears the burden of proof, \"one who is being deceived . . . may be lulled into a false sense of security.\" Mann v. Adams Realty Co., 556 F.2d 288, 295 (5th Cir.1977).\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Thus, a plaintiff \"is not required to presume fraud or suspect it, until something comes to him leading a just person to suspect and make inquiry.\" Williams v. Bedenbaugh, 215 Ala. 200, 110 So. 286, 289 (1926).\n\nIn its amended complaint, which it filed in August 1984, plaintiff asserts that it discovered the facts constituting fraud during a recent document inspection \"within the last few months, considerably less than a year prior to the date of this amendment.\" Amended Complaint, Rec. 46, at 3. Specifically, the bank contends that it discovered the misrepresentation about First State's ability to offer prior acts coverage when it received copies of the First State correspondence files, containing the telexes from C.T. Bowring \u0026 Co. (\"Bowring\") to First State, during a document inspection. First Alabama avers that First State first produced its correspondence file for First Alabama in July 1984, see Plaintiff's Exhibit No. 33, and that it did not have access to that file before commencing this suit. After reviewing all the evidence presented, the district court made a supplemental finding of fact that \"FAB did not learn until 1983 of the availability of such coverage, or of other facts which, with reasonable diligence, would have led to the discovery of First State's fraud.\" District Court's Memorandum Opinion (May 26, 1988), Rec. 207, at 45. Thus, the court concluded that \"the statute of limitations did not begin to run on FAB's fraud claims against First State until 1983 and those claims are not barred.\" District Court's Memorandum Opinion (May 26, 1988), Rec. 207, at 45; Rec. 213, at 2 (amending finding of fact by deleting reference to agreed fact number 41).\n\nOn appeal, First State does not challenge the facts regarding the discovery of the fraud. Rather, it argues that plaintiff did not produce sufficient proof of when it discovered the alleged fraud or how it discovered the exact details of the fraudulent scheme. Where the facts regarding the discovery of fraud are not in dispute, the date of accrual of a statute of limitations is a question of law which we review de novo. Galindo v. Stoody Co., 793 F.2d 1502, 1508 (9th Cir.1986); see also Ramp Operations, 805 F.2d at 1558 (if facts on the discovery issue are uncontroverted, \"the time of discovery of fraud can be determined as a matter of law.\").\n\nBased on our own independent review of the record, we believe that plaintiff adequately sustained its burden of proving when it discovered the fraud, and that, with reasonable diligence, it could not have discovered the fraud earlier. At trial, Mosley testified that the bank discovered in August or September of 1983 that a new affiliate, Merchants, had a bank trust department E \u0026 O policy with prior acts coverage from First State for the 1976-1977 policy year. Tr. at 378. Since First Alabama had previously requested E \u0026 O insurance with prior acts coverage in 1976, the discovery of Merchants' policy put the bank on notice that a \"fraud may have been perpetrated.\" Lampliter Dinner Theater, 792 F.2d at 1043. Nevertheless, plaintiff amended its complaint to add a fraud claim against First State in August 1984, within the one year statute of limitations. See id. Since a party \"is not required to presume fraud or suspect it,\" Williams, 110 So. at 289, First Alabama met its burden of proving when it discovered the fraud and that it could not have discovered the exact nature of the fraud earlier because it did not have access to First State's files. While First State contends that the fraud claim is barred by the statute of limitations, there is no evidence in the record to indicate that plaintiff discovered the fraud earlier or that it should have discovered the fraud earlier. Thus, we agree with the district court that plaintiff's action accrued in 1983 and that it is not barred by the one-year statute of limitations.\n\nIII. Finding of Fraud\n\nHaving determined that plaintiff's fraud claim is not barred by the applicable statute of limitations, we now address the merits of that claim. First State challenges the district court's decision by arguing that the court's finding that it committed fraud against First Alabama is clearly erroneous. Alabama has codified the common law of fraud in sections 6-5-100 to 6-5-104 of the Alabama Code. See Ellis v. Zuck, 409 F. Supp. 1151, 1157 (N.D.Ala.1976), aff'd, 546 F.2d 643 (5th Cir.1977); Jim Short Ford Sales, Inc. v. Washington, 384 So. 2d 83, 86 (Ala.1980). In Ellis, the court set out a concise description of the scope of Alabama fraud:\n\nLiability may arise from a willful deception, an innocent misrepresentation concerning an existing fact, a reckless misrepresentation made without knowledge of its falsity, or the suppression of a material fact rather than an active misstatement. See Standard Oil Co. v. Myers, 232 Ala. 662, 169 So. 312 (1936) (willful deception); Birmingham Broadcasting Co. v. Bell, 259 Ala. 656, 68 So. 2d 314 (1953) (innocent misrepresentation); Southern Bldg. \u0026 Loan Ass'n v. Holmes, 227 Ala. 1, 149 So. 861 (1933) (statements recklessly made); Groover v. Darden, 259 Ala. 607, 68 So. 2d 28 (1953) (suppression actionable). However, it is clear that before liability for nondisclosure or suppression of facts will arise there must be special circumstances which give rise to an obligation to disclose. Hall Motor Co. v. Furman, 285 Ala. 499, 234 So. 2d 37 (1970).\n\nThe critical elements of an action for fraud generally include:\n\n(a) a false representation concerning an existing material fact, Birmingham Broadcasting. . .;\n\n(b) a representation which (1) the defendant knew was false when made, or (2) was made recklessly and without regard to its truth or falsity, or (3) was made by telling plaintiff that defendant had knowledge that the representation was true while not having such knowledge, Hockensmith v. Winton, 11 Ala. App. 670, 66 So. 954 (1914);\n\n(c) reliance by the plaintiff on the representation and that he was deceived by it, Bynum v. Rucker, 235 Ala. 353, 179 So. 241 (1938);\n\n(d) reliance which was justified under the circumstances, Fidelity \u0026 Casualty Co. v. J.D. Pittman Tractor Co., 244 Ala. 354, 13 So. 2d 669 (1943);\n\n(e) damage to the plaintiff proximately resulting from his reliance, Smith v. Smith, 266 Ala. 118, 94 So. 2d 863 (1957). Ellis, 409 F. Supp. at 1157; see ALA. CODE § 6-5-101 to § 102 (1975).\n\nFurthermore, the fraud of suppression of facts has additional requirements. In order for the suppression of facts to be actionable, there must be a duty to speak. See Ellis, 409 F. Supp. at 1157. A duty to disclose often arises when there is a confidential or fiduciary relationship between the parties. Id. The Alabama courts do not seem to focus on the \"designation of the relationship, such as vendor-vendee, etc., but instead look to the relative bargaining positions of the parties.\" Id. (citing Furman, 234 So.2d at 41, Metropolitan Life Ins. Co. v. James, 238 Ala. 337, 191 So. 352 (1939)) (cited with approval in Jim Walter Homes, Inc. v. Waldrop, 448 So. 2d 301, 305 (Ala.1983) (per curiam)); Jim Short Ford Sales, 384 So.2d at 87. Even when a confidential relationship between the parties does not exist, the particular circumstances of a situation can give rise to an obligation to disclose. Mann, 556 F.2d at 297; ALA.CODE § 6-5-102 (1975). When the accused has superior knowledge or expertise not shared by the plaintiff, the obligation to disclose is compelling. Mann, 556 F.2d at 297 (citing Chapman v. Rivers Constr. Co., 284 Ala. 633, 227 So. 2d 403, 410-13 (1969)); Ellis, 409 F. Supp. at 1157-58. In order to determine whether a duty to disclose exists, we must examine the facts of each individual case; \"a rigid approach is impossible, and, indeed, the words of the statute itself counsel flexibility.\" Jim Short Ford Sales, 384 So.2d at 87. Finally, even if one is not under a duty to speak, if he decides to do so, \"he must make a full and fair disclosure,\" without concealing any facts within his knowledge. Ellis, 409 F. Supp. at 1158 (citing Jackson Co. v. Faulkner, 55 Ala. App. 354, 315 So. 2d 591 (1975)).\n\nThe trial judge, as the finder of fact, found that \"First Alabama Bank is entitled to recover against First State for egregious fraud based upon its misrepresentation and failure to disclose material facts.\" District Court's Memorandum Opinion (Feb. 20, 1987), Rec. 188, at 33. A finding of fraud is a finding of fact, which we will not set aside on appeal unless it is clearly erroneous. Citibank, N.A., v. Citibanc Group, Inc., 724 F.2d 1540, 1544 (11th Cir.1984); United States v. Fernon, 640 F.2d 609, 613 (5th Cir. Unit B Mar. 1981).\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e After a thorough review of the record, we conclude that the district court's finding of fraud is not clearly erroneous.\n\nA. Misrepresentation\n\nFirst State challenges the district court's finding of fraud by arguing that certain elements of an action for fraud are missing under the facts of the instant case. Specifically, the company argues that the December 10 letter from First State to Johnson \u0026 Higgins was true, and thus not misleading. Second, it contends that First Alabama's reliance on its representation that it could not offer prior acts coverage was not reasonable and that the bank should have searched for this coverage elsewhere. Third, First State argues that its representation was not the proximate cause of plaintiff's damages because the representation was made in 1976, while plaintiff's claim for indemnity in Martin-Gerson falls under the 1978 policy. We will address each of these arguments in turn.\n\nA review of the record indicates that First Alabama communicated its desire for E \u0026 O insurance with prior acts coverage to First State in their October 1976 Boston meeting and at subsequent times. See Tr. at 102, 373. In fact, Ted Oxholm's handwritten notes from their 1976 Boston meeting demonstrate that First Alabama requested quotes on unlimited prior acts coverage and prior acts coverage dating back to January 1, 1975. See Plaintiff's Exhibit No. 42. Furthermore, Mosley testified at trial that the bank was willing to pay a higher premium to obtain prior acts coverage. Tr. at 373, 399.\n\nAt trial, Grinstead testified that in response to First Alabama's requests for prior acts coverage, First State said that it \"would see what [it] could do, but that it was an issue that London would decide.\" Id. at 105. Grinstead further testified that the bank was \"under the impression, and [it was] led to believe that First State or Cameron \u0026 Colby were basically wholesalers, and that the entire issue was up to London.\" Id. at 107.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nAfter its discussions with First Alabama, First State prepared a rating sheet for the bank with an additional ten percent premium for prior acts coverage back to January 1, 1975, and a twenty percent additional premium for unlimited prior acts coverage, which it submitted to Bowring in London. See Plaintiff's Exhibit No. 42. The contract 548 reinsurers agreed to provide prior acts coverage for additional premiums of twenty percent and thirty percent respectively. See Plaintiff's Exhibit No. 124. Following the Marsh syndicate's decision to provide reinsurance for prior acts coverage for one million dollars of coverage, Bowring presented the proposal to the Minnis syndicate. The Minnis syndicate also agreed to reinsure prior acts coverage, but one of its members, Weavers, whose approval was necessary for reinsurance at this level, was reluctant. Bowring's telex to Vincent dated December 1, 1976, states:\n\nFirst Alabama Bancshares [your] 11/104 548/excess layer agree terms. However Weavers group consider premium inadequate and full rating should be applied with modest discount for overall limit although considers this offset to large extent by virtue quicker erosion underlying aggregate. Also unenthusiastic about providing retro[active] cover on applicants with claims history noting they feel best avoid providing such cover if possible and then only on risks with clear record and if essential for order. Please advise.\n\nPlaintiff's Exhibit No. 126 (emphasis added).\n\nShortly thereafter, on December 10, 1976, Frank Vincent of First State sent a letter to Pat Green of Johnson \u0026 Higgins, who relayed the information to First Alabama. The letter states, \"after rather prolonged negotiations with our reinsurers, we have finally placed the necessary reinsurance. We are unable to offer any prior acts coverage.\" Plaintiff's Exhibit No. 53. The district court found that \"the letter sent to Johnson \u0026 Higgins was so misleading as to constitute fraud.\" District Court's Memorandum Opinion (Feb. 20, 1987), Rec. 188, at 36. We agree.\n\nRather than state that it could obtain only a limited amount of prior acts coverage from London or that it was unwilling to provide the coverage, First State sent an inherently misleading letter to Johnson \u0026 Higgins. In rebuttal, First State argues that the letter was not misleading because Geoffrey Harrison's deposition testimony indicates that Weavers refused to reinsure prior acts coverage. This argument misses the point. The record conclusively establishes that London was willing to provide prior acts coverage up to $1 million. Thus, even if Weavers had decided not to offer the coverage, the Marsh syndicate had already agreed to provide prior acts coverage up to a limit of $1 million. Second, a telex, written at the time of the negotiations, saying that Weavers was \"unenthusiastic\" and wanted to avoid providing prior acts coverage \"if possible,\" is a better indication of Weaver's position than deposition testimony given years later in anticipation of pending litigation.\n\nJudge Guin concluded that a fair reading of First State's letter gives the impression that \"First State was willing; however, its reinsurers in London would not agree to reinsure with prior acts coverage included.\" District Court's Memorandum Opinion (Feb. 20, 1987), Rec. 188, at 36. In fact, this is precisely the impression that Grinstead received. Grinstead, who Green called to discuss the contents of the letter, testified in his deposition that he believed it was a \"take it or leave it proposition.\" Grinstead Deposition at 118. Since the bank definitely wanted the coverage and believed that there were no other markets available, First Alabama decided to accept the First State policy with a retroactive date of December 14, 1976. First State's letter was a false representation which resulted in damage to the plaintiff because it was induced to accept the insurance without the coverage it desired.\n\nB. Suppression of Facts\n\nIn addition to sending First Alabama a misleading letter, First State also failed to disclose to the bank that it was its decision, not London's, not to offer the prior acts coverage. In his deposition, Frank Vincent testified that \"we made a final determination at Cameron \u0026 Colby as unwriter [sic] for First State Insurance Co.. . . that we were unwilling to provide prior acts. . . .\" Vincent Deposition at 221. In light of the fact that First State had previously indicated to First Alabama that whether it could get prior acts coverage was up to London, First State committed fraud by not disclosing that it, rather than London, had made the decision not to offer the coverage. Since First State failed to disclose that it made the decision not to offer the coverage, First Alabama was \"lulled into not discussing the matter with First State or seeking coverage elsewhere, as it would have done had all the facts been disclosed.\" District Court's Memorandum Opinion (Feb. 20, 1987), Rec. 188 at 37.\n\nUnder the particular circumstances of the instant case, we believe that First State had an obligation to disclose that it had made the decision not to offer the coverage, rather than London. The parties were not dealing at arms length because First State, a leading insurer of bank trust department E \u0026 O insurance, had better knowledge about the availability of this coverage than did its client, First Alabama. See Mann, 556 F.2d at 297; Ellis, 409 F. Supp. at 1157-58. When First Alabama inquired about obtaining prior acts coverage from First State, the company told the bank that the decision would be up to London. Once First State knew that London had agreed to provide the coverage, it concealed this fact from the bank and told it that prior acts coverage was unavailable. Thus, under the facts of the instant case, we believe that the district court was justified, as a matter of law, in concluding that First State was under a duty to disclose the facts to First Alabama. See Jim Walter Homes, 448 So.2d at 306 (holding that the seller had a duty to disclose to the buyer that there was a pending lawsuit on the property for sale). See also State Farm Mut. Auto Ins. v. Ling, 348 So. 2d 472, 475 (Ala.1977) (stating that an agent's engendering of trust and confidence imposes a duty to disclose material facts). Finally, even if First State was not under a duty to disclose, once it chose to speak and told the bank that the decision would be up to London, it was required to \"make a full and fair disclosure.\" Ellis, 409 F. Supp. at 1158.\n\nFirst State argues that the bank's reliance on its misrepresentations was unreasonable. We disagree. At trial, Bohannon testified that Pat Green of Johnson \u0026 Higgins had told him that \"there was only one company that was writing [prior acts] coverage, that being First State.\" Tr. at 91. When First Alabama presented its request for retroactive coverage to First State, it was told that the decision \"would be left up to London. . . .\" Id. at 102. Given the nature of the facts that First State concealed from the bank, we agree with the district court that First Alabama was \"lulled into not discussing the matter with First State or seeking coverage elsewhere . . . .\" District Court's Memorandum Opinion (Feb. 20, 1987), Rec. 188 at 37, because it believed its efforts would have been futile, see Tr. at 104-05, 201. Although the bank desperately wanted E \u0026 O insurance with prior acts coverage, it accepted the policy without the coverage because it believed that First State was unable to write prior acts and that there were no other markets for this type of coverage.\n\nFirst State next argues that its representation was not the proximate cause of plaintiff's injury because the representation was made in 1976, while the bank's claim for indemnity because of its loss in Martin-Gerson occurred during the 1978 policy year. We do not find this argument persuasive. The testimony presented at trial indicates that First Alabama made its desire for prior acts coverage known to First State in 1976 as well as in subsequent years. Bohannon and Mosley both testified that they discussed the bank's need for retroactive coverage at a 1977 meeting and possibly at a 1978 meeting. Id. at 109, 428. Furthermore, the evidence indicates that if First Alabama had obtained prior acts coverage as it requested in 1976, it would have continued to have this coverage in its 1977 and 1978 policies. See id. at 329-330. The record indicates that in over ninety percent of the cases when First State wrote a bank trust E \u0026 O policy with prior acts coverage, it continued to offer this coverage when the policies were renewed. See Plaintiff's Exhibits Nos. 86-88. In fact, policies with prior acts coverage were renewed in later years even when the banks had poor claims histories. See id.\n\nAs part of its proximate cause argument, First State also argues that First Alabama would not have qualified for prior acts coverage in 1978 because of its poor claims history and because of misrepresentations it made in its applications for coverage. The district court thoroughly examined these contentions and dismissed them saying \"there is no evidence that the Martin-Gerson claim or any circumstances which might give rise to that claim were known to First Alabama Bank at the time the applications were submitted.\" District Court's Memorandum Opinion (Feb. 20, 1987), Rec. 188, at 39. The court further added \"that First Alabama Bank made known to First State all matters which were alleged to have been concealed in the renewal applications from 1976 through 1980.\" Id. at 40. After a careful review of the record, we agree with the court's findings on this issue. Since the district court adequately addressed these arguments and because we find that the record supports the court's findings on this issue, we decline to address these same issues again.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nC. Punitive Damages\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nIn addition to challenging the trial court's finding of fraud, First State also contends that the court abused its discretion by awarding the plaintiff punitive damages. In American Honda Motor Co. v. Boyd, 475 So. 2d 835 (Ala.1985), the Alabama Supreme Court announced its new standard for awarding punitive damages in intentional fraud cases. In that case, the court held that punitive damages are recoverable when the \"evidence establishes an intent to deceive or defraud. . . .\" Id. at 839. The Alabama Supreme Court clarified its earlier decisions by explaining that the intent to deceive is sufficient to trigger the possibility of the imposition of punitive damages, without the additional requirement of a showing of maliciousness, oppressiveness, or grossness. Id. at 838. Furthermore, the imposition of punitive damages is always discretionary with the trier of fact. See Ford Motor Credit Co. v. Washington, 420 So. 2d 14, 17 (Ala.1982) (citing Neil Huffman Volkswagen Corp. v. Ridolphi, 378 So. 2d 700 (Ala.1979)).\n\nIn the instant case, the district court found that \"First State intended to mislead and did successfully mislead plaintiff.\" District Court's Memorandum Opinion (Feb. 20, 1987), Rec. 188, at 37. Judge Guin further found that \"the representations made and the failure to disclose material facts by First State were an attempt to gain a negotiating advantage by concealment of a very material fact--egregious fraud--the kind deserving of punishment by the imposition of punitive damages.\" Id. at 45. After carefully reviewing the record, we do not believe that the court abused its discretion by awarding punitive damages under the facts of this case. First State misrepresented to First Alabama that prior acts coverage was not available even though it knew that contract 548 and all, but one member of contract 549, had approved this coverage. Second, after telling the bank that the decision on whether to offer the coverage was London's, it failed to disclose the fact that it, not London, had made the decision not to offer the coverage. First State intended to deceive First Alabama by inducing it to rely on its representations that prior acts coverage was not available and by inducing it to accept an E \u0026 O policy without the coverage it desired, which was \"relatively risk-free\" for First State, see Griffin Deposition at 77. First Alabama, subsequently, was damaged when First State refused to indemnify it for the loss it sustained in the Martin-Gerson case.\n\nIV. Timely Notice of Claim\n\nFirst State next argues that the court erred in granting First Alabama's motion for partial summary judgment and in striking its affirmative defense of failure to comply with a condition precedent, providing timely notice of a claim. We disagree.\n\nIn this diversity case, we must apply federal law in determining whether the district court properly granted the bank's motion for partial summary judgment. Fitzsimmons v. Best, 528 F.2d 692, 694 (7th Cir.1976) (per curiam); Lighting Fixture \u0026 Elec. Supply Co. v. Continental Ins. Co., 420 F.2d 1211, 1213 (5th Cir.1969). A court should grant a party's motion for summary judgment if the record shows that \"there is no genuine issue as to any material fact and that the moving party is entitled to a judgment as a matter of law.\" FED.R.CIV.P. 56(c). There were no disputed facts on the notice of claim issue and the district court found that, as a matter of law, the defendant had waived its defense of failure to provide timely notice of a claim. We review the district court's decision de novo. Tackitt v. Prudential Ins. Co. of Am., 758 F.2d 1572, 1574 (11th Cir.1985).\n\nThe bank trust E \u0026 O insurance policy that First State issued to First Alabama in 1976 and all subsequent renewals of this policy contain condition six which provides, \"the Insured shall, as a condition precedent to any right to coverage under this Insurance, give to the Company immediate notice in writing (a) of any claim made against them during the Policy Period. . . .\" Plaintiff's Exhibits Nos. 1-5. First State contends that the bank failed to give it timely notice of the Martin-Gerson claim as required in the contract and that this failure to provide notice releases it from its obligations under the contract, even though it did not suffer prejudice. See Pharr v. Continental Casualty Co., 429 So. 2d 1018, 1020 (Ala.1983); Liberty Mut. Ins. Co. v. Bob Roberts \u0026 Co., 357 So. 2d 968, 971 (Ala.1978).\n\nThere is no dispute as to the timeliness of the notice which First Alabama provided to its insurer. First Alabama was served with process in Martin-Gerson on December 28, 1978, but did not inform the insurance company of the claim until December 10, 1979, when it mentioned the claim in an answer to a question on its renewal application. See Affidavit of Bette E. Mahoney, Rec. 55 (Exhibit G). First State, however, waived its right to rely on this defense. Under Alabama law, when an insurer specifically denies liability on one ground, it waives other grounds or defenses it might later seek to assert. E.g., American Auto. Ins. Co. v. English, 266 Ala. 80, 94 So. 2d 397, 402 (1957); Shears v. All States Life Ins. Co., 242 Ala. 249, 5 So. 2d 808, 816 (1942). In particular, defenses which are capable of being waived under the above principle are those that arise out of an express condition in the insurance contract. Wood v. Mutual of N.Y. Life Ins. Co., 405 F. Supp. 685, 686 (N.D.Ala.1975); see English, 94 So.2d at 402 (finding waiver of notice); Travelers' Ins. Co. v. Plaster, 210 Ala. 607, 98 So. 909, 911 (1924) (same).\n\nOn October 2, 1981, Eileen Dacey, an attorney for First State, sent a letter to Eric Bruggink, an attorney for First Alabama, denying liability for the Martin-Gerson litigation because of the absence of prior acts coverage in the policy. The letter states \"the retroactive date of coverage is December 14, 1976 and suit is wholly predicated on acts which occurred prior to the retroactive date.\" Plaintiff's Exhibit No. 61. The letter then quotes the language of exclusion (b) dealing with the lack of prior acts coverage and cites exclusion (f) (eliminating coverage for non-pecuniary claims), but never mentions the late notice defense or a general reservation of rights and defenses. See id. By specifically denying liability because of the lack of prior acts coverage and no other grounds, First State waived its right to later assert condition six of the contract, the late notice of claim defense.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nIn rebuttal, the defendant argues that it did not waive the late notice defense because its first response to the bank in a letter dated July 9, 1981, contains general reservation of rights language and its last letter to the bank about the claim, dated July 25, 1983, from Dacey to Nachman, an attorney for the bank, also contains general reservation of rights and defenses language. See id ; Plaintiff's Exhibit No. 66. Defendant's argument misses the point. Alabama law does not require all correspondence from an insurer to an insured to contain non-waiver language, nor does it require only the first and last correspondence to contain such language. While the defendant preserved its right to rely on the late notice defense in its July 9, 1981, letter, it subsequently waived this defense in its October 2, 1981, letter. The fact that a subsequent letter, dated July 25, 1983, contains non-waiver language does not work to reverse the waiver because a waiver is irrevocable and cannot be recalled. Franklin v. All States Life Ins. Co., 239 Ala. 430, 195 So. 230, 231 (1940); State Life Ins. Co. v. Finney, 216 Ala. 562, 114 So. 132, 134 (1927); Blue Cross \u0026 Blue Shield Inc. v. Taylor, 370 So. 2d 1040, 1043 (Ala.Civ.App.1979). First State waived its late notice defense and the district court was correct in granting plaintiff's motion for partial summary judgment because it was entitled to judgment as a matter of law.\n\nV. Public Policy\n\nThough the District Court held this E \u0026 O policy to be violative of public policy, this determination was not necessary to support either its conclusion regarding the liability of First State for fraud or its compensatory and punitive damage award. This is so because under Alabama law the district court's compensatory damage award would have been the same whether based upon breach of contract or fraud. Likewise we conclude that under Alabama law the award of prejudgment interest as modified by this opinion may be supported by fraud alone. Lapeyrouse Grain Corp. v. Tallant, 439 So. 2d 105 (Ala.1983). Accordingly, since the amount of the damage award in this case would be the same under either a fraud or breach of contract theory and since we have determined that First Alabama was properly awarded damages through its fraud theory, we need not place this court in the awkward position of being a federal forum divining a state's public policy. Consequently, we do not express any opinion on the correctness of the trial court's public policy holding.\n\nVI. Prejudgment Interest\n\nFirst State next argues that the district court erred in awarding First Alabama prejudgment interest. First State does not argue that the bank is not entitled to any prejudgment interest. Rather, it contends that the court incorrectly determined the date from which the interest should run. In essence, First State argues that since the contract is an indemnity policy, not a liability one, it was not required to compensate the bank, including interest, until the bank actually paid the loss in the Martin-Gerson suit. Since the bank did not pay the Martin-Gerson loss until sometime in September 1983, the court's award of interest dating back to August 19, 1981, when judgment was entered in Martin-Gerson, is improper. We agree.\n\nSection 8-8-8 of the Alabama Code provides:\n\nAll contracts, express or implied, for the payment of money, or other thing, or for the performance of any act or duty bear interest from the day such money, or thing, estimating it at its money value, should have been paid, or such act, estimating the compensation therefor in money, performed.\n\nALA.CODE § 8-8-8 (1975). Under this statute, prejudgment interest can be awarded only against \"sums as are certain or are capable of being made certain.\" Wood v. Central Bank, 435 So. 2d 1287, 1291 (Ala.Civ.App.1982) (citing Roe v. Baggett Transp. Co., 326 F.2d 298 (5th Cir. 1963)). Having determined that the amount of compensatory damages First State owed to First Alabama was a \"certain\" sum, the court awarded the bank prejudgment interest on its claim from August 19, 1981, until February 20, 1987, when it entered judgment in the instant case. District Court's Memorandum Opinion (May 26, 1988), Rec. 207, at 46. While we agree with the district court that First Alabama is entitled to recover prejudgment interest on its contract claim, we believe that the court erred in awarding interest dating back to August 19, 1981.\n\nIt is well established that an insured is entitled to collect interest only from the date the loss should have been paid to the date of judgment. Alabama Farm Bureau Mut. Casualty Ins. Co. v. Williams, 530 So. 2d 1371, 1378 (Ala.1988) (citing Great Am. Ins. Co. v. Railroad Furniture Salvage of Mobile, Inc., 276 Ala. 394, 162 So. 2d 488 (1964); Home Ins. Co. v. Adler, 71 Ala. 516 (1882); ALA. CODE § 8-8-8). In order to determine when the loss should have been paid in the instant case, we must ascertain whether the First State policy is a liability contract or an indemnity contract. \"The chief difference between a liability policy and an indemnity policy is that under the former a cause of action accrues when the liability attaches, while under the latter there is no cause of action until the liability has been discharged, as by payment of the judgment by the insured.\" 6B J. APPLEMAN INSURANCE LAW \u0026 PRACTICE § 4261 (rev. ed. 1979). Thus, \"under an indemnity policy the insured must have suffered an actual money loss before the insurer is liable.\" Id.; accord 11 G. COUCH, CYCLOPEDIA OF INSURANCE LAW § 44:4 (2d ed. 1982).\n\nAfter carefully reviewing the policy provisions and the applicable case law, we are convinced that the First State policy is an indemnity policy, not a liability one. The policy specifically provides that First State \"agrees to Indemnify the Insured . . . against: A. Loss incurred by the Insured, from any claims made against the Insured during the Policy Period. . . .\" Plaintiff's Exhibit No. 3 at 4. The term \"indemnity against loss\" means the indemnitor is not liable until the \"person indemnified makes payment or sustains loss.\" BLACK'S LAW DICTIONARY 692 (5th ed. 1979). Furthermore, the district court noted that this is a suit by First Alabama against First State \"for indemnity under a trust department errors and omissions insurance policy.\" District Court's Memorandum Opinion (Feb. 20, 1987), Rec. 188, at 1 (emphasis added). This conclusion is reinforced by the fact that the word \"indemnify\" is repeatedly mentioned in the contract. See Plaintiff's Exhibit No. 3.\n\nIn Little Cahaba Coal Co. v. Aetna Life Insurance Co., 192 Ala. 42, 68 So. 317 (1915), the Alabama Supreme Court held that an insurance policy, similar to the one before us today, was an indemnity policy. The contract in that case provided that \"defendant indemnified plaintiff 'against loss or expense arising or resulting from claims upon the assured on account of bodily injuries or death. . . . '\" Id. The contract in that case, as does the instant contract, also provided that the insured should forward all claims or summons to the insurer. Id. Although the court noted that ambiguous contracts should be construed in favor of the insured, it stated that this general rule should not be applied when a contract's meaning is clear. Id. 68 So. at 318. After reviewing the policy provisions, the court stated that \"by the great weight of authority contracts of this character are contracts of indemnity against loss, and not against liability. . . .\" Id. (emphasis added); see also Brown Mechanical Contractors, Inc. v. Centennial Ins. Co., 431 So. 2d 932, 945 (Ala.1983) (finding that the contract, which provided \"the Subcontractor hereby covenants to defend, indemnify, save harmless and exonerate the Contractor and the Owner as to and from all liability, claims, lawsuits and demands,\" was an indemnity contract (emphasis omitted)).\n\nTo support its contention that the court's award of interest was correct, First Alabama argues that the policy is a liability contract and points to condition three in the policy as support for its argument. Condition three is a no action clause which provides:\n\nNo action shall lie against the company unless, as a condition precedent thereto, the Insured shall have fully complied with all the terms of this policy, nor until the amount of the insured's obligation to pay shall have been finally determined either by judgment against the insured after actual trial or by written agreement of the insured, the claimant and the company.\n\nPlaintiff's Exhibit No. 3 at 2. While the presence of such a clause cannot convert a liability policy into an indemnity policy, see General Casualty Co. v. Larson, 196 F.2d 170, 173 (8th Cir.1952), its presence is not inconsistent with the policy being one for indemnity. It does not establish the point at which First State is obligated to pay a claim, it merely ensures that First State pays out only on meritorious claims.\n\nFirst Alabama also relies on Michel v. American Fire \u0026 Casualty Co., 82 F.2d 583 (5th Cir.1936), as support for its argument that the insurance policy is a liability contract. That case, applying Florida law, is not controlling. Nevertheless, in that case, the court concluded that a policy which provided the company agrees to \"indemnify the assured . . .--Liability Coverage $10,000 limit. . . against loss resulting directly from the ownership, maintenance or specified use of any automobile described herein on account of damages imposed by law upon the assured,\" was a liability contract. Id. at 586. However, the court, in dicta, noted that if the policy had used only the words \"indemnify against loss,\" as does the instant policy, then it would have construed it as an indemnity policy. See id. Furthermore, the Michel court also determined that the policy involved in that case was a liability contract because the insurer was fully responsible for defending the liability. See id. The Alabama Supreme Court has specifically rejected that reasoning and held that because an insurance company takes charge of the defense of an action, does not convert the policy from a liability one into an indemnity one. See Goodman v. Georgia Life Ins. Co., 189 Ala. 130, 66 So. 649, 650 (1914).\n\nHaving concluded that the insurance policy is an indemnity contract, we believe the court erred in awarding interest from August 19, 1981, the date judgment was entered in Martin-Gerson. The bank appealed the judgment and did not pay it until sometime in 1983. In an indemnity contract, the \"liability is deemed to be fixed upon the payment of the judgment by the insured, from which date only he is entitled to recover interest.\" G. COUCH, CYCLOPEDIA OF INSURANCE LAW § 56:15 (2d. ed. 1982). Thus, the critical date for awarding interest is the date on which First Alabama paid the judgment in Martin-Gerson. Although the record does not contain the exact date on which First Alabama paid the Martin-Gerson judgment, see tr. at 788-89, the record indicates that the bank paid the judgment sometime in September 1983. See id. at 789; C \u0026 C Exhibit No. 25. While Alabama law requires that the time when interest is due must be \"certain,\" see Wood, 435 So.2d at 1291 (citing Grand Bay Land Co. v. Simpson, 207 Ala. 303, 306, 92 So. 789, 791 (1922)), we believe that the date on which the bank paid the judgment is certain and easily verifiable.\n\nThus, we reverse the district court's award of prejudgment interest and remand this case to the court to recalculate the award of prejudgment interest in accordance with this opinion. On remand, the court should first ascertain when First Alabama paid the Martin-Gerson judgment. Second, the court should decide according to the policy when First State was required to indemnify the bank for its payment in Martin-Gerson. After making these determinations, the court should recalculate the award of prejudgment interest from that date to February 20, 1987, at the rate of 6% per annum.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nVII. Breach of Contract\n\nJohnson \u0026 Higgins also appeals arguing that the district court erred by construing First Alabama's tort claim as a contract one and by not ruling that the contract claim was barred by the merger doctrine. We disagree.\n\nBefore being appointed as First Alabama's exclusive insurance broker, Johnson \u0026 Higgins made an oral presentation to the bank's insurance committee. During its presentation, Johnson \u0026 Higgins stressed that it \"would function as an arm of management,\" Tr. at 37-38, and that it \"would shop the market to make sure that the [bank] got the best insurance coverage for the premium [it] paid,\" id. at 38. In addition to this oral presentation, Johnson \u0026 Higgins also submitted a written proposal entitled \"A Proposal of Risk Management Services for First Alabama Bancshares, Inc.\" to the bank. Besides emphasizing Johnson and Higgins' knowledge of insurance markets and financial institutions, the proposal states that Johnson \u0026 Higgins would \"review the competitive positions of insurance carriers in the marketplace and draw on our experience to evaluate their past and potential performance.\" Plaintiff's Exhibit No. 13 at 16. In its proposal, Johnson and Higgins promised the bank that \"once the quotes are in, we prepare a comparison sheet of premiums, coverage and service, and present alternative insurance plans to you.\" Id. at 16-17. Based on these representations, First Alabama appointed Johnson \u0026 Higgins as its exclusive insurance broker. See Plaintiff's Exhibit No. 14.\n\nThe district court found that First Alabama's appointment of Johnson \u0026 Higgins as its exclusive insurance broker \"created a relationship governed by the express terms of the proposals and other communications, and by the terms, standards and duties implied from the relationship itself.\" District Court's Memorandum Opinion (Feb. 20, 1987), Rec. 188, at 8. The court further found that the presentation and proposal were \"submitted, accepted and relied upon by First Alabama Bank and encompassed a detailed description of the marketing practices and techniques utilized by Johnson \u0026 Higgins. Clearly these representations amount to more than mere 'puffery.'\" Id. at 11. Johnson \u0026 Higgins does not challenge these findings on appeal.\n\nBased on its findings, the court concluded that Johnson \u0026 Higgins had breached its contractual obligations to First Alabama. Id. As the court stated, \"J \u0026 H failed to ascertain and advise FAB concerning the availability of prior acts coverage from sources other than First State. This failure constituted a breach of the express contract that existed between J \u0026 H and FAB and of the duty that arose by virtue of J \u0026 H's contractual status as FAB's insurance broker.\" District Court's Memorandum Opinion (May 26, 1988), Rec. 207, at 3.\n\nWhile Johnson \u0026 Higgins does not challenge the court's factual findings, it does argue that the bank's claims were based in tort (which is barred by the statute of limitations), not contract. Furthermore, Johnson \u0026 Higgins contends that even if there was a breach of contract, it was a breach of a contract to procure insurance, which is barred by the merger doctrine. We disagree.\n\nA. Liability in Tort v. Contract\n\nIn Alabama, when an insurance broker fails in the duties he assumes, one can sue him either for breach of contract or in tort. Highlands Underwriters Ins. Co. v. Elegante Inns, Inc., 361 So. 2d 1060, 1065 (Ala.1978) (per curiam); Waldon v. Commercial Bank, 50 Ala. App. 567, 281 So. 2d 279, 282 (1973). While many cases involving insurance brokers discuss breach of a contract to procure insurance, see, e.g., Langley, 512 So.2d at 752; Timmerman Ins. Agency, Inc. v. Miller, 285 Ala. 82, 229 So. 2d 475 (1969), Johnson \u0026 Higgins breached not only a contract to procure insurance, but also a contract to \"provide the knowledge and skill necessary to meet FAB's insurance needs.\" District Court's Memorandum Opinion (May 26, 1988), Rec. 207, at 44. Alabama law holds that when one contracts with another and expressly promises to use due care or to do an act, he is liable in both tort and contract when his negligence injures the other party. See Blumberg v. Touche Ross \u0026 Co., 514 So. 2d 922, 927 (Ala.1987); Eidson v. Johns-Ridout's Chapels, Inc., 508 So. 2d 697, 702 (Ala.1987). \"He is liable in contract for breaching an express promise to use care,\" and the injured party can choose which cause of action to pursue. Blumberg, 514 So.2d at 927. Alabama has held that one can sue an accounting firm in contract for breach of its express agreement, see id. at 925, and one can sue a funeral home in contract for breach of its express promises, see Eidson, 508 So.2d at 703. Thus, because Johnson \u0026 Higgins made express promises on how it would meet First Alabama's insurance needs in both its oral presentation and written proposal, upon which the bank relied, we believe the court's holding that plaintiff's action sounds in contract is correct under Alabama law.\n\nTo determine whether the court was correct in holding that Johnson \u0026 Higgins had breached its contract with First Alabama, we must also discuss the obligations of an insurance broker to its principal. \"'An insurance broker is the agent of the insured in negotiating for a policy, and owes a duty to his principal to exercise reasonable skill, care, and diligence in effecting insurance.'\" Timmerman, 229 So.2d at 477 (quoting 16A J. APPLEMAN INSURANCE LAW \u0026 PRACTICE § 8841 (rev. ed. 1981)). An insurance broker is expected \"'to possess reasonable knowledge of the types of policies, their different terms, and the coverage available in the area in which his principal seeks to be protected.'\" Bates v. Gambino, 72 N.J. 219, 370 A.2d 10, 13 (1977) (per curiam) (quoting 16A J. APPLEMAN INSURANCE LAW \u0026 PRACTICE § 8845 (rev. ed. 1981)); See also Stein, Hinkle, 313 N.W.2d at 304 (allowing plaintiffs to reform their insurance policy because their agent did not inform them about the availability of prior acts coverage). Proper diligence requires an insurance broker to \"canvass the market\" and to be informed about \"different companies and terms available.\" Zeff Distrib. Co. v. Aetna Casualty \u0026 Surety Co., 389 S.W.2d 789, 795 (Mo.1965).\n\nFurthermore, an insurance broker can assume additional duties by an express agreement. See Hardt v. Brink, 192 F. Supp. 879, 881 (W.D.Wash.1961). Whether a broker assumes additional responsibilities depends on the relationship between the parties. See id. In this case, First Alabama made its desire for trust department E \u0026 O insurance with prior acts coverage known to Johnson \u0026 Higgins in 1976 and in subsequent years. Tr. at 102, 105, 377. Johnson \u0026 Higgins represented to the bank that it would \"shop the market\" and present alternative insurance policies to it. Furthermore, as First Alabama's exclusive broker, see Green Deposition at 25; Plaintiff's Exhibit No. 14, Johnson \u0026 Higgins promised that it would make its client \"aware of various alternatives.\" Jenniges Deposition at 66. Jenniges testified that if a client wanted a particular type of coverage, the company would \"look at all available sources. If one source wouldn't provide the need, they would go to other sources.\" Id. at 125-26.\n\nJohnson \u0026 Higgins, however, breached its contract by failing to comply with its express promises. Although Pat Green conceded that First Alabama needed the broadest coverage available, Tr. at 918, he did not canvass the market on behalf of his client. Green testified that he could not recall whether he had contacted other carriers, besides First State, for E \u0026 O insurance with prior acts coverage for First Alabama. Id. at 889; see Green Deposition at 127. In fact, after having reviewed the files, John Wall, an expert witness, testified that Johnson and Higgins did not approach any markets other than First State for the coverage. Tr. at 510, 650.\n\nWhile Johnson \u0026 Higgins informed the bank that First State was the only source for prior acts coverage, id. at 91, 202, 377, the bank presented overwhelming evidence that other companies were offering E \u0026 O insurance with prior acts coverage in 1976. Id. at 518, 533, 554; Johnson \u0026 Higgins' Answers to Plaintiff's Interrogatories, Rec. 119, at 2; Plaintiff's Exhibit No. 49 at 3. Although Johnson \u0026 Higgins approached only First State on behalf of First Alabama, Johnson \u0026 Higgins contacted these other companies for their other clients. See Plaintiff's Exhibit No. 46.\n\nWhile Johnson \u0026 Higgins admits that other companies were offering prior acts coverage, it argues that First State was the leader in trust department E \u0026 O insurance, see Tr. at 876, 954, and that other carriers were not suitable for the bank's needs, see, e.g., id. at 959, 962-64, 970. These arguments miss the point. Although coverage from other carriers might not have been appropriate for the bank's needs, Johnson \u0026 Higgins nevertheless had an obligation to inform the bank about the available options. Once Johnson \u0026 Higgins had informed the bank about the possible options, then the bank could have made an informed decision on whether to request coverage from these other companies. For example, although Johnson \u0026 Higgins' expert, Donahue, testified that MGIC Indemnity Corporation would offer E \u0026 O insurance with prior acts coverage only if First Alabama also bought its directors and officers insurance from this company, see id. at 962, Johnson \u0026 Higgins should have presented this information to the bank and let it decide whether it wanted to switch its directors and officers insurance to another carrier. As the district court said, \"By failing to advise and inform First Alabama Bank of the other markets for prior acts coverage, Johnson \u0026 Higgins effectively precluded the opportunity of considering such options, and Johnson \u0026 Higgins' negligence prevented any opportunity for plaintiff to pursue and obtain other options.\" District Court's Memorandum Opinion (Feb. 20, 1987), Rec. 188, at 25.\n\nJohnson \u0026 Higgins also contends that the company adhered to its instructions from First Alabama because Kurt Grinstead specifically told Charles Slusne of Johnson \u0026 Higgins not to conduct a survey of markets for prior acts coverage in 1978, the year when the Martin-Gerson claim arose. Johnson \u0026 Higgins presented this argument to the district court, and the court rejected it. So do we. If Johnson \u0026 Higgins had properly canvassed the market and obtained prior acts coverage for the bank in 1976, First Alabama would most likely have had this coverage in 1978. See Tr. at 329-330; Plaintiff's Exhibits Nos. 86-88. Second, although First Alabama might not have reiterated its desire for prior acts coverage at its 1978 meeting with Johnson \u0026 Higgins, the evidence indicates that the broker knew of the bank's continuing desire for this coverage. Since First Alabama never indicated that its interest in prior acts coverage had changed, even without a specific request \"Johnson \u0026 Higgins' duty as a broker, given the relationship of the parties, would require it to know and advise First Alabama Bank of the availability of such coverage\" and the \"potential repercussions of staying with First State without the benefit of prior acts coverage.\" District Court's Memorandum Opinion (Feb. 20, 1987), Rec. 188, at 14-15. Moreover, because Johnson \u0026 Higgins told First Alabama that it had contacted other carriers and that First State was the only company writing prior acts coverage, Tr. at 91, 202, Grinstead may have reasonably believed that it would have been futile to seek the coverage elsewhere. Therefore, we conclude that the district court correctly held that plaintiff's action against Johnson \u0026 Higgins sounds in contract and that the broker breached its contract with the bank by failing to comply with the representations it made in its oral presentation and written proposal.\n\nB. Merger\n\nFinally, Johnson \u0026 Higgins argues that plaintiff's breach of contract claim is barred by the merger doctrine. The merger doctrine provides that if a \"policy is accepted by the insured, he is bound thereby even though the policy does not correspond to the preliminary negotiations. The oral negotiations for the policy are merged in the accepted policy.\" Langley, 512 So.2d at 766 (quoting Smith v. Protective Life Ins. Co., 355 So. 2d 728, 730 (Ala.Civ.App.1978)); Accord Sexton v. Liberty Nat'l Life Ins. Co., 405 So. 2d 18, 22 (Ala.1981); Hartford Fire Ins. Co. v. Shapiro, 270 Ala. 149, 117 So. 2d 348, 354 (1960). The merger doctrine, however, does not apply to bar First Alabama's suit because this was not merely a contract to procure insurance. Johnson \u0026 Higgins agreed to \"provide the expertise necessary to meet FAB's insurance needs.\" District Court's Memorandum Opinion (May 26, 1988), Rec. 207, at 44; See Sexton, 405 So.2d at 22 (noting that the merger doctrine does not bar suit on express promises independent of the policy contract); Shapiro, 117 So.2d at 352 (holding that the merger doctrine does not apply to agreements which are separate and distinct from agreements embodied in the insurance policy). Furthermore, because Johnson \u0026 Higgins breached its contract to canvass the market, First Alabama was not aware of the availability of prior acts coverage. Thus, the merger doctrine cannot apply to bar First Alabama's contract claim against Johnson \u0026 Higgins under the facts of the instant case.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nVIII. Recovery of Attorneys' Fees\n\nFinally, we address the merits of First Alabama's cross-appeal. The bank claims that the court erred in ruling that it was not entitled to recover litigation expenses, including attorneys' fees, from Johnson \u0026 Higgins for expenses it incurred in suing First State. Specifically, the bank contends that it is entitled to recover attorneys' fees from Johnson \u0026 Higgins because Johnson \u0026 Higgins' breach of contract forced it to sue First State. We disagree.\n\nIn Alabama, \"attorneys' fees or expenses of litigation are not recoverable as damages, in [the] absence of a contractual or statutory duty, other than a few recognized grounds of equity principles.\" Elegante Inns, 361 So.2d at 1065-66 (citing State v. Alabama Pub. Serv. Comm'n, 293 Ala. 553, 307 So. 2d 521 (1975); Hartford Accident \u0026 Indem. Co. v. Cosby, 277 Ala. 596, 173 So. 2d 585 (1965)). However, one exception to the general rule that Alabama does recognize is that \"where the natural and proximate consequences of the defendant's wrongful act causes the plaintiff to become involved in litigation with a third person, attorneys' fees and other expenses incurred in such litigation may be recovered as damages.\" Id. at 1066; accord George E. Jensen Contractor, Inc. v. Quality Mill Works, 431 So. 2d 1232, 1234 (Ala.1983); Johnson v. Martin, 423 So. 2d 868, 871 (Ala.Civ.App.1982). In order to recover attorneys' fees against a defendant, the plaintiff must prove the following elements: \"(1) The plaintiff must have incurred attorneys' fees in the prosecution or defense of a prior action. (2) The litigation must have been against a third party and not against the defendant in the present action. (3) The plaintiff must have become involved in such litigation because of some tortious act of the defendant.\" Elegante Inns, 361 So.2d at 1066 (citation omitted).\n\nAlthough Elegante requires that the plaintiff must have incurred the attorneys' fees in a prior proceeding, the Elegante court, as well as other courts, have declined to follow this requirement. Wood v. Old Sec. Life Ins. Co., 643 F.2d 1209, 1218 (5th Cir. Unit A May 1981) (applying Alabama law); see Mutual Fire, Marine \u0026 Inland Ins. Co. v. Costa, 789 F.2d 83, 89 (1st Cir.1986). Furthermore, while Elegante Inns involved a tortious breach of duty, the above rule, allowing recovery of attorneys' fees, also applies where litigation with a third party was the result of the breach of a contractual duty between the parties. Quality Mill Works, 431 So.2d at 1234.\n\nIn Elegante Inns, the court held that a restaurant owner was entitled to collect attorneys' fees from his insurance broker for his expenses in suing his insurer for reformation of the insurance policy. 361 So.2d at 1066. In that case, although the insurance broker was negligent for endorsing the policy over to the owner's lessee, the insurer was innocent of any wrongdoing. Similarly, in Wood, the court ruled that the plaintiff could recover its litigation expenses from its insurance agent for costs it incurred in suing its insurance company to recover under the policy. 643 F.2d at 1218. In that case, the insurance company was also innocent of any wrongdoing, but the insurance agent was negligent in procuring the insurance policy. As the Wood court stated, \"in both Elegante Inns and the instant case, the insured was required to sue the insurer to collect the proceeds of the policy solely because of the agent's (at best) careless conduct with respect to the insured's rights under the policy. . . .\" Id. (emphasis added).\n\nIn contrast, there is no indication that First Alabama would not have sued First State but for Johnson \u0026 Higgins' breach of contract. Since the bank asserted and prevailed on both its fraud and breach of contract claims against First State because of the company's misrepresentations and failure to disclose material facts, it is evident that First Alabama \"had a separate, independent interest in the litigation.\" Quality Mill Works, 431 So.2d at 1235. Because we believe that First Alabama would have pursued its contract and fraud claims against First State regardless of Johnson \u0026 Higgins' breach of contract, we do not believe that First Alabama \"is a mere passive middleman caught up\" in litigation with a third-party. Id. Thus, we agree with the district court that the presence of these independent causes of action against First State \"prevents the application of [ Elegante Inns ] in the instant case.\" District Court's Memorandum Opinion (June 30, 1987), Rec. 201, at 5.\n\nThe district court correctly noted that \"the third-party exception to the general rule was not intended to allow a plaintiff to recover attorneys' fees in such a case.\" Id. at 7. In fact, an exception to the general rule prohibiting the recovery of attorneys' fees should be construed narrowly. See Cincinnati Ins. Co. v. City of Talladega, 342 So. 2d 331, 339 (Ala.1977) (concluding that § 16, a provision for award of attorneys' fees, applies only to labor and materials bonds); Alliance Ins. Co. v. Reynolds, 504 So. 2d 1215, 1216 (Ala.Civ.App.1987) (refusing to extend the attorney fee exception in fraud cases beyond the common fund fact situation); see also Alabama Pub. Serv., 307 So.2d at 540 (noting that there are only a few recognized exceptions to the general rule prohibiting the recovery of attorneys' fees). Thus, if we were to allow the bank to recover attorneys' fees from Johnson \u0026 Higgins in this case, we would be improperly broadening Alabama's third-party exception. This is something we cannot and will not do. Thus, we affirm the district court's decision not to award the plaintiff attorneys' fees under the facts of this case.\n\nIX. Conclusion\n\nIn conclusion, we AFFIRM the district court's judgment on all issues except the prejudgment interest. On that issue alone, we REVERSE and REMAND to the district court with instructions to determine the proper date from which the interest should be payable and then to recalculate the amount of interest from that date.\n\nTJOFLAT, Chief Judge, concurring in part and dissenting in part:\n\nI concur in part VII of the majority's opinion affirming the district court's judgment in favor of appellee First Alabama Bank against appellant Johnson \u0026 Higgins. The remainder of the majority opinion, however, troubles me.\n\nUnder the guise of Alabama's law of fraud, the majority, in affirming the district court's finding of fraud on the part of appellant First State Insurance Company,\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e today announces and applies a new maxim of equity: equity will not suffer a loss to be without a remedy that is extracted from every party to the transaction that resulted in the loss.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e After carefully reviewing the extensive record in this case, I find not even a trace of evidence to suggest that First State committed fraud against First Alabama. In the absence of such evidence, I would hold that the district court's finding of fraud was erroneous.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Also, I would hold that the district court erred in its awards of compensatory and punitive damages. I therefore dissent from part III of the majority's opinion, dealing with the fraud and damages issues, and part VI, dealing with prejudgment interest. I concur only in the result of part VIII, dealing with attorneys' fees.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nFurthermore, the district court misinterpreted Alabama public policy in holding the insurance contract at issue void as contrary to public policy. The majority today notes that First Alabama's fraud claim adequately supports the district court's award of damages and wisely refrains from \"express[ing] any opinion on the correctness of the trial court's public policy holding.\" Ante, at 1064. Because I would hold that the district court erred in finding fraud on the part of First State, however, I must address the alternative basis of First State's liability. Although I agree with the majority that a federal court places itself in an \"awkward position\" when it attempts to divine a state's public policy, Alabama's caselaw is, in my view, sufficiently clear to make this endeavor feasible. I submit that, in time, the district court's holding, rather than prior occurrence exclusions in claims-made insurance policies, will prove to be the real detriment to Alabama's public welfare.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nAfter briefly reviewing, in part I of this opinion, the salient facts in this case, I address in part II the fundamental issue on appeal: whether First State committed fraud against First Alabama. The majority has failed to recognize that the facts allegedly concealed and misrepresented were not material and that the alleged concealment and misrepresentation were not the proximate cause of First Alabama's injury. Moreover, the majority has ignored important principles of agency law in Alabama, and I demonstrate that, when those principles are applied to the facts in this case, First Alabama's fraud claim simply evaporates. In part III, I examine the district court's awards of compensatory and punitive damages and show that the court erred in granting those awards. Finally, in part IV, I show how the district court misinterpreted Alabama public policy and that Alabama caselaw indicates that this contract would be enforced by the Alabama courts.\n\nI.\n\nIn the fall of 1975, after deciding to consolidate the insurance coverage of its affiliate banks, First Alabama (a holding company) received proposals from several major insurance brokers. After reviewing various proposals, First Alabama announced in December of that year that it had appointed Johnson \u0026 Higgins to be its \"exclusive Insurance Broker with respect to all lines of insurance.\" First Alabama wanted errors and omissions (E \u0026 O) coverage, as part of the overall plan of risk management services, for the trust departments of the banks it owned. To that end, Johnson \u0026 Higgins placed Patrick Green in charge of securing trust department E \u0026 O coverage for First Alabama. Green considered himself to be an expert in the field of trust department E \u0026 O coverage, and that view was shared by his colleagues and, apparently, his superiors at Johnson \u0026 Higgins.\n\nDespite his knowledge of other providers of trust department E \u0026 O coverage, Green contacted only one primary carrier: First State, which he believed to be the \"leader\" in that type of coverage. After receiving quotations on premiums from First State, Green suggested that representatives of First Alabama meet with representatives of First State; Green believed that carriers are more likely to lower their premiums when they meet with, and are impressed by, representatives of an insured.\n\nOn October 29, 1976, Green and John Jenniges of Johnson \u0026 Higgins, Ted Oxholm and Frank Vincent of First State, and Kurt Grinstead and James Bohannon of First Alabama met in First State's offices in Boston. The meeting centered around a presentation by Bohannon of First Alabama's audit procedures but concluded with a brief discussion of the availability of trust department E \u0026 O coverage for acts or omissions occurring prior to the effective date of the policy. According to Oxholm's notes of the meeting, First Alabama requested alternate quotes for coverage of (1) all prior acts and (2) acts occurring after January 1, 1975. First State's precise response to this request is extremely significant but, unfortunately, not to be found in the record. In part II, I explore in detail the various witnesses' recollections of what was said and the significance of First State's response. Suffice it to say that Oxholm told the representatives of First Alabama that he would discuss some aspect of the request with First State's reinsurers in London.\n\nFirst State proposed to its reinsurers in London that prior acts coverage back to January 1, 1975, be given for a ten percent additional premium and unlimited prior acts coverage be given for a twenty percent additional premium. Reinsurance for up to one million dollars was agreed to, but one reinsurer expressed a lack of enthusiasm over providing coverage for the one-to-five million dollar level. On December 10, 1976, Vincent wrote to Green as follows:\n\nAfter rather prolonged negotiations with our reinsurers, we have finally placed the necessary reinsurance. However, we regret that we must revise our original premium indications as follows: [premium quotations]\n\nWe are unable to offer any prior acts coverage.\n\n(Emphasis added.) Green, who did not discuss prior acts coverage with any other primary carriers, relayed this information to First Alabama. First Alabama elected to purchase the policy without prior acts coverage from First State, according to Bohannon, because Green told representatives of First Alabama that \"there was only one company that was writing [prior acts] coverage, that being First State.\"\n\nThe remaining facts are predictable. Prior acts coverage was indeed available in 1976. First Alabama incurred substantial liability for acts occurring prior to the retroactive date of the trust E \u0026 O policy. First Alabama notified First State of the liability, and First State denied coverage.\n\nII.\n\nTo demonstrate that the district court's finding that First State committed fraud against First Alabama is erroneous, I first examine First State's representations to First Alabama, assuming that no agency principles are applicable that would impute Johnson \u0026 Higgins' knowledge to First Alabama. I thus show that, even if the relationships between the three primary actors were as the majority characterizes them--that is, no special relationship existed between First Alabama and Johnson \u0026 Higgins--First State committed no fraud. I then apply the familiar rule of agency law that the knowledge of the agent is imputed to the principal, in order to prove that First Alabama's fraud claim is virtually frivolous.\n\nA.\n\nThe common law of fraud in Alabama has been codified at Ala.Code §§ 6-5-100 to -104 (1975). Although familiar, the essential elements of actionable fraud bear repeating. A plaintiff must prove:\n\n(a) a false representation concerning an existing material fact;\n\n(b) a representation which (1) the defendant knew was false when made, or (2) was made recklessly and without regard to its truth or falsity, or (3) was made by telling plaintiff that defendant had knowledge that the representation was true while not having such knowledge;\n\n(c) reliance by the plaintiff on the representation and that he was deceived by it;\n\n(d) reliance which was justified under the circumstances;\n\n(e) damage to the plaintiff proximately resulting from his reliance.\n\nEllis v. Zuck, 409 F. Supp. 1151, 1157 (N.D.Ala.1976) (citations omitted), aff'd, 546 F.2d 643 (5th Cir.1977). To succeed on a fraud claim based on suppression of material facts, a plaintiff must show that the defendant had a duty to speak arising from (1) a confidential relationship between the parties, (2) the relative bargaining positions of the parties, (3) particular circumstances such as the superior knowledge or expertise of the defendant, or (4) a partial revelation of facts within the defendant's knowledge. See id. at 1157-58.\n\nFirst Alabama alleged, and the district court found, that First State committed fraud against First Alabama by both affirmatively misrepresenting certain facts and suppressing other facts. Assuming that First State did misrepresent or suppress facts, nothing that First State said, or failed to say, conceivably constituted a material fact or proximately caused First Alabama's loss as required under Alabama law.\n\nThe majority affirms the district court's holding based on the following crucial allegations:\n\n1. When First State was asked during the meeting in Boston to provide premium quotations for prior acts coverage, Oxholm replied (according to Kurt Grinstead of First Alabama) that \"they would see what they could do, but that it was an issue that London would decide.\"\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\n2. First State was able to secure commitments from the London reinsurers of up to one million dollars coverage for prior acts, but it was unable to secure commitments for the one-to-five million dollar range.\n\n3. First State told First Alabama, through Patrick Green, that it was \"unable\" to provide prior acts coverage and thus, according to the district court, created the impression that it was precluded from offering such coverage because of a decision made by the London reinsurers.\n\n4. First State did not inform First Alabama that the London reinsurers were only reluctant to provide prior acts coverage in the one-to-five million dollar range.\n\n5. Green (according to James Bohannon of First Alabama) informed Bohannon that First State was the only company at the time writing coverage for prior acts.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nFrom these allegations, which the district court accepted as true, the court concluded that First State fraudulently \"lulled [First Alabama] into not discussing the matter with First State or seeking coverage elsewhere.\" First Alabama Bank v. First State Ins. Co., No. 83-G-2082-S, mem. op. at 37 (N.D.Ala. Feb. 20, 1987). Thus, according to the majority today, First Alabama was \"induced to accept the insurance without the coverage it desired.\" Ante, at 1059.\n\nEven assuming that the five allegations listed above correctly characterize the facts in this case, I am convinced that the majority and the district court have misapplied Alabama's law of fraud. As noted above, a misrepresentation or concealment of facts is not actionable as fraud if the facts were not material or if the defendant's conduct did not proximately cause the plaintiff's injury. Torres v. State Farm Fire \u0026 Cas. Co., 438 So. 2d 757, 758 (Ala.1983). Materiality and proximate cause are both absent from this case. I address these two requirements in order.\n\n1.\n\nA material fact is one that induces action on the part of the plaintiff. Cooper v. Rowe, 208 Ala. 494, 94 So. 725, 726 (1922); Jackson Co. v. Faulkner, 55 Ala. App. 354, 315 So. 2d 591, 596 (1975). Lord Chancellor Brougham described the concept of materiality as follows:\n\nNow, my lords, what inference do I draw from these cases? It is this, that general fraudulent conduct signifies nothing; that general dishonesty of purpose signifies nothing; that attempts to overreach go for nothing, unless all this dishonesty of purpose, all this fraud, all this intention and design, can be connected with the particular transaction, and not only connected with the particular transaction, but must be made to be the very ground upon which this transaction took place, and must have given rise to this contract.\n\nAttwood v. Small, 6 Clark \u0026 Fin. 232, 447 (1838) (emphasis in original), quoted in 2 J. Pomeroy, A Treatise on Equity Jurisprudence § 890, at 1843 (4th ed. 1918).\n\nI submit that the facts allegedly misrepresented and suppressed clearly do not rise to the level of materiality required under Alabama law. This becomes apparent if we assume that First State had disclosed to First Alabama every item of information available to First State. Thus, assume that First State revealed to First Alabama (1) that the decision not to offer prior acts coverage was made by First State, rather than its reinsurers, and (2) that the reinsurers had been willing to commit to coverage of up to one million dollars. In that situation, First Alabama would have received the following statements: (1) a statement by First State that it was unwilling, because of substantial risk, to write the prior acts coverage desired by First Alabama; and (2) a statement by Patrick Green that First State was the only company writing prior acts coverage.\n\nA finding by the district court that First Alabama would have been prompted to look elsewhere for coverage had it been aware of this information would be clearly erroneous. Regardless of First State's motive in denying coverage, First Alabama-- according to a representative of Johnson \u0026 Higgins --was faced with a denial by the only company providing such coverage. Given Patrick Green's statement, nothing First State said or failed to say regarding its reason for denying coverage could conceivably have altered First Alabama's conduct. Yet, Alabama's requirement of materiality is not satisfied unless the misrepresentation or suppression induced the plaintiff to change its conduct. See Cooper, 94 So. at 726. Therefore, First State's alleged misrepresentation and suppression were not material.\n\n2.\n\nAlabama's law of fraud also requires that the alleged misrepresentation or concealment of fact be the proximate cause of the plaintiff's injury. See Ellis, 409 F. Supp. at 1160; Torres, 438 So.2d at 758; Smith v. Smith, 266 Ala. 118, 94 So. 2d 863, 868 (1957). The doctrine of proximate cause in the context of fraud is identical to the doctrine of proximate cause in the context of ordinary negligence. Just as a negligent act need not be the sole cause of a plaintiff's injury, a fraudulent misrepresentation or suppression of fact need not be the \"sole cause, if it [is] proximate, immediate, and material.\" Farrar v. Churchill, 135 U.S. 609, 615, 10 S. Ct. 771, 773, 34 L. Ed. 246 (1890); see Marshall v. Crocker, 387 So. 2d 176, 178 (Ala.1980) (\"it is not indispensable that the misrepresentation or concealment shall be the sole inducement\" (quoting Jordan \u0026 Sons v. Pickett, 78 Ala. 331, 338 (1884)). However, the injury must be \"the natural and probable consequence of the negligent act or omission (or direct wrongful act) which an ordinary prudent person ought reasonably to foresee would result in injury.\" Peevy v. Alabama Power Co., 393 So. 2d 971, 973 (Ala.1981). Moreover, there must be no \"intervention of any new or independent cause, [which] produces the injury.\" Morgan v. City of Tuscaloosa, 268 Ala. 493, 108 So. 2d 342, 346 (1959) (quoting Smith v. Alabama Water Serv. Co., 225 Ala. 510, 143 So. 893, 896 (1932)).\n\nThe evidence in this case plainly cannot support a finding of proximate cause. Even assuming that the misrepresentation and suppression of fact by First State were material, the injury would not have occurred but for Green's alleged representation to First Alabama that First State was the only company writing prior acts coverage. In fact, the district court specifically held that the breakdown at Johnson \u0026 Higgins \" directly caused the failure of First Alabama Bank to obtain prior acts coverage from First State itself, as well as precluding First Alabama Bank from the opportunity of obtaining such coverage from other sources.\" First Alabama Bank v. First State Ins. Co., No. 83-G-2082-S, mem. op. 18 (N.D.Ala. Feb. 20, 1987) (emphasis added). The majority today implies as much when it finds that \"since the bank definitely wanted the coverage and believed that there were no other markets available, First Alabama decided to accept the First State policy with a retroactive date of December 14, 1976.\" Ante, at 1058-59. Thus, Green's statement independently caused First Alabama's injury.\n\nOf course, if First State reasonably should have foreseen that a Johnson \u0026 Higgins representative would make such a statement, then the causal chain would not have been broken. See Morgan, 108 So.2d at 346. Johnson \u0026 Higgins, however, held itself out to have expertise in the field of trust department E \u0026 O coverage, and First State recognized that expertise. In light of this expertise, nothing should have alerted First State to the possibility that Johnson \u0026 Higgins was not aware of other companies writing prior acts coverage. Thus, First Alabama's injury could not have been a foreseeable result of First State's misrepresentation and suppression of fact, and a finding of proximate cause in this case would be erroneous.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nThis case is analogous to the case of Meeks v. Garner, 93 Ala. 17, 8 So. 378 (1890). Although rather old, Meeks' interpretation of Alabama law is still valid. In Meeks, a vendor, who had acquired title to his property by adverse possession, represented to a vendee that the vendor had always possessed title to the land. Although the vendor clearly misrepresented a fact, the court focused on the subsequent conduct of third parties. The court held that a \"vendor cannot be held responsible for a fraudulent misrepresentation as to his title, simply because third parties engage in blackmailing or malicious litigation with his vendee, or because others, not competent to judge of the title, refuse to purchase from the vendee.\" Meeks, 8 So. at 379. Obviously, the court was concerned with holding a vendor liable for misrepresentations that caused an injury only with the aid of a third party's independent and unforeseeable conduct. I am similarly concerned and would therefore decline to hold First State liable for Green's statement.\n\nB.\n\nCharacterizing the relationships between First State, Johnson \u0026 Higgins, and First Alabama as the majority characterizes them (that is, without recognizing the agency relationship between First Alabama and Johnson \u0026 Higgins), First State committed no actionable fraud. Now, I depart from the majority's approach and apply principles of agency law that the majority fails to consider.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Johnson \u0026 Higgins certainly acted as First Alabama's agent in procuring trust department E \u0026 O coverage, and, once the implications of that relationship are factored into the analysis of this case, one can see that First Alabama acted unjustifiably in relying, as it did, on First State's misrepresentation and suppression of facts. In this section, I review certain relevant principles of Alabama's agency law and show why those principles are applicable to this case. Then, I examine how the application of those principles affects the justifiability of First Alabama's reliance on First State's statements and omissions.\n\n1.\n\na. The Agency Relationship\n\nAs a threshold matter, one must determine whether Johnson \u0026 Higgins was First Alabama's agent in procuring trust department E \u0026 O coverage. In Alabama, an insurance broker becomes an insured's agent\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e when two requirements are satisfied. First, the broker must exclusively represent one party when negotiating and transacting business with other parties. In other words, the broker is not the insured's agent when the broker \"acts as intermediate negotiator between the parties to a transaction.\" Strumpf v. State, 31 Ala. App. 409, 18 So. 2d 104, 107 (1944). Second, the insured must have the right to control the broker. Brown v. Commercial Dispatch Publishing Co., 504 So. 2d 245, 246 (Ala.1987).\n\nAll of the evidence in this case suggests that Johnson \u0026 Higgins acted solely as the representative of First Alabama in procuring trust department E \u0026 O coverage. In a letter written on First Alabama's letterhead, James Bohannon stated that \" we have appointed Johnson \u0026 Higgins of Georgia, Inc. as our exclusive Insurance Broker with respect to all lines of insurance.\" (Emphasis added.) Bohannon also testified that Johnson \u0026 Higgins \"would function as an arm of management, so to speak.\" Nothing in the record indicates that Johnson \u0026 Higgins acted as an \"intermediate negotiator\" between First Alabama and First State.\n\nSecond, Alabama courts hold that no agency relationship exists unless the alleged principal has a right of control over the agent. The Alabama Supreme Court has held that \"for one to be an agent, the other party must retain the right to direct the manner in which the business shall be done, as well as the results to be accomplished, or, in other words, not only what shall be done, but how it shall be done.\" Brown, 504 So.2d at 246.\n\nThe record clearly indicates that First Alabama possessed the degree of control over Johnson \u0026 Higgins contemplated by the Brown court. Green stated in deposition\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e that Johnson \u0026 Higgins \"took direction from [First Alabama]. We gave them suggestions and took direction.\" Johnson \u0026 Higgins' initial proposal to First Alabama emphasized the degree of control that First Alabama would exercise: \"Once the quotes are in, we prepare a comparison sheet of premiums, coverage and service, and present alternative insurance plans to you. . . . We often use graphs to explain which plans work best at which retention levels. We offer our recommendation for the best plan.\" (Emphasis added.) Thus, First Alabama did not treat Johnson \u0026 Higgins as an independent contractor by merely hiring Johnson \u0026 Higgins to survey the market and purchase the best policy; rather, Johnson \u0026 Higgins was hired to survey the market, present the results of that survey to First Alabama, and purchase a policy according to First Alabama's direction. I submit that this degree of control is more than sufficient to establish an agency relationship between First Alabama and Johnson \u0026 Higgins.\n\nb. Knowledge Imputed to the Principal\n\nAlabama courts have always adhered to the general rule that the agent's knowledge is treated as the principal's knowledge. See, e.g., Carnival Cruise Lines, Inc. v. Goodin, 535 So. 2d 98, 103 (Ala.1988); National Union Fire Ins. Co. v. Lomax Johnson Ins. Agency, Inc., 496 So. 2d 737, 739 (Ala.1986). When the agent acquires the knowledge \"in transacting the business of the principal in the scope of his authority, the constructive notice thereby drawn is conclusive.\" Tennessee Valley Bank v. Williams, 246 Ala. 563, 21 So. 2d 686, 689 (1945); see Sullivan v. Alabama Power Co., 246 Ala. 262, 20 So. 2d 224, 230 (Ala.1944) (\"where notice is thus acquired it is indisputable\"). This constructive notice or knowledge is based on a presumption that the agent has fulfilled his duty to make relevant disclosures to his principal. See National Union, 496 So.2d at 739.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nThe rule of constructive knowledge has been consistently applied to agency relationships found to exist in transactions involving insurance contracts. Alabama courts have long held that notice to an insurer's agent constitutes notice to the insurer. See, e.g., Connell v. State Farm Mut. Auto. Ins. Co., 482 So. 2d 1165, 1167 (Ala.1985); Alabama Farm Bureau Mut. Cas. Ins. Co. v. Moore, 435 So. 2d 712, 714 (Ala.1983); Phoenix Ins. Co. v. Copeland, 86 Ala. 551, 6 So. 143, 145 (1889). Although no Alabama court, of which I am aware, has considered the issue of imputing knowledge of an insured's agent to the insured, all of the courts and commentators that have addressed the issue have applied the rule of constructive knowledge. See, e.g., Peel v. American Fidelity Assurance Co., 680 F.2d 374, 377-78 (5th Cir.1982); Merchants Fire Assurance Corp. v. Lattimore, 263 F.2d 232, 240 (9th Cir.1959); Standard of Am. Life Ins. Co. v. Humphreys, 257 Ark. 618, 519 S.W.2d 64, 66 (1975); Tamburine v. Center Savings Assoc., 583 S.W.2d 942, 949 (Tx.Ct.Civ.App.1979); 16 J. Appleman \u0026 J. Appleman, Insurance Law and Practice § 8728, at 350 (1981). As one court has stated, when an insured's broker/agent communicated with the insurer, \"it was as if [the insured] himself did so.\" Century Indemnity Co. v. Jameson, 333 Mass. 503, 131 N.E.2d 767, 769 (1956).\n\nGiven (1) the overwhelming authority in support of the proposition that the knowledge of the insured's agent should be imputed to the insured, and (2) the Alabama courts' consistency in applying agency principles to the insurance context, cf. National Union Fire Ins. Co. v. Schwab, 241 Ala. 657, 4 So. 2d 128, 130 (1941) (\"insured must bear the consequences of false swearing by the agent\"), I predict that the Alabama courts would adopt the rule of constructive notice with regard to an insured and his agent.\n\nAfter carefully reviewing the record, I have found that Patrick Green of Johnson \u0026 Higgins acquired crucial information and knowledge that, under the rules of agency, should be imputed to First Alabama. First, Green stated several times that, at the time he was acting as First Alabama's agent in procuring trust department E \u0026 O coverage, he knew that First State and other companies wrote such coverage without the prior acts exclusion. Green testified as follows:\n\nQ And you didn't find out that [First State] did on occasion endorse that coverage [for prior acts] out until much later; is that not true?\n\nTHE WITNESS: No. I don't know that's true. A few of these exclusions can be purchased, can be eliminated. You can get them back.\n\nQ Did you know that in 1976?\n\nA Yes.\n\nA . . . .\n\nIf [prior acts coverage] was available with Scarborough, I'm sure I knew. . . .\n\nI said the Scarborough policy was a higher price, and [a representative of First Alabama] said, to hell with that, let's go. . . .\n\nQ . . . In connection with this first placement in 1976, did you ever represent to . . . First Alabama . . . at any time in connection with this first placement that there were no other markets available for Trust E \u0026 O at that time?\n\nA I wouldn't say that. I wouldn't say there were no markets. There [were] other markets. . . . I knew about the markets. I wouldn't have said that at all.\n\nQ All right, sir. Did you say--do you recall saying anything to anyone in connection with First Alabama . . . that there was no other market available that would write prior acts coverage for them?\n\nA No. I don't remember any such conversation.\n\nQ At the time you placed First Alabama . . . or recommended to [First Alabama's] Insurance Committee the placement with First State . . ., were you aware of other markets that were available at that time?\n\nA I just went through the whole renewal situation with the Fulton Bank\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e which was back in June or July of that year, which is about the same time [I] was going through First Alabama. . . .\n\nFurthermore, Green knew that it was possible, if not likely, that First State, rather than its reinsurers, made the decision not to provide coverage for prior acts.\n\nQ Now, [Vincent says in his letter of December 10, 1976], \"We [are] unable to offer any prior acts coverage.\"\n\nA Correct.\n\nQ What did that relate to?\n\nA Exactly what it says, they wouldn't give prior acts coverage.\n\nQ When you read that, did you understand that to mean that he was not permitted to provide prior acts coverage?\n\nTHE WITNESS: Cameron and Colby [the parent of First State] would not provide the coverage.\n\nA Frank [Vincent] makes his own deals with reinsurers, any insurance company does. It is not up to me to speculate who wouldn't provide it.\n\n(Emphasis added.)\n\nThis knowledge was acquired by Green \"in transacting the business of [First Alabama] in the scope of his authority.\" See Tennessee Valley Bank, 21 So.2d at 689.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e Therefore, a conclusive presumption arises under Alabama law that First Alabama had constructive notice of this information. See id.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\n2.\n\nAs I note above, Alabama courts require a plaintiff's reliance on a defendant's fraudulent statements to be justifiable. For many years, the Alabama Supreme Court's definition of justifiable reliance has remained unchanged-always couched in terms of reasonableness. The Alabama Supreme Court has stated that \"because it is the policy of courts not only to discourage fraud but also to discourage negligence and inattention to one's own interests, the right of reliance comes with a concomitant duty on the part of the plaintiffs to exercise some measure of precaution to safeguard their interests.\" Southern States Ford, Inc. v. Proctor, 541 So. 2d 1081, 1083 (Ala.1989) (quoting Torres v. State Farm Fire \u0026 Cas. Co., 438 So. 2d 757, 758-59 (Ala.1983)). Therefore, \"where a party has reason to doubt the truth of the representation or is informed of the truth before the acts, he has no right to act on the representation.\" Taylor v. Moorman Mfg. Co., 475 So. 2d 1187, 1189 (Ala.1985); see Tillis v. Smith Sons Lumber Co., 188 Ala. 122, 65 So. 1015, 1019 (1914).\n\nThe Alabama Supreme Court, however, appears to have relaxed the reasonableness requirement somewhat. In I.N. Hickox v. Stover, 551 So. 2d 259, 263 (Ala.1989) (quoting Southern States Ford, 541 So.2d at 1081 (Hornsby, C.J., specially concurring) (unpublished)), the court established the following test:\n\nA plaintiff, given the particular facts of his knowledge, understanding, and present ability to fully comprehend the nature of the subject transaction and its ramifications, has not justifiably relied on the defendant's representation if that representation is \"one so patently and obviously false that he must have closed his eyes to avoid the discovery of the truth.\"\n\nThus, the court seems to have made proving justifiable reliance easier. See id. 551 So.2d at 266-67 (Houston, J., concurring in part and dissenting in part) (arguing that majority overruled concept of reasonable reliance as set forth in Torres).\n\nGiven, however, that First Alabama acquired constructive knowledge of other markets for prior acts coverage and of the possibility that First State made an independent decision not to provide prior acts coverage, one can only conclude that First Alabama's purported reliance on First State's misrepresentation and suppression of fact was unjustifiable, even under the less stringent Hickox standard. First Alabama constructively knew that other companies, as well as First State, were writing prior acts coverage. Moreover, it constructively knew that the decision not to provide prior acts coverage could very well have been made by First State independently. Yet, by relying on First State's statements, First Alabama purportedly was \"lulled\" into not seeking coverage elsewhere or pursuing the matter further with First State. To rely in this manner on First State's misrepresentation and suppression of fact was simply unjustifiable--First Alabama must have \"closed [its] eyes to avoid the discovery of the truth.\" See id. 551 So.2d at 263. Consequently, the district court erred in finding that First State committed actionable fraud against First Alabama.\n\nIII.\n\nAlthough assessing damages against First State should not even be an issue in this case, I am compelled to express my views on the district court's and majority's treatment of this issue. The district court assessed actual damages against First State in the amount of $3,000,000 and punitive damages in the amount of $3,000,000. The majority cursorily affirms both awards. Even assuming that First State committed actionable fraud against First Alabama, I think the district court erred in making both awards.\n\nA. Actual Damages\n\nIn Alabama, the general measure of damages for fraud includes all damages naturally and proximately resulting from the wrong. Winn-Dixie Montgomery, Inc. v. Henderson, 371 So. 2d 899, 902 (Ala.1979). The plaintiff, however, must affirmatively prove to the factfinder the amount of damages; if he fails to do so, the omission may not be corrected by speculation or conjecture. Continental Volkswagen, Inc. v. Soutullo, 54 Ala. App. 410, 309 So. 2d 119, 122-23 (1975).\n\nAssuming that First Alabama could have purchased the prior acts coverage elsewhere, it failed to meet its burden by not adducing evidence as to the amount of additional premium it would have had to pay to secure prior acts coverage. I find the district court's failure to address this issue particularly disturbing. When a plaintiff seeks damages of this nature, a court \" must [take] into consideration in calculating the loss to the plaintiff that which he has saved by reason of not having to perform.\" Whiting v. Dodd, 39 Ala. App. 80, 94 So. 2d 411, 414 (1957) (emphasis added).\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e Neither the record nor the district court tells us what First Alabama saved in premiums by not having prior acts coverage.\n\nIn essence, the court granted First Alabama relief that it did not seek--reformation\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e--by reforming the parties' insurance contract to include coverage for prior acts and giving First Alabama a judgment under that coverage. The district court called this de facto reformation \"damages.\" Even assuming that First Alabama had sought reformation, a court may reform a contract only to reflect the true intent of the parties; it may not reform a contract to create a new agreement. Rohleder v. Family Shows, Inc., 435 So. 2d 95, 97 (Ala.Ct.Civ.App.1983). Furthermore, reformation--an equitable remedy--may be granted only when there is no adequate legal remedy. Moss v. Crabtree, 245 Ala. 610, 18 So. 2d 467, 468 (1944). The district court's de facto reformation did create a new agreement--one clearly not intended by either party at the time they entered into the contract--and did so when the standard measure of damages clearly would have been adequate. Thus, the district court erred regardless of whether its award could be characterized as damages or reformation.\n\nB. Punitive Damages\n\nEqually troubling is the award of $3,000,000 in punitive damages. Of course, in such a case as this, where no actionable fraud was committed, the district court may not award punitive damages based on the defendant's misrepresentation and suppression of fact. See Coastal Concrete Co. v. Patterson, 503 So. 2d 824, 830 (Ala.1987) (fraud claim must support award of at least nominal compensatory damages before jury may award punitive damages). Even if First State did commit actionable fraud, however, the district court erred in awarding punitive damages to First Alabama.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nPunitive damages may not be imposed without evidence to support a finding that the defendant intended to deceive the plaintiff, Hopkins v. Lawyers Title Ins. Corp., 514 So. 2d 786, 790-91 (Ala.1986), or acted in wanton or reckless disregard of the plaintiff's rights, Gulf Atlantic Life Ins. Co. v. Barnes, 405 So. 2d 916, 925 (Ala.1981). The district court found such evidence. The district court found that \"First State intended to mislead and did successfully mislead [First Alabama].\" First Alabama Bank v. First State Ins. Co., No. 83-G-2082-S, mem. op. at 37 (N.D.Ala. Feb. 20, 1987). It also found that \"the representations made and the failure to disclose material facts by First State were an attempt to gain a negotiating advantage by concealment of a very material fact--egregious fraud--the kind deserving of punishment by the imposition of punitive damages.\" Id. at 45.\n\nA trier of fact, however, \"has no untrammeled discretion to speculate upon the existence of fraudulent intent. Any finding on the issue must be based on reasonable inferences from the evidence, and intent to defraud must be clearly proved by a preponderance of the evidence.\" Purcell Co. v. Spriggs Enters., 431 So. 2d 515, 519 (Ala.1983). I have carefully searched the record and have not found even a scintilla of evidence to support a reasonable inference that First State had an intent to deceive First Alabama or acted in wanton and reckless disregard of First Alabama's rights. To attribute this level of culpability to First State merely because it told a highly sophisticated brokerage firm it was \"unable\" to provide the coverage is patently ridiculous. I am continually confronted with two questions: (1) Why would Johnson \u0026 Higgins be deceived by this statement? and (2) Why would First State think that, with this statement, it could deceive a major brokerage firm that certainly was aware of all the relevant information? The record, the district court, and the majority provide no answers.\n\nThe district court's findings on this issue were merely speculations and therefore cannot support an award of punitive damages.\n\nIV.\n\nThe district court held, in a second opinion devoted entirely to the public policy issue, that \"in this factual setting the prior acts exclusion violates the public policy of Alabama.\"\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e First Alabama Bank v. First State Ins. Co., No. 83-G-2082-S, mem. op. at 41 (N.D.Ala. May 26, 1988). The district court was careful to note that not all claims-made policies with prior acts exclusions are void in Alabama; it held merely that, given the circumstances of this case, this particular contract violates public policy. Despite this narrow holding, the district court reached an incorrect result for two reasons. First, tightly interwoven with the district court's characterization of the circumstances of this case is an assumption that First State committed actionable fraud against First Alabama. Having shown that this assumption is erroneous, I am compelled to analyze the public policy issue from a completely different perspective. Second, the district court simply misconstrues the cases that test insurance contracts in light of public policy.\n\nIn this part, I first explore how courts in general, and Alabama courts in particular, examine contracts in light of public policy concerns and show that the district court adopted an improper approach to this question. I then examine the contract at issue, applying a better-founded interpretation of Alabama public policy.\n\nA.\n\nThe district court correctly noted that no Alabama court has directly considered a claims-made policy with a prior acts exclusion in light of the state's public policy. Thus, the court attempted to glean from related cases guiding principles that Alabama courts presumably would use in evaluating this contract, concluding that the courts generally construe public policy to favor (1) coverage coextensive with the insured's legal liability, and (2) freedom of contract. I agree that courts are often concerned with these two principles, but submit that the underlying concerns of these principles are (1) the adequate provision of goods and services to the public, and (2) the relative bargaining power of the parties to the contract; therefore, insurance contracts should be evaluated in light of these more general concerns.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e To prove the validity of these principles, I review the statutes and caselaw on this issue.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\n1. A Definition of \"Public Interest\"\n\nIn Alabama, \"the true test to determine whether a contract is unenforceable because of public policy is whether the public interest is injuriously affected in such a substantial manner that private rights thereunder should yield to the public interest.\" Taylor v. Martin, 466 So. 2d 977, 979 (Ala.Ct.Civ.App.1985). \"If it definitely appears that enforcement of a contract will not be followed by injurious results generally, at least what the parties have agreed to ought not to be struck down.\" Lowery v. Zorn, 243 Ala. 285, 9 So. 2d 872, 874 (1942). Alabama cases generally give us no more guidance than these cursory statements. What is the \"public interest,\" and when is it substantially injured? What are \"injurious results\"? One finds many cases in which contracts are tested against public policy, but rarely does one find a case in which the court attempts to answer these more general questions or provide guidance for later courts evaluating slightly different contracts.\n\nExamining the many tributary statutes and cases that have fed into the modern statement of the public policy test provides many helpful insights into the Alabama courts' conception of the \"public interest.\" First, one inevitably encounters the policy disfavoring contracts in restraint of trade, which is now codified at Ala.Code §§ 8-1-1, -10-1 to -10-3 (1975). In cases enforcing that policy, immediately apparent is the Alabama courts' view that encouraging the provision of necessary goods and services enhances the public interest. In Maddox v. Fuller, 233 Ala. 662, 173 So. 12 (1937), for example, the Alabama Supreme Court held a covenant not to compete in the ginning industry valid under Alabama public policy. The court focused on the fact that the \"public was deprived of no existing ginning facilities\" and that unfettered competition in the market would create a \"situation wherein additional capital outlay and overhead operating expenses may lead to abuses hurtful to the public interest, and ultimately to a crippling of efficient services at reasonable cost.\" Id., 173 So. at 16 (emphasis added).\n\nAgain, in Harris v. Theus, 149 Ala. 133, 43 So. 131 (1907), the Alabama Supreme Court noted the following important considerations when it examined a contract to sell a business and a covenant not to compete: \"Nothing is abandoned, and only a transfer is accomplished. The same occupation continues. The same number of mouths are fed.\" Id., 43 So. at 133 (quoting Tuscaloosa Ice Mfg. Co. v. Williams, 127 Ala. 110, 28 So. 669, 671-72 (1899) (quoting in turn Oliver v. Gilmore, 52 F. 562, 568 (C.C.D. Mass.1892))). These cases clearly indicate that the Alabama courts define the \"public interest\" to include an interest in maintaining a supply of goods and services at a reasonable price. See James S. Kemper \u0026 Co. Southeast v. Cox \u0026 Assocs., 434 So. 2d 1380, 1384 (Ala.1983) (contracts in restraint of trade \"not only deprive the public of efficient service, but tend to impoverish the individual\").\n\nSecond, tracing back through the history of Alabama's public policy test reveals an underlying concern with the liberty of contract and, necessarily, the relative bargaining positions of the parties. In Anderson v. Blair, 202 Ala. 209, 80 So. 31 (1918), the Alabama Supreme Court noted:\n\nIt must not be forgotten that you are not to extend arbitrarily those rules which say that a given contract is void as being against public policy, because, if there is one thing which more than another public policy requires, it is that men of full age and competent understanding shall have the utmost liberty of contracting, and that their contracts when entered into freely and voluntarily shall be held sacred and shall be enforced by courts of justice.\n\nId., 80 So. at 33 (emphasis added) (quoting Printing \u0026 Numerical Registering Co. v. Sampson, 19 L.R.-Eq. 462, 465 (1875) (Jessel, M.R.)); see Lowery, 9 So.2d at 874. Obviously, the Alabama Supreme Court has considered a contract that was not \"voluntarily and fairly made\" to be detrimental to the public interest. See Lowery, 9 So.2d at 874; cf. Morgan v. South Central Bell Tele. Co., 466 So. 2d 107, 117 (Ala. 1985) (criteria used to determine whether exculpatory clause contrary to public policy include (1) relative bargaining positions, (2) whether contract of adhesion involved, and (3) whether weaker party subject to stronger party's control).\n\nIn Lowery, the court cited Baltimore \u0026 O.S. Ry. v. Voigt, 176 U.S. 498, 20 S. Ct. 385, 44 L. Ed. 560 (1900), which in turn quoted extensively from Railroad Co. v. Lockwood, 84 U.S. (17 Wall.) 357, 21 L. Ed. 627 (1873). Lockwood provides perhaps the clearest exposition of when a contract is not voluntarily and fairly made and, hence, detrimental to the public interest. Analyzing a contract that limited a common carrier's liability for acts constituting ordinary negligence, the Court stated:\n\nThe carrier and his customer do not stand on a footing of equality. The latter is only one individual of a million. He cannot afford to higgle or stand out and seek redress in the courts. His business will not admit such a course. He prefers, rather, to accept any bill of lading, or sign any paper the carrier presents; often, indeed, without knowing what the one or the other contains. In most cases, he has no alternative but to do this, or abandon his business. . . .\n\nConceding, therefore, that special contracts, made by common carriers with their customers, limiting their liability, are good and valid so far as they are just and reasonable; to the extent, for example, of excusing them for all losses happening by accident, without any negligence or fraud on their part; when they ask to go still further, and to be excused for negligence--an excuse so repugnant to the law of their foundation and to the public good--they have no longer any plea of justice or reason to support such a stipulation, but the contrary. And then, the inequality of the parties, the compulsion under which the customer is placed, and the obligations of the carrier to the public, operate with full force to divest the transaction of validity.\n\nId. at 379-82 (emphasis added); see also 14 S. Williston, A Treatise on the Law of Contracts § 1628, at 6 (3d ed. 1972).\n\nThese cases show that the Alabama courts, and American courts in general, define \"public interest\" primarily as society's concern for protecting parties in clearly inferior bargaining positions and encouraging the supply of goods and services at reasonable prices. I submit that all of the cases cited by the district court support this definition. I therefore turn to the major cases cited by the court to show that the principles I have developed still guide the courts in their struggles to declare public policy with regard to the insurance industry.\n\n2. Insurance Contracts and the Public Interest\n\nThe district court discusses two cases at length-- Langley v. Mutual Fire, Marine \u0026 Inland Ins. Co., 512 So. 2d 752 (Ala.1987), overruled on other grounds, I.N. Hickox v. Stover, 551 So. 2d 259 (Ala.1989), and James \u0026 Hackworth v. Continental Cas. Co., 522 F. Supp. 785 (N.D.Ala.1980). In both of those cases, the insured filed a claim after the expiration date of a claims-made policy. Both courts upheld the policies against public policy attacks, obviously basing their decisions on the fact that both insureds were given the opportunity to purchase extended coverage and voluntarily turned down that coverage. See James \u0026 Hackworth, 522 F. Supp. at 788-89; Langley, 512 So.2d at 760. These decisions are in accord with the guiding principle that public policy frowns on contracts enforced to the detriment of a party with inferior bargaining power. The insureds had an alternative to the contract they accepted and were under no compulsion to accept a policy without extended coverage. The same principle can be found at work in other cases cited by the court. See, e.g., St. Paul Fire \u0026 Marine Ins. Co. v. General Mut. Ins. Co., 282 Ala. 695, 213 So. 2d 856, 859 (1968); Rotwein v. General Accident Group \u0026 Continental Cas. Co., 103 N.J.Super. 406, 247 A.2d 370, 377-78 (Law Div.1968).\n\nClosely related to these cases are the cases that have held policies void as against public policy. In every case cited by the district court in support of this proposition, the court held that the insurance policy at issue constituted a contract of adhesion.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e See, e.g., Sparks v. St. Paul Ins. Co., 100 N.J. 325, 495 A.2d 406, 415-16 (1985); Jones v. Continental Cas. Co., 123 N.J. Super. 353, 303 A.2d 91, 94 (Ch.Div.1973). In these cases, the individual insureds had no alternative but to accept or to reject the policy, entering into contracts that the Lockwood and Lowery courts certainly would have declared void based on the inequality of bargaining positions. See Lockwood, 84 U.S. (17 Wall.) at 381-82; Lowery, 9 So.2d at 874.\n\nHaving traced the development of the public policy test and distilled a generalized definition of public interest, and now having proved that definition to be the guiding principle in every recent relevant case of which I am aware, I believe it is safe to test the contract at issue with the principles developed in this section. Therefore, I consider next the trust department E \u0026 O policy issued by First State to First Alabama.\n\nB.\n\nIn this section, I show that the insurance contract in this case was not void as against public policy, given the twofold definition of the public interest developed above. First, the contract resulted from the negotiations of two powerful and sophisticated corporations and reflects a deliberate choice on the part of First Alabama. Second, holding this contract void would result in decreasing the supply of this type of coverage in Alabama.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e I address each point in turn.\n\n1.\n\nFirst Alabama is a major corporation that retained as its agent the brokerage firm of Johnson \u0026 Higgins, a recognized expert in the field of trust department E \u0026 O coverage. First Alabama hired Johnson \u0026 Higgins because of its expertise; therefore Johnson \u0026 Higgins' vast knowledge of the marketplace was imputed to its principal, First Alabama.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e Representatives of First Alabama and Johnson \u0026 Higgins met with representatives of First State in Boston to discuss the price and other terms of the policy. The favorable impression created by First Alabama at that meeting apparently resulted in more advantageous premiums.\n\nThen, Johnson \u0026 Higgins, acting as First Alabama's agent, made a voluntary decision to recommend acceptance of the policy, with full knowledge of the policy's terms and that other insurers provided prior acts coverage. As I note above, see supra at 1079-80, Johnson \u0026 Higgins' knowledge of the marketplace and of the possibility that First State made an independent decision not to offer prior acts coverage should be imputed to First Alabama. Given this background, I find it impossible to hold that the contract was one of adhesion or resulted from unequal bargaining positions.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e The contract was \"voluntarily and fairly made\" and therefore should not be held void as against public policy. See Lowery, 9 So.2d at 874; Anderson, 80 So. at 33.\n\n2.\n\nAlabama's definition of public interest provides a second reason for not holding this contract void: such a holding would discourage insurance companies from writing trust department E \u0026 O coverage with prior acts exclusions. Although the district court purported to issue a narrow holding, it sends a strong warning to insurance companies to write coverage with a prior acts exclusion at their own risk. The holding creates the possibility that an insurance company's prior acts exclusion will be held void. Given the fact-sensitive nature of such a decision,\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e however, the company will be unable to predict accurately when a court will strike its exclusion and impose substantial liability.\n\nThis possibility is sufficient to persuade insurance companies that writing trust department E \u0026 O coverage with prior acts exclusions is simply too risky in Alabama. Yet, the record indicates that insurance companies prefer to write such coverage for new clients with the prior acts exclusion. When an insurance company writes trust E \u0026 O coverage for a new client, it cannot estimate the risk of liability from prior acts because the company is not familiar with the new client's method of conducting business before it became the insurance company's client. Without the ability to estimate risk, the insurance company cannot profitably write coverage and will simply refuse to do so. Thus, the court's holding could significantly reduce the supply of trust department E \u0026 O coverage for new clients. I believe that the \"same number of mouths\" will not be fed after the district court's decision, see Harris v. Theus, 149 Ala. 133, 43 So. 131, 133 (1907); therefore, it is the court's holding, rather than the prior acts exclusion, that violates Alabama's public policy.\n\nV.\n\nFor the foregoing reasons, I would affirm the district court's judgment with regard to Johnson \u0026 Higgins, vacate with regard to First State, and instruct the district court, upon receipt of the mandate, to enter judgment in favor of First State.\n\n\u003cspan class=\"fn\"\u003e* Honorable Jesse E. Eschbach, Senior U.S. Circuit Judge, for the Seventh Circuit, sitting by designation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. The district court's jurisdiction was based on diversity of citizenship pursuant to 28 U.S.C. § 1332. First Alabama Bancshares, Inc. is a bank holding company of several separate banks scattered throughout Alabama. First Alabama Bank of Montgomery is a subsidiary of First Alabama Bancshares and is the plaintiff in this litigation. First Alabama Bank is the successor by merger to the plaintiff, First Alabama Bank of Montgomery. First Alabama Bank is a state banking association with its principal place of business in Montgomery, Alabama. The parties treat the three First Alabamas as interchangeable; so shall we. First State, a national insurance company, is a Delaware corporation, with its principal place of business in Massachusetts. Johnson \u0026 Higgins, a national insurance broker, is a Georgia corporation, with its principal place of business in Georgia. Cameron \u0026 Colby, First State's underwriting agent, is a Massachusetts corporation, with its principal place of business in Massachusetts. The parties do not dispute that Alabama law applies in this diversity action.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Throughout this opinion, references to First State will apply equally to Cameron \u0026 Colby except when separate identification is necessary.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. This section was repealed in 1985. On January 9, 1985, the Alabama Legislature replaced § 6-2-39 with § 6-2-38, a two-year limitations period. See Kelly v. A.L. Williams Corp., 669 F. Supp. 1058, 1060 n. 4 (N.D.Ala.1986). The Alabama Supreme Court has already held that § 6-2-38 does not apply to fraud actions which were filed before 1985. See Lader v. Lowder Realty Better Homes \u0026 Gardens, 512 So. 2d 1331, 1333 (Ala.1987); Watson v. Trail Pontiac, Inc., 508 So. 2d 262 (Ala.1987).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Section 6-2-3 was amended in 1985 to provide a two year limitations period for fraud actions. The effective date of the amendment is January 9, 1985, well after First Alabama filed this action. This amendment does not apply retroactively. Lampliter Dinner Theater, Inc. v. Liberty Mut. Ins. Co., 792 F.2d 1036, 1042 n. 4 (11th Cir.1986); see, e.g., Schoen v. Gulledge, 481 So. 2d 1094, 1097 (Ala.1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. In Bonner v. City of Prichard, 661 F.2d 1206, 1209 (11th Cir.1981) (en banc), the Eleventh Circuit adopted the case law of the former Fifth Circuit handed down as of September 30, 1981, as its governing body of precedent.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The dissent, while acknowledging Rule 52(a)'s requirement that a district court's factual findings be accorded great deference, posits that \"the district court's finding of fraud should not be granted any greater deference than we would grant to a pure legal holding.\" At footnote three we are told that this highly irregular deviation from Rule 52(a)'s mandate is warranted because the district court \"made a finding of fraud without considering certain important principles of fraud and agency law.\" This approach not only puts the cart before the horse, but also puts it before the wrong horse. This circuit has abrogated the clearly erroneous standard when reviewing a district court's factual findings only in the rare circumstances where the district court's factual determinations result from an erroneous view of the legal principles which govern the fact-finding process. Johnson v. Uncle Ben's, Inc., 628 F.2d 419, 422 (11th Cir.1980); Accord, Henson v. City of Dundee, 682 F.2d 897, 906 (11th Cir.1982). In this case, unlike those in which Rule 52(a) has been properly breached, no one alleges that the district court's factual findings resulted from its misunderstanding of governing rules of evidence or procedure. The dissent, by its own admission, asserts only that the district court's fraud finding is erroneous because it was made without \"considering certain important principles of fraud and agency law.\" Obviously, the dissent's objection does not attack the legal principles through which facts were found, but instead questions whether \"the lower court applied an incorrect standard of law to those facts in reaching its conclusions.\" Peterson Indus. v. Lake View Trust \u0026 Sav. Bank, 584 F.2d 166, 168 (7th Cir.1978) While such an inquiry goes to the essence of our role, in determining whether the district court applied \"important principles of fraud and agency law\" we cannot retry issues of fact, reweigh the evidence de novo or otherwise disturb findings simply because we would have reached a contrary result on the same evidence. Zenith Radio Corp. v. Hazeltine Research, Inc., 395 U.S. 100, 89 S. Ct. 1562, 23 L. Ed. 2d 129 (1969); Amadeo v. Zant, 486 U.S. 214, 108 S. Ct. 1771, 100 L. Ed. 2d 249 (1988); See also Anderson v. Bessemer City, 470 U.S. 564, 105 S. Ct. 1504, 84 L. Ed. 2d 518 (1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. First State's remarks about London are a reference to the fact that under its reinsurance arrangements, it had to secure the approval of its London reinsurers before issuing bank trust E \u0026 O insurance. Summary of Agreed and Disputed Facts, Rec. 170, at 2. There were three layers of reinsurance and First State dealt with the London syndicates through Bowring. Contract 548 was an agreement with certain of Lloyd's syndicates to reinsure First State on its financial institutions business up to a maximum limit of one million dollars. See Deposition of Bernard Griffin at 84; Deposition of Theodor Oxholm at 36-37. The leader of the contract 548 reinsurers was Marsh, a Lloyd's of London syndicate. Contract 549 was an agreement for an excess layer of reinsurance, which provided reinsurance in excess of one million up to five million dollars. The leader of this group was Minnis, a Lloyd's syndicate. Finally, contract 550 provided reinsurance of five million dollars in excess of five million, and the leader of this group was again the Minnis syndicate. See Griffin Deposition at 84-85. For background discussion on how Lloyd's of London operates, see Syndicate 420 at Lloyd's London v. Early Am. Ins. Co., 796 F.2d 821, 824 (5th Cir.1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The agency argument, so heavily advanced by the dissent, made its first appearance in this case in the appellant's reply brief. In it First State argued that Johnson \u0026 Higgins' knowledge of the availability of prior acts coverage was imputed as a matter of law to First Alabama because Johnson \u0026 Higgins was First Alabama's insurance agent. First State concluded that since the bank constructively knew through its \"agent\" about the availability of prior acts coverage, its reliance on First State was unreasonable, therefore making a fraud finding impossible. This would be a nifty argument if there was procedural basis to raise it, a legal basis to advance it, and a factual basis to support it. Since none exist, we originally dismissed the argument with little comment. However, in light of the dissent's extensive discussion, we feel it is appropriate to fully explain the sound reasons for its complete rejection. First, it must be noted that even if meritorious, First State's failure to press the argument before the district court foreclosed its right to present it on appeal. See Royals v. Tisch, 864 F.2d 1565, 1568 n. 6 (11th Cir.1989); Lee v. United States Postal Serv., 774 F.2d 1067, 1069 n. 3 (11th Cir.1985) (per curiam); Dean Witter Reynolds, Inc. v. Fernandez, 741 F.2d 355, 360-61 (11th Cir.1984); Troxler v. Owens-Illinois, Inc., 717 F.2d 530, 532-33 (11th Cir.1983); Harris Corp. v. National Iranian Radio \u0026 Television, 691 F.2d 1344, 1353 (11th Cir.1982). The dissent's contention that First State's answer denying First Alabama's fraud allegations in its complaint is enough to have raised the agency issue below is indefensible. There is no question that this agency theory was merely an afterthought, for if it were not the theory would most certainly have surfaced long before it did as a passing reference in the appellant's reply brief. Concededly, our rule foreclosing review of issues not presented below is not a jurisdictional limitation but instead is a rule which may be abrogated in our sound discretion. Dean Witter Reynolds, Inc. v. Fernandez, 741 F.2d 355, 360 (11th Cir.1984). Nonetheless, this is not a case, as the dissent suggests, where \"substantial justice\" calls for the rule's abrogation. The case-law in this area indicates that we hear issues otherwise waived only in instances where strict application of the rule would result in patently unjust results. This does not mean, however, as the dissent suggests, that we will entertain all issues first raised on appeal whenever they are outcome determinative. This approach would swallow our general rule of waiver, further impeding the efficient administration of justice. Forgiving the argument's shabby procedural pedigree and accepting the facts as the dissent recites them, there is no legal basis to impute the knowledge of Johnson \u0026 Higgins upon First Alabama. Granted in Alabama and elsewhere the general rule is that a principal is chargeable with and bound by the knowledge of his agent while acting within the scope of his authority. Carnival Cruise Lines, Inc. v. Goodin, 535 So. 2d 98, 103 (Ala.1988) However, the rule is subject to many qualifications which can only be understood in view of the rule's purpose. Two basic theories, which the dissent advances, attempt to explain the rule's existence. The first and oldest finds the reason for the rule in the legal identity of the agent with the principal during the continuance of the agency. In other words, the agent, while acting within the scope of his agency is, as to matter embraced within the agency, the principle himself or the alter ego of the principal. See Holmes, The Common Law, 232 (1890) See also dissent at note 12. The other theory, apparently advanced in Alabama, is based on the conclusive presumption that the agent has discharged his duty to impart the principal with all his knowledge which is necessary for the principal's protection or guidance. Whether the agent has discharged this duty is irrelevant to the legal presumption that the principal shares the agent's knowledge. See dissent citing National Union Fire Ins. Co. v. Lomax Johnson Ins. Agency, Inc., 496 So. 2d 737, 739 (Ala.1986). Though oblivious to the dissent, it is obvious that these enumerated \"theories\" are mere justifications for the rule rather than reasons for it. Both the alter ego theory and presumed communication theory are mere legal fictions which common law judges employed as shorthand to impose liability upon ostensibly \"ignorant\" principals. It is important to recognize that the reason courts impose constructive knowledge upon a principal is to avoid the injustice which would result if the principal could have an agent conduct business for him and at the same time shield himself from the consequences which would ensue from knowledge of conditions or notice of the rights and interests of others had the principal transacted his own business in person. Mechem, A Treatise on the Law of Agency, 2d ed. vol. 2, § 1802 (1982). As early as 1834, Lord Chancellor Brougham explained the rationale for the rule's application. \"Policy and the safety of the public forbids a person to deny knowledge while he is so dealing as to keep himself ignorant, or so that he may keep himself ignorant, and yet all the while let his agent know, and himself perhaps profit by that knowledge. In such a case it would be most iniquitous and most dangerous, and give shelter and encouragement to all kinds of fraud, were the law not to consider the knowledge of one as common to both, whether it be so in fact or not.\" Id., citing, (1834) Kennedy v. Green, 3 Mylne \u0026 Keen 699. It is universally accepted that \"the rule imputing an agent's knowledge to the principal is designed to protect only those who exercise good faith, and is not intended to serve as a shield for unfair dealing by the third person. The rule may not be invoked where third persons use the agent to further their own frauds upon the principal . . .\" Agency, 3 Am.Jur.2d § 295. Even assuming that Johnson \u0026 Higgins was First Alabama's agent and that their employee Green knew from a prior transaction that other carriers offered prior act's coverage, First State cannot use agency law's constructive knowledge rule to shield itself from liability for its fraudulent misrepresentation. The rule is an equitable one which cannot be employed by those with unclean hands. An examination of the dissent's constructive knowledge citations reveals that it is invoked only in cases in which a court imposes liability upon a principal for his agent's dealings with an innocent third party. First State clearly is not an innocent third party in this case. It misrepresented a material fact which caused detrimental reliance by First Alabama and cannot now invoke equitable principles of agency law to avoid liability for its fraudulent conduct. Finally, even if the agency issue were preserved for appeal and agency law principles did apply in this case, the facts found by the district court do not permit imputation of knowledge by Johnson \u0026 Higgins upon First Alabama. The district court, after making its credibility determinations and weighing all the evidence, specifically concluded that Johnson \u0026 Higgins, through its employee Green, had absolutely no knowledge of the \"availability of prior acts coverage from markets other than First State and failed to seek or determine the existence or terms of such other coverage.\" In complete contradiction to the dissent's independent fact findings, the district court specifically concluded that \"Green did not investigate or seek [prior acts] coverage from other markets and did not know whether they were eligible for coverage available in other markets.\" It further concluded that \"any misrepresentation was innocently made due to Green's inexperience or lack of full knowledge.\" Quite simply, Green's knowledge cannot be imputed to First Alabama when it is clear that the district court, the fact finder in this case, specifically concluded that Johnson \u0026 Higgins and Green had no knowledge of the availability of prior acts coverage. Even if Green previously had knowledge of prior acts coverage, it is indispensable to the rule imputing to the principal knowledge which the agent acquired before the agency that the knowledge be present in the agent's mind when he enters the agency relationship. Mechem, A Treatise on the Law of Agency, § 1809 (1982) Clearly, the law does not impute to the principal knowledge which the agent either has never had, or had forgotten before entering the agency relationship. Id. From the district court's opinion, it is clear that Johnson \u0026 Higgins through it's employee Green had absolutely no knowledge of the availability of prior acts coverage. This finding is buttressed by the district court's rejection of First Alabama's fraud count against Johnson \u0026 Higgins. In rejecting this count of the complaint the district court specifically ruled that there can be no finding of fraud because any misrepresentation by Johnson \u0026 Higgins was unintentional. The dissent's entire imputed knowledge argument requires the district court's fact-findings to be utterly rejected and supplanted with new facts obtained through its independent fact-finding. For the reasons stated infra at note 6 we will not disturb the district court's fact findings unless they are clearly erroneous. Since the record amply supports the district court's fact-findings we must accept them and at the same time reject the dissent's contrary findings. See infra note 6.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Since the appellants do not contest the amount of the district court's compensatory damage award we do not understand the dissent's criticism of our failure to challenge the district court's finding. It is not the appellate court's role to advocate the appellant's cause and independently search the universe for grounds for reversal. While conceding that assessing damages \"should not even be an issue in this case\", the dissent argues at length that the district court erred in awarding three million dollars in actual damages. The dissent finds that even if the Plaintiff did prove his damages, it failed to meet its burden in proving damages as to the amount of additional premium it would have to pay to secure such coverage. The dissent finds it \"disturbing\" that the district court did not deal with this concept. We do not. Here the plaintiff proved three million dollars in actual damages and the district court so found. If the defendant was entitled to a credit or reduction in those damages by reason of the plaintiff having to have paid a higher premium, then the burden is on the defendant to raise this claim. Clearly, the plaintiff does not have to present evidence which reduces his damage award. Since the record contains no hint that the defendants sought to introduce evidence regarding the premium differential and since no challenge to the court's damage award is raised by the appellants we firmly refuse to assume the role of appellants' counsel.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The Alabama Code specifically lists three acts which are not deemed a waiver of insurance provisions or defenses. These three acts are: (1) acknowledgement of the receipt of notice of loss or claim; (2) furnishing forms for reporting a loss or claim; or (3) investigating a loss or claim. ALA.CODE § 27-14-27 (1975). The Code does not make any exception to waiver for stating one defense and subsequently relying on another one.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Although no interest rate is specified in § 8-8-8, the Alabama Supreme Court has held that the legal rate of interest of 6% as set out in ALA.CODE § 8-8-1 applies to awards of prejudgment interest. See, e.g., Moore v. Alabama Farm Bureau Mut. Casualty Ins. Co., 452 So. 2d 1320, 1321 (Ala.1984); Lapeyrouse Grain Corp. v. Tallant, 439 So. 2d 105, 112 (Ala.1983).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Johnson \u0026 Higgins also argues that the plaintiff waived its right to assert its breach of contract claim because the bank knew that the policy did not contain prior acts coverage. See Burns v. Consolidated Am. Ins. Co., 359 So. 2d 1203, 1206 (Fla.Dist.Ct.App.1978) (per curiam). We reject this argument for the same reasons that we reject the applicability of the merger doctrine. Johnson \u0026 Higgins did not contract with the bank solely to provide it with prior acts coverage. Rather, Johnson \u0026 Higgins agreed to supply the skill necessary to meet the bank's insurance needs. Since Johnson \u0026 Higgins' breach of contract prevented the bank from being aware of the availability of prior acts coverage, the bank has not waived its right to bring this contract action.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. First State is a wholly owned subsidiary of appellant Cameron \u0026 Colby Company, Inc. Cameron \u0026 Colby was named as a defendant in this suit, and the district court found that it also committed fraud through its subsidiary. Because of the identity of interests, I refer to both Cameron \u0026 Colby and First State simply as \"First State.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The venerable maxim actually states that equity will not suffer a wrong to be without a remedy. 1 F. Lawrence, A Treatise on the Substantive Law of Equity Jurisprudence § 38 (1929).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Generally, we review a district court's finding of fraud as a finding of fact under the clearly erroneous standard of Federal Rule of Civil Procedure 52(a). See Citibank, N.A. v. Citibanc Group, Inc., 724 F.2d 1540, 1544 (11th Cir.1984). This deferential treatment of a finding of fraud is proper: the existence of actionable fraud is merely an ultimate fact supported by several subsidiary findings of fact, such as \"misrepresentation,\" \"reliance,\" and \"causation.\" This case, however, does not call for such deferential review. We have held that when a district court applies an incorrect legal standard, the findings resulting from that misapplication \"lose the insulation of [Rule] 52(a).\" Corley v. Jackson Police Dep't, 566 F.2d 994, 1001-02 (5th Cir.1978); see also Peterson Indus. v. Lake View Trust \u0026 Sav. Bank, 584 F.2d 166, 168 (7th Cir.1978); 9 C. Wright \u0026 A. Miller, Federal Practice and Procedure § 2585 (1971), cited in Henson v. City of Dundee, 682 F.2d 897, 906 \u0026 n. 13 (11th Cir.1982). The district court in this case made a finding of fraud without considering certain important principles of fraud and agency law. As I show in part II of this opinion, that finding resulted from a misapprehension of Alabama law; therefore, the district court's finding of fraud should not be granted any greater deference than we would grant to a pure legal holding. The majority is greatly troubled by my departure from the clearly erroneous standard in this case. Apparently, the majority would make such a departure only when the questioned finding resulted from a \"misunderstanding of governing rules of evidence or procedure.\" Ante at note 6. This statement itself represents a misunderstanding of this circuit's law. For example, in one of the cases cited by the majority, Johnson v. Uncle Ben's Inc., 628 F.2d 419 (5th Cir.1980), the court departed from the clearly erroneous standard when the district court assigned an inappropriate weight to statistical evidence in a Title VII case and consequently found no discrimination. Id. at 421-22. Such an error is not merely a misunderstanding of the rules of evidence or procedure--it is a misunderstanding of a substantive legal principle. When such an error occurs, \"we must undertake an independent analysis of the record before us in light of the correct legal standards.\" Id. at 422. Here, as in Johnson, the district court failed to weigh evidence relating to substantive legal rules: materiality, causation, and justifiability of reliance. The district court's failure to weigh that evidence resulted from a misapprehension of substantive principles of Alabama law. Therefore, we are required to \"undertake an independent analysis of the record before us in light of the correct legal standards,\" id. at 422.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Because First State did not commit actionable fraud against First Alabama, I express no opinion on First State's affirmative defense of failure to comply with a condition precedent, dealt with in part IV of the majority's opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Of course, the district court's holding will not bind any other courts. But, until the Alabama Supreme Court addresses this issue, the district court's holding could affect even suits brought in state courts since Alabama's lower courts might consider the holding to be evidence of Alabama's public policy.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Patrick Green testified, however, that a representative of First State responded that it was \"not willing to give that coverage right now. Let's write it for a year or two. Let's see how you are.\" Furthermore, Green testified that the only reference to the London reinsurers was made in regard to the price of the contemplated policy. This testimony raises doubt about Grinstead's impression that the prior acts coverage was left entirely to the discretion of the London reinsurers. Nevertheless, the district court apparently accepted Grinstead's version of First State's response, and I will assume in this opinion that the district court correctly interpreted the evidence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The record indicates that this allegation is highly suspect. When asked whether he made such a statement, Green testified that he \"wouldn't say that. . . . There was other markets. . . . I knew about the markets. I wouldn't have said that at all.\" Significantly, while Bohannon's testimony could be characterized as self-serving, Green's testimony was, if anything, contrary to his own interest since it tends to show that Green acted negligently. Nevertheless, I accept, for the purposes of this opinion, the district court's findings.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. See supra note 3.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The majority explicitly refuses to deal with the issue of agency, noting that First State failed to raise the issue in the district court. Ante at note 8. I must part company with the majority on this point. In First Alabama's amended complaint (the pleading on which it went to trial), it alleged that First State fraudulently misrepresented and suppressed certain material facts, that First State knew First Alabama would rely on those misrepresentations, and that the misrepresentations caused First Alabama's injury. By making these specific allegations, and simply by making a claim of fraud, First Alabama raised the issues of justifiable reliance and proximate cause. These issues must be raised by a claim of fraud in Alabama because no such claim will succeed without proof of these elements. First State specifically denied the section of First Alabama's complaint in which the allegations of fraud were made. By so denying these allegations, First State put First Alabama to the proof on all elements of its claim of fraud. See FDIC v. Siraco, 174 F.2d 360, 362 (2d Cir.1949); 5 C. Wright \u0026 A. Miller, Federal Practice and Procedure § 1266, at 283 (1969). The use of agency rules in this case does not constitute an affirmative defense, see Fed.R.Civ.P. 8(c) (agency and unjustifiable reliance not affirmative defenses); rather, the existence of an agency relationship between Johnson \u0026 Higgins and First Alabama precludes findings of justifiable reliance and proximate cause. Because agency rules are completely bound up in First Alabama's claim, the agency issue was, by necessity, before the district court: whenever a legal theory might directly contradict a substantive element of a plaintiff's prima facie case, a defendant need not specifically plead that theory for it to be presented to the district court. See Sanden v. Mayo Clinic, 495 F.2d 221, 224 (8th Cir.1974); Goodwin v. Townsend, 197 F.2d 970, 971 (3d Cir.1952). The district court might not have expressly dealt with the agency relationship, but we may explore any theory that bears directly on one of the elements of First Alabama's claim. Even if the agency relationship was not before the district court, the issue fits at least one of several exceptions to the general rule that courts of appeals do not consider issues not presented to the district court. Significantly, a federal appellate court may consider an issue not raised in the district court where the interest of substantial justice is at stake, where the proper resolution is beyond any doubt, or where that issue presents significant questions of general impact or of great public concern. Dean Witter Reynolds, Inc. v. Fernandez, 741 F.2d 355, 360-61 (11th Cir.1984). Substantial justice certainly is at stake when the failure to apply a well-established principle of law will result in significant liability for the defendant. Moreover, the resolution of this issue is beyond any doubt--application of agency principles is simple and certain and clearly delineates liability in this case. Finally, this is a question of general impact since insurance companies in Alabama must be allowed to deal with their insured's broker quickly, efficiently, and on a sophisticated level.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Alabama caselaw presupposes that an insurance broker can be an insured's legal agent. See, e.g., Washington Nat'l Ins. Co. v. Strickland, 491 So. 2d 872, 875 (Ala.1985) (independent broker usually agent of insured); Highlands Underwriters Ins. Co. v. Elegante Inns, Inc., 361 So. 2d 1060, 1065 (Ala.1978) (\"When the agent or broker has failed in the duty he assumes, the principal may sue either for breach of the contract or, in tort, for breach of the duty imposed on the agent or broker.\" (Emphasis added.)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The parties jointly submitted excerpts from depositions to the district court; thus, all such deposition testimony acquired the same force and effect as live testimony at trial before the court. All references in this opinion to deposition testimony are references to deposition testimony submitted to the district court at trial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Perhaps more fundamentally, the rule might have arisen from the courts' tendency to view the agent as the principal's alter ego. See Fay v. Swicker, 154 Ohio St. 341, 96 N.E.2d 196, 199 (1950). Alabama courts, however, have not expressly adopted this rationale.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. During the Fulton Bank renewal, Green learned that two companies, Scarborough Insurance Company and GATX Insurance Company offered trust department E \u0026 O coverage with prior acts coverage.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. One could argue that knowledge regarding other markets for prior acts coverage was acquired by Green while transacting business for other banks, thus preventing the application of the constructive notice rule. Alabama courts will not impute an agent's knowledge if that knowledge is acquired while not acting for the principal. This exception, however, has only been applied to situations in which the agent obtained \"private individual knowledge . . . acquired in personal contacts as if he had no official relation to plaintiff.\" See Tennessee Valley Bank, 21 So.2d at 689. More precisely stated, the rule will not impute knowledge \"acquired by the agent, which he receives outside of the line of his duty, or while engaged in the transaction of his purely personal affairs.\" Central of Georgia Ry. Co. v. Joseph, 125 Ala. 313, 28 So. 35, 37 (1900). First Alabama retained Johnson \u0026 Higgins not just to secure a policy; it was retained to use its expertise in trust department E \u0026 O coverage to search the markets and advise First Alabama. Johnson \u0026 Higgins' ability to acquire and maintain its expertise in this area motivated First Alabama to retain Johnson \u0026 Higgins. Consequently, Green's knowledge of other companies writing prior acts coverage, acquired during the same time period in which he was searching the market for First Alabama, would greatly enhance Johnson \u0026 Higgins' expertise in the area and must fall within its line of duty to provide expertise to First Alabama.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. The majority, citing the general rule that a third party may not invoke the constructive knowledge rule to perpetrate a fraud on the principal, thinks that First State, because it has unclean hands, cannot take advantage of the constructive knowledge rule. See ante at note 8. The majority's argument is circular. According to the majority, if First State defrauded First Alabama, First State cannot raise the constructive knowledge rule. But if First State cannot raise the constructive knowledge rule, then it defrauded First Alabama. The proper way to analyze the majority's concern about First State's clean hands is to ask two questions. First, does the record indicate that First State had reason to believe that Johnson \u0026 Higgins knew about the availability of prior acts coverage? If yes, then I cannot conceive how First State intended to use the constructive knowledge rule to perpetrate a fraud--First State could not expect to get away with it, unless it had reason to believe that Johnson \u0026 Higgins would not convey the information to First Alabama. Given Johnson \u0026 Higgins' reputation as an expert in the field of trust department E \u0026 O coverage, the answer to this first question must be \"yes.\" Second, does the record indicate that First State had reason to believe that Johnson \u0026 Higgins would not tell First Alabama about the availability of prior acts coverage? See Mutual Life Ins. Co. v. Hilton-Green, 241 U.S. 613, 622-23, 36 S. Ct. 676, 680, 60 L. Ed. 1202 (1916) (third party may not take advantage of constructive knowledge rule if it had reason to believe that agent would not communicate information to principal). If First State had no reason to think that Johnson \u0026 Higgins would fail to convey the information, then I cannot conceive how First State could be using the constructive knowledge rule to shield its own fraudulent conduct. In fact, the record contains no indication that First State had reason to believe that Johnson \u0026 Higgins would not communicate the information to First Alabama. Finally, the majority argues that, even if First State can claim the benefit of the constructive knowledge rule, the district court \"specifically concluded that Johnson \u0026 Higgins, through its employee Green, had absolutely no knowledge of the 'availability of prior acts coverage from markets other than First State and failed to seek or determine the existence or terms of such other coverage.'\" Ante at note 8. The majority would have a point if, indeed, the district court made such a finding; but, it did not. The district court found as follows: The evidence indicates that Green surveyed the market regarding trust errors and omissions coverage, in general, for Fulton National Bank and not regarding prior acts coverage. Even based upon his experience as a broker, Mr. Green was apparently not fully aware of the extent and availability of prior acts coverage. Mr. Green told Mosely and Bohannon and others at First Alabama Bank that there was no other source for prior acts coverage other than First State. This representation is against the evidence presented at trial which clearly indicated that there were other carriers who at least offered prior acts coverage. For example, Green had obtained prior acts coverage in a 1976 Scarborough policy for Fulton National Bank. Scarborough policies provided prior acts coverage as a matter of course; yet Green failed to communicate to anyone with First Alabama Bank any findings respecting the availability of prior acts coverage, or First Alabama Bank's eligibility for such coverage. Mr. Green did not submit any applications with any other carriers or discuss First Alabama Bank with them, thereby foreclosing First Alabama Bank from even the possibility of obtaining coverage from other sources. First Alabama Bank v. First State Ins. Co., No. 83-G-2082-S, mem. op. 17-18 (N.D.Ala. Feb. 20, 1987) (emphasis added). The district court's findings simply do not permit us to conclude that Johnson \u0026 Higgins \"had absolutely no knowledge of the 'availability of prior acts coverage.'\" Furthermore, the district court's holding that First State's misrepresentation was not \"intentional, reckless or egregious,\" id. at 32, buttresses nothing but the fact that Johnson \u0026 Higgins was merely negligent. That holding cannot be taken to mean that Johnson \u0026 Higgins had no knowledge of prior acts coverage.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. The majority would place the burden of producing such evidence on the defendant. See ante at note 9. Such a holding directly contradicts Alabama's rule that the plaintiff must affirmatively prove the amount of his damages and that courts may not speculate if the plaintiff fails to offer such proof. See Continental Volkswagen, 309 So.2d at 122-23.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Nowhere in its complaint or amended complaint does First Alabama seek reformation of the insurance contract.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. In Alabama, a finding of fraud does not automatically confer upon the trier of fact the power to award punitive damages. In Hopkins v. Lawyers Title Ins. Corp., 514 So. 2d 786 (Ala.1986), the Alabama Supreme Court held that \"although the evidence before us may be sufficient to support a finding of legal fraud, a finding of legal fraud in this context will not automatically give rise to a consideration of punitive damages by the jury.\" Id. at 790; see Cecil Crews Chevrolet-Oldsmobile, Inc. v. Williams, 394 So. 2d 912, 914 (Ala.1981); Hall Motor Co. v. Furman, 285 Ala. 499, 234 So. 2d 37, 41 (1970). Although the line separating the minimum level of culpability required to support an award of punitive damages and the minimum level of culpability required to support a claim of fraud is thin at best, Alabama courts have adhered to that distinction. To support a claim of fraud, a plaintiff must show that the defendant recklessly misrepresented a material fact. Winn-Dixie Montgomery, Inc. v. Henderson, 395 So. 2d 475, 476 (Ala.1981). To support an award of punitive damages, a trier of fact must find that the defendant misrepresented a material fact with wanton and reckless disregard for the rights of others. Gulf Atlantic Life Ins. Co. v. Barnes, 405 So. 2d 916, 925 (Ala.1981); Mid-State Homes, Inc. v. Johnson, 294 Ala. 59, 311 So. 2d 312, 317 (1975). Alabama courts define wanton conduct as (1) an intentional act (2) committed with knowledge of existing conditions that would make injury likely and (3) with reckless indifference to the consequences of that act. See Brown v. Turner, 497 So. 2d 1119, 1120 (Ala.1986); Birmingham Elec. Co. v. McQueen, 253 Ala. 395, 44 So. 2d 598, 600 (1950). Wanton conduct thus requires a higher level of culpability than reckless conduct, and this distinction accounts for the ability of Alabama courts to find fraud without finding the culpability required to support an award of punitive damages.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Particularly appropriate today is the famous dicta from Richardson v. Mellish, 2 Bing. 229, 252, 130 Eng.Rep. 294, 303 (1824): public policy is \"a very unruly horse, and when once you get astride it you never know where it will carry you. It may lead you from the sound law. It is never argued at all but when other points fail.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. By so defining public policy, I do not mean to imply that this definition applies to all types of contracts. For example, when evaluating a trust, public policy should also be defined to disfavor contracts that discourage marriage. And there are many other aspects of public policy that are relevant to other types of contracts. See E. Farnsworth, Contracts § 5.2 (1982). I believe, however, that the two underlying concerns stated in the text fully define public policy in the context of this type of insurance policy.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Alabama's public policy is expressed in its constitution, statutes, and common law. Couch v. Hutchinson, 2 Ala. App. 444, 57 So. 75, 76 (1911).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. I note that the district court cites Stein, Hinkle, Dawe \u0026 Assocs. Inc. v. Continental Cas. Co., 110 Mich. App. 410, 313 N.W.2d 299 (1981), and Heen \u0026 Flint Assocs. v. Travelers Indemnity Co., 93 Misc. 2d 1, 400 N.Y.S.2d 994 (Sup.Ct.1977). Neither of these cases appears to be on point since, in refusing to enforce the policies as written, the courts relied on the doctrines of reasonable expectations and unconscionability. Those doctrines are not at issue here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. See supra note 5.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. See supra, at 1079-81.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. I would also submit that this holding would be more consistent than the district court's opinion with Langley v. Mutual Fire, Marine \u0026 Inland Ins. Co., 512 So. 2d 752 (Ala.1987), overruled on other grounds, I.N. Hickox v. Stover, 551 So. 2d 259 (Ala.1989). In Langley, the court stated in dicta, \"the claims-made insurance contract in the present case does not purport to provide retroactive coverage at all beyond the retroactive date of the policy, regardless of whether the insured's previous coverage was with Mutual Fire. Thus, there is no freedom of contract violation in this case.\" Id. at 759-60 (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. See supra, at 1084.\u003c/span\u003e\n\n",
    "body_length": 172123,
    "citedas": [
      "899 F.2d 1045"
    ],
    "attorneys": "Clyde C. Owen, Jr., Ball, Ball, Matthews \u0026 Novak, P.A., Montgomery, Alabama, John R. Matthews, Jr., Montgomery, Alabama. For Johnson \u0026 Higgins of Georgia, Inc.: Fournier J. Gale, III, Maynard, Cooper, Frierson \u0026 Gale, P.C., Birmingham, Alabama, Walker Percy Badham, III, Birmingham, Alabama. For 1st State Ins. Co. \u0026 Cameron \u0026 Colby: Richard H. Gill, Copeland, Franco, Screws \u0026 Gill, P.A., Montgomery, Alabama. M. Roland Nachman, Jr., Balch \u0026 Bingham, Montgomery, Alabama. Robert McD. Smith, Lange, Simpson, Robinson \u0026 Somerville, Birmingham, Alabama. For First State Insurance Co. \u0026 Cameron \u0026 Colby: Daniel M. Blanca, Mendes \u0026 Mount, New York, New York. For Johnson \u0026 Higgens: Joe C. Freeman, Jr., Howell Hollis, III, Jack N. Sibley, Freeman \u0026 Hawkins, Atlanta, Georgia. Kevin R. Jespersen, (Amicus), Manger, Kalison, Murphy \u0026 McBride, Morristown, New Jersey. Robert A. Huffaker, (Amicus), Rushton, Stakely, Johnston \u0026 Garrett, P.A., Montgomery, Alabama.",
    "category": [
      "124",
      "3",
      "252",
      "184",
      "213"
    ],
    "judges": "Tjoflat, Chief Judge, Hatchett, Circuit Judge, and Eschbach,*fn* Senior Circuit Judge. Tjoflat, Chief Judge, concurring in part and dissenting in part.",
    "citation_count": 69
  }
}
