{
  "id": "DKFbR2YBTlTomsSBR_Ui",
  "document": {
    "title": "People v. Pitts",
    "full_title": "THE PEOPLE AND v. RICKY LYNN PITTS ET AL. AND (PART 2 OF 3)",
    "jurisdiction": "California Court of Appeal",
    "date": "1990-09-05T00:00:00.000Z",
    "docket": "No. F006225",
    "body": "D. Accusing Defense Counsel of Wasting Time\n\n1. \"Q [by Van Meter]: I Believe You Told Us That Both Rick and Wayne Forsythe Were Taking Pictures at the Same Time?\n\n\"Mr. Gindes: She Just Said That.\n\n\"The Court: I Think We're Going Back to the Resummarization Mode. Objection Sustained.\n\nBy Mr. Van Meter:\n\n\"Q Were They Taking Pictures at the Same Time?\n\n\"Mr. Gindes: Is He Getting Paid by the Question or Something? This Question Has Been Asked Three Times.\n\n\"Mr. Van Meter: I Would Ask He Be Cited for Misconduct for Making a Statement Like That.\n\n\"The Court: Whoa. I Don't Think He Has Asked the Question, If They Were Both Simultaneously Taking Pictures . . . .\"\n\nA motion for mistrial was made outside the jury's presence the following day. Gindes stated that he regretted the remark, but:\n\n\"[Van Meter] seemed to be taking very [ sic ] question and breaking it down into 15 questions and resummarize [ sic ] the testimony of a witness, and you said this and you said that. It seemed Mr. Van Meter was trying to keep the child on as long as possible. I formed the opinion then, and I do hold it now what we're seeing here is a very sophisticated case of good guybad guy defense tactics.\n\n\"What I think is happening is Mr. Rubin and Mr. Van Meter and possibly one other attorney, they confer and they have one turn of getting the role of keeping the child on as long as possible and exhausting the child, and the other attorney gets up and makes ingratiating remarks, I'm only going to ask a few questions and she's going to get off the stand. And it's annoying me. I don't like the tactics.\n\n\"I think those defense counsel are working together and I think when Mr. Rubin acts like that and has Mr. Van Meter pursue this policy of exhausting the witness by asking question after question after question and it was making me mad. I guess I should not have let that make me mad. I guess you should bet [ sic ] hardened.\"\n\nThe court denied the mistrial motion, stating:\n\n\"Well, I think that the comment was made at the end of a long day. The young girl has been on the stand for, I believe, over a week if you add all the days together, and counsel has apologized for the remark, and I think I just caution both sides to try to bear up under this strain. It's going to be a long trial, and let's see if we can move this as expeditiously as possible. Motion denied.\"\n\nIn People v. McCracken, supra, 39 Cal. 2d at pages 348-349, which counsel cited to the trial court in the instant case, the California Supreme Court held that the prosecutor committed misconduct when he stated in front of the jury, \"'What some people won't do for a fee.'\" (Italics omitted.) However, any prejudice was cured because there was an immediate objection and admonition to the jury to disregard the statement.\n\n2. \"Q [by Eyherabide] You Never Got Any Shots at the Green House?\n\n\"A [by Windy] No.\n\n\"Mr. Vendrasco: That Has Been Asked by Another Attorney. If We're Going to Be Asking Questions Two and Three Times We're Not Going to Finish by the End of the Summer. I Think It's Been Asked, So I Object.\n\n\"The Court: I Think It Has Been Asked, Mr. Eyherabide.\"\n\n3. \"Q [by Rubin] Now, Windy, when you were talking with Carol Darling the first time back in June, you knew that Rick and your mom had been arrested, right?\n\n\"Mr. Gindes: I'm going to object. This is an identical question that has been asked on direct examination, cross-examination two or three times.\n\n\"Mr. Rubin: That may be, your Honor. I believe the subject matter has been brought up again. It's been put in issue.\n\n\"Mr. Gindes: That doesn't give him the right to ask the question and it wastes time.\n\n\"Mr. Rubin: It sure does. It would take a lot less time.\n\n\"Mr. Gindes: Counsel would go on a year if I didn't object . . . .\"\n\n4. \"Q [by Van Meter] And were all three ropes [on the board] black?\n\n\"A [by Brian] Yes.\n\n\"Q Okay. None of the ropes were red?\n\n\"Mr. Gindes: Your Honor, excuse me. Are we going to go on with all the colors of the rainbow? He just told Mr. Van Meter all three ropes were black.\n\n\"Mr. Van Meter: This is to impeach his prior testimony in which he said the ropes were black and red and yellow.\n\n\"Mr. Gindes: He just said the ropes were black.\n\n\"Mr. Van Meter: This is to impeach his prior testimony [in] which he said the ropes were black and red and yellow.\n\n\"Mr. Gindes: That's not a prior inconsistent statement.\n\n\"The Court: If he said it was all black --\n\n\"Mr. Van Meter: I just wanted to get him pinned down on it.\n\n\"Mr. Gindes: Perhaps we could ask the question 30 times.\n\n\"Mr. Sims: Objection, your Honor.\n\n\". . .\n\n\"Mr. Gindes: Could we stop asking questions that are just, you know, absorbing time and not accomplishing anything. The child has testified they are all black.\n\n\"Mr. Rubin: Object to the colloquy.\n\n\"The Court: Why don't we do this, let's plod on.\"\n\n5. \"Q [by Gardiner] Now, you're saying that there were a lot of them [children] on this first time [at Knotts Street]?\n\n\"Mr. Gindes: Excuse me. This is the seventh time counsel has done this. She [Idolina Lopez] has told him seven times that she only remembers four children being present on the first occasion.\n\n\"The Court: But other occasions.\n\n\"Mr. Gindes: He's asking about the first occasion again. This is the seventh time he has elicited this testimony. It consumes time and it is accomplishing nothing to exonerate his client.\n\n\". . .\n\n\"Mr. Gindes: He's talking about the first time, and I counted them, now seven occasions she said there were four children on the first time. Why does he want to ask them an eighth time?\n\n\"The Court: I don't know.\n\n\"Mr. Gindes: Object to [ sic ] the time consumption outweighs the probative value. Counsel could ask a hundred times and she keeps saying four, and tomorrow he could do the same thing again.\n\n\"The Court: Let's go on to the next question.\n\n\". . .\n\n\"Mr. Gindes: Objection, asked and answered.\n\n\"The Court: Sustained. Next series of questions.\n\n\"Mr. Gindes: Your Honor, could counsel ask the next question?\n\n\"Mr. Gardiner: Your Honor, if I could have a moment.\n\n\"The Court: All right.\n\n\". . .\n\n\"Mr. Gindes: Object to that question as asking her to recall her answers to a preliminary hearing that has lasted two months. Asking her if she can recall an answer after two months of testimony.\n\n\"The Court: Where are we going with this line of questioning?\n\n\"Mr. Gardiner: Showing inconsistent statements, your Honor.\n\n\"Mr. Gindes: If he wants to prove an inconsistent statement, he can do it in a proper and appropriate manner which he is not doing.\n\n\"The Court: Objection sustained.\n\n\". . .\n\n\"Mr. Gindes: Could the record reflect a substantially long pause between the questions Mr. Gardiner is asking and consuming court time?\n\n\"The Court: He's looking through documents and police reports and transcripts, and I think it's understandable transition.\"\n\nE. Comments Regarding Defense Objections\n\n1. \"Q [by Vendrasco] Show us how the kid would touch the lady?\n\n\"Mr. Eyherabide: I will object, asked and answered . . . .\n\n\"Mr. Gindes: I will object to Mr. Eyherabide interrupting the witness.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\n\"The Court: Overruled.\"\n\n2. \"Q [by Vendrasco] And would you sometimes see in Rick and Tutti's room, would you see kids touch women's privates?\n\n\"A [by Brian] Yeah.\n\n\"Mr. Eyherabide: Objection, leading and vague as to time.\n\n\"Mr. Rubin: Join.\n\n\"The Court: Overruled.\n\n\"Mr. Gindes: I think that the Court has ruled by now that the prosecution has established a sufficient foundation to prevent these objections as too vague, as to time. The child has identified the time that he remembers best in Rick and Tutti's room. Therefore, I don't think it's necessary for counsel to completely time after time again repeat that objection when the Court has overruled that objection. It's disrupting the testimony of the child and the trier of fact.\n\n\"Mr. Eyherabide: If the Court will give me a continuing objection.\n\n\"Mr. Gindes: The Court won't give you a continuing objection. I'd ask Mr. Eyherabide not to make the same objection that has been overruled by the Court continuously.\n\n\". . .\n\n\"Mr. Fusilier: For the record, object to these speaking objections continually happening here.\n\n\"Mr. Sims: Join with Mr. Fusilier.\n\n\"The Court: I'm not going to give you a continuing objection. If you feel an objection is in order, please make it as you have been doing.\"\n\nMany defense objections were necessitated by the court's refusal to grant continuing objections. During the giving of instructions, however, the court did instruct the jury pursuant to defense request as follows:\n\n\"It is the duty of the attorney on each side of the case to object when the other side offers testimony or other evidence which the attorney believes is not properly admissible. You must not be prejudiced against either an attorney or any client because the attorney has made objections during the course of the trial.\n\n\"By allowing testimony or other evidence to be introduced over the objection of an attorney, the Court does not indicate any opinion as to the weight or effect of such evidence. As stated before, you are the sole judges of the credibility of all witnesses and the weight and effect to be given to all of the evidence.\"\n\nF. Improperly Imparting Information to Jury\n\nDefendants complain of the prosecutors' use of speaking objections and other devices to place information before the jury that was not admitted into evidence, or for other improper purposes such as suggesting defense counsel were wasting time. It is settled that \"the 'evidence developed' against a defendant shall come from the witness stand in a public courtroom where there is full judicial protection of the defendant's right of confrontation, of cross-examination, and of counsel.\" (Turner v. Louisiana (1965) 379 U.S. 466, 472-473 [13 L.Ed.2d 424, 429, 85 S.Ct. 546].) It is improper for a prosecutor to present potentially prejudicial \"evidence\" to a jury in the form of argument. (People v. Perez (1962) 58 Cal. 2d 229, 244 [23 Cal. Rptr. 569, 373 P.2d 617, 3 A.L.R.3d 946], disapproved on other grounds in People v. Green, supra, 27 Cal. 3d at pp. 32, 34.)\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e Some examples follow.\n\n1. \"Q [by Fusilier] You didn't tell her [Carol Darling] Wayne Dill was there, your uncle, did you at that time?\n\n\"A [by Christine] No.\n\n\". . .\n\n\"Q Then, in all fairness, let me ask you, was it because he wasn't there or what?\n\n\"Mr. Gindes: Excuse me. Counsel has a copy of this report and this list and it lists Wayne Dill, and he's asking her questions she didn't say on the list.\n\n\"Mr. Fusilier: I object. He's talking to the jury.\n\n\"The Court: Let's go back, Mr. Fusilier.\n\n\"Next question.\n\n\"Mr. Fusilier: Just a moment, your Honor. I think something ought to be done about these extemporaneous remarks. He's giving evidence to the jury and it's inadmissible. I don't have that report.\n\n\"The Court: Next question.\n\n\"Mr. Gindes: Counsel was given a copy of that report.\n\n\"Mr. Fusilier: Have to swear him in and testify, let him testify to that. He's talking in front of the jury.\n\n\"The Court: Gentlemen, Mr. Fusilier, next question, sir, please.\n\n\"Mr. Rubin: Move for a mistrial based on Mr. Gindes' conduct, totally inappropriate.\n\n\"The Court: Denied, sir.\n\n\"Next question.\n\n\". . .\n\n\"Mr. Fusilier: I'd like to join Mr. Rubin's last motion.\n\n\"The Court: His last motion was --\n\n\"Mr. Fusilier: For a mistrial.\n\n\"The Court: And you're pointing to Mr. Gindes.\n\n\"Mr. Fusilier: The same remarks, yes, your Honor.\n\n\"The Court: Motion.\n\n\"Mr. Gindes: If counsel wants to make that motion, I have the reports and will give it to the Court and swear that I gave this to all counsel.\n\n\"Mr. Fusilier: I renew.\n\n\"Mr. Rubin: I join.\n\n\"The Court: Motion denied.\"\n\n2. \"Q [by Eyherabide] And she [Carol Darling] identified herself as the investigator of the district attorney's office?\n\n\"Mr. Gindes: First of all, she's not an investigator with the district attorney's office and it's irrelevant.\n\n\"Mr. Eyherabide: I'm just asking the question. I don't need him to testify.\n\n\"The Court: Rephrase it, Mr. Eyherabide.\"\n\n3. \"Q [by Eyherabide] When Mr. Gindes Came Back to California [From Oklahoma] With You, Did He Have That [newspaper article concerning this case] in His Possession?\n\n\"A [by Sgt. Brad Darling] I Don't Recall. My Recollection Is That That Was Forwarded to California by Subpoena Process.\n\n\"Q Do You Have That --\n\n\"Mr. Vendrasco: That Is Right.\"\n\n4. \"Q [by Rubin] And then after you had told him [the policeman] that Rick had rubbed your -- use the term you used, your pee pee once and put his pee pee near your bottom, he asked you whether Rick had done anything else to you, and you said no, is that right?\n\n\"Mr. Gindes: Object to counsel, when he says I'm going to use the term you used. This report refers to the victim's report of anal intercourse.\n\nMr. Rubin says you only told him that you [ sic ] put the penis near the bottom, and I'm going to use the term you used, and he's looking at a report that says the child engaged in anal intercourse. That's misstating the report, and I don't think that's a question that should be asked the witness.\n\n\"Mr. Fusilier: Object to this testimony by the prosecutor on behalf of Mr. Wayne Dill, Jr.\n\n\"The Court: He's made an objection, counsel, that he's inaccurately quoting the report.\n\n\". . .\n\n\"Why don't you rephrase the question, counsel.\n\n\"Mr. Gindes: Another thing he said --\n\n\"Mr. Van Meter: Objection, object to counsel reading from the report. He's trying to get into evidence things that are not possibly admissible.\n\n\"Mr. Gindes: The basis of my objection is that counsel should not say I'm reading from the report and misread or misconstrue what a witness says in a report and says you say this. That's what my objection is.\n\n\"The Court: If we're referring to a report, let's accurately --\n\n\"Mr. Gindes: Legitimate objection.\n\n\". . .\n\n\"By Mr. Rubin:\n\n\"Q . . . After you told -- we're back to you, Brian, after you told this officer that Rick Pitts had rubbed your pee pee and that Rick Pitts had stepped behind you and placed his penis in the area of your behind, did the officer ask whether Rick Pitts had done anything else?\n\n\"Mr. Gindes: That's not what the report says.\n\n\"Mr. Rubin: Report says anus. I'm sure this witness didn't use that term.\n\n\"Mr. Gindes: The officer is summarizing, and the witness is talking about putting it in the anus and engaging in anal intercourse. Simply saying that his behind --\n\n\"Mr. Sims: Isn't that something for cross-examination?\n\n\"Mr. Fusilier: Object for Wayne Dill, Jr. Testimony by the prosecutors. He's testifying. It's not proper. I object.\n\n\"The Court: Overruled.\"\n\nThe preceding becomes especially interesting in light of the following:\n\n\"Q [by Gardiner] . . . Now, in that meeting with Officer Bob Fields, he indicates that he showed you a group of pictures and said he shows you this group of pictures, you looked at it and you picked picture no. 3 and said that was Colleen's boy friend and said his name was Wayne?\n\n\"A [by Brian] Yes.\n\n\"Mr. Gindes: Object and move to strike saying what Bob Fields said. That's hearsay. That report's not in evidence.\n\n\"The Court: That is correct. I think you can rephrase it, Mr. Gardiner.\"\n\nLater in the proceedings:\n\n\"Q [by Gardiner] . . . In the middle of that paragraph, there is a line or a sentence which says --\n\n\"Mr. Gindes: Objection to him reading off the report. That's hearsay.\n\n\"The Court: Sustained.\"\n\n5. \"Q [by Eyherabide] So Then You Talked to [Deputy] Conny Ericsson About Teresa Cox; Is That Right?\n\n\"A [by Linda Moten] Yes.\n\n\"Q Now, What Kind of Charges Is She Facing?\n\n\"Mr. Gindes: It's Irrelevant What Kind of Charges Teresa Cox Is Facing.\n\n\"The Court: Sustained.\n\n\"By Mr. Eyherabide:\n\n\"Q Did You Give -- Did You Tell Conny Ericsson That She Made Admissions Concerning Sexual Activity With Children?\n\n\"Mr. Gindes: I Would Object to That. Teresa Cox'[s] Testimony as Opposed to Colleen [B.] Is Hearsay, They Are Not Admissions.\n\n\"The Court: Sustained.\n\n\"Mr. Eyherabide: Your Honor, It's Not Coming in for the Truth, Just to Show the Pattern of This Witness.\n\n\"Mr. Vendrasco: I'm Willing to Stipulate That Teresa Cox Was Convicted, If You Want to Stipulate to That.\"\n\n6. \"Mr. Rubin: I'm Going to Object to Any Questions in This Area as Being Irrelevant and Outside the Evidence Presented at the Preliminary Hearing. Anything in Regard to That Other [Carol and Lisa's] Room.\n\n\"Mr. Sims: Join.\n\n\"Mr. Eyherabide: Join. Also Vague and Irrelevant.\n\n\"The Court: Overruled.\n\n\"Mr. Rubin: I Might Ask for a Limiting Instruction With Regard to My Client That Relates --\n\n\"Mr. Eyherabide: Join.\n\n\"The Court: There Is Aiding and Abetting, I Think, Alleged.\n\n\"Mr. Vendrasco: If You Prove Even Count One You Have Proved the Rest of the Counts.\n\n\"The Court: Overruled.\n\n\"Mr. Rubin: Your Honor, I Would Like to Have the Prosecutor Admonished. That Is a Totally Incorrect Statement in Front of the Jury. I Move for a Mistrial.\n\n\"The Court: The Question, Please.\"\n\n7. \"Q [by Fusilier] . . . In fact, the only time, and the first time you ever mentioned Wayne Dill . . . was there was the day before yesterday and today, isn't that true?\n\n\"Mr. Gindes: I object to that. Counsel has transcripts where Wayne Dill is mentioned, I think, at least 50 to 60 times in his possession, and he's representing to the Court that's not true.\n\n\"Mr. Fusilier: That's not proper. If he has an objection, he should make a proper objection. This is prejudicial and pointing evidence to the jury.\n\n\"Mr. Gindes: Counsel has represented to the jury that the first time that this child has ever named Wayne Dill is today.\n\n\"Mr. Fusilier: That's not my question.\n\n\"Mr. Gindes: May we have the question read back?\n\n\"Mr. Fusilier: He shouldn't interrupt and impart testimony without being under oath to this jury. I object.\n\n\"The Court: Let's hear the question, counsel.\n\n\". . .\n\n\"Q [by Fusilier] . . . Well, you never said that Wayne Dill was at this house where these nasty things occurred just after the track meet, is that true?\n\n\"Mr. Gindes: Could the Court grant -- preliminary hearing July 5, 1984 and look at Page 20.\n\n\". . .\n\n\"Mr. Fusilier: I was at a preliminary hearing of my client, Wayne Dill, Jr., and this young man [Johnny] was testifying, and I have read the transcript, and I am in good faith asking him what occurred. I don't know\n\nanything about any other transcripts that he's talking about. My transcript reflects exactly the questions I'm asking.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\n\n\"Mr. Vendrasco: I move to strike the testimony of Mr. Fusilier, what he read and what he heard. He made a statement 'English wasn't his primary language' I recall.\n\n\"The Court: That was correct.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\n\n\"Mr. Fusilier: Meaning what?\n\n\"Mr. Vendrasco: I move to strike testimony by the defense attorney what he read. It's not before the Court. It's not proper to consider that.\n\n\"The Court: Let's cut down on the editorializing.\n\n\"Mr. Van Meter: Request that counsel be cited for misconduct.\n\n\"Mr. Gindes: I'm asking the Court to look at those transcripts.\n\n\". . .\n\n\"Mr. Gindes: That was the preliminary hearing of Ricky Pitts, et al, and if counsel wants to talk about his own client's preliminary hearing, he can look at the July 25, 1984 transcript at Page 4 which also indicates his client being present there.\n\n\"Mr. Fusilier: No, I disagree, your Honor.\n\n\"Mr. Rubin: I move we adjourn. We're almost done for the day. Perhaps we should take this out of the presence of the jury.\n\n\"The Court: I think we can come back after Mr. Fusilier has an opportunity to look at the preliminary hearing transcript and we can see. Get this clarified tomorrow.\"\n\nThe next day, the following occurred:\n\n\"Q [by Fusilier] You didn't say Wayne Dill, Jr. was there that day, did you?\n\n\"Mr. Gindes: Excuse me, object to that type of question by counsel. He talked about three incidents at the preliminary hearing, and he put Wayne Dill at each of those three incidents. When counsel asks that question, it's unfair to him.\n\n\"Mr. Fusilier: If there's an objection, I'd like to hear it.\n\n\"Mr. Gindes: That's it.\n\n\"By Mr. Fusilier:\n\n\"Q Did you understand my question?\n\n\"Mr. Gindes: I don't care. He's misrepresenting the record to the witness.\n\n\"Mr. Fusilier: No, I'm not. I read the transcript. I was there.\n\n\"The Court: Didn't you just tell him that he did not testify?\n\n\"Mr. Fusilier: Just a minute, your Honor. I'm going to object to Mr. Gindes' interrupting. He's trying to impart information that's unfair and not really true.\n\n\"Mr. Gindes: I would ask the Court to look at this --\n\n\". . .\n\n\"Excuse me a second. I would like the Court to take the volume of July 24, 1984 and we will go through all the volumes where he mentioned incidents and he put Wayne Dill at each incident. So, counsel is misrepresenting to the Court when he says he didn't say Wayne Dill was there.\n\n\"Mr. Fusilier: This is an improper -- he has a right to cross-examine and produce any kinds of witnesses. I read the transcript of my preliminary hearing, and I defended Wayne Dill.\n\n\"Mr. Gindes: The only problem is --\n\n\"The Court: His objection is that you're misstating the evidence.\n\n\"Mr. Fusilier: That's his objection, fine.\n\n\"The Court: Let me look at the transcript then.\n\n\"Mr. Fusilier: I will withdraw the question in the interest of time.\n\n\"Mr. Gindes: Interest of time or interest of accuracy?\n\n\"The Court: All right, counsel.\n\n\"By Mr. Fusilier:\n\n\"Q Johnny, do you get mixed up as to what you said from one preliminary hearing?\n\n\"Mr. Gindes: Start at Page 23, your Honor.\n\n\"The Court: All right.\n\n\"Mr. Fusilier: Whose prelim was that?\n\n\"Mr. Gindes: This is yours, counsel, your client's, counsel.\n\n\"The Court: This is the preliminary hearing transcript, Mr. Fusilier, before the Honorable Judge Scott, Carey Scott on July 24 of '84.\n\n\"Mr. Rubin: I'm going to object. There is no question pending.\n\n\"Mr. Fusilier: This is highly improper.\n\n\"The Court: Have you withdrawn that question, counsel?\n\n\"Mr. Fusilier: I've withdrawn it.\n\n\"Mr. Sims: For time reference, ask to which one this is. Refer the Court to Page 23.\n\n\"The Court: I am at 23.\n\n\"Mr. Sims: Where he talks about this was on a weekend, on a Sunday, and also just before that the instance Mr. Gindes is referring to, it was the\n\nlast time that he visited and this isn't the last time that he visited because I brought that out on my cross examination.\n\n\"Mr. Gindes: Your Honor, [in] the preliminary hearing he talks about three incidents. And he talks about Wayne Dill [being] present at each one. When counsel says you said Wayne Dill wasn't present, he's misrepresenting.\n\n\"Mr. Fusilier: There's a place where he says no, he wasn't there also.\n\n\"Mr. Vendrasco: Why don't you find that place?\n\n\"Mr. Gindes: Page 24.\n\n\"Mr. Sims: That's the last time.\n\n\"The Court: Counsel, wait a second. One at a time.\n\n\"Mr. Fusilier: I will withdraw.\n\n\"The Court: Let's stop right here and let me read Page 24.\n\n\"Mr. Eyherabide: I have an objection on hearsay to my client.\n\n\"The Court: Fine. Let me read Page 24 . . . .\n\n\"Mr. Fusilier: You have to read the whole transcript.\n\n\"The Court: I understand.\n\n\"Mr. Gindes: Volume 25.\n\n\"Mr. Vendrasco: I object to his testimony, what he says.\n\n\"Mr. Gindes: Page 27.\n\n\"Mr. Rubin: I object to what is going on in front of the jury. This is highly prejudicial and incredible waste of time.\n\n\"The Court: I don't think it's prejudicial. I do think it's a waste of time in view of the fact that counsel has withdrawn the question. However, for the record, I want to point out that Page 24 of that transcript does indicate that the witness does identify Mr. Wayne Dill as being present at a particular incident.\n\n\"Mr. Gindes: I've got 15 more citations when Wayne Dill was there, if the Court wants it.\n\n\"Mr. Sims: Your Honor, --\n\n\"The Court: I think the point is clear for the record. The question has been withdrawn. Next question, sir.\n\n\"Mr. Rubin: I'm going to move to strike the Court's comments as being irrelevant. There is no question pending.\n\n\"Mr. Eyherabide: I will join.\n\n\"Mr. Gardiner: Join for Wayne Forsythe.\n\n\"The Court: Request denied. Next question.\n\n\"Mr. Fusilier: I will submit there are places where he fails to mention Wayne Dill being there.\n\n\"The Court: That's fine, sir.\n\n\"Mr. Vendrasco: I move to strike.\n\n\"Mr. Sims: Ask Mr. Gindes' comments be stricken as prejudicial and inaccurate.\n\n\"Mr. Gindes: If he thinks they're inaccurate --\n\n\"The Court: Request denied. Let's proceed.\"\n\nG. Improper Questioning of Witnesses\n\nDefendants also justifiably contend that prosecutorial misconduct occurred during examination of prosecution and defense witnesses, either because the prosecutor's examination was abusive or because it was used as a means of getting inadmissible evidence and improper innuendo before the jury. (See fn. 33.) In some instances, the prosecutors arguably became their own unsworn witnesses.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\n\n\"'The deliberate asking of questions calling for inadmissible and prejudicial answers is misconduct.' [Citation.]\" (People v. Bell, supra, 49 Cal. 3d at p. 532.) \"The rule is well established that the prosecuting attorney may not interrogate witnesses solely 'for the purpose of getting before the jury the facts inferred therein, together with the insinuations and suggestions they inevitably contained, rather than for the answers which might be given.' [Citations.]\" (People v. Wagner (1975) 13 Cal. 3d 612, 619 [119 Cal. Rptr. 457, 532 P.2d 105]; see also, People v. Bonin, supra, 46 Cal. 3d at p. 689 [intentionally eliciting inadmissible testimony]; People v. Warren, supra, 45 Cal. 3d at pp. 480-481 [asking questions suggesting facts harmful to defendant without good faith belief in existence of said facts]; People v. Perez, supra, 58 Cal. 2d at p. 241 [asking questions suggesting facts harmful to defendant without belief facts could be proved and purpose to prove them]; People v. Evans, supra, 39 Cal. 2d at p. 251 [repeated asking of questions relative to objectionable and prejudicial matter involving appeals to passions and prejudices of jury; in ยง 288 prosecution, crime charged is sufficient to inflame mind of average person so there must be \"rigorous insistence\" upon observance of rules of admission of evidence and conduct of trial]; People v. Johnson (1978) 77 Cal. App. 3d 866, 873 [143 Cal. Rptr. 852] [improper cross-examination of defendant to place inadmissible prejudicial evidence before jury]; People v. Shipe (1975) 49 Cal. App. 3d 343, 349 [122 Cal. Rptr. 701] [prosecutor \"may not, under the guise of cross-examination, get before the jury what is tantamount to devastating direct testimony\"].)\n\nNor is the impropriety of such cross-examination cured by the fact that the questions elicit negative answers. \"By their very nature the questions suggested to the jurors that the prosecutor had a source of information unknown to them which corroborated the truth of the matters in question . . . . It is reasonable to assume that, in spite of [the] negative responses in the instant case, the jurors were led to believe that, in fact,\" the insinuations of the questions were true. (People v. Wagner, supra, 13 Cal. 3d at pp. 619-620.) In Wagner, it was held that instructions and admonitions did not cure the prejudicial effect of repeated insinuations regarding the defendant's past conduct. (Id. at p. 621.)\n\nIn People v. Shipe, supra, 49 Cal. App. 3d at pages 349-350, this court held that such conduct violated the defendant's right of confrontation where the witness claimed his Fifth Amendment privilege and refused to answer questions, but through leading and suggestive questions the prosecutor created the almost irrefutable inference that defendant was guilty and the witness\n\ngave true statements to the authorities. Relying on Douglas v. Alabama (1965) 380 U.S. 415 [13 L.Ed.2d 934, 85 S.Ct. 1074], we determined that the Chapman (Chapman v. California (1967) 386 U.S. 18, 23-24 [17 L.Ed.2d 705, 710, 87 S.Ct. 824, 24 A.L.R.3d 1065]) standard was applicable. (People v. Shipe, supra, 49 Cal. 3d at p. 355.)\n\n1. \"Q [by Vendrasco] Were You Aware of Whether the Green Leafy Substance, Marijuana, Was Found Wrapped Up in the Woman's Underwear [in Rick's house in Boswell]?\n\n\"A [by Sgt. Darling] No.\n\n\"Mr. Rubin: Objection, Assumes Facts Not in Evidence.\n\n\"Mr. Vendrasco: Not Necessarily.\n\n\"The Court: Why Don't You Rephrase the Question.\n\n\"By Mr. Vendrasco:\n\n\"Q You Weren't Present, Then, When Marijuana Was Seized?\n\n\"Mr. Van Meter: Objection.\n\n\"The Court: Aren't We Talking About Green Leafy Substance?\n\n\"By Mr. Vendrasco:\n\n\"Q Well, Green Leafy Substance?\"\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\n\n2. Linda Dill testified on Dill's behalf. When Gindes started to cross-examine her about her children, Fusilier objected on relevancy grounds. Gindes stated that he wanted to show dates in relation to events in her life, and he proceeded to question her about when she went to work at a certain place and where and with whom she lived. The following then occurred:\n\n\"Q [by Gindes] Was There a Period of Time in These Dates Between August 25, 1979 and November 19th, 1984 When Your Kids Were Put in Foster Care?\n\n\"A [by Linda Dill] Yes.\n\n\"Mr. Fusilier: I Will Object, Irrelevant.\n\n\"The Witness: Yes.\n\n\"Mr. Gindes: It's Not Prejudicial, It's Not Irrelevant. I'm Going to Tie It Up.\n\n\". . .\n\n\"By Mr. Gindes:\n\n\"Q Now, I Believe You Said When You Married Wayne Dill You Had Two Kids?\n\n\"A Right.\n\n\"Q You Didn't Have the Third Kid Until 1983, Right?\n\n\"A '81. I Have Had Four in Total.\n\n\"Q Okay, So Three Kids Went Into Foster Care, I'm Sorry, I Didn't Get the Date.\n\n\"A September 1st of '81.\n\n\"Q After September 1st of 1981, Did Those Children Come Back to Live With You Again?\n\n\"A No.\n\n\"Q Now, When You Had the Child on August, It's August of 1983?\n\n\"A Uh-huh.\n\n\"Q Did That Child Stay and Live With You or Did That Child Go Off to Foster Care or Somewhere Else?\n\n\"Mr. Fusilier: I Will Object to This. This Is All Irrelevant, Prejudicial Under 352. It Should Be Excluded.\n\n\"Mr. Gindes: I'm Trying to Find These Dates Out.\n\n\"Mr. Fusilier: I Think This Evidence Is Not Probative of Anything. It's More Prejudicial Then [ sic ] Anything. It Should Be Excluded.\n\n\"The Court: I Think He Indicated He Was Going to Tie It Together.\n\n\"The Witness: Yes, He Did.\n\n\"By Mr. Gindes:\n\n\"Q That Child Went Into Foster Care, Right?\n\n\"A Yes.\n\n\"Q Can You Tell Us the Date?\n\n\"A A Police Hold Was Put on Him the 16th of August.\n\n\". . .\n\n\"A '83.\n\n\"Q That Is All I Want to Know About. I'm Trying to Find Out About the Dates These Things Happened Because When You Were Working --\n\n\"Mr. Fusilier: I Will Object to This. Is This a Question?\n\n\"Mr. Vendrasco: It's Got to Be.\n\n\"The Court: All Right.\n\n\"By Mr. Gindes:\n\n\"Q When You Were Working at Home Plate Pizza, Your Kids Had Already Gone Into Foster Care, Correct?\n\n\"A Yes.\n\n\"Q I Want to Call Your Attention to the Time You Were Pregnant With the Child That You Eventually Had, All Right?\n\n\"A Which One.\n\n\"Q The One You Had in August of '83.\n\n\"A Okay.\n\n\"Mr. Fusilier: I Will Object to This Again, All of This Under 352 Is More Prejudicial Than Probative. Counsel Is Attempting to Prejudice the Testimony of This Witness by Such Testimony Only.\n\n\"The Court: He Says He Is Trying to Get Dates.\n\n\"Mr. Fusilier: That Is What He Says, but It's Obvious He Is Trying to Taint This Person's Character Is What He Is Trying to Do.\n\n\"Mr. Gindes: No, I'm Not. I'm Not Trying to Do That at All.\n\n\"The Court: As an Officer of the Court, I Assume He Wouldn't Try to Do That. Objection Overruled.\"\n\nGindes then began questioning about the amount of time Ms. Dill actually spent with Dill, during the period of time in which the molestations were alleged to have occurred. The following ensued:\n\n\"Q [by Gindes]: Your Children Stayed Where?\n\n\". . .\n\n\"Right After the Child You Said You Had With Wayne Dill --\n\n\"Mr. Fusilier: I Will Object, Where the Child Is Living.\n\n\"The Court: Overruled.\n\n\"The Witness [Linda Dill]: When I Moved in With Dell [a friend of Ms. Dill's], Steven Had Yet to Be Born.\n\n\"By Mr. Gindes:\n\n\"Q He Was Born After You Moved in With Dell?\n\n\"A Yes.\n\n\"Q Did He Live With You and Dell?\n\n\"A No.\n\n\"Mr. Fusilier: I Object, That Is Irrelevant.\n\n\"The Court: Overruled.\n\n\"By Mr. Gindes:\n\n\"Q Where Did He Live?\n\n\"A He Was Put in a Foster Home Right After He Was Born.\n\n\"Q Let Me Ask You a Question, You Say Wayne Dill Was the Father of This Child?\n\n\"A Yes.\n\n\"Q Did You Ever See Wayne Dill and His Child Together?\n\n\"A Yes.\n\n\"Mr. Rubin: Objection.\n\n\"The Court: Overruled.\n\n\"By Mr. Gindes:\n\n\"Q Where Did You See Him?\n\n\"A At the Car Lot.\n\n\"Mr. Fusilier: I'm Making An Objection, I'm Making An Objection Under 352, More Prejudicial Than Probative. Furthermore, It's Irrelevant.\n\n\"The Court: Objection Overruled.\n\n\". . .\n\n\"By Mr. Gindes: You Brought the Child Over to the Car Lot Twice; Is That Correct?\n\n\"A Yes.\n\n\"Q How Long Did He Stay at the Car Lot With the Child?\n\n\"A About 15, 20 Minutes.\n\n\"Q Besides These Two, 15 to 20 Minute Stays, Are You Aware of Any Other Times at All That Wayne Dill Had Any Contact With His Child?\n\n\"Mr. Rubin: Objection, Irrelevant What She Knows.\n\n\"The Court: Overruled.\n\n\"By Mr. Gindes:\n\n\"Q Are You Personally Aware of Any Others?\n\n\"A No.\n\n\"Q This Is August of 1983 Until What, June of 1984?\n\n\"A Yes.\n\n\"Q Mr. Dill Never Went to See His Own Child?\n\n\"A He Was in a Foster Home.\n\n\"Mr. Fusilier: Objection, 352.\n\n\"Mr. Gindes: Your Honor, She Says Wayne Dill Fathered the Child in September of 1983. I Think the Father of the Child as a Natural Reasonable Consequence You Go Visit the Child, See the Child. You Don't Just Ignore the Child.\n\n\"Mr. Sims: He Is Assuming a Fact Not in Evidence Because She Said the Child Wasn't There.\n\n\"The Court: She Said the Child Was in a Foster Home.\n\n\"By Mr. Gindes:\n\n\"Q When Did the Child Go Into the Foster Home?\n\n\"A Right Out of the Hospital.\n\n\"Mr. Fusilier: I Will Object, This Is Irrelevant and Inflammatory.\n\n\"Mr. Rubin: It's Also Been Asked and Answered. The Date's Been Given Already.\n\n\"The Court: Overruled . . . .\n\n\". . .\n\n\"By Mr. Gindes:\n\n\"Q Then After That You Took the Child Over to the Car Lot?\n\n\"A Yes.\n\n\"Q Where Did You Get the Child From?\n\n\"Mr. Rubin: Objection, Irrelevant, 352.\n\n\"Mr. Fusilier: This Person Isn't on Trial, Your Honor. I Object That Is Irrelevant.\n\n\"The Court: Sustained. I Think She Said From the Foster Home.\n\n\"By Mr. Gindes:\n\n\"Q Was There a Dispute Between You and Wayne Dill About Who the [ sic ] Fathered That Child?\n\n\"Mr. Fusilier: Objection, That Is Irrelevant.\n\n\"The Court: What Is the Relevancy of That, Counsel?\n\n\"Mr. Gindes: I Think It Goes to Her Testimony About Sexual Relations With Wayne Dill in 1982. I Think She Is Trying to Show a Relationship With Wayne Dill and the People Intend to Show It Was Not That Close.\n\n\"The Court: Objection Overruled.\"\n\nThis was not the end of the evidence adduced about Dill's children. During Gindes's cross-examination of Dill, the following occurred:\n\n\"Q So You Claim That Steven Is Your Child, Right?\n\n\"A Yes.\n\n\"Q Did You Ever Go to See Steven?\n\n\"A No.\n\n\"Q How Come?\n\n\"A Because Steven Was Taken From the Hospital.\n\n\"Mr. Fusilier: That Is Irrelevant.\n\n\"By Mr. Gindes:\n\n\"Q Did You Ever Go See Steven?\n\n\"Mr. Rubin: I'm Going to Object to This Question as Being Irrelevant and More Time Consuming Than Probative.\n\n\"The Court: What Is the Next Question.\n\n\"By Mr. Gindes:\n\n\"Q Did You Ever Go See Steven Where He Had Been Taken?\n\n\"Mr. Fusilier: Objection, Irrelevant.\n\n\"Mr. Gindes: Wouldn't the Ordinary, Reasonable Parent, if That Is [w]hat He Is, and had a Son, Go and See the Child?\n\n\"Mr. Rubin: That Is Not Relevant to This Case. What Does That Have to Do With This Case?\n\n\"Mr. Gindes: Whether He Went to See the Child.\n\n\"Mr. Rubin: I Don't See the Relevance to This Case.\n\n\"Mr. Fusilier: It's Irrelevant.\n\n\"Mr. Gindes: I Think Most Normal People, When They Father a Child, Would Want to Go See That Child.\n\n\"The Court: How Is That Relevant to This Case?\n\n\"Mr. Vendrasco: He Said He Was -- She Said She Was With Wayne Dill and Was Alibi[i]ng Wayne Dill for That Period of Time and It Goes to That.\n\n\"The Court: Objection Overruled.\n\n\"Mr. Fusilier: I Will Object Again for the Record. This Is More Prejudicial by a Long Ways Than Probative. He Is Constantly Prejudicing This Client.\n\n\"The Court: Overruled.\n\n\"By Mr. Gindes:\n\n\"Q If This Was Your Child, Why Didn't You Go See the Child?\n\n\"A Because I Didn't Know Where He Was at.\n\n\"Q Did You Try to Find Out?\n\n\"Mr. Rubin: Irrelevant.\n\n\"The Court: Overruled.\n\n\"Mr. Fusilier: Collateral Matter, Irrelevant.\n\n\"The Witness: Yes.\n\n\"The Court: Overruled.\n\n\"By Mr. Gindes:\n\n\"Q Did You Find Out?\n\n\"Mr. Rubin: Objection, Irrelevant.\n\n\"The Court: Overruled.\n\n\"The Witness: I Talked to Several Case Workers and by the Time I Got to the Right Case Worker --\n\n\"Mr. Fusilier: I Will Object, It's Been Asked and Answered. Move the Latter Portion Be Stricken.\n\n\"The Court: Request Denied. Finish Your Answer, Sir.\n\n\"Remember the Question?\n\n\"The Witness: Yes. By the Time I Got to the Right Case Worker I Called Her Once, We Had Arrangements for Me to See Steven and Then Linda Told Me I Could See Steven Without Her.\n\n\"By Mr. Gindes:\n\n\"Q Before You Were Taken Into Custody on June the 29th, Were You Basically Out of Custody for Eight to Nine Months When Steven Was Living; Is That Correct?\n\n\"A Yes.\n\n\"Q And You Never, in Those Eight to Nine Months, Went to See Steven Once; Is That Correct?\n\n\"Mr. Rubin: Asked and Answered, Irrelevant.\n\n\"Mr. Fusilier: Objection, Irrelevant.\n\n\"The Court: Sustained.\n\n\"By Mr. Gindes:\n\n\"Q This Going to Find the Case Worker and All This Stuff and Finding Out Where Steven Was, It Took Nine Months Before You Could Get This Information and Attempt to Visit Steven?\n\n\"Mr. Rubin: Objection, Irrelevant.\n\n\"The Court: Overruled.\n\n\"The Witness: No.\n\n\"By Mr. Gindes:\n\n\"Q How Many Months Did It Take You?\n\n\"Mr. Rubin: Objection, Irrelevant.\n\n\"The Court: Overruled.\n\n\"The Witness: I Don't Know.\n\n\"By Mr. Gindes:\n\n\"Q You Indicated That Wayne [D.] and Marcella Was Her Middle Name?\n\n\"A Waynette.\n\n\"Q They Are Both Also Your Children?\n\n\"A Yes.\n\n\"Q During the Period of Time, 1982, the Last Two Months and 1983, Did You Visit These Children?\n\n\"A No.\n\n\"Q Ever?\n\n\"A No.\n\n\"Mr. Fusilier: Objection, Irrelevant.\n\n\"The Court: Overruled.\"\n\nIt is difficult to see how this line of questioning was designed to show anything but Dill's shortcomings as a father. Whether we term it prosecutorial misconduct or error on the part of the trial court in admitting it, it should not have come in. \"[T]he guilt of a defendant of a particularly charged offense cannot be proved by evidence of general bad character, or, with certain exceptions not here applicable, by evidence of the commission of other crimes not relevant to the one charged.\" (People v. Alverson, supra, 60 Cal. 2d at p. 810.)\n\n3. During cross-examination of virtually every defendant who testified, Gindes adopted the technique of rereading the children's testimony. Although we need not determine whether such a technique is improper per se, it was carried to abusive extremes in the instant case. For example:\n\n\"Q [by Gindes] . . . Mr. Dill, You Have Heard a Number of Witnesses Testify Against You and Make Certain Allegations Against You; Is That Correct?\n\n\"A [by Wayne Dill] Yes.\n\n\"Q For Instance, You Remember on February 28th of 1985, Being Present Here When Christina [H.] Testified?\n\n\"A Yes.\n\n\"Q And Did You Remember Christina [H.] Testifying on That Date That She Saw You Touching Children When They Were Naked at the Green House?\n\n\"A Yes.\n\n\"Q And Did You Also Observe Christina [H.] Point You Out and Identify You as a Person on that Date Who Had Been Present at the Green House When Children Were Molested?\n\n\"Mr. Fusilier: I Will Stipulate He Was Present and Heard All That, Your Honor.\n\n\"Mr. Gindes: I Think We Can Get Into Specific Allegations.\n\n\"Mr. Fusilier: I Think the Jury Heard It and I Will Object, Wasting Time.\n\n\"Mr. Eyherabide: I Will Join the Objection.\n\n\"Mr. Gindes: I Think We Can Ask Him About Each Allegation Made.\n\n\"The Court: Objection Overruled. I Should Say, Objection Is Plurally Overruled.\n\n\"By Mr. Gindes:\n\n\"Q Did You Hear Christina [H.] Tell Us That She Had Been With You on Ten Occasions Besides Being at the Green House?\n\n\"A Yes.\n\n\"Q Is That True or False?\n\n\"Mr. Eyherabide: What Is the Relevancy If He Hear[d] It or Not?\n\n\"Mr. Gindes: Because I'm Confronting With Allegations.\n\n\"The Court: Let Him Phrase His Own Questions, Counsel. Objection Overruled. Let's Proceed.\n\n\". . .\n\n\"By Mr. Gindes:\n\n\"Q Is That True or False?\n\n\"Mr. Eyherabide: Argumentative, Your Honor, for the Jury to Determine That.\n\n\"The Court: Objection Overruled.\n\n\"By Mr. Gindes:\n\n\"Q She Indicated That She Had Seen You on Ten Other Occasions Beside Being at the Green House. Was That True or False?\n\n\"Mr. Eyherabide: I'm Going to Object, Argumentative, Also Under 352, the Probative Value Is Outweighed by the Waste of Time While He Rehashes the Testimony From Several Months Ago.\n\n\"Mr. Gindes: I'm Not Going to Rehash the Testimony.\n\n\"The Court: Objections Are Overruled.\n\n\"Proceed.\n\n\"By Mr. Gindes:\n\n\"Q Is That True or False That She Indicated She Had Seen You More Than Ten Times Besides Seeing You at the Green House?\n\n\"Mr. Eyherabide: I Will Also Object as Irrelevant.\n\n\"Mr. Vendrasco: How Many Times Do They Get to Object.\n\n\"The Court: Let's Get All These Objections.\n\n\"Mr. Fusilier: My Objection Is, Your Honor, It's Assuming Something Not in Evidence. I Don't Believe She Said That. I Don't Believe She Said That, Not the Way You're Reading It. Slow Down.\n\n\"Mr. Van Meter: May the Record Reflect That Mr. Gindes Took Some Offensive Action Toward Mr. Fusilier.\n\n\"The Court: Counsel, We Have Got 16 People Giving Their Time to Hear This Case, Attorneys, Clients --\n\n\"Mr. Fusilier: He Is Paraphrasing These Things and I Don't Believe He Is Correctly Paraphrasing Them.\n\n\"The Court: Fine, Let's Hear the Question.\n\n\"Go Ahead, Sir.\n\n\"By Mr. Gindes:\n\n\"Q You Remember Christine [H.] Testifying When the Court Asked Her Questions, I'm Referring to Page 13, 14 of the Daily Transcript, 'The Court: Christina, Have You Seen Your Uncle, Mr. Wayne Dill, Jr. at Places Other Than the Green House? A Yes. Q' --\n\n\"Mr. Fusilier: Objection, If He Is Trying to Impeach This Individual, It's Improper.\n\n\"Mr. Gindes: There Is No Point in Even Cross-examining This Witness If He Is Going to Continuously Object.\n\n\"The Court: Counsel, I Would Like to Hear a Full Question, Please.\n\n\"By Mr. Gindes:\n\n\"Q You Remember the Court Asking Christina These Questions: '. . .' Do You Remember That Testimony?\n\n\"A Yes.\n\n\"Mr. Eyherabide: Objection, I Think It's Argumentative, Irrelevant and Under 352 I Would Ask the Court to Curtail These Kind of Question[s], Because the Probative Value Is Outweighed by the Waste of Time. All of Us Already Heard That Testimony and It's Time to Hear New Testimony, If There Is Any.\n\n\"The Court: I Have Indicated, Counsel, I'm Overruling Those Objections.\n\n\"Mr. Eyherabide: I Understand, Your Honor.\n\n\"By Mr. Gindes:\n\n\"Q Is That True or False?\n\n\"Mr. Rubin: I'm Going to Object, That Particular Question Is Vague and Ambiguous in That I Don't --\n\n\"Mr. Gindes: Maybe I Should Have a Break, Your Honor. I'm Not Going to Be Allowed to Cross-examine This Witness, They're Going to Harangue Me and Filibuster Me Until They Get Their Way.\n\n\"The Court: You're Going to Be Allowed to Cross-examine. You Don't Need a Break Right Now.\n\n\"Mr. Rubin: I Don't Know Whether He Means Is It True or False That He Heard the Statement or Is It True or False. The Problem Is That the Question Is Vague and Ambiguous.\n\n\"The Court: I Have Just Indicated, Objection Overruled. That Is My Ruling.\n\n\". . .\n\n\"Q [by Gindes] Did You Hear Tommy Say When He Was Being Questioned, When Mr. Fusilier Said, 'Let's Talk About Wayne Dill, My Client, Now, Did You Say That You Saw Him Do Some Nasty Things? Did He Do Some Nasty Things to You, for Example? A Who? Q Who, Wayne Dill, Your Uncle. A Yes. Q What Did He Do to You? A He Put His Privates in My Butt.' Did You Hear Tommy Testify to That?\n\n\"A [by Dill] Yes.\n\n\"Q Was That the Truth or a Lie?\n\n\"A Lie.\n\n\"Q Did You Hear Him Testify That You Did This to Him in Carol and Lisa's Bedroom?\n\n\"A Yes.\n\n\"Q Was That the Truth or a Lie?\n\n\"A Lie.\n\n\"Mr. Fusilier: I Will Object to the Repetitive Questions. They're the Same, Repetitious.\n\n\"Mr. Vendrasco: They're Repetitious Because There Are a Lot of Acts These People Testified To.\n\n\"The Court: Overruled.\n\n\"By Mr. Gindes:\n\n\"Q On March Five, 1985, Did You Hear Tommy Testify as Follows to Questions By Mr. Eyherabide: 'Okay. All Right, Remember I Was Asking You About the Grown-up Men That Would Put Their Privates Either on or in the Vaginas of the Little Girls? A Yes. Q Did You See Wayne Dill' --\n\n\"Mr. Fusilier: Let Me Interrupt and Object. How Many Times Is He Going to Ask the Same Questions?\n\n\"The Court: He Is Not Asking the Same Questions.\n\n\"Mr. Fusilier: It's a Different Attorney Is All.\n\n\"The Court: The Pattern Is to Read Testimony and Ask Him If It's True or False.\n\n\"Mr. Fusilier: But He Is Going Down the Line With Every Attorney. It's Been Asked and Answered.\n\n\"Mr. Eyherabide: I Will Join That. I Think It's Argumentative in Form and Not Eliciting Any New Testimony From the Witness Concerning Things That Will Help the Jury Decide This Case, Not Calculated to Introduce New Evidence Which Is the Purpose of Cross-examination or Direct Examination.\n\n\"Mr. Fusilier: It's Only Going to Inflame the Jury, Nothing Else.\n\n\"Mr. Vendrasco: I Think It's Important for the Jury to Know If There Is [ sic ] a Lot of Facts That These Victims Allege This Wayne Dill Did Do to Them in the Green House. That Goes to Their Credibility, Whether He Was at the Green House. I Think It's Something the Jury Should Hear and Access [ sic ] for Themselves.\n\n\"Mr. Eyherabide: They Have Already Heard It.\n\n\"Mr. Fusilier: It's the Same Act Over and Over Again With Different Attorneys.\n\n\"The Court: Objections Overruled.\"\n\n4. \"Q [by Gindes] Starting in the middle of October of 1982, did there come a long portion of time when you stopped going to D \u0026 D Auto?\n\n\"A [by Dill] No.\n\n\"Q You kept continuing to work there, is that correct?\n\n\"A Yes.\n\n\"Q Now, isn't it true that in 1982 starting approximately in October of 1982, you were attempting to evade the police?\n\n\"A No.\n\n\"Mr. Fusilier: Object to this sort of questioning, 352, besides it's irrelevant.\n\n\"The Court: Counsel, you got into the issue that he was in jail several times for not paying [traffic] tickets.\n\n\"Mr. Fusilier: What's that have to do with evading the police? It's prejudicial.\n\n\"The Court: We don't know yet. Overruled.\n\n\"Mr. Fusilier: It's irrelevant. All right.\n\n\"By Mr. Gindes:\n\n\"Q In October, approximately around October the 18th of 1982, did you get in a dispute with a person . . . by the name of Tom Beierle . . .?\n\n\"A Tom Beierle, I don't recall anybody by that name.\n\n\"Mr. Fusilier: Object, it's irrelevant. Where, no proper foundation furthermore, your Honor, object on that ground.\n\n\"The Court: Overruled.\n\n\". . .\n\n\"Q Is he [Marcus Dobbs] your best friend?\n\n\"A Yes.\n\n\"Q Now, in October of 1982, didn't you and Mr. Dobbs take a transmission out of an automobile of a man by the name of Tom Beierle?\n\n\"Mr. Fusilier: This is clearly prejudicial, your Honor.\n\n\"The Court: What's the relevance of this?\n\n\"Mr. Gindes: The relevance is that there has [ sic ] been allegations made that he's been showing up publicly in places and being in public places where he can be seen and working at D \u0026 D Auto, and I have evidence\n\nexactly to the contrary. For a period of time, he didn't care [ sic ], show his face around there for a long period of time.\n\n\"The Court: Objection overruled.\n\n\"Mr. Rubin: I object, it's irrelevant, especially as to my client.\n\n\"Mr. Fusilier: I believe there's a pattern of attempting to get into irrelevant questions under that guise of showing something that doesn't really lend anything or prove anything in this case. 352 should eliminate that.\n\n\"The Court: Overruled, sir.\n\n\"By Mr. Gindes:\n\n\"Q Do you remember getting into a dispute with a person about taking a transmission out of a car?\n\n\"A No.\n\n\". . .\n\n\"Q [by Gindes] Do you remember on January 24th of 1983, your friend, Marcus Dobbs, being arrested for his part in this taking of the transmission?\n\n\"Mr. Fusilier: Object to that. It's irrelevant. This is an attempt to inflame the jury.\n\n\"The Court: Sustained concerning Mr. Dobbs.\n\n\"By Mr. Gindes:\n\n\"Q Okay. Did you receive information from Mr. Dobbs in January of 1983 that the police had arrested him and were looking for you?\n\n\"Mr. Fusilier: Object, calling for hearsay.\n\n\"Mr. Gindes: Goes to state of mind.\n\n\"The Court: Overruled.\n\n\"The Witness: No.\n\n\"By Mr. Gindes:\n\n\"Q Do you remember the sheriff's department coming out to D \u0026 D Auto Parts, D \u0026 D at numerous times trying to contact you between October 18th of 1982 and January 24, 1983?\n\n\"Mr. Rubin: Objection, assumes a fact not in evidence.\n\n\"Mr. Fusilier: The form of the question anyway is improper, your Honor, no proper foundation for that question.\n\n\"The Court: Overruled.\n\n\". . .\n\n\"The Witness: No, I do not.\n\n\". . .\n\n\"Q Okay. Did Roy [Fizer] ever give you information that the police had been out to the premises looking for you on a number of occasions?\n\n\"Mr. Fusilier: Object, asked and answered.\n\n\"The Court: Overruled.\n\n\"The Witness: He had told me that his ex-partner that separated and one owned one car lot and another owned another car lot had came by and said that I stole the transmission from him.\n\n\". . .\n\n\"The Witness: And that he -- there was nothing ever said about cops being out there.\n\n\". . .\n\n\"Q And you don't remember Mr. Dobbs going to jail approximately on January 24th, 1983?\n\n\"Mr. Rubin: Object, irrelevant.\n\n\"Mr. Fusilier: Object, irrelevant, should be eliminated under 352.\n\n\"The Court: Sustained.\n\n\"By Mr. Gindes:\n\n\"Q Now, during the period of time from October 18, 1982 to January 24, 1983, did anybody tell you the police were out looking for you?\n\n\"Mr. Fusilier: Object, that's been asked and answered. Furthermore, irrelevant.\n\n\"The Court: Overruled.\n\n\"Mr. Rubin: And it's hearsay.\n\n\"The Court: Overruled.\n\n\"The Witness: Not that I could recall.\n\n\"By Mr. Gindes:\n\n\"Q Okay. Besides that in 1982, toward the end of 1982 and 1983, you had a whole bunch of warrants for your arrest, didn't you?\n\n\"Mr. Fusilier: Object to the form of that question, prejudicial, your Honor. Move that be stricken. It's a statement, not a question.\n\n\"The Court: Counsel, you brought up the jailing for traffic tickets, I believe, or fines.\n\n\"Mr. Fusilier: Then, I submit this is still calling for hearsay, your Honor.\n\n\"The Court: Overruled.\n\n\". . .\n\n\"The Witness: I knew there was warrants out on me for traffic violations.\n\n\"By Mr. Gindes: How many warrants?\n\n\"Mr. Rubin: I'm going to object to the number as being irrelevant.\n\n\"The Court: Overruled.\n\n\"The Witness: Three that I can recall.\n\n\"By Mr. Gindes:\n\n\"Q You say they were all traffic warrants?\n\n\"A Yes.\n\n\". . .\n\n\"Q Weren't you avoiding being seen in public because of the warrants, and also because of this business with the transmission?\n\n\"A No.\"\n\nThe subject of the transmission was brought up again later in cross-examination:\n\n\"Q [by Gindes] Do you remember approximately three pages later you told me that someone had called up your employer and said that you stole a transmission from him?\n\n\"A [by Dill] Yes.\n\n\"Q Do you consider that a dispute?\n\n\"Mr. Van Meter: Objection, your Honor. Counsel has conveniently omitted about three pages of testimony in which this subject was discussed.\n\n\"Mr. Gindes: All I see if [ sic ] three pages in which counsel made repeated objections to me asking that.\n\n\"The Court: What's the relevance of this discussion about transmissions? I understand it's for impeachment purposes possibly.\n\n\"Mr. Gindes: To show, your Honor, he was not showing around that auto sales place in 1982 in November. On the contrary, he was hiding out from the police because of warrants, and because they were looking for him because of that transmission stolen [ sic ].\n\n\"Mr. Fusilier: This is not proper to make such a statement in front of the jury. This is a back door he's taken to get, attempt to prejudice that jury against my client. What he is saying now is irrelevant.\n\n\"The Court: Overruled.\"\n\nNo attempt was made to show that the police were looking for Dill during the time in question, except possibly for the traffic warrants. Gindes subsequently made his point the proper way by calling witnesses on rebuttal who testified that Dill was not at D \u0026 D very often during the time in question.\n\n5. A major point of contention between the parties at trial was Gindes's cross-examining Tutti regarding allegations of child abuse made in other states. The issue was raised when Gindes asked Tutti if a group of people she named were the only ones who made false allegations against her about child molestation. Tutti responded that she had never been accused of molesting her children. Argumentative and relevancy objections were overruled. Gindes then offered a stipulation to strike the question and answer, otherwise he was going to cross-examine her on it. Van Meter started to ask a question about the proposed stipulation and the scope of the question, at which point Lorenz stated that the answer was of probative value to his case. The court then announced that the answer stood. Gindes subsequently proceeded to cross-examine Tutti on what she meant by molesting, which elicited the response that she had never abused her children. Gindes asked for Van Meter's opinion on the area, as he wanted to cross-examine Tutti on the volunteered response. A sidebar conference was then held. Gindes completed his cross-examination without asking further questions in the area.\n\nDuring his cross-examination of Tutti, Lorenz asked her if she had been accused of child abuse in the past. Tutti replied that she had once, in Oklahoma, when one of the boys dropped a spoon on Brian's leg. That was the only occasion; reports from Arkansas concerned the same incident, as an agency in the latter state investigated her after she moved across the border from Oklahoma.\n\nOn redirect examination, Van Meter questioned Tutti further about the incident with the spoon. In response to a relevancy objection, the court admonished the jury that the evidence was only to be considered against Tutti. Tutti's explanation was that Tommy was heating the spoon on the heater, then he dropped it onto Brian's leg and it burned his calf. It was not a bad burn. The baby-sitter reported the incident. A social worker began coming out once a month over a period of at least six months, but no police action was taken against Tutti as a result of the incident.\n\nOn recross-examination by Gindes, the following occurred:\n\n\"Q Are You Familiar With a Benton County Organization in Arkansas Called SCAN Which Stands for Suspected Child Abuse and Neglect?\n\n\"A Yes, I Am.\n\n\"Q . . . When Did You First Start Living in Arkansas After You Left Johnny [M.]?\n\n\"A In '79.\n\n\". . .\n\n\"Q When You Moved . . . to Arkansas, Did You Become the Subject of Investigations by This Anti-child Abuse Agency?\n\n\"A Yes, That Is When Tommy Burnt Bryan [ sic ] With the Spoon.\n\n\"Q In Fact, Weren't Complaints Filed Against You for Committing Acts of Physical Abuse Against Your Children?\n\n\"A Just That One About the Spoon.\n\n\"Mr. Rubin: Objection, This Is Irrelevant as to Everybody. Further It's Impeachment on a Collateral Matter, I Ask the Court to Limit This Under 352 or to Grant Severance to My Client.\n\n\"Mr. Gindes: It's Not Impeachment. Mr. Van Meter Brought This Out and Invited Us to Go Into This Area.\n\n\"The Court: Overruled.\n\n\"Mr. Fusilier: I Submit, Your Honor, Mr. Van Meter Just Covered What Had Been Covered on Direct [ sic ] Examination.\n\n\"Mr. Gindes: I Didn't Ask Any Questions About That on Direct [ sic ], I Refrained From Asking Questions About It on Direct [ sic ].\n\n\"The Court: Overruled.\n\n\"By Mr. Gindes:\n\n\"Q Now, When SCAN Started Investigating You There Were Numerous Complaints That Were Made About You as Far as the Way You Treated Your Children; Is That Correct?\n\n\"A No.\n\n\"Mr. Rubin: Objection.\n\n\"Mr. Gindes: I Would Instruct, Ask the Court to Instruct Mr. Rubin Not to Object, Because This Is Not Being Introduced Against His Client.\n\n\"Mr. Rubin: I Don't Have Any Standing? This Is Prejudicial.\n\n\"The Court: Overruled.\n\n\"Mr. Gindes: Mr. Van Meter Went Into This.\n\n\"Mr. Fusilier: It Goes to the Spill Over Theory and I Will Also Object.\n\n\"The Court: I'm Not Quite Familiar With That Theory. Overruled. Let's Move On, Counsel.\n\n\". . .\n\n\"Q Were You Told There Was an Accusation Made That You Were Using Cigarettes, Hot Cigarettes and Putting Them on Bryan's [ sic ] Feet?\n\n\"A No. That Spoon Is It.\n\n\"Q I'm Not Talking About the Spoon Incident. I'm Talking About Burning Bryan [ sic ] on His Foot With Cigarettes.\n\n\"A No.\n\n\"Q Were You Shown the Records of the Allegations That Were Made Against You?\n\n\"A I Don't Think I Was. I'm Not Sure, I Don't Remember. But I Never Remember Nothing Like That.\n\n\"Q Let Me Show You One, See If It Refreshes Your Recollection. Do You Remember Seeing This Piece of Paper Where It Has Names Whited Out and Allegations Against You Made About Physical Abuse to the Children?\n\n\"Mr. Fusilier: I Will Object, Your Honor, He Has Testified Repeatedly. This Is Not Proper, I Object.\n\n\"The Court: Overruled.\n\n\"Mr. Fusilier: Ask That He Be Admonished for Not [ sic ] Doing So Again.\n\n\"Mr. Rubin: Join.\n\n\"The Court: Overruled.\n\n\"The Witness: That Must Have Been the Same Time as the Spoon Because That Is the Only Time.\n\n\"By Mr. Gindes:\n\n\"Q Wasn't the Allegation Made Against You That You Were Using Cigarettes on Bryan's [ sic ] Feet?\n\n\"A No, I Don't Think -- I Never Heard That, No.\n\n\"Q Wasn't an Allegation Made Against You That Bryan [ sic ] Had a Burn on His Leg That Was Approximately Two and One Half Inches Long, Looks Like the End of a Butcher Knife Burn, a Raw, Open Sore With Dirty Bandaid Covering It? Wasn't That Allegation Made Against You?\n\n\"A No, I Don't Ever Remember That.\n\n\"Q Did You Just See That Piece of Paper I Showed You?\n\n\"A Yes, I Seen It.\n\n\"Q Did You Read That Piece of Paper?\n\n\"A Yes, I Read It.\n\n\"Q Isn't That the Allegation That Was Made Against You?\n\n\"A I Never Heard That, No.\n\n\"Mr. Fusilier: I Object, People Don't Get to Read Allegations Made in Law Enforcement, by Law Enforcement Officers. That Is Improper.\n\n\"The Court: Overruled.\n\n\"By Mr. Gindes:\n\n\"Q Isn't That an Accurate Description of This Little Burn on Bryan [ sic ], Two and a Half Inches Long?\n\n\"A No, It Wasn't a Big Burn.\n\n\". . .\n\n\"Q Now, You Indicated That This Was Such a Minor Thing That Bryan [ sic ] Wasn't Taken to a Doctor; Is That Correct?\n\n\"A No, Bryan [ sic ] Wasn't Taken to a Doctor.\n\n\"Q What?\n\n\"A He Wasn't Taken to a Doctor.\n\n\"Q That Is Not True. He Was Taken to a Doctor.\n\n\"A For His Burn?\n\n\"Q Yes.\n\n\"Mr. Fusilier: This Is Argumentative. I Will Object, She Just Answered That.\n\n\"The Court: Overruled.\n\n\"The Witness: Not for His Burn.\n\n\"Mr. Rubin: Impeachment on a Collateral Matter, Your Honor. I Object Under 352, It's Time Consuming.\n\n\"The Court: Overruled.\n\n\"Mr. Rubin: Then It's Irrelevant.\n\n\"The Court: That Is Overruled, Also.\n\n\"By Mr. Gindes:\n\n\"Q Now, Your Son, Bryan [ sic ], Was Taken to a Doctor Hutchison; Is That Correct?\n\n\"A I Think I Remember Taking Him in for a Physical, But I Don't Think It Was Just for the Burn.\n\n\"Q Didn't SCAN Take Your Child and Take Him to a Doctor Hutchison?\n\n\"A I Took Him, I Think.\n\n\"Q To Doctor Hutchison?\n\n\"A I'm Trying to Remember.\n\n\"Q That Was for the Burn, Wasn't It?\n\n\"Mr. Van Meter: Objection, He's Not Giving the Witness an Opportunity --\n\n\"The Witness: No, I Think It Was for a Complete Physical.\n\n\"The Court: Overruled.\n\n\". . .\n\n\"By Mr. Gindes:\n\n\"Q Isn't Is True That SCAN Took Bryan [ sic ] and Took Him to Doctor Hutchison?\n\n\"A I Think I Remember Now Something About Taking Him for a Complete Physical From SCAN.\n\n\"Q Didn't Doctor Hutchison Report There Is No Way This Burn Could Have Been Caused By a Spoon?\n\n\"Mr. Van Meter: Objection, Hearsay.\n\n\"The Court: Overruled.\n\n\"The Witness: No, I Don't Think So.\n\n\"By Mr. Gindes:\n\n\"Q Didn't the People at SCAN Tell You That the Child Was Taken to a Doctor and the Doctor Had Told You This Was Not Caused by a Spoon?\n\n\"A No.\n\n\"Mr. Rubin: Hearsay.\n\n\"Mr. Van Meter: Double Hearsay.\n\n\"The Court: Overruled.\n\n\"The Witness: No, They Didn't.\n\n\". . .\n\n\"Q Now, When Bryan [ sic ] Was Taken to A Doctor, Isn't It True That the Burn Incident Occurred Approximately Around November 20th, of 1979?\n\n\"A Somewhere Around There.\n\n\"Q And When Bryan [ sic ] Was Taken --\n\n\"Mr. Fusilier: In That Case, Your Honor, I Will Submit It's Irrelevant If It Happened in 1979.\n\n\"The Court: Mr. Van Meter Opened the Door. Overruled.\n\n\"By Mr. Gindes:\n\n\"Q When Bryan [ sic ] Was Taken to the Doctor, That Wasn't the Only Injury on Him, Was It?\n\n\"A I Don't Think He Had Any Other Injuries.\n\n\"Q Didn't He Have Black and Blue Marks Down His Backside, Strap Marks?\n\n\"A No.\n\n\"Q Are You Saying That Bryan [ sic ] Did Not Have Black and Blue Marks on His Buttocks and o[n] His Upper Back?\n\n\"A He May Have Had a Bruise.\n\n\"Mr. Van Meter: Objection, Asked and Answered.\n\n\"The Court: Overruled.\n\n\"The Witness: No.\n\n\"By Mr. Gindes:\n\n\"Q Did He Have Black and Blue Marks on His Buttocks and Upper Back?\n\n\"A No.\n\n\"Mr. Fusilier: It's Been Asked and Answered.\n\n\"The Court: I Don't Think It Has. Overruled.\n\n\". . .\n\n\"Q Did You Ever Explain to Tommy That If You Used a Plastic Spoon It Wouldn't Burn His Hand When He Inflicted a Burn?\n\n\"A No.\n\n\". . .\n\n\"Q Wasn't There Another Time When Bryan [ sic ] Was Referred to SCAN With Burns?\n\n\"A No.\n\n\"Q You Remember a Time When You Said, Oh, It Was Some Hot Pies That Bryan [ sic ] Pulled Off the Stove and That Burned Him That Time?\n\n\"A I Don't Remember.\n\n\"Q You Have No Recollection of That?\n\n\"A No.\n\n\"Q Are You Saying It's Untrue?\n\n\"Mr. Rubin: Objection, Question Is Argumentative.\n\n\"The Court: Overruled.\n\n\"The Witness: I Don't Remember Anything Like That Happening.\n\n\"By Mr. Gindes:\n\n\"Q Mr. Van Meter Asked You If Any Warrant Was Filed or Any Actions Were Filed Against You in Arkansas. Do You Recall the Arkansas Department of Human Services Closing the Case Against You for the Reason You Moved From the State?\n\n\"Mr. Rubin: Objection, Calls for Hearsay, Calls for Speculation.\n\n\"Mr. Gindes: She Is Testifying That There Were No Warrants Issued for Her. I Think This Also Goes to the Same Area.\n\n\"Mr. Van Meter: Was There a Warrant?\n\n\"The Court: What Does That Have to Do With the Issuance of a Warrant Other Than to Say They Dropped It Because She Left the State?\n\n\"Mr. Gindes: I Think I'm Entitled to Show the Reason Why This Was Dropped, Not the Reason Mr. Van Meter Implied, That She Was Not Guilty of This Conduct.\n\n\"The Court: Overruled.\n\n\"Mr. Rubin: You Can't Do It This Way.\n\n\"The Court: Overruled.\n\n\"By Mr. Gindes:\n\n\"Q You Left the State; Is That Correct?\n\n\"A The Lady Did Visit Me a Couple Times After I Moved to Oklahoma.\n\n\"Q SCAN Would Send People Out to Visit You on Numerous Occasions?\n\n\"A Yes, One Lady.\n\n\"Q You Kept Moving Time and Time Again When They Were Trying to Fin[d] You to Interview?\n\n\"A No, I Always Told Her Where I Lived.\n\n\"Mr. Fusilier: This Is Collateral.\n\n\"The Court: Overruled.\n\n\"By Mr. Gindes:\n\n\"Q Did You Also Always Tell Her Where You Moved To?\n\n\"A Yes.\n\n\"Q Isn't One of the Reasons Why You Left the State of Arkansas Is That You Were Getting Tired of These People From SCAN 'Spying' on You and Your Children All the Time?\n\n\"Mr. Fusilier: Argumentative.\n\n\"The Witness: No.\n\n\"The Court: Overruled.\n\n\"The Witness: I Had Nothing to Hide.\n\n\"By Mr. Gindes:\n\n\"Q In a Period of Six Months, Didn't They Maybe Make 20 or 30 Visits to Your House?\n\n\"Mr. Rubin: I'm Going to Object, It's Irrelevant How Many Times They Came Out.\n\n\"The Court: Counsel, Mr. Van Meter Opened the Door.\n\n\"Mr. Rubin: I Didn't Open the Door.\n\n\"The Court: Overruled.\n\n\". . .\n\n\"By Mr. Gindes:\n\n\"Q Do You Remember a Time on November the 21st of 1979 Being in the Office of SCAN?\n\n\"A I Have Probably Been There a Time or Two.\n\n\"Q Do You Remember Being in the Office That Day and Being Told That the Spoon Story Was Inconsistent With Your Explanation.\n\n\"A No.\n\n\"Mr. Rubin: Objection, Hearsay.\n\n\"The Court: Overruled.\n\n\"By Mr. Gindes:\n\n\"Q Do You Remember Telling the People at SCAN That It Was 'The Baby-sitter That Made the Black and Blue Marks and It Wasn't You'?\n\n\"A No, I Don't Remember Making That Statement.\n\n\"Q You Never Accused the Baby-sitter of Doing Any of This?\n\n\"Mr. Fusilier: Argumentative, Object.\n\n\"The Court: Overruled.\n\n\"The Witness: I Don't Remember.\n\n\"Mr. Fusilier: I Would Like to Inquire If This Is Coming Out of Mr. Gindes' Imagination or Is It a Statement?\n\n\"Mr. Gindes: Do You Think That Is Where I'm Getting It?\n\n\"Mr. Fusilier: Yes, That Is What I'm Beginning to Think. I Don't Have Any Such Discovery as That.\n\n\"Mr. Eyherabide: Your Honor, I, for the Record, Was Not Aware of These Reports Myself.\n\n\"Mr. Gindes: I Think the Court Can Take Note of the Fact, We, on Numerous Occasions Told Counsel We Had Them and Made Them Available for Inspection. As a Matter of Fact, if Counsel Says They Didn't Have Them, When We Got the Reports There Was a Subpoena From Mr. Pitts' Lawyer, It Was on the Top of the Report and That He Had Got Them.\n\n\"Mr. Eyherabide: I Never Go[t] Them.\n\n\"The Court: Objection Overruled.\n\n\"Mr. Rubin: Can We Have Mr. Pitts' Previous Lawyer?\n\n\"Mr. Gindes: Mr. Pitts' Lawyer?\n\n\"Mr. Rubin: I Would Ask Comments of Counsel to Be Stricken, They're Misleading. I'm Mr. Pitts' Lawyer, I Never Subpoenaed Those Records.\n\n\"Mr. Gindes: I'm Not Going to Argue What I Turned Over to the Other Lawyer.\n\n\"Mr. Fusilier: I Don't Believe There Are Any Record[s] From This State of what Persons Said About Various SCAN Investigations.\n\n\"The Court: Show Him the Documents.\n\n\"Mr. Eyherabide: I Would Move for Copies of the Documents.\n\n\"Mr. Lorenz: I Think I Saw Them Before Trial, as a Matter of Fact.\n\n\"Mr. Gindes: These Were Offered to All Counsel.\n\n\"Mr. Eyherabide: They Were Not Ever Offered to Me or Disclosed to Me.\n\n\"Mr. Fusilier: Statements About Plastic Spoons or Things Like That, Now [ sic ] Where Can Those Be Found in Here.\n\n\"Mr. Eyherabide: I Think the Court Can Note If They Had Offered Them to Me I Would Have Taken Them.\n\n\"Mr. Lorenz: Mr. Vendrasco Made Them Available to Me Before the Trail [ sic ] Started.\n\n\"Mr. Eyherabide: He Never Told Me About Them. He Is Laughing, Your Honor, But I Would Like to See Him Get Under Oath and Have Him Say That He Did.\n\n\"Mr. Vendrasco: Are You Running This Court, Mr. Eyherabide?\n\n\"Mr. Eyherabide: Mr. --\n\n\"The Court: Mr. Eyherabide, That Is It.\n\n\". . .\n\n\"The Court: Those Will Be Available From the District Attorney's Office . . . .\n\n\"By Mr. Gindes:\n\n\"Q Didn't You, After You Left Arkansas, Continue to Punish Bryan [ sic ] When He Disobeyed You by Burning Him?\n\n\"A No, I Never Have.\n\n\"Mr. Van Meter: Object to the Form of the Question, Continued to Punish Bryan [ sic ].\n\n\"The Court: Overruled.\n\n\"Mr. Rubin: Your Honor, Objection, Assumes a Fact Not in Evidence.\n\n\"The Court: All Right . . . .\"\n\nNone of the alleged SCAN reports were ever introduced into evidence. Nor does it appear that Gindes was prepared to do so, assuming they were admissible. Accordingly, most of the allegations were not properly in evidence. Given questions such as the one about whether Tutti continued to punish Brian by burning him, it is impossible to conclude that Gindes was merely cross-examining in this area in order to impeach Tutti's credibility. The only possible purpose for most of the foregoing is to paint Tutti as a bad mother.\n\nGindes also touched on these elements in his closing argument:\n\n\"And going down the line again, Marcella Pitts. Well, the evidence shows pretty much that one [ sic ] one is going to give her the mother of the year award before she started up with Rick Pitts. But again, look at not only Marcella Pitts' relation to Rick Pitts, but two other people. Him, Clifford. Her, Norma . . . .\n\n\". . .\n\n\"Those two people and Rick, and I'm not saying, you know, we've heard about this incident that took place in Arkansas about the spoon incident where a child allegedly, where Marcella says what happened, Tommy took a spoon and put it on a flame and heated it up until it was real hot, and accidentally dropped it on the calf of B.J.'s leg. Well, anybody familiar with elementary principles of chemistry or physics, children who have spoons and dropping on legs and producing burns like that.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e Okay. I'm not trying her for that. Mr. Van Meter brought that up for whatever reason he wanted to. But, that before she got involved with Rick Pitts, there are no allegations of child molestation. There are no allegations of committing these atrocities that took place here. It's only after. I mean, she was being accused of the things that virtually have been, you know, admitted against her. Smoking pot, you know, in front of kids. Not providing for them well. Not clothing them well. Having the older boy cook, stuff like that.\"\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e\n\nThe general rule in this area is stated in People v. Harris (1981) 28 Cal. 3d 935, at page 953 [171 Cal. Rptr. 679, 623 P.2d 240], as follows: \"'Where a defendant takes the stand and makes a general denial of the crime the permissible scope of cross-examination is very wide.' [Citation.]\n\nWhen a defendant voluntarily testifies in his own defense the People may 'fully amplify his testimony by inquiring into the facts and circumstances surrounding his assertions, or by introducing evidence through cross-examination which explains or refutes his statements or the inferences which may necessarily be drawn from them.' [Citation.] Evidence relevant for these purposes is admissible even though it incidentally involves an unrelated offense. [Citation.]\"\n\nHere, however, little actual evidence came in; most was inference and innuendo. Also, the material's relevancy is in question. The alleged incidents happened in 1979, several years before the period at issue in the instant case. Moreover, what Gindes did was not necessary to impeach Tutti's credibility as to her statements that she had never abused, or been accused of molesting, her children.\n\nNor did Van Meter's alleged \"opening the door\" excuse what occurred. For example, hearsay is admissible in the absence of an objection, and once in evidence, a witness may be cross-examined on it. (People v. Fatone (1985) 165 Cal. App. 3d 1164, 1171-1172 [211 Cal. Rptr. 288].) \"The fact that a topic is raised on direct examination and may therefore appropriately be tested on cross-examination, however, does not amount to a license to introduce irrelevant and prejudicial evidence merely because it can be tied to a phrase uttered on direct examination.\" (People v. Luparello (1986) 187 Cal. App. 3d 410, 426 [231 Cal. Rptr. 832].)\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e Moreover: \"'An error that is prejudicial is no less so because it results from a lack of knowledge on the part of either counsel or both. Legitimate cross-examination does not extend to matters improperly admitted on direct examination. Failure to object to improper questions on direct examination may not be taken advantage of on cross-examination to elicit immaterial or irrelevant testimony . . . . \"Questions designed to elicit testimony which is irrelevant to any issue in the case on trial should be excluded by the judge, even though opposing counsel has been allowed, without objection, to introduce evidence upon the subject.\" [Citation.]'\" (Dastagir v. Dastagir (1952) 109 Cal. App. 2d 809, 815 [241 P.2d 656].)\n\nThere is no reporter's transcript of the sidebar conference in which Van Meter apparently invited cross-examination into the spoon burning incident, nor do we know what may have motivated him. Regardless of this\n\nfact, Gindes should not have been permitted to carry the matter to the extremes he did.\n\nThe matter is further complicated by the trial court's refusal to allow Van Meter to rebut the inferences raised by Gindes's cross-examination. Van Meter was not permitted to call either Johnny or Detective Fields, to testify that Fields asked Johnny if Johnny knew of anything happening to Brian when they lived in Oklahoma. According to Fields's report, Johnny said Tommy burned Brian with a hot spoon, but he was a little kid and did not know what he was doing. When Fields asked if Tutti ever did anything like that, Johnny said not that he knew of. The court ruled:\n\n\"Anything That Happened Back There, Since It Wasn't Brought Up by the Prosecution, That Certainly Is Collateral, What Took Place in Another State. They're Not Charged With That. The Defendants Aren't Charged With That, or Your Client, Specifically, That Is Not One of the Allegations Against Them. That Is Something That Occurred at a Different Time in a Different State . . . .\"\n\n6. \"Q [by Gindes] After You Found Out That a Doctor Had Examined the Children, You Tried to Get Another Doctor to Examine the Children; Is That Correct?\n\n\"A [by Norma Pitts] Well, I Had Heard That He [Dr. Woodling] Was Unreliable, That He Was Working With the Court.\n\n\"Q Who Did You Hear That From?\n\n\"Mr. Sims: Objection, Hearsay.\n\n\"The Court: Overruled.\n\n\"By Mr. Gindes:\n\n\"Q Who Did You Hear That From?\n\n\"A From Other People Whose [ sic ] Been in the Same Type Cases.\n\n\"Q Convicted Child Molesters?\n\n\"A I Would Say That.\n\n\"Mr. Fusilier: Objection, Hearsay.\n\n\"By Mr. Gindes:\n\n\"Q Convicted Child Molesters?\n\n\"A They Have Been Convicted.\n\n\"Q But They Are, of Course, Innocent?\n\n\"Mr. Van Meter: Objection.\n\n\"The Court: Sustained.\n\n\"Mr. Van Meter: I Ask That Counsel Be Cited for That Remark.\n\n\"The Court: Sustained.\n\n\"By Mr. Gindes:\n\n\"Q Who Are the People You Heard Bring This Up?\n\n\"A Some People.\n\n\"Q Who?\n\n\"A If You Want to Know --\n\n\"Q Who.\n\n\"A From Members of VOCAL.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e\n\n\"Q Who? Name One Person.\n\n\"Mr. Fusilier: Objection, Irrelevant.\n\n\"Mr. Rubin: Join.\n\n\"Mr. Fusilier: Collateral Matter Here.\n\n\"The Court: Answer the Question.\n\n\". . .\n\n\"By Mr. Gindes:\n\n\"Q I Said Name One Person.\n\n\"A They Told Me in Confidential [ sic ].\n\n\"Q Name One Person.\n\n\"A I Object --\n\n\"Mr. Fusilier: Just a Moment, I Object to the Form of That Question. This Is Not a Question, It's Argumentative.\n\n\"The Court: Overruled.\n\n\"By Mr. Gindes:\n\n\"Q Are You a Clergy Member?\n\n\"A No, I Am Not.\n\n\"Q Then You Have to Name One Person.\n\n\"A If You Must Know, It Was Mr. Kniffen Told Me.\"\n\nMr. Kniffen was convicted of numerous counts of child molestation in 1984, in one of Kern County's notorious child molestation ring cases. It was improper for Gindes to link this case with that. (See People v. Adams (1939) 14 Cal. 2d 154, 162 [93 P.2d 146], overruled on other grounds in People v. Burton (1961) 55 Cal. 2d 328, 352 [11 Cal. Rptr. 65, 359 P.2d 433].) If Gindes's purpose was to impeach Norma's opinion of Woodling's abilities, that purpose was achieved once he elicited that she had heard about Woodling from a convicted child molester. Bringing out the Kniffen case by name could only have served to inflame the jury. Nor was this the only time other child molestation cases were mentioned.\n\n7. \"Q [by Gindes] Now, Do You Know That After Amanda Saw You She Was Hysterical for Almost 45 Minutes?\n\n\"A [by Rick] I Realize That.\n\n\"Mr. Rubin: Objection, Assuming a Fact Not in Evidence.\n\n\"The Court: Overruled.\n\n\"Mr. Rubin: Your Honor, I'm Going to Move for a Mistrial at This Point. There Is No Such Evidence of That.\n\n\"Mr. Fusilier: He Mentioned 45 Minutes and I Don't Think We Have 45 Minutes Worth of Testimony From That Morning.\n\n\"The Court: The Witness Can Answer.\n\n\"By Mr. Gindes:\n\n\"Q Do You Know for 45 Minute[s] She Sat on my Lap Screaming and crying, 'Don't Let Rick Hurt Me,' After She Looked You in the Face?\n\n\"Mr. Rubin: I'm Moving for a Mistrial at This Point.\n\n\"All Defense Counsel: (Join.)\n\n\"The Court: Denied.\n\n\"By Mr. Gindes:\n\n\"Q Do You Know That, Mr. Pitts?\n\n\"A I Don't Know That.\n\n\"Q Mr. Pitts, What Did You Do to Her?\n\n\"A I Didn't Do Nothing to Her. What Did You Do to Her?\n\n\"Q You Think I Did Something to Her to Make Her Do That?\n\n\"A I Think Somebody Did. One Thing This Jury Hasn't Heard One Tape on Any of These Kids, How You Questioned Them or Anything Else.\n\n\"Q You Think by Us Questioning Her She Started Getting Hysterical?\n\n\"A I Know That Kid Wouldn't Have Begged and Cried for an Hour and a Half Before We Moved to Oklahoma. She Wasn't Scared of Me.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e\n\n\"Q Do You Have Any Neutral Witnesses From the Last Time You Saw Her?\n\n\"A You Claim Everybody That Is Bias [ sic ] and Wants to Get Up and Lie.\n\n\"Q People That Aren't Defendants in This Case.\n\n\"Mr. Fusilier: This Is Argumentative.\n\n\"Mr. Rubin: Join. Move for a Mistrial.\n\n\"The Court: Denied.\n\n\". . .\n\n\"Q How Do You Think We Made Her Afraid of You By Questioning Her, Mr. Pitts?\n\n\"A Ain't Much Telling.\n\n\"Q There Ain't Much Telling.\n\n\"Mr. Rubin: Objection.\n\n\"The Court: Overruled.\n\n\". . .\n\n\"By Mr. Gindes:\n\n\"Q Mr. Pitts, None of the Attorneys or the Judge in This Action Were in the Green House. We Heard the Testimony of Children and the Testimony of You, but We All Saw What Happened to Amanda. Can You Explain --\n\n\"Mr. Van Meter: The Question Is Argumentative. It's Been Asked and Answered.\n\n\"All Defense Counsel: (Join Objection.)\n\n\"By Mr. Gindes:\n\n\"Q Can You Explain to Us What Would Cause That Terror of That Child Just Looking You in the Face?\n\n\"A I Can Say One Thing, Whatever You Say in Front of This Jury, It Don't Say, Change the Truth. There Is Seven People Over There That Knows the Truth.\n\n\"Q That Terror, That Is the Truth. That Is One Thing That Knows the Truth.\n\n\"A What I'm Saying Is the Truth.\n\n\"All Defense Counsel: (All Objecting and Asking for Mistrial.)\n\n\"Mr. Rubin: I Believe the Objections Were Argumentative by All Attorneys.\n\n\"The Court: Overruled.\n\n\". . .\n\n\"Q Is That the Reason Why Little Amanda Was So Terrified of You Because You Yanked Her Around?\n\n\"A I Heard You Say Before That, Ask Lisa If Rick Was Real, Real Nice to Her. Johnny Comes -- How Come Johnny Comes Up With the Other Real, Real Mean to Her? Couldn't Make Your Mind Up?\n\n\"Q You Heard Amanda -- Johnny Say You Be Nice to Lisa?\n\n\"A I Have Heard Lisa, Angela and a Few Others.\n\n\"Q We Have Heard Lots of Witnesses, but We Have All Seen That Terror in the Courtroom.\n\n\"Mr. Van Meter: Objection, Argumentative.\n\n\"Mr. Rubin: Objection, Also Assuming a Fact Not in Evidence.\n\n\"The Court: Sustained.\n\n\"Mr. Rubin: Move to Strike The --\n\n\"The Court: Request to Strike Denied.\"\n\n8. \"Q [by Vendrasco] . . . Approximately Two Months Ago, Did You Take -- Did You Attempt to Take Steps to Safeguard Your Children [the M. boys]?\n\n\"A [by Janice M.] Yes, We Did.\n\n\". . .\n\n\"Q Did You Seek to Have Your Kids in a Safe Environment?\n\n\"A Yes.\n\n\"Mr. Rubin: Objection, Irrelevant.\n\n\"Mr. Vendrasco: Very Relevant if They Have Been Threatened, Your Honor.\"\n\nAfter defense objections, Vendrasco asked to make an offer of relevancy. The jury and Janice were both excluded. Vendrasco asserted that defense counsel had previously elicited from other witnesses that the boys were in shelter care, and he did not want to leave the jury with the impression that said placement had something to do with the unfitness of Janice's home or similar reasons. He explained that he made the statement about threats in front of the jury, because he was getting a \"barrage of objections\" and he was merely stating relevancy.\n\nThe court suggested that he simply say the children were put in shelter care for their own protection, and leave it at that. Fusilier argued that the harm had already been done, but the court proposed that Janice be asked if the children were put in shelter care for their own protection, without any mention of threats. Eyherabide and Rubin objected; Vendrasco stated the court could tell the jury to disregard anything about threats. A motion for mistrial was denied. The jury was brought back in, after which the following occurred:\n\n\"[The Court]: Ladies and Gentlemen, You Will Disregard Any Comments as to the Reason for Tommy [M.] Going Into Shelter Care. He Was Put in Shelter Care for His Own Personal Safety and Well Being. Disregard Also Any Comments Regarding Any Alleged Threats That May Have Been Made.\n\n\"All Right, Mr. Vendrasco?\n\n\". . .\n\n\"By Mr. Vendrasco:\n\n\"Q Were the Boys Put in Shelter Care for Their Own Well Being?\n\n\"A [by Janice M.] Yes, They Were.\"\n\nThis is not the first time that alleged threats were raised in front of the jury. During cross-examination of Carol Darling, defense counsel questioned her regarding her various contacts with Christine. On redirect examination, Gindes asked Ms. Darling whether, while she was in Boswell with Brad Darling, concerns surfaced about Christine's physical safety. Rubin objected that this was an area in which the potential prejudice greatly outweighed any probative value; in the hearing outside the jury's presence, Gindes responded that he had a right to refute the defense's implications that Ms. Darling met often with Christine in order to condition Christine into becoming a prosecution witness. Rubin objected that any threats made in the time frame had to relate to Cliffy and Clovette, since everyone else was already in custody, and Cliffy and Clovette were not on trial. The court suggested Gindes question Ms. Darling about her concern over Christine's care and safety, since that did not connote any threat of kidnapping, and indicated it was also proper for Ms. Darling to have discussed with Christine Cliffy's and Clovette's possible hiding place.\n\nEyherabide then requested that the court admonish the jury that the evidence about information received by Ms. Darling relative to Clovette or Cliffy, was not being admitted for the truth of such evidence, but only to explain the contact between Ms. Darling and Christine. The court replied, \"I think that's patently obviously [ sic ] as to why it's coming in. Request denied.\"\n\nWhen the jury returned, Gindes carefully questioned Ms. Darling about her contacts with Christine during the time Brad Darling and Gindes were\n\nin Oklahoma, whether at the time she decided she had to do something about Christine's care and safety, and whether she contacted Christine for that purpose. After questioning regarding other contacts between Ms. Darling and Christine during the course of the various preliminary examinations, the following occurred:\n\n\"Q [by Gindes] Now, I Want to Go Back a Little Bit Because I Think I Got Sloppy, and I Didn't Cover This Before. But Do You Remember When You First Met Christine, Having a Contact With Her That Involved Going Out to Lunch With Her?\n\n\"A [by Carol Darling] Yes.\n\n\"Q Could You Tell Us About That?\n\n\"A It Was One of My First Contacts With Her, But I Already Knew Her, So It Was Probably My Second or My Third, and She Was in My Office and It Was Approaching the Lunch Hour, and She Was in Foster Care, and I Asked Her if She Was Hungry, if She Wanted to Go to Lunch. We Talked About Going to Lunch Together. I Told Her That I Wasn't a Brave Person and That if She Was in Any Danger or Knew of Anyone That Wanted to Hurt Her, Then I Could Take My Husband and He Could Go With Us, if That Is What She Wanted, or We Could Go by Ourselves. She Said, 'I Think You Better Take Your Husband.' So My Husband and Myself and Christina Went to Lunch.\n\n\"Mr. Rubin: Your Honor, I'm Going to Object. Move to Strike Further, I Think It Totally Violates What the Court Ordered.\n\n\"Mr. Gindes: This Has Nothing to Do With That, This Is 356 of the Evidence Code.\n\n\"The Court: Objection Overruled.\n\n\"By Mr. Gindes:\n\n\"Q So That Was Really When You Had This Conversation, This Was Way Before You [ sic ] Went to Boswell?\n\n\"A She Was Still in Foster Care.\"\n\nAs stated in People v. Weiss (1958) 50 Cal. 2d 535, 554 [327 P.2d 527]: \"'Efforts to suppress testimony against himself indicate a consciousness of guilt on the part of a defendant, and evidence thereof is admissible against him. [Citation.] Generally, evidence of the attempt of third persons to suppress testimony is inadmissible against a defendant where the effort did not occur in his presence. [Citation.] However, if the defendant has authorized the attempt of the third person to suppress testimony, evidence of such conduct is admissible against the defendant.' [Citations.] If the attempt is made by a third person, not in the presence of a defendant or shown to have been authorized by him, it should at once be suspect as a mere purporting attempt to suppress evidence and in truth an endeavor to prejudice the defendant before the jury in a way which he cannot possibly rebut satisfactorily because he does not know the true identity of the pretender. The wilful offering of such evidence might well form the basis for declaring a mistrial instanter, or for granting a new trial, or for reversal on appeal . . . .\"\n\nIn both of the instances cited above, the only reasonable implication is that some of the children were threatened in connection with this case. That leads to the inescapable conclusion that the threats were made by or on behalf of defendants. However, since the prosecutor could not prove that defendants made the threats or authorized third persons to do so, the evidence should not have been admitted and Vendrasco should not have commented that Janice's testimony was relevant if the boys had been threatened.\n\nInstead of curing the harm, the trial court's admonition compounded it by informing the jury as a proven fact that Tommy had been placed in shelter care for safety purposes. Although the court also told the jurors not to consider any alleged threats, what else were they likely to think? If Vendrasco's concern was that the jury not speculate that the boys' home was somehow unfit, then he should simply have asked Janice directly whether unfitness of the home was the reason. Any speculation by the jury that resulted would have been less likely to include the possibility of threats, and thus would have been less prejudicial to defendants. Likewise, the admonition should have simply advised that Tommy was not placed in shelter care due to unfitness of his home. As things stood, the jury was left with the unalterable impression that defendants had a hand in threatening possibly Christine, and certainly Tommy. The prejudice from this impression was not alleviated by the giving of CALJIC No. 1.02 (\". . . You must never assume to be true any insinuation suggested by a question asked a witness . . .\"), since the harm flowed not so much from a question's insinuation, but from what the jury was told to accept as fact.\n\nH. Misconduct Outside Jury's Presence\n\nA great deal of prosecutorial misconduct occurred outside of the jury's presence. Obviously, such misconduct cannot have prejudiced the jury directly, but given its egregious nature and the one-sidedness of some of the trial court's rulings, it must be discussed because of its possible impact on the court. Additionally, some of it appears to have been calculated to have a chilling effect on attempts to vigorously defend the accused. Representative examples follow.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e\n\n1. On several occasions, the parties argued about whether the court-room configuration violated the confrontation clause of the Constitution. These disputes arose, for example, when defense counsel were forced to question from a podium situated so that the witness did not need to look at defendants.\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e At one point, Rubin moved to strike Christine's testimony on confrontation clause grounds. While arguing that the witness could see the defendants if she wanted to but defendants had no right to force her to look at them, Gindes stated:\n\n\"I Didn't Like the Way Mr. Van Meter Positioned It [the podium] Himself the Way He Did So if This Witness Ever Looked at Him She Would Have to Look at Ricky Pitts, a Person That She Has Indicated She Is Terrified of. I Really Take Umbrage at the Fact and Really Am Aggravated at the Fact That Counsel Could Take Such a Fine Document as Our Constitution and Try to Interpret It in Such a Way That Lets Defense Counsel Do Creepy Things to Intimidate a Witness and Force a Witness to Look at a Client Who Sexually Abused Them.\"\n\n2. Gindes frequently sought to explain away his own conduct by arguing misconduct on the part of defense counsel. For instance, the following occurred during argument on one of Rubin's motions for mistrial:\n\n\"[The Court]: Mr. Gindes, any comment?\n\n\"Mr. Gindes: Only, your Honor, that I really object to Mr. Rubin's characterization of the way these proceedings have been held. I think it's totally inaccurate. I guess he's shifting his attack from the prosecution now to the Court. Now, everybody is under some basis of attack in his mind, probably excluding himself.\n\n\"I think that, number one, Mr. Van Meter was continuously asking questions about having the witness, and another thing that happens that disturbs me is and I don't know if the Court has been seeing this. Mr. Eyherabide giggles and laughs.\n\n\"The Court: He has his back to me. I can't see him.\n\n\"Mr. Gindes: During cross-examination the witness says something Mr. Eyherabide thinks is wrong, he will giggle and laugh about it or Mr. Rubin, and I know other judges, specifically Judge McNutt, has threatened to put Mr. Eyherabide in jail for unprofessional conduct for giggling and laughing at witnesses in court, and I just wish he would keep his demeanor. We have a child here. Maybe Mr. Eyherabide should learn to straighten out his demeanor. As I was talking to the Court he was giggling and smirking and laughing. It throws me off my pace to have him constantly do that.\n\n\". . .\n\n\"Mr. Rubin: . . . I object to Mr. Gindes attempting to put factual matters on the record which just aren't there. Things that happened with Mr. Eyherabide in some other trial which aren't proper for this Court to take.\n\n\"Mr. Gindes: It's proper because of what he's been doing, it's a pattern. It's not an isolated thing.\n\n\". . .\n\n\"Mr. Eyherabide: I don't know why counsel continues to make personal attacks. I don't know if Judge McNutt ever threatened to put me in jail for unprofessional conduct. He never did it in my presence . . . .\n\n\"The comment is I would ask the Court to think about this, I don't know why counsel doesn't want to talk about the issues, whenever he doesn't want to talk about the legal issues, some reason we get these personal attacks. Ask the Court to instruct him to just please talk about the legal issues.\n\n\"Mr. Gindes: They're not personal attacks. Mr. Eyherabide represented to the Court that he did not have a preliminary hearing in front of Judge McNutt when Judge McNutt brought to the attention that he observed Mr. Eyherabide snickering and smirking and laughing at the testimony of a witness and told him not to do it or he was going to get a contempt.\n\n\"Mr. Eyherabide: I don't recall that.\n\n\"Mr. Gindes: It never happened?\n\n\"Mr. Lorenz: Let's have a ruling.\n\n\"The Court: Denied.\"\n\n3. \"Mr. Rubin: Then, I'd like to make a motion to strike the testimony of this witness [Windy] as being without foundation, irrelevant to the charges at hand.\n\n\"The Court: On what basis?\n\n\"Mr. Rubin: The basis is that they're irrelevant. Vague as to time. They don't relate to the charges in the information, and if the prosecution hasn't elected, they don't relate to the charges, the testimony of which has already come in ahead of time from other witnesses.\n\n\"The Court: All right. Mr. Gindes.\n\n\"Mr. Gindes: . . . If they want people to testify against them that know dates, they should molest adults instead of children. Maybe adults can do that or accountants who keep diaries. We're dealing with little kids here. I think we're not having a due process right taken away from the defendant by the prosecution, they're denying themselves the right to have specific dates because of their choice of victims, and we have no control over that.\n\n\"The Court: Well, all right.\"\n\n4. Out of the jury's presence, Fusilier presented the court with Windy's records from the child guidance clinic, which had been the subject of prior discovery hearings. The following then ensued:\n\n\"The Court: Who Did You Get These Records From, Sir?\n\n\"Mr. Fusilier: Right Here, Right Here at the Courthouse.\n\n\"The Court: Oh, All Right.\n\n\"Mr. Gindes: Right Here at the Courthouse Where?\n\n\"Mr. Fusilier: Right Here in the Courthouse.\n\n\". . .\n\n\"Mr. Gindes: How Did the Files of the Henrietta Clinic Get to the Court Today?\n\n\"Mr. Fusilier: I Assure Counsel They Were Here Legally.\n\n\"Mr. Gindes: I Want to Know How the File Got to This Court.\n\n\". . .\n\n\"Mr. Gindes: Your Honor, I Can't Understand and Maybe I'm Missing Something, Is That Counsel Made a Motion to Have the Records of the Henrietta Weill Memorial Child Guidance Clinic Produced Before the Court, and Judge Westra Heard the Motion and Denied the Motion.\n\n\"Mr. Fusilier: I Didn't, Your Honor. I Wasn't There.\n\n\"The Court: I Would Suggest That Somebody, I Would Imagine That Over the Noon Hour, Somebody Laid a Subpoena on the Henrietta Weill --\n\n\"Mr. Gindes: Whether They Laid a Subpoena on Them or Not, It's Totally Improper. Those Records Have Been Ruled Inadmissible by Judge Westra. I Think He Reviewed Them in Camera, and for Somebody -- Maybe He Got Them From His Client or Something Like That, but for the Original Records Which Are Confidential Records Between a Child and a Psychologist, to Get to the Court Like This, There Must Be Something Wrong. I Don't Know How They Did It.\n\n\". . .\n\n\"The Court: . . . We'll Take That Up at the End of the Day When We Find Out How the Records Arrived.\n\n\"Did You Subpoena Those, Mr. Eyherabide?\n\n\"Mr. Eyherabide: I Would Prefer to Tell the Court Privately. I Just Don't Think It's Germane.\n\n\"Mr. Gindes: I Don't Think He Has a Right to Tell the Court Privately. I Think It's a Matter He Should Bring Before the Court.\n\n\"The Court: Were the Records Subpoenaed?\n\n\"Mr. Eyherabide: Yes.\n\n\"Mr. Gindes: Could I Ask Mr. Eyherabide How He Subpoenaed Them? How About the Subpoena Records From Mr. Fusilier?\n\n\"Mr. Fusilier: This Is Irrelevant. That Is a Collateral Matter. Is He Hiding Exculpatory Information Here?\n\n\"The Court: The Records Will Remain Here, Gentlemen. Let's Continue the Cross-examination.\n\n\"Mr. Gindes: I Just Might Inform the Court That Mr. Eyherabide Personally Made a Motion in Front of Judge Westra to Have All the Records of the Henrietta Weill Memorial Clinic of the Children Victims Produced Before Judge Westra. Judge Westra Denied the Motion and Quashed the Subpoena.\n\n\"If Mr. Eyherabide Has Somehow Gone Behind Judge Westra's Back and Subpoenaed Records in Any Way or Has Gotten Those Records, Maybe I'm Misjudging Him, but That Is What It Looks Like to Me, We Have Got a Very Serious Problem to Deal With.\n\n\"When the Judge Says You Cannot Have Access to This Record and the Judge Suppressed the Records Under 288(c) of the Penal Code, and I'm Sure That Is in the Court's File, if Mr. Eyherabide Went in there Somehow and by Some Trick or Device, Got Those Records Off the Clinic After the Judge Ordered Them, Ordered That They Were Not Discoverable, I Think Mr. Eyherabide Is Going to Have a Little Bit of Trouble Continuing With This Trial.\n\n\"I Don't Know If He Did, Maybe I'm Misunderstanding Something.\n\n\". . .\n\n\"Mr. Fusilier: I Was Intending to Bring That Up Just Before My Defense Begins, Your Honor, but I Think Whatever This Is Has Nothing to Do With the Merits of Our Motion Now.\n\n\"It's Obvious to Me That My Client Is Entitled to Bring That Out, Your Honor. This Little Girl Is Accusing -- Not Only Has She Accused Those Three Men Falsely, but There Is an Allen [B.] and Another Person by the Name of Dill, Not Related to My Client --\n\n\"The Court: Well, the One Point I'm Not So Sure You Emphasized, but I Believe It Was Her Father or Step Father Who Put Her Up to or Forced Her to Make Those Representations. I Believe That Is What the Records So Indicate . . . .\n\n\". . .\n\n\"Mr. Fusilier: May I Have That [the records] Back?\n\n\"Mr. Gindes: No.\n\n\"The Court: No, This Is Confidential Material, and I Want to Find Out How It Got in Your Presence, Sir, Your Possession.\n\n\"Mr. Fusilier: You Just Heard How It Got in My Possession.\n\n\"Mr. Gindes: If Mr. Eyherabide Walked Over and Got Those Records in Any Way and Violated Judge Westra's Order --\n\n\". . .\n\n\"Mr. Eyherabide: Your Honor, Just in the Interest of Time, I Will Tell the Court How I Got These So I -- Because I Don't Want to Spend the Whole Rest of the Afternoon Doing This.\n\n\"The Court: Why Don't You Tell Us.\n\n\"Mr. Eyherabide: My Client Had Been Treated At the Henrietta Weill Child Guidance Clinic Herself.\n\n\"The Court: Yes.\n\n\"Mr. Eyherabide: In December, According to These Records Here, the Investigator Served a Release for Her Own Records on Henrietta Weill, and Apparently They Turned Those Records to the Investigator Who Brought Them to Me.\n\n\"The Court: You Mean Turned the Records Over of Her Daughter?\n\n\"Mr. Eyherabide: Yes, What Is in There.\n\n\"The Court: Just to Have No Mistake, These Are Case Records of Windy [B.], They Don't Have Anything to Do About Your Client.\n\n\"Mr. Eyherabide: I'm Just Telling the Court That Is What They Sent Over to Me.\n\n\". . .\n\n\"Mr. Gindes: This Has Obviously Followed the Motion Where Judge Westra Ruled That Mr. Eyherabide Could Not Examine Records of the Children at Child Guidance Clinic. Child Guidance Clinic Counsels Children, They Don't Counsel Adults Unless the Adults Are With the Children, Because of Their Counseling.\n\n\"If After Judge Westra Ruled Mr. Eyherabide Was Not Entitled to Discover That and These Came Into Mr. Eyherabide's Hands and He Did Not Return Them, We Have a Very Serious Situation, Because Judge Westra Ruled Under Section 288(c) That Mr. Eyherabide Was Not Entitled to examine Those Records.\n\n\"Getting a Release for Colleen [B.'s] Records Strikes Me as a Subversion of the Court's Ruling Since These Records Obviously Are Records of Windy [B.] and what Happened With Her. The minute He Saw That File With the name 'Windy [B.]', He Should Have Returned That to Court. He Is in Violation of Judge Westra's Order . . . .\n\n\". . .\n\n\"Mr. Eyherabide: The Only Thing I Wanted to Put on the Record, I Got Those Records, Looked At Them, Stuck Them\n\nBack in My File, Then This Morning There Was Some Question About a Prior Report or Something of Windy [B.], and I Remembered That I Had These Records. Okay, I Went During the lunch Hour and looked Through Them. Then I Paper Clipped Those Parts That Said Something About Made Up or Enticed or Falsely Accused Somebody of Molestation, and I Know Mr. Gindes Had Told Mr. Fusilier, 'Well, There Was No Substantiation for That,' and the Court Said, 'If You Have Anything on that,' You Know, 'Bring It Forward.' So That Is When I Gave the Information to Mr. Fusilier.\n\n\"I Showed Him That There Was Something in Some Records Somewhere About That So the Court Didn't Think He Was Just Making That Up.\n\n\"Mr. Gindes: The Way I See It, Perhaps I'm Wrong and We'll Check the Court's Records, Is That Mr. Eyherabide Made a Motion in Front of Judge Westra to Have the Records of All These Children Turned Over to Him. Judge Westra Heard This Motion for Hours Under Section 288(c) of the Penal Code, Judge Westra Ruled That Mr. Eyherabide Could Not Inspect Those Records.\n\n\"Mr. Eyherabide Has Now Admitted That on December the 4th, 1984 He Came Into Possession of Those Records in the Pretext of Getting Colleen['s] Records, Which I Think the Court Can See Very Clearly That When You Have a Child Counseled in Child Guidance, He Is Not Looking for his Client's Records, He Is Looking for the Child's Records. . . .\n\n\"Now, to Mr. Eyherabide's Mind, That Might Seem Like Legal Conduct, But It Certainly Strike[s] Me as Criminal Conduct When Counsel Is Doing Something Like That. It's at Least a Contempt, and it Looks Like a Couple of Felonies Are Involved in There, Too.\n\n\"The Court: The Situation Is, Now We Have the Records. the Next Question Is, What Do We Do With Them.\n\n\"Mr. Gindes: The Next Question Is, Whether Mr. Eyherabide Should Benefit By His Own Misconduct.\n\n\"The Court: Not Necessarily . . . .\n\n\"Mr. Fusilier: I Think the Court Should Rule These Are Admissible Regardless of This Collateral Situation He Is Bringing Up. We Have the Information, We Have Heard the Testimony. I Think That My Client Is Entitled to Have That Brought Before the Jury, Your Honor, I Think You Ought to Rule in Our Favor on That.\n\n\"Mr. Gindes: First of All, Your Honor, I Think We Should Have Mr. Gianquinto Come to Court, and I'm Sure He Is Going to Probably Pursue in Some Legal Remedies Against Mr. Eyherabide.\"\n\nWe need not decide whether the court erred in denying discovery of the guidance clinic records. Assuming Gindes properly objected to their discoverability and admissibility, it served no proper purpose for him to accuse Eyherabide of committing felonies in obtaining the records, especially in light of Eyherabide's explanation as to how he got them.\n\n5. \"Mr. Gindes: I want to report to the Court after I asked Mrs. Darling the question Lisa, excuse me, Linda appeared really happy after Lisa had testified, Mr. Van Meter raised his head and looked directly at the jury and said, 'That's because she told the truth in court' and said that to the jury. I don't think the Court heard that.\n\n\"The Court: I didn't.\n\n\"Mr. Gindes: Mr. Vendrasco heard it. I heard it. Mr. Van Meter said it. I think Mr. Fusilier probably heard it sitting next to Mr. Van Meter. Your Honor, that's misconduct of the grossest sort and combined with Mr. Eyherabide who rampages through the Court's objections when the Court sustains an objection, he simply asks the same question again and argues with the Court in front of the jury, asks the question again. I think it's prejudicial to the prosecution's case when lawyers act that way, and they just get away with that type of thing.\n\n\"Mr. Eyherabide, you know, he doesn't conduct himself like anybody that has gone to law school or had any experience. He just rambles in front of the jury and acts like he's some sort of -- I've never seen this type of conduct before, where the Court sustains an objection three times and he keeps asking the question again, again and again, and knowing he's not supposed to ask the question, keeps asking them. And I think that something has to be done. Either his name has to be stricken from the list of court appointed attorneys. I don't think unethical attorneys should be appointed.\n\n\"The Court: I don't think he's going to be doing much court appointments in the next few months.\n\n\"Mr. Gindes: He's got another one trailing. He's going to tie up another one for seven months and make a living out of these cases. I think he should be held to the conduct of a reasonably intelligent and ethical lawyer in this court or something should be done about him. He's just incredibly, the way he's been talking throughout this entire trial, and Mr. Van Meter with his comment, I don't think, I think the prosecution has a right not to have attorneys act in that type of blatant unethical conduct in front of the jury.\n\n\"The Court: Well, counsel maybe I'm getting numbed a little bit. It's been a long day, and I didn't see any remark or hear any remark that Mr. Van Meter made, and Mr. Eyherabide, as I have indicated, we all have our own styles, and I think the best thing to do is if it reaches a stage where I feel that something is legally objectionable or counsel is in contempt, then, I will have to act accordingly, but I haven't seen anything today that is unethical . . . .\"\n\n6. Defense counsel objected to jailhouse tapes being played to the jury, as they had not had a chance to review the tapes. Apparently, portions of the tapes were made available to defense counsel the day before the prosecution sought their admission into evidence. The argument started in the jury's presence; finally, the jury was sent out and discussion continued over when defense counsel knew about the tapes, whether the prosecutor had a duty to disclose them earlier, and other related issues. The following colloquy then occurred:\n\n\"Mr. Gindes: . . . as Far as Disclosure Is Concerned, I Haven't Listened to Probably 90 Percent of These Tapes. Most of These Conversations Are About These Defendants Babbling About All Types of Things.\n\n\"The Court: Cigarette Money --\n\n\"Mr. Gindes: Or the Type of Things That People Like That Talk About and They're Depressing to Listen To, They're Foolish to Hear and Frankly, It's Hard to Listen to Those Types of Conversations When They Take Place.\n\n\"Now, When Counsel Announced Carol Forsythe Was Going to Take the Stand I Realized We Did Have Some Jailhouse Visit Tapes Against Her. I Began Listening the Last\n\nCouple Days to Some of Those Tape Recordings That Were Made and Actually Some of Her Statements Struck Me as a Bit Unusual.\n\n\"However, I Didn't Know They Would Be Admissible Until I Figured Out What Kind of Testimony She Would Give . . . .\n\n\"Yesterday, as Soon as the Court Ordered Discovery of These Tapes, I Took Every Tape I Was Going to Use, I Instructed My Secretary to Make Copies So Any Attorney That Would Come in Could Get a Copy Last Night. But No One Came in Last Night.\n\n\". . .\n\n\"We Would Like the Record to Reflect That Mr. Eyherabide Was Standing Up and Shouting in Front of the Jury That Mr. Vendrasco Was a Liar and That He Was Lying and I Think It's Highly Unprofessional Conduct by Mr. Eyherabide. I Have Never Been in Court or Had a Trial With Mr. Eyherabide Before Except the Preliminary Hearing. That Was the First Experience Where I Had an Experience With Mr. Eyherabide Where Judge Lund Was Threatening to Find Him in Contempt With the Conduct He Was Committing.\n\n\"Mr. Fusilier: This Is Irrelevant.\n\n\"Mr. Gindes: I Think Mr. Eyherabide Feels, Your Honor, That If You Get Away With Something Temporarily That That Shows You're a Big Shot, You Can Keep Doing Worse and Worse Things. I Think That Is Where He Is Coming From.\n\n\"He Is Blown Up With This Egomania and He Is Foolish to Do It. He Is Now Engaging in All Types of Conduct He Should Not Engage In. I Have Had Reports From Various Witnesses and Agencies of Things That Mr. Eyherabide Is Doing That Is Just Shocking to Me. And, You Know, He Just Continues to Do It Again and Again and Calling Mr. Vendrasco a Liar Is the Latest Culmination of This Thing. I Really Think Counsel Is Always Offering to Cite the District Attorney for Misconduct --\n\n\"Mr. Fusilier: Let Me Interject. I Didn't Hear Him Call Mr. Vendrasco a Liar. He Just Said That Wasn't the Truth.\n\n\". . .\n\n\"Mr. Eyherabide: I Would Like to Request a Hearing at This Time, Evidentiary Hearing, on When the Prosecution Became Aware of Alleged Threats Made to Witnesses. I Would Make a Motion for Discovery of Any and All Reports or Information Concerning Threats Made to Witnesses. I Would Like to Know When the Prosecution First Obtained Knowledge of the Particular Tapes . . . .\n\n\"I Think They Have an Affirmative Duty Ahead of Time to Provide This Discovery or Relevant Material to the Defense of Witnesses That They Have Tape Recorded and Know Who May Be Witnesses at the Trial, Information That Would Assist the Defense in Preparing Their Defense in a Case. I Think This Is an Affirmative Duty on Their Part.\n\n\"Now, I Was Aware Because I Went to the District Attorney and Got Tape Recordings and Transcripts Around the First of the Year From Mr. Vendrasco and They Provided Me With Jail Tapes Concerning Conversations in June of 1984. No One Told Me There Is [ sic ] On Going Tapes in the Jail . . . .\n\n\"At No Time Until Yesterday Did Anybody Tell Me That There Were Any More Jail Conversations That Were Somehow Relevant to the Case or Anything Like That. And I Think They Have an Affirmative Duty to Disclose This. I Think There Is a Cold, Calculated Effort Here to Withhold Discovery and I Think a Clear Example of It Was They Waited Until Mr. Fusilier Called a Witness and Then Disclosed the Material Because They Intended to Use It on Cross-examination.\n\n\"The Court: Well, Why Would They -- what Relevancy Would It Have Been to Disclose That Until the Lady Took the Stand and Made Certain Statements? That Wasn't Admissible Any Other Way Than by Way of Impeachment.\n\n\". . .\n\n\"Mr. Eyherabide: It's a Statement by His Client on That Tape and He Was Suppose[d] to have That Before Trial or as Soon as They Know About It. I Know You're Entitled to Statements of Your Own Client Which Are on That Tape. Since\n\nThat Is Coming in Against My Client as Well I Think I'm Entitled to Discovery of It.\"\n\nIn the event of a retrial, defense counsel will be free to seek such discovery, including the guidance clinic records and other sealed matters, as may be appropriate. However, the foregoing passage is illustrative of the prosecutors' ability to turn attention from their own possible wrongdoing to defense counsels' conduct. As the California Supreme Court stated in People v. Purvis (1963) 60 Cal. 2d 323, 344 [33 Cal. Rptr. 104, 384 P.2d 424], disapproved on other grounds in People v. Morse (1964) 60 Cal. 2d 631, 639 [36 Cal. Rptr. 201, 388 P.2d 33, 12 A.L.R.3d 810], \"[T]he facts in reference to this incident illustrate a type of misconduct that permeates the record, that is, the ability of the prosecutor to make his own misconduct appear to be the fault of the defense counsel.\" It was not misconduct for Gindes to vigorously argue the discovery issue. It was likewise not misconduct for him to note for the record Eyherabide's conduct in front of the jury. However, no proper purpose was served by his references to other proceedings involving Eyherabide, or to Eyherabide's supposed egomania, etc. There was likewise no proper purpose served by the following, which came at the end of the argument:\n\n\"Mr. Gindes: . . . Mr. Eyherabide Had Other Things to Do This Morning. He Might Want to Tell You About the Other Things. This Morning He Was Making a Search for the [M.] Boys Even Though the Court Had Ordered the [M.] Boys to Be Subject to Recall. Mr. Eyherabide Spent Time Trying to Find the [M.] Boys. I Don't Know Why He Is Trying to Find the [M.] Boys. Those Kids Have Been Terrorized Throughout These Proceedings. Mr. Eyherabide Is Doing This While We're Here With Rick Pitts Talking About Where They Are. After Mr. Eyherabide Has Taken County Funds and Made an Effort to Find These Children, Then the Defendant[s] Will Know About It and Their Associates Will Know About It.\n\n\"I'm Trying to Tell the Court I Don't Know Why He Is Doing These Things. I Would Like Him to Tell the Court Why He Is Trying to Find the [M.] Children. His Conduct Is the Most Intolerable I Have Seen in 12 Years of Practice. I Think It's the Result of Foolishness. God Knows What Is Motivating His Conduct Any More.\n\n\"Mr. Eyherabide: I Would Be Happy to Tell the Court in Camera.\n\n\"The Court: Mr. Eyherabide, I Have Heard Enough.\"\n\n7. A hearing was held outside the jury's presence regarding the validity of the search warrant executed on Laura Dobbs's residence. During argument on the motion, the following occurred:\n\n\"Mr. Van Meter: The sentence [in the affidavit] is written, 'He told me that he had requested to talk with a district attorney investigator.' Now, your Honor, that sentence in and of itself was a big clue that something was phoney in this whole thing because in my experience, both as a district attorney and as a defense attorney --\n\n\"Mr. Gindes: Object to Mr. Van Meter bringing up his experience as a district attorney. He was fired from the district attorney's office for various reasons. I don't think he's an experienced counsel.\"\n\nI. Trial Court Error\n\nThe prejudicial effect of the prosecutors' misconduct was compounded by the trial court's actions. As is evident from many of the foregoing examples, the court failed or refused to expressly rule on most defense objections to misconduct, or to curb the prosecutors in any way.\n\n\"[I]t is the duty of the judge to 'control all proceedings during the trial, and to limit . . . the argument of counsel to relevant and material matters' [citation] . . . .\" (People v. Bell, supra, 49 Cal. 3d at p. 542.) This does not mean the court is \"required to identify as misconduct, or correct sua sponte, improper prosecutorial argument.\" (Ibid. ; People v. Poggi, supra, 45 Cal. 3d at pp. 335-336.) In the instant case, however, we are not talking about a sua sponte duty to intervene: defense counsel were begging the court to take control of the situation. By failing or refusing to do so, the court \"allowed the trial to be conducted at an emotional pitch which is destructive to a fair trial.\" (People v. Bain, supra, 5 Cal. 3d at p. 849.)\n\nIn addition to frequently failing to act, at times the court entered into a rhetorical colloquy with Gindes, which had the effect of belittling defense counsel or their cases. It is reasonably probable that these exchanges, taken together with other remarks by the court which derided defense counsel or ridiculed defense witnesses, implied to the jury that the prosecution's case was more credible than those of the defense, and that the prosecutors and court were on the same side instead of the court being neutral. Added to this was the fact that occasionally the court testified instead of letting a\n\nwitness answer. Moreover, many of the court's evidentiary rulings appear to have been one sided.\n\n1. \"Q [by Gindes] Did Carol [Darling] ask you [Lisa] if anything bad happened at Rick and Tutti's house?\n\n\"Mr. Eyherabide: Objection, hearsay.\n\n\"Mr. Rubin: Join.\n\n\"Mr. Fusilier: Join for Wayne Dill, Jr.\n\n\"The Court: Overruled.\n\n\"Mr. Gindes: When they make an objection and you overrule it, and they make the identical objection, doesn't that seem to disrupt the proceedings?\n\n\"Mr. Eyherabide: Object to that comment, your Honor.\n\n\"Mr. Fusilier: Counsel knows very well we have to make objections each and every time.\n\n\"Mr. Gindes: The same objection to every identical question?\n\n\"The Court: Go ahead.\"\n\n2. Outside of the jury's presence, Sims joined a previous objection by Van Meter to both prosecutors handling things at the same time. The court responded: \"The record will indicate so far as I know only one of the two prosecutors at a single instance have asked questions of a witness. Mr. Vendrasco has on occasion, I mean, Mr. Gindes on occasion has made certain responses to certain objections, and in fact, may have objected to some of the objections while Mr. Vendrasco was up here conducting the direct examination. I don't find it offensive. I think that probably ninety-nine percent of the objections are coming from defense counsel. So, I make that notation for the record.\"\n\nAs will be discussed, post, we have concluded that it was not improper for the court to permit the People to be represented by two prosecutors, and that, assuming some error occurred, no prejudice has been shown. However, the foregoing passage is indicative of the court's attitude that defense counsel were taking up the bulk of trial time. The court's comments are especially interesting since they occurred during direct examination of the\n\nPeople's first witness, so it would have been unusual, to say the least, to have any objections from the prosecutors at that point.\n\n3. \"Q [by Fusilier] [Since] Last Thursday, Have You Talked to anyone About This Case, About Your Testimony?\n\n\"A [by Christine] No.\n\n\"Q What You Said in Court?\n\n\"A No.\n\n\"Q What Were You Doing in the Back Room This Morning, Back of the Courthouse?\n\n\"A Going to the Bathroom.\n\n\"The Court: She Was Using the Restroom in My Chambers, Counsel, While I Was Conducting a Settlement Conference.\n\n\"Mr. Fusilier: I Haven't Sworn You in Yet, Your Honor, but I Can Understand.\"\n\n4. Tommy testified to getting shots with a needle gun. Eyherabide had him draw a picture of it.\n\n\"Q [by Eyherabide] . . . What Is That Thing?\n\n\"A [by Tommy] The Needle.\n\n\"Q That Is the Needle. Can I Write 'Needle' There?\n\n\"A Go for It.\n\n\"Q What Did You Say, 'Go for It'?\n\n\"A Go for It.\n\n\"Q Do You Want to Ask the Questions?\n\n\"Now --\n\n\"The Court: It Would Be Shorter if He Did.\"\n\n5. \"Q [by Van Meter] Did You See Deputy Bob Fields Using a Tape Recorder on Either One of the Interviews, Either at Your House or Down at the Sheriff's Office?\n\n\"A [by Tommy] Down at the Sheriff's Office.\n\n\"Q In the Interview Down at the Sheriff's Office Didn't You Ask Bob Fields a Couple of Times, 'What Did Johnny Tell You' and 'What Did Johnny Say'?\n\n\"Mr. Gindes: Objection, Irrelevant, Hearsay.\n\n\"The Court: Sustained, Unless You Have an Offer of Proof, Mr. Van Meter.\n\n\"Mr. Van Meter: Well, the Offer of Proof Would Be the Tape Recordings Made of the Conversation, Your Honor.\n\n\"The Court: Didn't He Just Indicate There Was One?\n\n\"Mr. Van Meter: Excuse Me?\n\n\"The Court: Didn't He Just Indicate That Officer Fields Tape Recorded One?\n\n\"Mr. Van Meter: Yes.\n\n\"The Court: Do You Have It?\n\n\"Mr. Gindes: The Tape Has Been Made Available to All Counsel.\n\n\"Mr. Van Meter: It's Available, Yes, Your Honor.\n\n\"The Court: Well, Then, Listen to It.\"\n\n6. At the end of Amanda's direct testimony, Vendrasco led her off the witness stand and over to the defendants to see whom she could identify. Amanda stated she did not know Gina, then she identified Grace and asked for her mother. The following then occurred:\n\n\"Q [by Vendrasco] Wait. What about that guy right there?\n\n\"A [by Amanda] What guy?\n\n\"Q The guy sitting next to grandma [Grace].\n\n\"A No.\n\n\"Q Do you recognize him?\n\n\"A No. He was the nice guy that -- oh, oh, oh, where's Rick?\n\n\"Mr. Fusilier: Let the record indicate she's talking about Wayne Dill.\n\n\"The Court: Ma'am, up here. What's wrong?\n\n\"The Witness: Rick.\n\n\"The Court: Did you see him?\n\n\"The Witness: Yes.\n\n\"The Court: That's all right. Let's take a break. Would you take her back?\n\n\"The Witness: By the cop.\n\n\"The Court: The cop will take you back.\n\n\"The Witness: I don't want to go back by him. I want to stay by the judge. Oh, I see him.\n\n\"The Court: Mr. Fusilier, I don't think it's funny.\n\n\"Mr. Fusilier: I don't either.\n\n\"The Court: Get that smile off your face.\n\n\"Mr. Gindes: You're laughing.\n\n\"Mr. Lorenz: Why don't we take a quick recess.\n\n\"The Court: Let me walk her back.\"\n\nThe following day, outside the jury's presence, Fusilier made a motion for mistrial.\n\n\"The Court: [W]hen I made that comment to you, sir, it was after the little girl had broke down and was crying and was hysterical and shaking. She was over in the area of the front of the table where Mr. Gindes is seated right now, and she was crying there and screaming. She ran all the way back around in front of the jury, across the witness stand, and literally into my lap crying, and I looked down at her crying, and I was starting to get tears in my eyes, sir, and I looked up and I saw you look at me smiling and it wasn't during a conversation you were having with your client. You may have had that conversation, sir, but I saw everyone else in the courtroom literally having water in their eyes, and I could not understand for the love of money why that smile was on your face, and I apologize to you if it was embarrassing, but it just did not seem proper under those circumstances.\n\n\"Mr. Fusilier: I will tell this Court, I did not see -- I didn't even know what happened. The first time I saw that little girl was when she was right next to the judge as I was turning around, I asked my client afterwards what happened. I'm not the slowest fellow in the world. I did not realize what was happening, and I don't think that remark in front of the jury is fair to my client.\n\n\"Furthermore, Mr. Gindes, 'yes, just stop laughing,' and I said, 'who's laughing.' It doesn't reflect it in the record . . . .\n\n\". . .\n\n\"Mr. Lorenz: Yesterday when we didn't [ sic ] get into the very heavy emotional scene, and I noticed a couple of the jurors crying also. When that happened I got up and said let's have a short recess, and the Court took a break then. I would suggest perhaps we consider some type of instruction or admonition to the jury. I accept Mr. Fusilier's explanation. Maybe he was paying attention to somebody else, and I know too he does have a problem hearing some of the witnesses in the case.\n\n\". . .\n\n\"Mr. Gindes: . . . As far as the episode that Mr. Fusilier claims about not hearing what was going on or something like that, I just really can't direct a lot of credence to it. It was a moment of great stress. That little girl was crying at the top of her lungs. She was very close to me, very close to Mr. Fusilier. I can't imagine Mr. Fusilier not hearing that and then she ran right in Mr. Fusilier's point of direct vision when he was not talking to the client, up to the judge. Mr. Fusilier had to see that. And then she was screaming hysterically, and that's when the Court said Mr. Fusilier, something\n\nabout a smile, and Mr. Fusilier responded to the Court remarking like laughing at the Court's remark. That's what got me . . . .\n\n\"All I can say is, first of all, and I think there's basically three points that we have here is number one, I don't think the defendants can claim advantages or benefits from their own misconduct. If they're going to terrorize young children, then when those children get on the witness stand they're going to act terrorized.\n\n\"Number two, I think we should be specifically careful under 288(c) of the Penal Code to not let this happen again, and I think the things that are going to cause this happening again are the witness being directed to look at particular defendants, being forced by attorneys the way they station themselves, they station their bodies to see particular defendants while she's testifying. I think that's going to traumatize her . . . .\n\n\"The Court: What about a request from the defense counsel to ask the witness to identify a particular defendant?\n\n\"Mr. Gindes: Well, I suppose they can make those. And I suggest if any request such as that is being made, it be made at the end of her cross-examination, but I think that's going to -- if they have to do that because I think that's going to terrorize her again and create a situation of some anxiety on her . . . .\n\n\"As far as a request of the admonition of the jury, I think that would be confusing to them . . . .\n\n\"Another thing about that is that I frankly feel that it would confuse them because what she did, did have some evidentiary value, as coarse as that may sound, it did demonstrate her tremendous fear for one of these defendants, and it did demonstrate a tremendous power he obviously had over her . . . .\n\n\". . .\n\n\"Mr. Van Meter: I'd like the Court to recall that Mr. Vendrasco brought this witness, Amanda [B.], down to the counsel table and was asking the witness to pick out the various defendants.\n\n\". . .\n\n\"The Court: If something disturbing comes to my attention, I will mention it, and as I explained to Mr. Fusilier, it was nothing personal. I saw\n\nthis child in my arms crying and trembling, and I'm getting water in my eyes, and I'm looking at the jury and they look about the same way, and it's just that, after I looked at her face, I then saw your face, sir, and I probably couldn't reconcil[e] the two.\n\n\"Mr. Fusilier: I was just turning around, your Honor, at this time turning to my client. I couldn't figure out why this little girl didn't know her uncle. I was handling my affairs. Then, he had to explain to me what was happening.\n\n\"The Court: You understand I have to handle my affairs as well, and I'm charged with looking out for the welfare of the child.\"\n\nThe court denied Fusilier's motion for mistrial. It did, however, admonish the jurors as follows:\n\n\"I Have Not Intended by Anything I Have Said or Done or by Any Questions That I May Have Asked or by Any Ruling That I May Have Made to Intimate or Suggest What You Should Find to Be the Facts on Any Questions Submitted to You or That I Believe or Disbelieve Any Witness. If Anything I Have Done or Said Has Seemed to So Indicate, You Will Disregard It and Form Your Own Opinion.\"\n\nIn certain situations, a trial court's accusing defense counsel of laughing in a situation it does not find funny may constitute judicial misconduct. (See People v. Jackson (1955) 44 Cal. 2d 511, 517-520 [282 P.2d 898].) However, judges are human, and this one instance, standing alone, was probably not prejudicial especially since an admonition was given.\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e Unfortunately, the issue came up again during Gindes's cross-examination of Tutti, in a way that undermined any benefits derived from the admonition:\n\n\"Mr. Fusilier: Excuse Me, Your Honor, for the Record, I Don't Recall the Little Girl Being Hysterical.\n\n\"The Court: That Is When You Were Smiling, Counsel and I Had to Caution You About That.\"\n\n7. \"The Court: Any Objections to Rusty's Photograph Coming Into Evidence?\n\n\"Mr. Gindes: It Has No Real Probative Value.\n\n\"The Court: I Don't Think It Does Either, but We'll Receive It.\"\n\n8. \"Q [by Eyherabide] . . . Then have you talked with any other of the defense attorneys that you see here in court?\n\n\"Mr. Gindes: Objection, irrelevant. How is that relevant to Mr. Eyherabide's case, your Honor?\n\n\"The Court: I really don't know . . . .\"\n\n9. The following occurred after Van Meter concluded his cross-examination of Brian, before Rubin began his:\n\n\"The Witness [Brian] Would you read this now?\n\n\"The Court: What is it?\n\n\"For the record, I have just been handed a document from Mr. Brian [M.] He's asked me to read it. To save time, it's rules for Brian [M.] Rule 1, tell the truth.\n\n\"Mr. Van Meter: I'm going to object.\n\n\"Mr. Rubin: Objection.\n\n\"The Court: Who gave this to you?\n\n\"The Witness: Me and Andy did it on his typewriter.\n\n\"The Court: Anyone want to look at it?\n\n\"Mr. Fusilier: I'll join in the objection to read this for Mr. Wayne Dill, Jr.\n\n\"The Court: All right.\n\n\"The Witness: Would you read it?\n\n\"The Court: There's an objection on reading.\n\n\"The Witness: What's that?\n\n\"The Court: It means that the attorneys have objected to me reading this, but these are rules or instructions you're to follow?\n\n\"The Witness: Yeah.\n\n\"The Court: All right. Ladies and gentlemen, there has been an objection to me reading this particular document that basically it instructs the witness to tell the truth, and if there is any doubt as to what a question means, to say he doesn't understand it or ask the question to be rephrased and reminding him that he is good and that people do love him.\n\n\"Is that okay?\n\n\"The Witness: Yeah.\"\n\n10. \"Q [by Gindes] Did You Tell Carol Darling It Was Too Embarrassing to Talk About Your Dad?\n\n\"Mr. Eyherabide: Objection, Hearsay, Asked and Answered Yesterday About Three Times.\n\n\"Mr. Rubin: Join.\n\n\"The Court: I Think It Was Asked and Answered Yesterday, but We're Starting Over Today. Overruled.\"\n\n11. \"Q [by Gindes] Now, Yesterday We Talked About What You Think Are Nasty Things, Right?\n\n\"A [by Lisa] Right.\n\n\"Q Remember We Talked About Me Putting the Pencil on the Wood and You Said That Is Not Nasty; Right?\n\n\"A Right.\n\n\"Q You Remember You Said Having a Kid Touch Another Kid's Privates, That Was Nasty.\n\n\"Mr. Eyherabide: I'm Going to Object, Your Honor, to Rehashing What the Witness Said on a Prior Time. It's in the Record What She Said Yesterday. It's Just Delaying, Consuming Time Unnecessarily.\n\n\"Mr. Gindes: It's Foundational.\n\n\"The Court: Overruled.\"\n\nThe trial court was within its discretion to permit Gindes a little latitude in this line of questioning. Lisa was barely eight years old at the time she testified, and there was nothing unreasonable about Gindes attempting to refocus her attention after an evening recess. The problem is, the same type of questioning by defense counsel most often resulted in sustained objections.\n\nSimilarly, it is not difficult to determine how far defense counsel would have gotten questioning one of the children in the following manner:\n\n\"Q [by Gindes] Do you remember me asking you if Carol told you to say Carol [P.] told you to say nothing happened?\n\n\"A [by Lisa] Yes.\n\n\"Mr. Eyherabide: Object, leading the witness.\n\n\"The Court: Overruled.\n\n\"By Mr. Gindes:\n\n\"Q And didn't you tell me that Carol said to say nothing happened?\n\n\"Mr. Eyherabide: Objection, leading the witness.\n\n\"Mr. Rubin: Argumentative.\n\n\"Mr. Fusilier: Object, the only term I can think of is badgering, with the Evidence Code, this witness.\n\n\"The Court: Objection overruled.\n\n\"By Mr. Gindes:\n\n\"Q Didn't you tell me that Carol told you to say nothing happened? If it's hard to answer the question, tell the judge.\n\n\"A No.\n\n\"Q Okay. Did I ask you if your mother, Linda, told you to say nothing happened?\n\n\"Mr. Eyherabide: Objection, leading the witness.\n\n\"Mr. Rubin: Join.\n\n\"Mr. Fusilier: This is traumatizing the witness, object.\n\n\"Mr. Eyherabide: Join.\n\n\"Mr. Fusilier: I object to how close he's standing.\n\n\" Mr. Gindes: I think if anybody is traumatizing, I think it's the conduct of counsel. I think I'm being very gentle.\n\n\"The Court: Objection overruled.\n\n\". . .\n\n\"Q Okay. Honey, didn't you put your head down and tell me that Linda said to tell the people here that nothing happened?\n\n\"A Yes.\n\n\"Q Did your mother tell you that? Did Linda tell you to say nothing happened?\n\n\"A No.\n\n\"Q Did you tell me that Linda said that?\n\n\"Mr. Fusilier: For the record, have to object, your Honor, continual argument, argumentative.\n\n\"The Court: Overruled.\n\n\". . .\n\n\"Q Did you tell me that Linda told you to say nothing happened? Do you remember the question, honey?\n\n\"A No.\n\n\"Mr. Fusilier: I can't hear counsel at this time.\n\n\". . .\n\n\"Mr. Eyherabide: Your Honor, I heard a no in response to that question.\n\n\"Mr. Fusilier: I heard a no also.\n\n\"Mr. Gindes: These adults all bicker with each other. So, let's ignore them.\n\n\"Q Did Linda, did you tell me that Linda said to come into court and say that nothing happened when you were with me and Carol? Is it too hard to answer that question?\n\n\"A Yes.\n\n\"Mr. Rubin: Object. It's hearsay and it's irrelevant.\n\n\"The Court: Lisa, let me ask you a question, did anyone tell you what to say in court here today?\n\n\"The Witness: No.\n\n\"The Court: No one at all?\n\n\"The Witness: No one.\n\n\". . .\n\n\"Q Did Lisa -- did your sister, Carol, say to you, 'Tell them nothing happened at the house?'\n\n\"Mr. Rubin: Objection, asked and answered.\n\n\"Mr. Van Meter: Asked and answered.\n\n\"Mr. Eyherabide: Join.\n\n\"The Court: Sustained.\n\n\". . .\n\n\"Q Did you tell Carol [Darling] that yes, the first time I talked to you I told you nasty things happened? Did you say that to Carol?\n\n\"A No.\n\n\"Q Honey, are you sure?\n\n\"Mr. Rubin: Objection.\n\n\"Mr. Fusilier: I didn't hear that.\n\n\"Mr. Rubin: The question has been asked and answered now.\n\n\"By Mr. Gindes:\n\n\"Q Are you sure, honey? Didn't you say that to Carol?\n\n\"A I think.\n\n\"Mr. Fusilier: Object to that persuasion.\n\n\"By Mr. Gindes:\n\n\"Q Are you afraid of me, Lisa?\n\n\"The Court: Let's take a ten minute break.\n\n\"Mr. Gindes: Let me ask one more question.\n\n\"Q Honestly, didn't you tell Carol that you told her nasty things had happened?\n\n\"Mr. Rubin: Objection.\n\n\"Mr. Fusilier: That's arguing with the witness.\n\n\"Mr. Rubin: Join. It's been asked and answered.\n\n\"Mr. Eyherabide: Join.\n\n\"Mr. Gardiner: Join.\n\n\"Mr. Van Meter: Join.\n\n\"The Court: Objection overruled.\n\n\"By Mr. Gindes:\n\n\"Q Honestly, didn't you tell Carol that nasty things had happened? Didn't you tell her that?\n\n\"A I can't -- I don't remember.\n\n\"Q Honestly, you don't remember if you told her that?\n\n\"A No.\n\n\"Q Are you sure?\n\n\"A Yes.\n\n\"Mr. Gindes: We're ready for a break, your Honor.\"\n\n12. Carol Forsythe testified on Dill's behalf. According to her testimony, a typical weekend during 1982 and 1983 involved watching television, cashing a check, washing clothes, getting groceries, and doing things with the kids. No matter what day it was, Ms. Forsythe and Dill would wash clothes all day long the day after she received her check. During Gindes's recross-examination of Ms. Forsythe, the jurors were sent out so that evidentiary matters could be discussed. When they were brought back in, the court stated:\n\n\"Ladies and Gentlemen, We Did Receive Just a Couple Minutes Ago and That Is One of the Reasons I Held Up Calling You Right Back, Freshly Printed Drafts or Warrants as Their [ sic ] Called, From the County [for jury service fees]. Mr. Jackson, Our Friend Over There, Has Them All Here and They're All Alphabetized, and Margaret Will Pass Them Out. She Will Pass These Out Just at the Time of Our Lunch, but We'll Break Probably in About Ten Minutes and You Have Have [ sic ] a Good Lunch, Wash Clothes and Do Other Things You Do on Payday.\"\n\n13. Ms. Forsythe testified about certain conversations she had with Dill while he was in jail. The following occurred during cross-examination:\n\n\"[Q] [by Gindes] When You Conversed With Mr. Wayne Dill, Jr. About Weekends That You Can Remember Being Together, How Many Weekends Did You Come Up With in 1982 and 1983?\n\n\". . .\n\n\"The Witness: About 20 or So That I Can Remember.\n\n\"By Mr. Gindes:\n\n\"Q 20 or 10. When Did You Remember These 20 Times?\n\n\"A After I Had Gotten a Calendar of the Weekends of 1982 and '83 and I Sat and Thought Real Hard for 26 Days.\n\n\"The Court: You Thought Hard for 26 Days?\n\n\"By Mr. Gindes:\n\n\"Q Just Straight Through Like From Eight to Five for 26 Days?\n\n\"Mr. Van Meter: I Will Object, Your Honor. Counsel Is Asking These Facetious Questions in That Tone of Voice. I Think It's Very Objectionable, Your Honor.\n\n\"The Court: Overruled.\n\n\"By Mr. Gindes:\n\n\"Q From Eight to Five for 26 Days?\n\n\"A No, I Think About Wayne All the Time.\"\n\nThe next witness, also called by Dill, was Laura Dobbs. A search warrant was previously executed at her residence, resulting in the seizure of some letters from Forsythe.\n\n\"Q [by Vendrasco] Did you in fact tell Tam Hodgson you had a premonition he was coming?\n\n\"A No, my mother did.\n\n\"Q Oh, your mother did, okay.\n\n\"Mr. Rubin: Move to strike that as being hearsay and irrelevant.\n\n\"Mr. Vendrasco: It tends to show --\n\n\"The Court: Well, I think you're trying to lay a foundation, and I'm not too sure where these premonitions are coming in. Go ahead.\n\n\"Mr. Vendrasco: I don't know. I had a premonition there was a premonition.\n\n\"The Court: We've had 26-day thought sessions. I don't know what the premonitions are going for. Go ahead.\"\n\nThere is nothing wrong with a little levity during trial. Here, however, the court's comments went beyond mere humor and belittled the witnesses' testimony. A court's remarks have great potential influence in the eyes of the jury. The cumulative prejudicial effect of remarks interspersed throughout trial, indicating that the prosecutor and his witnesses are more trustworthy than defendants, cannot be negated by admonitions. (People v. Hefner (1981) 127 Cal. App. 3d 88, 95 [179 Cal. Rptr. 336].)\n\n14. During his cross-examination of Dill, Gindes asked about Dill's various jailhouse conversations with Ms. Forsythe. During one of those conversations, the participants said uncomplimentary things about Linda Dill and called her names.\n\n\"Q [by Gindes] Let's Go Into Another Area. You Indicated That You Did Not Remember Having a Conversation With Carol Forsythe About Linda Dill Being a Witness and You Said if You Heard That Conversation That Might Refresh Your Recollection. I Found That Conversation for You.\n\n\". . .\n\n\"The Court: Turn It Off for a Second. Objection Overruled. Objection Is Overruled. Let's Play It Back.\n\n\"Mr. Vendrasco: I Will Start With Porky Pig.\n\n\"The Court: Even Before the Queen of Sheba, Too.\"\n\n15. \"Mr. Rubin: Your Honor, at this point I don't think this has been moved in. I'm going to move this letter be introduced. It's Marcella Pitts F.\n\n\"The Court: Any objection?\n\n\"Mr. Gindes: I just don't see the relevance of the letter.\n\n\"The Court: I don't either.\n\n\"Mr. Rubin: It's a document, there's been evidence. It's been testified to, and I think that it's proper to have items like that introduced into evidence and accepted by the Court.\n\n\"Mr. Vendrasco: I guess if the water bed frame and T.V. gets in, I guess the letter should get in too.\n\n\"The Court: They're not in yet.\n\n\". . .\n\n\"The Court: We received that toy which probably isn't relevant. To save some time, we will admit this. It's in.\n\n\". . .\n\n\"Mr. Rubin: Your Honor, I'm going to object to the Court making these sort of derogatory comments about evidence being introduced.\n\n\"Mr. Gindes: Could we stop attacking?\n\n\"The Court: Let's go forward, sir.\"\n\n16. In the jury's presence, the court asked Eyherabide how long his next witness would be, because the evening recess was going to be taken at a certain time.\n\n\"Mr. Eyherabide: I expect the direct will be about five minutes.\n\n\"The Court: Where's the witness?\n\n\"Mr. Vendrasco: Your Honor, the witness is Mr. [H.] He was a witness for the People. Mr. Eyherabide requested that I contact him and have him here. He came directly from the job. I would prefer we don't have any interruptions with his job, if possible. If not, that's fine.\n\n\"The Court: I wish you would have told me this before. We would have put him on right away this afternoon.\n\n\"Mr. Gindes: It's a great inconvenience to him. He managed to accommodate his schedule, and so, we'd like to get him on.\n\n\"The Court: I understand. You should bring this to our attention, Mr. Eyherabide.\n\n\"Mr. Eyherabide: I had those teachers out there all day.\n\n\"The Court: It's not my problem you can't schedule them better.\n\n\"Mr. Rubin: I'm going to object to the Court making gratuitous comments about counsel's scheduling. It's highly improper.\n\n\"Mr. Sims: Join.\n\n\"The Court: Well, I think there could be a little bit better wan [ sic ] to schedule witnesses.\n\n\"Mr. Rubin: The court didn't make those comments when the prosecution had a problem.\n\n\"Mr. Gindes: Because we didn't do that.\n\n\"Mr. Rubin: Well, you did break, for example, for Dr. Woodling.\n\n\"Mr. Eyherabide: Your Honor, I'd like to join that objection. The Court, the other day told me to have my witnesses ready to go. The Court knows I have no way of predicting cross-examination.\n\n\"The Court: I'm not talking about this. If we have someone that has a problem, bring it to my attention early.\n\n\"Mr. Eyherabide: They told me he'd be available at 4:30 this afternoon today.\n\n\"The Court: Let's go forward.\"\n\nNot once was the prosecution chastised for causing delay by not having witnesses ready. Yet Gindes's assertion that they did not do that is patently false. For example, on March 25, 1985, court resumed, following a break, at 10:47 a.m. A few questions were asked of Amanda. When told to call his next witness, Gindes stated that he needed until 1:30. The court said all right. Later, following Dr. Woodling's testimony, the jury was sent home just before 11 a.m., because Gindes expected cross-examination to take all day and so had no other witness available prior to 9:30 the next morning. The court did not indicate any problem with this. When cross-examination of Bobby R. was finished, the court asked if the next witness was available.\n\nVendrasco said no, that she would be in the next morning. This was at approximately 3:55 p.m. After Gardiner finished his cross-examination of Idolina Lopez on Wednesday, May 1, at approximately 11:40 a.m., the court noted that the next prosecution witness would be available Monday morning. The jury was excused until that time. After Johnny's testimony, Gindes represented that the People might have one more witness, but that person could not be called at that time. Defense counsel did not oppose Gindes's request for a continuance from May 14 to May 16.\n\nThis is not to say that defense counsel always had their witnesses properly scheduled so as to minimize any delay. However, it was unfair of the court to criticize Eyherabide in front of the jury, especially when the problem does not appear to have been his fault. Apparently, the prosecutors told him that Bob H. would be available at a certain time, and Eyherabide called him to the stand as close to that time as possible. Regardless of whether the court's comments could ultimately be defended, it was not justified in reprimanding defense counsel before the jury. (People v. Fatone, supra, 165 Cal. App. 3d 1164, 1175.) \"When the court embarks on a personal attack on an attorney, it is not the lawyer who pays the price, but the client. And the error, where prejudicial, is reversible.\" (Ibid.)\n\n17. \"By Mr. Vendrasco:\n\n\"Q . . . What about your other tattoo, the hearts, was that also a joke?\n\n\"A [by Grace] No.\n\n\"Q Was that on a dare to[o], the other tattoo?\n\n\"A No, that was stupidness.\n\n\"Q Stupidness?\n\n\"A Yes.\n\n\"Q Why was it stupid to put the other tattoo on?\n\n\"A It just was.\n\n\"Mr. Fusilier: This is argumentative.\n\n\"The Court: It's stupid to have either one of them put on, but --\"\n\nRegardless of the standard of review employed (compare Rose v. Clark (1986) 478 U.S. 570, 577 [92 L.Ed.2d 460, 470, 106 S.Ct. 3101] [adjudication by biased judge is federal constitutional error reversible per se] and People v. Hefner, supra, 127 Cal. App. 3d at p. 95 [judicial statements merely tending to show bias do not require reversal where conviction based on overwhelming evidence of guilt]), where disparaging comments and the like permeate the record, especially when the prosecutor rarely received such treatment, they \"def[y] a finding of no prejudice.\" (People v. Fatone, supra, 165 Cal. App. 3d at pp. 1175-1176.) As stated in Fatone, \"[n]ot every example amounts to misconduct independently, nor does each necessarily involve an erroneous legal ruling. But together they tend to illustrate the demeaning, patronizing attitude displayed by the judge toward [defendant's] attorney before the jury: . . .\" (Id. at p. 1176.)\n\nJ. Conclusion\n\nThe foregoing represents a mere fraction of the misconduct that occurred in the instant case. The record is replete with examples of an overzealous prosecutor who, in his blind quest to convict, forgot or ignored his constitutional and ethical duties as representative of the People of the State of California. Gindes's gross misconduct and the lesser misconduct of Vendrasco were compounded by the actions of the trial judge.\n\nWe need not decide whether any of the misconduct is to be reviewed pursuant to the Chapman standard, since prejudice exists under the Watson (People v. Watson (1956) 46 Cal. 2d 818 [299 P.2d 243]) standard. This is not to say that defense counsel were without blame for the emotional level of the proceedings. However, nothing they did warranted the vituperative fervor of the response. A defendant has the right to be fairly tried regardless of the shortcomings of his or her counsel.\n\nMany of the instances cited above are mild and, if considered singly, would be inconsequential. However, this court must consider their cumulative effect. It is hardly a satisfactory answer to say, as respondent essentially does, that the misconduct was so pervasive on both sides, the jury must have ignored it. As the Court of Appeal appropriately stated some 55 years ago: \"The transcript of the proceedings shows continuous criticism of the public defender, representing the defendant, by the district attorney . . . .\n\n\"These remarks, and comments made by the district attorney during trial concerning the defendant's witnesses, taken separately, one by one, may not amount to more than what is, unfortunately a too common practice in the trial of cases. Making all due allowances for the fact that the district attorney\n\nwas engaged in the prosecution of a defendant whom he believed was guilty under the evidence which he was presenting, it must be remembered that a conviction can only be justified by legal means. A prosecutor has no right to inject into the proceedings, by innuendo, such prejudice against the defendant or his counsel as prevents a fair and impartial trial.\n\n\"There was no justification for this conduct on the part of the district attorney. As was pointed out in the case of People v. Wells, 100 Cal. 459, 465 . . .: 'It is too much the habit of prosecuting officers to assume beforehand that a defendant is guilty, and then expect to have the established rules of evidence twisted, and all the features of a fair trial distorted, in order to secure a conviction. If a defendant cannot be fairly convicted, he should not be convicted at all; and to hold otherwise would be to provide ways and means for the conviction of the innocent.'\" (People v. Podwys, supra, 6 Cal. App. 2d at pp. 72-73.)\n\nNor is it an answer to say, as respondent suggests, that this case was \"sufficiently strong as to render any misconduct harmless . . . .\" Assuming the evidence was sufficient to convict, it did not point unerringly to guilt. Under such circumstances, the type of misconduct involved here could reasonably have tipped the scales. Accordingly, reversal is required. (People v. Kirkes, supra, 39 Cal. 2d at p. 727.) \"That the jury was instructed generally to base its verdict exclusively upon the evidence does not prevent the misconduct from being prejudicial and requiring a reversal.\" (Ibid.) \"It is idle for us to speculate whether the prosecutor's conduct resulted from ignorance of the law and his official duties, or was a 'dishonest act or an attempt to persuade the court or jury, by use of deceptive or reprehensible methods.' Under either circumstance the unfair trial and the resultant conviction and punishment of the accused is an outrage, and the insult to our system of criminal justice, intolerable. [para.] 'Fewer judgments would have to be reversed if the trial courts were more firm in controlling the comparatively few prosecutors who need restraint.' [Citation.]\" (People v. Rodgers (1979) 90 Cal. App. 3d 368, 372-373 [153 Cal. Rptr. 382].)\n\nSimilarly, we need not decide whether the prosecutor or trial court bears the greater share of the blame. \"Things happened in appellant[s'] trial which simply ought not to happen in a fair proceeding. Whether characterized as prosecutorial misconduct, defense counsel misconduct, judicial error, or a combination of all three, the net result was that the trial was turned into something of a circus, complete with sideshows, . . . clowning, and tricks which could only divert the jury's attention from the serious business of determining guilt or innocence in accordance with proper standards.\" (In re Rodriguez (1981) 119 Cal. App. 3d 457, 467 [174 Cal. Rptr. 67].)\n\nWe recognize that recently, at least, prosecutorial misconduct has usually been deemed harmless. If what occurred in the instant case can be deemed harmless, however, then prosecutorial misconduct will never be grounds for reversal, no matter what effect it might have on a defendant's right to a fair trial. That is simply not the law. The misconduct herein was prejudicial under any standard; reversal is required.\n\nK. Related Issues\n\nRequest to Bar Retrial\n\nForsythe argues the misconduct was so egregious, retrial should be barred since what occurred caused permanent damage to defendants' cases. However, he offers nothing but speculation about the damage caused. He states that witnesses were intimidated, but the record on appeal contains no support for this or related assertions.\n\nForsythe seeks to analogize the instant case to ones in which mistrials were granted because of prosecutorial misconduct, but he offers no pertinent authority in support of the proposition that retrial should be barred. In fact, the one California case he does cite, People v. Hathcock (1973) 8 Cal. 3d 599 [105 Cal. Rptr. 540, 504 P.2d 476], specifically states that a \"defendant's voluntary institution of a mistrial motion is normally a sufficient indicant of the defendant's consent to the discharge of the jury to bar later recourse to a 'once in jeopardy' plea.\" (Id. at p. 613.) The defendant in Hathcock argued that his motion for mistrial was compelled by the prosecutor's blatant misconduct, but the Supreme Court rejected the argument. (Id. at p. 614.) Although the court recognized that a different situation might exist if a prosecutor deliberately caused the mistrial in order to obtain a fresh start (id. at p. 614, fn. 14), such is not the situation in the instant case, nor has Forsythe presented any reason for this court to depart from the Hathcock rationale.\n\nSimilarly, in Oregon v. Kennedy (1982) 456 U.S. 667 [72 L.Ed.2d 416, 102 S.Ct. 2083], upon which Forsythe also relies, the United States Supreme Court refused to bar retrial where a mistrial was granted because of prosecutorial misconduct, holding that \"[o]nly where the governmental conduct in question is intended to 'goad' the defendant into moving for a mistrial\" could a defendant successfully raise the bar of double jeopardy to a second trial. (Id. at p. 676 [72 L.Ed.2d at p. 425].) There is no showing that the prosecutors intended to goad defendants into moving for a mistrial in the instant case.\n\nNumber of Prosecutors\n\nDefendants also complain about two prosecutors being allowed to conduct the People's case. Basically, the argument has two prongs: (1) since two prosecutors argued the case, the trial court should have sua sponte permitted two defense arguments; and (2) since each defendant only had one counsel, the People should only have had one.\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e\n\nThe arguments are readily answered. Section 1095 provides: \"If the offense charged is punishable with death, two counsel on each side may argue the cause. In any other case the court may, in its discretion, restrict the argument to one counsel on each side.\"\n\nIn People v. Ah Wee (1874) 48 Cal. 236, the trial court, over objection, permitted three prosecutors to argue the case to the jury. Defendant had only two counsel, each of whom addressed the jury. The California Supreme Court rejected the argument that the trial court erred by allowing more than two arguments on behalf of the People. (Id. at p. 238.) It stated: \"As we construe [ยง 1095], its object was to give both the prosecution and the defense, in a capital case, the right to have the case presented to the jury by at least two counsel; and to distinguish the case in this respect from the inferior grades of crime in which the argument may, in the discretion of the Court, be restricted to one counsel on each side. But it was not intended to limit the power of the Court in any criminal case to allow as many counsel as in its discretion should seem proper, to address the jury, whether upon the part of the people or of the defendant.\" (People v. Ah Wee, supra, 48 Cal. at pp. 238-239.)\n\nDefendants offer no reason to depart from this rationale merely because we are concerned with all phases of trial, not just final argument. Forsythe alleges that while one prosecutor was questioning the witness, the other was preparing, researching, and comparing notes on testimony, rendering the proceedings \"about as fair as a tag team match with one side limited to one wrestler.\" However, he offers no proof in the record of this, nor does any defendant establish that prejudice resulted.\n\nMoreover, assuming that error somehow occurred, the defense's opportunity to participate in the adversary process was not significantly limited, and hence there was no infringement of defendants' constitutional right to the assistance of counsel. (People v. Bonin, supra, 46 Cal. 3d at pp. 693-695.) Likewise, assuming section 1095 was violated, which we do not believe has\n\nbeen established, the error was harmless under any standard of prejudice. No defense counsel asked for a second argument, nor was the trial court under any duty to sua sponte offer the opportunity for one, this not being a capital case. We have no way of knowing what effect a second defense argument might have had on the jury; however, the lack of defense request indicates either that defense counsel felt such request would be unavailing or that such argument was dispensable. Since the record on appeal sheds no light on this point, the argument is properly rejected. (Id. at p. 695.)\n\nInvestigatory Techniques\n\nFinally, defendants contend that the investigatory techniques denied them due process. As part of this argument, they request that this court take judicial notice of the Attorney General's report on the Kern County child abuse investigation, which report was made pursuant to a request by the Kern County Grand Jury. The request is denied.\n\nAlthough the record on appeal contains testimony regarding the investigative techniques used, such as repeated interviewing of the children, there is no actual evidence as to whether such techniques were improper or the likely effect on the children's testimony. The Attorney General's report does not concern this particular case. Judicial notice thereof is permissible but not mandatory, pursuant to Evidence Code sections 452 and 459. Given the insufficiency of the appellate record on this issue, this matter is more appropriately left for writ proceedings. (See People v. Stoll (1989) 49 Cal. 3d 1136, 1144, fn. 5 [265 Cal. Rptr. 111, 783 P.2d 698].)\n\nII.\n\nAdmission of Knotts Street Evidence\n\nA. Procedural Background\n\nTestimony was admitted at trial regarding Forsythe's alleged involvement in child molestations that occurred in September 1984. Defendants now argue that admission of the evidence, only some of which was limited to Forsythe, constituted reversible error.\n\nThe evidence must be examined in light of its procedural background and the justifications offered for its admission.\n\nDuring trial on April 3, 1985, the People filed a written offer of proof regarding the testimony of their next witness, Idolina Lopez. Idolina was not on the witness list announced by the People at the beginning of trial.\n\nShe was interviewed by Sergeant Bobby Fields and another officer on November 16, 1984, and a supplemental report was written by Fields on that date. The prosecutors interviewed her on February 21, 1985. Although Forsythe's attorney, Gardiner, may have had discovery of her statements earlier, other counsel such as Eyherabide did not receive police reports mentioning her until March 25. The materials were apparently provided to defense counsel without any indication, prior to the offer of proof, of Idolina's relevancy to the instant case. Despite this fact, various defense counsel requests for a brief continuance to prepare to respond to the People's offer of proof, which was given to counsel on April 1, were denied.\n\nAccording to the offer of proof, Idolina's testimony was to be divided into two areas. Area 1 would be admitted against all defendants and would include her observations of cameras, lighting equipment, a television set, light stands and a video camera used by Forsythe to make tapes of child molestation, and her observations of a tape shown by Forsythe of children and adults engaging in sexual acts.\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e\n\nThe basis for admitting this evidence was that children had testified to the use of the equipment and Idolina's testimony showed that Forsythe had the equipment used to make the child pornography with which he was charged. The jury could infer that he ended up with the equipment used in the crimes charged, after the arrest of his coconspirators. His possession of the video film would allow the jury to infer it was one of the films resulting from the conspiracy charged in the instant case.\n\nArea 2 evidence, which consisted of the acts of molestation, was to be admitted only against Forsythe. According to the offer of proof, it was admissible on the issue of identity, which was placed in issue by Forsythe's not guilty plea and his failure to indicate that he would not raise the issue as a defense. According to the People, Forsythe's defense was that he was misidentified as a perpetrator and that the children were molested but confused as to who did it. The People argued that it was difficult to find cases involving so many common marks -- that the marks were virtually Forsythe's \"fingerprint\" -- and that this also bolstered the credibility of the children's identifications of Forsythe as a perpetrator of the charged offenses. Finally, the People proposed that the jury be given a limiting instruction regarding area 2 evidence.\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e\n\nIn arguing the admissibility of the evidence, Gindes contended that area 1 testimony did not fall within the provisions of Evidence Code section 1101.\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e He argued that the equipment in both instances was the same, and Idolina's testimony showed that one of the conspirators ended up with it. Therefore, it was admissible to corroborate the testimony of the green house\n\nvictims. Gindes also relied on this court's opinion in People v. Willoughby (1985) 164 Cal. App. 3d 1054 [210 Cal. Rptr. 880], and argued that admitting the evidence would save time under Evidence Code section 352\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e since it would prevent the calling of numerous prosecution witnesses in various areas. He also pointed out that the evidence directly contradicted Forsythe's statement to Sergeant Fields that he never had video or photographic equipment, thus showing an attempt by Forsythe to fabricate evidence.\n\nDefense counsel argued that there were glaring dissimilarities among the various descriptions of equipment and that assuming most of what was claimed in the offer of proof were shown, there were no highly distinctive marks of similarity. Counsel also noted the great chance of undue prejudice and time consumption involved in essentially trying a second case. Additionally, counsel argued that there was no way the jury would be able to consider area 2 evidence only as to Forsythe, regardless of the limiting instruction. Various defense counsel also argued that area 1 evidence was irrelevant since Idolina's observations were made more than a year after the alleged molestations at the green house, and that at the very least the trial court should exercise its discretion and refuse to admit the evidence under Evidence Code section 352. Counsel also argued that Forsythe's identity was not actually in issue -- that this was not an identity case, but a \"no crime was committed\" case.\n\nThe trial court found that Forsythe placed his identity in issue by claiming that he was misidentified, and that his not guilty plea placed the burden on the People to prove all elements of the charged crimes, including Forsythe's identity as a perpetrator. The court further found that the offer of proof set forth highly distinctive marks of similarity between the charged and uncharged acts, and that the probative value substantially outweighed any prejudice. As to area 1 evidence, the court found that the jury could infer the photographic equipment was used in the green house; therefore, said evidence was admissible against all defendants.\n\nA motion for mistrial, made after conclusion of the Knotts Street testimony, was denied.\n\nB. Testimony\n\nIdolina Lopez\n\nIdolina Lopez testified that in August or September 1984, she lived in an apartment at 700 Knotts Street. Her son Juan, then age eight, and one\n\nIgnacio Cardona lived with her. Around September 1984, Forsythe moved into the apartment complex with Stephanie Jenkins and her daughters Angela, who was about eight years old, and Alicia, who was about four years old.\n\nAfter Forsythe and Stephanie moved into the complex, Idolina's son Juan began to play with Angela and Alicia. The second week of September 1984, Idolina missed Juan for a period of time and looked for him, among other places, at Forsythe's apartment. After discussing Juan's whereabouts with Stephanie, Lopez followed Stephanie into the bedroom. Juan was there, as were Alicia, Angela, and Pamela Weatherly's son David. Although Pamela Weatherly was in the kitchen, her husband Melvin was also in the bedroom. Everyone was watching videotapes on television. The movies were of adults having sex with children. Although there was more than one adult involved, Idolina recognized only Forsythe.\n\nWhile the movies were being shown, Forsythe was lying naked on the bed with Angela. Alicia was also naked. Idolina wanted to take Juan, but Forsythe would not let them leave. After saying they had seen too many things, Forsythe made Idolina remove her clothes. Present at this time were adults Forsythe, Ignacio Cardona, Allen LeCain, Ralph Lopez, and Melvin Weatherly. Also present were children Angela, Alicia, Juan, and David.\n\nForsythe did not make Idolina do anything else at the time, but he put a knife to Juan's throat and told her she had to come back every time he wanted, to participate in sexual activities, if she wanted to see her son alive. He then let her, Juan, and Ignacio go. After that, she returned to the apartment on numerous occasions when sexual activities occurred.\n\nIdolina was in Forsythe's bedroom on various occasions. There she saw a camera attached to a three-legged stand, and standing about four feet off the ground. The legs were black. The camera had a lens like a square, and the lens could be focused. The camera had one cable attached to it. Idolina saw a video recorder in the apartment, but could not recall if the wire from the camera was attached to it. She saw the camera and recorder in the same room at the same time. The video recording machine was connected to the television.\n\nAt a time when Idolina saw the camera on the stand in the bedroom, there were also two lights on stands, with bulbs on top. The stands were alike. The lights were about five feet five inches tall. The bases were round. The stands were silver metal. By each light was a round, silver oval like a bowl, with the light in the middle. The lights were very, very bright. Both lights were the same height and brightness. They were brighter than the\n\nfluorescent lights in the courtroom. There were no wheels on either the legs of the camera stand -- or the lights.\n\nOn one occasion, Idolina, Forsythe, Melvin Weatherly, Allen LeCain, Ralph Lopez, Kelly LeRoy, Stephanie, Pamela Weatherly, and Ignacio were present. The children there were Stephanie's girls, David W., Juan, Bobby R., Joseph R., Joseph P., Mike M., Christopher L., and Chuko. The children ranged in age from six or seven to twelve.\n\nForsythe told everyone to disrobe. Idolina then saw him operating the camera. He would tell everyone in what positions to get so that he could take pictures. These were pictures of the adults having sex with the children. Forsythe would tell the adults and children what to do with each other and where. When pictures were being taken, the lights would be turned on and placed directly where the adult and child were having sex. Forsythe would tell the little boys to suck the women's vaginas and the adults would suck the boys' private parts. The little boys would be placed on top of the women and told to penetrate the women. Forsythe would tell the boys to go up and down. Forsythe and Melvin made the boys suck the women's breasts and touch their vaginas with their hands. Forsythe would have the women touch the boys' privates. He also had the adults suck the girls' vaginas, then the girls would touch the men's penises, then the men would penetrate the girls' vaginas and rectums.\n\nAt times, Forsythe would stop using the camera and do sexual things himself. He sucked the boys' private parts and penetrated their rectums. He penetrated the girls' vaginas and rectums. He would also have the boys suck his privates. He had tattoos on his legs, arms, chest, back, and penis.\n\nThe adults never had sex with each other, just with the children. Forsythe had a knife on more than one occasion. Sometimes he would threaten the children by saying that if they told, they would not see their parents again because Forsythe would kill the children and their parents.\n\nWhen all the adults were in the room, they would pass around and smoke a long brown cigarette. When one adult was having sex with a child, the others would watch. Sometimes one person would be doing something to one child and another person would be doing something to another child. Once Idolina heard Forsythe telling Stephanie and Melvin that he thought they were going to make good money with the pictures. When the sex acts happened in the bedroom, the same camera and lights were always used.\n\nThese events occurred between the second week of September 1984 and October 22, 1984. During that time, the group got together 15 or 20 times.\n\nPhotographs were taken the last three times. On the first of those occasions, only one camera was present. It had three black legs. There were two lights. Idolina never saw more than two lights of that kind.\n\nIn November 1984, Bobby Fields and another officer spoke with Idolina about the alleged incidents. During the interview, Idolina lied to Fields about knowing the Weatherlys and being involved in sexually molesting the children. She denied ever being in Stephanie's apartment. She did this because she was afraid. Forsythe had told Idolina that if she ever told anyone, even if he was in jail, someone would kill her and her son.\n\nIdolina was eventually granted immunity for testifying in the Knotts Street case.\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e She agreed to testify in the instant case without any promises being made in relation to that case, although at the time she agreed, she knew she was facing a potential sentence of 379 years. At the time of trial, she was still in custody on 98 counts of child molestation, although the district attorney had promised to dismiss the charges.\n\nBobby R.\n\nAt the time of trial, Bobby R. was eight years old. He knew Forsythe from the time Forsythe moved into the apartment with Stephanie, Angela, and Alicia in 1984. Bobby lived two houses down.\n\nBobby initially testified that he did not go into Forsythe's apartment, nor did he remember being in a room with Forsythe. However, he remembered telling Gindes about some cameras Forsythe had. One was a movie camera and the other was one that you press. Bobby saw those cameras at Allen's. (Apparently, Allen LeCain.) He did not see Forsythe with those cameras. Bobby previously told Gindes that Forsythe had three cameras. That was the truth. Bobby saw Forsythe carrying three cameras to Forsythe's apartment. He also saw Forsythe with some lights.\n\nForsythe had three lights at Allen's apartment. Bobby also saw him with a videotape recorder in Allen's apartment. Bobby also saw Forsythe walking to his apartment with an unusual board. The board, which Bobby said he saw lots of times, was brown, three and one-half to four feet tall and about three feet wide. At one point, Bobby testified that three white ropes were tied around it. There were also sticks and nails on the board. The sticks were attached to the board. So were the nails, which were bent over. At another point, Bobby said that the ropes were tied to the nails and sticks\n\non the board. The sticks were nailed onto the board and the ropes were attached under the sticks. There were six ropes on the board.\n\nOne of the cameras had a flash bulb on it. The movie camera had a stand with three legs and a wire coming from it. The camera also had something on it to wind up and a squeeze ball. The other movie camera also had a stand and a squeeze ball. The third camera had a flash. The three lights had stands with three legs and a big round thing to hold the light bulb.\n\nThere came a time when Bobby was invited to Forsythe's apartment.\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e Bobby went inside about three times. When he was there, so was Forsythe. There were also times when Bobby went into Allen's apartment, which was in the same complex. Forsythe was there. Bobby had sex in both of the apartments when Forsythe was there. In Forsythe's apartment, it occurred in Forsythe's bedroom. On one occasion, there were 10 adults present: Forsythe, Stephanie Jenkins, David, Melvin Weatherly, Pamela Weatherly, Idolina, Ignacio, Ralph Lopez, Allen, and Allen's girlfriend Kelly. There were also a bunch of children in the room: Michael, John, Alicia, Angela, Bobby, and children whose names Bobby could not recall.\n\nOn one occasion, everyone disrobed in Forsythe's bedroom. Forsythe, who was mean, acted like the boss. He and Melvin Weatherly gave orders. Forsythe gave the most orders. He told Kelly, Allen, and Pam to do stuff to the kids. He told the kids to suck on his weenie. He told someone to get on top of the girls. He told the little kids to do it with the other little kids. The men put their weenies in the kids' butts. Forsythe put his penis inside the butts of five of the kids.\n\nThere were three bright lights in the room at the time. When a kid was doing something nasty, the lights shone on the kid. After the lights were on for awhile, they made the room hot.\n\nKids put their mouths on adults' penises. Melvin and Forsythe gave the orders to do this. Forsythe also ordered the children to put their penises in the women's butts. He also ordered them to get on top of the ladies and move up and down. The kids' penises would be lying on the ladies' privates. Forsythe also ordered the children to put their mouths on and lick the women's private places.\n\nForsythe ordered Bobby to go over to Angela and get on top of her, then told him to go up and down. Allen took a picture. Forsythe also ordered\n\nother children to do things with other children. Forsythe was the one who gave the orders as to what boy should do something with what girl. The boys had to lie on top of the girls. The boys also had to put their mouths between the girls' legs. This was photographed. Three of the boys, including Bobby, had to put their mouths on Forsythe's penis. Forsythe also ordered the boys to suck the women's breasts.\n\nForsythe has tattoos on his arm and his back. He also has a tattoo on his butt. One of the tattoos looks like a snake. One looks like a hawk.\n\nThe board was used at both Allen's and Forsythe's houses. Three children would be tied to the board at the same time. Forsythe tied them. They were sitting down. There were times when Bobby saw only one child tied to the board. That child would be lying down and was tied with two ropes. The ropes went around the child's arms. Then the women would get on top of the child while someone took pictures.\n\nAll of the children were made to sniff white powder through a straw from a dish in the kitchen. It made Bobby feel drowsy. It made his nose feel funny, like he always had to wiggle it.\n\nWhen Forsythe had to go to the rest room, he would \"pee\" in a cup. He made Bobby and other kids drink it while someone took pictures. This happened one time. When the kids had to pee, Forsythe made them pee on the floor. No one took pictures of this. Forsythe also made Bobby drink whiskey and beer. \"They\" made him smoke \"weed.\" It made Bobby feel sleepy. This all happened on the same day.\n\nThe nasty things started about 1 p.m. and ended about 3 p.m. They happened at Forsythe's apartment on three different days. There were two doors in the apartment; on two of the occasions, Bobby saw a big person standing at the front door. Once there was also a big person at the back door.\n\nAllen lived next door to Forsythe. The fourth time nasty things happened was at Allen's apartment. Nasty things happened more than four times, although Bobby could not recall how many altogether. They all ended before school started. Forsythe showed movies on television at Allen's. These were of children doing nasty things to each other. Bobby recognized Forsythe and some of the children doing nasty things in the movies, but he did not see himself. Forsythe threatened to kill the children's parents if the children told.\n\nBobby saw some of the people, whose names he did not know, drive up in cars. He saw a car that was really unusual in his neighborhood. It was a red\n\nPorsche. Bobby saw one of the people in Forsythe's room get out of the Porsche. This person was in Forsythe's room while the nasty things were happening.\n\nBobby saw the stranger drive up to the apartments in a red Porsche more than once, but only on days when the nasty things happened. The stranger would arrive shortly before the nasty things started happening in the apartment, and he would be present. The man stayed in the apartment while the nasty things were happening, but he did not take his clothes off or do any of the things. He was not the man at either of the doors. He was in the living room while everyone else was in the bedroom. He did not take any pictures.\n\nToby Tyler\n\nRichard P. \"Toby\" Tyler, a San Bernardino County sheriff's sergeant, was qualified by the People as an expert in child pornography. The lowest price Tyler encountered in the United States in 1982 and 1983 for a single videotape of child pornography was $100. An individual possessing such a tape could make unlimited copies thereof and sell each for that price. Still photographs of children involved in sexual activity in 1982 and 1983 went for $15 to $25 per picture, rarely less. Child pornography made to order commands higher prices. Tyler has encountered cases in which child pornography is traded for narcotics.\n\nIn making child pornography, a video camera is generally used. A VCR may be used. A low quality video has little or no auxiliary lighting. The higher quality semiprofessional one involves a minimum of two lights mounted on tripods. They are usually quartz lights which give off a substantial amount of light and heat. There is often a light mounted on the camera itself, in addition to the other two lights mounted on stands. The quartz lights are so bright that a momentary touching of the bulb itself would produce a third degree burn. People closer than six feet to the lights would be made uncomfortable by the heat. Within two feet, sustained exposure would cause a second degree burn.\n\nA video camera will always have a wire. A movie camera may or may not have a wire. Very frequently, more than one camera is used at the same time. Multiple cameras produce a larger quantity of material. There may be voice-overs on videotape, because child pornography collectors form a special preference for certain children and like to be able to identify those children when future orders are placed. Any kind of camera can be used in child pornography. There are a number of cameras that fit the description of an individual with a black hood over himself taking pictures.\n\nGenerally speaking, videotapes depict virtually any act that is possible between two humans or a human and an animal, or animals, or humans and animals. This includes sexual intercourse, fondling, oral intercourse, oral copulation of the anus, sexual acting out with animals, sodomy, and sadistic/masochistic (S \u0026 M) behavior. There are also \"golden showers,\" i.e., the child drinking urine, and \"brown logging,\" i.e., the consumption of human excrement. It is fairly common to have pictures of adults having sex with a child. It is also very common to have pictures of sexual acts between children. There is a movie called Kinder Orgy, which depicts an orgy scene showing an adult having access to many children. Tyler has seen depictions of children all lined up and an adult going from one child to the next.\n\nThere is a market for S \u0026 M child pornography, which depicts the infliction of pain upon others and the arousal by experiencing pain. It may include bondage, such as tying people up or handcuffing them. The child may be handcuffed, then molested, and this is shown on film. There are cases where children are filmed urinating on the floor. This is suggestive of golden showers, which may range from urinating on another person to urinating in another's mouth and having that person consume the urine. There are cases in which objects such as screwdrivers have been inserted into body openings of a child. Tyler has not heard golden showers applied to drinking urine from a cup. He has never seen depictions of a child drinking urine from some type of receptacle, nor has he seen depictions of a gun barrel placed into the anal opening of a child.\n\nKiddie porn films show basically the same acts as adult films, except that in kiddie porn, there is usually not penile penetration of prepubescent females' vaginas. Such penetration would cause tremendous pain and potentially life-threatening injuries. A child may be numbed by Novocain, or by having cocaine applied to the genitals.\n\nIt is fairly common for videotapes of children engaged in sexual acts to be shown to those children at a later time. One purpose is to get the child to have significant guilt over the fact that he or she is now a participant in a \"dirty movie.\" Another is to get the child interested in participating again, so they can once again become a movie star. A third purpose is to entice or seduce other children into participating in like activity.\n\nC. Admission of Evidence Against Forsythe\n\nThe general rule is that evidence of crimes other than those charged in the information is inadmissible when offered solely to prove the criminal disposition or propensity of the accused. (Evid. Code, ยง 1101, subd. (a).) This is because the probative value of such evidence is outweighed\n\nby its prejudicial effect. (People v. Haston (1968) 69 Cal. 2d 233, 244 [70 Cal. Rptr. 419, 444 P.2d 91].) However, except when it merely shows criminal disposition, sufficiently relevant evidence may be admissible although it includes evidence of the commission of another crime. (Ibid.)\n\nEvidence of other crimes must be examined with care and \"'[a] closely reasoned analysis' of the pertinent factors must be undertaken before a determination can be made of its admissibility.\" (People v. Thompson (1980) 27 Cal. 3d 303, 314, fn. omitted [165 Cal. Rptr. 289, 611 P.2d 883].) Such evidence should be received \"'with \"extreme caution,\" and if its connection with the crime charged is not clearly perceived, the doubt should be resolved in favor of the accused.' [Citations.]\" (People v. Haston, supra, 69 Cal. 2d at pp. 244-245.)\n\n\"'Before permitting the jury to hear evidence of other offenses the court must ascertain that the evidence (a) \"tends logically, naturally and by reasonable inference\" to prove the issue upon which it is offered; (b) is offered upon an issue which will ultimately prove to be material to the People's case; and (c) is not merely cumulative with respect to other evidence which the People may use to prove the same issue.' [Citation.]\" (People v. Perry, supra, 7 Cal. 3d at p. 780.) In other words, the admissibility of an uncharged offense depends on \"three principal factors: (1) the materiality of the fact sought to be proved or disproved; (2) the tendency of the uncharged crime to prove or disprove the material fact; and (3) the existence of any rule or policy requiring the exclusion of relevant evidence. [Citations.]\" (People v. Thompson, supra, 27 Cal. 3d at p. 315.)\n\nTo satisfy the materiality requirement, the fact sought to be proved may be either an ultimate fact in the proceeding or an intermediate fact from which an ultimate fact may be presumed or inferred. (People v. Thompson, supra, 27 Cal. 3d at p. 315.) The perpetrator's identity and elements of the charged crimes are ultimate facts, as are elements of certain defenses. (Id. at p. 315, fn. 13.) Motive, opportunity, plan, scheme, design, and modus operandi are intermediate facts. (Id. at p. 315, fn. 14.) \"Evidence of an uncharged offense offered to prove an intermediate fact is not necessarily material. The materiality requirement is satisfied only if the intermediate fact tends logically and reasonably to prove an ultimate fact which is in dispute . . . .\" (Ibid.)\n\nMoreover, the ultimate fact to be proved \"must be 'actually in dispute.' [Citation.] If an accused has not 'actually placed that [ultimate fact] in issue,' evidence of uncharged offenses may not be admitted to prove it. [Citations.] The fact that an accused has pleaded not guilty is not sufficient\n\nto place the elements of the crimes charged against him 'in issue.' [Citation.]\" (People v. Thompson, supra, 27 Cal. 3d at p. 315, fn. omitted.)\n\nEvidence Code section 1101, subdivision (a) does not permit balancing of probative value against prejudicial effect. \"The inference of a criminal disposition may not be used to establish any link in the chain of logic connecting the uncharged offense with a material fact. If no theory of relevance can be established without this pitfall, the evidence of the uncharged offense is simply inadmissible.\" (People v. Thompson, supra, 27 Cal. 3d at p. 317, fn. omitted.) Similarly, evidence of other crimes is not automatically admissible under Evidence Code section 1101, subdivision (b) when offered to prove an intermediate fact other than disposition: it must still satisfy the rules of admissibility codified in Evidence Code sections 210, 350, and 352. (People v. Thompson, supra, at p. 317, fn. 17.) This is because \"'[w]e have . . . reached the conclusion that the risk of convicting the innocent . . . is sufficiently imminent for us to forego the slight marginal gain in punishing the guilty.' [Citation.]\" (Id. at p. 317, fn. omitted.)\n\nIf evidence of other offenses is \"'merely cumulative with respect to other evidence which the People may use to prove the same issue,' it is excluded under a rule of necessity. [Citations.]\" (People v. Thompson, supra, 27 Cal. 3d at p. 318.) Moreover, for such evidence to be admissible, under Evidence Code section 352 its probative value must outweigh its prejudicial effect. Since a substantial prejudicial effect is inherent in such evidence, it is admissible only if it has substantial probative value. If there is any doubt, the evidence should be excluded. (People v. Thompson, supra, at p. 318; see also, People v. Tassell (1984) 36 Cal. 3d 77, 88 [201 Cal. Rptr. 567, 679 P.2d 1].)\u003cspan class=\"fnref\"\u003e50\u003c/span\u003e\n\nFinally, the admission of other crimes evidence cannot be justified merely by asserting an admissible purpose. Rather, its relevancy must be determined: is the evidence of other offenses here offered logically relevant\n\nto prove something other than disposition in this case ? (People v. Thompson, supra, 27 Cal. 3d at p. 319 and fn. 22.)\n\nIn the instant case, the People offered the Knotts Street evidence to prove Forsythe's identity as a perpetrator of the charged offenses. Since identity of a perpetrator is an ultimate fact, the Knotts Street evidence was offered to prove something other than Forsythe's criminal disposition, and hence was not made automatically inadmissible by Evidence Code section 1101, subdivision (a).\n\nThe question, however, is whether Forsythe's identity was actually in issue. If there was no issue of identity, it is immaterial whether the modus operandi of the green house offenses was similar to that of the Knotts Street crimes. Under such circumstances, the \"common plan or scheme\" rationale for admissibility was merely a euphemism for \"disposition\" and the other crimes evidence was inadmissible. (People v. Tassell, supra, 36 Cal. 3d at p. 89.)\n\nIn his opening statement, Gardiner asserted:\n\n\"The evidence will establish that Mr. Wayne Forsythe became acquainted with Colleen Dill Bennett Forsythe in the summer of 1982, and that Mr. Forsythe and his present wife, Colleen Forsythe were married later that year and lived in the southern California area.\n\n\"The evidence will establish that Wayne Forsythe had very little contact with these children, notably, Johnny [M.] who will be the principal witness against him, and in fact, probably saw the children no more than a couple of times. Because he did not spend any extensive period of time at this socalled green house. About his major involvement, the evidence will establish, is that he assisted Rick Pitts and his wife when they were packing up and moving back to the middle west. He saw the children on occasion in the yard in the house, of the house in which they were living.\n\n\"The evidence will establish that Mr. Wayne Forsythe was not part of any conspiracy, that he was not involved in a child molestation ring, and that the charges against him are unfounded, that is they are based upon untrue testimony.\n\n\"One glaring thing that you will notice in the evidence that's produced here in the testimony that you hear is this, if the activities that Johnny [M.] testifies to actually took place, Johnny [M.] would be able to describe certain features about Mr. Forsythe which he, the evidence will show,\n\ncannot describe. The evidence will show when this case is over that Wayne Forsythe is not guilty of the charges that have been brought against him.\"\n\nAs previously noted, Gindes characterized Forsythe's defense as being one of misidentification. Defense counsel characterized it as being that no crimes occurred.\n\nWhen the defense is that the victim mistook the defendant for another person, identity is clearly placed in issue. Where, however, the defendant claims that the crime did not occur, it has been held that identity is not actually in dispute. (See People v. Gordon (1985) 165 Cal. App. 3d 839, 846-848, 860 [212 Cal. Rptr. 174].) The import of Gardiner's opening statement is that Forsythe's defense was that the molestations did not occur.\n\nThis court has previously stated that where a defendant does not indicate he will not raise a misidentification issue, the prosecution may produce other crimes evidence in its case-in-chief because it has the burden of proving all elements of the charged offense, including the identity of the perpetrator thereof. (People v. Willoughby, supra, 164 Cal. App. 3d at pp. 1064-1065.)\n\nWe first note that this statement was in the form of an advisory opinion for the guidance of the trial court in the event of retrial following remand, and, as such, was not necessary to the decision and merely dictum. (9 Witkin, Cal. Procedure (3d ed. 1985) Appeal, ยง 783, pp. 753-755.) Secondly, in People v. Willoughby, supra, 164 Cal. App. 3d at page 1064, this court also stated in the course of the advisory portion of the opinion: \"Appellant's not guilty plea places the burden on the prosecution to prove his guilt of the charged crime beyond a reasonable doubt. This obviously includes proof of appellant's identity as the perpetrator of the charged crime.\" In the instant case, quite understandably, both Gindes and the trial court interpreted this as meaning that when a defendant pleads not guilty, he places his identity in dispute. Given the California Supreme Court's reasoning in People v. Thompson, supra, 27 Cal. 3d at page 315 [\"The fact that an accused has pleaded not guilty is not sufficient to place the elements of the crimes charged against him 'in issue'\"], this is an overly broad reading of Willoughby. If a defendant's identity were always \"actually in dispute\" because of a not guilty plea, other crimes evidence would always be admissible at least under Evidence Code section 1101, subdivision (b), assuming there were sufficiently distinctive marks of similarity between the charged and uncharged offenses. The exception would essentially swallow the rule. However, as we noted in Willoughby : \"We recognize there are sex cases which hold that a defendant's identity is not 'in issue' in the prosecution's case-in-chief where the victim is personally acquainted with the defendant, such as\n\nwhere the accused is the victim's parent or teacher. [Citations.] However, in these cases, unlike the present case, 'the focus . . . of [the] case is likely to be on whether the alleged crime was ever committed' [citation] rather than on the question whether the defendant did it. In the present case, because the evidence is uncontradicted that [K.] had been repeatedly molested, the only real issue for the jury to decide was whether appellant was the one who did it.\" (People v. Willoughby, supra, 164 Cal. App. 3d at p. 1065, fn. 3.)\n\nIn Willoughby, there was uncontradicted testimony by physicians of physical findings establishing that the child victim \"had been repeatedly sodomized and had been subjected to repeated vaginal intercourse.\" (People v. Willoughby, supra, 164 Cal. App. 3d at p. 1060.)\n\nIn the instant case, Forsythe was acquainted with all of the alleged victims and in fact lived with two of them (Windy and Amanda) off and on. Although Dr. Woodling testified that Carol and Lisa had been molested, this evidence was not uncontradicted since those children themselves testified otherwise. Nor was there uncontradicted evidence that any of the other alleged victims had been molested. When Gardiner's opening statement is considered in conjunction with these circumstances, it is clear that Forsythe's \"identity\" was not actually in dispute. The real issue was not whether Forsythe was, in fact, one of the persons identified by the children as perpetrators of the acts of molestation, but whether the acts of molestation as described by the children ever happened. No claim of misidentification was raised by Gardiner's opening statement on behalf of Forsythe, nor later by Forsythe's testimony. Stated another way, if the jurors believed the testimony of the children and found that the acts of molestation as described by them actually happened, there was no reasonable basis under the evidence for the jury to find that defendant Wayne Forsythe was not the Wayne Forsythe identified by the children as being one of the perpetrators.\n\nSince Forsythe's identity as one of the perpetrators was not actually in dispute, the Knotts Street evidence was inadmissible (see People v. Thompson, supra, 27 Cal. 3d at p. 315; People v. Tassell, supra, 36 Cal. 3d at pp. 88-89); moreover, because of its overwhelming prejudicial nature, reversal is required.\n\nHaving concluded that Forsythe's identity was not actually in dispute, we need not address the question of whether the Knotts Street evidence was admissible pursuant to Evidence Code section 1101, subdivision (b), as showing a modus operandi from which identity could reasonably be inferred.\n\nD. Admission of Evidence Against Other Defendants\n\nAlthough a prior act need not be a crime to be admissible under Evidence Code section 1101 (People v. Wills-Watkins (1979) 99 Cal. App. 3d 451, 456, fn. 1 [160 Cal Rptr. 289]), such evidence is not admissible solely to corroborate or bolster a witness's credibility (People v. Key (1984) 153 Cal. App. 3d 888, 894 [203 Cal. Rptr. 144]; see People v. Bunyard (1988) 45 Cal. 3d 1189, 1207, fn. 7) [249 Cal. Rptr. 71, 756 P.2d 795].\n\nGindes argued that the area 1 evidence did not depend on Evidence Code section 1101 for admissibility, but instead was relevant to show that one of the conspirators ended up with the equipment used in the commission of the charged offenses. Assuming this argument would be valid in some situations, it is not valid here nor was the area 1 evidence otherwise independently admissible: the equipment used in the Knotts Street acts was simply not sufficiently shown to be the equipment used in the green house.\n\nThe green house children gave enormously varied descriptions of the equipment involved. According to Christine, there was a movie camera on a stand and more than one bright light. There was or was not (depending on which version of her testimony is considered) a wire or cord touching the camera. There was also a smaller camera that pictures came out of. The larger camera was on a stand when not in use. There was no camera which involved the placement of a hood over the operator's head. The lights each had one bulb with a round thing like a salad bowl. Each was on a pole, and neither had wheels.\n\nTommy testified to big, round lights on two little stands. They were bright. There was also a video camera with wires coming out of it. It was on a stand. There was also a camera that pictures came out of. One camera had a black thing that went over the operator's head. The operator would have a little squeezer in his hand. There were wheels on the camera's legs. On one occasion, the camera with wires was not present, but one without wires was.\n\nDisposition\n\nThe judgments are reversed. The trial court is directed to enter its order dismissing the following counts: Counts 11, 13, 16, 20, 24, 27, 29, 31, 37, 39, 44, 51, 52, and 53 of Second Amended Information No. 27641; Counts 4, 11, 12, 13, 16, 19, 20, 22, 24, 25, 27, 37, 39, 42, 43, 44, 45, 47, 49, 50, 51, 52, 53, 55, 57, and 58 of Second Amended Information No. 27774; Counts 4, 10, 18, 20, 24, 29, and 31 of Amended Information No. 28244.\n\n\u003cspan class=\"fn\"\u003e29. It was not unreasonable for defense counsel to object before the answer.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. In People v. Poggi, supra, 45 Cal. 3d at pages 335, 336, the California Supreme Court stated that Perez was no longer valid. The issue in Poggi was the trial court's sua sponte duty to intervene where prosecutorial misconduct occurs. However, portions of Perez discussing what constitutes prosecutorial misconduct have been cited with approval in People v. Warren (1988) 45 Cal. 3d 471, 480 [247 Cal. Rptr. 172, 754 P.2d 218], and People v. Carrera (1989) 49 Cal. 3d 291, 318 [261 Cal. Rptr. 348, 777 P.2d 121].\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. The July 5, 1984, preliminary hearing involved Rick, Tutti, and Colleen. Dill's preliminary hearing, and that of Gina and Grace, began on July 24, 1984. Forsythe's preliminary hearing began October 31, 1984.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. Earlier in the proceedings, Fusilier asked Mr. Silvius for an explanation of dyslexia and noted that English was not his primary language. When Fusilier later was examining Silvius on recross-examination, Vendrasco objected to the unintelligibility of a question, and Silvius asked Fusilier to rephrase it. The trial court joked, \"In your primary language now.\" Fusilier responded, \"I've got trouble knowing what primary really means at times.\" Unlike the instant situation, the context of the initial exchange makes it clear the remarks were humorous.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. In many instances, this area overlaps defendants' challenges to various evidentiary rulings. In most cases, the prosecutors' conduct was sanctioned by the trial court's overruling of defense objections. Generally, \"[a] prosecutor is not guilty of misconduct when he questions a witness in accordance with the court's ruling.\" (People v. Rich (1988) 45 Cal. 3d 1036, 1088 [248 Cal. Rptr. 510, 755 P.2d 960].) Many of these instances are properly termed misconduct, however, because the prosecutors' questions were so obviously improper, they cannot have been asked in good faith.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. None of the defendants was charged with possession of marijuana, nor was any evidence introduced to show that the substance was, in fact, contraband.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. It is unclear if Gindes meant producing burns in that manner, or burns like Brian suffered. If the latter, it must be remembered that the actual evidence never showed the burn to have been anything more than minor. Only Gindes's questions implied that it was a significant injury.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. These were all allegations made by John M. during the various custody/visitation hearings. Tutti denied that any were true. John did not testify at trial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. Although it ultimately found the misconduct harmless, the Luparello court stated, \"While the court's sustaining of defense objections and striking of testimony suggested it did not condone such conduct, the flagrancy of the prosecutor's misconduct makes it highly unlikely that even a conscientious jury could completely ignore what it had heard.\" (Ibid.) Here, of course, the trial court's actions suggested it did condone Gindes's conduct.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. Although not made totally clear in the record, it appears VOCAL stood for Victims Of Child Abuse Laws and was an organization in which Norma Pitts was active.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. There was testimony that Amanda wanted to move to Oklahoma with Rick and Tutti.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. All examples in this group occurred wholly outside the jury's presence unless otherwise stated.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. At least in the case of Amanda, the youngest witness, the record reflects that at times certain of defense counsel could not even see her while she was testifying.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. It is arguable that the admonition was not sufficiently tailored to the circumstances so as to adequately cure any harm caused by the trial court's remarks. However, the burden was on defense counsel to request appropriate modifications if they thought it was inadequate. (People v. Martinez (1989) 207 Cal. App. 3d 1204, 1225 [255 Cal. Rptr. 691].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. Defendants correctly point out that objections were raised to both prosecutors examining witnesses, objecting, and presenting argument, throughout trial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. Subsequently, anything regarding observations of sexual acts, in person or on videotape, was moved to area 2.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. Just prior to direct examination of Idolina regarding area 2 evidence, the trial court instructed the jury: \"Ladies and Gentlemen of the Jury, You Will Now Be Hearing Evidence That Is Being Admitted Against Only One of the Defendants, Wayne Forsythe, and Is Not Being Admitted Against Any Other Defendant. You Are Instructed and Admonished That This Evidence May Only Be Considered Against Wayne Forsythe and Not Against Any Other Defendant. [para.] The Evidence That You Will Be Hearing Is Being Introduced by the Prosecution for the Purpose of Showing That Wayne Forsythe Committed a Crime or Crimes Other Than That for Which He Is on Trial. Such Evidence, if Believed, Is Not Being Received and May Not Be Considered by You to Prove He Is a Person of Bad Character or That He Has a Disposition to Commit Crimes. [para.] Such Evidence Is Received and May Be Considered by You Only for the Limited Purpose of Determining If It Tends to Show That There Is a Characteristic Method in the Commission of Criminal Acts Similar to the Method Used in the Commission of the Offense or Offenses in This Case Which Would Further Tend to Show the Identity of the Person Who Committed the Crime or Crimes, if Any, of Which Wayne Forsythe Is Charged. [para.] For the Limited Purpose for Which You May Consider Such Evidence, You Must Weigh It in the Same Manner as You Do All Other Evidence in the Case. You Are Not Permitted to Consider Such Evidence for Any Other Purpose.\" During the giving of instructions prior to deliberations, the trial court told the jury: \"Evidence has been introduced for the purpose of showing that a defendant committed a crime or crimes other than that for which he is on trial. Such evidence, if believed, was not received and may not be considered by you to proof [ sic ] that he or she is a person of bad character, or that such person has a disposition to commit crimes. Such evidence was received and may be considered by you only for the limited purpose of determining if it tends to show the following: As to the evidence that was introduced against Defendant Wayne Forsythe only and which you were instructed to consider, as to no other defendant in any manner, such evidence may be considered if it tends to show a characteristic method, plan or scheme in commission of criminal acts, similar evidence, correction, similar to evidence of the method, plan or scheme used in the commission of the event in this case which would further tend to show the identity of the person who committed the crimes, if any, of which said defendant is charged. [para.] As to evidence that was introduced against all defendants concerning crimes not charged in the information, such evidence was received and may be considered by you only for the limited purpose of determining if it tends to show the existence of a conspiracy. [para.] For the limited purpose for which you may consider such evidence, you must weigh it in the same manner as you do all other evidence in the case. You are not permitted to consider such evidence for any other purpose.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. As of the time of trial, Evidence Code section 1101 read: \"(a) Except as provided in this section and in Sections 1102 and 1103, evidence of a person's character or a trait of his character (whether in the form of an opinion, evidence of reputation, or evidence of specific instances of his conduct) is inadmissible when offered to prove his conduct on a specified occasion. \"(b) Nothing in this section prohibits the admission of evidence that a person committed a crime, civil wrong, or other act when relevant to prove some fact (such as motive, opportunity, intent, preparation, plan, knowledge, identity, or absence of mistake or accident) other than his disposition to commit such acts. \"(c) Nothing in this section affects the admissibility of evidence offered to support or attack the credibility of a witness.\" Evidence Code section 1101 has since been amended in a manner not pertinent to the instant case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. Evidence Code section 352 provides: \"The court in its discretion may exclude evidence if its probative value is substantially outweighed by the probability that its admission will (a) necessitate undue consumption of time or (b) create substantial danger of undue prejudice, of confusing the issues, or of misleading the jury.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. A preliminary hearing involving at least some of the Knotts Street defendants was in progress at the time of trial in the instant matter.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. In the same language as the admonition given concerning Idolina's testimony, the jury was instructed that the following evidence could be considered only against Forsythe.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. Evidence Code section 1101, subdivision (b) was amended by Statutes 1986, chapter 1432, section 1 to read as follows: \"Nothing in this section prohibits the admission of evidence that a person committed a crime, civil wrong, or other act when relevant to prove some fact (such as motive, opportunity, intent, preparation, plan, knowledge, identity, absence of mistake or accident, or whether a defendant in a prosecution for an unlawful sexual act or attempted unlawful sexual act did not reasonably and in good faith believe that the victim consented) other than his or her disposition to commit such an act.\" Section 2 of Statutes 1986, chapter 1432, provides: \"It is the intent of the Legislature in enacting this act to clarify the holding in People v. Tassell, 36 Cal. 3d 77, to the extent an inference can be drawn from that holding that evidence of another act is ipso facto inadmissible or irrelevant to the issue of a defendant's reasonable and good faith belief that the victim consented, by rejecting that inference and making it clear that that evidence can be relevant on that issue in a particular case, depending upon the circumstances there present.\" This clarification of Tassell does not affect that case's application to the instant case.\u003c/span\u003e\n\n",
    "body_length": 203162,
    "citedas": [
      "273 Cal. Rptr. 757",
      "223 Cal. App. 3d 606"
    ],
    "attorneys": "Michael Snedeker, Richard Phillips, Richard Power, Kyle Gee, Cynthia A. Thomas, Laurance S. Smith and Robert Fiedler, under appointments by the Court of Appeal, for Defendants and Appellants. John K. Van de Kamp, Attorney General, Arnold O. Overoye, Chief Assistant Attorney General, Jane N. Kirkland, Assistant Attorney General, Roger E. Venturi and Thomas F. Gede, Deputy Attorneys General, for Plaintiff and Respondent.",
    "category": [
      "75"
    ],
    "judges": "Opinion by Best, J., with Martin, Acting P. J., and Vartabedian, J., concurring.",
    "citation_count": 0
  }
}
