{
  "id": "wbf0TWYBTlTomsSBAIS3",
  "document": {
    "title": "North Carolina v. Artis",
    "full_title": "STATE OF NORTH CAROLINA v. ROSCOE ARTIS",
    "jurisdiction": "Supreme Court of North Carolina",
    "date": "1989-10-05T00:00:00.000Z",
    "docket": "No. 504A84",
    "body": "Defendant was convicted of murder in the first degree of Joann Brockman and sentenced to death. Our review of the guilt and penalty phases of his trial reveals no prejudicial error.\n\nEvidence adduced by both defendant and the state at defendant's trial tended to show the following events occurring in Red Springs on 22 October 1983:\n\nOn that day at about 9:30 a.m., the victim's aunt, Alice McLaughlin, observed defendant walking up the road towards Joann's home. Mrs. McLaughlin watched defendant knock on Joann's door and subsequently enter. About an hour later, Mrs. McLaughlin saw defendant and Joann leave the latter's house and walk past her own house in the direction of a shopping center. Shortly thereafter, Mrs. McLaughlin saw her brother, Curtis McKinnon,\n\ntracing the same route towards the shopping center. He testified that he walked past defendant and Joann, who were sitting under a pear tree, arguing. Mr. McKinnon testified that he ran into his brother-in-law, Johnny Haywood, at the shopping center. Mr. Haywood drove back towards the pear tree around 11:30 but saw no one. Shortly after she saw McKinnon walk past her house, Mrs. McLaughlin heard Joann call \"help\" three times. But because she had known Joann to \"cut the fool\" a lot, Mrs. McLaughlin did not respond to the cries.\n\nSometime later, Mrs. McLaughlin saw defendant walking back towards Joann's house. He stopped to ask Mrs. McLaughlin if she had seen Joann. She answered that the last time she had seen her niece was when she was with defendant. Defendant continued towards Joann's house and approached the door, but neither knocked nor entered. He turned around and headed back the way he had come. Mr. McKinnon, who by now had returned home by way of the pear tree, where he had neither seen nor heard anyone, also witnessed defendant's approach to and departure from Joann's door.\n\nJoann's fiance, David Moore, returned from work around 3:00 p.m. He was concerned about Joann's absence and went looking for her with Curtis McKinnon. The two found Joann's wig and shoes near some buildings not far from the pear tree. They called Joann's mother and contacted the police to report that Joann was missing.\n\nIn the early evening, Joann's mother, Johnny Haywood, and Deputy Sheriff McLean searched the area near the pear tree and eventually came upon Joann's body partially covered with dirt and brush. Except for a sweater and bra pushed up above her breasts, Joann's body was naked. There was blood on her nose and mouth, on her sweater, and a film of blood on her hands.\n\nAn autopsy revealed that although there was a large bruise on Joann's forehead, this had not resulted in a skull fracture nor had it been fatal. Abrasions on her neck, hemorrhaging in the connective tissue around the windpipe, and lungs full of fluid indicated that the cause of death had been asphyxia due to manual strangulation. In addition, the vagina was dilated, consistent with Joann's having died during sexual intercourse.\n\nAt defendant's trial, the state offered three statements made by defendant the night and early morning following the discovery\n\nof Joann's body. The first of these statements, which had been preceded by defendant's being read Miranda warnings and signing a waiver of rights form, was exculpatory. Defendant later testified that he had not made the subsequent, inculpatory statements, and he denied their truth.\n\nThe first statement was transcribed at around 10:00 p.m. In this statement defendant said he had come back to his sister's house at dawn from an all-night spree in South Carolina. He had gone to sleep at 6:00 a.m., awakened at 8:30, and walked up to the store with his sister and her boyfriend around 9:00 a.m. At 9:30 he bought some peppermint schnapps and drank it all, pitching the bottle into a field behind a grocery store. (The officers' search for the bottle proved fruitless.) Defendant had then walked to Joann's house, meeting her aunt on the way, but had found the door chained. He neither knocked nor entered, but turned around and walked back to his sister's house, where he slept from 10:30 till 4:00 p.m., when the police came and picked him up.\n\nDefendant was questioned again near midnight regarding blood on his shirt. This, defendant initially said, was chicken blood. He offered his shirt to officers for testing, then admitted that it was not chicken blood, but Joann's. He told officers where they could find Joann's pants and agreed to accompany officers to the scene where he had last been with her. He indicated how she had been lying when he left her, which coincided exactly with the position of her body when found that afternoon, and located her pants under a piece of tin where he had left them. When defendant returned with the officers to the police station at approximately 1:00 a.m., he was interviewed once more, resulting in the following inculpatory statement, the transcription of which was completed by 3:00 a.m.:\n\nI went to the liquor store in Red Springs about 9:30 a.m., 10-22-83. I was walking. I bought a pint of Peppermint Schnapps for $3.45 from the black dude at the liquor store. I walked over behind the Food Lion Store and I drank about two thirds of the pint. I took the rest of the liquor and stuck it in my belt.\n\nI walked down the dirt road after that, towards Joanne's house. I think her last name is Brockman, or something like that. I first went by Joanne's aunt's house. I saw her aunt standing in the yard. I hollered and asked her aunt if Joanne\n\nwas home. Her aunt said she didn't know, that Joanne had gone out but she didn't know if she had come home or not.\n\nI went to Joanne's house and knocked on the door. Joanne came to the door. Joanne had told me to come in, long time no see. We sit down and started talking. Joanne wanted a drink of that liquor I had. Joanne drank the rest of the liquor that I had. Joanne said, \"I want you to be my main man.\" I have been messing around with Joanne for some time.\n\nJoanne wanted me to go outside and get some old shingles to burn on the fire. I went outside and got an old tire and put it on the fire. I asked Joanne if we were going to do anything. Joanne asked me if I wanted to and I told her yeah. I got in the bed and I had sex with Joanne. Joanne got up afterwards and she took a bath.\n\nAfter that, Joanne asked me to give her ten dollars, because there was some stuff at the store she wanted. I gave Joanne a ten-dollar bill and she put it in her bra.\n\nAfter that, me and Joanne left the house, walking towards the store. We walked passed [sic] her aunt's house on the way. We were talking and Joanne said something about this man she was seeing in Lumberton. I asked Joanne who he was and she told me it weren't none of my business. I told her I had give her my money. She said, \"Yeah, and you going to give me some more of your money.\" Joanne called me a few words and she made me mad, because I was pretty high at the time.\n\nI grabbed Joanne by the arm and told her to let's go over there near the barn, on the right side of the road, and sit down and talk. I wanted to whip her, but I didn't want to hurt her. Joanne said, \"I ain't going no damn where with you.\"\n\nI grabbed Joanne by her arm and drug her over to the back of the barn to the corner. We sit down at the back of the barn and we talked a while. Joanne started talking about this guy in Lumberton again, and it made me mad. Joanne said she was going out with him tonight. We stood up and I reached down on the ground and picked up a big stick and I hit her side of the head. The stick was about as big around as my wrist. The stick was about three or four feet long.\n\nAfter I hit her, she said I didn't love her. I grabbed Joanne by the arm and snatched her. I was going to take her over to where she was found and beat her again. Joanne was pulling away from me, and I was dragging her. She lost a wig she had on and her shoes. I drug Joanne over to where she was found at, and I still had the stick in my hand.\n\nWhen me and Joanne were arguing about the man in Lumberton, on the dirt road, she took out something and told me she would cut my ass. I don't know if it was a knife or a fingernail file. I didn't take Joanne to be serious because I didn't believe she would cut me. After that, I never did see the knife or fingernail file again. Joanne had the knife or finger file inside a small, round black bag with a shoulder strap.\n\nWhen I drug Joanne over to where she was found, I asked her if she was going to give me a little bit. She told me no, she was going to give it to that guy in Lumberton. I got mad and I took the stick and hit her in the head real hard. When I hit Joanne, she fell to the ground on her side. I asked Joanne again if she was going to give me some. Joanne said no again. Joanne was still laying on her left side, and I was standing to the left of her. I hit Joanne again with the stick and I hit her pretty hard. After that, Joanne didn't move any more.\n\nBefore I hit her at the second place I took her, I told Joanne to take her clothes off. I guess she took them off because she was scared of me. Joanne was wearing jeans and she took them off. She was wearing a white sweater, but I don't know if she took it off or not. She didn't have any panties on.\n\nAfter I hit Joanne the last time with the stick, she was still laying on her side. I turned her over on her back. I dropped my pants down around my knees. I took my penis and put it inside Joanne, between her legs. I had sex with Joanne for about five minutes. I didn't feel right, so I got up. I didn't come inside or outside of her.\n\nJoanne had not said anything since I hit her the last time, and she was breathing kind of hard. I pulled my pants back up. I thought Joanne was dying. I called Joanne a couple\n\nof times after I pulled my pants up, but she wouldn't say anything.\n\nI took the stick I had and threw it away, toward the old white looking house, in the bushes. After that, I tried to cover Joanne up. I threw leaves and dirt on top of her, but I didn't put that much on her. After that, I took her jeans and hid them under a piece of tin, back towards the hold barn. That is the same pair of jeans that I showed to you and Detective Garth Locklear under the piece of tin.\n\nAfter I hid the jeans, I walked to my house and went to bed and went to sleep. I woke up about something after 4:00. I stayed there at the house until James McLean came there.\n\nDefendant completed a third, briefer statement at 3:10 a.m. in which he admitted that he had killed Joann Brockman, that he had been advised of and understood his rights, and that he had voluntarily assisted officers in finding Joann's body and pants. Despite these statements, defendant testified that he had not volunteered either inculpatory statement, explaining that the officers had answered their own questions and that his signatures on the waiver of rights form and on the 3:00 a.m. statement had been affixed to blank papers or to receipts for his clothes.\n\nDefendant's testimony, like his first statement, was exculpatory. He related that after buying a pint of peppermint schnapps shortly after 9:00 a.m., he had gone to Joann's house. Another man was already there sitting on the foot of the bed. While defendant went to find fuel and made up the fire, the other man left. Defendant testified that he had then had intercourse with Joann, that he had given her fifteen dollars and left. She followed him and walked with him to a barn where she stopped to fix her clothes. Defendant came around the barn to find her in partial undress. He laid her pants under a piece of tin at her request. When he stood up, his head was spinning and he saw faces. He took a swing and hit Joann by accident, causing her nose to bleed. He hugged her, apologized, and as he prepared to leave, he was hit in the back by someone from behind. He turned around but saw no one, then ran in the direction of the road. When he looked back at Joann, she was walking from the pear tree towards the barn. His head spinning again, defendant walked to the grocery store and eventually found himself at his sister's house. Defendant testified that he\n\nwas certain his last swig of schnapps had been drugged, but that he knew neither how, with what, nor by whom this had occurred.\n\nThe jury was instructed that it could find defendant guilty of murder in the first degree on the basis of either the felony murder rule or malice, premeditation, and deliberation, or both; guilty of murder in the second degree on the basis of malice, without premeditation and deliberation; or not guilty. The jury returned a verdict of guilty of murder in the first degree on both bases and, following a sentencing hearing, recommended a sentence of death.\n\nGuilt Phase\n\nDefendant first contends that the trial court's refusal prior to and throughout jury selection to substitute defendant's proffered jury instructions for the preliminary pattern jury instructions, N.C.P.I. Crim. 106.10, deprived him of the opportunity to select a fair, impartial jury. On two occasions during the jury selection process, the trial court charged the jurors that in a capital case there are two proceedings, and that in the first they must determine only whether the defendant is guilty of the offense charged or of any lesser included offenses. The trial court admonished the jury that its only concern in the first part of the trial was to resolve the question of guilt, and that the sentencing proceeding, which would follow if the defendant was convicted, might use another jury and would be preceded by separate jury instructions.\n\nDefendant requested that the trial court instruct the jury more specifically regarding the procedures of a capital trial, including an explanation that aggravating circumstances must be proved by the state beyond a reasonable doubt, that mitigating circumstances may be shown by defendant, and that the aggravating circumstances must be weighed against mitigating circumstances to determine whether the former were sufficiently substantial, beyond a reasonable doubt, to impose the death penalty.\n\nDefendant now contends it was error for the trial court to refuse this request, reasoning that his proffered instructions were critical to the selection of an impartial jury because of two misstatements of the law made by the prosecutor and because at least one juror changed his mind about his ability to consider imposing the death penalty based, defendant surmises, upon imperfect information. Defendant suggests that the members of the\n\nvenire were compelled to consider their attitudes towards the death penalty in a vacuum -- without information as to sentencing procedures that would enable them to answer accurately inquiries about those attitudes. As a result, defendant contends, those jurors who might hesitate before imposing a sentence of death were those who, in their ignorance of the sentencing process, expressed misgivings about their ability to impose the death penalty and who, for that reason, were excused for cause. He argues that this produced \"a jury uncommonly willing to condemn a man to die\" in violation of defendant's constitutional right to a fair and impartial jury. Witherspoon v. Illinois, 391 U.S. 510, 521, 20 L. Ed. 2d. 776, 784, reh'g denied, 393 U.S. 898, 21 L. Ed. 2d. 186 (1968).\n\nThe purpose of the pattern jury instruction, N.C.P.I. Crim. 106.10, is to explain the bifurcated nature of first-degree murder trials and to limit the jury's attention to consideration of issues concerned with the guilt phase of the trial. State v. Harris, 323 N.C. 112, 371 S.E.2d 689 (1988). To instruct the jurors, in addition, about the sentencing process of weighing aggravating circumstances against mitigating circumstances would have invited the following dangers: it might be fruitless, as the sentencing jury is not always composed of the same individuals as the guilt-phase jury; it might be distracting, as the function of the jury during the guilt phase is to determine the guilt or innocence of the defendant, not to be concerned about his penalty; and it could have a prejudicial effect, suggesting to the jury that the second stage in the trial will assuredly be reached, presupposing defendant's guilt.\n\nFurthermore, the trial judge has broad discretion in supervising jury selection to the end that both the state and the defendant may receive a fair trial. State v. Nelson, 298 N.C. 573, 260 S.E.2d 629 (1979), cert. denied sub nom., Jolly v. North Carolina, 446 U.S. 929, 64 L. Ed. 2d. 282 (1980). Reversible error can be shown only where the defendant establishes both that the trial judge abused her discretion and that he suffered prejudice as a result of such abuse. State v. Banks, 295 N.C. 399, 245 S.E.2d 743 (1978). Given the danger of distraction and prejudice and the desirability of uniform jury instructions for all trials, despite the unique features of each, we find no abuse of the trial court's discretion in relying upon the appropriate pattern jury instructions to inform the jury on voir dire. In addition, as we have noted, the trial court's refusal to exercise defendant's modification to the pattern jury instructions\n\nwas at least as likely to avoid prejudice to defendant as it was to enhance it.\n\nIronically, although the trial court refused to instruct the jury as to the mechanics of the sentencing procedure, the prosecutor asked a question of one potential juror substantially paralleling the instruction defendant had requested the trial court to give. To this question defendant objected, and the trial court responded with a brief reiteration of the pattern jury instruction, reminding the jury of its more focused responsibility in the guilt-innocence phase of the trial. This was not error. Although defendant accurately notes two other instances in which the prosecutor incorrectly stated the law, indicating at one point, for example, that an imbalance of aggravating over mitigating circumstances might \"mandate\" the death penalty, defendant failed to object to these misstatements, and his failure to do so constitutes waiver of such error on appeal. State v. Oliver, 309 N.C. 326, 307 S.E.2d 304 (1983). Moreover, the form and extent of counsels' inquiries in the voir dire examination of jurors is within the sound discretion of the trial court. State v. Johnson, 317 N.C. 343, 346 S.E.2d 596 (1986). We perceive no abuse of that discretion in permitting the state the wide latitude ordinarily accorded counsel in voir dire examination of jurors. Id.\n\nDefendant also contends that the jury selected was slanted in favor of the death penalty not only because of the trial court's refusal to charge the venire with defendant's proffered instruction, but also because of questions the court permitted the prosecutor to ask the venire without allowing similar latitude to questions posed by defendant's counsel. In so contending, defendant unjustifiably \"seeks to invade the discretionary power of the trial judge's duty to supervise and control the course of the trial.\" State v. Adcock, 310 N.C. 1, 11, 310 S.E.2d 587, 593-94 (1984). The record reflects no gross imbalance in the trial court's responses to defendant's inquiries as opposed to those of the prosecutor. More notable is the fact that the prosecutor objected more frequently to defendant's inquiries, drawing rulings from the bench, whereas defendant seized fewer opportunities to object, failing to alert the trial court to errors of which he now complains. See State v. Black, 308 N.C. 736, 303 S.E.2d 804 (1983). Again, there was no abuse of the broad discretion allowed the trial court in supervising jury selection, State v. Allen, 323 N.C. 208, 372 S.E.2d 855 (1988), including that governing the inquiries of counsel. Johnson, 317 N.C. 343, 346 S.E.2d 596.\n\nDefendant also assigns error in the process of jury selection to a private conversation between the trial court and a juror. The juror responded to the trial court's question whether any problems had developed with any of the jurors, and she was consequently invited to the court's chambers. The trial court later conducted an in camera hearing in the presence of counsel and the court reporter. Defendant contends that his absence from this \"reopened voir dire\" entitles him to a new trial because of his right to be present at every stage of his trial, as guaranteed by article I, section 23 of the Constitution of North Carolina and the sixth amendment to the Constitution of the United States. See State v. Payne, 320 N.C. 138, 357 S.E.2d 612 (1987).\n\nAlthough defendant failed to object at the hearing, excepting only to the ultimate removal of the juror from the panel, this Court has held that the right of an accused to be present at every stage of his trial upon an indictment charging him with a capital felony is not waivable. State v. Moore, 275 N.C. 198, 166 S.E.2d 652 (1969).\n\nIt is clearly error for the trial court to communicate with a juror in chambers and in the absence of the defendant, counsel, or a court reporter. Payne, 320 N.C. 138, 357 S.E.2d 612. However, not every violation of a constitutional right is prejudicial, and in this case the error was harmless beyond a reasonable doubt. The record of the in camera hearing reflects the benign substance of the conversation -- the juror's growing unease with her ability to impose the death penalty. There being \"no indication of record to the contrary, we must assume that the trial court caused the record to speak the complete truth in this regard.\" Payne, 320 N.C. at 139, 357 S.E.2d at 612. Moreover, the juror was thereafter promptly and properly removed for cause, obviating the possibility that anything said to her privately by the trial court might infect the jury as a whole. This action was proper under North Carolina law, which authorizes the trial court to remove an impaneled juror \"before final submission of the case to the jury\" if that juror \"becomes incapacitated or disqualified, or is discharged for any other reason.\" N.C.G.S. § 15A-1215(a)(1988). Such decisions relating to the competency and service of jurors are within the broad discretion of the trial court and are not reviewable on appeal absent a showing of abuse of discretion or legal error. State v. McLaughlin, 323 N.C. 68, 372 S.E.2d 49 (1988). It is within the trial court's discretion to reopen examination of a juror previously accepted by both parties. {PA}\n\nPage 298} State v. Freeman, 314 N.C. 432, 333 S.E.2d 743 (1985). In State v. Barts, 316 N.C. 666, 343 S.E.2d 828 (1986), this Court specifically found no abuse of the trial court's discretion nor any impropriety in excusing for cause a juror who, like the juror here, belatedly discovered she would be unable or unwilling to follow the law and her oath with regard to imposing the death penalty. Likewise, we find no abuse of discretion or impropriety in the trial court's action in this case.\n\nDefendant next assigns error to the admission of testimony from Billie Ann Woods, who was called by the state to describe defendant's conduct towards her the night of 13 December 1974, nearly ten years before this trial. This incident led to a conviction for assault on a female, a fact that defendant's own counsel later raised on direct examination of defendant himself. By doing so defendant cannot be heard to complain about the admission of the testimony recounting the events leading to that conviction. See State v. Wright, 282 N.C. 364, 192 S.E.2d 818 (1972). We elect nonetheless to appraise the merits of the assigned error because of our practice to review death cases scrupulously in order to show affirmatively that all proper safeguards have been afforded the defendant. State v. McKoy, 323 N.C. 1, 372 S.E.2d 12 (1988), cert. granted, U.S. , 103 L. Ed. 2d. 180 (1989).\n\nThe trial court prefaced the bulk of Ms. Woods' testimony with a warning to the jury that the witness' testimony was to be received and considered only for the purpose of showing motive, intent, and scienter on the part of defendant.\n\nMs. Woods testified that at the time of the incident she was sixteen years old. She related that on the way from her parents' apartment to the store she was approached by defendant, that he grabbed her from behind by the arm and told her she was \"going to the woods\" with him. She responded, \"No, I ain't.\" Defendant insisted, \"You're going to give me some,\" and threw her onto the ground, straddled her, put his hands around her throat, and started choking her. Ms. Woods testified that she started saying \"I will, I'll go,\" but defendant continued to choke her, saying, \"No, I'm just going to kill you, now.\" As long as she could breathe, Ms. Woods recounted, she told defendant she would accompany him to the woods, hoping that he would believe her to be sincere and let go of her. The choking continued, however, and she started to lose her breath and was convinced she was dying. Fortuitously,\n\na friend of her sister's walked by and spoke to defendant, prompting him to jump up and say to Ms. Woods, \"What's wrong with you, girl, are you crazy?\" As she ran towards the store, Ms. Woods heard defendant yell after her, \"Give me my money back!\" She testified that she had not that night or any other time received money from defendant.\n\nEvidence of prior offenses by a defendant is \"inadmissible on the issue of guilt if its only relevancy is to show the character of the accused or his disposition to commit an offense of the nature of the one charged.\" State v. Young, 317 N.C. 396, 412, 346 S.E.2d 626, 635 (1986). This rule is codified as N.C.R. Evid. 404(b). Such evidence is admissible, however, if it tends to prove any other relevant fact, \"such as proof of motive, opportunity, intent, preparation, plan, knowledge, identity, or absence of mistake, entrapment or accident.\" N.C.G.S. § 8C-1, Rule 404(b)(1988). The exception is grounded in the logic of inferring from the sequence of events comprising an offense or from its particular features that the same person committed the offense more than once, aware on at least the latter occasion of its consequences. When the state seeks to introduce evidence of prior, similar sex offenses by a defendant, this Court has been markedly liberal in admitting such evidence for the purposes cited in Rule 404(b). State v. Cotton, 318 N.C. 663, 351 S.E.2d 277 (1987).\n\nThe use of evidence as permitted under Rule 404(b) is guided by two constraints: similarity and temporal proximity. When the features of the earlier act are dissimilar from those of the offense with which the defendant is currently charged, such evidence lacks probative value. When otherwise similar offenses are distanced by significant stretches of time, commonalities become less striking, and the probative value of the analogy attaches less to the acts than to the character of the actor.\n\nEvidence of other crimes must be connected by point of time and circumstance. Through this commonality, proof of one act may reasonably prove a second. However, the passage of time between the commission of the two acts slowly erodes the commonality between them. . . . Admission of other crimes at that point allows the jury to convict defendant because of the kind of person he is, rather than because the evidence discloses, beyond a reasonable doubt, that he committed the offense charged.\n\n{PA}\n\nPage 300} State v. Jones, 322 N.C. 585, 590, 369 S.E.2d 822, 824 (1988). Attenuated by time, the pertinence of evidence of prior offenses attaches to the defendant's character rather than to the offense for which he is on trial. In other words, remoteness in time tends to diminish the probative value of the evidence and enhance its tendency to prejudice.\n\nDefendant's attack on Ms. Woods ten years before his trial for the murder of Joann Brockman was characterized by an apparent attempted rape, the initiation of manual strangulation, and defendant's stated intent to kill Ms. Woods. Medical evidence established that Joann Brockman had been raped and killed by manual strangulation. These similarities support the relevancy of Ms. Woods' testimony as to the prior offense.\n\nWhether ten years' remoteness so erodes the commonalities between the two offenses that the probative value of Ms. Woods' testimony is outweighed by its tendency to prejudice is arguable. Assuming without deciding that it was error to admit that testimony, there is no reasonable possibility that, had the error not been committed, a different result would have been reached at defendant's trial. N.C.G.S. § 15A-1443(a)(1988). Defendant's statement to police officers that he hit Joann with a stick, felling her, and that he had intercourse with her while her breathing was labored and although she was no longer moving is overwhelming evidence of his guilt. Any prejudicial impact of Ms. Woods' testimony concerning defendant's attempt at a similar assault upon her would have been wholly eclipsed by the damning nature of defendant's own words.\n\nDefendant also takes issue with that portion of the trial court's final instructions in which the jury was charged that Billie Ann Woods' testimony could be considered to show defendant's motive for the murder of Joann Brockman, his intent to commit that murder, and his scienter regarding the consequences of his attack on her. Because defendant failed to object to this alleged error, this Court's review is guided by the \"plain error\" analysis, whereby the burden on defendant to show prejudice is even greater than that imposed by N.C.G.S. § 15A-1443. State v. Walker, 316 N.C. 33, 340 S.E.2d 80 (1986). Again, assuming error arguendo, defendant's failure to show a reasonable possibility that, had Ms. Woods' testimony not been admitted, a different result would have been reached at his\n\ntrial implies, a fortiori, that he failed to bear the even heavier burden imposed by the test for plain error.\n\nDefendant also assigns error to the trial court's failure to sustain his objections to portions of the prosecutor's closing argument concerning Ms. Woods' testimony. Defendant contends that, despite the prosecutor's repeated emphasis on similar motive, intent, and modus operandi exhibited in the assault on Ms. Woods and in the evidence concerning the circumstances of Joann Brockman's death, the \"tenor\" of the prosecutor's argument suggested an emphasis on character.\n\nWe decline defendant's invitation to read between the lines of the prosecutor's argument and so to indulge in speculative analysis of its stylistic subtleties. Our scrutiny of the passages to which defendant objected reveals no such excesses as arguing facts not in evidence or uttering remarks calculated to mislead or prejudice the jury. See, e.g., State v. Monk, 286 N.C. 509, 212 S.E.2d 125 (1975). The record reveals that the prosecutor took no liberties falling improperly outside the wide latitude allowed parties in closing argument. State v. Lynch, 300 N.C. 534, 268 S.E.2d 161 (1980). Defendant's assignments of error regarding this issue are thus overruled.\n\nDefendant next asserts it was error for the trial court to deny his motion to dismiss the charge of murder in the first degree because the evidence was insufficient to prove a premeditated and deliberate killing. In ruling on a motion to dismiss, both the trial court and the reviewing court must consider the evidence in the light most favorable to the state, and the state is entitled to every reasonable inference to be drawn from the evidence. State v. Bullard, 312 N.C. 129, 322 S.E.2d 370 (1984); State v. Stephens, 244 N.C. 380, 93 S.E.2d 431 (1956). If there is any evidence that tends to prove the fact in issue or that reasonably supports a logical and legitimate deduction as to the existence of that fact and does not merely raise a suspicion or conjecture regarding it, then it is proper to submit the case to the jury. State v. Johnson, 199 N.C. 429, 154 S.E. 730 (1930). For purposes of appellate review, if the record discloses substantial evidence of all material elements constituting the offense for which the accused was tried, then the trial court's ruling is to be affirmed. \"'Substantial evidence' is that amount of relevant evidence that a reasonable mind might accept as sufficient to support a conclusion.\" State v. Corn, 303 N.C. 293, 296, 278 S.E.2d 221, 223 (1981).\n\nIn the case of murder in the first degree based upon premeditation and deliberation, there must be substantial evidence before the jury from which it could determine that the defendant killed his victim with malice, premeditation, and deliberation. Id. Premeditation and deliberation ordinarily must be proved by circumstantial evidence, such as the absence of provocation by the victim, the conduct of the defendant before and after the killing, ill will or other difficulties between the parties, or evidence that the killing was done in a brutal manner. Bullard, 312 N.C. 129, 322 S.E.2d 370.\n\nDefendant argues that no such circumstantial evidence of premeditation and deliberation existed, suggesting that he \"simply acted violently during the passions of sexual activity in a sudden turn of events.\" Defendant tenders the viewpoint that: 1) Joann's calling for help was insufficient circumstantial evidence of ill will, and Curtis McKinnon's testimony regarding defendant's and Joann's raised voices did not prove argument or bad feeling; 2) the force used, while lethal, was not grossly excessive, it being somehow less brutal to die during the act of intercourse than pursuant to some other murderous scheme; 3) being strangled while engaged in intercourse does not establish premeditation; 4) deliberation is lacking if the victim is killed in the midst of intercourse, a passion-filled event; and 5) neither the opportunity nor the ability to reflect or deliberate was present under the circumstances of this amorous encounter.\n\nDefendant's perception of the evidence strains its facts. Together, defendant's own statements and the testimony of Curtis McKinnon amply established the fact that defendant and Joann were arguing vehemently shortly before her death. Defendant admitted striking her with a stick as thick as his wrist bringing her to the ground, then dragging her so forcefully to another spot that she lost her shoes and her wig. Defendant admitted that he told Joann to take her clothes off and that she complied out of fear. He admitted he then hit her in the head with the stick so hard that she no longer moved. He positioned her body in order to force intercourse with her, heard her labored breathing, and stopped only when it \"didn't feel right,\" and it occurred to him that she was dying. Medical evidence established that Joann died of manual strangulation in the midst of sexual intercourse. Although defendant's first statement did not indicate that it was his own hands that were causing Joann to be \"breathing kind of hard,\" there is ample evidence from which the jury could infer not only\n\nthat fact but the specific intent to kill that accompanied it. If these acts of brutality were not enough circumstantially tending to prove a premeditated and deliberate killing, then defendant's callous and calculating acts of scattering dirt and leaves on Joann's body, of hiding Joann's jeans, and of going home to bed rather than seeking medical assistance, surely do. This and other substantial evidence was before the jury showing the elements of murder in the first degree and that defendant committed that murder, and the trial court emphatically did not err in denying defendant's motion to dismiss the underlying charge.\n\nDefendant next contends that after a voir dire the trial court erred in refusing to admit certain documentary and testimonial evidence. This included a letter received by defendant's sister and testimony by defendant that when he first met Joann Brockman in May 1983 he heard her say to her mother that she was going to get killed if \"the people\" ever caught up with her. This testimony was uncorroborated, either by Joann's mother or by her aunt, who, according to defendant, was present when the remark was made. The trial court disallowed this testimony as irrelevant. The contents of the letter were not admitted into evidence. The letter was sealed and preserved for purposes of this appeal.\n\nEvidence having \" any tendency to make the existence of any fact that is of consequence to the determination of the action more probable or less probable than it would be without the evidence\" is considered relevant. State v. McElrath, 322 N.C. 1, 13, 366 S.E.2d 442, 449 (1988); N.C.G.S. § 8C-1, Rule 401 (1988). However, hearsay evidence, even if relevant, is inadmissible unless it is covered by statutory exception, see N.C.G.S. § 8C-1, Rule 802 (1988), or unless its exclusion deprives a defendant of \"a trial in accord with fundamental standards of due process.\" State v. Barts, 321 N.C. 170, 180, 362 S.E.2d 235, 240 (1987).\n\nThe letter's anonymous author stated that defendant was not responsible for Joann Brockman's death, but that her death had been the result of a \"contract\" being placed on her life because she had not paid declarant a $5.00 debt. Both the victim's statement to her mother and the letter received by defendant's sister were hearsay, offered by a person other than the declarant to prove the truth of the matter asserted -- to wit, that it was not defendant but another who killed Joann Brockman. N.C.G.S. § 8C-1, Rule 801 (1988). Neither the statement nor the letter fits into any category\n\nof exception under Rule 803 or Rule 804(b). Although defendant suggests that Joann's May remark is admissible under the Rule 803(3) exception as a \"then existing state of mind, emotion, sensation, or physical condition,\" such a remark, if uttered, is plainly a \"statement of . . . belief to prove the fact . . . believed,\" which is specifically excluded from that exception. Id. Furthermore, five months' remoteness from the time of her death significantly erodes the relevance of any remark concerning the declarant's state of mind.\n\nThe letter does not come within the exception of Rule 804. The writer of the anonymous letter does not come within the statutory definition of being \"unavailable as a witness.\" There is no evidence in the record to support a finding that the writer (\"declarant\") was exempted from testifying; or refused to testify; or had a lack of memory; or was dead or physically or mentally unable to testify; or was absent from the hearing and defendant was unable to procure his attendance or testimony by process or other reasonable means. N.C.G.S. § 8C-1, Rule 804(a) (1988). This is true because the writer is unknown, and therefore there is no evidence as to his or her availability as a witness. The defendant, as the proponent of the evidence, bears the burden of satisfying the requirements of unavailability under the rule. See State v. Highsmith, 74 N.C. App. 96, 327 S.E.2d 628, disc. rev. denied, 314 N.C. 119, 332 S.E.2d 486 (1985).\n\nFurther, the anonymous letter is not a declaration against interest because the declarant is unknown. In order for a statement to be a declaration against interest, the statement must expose the declarant to criminal liability. Rule 804(b)(3) (1988). Where the declarant conceals or hides his identity the statement does not tend to expose him to criminal liability because he is unknown. Under circumstances where the declarant is unknown, the circumstantial guarantee of reliability is absent because persons may make untrue statements that would be damaging to themselves where they conceal their identity. It is only where the identity of the declarant is revealed in the statement that the guarantee of reliability arises. The statement must actually subject the declarant to criminal liability. State v. Haywood, 295 N.C. 709, 249 S.E.2d 429 (1978); State v. Singleton, 85 N.C. App. 123, 354 S.E.2d 259, cert. denied, 320 N.C. 516, 358 S.E.2d 530 (1987). Without knowledge of the identity of the declarant, the statement does not subject declarant to criminal liability.\n\nThe rule in North Carolina also requires that the declarant must have understood the damaging potential of his statement. State v. Haywood, 295 N.C. 709, 249 S.E.2d 429 (1978). Here, it is plain that the declarant actually believed that the anonymity of the statement shielded him or her from criminal liability. This is evidenced by this excerpt from the statement: \". . . I can not leave no name and if I do it will mess me up . . . .\" Thus, this requirement of the hearsay exception has not been fulfilled, and the statement is inadmissible for this reason.\n\nEven though a written statement may be otherwise admissible as a declaration against interest, it cannot be admitted as evidence until it has been properly authenticated. FCX, Inc. v. Caudill, 85 N.C. App. 272, 354 S.E.2d 767 (1987); see also Guynn v. Corpus Christi Bank and Trust, 589 S.W.2d 764 (Tex. Civ. App. 1979) (telexes were not authenticated, so not admissible as declaration against interest). Here, there is no showing that the letter was properly authenticated, and indeed, could not be so long as the declarant remained unknown. To authenticate a document as a declaration against interest, it must be shown that the person who executed it was the alleged declarant. 5 Wigmore, Evidence § 1472 (Chadbourn rev. 1974). Without proper authentication, the letter cannot be admitted under Rule 804.\n\nThis letter, a statement theoretically tending to expose its anonymous declarant to criminal liability, is not admissible unless corroborating circumstances clearly indicate its trustworthiness. N.C.G.S. § 8C-1, Rule 804(b)(3) (1988). Such indicia must include, for example, \"the potential of actually jeopardizing the personal liberty of the declarant at the time it was made and [the declarant's comprehending] the damaging potential of his statement,\" evidence of voluntariness, and \"facts and circumstances surrounding the commission of the crime and the making of the declaration . . . corroborat[ing] the declaration and indicat[ing] the probability of trustworthiness.\" State v. Haywood, 295 N.C. 709, 730, 249 S.E.2d 429, 442 (1978). These are absent.\n\nMention of the victim's May remark occurred only in defendant's testimony. The letter similarly stands isolated from any other evidence that might vouch for its trustworthiness. Only the letter tends to corroborate the remark and vice versa. Such bootstrapping does not provide an adequate guarantee of the trustworthiness of either piece of evidence. Without some other independent, nonhearsay\n\nindication of the trustworthiness of either the remark or the letter, each was properly barred as inadmissible hearsay. The trial court's proper application of the hearsay rule bore no affront to the \"ends of justice\" under these circumstances. Cf. Barts, 321 N.C. 170, 180, 362 S.E.2d 235, 240 (quoting Chambers v. Mississippi, 410 U.S. 284, 302, 35 L. Ed. 2d. 297, 313 (1973)).\n\nDefendant complains in addition that the testimony of a clinical psychologist concerning the results of an I.Q. test he had administered to defendant was erroneously excluded, although this testimony was in fact belatedly admitted. The objective of introducing this testimony was \"to show that as [defendant] is talked to and he makes responses [as] he is questioned, that his intellectual capacity would need to be considered to gauge his responses by.\" Defendant explains on appeal that evidence as to his I.Q. would have affected the jury's understanding of his responses to interrogation leading to his inculpatory statements. Further, he urges, such testimony was admissible under State v. Shank, 322 N.C. 243, 367 S.E.2d 639 (1988), as evidence relevant to the jury's determination of whether defendant was capable of premeditation and deliberation.\n\nAlthough the psychologist's testimony was excluded when first proffered, it was admitted in its entirety subsequent to defendant's own testimony. Under such circumstances defendant's assignment of error is baseless. Even if it had been error initially to exclude the psychiatrist's testimony, this was subsequently cured by its admission, and defendant makes no argument that he was in the least prejudiced by the delay. See N.C.G.S. § 15A-1443(a) (1988).\n\nDefendant's next assignments of error concern the interpretation and application of North Carolina Rule of Evidence 609, which governs the use of evidence of a criminal conviction for purposes of impeachment. The rule provides, inter alia, that evidence that the witness has been convicted of a crime punishable by more than sixty days confinement is admissible for purposes of attacking his credibility unless a period of more than ten years has elapsed since the date of the conviction or of the release from incarceration whichever occurs later. The use of evidence of convictions of more than ten years is permitted, but only when \"the court determines, in the interests of justice, that the probative value of the conviction supported by specific facts and circumstances substantially outweighs its prejudicial effect.\" N.C.G.S. § 8C-1, Rule 609(b) (1988). An analysis of the legislative history behind the identical Federal Rule 609(b)\n\nreveals that it rests upon a rebuttable presumption that prior convictions more than ten years old tend to be more prejudicial to a defendant's defense than probative of his general character for truthfulness, and that they should therefore not be admitted into evidence. State v. Blankenship, 89 N.C. App. 465, 366 S.E.2d 509 (1988).\n\nWhen the state asked defendant on cross-examination about having been tried and convicted of assault on a female with intent to commit rape in 1957, the trial court dismissed the jury and conducted a hearing ex mero motu. The court analyzed a number of convictions antedating the time of defendant's trial by a period exceeding ten years and found, in accord with N.C.R. Evid. Rule 609(b),\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e that the state had properly notified defendant of its intent to cross-examine him about these offenses. The court disallowed cross-examination regarding a larceny and an escape in 1961, but, expressing its conclusion in the language of Rule 609, it permitted the state to proceed with questions concerning the two other convictions:\n\nI do find that the assault on a female with intent to commit rape in 1957, and the assault on a female, 1967, have a sufficient connection, supported by facts and circumstances, to outweigh any prejudicial effect.\n\nThe trial court consequently permitted the state to cross-examine defendant regarding these two dated assaults, as well as regarding a number of more recent convictions.\n\nThe trial court's determination that defendant's convictions for assault on a female and assault on a female with intent to commit rape were admissible was erroneous. Specific facts and circumstances supporting the probative value of this evidence are neither apparent from the record nor recounted by the trial court. The trial court failed to comply with Rule 609 by identifying any fact or circumstance indicating that this evidence was probative of defendant's credibility.\n\nDefendant failed to object either to the trial court's conclusion or to the introduction of this evidence in the context of the state's cross-examination. Failure to object as required by N.C.R. App. P. 10(b)(1) constitutes waiver of the right to assert error on appeal. E.g., State v. Oliver, 309 N.C. 326, 307 S.E.2d 304. Even under appellate review under this Court's duty to see justice done, State v. Black, 308 N.C. 736, 303 S.E.2d 804 (Martin, J., concurring), or reviewed as \"plain error,\" Black, 308 N.C. 736, 303 S.E.2d 804, the evidence introduced precludes any possibility of prejudice. Given the evidentiary weight of guilt borne in defendant's statement alone, there is no possibility the improper admission of the two convictions of assaults on females could have prejudiced defendant in any way, least of all in the jury's verdict. See N.C.G.S. § 15A-1443(b) (1988); Black, 308 N.C. 736, 303 S.E.2d 804. Defendant's assignments of error with regard to this issue are without merit.\n\nThree issues raised by defendant with regard to the guilt-innocence phase of his trial concern alleged errors in the trial court's final charge to the jury. Since defendant objected to none of these instances at trial, this Court must consequently review the alleged errors under the \"plain error\" standard of State v. Odom, 307 N.C. 655, 660-61, 300 S.E.2d 375, 378-79 (1983), by which defendant must convince the appellate court that absent the error, the jury probably would have reached a different verdict. State v. Walker, 316 N.C. 33, 340 S.E.2d 80.\n\nThe first of these alleged errors in the jury charge was the trial court's singling out the testimony of defendant and his sister when it delivered its charge on prior inconsistent statements. Defendant admits the accuracy of applying this charge to these two witnesses, but asserts that the trial court's omitting similar mention of two witnesses for the prosecution constituted an impermissible expression of judicial opinion in violation of N.C.G.S. §§ 15A-1222 and 1232 (1988). Defendant perceives an inconsistency worthy of instruction in the testimony of Alice McLaughlin, who testified that she heard Joann Brockman screaming for help, but who failed to tell this to the officer who later testified in corroboration of her testimony. Defendant also contends that variations in David Moore's estimations of the time he left for work on the day Joann Brockman was killed required the trial court to signal an inconsistency in his prior statement to officers.\n\nThe trial court instructed the jury that prior statements of certain named witnesses had been received as corroboration tending to show that the statements were consistent with their testimony at trial. The court directed the jury to assess these prior statements not for their truth but for their bearing on the witness' credibility. The court then gave a similar instruction regarding prior inconsistent statements:\n\nEvidence has been received tending to show that at an earlier time the witness, Roscoe Artis, and the witness Pauline Smith, respectively, each made a statement which conflicts with his or her respective testimony at this trial.\n\nYou must not consider such earlier statement as evidence of the truth of what was said at that earlier time, because it was not made under oath in this trial. If you believe that such earlier statement was made and that it does conflict with the testimony of the witness at this trial, then you may consider this together with all other facts and circumstances bearing upon the witness' truthfulness in deciding whether you will believe or disbelieve his or her testimony at this trial.\n\nAlthough the trial court is not required to state, recapitulate, or summarize the evidence or to explain the application of law to the evidence, N.C.G.S. § 15A-1232 (1988), the court is free to do so in its discretion. State v. Williams, 315 N.C. 310, 338 S.E.2d 75 (1986). However, in so doing, the trial court must be vigilant not to express an opinion as to the quality of the evidence or as to the credibility of a witness: \"No judge at any time during the trial of a cause is permitted to cast doubt upon the testimony of a witness or to impeach his credibility.\" State v. Auston, 223 N.C. 203, 205, 25 S.E.2d 613, 614 (1943).\n\nThe words of the trial court's charge reveal clearly that, rather than expressing an opinion regarding whether the prior statements of defendant or Pauline Smith conflicted with their testimony, the court admonished the jury to determine whether the prior statement had been made at all and, if so, whether it conflicted with the testimony presented at trial. This was neither a violation of N.C.G.S. § 15A-1232 nor otherwise error.\n\nMoreover, the trial court properly chose not to include mention of these alleged inconsistencies in its charge to the jury on prior inconsistent statements. First, the officer's testimony corroborating\n\nthat of Alice McLaughlin did not purport to be comprehensive: he reiterated no excerpt from Ms. McLaughlin's prior statement that impeached her testimony, and made no reference whatsoever to her having heard or not heard cries for help. Cf. State v. Mack, 282 N.C. 334, 193 S.E.2d 71 (1972) (officer testified that witness' earlier statement failed to include salient fact to which witness testified). Second, except for a forty-five minute discrepancy concerning his estimated time of departure, David Moore's prior statement and his testimony about the hours of his waking, departure, and return were stated as approximations. Such variations were de minimus and immaterial, and the trial court's omission of them from its cited examples of prior inconsistent statements was proper.\n\nFinally, defendant contends that the trial court erred in instructing the jury that premeditation and deliberation could be inferred from proof of such circumstances as lack of provocation by the victim, the defendant's conduct before and after the killing, the use of grossly excessive force, the infliction of lethal wounds after the victim is felled, cruel or vicious circumstances of the killing, or the means by which the killing was done. Defendant asserts that no evidence was presented at trial supporting these circumstances, and that the instructions were unsupported by facts presented by a reasonable view of the evidence. See State v. Buchanan, 287 N.C. 408, 215 S.E.2d 80 (1975); State v. Lampkins, 283 N.C. 520, 196 S.E.2d 697 (1973). Defendant contends that, despite his failure to object, such instructions were prejudicial and constitute reversible error.\n\nWe emphatically disagree. The trial court's statement of the law was an accurate reiteration of circumstances identified by this Court in, e.g., State v. Williams, 308 N.C. 47, 301 S.E.2d 335, cert. denied, 464 U.S. 865, 78 L. Ed. 2d. 117, reh'g denied, 464 U.S. 1004, 78 L. Ed. 2d. 704 (1983); State v. Walters, 275 N.C. 615, 170 S.E.2d 484 (1969). There was evidence supporting not one, but all of these circumstances from which the jury could have inferred that Joann Brockman's murder was premeditated and deliberated. First, although defendant testified that he and Joann had argued about a rival in Lumberton, the words defendant testified had passed between them can by no means be said to have been adequate to provoke a killing in the heat of passion or one motivated by any other mens rea less inculpatory than premeditation and deliberation. See, e.g., State v. Cummings, 323 N.C. 181, 372 S.E.2d 541 (1988). Second, defendant's own description of his conduct before\n\nthe killing indicated an assault, a rape, and, after Joann's death, an attempt to camouflage the body and an unconcerned walk back to his sister's house for a nap. Third, death by strangulation has been characterized by this Court in State v. Prevette, 317 N.C. 148, 345 S.E.2d 159 (1986), as vicious and brutal, and it is ample evidence of the use of grossly excessive force, as a matter of law. Defendant testified in addition that Joann had been felled by three blows from a broad stick, dragged into the woods and positioned for a rape. The evidence tends to show -- and inferences from defendant's confession indicate -- that the lethal act, strangulation, occurred not only after she had been felled, but while she was being raped.\n\nWe conclude that substantial evidence supports all the circumstances submitted by the trial court to the jury indicating a killing effected after premeditation and deliberation. In the guilt-innocence phase of his trial, defendant received a fair trial free from prejudicial error.\n\nSentencing Phase\n\nDefendant asserts that the trial court also committed numerous errors in the sentencing phase of his trial, among them that the court failed to instruct the jury as to two statutory mitigating circumstances. Defendant correctly notes the mandate of N.C.G.S. § 15A-2000(b) that the trial judge presiding over a capital case submit a statutory mitigating circumstance to the jury for its consideration when evidence has been presented which \"would support a reasonable finding\" of that circumstance. State v. Lloyd, 321 N.C. 301, 312, 364 S.E.2d 316, 323 (1988). Even though a defendant fails to offer evidence to support the existence of a mitigating circumstance, \"when the State offers or elicits evidence from which the jury could reasonably infer that the circumstance exists[,]\" it must be offered to the jury for its consideration. State v. Stokes, 308 N.C. 634, 652, 304 S.E.2d 184, 195-96 (1983).\n\nDefendant first contends that evidence of his mental retardation supported the impaired capacity statutory mitigating circumstance of N.C.G.S. § 15A-2000(f)(6). Defendant presented evidence during the sentencing phase proceedings that he is borderline mentally retarded, with a full scale I.Q. of 67. Based upon this evidence, and upon evidence of intoxication at the time of the murder, he requested an instruction directing the jury to consider whether defendant's capacity to appreciate the criminality of his conduct\n\nor to conform his conduct to the requirements of the law was impaired.\n\nThe trial judge gave a portion of the requested instruction, limiting consideration of the statutory circumstance to the evidence of intoxication:\n\nYou would find this mitigating circumstance if you find that Roscoe Artis, on the evening of October 21, 1983, drank three beers and on the morning of October 22, 1983, before the killing, drank two swallows of Peppermint Schnapps, and that given Roscoe Artis' reaction to the Peppermint Schnapps that he drank, someone must have put something in it, and that this impaired his capacity to appreciate the criminality of his conduct, or to conform his conduct to the requirements of law.\n\nThe trial judge did not instruct the jury to consider defendant's mental retardation with respect to the statutory mitigating circumstance. Instead she submitted a separate, nonstatutory circumstance, instructing the jury to \"consider whether Roscoe Artis' bordering on mild mental retardation, with a full scale intelligence quotient of sixty-seven, is a mitigating factor.\"\n\nDefendant argues that the trial judge's failure to relate his mental retardation specifically to the statutory mitigating circumstance precluded the jury from adequate consideration of the mitigating evidence, thereby violating his rights to due process of law and to freedom from cruel and unusual punishment. We find no merit to this assertion.\n\nDan Jordan, clinical psychologist at the Southeastern Regional Mental Health Center, testified on direct examination that defendant had a full scale I.Q. score of 67, indicating upper-range mild retardation. He noted that defendant had no brain damage and could read at a fifth-grade level, add and subtract, and make simple change. He further testified that under normal circumstances individuals at defendant's level of intellectual functioning are capable of \"social and vocational adequacies\" and are generally considered to be responsible for their behavior.\n\nOn cross-examination Mr. Jordan stated that defendant could hold a job, be issued a driver's license, and generally \"cope with life.\" He reiterated his earlier evaluation of defendant's capabilities as follows:\n\nQ. . . . Now, you are not saying that because of his I.Q., he did not know the difference between right and wrong; are you?\n\nA. I didn't make any statement about that.\n\nQ. But you are not saying that, are you? I'm just trying to clarify it, now.\n\nA. No. I said he was generally responsible for his behavior.\n\nQ. Okay. Did you say that -- you may have already testified to this -- persons functioning at this level are capable of social and vocational adequacies under normal life's circumstances?\n\nA. Yes, sir.\n\nQ. Okay. And that unless other wise impaired, they are generally considered to be responsible for their behavior. That is what you're talking about; isn't it?\n\nA. That's right.\n\nAlthough Mr. Jordan's testimony presented some evidence of defendant's mild retardation, it failed to suggest any link between this condition and defendant's inability to appreciate the criminality of his conduct or to conform his conduct to the requirements of the law. To the contrary, all of the evidence tended to show that persons suffering from upper-range mild retardation are generally responsible for their own actions. While bare evidence of a low I.Q. can justify the submission of a properly worded nonstatutory mitigating circumstance, State v. Pinch, 306 N.C. 1, 292 S.E.2d 203 (1982), cert. denied, 459 U.S. 1056, 74 L. Ed. 2d. 622, reh'g denied, 459 U.S. 1189, 74 L. Ed. 2d. 1031 (1983), it is simply insufficient, without more, to require an instruction relating this evidence to the \"impaired capacity\" statutory mitigating circumstance.\n\nFor this reason, defendant's reliance on State v. Stokes, 308 N.C. 634, 304 S.E.2d 184, is misplaced. In Stokes we awarded the defendant a new sentencing hearing based on the trial court's failure to submit certain mitigating circumstances, including the impaired capacity circumstance of N.C.G.S. § 15A-2000(f)(6). In Stokes, however, the evidence presented in support of the impaired capacity circumstance went beyond mere evidence of the defendant's I.Q. Testimony tended to show not only that Stokes had an I.Q. of\n\n63 and was mildly retarded, but also that he had a long history of treatment for mental problems and had been diagnosed as suffering from an antisocial disorder. Such evidence was far more substantial than that presented here. This assignment of error is overruled.\n\nDefendant also assigns error in the sentencing phase of his trial to the court's failure to instruct the jury on the statutory mitigating circumstance that defendant had no significant prior criminal activity.\n\nIn State v. Wilson, 322 N.C. 117, 143, 367 S.E.2d 589, 604 (1988), this Court noted that it is the trial court's duty \"to determine whether a rational jury could conclude that defendant had no significant history of prior criminal activity.\" Then, once the court has so decided, the mitigating circumstance is submitted to the jury, which must decide for itself whether the evidence is sufficient to constitute a significant history of criminal activity and thus preclude a finding of that circumstance. Id. In the context of N.C.G.S. § 15A-2000(f)(1),\n\n\"[S]ignificant\" means that the activity is likely to have influence or effect upon the determination by the jury of its recommended sentence. . . . In other words, the prior criminal activity could be found by the jury to be completely irrelevant to the issue of sentencing. The prior activity of the defendant could be found by the jury to be completely unworthy of consideration in arriving at its decision. There could be evidence of prior criminal activity in one case that would have no influence or effect on the jury's verdict, which, in another case, could be the pivotal evidence.\n\nWilson, 322 N.C. 117, 147, 367 S.E.2d 589, 609 (Martin, J., concurring). Thus, it is not merely the number of prior criminal activities, but the nature and age of such acts that the trial court considers in determining whether by such evidence a rational juror could conclude that this mitigating circumstance exists. See, e.g., Wilson, 322 N.C. 117, 367 S.E.2d 589 (error not to submit mitigating circumstance where prior criminal activity in evidence was felony conviction for kidnapping of defendant's former wife when defendant was twenty years old and involvement in theft and drugs); State v. Lloyd, 321 N.C. 301, 364 S.E.2d 316 (two twenty-year-old felonies properly submitted under N.C.G.S. § 15A-2000(f)(1)); State v. Brown, 315 N.C. 40, 337 S.E.2d 808 (1985), cert. denied, 476 U.S. 1165, 90 L. Ed. 2d. 733 (1986) (submission of this mitigating circumstance\n\nto the jury proper, notwithstanding a record showing eighteen felony convictions, all acquired during defendant's youth).\n\nDefendant presented no evidence of his own supporting this mitigating circumstance, but his voir dire examination by the prosecutor revealed a number of past convictions. These included assault on a female with intent to commit rape in 1957, assault on a female in 1967, assault on a female in 1974, escape and larceny of an automobile in 1961, misdemeanor larceny in 1974, driving while license revoked in 1974, 1975, and 1979, driving while under the influence in 1974 and 1979, driving with no operator's license in 1981, and assault with a deadly weapon in 1975. Before the jury, defendant admitted that he had been convicted only of the 1957 and 1967 assaults. He denied the assault on Billie Ann Woods leading to the 1974 conviction and denied any memory of the other convictions. The trial court had barred the state's proof of all but the 1957 and 1967 assault convictions. Defendant suggests that these latter convictions would never have come to the attention of the jury, and that the two assault convictions, standing alone, would have supported a jury's finding in mitigation that defendant had no significant prior criminal activity. (This argument does not include mention of the third, most recent assault on a female, about which the victim, Billie Ann Woods, testified.)\n\nDefendant's position is untenable for three reasons. First, the trial court was aware of the plethora of defendant's past convictions -- including that arising from the assault on Billie Ann Woods -- in making the initial determination whether \"a rational jury could conclude that defendant had no significant history of prior criminal activity.\" Wilson, 322 N.C. at 143, 367 S.E.2d at 604. The court properly determined that a rational jury would conclude otherwise not only because it was aware that the state held proof of all these convictions, but also because of the nature of the two assault convictions which defendant had acknowledged.\n\nSecond, the propriety of the trial court's determination that a rational jury would not have found that defendant lacked a significant prior history of criminal activity is revealed by hindsight; in other words, defendant suffered no prejudice by virtue of the trial court's action. See N.C.G.S. § 15A-1443(a)(1988). In considering its recommendation for punishment the jury found three aggravating circumstances. Among these was the finding that defendant had been previously convicted of a felony involving violence to the\n\nperson. Given the fact that evidence in the record reflected not one but three assaults on females, it is unimaginable that, despite this finding and the evidence underlying it, the same jury might simultaneously have found that aggravating circumstance to be so irrelevant that it could reasonably infer the existence of the mitigating circumstance in N.C.G.S. § 15A-2000(f)(1).\n\nThird, the statute mandates that a mitigating circumstance be submitted to the jury for its consideration when it \"may be supported by the evidence.\" N.C.G.S. § 15A-2000(b)(1988). All the evidence must be taken into account by the trial court -- not just that which the court has ruled admissible for other purposes. However, a defendant cannot hold his breath throughout the trial in hopes that prior convictions never emerge into evidentiary light, then point to the deceptively incomplete record as support for the trial court's ostensible duty to submit this mitigating circumstance for the jury's consideration. The right to engage in such subterfuge is required neither by defendant's right to due process nor by his right to be free from cruel and unusual punishment. Cf. Wilson, 322 N.C. 117, 367 S.E.2d 589. \"[T]he legislature did not intend that the State or the defendant be allowed to limit in any way the jury's consideration of . . . statutorily established aggravating and mitigating circumstances.\" Lloyd, 321 N.C. at 312, 364 S.E.2d at 324. This means not only that the trial court must offer for the jury's consideration any mitigating circumstance that the jury might reasonably find supported by the evidence, id., but also that, when the evidence educed at trial appears to support the mitigating circumstance that defendant had no prior significant history of criminal activity, both parties must be given the opportunity to introduce additional evidence supporting or rebutting that circumstance. See State v. Laws, 325 N.C. 81, 381 S.E.2d 609 (1989).\n\nDefendant next contends that the trial court erred in submitting to the jury the aggravating circumstance that the murder was especially heinous, atrocious or cruel. N.C.G.S. § 15A-2000(e)(9). We find no merit to this assertion.\n\nWe have stated that this aggravating circumstance is appropriate when the level of brutality involved exceeds that normally found in first-degree murders or when the murder in question is conscienceless, pitiless or unnecessarily torturous to the victim. State v. Hamlet, 312 N.C. 162, 321 S.E.2d 837 (1984); State v. Page 317} Goodman, 298 N.C. 1, 257 S.E.2d 569 (1979). It also arises when the killing demonstrates an unusual depravity of mind on the part of the defendant. State v. Stanley, 310 N.C. 332, 312 S.E.2d 393 (1984). We have identified two of the types of murders which meet the above criteria: (1) those that are physically agonizing or otherwise dehumanizing to the victim, and (2) those that are less violent but involve the infliction of psychological torture. State v. Oliver, 309 N.C. 326, 307 S.E.2d 304.\n\nDefendant insists that his crime falls into neither of these categories. He first argues that the evidence was insufficient to support a reasonable conclusion that the murder was physically agonizing or in some other way dehumanizing within the meaning of Oliver. He hypothesizes that the victim lost consciousness sometime before her death and therefore would not have felt \"whatever pain might have been caused by continued choking.\"\n\nDefendant clearly misapprehends the applicable standard. In determining if there is sufficient evidence to submit a particular aggravating circumstance to the jury, the judge must consider the evidence in the light most favorable to the state. State v. Lloyd, 321 N.C. 301, 364 S.E.2d 316. Here the state's evidence tended to show that Joann Brockman was dragged through the woods, beaten repeatedly with a large stick, then strangled during an act of forcible intercourse. When discovered, she had blood on her nose, mouth, clothing, and hands. An autopsy showed that she had suffered a large bruise on the left side of the forehead which was insufficient to cause death. She had a bruise on the middle of her neck and eleven scratches and abrasions on both sides of the neck, ranging from one-quarter of an inch to an inch and a quarter in length. There was bruising and hemorrhaging in the connective tissue surrounding the windpipe, and her lungs were so filled with fluid that they were twice their normal weight. There was blood smeared around the opening to the victim's vagina and blood deep within the vaginal canal.\n\nThe pathologist testified that death by manual strangulation is caused by compression of the windpipe and constriction of the blood vessels in the neck which carry blood to the brain so that both the air to the lungs and the blood supply to the brain are shut off. As the heart fails from lack of air, the fluid that is normally pumped through the lungs by the heart accumulates in the air spaces. It takes four to five minutes for a victim of manual strangulation\n\nto die. The victim would not necessarily lose consciousness immediately and would suffer pain, particularly in the neck area where the pressure is exerted, during that period of time. Ultimately, the victim would actually drown in his or her own blood and fluids.\n\nWe hold that this evidence, when viewed in the light most favorable to the state, was sufficient to support a reasonable inference that the victim remained conscious during her ordeal and suffered great physical pain as, already bloodied and bruised from the beatings, she was raped with sufficient violence to draw blood from her vagina and strangled so forcefully that her neck was repeatedly scratched.\n\nThe physical evidence also supports an inference that the murder was especially dehumanizing. The pathologist testified that the victim's dilated vagina was consistent with death during the act of intercourse. When a murder takes place during the perpetration of a violent sexual assault upon the victim, it is unusually humiliating and debasing. We note that in other sexual assault-strangulation cases we have found that the evidence supported submission of the circumstance in N.C.G.S. § 15A-2000(e)(9). E.g., State v. Johnson, 298 N.C. 355, 259 S.E.2d 752 (1979) (defendant strangled his ten-year-old victim with a fish stringer, sexually assaulting him either during or after the killing); State v. Johnson, 298 N.C. 47, 257 S.E.2d 597 (1979) (defendant strangled his victim until she lost consciousness, then raped her).\n\nDefendant also argues that the facts of this case do not support a finding that the murder involved the infliction of psychological torture. In this vein, he contends that his case is governed by State v. Moose, 310 N.C. 482, 313 S.E.2d 507 (1984), and State v. Stanley, 310 N.C. 332, 312 S.E.2d 393, two gunshot murders in which we deemed the evidence of psychological torture insufficient for submission of the heinous, atrocious or cruel aggravating circumstance. Defendant characterizes the evidence of psychological torture in these cases as much stronger than that in the case at bar. We disagree, and find these authorities to be readily distinguishable.\n\nIn Stanley, defendant drove back and forth in front of his estranged wife's home, then shot her nine times in rapid succession when she emerged from the house to take a walk. Just before the shooting the victim uttered the words \"Please Stan.\" We noted that the victim, cognizant of defendant's behavior, had not felt\n\nso threatened by his presence in the neighborhood as to remain in the house. She was apparently unaware of any danger up until the moment of the shooting. We held that this evidence did not support an inference that the defendant had psychologically tortured his wife by stalking her prior to the shooting.\n\nIn Moose, the defendant followed the victim for over a mile, sounding his horn and bumping the victim's car with his pickup truck. When the victim pulled off the road, the defendant pointed a shotgun through the window of the truck for a period of about five seconds before shooting and killing him. Just before the shooting, the victim exclaimed \"Oh God, what are they going to do?\" We noted that although the evidence showed some amount of apprehension on the part of the victim, there was no evidence that he believed that the ultimate result of the defendant's pursuit would be death. Therefore, an inference that he had suffered psychological torture was unsupported.\n\nThus, in each case our analysis of the psychological torture issue centered upon the question of whether, prior to the actual killing, the victim was in fear that death was likely to result from the defendant's actions.\n\nDefendant, seeking to equate his case with Stanley and Moose, opines that there was no evidence to suggest that Joann Brockman experienced fear or suspected that her life was in danger \"until the killing was well underway.\"\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Defendant's argument misses the mark because he fails to perceive an essential difference between the shooting deaths in Moose and Stanley and the death by strangulation here. Manual strangulation, by its very nature, may require a continued murderous effort on the part of the assailant for a period of up to four to five minutes. The process is a prolonged one during which the victim's life is quite literally in the hands of the assailant. In the murderer's grasp, the victim is rendered helpless, aware of impending death, but utterly incapable of preventing\n\nit. The intimate proximity of the murderer surely adds to the victim's torment, as all possibility of escape appears foreclosed.\n\nHere, the state's evidence, viewed in its most favorable light, tended to show that the victim, though immobilized by several blows to the head and pinned to the ground by defendant's weight, remained conscious as defendant violated her sexually and began the slow process of choking the life out of her with his bare hands. While five minutes may be a short time under most circumstances, when struggling for the breath of life it can be an eternity. A reasonable jury could infer that the victim experienced tremendous anguish and terror during this period of strangulation.\n\nThis is not, as defendant suggests, tantamount to a holding that lingering death in itself supports a finding of the aggravating circumstance. \"That death is not instantaneous, however, does not alone make a murder especially heinous, atrocious or cruel.\" Stanley, 310 N.C. at 337, 312 S.E.2d at 396. See, e.g., State v. Hamlette, 302 N.C. 490, 276 S.E.2d 338 (1981) (victim of shotgun wound lingered for twelve days; circumstance improperly submitted). Rather, the propriety of submitting this aggravating circumstance must turn upon \"the peculiar surrounding facts of the capital offense under consideration.\" State v. Pinch, 306 N.C. at 35, 292 S.E.2d at 228.\n\nOur holding in this case is based upon the unique combination of factors demonstrated by the evidence. When taken as a whole, the evidence of the dehumanizing nature of the crime and of the victim's physical and psychological suffering was sufficient to support submission of this aggravating circumstance to the jury. Under the facts of this case a jury would be permitted, but not compelled, to find that the murder was especially heinous, atrocious or cruel.\n\nDefendant next assigns error to the trial court's instructing the jury with regard to the aggravating circumstance whether defendant had previously been convicted of a felony involving the use or threat of violence to the person. N.C.G.S. § 15A-2000(e)(3) (1988). The trial court charged that assault on a female with intent to commit rape is by definition such a crime. Defendant asserts that this instruction created an irrebuttable presumption and relieved the state of its burden of proving every essential element of the offense, thus violating defendant's right to due process of law. See State v. Torain, 316 N.C. 111, 340 S.E.2d 465, cert. denied, 479 U.S. 836, 93 L. Ed. 2d. 77 (1986); Francis v. Franklin, 471 U.S. 307, 85 L. Ed. 2d. 344 (1985). In addition, defendant perceives this\n\ninstruction as an impermissible expression of the trial court's opinion on a question of fact or its proof in violation of N.C.G.S. §§ 15A-1222 and 1232.\n\nDefendant failed to object at trial. We conclude that the challenged instruction did not constitute error. See Torain, 316 N.C. 111, 340 S.E.2d 465.\n\nWe note preliminarily that it is not necessary to show that the use or threat of violence is an element of a prior felony in order for a prior felony to be used in support of this aggravating circumstance. As this Court remarked in State v. McDougall, 308 N.C. 1, 18, 301 S.E.2d 308, 319, cert. denied, 464 U.S. 865, 78 L. Ed. 2d. 173 (1983), the legislature's selection of the word \"'involving' . . . indicate[d] an interpretation much more expansive than one restricting the jury to consider only felonies having the use or threat of violence to the person as an element.\" Hence, in order to substantiate this aggravating circumstance, it is enough to cite a prior felony in which the commission of the felony simply involved use or threat of violence.\n\nThere can be no question, however, that the use or threat of violence is among the elements of assault on a female with intent to commit rape. This Court has flatly stated that \"rape is a felony which has as an element the 'use or threat of violence to the person.'\" Id. Rape, vaginal intercourse with another person by force and against the victim's will, N.C.G.S. § 14-27.2 (1986), is an act of violence by any definition, and it is a crime of violence as a matter of law.\n\nFurthermore, assault also has as an element the use or threat of violence to the person. \"[T]here are two rules under which a person may be prosecuted for assault in North Carolina,\" State v. Roberts, 270 N.C. 655, 658, 155 S.E.2d 303, 305 (1967), and violence is an element of the offense under either rule. The common law offense of assault is \"an overt act or an attempt, or the unequivocal appearance of an attempt, with force and violence, to do some immediate physical injury to the person of another, which show of force or menace of violence must be sufficient to put a person of reasonable firmness in fear of immediate bodily harm.\" Id. Alternatively, assault may be proved without reference to the intent of the perpetrator where there is a \"show of violence accompanied by reasonable apprehension of immediate bodily harm or injury\n\non the part of the person assailed which causes him to engage in a course of conduct he would not otherwise have followed.\" Id.\n\nAn assault on a woman with intent to commit rape is an act exhibiting violence together with the intent to commit a subsequent act of violence. As such, it is, as a matter of law, an offense \"involving the use or threat of violence to the person.\" The trial court did not err in so instructing the jury.\n\nParenthetically, it is patent that the issue of whether it is error to instruct the jury that assault on a female with intent to commit rape is a violent crime as a matter of law is a question of law, not one of fact. The pertinent question of fact with regard to this aggravating circumstance -- whether defendant had been convicted of this offense -- remained within the province of the sentencing jury. Questions of fact regarding the elements of the offense itself had already been determined by a prior jury or fact-finder, and their existence was implied simply in the determination by the sentencing jury that defendant had indeed been convicted of that offense. This finding was untainted by any opinion from the bench. Defendant's contention that this instruction offended statutory proscriptions concerning the expression of judicial opinion on matters of fact or their proof is plainly without merit.\n\nDefendant next contends that it was error for the trial court to submit the aggravating circumstance that the murder was committed while defendant was engaged in the commission of a rape without instructing the jury that this offense could be considered in aggravation of murder in the first degree only if its basis was premeditation and deliberation, but not if it was based upon the felony murder rule. Defendant argues that the evidence was insufficient to support submission to the jury of murder based upon premeditation and deliberation, and that it was thus reversible error under the Cherry rule to submit the underlying felony in aggravation of his sentence. See, e.g., State v. Oliver, 302 N.C. 28, 274 S.E.2d 183 (1981); State v. Silhan, 302 N.C. 223, 275 S.E.2d 450 (1981); State v. Cherry, 298 N.C. 86, 257 S.E.2d 551 (1979), cert. denied, 446 U.S. 941, 64 L. Ed. 2d. 796 (1980).\n\nAs we have concluded heretofore, there was ample evidence supporting the submission to the jury of murder in the first degree based upon premeditation and deliberation. In cases where the jury has found the defendant guilty of murder based upon both premeditation and deliberation and felony murder, we have held\n\nunequivocally that because the commission of the felony is not an essential element of a premeditated and deliberated murder, it may properly be submitted to the jury as an aggravating circumstance. E.g., State v. Williams, 308 N.C. 47, 301 S.E.2d 335; State v. Rook, 304 N.C. 201, 283 S.E.2d 732. This case is no different, and we hold once again that the trial court did not err in allowing the jury to consider as an aggravating circumstance the felony underlying defendant's conviction for felony murder.\n\nDefendant next assigns error to the trial court's failure to intervene at several points in the prosecutor's sentencing argument where defendant contends the prosecutor's fervor prejudicially exceeded the bounds of propriety. In defendant's view, the prosecutor's rhetoric was at times so lurid and melodramatic that it went beyond fair, impartial argument, being calculated to inflame the passions and prejudices of the jury. See generally 1 ABA Bar Standards for Criminal Justice, The Prosecution Function, § 3-5.8(c)(1986).\n\nThis Court has repeatedly noted that counsel are allowed wide latitude in arguing hotly contested cases. E.g., State v. Brown, 320 N.C. 179, 358 S.E.2d 1, cert. denied, 484 U.S. 970, 98 L. Ed. 2d. 406 (1987); State v. Huffstetler, 312 N.C. 92, 322 S.E.2d 110 (1984), cert. denied, 471 U.S. 1009, 85 L. Ed. 2d. 169 (1985). \"Counsel for each side may argue to the jury the facts in evidence and all reasonable inferences to be drawn therefrom together with the relevant law so as to present his or her side of the case.\" Huffstetler, 312 N.C. at 112, 322 S.E.2d at 123. Whether an advocate has abused this privilege is left largely to the sound discretion of the trial court. Id. Where the defendant has failed to object to an alleged impropriety in the state's argument and so flag the error for the trial court, an appellate court may review the argument notwithstanding. But \"the impropriety . . . must be gross indeed in order for this Court to hold that a trial judge abused his discretion in not recognizing and correcting ex mero motu an argument which defense counsel apparently did not believe was prejudicial when he heard it.\" State v. Johnson, 298 N.C. 355, 369, 259 S.E.2d 752, 761.\n\nDefendant did object to the first instance of alleged prosecutorial impropriety, a tactic defendant contends was calculated to excite the jurors' sentiment at the expense of their reason. The prosecutor forewarned the jurors that he would clock a four-minute pause in which he wished each to \"hold your breath just as long as\n\nyou can. I'm not asking you to place yourself in the position of Joanne Brockman. . . . [B]ut I want you to understand . . . the dynamics of manual strangulation, and I want you to understand just how long four minutes is in that context.\" Despite the caveat that he did not expect the jurors to put themselves in the shoes of the victim, the prosecutor continued in words that urged the jurors to do just that:\n\n[W]hile we are counting all four minutes, I want you to analyze in your mind the evidence that you have seen in this case. I want you to think about it. I want you to think about the helplessness of Joanne Brockman there in those woods, confronted with this large man. I want you to think about the fear that she must have experienced. I want you to think about the brutal strength that he brought to bear on her body as he knocked her around and got her on the ground and choked her and raped her. And I want you to think about the surroundings she was in. I want you to think about the beauty of that place as she lie [sic] there dying, helpless, because this man, sitting at the next table, was determined to vent his lust on her body at any cost and any hazard to her. I want you to think about the loneliness of death. Her [sic] alone in the woods, hit in the head once, hit in the head twice, hit in the head three times; her cries going across those tree tops, \"Help, help, help,\" and no one came. And I want you to think about, Ladies and Gentlemen of the Jury, as your air starts to run out, the testimony that she (indicating) tried to bring that most precious thing into her body and was unable to do it, because this man, sitting here, had her by the throat and was slowly murdering her. And I want you to think, also, Ladies and Gentlemen of the Jury, about the pain as described by the doctor; pain in the neck, the fluid filling the lungs.\n\nIt is to be noted that this argument by the state occurred during the sentencing phase of this trial, and we find it neither improper nor prejudicial. Wide latitude is allowed the arguments of counsel in both the guilt and sentencing phases of a trial, see, e.g., State v. Pinch, 306 N.C. 1, 292 S.E.2d 203. However, the foci of the arguments in the two phases are significantly different, and rhetoric that might be prejudicially improper in the guilt phase is acceptable in the sentencing phase.\n\nDuring the guilt phase of a trial, the focus is on guilt versus innocence. Mercy is not a consideration, just as prejudice,\n\npity for the victim, or fear may be an inappropriate basis for a jury decision as to guilt or innocence. Arguments which emphasize these factors are properly deemed prejudicial. However, during sentencing, considerations are different. The emphasis is on the circumstances of the crime and the character of the criminal.\n\nState v. Oliver, 309 N.C. 326, 360, 307 S.E.2d 304, 326 (citations omitted). Urging the jurors to appreciate the \"circumstances of the crime\" by asking them voluntarily to suffer oxygen deprivation may inappropriately stress an emotional over a rational appreciation of those circumstances, and certainly \"may have strained the rational connection between evidence and inference.\" Brown, 320 N.C. at 206, 358 S.E.2d at 19. But it cannot be said that an argument utilizing such tactics was improper in the context of the penalty phase of a trial. \"If the touchstone for propriety in sentencing arguments is whether the argument relates to the character of the criminal or the nature of the crime,\" Id. at 202-3, 358 S.E.2d at 17, then the prosecutor's tactic here was within the bounds of propriety.\n\nDefendant also objected to a portion of the prosecutor's sentencing argument in which he remarked that the reason defendant's son, daughter, and aunt had been put on the stand to testify as to defendant's character and personal history was to evoke the jury's sympathy. Defendant's objection was overruled. This was proper, for the state is permitted to characterize and to contest the weight of proffered nonstatutory mitigating circumstances. See State v. Kirkley, 308 N.C. 196, 302 S.E.2d 144 (1983), overruled on other grounds, State v. Shank, 322 N.C. 243, 367 S.E.2d 639 (1988).\n\nDefendant failed to object to the prosecutor's next remark, however, in which the jury was urged \"to try this case without . . . prejudice and without sympathy; strictly on the facts of this lawsuit.\" Defendant contends that this interpretation of the law was not only erroneous, but that it contravened defendant's constitutional rights under the eighth amendment as delineated in California v. Brown, 479 U.S. 538, 93 L. Ed. 2d. 934 (1987). In Brown, the United States Supreme Court held that a jury instruction that jurors \"must not be swayed by mere sentiment, conjecture, sympathy, passion, prejudice, public opinion or public feeling\" did not unconstitutionally preclude a fair consideration of the full range of possible mitigation, for its meaning was not necessarily to\n\ndisregard those impulses altogether, but to do so only where they were divorced from the evidence. Id. at 540, 93 L. Ed. 2d. at 939.\n\nMitigating circumstances are to be supported by the evidence, not by emotion. This seems to have been the import of the prosecutor's statement, and as such, was not improper. The trial court's final charge to the jury accurately articulated how the evidence was to be viewed for purposes of mitigating punishment:\n\nA mitigating circumstance is a fact or group of facts which do not constitute a justification or excuse for a killing, or reduce it to a lesser degree of crime than first degree murder, but which may be considered as extenuating or reducing the moral culpability of the killing, or making it less deserving of extreme punishment than other first degree murders.\n\nThis was a correct statement of the law, paraphrasing this Court's language in State v. Boyd, 311 N.C. 408, 319 S.E.2d 189 (1984), cert. denied, 471 U.S. 1030, 85 L. Ed. 2d. 324 (1985) and State v. Brown, 306 N.C. 151, 293 S.E.2d 569, cert. denied, 459 U.S. 1080, 74 L. Ed. 2d. 642 (1982). If it was error for the trial court to exercise restraint in interrupting the prosecutor's argument, this was rectified by the court's subsequent instructions. See, e.g., State v. Lake, 305 N.C. 143, 286 S.E.2d 541 (1982).\n\nDefendant also excepts to that portion of the prosecutor's sentencing argument in which he remarked on the loss the victim's family suffered by her death:\n\nIt was so brutal. It was without mercy. It was absolutely unnecessary. He not only took her life, he took a loved one from those who have testified here, the uncle, the aunt, the man that she was going to marry. So, he not only took something from Joanne Brockman, he took something from these folks. And in doing that, he took something from all of society, because Joanne Brockman belonged to society just as much as you do or I do.\n\nAlthough defendant failed to object to these remarks, he now urges this Court to recognize their impropriety to be so \"glaring or grossly egregious\" that it could be said the trial court erred in failing to take corrective action sua sponte. State v. Pinch, 306 N.C. 1, 18, 292 S.E.2d 203, 218.\n\nWe perceive no error of such magnitude. Defendant asserts that these remarks are comprehended in the disapproval of victim\n\nimpact statements in Booth v. Maryland, 482 U.S. 496, 96 L. Ed. 2d. 440, reh'g denied, 483 U.S. 1056, 97 L. Ed. 2d. 820 (1987). But there are no objectionable references herein to \"the personal characteristics\" of the victim, to the emotional impact of the crime on the family, or to family members' opinions and characterizations of the crime and of the defendant. Id. at 502, 96 L. Ed. 2d. at 448. See also State v. McNeil, 324 N.C. 33, 375 S.E.2d 909 (1989). The prosecutor's mere allusion to the loss the victim's family feels does not threaten to sweep juror ruminations into the realm of the arbitrary and capricious. Although remarks concerning the effects of a crime on those the victim leaves behind are arguably irrelevant insofar as they concern neither the character of the criminal nor the nature of the crime, State v. Brown, 320 N.C. 179, 358 S.E.2d 1, the prosecutor's reference to the loss felt by Joann's family, if error at all, was de minimus. Given the overwhelming evidence against defendant, including the supporting aggravating circumstances, such possible error was harmless beyond a reasonable doubt. N.C.G.S. § 15A-1443(b)(1988); Brown, 320 N.C. 179, 358 S.E.2d 1.\n\nDefendant also failed to object when the prosecutor called the jury's attention to defendant's demeanor, suggesting that they perceived a man without visible signs of remorse:\n\nLook at Roscoe Artis over there, Ladies and Gentlemen of the Jury. You watched him throughout the trial. Is this a man of remorse? Is this a man of contrition? You have observed him on the stand. You have observed him sitting here in the Courtroom, now for almost two weeks. Have you seen the first sign of contrition about him? Have you seen the first sign of remorse about him to show there's a conscience somewhere in that head or body working on him?\n\nDefendant contends that \"exploiting\" his silence at trial or his unwillingness to admit guilt by dubbing these rights a failure to express remorse violates his right to plead not guilty and to stand by this plea throughout the proceedings. See State v. Harbison, 315 N.C. 175, 337 S.E.2d 504 (1985), cert. denied, 476 U.S. 1123, 90 L. Ed. 2d. 672 (1986). At the very least the prosecutor's remarks place defendant in the incongruous position of appearing unremorseful about a crime that he swears he did not commit.\n\nThe defendant in Brown, 320 N.C. 179, 358 S.E.2d 1, pressed the same argument on appeal, contending that since remorselessness cannot be offered by the state as an aggravating circumstance\n\nand where remorsefulness is not offered as a mitigating circumstance, this trait is irrelevant and its mention by the prosecutor improper. In Brown, however, this Court noted that \"[u]rging the jurors to observe defendant's demeanor for themselves does not inject the prosecutor's own opinions into his argument, but calls to the jurors' attention the fact that evidence is not only what they hear on the stand but what they witness in the courtroom.\" 320 N.C. at 199, 358 S.E.2d at 15. Remarks related to the demeanor displayed by the defendant throughout the trial remain \"rooted in\" observable evidence and, as such, are not improper. State v. Myers, 299 N.C. 671, 680, 263 S.E.2d 768, 774 (1980).\n\nFinally, defendant contends that certain other remarks of the prosecutor diluted the jury's sense of its own responsibility in recommending the death sentence in violation of Caldwell v. Mississippi, 472 U.S. 320, 86 L. Ed. 2d. 231 (1985), and thus constituted reversible error. Defendant objects to remarks invoking public sentiment and to remarks relying inappropriately on the Bible, which he contends were so grossly improper as to have called for the intervention of the trial court ex mero motu.\n\nThe prosecutor stressed to the jurors that it was not they who were responsible for the judgment they would recommend, but defendant:\n\nToday is judgment day. Who wrote that judgment, Ladies and Gentlemen of the Jury? Are you going to write it? You don't write anything. This man sitting right here wrote his own judgment in this case.\n\nDefendant's objection at this point was overruled, and the prosecutor continued:\n\nHe wrote his own judgment in this case when he broke the law, when he killed and murdered Joanne Brockman on the 22d of October, 1983. He passed judgment on himself. He wrote his own death warrant, which is now for you to sign and, therefore, make it lawful.\n\nViewed in context, it is plain these words were calculated not to relieve the jury of its responsibility, such as where it is suggested to a jury that any error it might make in sentencing would be checked on appeal, e.g., State v. Jones, 296 N.C. 495, 251 S.E.2d 425 (1979), but to indicate to the jury the fact that it was defendant, not they, who chose to take the life of another,\n\nand that it was defendant, not they, who was master of his own fate. We held in McNeil, 324 N.C. 33, 375 S.E.2d 909, that the identical argument was not so grossly improper as to require the trial court to intervene ex mero motu. We hold here that, even where defendant seizes the opportunity to object, the propriety of this argument is within the sound discretion of the trial court.\n\nThe prosecutor also urged the jury to consider community responses to their sentencing recommendation:\n\nWhen you hear of such acts, Ladies and Gentlemen of the Jury, you think, \"Well, somebody ought to do something about that.\" Well, you know who that somebody is? You are the somebody. You are the somebody that everybody talks about out there, and your duty may be uncomfortable, but it's necessary, an absolutely necessary duty.\n\nThe officers can do no more. The State can do no more. The Judge can do no more. Now, it's entirely up to you. The eyes of Robeson County are on you. You speak for Robeson County, and you say by your verdict how you feel about such vile acts there in the community. You send a message. You send a message to Roscoe Artis. You send a message to anyone out there in the community who would follow in his foot steps with a deed such as this.\n\nDefendant's objection to the last remark was sustained and the jury instructed to disregard it. Nevertheless, defendant observes that the preceding words delivered the same substantive message. He avers that these were statements that could be \"construed as telling the jury that the citizens of the community sought and demanded conviction and punishment of the defendant,\" which this Court held in State v. Scott, 314 N.C. 309, 312, 333 S.E.2d 296, 298 (1985), to be improper as \"an invitation to ignore the evidence and to hark to a pack already hot on the trail and in full cry.\"\n\nDefendant accurately notes that striking only the last of the prosecutor's remarks was ineffectual insofar as the preceding remarks contain the same subject matter. Nevertheless, it is not objectionable to tell the jury that its verdict will \"send a message to the community\" about what may befall a person convicted of murder in a court of justice. What is objectionable and improper is to intimate to the jury community preferences regarding capital punishment, for these are neither evidence nor otherwise proper considerations\n\nfor the sentencing jury. The state must not ask the jury \"to lend an ear to the community rather than a voice.\" Id. (quoting Prado v. State, 626 S.W.2d 775, 776 (Tex. Crim. App. 1982)). However, it is not improper to remind the jury, as the prosecutor did here, that its voice is the conscience of the community. See, e.g., McNeil, 324 N.C. 33, 375 S.E.2d 909; Brown, 320 N.C. 179, 358 S.E.2d 1; Scott, 314 N.C. 309, 333 S.E.2d 296. The trial court did not err in permitting these remarks to stand uncorrected.\n\nIn arguing that the appropriate punishment for one convicted of murder is death, the prosecutor read copiously from the Bible, occasionally interspersing biblical passages with reference to North Carolina law:\n\nListen to this: \"And if he smite him with an instrument of iron, so that he die, he is a murderer. The murderer shall surely be put to death. And if he smite him with throwing a stone wherewith he may die, and he die, he is a murderer. The murderer shall surely be put to death. Or if he smite him with a hand weapon or wood, wherewith he may die, and he die, he is a murderer. The murderer shall surely be put to death. If he thrust him of hatred, or hurl at him by laying in wait, that he die, or in enmity smite him with his hand, that he die, he that smote him shall surely be put to death, for he is a murderer.\"\n\nNow, listen to this: \"So these things shall be for a statute of judgment . . .\" Ladies and Gentlemen of the Jury, what is North Carolina Statute 15A-2000? It's simply a statute of judgment. \". . . a statute of judgment unto you through your generations in all your dwellings. Whoso killeth any person, the murderer shall be put to death by the mouth of witnesses . . . [.] Moreover, ye shall take no satisfaction for the life of a murderer, which is guilty of death, but he shall be surely put to death.\"\n\nAnticipating the argument by defendant's counsel that the New Testament teaches forgiveness, the prosecutor also assured the jury that these biblical laws regarding capital punishment remain unaffected by the New Testament.\n\nDefendant failed to object to this portion of the prosecutor's discourse but now argues vigorously that for a prosecutor, an officer\n\nof the state, to serve as an apologist and proponent for a particular religious orientation violates the principle of the separation of church and state, see U.S. Const. amends. I, XIV, and the prohibition against cruel and unusual punishment, U.S. Const. amend. VIII; N.C. Const. art. I, §§ 13, 19. Defendant urges that these passages suggest that \"the responsibility for any ultimate determination of death will rest with others,\" Caldwell v. Mississippi, 472 U.S. 320, 333, 86 L. Ed. 2d. 231, 242, and that they detract from the proper bases for sentencing -- the character of the criminal and the nature of the crime. E.g., Brown, 320 N.C. 179, 358 S.E.2d 1.\n\nIn their arguments before the jury, counsel for both sides are entitled to argue the law and the facts in evidence and all reasonable inferences that may be drawn therefrom. E.g., Brown; State v. Huffstetler, 312 N.C. 92, 322 S.E.2d 110. Neither the \"law\" nor the \"facts in evidence\" include biblical passages, and, strictly speaking, it is improper for a party either to base or to color his arguments with such extraneous material. See State v. Cherry, 298 N.C. 86, 257 S.E.2d 551. However, this Court has repeatedly noted the wide latitude allowed counsel in arguing hotly contested cases, e.g., State v. Britt, 288 N.C. 699, 220 S.E.2d 283 (1975); State v. Pinch, 306 N.C. 1, 292 S.E.2d 203, and it has found biblical arguments to fall within permissible margins more often than not. See, e.g., State v. Hunt, 323 N.C. 407, 373 S.E.2d 400 (1988); Brown, 320 N.C. 179, 358 S.E.2d 1; State v. Oliver, 309 N.C. 326, 307 S.E.2d 304. This Court has distinguished as improper remarks that state law is divinely inspired, Oliver, or that law officers are \"ordained\" by God. State v. Moose, 310 N.C. 482, 501, 313 S.E.2d 507, 519-20.\n\nThe prosecutor's amalgam of biblical language and the precise statutory citation for North Carolina's \"statute of judgment\" swing inappropriately close to this Court's indication in Oliver of the impropriety in saying the law of this State codifies divine law. Such remarks are not only misguided, they are misleading, particularly in the context of the prosecutor's argument here, where the lack of audible punctuation would contribute to the jury's confusion as to which words were statutory and which inspirational.\n\nAssuming error arguendo, however, it is plain in this case, as it has been in others, that these arguments were not so improper as to require intervention by the trial court ex mero motu. E.g., Hunt, 323 N.C. 407, 373 S.E.2d 400; Brown, 320 N.C. 179, 358 S.E.2d 1; Oliver, 309 N.C. 326, 307 S.E.2d 304.\n\nDefendant next contends that the trial court committed reversible error in denying defendant's motion for appropriate relief, which concerned the failure of the prosecutor to disclose the second of two pages of the medical examiner's report. The nondisclosed page was a one-paragraph summary of the circumstances surrounding Joann Brockman's death:\n\nPt. apparently left home at about 11:00 a.m. with Roscoe Artis. Was heard screaming later, but family members say they saw her at that time and she was alright. Did not return home. Was later found lying in the woods dead. Had some blood from her nose and some bruises on her neck.\n\nDefendant avers that this paragraph constitutes suppressed evidence \"material to guilt or punishment,\" Brady v. Maryland, 373 U.S. 83, 87, 10 L. Ed. 2d. 215, 218 (1963), and favorable to his defense, and that its nondisclosure amounts to a violation of his rights of due process under Brady.\n\nIn reviewing orders entered pursuant to N.C.G.S. § 15A-1415, which dictates the grounds for post-conviction relief, this Court is bound by the findings of fact of the trial court where they are supported by competent evidence. State v. Stevens, 305 N.C. 712, 291 S.E.2d 585 (1982). Among the trial court's findings underlying its denial of defendant's motion for appropriate relief were the following facts:\n\n10. That Dr. Kile [the medical examiner who had compiled the medical report and its summary] obtained his information for the narrative summary through Leveda Brown, who relayed information from the dispatcher and through Delois Patterson, mother of the deceased.\n\n11. That Detective Maynor [from whom Dr. Kile testified he had obtained his information] never stated to Dr. Kile that family members had heard Ms. Brockman scream but that she was alright; that Detective Maynor nor any other law enforcement officer had information to that effect and during the entire course of the investigation no family member ever told Detective Maynor or any other law enforcement officer that Brockman was seen alive after she was seen with the defendant.\n\n12. That Detective Maynor did not confirm the second sentence of the narrative summary with Dr. Kile.\n\nBased upon these and other findings of fact the trial court concluded, inter alia,\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e that insofar as the state's case relied most heavily on defendant's statements, the remainder of the testimony of its witnesses was merely corroborative, and that of Alice McLaughlin, the only witness who had testified as to Joann's cries for help, expendable. Citing State v. McDowell, 310 N.C. 61, 310 S.E.2d 301 (1984), vac. on other grounds sub nom., McDowell v. Dixon, 858 F.2d 945 (1988), the trial court concluded that \"there has been no showing that this information contained in the narrative summary . . . would have created in the jury's mind a reasonable doubt which did not otherwise exist as to defendant's guilt,\" nor as to the jury's consideration of aggravating circumstances and its subsequent recommendation of the death penalty.\n\nOur review of the record of the hearing on defendant's motion for appropriate relief reveals that the evidence strongly supports these findings and the conclusions of law that they underlie.\n\nThe information contained in the summary paragraph of the medical report was not of sufficient significance that its omission from defendant's arsenal of evidence would result in the denial of defendant's right to a fair trial. See United States v. Agurs, 427 U.S. 97, 108, 49 L. Ed. 2d. 342, 352 (1976). Nondisclosed information is material \"only if there is a reasonable probability that, had the evidence been disclosed to the defense, the result of the proceeding would have been different. A 'reasonable probability' is a probability sufficient to undermine confidence in the outcome.\" United States v. Bagley, 473 U.S. 667, 682, 87 L. Ed. 2d. 481, 494 (1985). This Court has stated that the issue of materiality \"hinges on two factors: (1) the strength of the evidence itself vis-a-vis the issue of guilt and (2) the magnitude of the evidence of guilt which the convicting jury heard.\" McDowell, 310 N.C. 61, 71, 310 S.E.2d 301, 308.\n\nDefendant argues energetically that the summary paragraph impeaches the testimony of Alice McLaughlin and Curtis McKinnon,\n\nif they were the \"family members\" mentioned in the summary paragraph. Not only does the paragraph so weaken the state's case, defendant argues, but it strengthens his own, bolstering his contention that someone else approached and strangled Joann Brockman after he hugged and left her. However, it is the burden of the moving party to prove by a preponderance of the evidence every fact essential to support his motion. N.C.G.S. § 15A-1420(c)(5) (1988). Giving imaginative reign to what the summary paragraph might imply is far from bearing this burden.\n\nIn the light of other evidence of defendant's guilt, including his inculpatory statements and his knowledge of the murder scene and of the location of Joann Brockman's body, the arguable exculpatory strength of this paragraph pales; any exculpatory significance it might otherwise have is dwarfed by comparison to inculpatory evidence. Furthermore, the record indicates that piecemeal and entirely derivative sources supplied the information in the medical examiner's summary paragraph. That these sources include an interview with the victim's mother, who was neither a witness nor present at any relevant time the morning of her daughter's murder, casts considerable doubt on the reliability of the facts the paragraph relates. That the officer who had actually interviewed family members who had been present denied that the details contained in the summary paragraph had come from him further erodes its reliability. Such evidence strongly sustains the trial court's order.\n\nWe conclude that the summary paragraph was not material evidence insofar as there is no reasonable probability that its disclosure to the defense would have caused the outcome of defendant's trial to be any different.\n\nPreservation Issues\n\nDefendant raises anew several issues upon which this Court has recently ruled. In most instances, defendant failed to object at pertinent points in his trial. Although defendant is procedurally barred from asserting these issues as error on appeal, N.C. Rules App. Proc. 10(b)(1), we have elected nonetheless to review even those errors to which defendant failed to object because this case involves a sentence of death. See State v. Oliver, 309 N.C. 326, 307 S.E.2d 304. Defendant does not argue that the facts of the case sub judice distinguish it from precedent; rather, he argues\n\nthat this Court's posture regarding these issues should be reversed. In each case we disagree and decline to do so.\n\nFirst, defendant takes issue with the requirement that mitigating circumstances must be found unanimously to exist. The result, he avers, is that circumstances found to be mitigating by some jurors may not be considered in the process of weighing circumstances in aggravation against circumstances in mitigation preliminary to deciding the appropriateness of a sentence of death. This, defendant continues, violates his right under the eighth amendment of the United States Constitution to have all mitigating evidence considered by the jury. See Mills v. Maryland, 486 U.S. 367, 100 L. Ed. 2d. 384 (1988). This Court held in State v. McKoy, 323 N.C. 1, 372 S.E.2d 12, that North Carolina's sentencing scheme is distinguishable from that found to be constitutionally infirm in Mills, as it allows for individualized sentencing and guards against an arbitrary and capricious infliction of the death penalty. Defendant has presented no reason to deviate from that conclusion.\n\nDefendant next complains that the trial court's denial of his motion for individual voir dire and sequestration of the jurors was error. This Court has repeatedly held that the trial court \"has broad discretion to see that a competent, fair and impartial jury is impaneled.\" State v. Johnson, 298 N.C. 355, 362, 259 S.E.2d 752, 757. See also State v. Reese, 319 N.C. 110, 353 S.E.2d 352 (1987); State v. Wilson, 313 N.C. 516, 330 S.E.2d 450 (1985). Such rulings of the trial court will not be reversed absent a showing that it has abused its discretion. Johnson, 298 N.C. 355, 259 S.E.2d 752. Defendant's speculation that the \"quick answers\" of the jurors opposing capital punishment in this case were an effort to avoid service does not suffice as such a showing. This assignment of error is therefore overruled.\n\nDefendant next urges this Court to overrule its holding that North Carolina's death penalty statute violates the eighth and fourteenth amendments to the United States Constitution and article I, sections 19 and 27 of the Constitution of this state. We have previously considered all grounds asserted by defendant upon which the death penalty statute of this state might violate constitutional rights and found them to be without merit. See, e.g., State v. Holden, 321 N.C. 125, 362 S.E.2d 513 (1987), cert. denied, 486 U.S. 1061, 100 L. Ed. 2d. 935 (1988) (death penalty not cruel and unusual punishment because jury has discretion whether to impose it); State Page 336} v. Robbins, 319 N.C. 465, 356 S.E.2d 279, cert. denied, 484 U.S. 918, 98 L. Ed. 2d. 226 (1987) (death penalty statute neither vague, overbroad, imposed in a discriminatory manner, nor involves subjective discretion). We do not now waver in the conviction that N.C.G.S. § 15A-2000 et seq. passes constitutional muster.\n\nDefendant next argues that his constitutional right under the eighth amendment to have mitigating circumstances fairly considered was impaired when the trial court instructed the jury that its \"duty\" was to impose the death penalty if it determined that the aggravating circumstances sufficiently outweighed circumstances found to be in mitigation and that the aggravating circumstances were sufficiently substantial to call for the imposition of the death penalty. In State v. McDougall, 308 N.C. 1, 301 S.E.2d 308, this Court specifically concluded that instructions substantially similar to those given by the trial court in the case sub judice satisfied both the requirements of N.C.G.S. § 15A-2000 and the holding in Lockett v. Ohio, 438 U.S. 586, 57 L. Ed. 2d. 973 (1978). Although this Court phrased a preferable, alternative order and form for these instructions, we have approved similar instructions before and since our holding in McDougall. See, e.g., Robbins, 319 N.C. 465, 356 S.E.2d 279; State v. Pinch, 306 N.C. 1, 292 S.E.2d 203. We here reiterate that approval and reaffirm the constitutional soundness of such instructions.\n\nDefendant next contends without argument or analysis that several prospective jurors were improperly excused for cause in violation of the standards set out in Witherspoon v. Illinois, 391 U.S. 510, 20 L. Ed. 2d. 776, and Wainwright v. Witt, 469 U.S. 412, 83 L. Ed. 2d. 841 (1985). Our review of the record of voir dire reveals that each juror excused for cause indicated that she or he would be unable to recommend a sentence of death regardless of circumstances. The trial court did not err in permitting excusal of each for cause.\n\nDefendant's next assignment of error likewise lacks merit. He argues, again with scant examples from the record, that the prosecutor exercised seven peremptory challenges to excuse potential jurors who expressed some hesitancy about their ability to return a sentence of death. Again, our careful review of the record reveals no hint of substantiation to defendant's contention that these jurors were at all hesitant about the death penalty or their ability to impose it under appropriate circumstances. Furthermore, in State Page 337} v. Allen, 323 N.C. 208, 372 S.E.2d 855, this Court recently restated the view that it is neither constitutionally nor otherwise improper to use peremptory challenges to strike veniremen who have voiced some qualms about imposing the death penalty. See also Robbins, 319 N.C. 465, 356 S.E.2d 279.\n\nFinally, defendant requests this Court to reexamine its holdings that a defendant is not deprived of due process of law because he bears the burden of proving a mitigating circumstance by a preponderance of the evidence. See, e.g., State v. Barfield, 298 N.C. 306, 259 S.E.2d 510 (1979), cert. denied, 448 U.S. 907, 65 L. Ed. 2d. 1137, reh'g denied, 448 U.S. 918, 65 L. Ed. 2d. 1181 (1980); State v. Johnson, 298 N.C. 47, 257 S.E.2d 597. This position has been recently reaffirmed in, e.g., State v. Lloyd, 321 N.C. 301, 364 S.E.2d 316, and defendant offers no new reason for this Court to consider that position to have been in error.\n\nOur review of the record and transcript of the penalty phase of the proceedings below leads us to conclude that, as in the guilt-innocence phase, defendant has received a fair trial free from prejudicial error.\n\nProportionality Review\n\nHaving determined that the guilt and sentencing phases of defendant's trial were free from prejudicial error, we now turn to our statutory duties pursuant to the mandate of N.C.G.S. § 15A-2000(d)(2). The statute sets forth a tripartite test as a check against the random or capricious imposition of the death penalty. State v. Jackson, 309 N.C. 26, 305 S.E.2d 703 (1983); State v. Hutchins, 303 N.C. 321, 279 S.E.2d 788 (1981). We must determine (1) whether the record supports the jury's finding of the aggravating circumstance or circumstances upon which it based the death sentence; (2) whether the sentence was imposed under the influence of passion, prejudice, or any other arbitrary factor; and (3) whether the sentence is excessive or disproportionate to the penalty imposed in similar cases. State v. Williams, 308 N.C. 47, 301 S.E.2d 335.\n\nWe consider the responsibility placed upon us by subdivision (d)(2) to be as serious as any responsibility placed upon an appellate court. Jackson, 309 N.C. 26, 305 S.E.2d 703; State v. Rook, 304 N.C. 201, 283 S.E.2d 732. Thus, we accord the review of capital cases our utmost care and diligence. State v. Pinch, 306 N.C. 1, 292 S.E.2d 203; State v. Smith, 305 N.C. 691, 292 S.E.2d 264, cert. Page 338} denied, 459 U.S. 1056, 74 L. Ed. 2d. 622 (1982), reh'g denied, 459 U.S. 1189, 74 L. Ed. 2d. 1031 (1983).\n\nWe have carefully reviewed the record on appeal, transcript, and exhibits in this case along with the briefs and oral arguments presented. After full and cautious deliberation, we conclude that the record fully supports the jury's finding of the aggravating circumstances submitted. Furthermore, we find no indication that the sentence of death was imposed under the influence of passion, prejudice, or any other arbitrary or impermissible factor.\n\nFinally, we undertake the solemn task of proportionality review, whereby we compare this case to cases in the proportionality pool which are \"roughly similar with regard to the crime and the defendant.\" State v. Lawson, 310 N.C. 632, 648, 314 S.E.2d 493, 503 (1984), cert. denied, 471 U.S. 1120, 86 L. Ed. 2d. 267 (1985). The pool includes all cases arising since 1 June 1977 which have been tried as capital cases and reviewed on direct appeal by this Court and in which the jury recommended death or life imprisonment or in which the trial court imposed life imprisonment after the jury failed to agree on a sentencing recommendation. Williams, 308 N.C. 47, 301 S.E.2d 335. The pool includes only those cases which have been affirmed by this Court as to both phases of the trial. Jackson, 309 N.C. 26, 305 S.E.2d 703. In making the comparison, we do not simply engage in rebalancing the aggravating and mitigating circumstances; rather, we are obligated to scour the entire record for all the circumstances of the case and the manner in which the defendant committed the crime, as well as the defendant's character, background, and mental and physical condition. State v. McLaughlin, 323 N.C. 68, 372 S.E.2d 49; Lawson, 310 N.C. 632, 314 S.E.2d 493. In so doing, we do not feel bound to give a citation to every case used for comparison. State v. Williams, 308 N.C. 47, 301 S.E.2d 335.\n\nIn this case the jury found the following three aggravating circumstances:\n\nDefendant had been previously convicted of a felony involving the use or threat of violence to the person. N.C.G.S. § 15A-2000(e)(3).\n\nThe murder was committed while defendant was engaged in the commission of a rape. N.C.G.S. § 15A-2000(e)(5).\n\nThe murder was especially heinous, atrocious or cruel N.C.G.S. § 15A-2000(e)(9).\n\nThe jury found one or more of the seven mitigating circumstances submitted\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e but did not specify which ones. Therefore, for purposes of proportionality review, we must assume that all seven of the mitigating circumstances were found. State v. Stokes, 319 N.C. 1, 352 S.E.2d 653.\n\nDefendant characterizes this case as typical of those in which the perpetrator killed his victim during or after the commission of a sexual assault. He then argues that a \"sheer numerical breakdown\" of the cases in the proportionality pool involving a sexual assault demonstrates that more than half of such cases yielded a jury recommendation of a life sentence.\n\nInitially we note that defendant's statistics are slightly inaccurate. Our research reveals that in murders involving sexual assaults, juries have actually recommended sentences of death in seven cases\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e while recommending sentences of life imprisonment in six.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e Thus, as we recognized in State v. Holden, 321 N.C. 125, 167,\n\n362 S.E.2d 513, 538, \"juries have tended to return death sentences in murder cases where the defendant also sexually assaulted his victim.\"\n\nIn so noting, we do not by any means advocate a strictly mathematical approach to our analysis. Numerical disparity, whether in favor of the state or in favor of the defendant, is not dispositive on proportionality review. State v. Greene, 324 N.C. 1, 376 S.E.2d 430 (1989); State v. Young, 312 N.C. 669, 325 S.E.2d 181 (1985). Although we compare this case to similar cases in the pool, our ultimate responsibility is to evaluate each case independently, considering the individual defendant and the nature of the crime or crimes he has committed. State v. Quesinberry, 325 N.C. 125, 381 S.E.2d 681 (1989). We therefore do not rely on statistics alone and find it more instructive to proceed with factual comparisons within the category of murders accompanied by sexual assault.\n\nDefendant contends that this case closely resembles the sexual assault murders in which the jury has recommended a life sentence. We disagree. Our review of the record reveals that each such case is readily distinguishable from the case at bar. Two of the cases, involving strong mitigation not present here, differ with respect to the character and condition of the defendant. In State v. Temple, 302 N.C. 1, 273 S.E.2d 273, the defendant was only eighteen years old at the time of the offense and had no significant history of prior criminal conduct. Here, by contrast, defendant was forty-three at the time of the offense and had an extensive criminal record which included a number of convictions for violent crimes, among them assault on a female with intent to commit rape in 1957, assault on a female in 1967, assault on a female in 1974, and assault with a deadly weapon in 1975. In the 1974 incident, defendant attempted to strangle a sixteen-year-old girl who had refused his sexual advances. In State v. Clark, 301 N.C. 176, 270 S.E.2d 425, there was considerable evidence that the defendant suffered from schizophrenia. Here, although defendant presented a modicum of evidence concerning his borderline mental retardation, there was absolutely no evidence that he suffered from a\n\nserious mental illness or emotional disorder when he committed the murder.\n\nThe remaining four life cases differ significantly from this case with respect to the nature of the crime, as reflected by specific jury findings. In State v. Fincher, 309 N.C. 1, 305 S.E.2d 685, State v. Franklin, 308 N.C. 682, 304 S.E.2d 579, and State v. Powell, 299 N.C. 95, 261 S.E.2d 114, the defendants were convicted solely upon the felony murder theory. Here defendant was convicted on theories of both felony murder and murder by premeditation and deliberation. The finding of premeditation and deliberation indicates a more cold-blooded and calculated crime. In State v. Prevette, 317 N.C. 148, 345 S.E.2d 159, the jury specifically rejected the aggravating circumstance that the murder was especially heinous, atrocious or cruel. Here, the jury found that circumstance, indicating a more brutal and torturous crime.\n\nWe note also that this case is not even remotely similar to those in which we have found the death sentence to be disproportionate.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e None of those cases involved the perpetration of a sexual assault in conjunction with the murder.\n\nWe now turn to a comparison with affirmed death penalty cases for the purpose of determining whether defendant's crime \"rise[s] to the level of those murders in which we have approved the death sentence upon proportionality review.\" State v. Brown, 320 N.C. 179, 220, 358 S.E.2d 1, 28. We have upheld the death sentence in a number of cases in which the jury has found that the murder was especially heinous, atrocious or cruel.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e The pool also includes numerous affirmed death penalty cases in which the jury found that the defendant had previously been convicted of\n\na felony involving the use of violence.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Although the presence of two of the aggravating circumstances which are most prevalent in death-affirmed cases is not in itself conclusive, it is one indication that the sentence was neither excessive nor arbitrarily imposed. The heinous, atrocious or cruel circumstance reflects upon the brutality of the crime and the suffering of the victim, while the prior violent felony circumstance reflects upon the defendant's character as a recidivist, two important factors in our consideration of the nature of the defendant and the crime.\n\nAgain we consider as most appropriate for case by case comparison those murders which also involved sexual assaults. The facts in this case, although brutal, do not demonstrate the level of extreme savagery present in some of the death-affirmed cases, most notably State v. Williams, 308 N.C. 47, 301 S.E.2d 335; State v. Smith, 305 N.C. 691, 292 S.E.2d 264; and State v. Rook, 304 N.C. 201, 283 S.E.2d 732. Nor did this case involve the murder of more than one person or the infliction of serious injuries upon more than one victim as in State v. McNeil, 324 N.C. 33, 375 S.E.2d 909; State v. Vereen, 312 N.C. 499, 324 S.E.2d 250; and State v. McDougall, 308 N.C. 1, 301 S.E.2d 308. For these reasons, we cannot draw meaningful comparisons with those six cases. However, this case has much in common with the two remaining death-affirmed cases, State v. Holden, 321 N.C. 125, 362 S.E.2d 513, and State v. Zuniga, 320 N.C. 233, 357 S.E.2d 898.\n\nIn Holden the victim, who was extremely intoxicated, rode in the defendant's car as he drove some acquaintances home from a nightclub. During the car ride, the defendant intimated to another passenger that he intended to have sexual relations with the victim. He further commented that he might have to kill her in order to do so. Some hours later, the victim was discovered on a dirt\n\npath near a rural road, partially undressed, with her throat slit and a gunshot wound to the neck.\n\nThe jury found three aggravating circumstances: that the murder was committed to avoid lawful arrest, that the murder was committed during the perpetration of an attempted rape, and that the defendant had previously been convicted of a violent felony. Although it found five mitigating circumstances, the jury recommended a sentence of death.\n\nWe find this case to be strikingly similar to Holden with respect to the number and nature of the aggravating and mitigating circumstances found. In spite of these similarities, defendant argues that his case is not comparable to Holden because his crime was not as cold and calculating. While we agree that defendant's crime displayed a far lesser degree of planning and calculation, we nonetheless conclude that it rises to the level of the crime in Holden. This defendant's crime was significantly more torturous to the victim both physically and psychologically, given the nature of the prolonged attack and the fact that the victim was alert and aware at the time of the attack rather than intoxicated and semi-conscious as was the victim in Holden.\n\nThis case is also similar in many respects to Zuniga. In Zuniga, the evidence tended to show that the defendant isolated his seven-year-old victim in the woods near her grandfather's farm. He raped the child and stabbed her twice in the neck, then left her to die hidden in an area of thick undergrowth. An autopsy revealed some scratches on the child's neck and a number of petechial pinpoint injuries, indicating pressure on the neck or chest caused by strangulation. Death was not immediate and the child would have suffered for a period of \"some minutes.\" The jury found as the sole aggravating circumstance that the murder was committed while the defendant was engaged in the commission of a rape. It found seven of the twelve mitigating circumstances submitted but concluded that they were insufficient to outweigh the aggravating circumstance.\n\nWe find the circumstances of Zuniga, including the type and extent of the injuries inflicted and the duration of the victim's suffering, to be roughly comparable to those in the present case. Here defendant attacked the victim in an isolated area, forcibly dragged her into the woods, and beat (rather than stabbed) her into submission. He then raped and strangled her, abandoning her body in the woods after an attempt to conceal it with dirt, leaves and\n\nvines. The victim suffered for up to five minutes as she drowned in her own blood.\n\nWhile the murder of a young child particularly shocks the conscience and was a heavy factor to be weighed against the defendant in Zuniga, the fact that this case involved a teenaged victim instead of a child does not alter our conclusion. Other factors in this case weigh just as heavily against this defendant, in particular the jury's finding of two aggravating circumstances not present in Zuniga.\n\nWe cannot say that defendant is any less deserving of the death penalty than the defendants in Holden and Zuniga. As a general rule, the decision of the jury in recommending a sentence of death should be accorded great deference. State v. Quesinberry, 325 N.C. 125, 381 S.E.2d 681 (1989); State v. Greene, 324 N.C. 1, 376 S.E.2d 430; State v. Goodman, 298 N.C. 1, 257 S.E.2d 569. The purpose of our review is merely to eliminate the possibility that a defendant will be sentenced to death by an aberrant jury. State v. Holden, 321 N.C. 125, 362 S.E.2d 513.\n\nThe evidence in this case depicts a vicious, lust-driven, dehumanizing crime perpetrated by a defendant with a history of violent conduct toward teenaged girls. After he rendered the victim helpless by striking her repeatedly with a stick as thick as his wrist, defendant wrapped his hands around her throat and slowly choked the life out of her as he violently raped her. The attack was brutal and relentless. Defendant displayed no remorse or contrition for his act and attempted to conceal the body before casually strolling home for a nap.\n\nThe nature of this crime and this defendant are such that we cannot conclude that the jury's recommendation was aberrant. We hold as a matter of law that the death sentence imposed against defendant is not disproportionate within the meaning of N.C.G.S. § 15A-2000(d)(2). Upon this holding, the death sentence is affirmed. This Court has no discretion in determining whether a death sentence should be vacated. State v. Robbins, 319 N.C. 465, 356 S.E.2d 279 (1987).\n\nIn all phases of the trial below, we find\n\nNo error.\n\nDisposition\n\nNo error.\n\nChief Justice Exum dissenting.\n\nBelieving that there is reversible error in both the guilt and sentencing phases of this capital case, I dissent and vote for a new trial.\n\nGuilt Phase\n\nThe majority assumes without deciding that it was error to admit the testimony of Billie Ann Woods that defendant had attempted to assault her sexually approximately nine years before the event for which defendant was being tried. I believe the admission of the evidence was error because of the remoteness in time of the earlier offense. State v. Jones, 322 N.C. 585, 369 S.E.2d 822 (1988) (evidence of prior sexual assault improperly admitted in rape prosecution when prior assault occurred seven years before the rape); State v. Scott, 318 N.C. 237, 347 S.E.2d 414 (1986) (evidence of prior sexual conduct improperly admitted in first degree sex offense prosecution when prior conduct occurred nine years before the first degree sex offense). The majority holds that it was error to permit defendant to be cross-examined regarding his convictions for assault on a female in 1957 and in 1967. Yet, because it characterizes the case against defendant as overwhelming, the majority concludes there is no reasonable possibility that these errors affected the outcome of the trial. I cannot concur with the majority's assessment that the case against defendant is so overwhelming that there is no reasonable possibility these errors would have affected the outcome of the trial. I would hold these errors entitle defendant to a new trial.\n\nI do not view the case against defendant as overwhelming. The evidence leaves some room for doubt as to whether defendant perpetrated the murder. As the majority says, the State relied primarily on an inculpatory statement purportedly made before trial by defendant to investigating officers; defendant's statements and actions tending to indicate that he was familiar with the crime scene; and bloodstains on defendant's shirt which matched the blood of the victim.\n\nDefendant, though, offered considerable evidence in support of his innocence. Defendant testified in his own behalf and denied his guilt of the crime. He also offered evidence tending to corroborate his testimony. One of defendant's witnesses, Curtis Blackmon, testified that on the morning the deceased was killed\n\nhe observed the deceased and defendant come from behind a building. Defendant walked toward the ABC store, where a car picked him up and drove away. Blackmon then saw the victim and another man, whom he had earlier observed with the victim at a club, go together behind a barn in the area. Defendant's testimony as recited in the majority opinion, if believed, explains how the victim's blood on his shirt and his knowledge of the crime scene could be consistent with his innocence.\n\nIn light of these conflicts in the evidence and the evidence tending to support defendant's innocence, there is to me a reasonable possibility that had evidence of defendant's prior crimes not been admitted there might have been a different outcome at his trial. This kind of evidence has a powerfully negative impact on the jury vis-a-vis the defendant as the jury contemplates the question of whether defendant is guilty.\n\nProof that a defendant has been guilty of another crime equally heinous prompts to a ready acceptance of and belief in the prosecution's theory that he is guilty of the crime charged. Its effect is to predispose the mind of the juror to believe the prisoner guilty, and thus effectually to strip him of the presumption of innocence.\n\nState v. Thomas, 310 N.C. 369, 372, 312 S.E.2d 458, 460 (1984), quoting State v. McClain, 240 N.C. 171, 174, 81 S.E.2d 364, 366 (1954), in turn quoting State v. Gregory, 191 S.C. 212, 220-21, 4 S.E.2d 1, 4 (1939).\n\nSentencing Phase\n\nIn my view it was wrong for the prosecutor to argue to the jury that it should decide the question of sentence \"without sympathy.\" The danger is that such an argument may violate the eighth amendment as it was interpreted in California v. Brown, 479 U.S. 538, 93 L. Ed. 2d. 934 (1987). Under consideration in Brown was a California penalty phase jury instruction for capital trials which admonished the jury not to be \"swayed by mere sentiment, conjecture, sympathy, passion, prejudice, public opinion or public feeling.\" Id. at 539, 93 L. Ed. 2d. at 938. In a five to four decision the United States Supreme Court found that the instruction was not objectionable insofar as it admonished the jury not to consider \"mere . . . sympathy\" largely because the word \"mere\" distinguished groundless sympathy from the sympathy arising from defendant's\n\nevidence of mitigating factors. The Court concluded that reasonable jurors would construe the instruction as a directive \"to ignore only the sort of sympathy that would be totally divorced from the evidence adduced during the penalty phase.\" Id. at 542, 93 L. Ed. 2d. at 940. Justice O'Connor in her concurring opinion in Brown, 479 U.S. at 545-46, 93 L. Ed. 2d. at 942-43, noted:\n\n[O]ne difficulty with attempts to remove emotion from capital sentencing through instructions such as those at issue . . . is that juries may be misled into believing that mitigating evidence about a defendant's background or character also must be ignored. . . . On remand, the California Supreme Court should determine whether the jury instructions, taken as a whole, and considered in combination with the prosecutor's closing argument, adequately informed the jury of its responsibility to consider all of the mitigating evidence introduced by the respondent.\n\n(Emphasis supplied.)\n\nThe teaching of Brown is that it is proper for a jury to base its sentencing decision in a capital case upon sympathy which is derived from the evidence in the case regarding defendant's background, character or the crime itself, but it is improper for a jury to base its decision upon mere sympathy or emotion which has no grounding in the evidence. As one federal court of appeals, sitting en banc, has put it:\n\nMitigating evidence about a defendant's background or character is not limited to evidence of guilt or innocence, nor does it necessarily go to the circumstances of the offense. Rather, it can include an individualized appeal for compassion, understanding, and mercy as the personality of the defendant is fleshed out and the jury is given an opportunity to understand, and to relate to, the defendant in normal human terms.\n\nParks v. Brown, 860 F.2d 1545, 1555 (10th Cir. 1988). Brown teaches that if what is said to a jury about avoiding considerations of sympathy could reasonably cause the jury to ignore appropriate mitigating circumstances, then the defendant's eighth amendment right to have all such circumstances considered by the sentencer is violated. See State v. Ramseur, 106 N.J. 123, 524 A.2d 188 (1987).\n\nWhile sympathy for a criminal defendant has no place in the jury's determination of defendant's guilt, it does have a proper\n\nplace, if grounded in the mitigating evidence, in the jury's determination of whether defendant shall suffer life imprisonment or die for his crime.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e In the instant case, for example, I think it would have been appropriate for the jury to base its sentencing decision in part on whatever sympathy, if any, it might have felt toward defendant arising from the evidence regarding his impaired capacity, mental retardation, abnormal parental relationship and abuse by his family during his formative years. The jury, of course, is not required to feel (and may not have felt in this case) any sympathy at all simply because this kind of evidence is introduced. But the jury ought not to be told either in closing argument by counsel or in instructions by the court that such sympathy as it might feel, grounded in this kind of evidence, can have no bearing on its sentence determination.\n\nBefore Brown, state courts were divided on the \"sympathy instruction\" issue, see Ramseur, 106 N.J. 123, 298, 524 A.2d 188, 277, at n.71; but the better reasoned decisions, particularly in light of Brown, held that jury instructions which precluded the jury from basing their sentencing decision on sympathy were error entitling defendant to a new sentencing hearing. Legare v. State, 250 Ga. 875, 302 S.E.2d 351 (1983); State v. Quinlivan, 81 Wash.2d 124, 499 P.2d 1268 (1972). The Georgia Supreme Court said:\n\nThus this jury was charged to consider in mitigation all circumstances which in fairness or mercy offer a basis for not imposing the death penalty, a charge the substance of which is constitutionally required. But the jury was also charged not to base their verdict on sympathy for the defendant. Since the evidence in mitigation might well evoke sympathy, we find these charges in irreconcilable conflict. Because the charge complained of might well confuse the jury and limit their constitutionally\n\nrequired consideration of evidence in mitigation, we hereby disapprove it.\n\n250 Ga. at 878, 302 S.E.2d at 354. The Washington Court said:\n\nContrary to this implication in the instructions, sympathy is an appropriate factor in the jury's consideration of the penalty issue. On remand it should be made clear to the jury (1) that considerations of sympathy are to be excluded only from that portion of the verdict relating to guilt or innocence; and (2) that sympathy may properly be considered as a factor in the determination of the penalty issue.\n\n81 Wash. 2d at 130, 499 P.2d at 1272 (citations omitted).\n\nSince the prosecutor's argument on this point was an isolated, single incident, not objected to by defendant, and since appropriate jury instructions were given by the trial court on the duty of the jury to consider appropriate mitigating circumstances, I agree with the majority that this error in the prosecutor's argument does not warrant a new sentencing hearing. See Ramseur, 106 N.J. 123, 524 A.2d 188.\n\nI do think it was reversible error for the prosecutor to be permitted to argue:\n\nLook at Roscoe Artis over there, Ladies and Gentlemen of the Jury. You watched him throughout the trial. Is this a man of remorse? Is this a man of contrition? You have observed him on the stand. You have observed him sitting here in the courtroom, now for almost two weeks. Have you seen the first sign of contrition about him? Have you seen the first sign of remorse about him to show there's a conscience somewhere in that head or body working on him?\n\nI believe this argument was so egregiously wrong as to require the trial court to intervene on its own motion. As defendant correctly contends, \"at the very least the prosecutor's remarks place defendant in the incongruous position of appearing unremorseful about a crime that he swears that he did not commit.\" For this reason other courts have held similar arguments to be reversible error. State v. Johnson, 293 S.C. 321, 360 S.E.2d 317 (1987); Owen v. State, 656 S.W.2d 458 (Tex. Crim. App. 1983). In Johnson the prosecutor argued during the guilt phase of a capital trial that defendant had shown no remorse for his crime. In granting a new trial, the South Carolina Supreme Court said:\n\nWe hold the solicitor's improper reference to appellant's lack of remorse was error because it was a comment upon his constitutional right to plead not guilty and put the state to its burden of proof. It would be an irreconcilable equivocation for the accused to plead not guilty, present a defense, and simultaneously express remorse for acts he denied committing . . . . Comments by the prosecution upon an accused's failure to express remorse invite the jury to draw an adverse inference merely because the defendant did not appear penitent.\n\n293 S.C. at 324, 360 S.E.2d at 319. In Owen the prosecutor argued during the punishment stage of a noncapital trial, \"I would submit to you that the first step in rehabilitating somebody, the first step in granting somebody probation, is for him to at least say that he is sorry for what happened.\" In reversing and remanding (presumably for a new sentencing proceeding), the Texas Court of Criminal Appeals said:\n\nThe State urges that it was not error for the prosecutor to comment on appellant's failure to express remorse or sorrow . . . . Acceptance of the State's argument would place an accused in the paradoxical position of saying I am sorry for a crime of which I am not guilty.\n\n656 S.W.2d at 459.\n\nIn concluding that no error was committed, the majority relies on State v. Brown, 320 N.C. 179, 358 S.E.2d 1 (1987). In Brown defendant's counsel had argued to the jury that defendant sympathized with the deceased's widow. The State's argument was in answer to the argument by defendant's counsel. Further, in Brown defendant's only argument was that lack of remorse is an irrelevant factor and to permit it to be argued as a reason for imposing the death sentence is tantamount to permitting the State to use an aggravating factor not authorized by our capital sentencing statute. The Court answered this argument by saying: \"Here, however, the State made no attempt to submit this characteristic as an aggravating circumstance.\" 320 N.C. at 199, 358 S.E.2d at 15. The Court did not address in Brown, nor does the majority here answer, defendant's contention that such argument impermissibly compromises defendant's right to plead not guilty and to stand by this plea throughout the proceedings and, thereby, denies him due process.\n\nFinally, if in the sentencing phase the Court were addressing for the first time the mitigating circumstance unanimity instruction issue, I would agree with defendant's position that these instructions violate the eighth amendment to the federal constitution as that amendment was interpreted in Mills v. Maryland, 486 U.S. 367, 100 L. Ed. 2d. 384 (1988), for the reasons stated in my dissenting opinions in State v. McKoy, 323 N.C. 1, 372 S.E.2d 12 (1988), cert. granted, U.S. , 103 L. Ed. 2d. 180 (1989), and State v. Allen, 323 N.C. 208, 372 S.E.2d 855 (1988). The majority's position on this issue is, as a result of the Court's decisions in McKoy and Allen, the law of this State to which I am now bound. For this reason I concur with the majority's treatment of this issue.\n\nJustice Frye dissenting as to sentencing phase only.\n\nI concur in the result reached by the Court as to the guilt phase of defendant's trial. I dissent only as to the sentencing phase of the trial.\n\nOne of the preservation issues raised by defendant relates to the applicability of the United States Supreme Court's decision in Mills v. Maryland, 486 U.S. 367, 100 L. Ed. 2d 384 (1988), to the unanimity requirement for mitigating circumstances in determining whether death is the appropriate punishment in a given case. This issue is now pending before the Supreme Court of the United States. See State v. McKoy, 323 N.C. 1, 372 S.E.2d 12 (1988), cert. granted, U.S. , 103 L. Ed. 2d. 180 (1989). I continue to believe that Mills is applicable to North Carolina. See State v. Lloyd, 321 N.C. 301, 364 S.E.2d 316, vacated and remanded on other grounds, 486 U.S. , 102 L. Ed. 2d 18, reinstated, 323 N.C. 622, 374 S.E.2d 277 (1988) (Exum, C.J., and Frye, J., dissenting). Based on Mills, I therefore dissent from that portion of the Court's opinion which rejects defendant's request for a new sentencing hearing.\n\n\u003cspan class=\"fn\"\u003e1. The state does not argue this evidence might have been admissible under Rule 404(b). In State v. Morgan, 315 N.C. 626, 340 S.E.2d 84 (1986), this Court analyzed similar evidence under both 608(b) and 404(b) because it was not apparent under which rule the trial court had admitted the evidence of prior convictions, and because the state argued both in the alternative. This case is distinguishable because the trial court's analysis of the admissibility of the convictions clearly tracks Rule 609 and because the state fails to argue admissibility under 404(b).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. We recognize in passing that the state did in fact present evidence of the victim's fear prior to the strangulation. A witness testified that she heard Joann cry for help three times, and defendant's own statement admitted that after he hit her twice with a stick, she obeyed his order to remove her clothes because she was afraid of him. However, for the purposes of this opinion, we assume that defendant's actions prior to the strangulation, like the actions of the defendants in Moose and Stanley, were insufficient to support a reasonable inference that the victim feared imminent death.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The trial court analyzed the question, argued energetically by the parties in their briefs before this Court, whether the prosecutor is chargeable with information obtained by the office of the chief medical examiner, as, for example, it is chargeable with information in the hands of investigating officers. See Brady, 373 U.S. 83, 10 L. Ed. 2d. 215. We see no need to reach this question. Nor need we speculate as to how the medical examiner might have misconstrued information available to both parties to arrive at his version of the events leading to Joann Brockman's death.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The mitigating circumstances submitted were the following: (1) The capacity of Roscoe Artis to appreciate the criminality of his conduct or to conform his conduct to the requirements of the law was impaired. N.C.G.S. § 15A-2000(f)(6). (2) The defendant, Roscoe Artis, is bordering on mild mental retardation with a full scale intelligence quotient of 67. (3) Roscoe Artis is an illegitimate child and experienced less than normal relationships with his mother and father. (4) Roscoe Artis was gainfully employed on October 22, 1983. (5) Roscoe Artis has done prior good works. (6) Roscoe Artis in his formative years was subjected to abuse by his family. (7) Any other circumstance or circumstances arising from the evidence which you the jury deem to have mitigating value. N.C.G.S. § 15A-2000(f)(9).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. State v. Holden, 321 N.C. 125, 362 S.E.2d 513; State v. Zuniga, 320 N.C. 233, 357 S.E.2d 898; State v. Vereen, 312 N.C. 499, 324 S.E.2d 250, cert. denied, 471 U.S. 1094, 85 L. Ed. 2d. 526 (1985); State v. Williams, 308 N.C. 47, 301 S.E.2d 335; State v. McDougall, 308 N.C. 1, 301 S.E.2d 308; State v. Smith, 305 N.C. 691, 292 S.E.2d 264; State v. Rook, 304 N.C. 201, 283 S.E.2d 732.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. State v. Prevette, 317 N.C. 148, 345 S.E.2d 159; State v. Fincher, 309 N.C. 1, 305 S.E.2d 685 (1983); State v. Franklin, 308 N.C. 682, 304 S.E.2d 579 (1983); State v. Temple, 302 N.C. 1, 273 S.E.2d 273 (1981); State v. Clark, 301 N.C. 176, 270 S.E.2d 425 (1980); State v. Powell, 299 N.C. 95, 261 S.E.2d 114 (1980). We do not include State v. Davis, 305 N.C. 400, 290 S.E.2d 574 (1982), cited by defendant, because our review of the record on appeal in that case reveals that there was no evidence of a sexual assault.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. State v. Benson, 323 N.C. 318, 372 S.E.2d 517 (1988); State v. Stokes, 319 N.C. 1, 352 S.E.2d 653; State v. Rogers, 316 N.C. 203, 341 S.E.2d 713 (1986); State v. Young, 312 N.C. 669, 325 S.E.2d 181; State v. Hill, 311 N.C. 465, 319 S.E.2d 163 (1984); State v. Bondurant, 309 N.C. 674, 309 S.E.2d 170; State v. Jackson, 309 N.C. 26, 305 S.E.2d 703.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The jury found the heinous, atrocious or cruel circumstance in twenty-one of the forty-one death-affirmed cases in the pool. See list in State v. Greene, 324 N.C. 1, 28, 376 S.E.2d 430, 446-47, fn 3. See also State v. Huff, 325 N.C. 1, 381 S.E.2d 635 (1989); State v. Laws, 325 N.C. 81, 381 S.E.2d 609 (1989); State v. McNeil, 324 N.C. 33, 375 S.E.2d 909; State v. Fullwood, 323 N.C. 371, 373 S.E.2d 518 (1988).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. In thirteen of the cases, the jury found that the defendant had been previously convicted of a prior violent felony under N.C.G.S. § 15A-2000(e)(3). See list in State v. Greene, 324 N.C. 1, 28, 376 S.E.2d 430, 446, fn 3; see also State v. Huff, 325 N.C. 1, 381 S.E.2d 635 (1989); State v. McNeil, 324 N.C. 33, 375 S.E.2d 909; State v. Hunt, 323 N.C. 407, 373 S.E.2d 400 (defendant Hunt); State v. McLaughlin, 323 N.C. 68, 372 S.E.2d 49; State v. McKoy, 323 N.C. 1, 372 S.E.2d 12. In two cases, the jury found that the defendant had been previously convicted of a prior capital felony under N.C.G.S. § 15A-2000(e)(2). Hunt, 323 N.C. 407, 373 S.E.2d 400 (defendant Barnes); State v. Cummings, 323 N.C. 181, 372 S.E.2d 541. We consider the aggravating circumstance of section (e)(2) sufficiently analogous to section (e)(3) for purposes of this review. Greene, 324 N.C. at 29, 376 S.E.2d at 447, fn 5.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. This Court acknowledged as much when it said in State v. Oliver, 309 N.C. 326, 360, 307 S.E.2d 304, 326 (1983): During the guilt phase of a trial, the focus is on guilt versus innocence. Mercy is not a consideration, just as prejudice, pity for the victim, or fear may be an inappropriate basis for a jury decision as to guilt or innocence. Arguments which emphasize these factors are properly deemed prejudicial. However, during sentencing, considerations are different. The emphasis is on the circumstances of the crime and the character of the criminal. (Citations omitted.)\u003c/span\u003e\n\n",
    "body_length": 155008,
    "citedas": [
      "325 N.C. 278",
      "384 S.E.2d 470"
    ],
    "attorneys": "Lacy H. Thornburg, Attorney General, by Joan H. Byers, Special Deputy Attorney General, and Debra C. Graves, Associate Attorney General, for the state. Malcolm Ray Hunter, Jr., Appellate Defender, by Gordon Widenhouse, Assistant Appellate Defender, for defendant.",
    "category": [
      "36",
      "78"
    ],
    "judges": "Martin, Justice. Chief Justice Exum dissenting. Justice Frye dissenting as to sentencing phase only.",
    "citation_count": 239
  }
}
