{
  "id": "bIjqP2YBTlTomsSBolCo",
  "document": {
    "title": "Adamson v. Ricketts",
    "full_title": "JOHN HARVEY ADAMSON -APPELLANT, v. JAMES G. RICKETTS, DIRECTOR, ARIZONA DEPARTMENT OF CORRECTIONS, ET AL. -APPELLEES",
    "jurisdiction": "Ninth Circuit",
    "date": "1988-12-22T00:00:00.000Z",
    "docket": "No. 84-2069",
    "body": "FERGUSON, Circuit Judge:\n\nJohn Harvey Adamson filed a petition for a writ of habeas corpus in district court after exhausting all of his state remedies. He contends that his death sentence after a conviction of first degree murder violated various provisions of the federal Constitution. The district court denied his petition, and a three-judge panel of this court affirmed the denial. Adamson v. Ricketts, 758 F.2d 441 (9th Cir. 1985). That decision was vacated when the majority of the judges of the circuit voted to have the appeal determined by an en banc panel. This panel then reversed the district court on double jeopardy grounds and directed the issuance of a writ of habeas corpus. Adamson v. Ricketts, 789 F.2d 722 (9th Cir. 1985) (en banc). We specifically declined at that time to decide the other issues presented by the petition. Id. at 725. The Supreme Court granted certiorari and reversed on the double jeopardy issue. Ricketts v. Adamson, 483 U.S. 1, 107 S. Ct. 2680, 97 L. Ed. 2d 1 (1987). We are now required to address the other issues which were reserved for determination. We affirm the district court in part, reverse in part, and remand with instructions.\n\nI.\n\nAdamson was arrested and charged with the June 2, 1976 car bombing murder in Arizona of Donald Bolles, an investigative reporter. A preliminary hearing was held on June 21, 1976, at which time a justice of the peace found probable cause to hold Adamson for first degree murder. In January 1977, after jury selection for his trial was underway, Adamson and the State entered into a plea agreement. Under the terms of the agreement, Adamson would testify against two other individuals who allegedly had hired him to commit the murder and would plead guilty to second degree murder. In exchange, Adamson would receive a sentence of 48-49 years imprisonment, with a total incarceration time of 20 years and 2 months.\n\nOn January 15, 1977, a hearing was held before Superior Court Judge Ben Birdsall. At that time, Judge Birdsall stated that he had reviewed the preliminary hearing transcript, police reports, supplements, and witness statements in the case. He questioned Adamson as to the factual basis of his guilt, and accepted the plea of guilty to second degree murder. He delayed acceptance of the sentencing provisions of the plea agreement, however, until he could determine the appropriateness of the sentence. Four days later, after having reviewed the presentence report, the preliminary hearing transcript, and the other information before him, Judge Birdsall concluded that the negotiated term of years was appropriate and accepted the sentence.\n\nFor three years following the court's acceptance of Adamson's plea and the provisions of the plea agreement, Adamson cooperated with authorities. On the basis of Adamson's testimony, Max Dunlap and James Robison were convicted of conspiracy and first degree murder, for which they were each sentenced to 29-30 years and the death penalty, respectively. While the Dunlap and Robison convictions were pending on appeal, the State moved to have Adamson's sentence imposed. Judge Birdsall sentenced Adamson to the agreed term of 48-49 years on December 7, 1978.\n\nOn February 25, 1980, the Arizona Supreme Court reversed the convictions of Dunlap and Robison and remanded the cases for new trials. State v. Dunlap, 125 Ariz. 104, 608 P.2d 41 (1980); State v. Robison, 125 Ariz. 107, 608 P.2d 44 (1980). When the State sought to secure Adamson's testimony in the retrials, Adamson's lawyer responded with a letter to the State dated April 3, 1980, which stated that his client believed that his obligations under the plea agreement were terminated once he was sentenced. The letter further stated that Adamson requested additional consideration, including release, in exchange for his testimony at the retrials. The State, in a letter to Adamson's attorneys dated April 9, 1980, stated that it considered the plea agreement to still be in effect. The State further wrote that Adamson's refusal to comply with its terms constituted a breach of the agreement. It also stated that, due to this refusal, \"the state may now institute proceedings necessary to carry into effect those things noted in the plea agreement that result from a violation,\" including reinstatement of the first degree murder charge and \"its possible punishment of death.\"\n\nShortly thereafter, on April 18, 1980, and again on April 22, 1980, the State called Adamson as a witness at a pretrial proceeding for the Dunlap and Robison retrials. Adamson reconfirmed his previous testimony concerning the Bolles killing, but asserted a Fifth Amendment privilege when questioned about another crime. After examining the State's letter of April 9, 1980, Superior Court Judge Robert L. Myers denied the State's motion to compel Adamson to testify. Judge Myers concluded that Adamson could legitimately assert his Fifth Amendment rights unless the State granted him immunity from prosecution. Although the State sought review of Judge Myers' denial of the motion to compel Adamson to testify, the Arizona Supreme Court declined to accept jurisdiction of the Special Action Petition. Adamson v. Superior Court, 125 Ariz. 579, 582, 611 P.2d 932, 935 (1980).\n\nFollowing this, on May 8, 1980, the State filed a new information charging Adamson with first degree murder. Id. Adamson challenged this by a Special Action in the Arizona Supreme Court. 125 Ariz. at 579, 611 P.2d at 933. The court held that Adamson, by refusing to testify, breached the plea agreement and that he had waived the defense of double jeopardy. Id. at 584, 611 P.2d at 937. The court vacated Adamson's second degree murder sentence, judgment of conviction, and guilty plea and reinstated the open murder charge. Following that decision, Adamson offered to accept the State's version of the agreement and testify against Dunlap and Robison. The State refused Adamson's offer and proceeded with the charge of first degree murder while apparently dropping its efforts to retry Dunlap and Robison.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nAdamson unsuccessfully sought federal habeas corpus review pursuant to 28 U.S.C. § 2254. This court affirmed in an unpublished memorandum disposition the district court's denial of the petition. Thereafter, on October 17, 1980, Adamson was convicted by a jury of first degree murder. A sentencing hearing was held on November 14, 1980.\n\nAt the hearing, Judge Birdsall, acting pursuant to Arizona Revised Statute Annotated (\"A.R.S.\") § 13-703,\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e concluded that two aggravating circumstances were present. Those circumstances were: (1) the defendant committed the offense as consideration for the receipt, or in expectation of the receipt, of anything of pecuniary value, A.R.S. § 13-703(F)(5), and (2) the defendant committed the offense in an \"especially cruel, heinous and depraved manner,\" § 13-703(F)(6). Judge Birdsall also found that Adamson had not established the existence of any mitigating circumstances beyond a reasonable doubt. He then sentenced Adamson to death. The Arizona Supreme Court affirmed Adamson's death sentence, holding that the facts adduced at the sentencing proceeding supported the finding of both the (F)(5) pecuniary gain aggravating circumstances and the \"cruelty\" portion of (F)(6)'s \"heinous, cruel, or depraved\" circumstance. State v. Adamson, 136 Ariz. 250, 665 P.2d 972, cert. denied, 464 U.S. 865, 78 L. Ed. 2d 178, 104 S. Ct. 204 (1983). Adamson then instituted the present federal habeas corpus proceeding.\n\nThe issues before this court are: (1) whether seeking or imposing the death penalty following Adamson's assertion of his Fifth Amendment right constitutes prosecutorial or judicial vindictiveness, respectively; (2) whether imposition of a death sentence by the judge who earlier found imprisonment an appropriate penalty for the same acts violated the Eighth Amendment prohibition against arbitrary and capricious sentencing in capital cases; (3) whether the Arizona statute violates the Sixth Amendment right to a jury determination of the elements of an offense by requiring the judge to make factual findings regarding aggravating circumstances; (4) whether the Arizona statute's aggravating factor that the offense was committed in an especially heinous, cruel or depraved manner is unconstitutionally vague as construed by the Arizona Supreme Court; (5) whether the Arizona statute violates the Eighth Amendment by precluding meaningful consideration of all mitigating evidence and by imposing a presumption of death; and (6) whether the admission of certain evidence at trial violated the Confrontation Clause.\n\nII.\n\nThe Due Process Clause of the Fourteenth Amendment guarantees against judicial and prosecutorial vindictiveness. Thus, a defendant may not be penalized by the imposition of a harsher sentence simply for exercising a right to appeal. North Carolina v. Pearce, 395 U.S. 711, 723-26, 23 L. Ed. 2d 656, 89 S. Ct. 2072 (1969). Similarly, a prosecutor cannot increase the charges against a defendant in retaliation for the defendant's assertion of a statutory right. Blackledge v. Perry, 417 U.S. 21, 27, 40 L. Ed. 2d 628, 94 S. Ct. 2098 (1974) (extending the rule in Pearce to protect the accused against prosecutorial vindictiveness).\n\nAdamson contends the 1980 decisions to seek and impose the death penalty against him for the same acts that earlier merited a term of years were vindictively motivated. We find the evidence insufficient to show that Adamson's death sentence was vindictively imposed by the sentencing judge. We thus reject his claim of judicial vindictiveness.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e We do find merit, however, in his claim that the circumstances surrounding the State's decision to seek the death penalty raise a presumption of prosecutorial vindictiveness sufficient to require an evidentiary hearing on the matter.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nNo actual showing of malice or retaliatory motive is necessary to assert a vindictive prosecution claim. Blackledge, 417 U.S. at 28; see also United States v. Burt, 619 F.2d 831, 836 (9th Cir. 1980). Rather, vindictiveness will be presumed when the circumstances surrounding the prosecutorial decision at issue create the appearance of vindictiveness.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e United States v. Robison, 644 F.2d 1270, 1272 (9th Cir. 1981); see also United States v. Griffin, 617 F.2d 1342, 1347 (9th Cir.), cert. denied, 449 U.S. 863, 66 L. Ed. 2d 80, 101 S. Ct. 167 (1980) (mere appearance of vindictiveness may give rise to presumption sufficient to establish due process violation); United States v. Groves, 571 F.2d 450, 453 (9th Cir. 1978) (\"it is the appearance of vindictiveness rather than vindictiveness, in fact, which controls\") (emphasis in original). A presumption arises whenever \"it reflects the very real likelihood of actual vindictiveness\" on the part of the prosecution. United States v. Martinez, 785 F.2d 663, 668 (9th Cir. 1986) (quoting United States v. Gallegos-Curiel, 681 F.2d 1164, 1167 (9th Cir. 1982)).\n\nThe circumstances surrounding the State's decision to seek the death penalty for Adamson clearly reflect the real likelihood of actual vindictiveness and thus give rise to a presumption of vindictiveness. The State sought the death penalty against Adamson for the very same conduct for which it had three years earlier found a lesser charge and a sentence of 48-49 years appropriate. See Martinez, 785 F.2d at 669 (presumption of vindictiveness raised when the increased charges arise from the same nucleus of operative facts as the earlier charge); Robison, 644 F.2d at 1272-73 (prosecutor's attempt to seek a heavier penalty for the same acts is inherently suspect). The same sovereign and the same set of facts were involved in both decisions. Cf. United States v. Ballester, 763 F.2d 368, 370 (9th Cir.), cert. denied, 474 U.S. 842, 106 S. Ct. 126, 88 L. Ed. 2d 103 (1985) (likelihood of prosecutorial abuse is diminished when a separate sovereign brings the increased charges); Robison, 644 F.2d at 1272 (vindictive prosecution claim weakened when different facts and different sovereigns involved). Most importantly, the decision to file the increased charges directly followed Adamson's assertion of his constitutional right against self-incrimination.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e See Blackledge, 417 U.S. at 27-28; United States v. Shaw, 655 F.2d 168, 171-72 (9th Cir. 1981) (appearance of vindictiveness shown by prosecutor increasing severity of charges after the defendant exercised a protected right). These circumstances create the appearance that the State, \"faced with a disappointing result, act[ed] so as to 'up the ante' for the defendant.\"\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Martinez, 785 F.2d at 669. Thus, a presumption of vindictiveness is warranted in this case.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Id.; see also Shaw, 655 F.2d at 171 (prima facie case of vindictiveness created when government upped the ante by vacating guilty plea in retaliation for exercise of protected right); Robison, 644 F.2d at 1273 (stating it is the prosecution's \"attempt or threat to 'up the ante' by bringing new or more serious charges in response to the exercise of protected rights that violates the due process guarantee\"); United States v. DeMarco, 550 F.2d 1224, 1227 (9th Cir.), cert. denied, 434 U.S. 827, 98 S. Ct. 105, 54 L. Ed. 2d 85 (1977) (constitutionally impermissible for government to up the ante to discourage defendant from exercising his right to change of venue).\n\nOnce the presumption of vindictiveness is raised, the burden shifts to the prosecution to rebut it by presenting evidence of independent reasons or intervening circumstances which demonstrate that the prosecutor's decision was motivated by a legitimate purpose. Gallegos-Curiel, 681 F.2d at 1167; United States v. Thurnhuber, 572 F.2d 1307, 1310 (9th Cir. 1977) (state has a \"heavy burden of proving that any increase in the severity of the alleged charges was not motivated by a vindictive motive\") (quoting United States v. Ruesga-Martinez, 534 F.2d 1367, 1369 (9th Cir. 1976) (footnote omitted)). Thus, the State must rebut the presumption that its reinstatement of the first degree murder charge and pursuit of the death penalty against Adamson was improperly motivated. To date it has not done so.\n\nNone of the arguments the State presents are sufficient to rebut the presumption of vindictiveness. The State's first contention, that \"no one upped the ante\" because it simply filed first degree murder charges as the plea agreement reinstatement provisions allowed it to do, wholly misses the point. Vindictive prosecution cases always involve circumstances where the prosecution is acting within its power.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e The issue in such cases, however, is whether the exercise of that power was improperly motivated. Thus, just because the State in this case could seek the death penalty against Adamson does not resolve the issue of whether it did so with a vindictive or retaliatory motive.\n\nThe State's related argument that its actions fall within the sphere of prosecutorial discretion is equally unpersuasive. The vindictive prosecution doctrine is \"a limit on prosecutorial discretion, and goes to the very authority of the prosecutor to hale the defendant into court in the first place.\" Griffin, 617 F.2d at 1345-46. Thus, while a prosecutor has great discretion to choose which charges it will bring against a particular defendant, \"when there is 'a significant possibility that such discretion may have been exercised with a vindictive motive or purpose,' the reasons for the prosecutor's decision to increase the stakes for the accused 'must be made to appear.'\" Id. at 1346-47 (quoting Ruesga- Martinez, 534 F.2d at 1369). In Adamson's case, there is a significant possibility of actual vindictiveness surrounding the State's decision to seek the death penalty, coupled with an apparent absence of legitimate reasons to justify it.\n\nThe facts before us also do not support a finding that the State's charging decision resulted from \"the prosecutor's normal assessment of the societal interest in prosecution.\" Goodwin, 457 U.S. at 380 n. 11. While we agree that the State has a legitimate and compelling interest in punishing and prosecuting the murder of Donald Bolles, that interest was present at the time the State made its original bargain with Adamson. An interest in punishing all concerned was the apparent motivation for the State's entering into the original agreement. That agreement resulted in a sentence of a term of years for Adamson and -- before their convictions were overturned -- the imposition of the death penalty for Robison and Dunlap. We fail to see how the State's interest in punishing those connected with Bolles' murder was advanced, three years later, by seeking to penalize one rather than all three.\n\nFurthermore, the State's argument that it increased the charges against Adamson because his credibility was destroyed \"once he made his famous non-negotiable demands\" is contradicted by its own actions. It continued to try to compel Adamson to testify on several occasions following receipt of the April 3, 1980 letter. In addition, the State's position is undermined by the record of Adamson's extensive cooperation with state and federal authorities. Adamson had testified for hundreds of hours and cooperated in more than two hundred interrogation sessions during the three year period between the plea agreement and his subsequent claim that he had fulfilled his obligations under the terms of that agreement. There is no evidence -- nor does the State even argue -- that at any time he testified less than credibly. The earlier convictions of Robison and Dunlap in fact support the contrary conclusion.\n\nWe also find no merit in the State's claim that it sought the death penalty against Adamson because Adamson might refuse to testify at a retrial of Robison and Dunlap. The State defends its actions on the grounds that such a refusal would be \"the definitive end of any case against Robison and Dunlap\" since double jeopardy would attach.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Nothing, however, could more definitively end the case against Robison and Dunlap than ending Adamson's life and silencing forever the key prosecution witness against them.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nIn addition, there was little indication that Adamson would refuse to testify.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e He proved his willingness to testify at the original trial of Robison and Dunlap, where his testimony was largely, if not entirely, responsible for their convictions. He also agreed, as soon as the Arizona Supreme Court rejected his interpretation of the provisions of the plea agreement, to testify at the retrial. Moreover, since the Arizona Supreme Court decision made clear that the State could refuse Adamson's demands, he had no further incentive for not testifying.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nBecause we find that Adamson has made an initial showing to raise a presumption of vindictiveness that the State has not thus far rebutted, we hold that the district court erred in denying Adamson's request for an evidentiary hearing on the matter. We therefore reverse the district court and remand for such a hearing.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nIII.\n\nGiven that the judge originally determined that a sentence of 48-49 years was an appropriate penalty for the acts constituting the murder, we also hold that the judge's subsequent imposition of the death penalty following Adamson's trial was arbitrary in violation of the Eighth and Fourteenth Amendments.\n\nThe death penalty qualitatively differs from any other sentence. California v. Ramos, 463 U.S. 992, 998-99, 77 L. Ed. 2d 1171, 103 S. Ct. 3446 (1983); Zant v. Stephens, 462 U.S. 862, 884, 77 L. Ed. 2d 235, 103 S. Ct. 2733 (1983); Enmund v. Florida, 458 U.S. 782, 797, 73 L. Ed. 2d 1140, 102 S. Ct. 3368 (1982); Beck v. Alabama, 447 U.S. 625, 637, 65 L. Ed. 2d 392, 100 S. Ct. 2382 (1980); Woodson v. North Carolina, 428 U.S. 280, 304, 49 L. Ed. 2d 944, 96 S. Ct. 2978 (1976). Thus, we must accord a \"greater degree of scrutiny\" to capital sentencing determinations. Ramos, 463 U.S. at 999.\n\nTo pass constitutional scrutiny under this heightened standard, the death penalty must not be applied in an arbitrary or capricious manner. Gregg v. Georgia, 428 U.S. 153, 188, 49 L. Ed. 2d 859, 96 S. Ct. 2909 (1976). Rather, there must be \"an ' individualized determination' of whether the defendant in question should be executed, based on 'the character of the individual and the circumstances of the crime.'\" Booth v. Maryland, 482 U.S. 496, 107 S. Ct. 2529, 2532, 96 L. Ed. 2d 440 (1987) (quoting Zant, 462 U.S. at 879 (emphasis in original)). A sentence of death may not be imposed unless there is a determination that death is the appropriate punishment in the specific case under consideration. Woodson, 428 U.S. at 304. \"Any decision to impose the death sentence must 'be, and appear to be, based on reason rather than caprice or emotion.'\" Booth, 107 S. Ct. at 2536 (quoting Gardner v. Florida, 430 U.S. 349, 358, 51 L. Ed. 2d 393, 97 S. Ct. 1197 (1977) (opinion of Stevens, J.)).\n\nWhether or not a capital sentence is involved, in Arizona the sentencing function does not lie with the parties to a plea agreement but \"rests primarily with the Judge, whose ultimate obligation is to impose an appropriate sentence. . . .\" Dominguez v. Meehan, 140 Ariz. 329, 332, 681 P.2d 912, 915 (1983) (quoting People v. Farrar, 52 N.Y.2d 302, 437 N.Y.S.2d. 961, 419 N.E.2d 864 (1981)), approved, 140 Ariz. 328, 681 P.2d 911 (1984). Thus, the wide discretion accorded a judge regarding whether to accept or reject a plea extends to the sentencing provisions of the plea agreement. See State v. De Nistor, 143 Ariz. 407, 411-12, 694 P.2d 237, 241 (1985). The judge therefore has complete authority to reject the sentence negotiated by the parties. See Ariz. R. Crim. P. 17.4(d); Williams v. Superior Court, 130 Ariz. 209, 210, 635 P.2d 497, 498 (1981); (Frank) Smith v. Superior Court, 130 Ariz. 210, 212, 635 P.2d 498, 500 (1981); see also De Nistor, 143 Ariz. at 412, 694 P.2d at 241. Even after accepting a plea agreement, a judge may reject the stipulated sentence if he or she finds it inappropriate.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e De Nistor, 143 Ariz. at 410, 694 P.2d at 241; see also (Frank) Smith, 130 Ariz. at 212, 635 P.2d at 500.\n\nIn Adamson's case, the judge held two hearings and reviewed extensive information in order to determine whether he would accept the plea and sentence negotiated between Adamson and the State. At the first hearing, on January 15, 1977, the judge stated that he had read and examined the preliminary hearing transcript, police reports and supplements, and the written statements of witnesses. The judge also elicited additional information from Adamson regarding his role in Bolles' murder \"to further establish a factual basis\" for the guilty plea. He then accepted Adamson's plea of guilty to second degree murder, but postponed acceptance of the stipulated sentence pending review and receipt of the presentence report.\n\nAt the next hearing four days later, the judge indicated that he had now considered the presentence report, the matters in the file, the preliminary hearing transcript, the plea agreement, and the proceedings at the previous hearing. Having reviewed and considered all of this information, the judge accepted the 48-49 year sentence proposed in the plea agreement.\n\nThe judge's acceptance of Adamson's negotiated guilty plea to second degree murder and sentence thus reflected his judicial determination that such was an \"appropriate\" punishment for all of Adamson's actions. Because second degree murder under Arizona law carries a maximum penalty of life imprisonment, the judge's acceptance of Adamson's plea agreement also signified his belief that Adamson would be appropriately punished by a prison sentence rather than death.\n\nNotwithstanding this previous determination, in November 1980, following Adamson's subsequent trial and conviction for Bolles' murder, the judge imposed the death penalty for the same conduct for which he had previously found a prison term \"appropriate.\" No information was cited to justify the imposition of the death penalty that had not been available at the first sentencing hearing. Indeed, the aggravating and mitigating circumstances listed in the sentencing findings were based on the same facts that the judge had used three years earlier to determine that a prison term was the \"appropriate\" penalty for Adamson.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e Thus, there is no evidence that the death sentence was \"based on reason rather than caprice or emotion.\" Gardner, 430 U.S. at 358. It therefore appears, based on the record before us, that the judge acted arbitrarily in imposing the death penalty in Adamson's case. Since the only change of circumstances between the imposition of the prison sentence and the imposition of the death sentence was that Adamson breached the plea agreement, there emerges the inescapable conclusion that Adamson was sentenced to death because he violated a contract.\n\nThe State counters that, when the judge originally sentenced Adamson to a term of years, he had no power to do anything other than to accept or reject the plea, and thus no authority to examine aggravating or mitigating factors. This argument has no merit. As we have already indicated, under Arizona law the sentencing judge has the power to accept the plea, reject the plea, or accept the plea yet reject the negotiated sentence if it is determined that it was not appropriate.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e See, e.g., De Nistor, 143 Ariz. at 411, 694 P.2d at 241. The record here shows that, in determining whether to accept the plea and the proposed sentence of 48-49 years as appropriate, the judge considered the same information that he subsequently used to find aggravating circumstances sufficient to justify a sentence of death.\n\nThe dissent attempts to justify Adamson's death sentence by concluding that, in light of the reinstatement provisions of the plea agreement, such a sentence was simply the logical and predictable result of his refusal to testify. Whatever may be said for the propriety of increasing prison sentences following the breach of a plea agreement, the imposition of the death penalty for such circumstances offends the constitutional principle that capital sentencing determinations require special treatment. See, e.g., Ramos, 463 U.S. at 998-99 \u0026 n. 9. While in agreement with the dissent that Adamson's death sentence followed his breach, we do not share the dissent's view that this sort of predictability passes constitutional muster. When the predictable result of the breach of a plea bargain is the death penalty, the imposition of that penalty is arbitrary and in violation of the Constitution. The Constitution requires an individualized determination of whether a defendant should be executed, and not a prediction of death.\n\nWe hold that the state trial judge acted arbitrarily in imposing the death penalty. We reverse the district court and remand to that court with instructions to grant the writ of habeas corpus unless the State, within a reasonable time, resentences Adamson to a sentence other than death.\n\nIV.\n\nAdamson also contends that the Arizona statutory scheme for imposing the death penalty erroneously lists elements of the offense as factors to be determined by the sentencing judge, thus depriving him of his right to a jury decision on the elements of the crime in violation of the Sixth and Fourteenth Amendments. We agree.\n\nThe historic roots of the right to jury trial provide an essential backdrop to this discussion. The Framers of the Bill of Rights included the Sixth Amendment's guarantee of a right to jury trial as an essential protection against government oppression. \"Fear of unchecked power, so typical of our State and Federal Governments in other respects, found expression in the criminal law in this insistence upon community participation in the determination of guilt or innocence.\" Duncan v. Louisiana, 391 U.S. 145, 156, 20 L. Ed. 2d 491, 88 S. Ct. 1444 (1968). The cornerstone of this protection is the right to have the jury determine the existence of the facts necessary to determine guilt or innocence of a given crime. Only by maintaining the integrity of the factfinding function does the jury \"stand between the accused and a potentially arbitrary or abusive Government that is in command of the criminal sanction.\" United States v. Martin Linen Supply Co., 430 U.S. 564, 572, 51 L. Ed. 2d 642, 97 S. Ct. 1349 (1977).\n\nThe Court has recognized that the defendant's right to a jury trial and the concomitant factfinding responsibilities of the jury merit greater protection as the potential punishment increases. See, e.g., Duncan, 391 U.S. at 160-61 (jury trial not constitutionally mandated for petty offenses; seriousness of punishment determines when right attaches). As we have previously stated, the Supreme Court has repeatedly held that the death penalty is qualitatively different from all other punishments and that heightened scrutiny of death sentencing decisions is required. Thus, when the death penalty is implicated courts must be particularly careful to prevent the infringement of Sixth Amendment rights.\n\nTo avoid the dangers of government oppression recognized in Duncan and reaffirmed in later cases, there must be strict separation of determinations of guilt or innocence (factfinding) and determinations of the appropriate punishment (sentencing). To otherwise blur the distinctions between those concepts would result in the ultimate tyranny feared by the Founders and condemned by Duncan : the unchecked power of the government to execute at will.\n\nA.\n\nAdamson was found guilty of first degree murder by a jury. Since Arizona's death penalty statute requires that a judge find at least one aggravating circumstance before a defendant convicted of first degree murder is death-eligible, however, the jury's verdict by itself did not qualify him for a death sentence. Accordingly, Adamson argues that the death sentence was imposed only after he had been found guilty of a higher degree of murder -- \"capital murder\" -- by virtue of the judge finding two additional factors, specifically, aggravating circumstances A.R.S. §§ 13-703(F)(5) (a motive of \"pecuniary gain\") (\"(F)(5)\"), and 13-703(F)(6) (murder committed in an \"especially heinous, cruel or depraved\" manner) (\"(F)(6)\"). Adamson thus concludes that because a judge made these findings he was deprived of his Sixth Amendment right to have a jury decide the facts of his guilt or innocence. The logic of Adamson's argument, however, is sound only if the Arizona statutory aggravating circumstances are actually elements of a distinct crime.\n\nThe Constitution requires that the state prove beyond a reasonable doubt all elements of the offense with which the defendant is charged. In re Winship, 397 U.S. 358, 361, 25 L. Ed. 2d 368, 90 S. Ct. 1068 (1970). Yet the parameters of what constitutes an \"element\" -- so as to fall within the jury's factfinding responsibility -- remain elusive. A line of due process cases considering such contours has failed to produce concrete guidelines. Cf. McMillan v. Pennsylvania, 477 U.S. 79, 106 S. Ct. 2411, 2417, 91 L. Ed. 2d 67 (1986) (Court has \"never attempted to define precisely the constitutional limits [of] the extent to which due process forbids the reallocation or reduction of burdens of proof in criminal cases, and do[es] not do so today. . . .\"); see also Patterson v. New York, 432 U.S. 197, 53 L. Ed. 2d 281, 97 S. Ct. 2319 (1977); Mullaney v. Wilbur, 421 U.S. 684, 44 L. Ed. 2d 508, 95 S. Ct. 1881 (1975); In re Winship, 397 U.S. 358, 25 L. Ed. 2d 368, 90 S. Ct. 1068 (1969). We find, however, that a framework for analysis emerges from these cases. Thus, in assessing Adamson's claim, we examine (1) the legislative history of Arizona's death penalty statutes; (2) the actual role played by aggravating circumstances under Arizona's revised statute § 13-703; and (3) the application of McMillan v. Pennsylvania, the Supreme Court's most recent pronouncement on the distinction between elements and sentencing factors, to this case.\n\n1.\n\nFrom 1901 to 1973 Arizona placed the sentencing decision of \"death or imprisonment\" on the jury:\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nA person guilty of murder in the first degree shall suffer death or imprisonment in the state prison for life, at the discretion of the jury trying the person charged therewith, or upon a plea of guilty, the court shall determine the punishment.\n\nState v. Nielsen, 108 Ariz. 251, 254, 495 P.2d 847, 850 (1972) (quoting A.R.S. of 1956 § 13-453(A)) (emphasis added); see also A.R.S. of 1955 § 13-453; Ariz. Code of 1939 § 43-2903; Rev. Code of Ariz. of 1928 § 4585; A.R.S. of 1913, 13 Penal Code § 173; Ariz. Penal Code of 1901 § 174. In addition, Arizona allocated the burden of proof of the elements of the homicide -- including the burden of proving mitigation -- between the prosecution and defendant at trial :\n\nUpon a trial for murder, the commission of the homicide by the defendant being proved, the burden of proving circumstances of mitigation or that justify or excuse it, devolves upon him, unless the proof on the part of the prosecution tends to show that the crime committed only amounts to manslaughter, or that the defendant was justifiable or excusable.\n\nArizona Penal Code of 1901 § 938; A.R.S. of 1913, 13 Penal Code § 1046; Revised Code of Arizona of 1928 § 5050; Arizona Code of 1939 § 44-1814; A.R.S. of 1955 § 13-454; A.R.S. of 1956 § 13-454.\n\nIn 1973, in response to Furman v. Georgia, 408 U.S. 238, 33 L. Ed. 2d 346, 92 S. Ct. 2726 (1972) (death penalty may not be imposed arbitrarily or capriciously), the Arizona legislature adopted a new procedure for determination of the appropriate sentence.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e The responsibility for deciding whether a defendant would receive a sentence of life or death was taken from the jury\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e and reassigned to the judge who presided over a separate, statutorily mandated, aggravation-mitigation hearing.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e The legislature similarly removed the consideration of mitigating circumstances from the jury at trial and allocated it to the judge at sentencing.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e This abbreviated legislative history thus reveals that for at least 72 years, the Arizona legislature believed (1) a jury should decide between life or death and (2) mitigating factors, as well as elements establishing higher degrees of murder, had to be proved or disproved at trial before the trier-of-fact.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nIf this were the end of the analysis, however, Adamson's argument would fail. Simply because Arizona previously assigned this decisionmaking responsibility to a jury does not mean, of course, that the State must continue to do so. Cf. Spaziano v. Florida, 468 U.S. 447, 464, 82 L. Ed. 2d 340, 104 S. Ct. 3154 (1984). However, the Supreme Court has not hesitated to invalidate sentencing procedures when the process violates constitutional rights. See, e.g., Mullaney, 421 U.S. at 698 (states may not simply \"redefine the elements that constitute different crimes, characterizing them as factors that bear solely on the extent of punishment\"). Thus we recognize that the mere use of labels such as \"determinations of guilt\" and \"sentencing\" to compartmentalize the functions of judge and jury, does not negate the very real possibility that what are called \"sentencing\" decisions may in fact usurp jury factfinding responsibilities. While a \"state legislature's definition of the elements of the offense is usually dispositive,\" id. at 2416, its decision in this regard is subject to proscription under the Due Process Clause if it \"offends some principle of justice so rooted in the traditions and conscience of our people so as to be ranked as fundamental.\" Id. The Sixth Amendment right to have a jury determine whether the State has proven every element of the charged offense is such a principle. Thus, a scrutinizing examination of the Arizona statutory scheme is necessary to determine if its assignment of responsibilities violates the fundamental right to a jury trial.\n\n2.\n\nUnder Arizona's revised code, all murder is not capital murder. Since 1973, Arizona has required that before a death sentence may be imposed the trial judge must find beyond a reasonable doubt that at least one statutory aggravating circumstance exists.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e While Arizona has formally subdivided murder into at least four categories -- first degree murder, second degree murder, manslaughter and negligent homicide\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e -- it appears that aggravating circumstances in fact operate to create an additional category of murder. While the statute's nomenclature (\"aggravating circumstances\") suggests they are mere factors guiding the judge in his or her determination of the appropriate penalty, all other indicators confirm that aggravating circumstances are additional elements necessary for a finding that a defendant is guilty of the distinctive offense of capital murder.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e Finding aggravating circumstances results in the only crime in Arizona for which a defendant may receive a death sentence.\n\nAn aggravating \"circumstance\" which elevates a murder to a \"death-eligible\" murder in the penalty phase, remarkably mirrors the attributes of an essential element of the offense during the guilt phase of a trial. Like an element of a crime, an aggravating circumstance in the Arizona scheme informs the prosecutor what facts must be proven to obtain a conviction. The circumstance must be proven beyond a reasonable doubt. The hearing is adversarial, with oral argument and the prosecution's presentation of evidence governed by the usual rules of evidence. The presiding trial judge must make findings on the existence or nonexistence of each of the statutory aggravating and mitigating circumstances. If the judge finds an aggravating circumstance, the burden then shifts to the defendant who must put on sufficient evidence of mitigation or the death penalty will be imposed. A.R.S. § 13-703; see also Arizona v. Rumsey, 467 U.S. 203, 210, 81 L. Ed. 2d 164, 104 S. Ct. 2305 (1984). If the prosecution is unable to prove the existence of a single aggravating circumstance, like not proving an essential element, the defendant cannot be put to death. Cf. Poland v. Arizona, 476 U.S. 147, 106 S. Ct. 1749, 1754, 90 L. Ed. 2d 123 (1986) (Court framed the relevant inquiry as \"whether the sentencing judge or the reviewing court has 'decid[ed] that the prosecution has not proved its case' for the death penalty and hence has 'acquitted' petitioners\"); Rumsey, 467 U.S. at 212 (where findings of fact at sentencing hearing were all favorable to defendant, he was \"acquitted\" of the death penalty).\n\nMoreover, to determine the existence of the aggravating circumstances at issue here requires subjective and complex inquiries into the defendant's state of mind before, during and after the perpetration of the crime.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e An (F)(5) finding obligates the judge -- not the jury -- to draw conclusions regarding whether the defendant had the \" expectation of the receipt, of anything of pecuniary value.\" A.R.S. § 13-703(F)(5) (emphasis added). The (F)(6) factor -- whether the offense was committed in an \"especially heinous, cruel or depraved manner\" -- requires assessments of \"the mental state and attitude of the perpetrator as reflected in his words and actions\" at the time of the offense. State v. Gretzler, 135 Ariz. 42, 51, 659 P.2d 1, 10, cert. denied, 461 U.S. 971, 77 L. Ed. 2d 1327, 103 S. Ct. 2444 (1983). These assessments directly measure a defendant's \"moral guilt\" and overall culpability -- traditionally the jury's domain of decision. See Enmund v. Florida, 458 U.S. 782, 800, 73 L. Ed. 2d 1140, 102 S. Ct. 3368 (1982) (\"American criminal law has long considered a defendant's intention -- and therefore his moral guilt -- to be critical to the 'degree of [his] criminal culpability'. . . .\") (quoting Mullaney, 421 U.S. at 698).\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\n\nWe therefore hold that Arizona's aggravating circumstances function as elements of the crime of capital murder requiring a jury's determination.\n\n3.\n\nFurther support for our conclusion is found in McMillan v. Pennsylvania, 477 U.S. 79, 106 S. Ct. 2411, 91 L. Ed. 2d 67 (1986), which contains the Supreme Court's most recent pronouncement on what constitutes an element of a criminal offense requiring proof beyond a reasonable doubt, and to which the right to a jury determination attaches. The Court in McMillan upheld a Pennsylvania statute which increases the minimum sentence a judge can impose upon finding, by a preponderance of the evidence, that the person \"visibly possessed a firearm\" during the commission of the underlying offense. The statute at issue required a mandatory minimum sentence of five years' imprisonment for certain felony convictions. 106 S. Ct. at 2414. The petitioners argued that visible possession was an element of the crime, demanding attendant constitutional protections. The Court disagreed, concluding that the \"visible possession of a firearm\" factor did not require proof beyond a reasonable doubt to satisfy due process, nor a jury determination necessary in order to conform with the Sixth Amendment.\n\nThe Court's conclusion in McMillan, however, turned upon facts not present in the instant case. For instance, the Court found it significant that Pennsylvania had defined the elements of the enumerated offenses, as well as their maximum allowable sentences, at least ten years prior to passing the statute at issue. Id. at 2416-17. The majority also noted that the legislature could have chosen to add visible possession as an element of the enumerated offenses. It did not, however, and thus the new statute affected only sentencing. Id. at 2417. Thus, the Court concluded that \"the specter raised by petitioners of States restructuring existing crimes in order to 'evade' the commands of Winship just does not appear in this case.\" Id. at 2418.\n\nIn contrast, Arizona's is a totally revised statutory scheme which, when enacted in 1973, in essence withdrew from the definition of its homicide crimes various \"elements\" traditionally preserved in Arizona for jury determination and reclassified them as judicial sentencing circumstances. The confluence of the elements and circumstances, combined with the simultaneous repeal of the statute allocating the burden of proving mitigation at trial and enactment of the statute allocating this burden at judicial sentencing, distinguishes Arizona's scheme from the one in McMillan.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\nMost significantly, however, the Court stated in McMillan that its result could be different \"if a finding of visible possession exposed [defendants] to greater or additional punishment. . . .\" Id. at 2418. The Court placed great emphasis on the fact that the Pennsylvania statute\n\nneither alters the maximum penalty for the crime committed nor creates a separate offense calling for a separate penalty; it operates solely to limit the sentencing court's discretion in selecting a penalty within the range already available to it without the special finding of visible possession of a firearm.\n\nId. at 2417-18 (emphasis added).\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e The Arizona statutes at issue however, operate very differently. Although first degree murder in Arizona is punishable by life imprisonment or death, see A.R.S. § 13-703(A), a defendant cannot, under any circumstances, be sentenced to death unless at least one aggravating circumstance is found to exist. Consequently, the finding of aggravating circumstances \"exposes [defendants] to greater or additional punishment.\" Id. at 2418.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e Further, because proof of at least one \"aggravating circumstance\" is required, capital murder becomes a distinct offense calling for a separate punishment not otherwise available -- the penalty of death.\n\nB.\n\nWhile a defendant is entitled to a jury's determination regarding the existence of elements of a crime, a defendant is not, however, constitutionally entitled to have a jury determine the appropriate punishment. In Spaziano v. Florida, 468 U.S. 447, 82 L. Ed. 2d 340, 104 S. Ct. 3154 (1984), the Supreme Court upheld Florida's \"over-ride\" provision which allows a judge to impose a death sentence despite a jury recommendation of life imprisonment. Never challenging the fundamental principle that criminal defendants are entitled to a jury trial, see Duncan, 391 U.S. at 156, the Court's examination in Spaziano was limited to the constitutionality of judicial \"sentencing\" and evaluation of \"the appropriate punishment to be imposed.\" 468 U.S. at 458-59. The Court never addressed a claim of judicial fact-finding as to an element of the offense. Thus the Court never reached the particular contention Adamson has raised: that Arizona's capital sentencing statute requires the judge to determine elements of the offense charged, thereby taking this factual element out of the jury's hands in violation of the Sixth Amendment.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e Sentencing, or the ultimate determination of an appropriate penalty, involves the weighing of factors. Such weighing is completely distinct from threshold findings of whether requisite elements even exist from which the trier-of-fact draws conclusions on guilt or innocence.\n\nThus, Spaziano is not controlling in this case, as it left untouched the question of the right to a jury trial where the aggravating circumstances of a state's death penalty statute are elements of a capital offense.\n\nC.\n\nWe therefore conclude that the function of Arizona's aggravating circumstances, considered in light of the development of Arizona's revised statutory scheme and McMillan, demand that the veil of the sentencing factor label be lifted. We hold that Arizona has impermissibly identified elements of the crime of capital murder as sentencing factors for determination by a judge, thereby removing their consideration from a jury, in violation of the Sixth Amendment. We reverse the district court on this issue and remand with instructions to grant the writ of habeas corpus unless the State, within a reasonable time, imposes a sentence other than death.\n\nV.\n\nNot only must a jury determine the existence of the elements -- including those mislabeled as aggravating circumstances -- which constitute the crime, but the Constitution also requires that there be guidelines to channel discretion in making these findings. Adamson received the death penalty after the trial judge found the presence of two aggravating circumstances: A.R.S. §§ 13-703(F)(5) (\"pecuniary gain\" motive)\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e and (F)(6) (\"especially heinous, cruel, or depraved\" murder). We conclude that the (F)(6) circumstance violates the Eighth and Fourteenth Amendments by failing to channel adequately the decisionmaker's discretion when determining whether the (F)(6) circumstance exists.\n\nA.\n\nArizona, like many other states, responded to Furman v. Georgia, by implementing specific guidelines intended to narrow the trier of fact's discretion. See Cartwright v. Maynard, 822 F.2d 1477, 1484 (10th Cir. 1987) (en banc), aff'd, 486 U.S. 356, 108 S. Ct. 1853, 100 L. Ed. 2d 372 (1988) (noting that thirty-five states enacted new death penalty statutes after Furman). The Supreme Court has upheld against limited attack statutory schemes designed to ensure channeled decisionmaking by consideration of aggravating and mitigating circumstances. See, e.g., Jurek v. Texas, 428 U.S. 262, 49 L. Ed. 2d 929, 96 S. Ct. 2950 (1976); Proffitt v. Florida, 428 U.S. 242, 49 L. Ed. 2d 913, 96 S. Ct. 2960 (1976); Gregg v. Georgia, 428 U.S. 153, 49 L. Ed. 2d 859, 96 S. Ct. 2909 (1976).\n\nSeveral Supreme Court decisions have addressed the constitutionality of aggravating circumstances in which the key terms are similar -- or identical -- to those selected by the Arizona legislature for the (F)(6) circumstance. In Gregg, the Court considered the constitutionality of an aggravating circumstance in the revised Georgia death penalty statute. That circumstance applied if a murder was \"outrageously or wantonly vile, horrible, or inhuman in that it involved torture, depravity of mind, or an aggravated battery to the victim.\" 428 U.S. at 165 n. 9. The Court held that although all murders could be characterized so as to fall within the circumstance the statutory \"language need not be construed in this way, and there is no reason to assume that the Supreme Court of Georgia will adopt such an open-ended construction.\" 428 U.S. at 201; see also Proffitt, 428 U.S. at 255-56 (reviewing a Florida aggravating circumstance which allowed the death penalty if \"the capital felony was especially heinous, atrocious, or cruel\").\n\nSeveral years later in Godfrey v. Georgia, 446 U.S. 420, 64 L. Ed. 2d 398, 100 S. Ct. 1759 (1980), a plurality of the Court held that Georgia had in fact given a sufficiently narrowing construction to the broad statutory terms attacked in Gregg.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e The Court also reaffirmed its previous mandate that the states \"channel the sentencer's discretion by 'clear and objective standards' that provide 'specific and detailed guidance,' and that 'make rationally reviewable the process for imposing a sentence of death.'\" Godfrey, 446 U.S. at 428 (quoting Gregg, 428 U.S. at 198; Profitt, 428 U.S. at 253; Woodson v. North Carolina, 428 U.S. 280, 303, 49 L. Ed. 2d 944, 96 S. Ct. 2978 (1976)).\n\nIn Zant v. Stephens, 462 U.S. 862, 77 L. Ed. 2d 235, 103 S. Ct. 2733 (1983), the Court cautioned that aggravating circumstances, while intended to direct discretion, could be \"so vague that they would fail adequately to channel the sentencing decision patterns of juries with the result that a pattern of arbitrary and capricious sentencing like that found unconstitutional in Furman could occur.\" Id. at 877 (citation omitted). The Court thus instructed states to genuinely narrow the class of persons eligible for the death penalty. Id.; see also California v. Brown, 479 U.S. 538, 107 S. Ct. 837, 839, 93 L. Ed. 2d 934 (1987) (Constitution requires that \"death penalty statutes be structured so as to prevent the penalty from being administered in an arbitrary and unpredictable fashion\").\n\nMost recently, the Supreme Court in Maynard v. Cartwright, 486 U.S. 356, 108 S. Ct. 1853, 100 L. Ed. 2d 372 (1988), unanimously affirmed the Tenth Circuit's holding that Oklahoma's \"especially heinous, atrocious, or cruel\" aggravating circumstance was unconstitutionally vague. The Tenth Circuit sitting en banc had conducted an exhaustive inquiry of Oklahoma's case law. It concluded that, while Oklahoma's highest court had held that the attitude of the killer, the manner of the killing, and the suffering of the victim were relevant and could support the aggravating circumstance, the Oklahoma court had \"'refused to hold that any one of those factors must be present for a murder to satisfy this aggravating circumstance.'\" Id. at 1857 (quoting Cartwright, 822 F.2d at 1491 (emphasis in original)). The Supreme Court agreed with the Tenth Circuit that such an open-ended approach was unconstitutional under Godfrey, where the Court had \"rejected the submission that a particular set of facts surrounding a murder, however shocking they might be, were enough in themselves, and without some narrowing principle to apply to those facts, to warrant the imposition of the death penalty.\" Id. at 1859. Thus, the Court found Oklahoma's application of its aggravating circumstance unconstitutional for two reasons:\n\nFirst, the language of the Oklahoma aggravating circumstance at issue -- \"especially heinous, atrocious, or cruel\" -- gave no more guidance than the \"outrageously or wantonly vile, horrible or inhuman\" language that the jury returned in its verdict in Godfrey. The State's contention that the addition of the word \"especially\" somehow guides the jury's discretion, even if the term \"heinous\" does not, is untenable. To say that something is \"especially heinous\" merely suggests that the individual jurors should determine that the murder is more than just \"heinous,\" whatever that means, and an ordinary person could honestly believe that every unjustified, intentional taking of human life is \"especially heinous.\"\n\nSecond, the conclusion of the Oklahoma court [in Cartwright's case] that the events recited by it \"adequately supported the jury's finding\" was indistinguishable from the action of the Georgia court in Godfrey, which failed to cure the unfettered discretion of the jury and to satisfy the commands of the Eighth Amendment.\n\nId. (citations omitted).\n\nThus, the Court has expressly conditioned the use of aggravating circumstances upon the state courts' ability to interpret and apply the statutory guidelines in a narrow and consistent manner. Given that the (F)(6) circumstance is composed of terms that are inherently vague, cf. Godfrey, 446 U.S. at 428 (\"there is nothing in these few words, standing alone, that implies any inherent restraint on the arbitrary and capricious infliction of the death sentence\"), we must decide whether the (F)(6) circumstance has been given a sufficiently narrow construction by the Arizona Supreme Court.\n\nB.\n\nThe Arizona legislature intended that the \"especially heinous, cruel, or depraved\" aggravating circumstance provide guidance to judges presiding over aggravation-mitigation hearings. Moreover, it surely was not meant to be used as a \"catch-all for those first degree murders where no other aggravating circumstance applies.\" State v. Gretzler, 135 Ariz. 42, 51, 659 P.2d 1, 10, cert. denied, 461 U.S. 971, 77 L. Ed. 2d 1327, 103 S. Ct. 2444 (1983) (quoting State v. Ortiz, 131 Ariz. 195, 206, 639 P.2d 1020, 1031 (1981), cert. denied, 456 U.S. 984, 72 L. Ed. 2d 863, 102 S. Ct. 2259 (1982)). It has, however, been used in just this manner.\n\nThe (F)(6) aggravating circumstance is by far the most frequently invoked circumstance of all of § 13-703's nine aggravating circumstances. Out of all first degree murder cases where proof of aggravating circumstances was sought, the \"especially heinous, cruel or depraved\" option was used over 68% more often than the next most commonly used circumstance, and more than 108% more often than any of the remaining circumstances.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e Although this is not a constitutional violation in and of itself, the popularity of the (F)(6) circumstance appears to be symptomatic of its catch-all function.\n\nThree reasons emerge to explain the frequent use of the (F)(6) circumstance. First, a broad range of definitions have been provided for the terms \"heinous,\" \"cruel,\" and \"depraved,\" each of which tends to employ terms or phrases as prone to subjectivity and ambiguity as those they were meant to define. Second, the Arizona courts have not restricted the creation of new definitions and factors that could constitute a (F)(6) finding. Third, even the most concrete of those definitions have been inconsistently applied.\n\n1.\n\nThe (F)(6) circumstance is composed of language that is, without question, the most susceptible to subjective interpretation of all of Arizona's enumerated statutory aggravating circumstances.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e It is therefore the most difficult to objectively define. Cf. State v. Ortiz, 131 Ariz. at 206, 639 P.2d at 1031 (Godfrey established that states must \"objectively define the terms used\" in aggravating circumstances). Not surprisingly, then, the Arizona Supreme Court has been unable to arrive at a definition of any of the key terms that can be uniformly applied.\n\nThe first published definition of the (F)(6) terms appeared in State v. Knapp, 114 Ariz. 531, 543, 562 P.2d 704, 716 (1977), cert. denied, 435 U.S. 908, 55 L. Ed. 2d 500, 98 S. Ct. 1458 (1978) (quoting Webster's Third New International Dictionary):\n\nheinous: hatefully or shockingly evil: grossly bad.\n\ncruel: disposed to inflict pain esp. in a wanton, insensate or vindictive manner: sadistic.\n\ndepraved: marked by debasement, corruption, perversion or deterioration.\n\nSee also Gretzler, 135 Ariz. at 51, 659 P.2d at 10 (quoting Knapp). Later, in State v. Lujan, 124 Ariz. 365, 604 P.2d 629 (1979), the Arizona Supreme Court identified a difference among the terms. The court stated that cruelty goes to whether the \"victim suffered pain,\" while \"heinous\" and \"depraved\" focus on \"the killer's state of mind at the time of the offense.\" Id. at 372, 604 P.2d at 636. Although oft-repeated, both Knapp's list of amorphous terms and Lujan's definitional distinction have failed to benefit the trier-of-fact in any meaningful way. Cartwright, 822 F.2d at 1489 (\"Vague terms do not suddenly become clear when they are defined by reference to other vague terms.\").\n\nThus, subsequent cases have set forth definitions for \"cruel,\" \"heinous,\" and \"depraved\" using terms and phrases that are equally vague, broad and open to subjective interpretation. For example, a cruel, heinous and depraved murder is one that is a \"'conscienceless or pitiless crime which is unnecessarily torturous to the victim,'\" State v. Watson, 120 Ariz. 441, 448, 586 P.2d 1253, 1260 (1978), cert. denied, 440 U.S. 924, 59 L. Ed. 2d 478, 99 S. Ct. 1254 (1979), whereas a murder can be heinous and depraved if the defendant's conduct reveals a \"callous disregard for human worth,\" State v. LaGrand, 153 Ariz. 21, 37, 734 P.2d 563, 579, cert. denied, 484 U.S. 872, 108 S. Ct. 207, 98 L. Ed. 2d 158 (1987), or if the defendant had a \"vile state of mind at the time of the murder,\" State v. McCall, 139 Ariz. 147, 161, 677 P.2d 920, 934 (1983), cert. denied, 467 U.S. 1220, 81 L. Ed. 2d 375, 104 S. Ct. 2670 (1984), or if the defendant had \"a shockingly evil and corrupt state of mind,\" State v. Zaragoza, 135 Ariz. 63, 69-70, 659 P.2d 22, 28-29, cert. denied, 462 U.S. 1124, 77 L. Ed. 2d 1356, 103 S. Ct. 3097 (1983), or \"a 'shockingly evil' state of mind 'marked by debasement,'\" State v. Ceja, 126 Ariz. 35, 39-40, 612 P.2d 491, 495-496 (1980); whereas a murder can be heinous and/or depraved if it is characterized by \"senselessness\" and a \"savage manner of death,\" State v. Gillies, 142 Ariz. 564, 570, 691 P.2d 655, 661 (1984), cert. denied, 470 U.S. 1059, 84 L. Ed. 2d 834, 105 S. Ct. 1775 (1985) (\" Gillies II \"), or by helplessness as to the victim, senselessness as to the crime, and the infliction of \"gratuitous pain\" on the victim, State v. Carriger, 143 Ariz. 142, 160, 692 P.2d 991, 1009 (1984), cert. denied, 471 U.S. 1111, 85 L. Ed. 2d 864, 105 S. Ct. 2347 (1985);\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e while a murder is depraved -- but not heinous or cruel -- when the defendant's actions \"reflect a mental state that is 'marked by debasement,'\" State v. Vickers, 129 Ariz. 506, 515, 633 P.2d 315, 324 (1981), or indicate \"a total disregard for human life,\" State v. Correll, 148 Ariz. 468, 481, 715 P.2d 721, 734 (1986), or \"a manifest disregard for the fundamental principles upon which our society is based,\" State v. Martinez-Villareal, 145 Ariz. 441, 451, 702 P.2d 670, 680, cert. denied, 474 U.S. 975, 106 S. Ct. 339, 88 L. Ed. 2d 324 (1985), or are \"totally without regard for human life,\" State v. Clark, 126 Ariz. 428, 437, 616 P.2d 888, 897, cert. denied, 449 U.S. 1067, 66 L. Ed. 2d 612, 101 S. Ct. 796 (1980), or where the defendant's conduct is \"perverted.\" State v. Madsen, 125 Ariz. 346, 352, 609 P.2d 1046, 1052, cert. denied, 449 U.S. 873, 66 L. Ed. 2d 93, 101 S. Ct. 213 (1980). These words give precious little guidance as to the meaning of (F)(6)'s key terms.\n\n2.\n\nIn 1983, the Arizona Supreme Court in State v. Gretzler reviewed nearly all of its \"especially cruel, heinous and depraved\" jurisprudence. The Gretzler court explained that, as a general matter, the term \"cruelty\" focuses on the victim's suffering while the terms \"heinous\" and \"depraved\" involve the mental state and attitude of the defendant at the time of the murder. 135 Ariz. at 51, 659 P.2d at 10. The court then turned to discussing each of these (F)(6) terms in greater detail. With respect to cruelty, the court briefly summarized the then-existing case law on the cruelty concept which had grown to include a victim's mental and/or physical distress, suffered before and/or after attack by the defendant. Id. With respect to heinousness and depravity, the court went on to note that \"our cases have suggested specific factors which lead to [their] finding,\" id., and proceeded to identify five factors which had been held to satisfy these terms:\n\n1. The apparent relishing of the murder by the killer.\n\n2. The infliction of gratuitous violence on the victim.\n\n3. The needless mutilation of the victim.\n\n4. The senselessness of the crime.\n\n5. The helplessness of the victim.\n\nId. at 52, 659 P.2d at 11. Thus, by offering a checklist for courts considering the (F)(6) circumstance, Gretzler appeared to be an attempt to provide a limiting construction to the (F)(6) terms and their varied definitions that would be able to withstand constitutional attack. See Pulaski, Capital Sentencing in Arizona: A Critical Evaluation, 1984 Ariz. St. L.J. 1, 28-29 [hereinafter Pulaski, Capital Sentencing ].\n\nGretzler's attempt to guide the sentencer under (F)(6) has failed, however, in two respects. Although Gretzler reviewed a large number of cases, it did not -- nor has any case since -- stated what specific factors are necessary for an (F)(6) finding. Moreover, the court did not include any instructions to limit future review to the enumerated factors. As a result, Arizona has failed to provide satisfaction of Godfrey's mandate that aggravating circumstances objectively guide discretion and narrow application of the death penalty.\n\nWhile Gretzler did suggest two evidentiary limitations for (F)(6) determinations, neither has accomplished its narrowing purpose. First, the court stated that where \"there is no evidence that the victims actually suffered physical or mental pain prior to death, or where the evidence presented is inconclusive, we have held that cruelty was not shown.\" 135 Ariz. at 51, 659 P.2d at 10. Numerous cases have, in fact, reversed a finding of \"especially cruel\" because such evidence was lacking. If it can be proven, however, that the victim was merely conscious prior to or just after the attack, the cruel criterion can be satisfied. As one commentator concluded, the Arizona Supreme Court's exposition of the \"especially cruel\" component \"would make the F(6) criterion applicable to almost any first degree murder case unless it involved a single, unsuspecting victim.\" Pulaski, Capital Sentencing, 1984 Ariz. St. L.J. at 30. Moreover, since suffering may occur either before or after attack by the defendant, that single unsuspecting victim must die, or be rendered unconscious, instantaneously for this criterion to apply. See State v. Harding, 141 Ariz. 492, 501, 687 P.2d 1247, 1256 (1984) (\"The evidence indicates that the victim did not die instantaneously, but rather died slowly, his death being caused by asphyxiation due to his being gagged as he was.\"). Indeed, in nearly every case in which a finding of cruelty was reversed, the court concluded only that the prosecution had not proven the victim was conscious. See, e.g., State v. Wallace, 151 Ariz. 362, 367, 728 P.2d 232, 237 (1986), cert. denied, 483 U.S. 1011, 107 S. Ct. 3243, 97 L. Ed. 2d 748 (1987) (\"the record is inconclusive as to whether any of the victims were even conscious following the initial blow to the head\"); State v. Poland, 144 Ariz. 388, 405, 698 P.2d 183, 200 (1985), aff'd, 476 U.S. 147, 90 L. Ed. 2d 123, 106 S. Ct. 1749 (1986) (\"A finding of cruelty cannot stand where the State has failed to prove beyond a reasonable doubt that the victims were conscious at the time of death\"); State v. Villafuerte, 142 Ariz. 323, 331, 690 P.2d 42, 50 (1984), cert. denied, 469 U.S. 1230, 84 L. Ed. 2d 371, 105 S. Ct. 1234 (1985) (doctor could not \"testify as to whether the victim was conscious after she sustained the blow to the head\"); State v. Graham, 135 Ariz. 209, 212, 660 P.2d 460, 463 (1983) (\"medical examiner testified that in his opinion [the victim] was rendered unconscious immediately\"); Zaragoza, 135 Ariz. at 69, 659 P.2d at 28 (cruelty not found because state could not prove the victim was conscious); State v. Jeffers, 135 Ariz. 404, 429, 661 P.2d 1105, 1130, cert. denied, 464 U.S. 865, 78 L. Ed. 2d 174, 104 S. Ct. 199 (1983) (no cruelty because \"it appears from the record that . . . the victim lost consciousness\"). As such, this alleged limitation has operated instead to include virtually all first degree murders where it can be proven that the victim was conscious.\n\nGretzler's other attempt to limit the application of the (F)(6) circumstance can be found in its suggestion that the fourth (senselessness) and fifth (helplessness) factors alone may not be sufficient for a finding of heinousness or depravity. Yet in Zaragoza -- decided only four days after Gretzler -- it appears that only those two factors were present. See 135 Ariz. at 69-70, 659 P.2d at 28. The facts in Zaragoza identified to support a finding of \"heinous and depraved\" were the victim's advanced age and limited mental capabilities to demonstrate that she was \"helpless.\" The victim was \"senselessly killed\" because the defendant \"could have accomplished whatever criminal goals he desired without killing her.\" Id. The court then affirmed the (F)(6) finding. The only cognizable way to explain this deviation from Gretzler without finding it inconsistent, is by interpreting Zaragoza as adding an additional factor to Gretzler's list of five: heinousness and/or depravity may be shown when the victim is elderly. Such an interpretation would, however, illustrate an additional flaw in Arizona's construction of the (F)(6) circumstance.\n\nBecause Gretzler did not limit (F)(6) review to the factors it identified, the Arizona Supreme Court has been free to fashion additional factors, bringing more defendants within the (F)(6) net. For example, in the court's Adamson opinion, 136 Ariz. 250, 665 P.2d 972, cert. denied, 464 U.S. 865, 104 S. Ct. 204, 78 L. Ed. 2d 178 (1983), the court strayed from Gretzler -- and all previous cases -- regarding a finding of cruelty. Previously, cruelty had focused exclusively on the victim. In Adamson, however, the court -- without giving any explanation -- expanded the cruelty concept to include a component inquiring into the mental state of the defendant. 136 Ariz. at 266, 655 P.2d at 988 (for a cruelty finding \"the defendant must also intend that the victim suffer or reasonably foresee that there is a substantial likelihood that the victim will suffer as a consequence of the defendant's acts\"); see also State v. (Bernard) Smith, 146 Ariz. 491, 504, 707 P.2d 289, 302 (1985) (reversing (F)(6) finding because Adamson \"prerequisite\" not established by the facts); State v. Bracy, 145 Ariz. 520, 537, 703 P.2d 464, 481 (1985), cert. denied, 474 U.S. 1110, 88 L. Ed. 2d 932, 106 S. Ct. 898 (1986) (noting Adamson prerequisite); McCall, 139 Ariz. at 161, 677 P.2d at 934 (same); State v. McDaniel, 136 Ariz. 188, 200, 665 P.2d 70, 82 (1983) (same). This additional consideration has not, however, been utilized in all post-Adamson cases. See, e.g., State v. Rossi, 146 Ariz. 359, 365, 706 P.2d 371, 377 (1985) (\" Rossi I \") (cruelty found, but no discussion of defendant's state of mind).\n\nThus, to establish cruelty, the Arizona courts can rely upon facts showing that the victim was conscious for a period of time before an attack, Correll, 148 Ariz. at 480-81, 715 P.2d at 733 (victims uncertain as to their ultimate fate), or after an attack, Rossi I, 146 Ariz. at 365, 706 P.2d at 377 (\"victim remained conscious for a short time\" after the second shot and before the third fatal shot), and suffered from either mental, Carriger, 143 Ariz. at 160, 692 P.2d at 1009 (victim pleaded for his life and thus suffered mental distress), or physical pain. State v. Clabourne, 142 Ariz. 335, 348, 690 P.2d 54, 67 (1984) (victim beaten and raped).\n\nThe list of factors regarding what may constitute an especially heinous or depraved murder has similarly grown since Gretzler.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e Post-Gretzler cases have, for example, held that depravity exists when a defendant murdered the victim to eliminate a potential witness.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e State v. (Roger Lynn) Smith, 141 Ariz. 510, 511-12, 687 P.2d 1265, 1266-67 (1984) (citing McCall, 139 Ariz. at 162, 677 P.2d at 935); Correll, 148 Ariz. at 481, 715 P.2d at 734; see also Gillies II, 142 Ariz. at 570, 691 P.2d at 661 (elimination of witnesses illustrates depravity and heinousness),\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e and when the victims had been kind to the defendant. State v. Fisher, 141 Ariz. 227, 242, 686 P.2d 750, 775, cert. denied, 469 U.S. 1066, 83 L. Ed. 2d 436, 105 S. Ct. 548 (1984). Decisions have also stated that the defendant committed the murder in a heinous and depraved manner when the defendant showed a \"total disregard for human life.\" A defendant kills totally without regard for human life if that person: (1) chooses a particular method of murder when \"less violent alternatives were readily available to him,\" Wallace, 151 Ariz. at 368, 728 P.2d at 238 (defendant chose not to use a loaded gun he had with him because he feared the noise would alert neighbors); (2) kills when there is no other motive except to eliminate witnesses to a robbery, Correll, 148 Ariz. at 481, 715 P.2d at 734; or (3) knowingly uses special bullets designed to cause greater tissue damage than regular bullets and then gives spent bullets as \"souvenirs\" to a friend. Rossi I, 146 Ariz. at 365, 706 P.2d at 377.\n\nThus, for a finding that a murder was especially heinous and/or depraved the possibilities appear endless. Such conclusions have been supported in part by the victim being too young, Roscoe, 145 Ariz. at 226, 700 P.2d at 1326 (victim was a \"helpless seven year old child\"), or too old, Fisher, 141 Ariz. at 252, 686 P.2d at 775 (victim was seventy-three years old); the defendant having no apparent motive for the murder, Wallace, 151 Ariz. at 368, 728 P.2d at 237, or having a motive the court did not approve of, Correll, 148 Ariz. at 481, 715 P.2d at 734 (motive to eliminate witnesses to a robbery); the defendant used more force than was necessary to kill the victim, State v. Summerlin, 138 Ariz. 426, 436, 675 P.2d 686, 696 (1983), or not enough, Chaney, 141 Ariz. at 312, 686 P.2d at 1282 (\"when Chaney left he knew the victim was not dead and Chaney knew the victim was suffering\"); the \"murder in no way furthered the plan of the killers,\" McCall, 139 Ariz. at 162, 677 P.2d at 935, or facilitated the defendant's escape, Villafuerte, 142 Ariz. at 313, 690 P.2d at 50 (defendant indicated that his purpose \"was to prevent the victim from calling the police\"); or when the court could imagine a less violent alternative. Chaney, 141 Ariz. at 313, 686 P.2d at 1282 (defendant \"could have taken the victim's guns and disabled the two-way radio\" rather than fire fatal shots); Wallace, 151 Ariz. at 368, 728 P.2d at 237 (defendant could have used a loaded gun he was carrying but did not because he feared \"the noise would alert neighbors\").\n\nGretzler's attempt to limit the broad scope of heinous and depraved has thus proven unsuccessful at preventing the unchanneled imposition of death sentences. Apparently the dissent shares this view, as noticeably absent from the dissent's (F)(6) discussion is any defense for these two aggravating factors. Even the dissent cannot muster a principled justification for such factors which, in essence, allow the sentencing court to make subjective determinations as to the offensiveness of a particular murder. Rather, the dissent attempts to save Adamson's death sentence by arguing that any constitutional infirmities in the State's limiting construction of (F)(6)'s heinous and depraved factors should not otherwise taint Adamson's death sentence since the Arizona Supreme Court affirmed his sentence on \"cruelty\" grounds.\n\nThe dissent's argument is flawed in two respects. First, the dissent's alternative argument begs the underlying question of the constitutionality of the limiting construction given cruelty by the Arizona courts which, as we have already noted, suffers from the same constitutional infirmities as those limiting instructions given heinous and depraved.\n\nMoreover, even accepting the dissent's characterization of cruelty as appropriately limited by the Arizona courts, Adamson's death sentence still fails Eighth Amendment principles. That the Arizona Supreme Court affirmed Adamson's death sentence based on cruelty grounds in no way cures the sentencing judge's failure to apply this allegedly constitutional cruelty construction in Adamson's sentencing proceeding. With respect to the (F)(6) aggravating circumstance, Judge Birdsall's special verdict simply states in conclusory terms that \"the aggravating circumstance[] . . . exists [since Adamson] committed the offense in an especially cruel, heinous and depraved manner,\" and then briefly describes Bolles' murder. Absent from the special verdict is any discussion or application of the \"actual suffering\" cruelty standard on which the dissent relies to justify the court's (F)(6) finding. Yet as the Supreme Court has repeatedly emphasized, it is the suitably directed discretion of the sentencing body which protects against arbitrary and capricious capital sentencing. Maynard, 108 S. Ct. at 1858; Godfrey, 446 U.S. at 428-29; Gregg, 428 U.S. at 189; Furman, 408 U.S. at 313 (White, J., concurring). Post hoc appellate rationalizations for death sentences cannot save improperly channeled determinations by a sentencing court. Not only are appellate courts institutionally ill-equipped to perform the sort of factual balancing called for at the aggravation-mitigation stage of the sentencing proceedings,\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e but, more importantly, a reviewing court has no way to determine how a particular sentencing body would have exercised its discretion had it considered and applied appropriately limited statutory terms. See Caldwell v. Mississippi, 472 U.S. 320, 330, 86 L. Ed. 2d 231, 105 S. Ct. 2633 (1984) (\"[state] appellate court, unlike a capital sentencing jury, is wholly ill-suited to evaluate the appropriateness of death in the first instance\"); Presnell v. Georgia, 439 U.S. 14, 16-17, 58 L. Ed. 2d 207, 99 S. Ct. 235 (1978) (reversing state appellate court affirmance of death sentence based on state court's own finding of an aggravating circumstance that had not been found by the sentencing jury) (per curiam). This is particularly significant under Arizona's capital sentencing scheme since double jeopardy principles prevent the State from appealing a defendant's sentence of life imprisonment (rather than death) after a capital sentencing hearing. Rumsey, 467 U.S. at 211.\n\nIn sum, Arizona has been unable to provide clearly discernable parameters to establish what kind of conduct falls within the (F)(6) circumstance. The court appears to rely on whatever events are presented to it. The court is therefore free to review the record for any actions or events that it believes to be especially heinous, cruel or depraved. Given the complete lack of any objective standards that guide the court in its decisionmaking, and its unlimited authority to consider any and all facts present in a particular case, we can only conclude that the Arizona Supreme Court's attempts to constitutionally narrow the (F)(6) circumstance have failed. Accord Rosen, Especially Heinous Aggravating Circumstance, 64 N.C.L. Rev. at 981 (\"The list of considerations that the Arizona Supreme Court has been willing to use to support one of the three terms that comprise its especially heinous aggravating factor is extremely broad.\").\n\nThe problem of unlimited discretion is compounded by the Arizona Supreme Court's construction of the (F)(6) circumstance in the disjunctive so that the prosecution's burden is satisfied upon a showing that a murder is either heinous or cruel or depraved. State v. Castaneda, 150 Ariz. 382, 393, 724 P.2d 1, 12 (1986); Gretzler, 135 Ariz. at 51, 659 P.2d at 10. This construction has invited the courts to approve or disapprove an (F)(6) aggravating circumstance finding by a sentencing judge based on any of this subsection's three ill-defined terms. Arizona appellate courts have, in a number of cases, reversed a lower court's finding with respect to one of the (F)(6) terms, yet affirmed the defendant's death penalty -- without returning the case for reweighing\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e -- because the court confirmed the presence of at least one other (F)(6) term. Cf. Wallace, 151 Ariz. at 362, 728 P.2d at 237 (reversed finding of cruelty but affirmed as to heinous and depraved); Villafuerte, 142 Ariz. at 323, 690 P.2d at 50 (reversed finding of cruelty but affirmed as to depravity); State v. (Robert) Smith, 138 Ariz. 79, 85-86, 673 P.2d 17, 23 (1983) (affirmed finding of cruelty but reversed as to heinous and depraved). See also Godfrey, 446 U.S. at 454 (White, J., dissenting) (disjunctive reading of key terms in aggravating circumstance \"would arguably be assailable on constitutional grounds\"). Thus, neither cruelty nor heinousness nor depravity is necessary, but any one will suffice to sustain an (F)(6) finding.\n\n3.\n\nFinally, we note that within the plethora of factors the Arizona Courts may consider there has been much contradiction and inconsistency in the application of the (F)(6) circumstance. Compare (Bernard) Smith, 146 Ariz. at 504, 707 P.2d at 292, 302 (not cruel even though time passed between defendant's demand for money in the cash register and time of shooting, and victim did not die for two weeks), with Chaney, 141 Ariz. at 312, 686 P.2d at 1282 (cruel because victim suffered mental anguish prior to being shot as evidenced by his call for help and because victim \"was conscious for approximately thirty minutes\"); compare Lujan, 124 Ariz. at 372-73, 604 P.2d at 637 ((F)(6) reversed even though victims were helpless, killing was unnecessary to accomplish defendant's plan, and victims' wounds were severe), with Correll, 148 Ariz. at 481, 715 P.2d at 734 (depravity affirmed because victims helpless, killing was unnecessary to accomplish the robbery, victims bound and gagged); compare Graham, 135 Ariz. at 212, 660 P.2d at 463 ((F)(6) reversed even though defendant \"smiled\" as he told friends that \"the victim 'squealed like a rabbit' when he was shot\"), and Madsen, 125 Ariz. at 353, 609 P.2d at 1052-53 ((F)(6) reversed even though defendant bragged it was \"easy to get money, you just blow someone away\" and collect insurance money), with Martinez-Villareal, 145 Ariz. at 451, 702 P.2d at 680 (depravity affirmed because defendant bragged to a friend that he murdered to show \"machismo\"), and Clark, 126 Ariz. at 437, 616 P.2d at 897 (depravity affirmed where defendant told friend, \"you should have seen Charley when I hit him with those cutters\"); compare Fisher, 141 Ariz. at 252, 686 P.2d at 775 (heinousness and depravity upheld because defendant used more violence than was necessary to rob or kill his victim and victim had shown defendant \"generosity and concern\"), with State v. Johnson, 147 Ariz. 395, 401, 710 P.2d 1050, 1052, 1056 (1985) (reversed on heinous and depraved even though murder was senseless and victims had allowed defendant to stay with them for two weeks and one of victims was a childhood friend of the defendant); compare State v. Brookover, 124 Ariz. 38, 41, 601 P.2d 1322, 1324-25 (1979) (not cruel or depraved even where victim shot twice in the back -- the second time after falling to the floor and crying out to the defendant -- and later abandoned in a parking lot), with Bracy, 145 Ariz. at 538, 703 P.2d at 482 (heinousness and depravity affirmed where victim shot twice and throat slashed); compare Watson, 120 Ariz. at 448, 586 P.2d at 1260 (not heinous, cruel or depraved even where victim shot four times in the back, the last time when face down on the floor), with Ceja, 126 Ariz. at 40, 612 P.2d at 493 (heinousness and depravity affirmed where victim shot twice, then shot four more times). Such cases plainly demonstrate that the (F)(6) circumstance has been applied in an arbitrary and capricious manner in violation of the most basic principles of death penalty jurisprudence.\n\nC.\n\nThe State contends that because this court previously upheld the constitutionality of Arizona's (F)(6) circumstance we need not address the issue. We disagree. In Chaney v. Lewis, 801 F.2d 1191 (9th Cir. 1987), we considered a challenge to (F)(6) both on its face and in its application to the defendant. A three judge panel concluded that the (F)(6) circumstance was not unconstitutional because\n\nthe Arizona Supreme Court appears to have sufficiently channeled sentencing discretion to prevent arbitrary and capricious capital sentencing decisions. The court has defined each of the factors set forth in section 13-703(F)(6). See State v. Gretzler, 135 Ariz. 42, 659 P.2d 1, 9-12, cert. denied, 461 U.S. 971, 77 L. Ed. 2d 1327, 103 S. Ct. 2444 (1983) (\"cruelty\" involves infliction of physical and/or mental pain on victim and \"depraved\" and \"heinous\" involves [sic] killer's state of mind).\n\nId. at 1195 (emphasis added). The panel then cited four Arizona Supreme Court cases -- all decided after Gretzler -- to show that the definitions of cruel, heinous and depraved have since been applied consistently. Id.\n\nWe believe, however, that an analysis of the (F)(6) circumstance cannot begin and end with Gretzler. The Chaney panel's statement that Arizona \"appears\" to have limited discretion -- supported by citation to a total of only five cases -- suggests that it deferred to Arizona's analysis of its own decisions. Our analysis of all of Arizona's death penalty opinions since 1973 leads us to a conclusion different from that in Chaney.\n\nD.\n\nIn summary, we conclude that the (F)(6) circumstance has not been given a sufficiently narrow construction by the Arizona Supreme Court such that its application will be kept within identifiable boundaries. Among the more than fifty cases in which an (F)(6) finding was appealed, we are unable to distinguish rationally those cases in which the Arizona Supreme Court upheld the finding from the few in which it did not. Because neither the legislative standard nor the case law has properly channeled decisionmaking on the imposition of the \"especially heinous, cruel or depraved\" aggravating circumstance, we find that this circumstance has been arbitrarily and capriciously applied by the Arizona courts. Because the Arizona Supreme Court returns a case to the appropriate trial court for reweighing when it reverses at least one of several aggravating circumstances found by the lower court and there are mitigating circumstances,\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e see, e.g., Wallace, 151 Ariz. at 370, 728 P.2d at 239; accord Cartwright, 822 F.2d at 1482 (\"the particular function of an aggravating circumstance in a state's capital punishment system determines the effect of reliance upon an unconstitutional aggravating circumstance\"), we reverse the district court and remand with instructions to grant the writ of habeas corpus unless the State, within a reasonable time, resentences Adamson.\n\nVI.\n\nThus, it is clear the Constitution requires that a statute assure individualized consideration through specific guidelines for determining the existence of aggravating circumstances. The Constitution's mandate, however, is not limited to aggravating circumstances. A capital sentencing scheme also must assure individualized sentencing both through provisions for the consideration of mitigating evidence and in its assignment of the ultimate burden of persuasion as to whether death is the appropriate penalty.\n\nWe hold that in these two areas the Arizona statute is constitutionally flawed. The statute violates the Eighth and Fourteenth Amendments in that (1) Arizona courts are precluded from considering all pertinent mitigating evidence when determining the appropriate penalty, and (2) the statute impermissibly places the burden on the defendant to prove the existence of mitigating circumstances sufficiently substantial to merit leniency, thereby imposing a presumption that death is the appropriate penalty.\n\nA.\n\nThe Supreme Court has consistently held that the Eighth and Fourteenth Amendments require the sentencer in a capital case to be free to consider all relevant evidence in determining the appropriate penalty. This is because \"penalties in capital cases ultimately will turn on mitigating evidence and on the advocate's ability to marshal and present that evidence.\" Goodpaster, The Trial for Life: Effective Assistance of Counsel in Death Penalty Cases, 58 N.Y.U. L. Rev. 299, 315 (1983). The Court has recognized that there is an \"essential difference\" between guiding the care with which the sentencer determines how much weight to accord evidence, and requiring that as a predicate to consideration of that evidence, it must be found true beyond a reasonable doubt, or by some other evidentiary standard. See Cool v. United States, 409 U.S. 100, 104, 34 L. Ed. 2d 335, 93 S. Ct. 354 (1972). Thus, beginning with Woodson v. North Carolina, the Court has struck down statutory sentencing schemes which excluded or restricted consideration of mitigating evidence. See 428 U.S. at 304 (opinion of Stewart, Powell, and Stevens, JJ.) (\"[A] process that accords no significance to relevant facets of the character and record of the individual offender or the circumstances of the particular offense excludes from consideration in fixing the ultimate punishment of death the possibility of compassionate or mitigating factors stemming from the diverse frailties of humankind.\"); see also Roberts v. Louisiana, 428 U.S. 325, 333-34, 49 L. Ed. 2d 974, 96 S. Ct. 3001 (1976) (opinion of Stewart, Powell, and Stevens, JJ.) (a statute must afford \"meaningful opportunity for consideration of mitigating factors presented by the circumstances of the particular crime or by the attributes of the individual offender\"); Lockett v. Ohio, 438 U.S. 586, 604, 57 L. Ed. 2d 973, 98 S. Ct. 2954 (1978) (plurality opinion) (sentencer may \"not be precluded from considering, as a mitigating factor, any aspect of a defendant's character or record and any of the circumstances of the offense that the defendant proffers as a basis for a sentence less than death\") (emphasis in original).\n\nThe Court has held that restricting the sentencer's ability to consider all relevant mitigating evidence \"creates the risk that the death penalty will be imposed in spite of factors which may call for a less severe penalty. When the choice is between life and death, that risk is unacceptable and incompatible with the commands of the Eighth and Fourteenth Amendments.\" Lockett, 438 U.S. at 605.\n\nApplying this principle, the Court in Eddings v. Oklahoma, 455 U.S. 104, 71 L. Ed. 2d 1, 102 S. Ct. 869 (1982), vacated a death sentence where the trial court had refused to weigh against the aggravating circumstances established by the State, mitigating evidence regarding traumatic events during the defendant's childhood. The Court stated that \"the trial judge did not evaluate the evidence in mitigation and find it wanting as a matter of fact; rather he found that as a matter of law he was unable even to consider the evidence.\" Id. at 113 (emphasis in original). The Court held that this limitation violated the rule set forth in Lockett :\n\nJust as the State may not by statute preclude the sentencer from considering any mitigating factor, neither may the sentencer refuse to consider, as a matter of law, any relevant mitigating evidence. . . . The sentencer, and the Court of Criminal Appeals on review, may determine the weight to be given relevant mitigating evidence. But they may not give it no weight by excluding such evidence from their consideration . . . . On remand, the state courts must consider all relevant mitigating evidence and weigh it against the evidence of the aggravating circumstances.\n\nId. at 113-115 (emphasis added).\n\nThus, it is well established that the Constitution requires that the weighing of all relevant mitigating evidence against aggravating circumstances. Id. See also Turner v. Murray, 476 U.S. 28, 34, 90 L. Ed. 2d 27, 106 S. Ct. 1683 (1986) (\"our cases establish that every capital sentencer must be free to weigh relevant mitigating evidence before deciding whether to impose the death penalty . . .\") (citing Eddings and Lockett) (emphasis added).\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e This is not permitted, however, under Arizona's capital sentencing scheme, as applied by its courts.\n\nSection 13-703, as applied by the Arizona courts, has yielded a three-stage sentencing process. First, the state must offer evidence to establish beyond a reasonable doubt the existence of one or more aggravating circumstances. See State v. Jordan, 126 Ariz. 283, 286, 614 P.2d 825, 828 (1980) (\" Jordan II \"); see also LaGrand, 153 Ariz. at 34, 734 P.2d at 576. If the court finds such aggravating circumstance(s), the defendant must then offer mitigating evidence to establish by a preponderance of the evidence the existence of any mitigating circumstance(s).\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e Finally, the court must weigh the aggravating circumstance(s) against the mitigating circumstance(s).\n\nThe constitutional defect at issue lies in the second stage of Arizona's sentencing process. When the defendant offers evidence at the mitigation stage of the sentencing hearing, the court must make two determinations before it moves onto the weighing stage. First, it must determine whether the evidence is relevant to mitigation. If it answers this question in the affirmative, then it must decide whether the evidence presented proves, by a preponderance, that a mitigating circumstance or factor exists. Contrary to the dissent's implications, we do not question the court's ability to determine the relevance of the evidence presented. Rather, our objection lies in the fact that once evidence is deemed relevant to mitigation, in Arizona it will not be weighed against the aggravating circumstance(s) unless that evidence establishes a mitigating circumstance by a preponderance.\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e See Pulaski, Capital Sentencing, 1984 Ariz. St. L.J. at 44 (\"Under the current Arizona legislation, a sentencing judge cannot consider claimed events or conditions proffered in mitigation unless satisfied by the required standard of proof that they, in fact, occurred.\").\n\nThus, the Arizona courts are precluded from weighing evidence of mitigation that, while not satisfying the evidentiary standard, nonetheless may give the sentencer reservations about the appropriateness of imposing a sentence of death. This exclusion of relevant evidence at the weighing stage violates the principle established by Woodson, Roberts, Lockett, Eddings, and reaffirmed in Turner that a sentencing court must weigh all relevant mitigating evidence against the aggravating circumstances. Thus, the process established by the Arizona death penalty statute is unconstitutional as a matter of law.\n\nB.\n\nWe also hold A.R.S. § 13-703 unconstitutional on its face, to the extent that it imposes a presumption of death on the defendant. Under the statute, once any single statutory aggravating circumstance has been established, the defendant must not only establish the existence of a mitigating circumstance,\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e but must also bear the risk of nonpersuasion that any mitigating circumstance will not outweigh the aggravating circumstance(s). See Gretzler, 135 Ariz. at 54, 659 P.2d at 13 (A.R.S. § 13-703(E) requires that the court find mitigating circumstances outweigh aggravating circumstances in order to impose life sentence).\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e The relevant clause in the statute -- \"sufficiently substantial to call for leniency\" -- thus imposes a presumption of death\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e once the court has found the existence of any single statutory aggravating circumstance.\n\nRecently, the Eleventh Circuit held in Jackson v. Dugger, 837 F.2d 1469 (11th Cir. 1988), that a presumption of death violates the Eighth Amendment. The trial judge, applying Florida's death penalty statute, had instructed the jury to presume that death was to be recommended as the appropriate penalty if the mitigating circumstances did not outweigh the aggravating circumstances. Examining the jury instructions, the Eleventh Circuit held that a presumption that death is the appropriate sentence impermissibly \"tilts the scales by which the [sentencer] is to balance aggravating and mitigating circumstances in favor of the state.\" Id. at 1474. The court further held that a presumption of death \"if employed at the level of the sentencer, vitiates the individualized sentencing determination required by the Eighth Amendment.\" Id. at 1473.\n\nThe Constitution \"requires consideration of the character and record of the individual offender and the circumstances of the particular offense,\" Woodson, 428 U.S. at 304, because the punishment of death is \"unique in its severity and irrevocability,\" Gregg, 428 U.S. at 187, and because there is \"fundamental respect for humanity underlying the Eighth Amendment.\" Woodson, 428 U.S. at 304 (citation omitted). A defendant facing the possibility of death has the right to an assessment of the appropriateness of death as a penalty for the crime the person was convicted of. Thus, the Supreme Court has held that statutory schemes which lack an individualized evaluation, thereby functioning to impose a mandatory death penalty, are unconstitutional. See, e.g., Sumner v. Shuman, 483 U.S. 66, 107 S. Ct. 2716, 2723, 97 L. Ed. 2d 56 (1987); Roberts, 428 U.S. at 332-33; see also Poulos, Mandatory Capital Punishment, 28 Ariz. L. Rev. at 232 (\"In simple terms, the cruel and unusual punishments clause requires individualized sentencing for capital punishment, and mandatory death penalty statutes by definition reject that very idea.\").\n\nIn addition to precluding individualized sentencing, a presumption of death conflicts with the requirement that a sentencer have discretion when faced with the ultimate determination of what constitutes the appropriate penalty. See Comment, Deadly Mistakes: Harmless Error in Capital Sentencing, 54 U. Chi. L. Rev. 740, 754 (1987) (\"The sentencer's authority to dispense mercy . . . ensures that the punishment fits the individual circumstances of the case and reflects society's interests.\").\n\nArizona Revised Statute § 13-703(E) reads, in relevant part: \"the court . . . shall impose a sentence of death if the court finds one or more of the aggravating circumstances . . . and that there are no mitigating circumstances sufficiently substantial to call for leniency.\" Thus, the Arizona statute presumes that death is the appropriate penalty unless the defendant can sufficiently overcome this presumption with mitigating evidence.\u003cspan class=\"fnref\"\u003e50\u003c/span\u003e In imposing this presumption, the statute precludes the individualized sentencing required by the Constitution. It also removes the sentencing judge's discretion by requiring the judge to sentence the defendant to death if the defendant fails to establish mitigating circumstances by the requisite evidentiary standard, which outweigh the aggravating circumstances. See Arizona v. Rumsey, 467 U.S. 203, 210, 81 L. Ed. 2d 164, 104 S. Ct. 2305 (1984) (\"death must be imposed if there is one aggravating circumstance and no mitigating circumstance sufficiently substantial to call for leniency\"); State v. Jordan, 137 Ariz. 504, 508, 672 P.2d 169, 173 (1983) (\" Jordan III \") (§ 13-703 requires the death penalty if no mitigating circumstances exist).\u003cspan class=\"fnref\"\u003e51\u003c/span\u003e\n\nThe State relies on the holdings of its courts that the statute's assignment of the burden of proof does not violate the Constitution. The Arizona Supreme Court reasons that \"once the defendant has been found guilty beyond a reasonable doubt, due process is not offended by requiring the defendant to establish mitigating circumstances.\" Richmond, 136 Ariz. at 316, 666 P.2d at 61.\u003cspan class=\"fnref\"\u003e52\u003c/span\u003e Yet this reasoning falls short of the real issue -- that is, whether the presumption in favor of death that arises from requiring that the defendant prove that mitigating circumstances outweigh aggravating circumstances, offends federal due process by effectively mandating death.\u003cspan class=\"fnref\"\u003e53\u003c/span\u003e\n\nIn addition, while acknowledging that A.R.S. § 13-703 places the burden on the defendant to prove the existence of mitigating circumstances which would show that person's situation merits leniency, State v. Poland, 144 Ariz. 388, 406, 698 P.2d 183, 201 (1985), aff'd, 476 U.S. 147, 90 L. Ed. 2d 123, 106 S. Ct. 1749 (1986), the State suggests that its statute does not violate the Eighth Amendment because subsection (E) requires the court to balance the aggravating against the mitigating circumstances before it may conclude that death is the appropriate penalty. While the statute does require balancing, it nonetheless deprives the sentencer of the discretion mandated by the Constitution's individualized sentencing requirement.\u003cspan class=\"fnref\"\u003e54\u003c/span\u003e This is because in situations where the mitigating and aggravating circumstances are in balance, or, where the mitigating circumstances give the court reservation but still fall below the weight of the aggravating circumstances, the statute bars the court from imposing a sentence less than death and thus precludes the individualized sentencing required by the Constitution. Thus, the presumption can preclude individualized sentencing as it can operate to mandate a death sentence,\u003cspan class=\"fnref\"\u003e55\u003c/span\u003e and we note that \"presumptions in the context of criminal proceedings have traditionally been viewed as constitutionally suspect.\" Jackson, 837 F.2d at 1474 (citing Francis and Sandstrom).\n\nThus, we hold that the Arizona statute, which imposes a presumption of death, is unconstitutional as a matter of law.\u003cspan class=\"fnref\"\u003e56\u003c/span\u003e We reverse the district court and remand with instructions to grant the writ of habeas corpus unless the State, within a reasonable time, resentences Adamson to a sentence other than death.\n\nVII.\n\nThe final issue we must address is whether certain hearsay statements admitted by the trial court violated the Confrontation Clause. We hold that the statements were improperly admitted but that the error was harmless for the reasons stated in Adamson v. Ricketts, 758 F.2d at 445-47.\n\nConclusion\n\nIn Part II, we affirm the district court on the issue of judicial vindictiveness. We reverse the district court with regard to the issue of prosecutorial vindictiveness and remand with instructions to conduct an evidentiary hearing on that issue.\n\nIn Part III, we reverse the district court and hold that the death penalty was imposed arbitrarily, in violation of the Eighth and Fourteenth Amendments. We remand to the district court with instructions to grant the writ of habeas corpus unless the State, within a reasonable time, resentences Adamson to a sentence other than death.\n\nIn Part IV, we hold that the Arizona death penalty statute deprived Adamson of his right to a jury decision on the elements of the crime, in violation of the Sixth and Fourteenth Amendments. We reverse the district court on this issue and remand to the district court to grant the writ of habeas corpus unless the State, within a reasonable time, imposes a sentence other than death.\n\nIn Part V, we hold that the state, in violation of the Eighth and Fourteenth Amendments, has failed to define the aggravating circumstances set forth in A.R.S. § 13-703(F)(6) (especially heinous, cruel or depraved) so that its application will be kept within identifiable boundaries. We reverse the district court and remand with instructions to grant the writ of habeas corpus unless the State, within a reasonable time, resentences Adamson in accordance with the rule set forth in State v. Gillies, 135 Ariz. 500, 516, 662 P.2d 1007, 1023 (1983) (en banc) (supplemental opinion).\n\nIn Part VI, we hold that the Arizona death penalty statute violates the Eighth and Fourteenth Amendments in that (1) the Arizona courts are precluded from considering all relevant mitigating evidence, and (2) the burden of proof placed on a defendant creates a presumption that death is the appropriate penalty. We reverse the district court and remand with instructions to grant the writ of habeas corpus unless the State, within a reasonable time, imposes a sentence other than death.\n\nIn Part VII, we hold that although certain hearsay statements admitted at trial constituted error, the error was harmless, and thus we affirm the district court on that issue.\n\nWe AFFIRM the district court in part, REVERSE in part, and REMAND with instructions.\n\nBoochever, Circuit Judge, concurring:\n\nI do not believe that the trial judge's prior sentencing of Adamson to a term of 48-49 years for second degree murder pursuant to a plea bargain is a valid basis for holding that imposition of the death sentence, subsequent to the breach of the agreement and after conviction for first degree murder, was arbitrary and capricious.\n\nBRUNETTI, Circuit Judge, with whom ALARCON, BEEZER, and THOMPSON, Circuit Judges, join, concurring and dissenting:\n\nThe majority opinion identifies and decides six issues in this appeal: whether Adamson's death sentence was imposed, (1) as a result of judicial vindictiveness or prosecutorial vindictiveness, in violation of the Fourteenth Amendment's Due Process Clause; (2) in an arbitrary and capricious manner, in violation of the Eighth Amendment; (3) in violation of right to trial by jury because the aggravating circumstances factor in the Arizona death penalty statute functions as an element of a crime; (4) pursuant to the Arizona death sentence statutory aggravating circumstances factor, heinous, cruel or depraved, which fails to adequately channel the judge's discretion, in violation of the Eighth Amendment; (5) pursuant to the Arizona death sentence statute which precludes meaningful consideration of all mitigating evidence, and imposes a presumption of death, in violation of the Eighth Amendment; and (6) after the admission at trial of certain hearsay evidence, in violation of the Constitution's Confrontation Clause.\n\nI agree with the majority's holding as it relates to judicial vindictiveness, and issue 6, that any hearsay statements erroneously admitted were harmless. Thus, I concur in the majority's decision to affirm the district court on those two grounds. However, I have difficulty with the majority's analysis, and disagree with its holding as it relates to the remaining issues, issue 1 as to prosecutorial vindictiveness and issues 2-5. Thus, I respectfully dissent from the majority's decision to reverse (and remand to) the district court on these five grounds. My five points of disagreement will be discussed in turn.\n\nI.\n\nPROSECUTORIAL VINDICTIVENESS\n\nAdamson's second conviction and sentence do not violate the Due Process Clause as a result of prosecutorial vindictiveness. A prosecutor cannot bring increased charges in retaliation to a defendant's exercise of a constitutional right. Blackledge v. Perry, 417 U.S. 21, 27-28, 40 L. Ed. 2d 628, 94 S. Ct. 2098 (1974). The appearance of vindictiveness is enough to constitute a violation of due process of law. Id. at 28. United States v. Goodwin, 457 U.S. 368, 378, 73 L. Ed. 2d 74, 102 S. Ct. 2485 (1982). Adamson had entered into a plea agreement after he had been charged for first degree murder and while the jury for his trial was being selected. Ricketts v. Adamson, 483 U.S. 1, 107 S. Ct. 2680, 2682, 97 L. Ed. 2d 1 (1987). The plea bargain puts the case in a much different posture than the majority describes:\n\nIn [the prosecutorial vindictiveness cases] the Court was dealing with the State's unilateral imposition of a penalty upon a defendant who had chosen to exercise a legal right to attack his original conviction -- a situation \"very different from the give-and-take negotiation common in plea bargaining between the prosecution and defense, which arguably possess relatively equal bargaining power.\"\n\nBordenkircher v. Hayes, 434 U.S. 357, 362, 54 L. Ed. 2d 604, 98 S. Ct. 663 (1978), quoting Parker v. North Carolina, 397 U.S. 790, 25 L. Ed. 2d 785, 90 S. Ct. 1458 (1970). In the context of a plea bargain, a prosecutor may use the threat of increased charges to secure a plea agreement, Bordenkircher, 434 U.S. at 364, and the presence of the plea agreement here dispels any possibility of prosecutorial vindictiveness. The reinstatement provision in the plea agreement was simply the means of enforcing the promise that Adamson had made to testify \"fully and completely\".\n\nThe Supreme Court found that Adamson had voluntarily and intelligently entered into the plea agreement where \"both parties bargained for and received substantial benefits.\" Ricketts v. Adamson, 107 S. Ct. at 2685 and n. 5. Once a defendant voluntarily and intelligently enters into a plea agreement, he or she can only escape its consequences if the plea was induced by an offer from the prosecutor that is not forthcoming or if the defendant was not fully apprised of its consequences. Mabry v. Brown, 467 U.S. 504, 508-510 (1984). Here, the prosecution came through with its exchange: they agreed to a second degree murder charge with a fixed sentence of 48-49 years, with a total incarceration time of 20 years and 2 months, and that sentence was imposed. Ricketts v. Adamson, 107 S. Ct. at 2682-83. Adamson promised to \"testify fully and completely in any Court, State or Federal, when requested by proper authorities, against any and all parties involved in the murder of Don Bolles. . . .\" Id. The consequences to Adamson should he not do as promised were clearly spelled out in the agreement:\n\nThe terms of the agreement could not be clearer: in the event of respondent's breach occasioned by a refusal to testify, the parties would be returned to the status quo ante. . . .\n\nId. at 2685. The Supreme Court recognized that to disallow the consequence of the original first degree murder charge reinstatement would \"render the agreement meaningless.\" Id. at 2686. They further recognized that Adamson knew the consequence of a breach of the promise and with that awareness breached the contract.\n\n[Adamson] could submit to the State's request that he testify at the retrial, and in so doing risk that he would be providing testimony that pursuant to the agreement he had no obligation to provide, or he could stand on his interpretation of the agreement, knowing that if he were wrong, his breach of the agreement would restore the parties to their original position and he could be prosecuted for first degree murder.\n\nRicketts v. Adamson, 107 S. Ct. at 2686 (emphasis added). See also Id. at 2684-85, n. 3. (Supreme Court declined to \"second guess\" the Arizona Supreme Court finding that Adamson had breached his plea agreement). The agreement specified in two separate paragraphs the consequences that would flow from Adamson's breach of his promise. Id. at 2685. In paragraph 5, the agreement provides that if Adamson refused to testify, \"this entire agreement is null and void and the original charge will be automatically reinstated.\" Adamson v. Ricketts, 789 F.2d 722, 731 (9th Cir. 1986) (Appendix A) (emphasis added). Paragraph 15 provides that \"in the event this agreement becomes null and void, then the parties shall be returned to the positions they were in before this agreement.\" Id. at 732. Adamson \"unquestionably understood the meaning of these provisions.\" Ricketts v. Adamson, 107 S. Ct. at 2685. Therefore, Adamson entered into a valid plea agreement, then breached that agreement rendering it null and void, and in accordance with the terms of the agreement the first degree murder charge was automatically reinstated, subjecting him to the same charge that was against him (and that he was in the midst of trial for) when he entered the agreement.\n\nAdamson's offer to testify following the Arizona Supreme court's decision which upheld the plea agreement, and held that there was a breach and that the reinstatement provision was valid, could not \"cure\" the breach.\n\nIt is of no moment that following the Arizona Supreme Court's decision [Adamson] offered to comply with the terms of the agreement. At this point, [Adamson's] second-degree murder conviction had already been ordered vacated and the original charge reinstated. The parties did not agree that [Adamson] would be relieved from the consequences of his refusal to testify if he were able to advance a colorable argument that a testimonial obligation was not owing. The parties could have struck a different bargain. . . .\n\nId. at 2687 (emphasis added). Thus, Adamson's offer to testify at that point was an offer for a new bargain. The dissent in Ricketts v. Adamson asked why the prosecution did not take Adamson up on his new offer. Id. at 2692, n. 13. Adamson had broken his promise twice before. This court's majority opinion notes that the convictions of Robison and Dunlap support the conclusion that Adamson testified fully and credibly for the prosecution. Maj. op. at 1020. However, the reason Robison's and Dunlap's convictions were reversed by the Arizona Supreme Court was because Adamson refused to answer a key question on cross-examination. State v. Dunlap, 125 Ariz. 104, 608 P.2d 41, 42 (1980); State v. Robison, 125 Ariz. 107, 608 P.2d 44, 46 (1980). The Arizona Supreme Court found that because Adamson's testimony was central to the convictions against Robison and Dunlap, that Adamson's refusal to testify violated Robison's and Dunlap's right to confrontation and reversed their convictions. Dunlap, 608 P.2d at 42-43, Robison, 608 P.2d at 46-47. The State, at that point, did not attempt to penalize Adamson for his broken promise, however they did seek Adamson's cooperation and testimony for Dunlap's and Robison's retrial. Only after Adamson refused to testify and demanded a new agreement did the state declare Adamson to be in breach of the plea agreement. Ricketts v. Adamson, 107 S. Ct. at 2683. Adamson, through his attorneys, challenged the agreement and his obligation to testify, again breaking his promise to testify \"fully and completely.\" Id. at 2683. After challenging the agreement all the way to the Arizona Supreme Court, Adamson then agreed to testify, however, at this point the prosecution had no duty to enter into a plea agreement, Weatherford v. Bursey, 429 U.S. 545, 561, 51 L. Ed. 2d 30, 97 S. Ct. 837 (1977). Further, the prosecution had no incentive to enter into a second agreement with someone who had twice broken his promise to testify (the only benefit the state was to receive from Adamson in exchange for dropping its first degree charge and murder trial and accepting a second degree murder plea with a specific sentence); and who had caused the cases against the other conspirators, Robison and Dunlap, (the object of the plea agreement) to be reversed. Adamson had no reservations in challenging the first agreement as it unfolded and as the majority recognizes (maj. op. at 1020 n. 12), the state could not obtain a guarantee that Adamson would testify fully or truthfully, and, in fact, he did not. The state did have recourse by the reinstatement of the first degree murder charge under the agreement. When Adamson made the offer to promise to testify the second time he had not been tried or convicted of first degree murder, and the state had no guaranty for his full or truthful testimony.\n\nUnder Adamson's view of the agreement there could be no automatic reinstatement, thereby rendering any enforcement provisions of a new plea agreement meaningless. If Adamson were allowed to escape the enforcement provisions of the original plea agreement it would \"render the agreement meaningless.\" Ricketts v. Adamson, 107 S. Ct. at 2686. As the law favors plea agreements, Bordenkircher, 434 U.S. at 363-64, Adamson should be held to his bargain and suffer the consequences of his voluntary breach.\n\nII.\n\nARBITRARY AND CAPRICIOUS\n\nA sentence of death is \"arbitrary and capricious\" under the Eighth Amendment if it is not suitably directed and limited. Gregg v. Georgia, 428 U.S. 153, 189, 49 L. Ed. 2d 859, 96 S. Ct. 2909 (1976). The concerns expressed in Furman v. Georgia, 408 U.S. 238, 33 L. Ed. 2d 346, 92 S. Ct. 2726 (1972) that the penalty of death not be imposed in an arbitrary or capricious manner are met by a carefully drafted statute which ensures that the sentencing authority is given adequate information and guidance. Gregg, 428 U.S. at 195. The safeguards espoused in Gregg v. Georgia, 428 U.S. 153, 49 L. Ed. 2d 859, 96 S. Ct. 2909 (1976), Proffitt v. Florida, 428 U.S. 242, 49 L. Ed. 2d 913, 96 S. Ct. 2960 (1976), Jurek v. Texas, 428 U.S. 262, 49 L. Ed. 2d 929, 96 S. Ct. 2950 (1976), Woodson v. North Carolina, 428 U.S. 280, 49 L. Ed. 2d 944, 96 S. Ct. 2978 (1976), Roberts v. Louisiana, 428 U.S. 325, 49 L. Ed. 2d 974, 96 S. Ct. 3001 (1976) (hereinafter the \"1976 Cases\"), are standards for statutes that guide the sentencing authority including weighing aggravating and mitigating circumstances and weighing them against each other, and providing for de novo appellate review. Gregg, 428 U.S. at 193-195. These cases determined the constitutionality of the death penalty after it was struck down in 1972 in Furman v. Georgia, 408 U.S. 238, 33 L. Ed. 2d 346, 92 S. Ct. 2726. The guidelines should focus on the individual circumstances of each case and on the individual defendant. Proffitt, 428 U.S. at 252; Gregg, 428 U.S. at 199.\n\nBy narrowing its definition of capital murder, Texas has essentially said that there must be at least one statutory aggravating circumstance in a first-degree murder case before a death sentence may even be considered. But authorizing the defense to bring before the jury at the separate sentencing hearing whatever mitigating circumstances relating to the individual defendant can be adduced, Texas has ensured that the sentencing jury will have adequate guidance to enable it to perform its sentencing function. By providing prompt judicial review of the jury's decision in a court with statewide jurisdiction, Texas has provided a means to promote the evenhanded, rational, and consistent imposition of death sentences under law.\n\nJurek v. Texas, 428 U.S. 262, 276, 49 L. Ed. 2d 929, 96 S. Ct. 2950 (1976). Since Furman, the Supreme court has insisted that the channeling and limiting of the sentencer's discretion in imposing the death penalty is a fundamental constitutional requirement for sufficiently minimizing the risk of wholly arbitrary and capricious action. Maynard v. Cartwright, 486 U.S. 356, 108 S. Ct. 1853, 1858, 100 L. Ed. 2d 372 (1988).\n\nThis arbitrary and capricious argument is usually applied when analyzing statutory sentencing schemes, and the 1976 Cases analyzed the statutory schemes of five states to see if their legislative changes after Furman were constitutional. The cases the majority cites for the proposition that a sentence of death may not be imposed by a judge in an arbitrary or capricious manner analyze the requirements of a statute, not the actions of an individual judge. E.g., California v. Ramos, 463 U.S. 992, 998-99, 77 L. Ed. 2d 1171, 103 S. Ct. 3446 (1983) (discusses constitutionality of the \"Briggs Instruction\" mandated under California's sentencing scheme); Gregg v. Georgia, 428 U.S. 153, 188, 49 L. Ed. 2d 859, 96 S. Ct. 2909 (1976) (upholding the constitutionality of Georgia's sentencing scheme); Booth v. Maryland, 482 U.S. 496, 107 S. Ct. 2529, 96 L. Ed. 2d 440, reh'g denied 483 U.S. 1056, 108 S. Ct. 31, 97 L. Ed. 2d 820 (1987) (precluded the use of a victim impact statement, mandated pursuant to a state statute, as a constitutionally unacceptable risk that the jury may impose the death penalty in an arbitrary or capricious manner); Gardner v. Florida, 430 U.S. 349, 51 L. Ed. 2d 393, 97 S. Ct. 1197 (1977) (held that presentence reports used in sentencing process must be shown to the defendant so that he may present evidence rebutting the report).\n\nThe Supreme Court, in analyzing the actions of a judge, within a constitutional statutory sentencing scheme, have used the \"judicial vindictiveness\" framework. U.S. v. Goodwin, 457 U.S. 368, 372-74, 73 L. Ed. 2d 74, 102 S. Ct. 2485 (1982), citing Bordenkircher v. Hayes, 434 U.S. 357, 363, 54 L. Ed. 2d 604, 98 S. Ct. 663 (1978). That is, a court cannot sentence a defendant more severely simply because he exercised his right to trial or any other constitutional rights. North Carolina v. Pearce, 395 U.S. 711, 724, 23 L. Ed. 2d 656, 89 S. Ct. 2072 (1969). If the majority is characterizing \"arbitrary and capricious\" as an abuse of discretion, they would have to show much more than disparate sentencing. They would have to show the trial judge failed to conduct an adequate investigation into facts necessary for an intelligent exercise of the trial court's sentencing power. State v. Grier, 146 Ariz. 511, 707 P.2d 309 (1985). However, the majority carefully notes the time the trial judge spent considering the facts about the defendant and the case, and investigating other relevant facts. Maj. op. at 1021. Assuming arguendo that the arbitrary and capricious analysis as announced by the Supreme Court can be applied to an individual judge's actions, it is necessary to ask if the judge was guided by a carefully drafted statute, if he had adequate information and guidance, and if he focused on the individual circumstances of the case and on the individual defendant. Gregg, 428 U.S. at 193-195; Proffitt, 428 U.S. at 252. The majority states that the judge was \"arbitrary\" because at one point in the case, he approved a 48-49 year sentence for a second degree murder plea and then three years later, he sentenced Adamson to death after he was convicted of first degree murder. Out of context the majority calls this action arbitrary -- but any choice appears arbitrary until inquiry is made as to the context and the reasons for the choice.\n\nTo determine whether the judge was properly \"guided\", it is necessary to look at the context in which he made the sentences and the differences between the two situations to see if they are reasonable. If the judge was reasonable and logical in his sentencing then he would not be arbitrary or capricious. Booth v. Maryland, 107 S. Ct. at 2536 (\"Any decision to impose the death penalty must be, and appear to be based on reason rather than caprice or emotion.\"). The majority neglects to consider the fact that Adamson's first sentence must be examined in light of the existence of the plea bargain.\n\nThere are four differences between the second degree murder sentence pursuant to the plea bargain and the sentence imposed after the jury trial convicting Adamson of first degree murder: 1) the presence or absence of the plea bargain and the degree of cooperation of Adamson; 2) the fact that the judge was sentencing two different crimes: second degree murder and first degree murder; 3) the fact that a full trial on the merits to a jury intervened between the two sentences; and 4) the fact that Adamson was on notice that if he breached the plea agreement, he could receive the death penalty.\n\n1. The Plea Bargain.\n\nThe trial judge when accepting a plea bargain is accepting a compromise, otherwise it would not be a \"bargain.\" Mabry v. Johnson, 467 U.S. 504, 508, 81 L. Ed. 2d 437, 104 S. Ct. 2543 (1984). \"Each side may obtain advantages when a guilty plea is exchanged for sentencing concessions.\" Id. (emphasis added.) In deciding whether to accept the plea bargain between the prosecution and Adamson, the judge had to decide whether to make sentencing concessions. Once that decision was made, it was subject only to an abuse of discretion. State v. Grier, 146 Ariz. 511, 707 P.2d 309, 313 (1985) (if a sentence is within statutory limits it will not be disturbed unless there is an abuse of discretion). Here, the Supreme Court found that both parties bargained for and received substantial benefits. Ricketts v. Adamson, 107 S. Ct. at 2685. The trial judge exercised his discretion and sentenced Adamson to the term agreed upon by Adamson and the state in the plea agreement. Adamson thus secured \"a lesser penalty than might be imposed if there were a guilty verdict after trial to judge or jury.\" See Mabry, 467 U.S. at 508, n. 8.\n\nWhen Adamson breached the plea agreement the first degree murder charges were reinstated according to the terms of the plea bargain. Ricketts v. Adamson, 107 S. Ct. at 2683, n. 3 (federal court on habeas cannot disturb state courts finding of breach of the plea agreement). Thus, when the judge sentenced Adamson after the jury trial, it was not pursuant to any plea agreement -- no sentencing concessions had to be made. Additionally, Adamson had refused to testify at a deposition held before the retrial of Dunlap and Robison, and in spite of what Adamson said he would do, what he had done was exhibit a lack of cooperation by breaching the plea agreement and refusing to testify. Ricketts v. Adamson, 107 S. Ct. at 2683. If the prosecution is precluded from enforcement of a plea agreement and can never reinstate charges that carry the death penalty, the usefulness of plea bargains would be severely undermined. Whatever may be the \"situation in an ideal world, the fact is that the guilty plea and the often concomitant plea bargain are important components of this country's criminal justice system. Properly administered, they can benefit all concerned.\" Blackledge v. Allison, 431 U.S. 63, 71, 52 L. Ed. 2d 136, 97 S. Ct. 1621 (1977). These advantages can only be secured if dispositions by guilty plea are accorded a great measure of finality. Id. Without enforcement provisions in plea bargaining agreements those accused of capital crimes would never get a plea bargain for a reduced crime or sentence but would be \"forced\" to go to trial because the prosecutor would have no bargaining chip -- no way to enforce the agreement and thus, no incentive to enter into one.\n\nA prosecutor may constitutionally threaten increased charges to induce defendants into entering into plea agreements. Bordenkircher v. Hayes, 434 U.S. 357, 360-65, 54 L. Ed. 2d 604, 98 S. Ct. 663 (1978). \"By hypothesis, the pleas may have been induced by promises of a recommendation of a lenient sentence or a reduction of charges, and this by fear of the possibility of a greater penalty upon conviction after a trial.\" Id. at 363. It follows that if it does not violate Due Process to threaten charges which defendant was \"plainly subject to prosecution\", then it cannot violate due process to carry out that threat. Id. at 365. Adamson was in the midst of a trial for first degree murder when he and the prosecution struck their deal. Ricketts v. Adamson, 107 S. Ct. at 2682. To reinstitute the very charges he had already been indicted on and was being tried for, and to suffer punishment upon conviction by a jury, cannot violate the Due Process Clause nor as asserted by the majority be an \"arbitrary or capricious\" sentence.\n\n2. The judge sentenced two different crimes.\n\nAdamson agreed to plead guilty to second degree murder in the plea bargain agreement. Adamson v. Ricketts, 789 F.2d at 731. The court accepted the guilty plea but postponed acceptance of the structured sentence (48-49 years with incarceration time of 20 years 2 months) pending review and receipt of the presentence report. Id. at 724.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Four days later, the judge accepted the entire plea agreement including the sentence. Id.\n\nThe determination of an appropriate sentence requires the exercise of discretion after due consideration given to, among other things, the crime charged, the particular circumstances of the individual before the court and the purpose of a penal sanction, i.e., societal protection, rehabilitation and deterrence. . . . Just as the court must be free to impose a more severe sentence when warranted, the plea and sentencing process must leave the court leeway to consider a lesser penalty when the facts and justice so require.\n\nDominguez v. Meehan, 140 Ariz. 329, 332, 681 P.2d 912, 915 (1983) (emphasis added).\n\nThe judge's determination of appropriateness was based on the plea bargain's stated second degree murder charge which Adamson had been \"convicted\" of after the court had accepted his guilty plea. He was not charged or \"convicted\" of first degree murder at this time and the judge had to consider the punishment suitable for the second degree murder crime for which Adamson had been convicted. State v. Jenson, 123 Ariz. 72, 597 P.2d 554 (1979) (a trial judge has no discretion to impose any sentence other than that specified by statute). The structured sentence which Adamson received was almost five times that specified as the minimum in the sentencing statute in effect at the time Adamson was sentenced for second degree murder. A.R.S. § 13-453. This is in addition to the fact that Adamson had to serve 20 years and 2 months before he could apply or be eligible for parole, and that he gave up his right to appeal and other constitutional rights. Adamson v. Ricketts, 789 F.2d at 731-32 (Appendix A). Furthermore, a sentence of death was not then, nor is it now, an available sentencing option for a second degree murder conviction. A.R.S. § 13-453; § 13-1644 (1977) (in 1977 when Adamson was first sentenced, 10 years to life was the sentencing range for second degree murder).\n\nIn November, 1980, following a full trial by jury which unanimously convicted Adamson of first degree murder the judge imposed the death penalty. Ricketts v. Adamson, 107 S. Ct. at 2684. Thus when the original charges were reinstated against Adamson and he was convicted, the judge had a different charge and conviction before him, and in weighing the aggravating and mitigating circumstances under the first degree murder sentencing scheme, the judge had to meet different legislative requirements. A.R.S. § 13-703 (see Maj. Op. at 1015, n. 2 for full text of statute). Under those requirements, the judge had to find an aggravating circumstance beyond a reasonable doubt and weigh that against any mitigating circumstances. A.R.S. § 13-703(E); State v. Richmond, 136 Ariz. 312, 322, 666 P.2d 57, 67, cert. denied, 464 U.S. 986, 78 L. Ed. 2d 367, 104 S. Ct. 435 (1983) (state must prove aggravating circumstances beyond a reasonable doubt). If aggravating outweighed mitigating the judge had to impose the death sentence. A.R.S. § 13-703(E).\n\nUnder the Arizona legislative mandate for sentencing, the trial judge must follow certain guidelines depending on the crime, the circumstances and the individual. Sentencing for second degree murder under a plea bargain agreement is not the same as sentencing after a full trial on the merits for first degree murder. Compare A.R.S. § 13-701 with A.R.S. § 13-703.\n\n3. The effect of a full trial on the merits.\n\nIn a recent case, we discussed the effects of a full trial on the merits on sentencing considerations. McKenzie v. Risley, 842 F.2d 1525 (9th Cir. 1988). In that case, defendant and the prosecutors made a tentative plea agreement subject to certain contingencies. Id. at 1536. The trial judge reluctantly approved the proposal and set a date to receive the plea. Id. Later, the prosecution advised defense counsel that there would be no plea bargain and so no guilty plea was entered. Id. Later, after a full trial, the judge sentenced McKenzie to death. Noting that a sentence of death must be based on reason rather than caprice or emotion (citing Gardner v. Florida, 430 U.S. 349, 358, 51 L. Ed. 2d 393, 97 S. Ct. 1197 (1977)), the Court stated that the fact that the sentence imposed after a trial on the merits is more severe than one the judge was willing to accept as part of a plea bargain does not \"impeach the legitimacy of the sentence\" and that the judge could have approved a settlement calling for a sentence lighter than he himself would have chosen to impose. Id. at 1537.\n\nIn the interval between the plea negotiations and the sentencing proceedings, the trial judge had numerous opportunities to gain additional information upon which to base his sentencing decision. He presided over McKenzie's sixteen-day-long trial; heard the testimony of fifty prosecution witnesses, including witnesses who testified in great detail about the brutality of the crime, McKenzie's apparent premeditation and other aggravating factors; read the presentence investigation report; and, most important, received a unanimous jury verdict finding the defendant guilty beyond a reasonable doubt of two of the most heinous crimes punishable under Montana law.\n\nId. (emphasis added).\n\nThe situation in Adamson's case is similar. Even though Adamson's breach of a plea agreement renders it void, it is as if a plea agreement had never been reached and Adamson was back where he was before the prosecution made their offer. \"The terms of the agreement could not be clearer: in the event of respondent's breach occasioned by a refusal to testify, the parties would be returned to the status quo ante.\" Ricketts v. Adamson, 107 S. Ct. at 2685. The trial judge presided over the intervening trial between the taking and consideration of the plea agreement and heard the testimony of the witnesses, the jury rendered a unanimous verdict, the judge read the presentence report, and considered the aggravating and mitigating circumstances of the crime. This is enough to overcome the assertion that the trial judge was arbitrary or capricious. See McKenzie, 842 F.2d at 1537, n. 24.\n\n4. Adamson had notice he could receive the death penalty.\n\nAdamson knew that if he breached the plea agreement he was at risk for the death penalty. Ricketts v. Adamson, 107 S. Ct. at 2686. Adamson had a choice. He could testify as requested by the State or\n\nHe could stand on his interpretation of the agreement, knowing that if he were wrong, his breach of the agreement would restore the parties to their original positions and he could be prosecuted for first degree murder.\n\nRicketts v. Adamson, 107 S. Ct. at 2686. The agreement specifies in two separate paragraphs the consequences that would occur if Adamson breached. Paragraph 5 provides that if Adamson refused to testify, \"this entire agreement is null and void and the original charge will be automatically reinstated.\" Adamson v. Ricketts, 789 F.2d at 731 (Appendix A). Further Paragraph 15 of the agreement provides: \"in the event this agreement becomes null and void, then the parties shall be returned to the positions they were in before this agreement.\" Id. at 732 (Appendix A). The Supreme Court recognized that to disallow the effect of this \"reinstatement\" clause would render the agreement meaningless, Ricketts v. Adamson, 107 S. Ct. at 2686. They also found that the trial court carefully went over each and every provision of the agreement with Adamson to ensure the constitutional requirements of an intelligent and voluntary plea and thus Adamson's awareness and notice of each provision of the agreement. Ricketts v. Adamson, at 2685.\n\nAlso, Adamson's attorneys in their letter of April 3, advised the prosecutor that Adamson \"is fully aware of the fact that your office may feel that he has not completed his obligations under the plea agreement . . . and, further, that your office may attempt to withdraw the plea agreement from him, [and] that he may be prosecuted for the killing of Donald Bolles on a first degree murder charge.\" Ricketts v. Adamson at 2686-87. Adamson understood what the consequences would be if he breached the agreement. Therefore, the imposition of the death sentence was neither an unfair surprise nor arbitrary, but just the rational, logical, sequential and predictable result of his refusal to testify of which Adamson was acutely aware.\n\nIII.\n\nJUDICIAL V. JURY SENTENCING IN CAPITAL CASES\n\nThe majority holds that the aggravating factor in the Arizona death sentence statute is an element of the crime of \"capital murder\" thereby depriving Adamson of his right to trial by jury. Maj. op. at 1029. The majority is reaching for a conclusion never made by the U.S. Supreme Court. The history of Arizona's death penalty law and its comparison to other states' laws pursued by the majority is irrelevant. The aggravating and mitigating factors considered by an Arizona judge are sentencing factors not elements of the crime to be tried to a jury. Additionally, the Arizona statute goes beyond the constitutional mandate of McMillan and requires that the aggravating factors be proven beyond a reasonable doubt.\n\n1. History of the Arizona Death Penalty.\n\nThe history of Arizona's death penalty, and the changes it has gone through are irrelevant so long as the statute applied here meets constitutional standards. Spaziano v. Florida, 468 U.S. 447, 464, 82 L. Ed. 2d 340, 104 S. Ct. 3154 (1984). Also, the fact that a majority of jurisdictions have adopted a different practice than Arizona does not offend \"common standards of decency.\" Id. \"The Eighth Amendment is not violated every time a State reaches a conclusion different from a majority of its sisters over how best to administer its criminal laws.\" Id.\n\nThe fact that the States have formulated different statutory schemes to punish armed felons is merely a reflection of our federal system, which demands \"tolerance for a spectrum of state procedures dealing with a common problem of law enforcement.\"\n\nMcMillan v. Pennsylvania, 477 U.S. 79, 106 S. Ct. 2411, 2419, 91 L. Ed. 2d 67 (1986) citing Spencer v. Texas, 385 U.S. 554, 566, 17 L. Ed. 2d 606, 87 S. Ct. 648 (1967). Although interesting, the majority's recitation of the history of Arizona's death penalty law and its comparison to other states has no bearing on this issue of punishment. The Supreme Court has made it clear that they are unwilling to say that there \"is any right way for a state to set up its capital sentencing scheme.\" Spaziano, 468 U.S. at 464 [citations omitted].\n\n2. Arizona's aggravating factors are not elements of a crime.\n\nWhile the majority and some commentators have found that death eligibility criteria is a separate crime, the Supreme Court has not. The 1976 Cases did not require that states create a new category of crime to ensure fairness in the application of the death penalty. See, e.g., Proffitt v. Florida, 428 U.S. 242, 253, 49 L. Ed. 2d 913, 96 S. Ct. 2960 (1976). So long as the sentencing scheme satisfies the \"twin objectives\" of the 1976 Cases, it is constitutional. Spaziano, 468 U.S. at 459. The first objective is that the state \"must administer that penalty in a way that can rationally distinguish between those individuals for whom death is an appropriate sanction and those for whom it is not.\" Id. at 460. Secondly, it must also \"allow the sentencer to consider the individual circumstances of the defendant, his background, and his crime.\" Id. at 460, citing Lockett v. Ohio, 438 U.S. 586 (1978).\n\nAfter the defendant has been convicted of first degree murder the Arizona statute requires the prosecutor to prove beyond a reasonable doubt at least one statutory aggravating circumstance in order for the sentencer to consider the statutory maximum penalty of death. State v. Richmond, 666 P.2d at 67. This is the first \"distinguishing\" factor required. Second, the trial judge must consider all proffered mitigating circumstances, the individual circumstances of the defendant, any presentence report and any other factors in mitigation. Knapp v. Cardwell, 667 F.2d 1253, 1259 (9th Cir.), cert. denied, 459 U.S. 1055, 74 L. Ed. 2d 621, 103 S. Ct. 473 (1982). Lastly, these aggravating factors and mitigating factors are weighed against each other to determine if the punishment should be death. A.R.S. § 13-703(E).\n\nNo where in the concerns of Furman, or the 1976 Cases did the Court say that to comply with the constitution the states had to include the determination of the punishment of death as an element of an offense of a crime. Gregg, 428 U.S. at 193-95; Lowenfield v. Phelps, 484 U.S. 231, 108 S. Ct. 546, 98 L. Ed. 2d 568 (1988) (legislature may narrow definition of capital offense or more broadly define capital offense and narrow punishment determination with findings of aggravating circumstances). If the Supreme Court had found that because death is different it required the states to create a new crime of \"capital murder\", it would also have expressly held that the death eligibility elements must be tried to a jury. This it has not done. \"The point is simply that the purpose of the death penalty is not frustrated by, or inconsistent with, a scheme in which the imposition of the penalty in individual cases is determined by a judge.\" Spaziano, 468 U.S. at 462-63.\n\nThe Supreme Court in McMillan emphasized that they should defer to the State's \"chosen course in the area of defining crimes and prescribing penalties\" unless \"it offends some principle of justice so rooted in the traditions and conscience of our people as to be ranked as fundamental.\" McMillan v. Pennsylvania, 106 S. Ct. at 2416-17. The Court found in analyzing the Pennsylvania law that the facts which invoked a prescribed punishment were not elements of the offense subject to proof beyond reasonable doubt by a jury -- but provable by a preponderance to a judge. Id. at 2418-19. The statute did not discard the presumption of innocence nor create any other presumptions so as to relieve the prosecution of its burden of proving guilt; it neither altered the maximum penalty for the crime committed nor created a separate offense calling for a separate penalty; and it operated only to limit the sentencing court's discretion in selecting a penalty within the range already available to it with the special finding. Id. at 2417-18.\n\nThe Arizona statute passes muster under similar factors. It does not alter the presumption of innocence and the prosecutor must prove all the elements of first degree murder beyond a reasonable doubt. The penalty for first degree murder is \"punishable by death or life imprisonment as provided by 13-703.\" A.R.S. § 13-1105. Therefore, the maximum punishment for first degree murder is death. The method of establishing that maximum punishment (A.R.S. § 13-703) does not alter the maximum penalty nor create a separate crime calling for a separate penalty. McMillan, 106 S. Ct. at 2417. The statute limits the Court's discretion in selecting a penalty. A.R.S. § 13-703(E); State v. Zaragoza, 135 Ariz. 63, 69, 659 P.2d 22, 28, cert. denied, Zaragoza v. Arizona, 462 U.S. 1124, 77 L. Ed. 2d 1356, 103 S. Ct. 3097 (1983). Although it is the harshest punishment, the Supreme Court has said the distinctions between capital and noncapital sentencing are not so clear. Spaziano, 468 U.S. at 461. The Arizona sentencing criteria in a proper manner specify which first degree murder convictions warrant the maximum statutory punishment of death.\n\n3. Arizona requires aggravating factors be proved beyond a reasonable doubt.\n\nArizona went farther than the requirements of McMillan. The Supreme Court in McMillan refused to hold that In re Winship, 397 U.S. 358, 25 L. Ed. 2d 368, 90 S. Ct. 1068 (1970), requires that sentencing factors be proven beyond a reasonable doubt. McMillan, 106 S. Ct. at 2416-18, citing Patterson v. New York, 432 U.S. 197, 213, 53 L. Ed. 2d 281, 97 S. Ct. 2319 (1977). However, the Arizona courts have required that the prosecutor prove at least one statutory aggravating circumstance beyond a reasonable doubt. A.R.S. § 13-703; State v. Richmond, 136 Ariz. 312, 666 P.2d 57, 67, cert. denied, 464 U.S. 986, 78 L. Ed. 2d 367, 104 S. Ct. 435 (1983). This additional requirement further insures that the mandate of the 1976 Cases is met -- that the factors which single out individuals for the death penalty be proven with a high degree of reliability and consistency.\n\n4. Sentencing does not have to be tried to a jury.\n\nThe Supreme Court has never held that capital sentencing must be tried to a jury. \"There is no Sixth Amendment right to jury sentencing, even where the sentence turns on specific findings of fact.\" McMillan, 106 S. Ct. at 2420. \"The fact that a capital sentencing is like a trial . . . does not mean that it is like a trial in respects significant to the Sixth Amendment's guarantee of a jury trial.\" Spaziano, 468 U.S. at 459. \"The purpose of the death penalty is not frustrated by, or inconsistent with, a scheme in which the imposition of the penalty in individual cases is determined by a judge.\" Id. at 462-63.\n\nArizona's aggravating factors are not elements of a crime, they are only determinants used to decide whether to apply the maximum punishment for first degree murder. The sentencing factors do not violate any constitutional guarantees of a jury trial. Either a judge or a jury may constitutionally determine a sentence for a crime.\n\nIV.\n\n\"ESPECIALLY HEINOUS, CRUEL, OR DEPRAVED MANNER\"\n\nThe majority also concludes that the aggravating circumstance provided in A.R.S. § 13-703(F)(6) (the murder was committed \"in an especially heinous, cruel or depraved manner\"), violates the Eighth Amendment by failing to adequately channel the decision maker's discretion. The trial judge here found two separate aggravating circumstances: 1) that the defendant committed the offense as consideration for pecuniary gain; 2) that he committed the offense in an especially cruel, heinous and depraved manner. Transcript of the Sentencing Hearing, November 14, 1980, special verdict, Hon. Ben C. Birdsall, pp. 93-97. As the trial judge found that no mitigating factors were sufficiently substantial to warrant leniency (Id.), the finding of the \"pecuniary gain\" factor would be enough to sentence Adamson to death. A.R.S. § 13-703(E). State v. Smith, 146 Ariz. 491, 494, 707 P.2d 289, 302 (1985) (elimination of some aggravating factors in absence of mitigating circumstances does not mandate a remand to the trial court for resentencing). However, I disagree with the majority's holding that F(6) is unconstitutional. The Arizona Supreme Court has adopted a constitutionally acceptable limiting construction of the language of (F)(6), and that limiting construction was applied properly in this case.\n\nThe Arizona Supreme Court provides a limiting construction of (F)(6) in State v. Gretzler, 135 Ariz. 42, 659 P.2d 1, cert. denied, 461 U.S. 971, 77 L. Ed. 2d 1327, 103 S. Ct. 2444, reh'g denied, 463 U.S. 1236, 77 L. Ed. 2d 1452, 104 S. Ct. 32 (1983). However, the majority finds Gretzler construes the word \"cruel\" over broadly. I disagree. In Gretzler, the Arizona Supreme Court stated that \"where . . . there is no evidence that the victims actually suffered physical or mental pain prior to death, or where the evidence presented is inconclusive, we have held that cruelty was not shown.\" Gretzler, 659 P.2d at 10. This limiting construction has been adhered to in subsequent cases. See, e.g., State v. LaGrand, 153 Ariz. 21, 36, 734 P.2d 563, 578, cert. denied, 484 U.S. 872, 108 S. Ct. 207, 98 L. Ed. 2d 158 (1987); State v. Wallace, 151 Ariz. 362, 367, 728 P.2d 232, 237 (1986), petition for cert. filed, (June 10, 1987). The majority argues that this limitation operates \"to include virtually all first degree murders where it can be proven that the victim was conscious.\" Maj. op. at 1034. But this has not been the result in Arizona.\n\nA review of the post-Gretzler cases finds that the circumstances surrounding the murder in each case resulting in a death sentence, were sufficient to establish the victim's actual suffering as opposed to a mere state of consciousness. See, e.g., State v. LaGrand, 734 P.2d at 578 (1987) (victim bound and gagged, threatened with death more than once, had a letter opener held to his throat, received twenty-four stab wounds of which only five would have immediately caused death); State v. Castaneda, 150 Ariz. 382, 394, 724 P.2d 1, 12 (1986) (victim sexually abused, forced to walk naked and barefoot into the desert, begged for his life, was stabbed four times in the chest, died in writhing pain while lying on a red ant hill); State v. Bracy, 145 Ariz. 520, 537, 703 P.2d 464, 481 (1985), cert. denied, 474 U.S. 1110, 88 L. Ed. 2d 932, 106 S. Ct. 898 (1986) (victims herded about home at gunpoint, bound and gagged lying on bed, heard attackers refer to their expendability, except for first victim, endured \"unimaginable terror of having their loved ones shot to death within their hearing and then having to wait for their own turn to come\"); State v. Chaney, 141 Ariz. 295, 312, 686 P.2d 1265, 1282 (1984) (victim attacked in car by defendant with high powered rifle, struck by approximately 200 pieces of flying glass and metal, had arm almost completely severed, bled slowly for approximately 30 minutes, begged for help, acknowledged his impending death); State v. Gillies, 135 Ariz. 500, 513, 662 P.2d 1007, 1020 (1983) (victim repeatedly raped, cast from a 40 foot cliff, begged for mercy, before having her skull crushed by boulders thrown by attackers).\n\nIn an attempt to show the over broad application of Gretzler's cruelty limitation, the majority states that \"in nearly every case in which a finding of cruelty was reversed, the court concluded only that the prosecution had not proven the victim was conscious.\" Maj. op. at 1033. In each of these decisions, the Arizona Supreme Court concluded that the victims' consciousness had not been established, and therefore, neither had cruelty. See Wallace, 728 P.2d at 237; State v. Poland, 144 Ariz. 388, 405, 698 P.2d 183, 200 (1985), aff'd 476 U.S. 147, 90 L. Ed. 2d 123, 106 S. Ct. 1749 (1986); State v. Villafuerte, 142 Ariz. 323, 331, 690 P.2d 42, 50 (1984), cert. denied, 469 U.S. 1230, 84 L. Ed. 2d 371, 105 S. Ct. 1234 (1985); State v. Graham, 135 Ariz. 209, 212, 660 P.2d 460, 463 (1983); State v. Jeffers, 135 Ariz. 404, 429, 661 P.2d 1105, 1130, cert. denied, 464 U.S. 865, 78 L. Ed. 2d 174, 104 S. Ct. 199 (1983); State v. Zaragoza, 135 Ariz. 63, 69, 659 P.2d 22, 28, cert. denied, 462 U.S. 1124, 77 L. Ed. 2d 1356, 103 S. Ct. 3097 (1983). But there is nothing startling in that regard. If, per Gretzler, the victims' suffering is a necessary element of a cruelty finding, then the failure to establish consciousness logically precludes a finding of cruelty. Yet, it does not follow that the Arizona Supreme Court would have found cruelty based on consciousness without some evidence of actual suffering, and the majority can cite no case in which that court has espoused such a position.\n\nThe majority's argument is more untenable in light of the Arizona Supreme Court's decision in Adamson's own appeal. Less than four months after Gretzler was decided, the court made it very clear that mere consciousness could not suffice to establish cruelty. Rather, in Adamson, 665 P.2d at 998, the court stated that \"the defendant must also intend that the victim suffer or reasonably foresee that there is a substantial likelihood that the victim will suffer as a consequence of the defendant's acts.\" The majority claims that the Arizona Supreme Court expanded the concept of cruelty when it added the requirement that the prosecution prove the defendant's intent to cause suffering, or the reasonable foreseeability of that suffering. To the contrary, because Adamson saddled the prosecution with an additional element of proof, this narrowed the construction of cruelty.\n\nAnd contrary to the majority's discussion, the Adamson prerequisite has been consistently applied in all post-Adamson cases. In some cases, as the majority has acknowledged, the Arizona Supreme Court has cited Adamson for the intent/foreseeability prerequisite and proceeded to analyze the facts accordingly. See State v. (Bernard) Smith, 146 Ariz. 491, 504, 707 P.2d 289, 302 (1985); Bracy, 703 P.2d at 481; State v. McCall, 139 Ariz. 147, 161, 677 P.2d 920, 934 (1983), cert. denied, 467 U.S. 1220, 81 L. Ed. 2d 375, 104 S. Ct. 2670 (1984); State v. McDaniel, 136 Ariz. 188, 200, 665 P.2d 70, 82 (1983). In other cases, the court has not cited Adamson. However, in each of these cases in which cruelty was found, the facts adequately satisfy the Adamson prerequisite. See, e.g., State v. Correll, 148 Ariz. 468, 480, 715 P.2d 721, 733 (1986) (victims bound, transported, laid on ground in desert, shot seriatum); State v. Carriger, 143 Ariz. 142, 160, 692 P.2d 991, 1009 (1984), cert. denied, 471 U.S. 1111, 85 L. Ed. 2d 864, 105 S. Ct. 2347 (1985) (victim pleaded for his life, was bound, was beaten from behind, unable to ward off the blows); State v. Lambright, 138 Ariz. 63, 75, 673 P.2d 1, 13 (1983), cert. denied, 469 U.S. 892, 83 L. Ed. 2d 203, 105 S. Ct. 267 (1984) (victim abducted, transported, sexually assaulted twice, choked, stabbed in chest, abdomen and neck, the knife being twisted and turned while inside her). I have found no post-Adamson decision in which cruelty was found in the absence of evidence of intent or foreseeability. For example, in Chaney, 686 P.2d at 1282, the court cited Adamson and stated the requirement that \"cruelty must be foreseeable by [the] defendant.\" The court then devoted an entire paragraph to a discussion of the facts supporting foreseeability:\n\nChaney knew of what the AR-15 was capable; he explained its use and power to Deanna. Chaney stood close enough to the victim to see that the victim was in great pain; Chaney then fired again. When Chaney left he knew the victim was not dead and Chaney knew the victim was suffering. The murder was cruel.\n\nId. In State v. Rossi, 146 Ariz. 359, 365, 706 P.2d 371, 377 (1985), the court did not cite Adamson, but similarly included a reference to the defendant's use of \"ammunition that was designed to inflict greater tissue damage than ordinary bullets.\"\n\nThat Rossi and other opinions do not include a citation to Adamson or a specific conclusion as to intent or foreseeability should not be controlling. Based on Proffitt v. Florida, 428 U.S. 242, 255, 49 L. Ed. 2d 913, 96 S. Ct. 2960, n. 12 (1976), we should look to the circumstances of the cases, not merely the court's language, to determine whether a limiting construction has been abandoned. Neither Rossi nor any other post-Adamson decision indicates that the Arizona Supreme Court has abandoned the Adamson prerequisite.\n\nThus, taking Gretzler and Adamson together, the Arizona Supreme Court has set forth a construction of cruelty that requires a showing that the victim suffered physical or mental pain prior to death, and that the defendant intended or could reasonably foresee that the victim would so suffer. This construction \"channel[s] the sentencer's discretion by clear and objective standards that provide 'specific and detailed guidance;' and that 'make rationally reviewable the process for imposing a sentence of death.'\" Godfrey v. Georgia, 446 U.S. 420, 428, 64 L. Ed. 2d 398, 100 S. Ct. 1759 (1980) quoting Woodson v. North Carolina, 428 U.S. 280, 303, 49 L. Ed. 2d 944, 96 S. Ct. 2978 (1976); Proffitt, 428 U.S. at 253; Gregg v. Georgia, 428 U.S. 153, 198, 49 L. Ed. 2d 859, 96 S. Ct. 2909 (1976).\n\nIn Maynard v. Cartwright, 486 U.S. 356, 108 S. Ct. 1853, 100 L. Ed. 2d 372 (1988) the Supreme Court affirmed the Tenth Circuit (en banc) finding that the aggravating circumstance of \"especially heinous, atrocious, or cruel\" of Oklahoma's capital sentencing statute violated the Eighth Amendment. Id. at 1857. The Court found the words did not sufficiently guide the jury and that the Oklahoma courts had not cured the infirmity by a limited construction of the terms. Id. Nor, could the Tenth Circuit's analysis look at the aggravating circumstance disjunctively -- finding \"cruel\" to be more precise than \"heinous\" or \"atrocious,\" Cartwright v. Maynard, 822 F.2d 1477, 1489-90 (10th Cir. 1987) (en banc). In Oklahoma, the Court of Criminal Appeals did not specify which term it was relying on when it found the aggravating circumstance to be present. Rather, after reviewing all of the circumstances surrounding the murder, the court would conclude either that the murder was \"at the 'core' of the circumstance,\" see, e.g., Nuckols v. State, 690 P.2d 463, 472-73 (Okl. Cr. 1984), or that it was not so. See, e.g., Odum v. State, 651 P.2d 703, 707 (Okl. Cr. 1982). Thus, as the Tenth Circuit alluded, a court reviewing such Oklahoma decisions could only speculate as to what findings underlied the \"heinous, atrocious, or cruel\" determination. Id. Even though the jury found another, unchallenged aggravating circumstance sufficient to sustain the sentence, Oklahoma had no procedure to save the death penalty when one of several aggravating circumstances relied on was invalid. Id. at 1860. The Court simply vacated the death sentence and automatically imposed a life-imprisonment sentence. Id. at 1857.\n\nEven if the limiting construction of heinousness and depravity runs afoul of the Supreme Court's Eighth Amendment authority such as Maynard v. Cartwright, 486 U.S. 356, 108 S. Ct. 1853, 100 L. Ed. 2d 372 (1988), this case is unaffected. In particular, because the Arizona Supreme Court found that Adamson's crime was cruel, but did not make a finding as to heinousness and depravity, any alleged constitutional deficiency surrounding those latter two terms is irrelevant to this appeal.\n\nThe Arizona Supreme Court reads the disjunctive language of (F)(6) (\"heinous, cruel, or depraved\") as permitting the establishment of this aggravating circumstance upon a finding of one or more of the statutory terms. See Wallace, 728 P.2d at 236-37; Gretzler, 659 P.2d at 10. The court has frequently found (F)(6) to be present in a case based only on a finding of cruelty, see, e.g., State v. Harding, 141 Ariz. 492, 501, 687 P.2d 1247, 1256 (1984); State v. (Robert) Smith, 138 Ariz. 79, 85-86, 673 P.2d 17, 23-24 (1983); McDaniel, 665 P.2d at 82; Gillies, 662 P.2d at 1019-20, or only on a finding of heinousness and depravity, see, e.g., State v. Fisher, 141 Ariz. 227, 252, 686 P.2d 750, 775 (1984); State v. Richmond, 136 Ariz. 312, 319, 666 P.2d 57, 64 (1983); Jeffers, 661 P.2d at 1130-31; Zaragoza, 659 P.2d at 28-29.\n\nThere is a significant difference between the way Arizona employs its disjunctive statute and the way Oklahoma was employing its disjunctive statute. The Arizona Supreme Court severs the terms used in (F)(6) and analyzes each one separately. See Wallace, 728 P.2d at 237; Gretzler, 659 P.2d at 10. All of the court's decisions clearly reveal whether the (F)(6) determination was based on \"cruelty\" or \"heinousness and depravity\", or both. Moreover, for \"cruelty\", the finding in this case, the essential factors for the finding are well defined. Therefore, the infirmities which defeated the Oklahoma statute in Maynard, on grounds of cruelty alone, are not present here.\n\nIn Adamson, the Arizona Supreme Court concluded that \"the murder was accomplished in an especially cruel manner and that the trial court properly found the aggravating circumstances under subsection (F)(6) of the statute.\" 665 P.2d at 988-89. The court did not discuss heinousness or depravity and reiterated the trial court's findings as follows:\n\nThe victim clearly suffered in the instant case. Witnesses who were inside buildings hundreds of feet from the explosion testified that they heard Bolles screaming for help. Bolles had particles from the bomb imbedded in his body. One leg was shattered from the upper hip to his ankle and had the appearance of hamburger. The other leg and one arm were also severely mutilated. The force of the explosion sent a piece of flesh the size of a softball across the parking lot. The means used to kill Bolles made it reasonably foreseeable to Adamson that if Bolles did not die instantaneously there was a substantial likelihood that he would suffer a great deal from his injuries.\n\nAdamson, 665 P.2d at 988. This excerpt plainly follows the channels set up in Gretzler (victim's suffering) and earlier in the same Adamson opinion (intent/foreseeability). No error exists in the court's factual findings on the existence of suffering or foreseeability, considering the presumption of correctness to which such findings are entitled. 28 U.S.C. § 2254(d). Therefore, (F)(6) was not applied in this case in an unconstitutional manner. The Arizona Supreme Court properly limited the construction of (F)(6) and that limiting construction was properly applied to Adamson and his crime.\n\nThe majority calls the Arizona Supreme Court's review of Judge Birdsall's special verdict \"post hoc appellate rationalizations.\" Slip op. At 56. The majority cites Caldwell v. Mississippi, 472 U.S. 320, 86 L. Ed. 2d 231, 105 S. Ct. 2633 (1984) and Presnell v. Georgia, 439 U.S. 14, 58 L. Ed. 2d 207, 99 S. Ct. 235 (1978) to support this contention. However, here there is no impermissible shifting of responsibility from the sentencing authority to the appellate court, as there was in Caldwell. In Caldwell, the prosecutor told the jury that because their decision to apply the death penalty was reviewed automatically by the state supreme court, their decision was not final. Id. at 325-26. The U.S. Supreme Court held that the prosecutor cannot use the element of judicial review as an influence on the jury to minimize their role in sentencing. Id. at 341. Here, Judge Birdsall made the findings of fact and final sentence with no element of prosecutorial misconduct or improper influence which sought to give his sentencing authority a \"view of [his] role in the capital sentencing procedure that was fundamentally incompatible with the Eighth Amendment's heightened 'need for reliability in the determination that death is the appropriate punishment in a specific case.'\" Id. at 340 (quoting Woodson v. North Carolina, 428 U.S. at 305).\n\nThe issue in Presnell is inapposite as it concerned the fact that the sentencing authority had not found the underlying \"capital offense\" which triggered the death penalty. Id. at 15. Further, the Arizona Supreme Court was not reaching for an aggravating circumstance that had not been presented and proved beyond a reasonable doubt to the judge. See Cole v. Arkansas, 333 U.S. 196, 201-202, 92 L. Ed. 644, 68 S. Ct. 514 (1948). The Arizona Supreme Court, as required by Arizona law, undertook \"an independent review of the facts that establish the presence or absence of aggravating and mitigating circumstances.\" State v. Richmond, 114 Ariz. 186, 196, 560 P.2d 41, 51 (1976); 17 A.R.S. Rule of Criminal Procedure 31.2(b) and A.R.S. § 13-4031 (formerly A.R.S. § 13-1711) (providing for automatic appeal of a death sentence to the state supreme court).\n\nThe gravity of the death penalty requires that we painstakingly examine the record to determine whether it has been erroneously imposed.\n\nRichmond, 560 P.2d at 51. This process, while not required, has been encouraged by the U.S. Supreme Court as a \"check against the random or arbitrary imposition of the death penalty,\" Gregg v. Georgia, 428 U.S. at 206; Pulley v. Harris, 465 U.S. 37, 45, 79 L. Ed. 2d 29, 104 S. Ct. 871 (1984) (holding appellate proportionality review is encouraged but not required by the Constitution) and safeguards the \"reliability of the sentencing process\" to prevent arbitrary and capricious sentencing. California v. Brown, 479 U.S. 538, 107 S. Ct. 837, 840, 93 L. Ed. 2d 934 (1987). The Arizona Supreme Court properly found that the evidence supported the finding of the F(6) aggravating circumstance of \"cruelty\" based upon the trial judge's findings and upon an independent review of the evidence.\n\nV.\n\nPRESUMPTION OF DEATH\n\nI understand the majority's reticence in imposing the death penalty. \"It can never be less than the most painful of our duties to pass on capital cases . . . . However, there comes a time in every case when a court must 'bite the bullet'.\" Eddings v. Oklahoma, 455 U.S. 104, 127, 71 L. Ed. 2d 1, 102 S. Ct. 869 (1982) (Burger, J., dissenting). It is our job here \"to say what the law is.\" Marbury v. Madison, 5 U.S. (1 Cranch) 137, 177-78, 2 L. Ed. 60 (1803). The Arizona legislature has promulgated its sentencing statute through its legislative process and we must apply it as the law unless it is unconstitutional. The majority holds that the Arizona sentencing statute (Arizona Revised Statutes [A.R.S.] § 13-703) (see Maj op. 1015, n. 2 for full text of statute) is unconstitutional, claiming that it precludes presentation of all mitigating evidence and creates a presumption of death. I disagree. The sentencing scheme here is constitutional on its face and as applied. First, Arizona allows consideration of all mitigating evidence and the trial court here allowed such consideration. Second, Arizona constitutionally allows the trial judge to ascribe weight to the mitigating evidence. Third, the word \"shall\" in the statute does not create a presumption of death or a mandatory sentencing scheme.\n\n1. Arizona allows consideration of all mitigating evidence.\n\nThe Arizona statute provides for the presentation of all mitigating evidence with the burden of production on the defendant. \"Any information relevant to any mitigating circumstances included in subsection G of this section may be presented regardless of its admissibility under the rules governing admission of evidence at criminal trials. . . . The burden of establishing the existence of any of the circumstances included in subsection G of this section is on the defendant.\" A.R.S. § 13-703(C).\n\nFirst, the statute provides for the presentation of \"any information relevant to any mitigating circumstances . . .\" This satisfies the mandate in Lockett v. Ohio, 438 U.S. 586 (1978) and its progeny: \"The Eighth and Fourteenth Amendments require that the sentencer . . . not be precluded from considering, as a mitigating factor, any aspect of a defendant's character or record and any of the circumstances of the offense that the defendant proffers as a basis for a sentence less than death.\" Eddings, 455 U.S. at 110, citing Lockett v. Ohio, 438 U.S. 586, 604 (1978) (emphasis in original). Subsection G of the statute provides just that:\n\nMitigating circumstances shall be any factors proffered by the defendant or the state which are relevant in determining whether to impose a sentence less than death, including any aspect of the defendant's character, propensities or record and any of the circumstances of the offense including but not limited to the following . . . .\n\nA.R.S. § 13-703(G) (emphasis added). Thus, the statute on its face complies with the Constitution.\n\nSecond, the trial court in this case considered all relevant mitigating factors:\n\nThe Court makes the following findings as . . . to the existence of any of the mitigating circumstances included in Subsection G thereof.\n\nIn this regard the Court has considered not only the five specific mitigating circumstances enumerated in the statute, but also any factors proffered by the defendant or the state which are relevant in determining whether to impose a sentence of death, including all aspects of the defendant's character, propensities, or record, and all of the circumstances of the offense so far as these have been made known to the Court. In making these findings the Court has disclosed to defendant's counsel all material contained in the presentence report and supplement thereto.\n\nThe Court has further considered any information relevant to any mitigating circumstances regardless of its admissibility under the rules governing admission of evidence in a criminal trial . . . .\n\nMitigating circumstances, Subsection G. The Court finds that none of the mitigating circumstances specifically set forth in Subsection G exist.\n\nThe Court further finds that there are no other mitigating circumstances sufficiently substantial to call for leniency.\n\nIn this regard the Court has considered the fact that the defendant has cooperated with the United States Government and with the State of Arizona in criminal cases and in criminal investigations, that at least some of the cases and investigations involve serious criminal activity, that some of these matters are still pending and that the defendant states that he is willing to continue this cooperation.\n\nThe Court has further considered the argument that if the defendant is given a life sentence through his cooperation it may be possible to convict others who are also responsible for the death of the victim.\n\nThe Court has also considered in mitigation the legal proceedings in this case since its inception to the time of this sentencing.\n\nTranscript of the Sentencing Hearing, November 14, 1980, Special Verdict, Hon. Ben C. Birdsall, excerpts of pages 94-98 (emphasis added). Thus, the statute was applied in this case in accordance with the Constitution. The statute as interpreted by the Arizona courts also provides for full consideration of any mitigating circumstances, State v. Poland, 144 Ariz. 388, 406, 698 P.2d 183, 201 (1985) aff'd, 476 U.S. 147, 90 L. Ed. 2d 123, 106 S. Ct. 1749 (1986) (court considered all proffered mitigating factors including those not listed in the Arizona statute), therefore it is constitutional. Jurek v. Texas, 428 U.S. 262, 272-76, 49 L. Ed. 2d 929, 96 S. Ct. 2950 (1976) (Supreme Court found statutory scheme constitutional as construed by the Texas courts); McKenzie v. Risley, 842 F.2d 1525, 1542 (9th Cir. 1988) (Montana statute as applied is constitutional).\n\nThe trial court here did not restrict or exclude any mitigating evidence as did the trial court in Eddings, 455 U.S. at 113. Nor did the trial court simply pronounce death once the aggravating circumstances were found as in the mandatory schemes. Sumner v. Shuman, 483 U.S. 66, 107 S. Ct. 2716, 97 L. Ed. 2d 56 (1987) (court struck down Nevada law mandating death sentence for inmates who kill while serving a life sentence). The Arizona statute has no preclusion on its face and the statute as applied by the trial court here allowed in all mitigating facts. Thus the trial court followed the mandate of Eddings and Lockett.\n\n2. Arizona constitutionally allows the trial judge to ascribe weight to the mitigating evidence.\n\nThe majority finds unconstitutional the fact that Arizona requires the defendant to prove the existence of mitigating factors by a preponderance of the evidence because it \"precludes the sentencer from weighing all relevant mitigating evidence.\" Maj. op. at 1039. Again I disagree. The 1976 Cases require states to rationally distinguish between those individuals for whom the death penalty is appropriate from those for whom it is not and in so doing the sentencer must consider the individual circumstance of the defendant, his background and his crime. Proffitt, 428 U.S. at 252-53; Gregg, 428 U.S. at 193-95. Part of this individual consideration includes allowing the defendant to present, during the sentencing hearing, all circumstances mitigating the imposition of the death penalty, Lockett v. Ohio, 438 U.S. 586, 604, 57 L. Ed. 2d 973, 98 S. Ct. 2954 (1978), and requires the sentencer to listen to this mitigating evidence. Eddings v. Oklahoma, 455 U.S. 104, 115, n. 10.\n\nBut this rule requiring the sentencer to allow in and to listen to all mitigating evidence, does not require that the sentencer give a particular weight to the evidence or that the sentencer consider irrelevant evidence. Lockett and Eddings allow the sentencer and the reviewing court to \"determine the weight to be given relevant mitigating evidence. But they may not give it no weight by excluding such evidence from their consideration.\" Eddings, 455 U.S. at 114-15. \"Nothing in this opinion limits the traditional authority of a court to exclude, as irrelevant, evidence not bearing on defendant's character, prior record, or the circumstances of his offense.\" Lockett, 438 U.S. at 604, n. 12. In Eddings the Court remanded to the trial court and said:\n\nEddings was a youth of 16 years at the time of the murder. Evidence of a difficult family history and of emotional disturbance is typically introduced by defendants in mitigation [citations omitted]. In some cases, such evidence properly may be given little weight. But when the defendant was 16 years old at the time of the offense there can be no doubt that evidence of a turbulent family history, of beatings by a harsh father, and of severe emotional disturbance is particularly relevant.\n\nEddings, 455 U.S. at 115 (emphasis added). The Supreme Court reiterated: \"On remand, the state courts must consider all relevant mitigating evidence and weight it against the evidence of the aggravating circumstances. We do not weigh the evidence for them.\" Id. at 117 (emphasis added).\n\nIn Turner v. Murray, 476 U.S. 28, 90 L. Ed. 2d 27, 106 S. Ct. 1683 (1986), cited by the majority, the Supreme Court analyzed the Virginia death penalty statute noting that the statute gives the jury greater discretion than other systems such as the Texas system upheld in Jurek, 428 U.S. 262, 49 L. Ed. 2d 929, 96 S. Ct. 2950 (1976). The Court, citing Eddings, stated that the sentencer must be \"free to weigh the relevant mitigating factors\" and that in the end \"it is the jury that must make the difficult, individualized judgment.\" Id. at 34. The majority contends that the Arizona statute does not allow the sentencer here to be \"free to weigh the relevant mitigating factors.\" Maj. op. at 1040, citing Turner, 476 U.S. at 34.\n\nThe majority's objection concerns the method with which Arizona has chosen to weigh the mitigating evidence. Their contention is that this method precludes the consideration required by the Constitution. The Supreme Court has been unwilling to say that there \"is any right way for a state to set up its capital sentencing scheme\", Spaziano, 468 U.S. at 464, so long as it is constitutional. The manner in which Arizona has set up its sentencing scheme meets all the constitutional requirements of the 1976 Cases.\n\nBefore someone is subject to the Arizona death penalty, the state must charge and prove a defendant guilty of first degree murder beyond a reasonable doubt. State v. Richmond, 136 Ariz. 312, 322, 666 P.2d 57, 67 (1983). Then the state must prove one of the statutory aggravating circumstances beyond a reasonable doubt. State v. Jordan, 126 Ariz. 283, 614 P.2d 825 (1980), cert. denied, 449 U.S. 986, 66 L. Ed. 2d 251, 101 S. Ct. 408 (1980). This meets the first objective of the 1976 Cases, that is, to distinguish between those individuals for whom the death penalty is appropriate from those for whom it is not. Gregg, 428 U.S. at 193-95. If the state cannot show aggravating circumstances beyond a reasonable doubt, the trial court must impose a life sentence and cannot impose a death sentence. A.R.S. § 13-703(E). However, if the state does show at least one aggravating circumstance beyond a reasonable doubt, the burden is then upon the defendant to show mitigating circumstances. A.R.S. § 13-703(E); Richmond, 666 P.2d at 61.\n\nThe Arizona statute provides that \"the burden of establishing the existence of the circumstances included in subsection G (mitigating facts) of this section is on the defendant.\" A.R.S. § 13-703(C). And, that the trial judge shall impose the death penalty if \"there are no mitigating circumstances sufficiently substantial to call for leniency.\" A.R.S. § 13-703(E). This has been interpreted by the Arizona Supreme Court to mean:\n\nOnly after concluding that a defendant has proved by a preponderance of the evidence certain mitigating circumstances must a trial judge determine whether the proven mitigating circumstances warrant leniency. If the trial judge concludes that proven mitigating circumstances warrant leniency, then he must impose a life sentence. If, however, the trial judge concludes that the proven mitigating circumstances do not warrant leniency . . . then he must impose a death sentence.\n\nState v. Rossi (II), 154 Ariz. 245, 246, 741 P.2d 1223, 1224-25 n. 1 (1987). See also State v. Poland, 144 Ariz. 388, 406, 698 P.2d 183, 201 (1985), aff'd, 476 U.S. 147, 90 L. Ed. 2d 123, 106 S. Ct. 1749 (1986):\n\nDefendants have the burden of proving mitigating factors by a preponderance of the evidence. . . . The sentencing court and this Court on appeal may take cognizance of evidence tending to refute a mitigating circumstance.\n\nThe fact that the defendant has the burden of production for the mitigating factors is not unconstitutional. Eddings, 455 U.S. at 110 (\"that the defendant proffers\"). The Supreme Court has expressed that the choice of what to present during sentencing, or the choice of presenting nothing at all, should be in the hands of the defendant as part of the strategy of the trial. Burger v. Kemp, 483 U.S. 776, 107 S. Ct. 3114, 3122-26, 97 L. Ed. 2d 638, reh'g denied, 483 U.S. 1056, 108 S. Ct. 32, 97 L. Ed. 2d 820 (1987) (defendant offered no evidence during mitigation/aggravation hearing); Campbell v. Kincheloe, 829 F.2d 1453, 1463 (9th Cir. 1987), cert. denied, 488 U.S. 948, 57 U.S.L.W. 3333, 102 L. Ed. 2d 369, 109 S. Ct. 380 (1988). In this case, Adamson proffered his cooperation with law enforcement authorities, his offer of further cooperation, and the length, subject and duration of the legal proceedings of the case since its beginning. Transcript of the Sentencing Proceeding at 98.\n\nThe majority objects to the fact that some weight is ascribed to the evidence before it is considered \"mitigating.\" Arizona's method of ascribing a weight in this manner is no different than the weighing described in Eddings :\n\nThe burden of proof to establish mitigating circumstances is not met by the lack of proof, as the appellant contends, but by the production of some form of affirmative evidence from which it could be inferred that the defendant's participation was relatively minor or that he could not have reasonably foreseen the risk of death to another person. [citations omitted] Appellant seems to contend that the prosecution should be required to prove beyond a reasonable doubt the non-existence of mitigating circumstances. We adhere to our decision in State v. Watson, where we rejected that contention.\n\nState v. Greenawalt, 128 Ariz. 150, 173, 624 P.2d 828, 851, cert. denied, 454 U.S. 882, 70 L. Ed. 2d 191, 102 S. Ct. 364 (1981) (emphasis added). This \"some form of affirmative evidence\" has since been interpreted by the Arizona Supreme Court, in making their independent review of the imposition of the death penalty, as whether a defendant has established a mitigating circumstance by a preponderance of the evidence, and has since applied this rule to the trial court. State v. McMurtrey, 143 Ariz. 71, 72, 691 P.2d 1099, 1100 (1984), cert. denied, 480 U.S. 911, 107 S. Ct. 1359, 94 L. Ed. 2d 530 (1984); State v. Rossi (II), 154 Ariz. 245, 246-47, 741 P.2d 1223, 1224-25 (1987). The Court describes the process as:\n\nThe trial court acts first as the fact finder. It must consider whether the state has proven any of the aggravating factors enumerated in [A.R.S. 13-703(F)] beyond a reasonable doubt . . . It must also determine whether the defendant has shown mitigating circumstances by a preponderance of the evidence [citing McMurtrey, 143 Ariz. at 73, 691 P.2d at 1101]. Mitigating circumstances are defined as \"any factors . . . relevant in determining whether to impose a sentence less than death.\" A.R.S. 13-703(G). After the trial court has made these findings of fact, it then engages in a balancing test in which it determines whether the mitigating factors are sufficiently substantial to call for leniency. [A.R.S. 13-703(C)].\n\nState v. Leslie, 147 Ariz. 38, 49, 708 P.2d 719, 730 (1985).\n\nWhen an Arizona trial court makes findings of fact it is considering all of the defendant's mitigating circumstances. If a fact is not mitigating, then it is irrelevant and may be disregarded. Lockett, 438 U.S. at 605, n. 12. If a mitigating factor has no weight at all, weighing it against aggravating circumstances would be futile. The Eleventh Circuit has spoken extensively on this point:\n\nLockett instructs that the sentencing body be free to consider the impact of the defendant's background in making its decision. To say, however, as [defendant] maintains, that Lockett imposes a duty on the sentencer to regard such evidence as mitigating is quite another matter. . . . There is no requirement that the court agree with the defendant's view that it is mitigating, only that the proffer be given consideration.\n\nRaulerson v. Wainwright, 732 F.2d 803, 807 (11th Cir. 1984) (emphasis in original); See also Johnson v. Wainwright, 806 F.2d 1479, 1484, reh'g denied, 810 F.2d 208 (11th Cir. 1986) (although the sentencer may not be precluded from considering mitigating factors, \"it is of no constitutional moment\" that the sentencing judge evaluated the factor as having little or no mitigating value); Hall v. Wainwright, 733 F.2d 766, 775 (11th Cir. 1984), cert. denied, 471 U.S. 1107, 85 L. Ed. 2d 858, 105 S. Ct. 2344 (1985) (sentencer may determine the weight to be given evidence of relevant mitigating circumstances).\n\nThe majority cites Cool v. United States, 409 U.S. 100, 104, 34 L. Ed. 2d 335, 93 S. Ct. 354 (1972) for the proposition that \"there is an 'essential difference' between guiding the care with which the sentencer determines how much weight to accord evidence, and requiring that as a predicate to consideration of that evidence, it must be found true beyond a reasonable doubt, or by some other evidentiary standard.\" Maj. op. at 1039. But the issue in Cool concerned an accomplice instruction requiring the jury to find exculpatory evidence, proffered by defendant about an accomplice, true beyond a reasonable doubt. Cool, 409 U.S. at 102-103. This instruction was found improper because it allowed the jury to convict despite its failure to find guilt beyond a reasonable doubt. Id. at 103. But this is not a pronouncement on the kind of weight evidence must have at sentencing, or the evidentiary standard to be applied to mitigating circumstances in a death sentence statute.\n\nThe process of determining if defendant has met this preponderance standard is exactly the kind of individualized consideration required by the Constitution. It does not preclude the sentencer from considering or weighing mitigation evidence as the majority suggests. For example, in State v. Jordan, 614 P.2d at 832, the fact that the defendant was somewhat intoxicated did not automatically make that fact a mitigating circumstance, although it was fully considered by the trial court. Whether the intoxication was a mitigating circumstance depended on whether \"his capacity to appreciate the wrongfulness of his conduct or to conform his conduct to the requirements of law was significantly impaired, but not so impaired as to constitute a defense to prosecution.\" Id. The Court said:\n\nWillifred's testimony falls short of proving the necessary degree of impairment from intoxication. Not only is her testimony inexact as to defendant's level of intoxication at the time of the crime, it is also devoid of any description of how defendant's intoxication affected his conduct, other than that he was \"mumbling.\" Defendant did not mention the influence of drugs or alcohol in his confession, nor did he testify at his sentencing hearing. We agree with the trial court that defendant has failed to prove that his intoxication was a mitigating circumstance.\"\n\nId. at 832. In State v. Gillies, 142 Ariz. 564, 691 P.2d 655 (1984), defendant claimed five mitigating circumstances: age, changed attitudes, intoxication, felony murder instructions and life sentence for his co-defendant. Id., 691 P.2d at 662. The trial court had considered all circumstances yet found that they were insufficient to call for leniency. The Arizona Supreme Court discussed each factor in their independent review of the evidence. Even though defendant was 20 years old, the court found the impact of \"youth\" was minimized by the extent and duration of the murder (the torture of the victim from beginning until death was eight hours). Next, the defendant claimed intoxication. The Court found that because the victim was held captive for 8 hours, the defendant was not intoxicated throughout that length of time so as to prevent him from appreciating the wrongfulness of his behavior. The Court found defendant's changed attitude a mitigating factor because defendant became religious and remorseful, but that the felony murder instruction was not a mitigating factor because there was no doubt here about defendant's intent to kill. The Court also found that the fact the co-defendant plea bargained for a life sentence was not a mitigating factor. Id.\n\nIn State v. Rossi (II), 154 Ariz. 245, 741 P.2d 1223 (1987), the defendant offered two mitigating circumstances and the trial court ruled that defendant did not prove by the preponderance of the evidence: 1) that defendant could be rehabilitated; and 2) that defendant's capacity to appreciate the wrongfulness of his conduct or to conform his conduct to the requirements of the law was significantly impaired due to cocaine abuse. Id., 741 P.2d at 1226. The trial court had found that in spite of testimony of three expert witnesses that indicated defendant could be rehabilitated that defendant had not proved this by a preponderance. The trial court considered that defendant planned the robbery, used unusually destructive (Hydrashok) bullets, bragged to his friends about the incident, gave away spent bullets as souvenirs and shot the victim's neighbor because she was a witness. Id., 741 P.2d at 1226-27. The Arizona Supreme Court arrived at a different conclusion and found these factors mitigating. They held in their independent review that the trial courts reasons \"have no bearing\" on rehabilitation so could not be used to refute defendant's evidence. Id., 741 P.2d at 1227. The Arizona Supreme Court did not find defendant proved by a preponderance that his cocaine addiction significantly impaired his capacity to appreciate the wrongfulness of his conduct. Id., 741 P.2d at 1229.\n\nCritical to our conclusion are the 'cover up' acts that appellant committed on the day of the crimes and appellant's ability to recall vivid details of the crimes themselves. We do believe, however, that appellant proved by the preponderance of the evidence that his cocaine addiction significantly impaired his capacity to conform his conduct to the requirements of the law. We find very persuasive Dr. Nash's unrefuted testimony on chemical dependency in general and how addiction fosters an insatiable and life-controlling craving for additional drugs that overwhelms the user's ability to control his physical behavior.\n\nId.\n\nThese cases show that the Arizona preponderance standard allows the trial court to listen and consider all factors offered as mitigation by the defendant, and weigh and balance the mitigating circumstances against the aggravating circumstances. This procedure characterized as a \"proof stage\" and objected to by the majority, does not preclude evidence but sifts the evidence, distinguishing between those facts which are mitigating from those which are not. Logically those factors found not to be mitigating by a preponderance, would have no weight at all as mitigating factors in the weighing process and so would not help defendant -- but they have been considered by the sentencer.\n\nWhere both aggravating and mitigating circumstances are found in a given case, the trial judge, and then the Arizona Supreme Court on review, must determine whether the mitigating circumstances are \"sufficiently substantial to call for leniency.\" A.R.S. § 13-703(E). If the Court finds one or more aggravating circumstance as listed in A.R.S. § 13-703(F) proven beyond a reasonable doubt then it \"shall impose a sentence of death\" unless there are mitigating circumstances that are \"sufficiently substantial to call for leniency.\" A.R.S. § 13-703(E). The number of aggravating and mitigating circumstances is not dispositive, but rather their gravity. \"One mitigating circumstance, for example, may be 'sufficiently substantial' to outweigh two aggravating circumstances.\" State v. Gretzler, 135 Ariz. 42, 54, 659 P.2d 1, 13 (1983), cert. denied, 461 U.S. 971, 103 S. Ct. 2444, 77 L. Ed. 2d 1327 (1983). Some examples where the mitigating circumstances were found to outweigh the aggravating factors are listed in State v. Gretzler, 659 P.2d at 14:\n\nFor example in State v. Brookover, supra, defendant's impaired capacity to appreciate the wrongfulness of his conduct, caused by a medical condition (a brain lesion of a type frequently producing anti-social behavior), outweighed a prior conviction of a drug offense. 124 Ariz. at 41-42, 601 P.2d at 1325-26. The extreme youth of an offender can also be a compelling mitigating circumstance, as demonstrated recently in State v. Valencia, 132 Ariz. 248, 645 P.2d 239 (1982). There, the defendant's prior convictions arising from a previous violent incident were outweighed by the fact that defendant was only sixteen years old at the time of each crime. . . . In some cases the combined weight of a number of mitigating factors outweighs the aggravation. For example, in State v. Watson, 129 Ariz. 60, 63-64, 628 P.2d 943, 946-47 (1981), the facts that the murder occurred as the result of an unexpected shootout with the robbery victim in which the victim fired first, that defendant was twenty one years old at the time of the crime, and that there was evidence defendant had done a great deal of genuine soul searching after the crime, had been a model prisoner while going through the appellate process, had set new goals for himself, and attempted to further his education in prison, outweighed his prior conviction for robbery.\n\nGretzler also discusses other cases where the aggravating circumstances outweigh the mitigating:\n\nFor instance in State v. Knapp, supra, defendant's lack of prior criminal record did not outweigh the extreme cruelty of burning his two children to death. 114 Ariz. at 543, 562 P.2d at 716, resentence aff'd 125 Ariz. 503, 504-05, 611 P.2d 90, 91-92 (1979). Similarly in State v. Ortiz, supra, defendant's lack of prior criminal record did not excuse his heinous and depraved murder, involving a grave risk of death to others, in which he stabbed a woman to death and then made senseless, indiscriminate attempts to stab and burn to death her three young children. 131 Ariz. at 211, 639 P.2d at 1036. In State v. Bishop, supra, defendant's lack of prior criminal record and below average intelligence were not sufficiently substantial to outweigh the heinous and depraved killing which defendant obviously relished. 127 Ariz. at 534-35, 622 P.2d at 481-82. In like manner, in State v. Clark, supra, defendant's age (20 years old), poor home life as a child, lack of adult criminal record, and emotional problems were found insufficiently substantial to outweigh his senseless, depraved killing of four persons with total disregard of human life, and with undoubted relish, keeping a souvenir of the occasion. 126 Ariz. at 437, 616 P.2d at 897.\n\nState v. Gretzler, 135 Ariz. at 55, 659 P.2d at 14.\n\nThe trial court in the instant case followed the letter of the law. It has been previously shown that he considered all the mitigating factors. (See Section V(1), supra). The trial court listened to and assigned weight to the evidence. He concluded that Adamson had not shown the mitigating evidence to be \"sufficiently substantial to call for leniency,\" all that he was required to do under Arizona law. Transcript of the Sentencing Hearing at 98. The Court went farther than this and found that the aggravating circumstances existed beyond a reasonable doubt and that the mitigating circumstances did not exist beyond a reasonable doubt reaching further than required by Arizona law to consider the existence of mitigating circumstances. Id. This procedure complies with the 1976 Cases and with Lockett. The trial court under the Arizona sentencing scheme gave all mitigating evidence presented careful, constitutional consideration.\n\n3. The Arizona sentencing statute does not create a presumption of death or a mandatory sentencing scheme.\n\nThe statute provides that once the aggravating factors have been proved beyond a reasonable doubt and once the defendant has presented the mitigating facts, the trial judge\n\nshall impose a sentence of death if the court finds one or more of the aggravating circumstances enumerated in subsection F of this section and that there are no mitigating circumstances sufficiently substantial to call for leniency.\n\nA.R.S. § 13-703(E) (emphasis added). The trial court in this case followed the statute. The court found two aggravating circumstances, that the defendant committed the offense as consideration for pecuniary gain and that he committed the offense in an especially cruel manner. Transcript of the Sentencing Proceeding, at 93-97. The Arizona Supreme Court found that the murder was accomplished in an especially cruel manner and that the trial court properly found the aggravating circumstance under subsection (F)(6) of the statute. Adamson v. State, 665 P.2d at 988-89. The trial court found there were no mitigating circumstances sufficiently substantial to call for leniency. Transcript of the Sentencing Proceeding at 97. Although the majority tries to distinguish Campbell v. Kincheloe, 829 F.2d 1453 (9th Cir. 1987), cert. denied, 488 U.S. 948, 57 U.S.L.W. 3333, 102 L. Ed. 2d 369, 109 S. Ct. 380 (1988), there is a similarity to this case. Defendant there argued that the statute created a mandatory presumption in favor of the death penalty and placed the burden on the defendant to prove there are sufficient mitigating circumstances to merit leniency. Id. at 1465. Under Washington law, after the jury finds the statutory aggravating circumstance beyond a reasonable doubt, they then are required to deliberate on the following question: \"Having in mind the crime of which the defendant has been found guilty, are you convinced beyond a reasonable doubt that there are not sufficient mitigating circumstances to merit leniency?\" Id. at 1465-66. As the instruction indicates, the state's burden of proof carries with it a presumption of leniency, a presumption which the state can overcome only by showing beyond a reasonable doubt that there are not sufficient mitigating circumstances to merit leniency. The trial judge in the instant case found that the mitigating circumstances did not exist \"beyond a reasonable doubt.\" Transcript of the Sentencing Proceeding at 98.\n\nThe majority reasons that because defendant has the burden of persuasion in presentation of mitigating evidence and because the statute contains the word \"shall\", that the sentencing scheme is a mandatory one, carrying with it a presumption of death. I have already discussed why the defendant's burden of persuasion is not unconstitutional (see V(2) above), and I shall show below that the Arizona scheme carries a \"presumption of life\" and in no way resembles an unconstitutional mandatory sentencing scheme.\n\nAfter the Supreme Court's pronouncement in Furman v. Georgia, 408 U.S. 238, 33 L. Ed. 2d 346, 92 S. Ct. 2726 (1972), where the Supreme Court declared the death penalty \"in these cases constitute cruel and unusual punishment,\" state legislatures changed their sentencing laws. Id. at 240. In 1976, the Supreme Court reviewed five death penalty cases under these new sentencing schemes. In the three cases upholding the \"guided-discretion\" statutes, the opinions emphasized that those schemes permitted the sentencing authority to consider relevant mitigating circumstances pertaining to the offense and a range of factors about the individual defendant. Gregg v. Georgia, 428 U.S. 153, 197, 49 L. Ed. 2d 859, 96 S. Ct. 2909 (1976); Proffitt v. Florida, 428 U.S. 242, 251-52, 49 L. Ed. 2d 913, 96 S. Ct. 2960 (1976); Jurek v. Texas, 428 U.S. at 270-71. The Court declared two mandatory sentencing schemes unconstitutional. The opinions stressed they were fatally flawed by their failure to permit presentation of mitigating circumstances for the consideration of the sentencing authority. Woodson v. North Carolina, 428 U.S. 280, 303-305, 49 L. Ed. 2d 944, 96 S. Ct. 2978; Roberts (Stanislaus) v. Louisiana, 428 U.S. 325, 333-34, 49 L. Ed. 2d 974, 96 S. Ct. 3001 (1976). Thus, the constitutional mandate is that in capital cases \"it is constitutionally required that the sentencing authority have information sufficient to enable it to consider the character and individual circumstances of a defendant prior to imposition of a death sentence.\" Sumner, 107 S. Ct. at 2720; Gregg, 428 U.S. at 189 n. 38. So long as the sentencing scheme makes these provisions it is constitutional.\n\nThe word \"shall\" as it appears in the Texas and Montana sentencing schemes has been declared constitutional. In Texas, the capital sentencing procedure requires the jury to answer three questions at the sentencing stage:\n\n(1) whether the conduct of the defendant that caused the death of the deceased was committed deliberately and with the reasonable expectation that the death of the deceased or another would result;\n\n(2) whether there is a probability that the defendant would commit criminal acts of violence that would constitute a continuing threat to society; and\n\n(3) if raised by the evidence, whether the conduct of the defendant in killing the deceased was unreasonable in response to the provocation, if any, by the deceased.\n\nJurek, 428 U.S. at 269. If the jury finds that the state has proved beyond a reasonable doubt that each answer to each question is yes, then the death sentence is imposed. Id. The Supreme Court held this system to be constitutional because it provides for presentation of individualized mitigating evidence. Id. at 276.\n\nIn Montana, upon conviction of a capital offense the \"court shall impose [a] sentence of death . . . unless there are mitigating circumstances.\" McKenzie v. Risley, 842 F.2d 1525, 1541 (9th Cir. 1988) (emphasis added). In that case, defendant complained that the procedures for consideration of mitigating factors were unconstitutional. Id. We concluded that the statute as applied by the Montana courts was constitutional. Id. at 1542.\n\nThe Montana, Texas and Arizona statutes require the kind of individualized sentencing mandated by the Constitution in spite of their \"mandatory language\". The statutes begin with a \"presumption of life,\" that is, the prosecutor must prove beyond a reasonable doubt that one of the statutory aggravating factors which make the defendant death-eligible exist. If the prosecution carries that burden, then the defendant may present mitigating evidence on his behalf to tilt the balance back in his favor. The sentencing authority, makes the final balancing determination. This scheme in no way resembles the typical mandatory sentencing procedure, which looks only to the aggravating circumstances. Sumner, 107 S. Ct. at 2720. Nor does the word \"shall\" create any presumption of death -- it is the prosecutor who must prove the defendant is death eligible.\n\nThis particular issue has been raised numerous times by defendants on automatic appeal to the Arizona Supreme Court. That court's explanation of the statute is\n\nThe statute takes the human element out of the imposition of the death penalty and in doing so supports the constitutionality of the statute. Under the statute, a defendant will stand the same chance of receiving the death penalty from a judge who does not philosophically believe in the death penalty as from a judge who does. By taking the human factor out of the sentencing process the death penalty is then reserved for those who are above the norm of first-degree murderers or whose crimes are above the norm of first-degree murders, as the legislature intended. State v. Blazak, 131 Ariz. 598, 604, 643 P.2d 694, 700, cert. denied, Blazak v. Arizona, 459 U.S. 882, 74 L. Ed. 2d 149, 103 S. Ct. 184 (1982); State v. Zaragoza, 135 Ariz. 63, 69, 659 P.2d 22, 28, cert. denied, Zaragoza v. Arizona, 462 U.S. 1124, 77 L. Ed. 2d 1356, 103 S. Ct. 3097 (1983); State v. Beaty, 158 Ariz. 232, 762 P.2d 519, (1988); State v. Fulminante, No. CR-86-0053-AP, June 16, 1988.\n\nFinally, the majority cites Arizona v. Rumsey, 467 U.S. 203, 81 L. Ed. 2d 164, 104 S. Ct. 2305 (1984) for the proposition that the Arizona statute precludes individual sentencing and removes the sentencing judge's discretion. Maj. op. at 1042. However, Rumsey decided a double jeopardy issue and not the constitutionality of the statute as applied by the Arizona Courts. Rumsey at 205.\n\nThe sentencing statute allows consideration of all mitigating evidence and the trial court here allowed such consideration. It is constitutional to allow the trial judge to ascribe weight to the evidence and there is no presumption of death or similarity to a mandatory sentencing scheme.\n\nVI.\n\nConclusion\n\nI concur in the majority's holding that there is insufficient evidence of judicial vindictiveness and that any hearsay statements erroneously admitted were harmless. However, the majority's constitutional attack on the other five issues is unsound. I dissent from the majority decision to reverse and remand to the district court as Adamson's death sentence was not imposed as a result of prosecutorial vindictiveness, or in an arbitrary or capricious manner, or in violation of right to trial by jury. The Arizona death sentence statutory aggravating circumstances of \"heinous, cruel or depraved\" do not inadequately channel the judge's discretion, and the Arizona death sentence statute does not preclude meaningful consideration of all mitigating evidence or impose a presumption of death.\n\nI would affirm the district court's denial of Adamson's petition for writ of habeas corpus.\n\n\u003cspan class=\"fn\"\u003e1. Neither Dunlap or Robison have ever been retried in connection with Bolles' murder.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The statute reads in full, as follows: A. A person guilty of first degree murder as defined in § 13-1105, shall suffer death or imprisonment in the custody of the department of corrections for life, without possibility of release on any basis until the completion of the service of twenty-five calendar years if the victim was fifteen or more years of age and thirty-five years if the victim was under fifteen years of age, as determined and in accordance with the procedures provided in subsections B through G of this section. B. When a defendant is found guilty of or pleads guilty to first degree murder as defined in § 13-1105, the judge who presided at the trial or before whom the guilty plea was entered, or any other judge in the event of the death, resignation, incapacity or disqualification of the judge who presided at the trial or before whom the guilty plea was entered, shall conduct a separate sentencing hearing to determine the existence or nonexistence of the circumstances included in subsections F and G of this section, for the purpose of determining the sentence to be imposed. The hearing shall be conducted before the court alone. C. In the sentencing hearing the court shall disclose to the defendant or defendant's counsel all material contained in any presentence report, if one has been prepared, except such material as the court determines is required to be withheld for the protection of human life. Any presentence information withheld from the defendant shall not be considered in determining the existence or nonexistence of the circumstances included in subsection F or G of this section. Any information relevant to any mitigating circumstances included in subsection G of this section may be presented by either the prosecution or the defendant, regardless of its admissibility under the rules governing admission of evidence at criminal trials, but the admissibility of information relevant to any of the aggravating circumstances set forth in subsection F of this section shall be governed by the rules governing the admission of evidence at criminal trials. Evidence admitted at the trial, relating to such aggravating or mitigating circumstances, shall be considered without reintroducing it at the sentencing proceeding. The prosecution and the defendant shall be permitted to rebut any information received at the hearing and shall be given fair opportunity to present argument as to the adequacy of the information to establish the existence of any of the circumstances included in subsections F and G of this section. The burden of establishing the existence of any of the circumstances included in subsection F of this section is on the prosecution. The burden of establishing the existence of the circumstances set forth in subsection G of this section is on the defendant. D. The court shall return a special verdict setting forth its findings as to the existence or nonexistence of each of the circumstances set forth in subsection F of this section and as to the existence of any of the circumstances included in subsection G of this section. E. In determining whether to impose a sentence of death or life imprisonment without possibility of release on any basis until the defendant has served twenty-five calendar years if the victim was fifteen or more years of age or thirty-five calendar years if the victim was under fifteen years of age, the court shall take into account the aggravating and mitigating circumstances included in subsections F and G of this section and shall impose a sentence of death if the court finds one or more of the aggravating circumstances enumerated in subsection F of this section and that there are no mitigating circumstances sufficiently substantial to call for leniency. F. Aggravating circumstances to be considered shall be the following: 1. The defendant has been convicted of another offense in the United States for which under Arizona law a sentence of life imprisonment or death was imposable. 2. The defendant was previously convicted of a felony in the United States involving the use or threat of violence on another person. 3. In the commission of the offense the defendant knowingly created a grave risk of death to another person or persons in addition to the victim of the offense. 4. The defendant procured the commission of the offense by payment, or promise of payment, of anything of pecuniary value. 5. The defendant committed the offense as consideration for the receipt, or in expectation of the receipt, of anything of pecuniary value. 6. The defendant committed the offense in an especially heinous, cruel or depraved manner. 7. The defendant committed the offense while in the custody of the department of corrections, a law enforcement agency or county or city jail. 8. The defendant has been convicted of one or more other homicides, as defined in § 13-1101, which were committed during the commission of the offense. 9. The defendant was an adult at the time the offense was committed or was tried as an adult and the victim was under fifteen years of age. G. Mitigating circumstances shall be any factors proffered by the defendant or the state which are relevant in determining whether to impose a sentence less than death, including any aspect of the defendant's character, propensities or record and any of the circumstances of the offense, including but not limited to the following: 1. The defendant's capacity to appreciate the wrongfulness of his conduct or to conform his conduct to the requirements of law was significantly impaired, but not so impaired as to constitute a defense to prosecution. 2. The defendant was under unusual and substantial duress, although not such as to constitute a defense to prosecution. 3. The defendant was legally accountable for the conduct of another under the provisions of § 13-303, but his participation was relatively minor, although not so minor as to constitute a defense to prosecution. 4. The defendant could not reasonably have foreseen that his conduct in the course of the commission of the offense for which the defendant was convicted would cause, or would create a grave risk of causing, death to another person. 5. The defendant's age. A.R.S. § 13-703 (Supp. 1983-84).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. We do find, however, that the imposition of the death penalty by the sentencing judge was constitutionally impermissible. See infra, section III.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. We reject the State's argument that the Supreme Court's decision regarding double jeopardy in Ricketts v. Adamson, 483 U.S. 1, 107 S. Ct. 2680, 97 L. Ed. 2d 1 (1987), disposed of Adamson's vindictive prosecution claim. The issue was not discussed in the majority opinion, because it was never reached by the en banc majority in the previous decision. See Adamson v. Ricketts, 789 F.2d 722 (9th Cir. 1986) (en banc). Indeed, the only mention of vindictive prosecution in the Supreme Court's opinion was in the dissent. See Adamson, 107 S. Ct. at 2692 n. 13 (Brennan, J., dissenting) (noting the \"curious and as yet unexplained decision of the State to abandon prosecution of Dunlap and Robison in favor of Adamson\" relates to the issues of prosecutorial and judicial vindictiveness and thus \"should be decided by the Court of Appeals on remand\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The Supreme Court in Pearce recognized the extreme difficulty of showing the existence of an actual vindictive motive in an individual case. 395 U.S. at 726. The Court thus held that vindictiveness on the part of the sentencing judge can be presumed whenever a defendant is sentenced more harshly after retrial and no objective reasons for the increased sentence are given. Id. Later, in Blackledge, the Court extended the holding regarding presumed vindictiveness to situations involving a likelihood of prosecutorial retaliation. See 417 U.S. at 27-28.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The State argues that it made the decision to seek the death penalty against Adamson before he had asserted his Fifth Amendment right and refused to testify against Robison and Dunlap. The State, however, has not consistently asserted this position. Moreover, its actions contradict this stance, since the State continued to try to compel Adamson's testimony after it sent him the letter on April 9, 1980. It was only after the Arizona Supreme Court refused to review Judge Myers' denial of the motion to compel Adamson to testify -- when it had no further legal challenge to Adamson's constitutional right -- that the State filed the increased charges.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Moreover, the State explicitly rejected Adamson's offer -- made after the Arizona Supreme Court rejected his interpretation of the plea agreement's terms -- to testify against Robison and Dunlap under the original terms of the agreement. Instead, the State chose to still pursue the death penalty for Adamson while letting Robison and Dunlap go untried and unpunished. These facts only increase the likelihood of actual vindictiveness and add to the appearance of an improper motive surrounding the State's decision to try Adamson alone.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The State's assertion that there is no presumption here is incorrect. Moreover, its reliance on United States v. Goodwin, 457 U.S. 368, 73 L. Ed. 2d 74, 102 S. Ct. 2485 (1982), as support for that assertion is misplaced. While Goodwin did limit the application of vindictive prosecution claims in cases involving pretrial procedures or plea negotiations, the Court there did not hold that vindictive prosecution can never occur in a pretrial setting. The Court in fact recognized \"that a defendant in an appropriate case might prove objectively that the prosecutor's charging decision was motivated by a desire to punish him for something that the law plainly allowed him to do.\" Id. at 384 (footnote omitted); see also United States v. Banks, 682 F.2d 841 (9th Cir. 1982), cert. denied, 459 U.S. 1117, 74 L. Ed. 2d 972, 103 S. Ct. 755 (1983) (suggesting that, though the Court in Goodwin refused to apply the presumption of vindictiveness to the pretrial actions of the prosecutor in that case, it did not foreclose the possibility in other circumstances). This circuit has also stated, post-Goodwin, that the presumption can arise from pretrial prosecutorial conduct. See United States v. McWilliams, 730 F.2d 1218, 1221 (9th Cir. 1984) (filing of initial indictment can provide basis of vindictive prosecution claim); see also United States v. Heldt, 745 F.2d 1275 (9th Cir. 1984) (suggesting increased charges filed in response to motion to suppress could provide basis for vindictive prosecution claim).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. If the prosecution did not have the power to bring the charges, there would be no need to reach the question of its motives -- the act of bringing unauthorized charges would itself be prohibited.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The State offers no reason as to why Adamson would choose to risk facing the death penalty in order to give Robison and Dunlap the benefits of double jeopardy protection.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. As for the State's argument that the jury would perceive Adamson as a mercenary for making non-negotiable demands, we see no difference between these demands and Adamson's original agreement with the State whereby he used his promise to testify to bargain for his life.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Failure to testify is a risk inherent whenever testimony is derived from an immunized witness or pursuant to a plea agreement. There is never any guarantee that the witness will testify -- or that the witness will do so truthfully. The State had no such guarantee when it initially made the plea agreement with Adamson.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. That Adamson continued to testify in other cases, even after he was convicted by the jury of first-degree murder, is proof of his willingness to testify. Even the sentencing judge recognized Adamson's extensive cooperation in the past, and his intention to continue to do so in the future.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. While the dissent fears that an evidentiary hearing would somehow allow Adamson to \"escape\" the reinstatement provisions and thus \"render the agreement meaningless,\" such a hearing in no way compromises the integrity of Adamson's plea agreement, or plea agreements generally. States remain free to enforce plea agreements via enforcement provisions authorizing the filing of increased charges, including death-eligible charges, following a defendant's breach. What states may not do, and what appearances indicate was done in Adamson's case, however, is to pursue a sentence under the guise of plea enforcement when animated by improper motives.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. If, however, the judge rejects the sentencing provisions of the plea agreement, he or she must give the defendant the opportunity to withdraw the guilty plea. Ariz.R.Crim.P. 17.4(e); De Nistor, 143 Ariz. at 410, 694 P.2d at 241.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. The preliminary hearing transcript contained testimony that (1) Adamson was paid $10,000 for the bombing; (2) Adamson procured components for constructing the bomb; (3) Bolles' car was severely damaged by the explosion; (4) the area around the car was strewn with pieces of vehicles, glass, lights, electrical wiring, blood and meat tissue; (5) a large pool of blood lay directly beneath the driver's (Bolles') door; (6) Bolles was bleeding badly and his legs were mangled and burned (alternatively described as shattered and torn); (7) Bolles was conscious and speaking after the bombing; (8) Bolles identified Adamson as responsible for the bombing; and (9) Bolles died of multiple injuries caused by \"violent means, bombing.\" In addition, Adamson's testimony at the plea hearing showed that he had procured and placed the bomb with the intent to kill Bolles, and that Bolles did not die until 11 days after the explosion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. The record refutes any suggestion that the judge thought he had no power to reject the stipulated sentence once he had accepted Adamson's plea. The judge knew that he could reject the negotiated sentence, and apparently considered the possibility. He specifically informed Adamson at the January 15, 1977, plea hearing that \"the Court shall not be bound by any provision in the plea agreement regarding the sentence.\" He also advised that Adamson could withdraw his plea if the judge ultimately rejected the sentence as inappropriate or unsatisfactory. In addition, although he accepted the plea at that time, the judge refused to accept simultaneously the sentence. Instead, he delayed this decision until after he had reviewed all of the information necessary for a determination as to whether the negotiated prison term was an appropriate penalty for Adamson.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. For a brief period between 1916 and 1918, Arizona abolished the death penalty. 1917 Ariz. Sess. Laws, Initiative and Referendum Measures, § 1, at 4-5. The death penalty was then reenacted and remained with minor changes until 1973.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. \"After Furman the legislature amended the criminal code. . . . The amended statute was intended to remove the deficiencies described by the Furman decision.\" State v. Murphy, 113 Ariz. 416, 417, 555 P.2d 1110, 1111 (1976).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. See 1973 Session Laws of Arizona, 31st Legislature, 1st Regular Sess. Ch. 138 § 2 (deleting the portion of the statute, that delegates this decision to the discretion of the jury or, upon a plea of guilty, to the court).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. See 1973 Session Laws of Arizona, 31st Legislature, 1st Regular Sess. Ch. 138 § 5 (adding judicial sentencing scheme utilizing aggravating and mitigating circumstances).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. See 1973 Session Laws of Arizona, 31st Legislature, 1st Regular Sess. Ch. 138 § 4 (repealing the entire statute that allocated the burden of proof on mitigating factors at trial).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Prior to the 1973 enactments, the jury had always been able to consider \"excuses\" to defend against, or lessen the degree of homicide of which the defendant could be found guilty. Among those \"excuses\" were: accident, misfortune, heat of passion, provocation, and \"when the killing is not done in a cruel and unusual manner.\" See A.R.S. of 1955 § 13-460; Ariz. Code of 1939 § 43-2906; Rev. Code of Ariz. of 1928 § 4588; A.R.S. of 1913, 13 Penal Code § 178; Ariz. Penal Code of 1901 § 179.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. The specific list of aggravating and mitigating circumstances -- set forth in § 13-454 from 1973-78 and in § 13-703 from 1978 to the present -- has been modified since 1973. The basic procedure and the two aggravating circumstances found in Adamson's case, however, have remained the same since that time. Arizona currently lists nine aggravating circumstances at least one of which must be found before the death penalty becomes an option.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. A.R.S. §§ 13-1105 (first degree murder), 13-1104 (second degree murder), 13-1103 (manslaughter), 13-1102 (negligent homicide).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. One commentator explains that those states which, after Furman, graded murder into first and second degree with enumerated \"special circumstances\" had, in fact, created an additional level of murder: The post-Furman statutes, however, did not purport to create new offenses, nor did they purport to divide murder or even first degree murder into a capital and non-capital first degree murder offense. Formally, legislatures treated the \"special circumstances\" as sentencing criteria. Nevertheless, to be subject to the death penalty the culprit had to first be guilty of murder, then be guilty of first degree murder, and finally be found to have committed first degree in one or more of the enumerated special circumstances. Brushing aside the formality of this scheme for a moment, the effect of the special circumstances was to subdivide first degree murder into capital and non-capital first degree murder. Poulos, The Supreme Court, Capital Punishment and the Substantive Criminal Law: The Rise and Fall of Mandatory Capital Punishment, 28 Ariz. L. Rev. 143, 214 (1986) (footnote omitted) (emphasis in original) [hereinafter Poulos, Mandatory Capital Punishment ].\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. The Oregon Supreme Court invalidated, on a similar rationale, a provision of the Oregon capital punishment statute which permitted imposition of the death penalty only after \"the trial court [judge] found that the crime was committed with a greater culpable mental state than that found by the jury.\" State v. Quinn, 290 Or. 383, 404, 623 P.2d 630, 643 (1981). The court concluded that a judge's finding of \"a mental state different and greater than that found by the jury,\" 290 Or. at 384, 623 P.2d at 644, deprived a capital defendant of his or her right to a jury's determination of the facts of the crime charged. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. These inquiries are identical in essence to those required under the formal (statutory) distinctions Arizona makes among homicides. The distinctions turn almost entirely on differences in the defendant's mental state, as this provides a measure of culpability. See A.R.S. § 13-1102 (negligent homicide involves causing another's death through criminal negligence), § 13-1103 (manslaughter occurs by, inter alia, recklessness in causing another's death), § 13-1104 (second degree murder occurs by, inter alia, intentionally causing another's death), § 13-1105 (first degree murder occurs by, inter alia, intentionally and with premeditation causing another's death).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Further, as discussed previously, although both Arizona and Pennsylvania have classified the existence of relevant facts as sentencing considerations, Arizona's aggravating circumstances have all the attributes of an element -- except for the right to a jury's determination.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. The McMillan majority distinguished Mullaney which struck down a criminal statute requiring proof beyond a reasonable doubt of only those facts comprising the offense as defined by the state, especially where the defendant faced \"'a differential in sentencing ranging from a nominal fine to a mandatory life sentence.'\" Id. at 2417 (quoting Mullaney, 421 U.S. at 700). For Adamson, the alternatives are life and death -- the greatest differential available to a court choosing an appropriate penalty.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. Accord Rosen, The \"Especially Heinous\" Aggravating Circumstance in Capital Cases -- the Standardless Standard, 64 N.C.L. Rev. 941, 958 n. 96 (1986) [hereinafter Rosen, Especially Heinous Aggravating Circumstance ]: In both situations [finding aggravating circumstances in a penalty trial and elements of a crime in a guilt/innocence trial] the presence of an additional element has the primary effect of increasing punishment. For instance, a person convicted of simple assault is guilty of a crime, and the primary effect of a jury finding that the defendant used a deadly weapon is to increase the authorized punishment. Crimes such as arson, burglary, and murder commonly are divided into degrees, with the severity of punishment increasing if the jury finds the presence of factors that the legislature has determined make the crime more egregious.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. The Court went to great lengths in Spaziano to point out that there is no constitutional requirement that a jury determine the appropriate sentence of every death-eligible offender. See 468 U.S. at 460, 462-63, 465. However, in that we are not addressing the role of a jury in the ultimate determination of appropriate punishment, we find a compelling distinction between Spaziano and the instant case. Moreover, the Court in Spaziano pointed out what was \"not at issue\" by noting that \"Petitioner does not urge that capital sentencing is so much like a trial on guilt or innocence that it is controlled by the Court's decision in Duncan v. Louisiana, . . . [guaranteeing the right to jury trial].\" Id. at 458 (citations omitted). The Court stated, as dicta, that where the issue is the determination of appropriate punishment, a sentencing hearing is not trial-like for purposes of the Sixth Amendment, and thus the defendant is not entitled to a jury's determination. Id. at 459. In contrast, Adamson makes a contention not urged in Spaziano, focusing on the particular nature of fact-finding regarding elements that are erroneously listed in Arizona's capital sentencing scheme as aggravating circumstances.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Adamson does not challenge the constitutionality of this circumstance.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. The plurality reversed the defendant's death sentence, however, concluding that Georgia had not followed its own announced guidelines governing application. 466 U.S. at 432-33.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Out of a total of 72 post-1973 death penalty cases where an aggravating circumstance was involved, 56 of those cases pursued the \"especially heinous, cruel or depraved\" circumstance -- on review to the Arizona Supreme Court there were 43 affirmances, 12 reversals and 1 was not addressed on appeal. The remaining breakdown is as follows: subsection (5) was used in 34 cases -- 27 affirmed, 5 reversed and 1 not addressed on appeal; subsection (2) was used in 27 cases -- 24 affirmed, 2 reversed and 1 not addressed on appeal; subsection (1) was used in 24 cases -- 22 affirmed and 2 reversed; subsection (3) was used in 22 cases -- 8 affirmed, 13 reversed and 1 not addressed on appeal; subsection (7) was used in 2 cases -- 1 affirmed and 1 reversed; and subsection (4) was used in 1 case and was affirmed on appeal. From 1973-1978 the aggravating circumstances were listed under A.R.S. § 13-454(E). Since 1978 they have been listed under A.R.S. § 13-703(F). Because the content of the enumerated circumstances were identical for circumstances (1)-(6) under both §§ 13-454(E) and 13-703(F), the totals above identify aggravating circumstances by the subsection number only.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. See supra note 2 for listing of Arizona's aggravating circumstances.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. \"Senselessness\" has been defined as a \"shockingly evil state of mind.\" State v. (Ricky) Tison, 129 Ariz. 526, 543, 633 P.2d 335, 352 (1981), cert. denied, 459 U.S. 882, 74 L. Ed. 2d 147, 103 S. Ct. 180 (1982).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. Moreover, the Arizona court has not resolved the difference -- if any really exists -- between the words \"heinous\" and \"depraved.\" In Ortiz, 131 Ariz. at 206, 639 P.2d at 1031, the Arizona Court attempted to distinguish between them by explaining that \"depravity focuses on the murderer's state of mind, and heinousness focuses on society's view of the murder as compared to other murders.\" This specific delineation was also suggested in a post-Gretzler case. State v. Roscoe, 145 Ariz. 212, 226, 700 P.2d 1312, 1326 (1984), cert. denied, 471 U.S. 1094, 85 L. Ed. 2d 525, 105 S. Ct. 2169 (1985) (\"The words 'heinous' and 'depraved' refer [respectively] to the nature of the crime and the state of defendant's mind.\"). It has not, however, been recognized in any subsequent opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. It is significant that in Arizona, \"killing of a witness\" is a judicially-created aggravating circumstance rather than one identified by the legislature. In thirteen other states, killing a witness is a statutory aggravating circumstance. See Note, Capital Punishment in 1984: Abandoning the Pursuit of Fairness and Consistency, 69 Cornell L. Rev. 1129, 1232 and n. 687 (1984).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. In State v. Hensley, 142 Ariz. 598, 691 P.2d 689 (1984), the Arizona Court identified this factor in support of A.R.S. § 13-703(F) (motive of pecuniary gain) -- rather than (F)(6). 142 Ariz. at 604, 691 P.2d at 694 (\"The defendant had the three victims lie on the floor during the robbery and before leaving the bar shot each victim in turn with the intent that no witnesses be left to identify the robbers.\"). Thus, it appears that the same behavior can be used to support either of two distinct aggravating circumstances.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. As the Supreme Court noted in Arizona v. Rumsey, 467 U.S. 203, 81 L. Ed. 2d 164, 104 S. Ct. 2305 (1983), the Arizona capital sentencing scheme does not empower the reviewing court to make trial-like factual determinations: Nor does the availability of appellate review, including reweighing of aggravating and mitigating circumstances, make the appellate process part of a single continuing sentencing proceeding. The Arizona Supreme Court [has] noted that its role is strictly that of an appellate court, not a trial court. Id. at 210 (citation omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. When the Arizona Supreme Court reverses one aggravating circumstance yet affirms others, it will remand for resentencing. State v. Gillies, 135 Ariz. 500, 516, 662 P.2d 1007, 1023 (1983) (supplemental opinion) (\" Gillies I \").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. In section VI, infra, we hold that the judge did not give proper consideration to Adamson's mitigating evidence. Thus the judge's conclusion that Adamson failed to establish any mitigating circumstances does not bar reconsideration.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. The Supreme Court has never directly addressed the constitutionality of requiring that defendants overcome an evidentiary hurdle as they attempt to establish the existence of mitigating circumstances. Justice Marshall dissented to the denial of certiorari in a case presenting precisely this issue. He explained the problem created by placing such a burden on a defendant: Mitigating factors . . . are not easily proved or disproved. Each one rests on evidence that easily might influence the conclusion that death is proper, even if that evidence does not conclusively prove the statutory mitigating factor . . . . As a result, the sentencer would be prevented from considering any of the evidence adduced in an effort to meet the burden of proof, because the statute permits consideration only of the factors proved by a preponderance of the evidence. To preclude the sentencer from considering such potentially influential evidence . . . is to bar, as a matter of law, consideration of all mitigating evidence and influence and thus to violate Lockett and Eddings. Such a result can only enhance 'the risk that the death penalty will be imposed in spite of factors which may call for a less severe penalty.' Stebbing v. Maryland, 469 U.S. 900, 902-03, 83 L. Ed. 2d 212, 105 S. Ct. 276 (1984) (Marshall, J., dissenting from denial of certiorari) (emphasis in original) (quoting Lockett, 438 U.S. at 605 (plurality opinion)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. Contrast Coleman v. Risley, 839 F.2d 434, 447 (9th Cir. 1988) (\"Nor under Montana law is the existence of mitigating circumstances a fact which must be 'proved or presumed' in obtaining a conviction or even in imposing sentencing.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. The dissent is in error when it suggests that the evidentiary standard imposed upon the defendant does not preclude evidence, but rather sifts evidence, distinguishing between those facts which are mitigating from those which are not. In fact, the separation of mitigating from non-mitigating evidence is accomplished when the court makes a relevancy determination. Thus, if facts are found relevant to mitigation, then those mitigating facts are indeed precluded from the weighing stage if the defendant is unable to meet the evidentiary burden imposed by the Arizona statute.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. Contrast Gregg, 428 U.S. 153, 96 S. Ct. 2909, 49 L. Ed. 2d 859, where the Court upheld the constitutionality of the statutory scheme enacted by the Georgia legislature in response to Furman. Georgia's bifurcated system required a finding at the sentencing phase of at least one statutory aggravating circumstance before a death sentence could be considered. Id. at 197. However, in contrast to the Arizona scheme at issue, Georgia did not require the sentencer (the jury) \"to find any mitigating circumstance in order to make a recommendation of mercy that is binding on the trial court. . . .\" Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. In Jurek, the Court upheld a Texas death penalty statute which provided for a separate sentencing proceeding wherein the jury was required to answer certain questions. The statute in Jurek differs from Arizona's in two significant respects. First, the phrasing of the questions asked in Jurek required the jury to make specific findings against the defendant before a death sentence could be imposed, allowing a presumption in favor of the defendant. In contrast, Arizona, forces a defendant to prove that his or her situation \"merits leniency.\" Moreover, in Jurek, all mitigating evidence was admissible for the jury to consider in answering the questions. 428 U.S. at 271-73, 275-76. Only if the jury answered all questions in the affirmative, could a death sentence result. Id. at 269. Thus at the stage in which balancing occurred to determine ultimately whether death was the appropriate penalty, all relevant evidence was considered. See id. at 276 (\"What is essential is that the jury have before it all possible relevant information about the individual defendant whose fate it must determine.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. Arizona's presumption \"requires the [sentencer] to find the presumed [fact] unless the defendant persuades the [sentencer] that such a finding is unwarranted.\" Francis v. Franklin, 471 U.S. 307, 314, 85 L. Ed. 2d 344, 105 S. Ct. 1965 n. 2 (1985) (citing Sandstrom v. Montana, 442 U.S. 510, 517-18, 61 L. Ed. 2d 39, 99 S. Ct. 2450 (1979)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. The dissent erroneously suggests that our conclusion that the Arizona statute creates a presumption of death is substantially based on the presence of the word \"shall\" in § 13-703(E). In fact, it is not primarily the word \"shall\" that leads us to our conclusion, but rather the fact that under the Arizona statute, the death sentence will be imposed unless mitigating circumstances outweigh the aggravating circumstances. Thus, the constitutionality of the Montana and Texas death penalty statutes, see Jurek v. Texas, 428 U.S. 262, 49 L. Ed. 2d 929, 96 S. Ct. 2950 (1976), and McKenzie v. Risley, 842 F.2d 1525 (9th Cir. 1988), both of which contain the word \"shall\" in their sentencing provisions, in no way undermines our position as neither of these statutes require the court to find mitigating circumstances outweigh aggravating circumstances.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. Compare Peek v. Kemp, 784 F.2d 1479, 1488 (11th Cir.) (en banc), cert. denied, 479 U.S. 939, 107 S. Ct. 421, 93 L. Ed. 2d 371 (1986) (noting that in Georgia, the sentencer has \"absolute discretion to grant mercy regardless of the existence of 'aggravating' evidence\") with Gray v. Lucas, 677 F.2d 1086, 1106 (5th Cir. 1982), cert. denied, 461 U.S. 910, 76 L. Ed. 2d 815, 103 S. Ct. 1886 (1983) (noting that in Mississippi, \"even if the jury finds that the aggravating circumstances outweigh the mitigating circumstances, it is not required to impose the death penalty\"). A panel of this circuit recently considered whether a death penalty statute imposed a mandatory death sentence by placing the burden of proving mitigating circumstances on the defendant. While posing an issue similar to that of the case at bar, Campbell v. Kincheloe, 829 F.2d 1453 (9th Cir. 1987), is distinguishable. In Campbell, this court examined the language of Washington's death penalty statute and its construction by the state courts. We concluded that \"the language of the statute clearly indicates that the burden of proof is on the state to 'convince' the jury beyond a reasonable doubt that there are not sufficient mitigating circumstances to merit leniency.\" Id. at 1466 (emphasis added). We further found that the state's bearing of the burden of proof resulted in a presumption of leniency. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. As the Supreme Court has held that the state is not constitutionally required to prove an absence of mitigating factors, we do not question the constitutionality of the bare requirement that a defendant bring forth evidence in support of mitigation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. The fact that the presumption of death is rebuttable probably would not cure the infirmity of a death sentence brought about by the presumption. See Francis, 471 U.S. at 316.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. The requirement of individualized sentencing rests squarely on the predicate that the penalty of death is qualitatively different from a sentence of imprisonment, however long. Death, in its finality, differs more from life imprisonment than a 100-year prison term differs from one of only a year or two. Because of that qualitative difference, there is a corresponding difference in the need for reliability in the determination that death is the appropriate punishment in a specific case. Woodson, 428 U.S. at 305 (footnote omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. Justice Stevens, writing in Smith v. North Carolina, 459 U.S. 1056, 74 L. Ed. 2d 622, 103 S. Ct. 474 (1982) (opinion respecting the denial of the petition for certiorari), voiced the same objections to a North Carolina death penalty instruction that operated in a manner similar to the Arizona statute. In Smith, the jury was instructed to impose the death penalty if it found that (1) one or more aggravating circumstances existed, (2) one or more aggravating circumstances were sufficiently substantial to call for the death penalty, and (3) that the aggravating circumstances outweighed the mitigating circumstances. Id. at 1056. Justice Stevens noted that such instructions may lead a jury to believe it is required to initially answer the question of whether the aggravating circumstances, considered alone, warrant the imposition of the death penalty, and then to respond to the question of whether the aggravating circumstances outweigh the mitigating circumstances. Justice Stevens then argued: It seems to me entirely possible that a jury might answer both of those questions affirmatively and yet feel that a comparison of the totality of the aggravating factors with the totality of mitigating factors leaves it in doubt as to the proper penalty. But the death penalty can be constitutionally imposed only if the procedure assures reliability in the determination that 'death is the appropriate punishment in a specific case.' Id. (quoting Woodson v. North Carolina, 428 U.S. 280, 305 (1976) (opinion of Stewart, Powell and Stevens, JJ.).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. One commentator has argued that \"the same dictates of text and policy\" that ensure the defendant a presumption of innocence, \"apply with equal, if not greater, force\" to require a \"presumption of life.\" Note, The Presumption of Life: A Starting Point for a Due Process Analysis of Capital Sentencing, 94 Yale L.J. 351, 360 (1984). Basing her argument not on the Eighth Amendment, but rather on the Due Process Clause of the Fourteenth Amendment, she notes: The capital sentencing decision, like the determination of guilt and unlike the typical noncapital sentencing decision, is binary. Just as the criminal trial jury must choose to convict or acquit, the capital sentencing authority must choose to impose either life imprisonment or the death penalty. In contrast, a noncapital sentencing authority can usually strike a balance between the conflicting interests of the parties by adjusting the length or severity of the noncapital sentence. Id. at 364.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. See Appendix A in Adamson v. Ricketts, 789 F.2d at 731-32. The sentence was heavily structured to the circumstances. Adamson could not apply for or be eligible for parole until 20 calendar years and 2 calendar months had passed (Id. at para. 3), time for sentencing was waived until the conclusion of Adamson's testimony (Id. at para. 8), judges other than the judge assigned to the case may sentence in accordance with the terms of the agreement and are bound by the terms of the agreement (Id. at para. 9), place of sentencing may be changed (Id. at para. 10), Adamson could not appeal from the second degree judgment and sentence and if he did the agreement was null and void and the original charges were automatically reinstated (Id. at para. 11), and Adamson would serve his sentence outside the State of Arizona (Id. at para. 14).\u003c/span\u003e\n\n",
    "body_length": 237567,
    "citedas": [
      "865 F.2d 1011"
    ],
    "attorneys": "Timothy K. Ford, Esq., Seattle, Washington, and Timothy J. Foley, San Francisco, California, for Petitioner-Appellant. Jack Roberts, Assistant Attorney General, Department of Law, Phoenix, Arizona, for Respondents-Appellees.",
    "category": [
      "243",
      "36",
      "78",
      "75"
    ],
    "judges": "Hug, Schroeder, Pregerson, Alarcon, Ferguson, Nelson, Boochever, Norris, Beezer, Brunetti, and Thompson, Circuit Judges. Boochever, Circuit Judge, concurring. Brunetti, Circuit Judge, with whom Alarcon, Beezer, and Thompson, Circuit Judges, join, concurring and dissenting.",
    "citation_count": 106
  }
}
