{
  "id": "RrhlTmYBTlTomsSB96n1",
  "document": {
    "title": "State v. Hartley",
    "full_title": "STATE OF NEW JERSEY v. TERRENCE B. HARTLEY",
    "jurisdiction": "Supreme Court of New Jersey",
    "date": "1986-07-03T00:00:00.000Z",
    "docket": "No. A-93",
    "body": "Defendant, Terrence Hartley, was convicted on one count of first-degree robbery, N.J.S.A. 2C:15-1, and two counts of felony murder, N.J.S.A. 2C:11-3(a)(3). For purposes of sentencing the robbery conviction was merged. On the two murders the court imposed a term of life imprisonment with a parole-ineligibility period of twenty years, and a consecutive thirty-year term with a parole-ineligibility period of fifteen years. The convictions were based on a robbery of the Holst Jewelry Store in Atlantic City that resulted in the death of the store's owner and the owner's aunt.\n\nThis appeal questions the admissibility, on the State's case in-chief, of defendant's two inculpatory statements given during custodial interrogations by separate branches of law enforcement, who were pursuing a \"joint\" investigation. Defendant had previously been given Miranda warnings, in response to which he had asserted in clear and unequivocal terms his right to remain silent.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Some time later he made the statements in question, the first in response to interrogation by federal authorities, who did not give defendant the Miranda warnings anew, and the second to New Jersey authorities after defendant had been reinformed of his Miranda rights. The specific issues are whether the federal authorities \"scrupulously\n\nhonored\" defendant's previously-invoked right to silence, as required by Michigan v. Mosley, 423 U.S. 96, 96 S. Ct. 321, 46 L. Ed. 2d 313 (1975); and, if not, whether the statement to New Jersey authorities is tainted because of its relationship to the \"federal\" statement.\n\nWe hold that before an accused's previously-asserted right to remain silent may be deemed to have been \"scrupulously honored,\" law-enforcement authorities must, at a minimum, readminister the Miranda warnings. In the absence of those renewed warnings any inculpatory statement given in response to police-initiated custodial interrogation after the right to silence has been invoked is inadmissible. In addition, we determine that a police failure scrupulously to honor an accused's earlier-invoked right to silence amounts to a violation not simply of Miranda 's prophylactic rules but of the accused's privilege against self-incrimination. Therefore, any statement that a suspect may make after his right to silence has not been scrupulously honored is unconstitutionally compelled as a matter of law. That circumstance in turn requires a close examination of the relationship between that first statement and any subsequent statement.\n\nWe conclude that in this case the federal authorities' failure scrupulously to honor defendant's announced intention not to make a statement requires the exclusion, on the State's case, not only of defendant's confession to agents of the Federal Bureau of Investigation (FBI) but also of defendant's second statement, made to state and municipal authorities. This result is compelled either (1) because the second statement was obtained through a process that was in fact part of the same illicit procedure that produced the first statement, or (2) because it was the product of an unconstitutional interrogation -- and this despite the readministering of Miranda warnings to defendant before the second statement. Finally, we base the above determinations not only on our understanding of the United States Supreme Court precedents in this area but on independent state grounds of decision as well.\n\nI\n\nThe facts surrounding the commission of the crimes are uncomplicated. Hartley and two companions, James Hooks and a young woman known only as \"Snow,\" traveled from New York to Atlantic City for the purpose of robbing the casino at the Resorts International Hotel. The heavy security at the hotel served to discourage that venture, so defendant and his co-felons searched for a more vulnerable target. The nearby Holst Jewelry Store appeared to promise easier pickings. While defendant remained outside as a \"lookout,\" Hooks and Snow robbed the jewelry store, in the course of which the owner and his aunt were shot and killed. The three culprits then returned to the hotel, took a taxi to the Atlantic City Bus Depot, and boarded a return bus for New York City.\n\nAt funeral services for James Hooks, who himself was killed just ten days after the robbery-murders in Atlantic City, an informant identified defendant as a suspect in the Holst Jewelry Store crimes. On the basis of the informant's tip and a corroborating police investigation, a federal magistrate sitting in the Eastern District of New York issued an arrest warrant for Hartley and a search warrant for his residence. The federal authorities' involvement arose because of a charge of interstate transportation of the property taken from the jewelry store.\n\nThe warrants were executed at Hartley's apartment in Brooklyn at about 7:30 a.m. on February 5, 1981, by five special agents of the FBI, assisted by members of the Atlantic City Police Department, the Atlantic County Prosecutor's office, and the New York City Police Department. At the time of the arrest FBI agent Richard Robley read Hartley the Miranda rights and informed him that he was being arrested for \"the interstate transportation of stolen property in connection with an armed robbery of the Holst Jewelry Store in Atlantic City, New Jersey, [in] which the owner and his aunt were murdered.\" A police search of defendant's apartment uncovered jewelry\n\nthat was later identified as merchandise stolen from the Holst Jewelry Store.\n\nAfter his arrest Hartley was taken to the Brooklyn-Queens office of the FBI. At 9:13 a.m. the authorities placed Hartley in an Interview Room for processing. At 9:16 a.m. he was readvised of his constitutional rights and was handed a federal \"Advice of Rights\" form, which contained the full panoply of Miranda warnings. Immediately following the statement of those warnings, the form contained the following, under the heading \"Waiver of Rights\":\n\nI have read this statement of my rights and I understand what my rights are. I am willing to make a statement and answer questions. I do not want a lawyer at this time. I understand and know what I am doing. No promises or threats have been made to me and no pressure or coercion of any kind has been used against me.\n\nThis in turn was followed by a line for defendant's signature. Thus, the only place provided for one to sign the form came after the \"waiver\" section. Put differently, the only purpose of the signature was not to acknowledge receipt of one's rights but rather to indicate a waiver of those rights.\n\nAccording to FBI agent Merle Frieberg, defendant \"briefly glanced at\" the form, after which Frieberg said,\n\n\"Do you understand what is on the form? Do you understand what was just read to you?\"\n\nHe said, \"Yes.\" He hesitated and I said, \"What seems to be the problem?\"\n\nHe said, \"I don't believe I want to make a statement at this time.\" And to which Special Agent Davis said, \"Fine. If you don't want to make a statement at this time, strike that particular item and initial it.\" Which he did.\n\nThe authorities asked no questions at that time, but proceeded to fingerprint and photograph defendant, commencing at 9:26 a.m.\n\nAt 10:43 a.m. agent Frieberg again approached Hartley, who had been returned to the Interview Room, and stated:\n\nTerrence, I am Special Agent Frieberg and I am from Atlantic City, New Jersey and I think you know why I am up here. And I would like you to reconsider and now is the time if you are going to make a statement. Now is the time to do it.\n\nDefendant replied, \"What do you want to know?\" Frieberg thereupon, without readministering the Miranda warnings, proceeded to ask defendant personal background questions, followed by questions probing the details of the jewelry-store robbery. Defendant responded by giving what amounted to a full confession. The agent had his notes typed into a statement, which Hartley refused to sign.\n\nAfter being questioned by the FBI agents, Hartley was questioned by a group of four New York and New Jersey officials. Criminal Investigator Margaret Barnett of the Atlantic County Prosecutor's Office read him his rights. The State asserts that defendant signed a waiver at that time but that the form was misplaced in the Prosecutor's office. The interrogation was conducted primarily by Detective Dennis Mason of the Atlantic City Police Department. Also present were two New York City police officers. All four were members of the group that had arrived at the defendant's apartment that morning and had assisted in the search conducted there. Hartley refused to allow his statement to be recorded on tape, and likewise refused to sign a typed description of this interview, as was the case with the federal statement.\n\nThe trial court refused to admit into evidence either of the unsigned typewritten statements, but it allowed both the federal and state authorities' testimony as to the contents of Hartley's oral statements to them. Defendant appealed his conviction to the Appellate Division, alleging error in the trial court's failure to have suppressed \"statements attributed to the defendant in violation of federal and state constitutions.\" The Appellate Division affirmed the conviction, with Judge Gaulkin dissenting. That court determined that defendant's right to remain silent had not been violated and that therefore his\n\nconfession was properly admitted. This appeal followed as of right. See R. 2:2-1(a)(2).\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nII\n\nThe fifth amendment to the United States Constitution provides in part that \"[n]o person * * * shall be compelled in any criminal case to be a witness against himself * * *.\" U.S. Const. amend. V. In Malloy v. Hogan, 378 U.S. 1, 84 S. Ct. 1489, 12 L. Ed. 2d 653 (1964), the Supreme Court held this privilege against self-incrimination applicable to the states, through the fourteenth amendment. Although we have no similar provision in our New Jersey Constitution, the privilege itself \"is firmly established as part of the common law of New Jersey and has been incorporated into our Rules of Evidence.\" In re Martin, 90 N.J. 295, 331 (1982); see also Evid.R. 23, 24, and 25 (bestowing the privilege, setting out its boundaries, and describing exceptions).\n\nWhen a defendant waives his privilege against self-incrimination, as he surely is entitled to do, the government has the \"heavy burden\" of demonstrating that such a waiver was made \"voluntarily, knowingly, and intelligently.\" Miranda v. Arizona, 384 U.S. 436, 444, 86 S. Ct. 1602, 1612, 16 L. Ed. 2d 694, 707 (1966); see Tague v. Louisiana, 444 U.S. 469, 471, 100 S. Ct. 652, 653, 62 L. Ed. 2d 622, 625 (1980); C.H. Whitebread, Criminal Procedure ยง 15.05, at 300-01 (1982). However, the question of waiver is an inquiry separate and apart from the first question that engages our attention in this appeal: whether the defendant's right to remain silent has been properly respected in the first instance. See Jarrell v. Balkcom, 735 F.2d 1242, 1252 n. 11, reh'g denied, 740 F.2d 979 (11th Cir.1984), cert. denied, U.S. , 105 S. Ct. 2331, 85 L. Ed. 2d 848, reh'g\n\ndenied, U.S. , 105 S. Ct. 3547, 87 L. Ed. 2d 670 (1985); People v. Grant, 45 N.Y. 2d 366, 373, 380 N.E. 2d 257, 261, 408 N.Y.S. 2d 429, 432 (1978); Stone, The Miranda Doctrine in the Burger Court, 177 Sup.Ct.Rev. 99 (1977) (hereinafter The Miranda Doctrine).\n\nIn Miranda, the Court made clear that the requirement that the police \"scrupulously honor\" the suspect's assertion of his right to remain silent is independent of the requirement that any waiver be knowing, intelligent, and voluntary. See Michigan v. Mosley, supra, 423 U.S. at 102-03, 96 S. Ct. at 325-26, 46 L. Ed. 2d at 320-21; The Miranda Doctrine, supra, 177 Sup.Ct.Rev. at 133. Care must be taken therefore that there be no blurring of the separate lines of analysis that are followed in respect of the \"scrupulously honor\" requirement on the one hand and the waiver issue on the other. The distinction between the two concepts stands out in bold relief in this case: given our holding that the failure scrupulously to honor a previously-invoked right to silence renders unconstitutionally compelled any resultant incriminating statement made in response to custodial interrogation, there can be no question of waiver. In the instant context the waiver issue could not arise until after the exercise of the asserted right had been scrupulously honored by, at a minimum, the giving of fresh Miranda warnings. The requirement that an asserted right be scrupulously honored has been carefully guarded in this state in order to ensure that full opportunity to exercise the privilege is permitted. State v. Kennedy, 97 N.J. 278, 288 (1984). Because in this case the right was not honored and defendant's \"federal\" statement must therefore be deemed to have been unconstitutionally compelled, there is simply no waiver issue posed on the appeal. See United States ex rel. Sanders v. Rowe, 460 F. Supp. 1128, 1135 (N.D.Ill.1978) (\"No waiver is possible if the suspect's original request for counsel was not 'scrupulously honored.'\").\n\nJustice Stein's dissent suggests that the Court engages in an \"unduly technical\" application of Mosley by refusing to test\n\nHartley's response by waiver standards. Post at 316. Justice Stein would apparently have us abandon this federal constitutional approach and adopt instead a waiver analysis proposed by Justice Powell's concurring opinion in Oregon v. Bradshaw, 462 U.S. 1039, 103 S. Ct. 2830, 77 L. Ed. 2d 405 (1983). That Justice Powell has not succeeded in changing the law here is readily apparent from the Court's recent reaffirmation, in the \"right to counsel\" context, of the \"two-step\" approach to statements obtained after assertion of a constitutional right. Michigan v. Jackson, 475 U.S. , , 106 S. Ct. 1404, 1410, 89 L. Ed. 2d 631, 642 (1986).\n\nIII\n\nThe privilege against self-incrimination is one of several important rights that the Supreme Court sought to protect in Miranda by establishing procedural prerequisites to admissibility of any inculpatory statement produced by custodial interrogation. Whereas prior to Miranda the admissibility of an accused's in-custody statements turned on whether those statements were \"voluntary\" within the meaning of the due-process clause, Miranda created an irrebuttable presumption of compulsion as to such statements given in the absence of the warnings mandated by that case. E.g., Oregon v. Elstad, 470 U.S. 298, - , 105 S. Ct. 1285, 1290-93, 84 L. Ed. 2d 222, 229-31 (1985), of which more in parts IV and V of this opinion. Consequently, under Miranda, statements produced by unwarned in-custody interrogation are inadmissible on the State's case in-chief, id. at , 105 S. Ct. at 1292, 84 L. Ed. 2d at 231.\n\nThe \"compulsion\" that is at the heart of the Miranda doctrine does not assume the \"rubber-hose\" scenario conjured up by a dictionary definition of \"coercion\" or \"involuntariness.\" Rather, the premise behind the decision is \"that without proper safeguards the process of in-custody interrogation of persons suspected or accused of crime contains inherently compelling pressures which work to undermine the individual's will to\n\nresist and to compel him to speak where he would not otherwise do so freely.\" Miranda, supra, 384 U.S. at 467, 86 S. Ct. at 1624, 16 L. Ed. 2d at 719. The compulsion contemplated by Miranda, then, is \"inherent\" or \"presumed,\" rather than \"actual.\" But cf. Kamisar, Heavy Blow Delivered by Miranda Decisions, The National Law Journal, Sept. 2, 1985, at S-22 (\"[T]here is no distinction, for constitutional purposes, between inherent compulsion and actual compulsion.\"). Our own recognition of the nature of this compulsion and of its significant ramifications is reflected in our decisions requiring that a request, \"however ambiguous,\" to terminate questioning or to have counsel present must be diligently honored. State v. Kennedy, supra, 97 N.J. at 288.\n\nIn Michigan v. Mosley, supra, 423 U.S. at 104, 96 S. Ct. at 326, 46 L. Ed. 2d at 321, the Supreme Court again emphasized the \"coercive pressures\" that are inherent in a custodial setting. The Court focused on this key passage from Miranda:\n\nOnce warnings have been given, the subsequent procedure is clear. If the individual indicates in any manner, at any time prior to or during questioning, that he wishes to remain silent, the interrogation must cease. At this point he has shown that he intends to exercise his Fifth Amendment privilege; and a statement taken after the person invokes his privilege cannot be other than the product of compulsion, subtle or otherwise. Without the right to cut off questioning, the setting of in-custody interrogation operates on the individual to overcome free choice in producing a statement after the privilege has been once invoked. [384 U.S. at 473-74, 86 S. Ct. at 1627-28, 16 L. Ed. 2d at 723 (emphasis added).]\n\nThe specific problem confronting the Mosley Court was that although Miranda appears to contain a clear requirement that \"the interrogation must cease\" when the suspect asserts his right to remain silent, the opinion does not discuss under what circumstances, if any, the authorities may resume interrogation.\n\nPrior to Mosley, the case law on this question was \"in a state of disarray.\" The Miranda Doctrine, supra, 177 Sup.Ct.Rev. at 130. The courts were sharply divided in their approach to the issue.\n\nMost pre- Mosley courts * * * seem to have adopted an ad hoc approach to the problem, implicitly undertaking a two-pronged inquiry. First, was the subsequent attempt to question merely an impermissible continuation of the prior attempt, or was it a genuinely independent event? * * * Second, if the subsequent attempt to interrogate was in fact an independent event, was the suspect's eventual waiver of his rights knowing, intelligent, and voluntary within the meaning of Miranda? * * * As might be expected, because of the absence of any clear standards, the results under this approach were unpredictable and often inconsistent. Finally, some courts modified this approach by employing an especially high standard of knowing, intelligent, and voluntary waiver in the face of renewed attempts to question. [ Id. at 130-31 (footnotes omitted).]\n\nIt was the confusion demonstrated in the foregoing passage that the Court sought to resolve in Mosley.\n\nThe defendant in Mosley, arrested on suspicion of robbery, was carefully informed of his constitutional rights when the police took him into custody. Mosley stated that he understood his rights and that he did not wish to speak about the robberies. Immediately, the police terminated the questioning. The defendant was questioned two hours later by a different police officer at another location concerning an unrelated homicide. At the outset of this second interrogation the defendant was again warned of his right to remain silent, 423 U.S. at 105, 96 S. Ct. at 327, 46 L. Ed. 2d at 322, after which he made incriminating statements. The question was whether those statements could be used against defendant at his murder trial.\n\nJustice Stewart's opinion for the Court recognized that resolution of the issue required the Court to look beyond the key passage in Miranda, quoted supra at 263, because reliance on a strict, literal interpretation of \"the interrogation must cease\" would take one to \"absurd and unintended results.\" 423 U.S. at 102, 96 S. Ct. at 325, 46 L. Ed. 2d at 320. The Court said:\n\nTo permit the continuation of custodial interrogation after a momentary cessation would clearly frustrate the purposes of Miranda by allowing repeated rounds of questioning to undermine the will of the person being questioned. At the other extreme, a blanket prohibition against the taking of voluntary statements or a permanent immunity from further interrogation, regardless of the circumstances, would transform the Miranda safeguards into wholly irrational obstacles to legitimate police investigative activity, and deprive suspects\n\nof an opportunity to make informed and intelligent assessments of their interests. [ Id. ]\n\nThe Court therefore eschewed a \"per se proscription of indefinite duration upon any further questioning by any police officer on any subject, once the person in custody has indicated a desire to remain silent,\" id. at 102-03, 96 S. Ct. at 326, 46 L. Ed. 2d at 321, and held instead that \"the admissibility of statements obtained after the person in custody has decided to remain silent depends under Miranda on whether his 'right to cut off questioning' was 'scrupulously honored'.\" Id. In concluding that Mosley's right to terminate questioning had been \"scrupulously honored,\" and that the incriminating statements elicited from the second interrogation could be used against him at trial, the Court stated:\n\nThis is not a case * * * where the police failed to honor a decision of a person to cut off questioning, either by refusing to discontinue the interrogation upon request or by persisting in repeated efforts to wear down his resistance and make him change his mind. In contrast to such practices, the police here immediately ceased the interrogation, resumed questioning only after the passage of a significant period of time and the provision of a fresh set of warnings, and restricted the second interrogation to a crime that had not been a subject of the earlier interrogation. [ Id. at 105-06, 96 S. Ct. at 327, 46 L. Ed. 2d at 322.]\n\nMosley has come in for some harsh treatment at the hands of the commentators. See, e.g., Professor Stone's comments in The Miranda Doctrine, supra, 177 Sup.Ct.Rev. at 129-37, in a section entitled Michigan v. Mosley: If at First You Don't Succeed * * * (\"[T]he requirement that an individual's rights be 'scrupulously honored' surely has a nice ring to it, but, as formulated and applied in Mosley, is devoid of any clear substantive content,\" id. at 134; and, \" Mosley offers only ambiguous protection to the accused and virtually no guidance to the police or the courts who must live with the rule.\" Id. at 137); Note, The Declining Miranda Doctrine: The Supreme Court's Development of Miranda Issues, 36 Wash. \u0026 Lee L.Rev. 259, 268 (1979) (\"[T]he Court's 'scrupulously honored' test provides no concrete guidelines for lower courts to resolve the issue of precisely when interrogation may be resumed.\");\n\nNote, Michigan v. Mosley: A New Constitutional Procedure, 54 N.C.L.Rev. 695, 696 (1976) (Mosley 's \"scrupulously honor\" requirement is defined \"so vaguely that it offers little guidance to lower courts or the police.\"). Whatever basis there may be for these criticisms, Mosley leaves no room for doubt in at least this respect: the decision of a suspect to remain silent is \"scrupulously honored\" when (1) the police do not approach him for two hours, (2) he receives fresh Miranda warnings, (3) he is questioned by a different officer, and (4) he is questioned in respect of an offense different from the one for which he is in custody.\n\nA number of courts have required the suppression of incriminating statements in cases in which one or more of the factors that supported admissibility in Mosley were absent. See, e.g., Robinson v. Percy, 738 F.2d 214, 220 (7th Cir.1984) (under Mosley, cessation of questioning for a certain period of time is required before interrogation can be renewed); People v. Young, 115 Ill.App. 3d 455, 71 Ill.Dec. 259, 450 N.E. 2d 947 (1983) (recess and fresh Miranda warnings are a minimum prerequisite to reinterrogation); Wilson v. United States, 444 A.2d 25, 31 (D.C.1982) (all Mosley factors are required to validate reinterrogation); United States v. Maddox, 413 F. Supp. 60 (W.D.Okla.1976) (reinterrogation on same offense is precluded by Mosley); cf. People v. Buxton, 44 N.Y. 2d 33, 374 N.E. 2d 384, 403 N.Y.S. 2d 487 (1978) (later non-coercive reinterrogation permitted after reiteration of requisite warnings). Still other courts have applied the Mosley factors in a more flexible fashion, focusing largely on the level of overall coerciveness surrounding the particular interrogation at issue. See, e.g., United States v. Terry, 702 F.2d 299 (2d Cir.), cert. denied, 461 U.S. 931, 103 S. Ct. 2095, 77 L. Ed. 2d 304, and 464 U.S. 992, 104 S. Ct. 482, 78 L. Ed. 2d 680 (1983) (statement given as the result of a non-coercive reinterrogation on same subject after forty minutes and fresh Miranda warnings held admissible); United States v. Smith, 608 F.2d 1011 (4th Cir.1979) (statement made after a brief cessation of questioning and in the absence\n\nof formal fresh Miranda warnings admissible as non-coercively obtained).\n\nThe commentators too are in disagreement as to which of the Mosley factors is indispensable to fulfillment of the \"scrupulously honor\" requirement. Professor Kamisar reports that Professor Stone, author of The Miranda Doctrine, supra, 177 Sup.Ct.Rev. 99, sees as \"critical\" to the Mosley result the fact that the second interrogation was restricted to a separate, \"unrelated\" crime, whereas Kamisar lists three elements as \" the minimum requirement \" for renewing questioning when a suspect indicates that he wishes to remain silent: \"(1) the original interrogation is promptly terminated; (2) the questioning is resumed only after 'the passage of a significant period of time' (presumably the passage of at least an hour or two); (3) the suspect is given another set of Miranda warnings at the outset of the interrogation * * *.\" Kamisar, \"The Edwards and Bradshaw Cases: The Court Giveth and the Court Taketh Away,\" 5 The Supreme Court: Trends and Developments 1982-83 153, 155 (1984).\n\nWe need go no further today, in respect of Mosley 's impact on this case, than declare as indispensable to a permissible resumption of custodial interrogation of a previously-warned suspect the furnishing of fresh Miranda warnings. Unless the police follow this \"bright-line,\" inflexible, minimum requirement, a defendant's statement made in the above-stated circumstances cannot be admitted into evidence as part of the prosecution's case in-chief. See also State v. McCloskey, 90 N.J. 18, 30 n. 3 (1982) (\"prosecution cannot use any statements made during [the defendant's] second interrogation, before which new Miranda warnings were not given\".).\n\nJustice Stein's dissent suggests that a reminder or reacknowledgement of an accused's previously-asserted right to silence is as effective a means of satisfying Mosley 's \"scrupulously honor\" requirement as is our bright-line rewarning requirement. Post at 318-319. The weakness of such an approach\n\nand the merits of a bright-line rule are highlighted by this very case. While the Court views Frieberg's statement as clearly coercive (see discussion infra at 267-271, Justice Stein views the same statement as a non-coercive request to reconsider a previous invocation of the right to silence, fully consistent with a scrupulous honoring of that right. A bright-line rule will help avoid this confusion and conflict in future cases, at least on the question of the minimum requirement for \"scrupulously honoring.\"\n\nAlthough the Supreme Court specifically avoided, in Mosley, the adoption of a \"per se\" test for determining when a suspect's previously-invoked right to silence had been \"scrupulously honored,\" we nevertheless are convinced that our establishment of a \"bright-line\" minimum requirement of renewed warnings for determining when that right has not been scrupulously honored not only is sound as a matter of New Jersey common law but is also consistent with the spirit of the Supreme Court's decisions and hence with the federal law as we understand it.\n\nMoreover, even absent the \"bright-line\" rule that we adopt today -- namely, a previously-invoked right to silence is not scrupulously honored in the absence of, at the least, fresh Miranda warnings -- the circumstances surrounding the taking of the first statement by FBI agents were such that it is highly unlikely that that statement could have been admitted under any standard, including the \"totality of the circumstances\" test used by some courts. See supra at 266. Were that test to guide our decision, we would narrow our focus to the conduct of agent Frieberg, for it is he who overcame defendant's previously-expressed refusal to speak to the FBI representatives. With all due respect to Justice Stein's thoughtful dissent, we are unpersuaded by its characterization of Frieberg's statement as no more than a reacknowledgement to Hartley of \"the continued availability\" of his right to remain silent. Post at 318. In no way did Frieberg refer even inferentially to any of defendant's rights. His remarks amounted to nothing less\n\nthan a pressure-laden expression of his desire to get defendant to talk. It did not even purport to be a request, inasmuch as it was couched not in the form of a question or even an entreaty, but rather in the form of the agent's advice to defendant -- \"I would like you to reconsider and now is the time if you are going to make a statement. Now is the time to do it. ' (Emphasis added.)\n\nAs important as the events following Frieberg's approach to Hartley, after defendant had invoked his right to silence, is the sense of urgency and pressure that attended those events. At 10:43 a.m., when the federal interrogation commenced, the federal authorities were \"waiting for a call from the Eastern District pertaining to [defendant's] arraignment.\" It was in that context that Frieberg told Hartley that \"now is the time\" to make a statement. And Frieberg was aware, as he testified, that\n\nthe federal law * * * dealing with speedy arraignments [is] very speedy, particularly in the Eastern District of New York. In my limited experience with the Eastern District of New York, the burden on the government is tremendous in terms of moving the process along. The Brooklyn Office particularly is extremely aware of that situation.\n\nQ You received instructions from your superior to get the defendant transported to this arraignment without delay?\n\nA Without delay.\n\nQ Under the federal law, or at least as far as you know, what is the sanction imposed for failing to arraign a defendant within the appropriate time period?\n\nA You lose the case.\n\nQ A dismissal?\n\nA Dismissal.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nThe federal people apparently communicated to the New Jersey authorities this same sense of the need to rush, for as Atlantic City Detective Mason testified, he did not conduct his interrogation in question-and-answer form because the FBI agents told him that \"they had to take [defendant] away and I only had a limited time to get a statement from him.\" According to Sergeant Toulon of the New York City Police Department, who was in the room during Mason's interrogation of Hartley, the interview was \"rather quick. * * * We were pressured for time. * * * Sir, we only had, I would say, approximately about five minutes * * * [b]ecause we were being pressed * * *.\" According to Toulon, before the New Jersey authorities even started their interrogation, \"[w]e were informed that the Eastern District Court had called, that the federal office -- that agents requested that they dispatch the defendant to their court immediately.\"\n\nWhen agent Frieberg's twice-imparted \"now is the time\" advice is viewed in the context of the foregoing, it is apparent that the \"time\" to which he made reference surely could not have been a \"good\" time or a \"right\" time for Hartley, although that is ostensibly the sense of the statement. Rather, it was the \"time\" that was swiftly running out on Frieberg before the fast-approaching arraignment could abruptly interrupt this phase of the investigation and itself trigger an additional sixth-amendment right to counsel. See, e.g., Moore v. Illinois, 434 U.S. 220, 226-27, 98 S. Ct. 458, 463-64, 54 L. Ed. 2d 424, 432-33 (1977); Fourteenth Annual Review of Criminal Procedure: United States Supreme Court and Courts of Appeals 1983-1984, 73 Geo.L.J. 253, 375-76 (1984).\n\nThe record speaks loudly, and speaks in the form of testimony of the State's own witnesses, of the authorities' impatience to nail down the joint investigation with defendant's confession\n\n-- an understandable, even laudable, impulse, but one whose exercise in the context of this case was not consistent with scrupulous observance of defendant's rights. So threatening, or misleading, was the burden of Frieberg's counsel to Hartley (abandon your determination to remain silent and, now or never, speak), that the non-observance -- to say nothing of a non-scrupulous observance -- of defendant's previously-asserted right to silence is a most likely, if not inescapable, conclusion.\n\nIV\n\nHaving determined that Hartley's previously-asserted right to silence was not scrupulously honored, by virtue of both the bright-line rule and the factual complex, we turn to the important question of what consequences flow from that circumstance. The answer turns in part on how we characterize the failure scrupulously to honor defendant's express resolve not to make a statement: is it to be viewed as a violation merely of Miranda 's prophylactic rules, or is it rather a clear violation of the right against compulsory self-incrimination as such, and hence a \"constitutional\" violation? As previously announced, supra at 256-257, we conclude that the failure scrupulously to honor an accused's previously-asserted right to silence amounts to a constitutional violation and a violation of the state common-law privilege against self-incrimination, and any inculpatory statement made in the absence of fresh warnings must be deemed to have been unconstitutionally and illegally obtained as a matter of law.\n\nContrary to Justice Handler's assertion, post at 294, we do not blur \"the distinctive lines between constitutional and non-constitutional violations.\" We recognize those lines and grasp full well the distinction drawn by Justice Rehnquist for the Court in Michigan v. Tucker, 417 U.S. 433, 94 S. Ct. 2357, 41 L. Ed. 2d 182 (1974), between on the one hand police conduct that directly infringes on an accused's right against compulsory self-incrimination, and on the other a violation only of the \"prophylactic\n\nrules developed to protect that right,\" id. at 439, 94 S. Ct. at 2361, 41 L. Ed. 2d at 190. The Supreme Court has made it abundantly clear that under its current formulation of the Miranda doctrine, a failure to administer Miranda warnings does not itself \"breed the same irremediable consequences as police infringement of the Fifth Amendment itself.\" Oregon v. Elstad, supra, 470 U.S. at , 105 S. Ct. at 1293, 84 L. Ed. 2d at 232. See infra at 276.\n\nWe perceive a qualitative difference between a failure to administer Miranda warnings in the first place, and a failure to honor, after they have been asserted, the constitutional rights that those warnings are designed to secure. In the former instance the police conduct, standing alone and unaccompanied by any oppressive acts of coercion or intimidation, does not inevitably demonstrate an undermining of the in-custody suspect's ability to exercise his free will. Put differently, the statement produced by an unwarned in-custody interrogation may be voluntary despite the absence of Miranda warnings. See Michigan v. Tucker, supra, 417 U.S. at 445, 94 S. Ct. at 2364, 41 L. Ed. 2d at 193. Although the unwarned confession must be suppressed under the force of Miranda 's irrebuttable presumption of compulsion, the violation of Miranda 's dictates is not in that instance of constitutional dimension. Id. at 445-46, 94 S. Ct. at 2364-65, 41 L. Ed. 2d at 193-94.\n\nOn the other hand, once the suspect has received his Miranda warnings and, as did Hartley, he determines to exercise his fifth-amendment privilege to remain silent, a different set of considerations comes into play. Miranda itself points to this conclusion through its explication of the purpose of prophylactic rules:\n\n[W]ithout proper safeguards the process of in-custody interrogation of persons suspected or accused of crime contains inherently compelling pressures which work to undermine the individual's will to resist and to compel him to speak where he would not otherwise do so freely. In order to combat these pressures and to permit a full opportunity to exercise the privilege against self-incrimination, the accused must be adequately and effectively apprised of\n\nhis rights and the exercise of those rights must be fully honored. [384 U.S. at 467, 86 S. Ct. at 1624, 16 L. Ed. 2d at 719.]\n\nThe plain implication of the foregoing passage is that the suspect must be afforded unimpeded access to the Constitution. As Justice Handler wrote for a unanimous Court in State v. Kennedy, supra, \"the pivotal consideration in making the constitutional inquiry is whether, upon being advised of his rights, defendant indicated that he wanted the assistance of counsel with respect to the particular charge in question, and whether he wanted to have counsel available or present before any further interrogation.\" 97 N.J. at 287 (emphasis added). Therefore, if after a suspect avails himself of the Constitution's protections the police violate a right that has been invoked, that violation, by definition, is of constitutional magnitude. Again, Miranda itself could scarcely be clearer in that regard, when it instructs us that when an in-custody suspect announces his wish to remain silent, he has shown at that point that\n\nhe intends to exercise his Fifth Amendment privilege; and a statement taken after the person invokes his privilege cannot be other than the product of compulsion, subtle or otherwise. [384 U.S. at 474, 86 S. Ct. at 1628, 16 L. Ed. 2d at 723.]\n\nSee also Wainwright v. Greenfield, 474 U.S. , , 106 S. Ct. 634, 639, 88 L. Ed. 2d 623, 631 (1986) (invocation of the right to silence after Miranda warnings is of \"constitutional dimension\").\n\nOur confidence that we have read Miranda correctly in the foregoing respects is borne out by the Supreme Court's treatment of Miranda 's progeny, see Michigan v. Jackson, supra, 475 U.S. , 106 S. Ct. 1404, 89 L. Ed. 2d 631; Oregon v. Elstad, supra, 470 U.S. 298, 105 S. Ct. 1285, 84 L. Ed. 2d 222; Edwards v. Arizona, 451 U.S. 477, 101 S. Ct. 1880, 68 L. Ed. 2d 378, reh'g denied, 452 U.S. 973, 101 S. Ct. 3128, 69 L. Ed. 2d 984 (1981).\n\nIn Edwards v. Arizona, supra, the Supreme Court held that an in-custody accused who has sought refuge in his constitutionally-guaranteed right to deal with the police only through counsel cannot be interrogated by the authorities until counsel\n\nhas been afforded him unless the accused himself initiates further conversations with the police. 451 U.S. at 484-85, 101 S. Ct. at 1884-85, 68 L. Ed. 2d at 386-87. Any statement obtained in violation of that proscription is inadmissible by virtue of the fifth and fourteenth amendments' prohibition against compelled self-incrimination, id. at 481, 101 S. Ct. at 1883, 68 L. Ed. 2d at 384 -- plainly a constitutional violation (not a mere stumbling over Miranda 's \"prophylactic rules,\" as Justice Handler's bracketed invention of Edwards ' text, post at 292 n. 1 would have it), and this in the face of the trial court's specific conclusion that the confession at issue in that case was \"voluntary.\" Id. at 483, 101 S. Ct. at 1884, 68 L. Ed. 2d at 385.\n\nMore recently, the Supreme Court again made the distinction to which we advert, this time quite explicitly, in Oregon v. Elstad, supra, 470 U.S. 298, 105 S. Ct. 1285, 84 L. Ed. 2d 222. That decision takes on considerable significance in the context of this case, wherefore it warrants extended discussion, both here and in part V.\n\nIn Elstad the defendant made a statement to a police officer who had gone to defendant's home for the purpose of arresting him. The officer, without giving Miranda warnings, told Elstad that he thought Elstad was involved in a certain robbery. Elstad stated, \"Yes, I was there.\" The defendant was transported to the Sheriff's headquarters, where full Miranda warnings were given, and he then gave a full confession. The Oregon Court of Appeals found that the coercive impact of the unwarned statement was not shown to have dissipated, and so the subsequent confession was inadmissible because it was the \"fruit of the poisonous tree.\" State v. Elstad, 61 Or.App. 673, 677, 658 P. 2d 552, 554, review denied, 295 Or. 617, 670 P. 2d 1033 (1983), rev'd sub nom. Oregon v. Elstad, supra, 470 U.S. 298, 105 S. Ct. 1285, 84 L. Ed. 2d 222.\n\nThe Supreme Court ruled that the Oregon court had applied the wrong standard. The Court observed that the \"fruit of the poisonous tree\" test, discussed infra at 282,\n\nis applicable only when there has been a constitutional violation, 470 U.S. at , 105 S. Ct. at 1291, 84 L. Ed. 2d at 230, and that a violation of Miranda 's procedural rules does not rise to the level of a constitutional violation. \"The failure of police to administer Miranda warnings does not mean that the statements received have actually been coerced * * *.\" Id. at , 105 S. Ct. at 1294, 84 L. Ed. 2d at 233. Miranda established a prophylactic rule. Failure to warn as required by Miranda creates a presumption of compulsion, which is irrebuttable only as regards use of the unwarned statement in the prosecutor's case in-chief. (For example, an unwarned statement may be used to impeach. Harris v. New York, 401 U.S. 222, 91 S. Ct. 643, 28 L. Ed. 2d 1 (1971).) The Miranda exclusionary rule \"may be triggered even in the absence of a Fifth Amendment violation.\" Elstad, supra, 470 U.S. at , 105 S. Ct. at 1292, 84 L. Ed. 2d at 230. Although the Court stated that a Miranda violation creates a presumption of compulsion, id. at , 105 S. Ct. at 1292, 84 L. Ed. 2d at 231, it concluded that it was \"beyond dispute\" that Elstad 's earlier remark was \"voluntary, within the meaning of the Fifth Amendment.\" Id. at , 105 S. Ct. at 1296, 84 L. Ed. 2d at 236. \"Neither the environment nor the manner of either 'interrogation' was coercive. The initial conversation took place at midday, in the living room area of respondent's own home, with his mother in the kitchen area, a few steps away.\" Id.\n\nThe Court repeatedly distinguished between, on the one hand, a violation of Miranda 's prophylactic, procedural requirements and, on the other hand, constitutional violations. It observed that the Oregon Court of Appeals had mistakenly assumed \"that a failure to give Miranda warnings necessarily breeds the same consequences as police infringement of a constitutional right.\" Id. at , 105 S. Ct. at 1290, 84 L. Ed. 2d at 229. In comparing Elstad to Michigan v. Tucker, supra, 417 U.S. 433, 94 S. Ct. 2357, 43 L. Ed. 2d 182, Justice O'Connor pointed out that \"the breach of the Miranda procedures [in both cases] involved no actual compulsion.\" 470 U.S. at , 105 S. Ct. at\n\n1293, 84 L. Ed. 2d at 231. The Court emphasized that mere errors \"in administering the prophylactic Miranda procedures * * * should not breed the same irremediable consequences as police infringement of the Fifth Amendment itself,\" id. at , 105 S. Ct. at 1293, 84 L. Ed. 2d at 232, and that \"a suspect who has once responded to unwarned yet uncoercive questioning is not thereby disabled from waiving his rights and confessing after he has been given the requisite Miranda warnings.\" 470 U.S. at , 105 S. Ct. at 1298, 84 L. Ed. 2d at 238. It is of surpassing importance for today's purposes, however, to recognize that in reaching that conclusion, the Court took pains to distinguish Elstad from cases \"concerning suspects whose invocation of their rights to remain silent and to have counsel present were flatly ignored while police subjected them to continued interrogation.\" Id. at n. 3, 105 S. Ct. at 1296 n. 3, 84 L. Ed. 2d at 234-35 n. 3; see also id. at n. 28, 105 S. Ct. at 1313, 84 L. Ed. 2d at 256 n. 28 (Brennan, J., dissenting) (elaborating on the same point). Presumably Justice O'Connor had in mind cases similar to the one before us, such as United States ex rel. Sanders v. Rowe, supra, 460 F. Supp. at 1137 (failure scrupulously to honor defendant's previously invoked right to counsel was \"constitutional error;\" subsequent confessions given after Miranda warnings inadmissible); State v. Ayers, Me., 433 A.2d 356, 362 (obtaining confession after suspect has asserted right to cut off questioning amounts to \"violation of [suspect's] constitutional rights.\").\n\nFinally, Michigan v. Jackson, supra, is important not only for its reaffirmation of the constitutional basis of the Edwards holding, 475 U.S. at , 106 S. Ct. at 1405, 89 L. Ed. 2d at 636, but also for its own constitutionally-based holding. In Jackson, the authorities' disregard of defendants' assertions at arraignment of their right to counsel led the Court to hold that the \"postarraignment confessions were improperly obtained -- and the Sixth Amendment violated * * *.\" Id. at , 106 S. Ct. at 1406, 89 L. Ed. 2d at 636. There is therefore no basis whatsoever for Justice Handler's assertion, post at 292 n. 1, that\n\nthe offensive action condemned in Jackson \"arguabl[y] * * * does not rise to the level of a constitutional violation but simply violates the ancillary principles of Miranda.\"\n\nAlthough both Edwards and Jackson are \"right to counsel\" rather than \"right to silence\" cases in the mold of Mosley and the case before us, we are satisfied that the principles of the cases are readily transferable -- that is, a failure scrupulously to honor an asserted right to silence is as much a constitutional violation as is a failure to honor a previously-invoked right to counsel. True, there is a difference in the tests to determine when the asserted right has been honored -- under Edwards and Jackson, once the accused requests counsel, there can be no interrogation, absent initiation by the accused, in the absence of counsel, whereas under our holding today, and our reading of Mosley, the minimum requirement for the scrupulous honoring of a suspect's previously-invoked right to silence is the readministering of the Miranda warnings. But once it has been determined that there has been a failure to honor the previously-invoked right in either instance, the resultant violation cannot be anything other than a constitutional infringement. See State v. Blevins, 108 Id. 239, 243, 697 P. 2d 1253, 1257 (Ct.App. 1985). (\"[B]oth [ Edwards and Mosley ] strive to ensure that the suspect who invoked his rights will be free from coercive attempts to change his mind. The analytical frameworks vary, not because the value or importance of the rights is different, but because the realities of implementing them are not the same.\" (Citation omitted)). And needless to say -- needless, that is, except for Justice Stein's pronouncement to the contrary, post at 317 -- an assessment of defendant's waiver following non-observance of his previously-asserted constitutional right is no more appropriate in the right-to-silence context than in a right-to-counsel case. In both instances the validity of the waiver would depend on whether the asserted right had been scrupulously honored; in neither case would a waiver analysis reveal whether the \"bright line\" rule had been observed. A waiver analysis would no more test a police officer's compliance\n\nwith the Mosley requirement of rewarning than with the Edwards requirement that renewed communication be initiated by the accused.\n\nNumerous other courts applying Mosley have come to the same conclusion that we reach today, namely, that the failure to honor a defendant's asserted privilege to remain silent violates his fifth-amendment rights. See United States v. Suggs, 755 F.2d 1538, 1541 (11th Cir.1985) (statement inadmissible as violative of fifth and sixth amendments if made in response to any kind of interrogation after defendant stated his desire to remain silent); Anderson v. Smith, 751 F.2d 96, 102 (2d Cir. 1984) (asking defendant why he was refusing to talk violated his right to remain silent and court was required to determine whether admission of statement was harmless constitutional error); Robinson v. Percy, supra, 738 F.2d at 220 (questions after invocation of right to remain silent violated defendant's fifth-amendment rights); Toliver v. Gathright, 501 F. Supp. 148, 150 (E.D.Va.1980) (admission into evidence of confession obtained in response to interrogation after defendant invoked right to silence violated his constitutional privilege against self-incrimination).\n\nIn view of the foregoing persuasive authority we are convinced that the failure to honor a previously-invoked right to silence smacks so inherently of compulsion that any statement following that failure is involuntary by definition. So here, FBI agent Frieberg's failure to readminister Miranda warnings was a violation of the obligation scrupulously to honor Hartley's asserted right to silence, and therefore amounted to a violation of defendant's fifth-amendment and state common-law right not to be compelled to be a witness against himself.\n\nV\n\nTo recapitulate our holdings thus far: (1) failure to readminister Miranda warnings before interrogating an accused who has previously invoked the right to silence will invariably result\n\nin a finding that the right has not been \"scrupulously honored\"; and (2) any statement thus obtained is unconstitutionally compelled, and hence inadmissible, as having been obtained in violation of the fifth amendment and of the state common-law right against self-incrimination. We turn now to the issue of the admissibility of the second statement, the one given to state authorities after the \"federal\" statement -- here declared to have been compelled -- but this one, unlike the first, preceded by fresh Miranda warnings. We conclude that this second statement too was inadmissible.\n\nThere are two approaches to the problem. The first reaches the conclusion that the process that produced the second statement was so inextricably entwined with the first interrogation procedure as to be part of that same procedure. The second treats the interrogations as separate.\n\nAs we have indicated, supra at 259-260, following the FBI interrogation Hartley was questioned by Atlantic City Detective Mason after defendant was given fresh Miranda warnings by Atlantic County Criminal Investigator Barnett. Two New York City police officers, Detective Carlos Toulon and Sergeant Lyle Foster, were likewise present (Toulon \"distinctly recall[ed]\" that FBI agent Rodney Davis was also in the room). Barnett, Mason, Toulon, and Foster had arrived with the FBI agents at defendant's apartment that morning and had participated in the search of the premises. The \"state\" interrogation took place in the same room in which Hartley had just undergone questioning by the same FBI agents who had executed the warrants at defendant's apartment.\n\nAlthough the State treats the two interviews as separate and distinct, it is apparent that they comprise a single continuing event, inasmuch as to a considerable extent they overlapped. The FBI interview log shows that the federal authorities' interview ended at 12:57 p.m., after which defendant underwent additional fingerprinting, described by agent Frieberg as \"a rather lengthy process due to the fact that this was a joint\n\ninvestigation.\" At 1:17 p.m. defendant was transported to his arraignment. Frieberg did not witness the unsigned FBI statement, but two other agents signed it as witnesses at 1:17 p.m. Atlantic City Detective Mason's typed version of the \"second\" interview sets forth the time as \"1:10 P.M.\" at the top of the first page. According to this statement, the interview was interrupted by FBI agent Robley, who stated that Hartley had to leave for arraignment, and the interview was thereupon concluded at 1:33 p.m. Whether the FBI's typewritten statement was presented while defendant was undergoing the second interrogation is not certain from the record. It is obvious, though, that at the very least the second interview followed so closely on the heels of the first as to be part and parcel of it, and hence to be burdened with the same constitutional infirmities. See Westover v. United States, 384 U.S. 436, 86 S. Ct. 1602, 16 L. Ed. 2d 694 (1966); Leyra v. Denno, 347 U.S. 556, 74 S. Ct. 716, 98 L. Ed. 948 (1954); cf. People v. Washington, 127 Misc. 2d 451, 486 N.Y.S. 2d 660 (Sup.Ct.1985) (dictum to the same effect).\n\nIn Westover, decided with Miranda, the defendant was interrogated by local police officers while in custody for over fourteen hours. FBI agents then advised Westover of his rights and began interrogating him about a different crime. The Supreme Court held that the later warning was insufficient to protect Westover's privilege against self-incrimination. The Court said:\n\nAlthough the two law enforcement authorities are legally distinct and the crimes for which they interrogated Westover were different, the impact on him was that of a continuous period of questioning.\n\nWe do not suggest that law enforcement authorities are precluded from questioning any individual who has been held for a period of time by other authorities and interrogated by them without appropriate warnings. A different case would be presented if an accused were taken into custody by the second authority, removed both in time and place from his original surroundings, and then adequately advised of his rights and given an opportunity to exercise them. But here the FBI interrogation was conducted immediately following the state interrogations in the same police station -- in the same\n\ncompelling surroundings. Thus, in obtaining a confession from Westover the federal authorities were the beneficiaries of the pressure applied by the local in-custody interrogation. [384 U.S. at 496-97, 86 S. Ct. at 1639, 16 L. Ed. 2d at 736 (emphasis added).]\n\nBut for the fact that Westover was held for fourteen hours and Hartley for five or so hours, and the Westover case deals with the problem of unwarned statements rather than a failure to honor the invocation of the right to silence, the cases have strikingly similar fact patterns.\n\nIn Leyra v. Denno, supra, 347 U.S. 556, 74 S. Ct. 716, 98 L. Ed. 948, the defendant made two confessions immediately after confessing to a psychiatrist under coercive conditions. The Supreme Court held that all the confessions were inadmissible because the relation of the confessions was so close that one must say the facts of one controlled the character of the other; they were all parts of one continuous process. In a recent New York case the same principle was espoused. \"An otherwise admissible statement may be suppressed if it constitutes part of a continuous interrogation initiated by improper questioning or other wrongful acts or omissions by law enforcement officers.\" People v. Washington, supra, 127 Misc. 2d 451, 486 N.Y.S. 2d 660 (no continuous interrogation found when three hours passed after defendant confessed while in an intoxicated condition and defendant had slept in the interim between confessions). As we have seen, the federal-state interrogations in the case before us were likewise continuous.\n\nBut even if we treat the interrogation processes as separate and distinct, the result remains that the second statement is inadmissible. Under this approach the admissibility of the \"state\" confession depends in the first instance on how the first, or \"federal,\" statement is characterized. If, as we have determined to be the case, the obtaining of the FBI statement amounted to a constitutional violation and a deprivation of the state common-law right against self-incrimination, thus rendering it unconstitutionally compelled and, under state law, illegally obtained, and hence inadmissible, any \"separately-obtained\"\n\nsecond statement must be approached with an eye to determining whether it was the product of a constitutional violation, sometimes known as the \"fruit of the poisonous tree\" doctrine. See Brown v. Illinois, 422 U.S. 590, 95 S. Ct. 2254, 45 L. Ed. 2d 416 (1975); Wong Sun v. United States, 371 U.S. 471, 83 S. Ct. 407, 9 L. Ed. 2d 441 (1963); State v. Barry, 86 N.J. 80, 87, cert. denied, 454 U.S. 1017, 102 S. Ct. 553, 70 L. Ed. 2d 415 (1981); State v. Elmore, 205 N.J. Super. 373 (App.Div.1985). The second confession would be the \"fruit\" of the first if, after being warned, Hartley gave the second statement because of a feeling that \"the cat is already out of the bag\":\n\nOf course, after an accused has once let the cat out of the bag by confessing, no matter what the inducement, he is never thereafter free of the psychological and practical disadvantages of having confessed. He can never get the cat back in the bag. The secret is out for good. In such a sense, a later confession always may be looked upon as fruit of the first. [ United States v. Bayer, 331 U.S. 532, 540, 67 S. Ct. 1394, 1398, 91 L. Ed. 1654, 1660 (1947).]\n\nSee also Darwin v. Connecticut, 391 U.S. 346, 350, 88 S. Ct. 1488, 1490, 20 L. Ed. 2d 630, 634 (1968) (Harlan, J., concurring) (\"A principal reason why a suspect might make a second or third confession is simply that, having already confessed once or twice, he might think he has little to lose by repetition.\").\n\nThe Supreme Court addressed these related doctrines in Oregon v. Elstad, supra, 470 U.S. 298, 105 S. Ct. 1285, 84 L. Ed. 2d 222. Because there was no actual infringement of the suspect's constitutional rights in Elstad, any more than there had been in Tucker, the case was not controlled by Wong Sun 's doctrine that the fruits of a constitutional violation must be suppressed. 470 U.S. at , 105 S. Ct. at 1292, 84 L. Ed. 2d at 231.\n\nAs now becomes obvious, the difference between Elstad and the case before us takes on critical importance. In Elstad the failure to have furnished the accused with his Miranda warnings resulted in exclusion of only his unwarned statement. Because that statement was indisputably voluntary, a subsequent confession was untainted. There having been no constitutional violation in connection with the obtaining of the first\n\nstatement, the second statement could not be perceived as the fruit of a constitutional violation, and it was therefore admissible. In contrast, we have held, following Mosley, that the FBI's failure scrupulously to honor Hartley's previously-invoked right to silence was a violation of constitutional magnitude, and the federal statement is deemed to have been unconstitutionally and illegally (under state law) compelled. As Elstad now makes clear, that circumstance triggers the \"fruit of the constitutional violation\" doctrine. See, e.g., United States v. Wauneka, 770 F.2d 1434 (9th Cir.1985) (discussing Elstad); State v. Madruga-Jiminez, 485 So. 2d 462, 465-66 (Fla.Dist.Ct.App.1986).\n\nPursuant to that doctrine generally, the admissibility of the second or \"state\" confession would be determined by whether the prosecution could establish either that the \"state\" statement was not the product of the first or \"federal\" statement, or that the \"taint\" of the first statement was attenuated. See State v. Barry, supra, 86 N.J. at 87; Brown v. Illinois, supra, 422 U.S. at 604, 95 S. Ct. at 2262, 45 L. Ed. 2d at 427; United States ex rel. Sanders v. Rowe, supra, 460 F. Supp. 1128, 1137. Factors relevant to this determination include the time between confessions, any intervening circumstances, whether there was a change in place, whether defendant received an adequate warning of his rights, whether the defendant initiated the second confession, the effect of his having previously made a confession, and the \"purpose and flagrancy of police misconduct.\" Brown v. Illinois, supra, 422 U.S. at 603-04, 95 S. Ct. at 2261-62, 45 L. Ed. 2d at 427; Robinson v. Percy, supra, 738 F.2d at 221 (citing Holleman v. Duckworth, 700 F.2d 391, 396 (7th Cir.) cert. denied, 464 U.S. 834, 104 S. Ct. 116, 78 L. Ed. 2d 116 (1983)); United States v. Wauneka, supra, 770 F.2d 1434.\n\nThe foregoing are ordinarily viewed as questions of fact, to be determined by a trial court after a hearing. And ordinarily a remand for the purpose of conducting such a hearing and\n\nmaking findings of fact and conclusions of law would be in order. In this case, however, that step is unnecessary, for we are satisfied, on the basis of our careful appraisal of the full and complete record before us, that the second statement, coming as it did on the heels of -- if not in tandem with -- the first, unconstitutionally-obtained, compelled statement, was unavoidably tainted. The most generous and indulgent view of the record cannot generate a conclusion of sufficient attenuation between the first and second interrogations to dissipate the taint. The second statement, chameleon-like, retains the coloration of the first as a matter of law, and hence must itself be deemed to have been unconstitutionally compelled.\n\nUnder either view of the second or \"state\" statement -- whether seen as produced by the same interrogation process as the first, or, even though separate, as tainted by the first -- it is inadmissible.\n\nVI\n\nWe base the holdings of this case not only on our understanding of federal constitutional law, but on our state common-law privilege against self-incrimination as well. See supra at 256, 267, 271, 277, 278, 281, 282. While it is our view that either ground would be sufficient, we are compelled by principles of sound jurisprudence to rest our decision on both.\n\nAs for the federal law, we believe that were the questions before us squarely presented to the Supreme Court, its decision would be the same as ours. All the signposts point in that direction, and we have sought to follow them faithfully, not to write new law. The fact remains, however, that the Supreme Court has not ruled squarely on the issue before us of whether the circumstances attending the obtaining of the \"federal\" statement amounted to a failure scrupulously to honor defendant's previously-asserted right to remain silent, with the result that that statement must be deemed to have been unconstitutionally compelled. In respect of federal constitutional law,\n\ntherefore, ours is a predictive exercise, one conducted on the basis of our best understanding of the authorities, but nonetheless predictive. We think our reading of the federal law is right. We acknowledge that it may be wrong. Given the importance of the question involved, we see our duty to settle it as a matter of state law.\n\nThe necessity for our giving guidance to our own law-enforcement officials cannot be underestimated. We are faced with a situation similar to that presented in State v. Deatore, 70 N.J. 100 (1976). When we decided that case, the United States Supreme Court had not yet ruled on whether a defendant's post-arrest silence could be used on cross-examination to undercut an \"alibi\" defense. Recognizing the importance of this issue to our state's criminal justice system, as well as the confusing \"disarray in decisional treatment of the question,\" we ruled as a matter of state law that such cross-examination was improper. 70 N.J. at 112. Our concern with the effective administration of our state criminal-justice system has led us in other circumstances to create or enforce criminal defendants' rights under our supervisory power, N.J. Const. of 1947 art. VI, ยง 2, para. 3, when the scope of federal constitutionally-required protection was unclear. See, e.g., State v. Gregory, 66 N.J. 510 (1975) (adopted \"same transaction,\" compulsory-joinder rule to prevent double jeopardy); Rodriguez v. Rosenblatt, 58 N.J. 281 (1971) (indigent defendants not to be subjected to conviction entailing imprisonment or other consequence of magnitude without first having had fair opportunity to have counsel appointed). Similarly, in non-criminal contexts we have rested decisions dealing with important personal rights alternatively on state and federal grounds. E.g., In re Quinlan, 70 N.J. 10, 40, cert. denied sub nom. Garger v. New Jersey, 429 U.S. 922, 97 S. Ct. 319, 50 L. Ed. 2d 289 (1976).\n\nMoreover, we would be remiss were we to rest our decision exclusively on federal grounds when alternative state grounds exist. Failure to set forth clearly the independent state-law basis for a decision in a case in which federal constitutional law\n\nis also involved can lead to needless review in the United States Supreme Court, and could in fact require, in some cases, subsequent redundant proceedings in our own courts. Such a disregard for concerns of judicial economy has been criticized, Massachusetts v. Upton, 466 U.S. 727, 735-39, 104 S. Ct. 2085, 2089-91, 80 L. Ed. 2d 721, 728-31 (1984) (Stevens, J., concurring). We heed that criticism today by stating expressly that our decision, which we view as consistent with federal fifth-amendment cases, is based alternatively \"on bona fide separate, adequate, and independent grounds.\" Michigan v. Long, 463 U.S. 1032, 1041, 103 S. Ct. 3469, 3476, 77 L. Ed. 2d 1201, 1214 (1983).\n\nThe privilege against self-incrimination has been an integral thread in the fabric of New Jersey common law since our beginnings as a state. State v. Fary, 19 N.J. 431, 435 (1955); see also State v. Zdanowicz, 69 N.J.L. 619, 622 (E. \u0026 A. 1903) (\"Although we have not deemed it necessary to insert in our constitution this prohibitive provision, the common law doctrine, unaltered by legislation or by lax practice, is by us deemed to have its full force. In New Jersey, no person can be compelled to be a witness against himself.\"). The voluntariness of confessions has consistently been tested in this state under common-law principles, albeit principles often expanded or altered in response to federal constitutional decisions. State v. Smith, 32 N.J. 501, 542 (1960), cert. denied, 364 U.S. 936, 81 S. Ct. 383, 5 L. Ed. 2d 367 (1961).\n\nThe existence of independent state grounds for our decision should not, however, preclude reliance on United States Supreme Court precedent when federal-constitutional rights are implicated, as in the instant case, and the bulk of decisional law in the area is federal. To the extent that we rely on federal precedent in reaching our state-law decision, we do so only for the purpose of guidance, recognizing that those precedents may not compel the result that we reach today. See Michigan v. Long, supra, 463 U.S. at 1041, 103 S. Ct. at 3476, 77 L. Ed. 2d at 1214.\n\nVII\n\nOur holdings are consistent with the very essence of the privilege against self-incrimination. The Supreme Court stated in Miranda that\n\nthe privilege against self-incrimination -- the essential maintenance of our adversary system -- is founded on a complex of values. All these policies point to one overriding thought: the constitutional foundation underlying the privilege is the respect a government -- state or federal -- must accord to the dignity and integrity of its citizens. * * * In sum, the privilege is fulfilled only when the person is guaranteed the \"right to remain silent unless he chooses to speak in the unfettered exercise of his own will.\" [ Miranda, supra, 384 U.S. at 460, 86 S. Ct. at 1620, 16 L. Ed. 2d at 715 (citations omitted).]\n\nTo accord this governmental respect \"to the dignity and integrity of its citizens\" that is the foundation of this fifth-amendment privilege, as well as of our own common-law rule, law-enforcement authorities must cease interrogation of a suspect on his request and cannot resume until a new set of warnings has been given, to impress upon the accused that his right to remain silent is still in effect and that he need not speak unless it be by his own desire. The benefit of this \"bright-line\" rule is that it will protect the rights of a defendant and, at the same time, be easy for the police to implement. The rule that we announce today will no more hinder the difficult, critically-important business of law-enforcement than did the rule that the Supreme Court laid down in Miranda, supra, 384 U.S. at 481, 86 S. Ct. at 1631, 16 L. Ed. 2d at 727.\n\nThe exclusion of an illegally procured confession and of any testimony obtained in its wake deprives the Government of nothing to which it has any lawful claim and creates no impediment to legitimate methods of investigating and prosecuting crime. [ Harrison v. United States, 392 U.S. 219, 224 n. 10, 88 S. Ct. 2008, 2011 n. 10, 20 L. Ed. 2d 1047, 1052 n. 10 (1968).]\n\nOur aim today is to fashion requirements that will guarantee protection of the right against self-incrimination, that are easy to observe, and that will produce clear and consistent results in cases to follow.\n\nThe judgment of conviction is reversed and the cause remanded for retrial.\n\nHANDLER, J., concurring in the result and dissenting in part.\n\nHANDLER, J., concurring in part and dissenting in part.\n\nIn this case the defendant incriminated himself by twice confessing. Both confessions were used as evidence to support his criminal conviction. The first confession was elicited after defendant was subjected to renewed custodial interrogation, notwithstanding the fact that he had previously claimed his right to remain silent in response to earlier Miranda warnings. The second confession quickly followed the first, when he was again interrogated by a different group of law enforcement officers, who had readministered Miranda warnings.\n\nThe resumption of custodial interrogation, which led to the initial confession, unquestionably amounted to a failure by law enforcement authorities to \"scrupulously honor\" defendant's claimed right to remain silent. The fundamental issue posed by these events concerns the nature and extent of remedial relief that is necessary to rectify a violation of the \"scrupulously honored\" requirement. This entails determining not only the propriety of excluding or limiting the evidentiary use of the first confession but also whether the second confession must be similarly restricted as evidence solely because of the derivative effects of the unlawfully obtained initial confession.\n\nI.\n\nAs recounted in the Court's opinion, defendant Hartley was arrested, and, while in custody, he was given Miranda warnings. Acting upon these warnings, he unequivocally exercised his right to remain silent. Thereafter, without readministering Miranda warnings, FBI Agent Frieberg initiated a conversation\n\nwith Hartley, which uncontrovertibly amounted to a resumption of interrogation. As a result of this renewed interrogation, defendant confessed.\n\nIn focusing initially upon this series of events, -- those related to defendant's first confession -- the majority posits the \"scrupulously honored\" standard as the operative measure of the defendant's constitutional interest. It observes that Miranda v. Arizona, 384 U.S. 436, 86 S. Ct. 1602, 16 L. Ed. 2d 694 (1966), \"appears to contain a clear requirement that 'the interrogation must cease' when the suspect asserts his right to remain silent.\" Ante at 263. The majority then engages in an analysis consistent with Michigan v. Mosley, 423 U.S. 96, 96 S. Ct. 321, 46 L. Ed. 2d 313 (1975), conditioning \"the admissibility of statements obtained after the person in custody has decided to remain silent . . . on whether his 'right to cut off questioning' was 'scrupulously honored.'\" Id. at 104, 96 S. Ct. 321, 46 L. Ed. 2d at 321. Ante at 263-267.\n\nThe majority correctly notes that the legal analysis occasioned by the facts of this case is complicated by the omission from Mosley of any guidelines to be applied in order to assure that an accused's claimed right to remain silent is \"scrupulously honored.\" See discussion ante at 265-267. Notwithstanding this absence of clarity, I am confident that the majority's review of the fact-sensitive approach taken by the Supreme Court in the context of its \"scrupulously honored\" test justifies the standard that it adopts. That standard mandates that fresh Miranda warnings be administered prior to the resumption of any interrogation following an accused's exercise of his right to remain silent. I also endorse the primary remedial consequence posited by the majority for the failure to meet this standard: \"Unless the police follow this 'bright-line,' inflexible, minimum requirement, a defendant's statement made in the above-stated circumstances cannot be admitted into evidence as part of the prosecutor's case in-chief.\" Ante at 267.\n\nIn light of my concurrence with the Court on these points, I join the majority in differing from Justice Stein's dissenting view that a simple reminder or reacknowledgement of an accused's right to remain silent is sufficient to preserve the \"scrupulously honored\" requirement. A \"bright-line\" rule that calls for the readministration of Miranda warnings will not only more efficaciously secure the right to remain silent, it will serve to avoid the \"confusion and conflict in future cases,\" ante at 268, inherent in attempting to characterize a statement by law enforcement authorities subsequent to an invocation of the right to remain silent.\n\nNevertheless, I have an important difference with the Court. It relates to the majority's characterization of the failure to readminister Miranda warnings, constituting a failure to \"scrupulously honor,\" as a constitutional violation, and its conclusion that any resultant statement is, necessarily, \"unconstitutionally compelled as a matter of law.\" Ante at 256. In my opinion, the failure to \"scrupulously honor\" in these circumstances does not violate the constitutional or fundamental common-law privilege itself. Rather it simply entails a violation of the incidental or ancillary, prophylactic rules designed to preserve the basic privilege against self-incrimination. Consequently, in my view, a statement obtained in violation of that requirement is not \"unconstitutionally compelled as a matter of law,\" and may therefore constitute probative evidence for purposes other than direct proof of criminal guilt.\n\nII.\n\nAs already noted, according to the majority, the failure to readminister Miranda warnings renders the first, or \"federal,\" statement \"unconstitutionally and illegally obtained as a matter of law.\" Ante at 271 (emphasis added). I perceive this violation of the \"bright-line,\" \"scrupulously-honor\" rule to constitute a failure to observe only the prophylactic rules of Miranda. The corollary to this view is that such a violation\n\nwould give rise only to a presumption that the statement was compelled, not, as the majority perceives it, unconstitutional compulsion as a matter of law.\n\nNevertheless, an infraction of the rules that are ancillary to constitutional rights is not to be taken lightly. The claimed right to remain silent itself is singularly important, its breach serious and the need to clearly deter its violations evident. These concerns justify treating the presumption of compulsion as irrebuttable as to any direct or affirmative use of a statement obtained in violation of the right to remain silent. Such a statement therefore should be excluded as probative evidence of criminal guilt on the prosecutor's case-in-chief.\n\nThis approach is consistent with Oregon v. Elstad, 470 U.S. 298, 105 S. Ct. 1285, 84 L. Ed. 2d 222 (1985). There the Supreme Court said:\n\nFailure to administer Miranda warnings creates a presumption of compulsion. Consequently, unwarned statements that are otherwise voluntary within the meaning of the Fifth Amendment must nevertheless be excluded from evidence under Miranda. Thus, in the individual case, Miranda's preventive medicine provides a remedy to the defendant who has suffered no identifiable constitutional harm. [ Id. at , 105 S. Ct. at 1292, 84 L. Ed. 2d at 231 (citations omitted) (emphasis added).]\n\nElstad 's recognition of a \"presumption of compulsion\" was derived from a distinction, previously drawn in Michigan v. Tucker, 417 U.S. 433, 94 S. Ct. 2357, 41 L. Ed. 2d 182 (1974), \"between on the one hand police conduct that directly infringes on the accused's right against compulsory self-incrimination, and on the other a violation only of the 'prophylactic rules developed to protect that right.'\" Id. at 439, 94 S. Ct. at 2361, 41 L. Ed. 2d at 190; ante at 271-272. The Supreme Court employed this distinction as a basis for finding that the failure to impart Miranda warnings, under circumstances demanding their administration, amounted merely to a violation of the \"prophylactic rules\" of Miranda. Oregon v. Elstad, supra, 470 U.S. at , 105 S. Ct. at 1293, 84 L. Ed. 2d at 232.\n\nThus, the basic rationale, which I believe should be extrapolated from Elstad, is that a violation of only the protective rules\n\nthat are incidental or ancillary to constitutional rights is not itself a constitutional violation. Accordingly, a presumption of invalidity affixed to such a violation is all that is necessary to sufficiently redress such a violation. The strength of the presumption of invalidity, and its remedial effects, parallels generally the gravity of the specific violation and the particular prosecutorial advantage that is sought to be obtained from the violation.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nThe majority, by its words, professes to recognize the distinction between constitutional violations and non-constitutional violations. However, in opting to impose the \"bright-line\" requirement that Miranda warnings be readministered as the only method for effectuating the \"scrupulously honored\" mandate, the majority classifies the failure to adhere to this standard as a constitutional violation.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e It, in effect, treats the rule,\n\nas well as the interest it protects, as constitutional in character. In doing so, the majority, in my judgment, obfuscates the distinction and overstates the consequences that federal courts are likely to attach to a violation of the \"scrupulously honored\" requirement arising solely from the absence of renewed Miranda warnings. Michigan v. Mosley, supra, 423 U.S. at 102, 96 S. Ct. at 325, 46 L. Ed. 2d at 320. As noted in Martin v. Wainwright, 770 F.2d 918, 928 (11th Cir.1985), although there is a distinction between a failure to honor the suspect's request to \"'cut off' questioning\" and \"a failure to give Miranda warnings,\" the reasoning of Elstad is properly applied in either context because both of these misdeeds by the police violate \"the technical requirements of Miranda, but [do] not violate the Fifth Amendment itself.\" Moreover, the result sanctioned by the majority, in a case such as this, appears contrary to the Mosley Court's perception of the \"scrupulously honored\" requirement, which was invoked only to determine whether the Miranda guidelines had been observed, not whether there had been a violation of the constitutional privilege against compulsory self-incrimination. Michigan v. Mosley, supra, 423 U.S. at 100, 96 S. Ct. at 324, 46 L. Ed. 2d at 319.\n\nThis failure to properly apply the distinction between violations of \"prophylactic rules\" and constitutional rights has led the Court to a seemingly anomalous position: an initial failure to give any Miranda warnings at all is merely violative of \"prophylactic\" standards, while the failure to repeat identical warnings after they have already been administered and claimed, is a constitutional violation.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e On this point, I join in\n\nJustice Stein's dissenting contention that the majority rule is irreconcilable with Elstad. Post at 324. It seems likely under Elstad that a violation of the \"scrupulously honored\" requirement would not be per se of constitutional dimension; additional factors, beyond the absence of requisite Miranda warnings, are necessary to elevate such an infraction to a constitutional violation.\n\nThe majority has blurred the distinctive lines between constitutional and non-constitutional violations drawn in Michigan v. Tucker, supra, 417 U.S. 433, 94 S. Ct. 2357, 41 L. Ed. 2d 182. At the very least, this inconsistency renders the majority's analysis of the federal constitutional right highly dubious. Consequently, I have no confidence that the rule espoused by the majority accurately presages federal constitutional law.\n\nIn this case, my differences with the majority carry potentially significant remedial repercussions relative to the admissibility of the \"state\" confession obtained subsequent to the initial confession secured in violation of \"scrupulously honored\" standards. The majority concludes that the \"failure scrupulously to honor a previously-invoked right of silence . . . smacks so inherently of compulsion that any statement following that failure is involuntary by definition.\" Ante at 278. This compulsion-by-attribution analysis brings the Court to extreme and unrealistic results. The Court should, I suggest, concentrate simply on what remedial relief is necessary to assure the scrupulously-honored requirement, such as a flexible or limited exclusionary rule that could address the need to deter improper in-custody interrogation and to encourage proper police conduct. See United States v. Leon, 468 U.S. 897, 104 S. Ct. 3405,\n\n82 L. Ed. 2d 677 (1984) (good-faith violation of Fourth Amendment does not require application of exclusionary rule). Instead, it dwells on the \"inherent\" -- that is the presumed, not actual -- involuntary character of a particular statement, and adopts, as a consequence, an absolute, rigid and total exclusionary rule.\n\nI think it should suffice to recognize, as does the majority, that an \"unwarned confession must be suppressed under the force of Miranda 's irrebuttable presumption\" despite the fact that the \"unwarned in-custody interrogation may be voluntary.\" Ante at 272. Conversely, I disagree with its conclusion that a failure to impart Miranda warnings subsequent to an accused's exercise of his right to remain silent per se constitutes a violation of \"constitutional magnitude,\" ante at 273, notwithstanding the voluntariness of this confession. If, in the first instance, a failure to give Miranda warnings is deemed merely to constitute a prophylactic violation when an accused gives a confession voluntarily, there is no reason to foreclose the possibility that an accused might voluntarily confess subsequent to invoking his right to remain silent. Such a circumstance is no different from the prophylactic violation of Miranda that exists initially when an accused voluntarily confesses prior to receiving Miranda warnings. Hence, by its categorical conclusion that the first or federal statement in this case is \"involuntary by definition\" and that its elicitation is a violation \"of constitutional magnitude,\" the Court has taken an unwarranted step that serves to predetermine the admissibility of the second confession.\n\nThe Court has, I believe, also misconceived and misapplied the \"fruit of the poisonous tree\" doctrine. See Brown v. Illinois, 422 U.S. 590, 95 S. Ct. 2254, 45 L. Ed. 2d 416 (1975); Wong Sun v. United States, 371 U.S. 471, 83 S. Ct. 407, 9 L. Ed. 2d 441 (1963). The Elstad Court declined to apply the \"fruit of the poisonous tree\" doctrine as a basis for excluding a second inculpatory statement given subsequent to Miranda warnings. It noted that \"errors . . . made by law enforcement authorities\n\nin administering prophylactic Miranda procedures . . . should not breed the same irremediable consequences as police infringement of the Fifth Amendment itself.\" Elstad, supra, 470 U.S. at , 105 S. Ct. at 1293, 84 L. Ed. 2d at 232. Similarly in Tucker the Supreme Court concluded that what was involved was merely a departure from Miranda \"prophylactic standards.\" Hence, application of the \"fruit of the poisonous tree\" doctrine, reserved exclusively for exclusion of evidence obtained as a result of constitutional violations, was deemed inapposite.\n\nIn my judgment, the more appropriate analysis commences with the recognition that the application of the \"fruit of the poisonous tree\" doctrine is bottomed on clear constitutional violations and is extremely fact-sensitive. It is fairly implicit in Elstad itself that the extension of the \"fruit of the poisonous tree doctrine\" is expressly contingent upon the actual voluntariness of the unwarned statement. The Supreme Court, upon finding that \"[n]either the environment nor the manner of [the pre- Miranda or unwarned] 'interrogation[s]' was coercive,\" determined that although \" Miranda requires that the unwarned admission must be suppressed, the admissibility of any subsequent statement should turn in these circumstances solely on whether it is knowingly and voluntarily made.\" Id. at , 105 S. Ct. at 1293, 84 L. Ed. 2d at 232 (emphasis added). This rationale suggests that if the unwarned statement in this case was in fact involuntary, thereby giving rise to a constitutional violation, the \"fruit of the poisonous tree\" doctrine would properly apply in ascertaining the admissibility of the second confession. Id. at , 105 S. Ct. at 1291, 84 L. Ed. 2d at 230. Conversely, if the unwarned statement was in fact voluntary, it would obviate consideration of the doctrine.\n\nAccordingly, in the case of a failure to \"scrupulously honor\" a suspect's exercise of his right to remain silent, arising solely from the absence of required Miranda warnings, different remedial consequences flow from a determination of the factual voluntariness of the initial confession. Although a presumption\n\nof involuntariness attaches because of the importance of the protectable interest in uncompelled statements, the strength of the presumption can vary depending on the specific use designated for the resulting confession. While, as previously noted, the presumption is irrebuttable in terms of using the unwarned statement itself as direct evidence of criminal guilt on the prosecutor's case-in-chief, the presumption may be rebutted when the statement is not to be considered for this purpose. See Harris v. New York, 401 U.S. 222, 91 S. Ct. 643, 28 L. Ed. 2d 1 (1971) (a confession obtained without warning the defendant of his right to appointed counsel, although inadmissible on the prosecutor's case-in-chief, was voluntarily given and therefore admissible for impeachment purposes on cross-examination); State v. Miller, 67 N.J. 229 (1975) (adopting Harris v. New York as a matter of state law); see also Terpstra v. Niagara Fire Ins. Co., 26 N.Y. 2d 70, 308 N.Y.S. 2d 378, 256 N.E. 2d 536 (1970) (voluntary written and oral statements by an insured that he set the fire that destroyed his insured building, despite the fact that the insured had been denied his request to consult counsel, are admissible in a civil action on the insurance policy). The majority, however, appears to foreclose any derivative use of an unwarned confession following a prior invocation of the right to remain silent. It does so by embracing the conclusion \"that any statement following that failure is involuntary by definition,\" ante at 278, thereby elevating the violation to \"constitutional magnitude.\" Under this analysis, it would appear that otherwise reliable and voluntary statements could not be used for impeachment purposes or for any other legitimate derivative use that might arise in the course of a criminal trial.\n\nIn my opinion, an immutable, irrebuttable presumption of involuntariness should not be ascribed to the initial confession for purposes of determining the admissibility of the second confession. As noted in Elstad, \"the Miranda presumption, though irrebuttable for purposes of the prosecution's case in chief, does not require that the statements and their fruits be discarded as inherently tainted.\" Id. at , 105 S. Ct. at 1292,\n\n84 L. Ed. 2d at 231. Rather, if the first, pre- Miranda statement is found, as a matter of fact, to be voluntary, then a subsequent, post- Miranda confession is properly evaluated solely under a traditional \"waiver\" analysis. North Carolina v. Butler, 441 U.S. 369, 99 S. Ct. 1755, 60 L. Ed. 2d 286 (1979). Conversely, if the initial, unwarned statement is itself factually involuntary, then the \"fruit of the poisonous tree\" doctrine must be summoned to determine the admissibility of the subsequent statement. See Bryant v. Vose, 785 F.2d 364 (1st Cir.1986) (if the defendant's oral confession was voluntary though inadmissible due to a Miranda violation, the later written confession would be admissible if fully warned and devoid of compulsion); United States v. Wauneka, 770 F.2d 1434, 1440 (9th Cir.1985) (to determine the admissibility of a confession given subsequent to Miranda warnings, the court must preliminarily decide whether a prior statement obtained in technical violation of Miranda was voluntary).\n\nI believe that engaging in such a voluntariness analysis premised upon a rebuttable presumption of compulsion for purposes of determining the use or admissibility of the first statement outside the prosecutor's case-in-chief, suitably protects both the constitutional privilege against self-incrimination and the ancillary rules devised to preserve that privilege; it also avoids the remedial overkill fostered by the majority rule. I reach this conclusion in terms of what I perceive to be the analysis most likely to be followed under these circumstances as a matter of federal law.\n\nIII\n\nState common law provides an alternative basis in support of a variable presumption of compulsion and a factual voluntariness inquiry regarding a statement obtained in violation of the claimed right to remain silent. It is appropriate in this case to address state grounds independently, particularly in \"the absence of a definitive Supreme Court determination on this\n\nquestion.\" State v. Williams, 93 N.J. 39, 57 (1983); State v. Schmid, 84 N.J. 535 (1980). I believe, as a matter of common law, that this proffered voluntariness analysis, based on presumptive compulsion, represents a sounder and more realistic solution to the dilemma posed between protecting a suspect's privilege against self-incrimination and his exercise of Miranda rights and society's interest in reasonable and effective law enforcement. Moreover, this analysis is consistent with our particular concerns and traditional approaches in the administration of our criminal laws. State v. Hunt, 91 N.J. 338, 360 (1982) (concurring opinion).\n\nWe have recognized the importance of the right to remain silent and particularly the importance of honoring that right once it has been claimed by a suspect. See State v. Kennedy, 97 N.J. 278, 288 (1984) (trial court authorized to determine whether an accused has been \"effectively apprised of his [ Miranda ] rights and [whether] the exercise of those rights [has been] fully honored.\"); State v. Wright, 97 N.J. 113 (1984). Hence, a sharp, \"bright-line\" requirement that Miranda warnings be readministered prior to resumption of interrogation is essential, as a matter of state law, to preserve the substantive right to remain silent. Ante at 267. See State v. McCloskey, 90 N.J. 18, 30 n. 3 (1982) (when the right to remain silent is invoked, absent new Miranda warnings, interrogation may not be resumed); see also State v. Magee, 52 N.J. 352, 374-75 (1968), cert. den., 393 U.S. 1097, 89 S. Ct. 891, 21 L. Ed. 2d 789 (1969) (recognizing that under certain circumstances it may be necessary, as a matter of law, to repeat Miranda warnings despite their prior administration).\n\nWe have also recognized as a matter of state law that a statement taken in violation of Miranda may not be directly used as affirmative evidence of criminal guilt by the prosecution. See State v. Gosser, 50 N.J. 438, 445-46 (1967), cert. denied, 390 U.S. 1035, 88 S. Ct. 1434, 20 L. Ed. 2d 295 (1968) (exclusionary rule of Miranda bars from evidence statements made by a defendant during in-custody interrogation unless he\n\nhas been advised of his Miranda rights and knowingly and intelligently waived such rights); State v. Vigliano, 50 N.J. 51, 64 (1967) (evidence obtained in the absence of prescribed Miranda warnings is inadmissible); State v. Lutz, 165 N.J. Super 278, 283-84 (App.Div.1979) (in the absence of Miranda warnings statements made by the defendant, whether exculpatory or inculpatory, may not be used by the prosecution).\n\nIn addition, we have acknowledged the distinction between constitutional and nonconstitutional violations and the remedial consequences that flow from each. See State v. Kennedy, supra, 97 N.J. at 285-86; State v. Miller, supra, 67 N.J. 229. To rise to the level of a constitutional violation, it is necessary that the egregious conduct of law enforcement authorities contravene, not simply the prophylactic rules protecting the privilege against compelled self-incrimination, but an independent, non-ancillary constitutional right. Cf. State v. Sugar (II), 100 N.J. 214 (1985); State v. Sugar (I), 84 N.J. 1, 25 (1980) (\"Because the violation of the right to effective assistance of counsel was so serious, and because the guarantee of a fair trial has been so threatened by the insolence of local law enforcement officers, the fruits of their lawlessness must not be allowed to aid a prosecution in any manner.\"); State v. Belucci, 81 N.J. 531 (1980) (violation of right to effective assistance of counsel arising out of conflict of interests mandates a per se reversal of a conviction).\n\nFurthermore, our common law has striven to avoid artificial barriers to the search for truth and the quest for justice in the administration of the criminal laws. Thus, when such a statement has been obtained in violation of ancillary Miranda rights, but is not deemed to be of constitutional dimension, the statement may be used for legitimate prosecutorial purposes aside from direct evidence of criminal guilt. State v. Miller, supra, 67 N.J. at 233; State v. Ross, 80 N.J. 239, 248 (1979).\n\nOur common law has also focused upon and stressed the reliability of confessions as the predicate for their use as direct\n\nincriminating evidence in criminal causes. We have sedulously devised measures to assure the admissibility in evidence of those statements that, realistically, could be considered voluntary and reliable. See State v. Hampton, 61 N.J. 250, 267-72 (1972); State v. Yough, 49 N.J. 587, 599-600 (1967); State v. Smith, 32 N.J. 501, 557-60 (1960) (Weintraub, C.J. concurring), cert. den., 364 U.S. 936, 81 S. Ct. 383, 5 L. Ed. 2d 367 (1961) (mandating the use of a preliminary hearing to assess the voluntariness of a confession as a prerequisite to admitting an inculpatory statement). We have also actively embraced the opportunity to move beyond the guidelines of federal directives in pursuit of an unyielding commitment to assure the proper admissibility of confessions. See State v. Yough, supra, 49 N.J. at 601 (avoiding the uncertainty of future federal law developments by adopting beyond-a-reasonable-doubt test with respect to preliminary voluntariness findings). Throughout our common-law history, we have mandated exacting scrutiny of the circumstances surrounding the elicitation of an inculpatory statement commensurate with the primary objectives of reliability and voluntariness. See State v. Miller, 76 N.J. 392 (1978) (trial court must perform an exhaustive, fact-based voluntariness review as a prerequisite to admitting a confession into evidence). Once a statement has surmounted the hurdles of admissibility, it then devolves upon the jury, as the ultimate fact-finder, to determine its probative worth. See State v. Hampton, supra, 61 N.J. at 272.\n\nThe standard I commend in this case entails a voluntariness inquiry based upon a rebuttable presumption of compulsion attached to the first confession in order to determine the admissibility of the subsequently obtained confession. This standard is fully consistent with our previously announced state common-law practices. It represents a cautious, yet flexible approach directed toward validation of Miranda 's goal of protecting a defendant from the admission into evidence of his improperly obtained confession without unduly restricting the\n\nderivative or indirect use of such confessions when surrounding facts genuinely demonstrate their reliability.\n\nI am also of the view that this approach, as a matter of state common law, would not unnecessarily extend the \"fruit of the poisonous tree doctrine.\" Cf. State v. Barry, 86 N.J. 80, 89-90, cert. denied, 454 U.S. 1017, 102 S. Ct. 553, 70 L. Ed. 2d 415 (1981) (under close factual analysis, intervening independent circumstances were sufficient to purge the taint of defendant's illegal arrest thereby satisfying the state's burden of establishing that a subsequent confession was the product of defendants' free will rather than the result of the exploitation of an illegal arrest); State v. Starling, 188 N.J. Super. 127 (Law Div.1983), aff'd, 207 N.J. Super. 79 (App.Div.1985). Rather, it recognizes that although a confession is excluded on the prosecutor's case-in-chief by virtue of an irrebuttable presumption of compulsion, its voluntary character may justify shedding the stigma of presumed inadmissibility when deciding questions of its use or admissibility for other purposes. See State v. Miller, supra, 67 N.J. 229.\n\nIV.\n\nIn this instance, the trial judge unduly depreciated the importance of Hartley's exercise of his right to remain silent in considering the admissibility of the \"federal\" statement. In finding the initial confession admissible as affirmative evidence of criminal guilt, the trial court failed to recognize or apply the \"scrupulously honored\" mandate, which would engender an irrebuttable presumption of compulsion, or, according to the majority, a conclusive determination of unconstitutional compulsion as a matter of law. Instead, the court embarked directly upon a factual voluntariness inquiry and determined that the initial confession was in fact voluntary; the statement was admitted in evidence solely on this basis. I disapprove of the trial court's failure to apply the \"bright-line\" \"scrupulously honored\" test and its determination that this initial confession\n\nis admissible on the prosecution's case-in-chief to establish criminal guilt. As previously noted, I would affix an irrebuttable presumption of compulsion to the initial statement, thereby disqualifying it from consideration as direct, affirmative evidence.\n\nDespite this disagreement with the trial court's decision to admit the first confession as direct evidence of criminal guilt, I can accept its factual finding of voluntariness, at least for purposes of determining the effect of the first confession on the admissibility of the second confession. With respect to this factual analysis, as set forth in Justice Stein's dissent, although Agent Frieberg's remarks and the circumstances surrounding the interrogation may be perceived as demonstrating an attempt to exert pressure on Hartley, \"[t]he trial court . . . found as a fact that Hartley's waiver was knowing, intelligent and voluntary.\" Post at 314. The trial court's factual determination, resulting from its totality of the circumstances voluntariness review, U.S. v. Sierra, 585 F. Supp. 1236 (D.N.J.), aff'd, 755 F.2d 925 (3d Cir.1984); State v. Miller, 76 N.J. 392 (1978), indicating that Hartley's will was not overborne, is clearly sustainable in the record. See State v. Pickles, 46 N.J. 542 (1966); State v. Johnson, 42 N.J. 146 (1964).\n\nI am satisfied that the presumption of compulsion, which for these purposes is appropriately regarded as rebuttable, was overcome. Hartley's decision to confess to the \"federal\" authorities was not the product of any coercion, threats, force or improper conduct on the part of law enforcement officials. Hence, I feel compelled to dissent from the majority's application of \"the fruit of the poisonous tree\" doctrine, consistent with my view that \"[i]f the first, pre- Miranda statement is ultimately found to be voluntary, than a subsequent, post- Miranda confession should be evaluated solely under a traditional 'waiver' analysis.\" See supra at 298. And, in accordance with the uncontroverted facts relating to the post- Miranda, \"state\" confession, I see no reason to disturb the\n\ntrial court's finding that the second confession was voluntarily rendered.\n\nV.\n\nI write separately to confirm my agreement with the majority's recognition of the importance of the \"scrupulously honored\" requirement in support of the claimed right to remain silent and its imposition of a \"bright-line\" rule to effectuate that right. At the same time, I express my disagreement with its explanation and application of these principles to this case. For these reasons, and in view of the improper admission into evidence of the initial confession, I would join in the Court's judgment to reverse and remand.\n\nSTEIN, J., dissenting.\n\nThis is a \"second-level\"\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Miranda case, involving as it does the rights of an accused who, after receiving his Miranda warnings, invokes one of them -- the right to remain silent. The issue posed is one of first impression before this Court: When an accused asserts the right to remain silent, under what circumstances may law-enforcement officials interrogate the accused or request that he reconsider the exercise of this constitutional right?\n\nThe majority of the Court today adopts a per se rule that law-enforcement officials, confronted with an accused who has invoked the right to remain silent, must at a minimum readminister Miranda warnings before either interrogating the accused or requesting that he reconsider the assertion of his fifth-amendment right. According to the majority, this per se rule applies irrespective of the number of times Miranda warnings have already been administered and, apparently, even when\n\nlaw-enforcement officials have acknowledged to the suspect that his right to remain silent is still in effect. In my view, this per se rule not only leads to an incorrect result in this case but is not helpful in clarifying for law-enforcement officials the increasingly convoluted issues concerning the application of Miranda principles to custodial interrogations.\n\nI\n\nThe facts are adequately set forth in the majority opinion and do not require restatement. However, I would emphasize certain aspects of appellant's custodial treatment in order to focus the issues in this case.\n\nOf paramount importance is the fact that from the time of Hartley's arrest in his apartment at 7:30 a.m. until the critical statement by Special Agent Frieberg at 10:43 a.m., ante at 257-258 his rights had been scrupulously respected by the law-enforcement officials participating in his arrest. As noted in the majority opinion, when Hartley was arrested at 7:30 a.m., he was read his Miranda rights from the FBI \"Advice of Rights\" card. Thereafter, none of the arresting officers made any attempt to interrogate him, either at his apartment or on the way to the Brooklyn-Queens FBI office.\n\nAt 9:15 a.m., Hartley and three FBI agents were present in a processing room containing photographic and fingerprinting apparatus. He was not handcuffed and the agents were unarmed. Before he was reinformed of his Miranda rights, he was questioned briefly about his education and his ability to read and understand the English language. Hartley had attended high school through the tenth grade and obtained a high school diploma by fulfilling New York State's equivalency requirements; hence, there was no doubt that he was capable of\n\nunderstanding the Miranda rights that were about to be reread to him.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nOne of the FBI agents then reread to Hartley the \"Advice of Rights\" form and afterwards handed him the form to read. At the bottom of the form was a \"Waiver of Rights\" section, which read:\n\nI have read this statement of my rights and I understand what my rights are. I am willing to make a statement and answer questions. I do not want a lawyer at this time. I understand and know what I am doing. No promises or threats have been made to me and no pressure or coercion of any kind has been used against me.\n\nAs the majority opinion indicates, Hartley displayed some hesitancy about signing the waiver form. When asked what the problem was, Hartley replied, \"I don't believe I want to make a statement at this time.\" Accordingly, Hartley was instructed to cross out the sentence on the \"Waiver of Rights\" form that read, \"I am willing to make a statement and answer questions.\" Hartley crossed out the sentence, initialed the deletion, and signed the \"Waiver of Rights\" form. No attempt was made to interrogate Hartley or to question his clear assertion of the right to remain silent.\n\nHartley was then fingerprinted and photographed. There was no further communication with Hartley until the statement by Agent Frieberg at 10:43 a.m. Accordingly, it is indisputable that the conduct of the law enforcement officials from the time of Hartley's arrest until 10:43 a.m. scrupulously honored Hartley's right to remain silent.\n\nI concur with the majority that the critical event in this case is Agent Frieberg's statement at 10:43 a.m.: \"Terrence, I am Special Agent Frieberg and I am from Atlantic City, New Jersey, and I think you know why I am up here. And I would like you to reconsider and now is the time if you are going to make a statement. Now is the time to do it.\"\n\nThe majority opinion makes much of the fact that the FBI agents were concerned about the necessity of transporting Hartley to a magistrate for arraignment and that the impetus for the phrase, \"Now is the time to do it,\" stemmed from the agents' concern that time was running out on them and they would have to leave promptly to transport Hartley to the federal court. This sense of urgency would appear to be overemphasized by the majority since Frieberg's comment to Hartley was made at 10:43 a.m., his interrogation of Hartley continued until 12:57 p.m., and Hartley was not transported for his arraignment until approximately 1:30 p.m., about two hours and forty-five minutes after the interrogation commenced. Agent Frieberg's testimony that he had received instructions to transport Hartley for arraignment \"without delay,\" ante at 269, referred to a telephone call to Agent Robley at about 1:00 p.m., long after the interrogation had begun.\n\nThe majority concludes that Frieberg's statement constituted conduct inconsistent with Hartley's right to remain silent. The majority is unimpressed with that portion of the statement that plainly reacknowledges Hartley's fifth-amendment rights -- \"And I would like you to reconsider and now is the time if you are going to make a statement \" -- and concludes that without a third reading of the Miranda rights, Hartley's subsequent confessions to the FBI and to the Atlantic City police must be suppressed.\n\nII\n\nThe majority defends its holding on the basis that it affords law-enforcement officials a \"bright line\" rule by which to guide their conduct during custodial interrogation. Whether the majority holding serves the function claimed for it requires a brief review of Miranda and the post- Miranda decisions applicable to \"second-level\" Miranda safeguards.\n\nUnder Miranda, as a prerequisite to custodial interrogation, the police must inform the accused of his basic rights. These\n\nrights are the right to remain silent, accompanied by the warning that any statement can and will be used against the accused in court; the right to consult with a lawyer and to have the lawyer present during the interrogation; and the right to have a lawyer appointed to represent the accused if he is indigent. Miranda v. Arizona, 384 U.S. 436, 467-73, 86 S. Ct. 1602, 1624-27, 16 L. Ed. 2d 694, 720-23 (1966). Although the Court in Miranda emphasized that interrogation must cease if the accused invokes either his right to remain silent or his right to confer with counsel, id. at 473-74, 86 S. Ct. at 1627-28, 16 L. Ed. 2d at 723, subsequent decisions have differentiated between the conduct required of law-enforcement officials with respect to the invocation of these two rights.\n\nA. The right to counsel.\n\nIn Edwards v. Arizona, 451 U.S. 477, 101 S. Ct. 1880, 68 L. Ed. 2d 378, reh'g denied, 452 U.S. 973, 101 S. Ct. 3128, 69 L. Ed. 2d 984 (1981), the Court, emphasizing its belief that \"additional safeguards are necessary when the accused asks for counsel,\" adopted a per se rule that once an accused invokes his right to counsel, law-enforcement officials cannot subject him to further interrogation until counsel has been made available, \"unless the accused himself initiates further communication, exchanges, or conversations with the police.\" Id. at 484-85, 101 S. Ct. at 1884, 68 L. Ed. 2d at 386. This Court has applied the per se rule of Edwards in several cases. See State v. Kennedy, 97 N.J. 278, 285 (1984); State v. Wright, 97 N.J. 113, 122-23, 125-26 (1984); State v. McCloskey, 90 N.J. 18, 25-28 (1982).\n\nHowever, Edwards has left unsettled significant questions regarding its implementation. In Oregon v. Bradshaw, 462 U.S. 1039, 103 S. Ct. 2830, 77 L. Ed. 2d 405 (1983), the Supreme Court was sharply divided as to whether the defendant, who had invoked his right to counsel, satisfied the Edwards test of initiating further communication when he inquired of a police officer, \"Well, what is going to happen to me now?\" Four\n\nmembers of the Court viewed the defendant's comment as reflecting nothing more than his desire \"to find out where the police were going to take him,\" rather than a desire for a generalized discussion about the investigation. Id. at 1055, 103 S. Ct. at 2840, 77 L. Ed. 2d at 419 (Marshall, J., dissenting). Four members of the Court found that the defendant's question satisfied the test of Edwards that the accused himself initiate further dialogue with the police. Id. at 1044-46, 103 S. Ct. at 2834-35, 77 L. Ed. 2d at 412-13.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e Justice Powell, concurring in the judgment of the Court, criticized the two-step analysis applied by both the majority and the dissent, which distinguished between the initiation of communication by the accused and the voluntariness of the waiver. In his view, the more appropriate inquiry is whether or not the eventual waiver is knowing, intelligent, and voluntary. Id. at 1050-51, 103 S. Ct. at 2837-38, 77 L. Ed. 2d at 415-16.\n\nB. The right to remain silent.\n\nIn Michigan v. Mosley, 423 U.S. 96, 96 S. Ct. 321, 46 L. Ed. 2d 313 (1975), the Court considered the admissibility of a confession made by a suspect who had previously invoked his right to remain silent. The Court acknowledged that Miranda left open the question whether law-enforcement officials may resume interrogation when a person in custody invokes his right to silence: \"It does not state under what circumstances, if any, a resumption of questioning is permissible.\" Id. at 101, 96 S. Ct. at 325, 46 L. Ed. 2d at 320. The Court rejected the suggestion that the invocation of the right to silence creates an absolute bar to any subsequent interrogation:\n\n[A] blanket prohibition against the taking of voluntary statements or a permanent immunity from further interrogation, regardless of the circumstances, would transform the Miranda safeguards into wholly irrational obstacles to legitimate police investigative activity, and deprive suspects of an opportunity to make informed and intelligent assessments of their interests.\n\nA reasonable and faithful interpretation of the Miranda opinion must rest on the intention of the Court in that case to adopt \"fully effective means . . . to notify the person of his right of silence and to assure that the exercise of the right will be scrupulously honored. . . .\" The critical safeguard identified in the passage at issue is a person's \"right to cut off questioning.\" Through the exercise of his option to terminate questioning he can control the time at which questioning occurs, the subjects discussed, and the duration of the interrogation. The requirement that law enforcement authorities must respect a person's exercise of that option counteracts the coercive pressures of the custodial setting. We therefore conclude that the admissibility of statements obtained after the person in custody has decided to remain silent depends under Miranda on whether his \"right to cut off questioning\" was \"scrupulously honored.\" [ Id. at 102-104, 96 S. Ct. at 326, 46 L. Ed. 2d at 320-21 (citations omitted).]\n\nIn Mosley the Court held that the statement obtained from the defendant after the second interrogation was admissible at his trial because the police had \"scrupulously honored\" the defendant's right to cut off questioning. The Court noted that the police immediately ceased the initial interrogation when the accused invoked his right to remain silent, that they attempted no further interrogation until a significant period of time had elapsed and fresh Miranda warnings had been administered, and that they limited the second interrogation to a different crime. Id. at 105-106, 96 S. Ct. at 327-328, 46 L. Ed. 2d at 322.\n\nAt least one state court, relying on state constitutional grounds, has rejected the Mosley rationale, holding that once an accused has asserted his right to remain silent, police interrogation must cease and cannot be resumed. People v. Pettingill, 21 Cal. 3d 231, 578 P. 2d 108, 145 Cal.Rptr. 861 (1978); cf. Michigan v. Mosley, 423 U.S. at 116-17, 120-21, 96 S. Ct. at 332-33, 334-35, 46 L. Ed. 2d at 329-32 (Brennan, J., dissenting) (suggesting that states adopt as a matter of state law the rule that once the accused has invoked his right to silence, no further interrogation is permitted unless counsel is present). Several commentators have sharply criticized the distinction drawn between an accused who invokes the right to silence and one who invokes the right to counsel:\n\nIf it is inherently coercive -- if it is inconsistent with Miranda -- to renew interrogation after a suspect has invoked his right to counsel, I think it is equally wrong for the police to do so if the suspect has asserted his right to\n\nremain silent. The average person has no idea that different procedural safeguards are triggered by saying \"I want to see a lawyer\" (or \"I don't want to say anything until I see a lawyer\") rather than \"I don't want to say anything\" (or \"I don't want to talk to you.\"). [Kamisar, \"The Edwards and Bradshaw Cases: The Court Giveth and the Court Taketh Away,\" 5 The Supreme Court: Trends and Developments 1982-83, 153, 155 (1984).]\n\nSee Stone, \"The Miranda Doctrine in the Burger Court,\" 177 Sup.Ct.Rev. 99, 136-37 (1977).\n\nIf the objective of the majority in this case is to establish a \"bright line\" rule as to suspects who invoke the right to remain silent, a much clearer rule than the one announced in the opinion would be one that eliminates the distinction between the assertion of the fifth amendment right to remain silent and the sixth amendment right to counsel. The majority, without discussing the validity of the distinction between Edwards and Mosley, follows the Mosley principle that reinterrogation is not barred following an assertion of the right to remain silent,\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e and simultaneously adopts the per se rule that after an accused has\n\nasserted his right to silence, law-enforcement officials can neither interrogate him nor ask him to reconsider his right to remain silent until new Miranda warnings have been administered. Ante at 256, 261.\n\nMost pre- and post- Mosley decisions that address the issue, however, do not insist on fresh Miranda warnings as a prerequisite to reinterrogation. See Stumes v. Solem, 752 F.2d 317, 321 (8th Cir.) (\"[W]e believe that Stumes was aware of his Miranda rights and voluntarily chose not to exercise them. To require the police to reissue Miranda rights under these circumstances would serve no real purpose.\"), cert. denied, U.S. , 105 S. Ct. 2145, 85 L. Ed. 2d 502 (1985); Jarrell v. Balkcom, 735 F.2d 1242, 1254 (\"We conclude that no violation of petitioner's rights occurred by the failure to reissue the Miranda warnings.\"), reh'g denied, 740 F.2d 979 (11th Cir. 1984), and cert. denied, U.S. ? , 105 S. Ct. 2331, 85 L. Ed. 2d 848 (1985); United States v. Hackley, 636 F.2d 493 (D.C.Cir.1980) (third set of Miranda warnings not required and statement made two hours after last warnings held admissible; dissenting opinion views colloquy with accused as reinterrogation); Brown v. Tard, 552 F. Supp. 1341, 1349 (D.N.J.1982) (\" Miranda does not require that a fresh set of warnings be repeated each time the police resume interrogation after an interruption.\"); see also Miller v. United States, 396 F.2d 492, 496 (8th Cir.1968) (rewarning not required each time interrogation process renewed; pre- Mosley), cert. denied, 393 U.S. 1031, 89 S. Ct. 643, 21 L. Ed. 2d 574 (1969); United States v. Kinsey, 352 F. Supp. 1176, 1178 (E.D.Pa.1972) (Miranda warnings do not become stale; pre- Mosley); State v. Melvin, 65 N.J. 1, 14 (1974) (no repetition of Miranda warnings required; pre- Mosley); State v. Magee, 52 N.J. 352, 374 (1968) (no repetition of Miranda warnings required prior to reinterrogation; pre- Mosley), cert. denied, 393 U.S. 1097, 89 S. Ct. 891, 21 L. Ed. 2d 789 (1969). Contra United States v. Jakakas, 423 F. Supp. 564, 568-69 (E.D.N.Y.1976); People v. Ferro, 63 N.Y. 2d 316, 472 N.E. 2d 13, 482 N.Y.S. 2d 237 (1984), cert. denied, U.S. ,\n\n105 S. Ct. 2700, 86 L. Ed. 2d 717 (1985); cf. People v. Young, 115 Ill.App. 3d 455, 460, 71 Ill.Dec. 259, 265, 450 N.E. 2d 947, 953 (App.Ct.1983) (Mosley interpreted to require fresh warnings, but defendant's confirmation that he understood rights previously read to him satisfies rule); State v. McCloskey, supra, 90 N.J. at 30 n. 3 (Mosley read to require new Miranda warnings prior to resumption of interrogation).\n\nC. Waiver.\n\nThe principle is well settled that a suspect may waive his constitutional rights to remain silent and to counsel, and that a confession made subsequent to the waiver of those rights will be admissible. The test is whether the waiver is knowing, intelligent, and voluntary. Johnson v. Zerbst, 304 U.S. 458, 464, 58 S. Ct. 1019, 1023, 82 L. Ed. 1461, 1466 (1938). The waiver need not be express or explicit. The question of waiver is to be determined on the basis of the particular facts and circumstances of each case, including the background, experience, and conduct of the accused. North Carolina v. Butler, 441 U.S. 369, 374-75, 99 S. Ct. 1755, 1757-59, 60 L. Ed. 2d 286, 292-93 (1979). New Jersey has consistently followed the rule that \"an explicit statement of waiver is not invariably necessary to support a finding that the defendant waived the right to remain silent.\" Id. at 375-76, 99 S. Ct. at 1758-59, 60 L. Ed. at 293-94; see State v. Kennedy, supra, 97 N.J. at 286. As we stated in State v. Kremens, 52 N.J. 303 (1968):\n\nAny clear manifestation of a desire to waive is sufficient. The test is the showing of a knowing intent, not the utterance of a shibboleth. The criterion is not solely the language employed but a combination of that articulation and the surrounding facts and circumstances. [ Id. at 311 (citations omitted).]\n\nIII\n\nPreliminarily, in order to appreciate the narrowness of the majority's focus in this case, it is significant to note that the trial court, after a lengthy hearing, expressly determined that Hartley's waiver of his right to silence was knowing and voluntary:\n\nI am satisfied beyond any doubt that this defendant did intelligently understand his rights. He had a right to remain silent. He had a right to counsel * * *. I am satisfied that Hartley knew that he did not have to make a statement. He already took that position once. There is no reason why he could not maintain that position. * * *\n\nI think he thought it was in his best interest to do what he did. I think he did it knowingly and voluntarily and willingly. I do not believe that there was any coercion or any threats or any force or any improper conduct on the part of the authorities.\n\nI do not find, in fact, that Mr. Hartley's will was overborne by any conduct on the part of the State.\n\nConcededly, Agent Frieberg's use of the phrase, \"Now is the time to do it,\" in encouraging Hartley to reconsider his refusal to make a statement, could have been found to be an attempt to exert pressure on Hartley and therefore inconsistent with a voluntary waiver. The trial court, however, rejected that argument and found as a fact that Hartley's waiver was knowing, intelligent, and voluntary. See Johnson v. Zerbst, supra, 304 U.S. at 464, 58 S. Ct. at 1023, 82 L. Ed. at 1466. The trial court's factual determination on the waiver issue, amply supported by the record in this case, should not be disturbed by us. State v. Johnson, 42 N.J. 146, 162-63 (1964).\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nThe majority declines to reach the waiver issue on the basis of the following reasoning:\n\n[G]iven our holding that the failure scrupulously to honor a previously-invoked right to silence unconstitutionally compelled any resultant incriminating statement made in response to custodial interrogation, there can be no question of waiver. In the instant context the waiver issue could not arise until after the exercise of the asserted right had been scrupulously honored by, at a minimum, the giving of fresh Miranda warnings. The requirement that an asserted right be scrupulously honored has been carefully guarded in this state in order to ensure that full opportunity to exercise the privilege is permitted. Because in this case the right was not honored and defendant's \"federal\" statement must therefore be deemed to have been unconstitutionally compelled, there is simply no waiver issue posed on this appeal. [ Ante at 261 (citations omitted).]\n\nAlthough the majority opinion refuses to consider the waiver issue, careful analysis demonstrates that in this case the criteria for recognizing a valid waiver of the right to silence necessarily encompass the factors that determine whether the right to silence has been scrupulously honored. The Mosley Court took pains to explain what it meant by the \"scrupulously honored\" standard. \"The critical safeguard identified in the passage at issue is a person's right to cut off questioning.\" Michigan v. Mosley, supra, 423 U.S. at 102-104, 96 S. Ct. at 325-327, 46 L. Ed. at 320-21. This suggests that the primary inquiry required by Mosley is to determine whether the police make it clear, when they resume communication with the accused, that his right of silence is still in force. The emphasis does not focus simply on knowledge of the substance of the right -- an objective that would be served by a rereading of the Miranda rights -- but on an acknowledgement that the right previously asserted would continue to be honored if that was the accused's wish.\n\nA valid waiver must be knowing, intelligent and voluntary. Johnson v. Zerbst, supra, 304 U.S. at 464, 58 S. Ct. at 1023, 82 L. Ed. at 1466. It is self-evident that Hartley could not validly waive his right to silence if he did not know both the nature of the right and that his privilege to continue to assert it was in effect at the instant of waiver. The trial court in this case found these conditions for a valid waiver to have been satisfied:\n\nI am satisfied beyond any doubt that this defendant did intelligently understand his rights. He had a right to remain silent. He had a right to counsel * * *. I am satisfied that Hartley knew that he did not have to make a statement. He already took that position once. There is no reason why he could not maintain that position.\n\nAs stated, the criteria for recognizing the validity of Hartley's waiver would appear to subsume the requirement of Mosley that an accused's right to remain silent must be \"scrupulously honored.\" The majority's refusal to consider the waiver issue in this case ignores the fact that Frieberg's crucial statement and Hartley's response occurred in rapid succession. This is not a case where there was a significant lapse of time\n\nbetween the alleged failure to respect the defendant's right to remain silent and the defendant's waiver. Here, the challenged police conduct and the alleged waiver occurred together. The majority's rejection of the trial court's factual finding that Hartley's waiver was valid, on the basis that Frieberg's statement made a moment earlier violated the Mosley test, is an unduly technical application of Mosley. This was the point urged by Justice Powell in his concurring opinion in Oregon v. Bradshaw, supra:\n\nJustice Marshall would hold that there can be no waiver of the right to counsel unless the accused himself opens a dialogue \"about the subject matter of the criminal investigation.\" He states that \"unless the accused himself initiates further communication with the police, a valid waiver of the right to counsel cannot be established.\" Under this view of the two-step analysis, a court never gets to the second step -- however relevant subsequent facts and circumstances may be to a waiver -- unless the accused was the first to speak and to say the right thing. * * *\n\nMy concern is that a two-step analysis could confound the confusion evident from the differing views expressed by other courts * * * and indeed evidenced by the conflicting reading of Edwards by Justices Marshall and Rehnquist. The Zerbst standard is one that is widely understood and followed. It also comports with common sense. Fragmenting the standard into a novel two-step analysis -- if followed literally -- often would frustrate justice as well as common sense. Courts should engage in more substantive inquiries than \"who said what first.\" The holding of the Court in Edwards cannot in my view fairly be reduced to this.\n\nWe are unanimous in agreeing in this case, as in Edwards, that \"the right to counsel [is] a prime example of those rights requiring the special protection of the knowing and intelligent waiver standard.\" We also agree that once the accused has requested counsel this right requires additional safeguards, particularly against any coercive form of custodial interrogation. But the question of whether a suspect has waived this important right to counsel is uniquely one of fact, and usually must and should be left to the judgment of the trial court that has had the benefit of hearing the evidence and assessing the weight and credibility of testimony. [ Id. 462 U.S. at 1050-51, 103 S. Ct. at 2837-38, 77 L. Ed. 2d at 415-16 (citations omitted).]\n\nJustice White, concurring in Michigan v. Mosley, agreed with Justice Powell's view that the critical issue should be the validity of the waiver:\n\nI suspect that in the final analysis the majority will adopt voluntariness as the standard by which to judge the waiver of the right to silence by a properly informed defendant. I think the Court should say so now. [432 U.S. at 108, 96 S. Ct. at 328, 46 L. Ed. 2d at 324.]\n\nThe majority cites Michigan v. Jackson, 475 U.S. , , 106 S. Ct. 1404, 1410, 89 L. Ed. 2d 631, 642 (1986), as authority for rejecting consideration of the waiver in this case. In Jackson, however, the right asserted was the right to counsel and recognition of the waiver in that context would not test the police officer's compliance with the Edward 's requirement that renewed communication be initiated by the accused. The difference in the right to silence context is that when the challenged police conduct occurs simultaneously with the waiver, the validity of the waiver depends upon whether the police have scrupulously honored the right to silence. Thus, there is no reason not to focus on the validity of the waiver in this case.\n\nIn my view, when the police conduct alleged to violate the \"scrupulously honored\" test of Mosley coalesces in time with the alleged waiver, there is no legal or logical impediment to a court's consideration of the validity of the waiver. The trial court could not have found that defendant knowingly and voluntarily waived his right to remain silent had it not also found that the conduct of law enforcement officials was consistent with the continued assertion of that right.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Accordingly, I reach the waiver issue in this case and would uphold the factual determination of the trial court.\n\nHowever, even on the basis of the Mosley standard, I would conclude that Hartley's right to remain silent was \"scrupulously honored.\" The majority opinion does not acknowledge a number of decisions, both pre- and post- Mosley, that have recognized the important distinction between renewed interrogation and a request by law enforcement officials that an accused \"reconsider\" his right to remain silent. These courts have acknowledged that such a request, unlike renewed interrogation, is not inconsistent with the continued availability of the right to remain silent.\n\nThere is a critical distinction between, on the one hand, an inquiry for the limited purpose of clarifying whether the defendant is invoking his right to remain silent or has changed his mind regarding an earlier assertion of the right and, on the other hand, questioning aimed at eliciting incriminating statements concerning the very subject on which the defendant has invoked his right. [ United States v. Lopez-Diaz, 630 F.2d 661, 665 (9th Cir.1980).]\n\nSee United States v. Smith, 608 F.2d 1011, 1013-14 (4th Cir.1979); United States v. Davis, 527 F.2d 1110, 1111 (9th Cir.1975), cert. denied, 425 U.S. 953, 96 S. Ct. 1729, 48 L. Ed. 2d 196 (1976); United States v. Collins, 462 F.2d 792, 797 (2d Cir.), cert. denied, 409 U.S. 988, 93 S. Ct. 343, 34 L. Ed. 2d 254 (1972).\n\nMosley was intended to permit renewed, noncoercive communication between law-enforcement officials and suspects who have initially elected to remain silent. The least intrusive way in which such communication can be resumed is by a request that the suspect reconsider his prior assertion of the right to remain silent. Such a request is clearly more consistent with the suspect's asserted right than the resumption of direct interrogation concerning the crime under investigation. When the request for reconsideration is conveyed in language that constitutes a clear reacknowledgement of the suspect's continuing right to remain silent, a requirement that new Miranda warnings precede such a request would be redundant. A request that the suspect reconsider his right to remain silent presumes the continued availability of that right. See United States v. Smith, supra, 608 F.2d at 1014.\n\nAs stated previously, the Mosley Court expressed the \"scrupulously honored\" test in terms of a defendant's right to cut off questioning. Consistent with that standard, it would seem evident that a reacknowledgment of the right to remain silent is as effective a means of satisfying the Mosley test as is a verbatim rereading of the Miranda warnings.\n\nAgent Frieberg plainly reacknowledged to Hartley the continued availability of his right to remain silent. His request to Hartley was that he \"reconsider\" -- which itself acknowledges that the right to remain silent continued in effect -- and he then advised Hartley, \"Now is the time if you are going to make a\n\nstatement. Now is the time to do it.\" The phrase \"if you are going to make a statement\" could only mean one thing: that it was Hartley's choice to talk or not to talk.\n\nIn the face of Agent Frieberg's statement to Hartley that reacknowledged the existence of his right to remain silent, it is difficult to understand the majority's insistence on fresh warnings in this case. Surely, the majority's holding that new warnings should have been administered to Hartley does not stem from a concern that Hartley did not know that he had the right to remain silent. He had been told that on two occasions already that same morning. As recently as 9:15 a.m. -- about an hour and a half before Agent Frieberg's statement -- Hartley had asserted his right to silence in unmistakable terms: \"I don't believe I want to make a statement at this time,\" and the FBI agents demonstrated their respect for that decision by directing Hartley to delete the pertinent language from the waiver form. Moreover, the trial court specifically found as a fact that Hartley \"knew that he did not have to make a statement.\"\n\nSignificantly, several courts have observed that the repetition of the Miranda warnings tends to reduce their importance to a suspect: \"The more times police inform a suspect of his rights in the face of his repeated invocation of one of those rights -- the right to remain silent -- the clearer it becomes that the police must not mean what they say.\" United States v. Hernandez, 574 F.2d 1362, 1368 (5th Cir.1978). This Court has expressed similar reservations, which the majority opinion ignores, about requiring repeated Miranda warnings: \"'To adopt an automatic second-warning system would be to add a perfunctory ritual to police procedures rather than providing the meaningful set of procedural safeguards envisioned by Miranda.'\" State v. Magee, supra, 52 N.J. at 374 (quoting People v. Hill, 39 Ill. 2d 125, 132, 233 N.E. 2d 367, 371, cert. denied, 392 U.S. 936, 88 S. Ct. 2305, 20 L. Ed. 2d 1394 (1968)).\n\nUnder the circumstances of this case, Agent Frieberg's reacknowledgement of Hartley's right to remain silent was as effective a means of informing Hartley of the continued existence of his right to silence as would have been yet another verbatim recitation of the same \"Advice of Rights\" form that the FBI agents had read to Hartley on two prior occasions that day. I would conclude that Hartley's right to cut off questioning was \"scrupulously honored\" by virtue of the express reacknowledgement of that right incorporated in Agent Frieberg's statement. Based upon that conclusion and the trial court's factual finding that Hartley's waiver of his right to silence was knowing, intelligent, and voluntary, I would affirm the trial court's and the Appellate Division's determination that Hartley's confession to the FBI and his subsequent confession to the Atlantic City police were admissible.\n\nIV\n\nAs stated, I disagree strongly that the requirement of fresh Miranda warnings has any application to this case, since Hartley was well aware of his Miranda rights and understood that his right to remain silent was still in effect. I also disagree that this \"bright line\" rule will serve to clarify this already complex area of the law for law-enforcement officials. The rule does not end the inquiry as to whether a suspect's Miranda rights have been \"scrupulously honored.\" With or without fresh Miranda warnings, the facts and circumstances of every custodial interrogation must be examined carefully and pragmatically to determine whether a suspect's right to cut off questioning has been protected. All that the rule will do is serve as a basis for suppressing confessions not preceded by the mandatory rewarning. Once it has been established that the fresh warnings were administered, the trial court must proceed to determine if the suspect's rights were \"scrupulously honored.\"\n\nThis \"bright line\" rule, intended by the majority to constitute a minimum standard for compliance with Mosley, may well be interpreted by law-enforcement officials as a simplistic prerequisite to the reinterrogation of suspects who have previously asserted the right to silence. Such an interpretation would divert the focus of the police away from the principles of Miranda that should ultimately guide the conduct of those law enforcement officials who have responsibility for custodial interrogations. Moreover, because the rule will compel the warnings to be readministered to suspects who have already been read their Miranda rights at least once, an atmosphere of meaningless ritual will inevitably accompany the repeated incantation of the same set of rights to the same suspect by the same police officer. Such ritual, I suggest, will not \"scrupulously honor\" a suspect's Miranda rights but will breed disrespect for them.\n\nI suspect that this \"bright line\" rule will generate exaggerated police testimony, perfunctory warnings, and a multiplicity of exceptions. I believe it neither advances the constitutional rights of criminal defendants nor the important objectives of law enforcement.\n\nV\n\nAlthough, based on my view of the record, Hartley's confession to the FBI should be admissible in evidence, I feel constrained to comment on the majority's suppression of the later, rewarned confession to the Atlantic City police. The majority suggests two approaches to the question of the admissibility of the second confession. The first approach \"reaches the conclusion that the process that produced the second statement was so inextricably entwined with the first interrogation procedure as to be part of that same procedure.\" Ante at 279. By treating the two confessions as the result of an indivisible procedure of interrogation, the majority excludes the second confession for precisely the same reasons it excludes the first.\n\nOn this analysis, I would hold the second confession admissible for precisely the same reasons I would the first, viz., that both confessions were voluntary waivers of a right to remain silent scrupulously honored by the custodial authorities.\n\nThe majority also analyzes the two confessions as \"separate and distinct,\" and is thus required to invoke the \"fruit of the poisonous tree\" doctrine to exclude the second, rewarned, confession from evidence. In reaching this conclusion, the majority attempts to reconcile it with the Supreme Court's decision in Oregon v. Elstad, 470 U.S. 298, 105 S. Ct. 1285, 84 L. Ed. 2d 222 (1985). In that case, police officers had gone to the defendant's home for the purpose of arresting him as a suspect in a residential burglary. An officer, before administering Miranda warnings, told Elstad that he believed Elstad was involved in the crime. Elstad responded to the officers' comments with the words, \"Yes, I was there.\" He was then taken to the local sheriff's office and gave a full confession after being administered Miranda warnings. The Oregon Court of Appeals held the confession to be inadmissible. The Supreme Court reversed, noting that the failure by law-enforcement officials to administer Miranda warnings did not constitute a constitutional violation. \"The failure of the police to administer Miranda warnings does not mean that the statements received have actually been coerced * * *.\" Id. at , 105 S. Ct. at 1294, 84 L. Ed. 2d at 233.\n\nSince the failure of the police initially to administer Miranda warnings was found by the Court not to be inconsistent with the voluntariness of Elstad's first admission, the Court concluded that the subsequent confession following the full Miranda warnings was admissible:\n\nIf errors are made by law enforcement officers in administering the prophylactic Miranda procedures, they should not breed the same irremediable consequences as police infringement of the Fifth Amendment itself. It is an unwarranted extension of Miranda to hold that a simple failure to administer the warnings, unaccompanied by any actual coercion or other circumstances calculated to undermine the suspect's ability to exercise his free will so taints the investigatory process that a subsequent voluntary and informed waiver is\n\nineffective for some indeterminate period. Though Miranda requires that the unwarned admission must be suppressed, the admissibility of any subsequent statement should turn in these circumstances solely on whether it is knowingly and voluntarily made. [ Id. at , 105 S. Ct. at 1293, 84 L. Ed. 2d at 232.]\n\nThe majority today holds that although the failure of the police in Elstad to administer \"the prophylactic Miranda procedures\" did not render Elstad's first statement involuntary, the failure by the FBI in this case to readminister the \"prophylactic Miranda procedures,\" after Hartley had already received them twice, necessarily caused Hartley's first confession to be involuntary. Ante at 277-278. The Court reaches this conclusion as a matter of law, disregarding the finding by the trial court in this case that Hartley's confession was voluntary and not coerced. The majority's conclusion appears to be inconsistent with the decision in Elstad.\n\nThere is a tenable distinction between a confession obtained, as in Elstad, voluntarily but not preceded by Miranda warnings, and a confession obtained by coercion or by blatantly disregarding a suspect's asserted right to counsel or to remain silent. In an attempt to distinguish Elstad, the majority characterizes this case as one \"concerning [a] suspect[ ] whose invocation of [his] right to remain silent and to have counsel present were flatly ignored while police subjected [him] to continued interrogation.' Ante at 276 (quoting Oregon v. Elstad, supra, 470 U.S. at , 105 S. Ct. at 1296 n. 3, 84 L. Ed. 2d at 234-35 n. 3) (emphasis added). In so doing, the majority does not acknowledge the distinction drawn by the Elstad Court \"between the direct consequences flowing from coercion of a confession by physical violence or other deliberate means calculated to break the suspect's will and the uncertain consequences of disclosure of a 'guilty secret' freely given in response to an unwarned but noncoercive question * * *.\" Oregon v. Elstad, supra, 470 U.S. at , 105 S. Ct. at 1295, 84 L. Ed. 2d at 234. In Elstad, the Court was simply reaffirming the distinction between violations of prophylactic rules and violations of the underlying constitutional right against compulsory\n\nself-incrimination. Id. at , 105 S. Ct. at 1292 n. 1, 1292, 1293, 84 L. Ed. 2d at 230 n. 1, 231, 232; New York v. Quarles, 467 U.S. 649, 655 n. 5, 104 S. Ct. 2626, 2631, n. 5, 81 L. Ed. 2d 550, 556 n. 5 (1984); Michigan v. Tucker, 417 U.S. 433, 440-48, 94 S. Ct. 2357, 2361-66, 41 L. Ed. 2d 182, 190-95 (1974); Miranda v. Arizona, supra, 384 U.S. at 457, 86 S. Ct. at 1618, 16 L. Ed. 2d at 713. Hence, \"[t]he most realistic reading of Elstad is that the 'fruit of the poisonous tree' doctrine simply does not apply to Miranda violations -- whether the 'fruit' is a second confession or a witness or physical evidence.\" Kamisar, \"Heavy Blow Delivered by Miranda Decision,\" The National Law Journal, Sept. 2, 1985, at S-22; see also Martin v. Wainwright, 770 F.2d 918, 928 (11th Cir.1985) (Mosley violations, absent actual coercion, violate the \"technical requirements of Miranda, but [do] not violate the Fifth Amendment itself.\"); \"The Supreme Court, 1984 Term -- Leading Cases,\" 99 Harv.L.Rev. 120, 142-151 (1985) (under Elstad courts must find actual, not presumed, coercion in obtaining original statement in violation of Miranda in order to bar admission of derivative evidence). Although the majority denominates the violation as one of constitutional magnitude, ante at 282, it follows from Elstad that the \"fruit of the poisonous tree\" doctrine does not apply to a Mosley violation where that violation was simply a failure to give the prophylactic Miranda warnings a third time.\n\nIn this case, there is no finding that Hartley's confession was coerced, and the majority's conclusion that his right to remain silent was not \"scrupulously honored\" is not based on objective findings, but is a self-imposed result based solely on the new requirement of fresh Miranda rewarnings. The majority's holding that the failure to give the third Miranda warning to Hartley taints his subsequent confession to the Atlantic City police is irreconcilable with the holding in Elstad that the failure to give the first Miranda warning did not bar the second confession in that case.\n\nFor the reasons stated, I would affirm the judgment of conviction.\n\n\u003cspan class=\"fn\"\u003e1. We are confident that by now the police are intimately familiar with Miranda and what that case requires by way of warnings. \"Prior to any questioning the [accused] must be warned that he has a right to remain silent, that any statement he does make may be used as evidence against him, and that he has a right to the presence of an attorney, either retained or appointed.\" Miranda v. Arizona, 384 U.S. 436, 444, 86 S. Ct. 1602, 1612, 16 L. Ed. 2d 694, 707 (1966).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. We denied certification on the issue of whether the police initially had conducted a lawful search of defendant's apartment in New York. 97 N.J. 605 (1984). Thus, in accordance with Rule 2:2-1(a)(2), the case is now limited to only that issue in respect of which the dissent was filed, namely, whether the authorities violated defendant's right to remain silent.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The anxiety of the federal agents was understandable in view of the fact that several hours had passed since Hartley's arrest and nearly six hours had elapsed from the time of his arrest to the time he was finally taken for arraignment. The agents came perilously close to violating the federal speedy-arraignment requirement: \"An officer making an arrest under a warrant * * * shall take the arrested person without unnecessary delay before the nearest available federal magistrate * * *.\" Fed.R.Crim.P. 5(a). Even if such a violation would not have led to the dismissal that the agents obviously dreaded, it seriously risked suppression of any statement obtained. See Mallory v. United States, 354 U.S. 449, 77 S. Ct. 1356, 1 L. Ed. 2d 1479 (1957); 18 U.S.C.A. ยง 3501 (1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. With respect to the exercise of the right to counsel arising in a Fifth Amendment context, for example, the Supreme Court noted that \"additional safeguards are necessary when an accused asks for counsel.\" The safeguard provided was a \"bright-line\" rule that prohibits all questioning, once an accused has invoked the right to counsel, \"unless the accused himself initiates further communication, exchanges or conversations with the police.\" Edwards v. Arizona, 451 U.S. 477, 484-85, 101 S. Ct. 1880, 68 L. Ed. 2d 378, 386, reh'g denied, 452 U.S. 973, 101 S. Ct. 3128, 69 L. Ed. 2d 984 (1981). The Court observed \"that it is inconsistent with [the prophylactic rules of] Miranda and its progeny for the authorities, at their instance, to reinterrogate an accused in custody if he has clearly asserted his right to counsel.\" Edwards v. Arizona, supra, 451 U.S. at 485, 101 S. Ct. at 1885, 68 L. Ed. 2d at 387. See Solem v. Stumes, 465 U.S. 638, 641, 104 S. Ct. 1338, 1340, 79 L. Ed. 2d 579 (1984). It is arguable that the Court would consider the failure to respect a suspect's invocation of the right to counsel under the Sixth Amendment as one that does not rise to the level of a constitutional violation but simply violates an ancillary safeguard under Miranda. E.g., Michigan v. Jackson, 475 U.S. , 106 S. Ct. 1404, 89 L. Ed. 2d 631 (1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. As support for its perception that a failure to give Miranda warnings after a suspect has availed himself of the right to remain silent constitutes a violation of \"constitutional magnitude,\" the majority turns to Miranda v. Arizona, supra, 384 U.S. 436, 86 S. Ct. 1602, 16 L. Ed. 2d 694, itself, which it proclaims \"could scarcely be clearer in that regard.\" Ante at 273. However, the Miranda language cited merely provides support for the proposition that an invocation of the right to remain silent requires that questioning immediately cease. This gave rise to the Mosley decision, now at issue, which addressed the problem of when interrogation might properly resume. At no time did the Miranda court forecast the consequences of a failure to \"scrupulously honor\" the claimed right to remain silent, a standard not adopted until nine years later in Mosley.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The majority rule may be interpreted to encourage law enforcement authorities to delay imparting Miranda warnings in anticipation of eliciting a voluntary confession, subject to an Elstad type analysis, rather than the per se involuntariness that follows any confession subsequent to a Miranda warning that is not \"scrupulously honored\" by renewed warnings. Police officers, however, should recognize that any bad faith underlying the failure to give required Miranda warnings, directed as a subterfuge to the majority's \"bright-line\" rule, will be strictly scrutinized under a \"voluntariness\" test.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. See Kamisar, \"The Edwards and Bradshaw Cases: The Court Giveth and the Court Taketh Away,\" 5 The Supreme Court: Trends and Developments 1982-83, 153 (1984) (citing People v. Grant, 45 N.Y. 2d 366, 371-72, 380 N.E. 2d 257, 260, 408 N.Y.S. 2d 429, 432 (1978)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. While confined in the County Jail awaiting trial, defendant filed pro se motions to suppress evidence and to compel inspection of the affidavit used to obtain a search warrant for his apartment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. For a critique of the majority opinion, see Kamisar, supra note 1, at 163-69.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. I agree with the majority's determination to follow Mosley rather than adopt, on state constitutional grounds, a rule prohibiting interrogation unless in the presence of counsel or after the accused voluntarily indicates a willingness to make a statement. Concededly, the distinction between a request for counsel and an assertion of the right to remain silent is narrow. However, it is probably fair to construe a request for counsel as a more emphatic and more permanent rejection of police interrogation than a refusal to answer questions. It is appropriate to recognize that suspects may be uncertain whether they will serve their own interests better by silence or by cooperation with the police. In this case, appellant may have been eager to communicate the fact that he was not directly responsible for the homicides. The majority's adoption of the Mosley rule indicates that the public interest in permitting inculpatory statements by persons in custody is sufficient to justify renewed but restrained communication by law-enforcement officials with suspects who have initially asserted their right to remain silent. I believe this to be the proper approach. However, its adoption by the majority should be accompanied by a clear warning to law enforcement officials that inculpatory statements made by the accused after asserting a right to remain silent will be inadmissible if the accused's rights have been overborne by direct or indirect pressure. The majority's per se rule requiring mandatory rewarning focuses on a formalistic procedure and in my view does not adequately emphasize the substantive conduct required of law enforcement officials after an accused has asserted his right to remain silent. See infra at 270-272.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Justice Handler, in his separate opinion, agrees that the trial court's determination as to the voluntariness of Hartley's statement is \"clearly sustainable in the record.\" Ante at 303.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Indeed, the trial court found: \"I do not believe that there was any coercion or any threats or any force or any improper conduct on the part of the authorities.\"\u003c/span\u003e\n\n",
    "body_length": 150968,
    "citedas": [
      "511 A.2d 80",
      "103 N.J. 252"
    ],
    "attorneys": "William E. Norris, Designated Counsel, argued the cause, for appellant (Joseph H. Rodriguez, Public Defender, attorney). Jay H. Hindman, Deputy Attorney General, argued the cause, for respondent (Irwin I. Kimmelman, Attorney General of New Jersey, attorney, Thomas J. Santangelo, Deputy Attorney General, of counsel and on the brief).",
    "category": [
      "36",
      "75"
    ],
    "judges": "For reversal and remandment -- Chief Justice Wilentz and Justices Clifford, Handler, Pollock, O'Hern and Garibaldi. For affirmance -- Justice Stein. The opinion of the Court was delivered by Clifford, J. Handler, J., concurring in the result and dissenting in part. Handler, J., concurring in part and dissenting in part. Stein, J., dissenting.",
    "citation_count": 102
  }
}
