{
  "id": "doU5P2YBTlTomsSBEe4g",
  "document": {
    "title": "Thompson v. Bell",
    "full_title": "GREGORY THOMPSON -APPELLANT, v. RICKY BELL, WARDEN -APPELLEE.",
    "jurisdiction": "Sixth Circuit",
    "date": "2003-01-09T00:00:00.000Z",
    "docket": "No. 00-5516",
    "body": "RECOMMENDED FOR FULL-TEXT PUBLICATION Pursuant to Sixth Circuit Rule 206\n\nELECTRONIC CITATION: 2003 FED App. 0006P (6th Cir.)\n\nArgued: November 1, 2001\n\nSUHRHEINRICH, J., delivered the opinion of the court. MOORE, J. (p. 47), delivered a separate opinion concurring in the result. CLAY, J. (pp. 48-73), delivered a separate dissenting opinion.\n\nOPINION\n\nI. Introduction\n\nPetitioner-Appellant Gregory Thompson (\"Thompson\") was convicted of first degree murder and sentenced to death in the Tennessee state courts. He appeals from the order of the district court denying his motion to alter or amend its grant of summary judgment to Respondent Warden Ricky Bell (\"Bell\") on Thompson's application for a writ of habeas corpus under 28 U.S.C. § 2254. This Court granted a certificate of appealability as to all issues presented.\n\nPetitioner's principal argument on appeal is that he was denied his Sixth Amendment right to effective assistance of counsel in both the guilt and penalty phases of his capital trial because his trial attorneys failed to investigate and present evidence regarding his mental illness and social history and failed to present evidence in support of a life sentence. Because we find that Thompson has presented no evidence that he was mentally ill at the time of the crime or at trial, we AFFIRM the judgment of the district court.\n\nII. Background\n\nA. Facts\n\nThe following facts involving the underlying crime are summarized by the Tennessee Supreme Court:\n\nOn December 29, 1984, Thompson and Joanne McNamara, a juvenile female, traveled by bus from Marietta, Georgia, to Shelbyville in Bedford County, Tennessee. They presented themselves as a married couple at the home of Willa Mae Odum, an acquaintance of McNamara's family who allowed them to stay. Ms Odum learned the two were not married and asked Thompson to leave, but he remained through the night of December 31, waiting for a relative to wire him funds for a bus ticket. The following morning, January 1, Ms. Odum again insisted that Thompson leave, and she called the authorities to report that Joanne was a runaway. This call apparently prompted their departure. The couple, having little money and no transportation, spent the afternoon at a nearby Wal-Mart store.\n\nLate that same afternoon, January 1, 1985, Brenda Lane, a local resident, made several purchases at the Wal-Mart, and did not arrive home when expected. Shortly after midnight her yellow Chevrolet was reported on fire near an apartment building in Marietta, Georgia. Thompson and McNamara were arrested by Cobb County authorities in connection with this investigation on the night of January 2. A traffic ticket in Thompson's jacket showed he had been cited for speeding, while driving Mrs. Lane's vehicle, at 8:25 p.m., on Interstate 24 near the Jasper-South Pittsburgh exit, the last exit before the Georgia line. A Wal-Mart receipt and several items in the vehicle indicated a purchase at that store at 5:51 p.m. January 1. A button found in the car matched those on Thompson's clothing.\n\nA few hours later, while in custody, Thompson gave a statement admitting that he had abducted a woman at knifepoint from the Wal-Mart location in Shelbyville and had forced her to drive him and his companion, in her car, to a remote location outside Manchester, Tennessee. There he had stabbed her, driven the car over her body, and left her. He and McNamara had returned to Marietta and attempted to burn the vehicle. He also drew a map illustrating the route from the town to the site of the stabbing and describing several structures and other features along the way. He spoke on the phone with authorities in Manchester to clarify his directions.\n\nIn the early morning hours of January 3, a team of searchers following Thompson's directions found Brenda Lane at the place indicated in his statement. She was dead from multiple stab wounds to her back. Two of the four wounds had been fatal, penetrating her right lung and causing her to bleed to death. A forensic pathologist testified that she would not have died immediately, but would have remained conscious for five to ten minutes. At the scene she lay on her back, her body arched, her heels dug into the ground. One hand clutched several blades of grass, and the other held a tissue. There was no evidence that she had, in fact, been run over by a vehicle. There was no evidence of a struggle, and apart from the stab wounds Ms. Lane was not injured. State v. Thompson, 768 S.W.2d 239, 243 (Tenn. 1989).\n\nB. Pretrial Preparation\n\nOn January 29, 1985, the trial court appointed H. Thomas Parsons and John W. Rollins to represent Thompson. On February 26, 1995, Parsons filed a notice of insanity defense and also requested a mental or psychological evaluation of Thompson to determine whether he was competent to stand trial, and to further determine his mental capacity at the time of the crime.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e On March 25, 1985, trial counsel filed a supplementary motion for a psychiatric examination and a neurological examination to determine whether Thompson was competent to stand trial and assist counsel with his defense, whether Thompson was suffering from a mental illness on the date of the offense, and whether he was in need of hospitalization for further psychiatric treatment and evaluation. In support, Parsons attached an affidavit stating that Thompson had previously suffered two concussions, one when he was sixteen years old from a car accident, and the second while in the Navy, when he was beaten in the head with a hammer by three fellow servicemen.\n\nOn March 28, 1985, the trial court ordered that Thompson be referred to the Multi-County Mental Health Center for a forensic evaluation to determine his competency to stand trial and to assist in his own defense, and his mental capacity at the time of the crime.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e On April 4, 1985, the trial court entered another order directing Thompson to undergo a forensic evaluation at a state facility, Middle Tennessee Mental Health Institute (\"MTMHI\"), for a maximum of thirty days. A team of forensic psychiatrists and psychologists at MTMHI evaluated Thompson. They found Thompson to be competent.\n\nTrial counsel questioned the impartiality of the state psychiatrists and psychologists and requested funds to secure further psychiatric evaluations.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e On July 29, 1985, the state trial court granted the request. The order provides in relevant part:\n\nThis cause came to be heard on the 10th day of July, 1985 . . . upon the request of defendant's attorneys for the Court to approve the expenses for a private evaluation of the defendant by a private psychiatrist and for the purpose of affording counsel the benefit of private expert psychiatric consultation in regards to the defendant . . . .\n\nThe Court is of the opinion that the Motion for resources is well taken . . . and that expert consultation is necessary to ensure that the constitutional rights of the defendant are properly protected.\n\nAccordingly it is hereby ORDERED that the charges of said psychiatrist . . . shall be paid by the executive secretary of the Supreme Court of the State of Tennessee for services performed by them on behalf of the defendant.\n\nIn spite of the court order approving a psychiatrist to examine Thompson, counsel used the court-ordered mental health funds to hire Dr. Copple, a clinical psychologist.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Doyle Richardson, one of Thompson's trial counsel, stated subsequently that the effort to hire a psychiatrist simply \"was not successful.\"\n\nAs part of their pretrial preparation, counsel also traveled to Thompson's home town, Molena, Georgia. There, they interviewed police officers, Thompson's teachers, his grandmother, his step grandfather, sister, brother, cousin, and several neighbors.\n\nC. Trial Proceedings\n\nThompson presented no proof during the guilt phase of the trial, and the jury convicted him of first degree murder of Brenda Lane. Thompson,768 S.W.2d at 244. Trial counsel testified at the post-conviction hearing that they felt the guilt phase case could not be defended.\n\nDuring the sentencing phase, Thompson called a number of witnesses, including former high school teachers, acquaintances, his grandparents, two siblings, and a cousin. All described Thompson as non-violent, cooperative, and responsible. Id. Witnesses described in detail his childhood and family circumstances in Georgia until he left in 1979 to join the Navy. The Tennessee Supreme Court noted in its opinion that, \"while [Thompson's] family was poor, it was also good and loving.\" Id.\n\nArlene Cajulao, Thompson's girlfriend while he was stationed with the Navy in Hawaii, testified that she knew Thompson from December 1980 until June 1984. She described their relationship as good, one that she was \"very proud to have experienced,\" and stated that Thompson was caring and sensitive. She testified that Thompson suffered a head injury when three of his fellow service members attacked him with a crow bar and that he became paranoid and unreasonably concerned about his and her personal safety thereafter. Id. On cross-examination, Cajulao testified to incidents concerning Thompson's violent behavior in the Navy. She stated that Thompson was discharged from the Navy after being court-martialed for shoving a petty officer and either dislocating the officer's shoulder or breaking his collar-bone. Cajulao acknowledged that Thompson had other violent episodes in the Navy. Id.\n\nThompson's sister, Nora Jean Walton, and his brother-in-law testified about Thompson's activities in Georgia upon his return from Hawaii after his discharge from the Navy. Id. While in Georgia, Thompson became involved in a relationship with Joanne McNamara. Walton testified that Thompson told her that McNamara's mother was trying to force McNamara into prostitution. Id.\n\nCopple also testified at sentencing. Copple is a clinical psychologist, licensed in the State of Tennessee. He obtained his Ph.D in clinical psychology from the University of Pittsburgh in 1948. He taught in the psychology department at Vanderbilt University from 1948 to 1969, and ran a clinical practice as well. At Vanderbilt, Copple taught normal psychology courses and the abnormal psychology course, child psychology, and courses in the giving of psychological testing. While at Vanderbilt, he served as the consulting psychologist at Western State Hospital in Hopkinsville, Kentucky. Part of his duties there was to interview patients as to their ability to stand trial. Copple testified that \"the main part of my work over the years--well, all of it--has been clinical psychology.\"\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e He added that the emphasis has differed at times, to include evaluations for social security applicants and vocational evaluations. Copple explained that the former task involved psychological evaluations of individuals alleging they have problems that would prevent them from working, and that vocational evaluations are used for \"helping people reach their vocational goals or choosing vocational goals . . . . \" Copple further stated that the social security evaluations are \"not really industrial psychology. That is clinical psychology, but it is from the standpoint of making a psychological evaluation as relating to whether a person can work anymore or not.\"\n\nCopple testified that he spent roughly eight hours examining Thompson over several sessions. In the first session on May 15, 1985, Copple met with Thompson at MTMHI for three and one-half hours. Copple stated that \"I was looking, at that point, at what things he might be capable of doing in a prison situation.\" Copple started with some ability testing, including a reading level test, a test of mathematical functioning, and a test of mechanical reasoning. Copple also gave Thompson a Career Preference Test.\n\nAt the second session on August 2, 1985, Copple spent about three and one-half hours with Thompson at the Coffee County Jail. At that meeting Copple administered the Minnesota Multiphasic Personality Inventory (\"MMPI\"), the Thematic Apperception Test, the Rotter Incomplete Sentences Blank, and the Rorschach or Ink Blot Test. Copple also had two twenty minute sessions with Thompson after the trial began.\n\nCopple stated that Thompson had the arithmetic level of a seventh grader, and a sixth grade level in reading. Copple also stated that Thompson scored at about the 64th percentile of high school graduates on a standard reasoning test. Copple testified that, in his opinion, Thompson had an unusually strong need to nurture other people, and that this \"exaggerated need for nurturance\" of McNamara, may have led, in part, to the murder of Mrs. Lane. In Copple's view, Thompson's need to nurture \"was very strong, strong enough to impel him to some unwise actions.\" Copple also testified that Thompson exhibited strong remorse for the killing and did not have adult anti-social personality. On cross-examination, Copple stated that he did not think Thompson was suffering from any mental illness.\n\nIn rebuttal, the State presented the deposition testimony of Dr. Robert Glenn Watson, also a clinical psychologist licensed by the State of Tennessee, who had participated in a staff evaluation of Thompson at MTMHI. Watson stated that the purpose of the evaluation was to determine the mental competence of Thompson to stand trial and to determine his mental status at the time of the alleged murder. Watson explained that Thompson received three kinds of examinations; a physical examination, which included an electroencephalogram, a psychological evaluation, and a psychiatric examination. Watson testified that the electroencephalogram showed no sign of brain damage, i.e. the EEG was normal.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nWatson described the tests he personally performed. First, he administered the Wechsler Adult Intelligence Scale, Revised, which assesses intellectual functioning and potential. Watson found that Thompson had a verbal I.Q. of 93, a performance I.Q. of 89, and a full-scale I.Q. of 91, which placed him in the lower-range intellectually, and also indicated \"that there is no intellectual impairment that would play a part in the forensic questions.\" Next, Thompson was given the Wide-Range Achievement Test, primarily for the purpose of assessing his reading ability. Watson explained that this test was chosen because Thompson had claimed he could not read or write. (Id.) Watson found that he was reading at a level better than 70 percent of the test population. Third, Watson gave the Bender Visual Motor Gestalt Test. Watson stated that this test provides a general assessment for brain damage. He further explained that it is a drawing test, and that \"we are looking for evidence of organicity there.\" When asked to explain what he meant by organicity, Watson, replied:\n\nPsycho-motor impairment. This is brain damage. There was a history in his background of a concussion at age 16 with reported hospitalizations. We didn't have the records from that. He also had a history of being hit over the head with a hammer while he was in military service in 1980. We were looking for brain damage.\n\nWatson continued:\n\nThe results of the Bender showed a few errors, but no real evidence of organicity or brain damage. To further test this, the Bender Interference Procedure was done, and what we expect is that the results of that procedure will be worse than the results obtained on the original test . . . [i]f he is suffering from organicity. . . .\n\nWe found less errors on the B.I.P.--the Bender Interference Procedure--than on the original, and this further strengthened our belief that there is no serious organicity here.\n\nWatson also performed the MMPI. He stated that this test was administered for the purpose of assessing deviations from the normal test population, indicative of some type of mental illness or defect. Watson found that the test results reflected malingering. Thompson was further given the Tennessee Self-Concept Scale, which measures the individual's self-concept, but also provides clinical indications of abnormality. Watson stated that the test results showed that Thompson has a good self-concept. Watson continued that only the General Maladjustment Scale was elevated a little bit above average, but not outside normal limits, and that \"these results showed no evidence of marked mental disturbance.\" Watson testified that the psychological tests were therefore consistent with the normal EEG. Because the psychological tests and the EEG were within normal limits, no further organic tests were done.\n\nWatson stated that on May 24, 1985, a staff conference was held in which all the data, including the medical, psychological, and social history, was reviewed and summarized.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e The staff concluded that:\n\n[Thompson] exhibited none of the signs of an affective illness. His judgment and insight are rather poor. Psychological testing revealed him to be functioning in the average range intellectually, to exhibit no signs of organicity or brain damage on the Bender-Gestalt Test and the Bender Interference Procedure. Personality profiles revealed no evidence of a psychosis, but indicated malingering in the mental illness direction. (For example, the schizophrenic score was at T 120, while clinical observations revealed no evidence of a thought disorder.)\n\nThe team diagnosed Thompson as Axis 1, Adult Antisocial Behavior, 071.01.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e The forensic team therefore concluded that Thompson was mentally competent to stand trial and was not suffering from a mental disease or defect.\n\nIn imposing the death penalty at the conclusion of the penalty phase, the jury found three aggravating circumstances pursuant to Tenn. Code Ann. § 39-2-203(i) (1982): (1) the murder was especially heinous, atrocious, or cruel in that it involved torture or depravity of mind, (2) the defendant committed the murder for the purpose of avoiding or preventing his lawful arrest and prosecution, and (3) the murder was committed while the defendant was engaged in committing robbery or kidnapping. The trial court entered judgment sentencing Thompson to death by electrocution. His judgment of conviction and death sentence was affirmed by the Tennessee Supreme Court. Thompson, 768 S.W.2d at 253. The United Supreme Court denied certiorari. Thompson v. Tennessee, 497 U.S. 1031 (1990).\n\nD. State Post-Conviction Proceedings\n\nOn October 16, 1990, Thompson filed his original petition for post-conviction relief in the Coffee County Criminal Court, claiming, inter alia, ineffective assistance of trial counsel.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Thompson alleged in pertinent part that trial counsel failed to: (1) adequately investigate Thompson's background and personal and medical history for the existence of mitigating evidence; (2) request and obtain expert and investigative assistance regarding Thompson's head injuries or to obtain adequate expert assistance regarding Thompson's competency at the time Thompson made incriminating statements to the police; (3) present an adequate defense at trial because they failed to cross-examine numerous witnesses and failed to challenge the prosecutor's implication to the jury during closing arguments that Thompson was required to present a defense; (4) request additional time to prepare witnesses, such as Arlene Cajulao, during the penalty phase of the trial; (5) adequately investigate Thompson's military career, therefore improperly raising the issue of his \"good character\" and opening the door for the prosecution to admit damaging information about him.\n\nOn February 1, 1991, post-conviction counsel filed an ex parte, sealed motion for funds for expert assistance of a psychologist and investigator. In the motion counsel requested \"funds to hire a licensed psychologist or psychiatrist and an investigator to assist in the preparation of his case for post-conviction relief.\" Counsel submitted the affidavit of Dr. Gillian Blair, a licensed psychologist. Blair stated that she reviewed Thompson's post-incarceration medical records, which indicated that Thompson had been variously diagnosed as having bipolar affective disorder, a schizo-affective disorder, and schizophrenia paranoid type, and was taking Lithium, Haldol, and Cogentin. Blair opined that \"[i]f Mr. Thompson is found to be suffering from neurological or psychological impairment as described above, it is likely that some degree of such impairment would have existed at the time of the offense and would have been a significant factor in determining whether or not Mr. Thompson was able to appreciate the wrongfulness of his conduct or to conform his conduct to the requirements of law when he committed the homicide of which he stands convicted.\" Blair stated that Thompson was in need of a full psychological evaluation.\n\nThe state trial court conducted an evidentiary hearing on March 27 and 29, 1995. Both of Thompson's trial counsel testified. Defense attorney Parsons testified that he knew about the head injuries, which included \"one in a car wreck when he was young and at home and another as a result of an assault in the military.\" Parsons also acknowledged that trial counsel attempted to, but did not obtain, all of Thompson's medical records. Parsons indicated that trial counsel did not present evidence at trial of Thompson's head injuries because \"we would had to have some expert proof and we did try to have him tested through the State and they did do some tests on him in an attempt to develop that.\" Parsons further stated that trial counsel also had their own expert, Copple.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nOn cross-examination, Parsons acknowledged that trial counsel had sought a mental evaluation and that it failed to show mental illness or defect. Parsons further agreed that since there was virtually no likelihood that another psychiatrist could find mental illness, counsel \"wanted to develop from Dr. Copple his testimony that [Thompson] had some positive characteristics, had abilities that would be beneficial to society wherever he was.\" Nonetheless, in response to the question that there was no evidence of organicity and that Copple had concluded that Thompson was sane, Parsons stated:\n\nThe thing that struck me so strongly throughout this whole case was really to do with that, and that was the difference in the man when he lived in Georgia and grew up there and what kind of person he was as opposed to someone who committed--allegedly committed this act, this murder and that was a tip off that there may well have been some kind of brain injury, but I didn't know a whole lot about that at the time but since, I have found that most closed head injuries will do a lot of things, and we read some articles, one of which you will get in this discovery about that.\n\nParsons further reflected that\n\nWell, I could never figure out why it happened, assuming it happened, assuming he killed her. Of course, either he did or his girlfriend did but I could never understand how he could do it. I couldn't understand that then and why, because there were other alternatives. Why? That puzzled me and everybody else, I think, associated with this case all the way through it.\n\nRegarding efforts to find a psychiatrist Parsons stated:\n\nI do want to say this and this is sincere. You know, we were required to send him for the evaluation, we felt, at the Middle Tennessee Mental Health Institute. I have literally no faith in any conclusion that comes out of that place, then or now. I didn't have any faith in what came out of it then. I still thought something might be wrong but we didn't have any other place to go that we knew of.\n\nNotwithstanding, Parsons denied that trial counsel failed to pursue the head injury theory, although he conceded that \"we may have not pursued it enough.\"\n\nCo-counsel Richardson testified that Thompson told counsel about his head injuries and that they followed up on that by hiring \"Copple, a clinical psychologist, [who] gave him a battery of tests in respect to that.\"\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Richardson acknowledged that the team at MTMHI found no evidence of organicity, but added that \"we wanted a psychiatrist of our own.\" Richardson stated:\n\n[We d]id try to hire a psychiatrist but that was not successful and it was, you know, it was the type [of] thing it was a theory as to whether to go with his good character and reservoir of moral upbringing, a man with a great deal of ability that could be used in the penitentiary and a life sentencing. I doubt if there will ever be another man on death row that had as good a background as he did. I don't know of any, and then the question as to whether to mix into that or try to accentuate some brain damage that we hadn't been able to spot, but at the same time, probably with some more digging may [sic] could have and then give the jury the idea that this man, if he ever gets out of prison with some brain damage, he will kill . . . somebody else, that is kind of counter productive. We went with one strategy and probably if we had to do it over again, would go with the other strategy because that one didn't work.\n\nHowever, when asked: \"[o]f course, it is speculation you could have found a psychiatrist to say he had brain damage?\" Richardson stated that he \"[p]robably could have.\"\n\nDr. Gillian Blair testified next. Blair is a clinical psychologist, with a master's degree in developmental and clinical psychology from Vanderbilt, and a Ph.D. in developmental and clinical psychology from Vanderbilt. After graduating from Vanderbilt in 1988, Blair worked at MTMHI as a psychologist in their Forensic Services Department and at the same time maintained an appointment at the Vanderbilt Psychiatry Department. In 1989 she went into private practice.\n\nBlair testified that she began reviewing Thompson's institutional records in 1990, including the records from the assessment at MTMHI in 1985. She interviewed Thompson several times in March and April 1992 while he was incarcerated at Riverbend Maximum Security Institution. At that time Blair administered \"a basic psychological battery of tests with some additional . . . neuropsychological tests because of the history of head injuries that Mr. Thompson had received and that were well documented in his medical record.\"\n\nBlair testified that, based on the review of Thompson's medical record, she formed the following opinion:\n\nThe Riverbend medical record indicated that since 1985, Mr. Thompson had shown a deteriorating mental status. He had become psychotic. He had been treated with anti-psychotic medication at that time. He was treated with Haldol, Cogentin, and Lithium, and three different treating psychiatrists at that time: Dr. Dyner [sic], Dr. Deal, and Dr. Humble had all over the years from 1985 to 1990 had diagnosed him as either having bipolar disorder or a schizo affective disorder or schizophrenia. They described his agitated behavior. They described his hostility. They described his inappropriate affect, his experience of auditory hallucinations, his delusions, his paranoia, his thoughts of persecution. He had attempted suicide on a couple of occasions. He had set fire to his cell burning both his hands and his face. They had certainly--two of those psychiatrists and maybe all three of them had considered the possibility that he was malingering, that he was faking mental illness and throughout their Riverbend records, it was clear that those psychiatrists had discounted the possibility of malingering because they didn't feel that it accounted for all of the psychotic symptoms they saw in him.\n\nWhen asked what other facts would be necessary for her to develop an opinion as to Thompson's condition at the time of the offense, Blair stated that \"the most important thing that would be necessary would be a full history and full medical records of Mr. Thompson prior to the commission of the offense.\" She added:\n\nFrom the records I was able to review, it was clear that the social history was very sketchy in terms of his remote history, his childhood and his upbringing, and also family history of mental illness. There seemed to be a [sic] strong evidence to suggest that there was mental illness in his family, probably in his father who committed suicide and was known to be extremely violent and possibly in his mother but none of those records were available.\n\nShe therefore stated that she did not have an opinion about Thompson's diagnostic status in 1985.\n\nOn cross-examination, Blair testified that she reviewed all of the records that are in the medical record from MTMHI. This included daily progress notes, medication sheets, the report of the psychological testing, the discharge summary, the admission summary, the staff conference report, and the social worker's history. When asked if she thought any of the test procedures were unreliable, she stated that she did not review the raw test data. When asked if she thought that the testing procedure done at MTMHI in 1985 was unreliable, Blair responded: \"I don't think it was unreliable. I think that it was not extensive enough.\" When asked what tests she performed, Blair explained:\n\nThe tests that I administered in 1992 that directly addressed whether there was psychosis or not, I administered the PAI, I administered the MMPI II which replaces the MMPI which was administered in 1985. I administered the Rorschach which was not administered in 1985. The PAI was not administered in 1985. I administered the MCMI II and I administered the Rorschach, which is a projective test of personality which was not--the others are all objective. They are all tests in which an individual answers true or false and the Rorschach is very different.\n\nBlair stated that from her battery of tests, she did not conclude that Thompson was faking or attempting to fake mental illness.\n\nOn May 15, 1995, the post-conviction court denied Thompson's claim, including his ineffective assistance of counsel claim and his request for funding to hire an expert. The court found:\n\n1.Defense counsel made an adequate investigation of their client's background and prior medical history. Present counsel presented no proof of mental problems on the part of Mr. Thompson that would have been a defense to the charge, or that would constitute a shield against execution.\n\n2.Counsel did not seek expert and investigative assistance regarding alleged head injuries to Mr. Thompson during his youth, or to testify as to his incompetency at the time of his confession, because the facts and circumstances did not indicate the necessity for such action.\n\n3.Counsel did not fail to present an adequate defense at trial. The facts simply left them with no effective defense.\n\nThompson appealed to the Tennessee Criminal Court of Appeals. He alleged that his trial attorneys were ineffective for failing to (1) interview witnesses who could have aided in his defense, especially during the penalty phase, (2) adequately investigate his prior head injuries, and (3) adequately prepare the defense witnesses.\n\nThe Tennessee Criminal Court of Appeals affirmed. See Thompson v. State, 958 S.W.2d 156 (Tenn. Crim. App. 1997). It concluded that Thompson failed to demonstrate any psychological impairment that may have existed which would have constituted mitigating evidence or that Thompson's alleged head injuries had any effect upon his mental stability at the time of the murder. Id. at 165.\n\nAs for Thompson's claim that trial counsel were ineffective for failing to interview witnesses to show that his head injuries might have contributed to his commission of the crime, including among others, his step-father, attorney in the military, and the mother of his co-defendant, the court found that Thompson was unable to show prejudice because none of the witnesses testified at the post-conviction hearing. See id. at 163-64. \"We cannot speculate upon the usefulness of these witnesses without the information they could have provided.\" Id. at 164.\n\nRegarding the failure to investigate alleged head injuries, the Tennessee Court of Criminal Appeals held:\n\nHaving determined there is a duty to investigate whether any psychological impairments might qualify as mitigating evidence, we nonetheless conclude that the petitioner has failed to demonstrate any prejudice from the failure of trial counsel to further investigate the head injuries. The petitioner has failed to establish that the head injuries had any effect upon his mental stability at the time of the murder. Further, he has failed to establish that any type of psychological impairment in general may have existed which would have been mitigating evidence. Because Dr. Blair declined to give an opinion on these important issues, the evidence does not preponderate against the trial court's finding that the defense attorneys were not ineffective.\n\nThe decision not to further pursue the head injuries in the penalty phase of the trial also qualified as a reasonable strategy. Trial counsel's decision to emphasize the petitioner's positive qualities rather than to suggest brain damage, while unsuccessful, was based upon adequate investigation. [T]he fact that a particular strategy or tactic failed or even hurt the defense does not, alone, support a claim of ineffective assistance. Deference must be given to an informed trial strategy. . . . Because two experts did not detect brain damage, counsel cannot be faulted for discarding a strategy that could not be supported by a medical opinion. Id. at 165 (emphasis added; internal quotation omitted).\n\nThe Tennessee Court of Criminal Appeals further rejected Thompson's claim that trial counsel did not properly prepare defense witnesses to testify, particularly, Arlene Cajulao, thereby permitting the state to inquire about his negative military history. The court found:\n\nAt the post-conviction hearing, Attorney Parsons recalled wishing that he had more time to meet with the witness. He testified that his strategy at trial was to humanize the petitioner by calling sympathetic witnesses. He was aware of the state's opportunity to rebut any positive testimony about the petitioner and conceded that his only other option would have been to present no mitigating evidence at all.\n\nAttorney Richardson testified that \"[t]here were certain witnesses that we had to face a problem of them bringing up the problems that he had in the Navy.\" He realized that the cross-examination of Ms. Cajulao might be risky but \"didn't realize we would have it to the extent that it ended up we had. . . .\"\n\nIn our view, defense counsel's awareness of the possible dangers inherent in the cross-examination and their decision to present her positive testimony anyway was a classic tactical decision. Because the strategy was based upon adequate preparation, this court must not second guess. . . .\n\nMoreover, there is nothing in the record to suggest that additional preparation time with the witness could have prevented the state from effectively cross-examining her. If Ms. Cajulao were to testify at all to the petitioner's prior military background, the state would be entitled to rebut that testimony. In summary, we cannot hold that the evidence preponderated against the finding of the trial court that trial counsel had performed effectively. Id. at 166.\n\nLastly, the Tennessee Court of Criminal Appeals rejected Thompson's ineffective assistance of counsel based on the claim that trial counsel opened the door to damaging evidence at the penalty phase. Thompson had complained that the state was allowed to present damaging evidence in rebuttal through Dr. Watson because trial counsel asked Copple about his good qualities. The Tennessee Court of Appeals reasoned:\n\nAttorney Richardson admitted, \"I frankly did not know that . . . the [s]tate could use information given by the defendant to a psychiatrist.\" Attorney Parsons testified that their strategy was to emphasize positive attributes of the petitioner and show the jury that he could lead a productive life in prison. Dr. Copple's testimony played a key role in this strategy. Although both trial attorneys apparently were surprised by the fact that the state could use the information acquired by MTMHI, Attorney Parsons did acknowledge that he knew that positive testimony by Dr. Copple would open the door for the state to present negative information.\n\nAgain, the petitioner has failed to establish any prejudice by whatever deficiency there may have been in the performance of counsel. The evidence does not preponderate against the finding that the sentence would have been different if the attorneys had known the information collected by MTMHI would have been admissible. In our view, trial counsel had little choice other than to call Dr. Copple in an effort to establish adequate mitigating circumstances. Even if there had been proof that trial counsel should have pursued a different strategy, there has been no indication that another strategy would have been more effective. Because the jury found three aggravators, we cannot conclude that the outcome would have been any different if the jury had not heard the evidence concerning the testing by MTMHI. If any witness testified to the petitioner's good character, the state would have been entitled to rebuttal. The only other option would have been to present no proof at all. As Attorney Richardson noted, the petitioner had a relatively productive background; the failure to present some evidence of his prior good behavior might have qualified as ineffective assistance. Id. at 167.\n\nThe Tennessee Supreme Court denied Thompson's application for permission to appeal on October 20, 1997.\n\nE. Federal Habeas Action\n\nThompson then brought this federal habeas action. Among numerous allegations, Thompson claimed that he was denied funding for mental health and investigative experts at trial and during state post-conviction proceedings, in violation of his right to due process. He also alleged a violation of his Sixth Amendment right to effective counsel. In particular, Thompson asserted that his trial counsel were ineffective for failing to: (1) perform a reasonable investigation of his background and mental health history; (2) secure adequate expert assistance regarding his mental health\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e; (3) discover available evidence of mental illness caused by two serious head injuries; and (4) investigate and challenge Thompson's competency to stand trial as well as his competency at the time of the offense.\n\nIn their Rule 26(f) [Fed. Rule Civ. P. 26(f)] report to the court, Thompson contended that discovery should be had regarding those matters alleged in his petition and such other federal constitutional errors that might be discovered during habeas proceedings. The Warden objected to discovery. On November 2, 1998, the magistrate judge issued an order allowing counsel to take the depositions of three mental health experts who had treated Thompson during his incarceration. The magistrate judge noted in pertinent part that the petition for writ of habeas included an allegation that executing the petitioner would violate the Eighth Amendment because he is incompetent to be executed. At the same time, the magistrate judge authorized the Warden to take the depositions of Thompson's two experts, psychologist Faye Sultan, and neuropsychologist Barry Crown.\n\nOn November 30, 1998, the district court affirmed the magistrate judge's order. The district court also expanded the scope of discovery:\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nAdditionally, if the facts are developed to show that petitioner's mental health should have been introduced as mitigating evidence, petitioner may be entitled to relief. . . . After a cursory review of the numerous volumes of state documents involved in this case, it appears that Thompson has alleged a factual basis for some of his claims and the magistrate judge so found. For example, petitioner claims trial counsel failed to properly investigate his mental health history and present mitigating evidence at trial and sentencing. Petitioner contends that he had two serious head injuries and intermittent bizarre and delusional thought patterns and witnesses to testify to such, and this mitigating evidence should have been introduced. Furthermore, petitioner contends that his institutional records reveal a diagnosis of schizophrenia with problems of auditory and visual hallucinations and paranoid ideation. If petitioner proves these factual allegations, he may be entitled to relief.\n\nThe Warden deposed Dr. Crown. Crown testified that he is a licensed psychologist in the State of Florida with a Ph.D. from Florida State University, and that he limits his practice to the areas of clinical and forensic psychology and neuropsychology. Crown met with Thompson for two and one-half to three hours on June 12, 1998. In that time he took a brief history and administered tests.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e Based upon those test results and the reports of the mental health professionals treating Thompson for the last fourteen years, Crown opined that Thompson suffered from some form of organic brain damage, which was secondary to a \"schizo-affective disorder- bipolar subtype.\" Crown also found that Thompson had a significant auditory processing deficit, which means he is easily distracted by auditory stimuli. He further stated that some of the test results led him to conclude that there was some sort of organic brain damage.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e (R91 p.24). However, Crown stated that he was not able to make an assessment of the severity of the damage and that he did not intend to. (R 91 p.28)\n\nCrown did, however, conclude that Thompson was competent at the time of the examination on June 12, 1998. (R91 p.47)\n\nSignificantly, Crown testified that he was only asked to render an opinion as to Thompson's competency at the time of the examination and not asked to render an opinion as to Thompson's mental status at the time of the offense or trial.\n\nIn rebuttal, the Warden offered the testimony of Dr. Theodore Blau.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e Blau testified that he did not observe any indications of organic brain damage on the test he administered. However, Blau also indicated that he had not \"come to an opinion that [he] would consider a complete profession opinion,\" and that the test he conducted \"would be called at best screening.\" On the other hand, Dr. Blau stated that he would only want to conduct other neuropsychological tests if \"there was a reason,\" such as a referral, observation or any difficulties during the testing that Thompson showed signs of left-hemisphere deficit.\n\nThe district court granted summary judgment to the Warden on Thompson's ineffective assistance of counsel claim:\n\nThompson has failed to provide any significant probative evidence which would make it necessary for this Court to resolve a factual dispute. See Celotex Corp. v. Catrett, 477 U.S. 317 (1986) . . . . Thompson has not provided this Court with anything other than factually unsupported allegations that he was incompetent at the time he committed the crime and at the time of his jury trial. Nor has Thompson provided this Court with any significant probative evidence that Thompson was suffering from a significant mental disease that should have been presented to the jury during the punishment phase as mitigation evidence.\n\nPetitioner had two different psychological evaluations and both resulted in findings of competency at the time of the crime and at the time of trial. Additionally, the record shows that trial counsel did reasonably investigate Thompson's background and mental health history.\n\nThe district court held that Thompson was not entitled to an evidentiary hearing.\n\nThe district court granted summary judgment to the Warden on all of Thompson's claims, dismissed Thompson's petition for writ of habeas corpus, and denied any application of a certificate of appealability. This Court granted a certificate of appealability on September 12, 2000. Four issues are presented for review.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nIII. Analysis\n\nOur review is governed by the Antiterrorism and Effective Death Penalty Act of 1996, Pub. L. No. 104-132, 110 Stat. 1214 (1996) (\"AEDPA\"). See Lindh v. Murphy, 521 U.S. 320, 326-27 (1997). Under the AEDPA, a federal court may not grant a writ of habeas corpus to a state prisoner with respect to any claim adjudicated on the merits unless (1) the state court's decision was \"contrary to, or involved an unreasonable application of, clearly established Federal law, as determined by the Supreme Court,\" 28 U.S.C. § 2254(d)(1) (1994 \u0026 Supp. VII), or (2) the state court's decision \"was based on an unreasonable application of the facts in light of the evidence presented in the State court proceedings.\" Id. § 2254(d)(2) (1994 \u0026 Supp VII).\n\nA state court's legal decision is \"contrary to\" clearly established federal law under § 2254(d)(1) \"if the court arrives at a conclusion opposite to that reached by [the Supreme] Court on a question of law or if the state court decides a case differently than [the Supreme] Court on a materially indistinguishable set of facts.\" (Terry) Williams v. Taylor, 529 U.S. 362, 412-13 (2000). An \"unreasonable application\" occurs when \"the state court identified the correct legal principle from [the Supreme] Court's decisions but unreasonably applies it to the facts of the prisoner's case.\" Id. Under this standard, a state court decision is not unreasonable simply because the federal court concludes that the state decision is erroneous or incorrect. Id. at 411. Rather, the federal court must determine that the state court decision is an objectively unreasonable application of federal law. Id. at 410-12. Factual findings by state courts are presumed correct. 28 U.S.C. § 2254(e)(1).\n\nA. Appropriate Standards of Review\n\n1. Adjudication on the Merits\n\nFirst, Thompson argues that the district court erred when it reviewed Thompson's claims under the \"all reasonable jurists\" standard that was rejected by the Supreme Court in Williams, 529 U.S. 362. As a threshold matter, he asserts that the state court's decision on his ineffective assistance of counsel claim did not constitute an \"adjudication\" within the meaning of § 2254(d) because he was denied funds for expert assistance during his post-conviction proceeding and thus denied a \"full opportunity to litigate the issues\" in state court, and the state court \"failed to render a considered deliberation of the issues.\" Consequently, according to Thompson, § 2254(d) was inapplicable and the district court should have reviewed his claims under the pre-AEDPA de novo standard of review.\n\nThompson's argument touches upon a inter-circuit debate regarding the proper interpretation of \"adjudicated on the merits\" as that term is used in § 2254(d)(1). See, e.g., Washington v. Schriver, 255 F.3d 45, 52-54 (2d Cir. 2001) (discussing various approaches by the circuits; citing cases); see also Schoenberger v. Russell, 290 F.3d 831, 837-41 (6th Cir. 2002) (Keith, J., concurring). This debate centers largely on whether a federal constitutional claim is \"adjudicated on the merits\" and is therefore subject to the AEDPA's deferential standard of review, if the state court neither cited nor applied federal law. See Washington, 255 F.3d at 52-53; see also Green v. Johnson, 116 F.3d 1115, 1121 (5th Cir. 1997) (looking to whether a state court decision disposes of a claim substantively or procedurally).\n\nAlthough this Court has \"not directly analyzed AEDPA's requirement that a state court adjudicate federal claims 'on the merits' in order to warrant our deference,\" Schoenberger, 290 F.3d at 841 (Moore, J., concurring), \"in Harris v. Stovall, . . .\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e we specifically held that the result of a state court's decision controls when the state court fails to explain its reasoning.\" Id. That is, \"we stated that we could not 'grant relief unless the state court's result is not in keeping with the strictures of the AEDPA.'\" Id. (quoting Harris, 212 F.3d at 943). Thus, in Harris, we focused on the result of the state court decision relevant to the petitioner's due process claim since no state court had addressed it. And in Doan v. Brigano, 237 F.3d 722 (6th Cir. 2001), we held that the \"contrary to\" rather than the \"unreasonable application\" prong of § 2254(d)(1) governs because the state court \"did not, as the Supreme Court defined an unreasonable application, correctly identify the governing legal principle only to unreasonably apply that principle to the particular facts of the case at hand.\" Id. at 730.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e In Schoenberger, we reviewed the petitioner's claim that admission of certain testimony violated his rights of due process and to a fair trial, which the Ohio Court of Appeals did not directly address, under the following standard: \"In the absence of a state court decision, we conduct an independent review of federal law to determine if the state court either contravened or unreasonably applied clearly established federal law.\" Schoenberger, 290 F.3d at 835 (citing Harris, 212 F.3d at 943).\n\nIn this case, Thompson asserted in state post-conviction proceedings that counsel was ineffective for failing to adequately investigate prior head injuries. The Tennessee Court of Criminal Appeals affirmed the trial court's denial of post-conviction relief on two grounds. First, the court held that Thompson had failed to establish prejudice under Strickland v. Washington, 466 U.S. 668 (1984). Thompson, 958 S.W.2d at 162, 165. Second, the court found that trial counsel's tactical decision to emphasize Thompson's positive qualities at trial, rather than to suggest brain damage, was a reasonable trial strategy based upon adequate investigation. Id. In other words, the state court analyzed Thompson's ineffective assistance of counsel claim under Strickland, rendering a substantive analysis. Thus, the state court decision is not an unexplained, summary dismissal of a federal claim. Thompson's contention is utterly without merit.\n\n2. Reasonable Jurists Standard\n\nSecond, Thompson argues that the district court's application in its § 2254(d)(1) analysis of the \"debatable among reasonable jurists\" standard, subsequently rejected by the Supreme Court in Williams v. Taylor, 529 U.S. 362, requires remand for reconsideration of his claims under the appropriate standard.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e Although Thompson is correct that the standard applied below is no longer appropriate in light of Williams, remand is unnecessary because we must, in reviewing the matter de novo, rely solely on the Supreme Court's decision in Williams for the proper standard under § 2254(d). Remand is unnecessary unless the district court's decision cannot be upheld under that standard. See, e.g., Harris, 212 F.3d at 942 (affirming the denial of habeas relief even though the district court incorrectly applied standards under the AEDPA). Further, this court can affirm a decision of the district court on different grounds. See Hammon v. DHL Airways, Inc., 165 F.3d 441, 445 (6th Cir. 1999).\n\nB. Ineffective Assistance\n\nThompson argues that he received ineffective assistance of counsel in both the guilt and sentencing phases of his capital trial because counsel failed to investigate and present evidence regarding Thompson's mental illness and social history and failed to present evidence in support of a life sentence. Specifically, Thompson contends that trial counsel's decision to employ a psychologist at trial, rather than a psychiatrist, was objectively unreasonable under Strickland. He also claims that counsel failed to interview and present testimony of witnesses who could have testified about a \"bizarre change\" in Thompson's behavior after he graduated from high school that may have signaled the onset of mental illness.\n\nIn Strickland, the Supreme Court announced a two-part test for evaluating ineffective assistance of counsel claims. First, counsel's performance must have been deficient in that it fell below an objective standard of reasonableness. Second, there must be \"a reasonable probability that, but for counsel's unprofessional errors, the result of the proceeding would have been different.\" Strickland, 466 U.S. at 687-94. At the same time, the Strickland Court cautioned that judicial scrutiny of defense counsel's performance must be \"highly deferential.\" Id. at 689. \"[C]counsel is strongly presumed to have rendered adequate assistance and made all significant decisions in the exercise of reasonable professional judgment.\" Id. at 690.\n\nBecause the Tennessee state court correctly stated the Strickland standard, the question we must decide is whether the state court unreasonably applied Strickland in this case. Under the AEDPA, it is not enough to convince the court in its independent judgment that the state courts applied Strickland incorrectly. Rather, a petitioner must show that the state courts applied Strickland in an objectively unreasonable manner. Cone v. Bell, 122 S. Ct. 1843, 1852 (2002).\n\nA state court's conclusion that counsel rendered effective assistance is not a finding of fact binding on a federal habeas court. Strickland, 466 U.S. at 698. Both prongs of the Strickland standard involved mixed questions of law and fact. Id. We therefore review both the state court ruling and the district court decision de novo. Carter v. Bell, 218 F.3d 581, 591 (6th Cir. 2000).\n\n1. Failure to Hire a Psychiatrist\n\nThompson contends that he received ineffective assistance of counsel at his capital trial because counsel failed to investigate his mental health and secure assistance from a psychiatrist.\n\nTo begin, to the extent that Thompson is claiming that trial counsel were ineffective because they failed to hire a psychiatrist rather than a psychologist, this argument is both procedurally defaulted and forfeited because it represents a transfiguration of Thompson's claim in the state courts and the district court that counsel failed to hire \"adequate expert assistance\" regarding his head injuries during his youth and his competency at the time of the crime.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e Furthermore, post-trial counsel have themselves not consulted psychiatrists in their attempt to establish that Thompson suffers from organicity and mental illness. State post-conviction counsel contacted Dr. Gillian Blair, a clinical psychologist. Thompson's federal habeas counsel, the Federal Community Defender Services of Eastern Tennessee\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e, consulted Faye Sultan, a psychologist, and Barry Crown, a neuropsychologist. It is with no small irony that we note that in attempting to claim that Thompson was constitutionally entitled to the services of a psychiatrist, post-trial counsel did not bother to obtain one themselves.\n\nMore fundamentally, even if the issue had been raised, Thompson did not establish that he was constitutionally entitled to expert psychiatric assistance under Ake v. Oklahoma, 470 U.S. 68 (1985), such that counsel's failure to attain one constituted ineffective assistance. In Ake, the Supreme Court held that, \"when a defendant has made a preliminary showing that his sanity at the time of the offense is likely to be a significant factor at trial, due process requires that a State provide access to a psychiatrist's assistance on this issue, if the defendant cannot otherwise afford one.\" Ake, 470 U.S. at 74, 83. The Ake court also stated that a similar conclusion was required in the context of a capital sentencing proceeding, when the state presents psychiatric evidence of the defendant's future dangerousness. Id. at 83. At the same time, the Ake majority emphasized that its ruling was limited to cases in which the defendant's mental condition was \"seriously in question\" upon the defendant's \"threshold showing.\" Id. at 82. Furthermore, the Court held that the state was obliged merely to provide one competent psychiatrist, and that it could choose that psychiatrist. In other words, the defendant's right does not include the right to a psychiatrist of his choice. Id. at 83 (\"That is not to say, of course, that the indigent defendant has a constitutional right to choose a psychiatrist of his personal liking or to receive funds to hire his own.\").\n\nThis Court has interpreted Ake to recognize that in addition to the right to a psychiatrist during the guilt phase, an indigent defendant is constitutionally entitled to \"psychiatric or psychological\" assistance during the sentencing phase \"1) if the defendant's sanity was a significant issue during the trial, or 2) defendant is on trial for his life and the state first presents psychiatric evidence of future dangerousness.\" Skaggs v. Parker, 235 F.3d 261, 272 (6th Cir. 2000) (quotation omitted), cert. denied, 122 S. Ct. 322 (2001). Neither of these prerequisites apply to Thompson. Counsel dropped the defense after two separate mental evaluations found him competent. The State did not present psychiatric evidence at trial or at its case-in-chief at sentencing.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e Nor has Thompson offered any evidence of legal insanity at the time of offense. Thus, trial counsel cannot be deemed ineffective for failing to obtain a psychiatrist.\n\nIn any event, trial counsel sought a psychiatric evaluation of Thompson, and the court ordered one. Under Ake, this is all Thompson would have been entitled to anyway. Although Parsons stated that he had no confidence in the conclusion rendered by MTMHI, Parsons' feeling is not proof of anything, and there is nothing in the state or federal record to undermine the evaluations rendered by MTMHI staff as to Thompson's competency at the time of the murder and at trial. As we stated in Martin v. Mitchell, 280 F.3d 594, 614 (6th Cir. 2002), petition for cert. filed, June 25, 2002 (No. 02-5185), \"[w]e have never found counsel to be ineffective solely because the expert used was on the State payroll.\"\n\nThis leaves the issue that is properly before us, whether trial counsel failed to hire adequate expert assistance. As illustrated above, the record reflects that trial counsel investigated Thompson's mental health and that he received expert assistance to attempt to establish valid mitigating factors. The record shows that trial counsel were aware from the outset of Thompson's prior head injuries and inappropriate behavior, and that they investigated possible mental illness or defect. They requested a competency evaluation. Thompson was evaluated for thirty days by a team of experts. The MTMHI team found no mental illness, mental defect, or insanity. Counsel also had Copple, a clinical psychologist and former professor of psychology at Vanderbilt, evaluate Thompson. Copple found no evidence of mental illness.\n\nOn appeal, Thompson seeks to undermine Copple's testimony by casting him as an \"industrial psychologist,\" and therefore somehow unqualified to make psychological evaluations.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e Copple's trial testimony belies this diminution of Copple's abilities. Copple himself testified on direct and cross examination that he is a clinical psychologist, and that he did not hold himself out as an industrial psychologist. Although he performs vocational evaluations and evaluations for social security applicants, he stated that the latter are not industrial psychology, but clinical psychology, from the standpoint of making a psychological evaluation of whether someone can continue working. Significantly, none of Thompson's experts faulted the testing that was performed.\n\nMoreover, not one of Thompson's post-trial experts have opined that Thompson suffered from organicity or mental illness at the time of the crime or trial. Blair, Thompson's state post-conviction expert, also a clinical psychologist with ties to Vanderbilt, declined to give an opinion, stating simply that more information was needed. Significantly, she did not fault the testing procedures used by MTMHI or Copple, but merely stated that they were not extensive enough. Indeed, she performed many of the same tests. Similarly, neither Crown nor Sultan ever expressed an opinion that Thompson was mentally ill at the time of the crime. In fact, Crown stated that he was not asked to render such an opinion. Cf. Mackey v. Dutton, 217 F.3d 399, 409 (6th Cir. 2000) (holding that the petitioner failed to establish that an expert's testimony would have been favorable to his insanity defense because the expert's report failed to speak to the ultimate issue--legal insanity at the time the offenses were committed), cert. denied, 531 U.S. 1087 (2001). On the other hand, Crown found Thompson competent in June 1998, which is consistent with Copple's findings and the MTMHI evaluation in 1985.\n\nAlso, as the district court found, Thompson failed to submit any medical records or proof to any court that he actually sustained the alleged head injuries or that they resulted in any permanent damage. Further, he has never submitted to any court any proof that he suffered from severe mental illness at the time of the crime. Thompson claims that trial counsel failed to discover his father had a history of severe mental illness, but Thompson have never offered any proof of this either.\n\nCounsel has now had numerous opportunities via expert testimony to establish that Thompson suffered from organic brain disease or mental illness at the time of the crime. And yet, at each opportunity, counsel fails to secure an answer to the critical issue of whether Thompson was mentally ill at the time of the crime. In essence, counsel is attempting to rely on, as proof, two inferences: 1) because Thompson allegedly suffered head injuries, he must have suffered brain damage, and 2) because he is currently suffering from schizo-affective disorder, he must have been suffering from mental illness at the time of the crime. But inferences are not proof, as even Thompson's experts seem to recognize, for each and every one fails to automatically take the leap from these inferences to the conclusion that he was mentally incompetent at the time of the murder. However, absent some evidence of organic brain damage or mental illness at the time of the crime, trial counsel cannot be deemed ineffective for failing to discover something that does not appear to exist. As we held in Lorraine v. Coyle, 291 F.3d 416, 436 (6th Cir. 2002), \"[i]t simply cannot be said that trial counsel's conduct fell below an objective standard of reasonableness under Strickland simply because the leads [of possible brain damage] led to nowhere.\"\n\nLike trial counsel in Lorraine, Thompson's attorneys actually pursued a lead of organic brain damage or mental defect. Like counsel in Lorraine, \"[t]hey cannot be deemed ineffective, since even at this late date, there is no medical proof of such a condition [at the time of the crime].\" Id. at 439. See also Martin, 280 F.3d at 614-15 (rejecting the petitioner's ineffective assistance at mitigation because the petitioner had not pointed to mitigating psychological evidence that should have been presented and therefore no prejudice was shown); Campbell v. Coyle, 260 F.3d 531 (6th Cir. 2001) (rejecting the petitioner's ineffective assistance at sentencing claim based on counsel's alleged failure to discover that he had post traumatic stress disorder because the petitioner failed to point to anything in the record showing that he suffered from it), cert. denied, 122 S. Ct. 1448 (2002). Cf. Williams, 529 U.S. at 395-98 (finding ineffective assistance where trial counsel failed to investigate and introduce available evidence showing that the petitioner was borderline mentally retarded); Coleman v. Mitchell, 268 F.3d 417, 449-53 (6th Cir. 2001) (finding ineffective assistance for failure to investigate and present available proof of the petitioner's borderline mentally retarded I.Q. and various psychological and hospital reports revealing that at the time of trial the petitioner had a borderline personality disorder), cert. denied, 122 S. Ct. 1639 (2002); Glenn v. Tate, 71 F.3d 1204, 1205 (6th Cir. 1996) (finding ineffective assistance of counsel where counsel failed to investigate and present evidence that the petitioner suffered from global brain damage sustained before he was born; stating that \"[e]xpert testimony that the petitioner's brain function was organically impaired would have been readily available if the petitioner's lawyers had sought it\").\n\nSkaggs, in particular, demonstrates why Thompson failed to demonstrate cause. In that case, we found that trial counsel were ineffective at the penalty phase because they retained a fraudulent psychologist whose testimony was often incoherent and rambling and who failed to present a realistic view of the petitioner's mental status. In several motions for a new trial, Skaggs offered the evaluations of two psychiatric experts who examined the petitioner in preparation for his federal habeas petition. Skaggs, 235 F.3d at 265. One of the experts, a certified psychologist, stated that Skaggs was mildly retarded and functioned at the level of a twelve- or thirteen-year-old. The other expert, a neuropsychologist, determined that Skaggs had an I.Q. of 64, which indicated that he was borderline mentally retarded. That expert also stated that the fraudulent psychologist's testimony was \"'so far below the standard of care as to totally misrepresent Mr. Skaggs to the jury.'\" Id. The neuropsychologist's report stated that Skaggs \"suffer[ed] from significant compromise in almost all areas of cognitive function. . . . and that the results of comprehensive neuropsychological assessment clearly reflect a pattern of results consistent with some form of organic brain syndrome.\" Id. at 273. This Court held that, based on this information, it was reasonable to assume that the jury might have found the statutory mitigating circumstance of Skaggs's impaired ability to appreciate the criminality of his conduct as a result of mental illness or retardation. Id. at 274. We therefore concluded that counsel's failure to present proof of Skaggs's mild mental retardation and mental capacity constituted prejudice because it was the one topic which may have convinced the jury that the death sentence was not justified. Id. at 271-72.\n\nCarter is also instructive. There we found cause under Strickland based on trial counsel's failure to investigate, discover, and present mitigating evidence. At an evidentiary hearing in federal court, Carter presented evidence of mitigating circumstances that he alleged his trial counsel should have presented. This included evidence that Carter's childhood home was violent and unstable, that his mother and sister were both hospitalized in mental health institutions, and that his IQ was 79-89. Carter, 218 F.3d at 593. Significantly, Carter also presented the evaluation of a clinical psychologist who, eight years after the murder at issue, determined that Carter had psychotic symptoms, and thought disorders consistent with paranoid schizophrenia or an organic delusional order, and further stated that \"although Carter may have not appeared delusional to a lay-person at the time of his trial, a trained professional would have been able to recognize mental compromise and abnormal personality traits in excess of an antisocial personal disorder.\" Id. at 593-94.\n\nBy contrast, Thompson has not presented any evidence of incompetence at the time of the crime or trial in either the state or federal proceedings. As previously noted, none of Thompson's experts have stepped up to the plate on the key issue of Thompson's competence at the time of trial.\n\nAs the Tennessee Court of Criminal Appeals held, there is no prejudice because, \"[t]he petitioner has failed to establish that the head injuries had any effect upon his mental stability at the time of the murder. Further, he has failed to establish that any type of psychological impairment in general may have existed which would have been mitigating evidence.\" Thompson, 958 S.W.2d at 165. Moreover, as the foregoing litany of cases shows, this Court will not find ineffective assistance of counsel unless the record establishes that there is actual mitigating evidence that was not presented.\n\nIndeed, although the state court ruled on the prejudice prong of Strickland, its ruling is equally sustainable under the cause prong of Strickland because trial counsel's decision to employ a clinical psychologist at trial was not objectively unreasonable. Further, as the Tennessee Court of Appeals concluded, \"counsel cannot be faulted for discarding a strategy that could not be supported by a medical opinion.\" Id. Nor can there be prejudice, because the jury was not deprived of any actual evidence of organicity or mental disease or defect at the time of the crime. Thus, the state court's decision holding that counsel were not ineffective under the Sixth Amendment is not an unreasonable application of Strickland.\n\n2. Witness Testimony\n\nThompson also contends that counsel failed to interview and present testimony of witnesses who could have testified about a \"bizarre change\" in Thompson's behavior after he graduated from high school that might have signaled the onset of mental illness and to otherwise present his personal and social history. Specifically, Thompson claims that trial counsel failed to interview and call as witnesses Nora Jean Walton, Joanne McNamara, and Arlene Cajulao.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e Thompson failed to properly present these claims in the state post-conviction proceedings. The Tennessee Criminal Court of Appeals found:\n\nWhen the claim of ineffectiveness is predicated upon the failure to present potential witnesses, their testimony should be offered at the post-conviction hearing. . . . Here, because none of the witnesses testified at the hearing, the petitioner was simply unable to show prejudice. We cannot speculate upon the usefulness of these witnesses without the information they could have provided. Thompson, 958 S.W.2d at 163-64.\n\nThompson further failed to submit affidavits from witnesses who could have testified to his alleged \"bizarre behavior\" in his federal habeas action. Thus, \"Thompson has failed to provide any significant probative evidence which would make it necessary for this Court to resolve a factual dispute.\" The state court did not err in concluding that Thompson failed to state an ineffective assistance of counsel claim on this basis, and the district court properly granted summary judgment. Cf. Martin, 280 F.3d 594.\n\nAlthough Cajulao testified, Thompson claims that she was not informed about the nature of the penalty phase testimony and only testified about things she felt would help Thompson. However, as the record reflects and the Tennessee Criminal Court of Appeals found, counsel were aware of the potential dangers inherent in allowing Cajulao to testify, but made a tactical decision to present her positive testimony as part of their strategy to \"humanize\" Thompson. The state court's ruling is not an unreasonable application of Strickland, which emphasized that courts are not to second-guess strategic decisions by counsel.\n\nThe record reflects that counsel conducted an adequate investigation into Thompson's background. Prior to trial, both counsel traveled to Thompson's home town. They interviewed relatives, teachers, and neighbors. Counsel knew of Thompson's head injuries and followed up by requesting and obtaining expert assistance. Although they did not obtain his medical records, Watson and Copple were each aware of these injuries prior to his evaluation of Thompson. (Apparently habeas counsel never obtained the records either.) Through the lay witnesses, the jury was provided with an image of Thompson as a caring, good person. Cf. Greer v. Mitchell, 264 F.3d 663, 676-78 (6th Cir. 2001) (finding ineffective assistance of appellate counsel for failing to raise ineffective assistance of trial counsel where trial counsel failed to interview family members, failed to review school records, and failed to call any mental health experts; and cases cited therein), cert. denied, 122 S. Ct. 1323 (2002).\n\nMoreover, to the extent that Thompson faults counsel for not presenting evidence of \"bizarre\" behavior, it should be noted that Cajulao testified to Thompson's increasing paranoia and erratic behavior after the crowbar attack. The jury was therefore given some indication that the head injuries may have affected Thompson's behavior. There is no prejudice.\n\n3. Strategy\n\nThompson claims that trial counsel adopted a completely indefensible strategy of presenting Thompson as a good, caring person with a need to \"nurture.\" We disagree. In this case, trial counsel were faced with a client who had committed a senseless crime and admitted to it. Further, his upbringing had been fairly normal. Cf. Bell, 122 S. Ct. at 1847-53 (holding that counsel decision not to present any mitigating evidence at sentencing and thereby preventing the prosecutor from presenting any rebuttal was not deficient under Strickland because counsel was \"faced with the formidable task of defending a client who had committed a horribly brutal and senseless crime,\" who had admitted to the killing, and who had a relatively normal upbringing). Nor could they present evidence of mental illness or defect. As the Tennessee Court of Criminal Appeals held, trial counsel could have pursued a strategy other than emphasizing his good qualities, and prevented the state from introducing some negative evidence about him. But there is no indication that another strategy would have been more effective, and the failure to present evidence of Thompson's prior good behavior might itself qualify as ineffective assistance. Cf. Cone v. Bell, 243 F.3d 961, 977-79 (6th Cir. 2001) (holding that counsel's failure to present any mitigating evidence or to ask the jury to spare the defendant's life constituted ineffective assistance, reversing death sentence); rev'd 122 S. Ct. 1843 (2002) (holding that counsel could have told jury of the defendant's Bronze Star decoration in Vietnam and his expression of remorse, but such strategy did not so clearly outweigh counsel's choice to waive oral argument to prevent lead prosecutor from arguing that it could be deemed objectionably unreasonable under Strickland).\n\nThus, as long ago cautioned in Strickland, and recently reemphasized in Bell, an attorney's conduct is entitled to a strong presumption that it falls within a wide range of reasonable professional assistance. Bell, 122 S. Ct. at 1854. As in Bell, \"[g]iven the choices available to [Petitioner's] counsel . . . we cannot say that the court's application of Strickland's attorney-performance standard was objectively unreasonable.\" Id.\n\nC. Evidentiary Hearing\n\nThompson asserts that the district court erred in denying his petition without an evidentiary hearing on three specific claims: (1) ineffective assistance of counsel; (2) competency at the time of the offense to stand trial, and (3) an alleged Brady/Giglio violation. Thompson further contends that the State withheld exculpatory evidence which clearly supported his claim of serious mental illness and presented false evidence regarding Thompson's mental health, during trial and post-conviction proceedings.\n\nThe AEDPA imposes express limitations on the ability of a petitioner to obtain an evidentiary hearing in federal court. In (Michael Wayne) Williams v. Taylor, 529 U.S. 420 (2000), the Supreme Court instructed that a habeas court presented with a request for an evidentiary hearing must first ascertain whether the \"applicant has failed to develop the factual basis of a claim in State court proceedings.\" 28 U.S.C. § 2254(e)(2); Williams, 529 U.S. at 433 (interpreting clause as evidencing congressional intent to codify standard of diligence announced in pre-AEDPA decision, Keeney v. Tamayo-Reyes, 504 U.S. 1 (1992)). If the applicant did not \"fail to develop\" the claim in state court, the statute does not bar an evidentiary hearing. If an \"applicant has failed to develop the factual basis of a claim in State court proceedings,\" 28 U.S.C. § 2254(e)(2) prohibits a federal court from conducting an evidentiary hearing on that claim unless the applicant demonstrates that\n\n(A) the claim relies on-\n\n(i) a new rule of constitutional law, made retroactive to cases on collateral review by the Supreme Court, that was previously unavailable; or\n\n(ii) a factual predicate that could not have been previously discovered through the exercise of due diligence; and\n\n(B) the facts underlying the claim would be sufficient to establish by clear and convincing evidence that but for constitutional error, no reasonable fact-finder would have found the applicant guilty of the underlying offense. 28 U.S.C. § 2254(e)(2).\n\nThe test for \"fail to develop\" is defined as a \"lack of diligence, or some greater fault, attributable to the prisoner or the prisoner's counsel\" in his or her attempts to discover and present a claim in state court proceedings. Williams, 529 U.S. at 432. Diligence, for purposes, of § 2254(e)(2), depends upon \"whether the prisoner made a reasonable attempt, in light of the information available at the time, to investigate and pursue claims in state court.\" Id. at 435.\n\nThompson claims that the district court erred in denying him an evidentiary hearing because he did not fail to develop the factual basis of his claims in state court. Thompson claims that he made diligent efforts to develop the fact of his claims in state court \"by requesting resources to conduct an investigation and resources to obtain expert assistance and by requesting an evidentiary hearing in state court.\" He claims that he was denied funding for mental health experts and investigative services at trial and during state post-conviction proceedings and argues that fault for any deficiency in the state court record belongs to the State.\n\nEven if we assume that Thompson did not \"fail to develop\" these claims below (and we do not make that assumption), Thompson is still not entitled to an evidentiary hearing under § 2254(e) because he failed to present any evidence demonstrating a genuine issue of material fact as to his claim of incompetence at the time of the offense and at trial. This is true even though the district court granted him further discovery under Habeas Rule 6. Absent such a showing, there can be no cause or prejudice under Strickland and therefore no need for an evidentiary hearing. Cf. Hutchinson v. Bell, - F.3d --, 2002 WL 1988196, at *8 (6th Cir. Aug. 29, 2002) (holding that the petitioner failed to develop the factual basis for his claims and that absent a record of the evidence that he would have presented at a separate trial, it was impossible to conclude that the state court unreasonably determined that he was not prejudiced). Furthermore, if Thompson did fail to develop, his failure to point to actual mitigating evidence that should have been presented, i.e. his failure to show prejudice, establishes that he has not met the requirement of § 2254(e)(2)(B). See Martin, 280 F.3d at 615.\n\nFinally, concerning an alleged Brady/Giglio violation, Thompson failed to identify below, or in this court, any evidence that was withheld from him at trial.\n\nIn short, Thompson's argument is without merit. We therefore affirm the district court's holding, and specifically adopt the reasoning of the district court as to these claims.\n\nIV. Conclusion\n\nFor all of the foregoing reasons, the judgment of the district court denying Thompson's petition for writ of habeas corpus is AFFIRMED.\n\nCONCURRENCE\n\nKAREN NELSON MOORE, concurring in the result. I concur in the court's decision to affirm the district court's denial of Thompson's petition for the writ of habeas corpus. However, I write separately to state that in regard to Thompson's claim that his counsel was constitutionally ineffective at sentencing, I reach the decision to deny his petition solely on the basis of the facts in this case.\n\nThompson claims that his trial counsel was constitutionally ineffective in presenting mitigating factors at his sentencing because his counsel did not present appropriate psychological evidence of his mental condition. Both Thompson and the dissent contend that had Thompson's trial counsel hired a more appropriate psychological or psychiatric expert, they would have been able to present evidence of Thompson's mental illness, or at least of his deteriorating mental condition. While I have sympathy for the view expounded in the dissent regarding the general propriety of using industrial psychologists as expert witnesses in capital cases, I cannot conclude that Thompson's trial counsel was constitutionally ineffective in hiring Dr. Copple in this case because Thompson has presented no evidence that his counsel knew or should have known either that Thompson was mentally ill or that his mental condition was deteriorating at the time of his trial or at the time of his crime. Without any evidence that a more appropriate psychological or psychiatric expert would have testified to Thompson's mental illness or his deteriorating mental condition, I cannot conclude that the hiring by Thompson's trial counsel of Dr. Copple -- however flawed his testimony seems in hindsight -- constituted constitutionally ineffective assistance of counsel.\n\nDISSENT\n\nCLAY, Circuit Judge, dissenting. Because the state court's conclusion that Thompson's trial counsel were not constitutionally ineffective was an unreasonable application of Strickland v. Washington, 466 U.S. 668 (1984), I would reverse the district court's judgment granting summary judgment to Warden Bell and remand to the district court with instructions to issue a writ of habeas corpus vacating Thompson's death sentence unless the State of Tennessee conducts a new penalty trial proceeding within 180 days of remand.\n\nI. Standard of Review and Governing Law\n\nI agree with the lead opinion that Thompson's habeas petition is governed by the Antiterrorism and Effective Death Penalty Act of 1996, as amended Pub. L. No. 104-132, 110 Stat. 1214 (1996) (\"AEDPA\"), 28 U.S.C. § 2254(d). AEDPA provides that an application for a writ of habeas corpus on behalf of an individual incarcerated pursuant to a state conviction cannot be granted with respect to any claim that was adjudicated on the merits in state court unless the adjudication: \"(1) resulted in a decision that was contrary to, or involved an unreasonable application of, clearly established federal law as determined by the Supreme Court of the United States; or (2) resulted in a decision that was based upon an unreasonable determination of the facts in light of the evidence presented in the state court proceeding.\" 28 U.S.C. § 2254(d). In Williams v. Taylor, 529 U.S. 362 (2000), the United States Supreme Court interpreted this provision of AEDPA to require a federal court to find a violation of law \"clearly established\" by holdings of the Supreme Court as of the time of the relevant state court decision. The Supreme Court in Williams held that a state court decision is \"contrary to\" clearly established federal law \"if the state court arrives at a conclusion opposite to that reached by this Court on a question of law or if the state court decides a case differently than this Court has on a set of materially indistinguishable facts.\" Id. at 413. The Court also stated that a decision by a state court will be deemed an \"unreasonable application\" of clearly established federal law \"if the state court identifies the correct governing legal principle from this Court's decisions but unreasonably applies that principle to the facts of the prisoner's case.\" Id.; see also Bell v. Cone, 535 U.S. 685, ___, 122 S. Ct. 1843, 1850 (2002).\n\nIn Williams, the Court held that the petitioner was entitled to federal habeas corpus relief on his claim that he was denied his constitutionally guaranteed right to the effective assistance of counsel when his trial attorneys did not investigate and present substantial mitigating evidence during the sentencing phase of his capital murder trial. 529 U.S. at 396. In particular, the Court found that while trial counsel were competent during the guilt phase of the trial, they rendered ineffective assistance at the sentencing phase by their failure to investigate \"Williams' nightmarish childhood\" and to present evidence that \"Williams was 'borderline mentally retarded' and did not advance beyond sixth grade in school\" or concerning his commendable behavior in prison. Id. at 395-96. Because Williams \"raised 'a reasonable probability that the result of the sentencing proceeding would have been different' if competent counsel had presented and explained the significance of all the available evidence,\" the Court in Williams concluded that \"the Virginia Supreme Court rendered a 'decision that was clearly contrary to, or involved an unreasonable application of, clearly established Federal law,'\" thus entitling Williams to habeas relief. Id. at 399.\n\nIn the matter at hand, Thompson also claims that he was entitled to habeas corpus relief, principally because he was denied the effective assistance of counsel under the Sixth Amendment of the United States Constitution.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e Claims of ineffective assistance of counsel are governed by the Supreme Court's two-prong test set forth in Strickland. The first prong of the test is whether counsel's performance fell below an objective standard of reasonableness, whereby \"counsel made errors so serious that counsel was not functioning as the 'counsel' guaranteed the defendant by the Sixth Amendment.\" Strickland, 466 U.S. at 687. Review of trial counsel's performance is highly deferential. Id. at 689. \"A fair assessment of attorney performance requires that every effort be made to eliminate the distorting effects of hindsight, to reconstruct the circumstances of counsel's challenged conduct, and to evaluate the conduct from counsel's perspective at the time.\" Id. In this regard, defense counsel must reasonably investigate the facts of the case or reasonably determine that an investigation is not necessary, or else the performance is deficient. Austin v. Bell, 126 F.3d 843, 848 (6th Cir. 1997). In addition, as this Court pointed out in Combs v. Coyle, 205 F.3d 269, 289-90 (6th Cir. 1997), Strickland instructed that \"[p]revailing norms of practice as reflected in American Bar Association standards and the like, e.g., ABA Standards for Criminal Justice 4-1.1 to 4- 8.63(2d ed. 1980) ('The Defense Function'), are guides to determining what is reasonable, but they are only guides.\" Strickland, 466 U.S. at 688, 104 S. Ct. 2052. ABA Standard 4-1.2(c) states that \"[s]ince the death penalty differs from other criminal penalties in its finality, defense counsel in a capital case should respond to this difference by making extraordinary efforts on behalf of the accused.\" ABA Standards for Criminal Justice Prosecution Function and Defense Function 120 (3d ed. 1993). (Emphasis supplied).\n\nThe second prong of the Strickland test is whether counsel's error materially prejudiced the defendant. Under this prong, \"[t]he defendant must show that there is a reasonable probability that, but for counsel's unprofessional errors, the result of the proceeding would have been different. A reasonable probability is a probability sufficient to undermine confidence in the outcome.\" Strickland, 466 U.S. at 694. In Strickland, the Supreme Court explained:\n\nWhen a defendant challenges a conviction, the question is whether there is a reasonable probability that, absent the errors, the factfinder would have had a reasonable doubt respecting guilt. When a defendant challenges a death sentence such as the one at issue in this case, the question is whether there is a reasonable probability that, absent the errors, the sentencer - - including an appellate court, to the extent it independently reweighs the evidence - - would have concluded that the balance of aggravating and mitigating circumstances did not warrant death. Id. at 695.\n\nIn Skaggs v. Parker, 235 F.3d 261 (6th Cir. 2000), this Court further noted that \"[t]he Court recently emphasized that a petitioner need not prove by a preponderance of the evidence that the result would have been different, but merely that there is a reasonable probability that the result would have been different.\" Id. at 271 (citing Williams, 529 U.S. at 362).\n\nBoth prongs of the Strickland test involve mixed questions of law and fact, and we review both the state court and district court determinations de novo. Carter, 218 F.3d at 591. \"As a federal court reviewing a state criminal judgment, we do not consider a state court conclusion that counsel rendered effective assistance to be a fact binding on us.\" Id. (citing Strickland, 466 U.S. at 698). Because the Tennessee state court correctly stated the Strickland standard, the question before us is whether the state court's decision was an unreasonable application of the standard set by the Supreme Court for evaluating claims of ineffective assistance of counsel.\n\nII. Analysis\n\nA. Counsel's Trial Strategy was Unreasonable\n\nThis Court's recent death penalty jurisprudence indicates that we have not been reluctant to find ineffective assistance of counsel in capital cases where there was no strategy at all or where the strategy was so completely ill-conceived as to be objectively unreasonable, especially when trial counsel fails to develop or present mitigating evidence at the sentencing phase. See Coleman v. Mitchell, 268 F.3d 417, 449-53 (6th Cir. 2001) (finding that counsel was ineffective for failing to investigate and present mitigating evidence regarding the petitioner's personal background, psychological history and potential organic brain dysfunction at the penalty phase); Skaggs, 235 F.3d at 266-75 (finding that while counsel was not ineffective during the guilt phase for failing to investigate the credentials of a fraudulent \"psychologist,\" counsel was ineffective because he failed to find a different psychiatric expert as his central mitigation witness at the penalty phase and because counsel essentially provided no legitimate mitigating evidence at sentencing); Carter, 218 F.3d at 594-600 (concluding that counsel's failure to investigate the petitioner's family, social or psychological background and present mitigating evidence at the sentencing phase amounted to ineffective assistance of counsel, \"constitut[ing] deficiencies so severe as to dispense with the need to establish prejudice\"); Combs, 205 F.3d at 287-88 (finding defense counsel's failure to question his only expert witness about his opinion regarding whether the petitioner lacked the requisite intent to commit the crimes before putting him on the stand at the culpability phase was \"inexcusable\" and \"objectively unreasonable,\" amounting to ineffective assistance of counsel where the expert's testimony that petitioner did not lack the requisite intent \"contradicted the sole defense theory\" and \"was completely devastating to the defense\"); Rickman v. Bell, 131 F.3d 1150, 1159-60 (6th Cir. 1997) (ruling that trial counsel's portrayal of his client as \"vicious and abnormal,\" labeling him as \"nuts\" and \"just . . . out of somebody's insane asylum,\" was not a legitimate trial strategy, depriving his client of the effective assistance of counsel); Groseclose v. Bell, 130 F.3d 1161, 1169-71 (1997) (holding that trial counsel's failure to have \"any defense theory whatsoever\" was, among other shortcomings, \"especially appalling,\" amounting to ineffective assistance of counsel); Austin, 126 F.3d at 848-49 (holding that trial counsel's failure to investigate and present any mitigating evidence during the sentencing phase \"because he did not think that it would do any good\" constituted ineffective assistance of counsel since \"this reasoning does not reflect a strategic decision, but rather an abdication of advocacy\"); Glenn v. Tate, 71 F.3d 1204, 1207-11 (6th Cir. 1995) (finding that petitioner was denied the effective assistance of counsel during the sentencing phase as a result of counsel's failure to develop and present mitigation evidence regarding the petitioner's history, background and organic brain damage, noting that \"[i]t was not that such information could not be found, or that counsel made a reasoned decision to withhold the information for tactical or strategic reasons\").\n\nThe case before us fits squarely within this line of cases in which counsel's failure to have a reasonable trial strategy in a capital case constitutes ineffective assistance of counsel. Specifically, trial counsel's decision to apply the court-ordered funds, granted in a motion filed pursuant to Ake v. Oklahoma, 470 U.S. 68, 83 (1985), to hire an industrial psychologist lacking the requisite professional background for the task at hand was simply not an \"objectively reasonable\" strategy in this case. Thompson's trial attorneys' failure to hire an appropriate psychiatric expert determined their purported trial strategy throughout this entire case. As a result, Thompson's trial attorneys failed to present any legitimate mitigating evidence at the penalty phase of the trial. The consequence of trial counsel's thoroughly unreasonable trial strategy is that there can be no confidence in the reliability of the state court's death sentence.\n\nAs indicated, Thompson's trial attorneys at the commencement of the proceedings in the state trial court moved for funds to hire a psychiatric expert pursuant to Ake because they questioned the reliability of the psychiatric evaluation of the forensic team at Middle Tennessee Mental Health Institute (\"MTMHI\"). Trial counsel filed this motion for court-ordered funding because Thompson's mental status was in issue after he was charged in this case, he was going to be on trial for his life, and the state was going to present evidence of his future dangerousness. Presumably because Thompson made a threshold showing for psychiatric assistance under Ake, the trial court granted his motion for court-ordered funds to hire his own psychiatric expert to assist in his defense and to respond to the state's psychiatric experts.\n\nIn Ake, the Supreme Court held that, under the Due Process Clause of the Fourteenth Amendment, an indigent defendant has the right to expert psychiatric assistance upon a preliminary showing that his sanity at the time of the offense is likely to be a significant factor at trial. As the Supreme Court explained, an indigent defendant, at a minimum, is entitled to \"access to a competent psychiatrist who will conduct an appropriate examination and assist in evaluation, preparation, and presentation of the defense.\" 470 U.S. at 83. Ake also held that, when appropriate, the right to expert assistance applies to the sentencing phase of capital proceedings. Id. at 86. In doing so, the Court emphasized the pivotal role that a psychiatric expert has come to play in such proceedings:\n\n[W]hen the State has made the defendant's mental condition relevant to his criminal culpability and to the punishment he might suffer, the assistance of a psychiatrist may well be crucial to the defendant's ability to marshal his defense. In this role, psychiatrists gather facts, through professional examination, interviews, and elsewhere, that they will share with the judge or jury; they analyze the information gathered and from it draw plausible conclusions about the defendant's mental condition, and about the effects of any disorder on behavior; and they offer opinions about how the defendant's mental condition might have affected his behavior at the time in question. They know the probative questions to ask of the opposing party's psychiatrists and how to interpret their answers. Unlike lay witnesses, who can merely describe symptoms they believe might be relevant to the defendant's mental state, psychiatrists can identify the \"elusive and often deceptive\" symptoms of insanity, and tell the jury why their observations are relevant. Further, where permitted by evidentiary rules, psychiatrists can translate a medical diagnosis into language that will assist the trier of fact, and therefore offer evidence in a form that has meaning for the task at hand. Through this process of investigation, interpretation, and testimony, psychiatrists ideally assist lay jurors, who generally have no training in psychiatric matters, to make a sensible and educated determination about the mental condition of the defendant at the time of the offense.\n\nBy organizing a defendant's mental history, examination results and behavior, and other information, interpreting it in light of their expertise, and then laying out their investigative and analytic process to the jury, the psychiatrists for each party enable the jury to make its most accurate determination of the truth on the issue before them. Ake, 470 U.S. at 80-81 (citations omitted).\n\nIn this case, the trial court granted the defense's request for funds to hire a \"private psychiatrist . . . for the purpose of affording counsel the benefit of private expert psychiatric consultation in regards to the defendant . . . to ensure that the constitutional rights of the defendant are properly protected.\" (J.A. at 24.) Although Thompson was provided with access to psychiatric assistance, as required by the Due Process Clause under Ake, his trial counsel took it upon themselves to hire an industrial psychologist who did not possess the proper professional qualifications necessary to respond to the state's mental or psychological examination of Thompson or to assist the defense. In failing to hire an appropriate psychiatric expert, and instead hiring Dr. Copple, an industrial psychologist, Thompson's trial counsel eviscerated Thompson's constitutional entitlement under Ake of any effective content. Thompson's trial counsel's alleged explanation for hiring Copple was that they could not find a psychiatrist in Nashville since the psychiatrist they ordinarily used had moved out of state.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e In effect, Thompson's trial counsel's decision to hire Dr. Copple, stripped their client of his constitutional right to access to an appropriate psychiatric expert, nullifying the protections provided by the Due Process Clause. See Starr v Lockhart, 23 F.3d 1280, 1289 (8th Cir.1994) (noting that \"[a]s Ake explains, due process requires access to an expert who will conduct, not just any, but an appropriate examination,\" and finding that the petitioner's \"exam was inappropriate because it did not delve into the mitigating questions essential to [the petitioner]\"); Smith v. McCormick, 914 F.2d 1153, 1158-59 (9th Cir. 1990) (\"[U]nder Ake . . . [the defendant] was entitled to his own competent psychiatric expert.\"). In short, Thompson's constitutional entitlement under Ake was rendered meaningless by his counsel's failure to hire an expert qualified to provide the psychiatric or psychological assistance necessary on the pertinent issues of Thompson's case.\n\nAs the trial record clearly shows, Dr. Copple did not have the requisite knowledge and training to provide the sort of expert assistance necessary to protect Thompson's constitutional rights. Simply put, Dr. Copple lacked the medical expertise to be a qualified witness in Thompson's behalf and to rebut the state's psychiatric evaluation performed by the team of forensic psychiatrists and psychologists at MTMHI. Specifically, as an industrial psychologist specializing in Social Security and vocational evaluations, Copple lacked the specialized knowledge, skill, experience, and training to function as a qualified witness in this capital case where a forensic psychologist or psychiatrist was needed to provide a psychological basis for Thompson's behavior in order to show that he was mentally impaired.\n\nAs a matter of fact, industrial psychologists generally, and Dr. Copple in particular, are not up to the task of functioning as forensic psychologists in capital cases. As described by the Society for Industrial and Organizational Psychology (SIOP),\n\nIndustrial-Organizational Psychologists are Versatile Behavioral Scientists Specializing in Human Behavior in the Work Place.\n\nIndustrial-organizational (called I-O) psychologists recognize the interdependence of individuals, organizations, and society, and they recognize the impact of factors such as increasing government influences, growing consumer awareness, skill shortages, and the changing nature of the workforce. I-O psychologists facilitate responses to issues and problems involving people at work by serving as advisors and catalysts for business, industry, labor, public, academic, community, and health organizations:\n\nThey are: Scientists who derive principles of individual, group, and organizational behavior through research;\n\nConsultants and staff psychologists who develop scientific knowledge and apply it to the solution of problems at work; and\n\nTeachers who train in the research and application of industrial-organizational psychology. http://www/sip.org/TIP/SIOP/brochure.html.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e The American Psychological Association provides a similar definition, stating that \"industrial/organizational psychologists apply psychological principles and research methods to the work place in the interest of improving productivity and the quality of work life.\" http://www.apa.org/students/brochure/subfields.html.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\nThe professional goals and expertise of industrial psychologists thus differ markedly from those of forensic psychiatrists or psychologists. As described by the American Academy of Psychiatry and Law (\"AAPL\"), \"forensic psychiatry is a medical subspecialty that includes research and clinical practice in the many areas in which psychiatry is applied to legal issues,\" including criminal responsibility and criminal competence. http://www.emory.edu/AAPL/org.htm. Similarly, the American Board of Forensic Psychology, which is part of the American Board of Professional Psychology, defines \"forensic psychology is the application of the science and profession of psychology to questions and issues relating to the law and legal system.\" The practice of forensic psychology includes, in pertinent part, \"psychological evaluation and expert testimony regarding criminal forensic issues such as trial competency, waiver of Miranda rights, criminal responsibility.\" http://www.abfp.com/brochure.html.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e An even more specific definition of forensic psychology has been adopted by the American Psychological-Law Society, Division 41 of the American Psychological Association. Specifically, Section1(B)(1) of The Specialty Guidelines for Forensic Psychologists provides:\n\nB. Scope\n\n1. The Guidelines specify the nature of desirable professional practice by forensic psychologists, within any subdiscipline of psychology (e.g. clinical, developmental, social, experimental) when engaged regularly as forensic psychologists.\n\na. Psychologist\" means any individual whose professional activities are defined by the American Psychological Association or by regulation of title by state registration or licensure, as the practice of psychology.\n\nb. \"Forensic psychology\" means all forms of professional psychological conduct when acting, with definable foreknowledge, as a psychological expert on explicitly psycholegal issues, in direct assistance to courts, parties to legal proceedings, correctional and forensic mental health facilities and administrative, judicial, and legislative agencies acting in an adjudicative capacity.\n\nc. \"Forensic psychologist\" means psychologists who regularly engage in the practice of forensic psychology as defined in I(B)(1)(b).\n\nThe Specialty Guidelines for Forensic Psychologists at http://www.unl.edu/ap-ls/links.htm (15 Law and Human Behavior 657 (1991)) (emphasis added). The Specialty Guidelines for Forensic Psychologists further provide:\n\nIII. COMPETENCE\n\nA. Forensic psychologists provide services only in areas of psychology in which they have specialized knowledge, skill, experience, and education.\n\nB. Forensic psychologists have an obligation to present to the court, regarding the specific matters to which they will testify, the boundaries of their competence, the factual bases (knowledge, skill, experience, training, and education) for their qualification as an expert, and the relevance of those factual bases to their qualification as an expert on the specific matters at issue. Id. at 658 (emphasis added).\n\nTurning to the present case, it was simply indefensible for Thompson's trial counsel to use the court-ordered funds designated for hiring a forensic psychiatrist to select Dr. Copple as their expert witness. Dr. Copple was not a forensic psychiatrist or even a general psychiatrist, nor was he a forensic psychologist. Rather, Dr. Copple's specialty involved psychological evaluations of Social Security applicants with problems that prevent them from working and \"vocational evaluations,\" which are used for \"helping people reach their vocational goals or choosing vocational goals.\" Although Dr. Copple was licensed to practice psychology in Tennessee, pursuant to Tenn. Code Ann. § 63-11-203, he clearly lacked the knowledge, skill, experience and training to function as a forensic psychologist in a capital murder case, as defined in I(B)(1)(b) of The Specialty Guidelines for Forensic Psychologists. Dr. Copple had never testified in a capital case and had not testified in a criminal case in years. Moreover, Thompson's trial counsel admitted that Dr. Copple was not an expert in criminal behavior. Thus, by their own admission, Thompson's trial counsel concede that Dr. Copple would not have been competent to function as a forensic psychologist, if the Specialty Guidelines for Forensic Psychologists had been in effect at the time of the trial, since he did not regularly engage in the practice of forensic psychology.\n\nFurther, had Rule 702 of the Tennessee Rule of Evidence, which tracks the federal rule, been applicable to this case, Dr. Copple would not have been qualified as an expert witness in forensic psychology under the criteria of Daubert v. Merrell Dow Pharmaceuticals, Inc., 509 U.S. 579 (1992) since adopted by Tennessee Supreme Court in McDaniel v. CSX Transportation, Inc., 995 S.W.2d 257 (Tenn. 1997). Indeed, what Thompson needed at the sentencing phase of the trial was not an industrial psychologist opining about whether Thompson would \"thrive\" in prison, but a qualified expert who would help him escape the death penalty by giving testimony about his mental condition so as to convince the jury that the mitigating circumstances outweighed the aggravating factors. Contrary to the lead opinion's claim, given Dr. Copple's background and practice as an industrial psychologist, he simply was not qualified to be an expert in this case.\n\nThe present case is quite analogous to Skaggs v. Parker, 235 F.3d 261, 266-75 (6th Cir. 2000). There, this Court found that counsel was ineffective for failing to replace a fraudulent \"psychologist\" with a different expert witness as his central mitigation witness at the penalty phase and for essentially providing no legitimate mitigating evidence at sentencing. Dr. Copple is the functional equivalent of the fraudulent psychologist in Skaggs since he was not competent to function as a forensic psychologist in a capital murder case and since Dr. Copple's testimony actually made things worse for Thompson. Because Thompson's counsel failed to hire a proper expert, they were not able to introduce evidence of his mental impairment, relying upon the totally implausible notion of presenting his \"positive qualities and reservoir of moral upbringing\" as mitigating circumstances. Thus, as in Skaggs, trial counsel essentially failed to present legitimate mitigating evidence at the sentencing phase.\n\nThe failure to hire an appropriate psychiatric expert had dire consequences for Thompson, dictating his attorneys' purported trial strategy throughout this entire case. It is no exaggeration to say that the decision to hire Dr. Copple was the single most important decision that Thompson's trial counsel made in this case, determining their ensuing trial strategy, which yielded their idea of presenting Thompson's \"positive qualities and reservoir of moral upbringing\" given the alleged dearth of evidence about Thompson's mental condition as uncovered by Dr. Copple. Without an appropriate expert, Thompson was not able to present mitigating evidence about his mental condition to rebut the conclusions of Dr. Watson and the forensic team at MTMHI that Thompson was malingering mental illness. However, according to the testimony of Dr. Blair at the state post-conviction hearing, three psychiatrists who treated Thompson from 1985 to 1990 reached far different conclusions about Thompson's mental condition than those of the forensic psychiatric team at MTMHI. Dr. Crown similarly opined that Thompson suffered from some form of organic brain damage, which was secondary to a \"schizo-affective disorder, bipolar subtype.\" Despite the fact that Thompson had suffered head injuries before the murder and experienced serious mental problems since incarceration, his trial attorneys, as a result of their failure to obtain the services of an appropriate psychiatric expert, were not in a position to develop this information. In view of Dr. Copple's professional background, then, there should be considerable doubt as to how much weight, if any, should be accorded Dr. Copple's concurrence with Dr. Watson and the forensic team at MTMHI that Thompson did not suffer from any mental illness.\n\nIn short, Thompson's trial counsel were hamstrung right from the start by their inability to respond to the state's psychiatric expert, since, without expert psychiatric assistance, they could not present proof of Thompson's mental problems, which may have provided a defense to the charges against him at the guilt phase or which could have constituted mitigating evidence at the penalty phase. It is precisely at this point that an appropriate psychiatric or psychological expert witness may have provided to the members of the jury the requisite medical testimony about Thompson's mental condition such that the jurors would have recommended that Thompson's life be spared. Specifically, it was the abject failure of Thompson's expert witness, as directed by his counsel, to present effective evidence of his mental problems that prejudiced him because it deprived him of any chance of convincing the jury to recommend a penalty short of the death sentence. Had Thompson been examined by a qualified psychologist or psychiatrist who had the appropriate expertise to be an effective witness, there is a substantial likelihood that the sentencing result in this case would have been different. Under the circumstances, it is fairly obvious that trial counsel's decision to apply the court-ordered funds to hire Dr. Copple was simply not an \"objectively reasonable\" strategy because Dr. Copple was not in the position to provide the kind of expert psychiatric assistance required by the Due Process Clause.\n\nGiven the absence of evidence in the form of expert testimony supporting Thompson's claim that he suffered from an adverse mental condition, his trial attorneys thus adopted, as if by default, the strategy of offering no defense in the guilt phase, while presenting Thompson's \"positive qualities\" as mitigating circumstances in the penalty phase of this case. As trial counsel Richardson put it, he and his co-counsel called upon Dr. Copple to accentuate defendant's \"positive moral qualities and reservoir of moral upbringing,\" as opposed to any \"negative\" evidence regarding defendant's mental condition. Thus, at the penalty phase, trial counsel offered Dr. Copple's testimony that Thompson is a sensitive, caring person who has \"an exaggerated need for nurturance\" or, alternatively, \"an unusually strong need for what we call nurturance.\" In the context of this case, though, the idea that Thompson had \"an unusually strong need for what we call nurturance\" is baffling to the point of being incomprehensible insofar as explaining his alleged brutal murder of a woman or offering mitigating evidence for his sentence are concerned. Moreover, by presenting testimony at the penalty phase that Thompson had a need to \"nurture,\" that he came from a \"loving family,\" had a good reputation, and was \"pleasant, easy-going and cheerful\" before joining the Navy in 1979, his trial attorneys, in effect, condemned him to death, allowing the jury to infer that Thompson had absolutely no excuse for committing such a heinous crime. Thus, rather than present the jury with sympathetic evidence that might have tended to reduce the degree of Thompson's moral culpability or make him appear to be a more sympathetic figure in the eyes of the jurors, trial counsel, through their completely indefensible trial strategy, achieved exactly the opposite result at the penalty phase.\n\nOn appeal, Thompson argues that his counsel's strategy of presenting Thompson's \"positive qualities\" at the penalty phase also backfired, opening the door to the prosecution's elicitation of evidence about defendant's violent proclivities. In this regard, Thompson claims that his ex-girlfriend, Ms. Cajulao, could have testified at the penalty phase about various incidents in which he \"snapped,\" but did not because she was not properly prepared to testify since his attorneys' strategy was to present Thompson's \"positive qualities.\" In any case, despite defense counsel's apparent strategy, Cajulao testified on direct examination about Thompson's \"paranoid\" behavior in the Navy after he was assaulted by three men with a crowbar and about his discharge from the Navy resulting from the incident in which Thompson pushed an officer, dislocating the officer's shoulder or breaking his collarbone. Cajulao also was forced on cross-examination to testify about Thompson's involvement in other violent incidents while in the Navy, which included threats to assault Navy personnel with a torque wrench extension bar and a five-inch steak knife.\n\nAs already noted, defense trial counsel was aware of Thompson's violent behavior in the military. Thus, defense trial counsel was presented with the problem of how to account for Thompson's violent behavior in light of their chosen strategy of presenting his \"positive qualities.\" Nevertheless, Thompson's trial counsel Parsons realized that there was a puzzling change in Thompson's behavior from the time he lived in Georgia before joining the Navy, wherein Thompson went from being \"non-violent, cooperative and responsible\" and \"pleasant, easy-going, cheerful\" to a \"paranoid\" individual apt to engage in violent assaultive behavior. Although trial counsel offered no explanation for Thompson's radical behavioral change, there was evidence, as Dr. Blair recognized, indicating that Thompson had a history of head injuries and that since 1985, he had shown a deteriorating mental status, becoming psychotic, with mood swings indicative of bipolar disorder or schizo affective disorder or schizophrenia. In her testimony at the post-conviction hearing, Dr. Blair intimated that Thompson's troubles in the Navy just before the crime in this case suggested that he was becoming mentally ill at that time. Notwithstanding the evidence regarding the marked change in Thompson's behavior during his time in the Navy, along with well-founded questions about his possible mental illness, trial counsel was simply not in the position to exploit this evidence on behalf of Thompson's defense. Again, the reason why Thompson's trial counsel could not avail themselves of this evidence was a direct consequence of their own failure to hire an appropriate psychiatric expert in this case. They therefore could not present the jury with a plausible explanation in psychiatric terms as to why Thompson's behavior had changed so markedly. Viewed in this way, then, trial counsel's strategy of only presenting Thompson's \"positive qualities\" must be seen in the context of this case as tantamount to presenting no defense for him at all. Trial counsel's strategy actually resulted in the introduction, by way of rebuttal, of additional damaging evidence against Thompson.\n\nContrary to defense trial counsel's characterization, this case did not present them with a Hobson's choice of offering only evidence of Thompson's \"positive qualities\" or no evidence at all in the penalty phase. Indeed, by accounting for the marked change in Thompson's behavior after he joined the Navy, expert psychiatric testimony supporting the notion that Thompson suffered from mental illness or an adverse mental condition would have provided a plausible explanation for Thompson's \"positive qualities\" in contradistinction to his subsequent violent behavior. However, by not being able to offer the jury any plausible psychiatric explanation regarding the significance of Thompson's change in behavior as witnessed by Cajulao and others, his trial counsel essentially abdicated their roles as meaningful advocates on behalf of their client. This is because defense counsel had nothing with which to rebut the state's proofs after opening the door to the issue of whether Thompson was a \"good person.\"\n\nIn summary, the performance of Thompson's trial attorneys in this capital case was well below an objective standard of reasonableness demanded by the Sixth Amendment. Here, trial counsel rendered nugatory the protections afforded by the Due Process Clause by failing to hire an appropriate psychiatric expert as directed by the trial court's order pursuant to Ake. As a result of their own error in failing to hire an appropriate psychiatric expert to respond to the state's psychiatric evidence and to assist the defense, trial counsel availed themselves of the purported strategy of presenting no defense at the guilt phase and of offering Thompson's \"positive qualities\" as mitigating evidence in the penalty phase without attempting to provide a plausible psychiatric explanation for Thompson's anti-social and criminal behavior.\n\nThe lead opinion's reasoning that Thompson's trial counsel cannot be found to have acted unreasonably because there was no proof of Thompson's mental illness at the time of the crime, is circular and unpersuasive. Indeed, without the proper psychiatric assistance to adduce evidence of Thompson's mental condition, no proof could be offered. Thus, counsel's strategy simply amounted to no strategy at all and permeated these entire proceedings ab initio, depriving Thompson of the ability to mount any defense in the guilt phase and to present important mitigating evidence about his mental condition at the penalty phase. In so doing, trial counsel left their client virtually defenseless, as though he were without any representation, facing the charges and a death sentence on his own.\n\nB. The Prejudice Prong under Strickland\n\nHaving concluded that trial counsel's performance was deficient in both the guilt and penalty phases of this case, the next question is whether there was prejudice. To establish prejudice under Strickland, Thompson must show that \"there is a reasonable probability, absent the errors, that the factfinder would have had a reasonable doubt respecting guilt\" and that \"there is a reasonable probability that, absent the errors, the sentencer . . . would have concluded that the balance of aggravating and mitigating circumstances did not warrant death.\" Strickland, 466 U.S. at 695.\n\nOn the present record, there does not appear to be a reasonable probability that, but for trial counsel's thoroughly deficient performance, the jury would have had a reasonable doubt about Thompson's guilt. As Thompson's trial attorneys recognized, there was overwhelming evidence that he committed the murder. While there was no apparent defense to Thompson's factual guilt, the question still remains whether his trial counsel could have mounted an effective psychiatric defense in the guilt phase by showing that he was under some psychiatric or psychological impairment at the time of the murder. In this regard, it should be noted that the record seemed to suggest that Thompson was competent at the time of trial. Dr. Crown, while not asked to give an opinion about whether Thompson was competent during his state trial, opined that Thompson was competent at the time of his examination on June 12, 1998. Dr. Blair testified about Thompson's deteriorating mental condition since 1985 and suggested that he was likely suffering from schizophrenia at the time of the crime. However, she declined to render a formal opinion about Thompson's mental condition at the time of the crime, claiming that she needed more information about Thompson's background before she could render such an opinion. Thus, there is nothing in the present record to indicate that Thompson was not competent at the time of the murder, or to show that he was suffering from some form of organic brain damage or mental illness at the time of the murder.\n\nBecause the evidence does not sufficiently indicate that Thompson was under some psychiatric or psychological impairment at the time of the crime so as to absolve him of criminal culpability, it is unclear whether Thompson would have been able to mount an effective psychiatric defense at the guilt phase if his trial counsel had secured the services of an appropriate psychiatric expert. Although Thompson had suffered some head injuries and experienced mental instability during the time of his service in the Navy, and though his mental condition may have continued to decline subsequent to the crime, the present record does not allow us to conclude whether the assistance of an appropriate psychiatric expert would have altered the outcome of the guilt phase of Thompson's trial.\n\nOn the other hand, there certainly is reasonable probability that, but for trial counsel's deficiencies at the penalty phase of the trial, the jury would have concluded that the death sentence was not warranted in this case. It is well-established that at the sentencing phase of a capital trial, the jury must consider the facts and circumstances of the crime and the character and background of the defendant. Lockett v. Ohio, 438 U.S. 586, 604 (1978); Austin, 126 F.3d at 848. As this Court noted in Coe:\n\nWe have previously had occasion to explore the nature of the Tennessee death penalty process:\n\nTennessee is a \"weighing\" state--that is, the jury determines whether any aggravating circumstances have been established beyond a reasonable doubt by the State and then balances this against any mitigating circumstances found by the individual jurors. If the jury unanimously finds that the aggravators outweigh the mitigators, death must be imposed. Coe, 161 F.3d at 332 (quoting Houston v. Dutton, 50 F.3d 381, 387 (6th Cir. 1995)).\n\nHere, it seems quite likely that, but for trial counsel's objectively unreasonable strategy triggered by their failure to hire an appropriate psychiatric expert, the result at the penalty phase was likely to have been different. See Strickland, 466 U.S. at 700; Mayfield v. Woodford, 270 F.3d 915, 932 (9th Cir. 2001) (\"If the jury had considered the testimony of experts in endocrinology and toxicology, or of friends and family members relating additional humanizing stories, there is a reasonable probability that the omitted evidence would have changed the conclusion that the aggravating circumstances outweighed the mitigating circumstances and, hence, the sentence imposed.\") (internal quotation marks and citation omitted); Skaggs, 235 F.3d at 269-75 (finding that counsel's failure to find a different psychiatric expert for the penalty phase of the trial was prejudicial because it resulted in the presentation of no mitigation evidence at all, even though the defendant suffered from mild mental retardation and diminished capacity); Glenn, 71 F.3d at 1210-11 (holding that counsel's failure to present pertinent evidence of mental history and mental capacity was prejudicial).\n\nAlthough in the absence of competent psychiatric testimony there was insufficient evidence showing that Thompson was suffering from some psychiatric or psychological impairment at the time of the crime, there was, on the other hand, sufficient record testimony indicating that his mental condition has deteriorated since 1985. As Dr. Blair pointed out in her testimony at the post-conviction evidentiary hearing, three psychiatrists who treated or examined Thompson from 1985 to 1990 diagnosed him as either having a bipolar disorder or a schizoaffective disorder or schizophrenia. According to Dr. Blair, \"there was some question as to whether [Thompson] accurately fit the diagnostic criteria for [schizoaffective] disorder or schizophrenia or a bipolar disorder, all of which usually begin in early adulthood.\" Further, on the basis of the reports of the mental health professionals treating Thompson since the late 1980s, Dr. Crown concluded that Thompson suffered from some form of organic brain damage, which was secondary to a \"schizo-affective disorder, bipolar subtype.\" Given what the evidence about Thompson's deteriorating mental condition after the crime suggests about his mental condition at the time of the crime, there is reasonable probability that, but for trial counsel's failure to obtain appropriate psychiatric assistance so as to investigate and present mitigating evidence regarding the marked change in Thompson's behavior during his time in the Navy and his possible mental illness, the jury would have concluded by balancing the aggravating and mitigating circumstances that the death sentence was not warranted.\n\nIn this case, the availability of psychiatric expert testimony that, at the time of the crime or at the time of the trial, Thompson suffered from some form of psychiatric disorder, including perhaps even organic brain disorder or bipolar disorder, schizo affective disorder or schizophrenia, would have presented the jury with a far more sympathetic figure--which would likely have altered the conclusion that the aggravating circumstances outweighed the mitigating circumstances. Accordingly, there can be no confidence in the reliability of the death sentence imposed in this case because there is a reasonable probability that, but for trial counsel's deficient performance at the penalty phase of the trial, the jury would not have recommended the death penalty. See Austin, 126 F.3d at 849 (holding that \"[counsel's] failure to investigate or present any mitigating evidence undermined the adversarial process and rendered the death sentence unreliable\").\n\nIII. Conclusion\n\nRegardless of evidence presented against Thompson at the guilt phase, trial counsel's deficient performance sealed his fate at the penalty phase. Instead of making extraordinary efforts as prescribed by ABA standards, Combs, 205 F.3d at 289-90, trial counsel's performance on Thompson's behalf at the penalty phase was not merely ineffectual, but positively detrimental to his cause. To hold that AEDPA compels us to uphold the patently unreasonable action of Thompson's trial attorneys under its presumed interpretative strictures is to misrepresent AEDPA. The result in Williams v. Taylor, 529 U.S. 362 (2000) supports the view that the state court's application of Strickland was more than incorrect; it was in fact unreasonable, thereby satisfying the requirements of AEDPA. This is so because a competent attorney unquestionably would have obtained a suitable expert in a capital offense case such as this. To hold otherwise, as the state court did, constitutes an unreasonable application of Strickland because, as a consequence of trial counsel's error, the jury was not given the opportunity to consider evidence about Thompson's deteriorating mental condition after he was discharged from the Navy, which might have caused the jury to recommend the option of life imprisonment without parole instead of the death penalty. Considering the highly prejudicial consequences of the unreasonable strategy of Thompson's trial counsel flowing from their error in failing to hire the proper expert to examine Thompson, it is clear that the state court's application of Strickland was unreasonable.\n\nFor the foregoing reasons, I would therefore reverse the district court's judgment granting summary judgment to Warden Bell and remand to the district court with instructions to issue a writ of habeas corpus vacating Thompson's death sentence unless the State of Tennessee conducts a new penalty trial proceeding within 180 days of remand, while providing Thompson with the appropriate psychiatric services necessary to assist the defense in the presentation of mitigating evidence as guaranteed to Thompson by the Constitution.\n\n\u003cspan class=\"fn\"\u003e1. Rollins did not participate in Thompson's representation due to a conflict of interest, and was relieved of his appointment on April 9, 1985. Doyle Richardson was substituted as co-counsel the same day. He remained as counsel through the state proceedings on direct appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Specifically, the staff at Multi-County Mental Health Center was directed by the court, in part, as follows: The staff shall assess if, at the time of the criminal conduct, as a result of mental disease or defect, [the defendant] lacked substantial capacity either to appreciate the wrongfulness of his conduct or to conform his conduct to the requirements of the law. The terms \"mental disease or defect\" do not include any abnormality manifested only by repeated criminal or otherwise antisocial conduct.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Trial counsel Richardson stated at the pretrial motion on July 10, 1985: I really don't believe he got an impartial review on that. It would almost appear from the reports that the psychiatrist is just an extension of the State. I don't believe he has had a really independent review, and it is something that the defendant is starting to complain about. I've got mixed emotions about an independent psychiatrist--it is sometimes a two-edged sword. Whatever is told to them, they can be called to testify about it and have to; but that's not to say that I don't need it.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. On June 20, 1985, trial counsel filed a \"Notice of Intent to Use Industrial Psychologist.\" The notice stated that Thompson intended \"to use the testimony of Dr. George Copple, Clinical Psychologist, in the trial of this cause in regard to defendant's mental condition and abilities.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. When asked on cross-examination whether he \"basically [held] [himself] out as an industrial psychologist more than a clinical psychologist,\" Copple said: No. My licensing in the State of Tennessee is as a clinical psychologist. The application that I make of it most frequently is concerning the abilities and the lost abilities, to some extent, of individuals. I don't believe that--the majority of my work is actually Social Security Administration evaluations, and that is not really industrial psychology. That is clinical psychology, but it is from the standpoint of making a psychological evaluation as relating to whether a person can work anymore or not.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Watson stated that he did not interpret the EEG, which is a medical test.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Watson testified that although he was aware of Thompson's head injuries, he did not have the hospital records.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The number refers to the catalog number of the diagnosis in the Diagnostic and Statistical Manual, 3rd Ed. Watson explained to the jury that adult antisocial behavior is not a per se mental illness or defect or mental disorder, but a recognized set of behaviors.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. During this stage of the proceedings Thompson was represented by new counsel.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Parsons stated that Copple was chosen because co-counsel Richardson had taken a course from Copple while Richardson attended Vanderbilt and Copple was the head of the psychology department.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Richardson stated: I believe the tests that they gave--that they give will reflect whether or not there is some brain damage or not. . . . I believe clinical psychologists do this for psychiatrists. They do the testing that will detect if a person's brain is not functioning properly from injury.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The allegation reads in part: Counsel was ineffective for failing to fully investigate and present relevant evidence of Mr. Thompson's mental health history, and to secure adequate expert assistance to defend Mr. Thompson including psychologists, neuropsychological, and/or neurological experts to establish valid mitigating factors including, but not limited to, three statutory mitigating factors under Tennessee law, i.e., that Mr. Thompson suffered from substantial mental disorders and demonstrable physical brain damage which made him unable to conform his behavior to the law; left him under the influence of extreme mental or emotional disturbance, [and] substantially impaired his ability to appreciate the wrongfulness of his conduct at the time of the offense. Again, in a separate allegation, Thompson alleged: Counsel failed to obtain adequate expert assistance, including confidential psychological, neuropsychological, and neurological experts.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. On February 12, 1999, Thompson filed an ex parte motion for temporary mandatory restraining order, for preliminary injunctive relief, for permanent mandatory injunction, for an order finding petitioner incompetent to proceed, continuance, and to toll. Attached to that affidavit is the Declaration of Dr. Faye Sultan, a clinical psychologist with a Ph.D in clinical psychology from the University of Georgia. In that declaration Sultan stated that she had examined Thompson on a periodic basis since 1998. In Sultan's opinion as of February 1999, Thompson met all of the diagnostic criteria for major mental illness Schizophrenia, Episodic, with Interepisode Residual Symptoms. Sultan's affidavit does not discuss Thompson's mental state at the time of the offense. Rather, its focus was to address his then-current mental condition and alleged inability to proceed with the appeal process. Thompson filed a motion to alter or amend the judgment pursuant to Fed. R. Civ. P. 60(b) for the purpose of allowing him to supplement the record with the deposition and accompanying record of Dr. Faye E. Sultan, Ph.D. The district court denied it as time-barred by order dated March 7, 2001.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Crown testified that the tests included: The Shipley Institutes of Living Scale; the G-F-W Auditory Selective Attention Test; the Category Test; the Kaufman Neuropsychological Assessment Procedure; the Luria Memory Test; the Reitan-Indiana Aphasia Screening Test; the Rey-Osterreith Complex Figure Test; the Trailmaking Test; Word Generation, F/A/S; Finger Oscillation Test; and the Wisconsin Card Sorting Test. (Dct. R. vol. 2 Exh. 91 p18)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Crown defined \"organic brain damage\" as \"damage to the brain that is of a physical nature, and that physical nature may be anatomic, it may be electrical, or it may be metabolical.\" (R.91 p.40) When asked if he knew the causation for Thompson's brain damage, he replied: \"I don't specifically know the causation. I believe it may be secondary to his thought disorder since we know that in people with thought disorders that the thought disorder itself may either be caused by or may result in some damage to the brain.\" (R.91 p. 40-41).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Only limited portions of Dr. Blau's deposition testimony were filed with the district court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Thompson indicated that he has consolidated the seven issues upon which the certificate of appealability was granted into four issues.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. 212 F.3d 940 (6th Cir. 2000), cert. denied, 532 U.S. 947(2001).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The Second Circuit observes that our view of § 2254's unreasonable application prong in Doan, namely that an \"unreasonable application\" analysis cannot be performed on a state court decision that fails to identify a state prisoner's federal claim, is in tension with our conclusion in Harris that when a state court decides a constitutional issue by form order or without discussion, a habeas court should focus on the result and perform an \"unreasonable application\" analysis. See Sellan v. Kuhlman, 261 F.3d 303, 313 n.5 (2d Cir. 2001). However, Judge Moore, the author of Doan, explained the apparent contradiction as follows: Harris denied habeas relief because the Supreme Court had not clearly established a defendant's right to a free copy of a transcript of his co-defendants' previous trial for the impeachment of witnesses in the defendant's trial. Harris, 212 F.3d at 945. In contrast, the defendant in Doan had a clearly established Sixth Amendment right to a fair and impartial jury. Therefore, the language in Harris about the state court's unreasonable application of federal law was dicta, and Doan's \"contrary to\" analysis controls. Schoenberger, 290 F.3d at 842 (Moore, J., concurring).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. The district court rendered its decision prior to Williams. Thus, its reliance on the \"all reasonable jurists\" standard was proper at the time.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Thompson's amended petition for post conviction relief provides in pertinent part: Counsel failed to request and obtain adequate expert and investigative assistance regarding Gregory Thompson's head injuries during his youth, and failed to obtain \"adequate expert assistance\" regarding Gregory Thompson's competency at the time Gregory Thompson made incriminating statements to state authorities. In his federal habeas petition, Thompson averred that: Counsel was ineffective for failing to fully investigate and present relevant evidence of Mr. Thompson's mental health history, and to secure adequate expert assistance to defend Mr. Thompson including psychologists, neuropsychological, and/or neurological experts to establish valid mitigating factors . . . Counsel failed to obtain adequate expert assistance, including confidential psychological, neuropsychological, and neurological experts. (Emphasis added.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. We note that Thompson is represented by the same office in this appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. The state introduced a redacted portion of Thompson's evaluation at MTMHI though Watson, a rebuttal witness.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. The American Psychological Association describe industrial psychologists as follows: \"Industrial/organizational psychologists apply psychological principles and research methods to the work place in the interest of improving productivity and the quality of work life.\" http://www.apa.org/students/brochure/subfields.html.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. In his brief Thompson recites what these witnesses \"would have testified\" to had counsel \"conducted a proper social history.\" This purported testimony is unsupported by any record proof, and violates Fed. R. App. 28.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. The lead opinion's contention that Thompson procedurally defaulted his claim that trial counsel were ineffective because they failed to hire a psychiatrist instead of a psychologist is unsupported inasmuch as this claim is inherently implied by Thompson's petitions for relief. More importantly, however, trial counsel's failure to hire any competent psychological assistance whatsoever provides a basis for granting Thompson relief, as will be demonstrated.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. The lead opinion's attempt to characterize Dr. Copple as a clinical psychologist as opposed to an industrial psychologist by virtue of Dr. Copple's self-serving description is unpersuasive. Despite the professional label that Dr. Copple chose for himself, the fact remains that by definition, Dr. Copple is an industrial psychologist inasmuch as he specializes in the evaluation of Social Security applicants who allegedly suffer from psychological disorders which prevent the applicants from performing work in the national economy, and in \"vocational evaluations\" which are used to assist individuals in achieving their vocational goal. See Stedman's Medical Dictionary 1165 (27th ed. 2000) (defining \"industrial psychologist\" as a licensed psychologist who specializes in \"the application of the principles of psychology to problems in business and industry\"). Significantly, Dr. Copple in no way could be characterized as a forensic psychologist. See id. (defining \"forensic psychologist\" as a licensed psychologist who specializes in \"the application of psychology to legal matters in a court of law\"); see also infra note 5.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. SIOP, Division 14 of the American Psychological Association and an organizational affiliate of the American Psychology Society, states that its purpose is to study and promote human performance in organizational and work settings, and is perhaps the most authoritative source in this country for information about the nature and expertise of industrial-organizational (I-O) psychologists.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. These descriptions of I/O psychologists are generally accepted by psychologists. For example, the MacMillan Dictionary of Psychology defines \"industrial psychology\" as \"[t]he psychological study of all aspects of work and of the working environment, and the application of psychological findings to improving efficiency and contentment at work, through e.g. better selection methods, improved design of machinery, improved training, or improved organizational and management strategies.\" MacMillan Dictionary of Psychology (2d ed. 1995); see also The Dictionary of Psychology (1999) (Defining \"industrial-organizational psychology\" as \"[t]he application of psychological theory and methods to industrial and organizational problems having to do with a person's self, others, job, machines, operations, etc. as well as to improving selection of personnel and work procedures, all in the interest of establishing a productive and happy climate in a variety of shops, agencies, and organizations, as well as enhancing profit\"). As explained in the Baker Encyclopedia of Psychology \u0026 Counseling: \"[a]reas of specialization within I/O psychology include personnel (industrial) psychology (selection) and hiring, training, and performance appraisal). Baker Encyclopedia of Psychology \u0026 Counseling 619 (2d ed. 1999); see also 4 Encyclopedia of Psychology 252-63 (2000) (discussing industrial and organizational psychology in three articles about the history of the field, its principle theories and the assessments and interventions used in the field).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. In describing forensic psychiatry, the Baker Encyclopedia of Psychology \u0026 Counseling states: Forensic psychiatry is a branch of forensic medicine, the science that deals with the application of medical facts to legal problems. The term medico-legal refers to a contrasting distinction, a branch of law that deals with the application of legal principles to medical and psychiatric problems. Forensic psychiatry and medico-legal psychiatry are used interchangeably and while \"forensic psychiatry\" has a specific meaning, it is generically used to denote the interface shared by psychiatry and the law. Baker Encyclopedia of Psychology \u0026 Counseling, supra at 464. Similarly, \"forensic psychology\" is defined by the MacMillan Dictionary of Psychology to be \"[a] branch of applied psychology that studies and makes practical suggestions about the working of the law.\" The Dictionary of Psychology also defines \"forensic psychology\" generally as \"[t]he application of psychological principles and techniques in law, including the evaluation of testimony, functions of the expert witness, methods of interrogation, guilt detection, legal policies, diagnosis and therapy, and general assistance in a variety of problems.\" As explained in the Baker Encyclopedia of Psychology \u0026 Counseling: The role and function of a psychologist in a court setting can involve pretrial, trial and posttrial tasks. The pretrial question of competency of the defendant to cooperate with the attorney and understand the charges is usually determined by a combination of clinical interviews and tests such as intelligence tests, projective tests and tests for literacy. The psychologist may also be asked to determine the state of the defendant's mind at the time of the crime. This is a rather controversial aspect of the competency evaluation because the psychologist is asked to determine the defendant's mental state not at the time of the evaluation but at some previous time. Baker Encyclopedia of Psychology \u0026 Counseling, supra at 467.\u003c/span\u003e\n\n",
    "body_length": 145450,
    "citedas": [
      "315 F.3d 566"
    ],
    "attorneys": "Counsel Argued: Dana C. Hansen, Federal Defender Services, Knoxville, Tennessee, for Appellant. Jennifer L.Smith, Office OF The Attorney General, Criminal Justice Division, Nashville, Tennessee, for Appellee. ON Brief: Dana C. Hansen, Federal Defender Services, Knoxville, Tennessee, for Appellant. Jennifer L.Smith, Office OF The Attorney General, Criminal Justice Division, Nashville, Tennessee, for Appellee.",
    "category": [
      "243",
      "36",
      "78",
      "75"
    ],
    "judges": "Before: Suhrheinrich, Moore, and Clay, Circuit Judges.",
    "citation_count": 8
  }
}
