{
  "id": "e7hoTmYBTlTomsSBNa6a",
  "document": {
    "title": "State v. Rose",
    "full_title": "STATE OF NEW JERSEY v. TEDDY ROSE",
    "jurisdiction": "Supreme Court of New Jersey",
    "date": "1988-09-22T00:00:00.000Z",
    "docket": "No. A-36",
    "body": "Defendant, Teddy Rose, was tried by an Essex County jury for the murder of Irvington police officer Anthony Garaffa. He was convicted and sentenced to death. He appeals directly to this Court as of right. R. 2:2-1(a)(3). We affirm his convictions for murder and for the related offenses.\n\nThe fairness of the sentencing proceeding in this case was marred by a series of prejudicial errors. These include the lack of a limiting instruction by the trial court concerning evidence of defendant's past conduct elicited by the State during cross-examination of defense witnesses, several instances of improper conduct by the Essex County Prosecutor, and the absence of any clarifying instructions to the jury concerning its function in weighing two aggravating factors, N.J.S.A. 2C:11-3c(4)(f) and (h), based on identical evidence. We therefore set aside the death sentence and remand the matter to the trial court for a new sentencing proceeding.\n\nI.\n\nThis case involves the shocking and senseless killing of an Irvington police officer. The uncontested evidence adduced during the guilt phase of the trial demonstrated that on August 8, 1984, at approximately 11:45 p.m., defendant, Rose, shot and killed Irvington police officer Anthony Garaffa with a sawed-off shotgun.\n\nEarlier that evening defendant had been out with a friend, returning to his home in Irvington shortly after 11:00 p.m. He was approached by two acquaintances, Gerry Cuccolo and Paul Palermo. They told Rose they planned to burglarize a pizza restaurant and asked to borrow some of Rose's tools. Rose loaned them the tools, but the testimony at trial was contradictory about Rose also agreeing to act as a lookout. Cuccolo and Palermo proceeded to the pizzeria; however, the burglary plan was aborted when Cuccolo was observed in the hallway leading to the pizza parlor. The two returned a pry bar to\n\nRose, and Palermo, with Rose's consent, retained possession of the other tools.\n\nRose returned from his car to the corner of Springfield Avenue and 40th Street with Palermo, carrying a white canvas bag over his shoulder. In the bag was a sawed-off shotgun he had purchased a few weeks earlier in Pennsylvania. They joined Cuccolo and two other young men, Michael O'Keefe and a person known as \"Mark.\" It was then about 11:30 p.m.\n\nPalermo and Mark departed, and Cuccolo, O'Keefe, and Rose started walking down 40th Street. Rose took the lead and Cuccolo followed about five to seven feet behind, with O'Keefe to his right. An Irvington police car passed by. Rose waved to the driver and told Cuccolo that he thought it was someone he knew. The patrol car passed Cuccolo, O'Keefe, and Rose and pulled up to the corner. The driver then backed up the patrol car, stopping abreast of Cuccolo, O'Keefe, and Rose who stood by the curb.\n\nIrvington Police Officer Anthony Garaffa was driving the patrol car. After stopping the car beside Cuccolo, O'Keefe, and Rose, he got out and approached them. Officer Garaffa held a flashlight in his hand. He shined the flashlight on the white canvas bag still over Teddy Rose's shoulder and inquired about its contents. According to the testimony of Cuccolo and O'Keefe, Rose responded that the bag contained a \"rocket.\" As he was responding to Officer Garaffa's question, he removed the bag from his shoulder and placed it on the ground. Officer Garaffa asked to see what was in the bag. At that point, Rose put his hand in the bag, raised it up, said \"and this,\" held the bag to Officer Garaffa's stomach and fired the shotgun. Officer Garaffa was knocked five or six feet into the street, flat on his back.\n\nRose dropped the gun and fled. Cuccolo attempted to aid Officer Garaffa, then tried to summon help with the patrol car radio but received no response. Cuccolo left the scene in an effort to obtain assistance, and found Irvington Police Officer\n\nRobert Williams who was in the vicinity investigating the aborted burglary of the pizza parlor. Officer Williams ran toward Officer Garaffa's patrol car. He found Officer Garaffa in the street behind the vehicle, semi-conscious and severely wounded. Officer Williams immediately radioed for assistance. Other police officers arrived at the scene. Garaffa's pulse was rapid and weak, and his breathing was labored. The police began supplying him with oxygen, and emergency medical technicians arrived. Before Officer Garaffa could be placed in an ambulance, he experienced cardiac arrest, and the medical technicians had to administer cardio-pulmonary resuscitation.\n\nIn the ambulance Officer Garaffa regained consciousness and was able to breathe without assistance. He had severe pain in his legs and lower back and had to be restrained by a paramedic. He arrived at College Hospital in Newark at about 12:00 a.m. According to Doctor Thomas Corbyons, the head of the College Hospital Trauma Team, when Officer Garaffa arrived in the emergency room, he had \"no blood pressure\" and a low heart rate. Preliminarily, steps were taken to assist his breathing and restore his blood pressure and heart rate. He was then transferred to an operating room. Doctor Corbyons described his injury as \"enormous.\" Approximately three-quarters of the aorta was \"shot away,\" and the vena cava was lacerated over \"almost its entire length.\" The wadding of the shotgun shell was imbedded in the spinal column. Despite the surgeon's efforts, Officer Garaffa's heart stopped beating during surgery, and the medical team was unable to resuscitate him. He was pronounced dead at 3:05 a.m.\n\nIn the meantime, defendant had driven to his aunt's house in Monmouth Junction. He told his aunt that he had shot a police officer in Irvington. From his aunt's house, he called Debby Wolfe, the woman he had been with earlier that evening, and told her that he had shot Officer Garaffa. Defendant and his aunt, Helen Pyne, drove to the Princeton Barracks of the New Jersey State Police between 1:00 a.m. and 1:30 a.m. Defendant told Sergeant Gary Knight of the State Police that he had shot\n\na police officer in Irvington, and that he wished to confess in order to ease his conscience. Sergeant Knight contacted the Irvington Police Department to confirm that an Irvington police officer had in fact been shot, and that defendant was wanted in connection with the shooting. When Rose began to tell Sergeant Knight what had occurred, Knight interrupted to give him Miranda warnings. Miranda v. Arizona, 384 U.S. 436, 86 S. Ct. 1602, 16 L. Ed. 2d 694 (1966). Knight then administered Miranda warnings a second time to be certain the defendant understood his rights.\n\nSergeant Knight testified at the guilt phase about defendant's statement to him:\n\nQ. What did he tell you happened?\n\nA. He said that he had taken a gun out of the trunk of his car and bringing it into the house into where he lived and that he was confronted by a police officer. He had the gun in a sack and that when he was confronted by the police officer, the police officer had stated to him what was in the sack. He stated that he had a bottle rocket.\n\nThe police officer then asked him -- the police officer then asked him to take the object out of the bag. At that time Mr. Rose stated to me that when he took the weapon out the sack --\n\nQ. Did he tell you he reached into the sack?\n\nA. Yes.\n\nQ. All right.\n\nA. He reached into the sack and when he pulled it out of the sack it apparently had cocked and when it came out of the sack the gun went off striking the police officer in [the] abdomen.\n\nDefendant was sweating and nervous when he spoke to Sergeant Knight; he was \"pale, ashen,\" and frightened. He expressed the hope that Officer Garaffa would recover.\n\nDetective Eugene Czaplinski and two other officers from the Irvington Police Department arrived at the Princeton Barracks sometime after 2:00 a.m. Miranda warnings were administered, and Rose signed a waiver-of-rights form. Detective Czaplinski then interrogated defendant, recording both the questions and answers on a typed statement that defendant signed. In his statement defendant gave this account of the shooting:\n\n[A]s I reached into the bag I cocked the shotgun by pulling back the hammer with my thumb. I just looked at him and I just fired the gun.\n\nRose told Officer Czaplinski that he knew the gun was loaded with a 12-gauge, 7 1/2 shot shell when he cocked and fired it. He stated that he shot Officer Garaffa because he \"panicked, did not want to get caught.\"\n\nThe police officers took the defendant back to Irvington that night. After another Miranda warning, Rose gave a second written statement in which he made a positive identification of the shotgun, denied taking any drugs or alcohol before the shooting, and stated that he had received \"very good\" treatment by the police from the time he had turned himself in. This statement was completed and signed by the defendant at 6:34 a.m., August 9.\n\nAn Essex County grand jury indicted defendant for (1) the purposeful or knowing murder of Irvington Police Officer Anthony Garaffa; (2) possession of a sawed-off shotgun; (3) possession of a sawed-off shotgun with a purpose to use it unlawfully against the person or property of another; (4) hindering apprehension; and (5) conspiracy to commit burglary. The conspiracy to commit burglary charge was severed from the other counts, and at the time of this appeal was still pending.\n\nFollowing ten days of jury selection, the trial commenced on May 29, 1985. The State offered detailed evidence of the events that resulted in Officer Garaffa's death. In addition, evidence was introduced concerning defendant's reasons for acquiring the sawed-off shotgun, and the fact that he often carried the gun with him and had practiced shooting it. The State also offered evidence of an incident that occurred about a week prior to the murder, during which defendant had the shotgun in his possession as he and some friends were about to confront a black male with whom they had previously experienced some difficulty.\n\nDefendant called no witnesses in the guilt phase. In his opening statement, defense counsel acknowledged that Rose had shot and killed Officer Garaffa, but argued that he did so in an \"instantaneous act of fear and panic.\" He stressed that it was critical for the jury to determine whether the murder was \"with premeditation * * * and with an evil mind.\" At the conclusion of the guilt phase, defense counsel requested that the trial court include in its jury charge the lesser-included offense of aggravated manslaughter. The trial court denied the requested charge. In summation, defense counsel acknowledged defendant's guilt. The jury found defendant guilty of all charges.\n\nIn the penalty phase, defendant invoked four mitigating factors: that he acted under the influence of extreme mental or emotional disturbance (N.J.S.A. 2C:11-3c(5)(a)); his age at the time of the murder (N.J.S.A. 2C:11-3c(5)(c)); that his capacity to appreciate the wrongfulness of his conduct or to conform his conduct to the requirements of the law was significantly impaired by mental disease and/or intoxication (N.J.S.A. 2C:11-3c(5)(d)); and circumstances concerning his background and character (N.J.S.A. 2C:11-3c(5)(h)). The defendant originally intended to prove the existence of another mitigating factor, that the defendant had \"no significant history of prior criminal activity.\" N.J.S.A. 2C:11-3c(5)(f). However, after the trial judge denied defendant's motion to restrict rebuttal of this factor to evidence of prior criminal convictions, the defendant withdrew mitigating factor (5)(f).\n\nThe State advanced three aggravating factors at the penalty hearing: (1) that the murder was outrageously or wantonly vile, horrible, or inhuman in that it involved torture, depravity of mind, or an aggravated battery to the victim (N.J.S.A. 2C:11-3c(4)(c)); (2) that the murder was committed for the purpose of escaping detection, apprehension, trial, punishment, or confinement for another offense (N.J.S.A. 2C:11-3c(4)(f)); and (3) that the defendant murdered a public servant while the victim was engaged in the performance of his duty or because\n\nof the victim's status as a public servant (N.J.S.A. 2C:11-3c(4)(h)). The State did not present any new evidence at the penalty phase; it simply moved into evidence all the testimony presented and the exhibits offered and accepted into evidence in the guilt phase.\n\nDefense counsel called several witnesses at the penalty phase: Lee Claus, the defendant's grandmother, who raised him after he was deserted by his mother; Betty Ann Walker, the defendant's mother; Betty Jane Rose, the defendant's sister; Thomas Michael Rose and Ernest Rose, the defendant's half-brothers; and Helen Pyne. Eugene Thomas Hagey, Jr., and Larry Kukan, former employers of Teddy Rose, also testified. The defense called two expert witnesses: Dr. Leah Blumberg Lapidus, a professor of clinical psychology at Columbia University, and Dr. Robert A. Fox, Jr., a psychiatrist, who is professor of clinical psychiatry at New York University Medical Center and Director of In-Patient Psychiatry at New York University Hospital. Nicholas Ciufi, Assistant Principal of Irvington High School and a past teacher of defendant, testified, as did Regina Marie Doyle, Coordinator of Senior Outreach Services for the Irvington Mental Health Center, who had worked with Rose during his treatment at the Center from July to December 1982. Several friends of defendant also testified: Linda Mettler, Dorothy Frank, Pamela Ann Patinha, Joanne Macavia, Denise Marie Korski, Debra Ann Wolfe, and Suzanne Malamut. Defendant also took the stand during the penalty phase.\n\nThe jury found that the prosecution had proved two aggravating factors (N.J.S.A. 2C:11-3c(4)(f) and (h)), that the defendant had proved two mitigating factors (N.J.S.A. 2C:11-3c(5)(a) and (h)), and that the aggravating factors substantially outweighed the mitigating factors. The court imposed a sentence of death.\n\nIn July 1985, defendant moved for a new trial. The court denied defendant's motion, and proceeded to sentence him on\n\nthe noncapital counts to a four-year prison term on count two and a nine-month term on count four, the terms to run concurrently. The guilty verdict on count three was vacated and merged with the murder conviction.\n\nDefendant challenges his conviction and death sentence on numerous grounds including the deprivation of his federal and state constitutional rights to a fair trial. We now consider defendant's contentions.\n\nA. Constitutionality\n\nDefendant challenges the constitutionality of New Jersey's capital punishment act, N.J.S.A. 2C:11-3c to g, an issue we addressed and decided in State v. Biegenwald, 106 N.J. 13, 25-26 (1987), and State v. Ramseur, 106 N.J. 123, 166-97 (1987). We adhere to our conclusion that the death penalty statute does not violate either federal or state constitutional prohibitions against cruel and unusual punishment. U.S. Const. amends. VIII, XIV; N.J. Const. of 1947 art. I, para. 12.\n\nB. Jury Selection Issues\n\n1. Death Qualification\n\nDefendant challenges the death-qualification process used in the course of selection of the jury. His primary contention is that the exclusion of jurors from the guilt phase, because their views on the death penalty would require their exclusion from the penalty phase, violates his constitutional right to be tried by an impartial jury. Furthermore, defendant argues that the very process of death qualification, focusing as it does on the willingness of jurors to impose the death penalty in a case in which guilt has yet to be determined, inevitably conditions the jurors to assume the defendant's guilt and thus violates his right to an impartial jury. We rejected both of these arguments in State v. Ramseur, supra, 106 N.J. at 248-54, the first expressly and the second by implication. In Ramseur, we observed that under our capital punishment act\n\nthe duties of jurors \"contemplate both phases of a capital trial, the guilt/innocence phase and the penalty phase,\" and thus \"the State is entitled to insist on a properly conducted interrogation of jurors prior to the guilt phase of a capital trial to determine whether their views on capital punishment will substantially interfere with their duties as jurors.\" Id. at 254. We adhere to that view. Cf. Buchanan v. Kentucky, U.S. , n. 16, 107 S. Ct. 2906, 2913 n. 16, 97 L. Ed. 2d 336, 350 n. 16 (1987) (upholding death qualification where death penalty sought only as to codefendant, despite Court's assumption that death qualification \"produces juries somewhat more 'conviction prone' than nondeath-qualified juries\").\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e We add only that trial courts, on their own initiative or at counsel's request, may take into account a defendant's concerns about the collateral effects of the death qualification process by addressing the issue specifically in the course of the voir dire.\n\n2. Exclusion of Certain Jurors\n\nIn Ramseur this Court adopted the death qualification test as reformulated by the United States Supreme Court in Adams v. Texas, 448 U.S. 38, 100 S. Ct. 2521, 65 L. Ed. 2d 581 (1980), and Wainwright v. Witt, 469 U.S. 412, 105 S. Ct. 844, 83 L. Ed. 2d 841 (1985). State v. Ramseur, supra, 106 N.J. at 256 (\"Henceforth, trial courts shall use the Adams test in death-qualifying a jury.\"). In Adams, the Supreme Court held that the death-qualification test is whether the juror's views \"would prevent or substantially impair the performance of his duties as a juror in accordance with his instructions and his oath.\" Adams v. Texas, supra, 448 U.S. at 45, 100 S. Ct. at 2526, 65 L. Ed. 2d at 589; see also Wainwright v. Witt, supra, 469 U.S. at 424, 105 S. Ct. at 852, 83 L. Ed. 2d at 851-52 (the Adams standard \"does not require that a juror's bias be proved with 'unmistakable clarity';\" the \"standard is whether the juror's views would\n\n'prevent or substantially impair the performance of his duties as a juror in accordance with his instructions and his oath'\").\n\nWe also noted in Ramseur, 106 N.J. at 256, that trial courts must be accorded a \"sound measure of discretion\" in determining whether or not a juror's views on the death penalty would prevent or substantially interfere with the juror's performance of his duties:\n\nA sensitive weighing and appraisal of a juror's entire response must be made by the trial court in its duty to resolve the question of whether the juror has shown bias or prejudgment in answering the questions. [Id. at 257.]\n\nBefore us defendant challenges the exclusion of five jurors, Deborah Campbell, Valeria Cacossa, Grace Cohn, Janet Stone, and George Muller. Although defense counsel objected to the removal of juror Cohn, no objection was asserted in the course of voir dire to the removal of the other four jurors. We have carefully reviewed the interrogation and responses of each of the jurors whose exclusion is challenged. We are convinced that in each case there is substantial support in the record for the trial court's conclusion that the jurors' views on the death penalty would \"prevent or substantially interfere with the performance of [their] duty.\" Jurors Cacossa, Stone, and Muller flatly stated that they would never vote to impose the death penalty. Jurors Campbell and Cohn expressed a strong desire to avoid responsibility for a decision resulting in death and their responses indicated that it was highly unlikely that either could ever vote to impose the death penalty. Accordingly, the trial court's exclusion of these jurors did not constitute an improper exercise of discretion.\n\n3. Challenge to Composition of Grand and Petit Juries\n\nDefendant contends that the grand and petit juries that indicted, convicted, and sentenced him under-represented blacks and that, as a result, the county deprived him of his federal and state constitutional rights to an impartial jury and to equal protection of the laws. Defendant also asserts that the grand jury procedures used by the assignment judge violated New\n\nJersey selection statutes and that the selection process for grand jury forepersons improperly excluded blacks and women. In support of this assertion, defendant relies on the challenge to the composition of the Essex County grand and petit juries advanced in defendant's briefs in Ramseur.\n\nWe fully addressed each of these contentions in State v. Ramseur, supra, 106 N.J. at 212-36 and we adhere to the views expressed in that opinion.\n\nC. Guilt Phase Issues\n\n1. Refusal to Charge Lesser-Included Offense of Aggravated Manslaughter\n\nDefendant contends that the trial court's refusal to charge the lesser-included offense of aggravated manslaughter deprived him of a fair trial and due process of law. Prior to summations in the guilt phase of the case, there was a colloquy between the trial court and counsel concerning the proposed jury charge. Initially, except for the prosecutor's inquiry to confirm that a charge concerning flight would be given, neither counsel submitted requests to charge to the court. The trial court then informed counsel that he did not intend to charge the jury on any lesser-included offenses, citing State v. Choice, 98 N.J. 295 (1985). In response, defense counsel specifically requested a charge of aggravated manslaughter. The trial court denied the requested charge.\n\nBefore us defendant first argues that the trial court incorrectly relied on State v. Choice as its source for the standard to apply in determining whether or not to charge aggravated manslaughter. In Choice we observed that when a defendant does not request a lesser included offense charge,\n\n[t]he trial court does not * * * have the obligation on its own meticulously to sift through the entire record in every murder trial to see if some combination of facts and inferences might rationally sustain a manslaughter charge. It is only when the facts \"clearly indicate\" the appropriateness of that charge that the duty of the trial court arises. [98 N.J. at 299.]\n\nThe State concedes that since defense counsel requested the aggravated manslaughter charge, the Choice standard is inapplicable, and thus agrees with defendant's assertion that the controlling principles are set forth in State v. Crisantos (Arriagas), 102 N.J. 265 (1986):\n\n[U]nder our Code it is improper for a trial court to charge manslaughter, even when requested by the defendant, if there is no evidence in the record to support a manslaughter conviction. To warrant the charge, there must be a \"rational basis\" for a manslaughter verdict.\n\nDefendant contends that although no defense witnesses were called in the guilt phase of the trial, evidence adduced during the State's case afforded a rational basis for the jury to conclude that defendant's \"fear and panic upon being approached by [Officer Garaffa] led him to mishandle the sawed-off shotgun and recklessly cause the officer's death.\" Defendant points to the testimony of his companion on the night of the shooting, Gerald Cuccolo, who confirmed that he was \"surprised\" and \"shocked\" when defendant shot Officer Garaffa, and to the testimony of Debra Wolfe that when defendant called her after the shooting, \"[h]e was crying and he was nervous.\" Primarily, however, defendant relies on the testimony of Trooper Gary Knight of the New Jersey State Police, who questioned defendant when he turned himself in. Trooper Knight testified that defendant told him that he \"reached into the sack and when he pulled it out of the sack it apparently had cocked and when it came out of the sack the gun went off striking the police officer in [the] abdomen.\" Supra at 472. Although defense counsel in his opening statement stated that \"[defendant] shot Officer Garaffa in an instantaneous act of fear and panic,\" the only direct testimony on this point came from Irvington police detective Eugene Czaplinski, who had\n\ninterrogated Rose. Detective Czaplinski testified that he asked Rose, \"Why did you shoot the officer?\", and defendant replied: \"I panicked, did not want to get caught.\"\n\nThe State argues that Trooper Knight's testimony is simply a paraphrase of defendant's statement to him, that defendant never told Trooper Knight that the gun was fired \"accidentally,\"\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e and that the phrases \"apparently had cocked,\" and \"the gun went off\" were vague acknowledgments of guilt that omitted any explanation of how the hammer became cocked or how the shotgun was fired. The State asserts that defendant's written statement describing the shooting, given to Czaplinski and other Irvington police officers, refutes any possible suggestion that the shooting was accidental:\n\nI reached into the bag and as I reached into the bag I cocked the shotgun by pulling back the hammer with my thumb. I just looked at him and just fired the gun.\n\nThe State also relies heavily on the uncontradicted testimony of its ballistic expert, Kenneth Salvato. He testified that the shotgun could not be fired accidentally; that to fire the weapon required a two-step procedure -- cocking the hammer and pulling the trigger; and that approximately 4 1/4 pounds of pressure was required to pull the trigger.\n\nWe have carefully scrutinized the record and independently reviewed all of the testimony pertinent to the requested lesser-included-offense charge. In our view the evidence would not have afforded the jury a rational basis for returning a verdict convicting the defendant of aggravated manslaughter. N.J.S.A. 2C:1-8e; State v. Crisantos (Arriagas), supra, 102 N.J. at 275.\n\nThe Code defines aggravated manslaughter as follows:\n\nCriminal homicide constitutes aggravated manslaughter when the actor recklessly causes death under circumstances manifesting extreme indifference to human life. [ N.J.S.A. 2C:11-4a.]\n\nUnder the Code, one acts recklessly \"with respect to a material element of an offense when he consciously disregards a substantial and unjustifiable risk that the material element exists or will result from his conduct.\" N.J.S.A. 2C:2-2b(3). By contrast, conduct is \"knowing,\" with respect to a result, if the person is aware \"that it is practically certain that his conduct will cause such a result,\" N.J.S.A. 2C:2-2b(2); it is \"purposeful,\" if it is the person's \"conscious object\" to cause such a result. N.J.S.A. 2C:2-2b(1).\n\nDefendant's principal contention is that aggravated manslaughter should have been charged because there was some evidence in the record suggesting that the shooting was accidental and not intentional. We find that the overwhelming weight of the proofs in the guilt phase establish that defendant's act of firing the shotgun was volitional. Defendant's familiarity with the operation of the shotgun and its destructive capacity was illustrated by evidence that he had practiced shooting it on several occasions during the weeks preceding the\n\nhomicide. His use of the words \"and this\" as he fired the shotgun, his graphically candid statement to detective Czaplinski that \"I just looked at him and just fired the gun,\" and the uncontradicted testimony of the ballistics expert concerning the pressure required to pull the trigger combine to demonstrate that whatever may have prompted defendant to fire the shotgun, the defendant's conduct in firing the weapon was intentional and not accidental. In the context of all the guilt-phase testimony, defendant's statement to Trooper Knight could not rationally be construed as an assertion that the shooting was accidental. Rather, as argued by the State, the statement reflected an acknowledgment of defendant's responsibility for the shooting without any explanation of how it occurred. It constituted far too speculative and insubstantial a basis for a manslaughter verdict. Hence, the trial court's refusal to charge the jury with the lesser-included offense of aggravated manslaughter, on the assumption that the jury could have concluded the shooting occurred accidentally, was not error since the evidence during the guilt phase did not afford a \"rational basis\" for such a jury verdict.\n\nDefendant's collateral argument that the shooting occurred because he \"panicked,\" and \"did not want to get caught\" does not relate to the question of volition nor negate the evidence that the shooting was knowing or purposeful. Panic is an emotional condition, characterized by sudden, even groundless, fright. It does not constitute a justification for conduct pursuant to the Code, see N.J.S.A. 2C:3-1 to -11 (codifying valid defenses, \"panic\" not included), nor was panic recognized as a defense to crime at common law. Further, defendant's \"panic\" at the time of the shooting was not offered as evidence in the guilt phase of a mental defect to prove diminished capacity, i.e., that defendant did not have a state of mind that is an element of the offense. N.J.S.A. 2C:4-2; see State v. Breakiron, 108 N.J. 591, 607-09\n\n(1987).\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nOur dissenting colleagues assert that because of defendant's \"panic,\" his state of mind may have been reckless, rather than knowing or purposeful, with respect to the result of the shooting of Officer Garaffa. Their contention is that even if the firing of the shotgun was intentional, the record afforded the jury a rational basis for concluding that defendant's conduct was prompted by panic, and therefore defendant \"recklessly\" caused Officer Garaffa's death, N.J.S.A. 2C:11-4a, by consciously disregarding the substantial risk that death would result from the firing of the shotgun. N.J.S.A. 2C:2-2b(3). Post at 550-553, 554-560 (Handler, J. dissenting); post at 549, 550 (Wilentz, C.J., concurring and dissenting). Justice Handler hypothesizes that defendant's \"blind panic\" may have prevented him from realizing how close he was to Officer Garaffa or that the weapon was aimed at the officer's abdomen, and that he may have acted without thinking about the consequences of his actions. Post at 557 (Handler, J., dissenting).\n\nOur colleagues' position ignores the reality that in the absence of insanity or diminished capacity, a person firing a sawed-off shotgun into the abdomen of another at point-blank range necessarily is aware that \"it is practically certain\" that such conduct will cause the victim's death. N.J.S.A. 2C:2-2b(2). Their position also appears to accord undue significance to an isolated reference to \"panic\" that appears once in the guilt-phase trial record. As noted, Detective Czaplinski testified that defendant, when asked why he shot Officer Garaffa, responded: \"I panicked, did not want to get caught.\" There was no other testimony in the guilt phase from defendant or any other witness that suggested that defendant was unaware of the inevitable consequence of firing the shotgun at Officer Garaffa's abdomen. There was no testimony, expert or otherwise, in the guilt phase that this defendant's capacity to be aware of the inevitable result of his conduct was diminished because of a mental or emotional condition. Hence, an aggravated manslaughter charge would have invited the jury to speculate, in the absence of evidence of defendant's mental processes, about whether defendant's \"panic\" interfered in some manner with his capacity to be aware of the consequences of his act. There simply was no evidence put before the jury in the guilt phase that would have supported such a determination. Defendant's statement that he \"panicked, did not want to get caught,\" does not constitute a rational basis for a jury to conclude that defendant was merely reckless and thus unaware that firing the shotgun into Officer Garaffa's abdomen was \"practically certain\" to cause his death. We therefore find no error in the trial court's refusal to charge aggravated manslaughter.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\n2. Admission of Evidence of Defendant's Past Conduct at the Guilt Phase\n\nDefendant contends that testimony concerning two instances of past conduct was improperly admitted into evidence during the guilt phase, thereby depriving him of a fair trial. The first incident concerned defendant's purchase of the sawed-off shotgun in Pennsylvania one or two months before the shooting of Officer Garaffa. Rose purchased the gun from Gordon Seale, a forklift operator in Pottstown, Pennsylvania. The State called Seale as a witness. Over defense counsel's objection, Seale testified that Rose paid him sixty dollars for the gun, which he needed because \"he was having some problems over in Jersey with some niggers.\" The trial court rejected the contention that the testimony was irrelevant and unduly inflammatory, concluding that it was material to the third count of the indictment charging defendant with possession of the shotgun with a purpose to use it unlawfully. N.J.S.A. 2C:39-4a. The court stated:\n\n[T]he fact of the matter is the testimony I've heard so far all seems to indicate Officer Garaffa came by here, that no one expected [him] to go by there. There was no evidence Mr. Rose expected him. It would seem to me based on the very charge in the indictment that the very purpose for which he had the gun is relevant so the State can prove in fact he had the weapon on August 8th for the purpose of using it unlawfully.\n\nDefendant also objects to the admission of testimony concerning a second incident that occurred in an Irvington schoolyard one to one-and-a-half weeks before the shooting of Officer Garaffa. Rose's friend Nicholas Silva testified that on the day in question he, Paul Palermo, and defendant intended to confront one Coley Hunter, whom Silva described as \"* * * a black guy that I had trouble with and Teddy had trouble with and my brother had trouble with.\" Silva testified that when he, Palermo, and Rose left their car to walk to the schoolyard, in order to find Hunter, defendant removed his sawed-off shotgun from the trunk. He placed it in his right pants pocket, which had a hole in it, so the shotgun \"just went down his leg.\" According to Silva's testimony, he told defendant to put the gun\n\naway. Defendant replied, \"Fuck it, I don't give a shit.\" The trial court permitted Silva to testify about Rose's statement to him, overruling defense counsel's objection that the comment was irrelevant.\n\nThe State argues that the testimony concerning both incidents is material to the charge that defendant possessed the shotgun on August Eighth with a purpose to use it unlawfully. Primarily, however, the State asserts that the testimony was admissible under Evidence Rule 55 to establish intent and absence of mistake or accident. Referring to defense counsel's opening statement\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e as putting in issue defendant's state of mind when he shot Officer Garaffa, the State argues that the disputed testimony was offered to establish \"the requisite mens rea essential to convictions for purposeful or knowing murder * * *.\"\n\nDefendant challenges the admission of this testimony on several grounds. He contends that the charge of possession of the shotgun for an unlawful purpose was not contested, citing concessions made by defense counsel in his opening statement.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e In addition, he cites the trial court's charge to the jury on the count charging possession of the shotgun with an unlawful purpose. Defendant asserts that the charge characterized this count as \"inseparable\" from the shooting itself, and permitted the jury to find that proof of the shooting also constituted proof of defendant's unlawful purpose, thereby obviating the need for\n\nevidence of unrelated events to prove defendant's unlawful purpose. Defendant also challenges the admissibility of this testimony under Evidence Rule 55, citing State v. Soney, 177 N.J. Super. 47, 59 (App.Div.1980), certif. denied, 87 N.J. 313 (1981), for the proposition that evidence of commission of a \"crime or civil wrong on a specified occasion [is inadmissible] to show a disposition to engage in such conduct at another time.\" Defendant also contends that the testimony should have been excluded under Evidence Rule 4 because any probative value that it possessed was outweighed by the risk that its admissibility would \"create substantial danger of undue prejudice or of confusing the issues or of misleading the jury.\" Finally, defendant claims reversible error because of the trial court's failure to instruct the jury concerning the limited purpose for which the evidence was admitted. Evid.R. 6.\n\nWe agree that the testimony concerning defendant's reason for purchasing the shotgun as well as the testimony describing his conversation with Nicholas Silva on the way to the schoolyard were inadmissible to prove that on August 8, 1984, defendant possessed the shotgun with the purpose to use it unlawfully. We held in State v. Harmon, 104 N.J. 189 (1986), that a violation of N.J.S.A. 2C:39-4a \"requires proof not only that the accused intended to use the weapon, but that he intended to use it to accomplish a criminal purpose.\" Id. at 203. In the absence of a proffer by the State of an intention to offer evidence that defendant's unlawful purpose in possessing the weapon on August Eighth was related to his \"problems\" with blacks or to his hostility toward Coley Hunter, we find no relevance whatsoever in the testimony at issue to the charge that on the date in question defendant possessed the shotgun for an unlawful purpose.\n\nAlthough it is a close question, we find the testimony somewhat relevant to the issue of defendant's state of mind at the time of shooting and thus admissible under the criteria set forth in Evidence Rule 55 as evidence of \"intent\" or \"absence\n\nof mistake or accident.\" We agree with the State's contention that it was obligated to prove defendant's state of mind, and that defense counsel's opening could fairly be construed as contesting that the shooting was knowing or purposeful. Supra at 487 n. 5. Defendant's request at the close of the guilt phase for a charge of aggravated manslaughter lends support to the State's contention. We view the testimony concerning the schoolyard incident, which suggested defendant's willingness to use the shotgun offensively against Coley Hunter, to be somewhat probative on the question whether defendant's shooting of Officer Garaffa was purposeful or accidental. We reach the same conclusion, but with greater reservation because the relevance is more attenuated, about the explanation offered by defendant to Gordon Seale when he purchased the shotgun. That testimony perhaps suggested that defendant was inclined to use the shotgun offensively against others; hence, although inadmissible to prove that he shot Officer Garaffa, it was slightly probative on the question whether the shooting was purposeful or accidental.\n\nOur articulation of the rationale concerning the possible grounds for admission of this evidence underscores the necessity for according some measure of discretion to trial courts in ruling on the admissibility of evidence that may be both material and inflammatory. In our view, the preferred disposition would have been to admit the evidence of the schoolyard conversation, but exclude the conversation with Gordon Seale under Evidence Rule 4 because of its limited relevance and its capacity to prejudice the jury. Nevertheless, because the evidence of guilt was overwhelming, we consider the admission of the testimony concerning defendant's conversation with Seale, in the guilt phase, to be harmless error, and not clearly capable of producing an unjust result. R. 2:10-2.\n\nFinally, we fully agree with defendant's contention, conceded by the State, that the trial court's failure to instruct the jury concerning the limited purpose for which this evidence\n\nwas admitted, Evid.R. 6, constituted error. Unquestionably, the jury should have been told that the evidence was to be considered only on the question whether the State had sustained its burden of proof that the shooting was knowing or purposeful. In view of the substantial evidence of defendant's guilt, we do not find that the court's failure to give this limiting instruction constituted reversible error in the guilt phase of the trial. We discuss below the effect of the trial court's omission during the penalty phase to afford the jury a limiting instruction concerning evidence of prior acts of defendant that was elicited during the penalty phase. Infra at 503-509.\n\nAccordingly, we affirm defendant's convictions for murder and for the related offenses.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nD. Penalty Phase Issues\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\n1. Admission of Prejudicial Evidence of Defendant's Past Conduct During Cross-Examination of Expert and Character Witnesses, Combined with Trial Court's Failure to Give a Limiting Instruction, Deprived Defendant of a Capital Sentencing Hearing.\n\nAt the commencement of the penalty phase of the case, the trial court granted the State's motion to admit as evidence in the penalty phase all of the State's testimony and evidence admitted during the guilt phase. The State called no other witnesses and offered no other evidence. Thus, the penalty phase of the trial, aside from the opening and closing arguments of counsel, was devoted exclusively to the direct testimony\n\nand cross-examination of expert and lay witnesses produced by the defendant.\n\nDefendant contends that in the course of the State's cross-examination of its witnesses, evidence of defendant's past conduct was improperly elicited by the prosecutor. Defendant asserts that in some instances the cross-examination went far beyond the scope of direct testimony; in other instances the cross-examination is challenged as violative of Evidence Rule 47; in still other instances defendant's contention is that the questions posed by the prosecutor unfairly or inaccurately characterized past events or improperly referred to events not otherwise proved by evidence in the record. Some of defendant's contentions in this regard also pertain to the charge of prosecutorial misconduct. Infra at 513-519. Complementary to these contentions is defendant's argument that the admission of the evidence of defendant's past conduct in the penalty phase obligated the trial court to give the jury a limiting instruction, Evid.R. 6, so that the jury would not consider this evidence as supplementing the aggravating factors proved by the State. Infra at 503-509. Without such a limiting instruction, defendant argues, the jury's verdict in the penalty phase may have been influenced by its misunderstanding of the limited relevance of the evidence of defendant's past conduct.\n\nBefore discussing the applicable legal principles, we summarize those portions of the testimony of the expert and character witnesses challenged by defendant.\n\nExpert Testimony\n\nDr. Leah Lapidus, a professor of clinical psychology at Columbia University, was defendant's first expert witness. She based her opinion of defendant's mental condition on the results of a battery of standardized psychological tests, interviews with defendant, records from the Irvington Mental Health Clinic, accounts of defendant's relationships with women and of his visit with his mother in Indiana a few months prior to the shooting, and details regarding the shooting of Officer Garaffa.\n\nDr. Lapidus testified that the results of defendant's psychological testing were consistent with \"serious mental disturbance,\" and that defendant exhibited a \"borderline psychotic pattern.\" She stated that in a stressful situation defendant would experience \"massive confusion, commotion,\" that his thinking would become \"confused and chaotic,\" and that he functioned with \"unrealistic panic and impulsivity under stress * * *.\" She testified in a generalized fashion that he had previously exhibited a \"panic or rage type\" reaction in his relationships with women, particularly when he felt insecure or anticipated the relationship would terminate. In such situations Dr. Lapidus said Rose would panic and \"strike out\" to prevent abandonment. She testified that the shooting of Officer Garaffa was consistent with his behavior patterns, describing it as a reaction to \"overwhelming panic, loss of control, [and] sense of catastrophe.\" She testified that at the time of the shooting defendant was under the influence of \"extreme emotional disturbance\" and that his ability to conform to the requirements of the law was \"severely impaired.\"\n\nDuring cross-examination Dr. Lapidus was asked by the prosecutor to reconcile the schoolyard incident, in which Rose refused to accede to his friend's suggestion that he put the shotgun away, with her testimony describing Rose as \"suggestible\" and eager to please. In response, Dr. Lapidus explained that in her opinion Rose's recent visit to Indiana to visit his mother, who had abandoned him, was a \"catastrophe\" that left Rose with a feeling of \"desperation.\" To counter the witness's testimony that Rose's actions were prompted by his unsuccessful attempt to establish a relationship with his mother, the prosecutor questioned Dr. Lapidus about defendant's conduct prior to visiting his mother:\n\nQ. What do you think about the fact that he 3 years before that or at least 2 years before that Indiana catastrophe, that he punched a girl in the face because she didn't want to do it his way? Doesn't that sort of show that he had this attitude long before he went to Indiana? Did you know that? Did you\n\nknow that fact that he had punched one of his girlfriends in the face?\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e (Emphasis added.)\n\nA. I read a report about that but as I recall it wasn't about doing something exactly his way but it was about rejection, again that theme.\n\nQ. Why was he being rejected by the girl and by all his girlfriends?\n\nMR. HOCHMAN: Objection, your Honor.\n\nQ. If you know?\n\nTHE COURT: If she knows she could answer the question, Mr. Hochman.\n\nA. As characteristic with this kind of borderline pathology, there's an instability in the emotional relationships so that attachments are fine to start with and then they get so intense that he develops a kind of paranoid kind of jealousy. It becomes panicked, they're not going to stay attached to him, he's going to lose them as he lost his mother and his identity and the rest of it and so that then he becomes too sticky and becomes paranoid and jealous and then he drives them away and gets the rejection that he's so terrified about and then feels a helpless out of control frustration that explodes at times in an aggressive reaction.\n\nQ. Do you know how the intensive situations develop in the relationship? I mean, you said you read the reports of these girlfriends?\n\nA. Right, and I interviewed one girlfriend.\n\nQ. Doesn't it all start because he's beating them up, he's pulling their hairs and dragging them, trying to run them over with the car, punching them in the face, throwing ash trays at them?\n\nA. No that's --\n\nQ. Taking them to a motel and locking them in a room and beating them up and deserting them there. Don't you think that would have something to do with the fact that the relationship is going to be terminated?\n\nA. That's not the way the sequence or the way any of the reports -- I didn't come across one single report that suggested he just sort of out of the blue without any sense of threat and that he would be losing them that --\n\nQ. Do you have reports or statements from these women? Were they given to you?\n\nA. I read those reports and I interviewed one girlfriend who described the pattern that was consistent with the reports that the relationship goes along fine for a while and then as he gets very intensely attached, he begins to feel very vulnerable and insecure and he's going to lose it all and then he puts so much pressure on them under time that then they feel like withdrawing --\n\nQ. They feel like withdrawing because they're getting beat up regularly, right? That's not in the reports you read?\n\nA. I never saw anything that suggested that he went around just beating up girlfriends. I have worked with people who batter but he doesn't --\n\nQ. I don't care about other cases. This case, did you read about the girl who's [ sic ] hair he pulled as he dragged her down the street? Did you read that one?\n\nA. I think I read something like that.\n\nQ. Did you read [about the one] that got punched in the face? Did you read that one?\n\nA. I believe so.\n\nQ. Okay.\n\nDid you read [about the one] that got an ash tray thrown at her which resulted in a big bruise in her side, do you remember that one?\n\nA. I vaguely remember something about an ash tray but each --\n\nQ. Do you remember the one he took her car from her and tried to run her over with the car, do you remember that one?\n\nA. I read that.\n\nQ. Okay.\n\nNow, do you think that maybe that's why these girls want to leave him?\n\nA. I think it's chicken and egg, I think it's the dependency gets so intense that then they start to leave and then he feels desperate and he drives them away further and then comes the violence, not the other way around.\n\nThe prosecutor also cross-examined Dr. Lapidus concerning her knowledge of other incidents involving defendant's prior conduct. She was questioned about defendant's statement that he purchased the shotgun because he was \"having trouble with some niggers in New Jersey;\" she was asked about \"a knife episode * * * where he had the fight with the black kids in Irvington;\" and she was asked about the schoolyard incident in which defendant, carrying the shotgun in his trousers, went with his friends to look for Coley Hunter. Presumably, these questions were intended to challenge Dr. Lapidus's testimony linking defendant's aggression to situations involving stress and panic.\n\nDuring his cross-examination of Dr. Lapidus, the prosecutor ascertained that she had previously reviewed the statement of Nicholas Silva as part of the records on which her opinion of defendant's mental condition was based. The prosecutor then asked Dr. Lapidus to read from Silva's statement aloud to the\n\njury, although a comment by defendant described in the statement had been ruled inadmissible by the trial court, during the guilt phase of the case, on the two occasions that the prosecutor had attempted to elicit evidence concerning that comment.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Without objection, Dr. Lapidus read aloud from Silva's statement:\n\nA. \"Teddy said I have to show Paul something. I got Paul. We walked over to Teddy's car. It was parked on 40th Street in front of his house. Teddy took the shotgun out of the trunk and put it in a blanket. Teddy put the gun in the back seat next to Paul. We drove to 38th Street and parked the car. Teddy got out of the car and put the gun down his pants. I told him someone was going to see it and he said fuck it, I don't give a shit.\n\nWe walked over to the driveway by the school and waited for the black kids to come out. While we were waiting there Teddy said I wish we had a stolen car or a van so we could take Coley for a ride.\"\n\nQ. Coley?\n\nA. Coley for a ride.\n\nQ. He's the black kid, right?\n\nA. Is it? I guess.\n\n\"We waited for about 10 minutes and Coley's younger brother came out with three of his friends and walked passed us.\n\n\"QUESTION: Did any of you say anything to the black youths?\n\nANSWER: No, but after they walked passed us Teddy pulled out the gun and pointed at them and said I should blow their fucking heads off. I told\n\nTeddy to put the gun away, we are out on Springfield Avenue. (Emphasis added.)\n\nQUESTION: Did any of the black kids see Teddy with the gun?\n\nA. No, their backs were turned, they were walking away from us. After that we walked back to the car and Teddy put the gun under the front seat and Teddy dropped us off.\"\n\nAlthough Dr. Lapidus stated that she had not reviewed defendant's army records, the prosecutor questioned her briefly about his \"short\" period of military service and whether she was aware that defendant had been \"AWOL\" on several occasions.\n\nDr. Robert A. Fox, Jr., a professor of clinical psychiatry at New York University Medical Center, also testified as an expert witness. He interviewed defendant on four separate occasions. He also reviewed the police reports, witness statements, the records concerning Rose from the Irvington Mental Health Center, and statements from two of defendant's former \"girlfriends.\" He testified that he was aware that Rose had difficulty controlling his anger, and had on occasions struck women that he had been seeing socially. He also testified that defendant's unsuccessful attempt at a reunion with his mother in Indiana a few months before the shooting had a significant and adverse effect on defendant's emotional condition.\n\nHe diagnosed Rose as suffering from chronic depression as well as a borderline personality disorder characterized by instability in personal relationships. He testified that defendant's prior tendencies toward depression and violence were magnified after his failed visit with his mother. Dr. Fox expressed the opinion that at the time of the shooting defendant \"was under the influence of extreme mental or emotional disturbance\" and that his capacity \"to conform his conduct to the requirements of the law was significantly impaired as a result of mental disease or defect.\" See N.J.S.A. 2C:11-3c(5)(a), (d).\n\nDuring cross-examination, Dr. Fox disclaimed any familiarity with defendant's school records, army record, or jail record, but acknowledged speaking with defendant concerning his incarceration.\n\nDr. Fox responded in the negative when asked by the prosecutor if defendant had told him anything about extorting meals from other inmates at jail, or about \"social relationships\" or friendships with other prisoners. Although Dr. Fox denied any knowledge of defendant's disciplinary problems in high school, he was cross-examined by the prosecutor about the \"significance\" of defendant having been suspended in high school on different occasions for assaulting other students, selling firecrackers, intoxication, and profanity to a teacher. Dr. Fox was asked about and acknowledged defendant's brief army serviceand two occasions on which he was AWOL.\n\nThe prosecutor challenged Dr. Fox's testimony that defendant's unsuccessful visit with his mother in Indiana significantly affected defendant's behavior.\n\n[Q.] How about the fact of his treatment of his \"girlfriends\"? The history of personal violence on behalf of Teddy Rose goes back way before his visit to Indiana, doesn't it?\n\nA. Way back.\n\nQ. Couple of years back?\n\nA. About 4 years.\n\nQ. You're familiar with the fact over that period of time he would punch the girl in the nose, punched her in the face, right?\n\nA. Yes, all those things are well detailed.\n\nQ. He tried to run another one over with her own car?\n\nA. Chased her with a car, yes.\n\nQ. Dragged one by the hair and dragged her down the street?\n\nA. I think that was the same one, the same one he chased with the car I thought.\n\nQ. Well, how about the one where he threw something from the kitchen? It was an ash tray or something, hit her in the body and she had a big bruise she said for a while after that, remember that one?\n\nA. Yes.\n\nQ. That was all before the Indiana visit, right?\n\nA. That was in 81 or 82.\n\nQ. How about Malamut, Sue Malamut?\n\nA. Sue Malamut is one of the girlfriend's name.\n\nQ. Remember the incident there where she was taken to a motel by him and she was mistreated at the motel and then abandoned at the motel on Route 22 in Union and she had to call her girlfriend to come and get her because he left with the car?\n\nA. Right.\n\nQ. All these incidents occurred well before the visit to Indiana?\n\nA. Well before.\n\nQ. These all show this person is somewhat of a violent person way before Indiana?\n\nA. Yes, he was a violent person, oh yes.\n\nQ. What was the change in his life that he told you he had when he came back from Indiana? What changed? He was already thrown out of school, he was already thrown out of the Army, he was beating up the girls. He was already getting fired from jobs. What changed, what's the difference because he has an unfortunate meeting with his natural mother?\n\nDr. Fox was also questioned by the prosecutor about several of the incidents on which Dr. Lapidus was interrogated, including defendant's reason for buying the shotgun, and the schoolyard incident where defendant approached black youths with the shotgun in his trousers.\n\nCharacter Testimony\n\nPamela Patinha, a friend of defendant, testified to defendant's good character and his kindness to her children. On cross-examination, she was asked if defendant told her how he \"beat up\" a girlfriend named Suzy, that he was \"carrying a gun around looking for those black kids in the neighborhood,\" and that he \"bought the shotgun to settle some disputes he had with some black kids in the neighborhood.\" The witness disclaimed knowledge of these events. Denise Korski, another friend, described defendant as \"thoughtful, caring;\" on cross-examination she was asked if defendant told her \"about the times he beat his girlfriends.\" Defense witness Dorothy Frank was asked if she knew that defendant was a \"beater of women.\"\n\nJoanne Macavia also testified in general terms as a character witness for defendant. On cross-examination, she was questioned about her knowledge of defendant's violent behavior toward women:\n\nQ. Were you present during any of the times when he beat up the girls, punched them in the face, dragged them by the hair over the street, tried to run them over?\n\nA. No.\n\nQ. Desert them in a motel room?\n\nQ. That never happened; he never laid a hand on Suzy then. I picked her up, I was the girlfriend that picked her up.\n\nAs noted above, we confine our discussion here to defendant's challenges to the scope of cross-examination during the penalty phase, to the admissibility of evidence elicited during cross-examination, and to the omission of a limiting instruction concerning evidence of defendant's past conduct elicited during the penalty phase. We find reversible error only in the trial court's failure to afford the jury a limiting instruction concerning the abundant evidence of defendant's past conduct adduced during cross-examination of defendant's witnesses. To some extent issues concerning the scope of cross-examination will also be addressed in our discussion of prosecutorial misconduct. Infra at 513-519.\n\n(a) Cross-Examination of Expert Witnesses\n\nCounsel are customarily accorded considerable latitude in the cross-examination of witnesses, subject to limits reasonably imposed by the trial court in the exercise of its sound discretion. State v. Siegler, 12 N.J. 520, 526-27 (1953). Defendant acknowledges that it was appropriate for the prosecutor to have tested the conclusions of its expert witnesses through cross-examination focused on factors that formed the basis for their opinions.\n\nDefendant contends, however, that questions to Dr. Lapidus and Dr. Fox emphasizing details of defendant's record in high school, the army, and in jail were improper because the records were not in evidence and the experts had not relied on them in formulating their opinions. Moreover, defendant asserts that the questions posed by the prosecutor concerning these subjects exposed the jury to allegations about defendant's past conduct not otherwise admissible by the State in the penalty phase. An example cited is the prosecutor's question during cross-examination of Dr. Fox concerning his knowledge that defendant extorted meals from inmates while in jail, an allegation that the prosecutor repeated during his summation.\n\nDefense counsel did not object to the question and Dr. Fox denied any such knowledge.\n\nWithout doubt, the question was improper, and a timely objection, if made, should have been sustained. Not only was the subject matter unrelated to Dr. Fox's opinion or the information reviewed by him, no facts concerning the event on which the question was based were in evidence and the prosecutor made no proffer indicating his ability to prove the occurrence. See State v. Di Paglia, 64 N.J. 288, 302-03 (1974) (Clifford, J., dissenting); see also infra at 513-519 (discussing limits on cross-examination). Similarly, other questions relating to defendant's schooling, army service, and incarceration, asked and answered without objection, were neither related to the materials reviewed by the experts nor based on evidence in the record. Subject to our conclusion concerning the need for a limiting instruction before jury deliberations in the penalty phase, we find that whatever error may have occurred in permitting this line of cross-examination was not clearly capable of producing an unjust result. R. 2:10-2.\n\nDefendant challenges the prosecutor's cross-examination of the expert witnesses concerning defendant's acts of physical violence toward women. Although acknowledging that information concerning these incidents had been reviewed by the experts prior to trial, defendant contends that the cross-examination was improper because it was conducted based on the prosecutor's \"wildly exaggerated version of the facts.\" Since both experts referred to these incidents during their direct testimony, the defendant's prior physical assaults on women was a proper subject for cross-examination. Although defense counsel had ample basis for objecting to the exaggerated and inflammatory form of this interrogation, we note that this questioning also occurred without objection. Under the circumstances, and subject to our conclusion about the need for a limiting instruction, we conclude that any error\n\non the part of the trial court in connection with this aspect of the expert's cross-examination was harmless.\n\nDefendant also challenges as irrelevant and inflammatory the interrogation of Dr. Lapidus and Dr. Fox concerning defendant's reason for buying the shotgun, the schoolyard incident in which defendant carried the shotgun while looking for Coley Hunter, and defendant's hostility toward and altercations with black youths. We find this line of interrogation to be pertinent and conclude, subject to our determination concerning a limiting instruction and our discussion of prosecutorial misconduct, that any errors that occurred on specific aspects of this cross-examination were harmless.\n\n(b) Cross-examination of Character Witnesses\n\nDefendant contends that it was prejudicial error for the trial court to have allowed the prosecutor to cross-examine character witnesses concerning their knowledge of instances of past conduct not evidenced by a criminal conviction. Defendant cites the prosecutor's interrogation of character witnesses with regard to defendant's acts of violence toward women, and defendant's hostility to and threatening encounters with black youths as examples of cross-examination in violation of Evidence Rule 47. That Rule provides:\n\nRULE 47. CHARACTER TRAIT AS PROOF OF CONDUCT\n\nSubject to Rules 48 and 55, a trait of character offered for the purpose of drawing inferences as to the conduct of a person on a specified occasion may be proved only by: (a) testimony in the form of opinion, (b) evidence of reputation, or (c) evidence of conviction of a crime which tends to prove the trait. Specific instances of conduct not the subject of a conviction of a crime shall be inadmissible. In a criminal proceeding, evidence offered by the prosecution of a trait of character of the defendant on trial may be admitted only if the judge has admitted evidence of good character offered by the defendant. Character evidence offered by the defendant may not be excluded under Rule 4. The credibility of a character witness testifying on behalf of the defendant may not be impaired by an inquiry into his knowledge of the defendant's alleged criminal conduct not evidenced by a conviction.\n\nPrior to the commencement of the penalty phase, the trial court granted defendant's motion, based on Evidence Rule 47, to preclude the prosecution from impeaching defendant's character\n\nwitnesses by inquiries into their knowledge of misconduct not evidenced by prior criminal convictions. Defendant contends that the trial court ignored its own ruling, and permitted impeachment of defendant's character witnesses in violation of that Rule.\n\nWe conclude that although the trial court's ruling based on Evidence Rule 47 was erroneous, the trial court did not err in permitting defendant's character witnesses to be cross-examined concerning defendant's past conduct not evidenced by prior convictions. Indeed, Evidence Rule 47 ordinarily would not apply to the penalty phase of a capital case. As Comment 1 to the rule illustrates, Evidence Rule 47 applies\n\nwhen evidence of a trait of a person's character is offered for the purpose of drawing inferences as to the conduct of that person on a particular occasion. * * * The rule deals with the use of character trait evidence as circumstantial proof of conduct. Rule 47 should not be confused with Rule 46, which applies when a trait of character is actually in issue under the substantive law of this State. * * * Thus, evidence of a criminal defendant's personal character which is admissible under Rule 46 at a hearing to determine whether the death penalty should be imposed is not ordinarily admissible at his prior trial for murder unless it is otherwise permitted under Rule 47. [Citations omitted (emphasis added).]\n\nAccord State v. Williams, 93 N.J. 39, 65 n. 9 (1983).\n\nThe testimony of defendant's character witnesses during the penalty phase was not offered \"for the purpose of drawing inferences as to [defendant's] conduct\" on the night of the shooting. Rather, such testimony was offered to prove mitigating factor c(5)(h), N.J.S.A. 2C:11-3c(5)(h), which reads:\n\n(h) Any other factor which is relevant to the defendant's character or record or the circumstances of the offense.\n\nTherefore, Evidence Rule 46 governs the scope of permissible cross-examination of defendant's character witnesses. It provides:\n\nWhen a person's character or a trait of his character is in issue, it may be proved by testimony in the form of opinion, by evidence of reputation, or by evidence of specific instances of the person's conduct, subject, however, to the limitation of Rules 47 and 48.\n\nComment 1 to Evidence Rule 46 observes:\n\nWhen the State seeks the imposition of the death penalty against a convicted murderer the personal character of the defendant is relevant to the determination\n\nof the existence of many of the mitigating circumstances outlined in N.J.S. 2C:11-3c(5) * * *.\n\nThus, we conclude that evidence of defendant's character offered to support mitigating factor c(5)(h) may be impeached under Evidence Rule 46 by evidence of specific conduct. Our determination finds further support in the section of the capital punishment act that governs the presentation of evidence during the penalty phase:\n\nAt the proceeding, the State shall have the burden of establishing beyond a reasonable doubt the existence of any aggravating factors set forth in paragraph (4) of this subsection. The defendant shall have the burden of producing evidence of the existence of any mitigating factors set forth in paragraph (5) of this subsection * * *.\n\nThe State and the defendant shall be permitted to rebut any evidence presented by the other party at the sentencing proceeding and to present argument as to the adequacy of the evidence to establish the existence of any aggravating or mitigating factor. [N.J.S.A. 2C:11-3c(2)(a), (d) (emphasis added).]\n\nAlthough we are satisfied that the use of instances of past conduct to impeach evidence of a defendant's good character is consistent with both the capital punishment statute and the Rules of Evidence, there is a compelling need for the trial court to exercise close supervision over such cross-examination in order to avoid prejudice to the defendant. The State, in the penalty phase, is restricted to proving the statutory aggravating factors and rebutting proof of mitigating factors. Since there is no statutory aggravating factor dependent on proof of prior bad conduct (other than prior murder convictions, N.J.S.A. 2C:11-3c(4)(a)), evidence of defendant's specific past conduct is pertinent only to the rebuttal of mitigating evidence of good character. Even if the jury is carefully instructed on the limited relevance of such evidence, infra at 503-509, there remains a substantial danger that inflammatory or misleading evidence of past conduct could be improperly applied by the jury during its deliberations. Thus, a trial court alerted in advance to the prosecutor's intention to interrogate defendant's character witnesses about instances of misconduct would be\n\nwell-advised to rule in advance on the permitted scope of such cross-examination, outside the presence of the jury. Evid.R. 8.\n\nDefendant also challenges the inflammatory nature of the prosecutor's cross-examination of the character witnesses. He argues that since the State is limited in the penalty phase to proving aggravating factors and rebutting evidence of mitigating factors, the prosecutor's repeated references to defendant's past conduct exposed the jury to highly prejudicial allegations that necessarily tainted the jury's deliberations. Focusing on the provocative and accusatory formulation of the interrogation, defendant contends that inadequate limitations by the trial court on the prosecutor's cross-examination necessarily prejudiced the jury's deliberations.\n\nWe note initially that the cross-examination of the character witnesses occurred without significant objections from defense counsel. Nevertheless, it is well settled and virtually self-evident that the cross-examination of character witness by interrogation concerning prior acts of misconduct is \"pregnant with possibilities of destructive prejudice. The mere asking by a respected official of such a question, however answered, may well suggest to the jury that the imputation is true.\" E. Cleary, McCormick's Handbook of the Law of Evidence  191 at 457-58 (2d ed. 1972) (McCormick); accord 3A Wigmore, Evidence  988 at 912-21 (Chadbourn rev. 1970).\n\nTo limit the possibility of prejudice, the trial court should have required a proffer by the prosecutor concerning the accuracy of the allegations referred to in his cross-examination. The procedure of choice is outlined by Professor McCormick:\n\n\"The trial judge, it is believed, should be required, before permitting the prosecuting counsel to cross-examine the character witness on rumors of misconduct of the accused, or upon arrests, charges or convictions, to request the prosecutor to give his * * * statement to the judge (in the absence of the jury) that he has reasonable ground to believe, and does believe, that the crimes or misconduct, which are imputed by the rumors, or which are the subject of the arrests or charges, were actually committed by the accused, and that the judgments of conviction inquired about were actually pronounced. Reasonable grounds would require, it is suggested, that the prosecutor's assurance be\n\nbased on the statements of witnesses, believed to be credible, who purport to have firsthand knowledge.\" [McCormick, supra, at 458.]\n\nThe same point was made by Justice (then Judge) Francis, writing for the Appellate Division, in State v. Steensen, 35 N.J. Super. 103, 108-09 (1955):\n\nThe administration of the rule is in the hands of the trial judge and he has a heavy responsibility to protect the practice from being abused. * * * A correlative obligation rests upon the prosecutor to display a very high degree of good faith in embarking upon such a cross-examination. [ Id. at 108 (citation omitted).]\n\nAccord Gross v. United States, 394 F.2d 216, 222-23 (8th Cir.1968), cert. denied, 397 U.S. 1013, 90 S. Ct. 1245, 25 L. Ed. 2d 427 (1970).\n\nBecause of our conclusion concerning the lack of a limiting instruction focusing on the evidence of defendant's past conduct, we need not decide whether the scope of the prosecutor's cross-examination of character witnesses itself constitutes reversible error. Suffice it to say that the need for close supervision by trial courts of this type of cross-examination in capital cases is particularly acute.\n\n(c) Omission of a Limiting Instruction\n\nDefendant contends that his death sentence should be reversed because of the trial court's failure to instruct the jury on the limited relevance of evidence of defendant's past conduct, asserting that the absence of any such cautionary instruction leaves undiminished the prejudicial impact of this testimony. The State's response is that no such instruction was requested by defense counsel; in any event, the State argues that the trial court's general instructions to the jury in the penalty phase were adequate.\n\nWe need not resolve the question whether defense counsel made sufficiently clear their request for a limiting instruction concerning this testimony, although it is self-evident that on an issue of such critical importance there should be no cause for understatement or ambiguity. We hold, in view of the repetitive and highly inflammatory quality of the evidence of defendant's\n\npast misconduct that came before the jury in the penalty phase, both derivatively through the guilt phase and in the cross-examination of defendant's penalty phase witnesses, that the trial court's failure to instruct the jury on the limited relevance of this evidence was so clearly prejudicial that it requires defendant's death sentence to be set aside.\n\nWe have already reviewed in detail the evidence of defendant's past conduct to which the jury was exposed in both the guilt and penalty phases of the case. During the guilt phase the jury heard evidence of defendant's apparent racially-tinged motivation for purchasing the sawed-off shotgun as well as evidence of defendant's defiant possession and threats to use the shotgun during the schoolyard incident. Supra at 473, 483-487. On the prosecutor's motion, this evidence was before the jury in the penalty phase.\n\nThrough cross-examination of defendant's expert witnesses in the penalty phase, the jury heard evidence (or references by the prosecutor) concerning past misconduct by defendant in high school, in the army, and in jail. Supra at 496. In addition, the jury heard extensive testimony and provocative references by the prosecutor to defendant's acts of physical violence toward his former girlfriends. Supra at 492-494; 497-498. The expert witnesses were also interrogated about the schoolyard incident and defendant's reason for buying the shotgun. Supra at 491, 494-496, 498.\n\nVirtually every character witness, other than defendant's relatives, was questioned aggressively by the prosecutor about defendant's tendency to \"beat up\" women. In addition, the cross-examination of some character witnesses included references to defendant's prior misuse of the shotgun.\n\nAll of this evidence of defendant's past conduct, to the extent it was admissible at all, was admissible only for a limited purpose. In the guilt phase, evidence of the schoolyard incident was admissible under Evidence Rule 55 to prove absence of\n\nmistake or accident; if admissible at all, evidence of defendant's reason for buying the shotgun was admissible for the same purpose. Supra at 485-490. In the penalty phase, evidence of defendant's past conduct was relevant to test the credibility and the conclusions of the expert witnesses, and in the case of the character witnesses was material to rebut their testimony to demonstrate defendant's good character as a mitigating factor.\n\nThe jury was never told about the limited relevance of any of this testimony. Evidence Rule 6 provides as follows:\n\nWhen relevant evidence is admissible as to one party or for one purpose and is inadmissible as to other parties or for another purpose, the judge shall restrict the evidence to its proper scope and instruct the jury accordingly. [Emphasis added.]\n\nWhen evidence is admissible for one purpose, but not for another, a limiting instruction is the appropriate device through which to restrict the jury's use of such evidence. See State v. Lair, 62 N.J. 388, 391 (1973); see also United States v. Gilliam, 484 F.2d 1093, 1096 (D.C.Cir.1973) (trial court is required to give, sua sponte, a cautionary instruction and * * * failure to do so constitutes reversible error\"); accord Jones v. United States, 385 F.2d 296, 300 (D.C.Cir.1967); McCormick, supra, at 134-36.\n\nIn the penalty phase of a capital case, the function of the jury has been sharply defined by the Legislature. The jury must determine if the State has proved beyond a reasonable doubt the existence of any aggravating factors, and if the defendant has proved the existence of any mitigating factors. The jury must then weigh only the aggravating factors against only the mitigating factors. N.J.S.A. 2C:11-3c(3). The jury is not permitted, in its weighing process, to add other evidence of defendant's past conduct to the weight it assigns to the aggravating factors, nor to consider other evidence of defendant's past conduct, except to the extent offered to rebut mitigating factors, as detracting from the weight it assigns to the mitigating\n\nfactors.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nIn this case, however, the jury was totally unguided concerning the uses to which it could put the abundant evidence of defendant's past conduct that was adduced at trial. We therefore have no confidence that the jury did not consider such evidence improperly in the course of its weighing process. We concede that there is no way to assure that a jury adheres scrupulously to the mandate of a limiting instruction. But in a death penalty context, and in the face of such abundant and inflammatory evidence of defendant's past conduct, the necessity for a careful and precise limiting instruction to this jury was clear and compelling. Its omission from the charge was prejudicial beyond a reasonable doubt and compels the reversal of defendant's death sentence.\n\n2. Prosecutorial Misconduct\n\nDefendant argues that the Essex County Prosecutor engaged \"in a pattern of misconduct, the cumulative effect of which was to deprive him of his constitutional guarantee of a fair trial at both phases of the [case].\" Although the State acknowledges that \"the prosecutor may have made some errors during the course of the trial,\" it asserts that the prosecutor's conduct \"in the context of the entire trial, was not so egregious as to warrant a reversal of either the defendant's conviction or sentence.\"\n\nIn resolving an allegation of prosecutorial misconduct, our courts have had no difficulty in defining the standards and\n\nguidelines that should circumscribe the conduct of a prosecutor in a criminal trial; the close questions arise in the application of the standards to the particular facts of a case. The classic and often-cited statement concerning the prosecutorial function is that of Mr. Justice Sutherland in Berger v. United States, 295 U.S. 78, 88, 55 S. Ct. 629, 633, 79 L. Ed. 1314, 1321 (1935):\n\nThe * * * [prosecuting] Attorney is the representative not of an ordinary party to a controversy, but of a sovereignty whose obligation to govern impartially is as compelling as its obligation to govern at all; and whose interest, therefore, in a criminal prosecution is not that it shall win a case, but that justice shall be done. As such, he is in a peculiar and very definite sense the servant of the law, the twofold aim of which is that guilt shall not escape or innocence suffer. He may prosecute with earnestness and vigor -- indeed, he should do so. But, while he may strike hard blows, he is not at liberty to strike foul ones. It is as much his duty to refrain from improper methods calculated to produce a wrongful conviction as it is to use every legitimate means to bring about a just one.\n\nIt is fair to say that the average jury, in a greater or less degree, has confidence that these obligations, which so plainly rest upon the prosecuting attorney, will be faithfully observed. Consequently, improper suggestions, insinuations, and, especially, assertions of personal knowledge are apt to carry much weight against the accused when they should properly carry none.\n\nWhen the conduct of prosecutors has been so prejudicial to an accused as to deny him a fair trial, this Court has reversed convictions and remanded for a new trial. See State v. Farrell, 61 N.J. 99 (1972); State v. Welsch, 29 N.J. 152 (1959); State v. West, 29 N.J. 327 (1959); State v. Landeros, 20 N.J. 69 (1955), cert. denied, 351 U.S. 966, 76 S. Ct. 1025, 100 L. Ed. 1486 (1956); State v. D'Ippolito, 19 N.J. 540 (1955).\n\nWe recently had occasion to address the issue of prosecutorial misconduct in the context of a capital case, State v. Ramseur, supra, 106 N.J. at 319-24. Our observations in Ramseur provide the backdrop against which we review the conduct of the prosecutor in this case:\n\nWe stress, however, that the fact that the prosecutor's misconduct in this case cannot be said to have prejudiced defendant in no way excuses it. Prosecutors in capital cases are hereby on notice that in the future, this Court will not hesitate to refer on its own motion possible violations of the special ethical rules governing prosecutors to the appropriate district ethics committee for disciplinary action. We are well aware that within the legal profession the prosecutor's double calling -- to represent vigorously the state's interest in law\n\nenforcement and at the same time help assure that the accused is treated fairly and that justice is done -- is uniquely challenging. That challenge is what makes the prosecutor's mission such a difficult one and such an honorable one. A prosecutor willing to engage in proscribed conduct to obtain a conviction in a capital case betrays his oath in both its respects. Not only does he scoff at rather than seek justice, he also represents the state poorly. Because death is a uniquely harsh sanction, this Court of necessity will more readily find prejudice resulting from prosecutorial misconduct in a capital case than in other criminal matters; prosecutors who fail to take seriously their particularly stringent ethical obligations in capital cases thus strongly risk postponing, and even jeopardizing, the enforcement of the law. We are confident that our prosecutors will be equal to this ethical challenge, but we also stand ready to take whatever action is required to remedy any abuses. [Id. at 323-24.]\n\nAlthough defendant cites multiple instances of prosecutorial misconduct as warranting reversal of the death sentence, we limit our discussion to the conduct that we consider most egregious and most likely to have been prejudicial to defendant's right to a fair trial.\n\n(a). Telling Jury It Was Not Responsible for Deciding Death of Defendant\n\nIn the course of his opening statement in the penalty phase, the prosecutor made the following statements to the jury:\n\nYour job here is not to sentence, your job here is not to execute. Your job here is not to kill anybody. Your job here is to follow the law and based on the facts that you find to exist in your intelligent reasonable weighing process is to return that verdict. The law then takes over and does what the law has provided for, the penalty.\n\nDon't let anybody tell you that you're going to kill anybody. Don't let anybody say that you're going to be responsible for a person's life because you're not. You took an oath of office to serve as a juror and well and truly try this case according to the evidence and the law and that's what you're going to do. It's not up to you to spare any lives or take any lives. It's up to you to find facts and render a verdict consistent with those facts and the law will take over, the law is in place.\n\nYou are not executing anybody, you're not taking anyone's life. You're not killing anybody, there's only one killer in this room, ladies and gentlemen, there's only one person who killed, who murdered in this room.\n\nThank you for your attention.\n\nDefense counsel did not object to the prosecutor's remarks and no curative instruction was given by the trial judge.\n\nAlso, during defense counsel's direct examination of Pamela Patinha, the following exchange took place in the presence of the jury:\n\nQ. You know that Teddy is to be punished for what he did.\n\nA. Yes.\n\nQ. You know that this jury is going to determine what the punishment is?\n\nMR. SCHNEIDER: I object, your Honor. That's not what the jury is going to determine. The jury is going to find facts.\n\nTHE COURT: Well, the result of the fact finding process will determine what the penalty will be.\n\nMR. SCHNEIDER: That's right.\n\nTHE COURT: The jury already knows that. I've instructed them.\n\nI'll permit the question.\n\nIn Caldwell v. Mississippi, 472 U.S. 320, 105 S. Ct. 2633, 86 L. Ed. 2d 231 (1985), the prosecutor in a death penalty trial argued during summation that the jury should not assume that it had to determine whether defendant lived or died, since \"the decision you render is automatically reviewable by the Supreme Court.\" 472 U.S. at 325-26, 105 S. Ct. at 2637-38, 86 L. Ed. 2d at 237. The jury sentenced defendant to death and the Supreme Court of Mississippi affirmed the conviction by an evenly divided court. The United States Supreme Court reversed, holding that it is \"constitutionally impermissible to rest a death sentence on a determination made by a sentencer who has been led to believe that the responsibility for determining the appropriateness of the defendant's death rests elsewhere.\" Id. at 328-29, 105 S. Ct. at 2639-40, 86 L. Ed. 2d at 239.\n\nWe dealt with this issue in Ramseur, where we observed that a supplemental jury instruction may have left the jury with the impression \"that it was not responsible for the decision sentencing defendant to death;\" rather, \"that [the jurors'] task was simply fact finding and weighing, i.e., finding the aggravating and mitigating factors and then weighing them.\" State v. Ramseur, supra, 106 N.J. at 315. Accordingly, we ruled that this supplemental instruction constituted reversible error because of its capacity to mislead the jury concerning its sentencing function:\n\nBut in \"merely\" determining whether aggravating and mitigating factors exist and striking a balance between them, the jury decides whether defendant shall live or die. In no other determination in the criminal law is the jury more truly to act as the conscience of the community. In no other determination in the criminal law is it more important to make absolutely certain the jury is aware, not simply of the consequences of its actions, but of its total responsibility for the judgment. As the United States Supreme Court has recently made clear, jury instructions in capital cases should never lead the sentencer to believe that responsibility for determining the appropriateness of defendant's death rests elsewhere. Caldwell v. Mississippi, 472 U.S. 320, 105 S. Ct. 2633, 86 L. Ed. 2d 231 (1985). This command flows from the premise that the death penalty can be constitutionally imposed only if the procedure assures reliability in the determination that \"'death is the appropriate punishment in a specific case.'\" Id. at 323, 105 S. Ct. at 2637, 86 L. Ed. 2d at 236 (quoting Woodson v. North Carolina, supra, 428 U.S. at 305, 96 S. Ct. at 2991, 49 L. Ed. 2d at 961).\n\nUnder New Jersey's prior death penalty statute, this Court held that any instruction that \"tend[s] to dilute the jury's sense of responsibility in passing on the issue of life or death\" is erroneous. State v. Mount, 30 N.J. 195, 214 (1959); accord State v. Hipplewith, 33 N.J. 300, 319-20 (1960). It is apparent that this rule should apply with equal force under the current capital sentencing scheme, and that the trial court's instructions here violated this rule and hence constituted prejudicial error. [ Id. at 316.]\n\nAccord People v. Drake, 748 P. 2d 1237, 1239 (Colo.1988); State v. Clark, 492 So. 2d 862, 870-71 (La.1986); Commonwealth v. Baker, 511 A.2d 777, 787-91 (Pa.1986)\n\nWe note that to some extent the prosecutor's remarks may have been offset by the trial court's charge to the jury in the sentencing phase, which referred on several occasions to the fact that the jury's deliberations could result in the death penalty:\n\nLadies and gentlemen, as you know at this time you must now decide what penalty is to be imposed on the defendant Teddy Rose for his conviction on the murder charge.\n\nNow, the State has the burden of convincing you beyond a reasonable doubt that an aggravating factor exists. If you are not so convinced, the defendant\n\nwill not receive the death penalty and will be sentenced to death -- I'm sorry, will be sentenced to life in prison with no parole eligibility for 30 years.\n\nNow, stated specifically, the defendant may be put to death only if you are convinced beyond a reasonable doubt that an aggravating factor or factors exist and further convinced beyond a reasonable doubt that the aggravating factor or factors outweigh any mitigating factor or factors which you find.\n\nIn sum, the burden is upon the State to establish beyond a reasonable doubt that an aggravating factor or factors are present and that the State has established beyond a reasonable doubt that the aggravating factor or factors outweigh any mitigating factor or factors in order for the death penalty to be imposed.\n\nSignificantly, the jurors' verdict sheet contained the most explicit reference to the jury's responsibility for deciding whether defendant should be executed. The last page of the verdict sheet, signed by each juror, contained the following legend:\n\nARE YOU CONVINCED BEYOND A REASONABLE DOUBT THAT THE AGGRAVATING FACTOR(S) OUTWEIGH THE MITIGATING FACTOR(S)?\n\nIf your answer is \"YES\", defendant shall be sentenced to death. All jurors must agree that death is the only appropriate verdict in order for death to be your verdict.\n\nAlthough the combined thrust of the trial court's charge and the verdict sheet probably were sufficient to supersede the prosecutor's highly improper suggestion to the jury that \"Your job here is not the sentence, your job here is not to execute * * *. Your job here is to follow the law * * *,\" we cannot be confident that the impact of the prosecutor's statement did not affect the deliberations of any member of the jury. The remarks were highly improper, constituting a patently incorrect statement of the law and an attempt to dilute the jury's sense of responsibility for its sentencing function. Just as it is improper for a prosecutor to misrepresent matters of law to the court, see ABA Standards for Criminal Justice  3-2.8 (2d ed. 1980) (hereinafter referred to as \"ABA Standards\"); cf. New Jersey Rules of Professional Conduct 3.3(a) (hereinafter referred to as \" RPC \") (\"A lawyer shall not knowingly (1) make a\n\nfalse statement of material fact or law to a tribunal.\"), so is it improper for the prosecutor knowingly to mislead the jury. Cf. ABA Standards, supra,  3-5.8, comment, (2d ed. 1980) (\"References to the likelihood that other authorities, such as the governor or the appellate courts, will correct an erroneous conviction are impermissible efforts to lead the jury to shirk responsibility for its decision\"). Id. at 3.90.\n\nNor does the fact that the prosecutor's statements to the jury antedated the Supreme Court's decision in Caldwell v. Mississippi, supra, and our decision in Ramseur diminish the impropriety of such comments. Under our prior death penalty statute we held that any instruction that \"tend[s] to dilute the jury's sense of responsibility in passing on the issue of life or death\" is erroneous. State v. Mount, 30 N.J. 195, 214 (1959); accord State v. Hipplewith, 33 N.J. 300, 319-20 (1960). Other state courts that considered the issue prior to Caldwell v. Mississippi, supra, reached the same conclusion. State v. Willie, 410 So. 2d 1019, 1035 (La.1982); State v. Gilbert, 258 S.E. 2d 890, 894 (S.C.1979); Hawes v. State, 273 S.C. 690, 240 S.E. 2d 833, 839 (1977); State v. Hines, 286 N.C. 377, 211 S.E. 2d 201, 206 (1975); Pait v. State, 112 So. 2d 380, 385-86 (Fla.1959). We are constrained to conclude that the prosecutor's remarks to the jury were knowingly misleading. The statement was not corrected by the trial court nor was the jury instructed to disregard the prosecutor's remarks. Despite the clarifying content of the trial court's charge and the verdict sheet, we cannot conclude that so inaccurate a characterization of the jury's sentencing role in capital cases, urged on the jury by the chief law-enforcement official of Essex County, did not prejudice defendant's right to a fair trial.\n\n(b). Prosecutor's Cross-Examination During Penalty Phase\n\nDefendant cites a multiplicity of instances during cross-examination of defense witnesses in the penalty phase that he contends constitute prosecutorial misconduct of sufficient magnitude\n\nto require reversal of the defendant's death sentence. Virtually every example of allegedly improper cross-examination is raised as plain error, since defense counsel asserted few objections to the prosecutor's interrogation of the defense witnesses. Indisputably, there are in this record frequent instances in which the prosecutor, while questioning a witness about a proper subject of cross-examination, took extreme liberties in paraphrasing facts not in evidence but reflected in reports reviewed by the experts. Thus, in questioning Dr. Lapidus about defendant's history of violence in his relationships with women, a subject addressed by the witness during her direct testimony, the prosecutor asked these questions without objection:\n\nQ. Doesn't it all start because he's beating them up, he's pulling their hairs and dragging them, trying to run them over with the car, punching them in the face, throwing ash trays at them?\n\nA. No that's --\n\nQ. Taking them to a motel and locking them in a room and beating them up and deserting them there. Don't you think that would have something to do with the fact that the relationship is going to be terminated?\n\nSimilarly, in challenging Dr. Lapidus's opinion that defendant's emotional problems emanated from his failed reunion with his mother a few months prior to the shooting, the prosecutor, again without objection, asked:\n\nQ. What do you think about the fact that he 3 years before that or at least 2 years before that Indiana catastrophe, that he punched a girl in the face because she didn't want to do it his way? Doesn't that sort of show that he had this attitude long before he went to Indiana? Did you know that? Did you know that fact that he had punched one of his girlfriends in the face? [Emphasis added.]\n\nAs previously noted, the prosecutor's phrase \"because she didn't want to do it his way\" appears to be a deliberate distortion of the corresponding entry in the records of the Irvington Mental Health Center, which quote defendant as asking \"Why doesn't she do things my way?\" See supra at 493 n. 9.\n\nThese are but illustrative of numerous examples cited by defendant in which the prosecutor, without objection, allegedly\n\nused exaggerated characterizations of facts not in the record in cross-examining witnesses. We find the tactic offensive, and one that amply warranted vigorous objection by defense counsel or, sua sponte, intervention by the trial court. However, matters such as these must ordinarily be resolved by the adversarial process, through timely objection and proper rulings by the trial court. We are aware that criminal trials create a \"charged atmosphere * * * [that] frequently makes it arduous for the prosecuting attorney to stay within the orbit of strict propriety.\" State v. Bucanis, 26 N.J. 45, 56, cert. denied, 357 U.S. 910, 78 S. Ct. 1157, 2 L. Ed. 2d 1160 (1958). We have painstakingly examined the record concerning the instances of alleged improprieties by the prosecutor in cross-examining defense witnesses. Except for the specific instance of misconduct to which we now refer, we are unable to conclude that the prosecutor's cross-examination of defense witnesses, even though at times improper, was so prejudicial as to deny defendant his right to a fair trial.\n\nCross-Examination of Dr. Lapidus Concerning Statement of Nicholas Silva\n\nAs previously noted, during the guilt phase of the case the prosecutor attempted to introduce into evidence, through the testimony of Paul Palermo, defendant's actions and statements in the course of the schoolyard incident. After defense counsel objected, the trial court requested an offer of proof. The prosecutor described the incident, which apparently concluded with defendant pointing his shotgun at three or four black youths in the schoolyard and stating \"I should blow their fucking heads off.\" The trial court excluded the evidence, ruling that its relevance was \"substantially outweighed by a prejudicial effect.\" Subsequently, during direct examination of Nicholas Silva in the guilt phase, when the prosecutor attempted and was permitted to elicit evidence concerning an earlier portion of the schoolyard incident, the prosecutor requested and received explicit confirmation from the trial court of its ruling\n\nto exclude evidence of the statement previously described by the prosecutor. See supra at 495 n. 10.\n\nNevertheless, during the cross-examination of Dr. Lapidus, at a point when the prosecutor was questioning the witness about defendant's propensity for violent behavior, the prosecutor ascertained from Dr. Lapidus that she had read Nicholas Silva's statement before formulating an opinion about defendant's mental and emotional condition. The prosecutor then asked Dr. Lapidus to read to the jury the second page of Nicholas Silva's statement to the Irvington police. Without objection by defense counsel, Dr. Lapidus read the statement aloud, exposing the jury to the very testimony the trial court had ruled inadmissible on two occasions during the guilt phase. See supra at 495-496. When she had finished reading the statement to the jury, the prosecutor asked Dr. Lapidus to confirm that she had considered Silva's statement in forming her opinion about defendant.\n\nBased on our review of the record, it appears that the prosecutor's sole purpose in requesting Dr. Lapidus to read the Silva statement to the jury was to expose the jury to evidence previously ruled to be inadmissible under Evidence Rule 4. This was highly improper and constitutes misconduct on the part of the prosecutor. The prosecutor's conduct violated Standard 3-5.6(b) of the ABA Standards, supra, which provides:\n\nIt is unprofessional conduct for a prosecutor knowingly and for the purpose of bringing inadmissible matter to the attention of the judge or jury to offer inadmissible evidence, ask legally objectionable questions, or make other impermissible comments or arguments in the presence of the judge or jury.\n\nNot only did the jury hear and consider the evidence of defendant's statement, the prosecutor referred to defendant's statement on two occasions during his closing argument to the jury. We cannot conclude that the prosecutor's misconduct in this instance, weighed cumulatively with the other instances of improper conduct that occurred during the penalty phase, did not prejudice defendant's right to a fair trial.\n\n(c). Prosecutor's Summation\n\nA prosecutor in a criminal case is expected to make a vigorous and forceful closing argument to the jury. As Justice Clifford observed in his dissent in State v. DiPaglia, 64 N.J. 288, 305 (1974):\n\nCriminal trials are emotionally charged proceedings. A prosecutor is not expected to conduct himself in a manner appropriate to a lecture hall. He is entitled to be forceful and graphic in his summation to the jury, so long as he confines himself to fair comments on the evidence presented.\n\nNevertheless, at several points during his summation in the penalty phase of this case, the prosecutor crossed the line that separates forceful from impermissible closing argument.\n\n1.\n\nDuring defense counsel's closing argument to the jury, he referred to the expert testimony presented by the defense during the penalty phase, emphasizing that it had not been rebutted by the State. In response, the prosecutor during his summation stated:\n\nHis motives expressed to you some type of a mind, some type of a depravity of mind. He knew at the time he was interviewed by these doctors what his defense was, what the law was, what he faced. The doctors knew that. They were explained the law by the lawyers, as to what he's being charged with, what he faced and how he could beat the penalty that the law provides for him and they came in here and they as counsel said uncontradicted gave an opinion. Well, the Judge will charge you their opinion is only as good as the facts upon which they base their opinion and some of the facts were wrong and some of the facts were nonexistent.\n\nThe basis for their opinion is extremely weak; weak foundation, the whole cards fall.\n\nShall I parade experts in here to contradict them? I would consider that an insult to your intelligence. I believe that you can cope with the weight to be given to these expert witnesses. Why should we have to get into a battle of the experts, a battle of the psychiatrists? They might have been able to bring in ten more to say the same thing, find them somewhere. I could bring ten in to say the opposite where we come back to you people, we come right back to you people. [Emphasis added.]\n\nThe prosecutor's comments were clearly improper in two respects. First, in suggesting that the experts were told by the lawyers \"how he could beat the penalty that the law\n\nprovides for him and they came in here and * * * gave an opinion,\" the prosecutor implied that the expert's testimony was fabricated or contrived, with the assistance of defense counsel. There was no support in the record for the prosecutor's innuendo. The experts were both well qualified, and they carefully explained the basis for their opinions. The jury accepted their testimony at least in part, finding that one of the two mitigating factors their testimony supported had been proved. Without an adequate foundation in the record, the prosecutor's implication that the expert testimony was contrived was totally unwarranted. See State v. DiPaglia, supra, 64 N.J. at 299-300 (Clifford, J., dissenting).\n\nMoreover, the prosecutor's statement that he could have produced \"ten\" experts to testify differently from the defense experts was also improper. It suggested to the jury that it could assume that there were other qualified experts, known to the prosecutor but not produced as witnesses, that would contradict the opinion of the defendant's experts. See ABA Standards, supra,  3-5.8(a). (\"It is unprofessional conduct for the prosecutor intentionally * * * to mislead the jury as to the inferences it may draw.\"), and  3-5.8(b) (\"It is unprofessional conduct for the prosecutor to express his personal belief or opinion as to the truth or falsity of any testimony of the defendant.\")\n\n2.\n\nOn several occasions during his summation the prosecutor encouraged the jury to sentence defendant to death by focusing the jury's attention on matters outside the scope of the record. For example, at one point the prosecutor emphasized the importance of preventing defendant from committing future acts of violence:\n\nCounsel says any one of you can spare Teddy's life; true, any one of you wants to bail out of this case, wants to let your sympathy for this type of a person overwhelm the facts and the evidence to the contrary and overwhelm the law can spare Teddy's life.\n\nWhat will you have done by doing that? You have Teddy around to do who knows what in the future. When his next rage will be, whether it's on the street many years from now or whether it's in prison as he's going against a doctor or psychiatrist, against a social worker in prison, against a visitor, against another inmate, that's a chance you'll have to take. [Emphasis added.]\n\nAt other points in his summation, the prosecutor exhorted the jury to impose the death penalty in order to \"send a message\" to the community:\n\nThat's what I'm calling upon you now to do. When you put your hand on the Bible and you took that oath to follow the laws and give fair treatment to the evidence and State as well as the defense, honest, reasonable, proper decision, fact finding and weighing process and you did that. You became part of the greatest criminal justice system in the world. That's what you're part of now.\n\nThat's why what you do here today is going to send a message. Everybody that lives in this County, everybody that lives in this State and you're going to send a message and you're going to say that the law is in place; we live by these laws; fortunately, some people die by these laws. [Emphasis added.]\n\nThe prosecutor repeated this argument toward the end of his summation:\n\nIt's been a terrible, terrible tragic thing that happened to Anthony Garaffa. It can happen again.\n\nYou must send a message out to everybody outside in this community, in this county, if you're going to do what he did, remember, think about it, when you have 34 or 44 seconds you're thinking about it. Let them know out there what happens if you're going to do it. Let them know that the penalty has to be paid for the ultimate crime.\n\nMaybe they'll think twice. Maybe they'll think twice before they even go buy the damn gun and practice with it and threaten others with it. [Emphasis added.]\n\nIn State v. Ramseur, supra, 106 N.J. 123, we condemned as improper statements by a prosecutor suggesting that the jury should impose the death penalty \"in order to protect society from crime,\" id. at 321. There, the prosecutor argued:\n\nThe laws are made for our protection and in this case, ladies and gentlemen, we must realize that it is our responsibility to protect everybody here who has no interest in this case and to protect everybody out there in the culture of Essex County from the cruel, horrible, inhumane acts of murder. [Ibid.]\n\nWe concluded that such statements improperly \"divert the juror's attention from the facts of the case before them.\" Id. at 322; accord Darden v. Wainwright, 477 U.S. 168, 178-79, 106 S. Ct. 2464, 2471, 91 L. Ed. 2d 144, 156-57 (1986) (comments\n\nimplying \"that the death penalty would be the only guarantee against a future similar act\" were undoubtedly improper). Such arguments are also disapproved by the ABA Standards, supra,  3-5.8(d):\n\nThe prosecutor should refrain from argument which would divert the jury from its duty to decide the case on the evidence, by injecting issues broader than the guilt or innocence of the accused under the controlling law, or by making predictions of the consequences of the jury's verdict.\n\nCf. United States v. Young, 470 U.S. 1, 30, 105 S. Ct. 1038, 1053, 84 L. Ed. 2d 1, 22 (1985) (Brennan, J., concurring in part and dissenting in part) (\"Similarly, the prosecutor's admonition that the jurors would not be 'doing your job as jurors' if they voted to acquit was neither invited nor excusable, as the Court concedes. Many courts historically have viewed such warnings about not 'doing your job' as among the most egregious forms of prosecutorial misconduct.\" (Citations omitted)).\n\nBy urging the jury to sentence defendant to death in order to deter him from future acts of violence and to \"send a message\" to society that conduct such as defendant's will result in the death penalty, the prosecutor's arguments focused the jury's attention on matters extraneous to the aggravating and mitigating factors established by the Legislature to channel the jury's deliberations in the penalty phase of a capital case. Neither the likelihood that defendant would commit future crimes nor the benefit to society from sentencing to death persons convicted of capital murders is among the aggravating factors set forth in the Act. The emotional force of the prosecutor's arguments posed a significant risk that the jury would be diverted from its duty to determine defendant's punishment based on the evidence and in accordance with the trial court's charge. We conclude that these statements were improper and prejudiced defendant's penalty-phase proceeding.\n\n3.\n\nWe have already addressed the method by which the prosecutor put before the jury defendant's comment made during the\n\nschoolyard incident, while pointing the shotgun at a group of black youths: \"I should blow their fucking heads off.\" Supra at 494-496, 516-517. The prosecutor referred to this statement twice during his summation.\n\nIn addition, the prosecutor represented to the jury that defendant's jail records revealed that defendant \"extorted food from other inmates since he's been in there.\" That representation, completely unsupported by any evidence at trial, occurred during this portion of the prosecutor's closing argument:\n\nRemember when I was questioning Doctor Fox when he was unaware of the history of violence in school where Teddy Rose had attacked a teacher and attacked students? He wasn't aware of that and as I pointed that out, he wasn't shown that. Why wasn't he shown that? Why wasn't he shown the army records? Why wasn't he shown the jail records where he fought with jail guards, extorted food from other inmates since he's been in there?\n\nIn fact, the only reference during the trial to defendant's alleged extortion of food from inmates occurred when Dr. Fox, having been asked by the prosecutor if defendant had told him about extorting meals from inmates, denied any such knowledge. Defense counsel objected to the prosecutor's reference during summation. The trial court, erroneously, overruled the objection. The prosecutor's statement was plainly improper, since it was not based on any evidence adduced at trial. See ABA Standards, supra,  3-5.8(a): (\"The prosecutor may argue all reasonable inferences from evidence in the record. It is unprofessional conduct for the prosecutor intentionally to misstate the evidence or mislead the jury as to the inferences it may draw.\"); RPC 3.4 (\"A lawyer shall not * * * (e) in trial, allude to any matter that * * * will not be supported by admissible evidence.\").\n\n4.\n\nFinally, on two occasions in the course of summation the prosecutor's argument constituted an inaccurate assertion to the jury that \"the law\" mandated the death penalty for defendant. He stated:\n\nYou will then be called upon as you know to determine whether or not any mitigating factors exist. The last word will be yours. Whatever I say to you here today is a way of conveying to you the expression of the State, comments on the evidence, the logic and reason of a certain decision but you have the last word. You have the last say; that is, you people are going to say whether or not our laws mean anything, whether or not the people that are out there in the streets whether there will be anymore Teddy Roses out there, that they know that if you commit the ultimate crime unjustified, inexcusable, cold blooded murder, you're going to pay the ultimate price because that's what the law says, not because I want it or because you want it, because that's what the law states and we took an oath, we swore on the Bible. [Emphasis added.]\n\nSimilarly, at the very conclusion of his closing argument, the prosecutor exhorted the jury to impose the death penalty because it was required by \"law\":\n\nYou know in your minds and in your hearts that what you're going to do is the right thing. It's something you really have no choice. It's not anything that's going to be difficult to live with. It's going to be voting against your conscience, voting against the evidence, voting against the law, that's what you have to do if you give him the break you wouldn't give anybody else.\n\nThe law cries out for a verdict here, ladies and gentlemen. I don't cry for it. We the citizens that follow the law, cry out for it. We demand it. The law is in place; have the guts and the heart and the mind to follow it so that we can keep our foundation of justice in this country and this State otherwise we're in a whole lot of trouble, deep trouble unless you can show us you have the guts to do what has to be done. [Emphasis added.]\n\nSuch statements were inaccurate and misleading to the jury. As the prosecutor was undoubtedly well aware, the capital punishment statute does not mandate the death penalty for capital murder, leaving the determination of the appropriate penalty to the jury based on its weighing of aggravating and mitigating factors. The prosecutor's suggestion that the death penalty was required by law was highly inappropriate.\n\nOur review of the record persuades us that unlike the prosecutorial misconduct in Ramseur, the cumulative effect of the prosecutorial improprieties committed during the opening and closing arguments in the penalty phase of trial and in the cross-examination of Dr. Lapidus were substantially prejudicial and deprived defendant of his constitutional right to a fair trial. In the highly emotional setting of the penalty phase of a capital murder case, we cannot conclude that multiple violations of\n\nprevailing standards of prosecutorial conduct had no impact on this jury's deliberations. We repeat again our admonition in Ramseur that prosecutors determined to enforce the law may, in their zeal, unwittingly be the instrument of its obstruction:\n\nBecause death is a uniquely harsh sanction, this Court of necessity will more readily find prejudice resulting from prosecutorial misconduct in a capital case than in other criminal matters; prosecutors who fail to take seriously their particularly stringent ethical obligations in capital cases thus strongly risk postponing and even jeopardizing, the enforcement of the law. [106 N.J. at 324.]\n\nAccordingly, we conclude that the prosecutor's misconduct during the penalty phase requires the reversal of defendant's death sentence.\n\n3. Double Counting of Aggravating Factors\n\nDefendant contends that the submission to the jury of two statutory aggravating factors based on the same underlying evidence constituted a violation of his constitutional right to a fair trial. The two factors, both found by the jury to have been proved beyond a reasonable doubt, were those set forth in N.J.S.A. 2C:11-3c(4)(f) (\"The murder was committed for the purpose of escaping detection, apprehension, trial, punishment or confinement for another offense committed by the defendant or another;\") and N.J.S.A. 2C:11-3c(4)(h) (\"The defendant murdered a public servant, as defined in 2C:27-1, while the victim was engaged in the performance of his official duties, or because of the victim's status as a public servant.\").\n\nBefore trial, defense counsel moved to dismiss aggravating factor c4(h) (murder of a public servant), contending that it was based on the same evidence that supported aggravating factor c4(f) (murder to escape apprehension). The trial court ruled that the factors were not necessarily cumulative, reserving final decision on the question for the penalty phase. The motion was renewed prior to the commencement of the penalty phase and denied. The trial court concluded that the two aggravating factors were distinct and that the legislative intent\n\nwas to permit submission of both factors to the jury if supported by the evidence.\n\nThe State and the Attorney General, as amicus, contend that the two factors do not overlap, observing that factor c4(f) relates to the defendant's motive and factor c4(h) relates to the status of the victim. They rely on a series of cases from other states upholding the combined submission of analogous aggravating factors in capital cases. Collier v. State, 244 Ga. 553, 261 S.E. 2d 364 (Ga.1979), cert. denied, 445 U.S. 946, 100 S. Ct. 1346, 63 L. Ed. 2d 781 (1986); State v. Jenkins, 15 Ohio St. 3d 164, 473 N.E. 2d 264 (Ohio 1984), cert. denied sub nom. Scott v. Ohio, 472 U.S. 1032, 105 S. Ct. 3514, 87 L. Ed. 2d 643 (1987); Calhoun v. State, 297 Md. 563, 468 A.2d 45 (Md.1983), cert. denied sub nom. Tichnell v. Maryland, 466 U.S. 993, 104 S. Ct. 2374, 80 L. Ed. 2d 846 (1984); State v. Hutchins, 303 N.C. 321, 279 S.E. 2d 788 (N.C.1981), cert. denied sub nom. Hutchins v. Garrison, 464 U.S. 1065, 104 S. Ct. 750, 79 L. Ed. 2d 207 (1984).\n\nDefendant contends that jury consideration of two aggravating factors based on identical evidence enhances the likelihood of arbitrary imposition of the death sentence, thereby subverting the function of aggravating factors to \"guide[ ] and focus[ ] the jury's objective consideration of the particularized circumstances of the individual offense and the individual offender before it can impose a sentence of death,\" quoting Jurek v. Texas, 428 U.S. 262, 273-74, 96 S. Ct. 2950, 2957-58, 49 L. Ed. 2d 929, 939-40 (1976). Defendant relies on People v. Harris, 36 Cal. 3d 36, 201 Cal.Rptr. 782, 679 P. 2d 433, cert. denied, 469 U.S. 965, 105 S. Ct. 365, 83 L. Ed. 2d 301 (1984), for the principle that multiple aggravating factors based on the same conduct cannot be used at the sentencing phase to determine punishment:\n\n[t]he constitutionally mandated objective of focusing on the particularized circumstances of the crime and the defendant is undercut when the defendant's conduct is artificially inflated by the multiple charging of overlapping special circumstances or multiple special circumstances based on an indivisible course of conduct having one principal criminal purpose. [36 Cal. 3d at 62, 679 P. 2d at 449, 201 Cal.Rptr. at 798.]\n\nWe recently addressed this issue in State v. Bey II, 112 N.J. 123, 174 (1988). There, defendant was convicted of robbery, aggravated sexual assault, and felony murder. Defendant argued that evidence of the sexual assault was used to support both aggravating factor c(4)(g) (\"The offense was committed while the defendant was engaged in the commission of * * * sexual assault * * *.\"), and factor c(4)(c) (\"The murder * * * involved torture, depravity of mind, or an aggravated battery to the victim.\"). In Bey II we reversed the death sentence on other grounds, and did not definitively resolve the issue concerning double counting of the evidence of sexual assault. However, we noted that our capital punishment act sought to comply with the constitutional mandate that the jury's discretion \"be suitably directed and limited so as to minimize the risk of wholly arbitrary and capricious action,\" id. at 175 (quoting Gregg v. Georgia, 428 U.S. 153, 189, 96 S. Ct. 2909, 2932, 49 L. Ed. 2d 859, 883 (1976)), and that such direction must be provided by objective sentencing standards that compel the jury \"to focus on the particularized circumstances of the crime and the defendant.\" Id. at 175 (quoting Gregg v. Georgia, supra, 428 U.S. 153, 199, 96 S. Ct. 2909, 2937, 49 L. Ed. 2d 859, 889). Thus, we stated in Bey II that\n\nthe appropriate resolution is to allow the prosecution to use the same evidence in seeking to prove multiple aggravating factors, provided the trial court advises the jury that it should not simply compare the number of aggravating factors against the number of mitigating factors, that it is considering the same facts more than once, and that it should be cognizant of the double counting when it balances the aggravating against the mitigating factors. This result permits the jury to consider the evidence relevant to each aggravating factors and should prevent it from giving undue weight to the number of factors when one aspect of the defendant's conduct supports multiple aggravating factors. [State v. Bey II, supra, 112 N.J. at 176-177 (emphasis added).]\n\nThere was no such instruction given to the jury in this case. Hence, in weighing the aggravating factors against the mitigating factors, the jury may have incorrectly perceived its duty to be to double-count the evidence of the homicide, weighing\n\nthe evidence once in concluding that defendant murdered Officer Garaffa to escape apprehension for his unlawful possession of the shotgun, and a second time in concluding that defendant murdered a public servant while the victim was performing his official duties. As noted in Bey II, it is not improper for the prosecution to prove more than one aggravating factor based on the same evidence, provided the jury is carefully instructed that in weighing the aggravating factors against mitigating factors, it does not assign inordinate weight to the facts that support multiple factors. The absence of such a clarifying instruction in this case compels us to conclude that the jury instructions concerning the weighing of aggravating factors were inadequate, thereby impermissibly prejudicing defendant's right to a fair trial and mandating reversal of the death sentence.\n\n4. Was it Error for the Trial Court to Submit Aggravating Factor c(4)(c) to the Jury?\n\nOver defendant's objection asserted before trial and prior to the commencement of the penalty phase,\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e the trial court submitted\n\nfor the jury's consideration during its sentencing deliberations the aggravating factor set forth in N.J.S.A. 2C:11-3c(4)(c), which reads:\n\nThe murder was outrageously or wantonly vile, horrible or inhuman in that it involved torture, depravity of mind or an aggravated battery to the victim.\n\nThe trial court instructed the jury prior to its sentencing deliberations concerning the elements of this aggravating factor:\n\nFor the purposes of this case you may consider whether the following aggravating factors exist:\n\nFirst, the murder was outrageously or wantonly vile, horrible or inhuman in that it involved torture, depravity of mind or an aggravated battery to the victim.\n\nAlthough, of course, every murder may be viewed as vile, horrible or inhuman, this aggravating factor does not exist with respect to every purposeful or knowing killing.\n\nIn order for you to find this aggravating factor present you must be convinced beyond a reasonable doubt that the defendant inflicted upon the victim brutal and agonizing mental and bodily harm before death. The term depravity of mind means that mental state which leads a murderer to torture or commit an aggravated battery upon the victim before committing the crime of murder.\n\nNow, aggravated battery means serious bodily harm to the victim. Such bodily harm must occur before death. A person commits aggravated battery when he purposely causes bodily harm to another by depriving him of a member of his body or by rendering a member of his body useless or by seriously disfiguring his body or a part thereof.\n\nNow, purposefully has the same meaning as the definition previously charged to you at the guilt phase of the trial; I'm not going to repeat it for you.\n\nI used serious bodily injury; that term can be defined as bodily injury which creates substantial risk of death or which causes serious permanent disfigurement or protracted loss of any bodily member or organ. The injuries need not be permanent, but they must nevertheless, be substantial rather than superficial.\n\nNow, the aggravated battery must occur before death. By that I mean the aggravated battery must not be the cause of the death of the victim; it must occur prior to the death and be independent of the cause of death.\n\nTorture occurs when a victim is subjected to serious or mental abuse before death. Insofar as aggravated battery and torture are concerned, only acts and\n\nconducts occurring prior to death may be considered in determining whether this aggravating factor is present.\n\nAlthough the jury determined that the State did not sustain its burden of proving the existence of aggravating factor (4)(c), defendant contends that its submission to the jury was reversible error in the penalty phase. Defendant further argues, relying on State v. Christener, 71 N.J. 55 (1976), that the jury's discharge of its duty to consider factor c(4)(c) may have resulted in a \"compromise\" verdict reflected by the jury's determination that the State had sustained its burden of proving two other aggravating factors, c(4)(f) and c(4)(h). The State contends that the trial court properly submitted factor c(4)(c) to the jury, but even if that determination was erroneous, it constituted harmless error since the jury found that the existence of the factor had not been proved.\n\nIn State v. Ramseur, supra, 106 N.J. 123, we acknowledged the difficulties inherent in applying this provision of our Capital Punishment Act:\n\nSection c(4)(c) of the Act is its most troublesome portion and one of its most important. The provision is troublesome because of its obvious vagueness. Merely quoting it is the best proof of that fact. The provision is important because this vagueness probably accurately expresses society's wish to limit the death penalty to only certain murderers and yet reflects society's inability to define precisely that limit. [Id. at 198 (footnote omitted).]\n\nWe also explained that the indefiniteness of the introductory language in c(4)(c) compelled us to focus on the Legislature's qualifying language in construing the statute:\n\nQuite clearly the introductory language of the provision (\"[t]he murder was outrageously or wantonly vile, horrible or inhuman\") is indefinite beyond anyone's ability to remedy, and presumably was so recognized by the Legislature, which attached to that part of the section the explicitly limiting portion \"in that it involved torture, depravity of mind, or an aggravated battery to the victim * * *.\" (Emphasis added). Interpretations by various courts throughout the nation give effect to this limitation, ultimately by construing the entire provision in a manner that results in the second portion being the essential finding. In effect, although these courts do require two independent findings (that the offense (1) is \"outrageously or wantonly vile, horrible or inhuman,\" and (2) involves torture, depravity or aggravated battery), in applying the construction, the first part of the provision is rendered nugatory. Theresultant construction is that the aggravating factor exists when the murder \"involved\n\ntorture, depravity of mind, or an aggravated battery to the victim.\" [106 N.J. at 199 (citations omitted).]\n\nIn Ramseur we adopted a narrowing construction of c(4)(c) in order to satisfy constitutional standards, concluding that the defendant's state of mind was the true focus on the Legislature's intent:\n\nWe are convinced that the essence of the legislative concern is the defendant's state of mind. We do not believe that the Legislature intended to distinguish between two murderers each of whom intended to inflict immediate death upon the victim without any additional suffering whatsoever, when one victim dies immediately and the other lives for a long period of time and experiences excruciating pain. That capricious event alone would be perceived as an insufficient basis on which to inflict death on that defendant while imposing imprisonment on the other. Our system of criminal laws is predicated usually on the imposition of punishment based on the defendant's intent. Indeed, our Code's ranking of crimes by degree places those crimes committed with intentional conduct as the highest degree of crime, for which the defendant is most severely punished. Society's concern, the community's concern, the Legislature's concern, is to punish most harshly those who intend to inflict pain, harm, and suffering -- in addition to intending death. [106 N.J. at 207-08.]\n\nFinally, we paraphrased in Ramseur the essence of an appropriate charge to the jury on factor c(4)(c):\n\nTherefore, depending on the facts, the jury should be charged -- without quoting the statute -- that this aggravating factor exists if the murder involved torture, depravity of mind, or an aggravated battery to the victim. Torture or aggravated battery to the victim shall be found if the defendant intended to cause, and did in fact cause, severe physical or psychological pain or suffering to the victim prior to the victim's death, \"severity\" measured either by the intensity of the pain, or the duration of the pain, or a combination of both. Where the murder was not the product of greed, envy, revenge, or another of those emotions ordinarily associated with murder, and served no purpose of the defendant beyond his pleasure of killing, the court shallinstruct the jury on the meaning of depravity in this specific context. For the defendant who killed for the enjoyment of it, because the victim just happened to be in the area, or for no reason at all, just to kill, society must be able to reserve its most extreme sanction. [106 N.J. at 211.]\n\nIt is evident that the trial court's charge to the jury on c(4)(c), delivered prior to our decision in Ramseur, was erroneous. The charge did not instruct the jury that it must determine that defendant intended to cause severe physical pain or suffering to the victim prior to death. Nor did the trial court properly inform the jury that a finding of depravity requires proof that\n\nthe murder \"served no purpose for the defendant beyond his pleasure of killing.\" Id. at 211.\n\nWe also conclude that the evidence adduced at trial did not support the submission of factor c(4)(c) to the jury, even assuming that its submission was accompanied by a proper instruction. Aside from evidence that defendant had fired the shotgun and was knowledgeable about its capacity to inflict devastating injury, there was no proof that defendant's intention was to cause Officer Garaffa to endure pain and suffering, rather than to kill him. Although the State argues that a shotgun fired at the abdomen, rather than at a more vital organ, is likely to result in pain and suffering prior to death, this fact alone cannot be sufficient to prove defendant's intention to inflict severe pain and suffering prior to death. As we noted in Ramseur:\n\nWe do not believe that the Legislature intended to distinguish between two murderers each of whom intended to inflict immediate death upon the victim without any additional suffering whatsoever, when one victim dies immediately and the other lives for a long period of time and experiences excruciating pain. [Id. at 207.]\n\nNor did the proofs support the submission of c(4)(c) to the jury on the basis that the murder involved depravity of mind. There was evidence produced at trial that the defendant had a propensity to use the shotgun to threaten black youths in the neighborhood. But the only evidence concerning defendant's motive for shooting Officer Garaffa was defendant's own statement indicating that he panicked and did not want to be caught with the shotgun. The State apparently accepted defendant's explanation of his reason for the murder, by submitting to the jury proof of aggravating factor c(4)(f), \"The murder was committed for the purpose of escaping * * * apprehension * * * for another offense committed by the defendant * * *,\" a factor found to exist by the jury in its sentencing deliberations. As we held in Ramseur, depravity of mind characterizes \"those who murder without purpose or meaning as distinguished from those who murder for a purpose (although a completely unjustified\n\npurpose).\" Id. at 209. The evidence at trial, however, indicates that defendant shot Officer Garaffa to escape detection for his unlawful possession of a sawed-off shotgun, and the State acknowledged defendant's purpose by its submission of aggravating factor c(4)(f) to the jury. Under the circumstances, that aspect of factor c(4)(c) focusing on \"depravity of mind\" should not have been submitted to the jury.\n\nDefendant relies on State v. Christener, supra, 71 N.J. at 55, for the contention that the improper submission to the jury of aggravating factor c(4)(c) constitutes an independent ground for reversing the death sentence in this case. In Christener, the victim was the estranged husband of the woman with whom defendant resided in a mobile home. There was substantial evidence of the victim's physical strength and violent temper. The murder occurred after the victim broke into the mobile home early one morning, and ignored defendant's demands that he leave. He was shot while lunging toward his estranged wife. The jury, charged on first- and second-degree murder, manslaughter, self-defense, and defense of others, found defendant guilty of manslaughter. We reversed the conviction, concluding that it was plain error for the trial court to have charged the jury on first degree murder, id. at 69, and that such error was prejudicial since the jury's manslaughter verdict might have been a compromise verdict induced by the erroneous charge. Id. at 69-70. Relying on our holding in Christener, defendant argues that the erroneous submission to the jury of aggravating factor c(4)(c) may have resulted in a \"compromise\" by the jury in finding the existence of the two other aggravating factors relied on by the State.\n\nSince there exist independent grounds for reversing defendant's death sentence, we need not now definitively resolve the question whether the improper submission of an aggravating factor to the jury in the penalty phase of a capital case necessarily constitutes reversible error. We noted in State v. Thomas, 76 N.J. 344, 365 (1978), that our decision in Christener focused on the prejudicial effect of \"overcharging\" a jury, i.e.,\n\ninstructing it on a crime more serious than the evidence warrants, where the result may induce a compromise verdict. Unlike the mutually exclusive choices between first-degree murder and manslaughter available to the jury in Christener, the jury's function in the penalty phase of a capital case is first to assess, independently of each other, the sufficiency of proof of the aggravating and mitigating factors. Its rejection of one such factor neither compels nor inhibits its determination that another factor exists. We also note on this record that there was overwhelming proof of the existence of aggravating factors c(4)(f) and c(4)(h). Hence, it would be highly speculative to conclude that the erroneous submission to the jury of aggravating factor c(4)(c), a factor rejected by the jury, prejudicially affected this jury's deliberations concerning the remaining aggravating factors, the mitigating factors, and its weighing process.\n\n5. Was it Error for the Trial Court to Have Admitted Into Evidence the Police Tape Recording, Articles of the Victim's Clothing, and an Autopsy Photograph?\n\nDefendant contends that the trial court's admission of certain physical evidence during the guilt phase of trial, and in the penalty phase on the prosecutor's motion, violated the New Jersey Rules of Evidence and defendant's right to a fair trial. The challenged evidence consists of a police tape recording of transmissions to and from the Irvington police dispatcher before and after the shooting of Officer Garaffa, an autopsy photograph of Officer Garaffa's body that reveals the site of the entry wound and the location of the incisions made in the course of the emergency surgery at University Hospital, and the tattered and blood-stained shirt and undershirt worn by Officer Garaffa when he was shot.\n\nThe police tape recording was played for the jury, without objection, during the guilt phase of trial while Officer Kenneth Verzal testified. Officer Verzal was the Irvington police dispatcher on the night of the shooting and identified voices heard\n\non the tape over a span of about ten minutes. He testified that at approximately 11:48 p.m. on August Eighth, Officer Garaffa called in to police headquarters, stating: \"[Car] 2's off on 40th Street, guy with a bag.\" Officer Verzal understood the transmission to mean that Officer Garaffa was leaving his vehicle to question someone. The officer testified that approximately thirty-four seconds later he heard \"cries\" over the police radio and subsequently called for emergency assistance when he learned that Officer Garaffa had been shot. The tape records Officer Garaffa crying-out, the transmissions seeking emergency aid, and the sound of ambulances. After Officer Venzal testified, the tape recording was admitted into evidence without objection, and also admitted, with the other guilt-phase evidence, in the penalty phase. The prosecutor played the tape again for the jury during his summation.\n\nDefendant contends that the tape recording was not probative of any fact in issue. Moreover, he argues that the officer's screams and garbled utterances, combined with the transmissions seeking emergency aid, were highly inflammatory and served to \"create substantial danger of undue prejudice or confusing the issues or of misleading the jury.\" Evid.R. 4. The State argues that the tape recording was relevant to demonstrate that approximately thirty-four seconds elapsed between the time Officer Garaffa alighted from his vehicle and the shooting, thus contradicting defendant's contention that the shooting was impulsive and resulted from panic.\n\nBased on our review of the tape recording, and its admission without objection at the guilt phase, we find no abuse of discretion by the trial court in not excluding the evidence in the guilt phase sua sponte under Evidence Rule 4. Moreover, although the recording was not material to any of the penalty-phase issues, its admission in the penalty phase occurred as a matter of course, also without objection, and simultaneously with the other guilt-phase evidence. We are satisfied that any error that occurred in admitting the tape recording in the\n\npenalty phase was harmless beyond a reasonable doubt. R. 2:10-2.\n\nThe trial court's admission of the autopsy photograph occurred in the context of the State's offer of five photographs of the victim's body. Three of the photographs, which apparently depicted various aspects of the wounds sustained by the victim, were excluded by the trial court on the ground that they were inflammatory and could prejudice the jury. Another autopsy photograph was admitted without objection by defense counsel, since it depicted the site of the entry wound. Defense counsel objected to the admission of photograph S-36, contending that the site of the entry wound had already been established by admission of the prior autopsy photograph. The trial court disagreed, and admitted S-36 because it showed the entry wound in relation to the victim's upper torso.\n\nBefore us, defendant argues that the photograph was gruesome and inflammatory and therefore should have been excluded under Evidence Rule 4. The State asserts that the photograph was relevant to prove the location of the entry wound and, in connection with aggravating factor c(4)(c), to prove the extent of the victim's injury.\n\nSimilarly, defendant argues that the trial court's admission over defense counsel's objection of Officer Garaffa's blood-stained undershirt and shirt constituted prejudicial error, asserting that articles of the victim's clothing were offered solely for \"shock value\" and were highly inflammatory. The State contends that the clothing was admissible to show that the shotgun was \"near contact\" with the victim's body when fired, citing testimony from Irvington Police Officer Salvato, who had performed various tests to determine the distance between the shotgun and the victim at the instant of firing. The trial court admitted the clothing into evidence \"to show what the injury was and the extent of the injury caused to him.\"\n\nThe general rule is that \"the admissibility of photographs of the victim of a crime rests in the discretion of the trial court, and the exercise of its discretion will not be reversed\n\nin the absence of palpable abuse.\" State v. Thompson, supra, 59 N.J. at 420; see also Evid.R. 4 (\"the judge may in his discretion exclude evidence if he finds that its probative value is substantially outweighed by the risk that its admission will * * * (b) create a substantial danger of undue prejudice or of confusing the issues or misleading the jury\"). On balance, we conclude that the trial court should have excluded the second autopsy autograph, in view of its capacity to create undue prejudice, and since the site of the entry wound had already been established through another photograph. However, the error was plainly harmless in the guilt phase in view of the overwhelming evidence of defendant's guilt. We have already determined that it was error for the trial court to submit aggravating factor c(4)(c) to the jury in the penalty phase; hence, the second autopsy photograph was not admissible to prove any of the elements of factor c(4)(c).\n\nWe reach the same conclusion with respect to the admission of the victim's articles of clothing. The State's evidence concerning the distance between the shotgun and the victim's body did not require admission of Officer Garaffa's blood-stained shirt and undershirt into evidence, and this evidence had a clear capacity to inflame and prejudice the jury. Thus, it should have been excluded under Evidence Rule 4. However, in view of the compelling evidence of guilt, we are fully satisfied that the error was not clearly capable of producing an unjust result. R. 2:10-2.\n\n6. Was it Error for the Trial Court to Permit Rebuttal of Mitigating Factor c(5)(f) by Conduct not the Subject of a Prior Criminal Conviction?\n\nPrior to the commencement of the penalty phase, defense counsel sought a ruling from the trial court that would have restricted the State, in rebutting evidence of mitigating factor c(5)(f) (\"The defendant has no significant history of prior criminal activity\"), to proof of the defendant's prior criminal convictions. The trial court denied the motion:\n\nObviously I'm not going to rule at this point whether I'm going to permit that evidence of rebuttal by the Prosecutor because I'm not going into a vacuum and I'm not going to anticipate what may come before me.\n\nIt also seems to me the Legislature has provided wording in the mitigating factor, namely, that the defendant has no significant history of prior criminal activity. They don't say prior criminal convictions, they say activity. Activity is different from conviction. If the defense is allowed simply to state evidence that he has no particularly significant history of prior criminal activity and the Prosecutor has knowledge of prior criminal activities, it would seem to me it would be unfair to the State to prevent them from going into acts of prior criminal activity not the subject matter of criminal conviction and for that reason I will deny motion number 6.\n\nAgain I will have to rule on it as it arises on each issue.\n\n[Defense Counsel] I understand that, Judge, but I also understand the general thrust of the Court's ruling to be that the mitigating factor F is not limited to prior convictions.\n\nTHE COURT: I don't think it is based on its wording.\n\n[Defense Counsel]: Judge, if that's the Court's ruling I will advise the Court and the Prosecutor now that we may in fact withdraw this mitigating factor and we will advise both the Court and the Prosecutor tomorrow.\n\nBased on the trial court's refusal to restrict the State's evidence in rebuttal of mitigating factor c(5)(f) solely to prior criminal convictions of defendant, defense counsel advised the trial court that it was \"withdrawing\" mitigating factor c(5)(f). Defendant contends that the trial court's ruling constituted reversible error in the penalty phase, since it improperly deprived defendant of the right to prove this mitigating factor to the jury.\n\nWe find no error in the trial court's ruling. Although nothing in the legislative history of the Capital Punishment Act illuminates the Legislature's intent, we attach substantial significance to the plain meaning of the words used to define factor c(5)(f). See Levin v. Township of Parsippany-Troy Hills, 82 N.J. 174, 182 (1980). The Legislature's use of the word \"convicted\" in N.J.S.A. 2C:11-3c(4)(a) suggests that its choice of the word \"activity\" in defining factor c(5)(f) was deliberate.\n\nDefendant argues that the drafters of the Model Penal Code, the source of mitigating factor c(5)(f), used the term \"significant\n\nhistory of prior criminal activity\" in order to distinguish extensive prior records of serious convictions from records of trivial or remote convictions. Model Penal Code  210.6(4)(a) (1986 ed.). In the comments to the first proposed official draft of the Code, the drafters explained the change from the originally submitted language of \"the defendant has no history of prior criminal activity\" to the present language as follows:\n\nThe word \"significant\" has been inserted before \"history\" in Subsection (4)(a) in order to meet the concern expressed by some Institute members lest any trivial and remote conviction bar consideration of an otherwise law-abiding life as a mitigating factor. [ Model Penal Code  210.6 comment (Proposed Official Draft 1962) (emphasis added).]\n\nMost courts that have considered the question have held that this mitigating factor may be rebutted by evidence of criminal activity not necessarily the subject of a criminal conviction. See Funchess v. Wainwright, 772 F.2d 683, 694 (11th Cir.1985), cert. denied, 475 U.S. 1031, 106 S. Ct. 1242, 89 L. Ed. 2d 349 (1986); Barfield v. Harris, 540 F. Supp. 451, 471 (E.D.N.Y.1982), aff'd, 719 F.2d 58 (4th Cir.1983); Smith v. State, 407 So. 2d 894, 901 (Fla.1982), cert. denied, 456 U.S. 984, 102 S. Ct. 2260, 72 L. Ed. 2d 864 (1982); Washington v. State, 362 So. 2d 658, 666 (Fla.1978), cert. denied, 441 U.S. 937, 99 S. Ct. 2063, 60 L. Ed. 2d 666 (1979); State v. Simants, 197 Neb. 549, 567, 250 N.W. 2d 881, 892 (1977), cert. denied, 434 U.S. 878, 98 S. Ct. 231, 54 L. Ed. 2d 158 (1977); State v. Gladden, 315 N.C. 398, 435, 340 S.E. 2d 673, 696 (1986), cert. denied, 479 U.S. 871, 107 S. Ct. 241, 93 L. Ed. 2d 166 (1986); State v. Noland, 312 N.C. 1, 21, 320 S.E. 2d 642, 654 (1984), cert. denied, 469 U.S. 1230, 105 S. Ct. 1232, 84 L. Ed. 2d 369 (1985); State v. Matson, 666 S.W. 2d 41, 44 (Tenn.1984), cert. denied, 469 U.S. 873, 105 S. Ct. 225, 83 L. Ed. 2d 154 (1984). But cf. Cook v. State, 369 So. 2d 1251 (Ala.1978) (requiring proof of criminal conviction to rebut analogous mitigating factor under Alabama statute); Dragovich v. State, 492 So. 2d 350 (Fla.1986) (testimony that defendant was called \"The Torch\" and had reputation as arsonist held insufficient to constitute evidence of criminal activity).\n\nIt is self-evident that a trial court must prudently exercise its discretion in determining the quality of proof necessary to constitute a \"significant history of prior criminal activity\" as evidence of rebuttal of mitigating factor c(5)(f). In this case the trial court expressed its intention to rule on the evidence \"as it arises on each issue,\" but did not have the opportunity to do so because defendant withdrew factor c(5)(f) from consideration by the jury. We find no error in the trial court's ruling.\n\n7. Must the Jury Weigh any Mitigating Circumstances that the State Failed to Disprove?\n\nDefendant requested that the trial court charge the jury that if there were any believable evidence of a mitigating factor not disproved by the State beyond a reasonable doubt, the jury was required to find that the mitigating factor exists. The trial court declined, instructing the jury instead that it \"need only be satisfied that the defendant has shown that the existence of a mitigating factor is more likely than not.\" Defendant contends the trial court's charge was error.\n\nIn State v. Zola, 112 N.J. 384 (1988), we considered this question and concluded that \"[t]he jury's determination of whether matters in evidence constitute mitigating factors is the result of a qualitative judgment.\" Id. at 438. We adhere to that principle. Thus, whether or not the State rebuts defendant's proof of a mitigating factor, the jury must still decide if defendant's evidence is sufficient to establish the existence of the mitigating factor. We find no error in the trial court's instruction.\n\n8. Did the Trial Court's Failure to Provide the Jury with More Detailed Explanations of the Mitigating Factors Deprive Defendant of his Constitutional Rights?\n\nDefendant raises as plain error the trial court's instruction to the jury concerning the mitigating factors relied on by\n\ndefendant. Defendant contends that the court's instruction consisted essentially of a reading of the statutory language, and consequently failed to supply the jury with adequate instructions on which to base its deliberations.\n\nWe recently had occasion to consider this general issue in State v. Bey II, supra, and we reiterate the general guidelines set forth in that opinion:\n\nThe requirement that capital sentencing must not preclude consideration of relevant mitigating circumstances would be hollow without an explanation of how the evidence can mitigate the imposition of the death penalty. Otherwise, the court would subject the defendant to the risk of an arbitrary and capricious jury determination. * * * Even before the enactment of the Act, we recognized that \"[a]ppropriate and proper charges are essential for a fair trial\" and that the charges \"should explain to the jury in an understandable fashion its function in relation to the legal issues involved.\" * * * In sum, it is the trial court's duty to assure that a reasonable juror will understand the meaning and function of mitigating factors.\n\nAccord State v. Zola, supra, 112 N.J. at 430-431.\n\nOn remand, the trial court should conform its instructions concerning mitigating factors to the standards set forth in Bey II.\n\n9. Should the Jury Have Been Required Specifically to Find that Death was the Appropriate Punishment?\n\nDefendant objects to the trial court's refusal to instruct the jury that it should sentence defendant to death only if the\n\njury \"unanimously believes that death is the only appropriate punishment.\" As noted above, the jury verdict form contained language virtually identical to the requested charge. Supra at 513. Nevertheless, as we observed in State v. Zola, supra, 112 N.J. at 437, \"no incantation had to accompany the jury's sentence of death, provided that the court's instructions have imparted to the jury its obligation to make the normative judgment that death was 'the fitting and appropriate punishment for the offense before them.'\" Ibid. (quoting State v. Ramseur, supra, 106 N.J. at 316 n. 80). Accordingly, the trial court's refusal to give the requested charge was not error.\n\n10. Did the Trial Court's Refusal to Bar Uniformed Irvington Police Officers from the Courtroom During the Penalty Phase Violate Defendant's Right to a Fair Trial?\n\nPrior to the commencement of the penalty phase of the case, defense counsel noted the presence of nine or ten Irvington police officers in the courtroom, objecting to the fact that they were in uniform on the ground that their intent was \"to send a message to the jury.\" The trial court responded by ruling that \"the officers have a right to be here,\" observing that \"I don't believe I can tell them how to dress when they come to court.\"\n\nWe find no prejudicial error in the court's ruling. Nevertheless, for future guidance, we emphasize that a trial court's paramount responsibility in presiding over a criminal trial is to assure that the proceedings are conducted fairly and that a verdict is rendered impartially by the jury. To that end, a court has broad discretionary powers that may be exercised to protect the jury from extraneous pressures that might affect the proper discharge of its sworn duty. In appropriate circumstances, that power might properly be exercised by imposing limitations on the dress of police or correction officers, by prohibiting the display of buttons or emblems, or by other\n\nproscriptions necessary to preserve decorum and an atmosphere of impartiality in the courtroom.\n\nWe note with approval the observation by the Supreme Court of Kansas in State v. McNaught, 238 Kan. 567, 713 P. 2d 457 (Kan.1986), a vehicular homicide case in which defendant was allegedly driving while intoxicated and numerous spectators were present in court wearing buttons inscribed MADD (Mothers Against Drunk Driving) and SADD (Students Against Drunk Driving):\n\nIn the administration of justice, the trial judge is charged with the preservation of order in his court and with the duty to see that justice is not obstructed by any person or persons whatsoever. A large measure of discretion resides in the trial court in this respect, and its exercise will not be disturbed on appeal unless it appears that prejudice resulted from the denial of a legal right. One of the ideals of criminal jurisprudence is that a defendant is entitled to a trial in a calm judicial atmosphere, to minimize any possibility of a decision being rendered on speculation or emotion rather than on the facts and logical reasoning. On occasions, however, the decorum of the courtroom has been disturbed by demonstrations by spectators. On such occasions, in determining whether or not a defendant was denied a fair trial, the decision of whether the jury was or possibly could have been influenced is one which is necessarily left to the sound discretion of the trial court, the exercise of which will not be disturbed unless it appears that prejudice resulted from the disturbance. [238 Kan. at 577, 713 P. 2d at 466.]\n\nCf. United States v. Alvarez, 755 F.2d 830 (11th Cir.1985),cert. denied, Hernandez v. United States, 474 U.S. 905, 106 S. Ct. 274, 88 L. Ed. 2d 235 (1985) (in trial involving charges of murder and assault of agents of Bureau of Alcohol, Firearms and Tobacco (BATF), trial court did not abuse its discretion in permitting BATF agents that testified to remain in courtroom during closing arguments); Woods v. State, 490 So. 2d 24 (Fla.1986), cert. denied, 479 U.S. 954, 107 S. Ct. 446, 93 L. Ed. 2d 394 (1986) (upholding trial court's exercise of discretion in refusing to bar uniformed correction guards from courtroom).\n\nIn a related context, involving a challenge to the presence of uniformed state troopers in court for security purposes, the United States Supreme Court, reversing the First Circuit Court of Appeals, reinstated a Rhode Island armed robbery conviction and upheld the trial court's exercise of discretion in permitting\n\nthe troopers' presence. The Court's observations, however, highlight our concern that trial courts exercise effective supervisory discretion in dealing with such issues:\n\nWe do not minimize the threat that a roomful of uniformed and armed policemen might pose to a defendant's chances of receiving a fair trial. See ABA Standards for Criminal Justice 15-3.1(c) (2d ed. 1980). But we simply cannot find an unacceptable risk of prejudice in the spectacle of four such officers quietly sitting in the first row of a courtroom's spectator section. Even had the jurors been aware that the deployment of troopers was not common practice in Rhode Island, we cannot believe that the use of the four troopers tended to brand respondent in their eyes \"with an unmistakable mark of guilt.\"\n\nBased on our review of the record, we do not find an abuse of discretion by the trial court in its refusal to grant defendant's request to exclude uniformed Irvington police officers from observing the penalty phase of the proceedings. In the event the issue recurs on retrial of the penalty phase, the trial court should carefully consider its resolution in the context of our observations in this opinion.\n\n11. Did the Trial Court's Failure to Instruct the Jury concerning the Role of Sympathy in its Penalty Phase Deliberations Deprive Defendant of his Constitutional Rights?\n\nDefendant requested that the trial court give the following charge to the jury to clarify the relevance of sympathy and compassion in its penalty phase deliberations:\n\nEven if you find that the aggravating factors outweigh the mitigating factors, you as the sentencing body may still determine that in fairness and mercy a sentence of death would be unjust. Any sympathy or compassion can be taken into consideration by you in coming to your decision as to a penalty. Thus only if you unanimously believe that death is the only appropriate punishment would you return such verdict.\n\nThe trial court declined to charge the jury as requested. In its instructions, the trial court briefly summarized for the jury each of the mitigating factors defendant attempted to prove. Concerning factor c(5)(h), the Court instructed the jury that it was \"required to consider anything concerning the defendant's life and characteristics and the particular circumstances of the crime for which you have found him guilty.\" Unlike the charge in Ramseur, the court's instruction to the jury did not direct that the jury exclude sympathy from its deliberations, but simply omitted any mention of compassion, mercy, or sympathy. Defendant claims the charge constituted reversible error.\n\nIn State v. Ramseur, supra, 106 N.J. 123, we held that an instruction that the jury \"should decide the case on the evidence without any bias, prejudice or sympathy * * *\" did not violate a defendant's constitutional rights, citing California v. Brown, 479 U.S. 538, 107 S. Ct. 837, 93 L. Ed. 2d 934 (1987). Id. 106 N.J. at 296-99. We noted that the instruction by the trial court in Ramseur \"did not preclude the jury from considering all possible mitigating circumstances and such sympathy as those circumstances might inspire,\" id. at 299, nevertheless cautioning against the use of a general admonition against \"sympathy\" if in a particular case it might \"conflict with the permissible role of sympathy specifically engendered by any mitigating factor.\" Ibid. Recently, in State v. Bey II, supra, 112 N.J. at 171, we upheld a trial court's refusal to direct a capital case jury to consider \"[a]ny sympathy or compassion which [the proffered] mitigating circumstances may engender * * *,\" id. at 171.\n\nWe find no error in the trial court's refusal to give the requested charge. The court's instruction was significantly more neutral on the issue of sympathy than the charge we approved in Ramseur, and did not inhibit the jury from considering\n\nsympathy to the extent it may have been engendered by mitigating factors proved by defendant.\n\n12. Did the Trial Court Err in Failing to Instruct the Jury that Defendant is Entitled to a Presumption Against The Death Penalty?\n\nIn State v. Biegenwald, supra, 106 N.J. 13, we held that in all cases tried under the Capital Punishment Act, \"in order for the death penalty to be imposed, the State must prove beyond a reasonable doubt that the aggravating factors outweigh the mitigating factors.\" Id. at 67. The trial court's charge in this case adhered fully to the standard set forth in Biegenwald. We find no basis in the Capital Punishment Act, or in any principle of federal or state constitutional law, that would require the instruction approved in Biegenwald to be supplemented by a statement that the defendant is entitled to a \"presumption\" against the death penalty. No such instruction was requested of the trial court. We find no error in the trial court's omission of such a statement from its charge.\n\n13. Did the Trial Court Violate Defendant's Right to a Fair Trial by Failing to Afford Him the Opportunity to Address the Jury Personally and Plead for Mercy Without Being Subject to Cross-Examination?\n\nIn this case defendant elected to testify in the penalty phase and was subjected to cross-examination. He invokes as plain error the trial court's failure to accord him \"the common law right of allocation, the ancient right of a defendant 'to present to the sentencer his plea in mitigation. The most persuasive counsel may not be able to speak for a defendant as the defendant might, with halting eloquence, speak for himself.'\" State v. Zola, supra, 112 N.J. at 428 (quoting Green v. United States, 365 U.S. 301, 304, 81 S. Ct. 653, 655, 5 L. Ed. 2d 670, 673 (1961) (Frankfurter, J., plurality opinion)).\n\nIn Zola we observed that the right of allocution is set forth in our Rules of Court. Rule 3:21-4(b) provides:\n\nBefore imposing sentence, the court shall address the defendant personally and ask him if he wishes to make a statement in his own behalf and to present any information in mitigation of punishment. The defendant may answer personally or by his attorney.\n\nNo such reference appears in the rule governing sentencing hearings in capital cases. R. 3:21-4A.\n\nWe held in State v. Zola, supra, that there was no federal or state constitutional mandate that a capital defendant be accorded the right of allocution. 112 N.J. at 430. Nevertheless, we determined that such a right should be recognized, on a prospective basis, based on our supervisory jurisdiction over criminal trials:\n\nWe do not base our argument on State or Federal Constitutions and would not find the absence of the right grounds to reverse a capital trial conducted prior to this date. We make our ruling in the exercise of our supervisory jurisdiction over criminal trials in New Jersey. Hence, in the future, we shall permit the narrowly-defined right of a capital defendant to make a brief unsworn statement in mitigation to the jury at the close of the presentation of evidence in the penalty phase. Before a defendant speaks, he shall be instructed by the court, outside of the presence of the jury, of the limited scope of the right; that his statement is subject to the court's supervision; and that should the statement go beyond the boundaries permitted he will be subject to corrective action by the court including either comment by the court or prosecutor or in some cases possible reopening of the case for cross-examination. We shall request our committee on capital cases to suggest any necessary procedures to assist trial courts in this aspect of capital sentencing. It might be useful for a court to examine in advance of the defendant's speech a written outline of the proposed statement. At any rate, we shall stand ready to reconsider this ruling if experience dictates that allocution creates more problems than it solves. [Id. at 431-432.]\n\nAccordingly, since defendant's trial occurred before our decision in Zola, no error resulted from the trial court's failure to afford defendant the right of allocution. In the event of retrial of the penalty proceeding, the right of allocution shall be available to defendant in accordance with our opinion in Zola.\n\n14. Must Defendant be Accorded the Right to Make the Initial Opening Statement and Final Summation During the Penalty Phase?\n\nDefendant contends that it was prejudicial error for the trial court to have denied his request to sum up after the\n\nprosecution in the penalty phase, asserting that the right to give the final closing argument should have been accorded to him as a matter of fundamental fairness since his life was at stake. We dealt with this issue in State v. Ramseur, supra, 106 N.J. at 318 n. 81, and rejected the contention now advanced by defendant. Accord State v. Bey II, supra, 112 N.J. at 183. We adhere to the views expressed in Ramseur and Bey II.\n\nFinally, defendant argues that the death sentence imposed on defendant is manifestly inappropriate and excessive, and is disproportionate to that of other defendants convicted of similar crimes. In view of our disposition of this matter, we do not address these contentions.\n\nThe conviction of murder is affirmed as are the other convictions. The sentence of death is reversed and the matter remanded to the Law Division for capital resentencing.\n\nCLIFFORD, J., concurring.\n\nI agree with Justice Handler that the prosecutor's excesses in his summation on the guilt phase of the case were most offensive, sometimes egregious, such that I would not hesitate to vote to reverse the guilt conviction for that reason alone were I to conclude that that conduct deprived defendant of a fair trial. See State v. Koedatich, 112 N.J. 225, 341 (1988) (Clifford, J., dissenting). Bad as it was, however, the prosecutor's performance was rendered largely inconsequential on the question of guilt by the ready acknowledgement of defense counsel in his summation that his client was guilty of knowing or purposeful murder.\n\nHere is how the case shaped up by the time of the summation on guilt: the court had informed counsel that the defense's request for a charge on aggravated manslaughter would be denied. (I concur with the majority's favorable disposition of that ruling. Justice Handler disagrees. That disagreement on the \"aggravated manslaughter\" issue is at the heart of our divergence of views on this, the prosecutorial conduct, point. I\n\nconcede that if Justice Handler were right on the former -- as I think he is not, for all the reasons so persuasively set forth in the Court's opinion -- then he would be right on the latter.) Therefore, the only options open to the jury were to convict of knowing or purposeful murder or to acquit. The strength of the State's case was such that defense counsel could not mount a respectable argument for acquittal, and therefore chose not to present some kind of silly argument that would run the risk of irritating the jurors, and decided instead (probably wisely, albeit unsuccessfully) to treat the guilt-phase summation as a \"dry run\" of his penalty-phase plea. His purpose was transparently not to gain an acquittal but rather to condition the jurors for what was to come: a subsequent proceeding in which he would argue against imposition of the death penalty. That becomes clear when one examines the transcript of defense counsel's guilt-phase summation, pertinent portions of which follow:\n\nNormally a summation is the time when a defense attorney is supposed to emphasize to you certain facts that he would like you to consider during your deliberations and make an argument to you to try to persuade you that his client or her client is not guilty of the charges against him. I'm not going to do that. At least I'm not going to try to persuade you that Teddy Rose isn't guilty because he is guilty.\n\nAs Mr. Marucci said earlier, Teddy Rose killed Officer Garaffa and there is no disputing that evidence. We have never disputed it. Teddy Rose has never disputed it. He doesn't seek to deceive you. He doesn't seek to deceive anyone or misrepresent anything regarding what happened. He doesn't try to avoid responsibility for his actions.\n\nYou know what the consequences are. You know that a finding of guilty of purposeful or knowing murder forces us to go to a penalty phase where the alternatives are either life imprisonment with 30 years at least without parole or the death penalty.\n\nIt's difficult for him to admit that, it's difficult for us to concede it and perhaps for you to accept it, to accept those will be the only options available to you but it's also difficult to accept that Teddy Rose killed a man and this is true but there are facts in evidence which I would like to emphasize to you because I think it's important for you to keep certain things in mind during your deliberations, however short your deliberations may be.\n\nThe shooting just happened in seconds because Teddy Rose knewthat he was about to get arrested for having that gun, the gun which he knew was illegal\n\nfor him to have and we know he didn't just decide to kill a cop, this one or anyone else. Teddy Rose didn't stalk a police officer and kill him or scour the city looking for this particular police officer. Teddy Rose was going home. We know when this particular police car pulled up what did Teddy Rose do? He waved. You don't wave at a police officer if killing that police officer is what's on your mind. Killing Officer Garaffa was not on Teddy Rose's mind. That couldn't be more clear from the testimony you heard. This was an instant split second decision done with little or no thought, it was a stupid impulsive irrational decision. This isn't to say that he's not guilty.\n\nKilling somebody impulsively in panic is not an excuse and not a justification. The killing of Officer Garaffa can never be excused or justified but there's an explanation and this killer [sic: killing] cries out for an explanation. Before you return your verdict we ask only that you think about it first. Think about what Mr. Marucci and I and the evidence emphasizes to you, the speed with which this happened, the impulsive unplanned, unthinking nature of this act in Teddy Rose's irrational bizarre fear at being arrested.\n\nThe evidence the Prosecutor presented satisfies the requirements of the law Judge Degnan will define to you. As I've said we do not dispute that so go ahead and return your verdict the Prosecutor asks.\n\nWe'll see you at the second part [the penalty phase] of this trial. At that time we'll answer the questions which we know you must have. The answers are there and they will show not that Teddy Rose is an evil monster but that he is indeed different. His actions are not justifiable. Understanding his life is significant and critical to what happened on August 8th, 1984 and he's a human being whose life need not be sacrificed. [Emphasis supplied.]\n\nGiven the defendant's ready concession of guilt, I would have to find the excesses of the prosecutor harmless beyond a reasonable doubt as they affected guilt. Not that that conduct was excusable -- it was not, and possibly it should be dealt with in some other forum. See State v. Ramseur, 106 N.J. 123, 323-24 (1987).\n\nI agree, of course, with the Court's appraisal of the prosecutor's remarks in the penalty phase and of the disposition occasioned by those remarks. I would add only that the prosecutorial improprieties in the guilt-phase summation acted as an accelerant to the fire produced by the penalty-phase excesses.\n\nWILENTZ, C.J., concurring in part, dissenting in part.\n\nI dissent from the majority's disposition of the guilt phase. Aggravated manslaughter should have been charged. As to the rest of the case, I concur and join in the majority opinion.\n\nOn the facts of this case, a jury could find that defendant, rather than intending death or knowing that death was practically certain, was motivated solely by a desperate desire to avoid apprehension. One could find that he shot the victim without intending to kill and without knowing that what he did was practically certain to result in the victim's death. A state of mind does not necessarily precisely track the definitions of the Code. A defendant may be devoid of any state of mind concerning the victim other than the wish to escape the consequences of having committed a separate crime.\n\nA fair inference from the facts of this case is that defendant acted as a result of panic. Panic, of course, can induce an act that defendant knows is practically certain to result in death; that it was caused by panic is no excuse. But panic can also induce a mindless act -- unaware, uncaring, concerned solely for defendant's survival, and totally unconcerned with the consequences to others. That state of mind -- recklessness \"manifesting extreme indifference to human life\" -- is the defining aspect of aggravated manslaughter under the Code. N.J.S.A. 2C:11-4a. The facts in this case, though more strongly suggestive of a purposeful or knowing murder, may reasonably be taken to suggest that state of mind. The jury should have been allowed to decide the issue. See State v. Crisantos (Arriagas), 102 N.J. 265, 278 (1986) (\"the rational-basis test of the Code imposes a low threshold . . . for permitting a charge on a lesser-included offense\").\n\nHANDLER, J., dissenting.\n\nThis is a capital murder appeal in which the defendant, Teddy Rose, was convicted of the purposeful or knowing murder of a police officer and sentenced to death. The Court affirms the defendant's conviction for murder, but reverses the defendant's death sentence. I concur in the conclusion that the death sentence should be reversed, although I do so for different reasons. I would also, however, reverse defendant's conviction for murder.\n\nThe Court gives us an accurate presentation of the history and evidence in this case. The defendant shot Anthony Garaffa, an Irvington police officer, in the stomach from very close range with a sawed-off shotgun that was concealed in a canvas bag. The shooting was witnessed; defendant turned himself in and confessed to it. This evidence moved strongly to a determination that defendant committed a purposeful or knowing murder.\n\nThe majority relies on the strength of the evidence to hold that the trial court did not err in refusing to charge the jury on aggravated manslaughter, and that the trial court's error in admitting certain prejudicial evidence was harmless. Because I differ with the majority's assessment of the prejudice inhering in the trial court's erroneous decisions, and because I find that both the evidence adduced at trial and the structure of the statute would support a charge, not given, on aggravated manslaughter, I would find the errors to be reversible. In addition, I believe that prosecutorial misconduct during the guilt-phase summation warrants reversal of the conviction. I concur in the majority's decision to reverse the death sentence, but would further find in this case extreme prejudice in allowing the jury in the penalty phase to consider virtually the same evidence in support of more than one aggravating factor, thereby distorting the process involved in comparing and weighing aggravating and mitigating factors. In addition, further prejudice occurred, I believe, when the jury was permitted to consider an aggravating factor in the absence of sufficient evidence to support such a finding.\n\nThese several points justify the reversal of the defendant's murder conviction and death penalty. This reversal, I believe, is mandated under either the conventional standard of review used by the majority or the enhanced standard I proposed and have applied in capital cases. See State v. Bey (I), 112 N.J. 45 (1988) (Handler, J., concurring); State v. Bey (II), 112 N.J. 123 (1988) (Handler, J., dissenting); State v. Koedatich, 112 N.J. 225\n\n(1988) (Handler, J., dissenting); State v. Zola, 112 N.J. 384 (1988) (Handler, J., concurring).\n\nI.\n\nThe Court today upholds a trial court's refusal to charge aggravated manslaughter in a capital murder case in which the argument that the defendant did not possess the state of mind requisite for murder was the only \"defense\" offered. The Court acknowledges that, in insisting on a \"clear indication\" of aggravated manslaughter, State v. Choice, 98 N.J. 295, 299 (1985), the trial court applied the wrong standard in deciding not to charge on aggravated manslaughter, ante at 479-480. The Court further acknowledges testimony in the record that (1) defendant's companion was \"shocked\" and \"surprised\" when the shooting occurred, (2) defendant himself was crying and nervous after the shooting occurred, (3) the defendant turned himself in, (4) the defendant told police on turning himself in that he had \"reached into the sack and when he pulled it out of the sack it apparently had cocked and when it came out of the sack the gun went off,\" ante at 480, (5) the defendant stated on turning himself in that he hoped the officer would live, and (6) the defendant told police that he had shot the officer reflexively because \"I panicked, did not want to get caught.\" The Court acknowledges that this testimony was \"the only evidence concerning defendant's motive.\" Ante at 531. The Court also concedes that certain evidence adduced by the State to rebut any state of mind defense was admitted erroneously. Ante at 488. Nonetheless, the Court purports to apply State v. Crisantos (Arriagas), 102 N.J. 265, 276 (1986), and concludes that there was no rational basis for allowing the jury to consider aggravated manslaughter in this case.\n\nI disagree. In my opinion, a rational jury confronted with the evidence described above, expunged of the erroneously admitted, prejudicial evidence adduced by the State, could not have acquitted the defendant, but could have found the defendant\n\nguilty of having recklessly caused death \"under circumstances manifesting extreme indifference to human life,\" N.J.S.A. 2C:11-4a, rather than of shooting the officer with the \"conscious object\" or \"practical certainty\" that he would die; such a finding would have been based, in other words, not on mere sympathy unsupported by the evidence, which would have rendered it irrational, but rather on the credited testimony that defendant's behavior both before and after the shooting reflected a regretted act of recklessness, not a knowing or purposeful murder.\n\nA.\n\nBy refusing to charge on aggravated manslaughter the trial court left the jury with a choice: conviction of knowing or purposeful murder or acquittal. Given that the defendant had turned himself in and admitted to the act of killing the officer, there was no way a rational jury could acquit him. The court's refusal was, in effect, a directed verdict of guilt. A rational jury might, however, have concluded on these facts that the defendant was probably telling the truth when he stated that he had shot the officer because he had panicked and feared being caught. If given the proper instruction, the jury could have considered whether this panic reflected the defendant's \"conscious object\" to kill the officer (purpose), N.J.S.A. 2C:2b(1); his \"practical certainty\" that his conduct would kill the officer (knowledge), N.J.S.A. 2C:2-2b(2); or his \"conscious disregard\" of \"a substantial and unjustifiable risk\" that his conduct would kill the officer (recklessness), N.J.S.A. 2C:2-2b(3), in circumstances \"manifesting extreme indifference to the value of human life,\" N.J.S.A. 2C:11-4a. Having been deprived of the potentially dispositive third alternative, a rational jury could have reached only one verdict: guilty of capital murder.\n\nThe Court makes much of the fact that there was testimony from the defendant, police officers, and experts that supported a conviction of knowing and purposeful murder. I agree that\n\nthe evidence described by the Court is sufficient to support the jury's verdict; no one, however, is challenging the sufficiency of the evidence. In my opinion, the Court misapplies Crisantos by conducting a weighing of evidence appropriate to the jury's deliberation rather than to the ascertainment of \"rational basis\" required by Crisantos. That case enjoins courts to \"examine the record thoroughly\" \"in view of the defendant's request\" to determine whether the \"low threshold\" of rational basis is met. 102 N.J. at 278.\n\nPrecisely how low the threshold is can be seen by comparing the testimony in this case with the evidence adduced in Crisantos and in State v. Bohannan, 206 N.J. Super. 646 (App.Div.1986), and State v. Powell, 84 N.J. 305 (1980), cases whose results are discussed with approval in Crisantos. In Bohannan, the Appellate Division held that it was reversible error for the trial court to have refused to charge second-degree robbery. The court noted that such a charge is warranted \"[i]f there exists a rational basis in the proofs to support a conviction of the lesser degree of the crime. . . . [E]ven very slight evidence on [the proposed theory] will compel the instruction on a lesser offense.\" 206 N.J. Super. at 649, (citing State v. Powell, 84 N.J. 305 (1980)). Turning to the facts of the case, the court found such a rational basis for second degree robbery because\n\n[d]efendant's testimony that he was unaware of a handgun until the [other perpetrators] returned to the car a second time was direct evidence to be weighed against the circumstantial evidence that he knew that a dangerous weapon would be used. It was for the jury to determine whether he was aware of sufficient circumstances to believe or hope that an armed robbery was contemplated. [Id. at 651.]\n\nThus, despite strong circumstantial evidence to the contrary, where there was evidence that, if credited, would have supported the lesser-included offense -- even though that evidence derived from the defendant's self-serving testimony -- the court held that the instruction should have been given. Similarly, in this case, the majority concedes that \"the only evidence concerning defendant's motive for shooting Officer Garaffa was defendant's own statement indicating that he panicked and did\n\nnot want to be caught with the shotgun.\" Ante at 531. The jury should have been allowed to consider whether he was telling the truth about his panic and, if so, whether his panic caused defendant to act recklessly.\n\nIn Crisantos, by contrast, this Court upheld the trial court's refusal to charge passion/provocation manslaughter. The Court cited Bohannan with approval, and cautioned that the \"rational basis\" standard requires slightly more than \"a scintilla\" of supporting evidence, but added that the \"rational basis\" standard \"[n]evertheless . . . imposes a low threshold . . . for permitting a charge on a lesser-included offense.\" 102 N.J. at 277-78. The Court failed, however, to find a rational basis on the record before it, because \"[p]assion/provocation manslaughter in this case is not only inconsistent with the defendants' testimony; it is also inconsistent with the State's version of the homicide and is substantiated by no testimony in the record.\" Id. at 280. The Court contrasted this situation with that in State v. Powell, supra, 84 N.J. 305, in which this Court held that the lesser-included offense of manslaughter should have been charged despite the defendant's denial of any involvement at all and his assertion of an alibi. Manslaughter should have been charged, this Court held in Powell, because \"the State introduced a contradictory statement from defendant that was held to support a manslaughter instruction.\" Crisantos, supra, 102 N.J. at 280-81 (citing State v. Powell, supra, 84 N.J. at 320). Thus, the Crisantos Court concluded, \"[u]nlike Powell, no evidence in this record connects the alleged provocation to the homicide.\" Ibid.\n\nRead together, Crisantos, Powell, and Bohannan establish that no rational basis exists if the proposed lesser-included offense contradicts both the defense's and the State's theories of the case, and is otherwise wholly unsupported by the evidence (Crisantos). A rational basis must be supported by slightly more than a \"scintilla\" of evidence, but can be afforded by a defendant's self-serving statements, even in the face of strong contrary evidence (Bohannan), and by evidence adduced\n\nby the State -- even a single contradictory statement of the defendant -- that directly contradicts both the defendant's other statements and the defense's entire theory of the case, so long as that evidence could be read to support the lesser-included charge (Powell). Turning to the facts of this case, it is clear that there is evidence in the record that could be read to support the lesser-included charge. This case is distinguishable, therefore, from Crisantos; the question is whether that evidence amounts to slightly more than a scintilla, and thus meets the rational basis test. In light of the truly slight evidence accepted in Bohannan and Powell, as approved in Crisantos, I believe that the rational basis threshold is met in this case by the defendant's testimony, read in light of the surrounding circumstances, that he shot the officer out of panic that he would be caught with the weapon.\n\nIt is a rational conclusion -- from the companion's shock that the shooting occurred, from the defendant's distraught state immediately afterward, from his surrender, his confession, his statement that he panicked, and his statement that he hoped the officer would live -- that the defendant, when confronted with law enforcement, simply panicked and, manifesting extreme indifference to the value of human life in his desire to escape, cocked and pulled the trigger. To the extent that the rational basis for aggravated manslaughter rests in this case on defendant's self-serving and contradictory statements, Bohannan and Powell are authority supporting the issuance of instructions on lesser-included offenses where there is evidence to the contrary, where the defendant has made contradictory statements on the record, and even where the lesser-included offense contradicts the theory of the defense. In this case, of course, the lesser-included offense was the theory of the defense. To the extent, moreover, that the majority finds significant the fact that all of the evidence affording the rational basis was adduced by the State, ante at 480, Powell is controlling authority that the source of the evidence does not matter.\n\nThe majority does not challenge this interpretation of our precedent; rather, the majority responds by concluding that \"panic\" is irrelevant to mental state, that \"in the absence of insanity or diminished capacity, a person firing a sawed-off shotgun into the abdomen of another at point-blank range necessarily is aware that 'it is practically certain' that such conduct will cause the victim's death.\" Ante at 484. But cf. State v. Palmer, 211 N.J. Super. 349, 352 (App.Div.1986) (endorsing trial court's definition of \"circumstances manifesting extreme indifference,\" for aggravated manslaughter purposes, as conduct \"that is practically certain to kill everyone who might happen to be in the way\" (emphasis added)). The majority thus concludes that what it concedes to be \"the only evidence concerning defendant's motive,\" ante at 531, was somehow irrelevant to the defendant's state of mind. The majority accomplishes this by pointing out that \"panic\" is not a state of mind contemplated by the Code, by ignoring the fact that \"recklessness\" is contemplated by the Code, and thus by avoiding the question of whether \"panic\" can lead to \"reckless\" behavior.\n\nPanic may not be defined in the Code -- neither, I should add, are other terms of common currency, such as fear, anger, or jealousy, with which a party might be expected to describe his state of mind -- but in plain English \"panic\" means \"[a] sudden, overpowering terror,\" The American Heritage Dictionary of the English Language (1978 ed.), at 948, or \"a sudden terror often inspired by . . . a misapprehension of danger and accompanied by unreasoning or frantic efforts to secure safety,' Webster's Third New International Dictionary (unabridged), at 1630 (emphasis added). It was the evidence -- albeit scanty -- of precisely such \"panic,\" such \"terror . . . inspired by . . . a misapprehension of danger\" -- or, as Justice O'Hern put it, such an \"overreact[ion] to the perceived menace\" -- that led this Court to hold last term, in State v. Bowens, 108 N.J. 622, 640 (1987), that the trial court should have charged the jury on aggravated manslaughter. The term \"overreact[ion] to the\n\nperceived menace,\" while not defined in the Code, was held relevant in Bowens to the issue of whether the defendant had acted recklessly; if this is so, how is it that the evidence in this case of similar \"panic,\" or \"terror . . . inspired by . . . a misapprehension of danger\" can be considered irrelevant to the identical issue? Assuming arguendo that the jury was disposed to credit the testimony that Teddy Rose, when confronted by the police, was afflicted with \"[a] sudden, overpowering terror,\" it is unreasonable to preclude that jury from considering the effect of that \"sudden, overpowering terror\" on defendant's state of mind. It seems self-evident that one who feels a \"sudden, overpowering terror\" is at least equally likely -- and perhaps more likely -- to act \"recklessly\" -- with conscious disregard of the potential consequences of his act -- as he is to act with \"practical certainty\" of the consequences of his actions. Surely if the jury is to be allowed to find that the defendant's state of mind was \"knowing\" despite his panic, it should be allowed to consider the possibility that his conduct was \"reckless\" because of it.\n\nThe majority thus inexplicably fails to consider the question most obviously raised by the evidence relating to panic: what if the defendant was thinking only of getting away, not of where or whether he was aiming nor of how close the officer was nor, for that matter, of the nature of his instrument of escape in relation to the proximity of the person who might prevent such an escape? What if, in other words, the defendant was in a state of blind -- dare I say it? -- panic? An instruction on aggravated manslaughter would have \"invited the jury to probe defendant's mental processes\" not, as the majority insists, to speculate whether defendant's panic \"interfered . . . with his capacity to be aware of the consequences of his act,\" ante at 485, but to define the extent to which that panic led the defendant to disregard those consequences: purposefully, knowingly, or recklessly, the latter with conscious -- not insane or incapacitated -- disregard for the consequences of his actions\n\nin circumstances \"manifesting extreme indifference to human life.\"\n\nI believe, in short, that a rational basis existed, within the meaning of Crisantos, for charging the lesser-included offense. The Court's approach -- emphasizing the evidence against defendant, rather than the evidence that could support a rational inference -- distorts precedent cynically; strong evidence supporting guilt of the greater charge will always exist, or a charge on the greater offense will be unjustified and will in fact be reversible error. By holding, in other words, that \"a charge of aggravated manslaughter was unwarranted unless there was a rational basis on which the jury could find that defendant did not purposely or knowingly shoot Officer Garaffa,\" ante at 482, the Court has not merely misstated the law but reformulated it. Indeed, N.J.S.A. 2C:1-8e provides expressly that \"[t]he court shall not charge the jury with respect to an included offense unless there is a rational basis for a verdict convicting the defendant of the included offense.\" In no prior case, moreover, has this Court suggested that a charge on a lesser-included offense was unwarranted unless there was a rational basis for acquittal of the greater offense that did not derive exclusively from the existence of evidence supporting conviction of the lesser offense. This Court noted in State v. Crisantos, supra, 102 N.J. at 277 n. 10, that the formulation in N.J.S.A. 2C:1-8e differed from the proposed wording of the comparable provision of the Model Penal Code -- \"rational basis for a verdict acquitting the defendant of the offense charged and convicting him of the included offense\" -- but declined to ascribe any significance to the distinction. The reason for this seems clear; because conviction of the included offense entails acquittal of the greater, evidence affording a rational basis for convicting of an offense involving a lesser degree of culpability will necessarily afford a rational basis for acquittal of the greater charge. Thus, by omitting the language respecting acquittal of the greater charge from the statute, while retaining it in the Commentary, the legislature expressed its conclusion\n\nthat this language was simply extraneous to the proper focus of the rational basis test: the existence of evidence supporting conviction of the lesser-included offense.\n\nThe majority today, however, seeks in effect not only to import the omitted language into our Code, but to manipulate it to create a two-part test. Under this new formulation, a rational basis is not established unless a defendant has not only pointed to evidence that could support a conviction on the lesser charge, but also, and quite apart from this, explained why the jury should have credited that evidence by assailing the strength of the evidence of the greater charge. In my opinion this approach transforms a \"low threshold\" into an unattainable ceiling. Any evidence that could be read to support conviction of a lesser charge may be said to weaken the case for the greater charge to the extent that the jury credits such evidence. Because the degree to which a jury will believe and weigh evidence is essentially inscrutable, however, the question of what weight to afford evidence that could be read to support a lesser charge has until today been left to the jury; rational basis has been afforded in our prior cases by the existence of slightly more than \"a scintilla\" of evidence of the lesser charge, not by any assessment of its weight as against the evidence supporting conviction of the greater charge. The majority's approach thus transforms the rational basis test by requiring courts to \"hypothesize\" the weight a jury would have ascribed to the evidence supporting conviction of the lesser charge. Furthermore, because all that is required to establish a rational basis is slightly more than a \"scintilla\" of evidence of the lesser offense, such evidence will almost always be outweighed substantially by evidence sufficient to establish guilt of the great offense beyond a reasonable doubt. To the extent, therefore, that the majority's approach requires courts to assess the weight of the evidence of the lesser offense as against the weight of the evidence of the greater, it departs from all precedent, imposes an unrealistic standard, and usurps the function of the jury. To the extent, moreover, that the majority's\n\napproach implies that the strength of the evidence supporting conviction of the greater charge should be evaluated independent of the evidence supporting conviction of the lesser standard, it sets an unattainable standard; if there were a rational basis for acquittal that was afforded not by the evidence supporting a lesser charge but by the weakness of the evidence of the greater charge, the defendant should never have been convicted of the greater offense in the first place. Such a \"rational basis\" independent of the evidence of the lesser charge would be difficult to distinguish, in other words, from a \"reasonable doubt\" justifying acquittal. Few, if any, defendants raising this issue will be able to meet such a standard. In my view, the only evidence relevant to the possibility of acquittal of the greater charge, for purposes of ascertaining whether \"there is a rational basis for a verdict convicting the defendant of the included offense,\" N.J.S.A. 2C:1-8e, is the evidence that has been the focus of the rational basis inquiry in all of our prior cases: the evidence that could be read to support conviction of a lesser charge.\n\nThe majority's standard, rather than restating this \"low threshold,\" transmutes it, and seems insurmountable on its face. It is, moreover, precisely the approach that this Court rejected just last term by affirming the Appellate Division's decision in State v. Bowens, 205 N.J. Super. 548 (App.Div.1985), aff'd, 108 N.J. 622 (1987). In that case, a majority of the Appellate Division panel reversed a murder conviction for the trial court's failure sua sponte to charge the jury on aggravated manslaughter. The Appellate Division reviewed the record testimony and, relying chiefly on \"defendant's own testimony,\" 205 N.J. Super. at 551, found \"[a] version of the evidence which would have supported a jury verdict of aggravated or reckless manslaughter. . . .\" The Appellate Division dissent, like the majority's approach in this case, emphasized the strength of the evidence of murder, and noted that defendant had \"conceded in his brief that 'there is more evidence on the record to infer a finding that defendant's actions were either purposeful or\n\nknowing' rather than reckless.\" Id. at 556 (dissenting opinion). This Court rejected the dissenting approach, agreeing with the approach of the Appellate Division majority, which treated as irrelevant the strength of the evidence of murder, emphasizing instead the fact that defendant's version afforded \"sufficient evidence . . . to have the jury consider whether the defendant overreacted to the perceived menace. . . .\" 108 N.J. at 640. There was no intimation that \"overreact[ion] to . . . perceived menace\" was irrelevant because it is not defined in the Code or that defendant had to show a rational basis for not convicting apart from the evidence that could have been read to support a conviction of the lesser charge.\n\nThe majority's formulation, requiring that defendant show a rational basis for not convicting him of the greater charge, not only requires defendants to prove a negative, but also shifts the focus of the rational-basis inquiry from its proper object: whether evidence exists that, if credited, would support the lesser-included charge. Because such evidence existed, and because no such charge was given, defendant's conviction should be reversed.\n\nB.\n\nA second, perhaps more important, reason that the jury should have been allowed to consider convicting of aggravated manslaughter is that it was allowed to convict of knowing murder. The distinction between knowledge and recklessness, between \"practical certainty\" of a result and \"conscious disregard\" of \"a substantial and unjustifiable risk\" of a result, is a subtle one at best. Under New Jersey's capital murder statute, a defendant can be considered death-eligible for the \"knowing\" infliction of \"serious bodily injury resulting in death,\" but as the trial court instructed the jury in this case, serious bodily injury \"can be defined as bodily injury which creates substantial risk of death,\" ante at 528. See N.J.S.A. 2C:11-1b. Similarly, \"the risk under [both N.J.S.A. 2C:11-4a and b, aggravated and reckless manslaughter] must be 'a substantial risk of\n\ndeath.'\" Cannel, New Jersey Code of Criminal Justice Annotated (1987), at 259. Thus, the term on which \"knowledge\" is predicated in the capital murder statute, \"serious bodily injury,\" denotes the very idea of \"substantial risk\" of death on which aggravated manslaughter is predicated; the distinction between \"knowing\" murder and \"aggravated manslaughter\" turns in close cases, therefore, on the difference between \"practical certainty\" that one is inflicting injury with a substantial risk of death and a conscious disregard of a substantial risk of death that manifests \"extreme indifference to the value of human life.\" The Commentary to the proposed Code revision of 1971, which introduced the concepts ultimately codified as \"knowing\" murder and \"aggravated manslaughter,\" made clear the fineness of the distinction between them by suggesting that it did not exist:\n\n[T]here is a kind of reckless homicide that cannot be distinguished . . . from homicides committed knowingly. Recklessness presupposes an awareness of the creation of substantial homicidal risk. . . . Since risk, however, is a matter of degree and the motives for risk creation may be infinite in variation, some formula is needed to identify the case where recklessness should be assimilated to knowledge. The conception employed is that of extreme indifference to the value of human life. The significance of purpose or knowledge is that . . . it demonstrates precisely such indifference. Whether recklessness is so extreme that it demonstrates similar indifference is not a question that, in our view, can be further clarified; it must be left directly to the trier of the facts.\n\n[New Jersey Penal Code, Volume II: Commentary, Final Report of the New Jersey Criminal Law Revision Commission, 1971 (quoted in Cannel, New Jersey Criminal Code Annotated (1987), at 245-46) (emphasis added).]\n\nThe \"indifference\" signified by \"knowledge\" is, therefore, a species of \"extreme indifference\" to \"substantial homicidal risk\"; a \"conscious disregard\" of such \"substantial homicidal risk\" in other circumstances \"manifesting extreme indifference to the value of human life,\" the Commentary held, raises reckless manslaughter to the equivalent of knowing murder.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nThus, the Commentary recognizes the propinquity -- indeed, it urges the inseparability -- of species of recklessness \"manifesting extreme indifference to the value of human life\" and \"knowing\" murder; \"extreme indifference\" is the formula by which \"recklessness\" is \"assimilated to knowledge.\"\n\nPerhaps in recognition of the minuteness of any distinction between aggravated manslaughter and knowing murder, aggravated manslaughter was omitted from the original enactment of the Code revision. In 1979, however, the aggravated manslaughter provision was added -- but only as a separate and, in proper cases, a lesser-included offense -- in the language proposed in 1971 as the equivalent of knowing murder; it applied, in other words, \"when the actor other than purposely or knowingly causes death under circumstances manifesting extreme indifference to human life.\" L. 1979, c. 178.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e By further amendment in 1981, the language of the provision was amended to make clear that \"extreme indifference\" established a species of \"recklessness,\" the precise term discussed in the 1971 Commentary, rather than \"negligence.\" L. 1981, c. 290. Cannel, supra, at 258-59. Thus, the Commentary's discussion of the distinction between knowledge and recklessness that manifests extreme indifference speaks directly to the terms of the current statute. Cf. State v. Palmer, supra, 211 N.J. Super. at 352 (endorsing a definition of \"circumstances manifesting extreme indifference\" as conduct \"practically certain to kill anyone who might happen to be in the way\").\n\nAggravated manslaughter is not a class of murder, as the Code revision intended, but its formulation in terms identical to\n\nthose discussed in the Commentary, and the Commentary's conclusion that those terms rendered it indistinguishable from knowing murder, should give this Court pause. This is particularly so when one considers the consequences of the distinction under the current Code. When the original Code revision was proposed, the Commentary took pains to point out that \"[i]t is only purposeful killings which subject the defendant to capital punishment.\" 1971 Commentary (quoted in Cannel, supra, at 245). Thus, when the commentators equated what we know as aggravated manslaughter with knowing murder, any proffered distinction between them could have made a difference in degree only; this was the situation from 1979, when aggravated manslaughter was adopted, until 1982. When the Legislature included \"knowing\" murder in the 1982 amendment reinstituting capital punishment, however, it transformed a difference in degree -- and a tenuous one at that -- into a difference in kind. Last year, this Court upheld the constitutionality of this scheme. See State v. Ramseur, 106 N.J. 123, 194-95 (1987); but see id. at 389-90 (Handler, J., dissenting).\n\nToday this Court goes even further, holding that the distinction between \"knowing\" murder and \"aggravated manslaughter\" -- a distinction the existence of which the Code Commentary of 1971 denies utterly, but a distinction that can now mean the difference between life and death -- is great enough to justify charging the jury on knowing murder, for which the defendant is death-eligible, while refusing to charge the jury on aggravated manslaughter, for which the defendant is not death-eligible. I cannot agree. In my opinion, the distinction between a knowing infliction (an infliction with practical certainty) of serious bodily injury (a substantial risk of death) and a conscious disregard of a substantial risk of death that manifests extreme indifference to the value of human life is, as the Commentary suggests, one for juries to draw deliberatively, not one for trial judges to draw preemptively, particularly when that distinction is the defendant's only argument.\n\nAt a minimum, this analysis suggests that in capital cases in which the jury is charged on \"knowing\" murder it should also be charged on aggravated manslaughter. To paraphrase the original Code Commentary, whether the degree of \"indifference\" to \"substantial homicidal risk\" more closely approximates \"practical certainty\" or \"a conscious disregard\" \"manifesting extreme indifference to the value of human life\" is not a question that can be further clarified; \"it must be left directly to the trier of the facts.\" Accordingly, this conviction should be reversed and the case remanded for the court's refusal to charge on the \"lesser-included offense\" of aggravated manslaughter.\n\nBeyond adopting this prophylactic measure, this Court should face the implications of the proffered analysis for this State's capital punishment system. By enacting aggravated manslaughter as a lesser-included offense of knowing murder in terms that, according to the original Code Commentary, render the two indistinguishable, and then by including knowing murder as a capital offense, the Legislature has created a system that will of necessity function irrationally. Even where a charge is given on the lesser-included offense, the distinction between defendants convicted of knowing murder and sentenced to die, defendants convicted of knowing murder whose lives are spared,and defendants convicted, instead, of aggravated manslaughter will be difficult, if not impossible, to draw. By holding as it does today, moreover, this Court exacerbates this irrationality; there will now be verdicts of guilt of knowing murder that are unreliable because the jury was not allowed to consider convicting of the nearly identical, but non-death-eligible, crime of aggravated manslaughter. This Court is enjoined, however, by the statutory requirement of proportionality review, to attempt to compare \"like\" cases to ensure rationality.\n\nThe Court's dilemma is, therefore, clear: by upholding this statutory structure, it has made an effective proportionality review more necessary even as it has rendered it next to impossible. In addition, the charging discretion left to prosecutors\n\nby this statutory structure, particularly in view of this Court's unwillingness to set guidelines to channel prosecutorial discretion, State v. Koedatich, 112 N.J. 225 (1988), seems to me certain to result in irreconcilable charging decisions.\n\nThe Legislature's enactment of aggravated manslaughter as a lesser-included offense, coupled with its inclusion of knowing murder as a capital offense, bespeaks inadvertence rather than deliberation, an inadvertence reflected in the absence of any legislative history explaining why aggravated manslaughter is now an offense distinguishable from knowing murder, and in the statement of the capital murder legislation's sponsor that this State's capital murder statute is \"not as broad\" as statutes in some other states, in part because defendants are death-eligible only if \"found guilty . . . of first degree murder, willful, premeditated murder,\" a degree of murder closely corresponding only with a \"purposeful\" state of mind. Capital Punishment Act: Hearings on S.112 Before the Senate Judiciary Committee (1982) at 1. Because I see little distinction between aggravated manslaughter and knowing murder, because my belief is unshaken that the inclusion of knowing murder as a capital offense has contributed to the creation of an unconstitutionally overbroad class of capital defendants, and because I am convinced that the Legislature's adoption of aggravated manslaughter as, in effect, a lesser-included offense, coupled with its inclusion of knowing murder as a capital offense, has created a system that canfunction only in an arbitrary and capricious fashion, I am constrained to renew my objections to the constitutionality of the capital murder statute. See State v. Bey (II), 112 N.J. 123 (1988) (Handler, J., dissenting); State v. Ramseur, supra, 106 N.J. 343 (Handler, J., dissenting).\n\nII.\n\nThe Court's stringency in deciding that there was no rational basis for charging aggravated manslaughter stands in sharp contrast to its assessment of other evidentiary rulings and to\n\nits treatment of prosecutorial misconduct during the guilt phase. The Court upholds and confirms harmless evidentiary rulings whose relevance is admittedly attenuated and whose capacity for prejudice is both flagrant and undisputed. In addition, the Court glosses over a glaring instance of prosecutorial misconduct during the guilt phase of the trial. In my opinion, both issues warrant reversal.\n\nA.\n\nThe Court strains to uphold as relevant to the defendant's state of mind the admission of testimony concerning defendant's brandishing of the gun on another occasion. The Court concedes that this testimony was inadmissible \"to prove that on August 8, 1984, defendant possessed the shotgun with the purpose to use it unlawfully.\" Ante at 488. Nonetheless, the Court upholds the admission of the testimony as \"somewhat relevant to the issue of defendant's state of mind at the time of shooting,\" ante at 488, and points, as support for this position, to the fact that defendant requested, \"at the close of the guilt phase . . . a charge of aggravated manslaughter.\" Ante at 489.\n\nThe Court cannot have it both ways. Surely if the playground conversation is admissible as \"somewhat relevant\" to the defendant's state of mind, the concentration of other evidence discussed above -- the surrender, confession, remorse, etc. -- affords a \"rational basis\" for refuting what this \"somewhat relevant\" evidence is allowed to prove. Furthermore, if the evidence of the playground incident, which involved defendant's antipathy toward a black man, is relevant at all to defendant's shooting of the white policeman -- and its relevance is, in my view, so remote as to require exclusion -- that relevance lies in revealing a defendant ready to use his weapon without regard for the identity of his target and therefore with reckless disregard for the value of human life -- the very definition, it seems to me, of aggravated manslaughter. See State v. Palmer,\n\nsupra, 211 N.J. Super. at 352. If the Court insists that this evidence was properly admitted, it must consider interpretations of this evidence that might support a charge of aggravated manslaughter. State v. Powell, supra, 84 N.J. 305.\n\nThis reading of relevance is buttressed by the admission of testimony that the defendant had purchased the shotgun because \"he was having some problems over in Jersey with some niggers.\" The Court concludes that this testimony, like the playground testimony, was \"somewhat probative of the question of whether defendant's shooting . . . was purposeful or accidental,\" then holds that its admission, if erroneous, was harmless. Ante at 488-489. If this evidence is \"somewhat probative\" on whether the conduct was purposeful or accidental, it was equally probative, given that defendant's problem was with \"some niggers\" and his victim was a white policeman, on whether that state of mind was extreme indifference to the value of human life; if it was properly admitted, the jury should have been given 3 the option to consider its relevance in this respect.\n\nIn any event, it seems to me clear that the capacity of this evidence for prejudice, for convincing the jury that this was, as the prosecutor put it, just a \"bad guy\" who, in addition to killing a white cop, hated blacks, outweighed any relevance it might have to the defendant's state of mind. Evid.R. 4. Its effect will in all likelihood, moreover, continue to be felt, as the record of the guilt phase is customarily entered into evidence at resentencing. The capacity of this evidence that the defendant is a racial bigot to corrupt the moral balancing of sentencing, to function, in other words, as a non-statutory aggravating factor, seems to me incalculable. At a minimum, the Court should order this evidence expunged from the record introduced into evidence at the resentencing hearing.\n\nThe Court justifies its search for \"the possible grounds\" for upholding the admissibility of the evidence by noting that such a search \"underscores the necessity for according some measure\n\nof discretion to trial courts\" where the evidence \"may be both material and inflammatory.\" Ante at 489. This degree of deference is inexplicable in a capital case, particularly where, as here, the rulings have nothing to do with demeanor or other factors within the unique purview of the trial court. The majority's repeated protestations that its review of the record in capital cases is independent and searching, e.g., State v. Bey (II), supra, 112 N.J. 123; State v. Koedatich, supra, 112 N.J. 225, take on an inadvertent irony in this case, where the Court searches the record scrupulously to find \"the possible grounds\" to hold this prejudicial evidence admissible as relevant to state of mind, while holding that the only record evidence relating to the defendant's motive was irrelevant to his state of mind and discounting other evidence that could be read to support a rational basis for aggravated manslaughter.\n\nThis evidence, in short, should not have been admitted. Even if the Court is correct to uphold its admission, however, it can be read with other evidence in the case to afford a rational basis for a charge of aggravated manslaughter. In either case, in my judgment, the conviction should be reversed.\n\nB.\n\nThe prosecutor's numerous excesses during the penalty phase aretreated at length by the majority. Ante at 508-524. The majority gives short shrift -- indeed, no shrift -- however, to an instance of improper prosecutorial comment during the guilt phase that corrupted the entire working of the statute. During his closing argument, the prosecutor drew the following comparison between defendant and the victim:\n\nThis photograph of Teddy Rose, this is the man who took the life of an honest hard working law abiding citizen who was on the streets to protect you and I. This is the difference between you. The police officer is a different, this is a different person than you, Teddy Rose. This Officer Garaffa is a person like you and I who does his job day in and day out to raise a family. There's something else about him though that makes this the serious case that it is here and we talked about this in jury selection.\n\nHe, Officer Garaffa, stands between you and this man, the likes of this man. Take him away, we're nowhere, we're not in New Jersey, we're not in Essex County, we're not in the free law abiding country. You have a serious responsibility as I stated.\n\nIt should go without saying that Teddy Rose is no more or less culpable for knowing or purposeful murder because his victim was a person \"who does his job day in and day out to raise a family.\" Defendant either committed knowing or purposeful murder or aggravated manslaughter or he did not; the victim's status in the community is absolutely irrelevant to the degree of culpability during the guilt phase.\n\nThe prosecutor went further, however, arguing that the fact that the victim was a policeman \"makes this the serious case that it is here.\" This comment is as egregious as any that could occur during a capital case, for its effect is to corrupt the structure of the entire statute. The prosecutor was correct that the fact that the victim was a police officer \"makes this the serious case that it is;\" it does so, however, by virtue of aggravating factors c(4)(h) and, in this case, c(4)(f), which are properly before the jury during the penalty phase. By injecting a penalty phase aggravating factor into the guilt phase deliberation, the prosecutor both ignored and frustrated a principal purpose of conducting a bifurcated proceeding in a capital case: to prevent the guilt phase deliberation from becoming infected with circumstances that might aggravate the crime as far as sentencing is concerned, but that bear no relevance to and substantial capacity for prejudice during the guilt phase deliberation.\n\nJustice Clifford, concurring, agrees that this statement constituted misconduct, but concludes that it was rendered harmless beyond a reasonable doubt by \"the ready acknowledgement of defense counsel in his summation that his client was guilty of knowing or purposeful murder.\" Ante at 547. Justice Clifford quotes at length from this summation, ante at 548-549, as an indication that nothing the prosecutor said could have made things worse for defendant; this is all too true with\n\nrespect to the jury's deliberation of guilt. I agree, moreover, with Justice Clifford that both the prosecutor's comment and the defense counsel's summation must be seen in context. I differ, however, from Justice Clifford in my assessment of that context, and in the weight that I attach to defense counsel's summation.\n\nPrior to delivering his summation, defense counsel had requested an instruction on aggravated manslaughter; the rejection of this request, despite the evidence, discussed supra, that could have supported the charge, effectively directed a verdict of guilt. Justice Clifford thus makes too much of the defense counsel's \"ready acknowledgement\" of guilt; what else was defense counsel to do? Rather than substantiating the harmlessness of the prosecutor's remarks, defense counsel's summation, read in context, speaks eloquently of how harmful was the trial court's refusal to charge on the lesser-included offense. The jury's deliberations were co-opted; there was, as defense counsel recognized, nothing for the jury to decide:\n\nYou know that a finding of guilty of purposeful knowing murder forces us to go to a penalty phase where the alternatives are either life imprisonment . . . or the death penalty.\n\nIt's difficult for him to admit that, it's difficult for us to concede it and perhaps for you to accept it, to accept those will be the only options available to you. . . .\n\nViewed in this context, the prosecutor's guilt-phase remarks are the more egregious, for they reveal that his corruption of the statutory structure was as gratuitous as it was calculated. The only explanation for the prosecutor's behavior, after defense counsel's summation, is not that he was in zealous pursuit of a conviction -- that much had been conceded -- but that he was using the guilt-phase deliberation to condition the jury's penalty-phase sentence. This behavior is a clear violation of due process, and should be, like the wrongful deprivation of a peremptory challenge, reversible without regard to a showing of actual prejudice.\n\nIn State v. Ramseur, supra, 106 N.J. at 322-23, we admonished prosecutors that we would not hesitate to reverse capital convictions based on prosecutorial misconduct where that conduct\n\nis \"so egregious that it deprived defendant of a fair trial.\" This is such a case; the \"fairness\" of a trial depends not on the culpability of a defendant, for it seems obvious that the most guilty defendant can have a trial that was unfair; rather, the fairness of a trial must rest, particularly in capital cases, on the integrity of the procedures that safeguarded the trial. The instance noted demonstrates that the misconduct in this case did not begin with the penalty phase, but infected the entire proceeding and, indeed, made a mockery of the statutory scheme by insisting that jurors consider what made the crime aggravated even as they deliberated whether it was a crime at all. As Justice Clifford put it in State v. Koedatich, supra, 112 N.J. at 342: \"I see little hope of avoiding repetition of the deprivation of a fundamental constitutional right to a fair trial if we do no more than 'reiterate our warning . . .' that dire consequences may flow from [prosecutorial] violations. . . .\" Indeed, by virtually ignoring this instance of misconduct, the majority sends an entirely wrong signal. The defendant's conviction must be reversed.\n\nIII.\n\nIn this case, I find that serious errors have affected the weighing process that is critical in a jury's determination of whether the defendant lives or dies. The majority concludes quite soundly that there must be a reversal of the death sentences for errors infecting the jury's deliberation of penalty. I agree. In addition, I believe the weighing process was irretrievably distorted by improperly multiplying aggravating factors, and, further, by permitting the jury to consider and deliberate on an aggravating factor for which there was simply no evidential support.\n\nA.\n\nI have expressed, in prior cases, my view that the reliability of capital sentences is undermined by the potential for ostensibly\n\ndistinct aggravating factors to be based on identical evidence. See State v. Ramseur, supra, 106 N.J. at 392 n. 21; State v. Bey (II), supra, 112 N.J. at 155-163. The Court has rejected this argument, acknowledging the potential for prejudice but holding that so long as the jury is made aware \"that it is considering the same facts more than once, and [is made] cognizant that the same facts are being used to prove more than one aggravating factor,\" id. at 177, double counting is permissible.\n\nThe facts of this case illustrate the problem. The jury was instructed that it could find, among other factors, factor c(4)(f) (that \"the murder was committed for the purpose of escaping detection, apprehension,\" etc.) and factor c(4)(h) (\"The defendant murdered a public servant . . . while the victim was engaged in the performance of his official duties. . . .\"). Thus, the jury was allowed to find that the murder was aggravated both because defendant murdered to escape detection and because he murdered the person whose duty it was to detect him. Because the victim's \"performance of his official duties\" was, in fact, the \"detection\" from which defendant sought to escape, the two aggravating factors are not only overlapping but nearly identical; given the Court's acknowledgement of the potential prejudice, one wonders what the point is of allowing the jury even to consider both factors.\n\nWhile it is true, moreover, that there is \"a series of cases from other states\" allowing the submission of overlapping aggravating factors, it is not true, as the majority's analysis implies, that California is the only state to prohibit the submission of overlapping factors. Indeed, the case law on this point seems, if anything, evenly divided. While the majority cites cases from Georgia, Ohio, Maryland, and North Carolina that allow for the submission of overlapping factors, it is worth noting that, in addition to California, Alabama, Florida, and Nebraska prohibit the submission of overlapping factors. See, e.g., Cook v. State, 369 So. 2d 1251, 1256 (Ala.1979); Provence v. State, 337 So. 2d 783, 786 (Fla.1976) (prohibiting submission\n\nof both murder committed in course of robbery and murder committed for pecuniary gain because \"both subsections refer to the same aspect of the defendant's crime. . . . [O]ne who commits a capital crime in the course of a robbery will always begin with two aggravating circumstances against him. . . .\"); State v. Rust, 197 Neb. 528, 250 N.W. 2d 867 (1977). Furthermore, one justice from another state that has allowed the submission of overlapping aggravating factors has expressed misgivings. In Wiley v. State, 484 So. 2d 339, 351-52 (Miss.), cert. denied, 479 U.S. 906, 107 S. Ct. 304, 93 L. Ed. 2d 278, reh. denied, 479 U.S. 999, 107 S. Ct. 604, 93 L. Ed. 2d 604 (1986), Justice Robertson, who had endorsed the Mississippi Court's allowance of overlapping factors, departed from this view, stating:\n\n[N]o one doubts that the side with the largest number of \"circumstances\" has a practical advantage before the sentencing jury. . . . In the end, the fallacy of our rule is its failure to recognize that murders are aggravated by a defendant's conduct, not by statutory language. . . . A single legally indivisible act of the defendant may rationally aggravate a murder but once. [Id. at 358 (Robertson, J., concurring).]\n\nIt seems to me clear that the inevitable result of allowing the jury to consider both factors in this case is an artificial inflation by statutory language of the aggravating circumstances of the crime. The submission of separate factors carries with it the implication that each factor that is found escalates the degree of aggravation; why else would they be separate? One simply cannot separate, however, the reason for this defendant's conduct, the basis of one factor, from the performance of the officer's duty, the basis of the other. The defendant acted the way he did precisely because the officer was acting in the course of his duty. The distinction between motive and result is, therefore, entirely specious in the circumstances of this case.\n\nThe Court acknowledges (if it undersells) the potential for prejudice, but holds that this can be cured by a limiting instruction to the jury that will \"prevent it from giving undue weight to the number of factors. . . .\" Ante at 526 (quoting State v. Bey (II), supra, 112 N.J. at 177.) Try to imagine the effect of\n\nthis instruction from the perspective of a rational juror. This juror will be instructed that he or she will be conducting a weighing process, in which the jury will be asked to enumerate certain aspects of the crime deemed by the legislature to \"aggravate\" it; the inevitable implication of this task is that the degree of aggravation of the crime increases with the number of these presumably separate circumstances that are found to exist. This implication is undermined where the aggravating element underlying two factors is identical. The Court recognizes this, so the juror will now be instructed, in essence: \"Look. We want you to be aware that even though these two circumstances may exist, you have considered the same facts twice. You are allowed to do this, but we want you to know that you are doing it. Do not give those factors undue weight.\" A rational juror, confronted with this charge, may well wonder what is meant by \"undue weight.\" Does undue weight consist in giving the second factor any weight at all? Giving both full weight? Giving both three-quarters the weight each would have if considered alone? Giving one full weight and the other half? Does not the fact that there are two circumstances rather than one increase the degree of aggravation?\n\nThe inadequacy of the majority's hybrid instruction is patent. The \"undue weight\" is accorded automatically when the jury is allowed to find that this murder was aggravated both because defendant murdered to escape detection and because he murdered the person whose duty it was to detect him. The jury should not be allowed, on remand, to find both c(4)(f) and c(4)(h).\n\nB.\n\nThe jury's conduct of the weighing process was further corrupted by its consideration of an aggravating factor, c(4)(c), that was unsupported by the evidence. The majority appropriately concludes that because the sentence is being vacated, \"we\n\nneed not now definitively resolve the question whether the improper submission of an aggravating factor . . . necessarily constitutes reversible error.\" The Court's gratuitous analysis suggests, however, that because the jury's rejection of one aggravating factor \"neither compels nor inhibits its determination that another factor exists,\" our case of State v. Christener, 71 N.J. 55 (1976), is inapposite. I reject thisdictum.\n\nChristener stands for the proposition that it is reversible error to instruct the jury on a degree of a crime that is more serious than the evidence will support. This is so, the Court held, because \"[i]t must be assumed that the jury inferred by the giving of such an instruction that the elements of that charge were present in the case.\" Id. at 73. The majority has held that the aggravating circumstances in the capital-murder statute function, in narrowing the class of death-eligible defendants, as elements of the offense. State v. Ramseur, supra, 106 N.J. at 201 n. 27. Thus, to the extent that an aggravating circumstance is charged that is unsupported by the evidence, the very evil identified in Christener -- an artificial inflation of the elements that the jury is entitled to assume are present -- corrupts the deliberations. The majority's proffered distinction, moreover, that \"rejection of one factor neither compels nor inhibits its determination that another factor exists\" is unpersuasive. Given the jury's inference from the charge that the elements are present in the case, it seems likely that the greater the number of aggravating factors charged, the more likely the jury is to believe that at least some of those factors are present. This is precisely the kind of compulsion toward a jury's acceptance, in the interest of compromise, of an element it might otherwise have rejected that the Christener Court expressly held requires reversal. For this reason, the majority's dictum should be rejected.\n\nIV.\n\nMore than anything, the Court's result today reveals the corrosive effect of the death penalty on this State's general\n\ncriminal jurisprudence. Just as in State v. Koedatich the principle of a \"realistic likelihood of prejudice\" has been so distorted that a change of venue will now be virtually impossible to obtain, and just as in State v. Bey (II) the circumstances under which one can be said to have invoked the right to cut off questioning have been narrowed so that ambiguity is no longer sufficient, so in this case the \"low threshold\" of evidence required to support an instruction on a lesser-included offense has been raised considerably, the only record evidence of a defendant's motive has been declared irrelevant to his state of mind, the scope of what undisputablyinflammatory evidence is admissible as relevant to a defendant's state of mind is broadened substantially, and the scope of allowable prosecutorial comment is expanded so that the integrity of the statute is undermined.\n\nMy differences with the Court in this case, as in prior cases, reflect the fact that the Court has employed a more tolerant and less strict substantive standard for determining reversibility than is demanded in the direct appeal of capital-murder convictions. See, e.g., State v. Bey (I), 112 N.J. at 93-95 (an error is reversible if it has not produced an \"unjust result,\" R. 2:10-1, or if it does not appear beyond a reasonable doubt that the error contributed to the jury's guilty verdict, citing State v. Macon, 57 N.J. 325 (1971)). However, I believe that even under this substantive standard of reversible error there should be a reversal. Whether the result is \"unjust\" -- the imposition of a death sentence -- cannot be determined merely by a review of evidence. Moreover, I do not believe it can be concluded beyond a reasonable doubt that certain of the errors, discounted by the majority, did not contribute to the jury's verdict of guilty. The majority's result illustrates how elastic the standard for harmless error can become, and how easily courts can succumb, in capital cases, to the temptation to defer inappropriately to trial court judgments. It is for these reasons that I have advocated adoption of a clearly defined standard of review for capital cases.\n\nWe should, I submit, focus not on results in capital cases, but on the integrity of the procedures that produce them. Resultoriented tests such as \"harmless error\" call essentially for a quantification of evidence, a comparing and weighing of proper evidence with improper evidence to determine simply whether the former can satisfactorily account for and explain the jury's determination without the latter. The assumption of this test, perhaps well-grounded for the generality of criminal appeals, is that the jury's determination of guilt can be viewed as primarily the consideration and assessment of evidence, and only tangentially as the exercise of conscience. That assumption, I suggest, must be discarded in a capital-murder prosecution, the only proceeding in which the jury is not told that it should find the facts with no thought for the ultimate sentence.\n\nWhen the State insists that a criminal pay with his life, then it must fully, not begrudgingly, acknowledge and accept the jury as the conscience of the community. The evidence in a capital case is not, then, simply weighed and quantified, but rather sorted and seen through the prism that constitutes our collective community conscience. It is this insight of the jury's responsibility and deliberative function that impels us to adopt a more exacting standard for reversible error in capital cases. Our review should be one that answers the question of whether there was any realistic possibility that error had an adverse or detrimental influence on the deliberations of the jury. Such an effect or influence is one that can cloud the thinking, alter the feeling, or color the conscience of the jury. That alone should suffice to impugn a verdict for capital murder, not whether on some scale the error itself, in whole or part, could be said to have caused the verdict.\n\n\u003cspan class=\"fn\"\u003e1. Our reference to Buchanan v. Kentucky does not imply approval of the death-qualification process in a case involving a noncapital codefendant.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. During the penalty phase, Rose denied that he told Trooper Knight the shooting was accidental. Q. It's also not true when you told Sergeant Knight from the State Police that you shot the policeman by accident, Officer Garaffa by accident. That wasn't the truth either, was it? A. I never said accidental. Q. That hammer didn't apparently cock by accident, did it? A. No. Q. You cocked it. A. Yes. Q. You pulled this hammer back, right, didn't you pull it back? It's kind of tough to pull back, isn't it? A. No. Q. Not for you but you pulled it back, you cocked it, right? A. Yes. Q. Right before you pulled the trigger and shot Officer Garaffa in the stomach? A. Yes. Q. So when you told Sgt. Knight that it apparently cocked, that wasn't true, was it? A. No, I never said that. Q. So he's lying when he said you said that? A. He might have misquoted something.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. We also note that during the penalty phase of the trial defendant's expert witness, Dr. Leah Lapidus, testified that defendant tended to experience \"massive confusion [and] commotion\" in stressful situations. She expressed the opinion that when defendant was confronted by Officer Garaffa, he experienced \"a kind of overwhelming panic, loss of control,\" that resulted in the shooting. Dr. Lapidus's testimony was offered to support the existence of one of the statutory mitigating factors, 2C:11-3c(5)(a), which provides: The defendant was under the influence of extreme mental or emotional disturbance insufficient to constitute a defense to prosecution. As noted above, after considering all of the evidence in the penalty phase, the jury found that defendant had proved the existence of this mitigating factor.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. At oral argument, defense counsel asserted that it was inconsistent and unconscionable for the State to offer evidence of defendant's state of mind in the guilt phase of the case to prove that the homicide was knowing or purposeful, while simultaneously contending that there was insufficient evidence to warrant a lesser-included offense charge of manslaughter. We find no inconsistency in the State's position. Defendant's state of mind was put in issue during defense counsel's opening argument in the guilt phase. In any event, it was incumbent on the State to prove that the murder was knowing or purposeful. Its attempt to discharge that responsibility did not preclude the State from taking the position, at the close of the guilt phase, that the evidence adduced was insufficient to provide a rational basis for a jury verdict of manslaughter.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. In his opening statement, defense counsel Marucci stated: One of the things that * * * might be critical to your decision as to whether Teddy lives or dies is * * * whether he deliberately, intentionally with premeditation * * * and with an evil mind shot and killed Officer Garaffa. [Y]ou will see that Teddy shot Officer Garaffa in an instantaneous act of fear and panic.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. At one point in his opening statement, defense counsel noted that defendant \"knew that the gun he had was illegal\" and also conceded that defendant, using the shotgun, \"shot and killed Officer Garaffa.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Justice Handler adverts to an excerpt from the prosecutor's summation in the guilt phase, contending that it constituted prosecutorial misconduct and requires reversal of defendant's convictions. Post at 570-574. We agree that the comment was improper but conclude that it was not clearly capable of producing an unjust result. R. 2:10-2.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Defendant's points of contention that apply to both the guilt and penalty phases will be discussed in this portion of the opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The extract from the Irvington Mental Health Center notation of July 1, 1982, to which the prosecutor obviously referred, read in part as follows: \"Girlfriend called me names. I threw my boots at her and hit her. After it happened, it was like it didn't happen. When I hit, it's like expressing myself. Why doesn't she do things my way?' (Emphasis added.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. On two occasions during the guilt phase, the prosecutor attempted to elicit testimony concerning Teddy Rose's conduct and statement in connection with the schoolyard incident in which he pointed the shotgun at a number of black youths and said \"I should blow their fucking heads off.\" During the direct testimony of Paul Palermo the trial court, after an offer of proof by the prosecutor, ruled that the statement may have some relevance but whatever relevance it may have is \"substantially outweighed by a prejudicial effect,\" and ruled that the statements were inadmissible. Subsequently, during the testimony of Nicholas Silva the prosecutor was seeking clarification as to the extent to which he could elicit testimony concerning the schoolyard incident and confirmed his understanding that the trial court had previously ruled that defendant's statement was inadmissible. The prosecutor commented: \"I understand you don't want me to bring that out, bringing the gun out and pointing it at the black kids saying, 'I should have blown their fucking heads off.' That's what I assume you don't want to come in consistent with other rulings.\" In response, the court stated: \"That's the only thing that I knew there was attempt to bringing in.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. We note that the United States Supreme Court has held that the federal constitution \"does not prohibit consideration at the sentencing phase of information not directly related to either statutory aggravating or statutory mitigating factors as long as that information is relevant to the character of the defendant or the circumstances of the crime.\" Barclay v. Florida, 463 U.S. 939, 967, 103 S. Ct. 3418, 3433, 77 L. Ed. 2d 1134, 1154 (1983). Some states specifically permit jury consideration of aggravating or mitigating factors other than those set forth by statute. See Gregg v. Georgia, 428 U.S. 153, 197, 96 S. Ct. 2909, 2936, 49 L. Ed. 2d 859, 888 (1976).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Defense counsel moved before trial for an order declaring aggravating factor c(4)(c) unconstitutional on its face. The trial court denied this motion. At this same hearing, defendant moved for a bill of particulars relating to this factor, asking that the prosecutor specify which of defendant's alleged acts constituted torture, depravity of mind, or an aggravated battery to the victim. The trial court also denied this motion, observing that \"there shouldn't be any question, as to the facts upon which they're relying to show the presence of aggravating factor (4)(C).\" Defense counsel then argued the inapplicability of aggravating factor c(4)(c) based on the discovery thus far provided by the State. While acknowledging the possibility that there may be no basis to present the factor by the time the case reached the penalty phase, the court determined that \"at this point defendant has not met a burden of showing the proof is clearly lacking to support the presence of these aggravating factors,\" (citing State v. McCrary, 97 N.J. 132 (1984)). Just prior to the commencement of the penalty phase, defense counsel moved to strike aggravating factor c(4)(c), contending that no evidence was presented in the case that would indicate the applicability of this factor. The trial court denied this motion, citing as evidence justifying this factor \"the manner in which the weapon was pointed at the officer, the stomach area, the type of a weapon that was used, [and] the number of pellets involved.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. There is no intimation in the Commentary that the \"motives for risk,\" such as panic, must be codified, as the majority argues, ante at 484, to be relevant to a defendant's state of mind; indeed, the Commentary's conclusion that such \"motives for risk creation may be infinite in variation\" suggests that such motives, while relevant to \"recklessness,\" are not susceptible of codification.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The same legislation also clarified the scope of knowing murder by adding the \"serious bodily injury\" language. Thus, \"practical certainty\" was expressly made applicable to more than just death; the \"serious bodily injury\" language extends its applicability to injury carrying a \"substantial risk of death\" -- the precise scope of aggravated manslaughter.\u003c/span\u003e\n\n",
    "body_length": 241251,
    "citedas": [
      "548 A.2d 1058",
      "112 N.J. 454"
    ],
    "attorneys": "Matthew Astore, Deputy Public Defender, II, and Patricia A. Kern, Designated Counsel, argued the cause for appellant (Alfred A. Slocum, Public Defender, attorney). Hilary L. Brunell, Assistant Prosecutor, argued the cause for respondent (Herbert H. Tate, Jr., Essex County Prosecutor, attorney; Hilary L. Brunell, Elizabeth A. Duelly, Marc J. Friedman, Frederick Gerson, Virginia M. Lincoln, Donald J. Sears, Assistant Essex County Prosecutors, on the brief). Leslie Faye Schwartz, Deputy Attorney General, argued the cause for amicus curiae, Attorney General (W. Cary Edwards, Attorney General of New Jersey, attorney).",
    "category": [
      "36",
      "78",
      "75"
    ],
    "judges": "For affirmance of convictions and reversal of sentence; remand -- Justices Clifford, Pollock, Garibaldi and Stein. For reversal of convictions and sentences; remand -- Chief Justice Wilentz and Justices Handler and O'Hern. The opinion of the Court was delivered by Stein, J. Clifford, J., concurring. Wilentz, C.J., concurring in part, dissenting in part. Handler, J., dissenting. Justice O'Hern joins in Part II of this opinion. Chief Justice Wilentz joins in the majority opinion on the penalty phase but has filed a separate dissenting opinion on the guilt phase. Justice O'Hern joins in the majority opinion on the penalty phase, but joins in Part II of Justice Handler's dissenting opinion in respect of the guilt phase.",
    "citation_count": 128
  }
}
