{
  "id": "Ja-DS2YBTlTomsSB-c10",
  "document": {
    "title": "06/26/41 TUCKER ET AL. v. STATE INDIANA",
    "full_title": "TUCKER ET AL. v. STATE OF INDIANA",
    "jurisdiction": "Indiana Supreme Court",
    "date": "1941-06-26T00:00:00.000Z",
    "docket": "No. 27,547.",
    "body": "FANSLER, C.J. This is an action instituted by the Attorney General on behalf of the State of Indiana against the appellants and the appellee Henry F. Schricker as Governor of the State of Indiana, seeking to enjoin the defendants from acting or functioning under certain Acts of the 82nd General Assembly of the State of Indiana (1941 Session). There was a temporary injunction, the issuing of which is assigned as error on this appeal.\n\nBy an original action, the jurisdiction of the trial court over the subject-matter was questioned, and we held that the court had jurisdiction. State ex rel. Dawson, Lieutenant Governor, et al. v. Marion Circuit Court et al. (1941), ante p. 451, 33 N.E.2d 515.\n\nIf the statutes involved are unconstitutional they are void and confer no legal authority upon those in whom it is sought to vest control over a major portion of the state's business. That an attempt upon the part of such persons to control and manage the state's property and business affairs without legal authority would be injurious and damaging to the state's business and property rights cannot seriously be doubted. The substantial question involves only the constitutionality of the questioned statutes. If they are constitutional it was error to grant the temporary injunction. If they are unconstitutional the injunction was properly granted and should be made permanent.\n\nThe complaint sets out five separate statutes which are alleged to be unconstitutional. One of these is\n\namendatory of another, so that in fact there are but four statutes involved.\n\nChapter 13 (Acts 1941, p. 31, § 60-134 et seq., Burns' 1933 [Supp.], § 14974-1 et seq. Baldwin's Supp. 1941), provides for the termination of the tenure of office or employment of every officer or member of a board or commission, and every employee or servant within the scope of the act, exclusive of the State Police personnel below the rank of superintendent, the Unemployment Compensation Division below the rank of director, and the State Board of Health below the rank of secretary, upon the taking effect of the act.\n\nIt is provided that the Governor shall have jurisdiction over, and to appoint and remove, members of the boards and commissions in charge of or functioning in connection with the following enumerated matters:\n\n\"(1) The land and naval militia, including the office of Adjutant General, the Armory Board, the Board of Control of State Soldiers' and Sailors' Monument, the Battle Flags Commission, the Grand Army of the Republic, the United Spanish War Veterans, and the Veterans of Foreign Wars;\n\n\"(2) State Commission on Clemency;\n\n\"(3) State Probation Department, including State Probation Commission;\n\n\"(4) State Fire Marshal;\n\n\"(5) State police department; subject, however, to any provision in any act passed at the eighty-second session of the General Assembly of the State of Indiana providing for the appointment of members of the state police board and of the personnel of the state police department.\"\n\nThe act then provides:\n\n\"There are hereby created and established the following administrative departments:\n\n\"(1) Department of state;\n\n\"(2) Department of audit and control;\n\n\"(3) Department of treasury;\n\n\"(4) Department of public works and commerce.\"\n\nThe Department of State is placed in charge of a board consisting of the Secretary of State, who is named as the chief administrative officer of the department, the Governor, and Auditor of State. The following enumerated boards, commissions, offices, and agencies are placed in charge of the Department of State:\n\n\"(1) Administration of Motor Vehicle Laws on Registration, certificates of title, and Operators' and Chauffeurs' licenses.\n\n\"(2) Board of Registration for Architects;\n\n\"(3) State Board of Barber Examiners;\n\n\"(4) State Board of Beauty Culturist Examiners;\n\n\"(5) Indiana Library and Historical Department, including State Library and Historical Bureau;\n\n\"(6) Legislative Bureau;\n\n\"(7) Commission on Public Records;\n\n\"(8) State Board of Canvassers;\n\n\"(9) State Board of Dental Examiners;\n\n\"(10) State Board of Embalmers and Funeral Directors;\n\n\"(11) State Board of Registration for Professional Engineers and Land Surveyors;\n\n\"(12) State Board of Medical Registration and Examination;\n\n\"(13) The Indiana State Board of Examination and Registration of Nurses;\n\n\"(14) Indiana State Board of Registration and Examination in Optometry;\n\n\"(15) Board of Podiatry Examiners;\n\n\"(16) Reciprocity Commission;\n\n\"(17) State Live Stock Commission;\n\n\"(18) Indiana Board of Pharmacy;\n\n\"(19) Indiana State Board of Examiners in Watch Repairing;\n\n\"(20) Veterinary Examining Board;\n\n\"(21) The Stallion Enrollment Board.\"\n\nIt is provided that no powers and functions accorded to the Secretary of State individually, or the duties imposed upon him individually by statute, or his powers and duties as Securities Commissioner, shall be within the Department of State, but shall be exercised and performed by the Secretary of State individually. It is assumed that this means that he shall exercise these nonincluded powers as Secretary of State.\n\nThe Department of Audit and Control is placed in charge of a board consisting of the Auditor of State, who is named as the chief administrative officer of the department, the Governor, and Secretary of State. The following enumerated boards, commissions, offices, and agencies are placed in charge of the Department of Audit and Control:\n\n\"(1) Bureau of Public Printing;\n\n\"(2) Department of Insurance;\n\n\"(3) The Indiana State Teachers' Retirement Fund;\n\n\"(4) State Budget Committee;\n\n\"(5) Chief Oil Inspector;\n\n\"(6) State Athletic Commission;\n\n\"(7) State Board of Certified Accountants of Indiana;\n\n\"(8) The Indiana Year Book;\n\n\"(9) Gross Income Tax, including Director;\n\n\"(10) Motor Vehicle Fuel Tax.\"\n\nIt is provided that no powers and functions accorded to the Auditor of State individually shall be included, which is assumed to be intended as having the same effect as the provisions concerning the Secretary of State.\n\nThe Department of Treasury is placed in charge of a board consisting of the Treasurer of State, who is named as the chief administrative officer of the department, the Governor, and the Lieutenant Governor. The following enumerated boards, commissions, offices, and agencies are placed in charge of the Department of Treasury:\n\n\"(1) Inheritance Tax Administrator;\n\n\"(2) Unemployment Compensation Division, including Indiana State Employment Service;\n\n\"(3) State Board of Tax Commissioners;\n\n\"(4) The Department of Financial Institutions;\n\n\"(5) Board for Depositories;\n\n\"(6) Municipal Loan Board;\n\n\"(7) Division of State Publicity.\"\n\nThere is a provision concerning the powers and functions of the Treasurer of State similar to that in the case of the Secretary and Auditor of State.\n\nThe Department of Public Works is placed in charge of a board consisting of the Lieutenant Governor, who is named as the chief administrative officer, the Governor, and the Treasurer of State, charged with the administration of the following enumerated agencies:\n\n\"(1) Department of Conservation;\n\n\"(2) State Highway Commission;\n\n\"(3) Board of Public Buildings and Property;\n\n\"(4) State Memorials, including Trustees of the Indiana World War Memorial, George Rogers Clark Memorial Commission, New Harmony Memorial Commission, The Anthony Wayne Memorial Commission;\n\n\"(5) Division of Labor, including Industrial Board, Bureau of Mines and Mining, Bureau of Factory Inspection, Bureau of Boiler Inspection, and Bureau of Women and Children;\n\n\"(6) State Livestock Sanitary Board;\n\n\"(7) Pollution Hearing Board;\n\n\"(8) Indiana Wolf Lake Park Commission;\n\n\"(9) Central Purchase Bureau of Indiana;\n\n\"(10) The State Board of Health;\n\n\"(11) Public Service Commission of Indiana;\n\n\"(12) The Indiana Board of Public Harbors and Terminals.\"\n\nThere is a provision that no powers or functions accorded to the Lieutenant Governor individually shall be included in this department.\n\nIt is provided that any proceeding, or other business, or matter, undertaken or commenced \"by any division of the Executive including the Administrative Department of the State of Indiana,\" the powers, duties, and functions of which are assigned to these boards, may be conducted and completed by the department to which it is assigned.\n\nIt is further provided:\n\n\"Whenever any division of the Executive, including the Administrative Department of the State of Indiana, whether the same be a person, body, or organization of whatsoever character, is referred to or designated in any law, contract, or document, such reference or designation shall be deemed to refer to and include the department organized hereunder to which the powers, duties and functions thereof are hereby assigned and transferred or the appropriate authority therein, so far as such law, contract or document pertains to matters which are by reason of such assignment and transfer placed by the terms of this act within the supervision and jurisdiction of the department to which such assignment and transfer is made.\n\n\"The several boards of departments created hereby, each in its particular department, shall have full power and authority to adopt and amend from time to time\n\nsuch rules or procedure as will expedite and assist the transaction of business before the department, the same including the adoption and amendment of such forms for records or matters of procedure as are not contrary to any law of the State of Indiana. They shall have power to fix, modify, or change the compensation of any officer, employee or servant in their respective departments, subject to the limitations established by law; and they may establish merit systems and promulgate administrative rules for the purpose of expediting and making more efficient the work of the several divisions within their respective departments. To that end, the several boards of departments shall have general supervision over their respective departments, but only in accordance with Section 5 hereof and with other applicable provisions of this or any other law of the State of Indiana.\"\n\nIt is provided: \"The governor and lieutenant governor, in addition to their respective powers and duties provided for by the Constitution, shall, except as is otherwise provided in this or any other act passed in this session of the General Assembly, each continue to have all of the powers and duties heretofore or hereafter conferred upon them . . .\"\n\nIt is further provided: \"The respective boards of the separate administrative departments created in this act are hereby empowered to appoint, for terms of four (4) years each or for shorter terms if authorized by any law that may be in force after this act takes effect, and remove for causes hereinafter provided, all members of all boards or commissions and all administrators, directors, and officers who are by law directly charged with the administration of the offices or matters which are by this act assigned and transferred to and placed under the said respective departments. Removal by any\n\nsuch board of department of any member of a subordinate board or commission or of any officer, administrator, or director by this act assigned to such department shall be only upon grounds of ineligibility, incompetency, inefficiency or of neglect of duty, and shall be made only after the person affected shall have been accorded a hearing upon a written charge. Except as may be otherwise provided in any law or laws heretofore or hereafter enacted providing for a merit system, such subordinate board, commissions, officers, administrators or directors thus appointed by a board of department are themselves hereby empowered to appoint, subject to the approval of such board of department, and to dismiss at will all officers and employees who are their subordinates, but said last mentioned class of officers and employees shall not be subject to appointment or dismissal by such board of department itself.\"\n\nIt is asserted in the complaint that this statute seeks to wrest from the Governor all executive authority within \"the executive including the administrative\" department of the government, except in respect to the minor agencies which are expressly delegated to his supervision, and that it is therefore void and in derogation of certain constitutional provisions referred to in the complaint, and which will be hereafter referred to and discussed.\n\nChapter 108 (Acts 1941, p. 291, § 49-1919n., Burns' 1933 [Supp.], § 15074n., Baldwin's Supp. 1941), abolishes the office of Attorney General. Chapter 109 (Acts 1941, p. 292, § 49-1919 et seq., Burns' 1933 [Supp.], § 15074, Baldwin's Supp. 1941), establishes the office of Attorney General, the first incumbent to be elected at the general election in the year 1942, and provides that in the interim the Governor, Lieutenant Governor, and Secretary of State will constitute a board for the purpose\n\nof employing an attorney for the state, such attorney when employed to be designed as \"the attorney general of Indiana,\" the employment to continue until the elective Attorney General has qualified. It is provided that the new elective Attorney General shall receive a salary of $7,500 per year; that the salary of the first deputy shall be $5,000 per year; and that the salary of the second deputy shall be $3,600 per year; \"the salaries of such other deputies, assistants, clerks, and stenographers as may be appointed by him shall be in such reasonable amounts as he may fix and determine, but not exceeding the total amount to be appropriated therefor.\" It is provided that he shall have such deputies, assistants, clerks, and stenographers as he may deem necessary. The new elective Attorney General is given \"all of the rights, powers and duties heretofore conferred by any law or laws upon the attorney general as created by Chapter LXXI of the Acts of the General Assembly of 1889.\" It is provided that, in addition thereto, the newly elected Attorney General shall: \"(a) Consult with and advise the several prosecuting attorneys of the state in relation to the duties of their office; and when, in his judgment, the interest of the public requires it, he shall attend the trial of any party accused of crime, and assist in the prosecution; and (b) represent the State of Indiana in any matter involving the rights or interests of the state, including actions in the name of the State of Indiana, for which provision is not otherwise made by law.\"\n\nConcerning the duties of the interim Attorney General, it is provided: \"The attorney general of Indiana so selected and employed for and during said interim period shall advise all state officers, boards and commissions on legal matters and shall, except as may be otherwise provided by law, himself or by assistant or\n\ndeputy, represent and act as attorney for the state and state officers, boards and commissions in the courts of this state in any action or appeal to which the state or any state officer, board or commission is a party; he may employ such assistants, deputies and employees as may be necessary to enable him properly to do said work and may fix their respective salaries in amounts not exceeding, however, the amounts specified in Section 5 of this act; his salary shall be at the rate of seventy-five hundred dollars ($7,500) per annum; he shall not be required to take an oath, but shall give and file with the treasurer of state, to the treasurer's approval, a surety company bond in the amount of forty thousand dollars ($40,000), payable to the state, and conditioned upon his faithful accounting to the state of any moneys of the state coming in his hands; he shall be entitled to immediate possession of the rooms, records, books, papers, furniture, equipment and other matters heretofore belonging or appertaining to the office of attorney general or to the Department of Law, and he shall have a right to bring and maintain in his name in the superior or circuit court of Marion county a possessory action to obtain possession thereof.\" All funds appropriated for the Attorney General or the Department of Law, remaining undisposed of, are expressly assigned and transferred to, and appropriated for the use and benefit of, the interim Attorney General for the payment of himself, deputies, and assistants, and the operating expenses of his office; and the Auditor and Treasurer of State are directed to honor vouchers when drawn and approved by him.\n\nThe statutes concerning the Attorney General are charged in the complaint to be unconstitutional for the reasons: (1) That the repeal of the old law and the setting up of an interim Attorney General and an elective\n\nAttorney General is but a subterfuge to remove the acting Attorney General from office; (2) that if in fact an old office has been abolished and new ones created, the interim Attorney General is a state officer; that the appointment of the officer involves an exercise of executive power, and that, under the Constitution this power is vested solely in the Governor.\n\nChapter 182 (Acts 1941, p. 552, § 28-401, Burns' 1933 [Supp.], § 5906, Baldwin's Supp. 1941), concerns the State Board of Education. It amends a former act by abolishing the old State Board of Education, sets up a new board of eight members, four to be appointed by the Governor and four to be appointed by the Lieutenant Governor, except in case where the Governor and Lieutenant Governor are both of the same political party, in which case the Governor shall appoint all of the members. The objection to this act is that power to appoint these board members is executive, and the Constitution vests the executive power exclusively in the Governor.\n\nThe objection made to these statutes, and the contentions and arguments of the parties respecting the powers vested in the Governor by the Constitution, and the discretion vested in the Legislature to provide for the appointment to office, require an exhaustive consideration of the governmental structure as established by the Constitution.\n\nIt was said by Elliott, C.J., speaking for this court, in State ex rel. Hovey v. Noble et al. (1889), 118 Ind. 350, 353, 21 N.E. 244, 245, 10 Am. St. Rep. 143, 4 L.R.A. 101, that:\n\n\". . . written constitutions are the product of deliberate thought. Words are hammered and crystallized into strength, and if ever there is power in words it is in the words of a written constitution. Behind the words is the power of a free people\n\noperating through the medium of a constitutional convention, called together for the purpose of framing a fundamental and inviolable system of government. Of all governmental instruments it is the most solemn and powerful. Its grants are unalterable, its delegations of power unchangeable and its commands supreme. Until the people themselves shall change or annul their constitution, all must obey its mandates.\"\n\nWriters upon government and constitutions have invariably expressed the same thought concerning the force and solemnity of constitutions and the words and phrases in which they are drawn, and it cannot be doubted that the delegates who made up the Convention that drafted our Constitution, able and scholarly men, approached their task with a full appreciation of its importance, and not without a study of the principles of constitutional government and the opinions of scholars and statesmen concerning the force and effect of constitutional provisions.\n\nIt has been said that:\n\n\"As a reader studies the printed speeches delivered at the state constitutional convention (of 1851) the Conclusion draws upon him that the men who framed the present state constitution were probably the most resourceful men ever assembled in Indiana. They were learned in the law, history, achievements, ambitions, aims, hopes, and aspirations of genuine Hoosiers. They had been students and readers of the great men of the past, of the conventions and constitutions of other states and countries, and the history and progress made thereunder.\" Biographical Sketch of Judge James Lockhart, a delegate to the Constitutional Convention from Vanderburgh County, by George R. Wilson, Indiana Historical Society Publications, Vol. 8, No. 1, p. 22 (1923).\n\nKent's Commentaries, the work of the scholarly Chancellor Kent (5th Ed., 1844), was a standard law\n\nbook, and, together with Justice Story's Commentaries on the Constitution of the United States, published in 1833, was found in almost every law library. The Discussions and debates concerning our Federal Constitution, and the views of the great statesmen who participated in drafting it, were available, together with the Discussions in the first Congress of the United States under the new Constitution in which the opinions of respected authorities were expressed as to the effect and meaning of constitutional provisions; and there are indications that the framers of our Constitution were aided in their endeavors by a study of these authoritative sources.\n\nIntelligent, able, scholarly men, embarking upon the drafting of a charter of government, with grants unalterable, delegations of power unchangeable, and commands supreme, would seek to create a harmonious and consistent plan, free from conflicting and contradictory provisions, and steadfastly adhering to dominant principles. In examining isolated provisions and determining their meaning, and entire plan of government must be considered. We must attribute to the framers an intention to construct the instrument as a consistent whole, without contradictory provisions at cross-purposes, and we must attribute to the separate provisions a meaning consistent with such an intention, if that is possible.\n\nIn Section 1 of Article 1 of the Constitution of Indiana it is declared \"that all power is inherent in the People; and that all free governments are, and of right ought to be, founded on their authority . . .\"\n\nArticle 2 deals with elections, and, together with many other express provisions, indicates that some part of the sovereign function of selecting officers in the government was reserved to the people.\n\nSection 1 of Article 3 provides:\n\n\"The powers of the Government are divided into three separate departments; the Legislative, the Executive including the Administrative, and the Judicial; and no person, charged with official duties under one of these departments, shall exercise any of the functions of another, except as in this Constitution expressly provided.\"\n\nSince the powers of the government are expressly granted and vested not in the departments, but to specific agencies within the departments, and, since the provisions are to be read together, the purpose of this provision is to divide the government into departments, and to prohibit persons charged with duties in one department from functioning in another.\n\nIn Lafayette, Muncie, and Bloomington R.R. Co. et al. v. Geiger (1870), 34 Ind. 185, 197, this court said:\n\n\"The same division of powers exists in the federal constitution, and in most, if not all, of the state constitutions, and is essential to the maintenance of a republican form of government.\"\n\nIn Humphrey's Executor v. United States (1935), 295 U.S. 602, 629, 55 S. Ct. 869, 874, 79 L. Ed. 1611, 1620, it is said:\n\n\"The fundamental necessity of maintaining each of the three general departments of government entirely free from the control or coercive influence, direct or indirect, of either of the others, has often been stressed and is hardly open to serious question.\"\n\nIn State ex rel. Hovey v. Noble et al., supra, it is said (page 354 of 118 Ind., page 246 of 21 N.E.):\n\n\"There is more than a mere theoretical separation, or else words are powerless and constitutions mere empty fulminations.\"\n\nThe construction placed upon the various clauses of this section are nowhere disputed, but everywhere concurred in.\n\nSection 1 of Article 4 provides:\n\n\"The Legislative authority of the State shall be vested in the General Assembly, which shall consist of a Senate and a House of Representatives.\"\n\nSection 1 of Article 5 provides:\n\n\"The executive power of the State shall be vested in a Governor.\"\n\nSection 1 of Article 7 provides:\n\n\"The judicial power of the State shall be vested in a Supreme Court, in Circuit Courts and such other courts as the General Assembly may establish.\"\n\nThe legislative power is vested not in a department, but in the General Assembly; the judicial power is vested not in the judicial department, but in the courts; and the executive power is vested not in the \"Executive including the Administrative\" department, but in one man, one officer, the Governor. It is noted that while an administrative department is mentioned and made a part of the executive department, there is also an administrative department established within the judicial department, consisting of the Clerk of the Supreme Court; and the provision for publishing the Supreme Court Reports brought the creation of the office of Reporter. These are administrative offices within the department.\n\nConcerning a suggestion like that of appellants in the brief, that the power which the Governor has had, and will exercise if these statutes are held unconstitutional, is autocratic and czar-like, that it is too much power, it was said by Chief Justice Taft in Myers, Adm'x, v.\n\nUnited States (1926), 272 U.S. 52, 123, 47 S. Ct. 21, 27, 71 L.Ed. 160, 169:\n\n\"Underlying such fears was the fundamental misconception that the President's attitude in his exercise of power is one of opposition to the people, while the Congress is their only defender in the Government, and such a misconception may be noted in the Discussions had before this Court. This view was properly contested by Mr. Madison in the Discussion (1 Annals of Congress, 461), by Mr. Hartley (1 Annals, 481), by Mr. Lawrence (1 Annals, 485), and by Mr. Scott (1 Annals, 533). The President is a representative of the people just as the members of the Senate and of the House are, and it may be, at some times, on some subjects, that the President elected by all the people is rather more representative of them all than are the members of either body of the Legislature whose constituencies are local and not countrywide; and, as the President is elected for four years, with the mandate of the people to exercise his executive power under the Constitution, there would seem to be no reason for construing that instrument in such a way as to limit and hamper that power beyond the limitations of it, expressed or fairly implied.\"\n\nBut if the Constitution has vested the Governor with sole and exclusive jurisdiction and authority to exercise those powers, the remedy, if they are too large, is to amend the Constitution.\n\nThe question of centralization of the executive power in constitutional government had been often considered and much discussed before our Constitution was drawn. In Rome and in the early French Republic the executive power was in a committee. A multiple executive was proposed and rejected in the convention that framed the Federal Constitution. Chancellor Kent had said (Kent's Commentaries on American Law, 1844, 5th Ed., Vol. 1, pages 270, 271, 272):\n\n\"(1.) By the constitution, it is ordained, that the executive power shall be vested in a president.\n\n\"The object of this department is the execution of the law; and good policy dictates that it should be organized in the mode best calculated to attain that end with precision and fidelity. . . . The characteristical qualities required in the executive department, are promptitude, decision and force; and these qualities are most likely to exist when the executive authority is limited to a single person, moving by the unity of a single will. . . . Every government, ancient and modern, which has been constituted on different principles, and adopted a compound executive, has suffered the evils of it; and the public interest has been sacrificed, or it has languished under the inconveniences of an imbecile or irregular administration. In those states which have tried the project of executive councils, the weakness of them has been strongly felt and strikingly displayed; and in some instances in which they have been tried, (as in Pennsylvania and Georgia,) they were soon abandoned, and a single executive magistrate created, in accordance with the light afforded by their own experience, as well as by the institutions of their neighbors.\n\n\"Unity increases not only the efficacy, but the responsibility of the executive power. Every act can be immediately traced and brought home to the proper agent. There can be no concealment of the real author, nor, generally, of the motives of public measures, when there are no associates to divide, or to mask responsibility. . . . The eyes of the people will be constantly directed to a single conspicuous object; and, for these reasons, De Lolme considered it to be a sound axiom of policy, that the executive power was more easily confined when it was one. 'If the execution of the laws,' he observes, 'be intrusted to a number of hands, the true cause of public evils is hidden.Tyranny, in such states, does not always beat down the fences that are set around it, but it leaps over them. It mocks the efforts of the people, not because it is invincible, but because it is unknown.' The justness of these reflections might be illustrated and confirmed, by a review of the proceedings of the former council of appointment in New-York, under the constitution of 1777. All efficient responsibility\n\nwas there lost, by reason of the constant change of the members, and the difficulty of ascertaining the individual to whom the origin of a bad appointment was to be attributed.\"\n\nMany authorities on constitutional government had weighed the advantages of single or multiple executives, and we cannot doubt that the framers of our Constitution deliberately made choice in the matter.\n\nAt the time our Constitution was adopted it was settled by the great weight of authority that the provision granting the executive power and the admonition to take care that the laws are faithfully executed carried with them as a necessary and essential incident the power to appoint to office. Dissent there had been, but it must have been supposed that the grants would be interpreted to have the meaning attributed to them by the great weight of authority, and not the meaning unsuccessfully contended for by a minority. If it had been intended to grant less power, surely they would not have used words almost universally construed as granting more. But that it was intended to give the Governor not less but more power is indicated by the elimination of the provision for approval of appointments by the Senate found in the Federal and our former State Constitutions.\n\nWe quoted again from Chancellor Kent (page 287 of Kent's Commentaries on American Law):\n\n\"The appointment of the subordinate officers of government concerned in the administration of the law, belongs with great propriety to the president, who is bound to see that the laws are faithfully executed, and who is generally charged with the powers and responsibility of the executive department. The association of the senate with the president in the exercise of this power, is an exception to the general delegation of executive authority; and if he were not expressly invested with the exclusive right of nomination in the instances before\n\nus, the organization of this department would be very unskilful, and the government degenerate into a system of cabal, favouritism and intrigue. But the power of nomination is, for all the useful purposes of restraint, equivalent to the power of appointment. It imposes upon the president the same lively sense of responsibility, and the same indispensable necessity of meeting the public approbation or censure. This, indeed forms the ultimate security that men in public stations will dismiss interested considerations, and act with a steady, zealous and undivided regard for the public welfare.\n\n\"The advice and consent of the senate, which are requisite to render the nomination effectual, cannot be attended, in the nature of the case, with very mischievous effects. Having no agency in the nomination, nothing but simply consent or refusal, the spirit of personal intrigue and personal attachment must be pretty much extinguished, from a want of means to gratify it. On the other hand, the advice of so respectable a body of men will add still further inducements to a coolly reflected conduct in the president, and will be at all times a check on his own misinformation or error.\"\n\nMr. Justice Story had said:\n\n\"Those who are accustomed to profound reflection upon the human character and human experience will readily adopt the opinion that one man of discernment is better fitted to analyze and estimate the peculiar qualities adapted to particular offices than any body of men of equal or even of superior discernment. His sole and undivided responsibility will naturally beget a livelier sense of duty and a more exact regard to reputation. He will inquire with more earnestness and decide with more impartiality. He will have fewer personal attachments to gratify than a body of men; and will be less liable to be misled by his private friendships and affections; or at all events, his conduct will be more open to scrutiny, and less liable to be misunderstood. If he ventures upon a system of favoritism he will not escape censure, and can scarcely avoid public detection and disgrace. But in a public body appointments will be materially\n\ninfluenced by party attachments and dislikes, by private animosities, and antipathies, and partialities, and will be generally founded in compromises, having little to do with the merit of candidates, and much to do with the selfish interests of individuals and cabals. They will be too much governed by local, or sectional, or party arrangements. A President chosen from the nation at large may well be presumed to possess high intelligence, integrity, and sense of character. He will be compelled to consult public opinion in the most important appointments; and must be interested to vindicate the propriety of his appointments by selections from those whose qualifications are unquestioned and unquestionable. If he should act otherwise, and surrender the public patronage into the hands of profligate men or low adventurers, it will be impossible for him long to retain public favor. Nothing -- no, not even the whole influence of party -- could long screen him from the just indignation of the people. Though slow, the ultimate award of popular opinion would stamp upon his conduct its merited infamy. No President, however weak or credulous (if such a person could ever, under any conjuncture of circumstances, obtain the office), would fail to perceive or to act upon admonitions of this sort. At all events, he would be less likely to disregard them than a large body of men, who would share the responsibility and encourage each other in the division of the patronage of the government.\" Story's Commentaries on the Constitution of the United States (1891), 5th Ed., Vol. 2, § 1529, p. 352.\n\nIn Myers, Adm'x, v. United States, supra, Chief Justice Taft reviewed at length the opinions of the great statesmen who assisted in drafting the Federal Constitution, and the debates in the first Congress of the United States under the Federal Constitution, and concluded that it was settled then that the power to appoint to office was vested in the President under the Federal Constitution by the vesting in him of the executive power and the requirement that he should take care that the laws be faithfully\n\nexecuted. The case involved the right to remove an officer appointed with the advice and consent of the Senate. It seems to have been conceded that the power to appoint was in the executive, but it was contended that, since the particular appointment was required to be approved by the Senate, the President might not remove the incumbent without the Senate's approval. The effect of the opinion is well summarized in the syllabus:\n\n\"Removal of executive officials from office is an executive function; the power to remove, like the power to appoint, is part of 'the Executive power,' -- a Conclusion which is confirmed by the obligation 'to take care that the laws be faithfully executed.'\"\n\nIt is contended by the appellants that the force of this opinion is weakened by the opinion in Humpherey's Executor v. United States, supra, but we do not find it so. This latter case involved the appointment of a ministerial board charged with quasi-judicial duties, and the opinion merely excludes such officers from those which the President has the right to remove. The distinction involves a principle long ago recognized by this court. The following quotations are from State ex rel. Hovey v. Noble et al., supra:\n\n\". . . we do not understand the authorities to assert that the selection of officers is always an executive act; on the contrary, the authorities hold that, while the power is intrinsically executive, it may be exercised by a court or by a legislative body, as an incidental power of an independent department of the government. No one would, we confidently assume, be so bold as to assert that the Legislature may not appoint officers connected with its duties and proceedings, and there is no more reason for denying the power to the courts than there is of denying it to the Legislature. The truth is, that all independent departments have some appointing powers, as an incident of the principal power, for without it no department can be independent.\"\n\n(Pages 361, 362 of 118 Ind., pages 248, 249 of 21 N.E.)\n\n\"A department without the power to select those to whom it must entrust part of its essential duties can not be independent. If it must accept as 'ministers and assistants' as Lord Bacon calls them, persons selected for them by another department, then it is dependent on the department which makes the selection. To be independent the power of the judiciary must be exclusive, and exclusive it can not be if the Legislature may deprive it of the right to choose those with whom it shall share its labors or its confidences. If one kingdom possesses the right to send into another ministers and assistants to share with the governing power its functions and duties, the latter kingdom is in no sense independent.\" (Page 357 of 118 Ind., page 247 of 21 N.E.)\n\n\"The provisions of the Constitution we have quoted, taken in connection with those which prescribe, define and limit the powers of the other departments of government, remove all doubt and make it incontrovertibly plain that the courts possess the entire body of the intrinsic judicial power of the State, and that the other departments are prohibited from assuming to exercise any part of that judicial power.\" (Page 354 of 118 Ind., page 246 of 21 N.E.)\n\n\"If it be conceded that the right to make choice of ministers and assistants for the court is a legislative power, then neither the judiciary nor the executive can limit its exercise, nor impose restraints upon the legislative discretion. Do but grant the existence of the power, then the extent and the mode of its exercise are, and must necessarily be, entirely matters for legislative determination. If this be so, then the Legislature may select any number of assistants, assign to them whatsoever duties they may see fit, give them access to the records of the court and surrender to them the right to share with it all labors and all duties. Surely, a court thus subject to legislative rule would be a mere dependent, without a right to control its own business and records. But a constitutional court is not subject to any such legislative control. The Legislature\n\ncan not for any purpose cross the line which separates the departments and secures the independence of the judiciary. It is not the length of the step inside the sphere of the judiciary that summons the courts to assert their constitutional right and demands of them the performance of their sworn duty, for the slightest encroachment is a wrong to be at once condemned and resisted.\" (Page 357 of 118 Ind., page 247 of 21 N.E.)\n\n\"'But in America, a Legislature is a Legislature and nothing more.The same instrument which creates it creates also the executive, Governor and the Judges. They hold by a title as good as its own. If the Legislature should pass a law depriving the Governor of an executive function conferred by the Constitution, that law would be void. If the Legislature attempted to interfere with the jurisdiction of the courts, their action would be even more palpably illegal and ineffectual.' 1 Bryce Am. Com. 429.\" (Page 358 of 118 Ind., page 247 of 21 N.E.)\n\nThe appellants say that if it had been intended to confer the appointive power upon the Governor, a few appropriate words would have sufficed to do so. But Constitutions are concisely drawn and superfluity is avoided. It was generally understood that the grant of executive power carried with it, among other things, the general power of appointment, and so it was unnecessary to define the grant by setting out in detail that it should carry with it the power of appointment, together with details of the other powers generally understood to be included. The Constitution-makers knew that the appointive power was in the President under the Federal Constitution, and in the Governor under the old Constitution of Indiana, and that it was there curtailed and limited by a provision for approval by the Senate. In the new Constitution they omitted the limitation upon the power, and inserted no other limitations, although there are limitations upon certain other executive powers. It cannot\n\nreasonably be concluded that, by striking down the limitation, they intended to strike down the power entirely and leave the Governor with the appointive powers only that are conferred upon him by express provision and which do not lie within the normal field of the executive and which he would not have had except for the express provision, but leave him stripped of the appointive power that normally lies within the executive field.\n\nThe case last quoted from involved the constitutionality of an act creating Supreme Court Commissioners to assist the court in performing its judicial functions, and providing that the Legislature should appoint the commissioners. The provision of Section 1 of Article 3 of the Constitution, which precludes a person charged with duties in one of the departments of government from exercising any of the functions of another, is referred to, and it was held that the Legislature might not invade the judicial department and appoint officers who were to function as assistants to the courts in the performance of their judicial functions. But the reasons given for the decision involve consideration other than the separation of power provisions of the Constitution. It is pointed out that the judicial power of the government is vested in the courts (and not the judicial department), and that to permit the Legislature to appoint assistants to the courts would be an invasion of the judicial power. The Clerk of the Supreme Court is placed in the judicial department of the government by the Constitution. Under Section 1 of Article 3 the Legislature might not appoint a deputy clerk of the Supreme Court. It would be barred from so doing not because the appointment would invade and infringe upon the judicial power, which is in the courts, but because it would offend the\n\nprohibition against persons serving in one department of the government exercising a function in another.\n\nIf, after the decision, the Legislature had amended the law creating the office of Supreme Court Commissioners to assist the Judges of this court in the exercise of their judicial functions by providing that the commissioners were to be appointed by the Clerk of the Supreme Court, an administrative officer within the judicial department of the government, the amended statute would not be unconstitutional under Section 1 of Article 3 of the Constitution, since the Clerk of the Supreme Court is an administrative officer in the judicial department of the government, and the Supreme Court Commissioners would serve in the judicial department, and thus, in making the appointment, the clerk would be functioning in the same department. But there can be no doubt that the amended law would have been held unconstitutional, upon the ground that the judicial power was vested by the Constitution in the courts and not in the judicial department, and that the courts, and the courts alone, must exercise the judicial function, and that the appointment of \"ministers and assistants\" by any agency outside of the courts would make the court \"a mere dependent, without a right to control its own business and records.\"\n\nThe question presented by the record before us is not whether persons in one department may be constitutionally vested with authority to make appointments in another department, but whether administrative officers and the Lieutenant Governor, who are in the executive including the administrative department, may be constitutionally vested with authority to make appointments within that department of the character involved in the legislation before us.\n\nThe right of the courts to exercise the entire judicial power and all of the executive appointive power that is an incident to the exercise of the judicial power is no more sacred, nor is it granted more definitely or exclusively, than the constitutional right of the Governor to exercise the entire executive power and all of the appointive power incident thereto. It is established by the great weight of authority here and elsewhere that the power to appoint officers is in the executive, where it is not merely an incident to the exercise of some other power expressly granted. This court has claimed for itself the right to exercise the executive appointing power in the case of all officers and employees who assist in the performance of judicial functions. It is equally well established by our decisions, and decisions elsewhere, that the General Assembly may exercise the executive power of appointment of officers and employees whose duties are an incident to its legislative functions; and it cannot be seriously doubted that administrative officers in the administrative department of the government or in the judicial department may exercise the executive power of appointing their own deputies and employees whose duties are incidental to the carrying out of the administrative functions of the offices they occupy. Thus the Clerk of the Supreme Court may appoint deputies and assistants who are to assist him in his ministerial functions, and the Auditor, Treasurer, and Secretary of State may exercise like power; and if the Governor had not been broadly vested with the general executive power of the state, but had been vested only with special and limited executive authority, that would carry with it the incidental executive appointing power in so far as it involved his subordinates and assistants. But the Constitution has vested in the Governor not certain specific\n\npowers, executive or otherwise, which carry with them incidentally or secondarily the executive power to appoint to office, but he has been vested with the general executive power of the state which carries with it the general power to appoint to office, not as an incident to some other power, but as a principal power in itself. Logically, then, the appointive power vested in the Legislature, aside from those particular clearly executive powers which vest in it by certain exceptions, is limited to the incidental power of appointing those who assist in carrying out the legislative functions. And the appointive power of the courts is limited to those instances which are incidental to the judicial functions; and the appointive powers of administrative and ministerial officers in any department must be limited to that which is incidental to their principal administrative or ministerial functions. Appointment is construed as including election. Certain powers of appointment by election of state officers were reserved in the people, and discretion was lodged in the Legislature to create other offices not specifically mentioned in the Constitution, and to determine that the officers should be elected by the people. All of the rest and residue of the appointive power is vested in the Governor by investing him with the general executive power. Evidence that the Governor was considered the natural and logical repository of the general appointive power is seen in the provision that, in the case of vacancy in any state office, whether in the legislative, or the judicial, or the executive including the administrative department, the Governor shall appoint an incumbent to fill the vacancy until the normal constitutional appointive power may be exercised. This seems to clearly evidence an intention that, except in cases where the power of appointment is merely incidental to a major power expressly granted,\n\nthe appointing power is to rest in the Governor. This Conclusion is supported by the principles announced and the views expressed in all of the decisions of this court except Overshiner v. State (1901), 156 Ind. 187, 59 N.E. 468, 51 L.R.A. 748, which will be hereafter noticed.\n\nThe appellants contend that the Governor's powers under the Constitution are only such as were specifically granted; that otherwise certain specific provisions of the Constitution are mere surplus-age. It is said in the brief:\n\n\"The only power granted by the constitution to the Governor to make appointments is found in Sec. 18 of Article V and Sec. 2 of Article XII, which, respectively, read as follows:\n\n\"'When, during a recess of the General Assembly, a vacancy shall happen in any office, the appointment to which is vested in the General Assembly; or when, at any time, a vacancy shall have occurred in any other State office, or in the office of the Judge of any court; the Governor shall fill such vacancy, by appointment, which shall expire, when a successor shall have been elected and qualified.'\n\n\"Sec. 2. Governor's aids. The Governor shall appoint the Adjutant, Quartermaster, and Commissary Generals.\"\n\nIt is argued that:\n\n\"The enumeration in the constitution of the instances in which the Governor may make appointments excludes from his power to appoint all other appointments under the rule of constitutional construction that 'expressio unius est exclusio alterius.'\"\n\nOmitted from the quotation of Section 18 of Article 5 is the heading, which appears in the Constitution itself: \"Vacancies filled by governor.\"\n\nThe contention finds support only in a Dissenting opinion by Elliott, C.J., in State ex rel. Yancey v.\n\nHyde (1889), 121 Ind. 20, 22 N.E. 644. The fundamental error in the position is that Section 18 of Article 5 does not deal with offices, the appointment to which lies within the scope of the executive power under the general grant. The first provision deals with vacancy in an office, the appointment to which vests in the General Assembly. This would include officers, the appointment of whom we shall hereafter see was expressly vested in the Legislature. The next deals with other state offices. The state officers specifically provided for in the Constitution are elected by the people, and it may be assumed that it was contemplated that other offices elective by the people would be created. In the absence of an express provision, the general executive power does not carry with it the power to fill a vacancy in an elective office. The third refers to the office of the Judge of any court. This is the judicial branch of the government and not the executive, and without this express provision the Governor would have no power to fill vacancies under the general grant of executive power. The concluding clause, that the appointment shall expire when a successor shall have been elected and qualified, clearly indicates that the provision was designed to cover interim appointments to offices which were not filled by executive appointment, for if there is a vacancy in an office appointive by the Governor, there need be no interim between the vacancy and the selection of a successor, since the Governor may fill the office at once. His appointment to fill the office would fill it, and there would be no vacancy nor serving until a successor had been elected and qualified. This leaves then only Section 2 of Article 12, an article which deals with the militia. It is inconceivable that the Constitution-makers would vest in the Governor the entire executive power, with\n\nthe admonition that he take care that the laws are enforced, knowing that in enforcing them he must have the assistance of subordinates, whose loyalty he must be in a position to command, and then strip him of all appointive power except three personal military aids. Under the old Constitution all officers in the militia were elected by the rank and file except the Governor's aids. All provisions for such elections were omitted from the new Constitution except as to the Governor's aids. The provision can be more reasonably accounted for as intended to preserve from doubt the Governor's right to appoint his aids than as a grant of power to appoint three comparatively unimportant officers and a withholding of all authority to appoint officers in the government outside the militia.\n\nSupplementing the contention that the appointive power of the Governor is limited to specific grant is the consistent contention that all of that officer's executive power is limited to express grants. It is argued that certain specific executive powers are expressly granted to the Governor by the Constitution; that if the provision of Section 1 of Article 5, that \"The executive power of the State shall be vested in a Governor,\" is construed as a grant of all executive power, the specific grants thereafter made were unnecessary and the language used mere surplusage; that all of the words used in the Constitution must be construed as effective and not as surplusage; and that therefore the provision quoted from Section 1 of Article 5 is to be treated as limited to the powers thereafter expressly conferred. But if the executive powers granted to the Governor are confined to express grants, the provision that the executive power shall vest in the Governor is surplusage, and this cannot be. An examination of the provisions referred to as granting express executive\n\npower to the Governor discloses that they are not, in fact, grants of power, but rather directions or mandates as to the manner in which executive power is to be exercised, or limitations upon power or delegation of power which is not in essence executive.\n\nSection 12 of Article 5 makes the Governor commander-in-chief of the military and naval forces and lists the occasions and purposes for which he may call out such forces.\n\nSection 13 requires him to give the General Assembly information touching the condition of the state and to recommend measures which he shall Judge to be expedient. In the absence of this provision, any such action upon the part of the executive might be considered an invasion of legislative power.\n\nSection 14 vests him with veto power over bills passed by the Legislature -- again an invasion of the legislative realm.\n\nSection 15 requires him to transact all necessary business with the officers of government and authorizes him to require information in writing from the officers of the administrative department. Authority for this might be implied from the grant of executive power, but administrative officers might assert independence and contend that they were elected by the people and could not be compelled to transact business with the Governor or to report to him in writing. It is more reasonable to conclude that an anticipation of such a situation prompted the insertion of Section 15 than that it was inserted with the intention that is should be a limitation upon the general executive power.\n\nSection 16 provides that: \"He shall take care that the laws be faithfully executed.\" This provision is almost as broad as the general grant of executive power,\n\nand no way is perceived in which it can be construed as a limitation of power.\n\nSection 17 involves pardons and reprieves, but it is a limitation upon the common-law power, and the Legislature is authorized to regulate the exercise of the power and set up an advisory council to advise the Governor in respect to the exercise of the power -- an invasion by the Legislature of a power intrinsically executive. This section in not a grant then, but a limitation upon his power.\n\nSection 18 vests him with power to fill vacancies in office, the appointment to which is vested in the General Assembly, and to fill vacancies in other state offices or in the office of Judge of any court. It has been pointed out above that this is a grant of power not within the normal sphere of the executive.\n\nSection 19 provides that he shall issue writs of election to fill vacancies in the General Assembly. Again it permits the Governor to invade the legislative field, which permits this section to be accounted for as an extension of power beyond that which is within the executive realm; and the same applies to Section 20, which permits him, under certain circumstances, to convene the General Assembly at some other place than the usual meeting place.\n\nIn Section 1 of Article 2 of the Constitution of the United States it is provided that: \"The executive power shall be vested in a President of the United States of America.\"\n\nIn Section 2 of the same Article are provisions that the President shall be commander-in-chief of the Army and Navy and militia. He shall have power to grant pardons; to make treaties; and, with the advice of the Senate, to appoint ambassadors, Judges, etc., and to fill\n\nvacancies that may happen during the adjournment of the Senate.\n\nIn Section 3 it is provided that he shall give Congress information as to the state of the Union, and make recommendations. The provisions are very similar in character to the provisions of the Constitution of this state respecting the powers of the Governor.\n\nConcerning the constitutional powers of the President, it was said by Chief Justice Taft in Myers, Adm'x, v. United States, supra (pages 117, 118 of 272 U.S., pages 166, 167 of 71 L. Ed., pages 25, 26 of 47 S. Ct.):\n\n\"The vesting of the executive power in the President was essentially a grant of the power to execute the laws. But the President alone and unaided could not execute the laws. He must execute them by the assistance of subordinates. This view has since been repeatedly affirmed by this Court. (Authorities.) As he is charged specifically to take care that they be faithfully executed, the reasonable implication, even in the absence of express words, was that as part of his executive power he should select those who were to act for him under his direction in the execution of the laws. The further implication must be, in the absence of any express limitation respecting removals, that as his selection of administrative officers is essential to the execution of the laws by him, so must be his power of removing those for whom he cannot continue to be responsible. Fisher Ames, 1 Annals of Congress, 474. It was urged that the natural meaning of the term 'executive power' granted the President included the appointment and removal of executive subordinates. If such appointments and removals were not an exercise of the executive power, what were they? They certainly were not the exercise of legislative or judicial power in government as usually understood.\n\n\". . . In the British system, the Crown, which was the executive, had the power of appointment and removal of executive officers, and it was natural, therefore for those who framed our Constitution\n\nto regard the words 'executive power' as including both. Ex Parte Grossman, 267 U.S. 87, 110. Unlike the power of conquest of the British Crown, considered and rejected as a precedent for us in Fleming v. Page, 9 How. 603, 618, the association of removal with appointment of executive officers is not incompatible with our republican form of Government.\n\n\"The requirement of the second section of Article II that the Senate should advise and consent to the Presidential appointments, was to be strictly construed. The words of section 2, following the general grant of executive power under section 1, were either an enumeration and emphasis of specific functions of the Executive, not all inclusive, or were limitations upon the general grant of the executive power, and as such, being limitations, should not be enlarged beyond the words used. Madison, 1 Annals, 462, 463, 464. The executive power was given in general terms, strengthened by specific terms where emphasis was regarded as appropriate, and was limited by direct expressions where limitation was needed, and the fact that no express limit was placed on the power of removal by the Executive was convincing indication that none was intended. This is the same construction of Article II as that of Alexander Hamilton quoted infra. \"\n\nThe last paragraph quoted furnishes distinguished authority for the Conclusion that the provisions following the general grant of executive power to the Governor were not intended as a limitation upon the grant of power. We quote further from the opinion (page 131 of 272 U.S., page 172 of 71 L. Ed., page 30 of 47 S. Ct.):\n\n\". . . Mr. Madison and his associates pointed out with great force the unreasonable character of the view that the Convention intended, without express provision, to give to Congress or the Senate, in case of political or other differences, the means of thwarting the Executive in the exercise of his great powers and in the bearing of his great responsibility, by fastening upon him, as subordinate executive officers, men who by their inefficient service\n\nunder him, by their lack of loyalty to the service, or by their different views of policy, might make his taking care that the laws be faithfully executed most difficult or impossible.\"\n\nIn the opinion the Chief Justice refers to the assertion that Mr. Webster, when in the Senate, denied that the vesting of executive power in the President was a grant of power. He said it was no more than merely naming the department, but it is pointed out that he had not always held that view, and the Chief Justice says (page 152 of 272 U.S., page 180 of 71 L. Ed., page 37 of 47 S. Ct.):\n\n\"It is not unjust to note that Mr. Webster's final Conclusion on this head was reached after pronounced political controversy with General Jackson, which he concedes may have affected his judgment and attitude on the subject.\"\n\nBut Mr. Webster's argument that the grant of executive power was merely setting up a department of government has no force in respect to the Constitution of the State of Indiana, which, unlike the Federal Constitution, expressly sets up the departments of government in a separate article of the Constitution, so that the grant of executive power to the Governor was not in any sense necessary, nor can it be reasonably construed as intended to merely set up a department of government or to accomplish any other purpose than its expressed and obvious one\n\nAgain quoting the Chief Justice (page 127 of 272 U.S., page 170 of 71 L. Ed., page 29 of 47 S. Ct.):\n\n\"A reference of the whole power of removal (of officers) to general legislation by Congress is quite out of keeping with the plan of government devised by the framers of the Constitution. It could never have been intended to leave to Congress unlimited\n\ndiscretion to vary fundamentally the operation of the great independent executive branch of government and thus most seriously to weaken it. It would be a delegation by the Convention to Congress of the function of defining the primary boundaries of another of the three great divisions of government.\"\n\nAnd quoting again (page 122 of 272 U.S., page 168 of 71 L. Ed., page 27 of 47 S. Ct.):\n\n\"Oliver Ellsworth was a member of the Senate of the First Congress, and was active in securing the imposition of the Senate restriction upon appointments by the President. He was the author of the Judiciary Act in that Congress and subsequently Chief Justice of the United States. His view as to the meaning of this article of the Constitution, upon the point as to whether the advice of the Senate was necessary to removal, like that of Madison, formed and expressed almost in the very atmosphere of the Convention, was entitled to great weight. What he said in the Discussion in the Senate was reported by Senator William Patterson, 2 Bancroft, History of the Constitution of the United States, 192, as follows:\n\n\"'The three distinct powers, legislative, judicial and executive should be placed in different hands. \"He shall take care that the laws be faithfully executed\" are sweeping words. The officers should be attentive to the President to whom the Senate is not a council. To turn a man out of office is an exercise neither of legislative nor of judicial power; it is like a tree growing upon land that has been granted. The advice of the Senate does not make the appointment. The President appoints. There are certain restrictions in certain cases, but the restriction is as to the appointment and not as to the removal.'\"\n\nBut it is contended that, under Section 1 of Article 15:\n\n\"Official appointments. -- All officers, whose appointment is not otherwise provided for in this Constitution, shall be chosen in such manner as now is, or hereafter may be, prescribed by law,\"\n\nthe appointive power is \"within the unlimited power of the legislature to prescribe,\" regardless of other provisions of the Constitution, including Section 1 of Article 3, which provides for the division of powers and excludes persons serving under one of the departments from exercising any of the functions of another. This contention has been made before, but this court has always refused to so construe the provision except in the Overshiner case, supra. If the contention can be sustained, there is no limitation upon the right of the Legislature to provide who shall appoint or elect to public office in any department of the government, and it seems that this is appellants' contention. If it can be sustained, then, under this section, the Legislature might provide that Supreme Court Commissioners serving in the judicial department and Judges of the courts might be elected by the Legislature, but in State ex rel. Hovey v. Noble, supra, this court most emphatically held that this could not be done; or it might provide by law that all of the subordinate executives in the executive department of the government should be appointed by the Judges of this court. Such a construction of this provision puts it at cross-purposes with the general scheme of government by which the departments were strictly separated. Such a construction must be avoided, since to adopt it would be to attribute inconsistency and an abandonment of the original purpose to the drafters of the instrument. The section is contained in an article headed \"Miscellaneous,\" toward the end of the instrument. It first provides that all officers whose appointment is not otherwise provided for in the Constitution shall be chosen as \"now is.\" There were certain minor officers elected or appointed by the Legislature at the time the Constitution was adopted, whose appointment\n\nwas not otherwise expressly provided for in the Constitution. These we shall notice hereafter, and it has been universally held that the Legislature may still appoint or elect these officers. But Mr. Holman said in the latter days of the convention that it was not intended to permit the Legislature to elect more than two or three officers, and no one seems to have disputed this upon the convention floor. The provision, \"or hereafter may be, prescribed by law,\" would include officers thereafter created by the Legislature, and officers then elective by the Legislature, should the Legislature desire to abdicate the duty of continuing to select them. One of the officers elective by the Legislature was the manager or superintendent of the prison, and it has been conceded in all of the cases that the making of appointments controlled the right to manage the prison. This surely is not a judicial function. It cannot be reasonably believed that the Constitution-makers intended that a law might be passed requiring the Judges to make this appointment. The provision cannot reasonably be construed to mean that the Legislature might create offices in the executive department, subordinate to the Governor, to assist him in the performance of his duties, and provide by law that the Legislature itself might elect these officers, or that the Judges of this court might appoint them. Such a construction would be at cross-purposes with the cardinal scheme of the division of powers. The consistent and reasonable construction is that it was intended that the Legislature should continue to select the officers that it was then selecting until such time as it should desire to delegate that duty to that department of the government in which the officers properly function, and in that case that it might delegate the appointing power to the appropriate agency in that department of government,\n\nor that it might provide by law that the officer should be elected directly by the people. The same applies to new officers that might be created. If they are in the judicial department it might provide by law that they should be elected by the people or appointed by the appropriate judicial officer, and if in the executive including the administrative department that they might be elected by the people or appointed by the Governor. Such a construction is consistent with a continued intention and purpose to adhere to the strict and exclusive division of governmental powers. There is a similar provision in Section 1 of Article 6, which provides:\n\n\"There shall be elected, by the voters of the State, a Secretary, an Auditor and a Treasurer of State, who shall, severally, hold their offices for two years. They shall perform such duties as may be enjoined by law. . . .\"\n\nIt cannot have been intended to authorize the Legislature to enjoin upon these ministerial officers judicial duties, since all judicial power is vested in the courts; and it cannot have been intended that the Legislature might enjoin upon them executive duties in the executive department of the government, since all executive power is vested in the Governor. Such inconsistencies cannot be tolerated in constitutional construction. To permit of such a construction is to engraft upon the provision of Section 1 of Article 3, that \". . . no person, charged with official duties under one of these departments, shall exercise any of the functions of another, except as in this Constitution expressly provided,\" the words \"unless the Legislature shall otherwise provide by law.\" Nor is it conceivable that it was intended that the Legislature should by law enjoin upon these ministerial officers legislative duties, authority to pass\n\nlaws, and if they may not be charged with authority to make laws, where is the exception that would still leave them chargeable with the execution of the laws or their adjudication?\n\nAppellants argue again that the Secretary, Auditor, and Treasurer of State are officers in \"the Executive including the Administrative\" department of the government, and that therefore they may be given general duties and vested with general powers therein. It will be noted, first, that even though it could be conceded that they are officers in the executive department, the executive power is vested in the Governor, and not in the department, just as the judicial power is vested in the courts and not in the judicial department, and no one else in the department can be vested with executive power. But it must also be seen that these ministerial officers are not officers of the executive department. They are officers in the administrative department, which is included in and made a part of the executive department. The Constitution does not provide that the executive department is included in the administrative, which is a far different matter. The bookkeeping department may be considered as included in the executive department of a corporation, but this does not permit of considering the executive department of the corporation as included in the bookkeeping department. It is noted that in the principal statute complained of the departments created are referred to as administrative departments. This may have been designedly done to avoid using the word \"executive,\" and so that the contention might be made that the duties delegated to the administrative officers involved and to the Lieutenant Governor were merely administrative functions. No such argument is stressed in the briefs or at the bar, nor could it well be stressed,\n\nsince the general supervision of the greater part of the state's activities in carrying out and executing the laws is involved in the powers of the boards. Among their express powers is the selection of executives who make up the boards and officers at the head of the various agencies which carry on the state's business and affairs, and these executives thus appointed are vested with full power to employ assistants, fix salaries, and remove from office at pleasure, a clearly and purely executive function, subject, however, to the approval of the supervising board. That the exercise of such discretion is not ministerial is so clear and well settled as to need no citation of authority.\n\nIn Gray Governor, et al. v. State ex rel. Coghlen (1880), 72 Ind. 567, 578, it is said:\n\n\"The executive power of the State is vested solely in the Governor. Constitution, art. 5, section 1.\n\n\"Any power or authority vested by legislation in the Governor, together with other officers or persons, in which they are to have an equal voice with him, can not be executive, as he alone is vested with the executive power of the State. Any duty which he is by law required to perform, in connection with others, in which they have an equal voice with him, can in no sense be said to be an executive duty.\"\n\nIt was concluded that the duty sought to be mandated was clearly ministerial, but the corollary to the statement must be that, where the authority vested is executive, it cannot be vested in the Governor and others, since executive power may be vested only in the Governor.\n\n\"A ministerial act is defined to be 'one which a person performs in a given state of facts, in a prescribed manner, in obedience to the mandate of legal authority, without regard to, or the exercise of, his own judgment upon the propriety of the act being done.'\" (Page 578 of 72 Ind.)\n\nThe above case was cited with approval in French v. State ex rel. Harley (1895), 141 Ind. 618, 41 N.E. 2 which we will later discuss, and in Ellingham, Secretary of State, et al. v. Dye (1912), 178 Ind. 336, 99 N.E. 1, Ann. Cas. 1915C, 200.\n\nThe word \"administrative\" is sometimes loosely used as synonymous with \"executive,\" but it is clear that it was not so used in the Constitution, for to conclude that it was is to conclude that two executive departments were established or two administrative departments, as the case may be. More strictly and correctly, the word \"administrative\" is synonymous with \"ministerial.\" They stem from the word \"minor,\" meaning \"inferior in bulk, degree, importance, etc.; less, smaller; as, minor divisions; of minor importance.\" See Webster's New International Dictionary. \"Minister\" is the next form of the word, and we note in the quotation from State ex rel. Hovey v. Noble, supra (page 357 of 118 Ind., page 247 of 21 N.E.), that Lord Bacon is referred to as using the expression \"ministers and assistants\" to describe those who assisted in performing sovereign functions. \"Ministerial\" pertains to minister, and \"administrative\" pertains to the same word. It is noted that administrative state officers were treated and considered as ministerial officers in Gary, Governor, et al. v. State ex rel. Coghlen, supra. They were the officers referred to in the statement that (page 578 of 72 Ind.): \"Any power or authority vested by legislation in the Governor, together with other officers or persons, in which they are to have an equal voice with him, can not be executive, as he alone is vested with the executive power of the State.\" This statement has been repeatedly cited with approval by this court. It is not intended to convey the impression that a limited executive power, incidental\n\nto the management and carrying out of the duties of the offices of these administrative offices, may not be exercised by them. They may properly exercise the executive power to appoint their own deputies, who are state officers, and other assistants and employees, but, as in the case of the officers in the judicial department of the government exercising executive power, it must be limited to that which is incidental to the constitutional functioning of the office. Not so of the Governor. If he had not been vested with the general executive power of the state it would still be concluded that, as in the case of the administrative officers, he would have executive power incidental to the duties expressly conferred upon him. But, in addition to any such incidental power, the Governor is vested with the general executive power of the State.\n\nIt has been noted elsewhere that members of the Constitutional Convention were conversant with the history of constitutional government. They must have understood the meaning of words which were so carefully used. The administrative departments which they set up provide for certain named state officers and for county and township officers. The administrative state officers created by the Constitution in the administrative department are a Secretary, Auditor, and Treasurer of State. Not only does the name given to the department indicate that the officers are minor officers, but the names given to the officers indicate that they were to play a minor role in the affairs of state. It must be concluded from the names that it was intended that the Secretary of State should perform secretarial duties, and the Auditor of State auditing duties, and the Treasurer of State those duties concerning the holding of the funds of the state which are usually involved in the duties of a treasurer.\n\nIn our Constitution the powers of the government are divided into three; (1) the legislative power is vested in the General Assembly; (2) the judicial power is vested in the courts; but (3) the executive power is vested in the Governor alone. These are all the powers of the government. The administrative officers were vested with no powers. It is provided that: \"They shall perform such duties as may be enjoined by law. . . .\"\n\nIt cannot be believed that the drafters of the Constitution thought of these administrative state officers of equal rank with the Governor. Webster defines \"Governor\" as \"one who governs; a chief ruler or magistrate\"; \"the person elected as chief executive official of a State in the United States.\" \"Govern\" is defined \"to direct and control the actions or conduct of, either by established laws or by arbitrary will; to direct and control, rule, or regulate, by authority.\" See Webster's New International Dictionary.\n\nIt is a cardinal principle of constitutional construction that words are to be considered as used in their ordinary sense; and that their ordinary and common meaning is to be attributed to them. By the use of the words \"Governor,\" \"Secretary,\" \"Treasurer,\" and \"Auditor,\" we must conclude that the Constitution-makers intended to convey that they as officers were to fill offices and functions in the government in the manner normally and naturally indicated by the meaning of the words.\n\nGovernors are almost always vested with the executive powers of the state. That the executive power is the power to execute the laws -- to carry them into effect as distinguished from the power to make the laws and the power to Judge them, and that the power to appoint the subordinate officers and\n\nemployees through whom the laws are executed is a necessary incident to the power to execute the laws, is manifest from the words of the learned authorities above referred to with which the Constitution-makers must have been familiar. It was not the intention to curtail the executive power generally given to the chief executive. On the contrary, an intention to enlarge the power as it had previously existed, and as it existed in the President, is manifest in the omission to require the confirmation of appointments by the Senate, which was included in the Federal Constitution and in the Constitution of the State of Indiana which was superseded. Reasonable construction requires that the grant of full executive power to the Governor included all of its incidents as they were then generally understood to exist. This then excludes the view that it was intended that any executive power in the generally understood sense should vest in any other officer of the Government.\n\nThe \"duties\" to be assigned by the Legislature to the Secretary, Auditor, and Treasurer of State were to be such \"as may be enjoined by law.\" There is no express authority to vest these officers with executive power, but it is argued that we must imply an intention that the Legislature might in its discretion vest these officers with power to choose and appoint officers in the executive department of the government who were to assist in the executive function of executing the laws and taking care that the laws be faithfully executed. If there is authority in the Legislature to vest these administrative officers with power to make any such appointment, they may be vested with power to make all -- there is no limit to the legislative discretion in this respect for the Constitution provides no limitation. If the Legislature may in its discretion vest one ministerial officer with power to\n\nappoint one state official whose duties involved the executive function of executing the laws, then it may vest all such appointive power in any one or more of these administrative officers. This would entirely exclude the Governor from having a voice in the selection of those who are to actually carry out and execute the laws. He cannot execute the laws himself; he must execute them through subordinate officers and employees; and if he cannot choose the subordinates, he cannot control them, and the executive power expressly vested in the Governor will have been delegated to others. But this conflicts with the grant of the executive power to the Governor.\n\nA universally recognized rule of constitutional construction is that apparent conflict in provisions must be reconciled if possible upon the theory that the instrument was carefully prepared and intended to be a consistent whole. If inconsistent intention must be avoided in construing the express provisions of the Constitution, surely it is not permitted to imply an intention that conflicts with a definite and expressed intention. Never has it been thought that secretarial duties involved the execution of laws. Never has it been thought that auditing duties or treasurer duties involved such functions. To write into the Constitution by implication authority for the Legislature in its discretion to strike down the express grant of all executive power to the Governor, and to vest ministerial secretaries, auditors, and treasurers with functions that are everywhere recognized as belonging to the Governor and to the executive power, would do violence to every known rule of construction.\n\nThe appellants say in their brief:\n\n\"The selection of administrative officers who shall make appointments to offices is a legislative function. It is only after this legislative function\n\nhas been exercised and those selected to make the appointments in the executive including the administrative department make appointments that an administrative or executive function is being performed.\"\n\nBut this is an erroneous view. The creation of the offices is a legislative function. The appointment, of officers is an executive function. And it is noted that in the principal statute under consideration the appointing board is given not only executive authority to appoint executive officers, but also supervisory power and power to control by approval or disapproval the appointment and dismissal of deputies and employees under the subordinate executive officers within its control.\n\nThe following quotation from State ex rel. Collett v. Gorby (1890), 122 Ind. 17, 26, 27, 23 N.E. 678, 681, is pertinent:\n\n\"If the construction contended for by the appellee can be sustained, the General Assembly may create any number of State offices its discretion may dictate, under any name it may choose, make them appointive, and transfer to them the statutory duties now performed by the secretary, auditor and treasurer of state, thus rendering the constitutional provision that these administrative State officers shall be elected by the people, a dead letter. It would be difficult to find any constitutional provision expressly prohibiting the General Assembly from the creation of such offices, making them appointive, and from transferring to them the statutory duties now performed by the administrative State officers above named, and yet such a proceeding would be such a plain violation of the intention of the framers of the Constitution that no court would hesitate to declare that it did not possess such power. To permit such a construction would place it in the power of the Legislative department of the State to wholly absorb and usurp the executive and administrative department. It is immaterial whether it is usurped by the direct\n\naction of the General Assembly, as a legislative body, or whether it is done indirectly by its own appointed agents. The result in either case is the same. By the express terms of the Constitution the General Assembly is prohibited from exercising executive or administrative functions, except in cases expressly provided for by that instrument,\"\n\nIf the Legislature may not absorb and usurp the functions of constitutional administrative officers (thus leaving them with nothing to do and their election by the people a \"dead letter\"), then by what reasoning can it be concluded that it may absorb and usurp the functions of the Governor by taking from him the executive power which is especially vested in him by the Constitution, and delegating to administrative officers the functions of appointing and supervising and controlling the actions and activities of subordinate executives who are intrusted with carrying the laws into effect, in other words, with executing the laws, thus making the election of the Governor by the people a \"dead letter?\" The Conclusion cannot be avoided that the acts here in question seek to absorb and usurp functions which are normally and generally understood to be the functions of a Governor, and vest them in minor administrative officers.\n\nOn some of the boards the Lieutenant Governor is associated with the Governor, or with the Governor and an administrative state officer. It is contended by the appellees that the Lieutenant Governor is a legislative officer, and that Section 1 of Article 3 prohibits his appointment upon a board functioning within the executive including the administrative department. In the Constitution the office of Lieutenant Governor is established and set up as a part of the executive department of the government, and\n\nwe known of no rule of construction that would permit us to conclude that it was intended that it should be considered as a part of either of the other departments. It is true that it is provided in the Constitution that the Lieutenant Governor is to preside in the Senate, with power to vote and exercise the legislative function in certain instances. But these provisions must be treated as exceptions to the rule that officers with duties in one department may not function in another. See Armstrong v. Townsend et al. (1934), 8 Fed. Supp. 953.\n\nBut it may be reasonably concluded that the principal reason for creating the office of Lieutenant Governor was to provide an available substitute to fill the Governor's office in case of the Governor's death, resignation, or inability to discharge the duties of his office, and it is expressly provided in Section 10 of Article 5 that in such case the duties of the office of Governor shall devolve upon the Lieutenant Governor. We must conclude from this that it was not intended that he should exercise any of the functions of the Governor's office except in such a contingency. No executive powers are otherwise conferred upon him. He is not the Governor, and clearly was not intended to have power equal to the powers of the Governor, and there is nothing in the Constitution to indicate that we was to exercise any executive powers or functions whatever except in the contingency provided for in Section 10 of Article 5.\n\nThus interpreted, all of the constitutional provisions are consistent with the fundamental principles incorporated in its general provisions. It is a consistent and harmonious whole.\n\nThe appellants contend that the Constitution is ambiguous, and that the fact that similar statutes have\n\nbeen enacted and become operative indicates a practical construction of the Constitution which affords sanction for this legislation. It might be sufficient to dispose of this contention to say that we find the provisions of the Constitution clear, plain, and unambiguous, and that:\n\n\"The rule of practical construction is of no value when it is plain that the practice has been in open violation of the instrument which the court is called upon to construe.\" Parker et al. v. State ex rel. Powell (1893), 133 Ind. 178, 199, 32 N.E. 836, 842, 33 N.E. 119, 18 L.R.A. 567, 575.\n\nIt is sometimes said that, in construing statutes, an interpretation put upon a statute by the Legislature over a long period of time is controlling. But the Legislature has power to make statutes, and in construing them the object is to ascertain the legislative intention, and the legislative intention may be gathered from a construction by the Legislature. But the Legislature did not enact the Constitution, and a legislative intention as to how the Constitution is to operate is of little value in determining the intention of the drafters of the Constitution, especially where the legislative interpretation involves the usurpation of powers which the Constitution vests in the other departments of government. Practical construction to be valuable as an aid to resolving ambiguity must be acquiesced in by the various departments affected, that is to say, it must be acquiesced in by the invaded as well as the invader. The many cases which will be hereafter discussed clearly indicate that the judicial department has never acquiesced in a construction of the Constitution that permits the Legislature to provide for appointment to office in such a manner as to invade or strike down the judicial power, which is vested in the courts, or the executive power, which is vested in the Governor; and, while\n\ninstances are cited in which provisions for the appointment of minor officers by state administrative officers have become effective without legal action to question their constitutionality, the many cases in which such delegation of power has been questioned in court by the then Governor or others preclude the Conclusion that there has been general acquiescence in construing the Constitution to permit such a practice. See Myers, Adm'x, v. United States, supra; Fairfield v. Foster (1923), 25 Ariz. 146, 214 Pac. 319; Lewis' Sutherland Statutory Construction, § 473 et seq.; 11 Am. Jur., p. 697 et seq. Many of the opinions of this court involving construction of the constitutional provisions referred to have been cited.\n\nCollins, Secretary of State v. State ex rel. Morrison, Attorney General (1856, 8 Ind. 344, involved an appointment by the Governor to fill the newly created office of Attorney General upon the theory that there was a vacancy. The statute creating the office provided for election by the Legislature. The appellants contend that this case decides that the Attorney General was one of the officers elective by the General Assembly at the time the Constitution was adopted, and which it was entitled to continue to appoint under the \"now is\" clause of Section 1 of Article 15 of the Constitution.\n\nBut in City of Evansville et al. v. State ex rel. Blend et al. (1889), 118 Ind. 426, 21 N.E. 267, the Collins case was considered as deciding only that there was no vacancy to be filled by the Governor. If the case can be construed as deciding that the Attorney General was one of those officers appointed by the Legislature at the time the Constitution was adopted, the court was in error in the facts. But if it had not been in error, and the Attorney General is such an officer now, which he\n\nis not, the case is not authority to support the view that the Legislature might abdicate the power and delegate it to ministerial officers.\n\nState ex rel. Jameson et al. v. Denny, Mayor (1889), 118 Ind. 382, 389, 390, 391, 21 N.E. 252, 254, 255, 4 L.R.A. 79, involved the right of the Legislature to appoint officers for local municipalities. It was said that generally the power to appoint to office is an executive function; that the several departments of the state government may exercise the power in so far as necessary to maintain their independent existence, but that the appointment of local officers for the subdivisions of the government \"we think involves the exercise of executive functions and falls within the prohibition of section 1, article 3 of the Constitution.\" It is pointed out that Section 18 of Article 5 of the Constitution, which provides for the filling of vacancies, \"'the appointment to which is vested in the General Assembly,'\" confers no appointive power upon the Legislature; that the appointive power is conferred by Section 1 of Article 15; that a few certain officers were appointed by the Legislature at the time the Constitution was adopted; and that the provision, \"'shall be chosen in such manner as now is,'\" authorized the Legislature to continue such appointments, but that it has no other appointive power; that: \"This construction harmonizes and gives force to all the provisions of the Constitution, while to wholly deny the General Assembly the power to make appointments renders meaningless many words, phrases, and even whole sentences found in that instrument.\" But it is held that the Legislature may not provide a manner of appointment inconsistent with the division of powers.\n\nCity of Evansville et al. v. State ex rel. Blend et al., supra, involved the right of local self-government. The\n\nviews expressed in the case are not substantially different than those in the case last referred to. It is said (pages 443 of 118 Ind., pge 272 of 21 N.E.):\n\n\"The power to appoint to office is not a legislative function, but belongs to the executive department of the government.\"\n\nConcerning the last phrase of Section 1 of Article 15 of the Constitution, that:\n\n\"All officers, whose appointment is not otherwise provided for in this Constitution, shall be chosen in such manner as now is, or hereafter may be, prescribed by law,\"\n\nit is said that to prescribe a mode of appointment and to make the appointment are two different things; that (page 446 of 118 Ind., page 273 of 21 N.E.):\n\n\"The legislature may provide by law for the appointment of all officers not provided for in the Constitution, but the appointing power must be lodged somewhere within the executive department of the government.\"\n\nThere were no contentions and no reasons to consider where in that department the power must be lodged, but, since the power to appoint is executive, it is clear that it would have to be lodged with some officer in the executive department who had executive power, and the only such is the Governor.\n\nState ex rel. Holt et al. v. Denny, Mayor, et al. (1889), 118 Ind. 449, 21 N.E. 274, 4 L.R.A. 65, involved local self-government, and does not differ materially from the opinions last referred to.\n\nHovey, Governor v. State ex rel. Riley (1889), 119 Ind. 386, 21 N.E. 890, involved the right of the General Assembly to appoint trustees of the institution for the education of the blind. It was concluded that, since the benevolent institutions in existence\n\nat the time the Constitution was adopted were under the control of the Legislature, in the sense that their officers and managers were appointed by the Legislature, it furnished color of claim to the right to appoint the governing officers of all benevolent institutions. The opinion leans heavily upon practical exposition of the Constitution. But it is said (page 388 of 119 Ind., page 890 of 21 N.E.):\n\n\"We are far from asserting that the plain provisions of the Constitution may be broken down or overleaped by practical exposition, but what we do assert is, that where, as here, there are provisions not entirely clear and free from doubt, practical exposition is of controlling force.\"\n\nThroughout the opinion, in which two of the Judges Dissented, doubts are expressed, and there is apparent a lack of that confidence which generally characterizes the opinions of the writer (Elliott, C.J.). In the concluding paragraph of the opinion it is said (page 392 of 119 Ind., pages 891, 892 of 21 N.E.):\n\n\"Another consideration, not without importance and one that is to be regarded in construing the Constitution and giving effect to its provisions, is, that the benevolent institutions are the property of the State, and as such within the general control of the Legislature. As the Legislature has general authority over the property of the State, and as it may appoint agents or officers to manage that property, there is a solid foundation for the practice which has so expounded the Constitution, or aided in expounding it, as to give the General Assembly the power to appoint the governing officers of the benevolent and other State institutions. The basis of the practice is the familiar principle that the grant of a principal power carriers with it all necessary subsidiary powers.\"\n\nThe Conclusion reached in the opinion is not important in considering the questions presented here. But we\n\ncannot by silence seem to give our assent to the view expressed in the paragraph quoted. That the authority of the Legislature is legislative merely, and that it is limited to legislation unless some other power is expressly granted by the Constitution, is too well settled and has been too often affirmed to need citation of authority. The Legislature does not have general authority over the property of the state, and that it has such general authority has never elsewhere been asserted to our knowledge. The management of the state's property is an executive function. The General Assembly may legislate concerning the state's property, the courts may adjudicate concerning it, but the Governor, vested with the executive power, must manage the state's property. But in any event, the opinion lends no support to the views that the Legislature may delegate executive power to a board dominated by ministerial state officers.\n\nHovey, Governor v. State ex rel. Carson (1889), 119 Ind. 395, 21 N.E. 21, involved the right of the General Assembly to appoint trustees of the Indiana Hospital for the Insane, and it was held to have the appointing power under the \"now is\" clause of Section 1 of Article 15. The opinion, which was by Mitchell, J. (a minority opinion, three of the Judges Concurring in the result only and expressly withholding their concurrence in the reasoning), goes into a long Discussion of matters that were not necessary to a decision of the case. It is said (page 401 of 119 Ind., page 23 of 21 N.E.):\n\n\"The Federal Constitution declares, with emphasis, that 'The executive power shall be vested in a President of the United States,' but it was never supposed that this declaration invested the President with the appointing power, which, after long and earnest debate, was conferred upon the chief executive of the nation in express terms.\"\n\nThat the writer was in error in this Conclusion seems clearly demonstrated by the exhaustive review of the history of this provision and the debates concerning it by Chief Justice Taft in Myers, Adm'x v. United States, supra. But there is nothing in the opinion that is pertinent to the narrow question with which we are confronted, unless it can be construed as contended that the power to provide by law for the manner of appointment of officers authorizes the Legislature in its discretion to break down the provision for the division of powers and to interfere with the courts in exercising the judicial function, and with the Governor in his exercise of the executive power. If it can be so construed it is contrary to the great weight of reason and authority and with former decisions of this court, and this may be one of the reasons for the refusal of the majority to concur in the views expressed.\n\nState ex rel. Yancey v. Hyde, supra, involved appointment to the office of inspector of mineral oils. The Governor had appointed a director of the department of geology and natural resources, a statutory office, and the director thus appointed an inspector of mineral oils, who, under the statute, was chief of one of the divisions of the department of natural resources. By an amendment of the statute it had been provided that the General Assembly should elect the director of the department of geology and natural resources, and that the director thus appointed should appoint the chiefs of division. It is said in the opinion that the question presented divides itself into two inquiries (page 25 of 121 Ind., pages 645, 646 of 22 N.E.):\n\n\" First. Has the Legislature the same general power to fill that it has to create offices?\n\n\" Second. If it has, then may it create two offices, elect the incumbent to one of them, and provide that he shall appoint the incumbent to the other?\"\n\nAfter referring to Section 1 of Article 3, which divides the powers of government and provides that no person charged with official duties under one of the departments shall exercise the duties of another, it is said (pages 25, 30 of 121 Ind., page 646 of 22 N.E.):\n\n\"When applied to the question under consideration, one of two Conclusions must follow, or the Legislature was without power to elect the director of the department of geology and natural resources, and therefore without power to confer upon him the power to appoint the appellee to the office in question: (1) The power to appoint the office must be a legislative function, or (2) express power must be lodged somewhere in the Constitution to make such appointment.\n\n\"We can not give our consent to the affirmative of either of these propositions. . . .\n\n\"That the power to appoint to office is not a legislative function it seems there can be no question.\n\n\"Is it an executive function? That the power to appoint to office is intrinsically an executive function, has been decided over and over again, and so held by this as well as other courts.\n\n\"Upon this question, so long settled and well understood, there ought to be no difference of opinion, and there has been no contention to the contrary until within the last few years.\"\n\nThere are numerous quotations and citations of authority to sustain the Conclusion. Among others, Am. \u0026 Eng. Ency. of Law, Vol. 3, p. 686, to the effect (page 34 of 121 Ind., pages 648, 649 of 22 N.E.):\n\n\"'The power of appointing and removing subordinate executive officers is generally, by the American Constitutions, vested in the chief executive.'\"\n\nIt is concluded that there is no direct grant of power to the Legislature to fill offices like that of director of the department of geology and natural resources, and\n\nthat the Legislature has no power to elect the officer in question. This is based upon the view that the right to provide the manner of appointment is limited by the division and delegation of powers. In answer to the contention that practical construction has established a precedent, it is said (page 37 of 121 Ind., page 650 of 22 N.E.):\n\n\"hPractical construction is of very little consequence when it is exercised in violation of the plain provisions of the Constitution.'\"\n\nThis required the Conclusion that the effort of the Legislature to fill the principal office had failed, and that the appointment to the principal office by the Governor was the legal appointment since there was a vacancy in the office. Elliott, C.J., and Mitchell, J., wrote Dissenting opinions. It is in this Dissent, that Elliott, C.J., concluded that there were certain provisions in the Constitution expressly designating the cases in which the Governor may appoint; that they would be meaningless if the Governor had the executive appointing power under the general grant. We have pointed out above that the specific instances referred to were grants of power to appoint that were not covered by the general grant of executive power. If the provisions referred to are taken as special grants of appointive power, and other similar provisions referring to power vested in the Governor are to be taken as special grants of executive power, then the general grant of executive power is meaningless. Under the construction we have put upon these various clauses, they harmonize, and there is no conflict or superfluity. Since such a construction can reasonably be adopted, there is no room for the construction put upon the provisions in this Dissenting opinion.\n\nState ex rel. Worrell v. Peelle (1889), 121 Ind. 495, 22 N.E. 654, involved the appointment to office of the Indiana Bureau of Statistics. The opinion is by Olds, J. A department of statistics was created by statute, the declared purposes being \"'for the collection and dissemination of information, hereinafter provided, by annual printed reports made to the Governor and Legislature of the State.'\" (Page 497 of 121 Ind., page 655 of 22 N.E.) It originally provided for appointment of the chief of the department by the Governor. Thereafter the act was amended, the duties somewhat enlarged, and it was provided that the chief of the department should be elected by the General Assembly. It was contended that the office was legislative, the duties involving only the collection of information for the use of the Legislature. This view was not concurred in by the court. It was held that the officer was a state officer, and that it is well settled that the provision of the Constitution, that (pages 505, 506 of 121 Ind., page 658 of 22 N.E.):\n\n\"'All officers whose appointments are not otherwise provided for in this Constitution shall be chosen in such manner as now is or hereafter may be prescribed by law,'\"\n\ndid not authorize the Legislature to provide that it might itself elect such officers. This Conclusion was, of course, as it had been before, upon the theory that the power to appoint to a state office was not a legislative function, and that the manner of appointment must conform to the division and delegation of powers.\n\nState ex rel. Collett v. Gorby, supra, involved the question of whether the Legislature might properly elect the director of the department of geology and natural resources. The opinion was written by Coffey,\n\nJ. The cases are reviewed, and it is pointed out that there is a conflict of opinion among the members of the court. It is said (page 22 of 122 Ind., page 680 of 23 N.E.):\n\n\"If it were agreed that an appointment to office was intrinsically the exercise of an executive or administrative function, then the Conclusion would so inevitably follow from the language used in section 1, article 3, of our Constitution, that the Legislature could not appoint, except in cases where the Constitution expressly confers such power, that the controversy would be at an end. But it is not so agreed. Indeed, the majority and the minority of the court have come to directly opposite Conclusions as to the nature of the appointing power conferred by our Constitution.\"\n\nAn examination of the opinions written by the various members of the court as them constituted discloses that only Mitchell, J., believed that the appointment to office was not intrinsically an exercise of the executive power. He was led to this belief, in part, as we have pointed out, by what seems to be a misapprehension concerning the source of the appointive power of the President. Elliott, J., had repeatedly said that the power is intrinsically executive. His difference with the other members of the court arose out of his Conclusion that, notwithstanding the power is intrinsically executive, it was not conferred upon the Governor by our Constitution except in specific instances. It is true that in the quotation it is said that the question was whether or not it was an exercise \"of an executive or administrative function,\" but nowhere in the cases, in this state or elsewhere, or in the textbooks, or in the writings of statesmen or scholars, do we ever find the contention that the appointment of a state officer is an administrative, that is to say, a ministerial function. In the cases in which the disagreement\n\namong the members of the court arose there was no contention that the function was ministerial, and hence it must be concluded that consideration of this distinction was not brought to the attention of the court. It was concluded that the Legislature could not fill the office under the Constitution.\n\nState ex rel. Yancey v. Hyde (1891), 129 Ind. 296, 28 N.E. 186, 13 L.R.A. 79, involved an appointment to the office of State Supervisor of Oil Inspection by the State Geologist. The opinion is by Coffey, C.J., the author of the opinion in the last case above referred to. It is concluded, first, that the Legislature may put an end to the tenure of any officer and provide a new mode of selecting a successor to take his place. This Conclusion seems in irreconcilable conflict with dictum in an opinion by the same author quoted earlier in this opinion. But the Conclusion is obiter dictum, since the case was decided upon an entirely different basis, and we have no present concern with that question.\n\nThe opinion refers to the case of State ex rel. Yancey v. Hyde (121 Ind. 20), supra, and State ex rel. Collett v. Gorby, supra, and says that any statements contained in those opinions were to be considered as dictum in so far as they affect anything but the office there involved.The opinion quotes the following from the latter case (page 307 of 129 Ind., page 189 of 28 N.E.):\n\n\"'In the creation of these, and kindred offices, it is within the power of the General Assembly to provide by law that such offices may be filled either by election or by appointment; and when to be filled by appointment it need not provide that such appointment shall be made by the Governor. Such appointments, if the law so provides, could, doubtless, be made by the Governor of the State, or by any one or more of the administrative State officers,'\"\n\nand says that this is to be considered as mere dictum. The question involved in the case referred to was the election of an officer by the General Assembly, so the question of whether or not the appointive power could be delegated to an administrative officer did not arise.\n\nIt is said in Humphrey's Executor v. United States, supra (page 627 of 295 U.S., page 873 of 55 S. Ct., page 1618 of 79 L. Ed.):\n\n\"Chief Justice Marshall, who delivered the opinion in the Marbury case, speaking again for the court in the Cohens case, said:\n\n\"'It is a maxim, not to be disregarded, that general expressions, in every opinion, are to be taken in connection with the case in which those expressions are used. If they go beyond the case, they may be respected, but ought not to control the judgment in a subsequent suit, when the very point is presented for decision. The reason of this maxim is obvious. The question actually before the Court is investigated with care, and considered in its full extent. Other principles which may serve to illustrate it, are considered in their relation to the case decided, but their possible bearing on all other cases is seldom completely investigated.'\"\n\nThe result reached in the Yancey case, supra, seems to be based upon the Conclusion that (page 309 of 129 Ind., page 190 of 28 N.E.):\n\n\"The appointment to office being generally the exercise of an executive or administrative function, the power must be conferred upon some executive or administrative officer, but the State Geologist is an administrative State officer, elected by the people.\"\n\nThere is no argument advanced, or reason given, or authority cited, to support this statement, and we are confronted with the fact that in numerous prior opinions the court had said that the power to appoint is intrinsically executive.If the quoted language may be\n\nconstrued as meaning that the appointment of subordinates to a state administrative office may be made by that officer, and that the appointment of all others in the executive including the administrative department may be made by the Governor, it is consistent with reason and authority and the former statements of the court limiting the manner of appointment within the division and delegation of powers. There is room to conclude from the language of the statute referred to in the case, and in a former case involving the State Geologist and Chief Oil Inspector, that the officer involved was considered by the court as a deputy or subordinate officer in the office of the State Geologist. If the language can be construed to mean that the appointment of subordinate executives, charged with the duty of assisting in the execution of the law and carrying the laws into effect, is an administrative function that can be delegated to an administrative officer, it is without support in the decisions, contrary to the teachings of the most highly respected authorities, and in direct conflict with the reasoning in the Supreme Court Commissioners' case above referred to. It is further in direct conflict with the Gray case, supra, in which it was held that state administrative officers could not be put upon boards to share executive powers with the Governor, since \"he alone is vested with the executive power of the State\" (page 578 of 72 Ind.), a statement which has never been doubted, but which has been repeatedly reaffirmed. If we are to adhere to the rule laid down in the Supreme Court Commissioners' case, that the appointment of those ministers and assistants who assist in performing the judicial function cannot be delegated to any one but the courts, and that rule has long been accepted and it must be adhered to, it\n\ncannot be seen that there is any distincton that will permit of holding that the Governor has not a like protection in his executive duty of executing the laws and taking care that they be faithfully executed. We prefer to construe the case as consistent with these rules, and as having been decided upon the theory that the officer involved was subordinate to a state administrative officer. It is said in the opinion (page 308 of 129 Ind., page 189 of 28 N.E.) that:\n\n\"The duties to be performed are such as pertain purely to the police.\"\n\nWhat was meant by this statement is not clear and the decision is not made to depend upon it. The police power is a sovereign power. Authority to enact laws is in the Legislature, but the power to enforce and execute the laws enacted under the police power is in the executive. Therefore if the duties to be performed by the officer pertain merely to the enforcement of police regulations, it is an executive office.\n\nFrench v. State ex rel. Harley, supra, referred to early in this opinion as approving the rule laid down in the Gray case, supra, involved the appointment of prison directors by a board consisting of the Governor, Auditor of State, Treasurer of State, Secretary of State, and the Attorney General. In a Discussion that was not depended upon as a basis for the result reached in the case, the court seems to have fallen into difficulty in respect to the provisions of Section 18 of Article 5 of the Constitution, which refers to filling vacancies in any office, the appointment of which vests in the General Assembly. After noting that the words \"election\" and \"appointment\" are used synonymously, it is said that, without having been directed to some provision of the Constitution supplying the office to be filled by the General Assembly, it must be concluded that there are\n\nnone, and that the words referred to are meaningless and confusing unless it be concluded that they refer to \"officers, whose appointment is not otherwise provided for in this Constitution,\" which led to the Conclusion that the Legislature might create new offices outside of the legislative department and provide for filing them by the General Assembly. We have referred to numerous cases holding that there were certain officers who were appointed by the General Assembly at the time the Constitution was adopted, and that these were the officers referred to by the expression, \"the appointment to which is vested in the General Assembly.\" But the court seems to have overlooked these cases. It is said that the contention made by one of the parties that the provision of Section 1 of Article 15 merely authorized the Legislature to provide the manner of appointment and did not confer appointive power (and this contention is sustained by the cases above referred to), required the Conclusion that all power to appoint to office is in the Governor, and, since no one else could appoint, the provision that the Legislature might provide the manner of appointment were mere meaningless words. (The contra cases above referred to seem to have been entirely overlooked.) This, too, was dictum, which the Conclusion reached in no way rests upon. If the question had not already been decided, the statements were repudiated in an opinion which we will refer to. It is said (page 624 of 141 Ind., page 3 of 41 N.E.):\n\n\"It is true that with sharp conflict of opinion these cases hold to the proposition that the power to appoint is an executive function. With this Conclusion, as we have said, we have no present duty to agree or to disagree, further than to maintain that, if this Conclusion is true, it could not prevent the people from making such distribution of that power as to them seemed wise or desirable. If this\n\nposition is at variance with the holding of those cases, be it so.\"\n\nAn established rule is recognized, and doubt at least as to whether the dictum announced conforms to the rule is indicated, together with an intention to adhere to the dictum regardless of the established rule. But the people had already distributed the powers of government. These powers are not distributed by legislative enactment, but by the Constitution, and if the power to appoint is an executive function, and this court and authorities everywhere have said so repeatedly, that power was vested in the Governor by the grant of executive power.But the result is not made to rest upon this Conclusion. It is said that practical construction sustains the view that the General Assembly had the right to appoint the prison officers. But it never before had been put upon that ground. It had always been agreed that prison officers had been appointed by the General Assembly at the time the Constitution was adopted, and that the power to appoint continued there under the \"now is\" clause. It is concluded (pages 634, 635 of 141 Ind., pages 6, 7 of 41 N.E.):\n\n\"To name the functionaries, therefore, was the privilege of the General Assembly, and it only remains to inquire if, in doing so in this instance, the commingling of the executive with administrative officers in the performance of the duty to appoint, has violated any provision of the constitution. Counsel urge that the power conferred constitutes an independent office, a board of appointment, and is not an addition of duties to offices already imposed; that 'no one can be associated with the Governor in the performance of executive duties,' quoting from Gray, Gov. v. State, ex rel., 72 Ind. 567 (578).\n\n\"We do not question the correctness of that holding, but, as we have already shown, the duty in question, while possibly in the nature of an executive\n\nduty, can not, under our constitution, be classed as an executive duty, since, by that instrument, the duty was entrusted to the legislative department for performance by it, or for the purpose of this question in the manner which it might prescribe.\n\n\"The contention that the association with the Governor, of administrative State officers, in the duty charged by the law in review, infringes his prerogative as the executive head of the State, rests upon the proposition that the power of appointment, in this instance, is an executive function. We should not incline to the view that, if an executive function, the duties and responsibilities attending the exercise of that function could be shared by administrative officers. (Our italics.) But, as we have shown, that is not the case before us. Nor do we find it necessary to our Conclusion that, while by constitutional permit the appointment may be made directly by the General Assembly, it must be done so, for, by the plain language of the constitution, the manner is a matter of choice by the General Assembly. This choice is not embarrassed by limitations or conditions, and to render it invalid it must be so exercised as to confer it upon some one or number incapable of its performance.\"\n\n(But in many former cases that are not noticed, it is squarely held that the choice of the manner of appointment is embarrassed by the limitations imposed by the division and distribution of powers.)\n\nWe interpret the case as concluding that, admitting the appointment to office is generally an executive function, since the Constitution by specific exception vested these particular appointments in the General Assembly, the power to appoint became a legislative function and not an executive function exercised by the Legislature; that, since it is a legislative function, the Legislature might itself appoint, without invading the prerogatives of the Governor; and, finally, that, since the appointment is a legislative function, the Legislature might choose the manner of appointment,\n\nunembarrassed or unlimited by any conditions, even the provisions of Section 1 of Article 3 concerning the overlapping of powers, and vest the appointing power in ministerial officers. It is said (page 635 of 141 Ind., page 7 of 41 N.E.):\n\n\"There is no expressed inhibition of our Constitution to the discharge of this duty by executive or administrative officers, or by both classes of officers.\"\n\nIf this is true, it may also be said that there is no expressed inhibition to the discharge of the duty of making these appointments by the Judges. It is then argued that Section 1 of Article 3 does not prohibit officers in one department from being joined with other officers in that department in the exercise of functions of that department, and that therefore the Governor might be joined with administrative officers in making appointments. But the right to delegate appointive power is limited not only by the provision for the division of powers, but also by the delegation of power. The Gray case, supra, which is cited and not disapproved, squarely holds that such officers may be joined with the Governor in the exercise of administrative, that is to say, ministerial functions, but that they may not be joined with him in the exercise of executive functions. It is said (page 636 of 141 Ind., page 7 of 41 N.E.):\n\n\"It will be observed that it is not forbidden that those assigned to one department shall exercise any of the functions of another within such department.\"\n\nBut it is forbidden that administrative officers in the judicial department shall exercise judicial functions, for those functions are committed to the courts alone, and, while the General Assembly may create offices\n\nfor its convenience, and to assist it in ministerial matters, secretaries, clerks, etc., it has never been doubted that the Constitution forbids that the General Assembly should delegate the law-making power, which is the legislative power, to any such administrative officers; and it seems to logically follow that, although there are administrative officers and an administrative department included within the executive, the express delegation of the executive power to the Governor precludes the delegation of any such power to the administrative officers.Since the appointment to office, other than the appointment of subordinates under the specific administrative officers, is clearly an executive function, the power must vest in the Governor, and not elsewhere. In concluding the opinion there is a Discussion of the rule that doubts as to constitutionality must be resolved in favor of constitutionality, which, together with other language referred to, tends to create the impression that the result was not reached confidently. The opinion cannot be considered as authority for anything more than the Conclusion that officers, the appointment of whom was expressly vested in the General Assembly by the Constitution, may be appointed by boards consisting of the Governor and state administrative officers. So far as we are able to ascertain, no office or officer whose appointment was authorized by the Legislature in the Constitution is involved in the case at bar.\n\nOvershiner v. State, supra, is a criminal case. It is an appeal from a conviction of the appellant for practicing dentistry without a license. The appellant questioned the constitutionality of the law establishing a board of examiners, which, by the statute, consisted of five persons, one named by the Governor, one by the State Board of Health, and three by the Indiana State\n\nDental Association, which gave that independent and nongovernmental organization control of the board. It was contended that the act was unconstitutional, since, under the Constitution, the Legislature had no power \"to confer the power of appointment upon a private corporation, or individual outside the executive department.\" The law was held to be constitutional. It is said in the opinion (page 189 of 156 Ind., page 469 of 59 N.E.):\n\n\"And while it has been many times decided by this and other courts that, as a general rule, the power of appointment to office is an appropriate executive prerogative, yet, as said by Mitchell, J., in Hovey v. State, 119 Ind. 401, 'It is a fundamental error, however, to assume that the exclusive right to exercise the power of appointment is included in the general grant of power to the executive.' In the distribution of governmental power the people had the undoubted right to lodge any part of it where it pleased them, and when expressly placed the court will suffer no encroachment upon it by those acting in another department; but where the Constitution is silent and the question is one of public policy, or relates to the best means or agency for the attainment of some governmental end, it must be presumed that the framers of the Constitution intended to invest the legislative body with a large discretion in the selection of the agencies most suitable and beneficial to the public.\n\n\"In People v. Hurlburt, 24 Mich. 44, 93, Cooley, J., says: 'The legislature, in prescribing new rules, have necessarily a large discretion as to whether the agencies for putting them in force shall be named by themselves, or left to the selection of the executive.'\"\n\nThe opinion by Mitchell, J., referred to, is a minority opinion, though it appears in the reports as the principal opinion. Three members of the court, Concurring in the result, expressly disagreed with the reasoning, and, furthermore, it has never\n\nbeen contended anywhere that the general grant of executive power to the Governor carried with it the exclusive right to the power of appointment. All will agree that in the distribution of the governmental power the people had the undoubted right to lodge any part of it where it pleased them. And the Constitution is not silent. It has vested all of the governmental power, which was not reserved in the sovereign people, to a government consisting of three departments, and it has left no discretion in the Legislature to distribute governmental power outside of those three departments. It is true that the Legislature may create new offices within the departments, and provide for the selection of officers to operate those offices, but it is unthinkable that the Legislature may have discretion to vest a part of the sovereign power in some agency outside the government, as set up and established by the Constitution. The appointment to office is universally held to be an exercise of the sovereign power. The State Dental Association is a private nongovernmental agency. It was chartered, it is true, by the State, as other private corporations are chartered, but its officers and membership are privately selected. It is said that the corporation is composed of practicing dentists, organized for the promotion of scientific knowledge and skill in the practice of the profession, and well informed on the subject, and possessing a peculiar interest in the profession. But the court may not weigh considerations of wisdom and expediency for the purpose of determining the constitutionality of legislative action. If the Legislature has power to go outside of the government established by the Constitution and confer governmental power elsewhere, then the discretion as to where it will be vested, and the determination of the expediency of the investure in one place rather than another,\n\nis for the Legislature and not for the courts. If the Legislature should attempt to invest the State Dental Association with power to appoint members of the State Highway Commission, the courts could not hold the statute unconstitutional because in their judgment it would have been wiser to vest that power in an association of highway engineers. Such an enactment could only be stricken down upon the ground that the Legislature had no constitutional power to vest a governmental function elsewhere than in one of the three departments of the government created by the people in their Constitution.\n\nThe Michigan case quoted from involved the right of local self-government -- the right of the Legislature to appoint city officers.The court expressly refrained from deciding the question of whether the appointment there involved was the exercise of an executive or a legislative function. Judge Cooley did use the language quoted as a general statement in the beginning of his separate opinion. He pointed out that the board involved was in the nature of a city council with legislative power; but, notwithstanding this fact, he believed the Legislature might not make permanent appointments. He thought perhaps that the Legislature might provide for the provisional filling of the offices until such time as officers could be locally elected or appointed, but expressly refrained from reaching a definite Conclusion that even this might be done. It is seen therefore that the preliminary statement quoted must be greatly qualified by his further Discussion and the Conclusion which he reached. The statements quoted from Chief Justice Marshall in McCulloch v. Maryland (1819), 4 Wheat, 316, 4 L. Ed. 579, are general statements and nothing more, and those cases are not authority\n\nfor a Conclusion that the Legislature has discretion to set up other governmental departments or agencies outside of the Constitution, or to delegate part of the sovereign power to independent and nongovernmental agencies. The fact that the Legislature may set up monopolies for operating slaughter houses does not support the Conclusion reached. The Legislature has set up monopolies in the public utility field for the public good, but this does not justify the Conclusion that it may vest in a public utility corporation power to appoint the members of the Public Service Commission, nor that it may vest in a labor union power to appoint members of the Workmen's Compensation Board. Whether the result reached in the Overshiner case, supra, was correct upon the ground that the members of the board appointed by the Dental Association were commissioned by the Governor, and hence became his appointees if the appointment by the Dental Association was void and of no effect, or whether the members of the board, being de facto officers, the legality of their appointment could not be collaterally attacked, we need not decide. It may be assumed that the result reached in the case, the affirmance of a conviction in a criminal case, was correct, but we cannot approve of the view expressed in the opinion that the Legislature has authority to delegate sovereign governmental powers to agencies outside of the government established by the people in the Constitution. The views expressed in the opinion are squarely in conflict with the many cases above referred to, which confine the legislative discretion in providing for appointments within the provisions for division and delegation of the governmental powers, and it is in conflict with the case next discussed.\n\nIn State ex rel. Geake et al. v. Fox, Comptroller (1902), 158 Ind. 126, 139, 63 N.E. 19, 24, 56 L.R.A. 893, the court quotes Article 15, Section 1, of the Constitution:\n\n\"'All officers whose appointments are not otherwise provided for in this Constitution shall be chosen in such manner as now is, or hereafter may be, prescribed by law.'\"\n\nAnd continues with respect to this provision:\n\n\". . . it should be observed that the language is not, 'All officers whose selections are not otherwise provided for.' There are two distinct methods of selecting officers recognized by the Constitution, one by election, and one by appointment; and specific provisions as to both are prescribed in many instances. The language of this provision is clear, and we perceive no reason for holding that it means other than what it says, that all officers whose appointments are not otherwise provided for may be chosen in such manner; that is, by election or appointment, as may be prescribed by law.\"\n\nIn other words, the power of the Legislature to prescribe the manner in which officers shall be chosen is limited by the provisions of the Constitution. This is the latest construction of Article 15, Section 1, by this court, that has come to our attention.\n\nThe powers conferred on the so-called boards of appointment under Chapter 13 are executive in character. The principal duty of these boards is to select and appoint the executives who serve upon the boards and commissions and fill the offices that execute and supervise the execution of the laws respecting a major part of the affairs of the general government of the state. The officers to be appointed by the boards execute the laws and carry them into effect; they exercise the executive authority to employ deputies and assistants, to fix salaries, and\n\nto terminate employments, within their divisions, at their pleasure, subject to the approval of the appointing boards, however. It is not contended by the appellants that the functions of the boards are not executive functions, and such a contention would be of no avail in view of the obvious facts. Control and domination of the boards is vested in ministerial state officers and in the Lieutenant Governor, who can have no general executive power, since the executive power vests in the Governor.\n\nSince the functions of the boards involved are executive and not ministerial, although they are described as administrative in the statute, and since they are not judicial, they must fall either within the executive department or the legislative department. If they are within the executive department, power to make the appointment can be vested only in the Governor. If they fall within the legislative, authority to make the appointment cannot be lodged in officers in the administrative department, since that department is included within the executive, and officers within it cannot be assigned legislative duties.\n\nThe interim Attorney General is referred to in the act as an employee, but the duties and functions delegated to him by the act involve an exercise of a portion of the sovereign power. He appoints deputies, and employees are not thought to have deputies; fixes their salaries; and is authorized to draw vouchers upon the State Treasury in his own discretion, limited only by the total appropriation theretofore made for the Attorney General's office and the Department of Law. This is discretion to spend the total funds, uncontrolled by the judgment of any other executive officer. The provision that his expenditures are limited by the amounts appropriated applies to all -- even the highest\n\nand most powerful offices. The exercise of discretion in employing deputies and persons to assist in taking care of the state's business, and to fix their salaries, and to incur expenses to be paid out of the general funds, is an exercise of part of the functions of a sovereign. It is well settled that any one intrusted with part of the sovereign power is an officer. The fact that the statute provides that he shall not be required to take an oath is conceded to be of no effect if, in fact, his duties are those of an officer, since the Constitution requires all officers to take an oath. Even if it might be said that the Attorney General is a ministerial officer, his duties are not confined to matters which are incidental to any one or all of the constitutional administrative officers, and, since they have only such executive appointing power as is incidental to their administrative duties, the executive power to appoint the Attorney General cannot vest in them, but must best in the Governor, where the general executive power is lodged.\n\nAnd as to the Board of Education the same is true. It has executive power.The primary duties involve an exercise of executive discretion. The Legislature may confer ministerial duties upon the Lieutenant Governor, but, while he is in the executive department, it may only vest him with executive power subordinate to the Governor, since all of that vests in the Governor. If the Lieutenant Governor should be by statute vested with ministerial duties, he might exercise executive powers incidental to those ministerial duties, but it cannot be imagined that the functions of the State Board of Education come within the scope of any ministerial duties that have been or might be put upon the Lieutenant Governor.\n\nWe need not consider the contention of the appellees that the act abolishing the former office of Attorney\n\nGeneral, and setting up the new office of Attorney General, is but a subterfuge to screen the removal of a state officer without impeachment. For the purposes of the case, it may be assumed that the office of interim Attorney General is a new office, but since the provision for appointment to the office is unconstitutionally lodged in ministerial officers, so much of that statute as vests the appointing power is unconstitutional and void.\n\nIn State ex rel. Collett v. Gorby, supra (pages 29 and 30 of 122 Ind., page 682 of 23 N.E.), the court said:\n\n\"Finally it is contended that if the provision of the statute which reserves to the General Assembly the power to fill the office created thereby falls, the whole act must fall with it, for the reason that we cant not presume the General Assembly would have passed the law, had it not believed it possessed the power to elect the incumbent.\n\n\"Such an assumption can only be maintained upon the supposition that the General Assembly created the office in question for the sole purpose of providing a place for some particular partisan or individual. We can not attribute to a co-ordinate branch of the government an object so unworthy of it and of its well known duties. We must attribute to that body the belief that the office in question was demanded by the public necessity, and that it was created for that reason, without reference to the constituency which should choose the person by whom it should be administered. Striking from the law the provision reserving to the General Assembly the power to elect the incumbent to the office thereby created, it leaves a perfect law, capable of being executed according to the intention of the Legislature, as therein expressed. Under such circumstances that which is unconstitutional will be rejected, and the remainder will stand as the law. State, ex rel. v. Blend, 121 Ind. 514, and authorities there cited. . . .\n\n\"From what we have said it necessarily follows that the General Assembly had no power to appoint or elect the appellee to the office he now claims, and that the Governor of the State had the right to fill the vacancy therein by the appointment of the appellant.\"\n\nThe vacancy thus created by a failure of the provision for appointment within the statute, because of unconstitutionality, may be filled by the Governor under the authority vested in him to fill vacancies in state offices by Section 18 of Article 5 of the Constitution.\n\nThe statute involving the State Board of Education is unconstitutional is so far as it seeks to place the appointing power upon the Lieutenant Governor. Some appointive power is there directly conferred upon the Governor. He may exercise full power to appoint the entire board upon the theory that, with respect to those in which the statute does not authorize him to appoint, there is a vacancy in the office.\n\nChapter 13 is designed to do nothing more or other than confer executive appointing power and other executive duties upon the boards in which administrative officers are associated with the Governor and in which they are given discretionary control.This statute is therefore unconstitutional and void in its entirety.\n\nThe terms and tenure of all of the officers and employees of the various boards, commissions, agencies, and offices to which the new appointive boards set up by this statute were given the appointive power, are declared by the statute to be vacant upon the taking effect of the act. Since the act is unconstitutional and void, it does not take effect, and the appointment of these commissions, officers, and employees must be considered to rest wherever it was theretofore placed by constitutional enactments of the\n\nLegislature. If there are no such constitutional provisions for appointment, and the offices become vacant, the appointment to fill the vacancies may be made by the Governor under Section 18 of Article 5 of the Constitution.\n\nOur Conclusion requires that the judgment of the trial court be in all things affirmed.\n\nJudgment affirmed.\n\nRichman, J., Dissents with opinion.\n\nDisposition\n\nAffirmed.\n\nRICHMAN, J. DISSENTING OPINION By this Dissent I express no approval of the governmental policy of the statutes in question nor of the statutes sought thereby to be repealed or amended. My only concern is the purely legal question of validity under the Constitution. In this inquiry I disagree with the other Judges on basic principles which permit no compromise. My position will be first stated and then I shall discuss as briefly as possible the major premises upon which the majority take their stand.\n\nIn the years following the election of Governor Hovey the Judges of this court in many cases and from many angles debated the question of the appointing power under the Constitution. The issue upon which the Judges never agreed was whether the Legislature could create an office and itself fill that office. That question was settled in the negative with Judges Elliott and Mitchell Dissenting. In one of those Dissenting opinions, State ex rel. Yancey v. Hyde (1889), 121 Ind. 41, 22 N.E. 644, Judge Elliott said:\n\n\"I have searched with all possible care, but I can find no decision which sustains the contention of the relator, that the appointing power resides in the Governor.\"\n\nThe present issue is not whether the Legislature may appoint the officers, but whether the appointing power may be given to boards in the \"Executive-Administrative\" department of the government, over the Governor's claim of interference with his prerogative. On that issue \"I can find no decision which sustains the contention . . . that the appointing power resides in the Governor.\"\n\nOur Constitution has had almost ninety years of judicial and legislative interpretation. This I cannot disregard. \"The oath of the judiciary is to construe the constitution as it is, and not as it might have been.\" State ex rel. Withycombe v. Stannard (1917), 84 Ore. 450, 165 P. 571.\n\nIn French v. State ex rel. Harley (1895), 141 Ind. 618, 41 N.E. 2, 29 L.R.A. 113, this court decided the principal issue which is now before us. The sole question then presented by the parties was succinctly stated in appellee's brief therein:\n\n\"Has the General Assembly the power under the Constitution of the State to impose upon a Board composed of executive and administrative State officers the duty of selecting an administrative State official, notwithstanding the contention of the Governor, that the power of appointment is a constitutional prerogative of the Governor, of which he can not be deprived by an act of the Legislature.\"\n\nThe answer then was in the affirmative and should be now. Every substantial argument herein made to the contrary was made in the briefs filed by Mr. French. The decision then was in harmony with judicial dicta and legislative practical exposition from 1852 until 1895. Almost fifty years have since passed with no judicial decision nor dictum casting any doubt upon the views then held. During that time the Legislature has continued its practical exposition in harmony with the\n\ncourt's decision. If, upon consideration of abstract principles of governmental functions a different opinion could have been reached, I think it is now too late for we must take the Constitution \"as it is, not as it might have been.\"\n\nIf the French decision, supra, might have been put solely on other ground, the fact remains that it was not. The issue was clearly stated, as above, ably briefed and decided. I do not believe that the majority opinion gives a fair interpretation of its holding. On that score, however, the case must speak for itself.\n\nThe substantial argument against the decision is: Article 3, Section 1 separates the powers; Article 5, Section 1 grants all executive power to the Governor; appointment to office is an executive function; therefore all power of appointment is in the Governor. It must be so because otherwise the Governor could not \"take care that the laws be faithfully executed.\" So French contended and was ruled against.\n\nWe now have two additional contentions, one, that the authority to sign commissions, conferred by Article 15, Section 6, implies the power to appoint all those who shall be commissioned and, the other, that the reasoning of the majority in Myers v. United States (1926), 272 U.S. 52, 71 L. Ed. 160, 47 S. Ct. 21, and their construction of the Constitution of the United States, upon which ours was patterned, is a binding analogy.\n\nBut Mr. Justice Holmes in his inimitable way then said, Dissenting, (page 191 of 71 L. Ed.):\n\n\"My brothers McReynolds and Brandeis have discussed the question before us with exhaustive research and I say a few words merely to emphasize my agreement with their Conclusion.\n\n\"The arguments drawn from the executive power of the President, and from his duty to appoint officers of the United States (when Congress does not\n\nvest the appointment elsewhere), to take care that the laws be faithfully executed, and to commission all officers of the United States, seem to me spiders' webs inadequate to control the dominant facts.\n\n\"We have to deal with an office that owes its existence to Congress and that Congress may abolish tomorrow. Its duration and the pay attached to it while it lasts depend on Congress alone. Congress alone confers on the President the power to appoint to it and at any time may transfer the power to other hands. With such power over its own creation, I have no more trouble in believing that Congress has power to prescribe a term of life for it free from any interference than I have in accepting the undoubted power of Congress to decree its end. I have equally little trouble in accepting its power to prolong the tenure of an incumbent until Congress or the Senate shall have assented to his removal. The duty of the President to see that the laws be executed is a duty that does not go beyond the laws or require him to achieve more than Congress sees fit to leave within his power.\"\n\nAnd nine years later, in Humphrey's Executor v. United States (1935), 295 U.S. 602, 79 L. Ed. 1611, 55 S. Ct. 869, the whole court agreed that all the dicta of Chief Justice Taft of the majority and Justices Brandeis and McReynolds of the minority meant nothing beyond the narrow decision that a \"purely executive\" officer appointed by the President with the consent of the Senate might be removed by the President without regard to the congressional will. The court further said, (79 L. Ed. 1619):\n\n\"The Federal Trade Commission is an administrative body created by Coingress to carry into effect legislative policies embodied in the statute, in accordance with the legislative standard therein prescribed, and to perform other specified duties as a legislative or as a judicial aid. Such a body can not in any proper sense be characterized as an arm or an eye of the executive. Its duties are performed\n\nwithout executive leave and, in the contemplation of the statute, must be free from executive control. In administering the provisions of the statute in respect of 'unfair methods of competition' -- that is to say in filling in and administering the details embodied by the general standard -- the commission acts in part quasi-legislatively and in part quasi-judicially. In making investigations and reports thereon for the information of Congress under § 6, in aid of the legislative power it acts as a legislative agency. Under § 7, which authorizes the commission to act as a master in chancery under rules prescribed by the court, it acts as an agency of the judiciary. To the extent that it exercises any executive function -- as distinguished from executive power in the constitutional sense -- it does so in the discharge and effectuation of its quasi-legislative or quasi-judicial powers, or as an agency of the legislative or judicial department of the government.\"\n\nIf there is any analogy by which we are controlled it is found in the holding that over the objection of the Congress Mr. Humphrey could not by the President be removed from the Federal Trade Commission because he was not a \"purely executive\" officer. If we desired, our decision might be put on just this ground, that there are no \"purely executive\" officers to be appointed under the laws in question, so that the legislative will may be interposed against the claim of executive prerogative.\n\nNot one of the boards or commissions whose personnel is involved, is purely executive in its character. All are listed in § 6, § 7, § 8 and § 9 of Ch. 13, Acts of 1941, except of course the Attorney General's office and the Board of Education. They may be classified, so as generally to indicate their functions, as follows:\n\n1. Boards regulating businesses, trades, professions and industries created by statutes enacted in the exercise of the police power. Most, if not all of them, are\n\nin aid of regulatory legislation. They have fact finding powers and make some decisions. They include Board of Registration for Architects, § 63-102, Burns' 1933, § 3958, Baldwin's 1934; State Board of Barber Examiners, Acts 1941, ch. 77, p. 192, § 63-342, Burns' 1933 Supp., § 4082-15, Baldwin's Supp. 1941; State Board of Beauty Culturist Examiners, § 63-1801, Burns' 1933 (Supp.), § 4083-1, Baldwin's Supp. 1935; State Board of Dental Examiners, § 63-501, Burns' 1933, § 5586, Baldwin's 1934; State Board of Embalmers and Funeral Directors, § 63-701, Burns' 1933, § 7458, Baldwin's 1934; State Board of Registration for Professional Engineers and Land Surveyors, § 63-1517, Burns' 1933 (Supp.), § 7489-1, Baldwin's Supp. 1935; State Board of Medical Registration and Examination, § 63-1301, Burns' 1933, § 10703, Baldwin's 1934; Indiana State Board of Examination and Registration of Nurses, § 63-901, Burns' 1933, § 13031, Baldwin's 1934; Indiana State Board of Registration and Examination in Optometry, § 63-1001, Burns' 1933, § 13169, Baldwin's 1934; Board of Podiatry Examiners, § 63-1401, Burns' 1933, § 13309, Baldwin's 1934; State Live Stock Commission, § 42-910, Burns' 1940 Replacement, § 3923-1, Baldwin's Supp. 1935; Indiana Board of Pharmacy, § 63-1101, Burns' 1933, § 13275, Baldwin's 1934; Indiana State Board of Examiners in Watch Repairing, § 63-2301, Burns' 1933 (Supp.), § 10498-1, Baldwin's Supp. 1939; Veterinary Examining Board, § 63-1701, Burns' 1933, § 3943, Baldwin's 1934; Stallion Enrollment Board, § 16-901, Burns' 1933, § 3784, Baldwin's 1934; Department of Insurance, § 39-3301, Burns' 1940 Replacement, § 9495-1, Baldwin's Supp. 1935; Chief Oil Inspector, § 35-2117, Burns' 1933 (Supp.), § 9401-1, Baldwin's Supp. 1937 and 1941; State Athletic Commission, § 63-201, Burns' 1933, § 3985, Baldwin's 1934; State Board of Certified Accountants\n\nof Indiana, § 63-401, Burns' 1933, § 3504, Baldwin's 1934; The Department of Financial Institutions, § 18-201, Burns' 1933, § 7726, Baldwin's 1934; Division of Labor, including Industrial Board, Bureau of Mines and Mining, Bureau of Factory Inspection, Bureau of Boiler Inspection, and Bureau of Women and Children, § 40-2102, Burns' 1940 Replacement § 10000-2, Baldwin's Supp. 1937; State Livestock Sanitary Board, § 16-501, Burns' 1933, § 3924, Baldwin's 1934; Pollution Hearing Board, § 68-501, Burns' 1933 (Supp.), § 8424-1, Baldwin's Supp. 1935; and Public Service Commission of Indiana, § 54-101, Burns' 1933, § 13906, Baldwin's 1934.\n\n2. Boards having to do with the making, publishing, and keeping of public records. They include Indiana Library and Historical Department, including State Library and Historical Bureau, § 63-802, Burns' 1933, § 10259, Baldwin's 1934; Commission on Public Records, § 63-1901, Burns' 1933 (Supp.), § 5400-1, Baldwin's Supp. 1935; The Indiana Year Book, § 60-1001, Burns' 1933, § 15436, Baldwin's 1934.\n\n3. Boards concerned with taxation: Gross Income Tax, including Director, § 64-2628, Burns' 1933, § 16008, Baldwin's 1934; Motor Vehicle Fuel Tax, § 47-1501, Burns' 1940 Replacement, § 16024, Baldwin's 1934; Inheritance Tax Administrator, § 6-2432, Burns' 1933, § 15970, Baldwin's 1934; State Board of Tax Commissioners, § 64-1301, Burns' 1933, § 15705, Baldwin's 1934.\n\n4. Boards conserving and regulating the use of public property including Department of Conservation, § 60-701, Burns' 1933, § 4815, Baldwin's 1934; State Highway Commission, § 36-101, Burns' 1933, § 8640, Baldwin's 1934; Board of Public Buildings and Property, § 49-2401, Burns' 1933, § 15401, Baldwin's 1934; New Harmony Memorial Commission, § 63-2201, Burns' 1933 (Supp.), § 10848-8, Baldwin's Supp. 1939; The Indiana\n\nBoard of Public Harbors and Terminals, § 68-701, Burns' 1933 (Supp.), § 16310, Baldwin's Supp. 1939.\n\n5. The Legislative Bureau, § 63-837, Burns' 1933 (Supp.), § 14946-1, Baldwin's Supp. 1939; and State Budget Committee, § 60-401, Burns' 1933, § 15096, Baldwin's 1934, which are in aid of legislative duties, the latter with reference to taxation.\n\n6. Agencies Handling trust or state funds: The Indiana State Teachers' Retirement Fund, § 28-4501, Burns' 1933, § 6729, Baldwin's 1934; Board for Depositories, § 61-643, Burns' 1933 (Supp.), § 13844-64, Baldwin's Supp. 1937; and Municipal Loan Board, § 61-1101, Burns' 1933 (Supp.), § 12504, Baldwin's Supp. 1937.\n\n7. Miscellaneous boards: Administration of Motor Vehicle Laws on Registration, Certificates of title, and Operators' and Chauffers' Licenses, § 47-1801, Burns' 1940 Replacement, § 11189-11, Baldwin's Supp. 1939, which could go either in paragraph 1 or 3, supra, State Board of (Election) Canvassers, § 29-525, Burns' 1933, § 7211, Baldwin's 1934; Commission on Interstate Cooperation, § 63-2101, Burns' 1933 (Supp.), § 10226, Baldwin's Supp. 1937, which determines and exercises the public policy of this state with regard to its relations with other states; Division of State Publicity, § 60-1201, Burns' 1933 (Supp.), § 14990-1, Baldwin's Supp. 1939, which is an advertising agency; Central Purchase Bureau of Indiana, § 60-601, Burns' 1933, § 15179, Baldwin's 1934, which purchases supplies for all departments of government; and State Board of Health, § 35-101, Burns' 1933, § 8386, Baldwin's 1934, whose functions are well known to be in the exercise of the police power.\n\nIt would unduly extend this opinion to develop the reasons why I think many of these agencies are more closely related to the legislative, and some more to the judicial, than the executive department of the government.\n\nThe Industrial Board and Public Service Commission are not so unlike the Federal Trade Commission as to be beyond the scope of the holding in the Humphrey case, supra. Of another Highway Commission it was said: \"We are of the opinion that the State Highway Department is a legislative rather than an executive instrumentality, and consequently in the regulation of that Department we perceive no invasion of the executive prerogatives.\" State ex rel. Morford, Atty. Genl. v. Emerson et al. (1939), Super. Ct. Del., 10 A. (2d) 515, 523, Aff'd 14 A. (2d) 378. It is recognized also that the taxing function is peculiarly legislative. State Board of Tax Commissioners v. Holliday (1898), 150 Ind. 216, 49 N.E. 14, 42 L.R.A. 826. The boards having to do with the safe keeping and disbursement of public funds, after they have been raised by taxation, are clearly within the province of the Treasurer of State, certainly not a primary concern of the Governor. And one fund particularly, the Teachers' Retirement Fund, is an independent trust that might like other trusts more properly be under the supervision of a court than the executive branch of the government.\n\nThe majority say that \"the creation of the offices is a legislative function.\" With this I agree. It is also a legislative function to determine the qualifications of the officers and by whom they shall be appointed. The act of appointment only is executive. If there be any force in the views of the court in the Humphrey case, supra, it seems that such appointment is the exercise of an \"executive function -- as distinguished from executive power in the constitutional sense\" and that in such capacity the appointing board acts as \"an agency of the legislative or judicial department of the government\" depending upon whether or not the particular administrative board or commission is charged with the\n\nexercise of quasi-legislative or quasi-judicial powers. If this be true the appointing board can in no sense be said to be exercising purely executive power.\n\nWithout pursuing this subject further I return to the consideration of appellees' argument which is further based on the constitutional provision that all commissions shall be in the name of the state \"and signed by the governor.\" Article 15, Section 6. This does not require that every officer shall be commissioned, nor make title to an office depend upon a commission, Shuck v. State ex rel. Cope (1893), 136 Ind. 63, 70, 35 N.E. 993; Russell v. State ex rel. (1909), 171 Ind. 623, 634, 87 N.E. 13. In State ex rel. Cornwell v. Allen (1863), 21 Ind. 516, 521, is a remark, \"that, it is probably the law that where the title to an office is solely derived from Executive appointment, the commission of the Executive is the only legal evidence of such title.\" But because the governor must sign the commission it is not a necessary inference that he has the power to appoint the person to be commissioned. The Judges of this court hold commissions signed by the Governor. He could not override the will of the electorate by declining to sign such commissions nor can he by withholding his signature veto the appointment of any officer other than one \"purely executive\" and one whom he is permitted or required to appoint. The additional contentions therefore add nothing to the argument which in the French case, supra, did not convince this court.\n\nThe Governor by Article 5, Section 16 is not required to execute the laws but \"to take care that the laws be faithfully executed.\" If officers fail to perform their duties, the Governor may remove them if the Constitution gives him that right or, if not, \"bring the subject to the cognizance of that department of the government which has the power to remove or punish them.\" Shields\n\net al. v. Bennett (1864), 8 W. Va. 74, 89. He may cause an officer to perform his duties by proceeding in court for a judicial mandate. State ex rel. Withycombe, Gov. v. Stannard, supra. He may in sufficient emergency call out the militia who are under his exclusive control as commander-in-chief. See Shields v. Bennett, supra. From the constitutional requirement \"it does not follow, as a necessary Conclusion, that, in order to perform this duty, he must have agents of his own nomination. Our form of government, in its various changes, has never recognized this power as an executive prerogative.\" Mayor and City Council of Baltimore v. Howard et al. (1860), 15 Md. 376, 455, 456.\n\nIt is not a necessary implication from the grant of executive power to the Governor that he has the exclusive power of appointment to office. If this were true courts would have to look beyond the judicial department for appointment of masters in chancery, receivers and other judicial officers. No one will contend this is necessary. The Legislature was not permitted to name commissioners to aid the court. State ex rel. Hovey v. Noble, infra. The reasoning therein compels the view that the court would not have tolerated such appointments by the Governor. So that the appointive power is not exclusively in one, but as shown in the French case, supra, may be and is exercised by all three departments of the government.\n\nThe last sentence of Article 15, Section 2 provides that \"the General Assembly shall not create any office, the tenure of which shall be longer than four years.\" In Baker, Governor v. Kirk (1870), 33 Ind. 517, 527, it was said that: \"This section confers upon the legislature the power to create offices not provided for in the constitution, and to fix the tenure of such offices.\" The right of the Legislature to create new offices might without\n\nthis section have been assumed, else we would accuse the convention of an astonishing lack of vision.\n\nIn close connection with this authorization is the preceding section, Article 15, Section 1 providing that \"all officers, whose appointment is not otherwise provided for in this Constitution, shall be chosen in such manner as now is, or hereafter may be, prescribed by law.\" I find in this section a significance which appellants stress and appellees refuse to concede. To me it seems to be the final step in the reasoning which I restate as follows:\n\nWhile the appointing act is an executive function, it may be and is exercised by every department of government. The people may determine to whom the power shall be delegated in any case. The Constitution discloses that the grant of executive power to the Governor was not intended to convey to him the exclusive power of appointment for it expressly recognizes certain appointing power as existing in the General Assembly. The power to appoint certain officers was by express grant given to the Governor. This was supererogation if all appointing power was carried in the general grant of executive power. That general grant was therefore not all-inclusive but on the contrary carried no appointing power beyond that pertaining to the functioning of his own office. And finally Article 15, Section 1, declares that all appointments not otherwise provided shall be made in such manner as may be prescribed by law. The Conclusion is that the Legislature may determine who shall appoint the administrative officers referred to in certain cases and these include the cases designated in the questioned statutes. With this interpretation no constitutional provision is overlooked and to every one is ascribed some effectual significance. The offices were created by the Legislature who assigned\n\nto a board of executive and administrative officers the selection of the incumbents and the supervision of their administrative activities. This the Constitution permits.\n\nBut appellees would limit the application of Article 15, Section 1 to only such offices as were in existence in 1852, relying upon the words of Coffee, J., in State ex rel. Jameson v. Denny, Mayor (1889), 118 Ind. 382, 390, 21 N.E. 252, 4 L.R.A. 79. He was then endeavoring to find some express grant to the General Assembly of the appointing power recognized but not granted in Article 5, Section 18 and did find it in Article 15, Section 1. He did not say that this was the only function of the section. Nor did he think so. His Conclusion was only that this section did not give the General Assembly itself the appointing power to any office not existent when the constitution was adopted.\n\nLess than a year later he said in State ex rel. Collett v. Gorby (1890), 122 Ind. 17, 25, 23 N.E. 678:\n\n\"This section does apply to most of the statutory State offices. Under its provisions the General Assembly has created the office of mine inspector, oil inspector, trustee of the new benevolent institutions, state prisons, reformatory institutions, state board of health, state board of charities, and many other offices, and has made the incumbents of such offices appointive, as it had the undoubted power to do. In the creation of these, and kindred offices, It is within the power of the General Assembly to provide by law that such offices may be filled either by election or by appointment; and when to be filled by appointment it need not provide that such appointments shall be made by the Governor. Such appointments, if the law so provides, could, doubtless, be made by the Governor of the State, or by any one or more of the administrative State officers.\n\n\"We are not aware that a different doctrine has ever been advanced or advocated by any one.\"\n\nAnd in the following year, speaking for a unanimous court in State ex rel. Yancey v. Hyde (1891), 129 Ind. 296, 308, 28 N.E. 186, 13 L.R.A. 79, he said:\n\n\"The office is not an administrative State office, whose incumbent is charged with the administration of a separate department of the State government. The duties to be performed are such as pertain purely to the police. It is an office, therefore, which may be filled by appointment, and as the appointment of the incumbent is not provided for in the Constitution, the case falls clearly within the provisions of section 1, article 15. That section applies to such officers only as may be appointed, and for whose appointment no provision is made in the Constitution. As the incumbent of the office in question may be appointed, and as no provision is made in the Constitution for his appointment, the General Assembly has the power to provide by law for the manner of his selection. It has the power to provide that such office shall be filled by popular election, or that it shall be filled by appointment. While the appointment to office is, generally, the exercise of an executive or administrative function, we do not think it must, of necessity, be made by the Chief Executive, for by the terms of section 1, article 3, of the Constitution, the executive department of the State includes the administrative. Of course, it was not the intention that any administrative State officer should perform any duty properly and necessarily belonging to the Governor of the State, but it was, we think, the intention that such officers should have the power to perform such duties as should be required of them by law, in the administration of the State government, where such requirement in no wise conflicted with the powers delegated to the Governor alone.\n\n\"The appointment to office being generally the exercise of an executive or administrative function, the power must be conferred upon some executive or administrative officer, but the State geologist is an administrative State officer, elected by the people.\n\n\"The appointment to the office in controversy here by the State geologist is certainly a manner\n\nor mode of selecting an officer for whose appointment no provision is made by our Constitution. Nor does such mode of selection in any manner infringe upon the prerogatives of the Governor of the State.\"\n\nSo far as I can ascertain from the books, these opinions of Judge Coffee were shared by all the Judges who were on the bench during the administration of Governor Hovey when arose the many cases relied upon by appellees and reported in volumes 118 to 129 of the Indiana Reports. Judges Elliott and Mitchell, who were the original Dissenters, insisted that the Legislature itself might fill an office of its creation. That opinion did not prevail, but there was no doubt cast upon the legislative right to give the appointing power to others than the Governor, or to others with him. Judge Berkshire, in City of Evansville v. State ex rel. Blend (1889), 118 Ind. 426, 446, 21 N.E. 267, 4 L.R.A. 93, did say that it \"must be lodged somewhere within the executive department of the government.\" The laws in question are within this narrow field, for the Secretary of State, Auditor of State, and Treasurer of State are elective officers in the administrative department which by the constitutional provision for separation of powers is included in the executive branch of the government. The Lieutenant Governor is also an executive officer as held in Armstrong v. Townsend (D.C.S.D. Ind., 1934), 8 F. Supp. 953, which holding I think is sound. These four elective executive officers with the Governor, in various combinations of three, are the boards whose power to appoint is here in question.\n\nWhile the Judges of the courts from 1889 until as late as 1900 (Overshiner v. State [1901], 156 Ind. 187, 59 N.E. 468, 83 Am. St. Rep. 187, 51 L.R.A. 722) were Concurring in the dicta of Judge Coffee above\n\nquoted, the General Assemblies from 1861 until 1941 were enacting laws in harmony with the views so expressed. In each of the following instances, the Governor was named a minority member of a board of officers in the \"executive including the administrative department\" to appoint the personnel of other administrative boards or agencies:\n\nAgent of State, Acts 1872, p. 27;\n\nCommissioners to erect a State Soldiers' and Sailors' Monument, Acts 1887, p. 30;\n\nState Board of Health, Acts 1891, p. 15;\n\nState Agricultural and Industrial Board, Acts 1891, p. 92;\n\nBoard of Prison Directors, Acts 1895, p. 160;\n\nBoard of Regents of State Soldiers' and Sailors' Monument, Acts 1895, p. 134;\n\nState Unemployment Compensation Board, Acts 1936 (Spec. Sess.), p. 104;\n\nOn the following boards, he was made a minority member associated with other state officers not appointed by him:\n\nState Board of Education, Acts 1861, p. 96;\n\nSame, Acts 1865, p. 33;\n\nState Board of Equalization, Acts 1872, p. 57;\n\nCommissioners of Public Printing and Binding, Acts 1875 (Special Session), p. 66;\n\nSame, Acts 1885 (Special Session), p. 215;\n\nState Board of Tax Commissioners, Acts 1891, p. 199, 249 (Governor, Auditor of State, Secr. of State and two persons appointed by Governor);\n\nBoard of Public Buildings and Property, Acts 1895, p. 359;\n\nCommissioners of Public Printing, etc., Acts 1905, p. 143;\n\nState Board of Finance, Acts 1907, p. 391;\n\nState Charter Board, Acts 1915, p. 550;\n\nBoard of Public Buildings, etc., Acts 1919, p. 572;\n\nNumerous boards under State Executive-Administrative Act of 1933, p. 7.\n\nBy other statutes, the Governor was associated with various persons, some not even state officials, in administering agencies of government, e.g. Division of State Publicity, Acts 1939, p. 736. And in many cases he and other persons of his appointment constituted the administrative boards. Upon their appointment, he became a minority member. We cannot assume that his appointees would abdicate their right and duty to exercise an independent judgment on matters before the board and blindly do his will merely because they owed their appointment to the Governor. That kind of a public servant is not to be commended.\n\nThis interpretation by the Legislature of its constitutional rights was deemed by Hackney, J. in the French case, supra, to be controlling. Surely, after forty-five additional years of construction in harmony with what he then conceived to be the law, the matter is put beyond all controversy. If there be doubt that I have stated the correct view in my judicial interpretation, that doubt should be resolved in favor of the practical or legislative exposition. In my opinion, therefore, Chapter 13 of the Acts of 1941 is not subject to the objections raised by appellees and the appointive and supervisory powers therein given may be exercised by the various appellants in conjunction with the Governor as therein provided. The issue is not presented and I express no opinion as to whether any elective state administrative officer may be required to accept in his department, to aid in the discharge of duties peculiar to his office, assistants or employees other than of his own choice.\n\nNo reason appears why the Governor should have any connection with the school system which Article 8 of\n\nthe Constitution commits to the Legislature; Section 4 even requiring the General Assembly itself to invest all school funds not theretofore distributed to the counties. The Superintendent of Public Instruction is required to be elected, Section 8. In 1861 an act made the State Superintendent, Governor, Treasurer, Auditor, Secretary of State, and the Attorney General the board of education. Acts 1861, ch. 41, p. 68, 96. Chapter 1 of the Acts of 1865 provided that the Governor, State Superintendent of Public Instruction, president of the State Normal School, and the superintendents of common schools of the three largest cities in the state should constitute the board. In 1913, the Governor was taken from the board, but was required to name three of a board of ten. Acts 1913, ch. 24, p. 37. With this history, possibly incomplete, and the constitutional injunction upon the Legislature to provide the school system, it is inconceivable that the Governor has such an interest in the board of education by virtue of his office as to require his control thereof by appointment. This objection urged to Chapter 182 of the Acts of 1941 in my opinion cannot be sustained.\n\nIt is also claimed that the former board may not be legislated out of office by repealing and re-enacting the law providing for a different manner of appointment. This question arises also as to the office of attorney general contained in Chapters 108 and 109 of the Acts of 1941, each with an emergency clause to take effect on April 1, 1941, which must be read together. The former abolished the office of attorney general and the department of law and terminated the tenure of the officer and all his subordinates. Chapter 109 \"created\" the office of attorney general and made it elective, the first incumbent to be chosen at the general election in 1942 and to take office on the second Monday of January\n\nthereafter. He is assigned additional duties to those of the former office. So much of the law is not questioned by appellees.\n\nIt goes further, however, and authorizes the employment by a board, consisting of the Governor, Lieutenant Governor and Secretary of State, of \"a duly licensed and qualified attorney\" to act as attorney for the state in the interim from April 1, 1941 until the elected incumbent shall take office. Chapter 109 designates him as the Attorney General and assigns him duties as disclosed in the majority opinion. These are not all the duties of the former office.\n\nAppellees contend that the effect of the law \"was to continue the office of attorney general as an office of appointment, with the term shortened until there be an elected incumbent\" and that the present incumbent is entitled to hold over until that time. Appellants say that the Legislature abolished the former office and thus ended the incumbent's tenure; that a new office (elective) was created with additional powers and duties; that there need be no attorney general until the elective incumbent takes office; and that, in the meantime, the Legislature may provide for an attorney to represent the state and its agencies and advise them, without regard to the duties theretofore assigned to the attorney general. In addition it is asserted that the Legislature may itself select the attorney general as held in Collins v. State ex rel. Morrison (1856), 8 Ind. 344.\n\nChief reliance, however, is placed upon State ex rel. Yancey v. Hyde, supra, which I think sustains the validity of this legislative action. It has never been criticized or disapproved. It has been cited and its principles followed in Goodwin, Clerk of City of Terre Haute, v. State ex rel. Foley (1895), 142 Ind. 117, 41 N.E. 359; Downey v. State ex rel. (1903), 160 Ind. 578, 581,\n\n67 N.E. 450; Conter, Treas. v. Post (1935), 207 Ind. 615, 618, 194 N.E. 153; Rogers v. Calumet National Bank (1938), 213 Ind. 576, 585, 12 N.E.2d 261. All these cases hold that a legislative body which has the power to create an office may also abolish it and end the tenure of the incumbent. The same legislature may create a new office to be filled in other manner or may otherwise provide for performance of duties theretofore assigned to the old office.\n\nOf the cases cited by appellees, most are readily distinguishable. The case of Commonwealth ex rel. Smillie v. McElwee (1937), 327 Penn. 148, 193 A. 628, like the case of State ex rel. v. Fox (1902), 158 Ind. 126, 63 N.E. 19, 56 L.R.A. 893, was correctly decided as violating the doctrine of home rule. The language relied upon by appellees was not necessary to the decisions. The provisions of the Delaware Constitution are so unlike ours that State ex rel. Green v. Collison (1938), 9 Harr. 245 (Del.), 197 A. 836, is not at all helpful. The issue there was whether a statute giving the governor the power to remove an appointive officer \"without cause\" was valid. The case of People ex rel. Kelly v. Milliken (1923), 74 Colo. 456, 223 P. 40, shows that the legislature was restrained by express constitutional provision from removing a civil service officer, so that the act abolishing and re-creating the office with other appointing provisions was invalid. The case of State ex rel. v. Leonard (1888), 86 Tenn. 485, 7 S.W. 453, held that a Judge elected for a term of eight years, the office being legislative but the term fixed by the constitution, could not be legislated out of office by transferring the duties of his court to another court.\n\nThe case of Malone v. Williams (1907), 118 Tenn. 390, 103 S.W. 798, is full of dicta to the effect that the Legislature may not remove an officer by abolishing and\n\nre-creating the office. But the dicta are largely based on a rule in North Carolina wherein Hoke v. Henderson (1833), 15 N.C. 1, 25 Am. Dec. 677, was the leading case. It was expressly overruled in State ex rel. Mial v. Ellington (1903), 134 N.C. 131, 46 S.E. 961, 65 L.R.A. 697, wherein it is said (page 709 of 65 L.R.A.):\n\n\"To conclude the matter, the doctrine of Hoke v. Henderson is based upon the proposition that public office is private property, with all the results that logically flow therefrom. In so far as that case holds this proposition to be law, we expressly over-rule it, and declare that no officer can have a property in the sovereignty of the state; that, in respect to offices created and provided for by the Constitution, the people, in convention assembled, alone can alter, change their tenure, duties, or emoluments, or abolish them; that, in respect to legislative offices, it is entirely within the power of the legislature to deal with them as public policy may suggest and public interest may demand.\"\n\nState ex rel. Birdsey v. Baldwin (1877), 45 Conn. 134, comes nearer the question. By the same act a board was abolished and re-created with the same duties and powers. The court held that a legislative office may be abolished so as to terminate the tenure of the officer but said:\n\n\"The act in question contains the elements of its own destruction. It attempts to kill and make alive at the same instant, an impossibility. There must be some appreciable space of time between the repealing act and the re-enactment of the same act.\"\n\nIt is clear that, unlike the statutes before us, there was no change in the duties or powers assigned to the new office. But if it be conceded that an office may not be destroyed and re-created in the same act, the situation here as to the Attorney General is further distinguishable\n\nin that Ch. 108, the repealing or killing act, was passed, vetoed, and re-passed over the veto before Chapter 109, the act that created or made alive, was in the legislative mill. It is true that the acts were to take effect upon the same day but when the first was passed it was not known, as indicated by the language of the veto message, that the second or any similar act would be presented for passage. While to abolish the office, without providing a substitute, would have caused much confusion, the Legislature which created it could destroy it without in any way violating the Constitution.\n\nOn the subject generally see the notes and cases cited in 4 A.L.R. 205, 206; 37 A.L.R. 815; 46 C.J. Officers, § 30, p. 934.\n\nChapter 182 discloses that partisan considerations could make difficult the selection of the members of the board of education. There is no field of activity under governmental supervision wherein politics is to be more scrupulously avoided than in the public school system. The court has a right to assume that such considerations will not control the two executive officers charged with such selection. Upon such assumption there is no reason presented which in my opinion requires us to hold this statute invalid.\n\nFrom my answer to the principal question in this case it necessarily follows that the Legislature may determine the public policy as to appointing power. Whether that power should be concentrated in the Governor, distributed among the executive and administrative state officers, put under civil service regulations or largely restored to the electorate, this court is not permitted to decide.\n\nTurning now to a consideration of the arguments of the majority, a major premise is that \"at the time our Constitution was adopted it was settled by the great\n\nweight of authority that the provision granting the executive power and the admonition to take care that the laws are faithfully executed carried with them as a necessary and essential incident the power to appoint to office.\" I do not accept this statement. From the investigation I have been able to make in connection with this case, it seems to me that this was a debatable question not settled even as to the United States Constitution and certainly not as to state constitutions.\n\nI do not believe that the learned members of the Constitutional Convention had determined that the great weight of authority was as so stated and were so convinced of that fact that they thought those provisions inserted in our Constitution necessarily carried the implication of the appointing power. They were able men but, I suspect, of no greater ability than the members of any constitutional convention that might be assembled today.\n\nIn the face of the long historical statement of Chief Justice Taft in the Myers case, supra, I am of the opinion that Judge Mitchell, whose scholarly opinions indicate his acquaintance with the history of constitutional government, was within the facts when he said in Hovey, Governor, v. State ex rel. Carson (1889), 119 Ind. 395, 401, 21 N.E. 21:\n\n\"It is fundamental error, however, to assume that the exclusive right to exercise the power of appointment is included in the general grant of power to the executive. The Federal Constitution declares, with emphasis, that 'The executive power shall be vested in a President of the United States,' but it was never supposed that this declaration invested the President with the appointing power, which, after long and earnest debate, was conferred upon the chief executive of the nation in express terms. Section 1, Art. 2, U.S. Const.\"\n\nAnother major premise of the majority is that the Secretary of State, Auditor of State and Treasurer of State were intended to be of such inferior status as to be ministerial only in the present acceptance of that word, which implies no discretion whatever. If the members of the convention were as learned as claimed and were thinking in terms of the United States Constitution, they must also have had in mind, at least, the Secretary of State in the Federal Government and must have known that his office was not of minor, but of major importance. They knew also that he was appointed by the President and subject to the President's will. If they had had any intention that the Secretary of State under our constitution should be of such inferior position, as the opinion indicates, they would not have made the office elective; nor would they have set up a separate article in the Constitution entitled \"Administrative\" and included therein the provisions as to the three elective state officers who then were deemed an adequate number to administer the state's business. But it seems to me that the Constitutional Convention also recognized the possibilities of increasing functions of the elective offices in the administrative department and purposely did not circumscribe the duties of the officers, being content with stating that they should \"perform such duties as may be enjoined by law.\"\n\nIf in 1852 the intention was that these officers should have no executive and discretionary powers, nevertheless it seems to me that the practical construction by the Legislature, which has increasingly during the years added to the duties and powers of each of these elective officers, makes impossible any present holding that they are ministerial officers only. I quote again Judge Elliott: He said in Hovey, Governor, v. State ex rel. Riley (1889), 119 Ind. 386 at 388, 21 N.E. 890:\n\n\"Our own and other courts have time and time again adJudged that practical exposition is of controlling influence wherever there is need of interpretation. The language employed by the courts is strong, and the current of opinion is unbroken. In speaking of the effect of a practical exposition, it was said by an able court that: 'It has always been regarded by the courts as equivalent to a positive law.' Bruce v. Schugler, 4 Gilm. 221. In adhering to long continued exposition, another court said 'We can not shake a principle which in practice has so long and so extensively prevailed.' Rogers v. Gooden, 2 Mass. 478. But it is unnecessary to quote the expressions of the courts, for harmony reigns throughout the whole scope of judicial opinion upon this subject.\"\n\nI can see no force in the definition of the word \"Governor.\" If it was intended by the use of that word that he should govern, then it was intended by the use of the word \"President\" in the Federal Constitution that he should preside. The word \"Governor\" was the common name for the chief executive in all the states and carried no further implication. His powers were to be determined not from the name but from the Constitution.\n\nThe majority lean heavily upon the Noble case, supra. This case holds that all judicial power was given to the courts by Article 7, Section 1 and that none of such power was reserved by the people. This can be true without giving a like effect to Article 5, Section 1. The judicial power is not divisible in the sense that a part may be reserved in the people and a part given to a court. It can be distributed but the distribution must be to courts. If it were retained by the people we should have a government of force not of law. Nor was the legislative power in 1852 deemed possible of separation so that some might be delegated to a department of government, the remainder to be retained and exercised\n\nby the people. This was before the days of the initiative and referendum. The Constitutional Convention did not consider a town meeting adaptable to the needs of a great state and provided a representative assembly to which all legislative power was delegated except under the principle of home rule.\n\nThe executive power is different. Every citizen when he obeys the law carries the law into effect which in one sense is an execution of the law. Every officer, elective or appointive, in the state, from township up to Secretary of State executes some part of the law. All executive power cannot be so concentrated as to be exercised by one man. If it be conceded that appointment to office is necessarily an executive function, then from the very nature thereof the power of appointment can be distributed to several or many persons.\n\nThe claim is made by the majority that Article 5, Section 1 is the grant of general appointive power to the Governor. They do not rely on Article 5, Section 16 as a grant but as evidence that the grant was made by the first section of the article. They further say that \"In the absence of an express provision the general executive power does not carry with it power to fill a vacancy in an elective office.\" No authority is cited for this statement. It has been held that where the Legislature has created an office and provided no means of filling such office, the Governor under the clause that he shall take care that the laws be faithfully executed has authority to make an appointment to that office. I can see no reason why, if an elective office becomes vacant by death or otherwise, the Governor should not have authority under the same constitutional provision to make an appointment to the office. It is not necessary to go to Article 5, Section 1 for that authority and the argument therefore fails. The power to fill a\n\nvacancy is not in aid of the general appointive power claimed under the grant of executive power.\n\nI can see how some appointive power in the Governor (and not confined to the administration of his own office) might be implied from the necessity of a situation, without having to resort to the implication that all general appointive power is included in the grant of executive power. This does not conflict with the view that where express powers are granted implied powers are excluded. If there were no other provisions in the constitution to which we might turn for authority to fill a particular office and the functioning of that office was necessary to the public welfare it might be assumed that the Governor should make the appointment because normally appointment is a step in the execution of the law and not a legislative or judicial function. But the power so to do would not flow from the grant of all executive power, but from the necessity to maintain the office. The argument is not important, however, for in the Constitution there is a provision, Article 15, Section 2, which, with other provisions, seems to me to exclude the necessity for an implication of emergency appointive power in the Governor.\n\nThere seems to me to be no substance in the argument that this section is found in Article 15 entitled \"Miscellaneous\" and is therefore to be considered only as an afterthought without material bearing upon the prior provisions. \"The rule applicable here is, that effect is to be given, if possible, to the whole instrument, and to EVERY SECTION AND CLAUSE.\" (My capitals.) 1 Cooley's Constitutional Limitations (8th Ed.) p. 128. This being true, what is the difference whether the section be in Article 15 or Article 4 or 5 or 6? I can find no better place for it than where it is.\n\nJudge Elliott took the position that the several clauses granting appointive power to the Governor excluded implication that the executive power vested by Article 5, Section 1 gave to him general appointing power. The majority say that the express provisions for appointing power were necessary additions to the general appointing power under Article 5, Section 1 for the reason that without them the Governor would be invading the province of the other departments of the government in making such appointments. I do not accept this theory.\n\nIt is not an interference with any other department of government for him to make an appointment to fill a vacancy. It is not a usurpation of sovereign right of the people for him to do something which they cannot do until an election. And particularly with reference to filing vacancies in the office of Judge there is no interference with judicial power when the governor appoints a Judge because, upon the premise of the majority, appointment is not the exercise of a judicial but of an executive function. Nor, in the absence of an express provision for executive appointment, would we be driven to the Conclusion that a vacancy in the office of Judge must be filed by some judicial body as an incident to the functioning of the judicial system. Not on this theory can be explained the presence in the Constitution of the provision for interim appointments by the Governor.\n\nThe only necessary implication from the concluding clause of Article 5, Section 18 is that the Governor may appoint only an interim officer instead of one to fill out an unexpired term and that the elective or appointive authority shall select the permanent officer.\n\nThe majority also say that the provisions which appellants claim grant express executive power to the Governor \"are not, in fact, grants of power but rather\n\ndirections or mandates as to the manner in which executive power is to be exercised, or limitations upon power or delegations of power, which are not in essence executive.\" Sections 12 to 19 of Article 5, are asserted to be these mandates or limitations. In my opinion they are not of the character claimed. I fail to see how any communication or recommendation to the General Assembly could possibly be an invasion of a legislative power. Section 14 as to veto is an express delegation of legislative power and not a limitation upon the exercise of executive power. See 16 C.J.S. Constitutional Limitations, § 170, p. 514. It is not necessary to determine whether under any other provision or implication he would have had that power in the absence of the language of this section. Section 15 in conjunction with Article 6, Section 1, to me is evidence of the intent of the convention that the administrative officers were not to be subservient to the Governor, but were to be independent; not so independent, however, that they might refuse to give the Governor information. There is no contention that Section 16 is a limitation of power. Nor, in my opinion, is it a grant of power. It is a specific assignment to the Governor of a duty which might well have been implied from the grant of executive power. The majority say that Section 17 involving pardons and reprieves is a \"limitation on the common law power.\" But this court in State v. Dunning (1857), 9 Ind. 20, 23 had a different view:\n\n\"The governor, then, simply by virtue of his office as such, takes no power touching pardons -- there is no such prerogative here. He derives his power from the constitution and laws alone.\"\n\nThis provision is a grant of power but with a limitation which was not contained in the prior constitution under which the pardoning power had been abused. For the\n\nreasons above stated I think Section 18 is a grant of the appointive power which might well be within the normal sphere of the Governor's duty to see that the law be executed. This however does not carry the implication of general appointing power by virtue of the vesting of the executive power. Sections 19 and 20 do not appear to me to have any significance on the question before us.\n\nIt is asserted: \"But if the executive powers granted to the Governor are confined to express grants, the provision that the executive power shall vest in the Governor is surplusage, and this cannot be.\" This argument proceeds on the fallacious assumption that there is no executive power except the power of appointment. I do not assert that the Governor was not granted executive power by Article 5, Section 1, but on the contrary I do hold that such grant did not include general appointing power. There is no surplusage created by this construction.\n\nThe Gray case, supra, is given an effect out of all proportion to the issue decided which was that a board of consisting of the Governor, Attorney General, Secretary of State and Treasurer of State could be mandated to redeem certain state bonds. It was said that any duty which the Governor \"is by law required to perform, in connection with others, in which they have an equal voice with him, can in no sense be said to be an executive duty.\" But it was not said that a Governor cannot be associated with those and similar state officers in the exercise of the appointing power, which is not exclusively an executive duty. Nor has it ever been held that this could not be done. It is not correctly stated by the majority that these officers \"were treated and considered as ministerial officers\" in the Gray case, supra. The\n\nduty which they were exercising was characterized as a ministerial duty; the officers were not so labeled.\n\nThe majority quote at length from State ex rel. Collett v. Gorby, supra, where is suggested the extreme length to which the Legislature might go in transferring duties from one officer to another. This might be unwise or unfortunate but not necessarily unconstitutional.\n\nIt is further asserted that the appellants are claiming that Article 15, Section 1 gives the right to the Legislature to put the appointing power in any person. This is not my position. I do believe that an officer in the \"executive including the administrative department\" may be given power to appoint the personnel of administrative offices.\n\nI am not aware that the Governor (as executive) has any peculiar claim to \"manage\" the property of the state and no authority is cited for the claim. I have seen authority for a legislative right to such management. The fact is, I think, that as the title is in the state, that is, in the people, they have the control of the property and may determine how it shall be managed. In the absence of constitutional provision, they speak through the Legislature. And when they have so spoken, the various agencies to whom custody is committed, and not the Governor by virtue of his office, must execute the will of the people so expressed.\n\nThere is no more assertion in the majority opinion which seems to require notice. Apparently the view is taken that the rule of practical construction should be confined to statutes. If this be their view, I think it erroneous. See 1 Cooley, Constitutional Limitations, pp. 141-151 wherein numerous cases are cited. It is true that a practical interpretation of a constitution\n\nplainly contrary to its express provisions may not stand when challenged. But where there is ambiguity or doubt then constitutions as well as statutes, which have been given a long continued practical exposition by a coordinate branch of the government, must be given the same exposition by the courts. If I alone of all the Judges that have served on this court had conceived the Constitution to be as I think it is I would not insist that the Legislatures which have shared my views were right. But these views were shared also by Judges Elliott, Mitchell, Coffee, Berkshire, Olds, McBride, and Miller, who were on the court in the years of controversy immediately after the election of Governor Hovey, by Judges Hackney, McCabe, Howard, Jordan, and Monks, who joined in the French decision, supra, and by Judges Hadley, Dowling, and Baker who were serving with Monks and Jordan when the Overshiner case, supra, was decided. So far as I am aware no Judge until this date has expressed a different view. If many dicta and one decision, in a case where that was the only question presented, are of any significance, the views so held surely present to my brother Judges an occasion for such doubt of their position that the practical construction of the legislatures for more than half a century should be entitled to controlling weight.\n\nThe court has heretofore said: \"If the statutes are constitutional, the injunction should not have been granted.\" I am firmly of the opinion that the statutes are constitutional and that the judgment should be reversed.\n\n",
    "body_length": 201967,
    "citedas": [
      "35 N.E.2d 270",
      "218 Ind. 614"
    ],
    "attorneys": "Gilliom \u0026 Gilliom, Pickens, Gause, Pickens \u0026 Gause, Fred C. Gause, and Erle A. Kightlinger, all of Indianapolis, for appellants. George N. Beamer, Attorney General, James K. Northam, Deputy Attorney General, Frank C. Dailey and Walter Myers, both of Indianapolis, Walter R. Arnold, of South Bend, Samuel D. Jackson, of Fort Wayne, and James P. Hughes, of Greencastle, for appellees.",
    "category": [
      "124"
    ],
    "judges": "Fansler, C.j. Richman, J., Dissents with opinion.",
    "citation_count": 2
  }
}
