{
  "id": "GYvUQGYBTlTomsSBE3K_",
  "document": {
    "title": "Nuclear Energy Institute",
    "full_title": "NUCLEAR ENERGY INSTITUTE, INC. v. ENVIRONMENTAL PROTECTION AGENCY",
    "jurisdiction": "D.C. Circuit",
    "date": "2004-07-09T00:00:00.000Z",
    "docket": "No. 01-1258 Consolidated with, 01-1268, 01-1295, 01-1425, 01-1426, 01-1516,, 02-1036, 02-1077, 02-1116, 02-1179, 02-1196,, 03-1009, 03-1058",
    "body": "Argued January 14, 2004\n\nHaving the capacity to outlast human civilization as we know it and the potential to devastate public health and the environment, nuclear waste has vexed scientists, Congress, and regulatory agencies for the last half-century. After rejecting disposal options ranging from burying nuclear waste in polar ice caps to rocketing it to the sun, the scientific consensus has settled on deep geologic burial as the safest way to isolate this toxic material in perpetuity. Following years of legislative wrangling and agency deliberation, the political consensus has now selected Yucca Mountain, Nevada as the nation's nuclear waste disposal site.\n\nIn this case, we consider challenges by the State of Nevada, local communities, several environmental organizations, and the nuclear energy industry to the statutory and regulatory scheme devised to establish and govern a Yucca Mountain nuclear waste repository. Petitioners challenge regulations issued by the three agencies with responsibility for the site: the Environmental Protection Agency (EPA), the Nuclear Regulatory Commission (NRC or Commission), and the Department of Energy (DOE). Petitioners also challenge the constitutionality of the joint resolution through which Congress selected Yucca Mountain as the repository site, as well as certain actions of the President and Energy Secretary leading to approval of the Yucca site.\n\nWe conclude: (1) The 10,000-year compliance period selected by EPA violates section 801 of the Energy Policy Act (EnPA) because it is not, as EnPA requires, \"based upon and consistent with\" the findings and recommendations of the National Academy of Sciences. The remaining challenges to the EPA regulation are without merit. (2) The Nuclear Regulatory Commission's licensing requirements are neither unlawful nor arbitrary and capricious except to the extent that they incorporate EPA's 10,000-year compliance period. (3) The congressional resolution selecting the Yucca site for development represents an appropriate exercise of Congress's Article IV, section 3 authority over federal property. (4) The Department of Energy's and the President's actions leading to the selection of the Yucca Mountain site are unreviewable. All but one of Nevada's challenges to these actions are moot, and the remaining challenge is unripe. Accordingly, we vacate the EPA and NRC regulations insofar as they include a 10,000-year compliance period. We deny or dismiss the remaining petitions for review.\n\nI. BACKGROUND\n\nSince the dawn of the atomic age, the United States has used nuclear fission to generate electricity. Today, approximately twenty percent of the nation's electricity comes from nuclear power. See Recommendation by the Secretary of Energy Regarding the Suitability of the Yucca Mountain Site for a Repository Under the Nuclear Waste Policy Act of 1982 at 1 (Feb. 2002), available at http://www.ocrwm. doe.gov/ymp/sr/sar.pdf [hereinafter \"Secretary's Recommendation\"]. Although nuclear power burns without emitting harmful greenhouse gases, it produces a potentially deadly and long-lasting byproduct: highly radioactive spent nuclear fuel.\n\nAt massive levels, radiation exposure can cause sudden death. National Institutes of Health, Fact Sheet: What We Know About Radiation, at http://www.nih.gov/health/ chip/od/radiation (last visited May 28, 2004). At lower doses, radiation can have devastating health effects, including increased cancer risks and serious birth defects such as mental retardation, eye malformations, and small brain or head size. See Environmental Radiation Protection Standards for Yucca Mountain, Nevada, 64 Fed. Reg. 46,976, 46,978 (Aug. 27, 1999).\n\nRadioactive waste and its harmful consequences persist for time spans seemingly beyond human comprehension. For example, iodine-129, one of the radionuclides expected to be buried at Yucca Mountain, has a half-life of seventeen million years. See COMM. ON TECHNICAL BASES FOR YUCCA MOUNTAIN STANDARDS, NAT'L RESEARCH COUNCIL, TECHNICAL BASES FOR YUCCA MOUNTAIN STANDARDS 18-19 (1995) [hereinafter \"NAS REPORT\"]. Neptunium-237, also expected to be deposited in Yucca Mountain, has a half-life of over two million years. Id. at 19.\n\nAs of 2003, nuclear reactors in the United States had generated approximately 49,000 metric tons of spent nuclear fuel. See Office of Civilian Radioactive Waste Management, Fact Sheet, Nuclear Waste Explained: How Much Nuclear Waste is in the United States, at http://www. ocrwm.doe.gov/ymp/about/howmuch/shtml (last visited June 1, 2004) [hereinafter \"How Much Nuclear Waste Is in the United States\"]. Most of this waste is currently stored at reactor sites across the country. See United States Environmental Protection Agency, Public Health and Environmental Radiation Protection Standards for Yucca Mountain, Nevada, Final Background Information Document for Final 40 CFR 197 at 5-2 (June 2001) [hereinafter \"Final Background Information Document\"]. With more than 100 interim storage locations sprinkled across thirty-nine states, over 161 million people reside within seventy-five miles of a nuclear waste storage facility. See Office of Civilian Radioactive Waste Management, Fact Sheet, Nuclear Storage Explained: Current Storage Methods For Radioactive Waste, at http://www.ocrwm.doe.gov/ymp/about/storage.shtml (last visited June 1, 2004). By the year 2035, the United States will have produced 105,000 metric tons of nuclear waste - approximately twice the current inventory. See How Much Nuclear Waste Is in the United States.\n\nIn 1982, responding to growing quantities of radioactivewaste and their potentially deadly health risks, Congressenacted the Nuclear Waste Policy Act (NWPA), directing thefederal government to assume responsibility for permanentlydisposing of the nation's nuclear waste. Pub. L. No. 97-425,96 Stat. 2201 (1982) (codified as amended at 42 U.S.C.§§ 10101-10270 (2000)). The NWPA put the United Stateson course to using geologic repositories buried deep below theearth's surface to house its nuclear waste. To finance thecreation and operation of such repositories, the NWPA established the Nuclear Waste Fund to ensure that \"the costs ofcarrying out activities relating to the disposal of [radioactive]waste and spent fuel will be borne by the persons responsiblefor generating such waste and spent fuel.\" 42 U.S.C.§ 10131(b)(4) (2000). Accordingly, the NWPA required nuclear energy producers to pay assessments into the Fundbased on the amount of electricity they generate. See id. § 10222(a), (c) (2000).\n\nThe NWPA assigned distinct regulatory roles to the Department of Energy, the Environmental Protection Agency,and the Nuclear Regulatory Commission. Congress chargedDOE with selecting, designing, and ultimately operating therepository. See id. §§ 10132-10134 (2000). It required EPAto establish generally applicable standards for protecting theenvironment from releases of radioactive materials, id. § 10141(a) (2000), and directed NRC to assume responsibilityfor licensing a DOE-proposed repository, id. § 10141(b).\n\nThe NWPA also established a multi-stage process for DOEto select an appropriate host site. The Act required theSecretary of Energy to begin by issuing general site-selectionguidelines, id. § 10132(a), that DOE would then use to determine which candidate sites to recommend for intensive investigation, known as \"site characterization,\" id. § 10132(b).Based on these guidelines, the Secretary was directed tonominate at least five sites, id. § 10132(b)(1)(A), and then tonarrow the field to three for the President's consideration, id. § 10132(b)(1)(B).\n\nOnce the President approved the nominated sites, the Secretary was required to undertake site-characterization activities at each location. NWPA § 113(a) (codified as amended at 42 U.S.C. § 10133(a)). The NWPA also directed DOE, as part of its site-characterization program, to issue \"criteria\" for determining whether the candidate sites were \"suitab[le]\" for housing a waste repository. 42 U.S.C. § 10133(b)(1)(A)(iv). After completing the intensive sitecharacterization process, the Secretary was authorized to submit to the President, together with a final environmental impact statement, a recommendation that he approve one of the suitable sites for development. NWPA § 114(a)(1) (codified as amended at 42 U.S.C. § 10134(a)(1)).\n\nUnder the NWPA, once the President approved a site, hewould then transmit his recommendation to Congress. Id. § 114(a)(2) (codified as amended at 42 U.S.C. § 10134(a)(2)).The state within which the recommended site was locatedcould then submit a \"notice of disapproval\" to Congress, anaction that would effectively end the development processwith respect to that site unless Congress passed a jointresolution overriding the state's disapproval and approvingthe site. See 42 U.S.C. § 10136(b)(2) (2000).\n\nPursuant to this statutory regime, DOE promulgated siteselection guidelines in 1984 and applied them to nominate five candidate sites for characterization. Based on these guidelines, the Energy Secretary then recommended three sites to the President: Deaf Smith County, Texas; Hanford, Washington; and Yucca Mountain, Nevada. See Nevada v. Watkins, 939 F.2d 710, 713 (9th Cir. 1991). The President then approved each for characterization. Id.\n\nIn 1985, EPA promulgated 40 C.F.R. part 191, general health and safety standards to govern an eventual waste repository. EPA later revised these standards in response to a First Circuit decision remanding aspects of the regulation. See Natural Res. Def. Council, Inc. v. United States EPA, 824 F.2d 1258 (1st Cir. 1987) ( NRDC v. EPA ). NRC then issued generic licensing standards in 10 C.F.R. part 60.\n\nIn 1987, however, because characterizing three separate sites was becoming both costly and time-consuming, Congress departed from the NWPA's original site-selection scheme and directed, through the Nuclear Waste Policy Amendments Act (NWPAA), that the nation's nuclear waste program focus exclusively on Yucca Mountain, Nevada. See Pub. L. No. 100-203, §§ 5001-5065, 101 Stat. 1330, 1330-227 to 1330-255 (1987) (codified in scattered sections of 42 U.S.C.). Located in the arid Nevada desert approximately 100 miles northwest of Las Vegas, Yucca Mountain sits on the Nevada Test Site, the nation's former nuclear bomb testing range. Under the NWPAA, Yucca became the only site that DOE could lawfully characterize. See 42 U.S.C. § 10133(a) (requiring the Energy Secretary to \"carry out ... appropriate site characterization activities at the Yucca Mountain site\"); id. § 10172(a)(1)-(2) (2000) (\"The Secretary shall provide for an orderly phase-out of site specific activities at all candidate sites other than the Yucca Mountain site ... [and] shall terminate all site specific activities (other than reclamation activities) at all candidate sites, other than the Yucca Mountain site....\").\n\nIn 1992, Congress directed DOE's sister agencies, EPA and NRC, to focus their regulatory attention on Yucca Mountain as well. Through the Energy Policy Act, Congress required EPA to promulgate, based on the recommendations of the National Academy of Sciences, site-specific standards for Yucca Mountain, and ordered NRC to modify its generic technical requirements and criteria to bring them into conformity with EPA's Yucca-specific rule. Pub. L. No. 102-486, § 801, 106 Stat. 2776, 2921-23 (1992) (codified at 42 U.S.C. § 10141 note (2000)). At about the same time, Congress exempted the Yucca Mountain site from EPA's part 191 generally applicable environmental regulations. See Waste Isolation Pilot Plant Land Withdrawal Act, Pub. L. No. 102-579, § 8, 106 Stat. 4777, 4786-88 (1992). With the enactment of the NWPA, the NWPAA, and EnPA, the stage was set for the promulgation of the regulations and the adoption of the joint resolution challenged in this case.\n\nActing pursuant to EnPA, both EPA and NRC promulgated standards to govern the Yucca Mountain repository. EPA issued 40 C.F.R. part 197, establishing health and safety standards that require DOE to limit radiation releases from the repository for 10,000 years. See Public Health and Environmental Radiation Protection Standards for Yucca Mountain, NV, 66 Fed. Reg. 32,074 (June 13, 2001) (codified at 40 C.F.R. pt. 197 (2004)). Shortly thereafter, NRC issued Yucca-specific licensing standards in 10 C.F.R. part 63. See Disposal of High-Level Radioactive Wastes in a Proposed Geologic Repository at Yucca Mountain, Nevada, 66 Fed. Reg. 55,732 (Nov. 2, 2001) (codified at 10 C.F.R. pt. 63 (2004)).\n\nDOE also focused its attention on the Nevada site, issuing new site-suitability criteria specific to Yucca Mountain. See 10 C.F.R. pt. 963 (2004). Pursuant to these criteria and a final environmental impact statement, the Energy Secretary found Yucca Mountain suitable for a repository, concluding that a Yucca facility is \"likely to meet applicable radiation protection standards.\" Secretary's Recommendation at 26. Based on that finding, the Energy Secretary recommended Yucca Mountain to the President for development as the nation's underground nuclear waste repository. Id. at 6. Pursuant to NWPA procedures, the President then recommended Yucca to Congress. Objecting, Nevada submitted a notice of disapproval, to which Congress responded by passing a joint resolution approving the development of a repository at Yucca Mountain. See Pub. L. No. 107-200, 116 Stat. 735 (2002) (codified at 42 U.S.C. § 10135 note (Supp. IV 2004)).\n\nAs currently designed, the Yucca Mountain waste repository will house up to 70,000 metric tons of radioactive waste deep underground. See 66 Fed. Reg. at 32,081. DOE projects that ninety percent of the waste destined for Yucca Mountain will be spent nuclear fuel from commercial nuclear power plants. See id. The remaining ten percent will be high-level radioactive waste left over from the nation's nuclear weapons program. See id.\n\nTo isolate this waste for the epochal years required - by comparison, human history has been recorded for only 5000 years, see id. at 32,099 - the disposal system's overall design contemplates two types of barriers. First, \"engineered\" barriers, which include waste packages consisting of metal cylinders protected by drip shields, will surround the waste and protect it from water infiltration. See Office of Civilian Radioactive Waste Management, Yucca Mountain Project, Repository Concept: Engineered Barriers, at http:// www.ocrwm.doe.gov/ymp/about/ebarriers.shtml (last visited June 1, 2004). These packages will sit in a complex of over fifty horizontal tunnels, each over sixteen feet wide, 2000 feet long, and reinforced with steel sets, rock bolts, and wire mesh. See Office of Civilian Radioactive Waste Management, Yucca Mountain Project, Repository Concept: Tunnel Layout and Design, at http://www.ocrwm.doe.gov/ymp/about/tunnels. shtml (last visited June 1, 2004). These tunnels are designed not only to keep water and falling rocks from reaching the waste canisters, but also to manage the heat the waste will generate. See id. Second, the disposal system's \"natural\" barriers, i.e., the characteristics of the rock formations under Yucca Mountain, are intended to protect the waste from water infiltration and to dilute radiation releases expected to occur from leakage of the engineered barriers or from their failure thousands of years from now. See Office of Civilian Radioactive Waste Management, Fact Sheet, Nature and engineering working together for a safe repository, at http://www.ocrwm.doe.gov/factsheets/doeymp0203.shtml (last visited June 1, 2004). DOE plans to construct the repository tunnels in a thick layer of rock 1000 feet below the surface and 1000 feet above the water table. See id. The Energy Department expects that this surrounding rock will both limit water from seeping into the waste packages and delay radioactive particles from migrating into the human environment. See id.; 66 Fed. Reg. at 32,087. Decades or even centuries after beginning to bury waste at Yucca Mountain, DOE will permanently close the repository by sealing off all openings to the surface. See Secretary's Recommendation at 7.\n\nBefore us now are challenges to four aspects of the statutory and regulatory regime governing the Yucca Mountain repository. First, the State of Nevada and various environmental groups (Natural Resources Defense Council, Inc., Public Citizen, Citizen Alert, Nevada Nuclear Waste Task Force, Nevada Desert Experience, Citizen Action Coalition of Indiana, and the Nuclear Information and Resource Service) challenge EPA's radiation-protection regulation as insufficiently protective of public health and safety. The Nuclear Energy Institute, Inc. (NEI), a trade association representing the nuclear energy industry, challenges EPA's ground-water standard, claiming it to be both unnecessary and unlawful. Second, Nevada, Clark County, and the City of Las Vegas attack NRC's licensing-criteria rule as arbitrary, capricious, and contrary to law. Third, Nevada, Clark County, and the City of Las Vegas challenge the constitutionality of the congressional resolution selecting the Yucca Mountain site, arguing that Congress impermissibly singled out the State to bear the unique burden of housing the nation's nuclear waste. Fourth, Nevada, Clark County, and the City of Las Vegas attack DOE's part 963 site-suitability criteria, the Energy Secretary's and President's decisions to recommend Yucca Mountain for development as the nation's waste repository, and the Energy Department's Final Environmental Impact Statement. We consider each challenge in turn.\n\nII. THE EPA CASES\n\nA. The EPA Rule: 40 C.F.R. part 197\n\nThrough the 1992 Energy Policy Act, Congress required EPA to establish site-specific standards for a repository at Yucca Mountain. The statute provides:\n\n[T]he [EPA] Administrator shall, based upon and consistent with the findings and recommendations of the National Academy of Sciences, promulgate, by rule, public health and safety standards for protection of the public from releases from radioactive materials stored or disposed of in the repository at the Yucca Mountain site. Such standards shall prescribe the maximum annual effective dose equivalent to individual members of the public from releases to the accessible environment from radioactive materials stored or disposed of in the repository. The standards shall be promulgated not later than 1 year after the Administrator receives the findings and recommendations of the National Academy of Sciences ... and shall be the only such standards applicable to the Yucca Mountain site.\n\nEnPA § 801(a)(1).\n\nActing pursuant to this authority, EPA promulgated a rule, codified at 40 C.F.R. part 197, establishing a trio of public health and safety standards to govern DOE's nuclear waste disposal activities at Yucca Mountain. Together, these standards are designed to protect both individuals living near the disposal site and local ground-water supplies from excessive radiation contamination.\n\nThe rule begins by prescribing an \"individual-protection standard\" that requires the Energy Department, as a condition of receiving an NRC license, to show that the Yucca Mountain disposal system will sufficiently contain radiation to protect a hypothetical person living adjacent to the site from excessive exposure to radiation releases. The standard provides:\n\nThe DOE must demonstrate, using performance assessment, that there is a reasonable expectation that, for 10,000 years following disposal, the reasonably maximally exposed individual receives no more than an annual committed effective dose equivalent of 150 microsieverts (15 millirems) from releases from the undisturbed Yucca Mountain disposal system. The DOE's analysis must include all potential pathways of radionuclide transport and exposure.\n\n40 C.F.R. § 197.20 (2004). This \"reasonably maximally exposed individual\" (RMEI) represents a theoretical personliving in the \"accessible environment,\" id. § 197.21 (2004), i.e.,any point outside the \"controlled area,\" an area no greaterthan 300 square kilometers around the repository, id. § 197.12 (2004). The RMEI is designed to have lifestylecharacteristics (such as water and food consumption habits)that would expose him or her to \"reasonably maximal\" exposure levels. See 66 Fed. Reg. at 32,092. The individualprotection standard expresses the maximum doses the RMEImay incur in terms of an \"annual committed effective doseequivalent,\" a methodology that calculates an overall exposure dose by assigning weighting factors to account fororgans' relative sensitivities to radiation. See 40 C.F.R.§ 197.2 (2004) (defining \"effective dose equivalent\" as \"thesum of the products of the dose equivalent received byspecified [human body] tissues following an exposure of, or anintake of radionuclides into, specified tissues of the body,multiplied by appropriate weighting factors\").\n\nThe rule's second standard, the \"human-intrusion standard,\" requires DOE to show, among other things, a reasonable expectation that the RMEI will receive no more than a specified dose of radiation even if humans drill, intentionally or otherwise, into a waste package during the 10,000-year period immediately following disposal. Id. § 197.25(a) (2004).\n\nThe third standard, the \"ground-water-protection standard,\" requires DOE to demonstrate that the Yucca Mountain disposal system will contain radiation sufficiently well to protect ground water outside the controlled area from excessive contamination. Specifically, the rule provides:\n\nThe DOE must demonstrate that there is a reasonable expectation that, for 10,000 years of undisturbed performance after disposal, releases of radionuclides from waste in the Yucca Mountain disposal system into the accessible environment will not cause the level of radioactivity in the representative volume of ground water to exceed the limits in ... Table 1.\n\nId. § 197.30 (2004). Table 1, in turn, specifies maximum permitted contamination levels for three different types of radionuclides, which correspond to the maximum contaminant levels (MCLs) that EPA established under the Safe Drinking Water Act (SDWA), 42 U.S.C. §§ 300f to 300j-26 (2000). See 66 Fed. Reg. at 32,106. For example, DOE must demonstrate that \"[c]ombined beta and photon emitting radionuclides\" will not exceed four millirems per year. 40 C.F.R. § 197.30 (Table 1). Measured according to \"critical organ dose\" methodology, these MCLs establish maximum radiation doses by reference to the part of the body most sensitive to the regulated radionuclide. See National Primary Drinking Water Regulations; Radionuclides; Notice of Data Availability, 65 Fed. Reg. 21,576, 21,603 (Apr. 21, 2000); National Primary Drinking Water Regulations; Radionuclides, 65 Fed. Reg. 76,708, 76,716 (Dec. 7, 2000); United States Environmental Protection Agency, Public Health and Environmental Radiation Protection Standards for Yucca Mountain, Nevada (40 CFR Part 197) - Final Rule, Response to Comments Document 6-21 (June 2001) [hereinafter \"Response to Comments\"]. The \"representative volume\" referred to in the ground-water standard must include the highest concentration of radiation in the \"plume of contamination\" outside the controlled area. 40 C.F.R. § 197.31(a)(1) (2004).\n\nTo obtain a license to dispose of waste at Yucca Mountain, the Energy Department \"must demonstrate to NRC that there is a reasonable expectation of compliance\" with each of these three protection standards. Id. § 197.13 (2004). To account for changing conditions during the 10,000 years following disposal, EPA requires DOE to \"vary factors related to geology, hydrology, and climate based upon cautious, but reasonable assumptions.\" Id. § 197.15 (2004). In contrast, the Energy Department must hold constant \"changes in society, the biosphere (other than climate), human biology, or increases or decreases in human knowledge or technology.\" Id.\n\nAs to the period beyond the first 10,000 years, the rule requires DOE to calculate the maximum radiation exposures the RMEI will incur and then include the results of this calculation in its environmental impact statement as an indicator of long-term disposal system performance. Id. § 197.35 (2004). \"No regulatory standard,\" however, \"applies to the results of this analysis.\" Id.\n\nIn their petition for review, the State of Nevada, the Natural Resources Defense Council (NRDC), and the other environmental groups (throughout section II of this opinion, we shall refer to this set of petitioners as either \"Nevada\" or \"the State\") first challenge part 197's 10,000-year compliance period, claiming that it both conflicts with EnPA and is arbitrary and capricious. They also argue that EPA arbitrarily and capriciously drew the controlled area's boundaries, that the size of the controlled area violates the Safe Drinking Water Act, and that the rule impermissibly defines the term \"disposal.\" For its part, the Nuclear Energy Institute challenges EPA's decision to add a separate ground-water standard to part 197, arguing that the standard contravenes EnPA and that it is arbitrary and capricious.\n\nB. Challenges Brought by Nevada and Environmental Petitioners\n\n1. Jurisdiction\n\nBefore addressing the merits of Nevada's petition, we must consider two jurisdictional issues. See Steel Co. v. Citizens for a Better Env't, 523 U.S. 83, 94-95, 101-02 (1998) (holding that federal courts must ensure that they have jurisdiction before considering the merits of a case). The first, relating to subject matter jurisdiction, arises because although the Hobbs Act, the jurisdictional statute invoked by all parties, gives courts of appeals exclusive jurisdiction to review orders issued by a host of federal agencies - including the Atomic Energy Commission (AEC), the Federal Communications Commission, and the Federal Maritime Commission - the Act nowhere mentions the Environmental Protection Agency. See 28 U.S.C. § 2342 (2000). Even so, we believe that the Act's conferral of jurisdiction over rules issued by the nowdefunct AEC gives us jurisdiction to entertain the petitions in this case.\n\nThe Hobbs Act authorizes courts of appeals to review \"all final orders of the Atomic Energy Commission made reviewable by section 2239 of title 42.\" Id. § 2342(4). In turn, section 2239 makes reviewable \"[a]ny final order [of the Atomic Energy Commission],\" 42 U.S.C. § 2239(b) (2000), that is entered in \"any proceeding for the issuance or modification of rules and regulations dealing with the activities of licensees,\" id. § 2239(a)(1)(A). The AEC's authority to establish environmental standards to protect the public from radiation exposure, however, has since been transferred to EPA, and the AEC has been abolished. See Reorganization Plan No. 3 of 1970, § 2(a)(6), reprinted in 5 U.S.C. App. 1 (2000) (transferring to the EPA Administrator the \"functions of the Atomic Energy Commission ... administered through its Division of Radiation Protection Standards, to the extent that such functions of the Commission consist of establishing generally applicable environmental standards for the protection of the general environment from radioactive material\"); 42 U.S.C. § 5814(a) (2000) (abolishing the AEC). Given this transfer of authority, at least three circuits have held that EPA action undertaken pursuant to EPA's AEC-transferred authority is reviewable under the Hobbs Act as if undertaken by the AEC itself. See Watkins, 939 F.2d at 712 n.4 (stating that EPA's generic health and safety standards for nuclear waste repositories are reviewable under 42 U.S.C. § 2239(b)); NRDC v. EPA, 824 F.2d at 1267 n.7 (same); Quivira Mining Co. v. United States EPA, 728 F.2d 477, 481-84 (10th Cir. 1984) (finding Hobbs Act jurisdiction over EPA regulations addressing radiation releases from uranium fuel cycle operations). Going one step further, this circuit has held that agency action that \"derives\" from transferred authority is also reviewable under the Hobbs Act. See Aulenbeck, Inc. v. Fed. Highway Admin., 103 F.3d 156, 164-65 (D.C. Cir. 1997) (holding that the court had Hobbs Act jurisdiction to review Transportation Department rules addressing certain safety requirements because the agency's power to issue those requirements \"derive[d] in part\" from its transferred authority and because actions taken pursuant to that transferred authority were subject to Hobbs Act review). This is just such a case.\n\nIn issuing its Yucca Mountain standards, EPA acted pursuant to authority derived from its AEC-transferred powers. When Congress, acting through EnPA section 801, required EPA to issue Yucca-specific, radiation-protection standards, it built on EPA authority - transferred from the AEC - to promulgate generally applicable standards to protect the public from radiation. See H.R. CONF. REP. NO. 102-1018, at 390 (1992), reprinted in 1992 U.S.C.C.A.N. 2472, 2481 (\"Section 801 [of EnPA] builds upon [the] existing authority of the [EPA] Administrator to set generally applicable [radiationprotection] standards....\"). Because EPA's authority to promulgate its Yucca rule thus \"derives\" from its AEC-transferred powers, we may consider petitioners' challenge to part 197 under our Hobbs Act jurisdiction. See Aulenbeck, 103 F.3d at 165.\n\nThe second jurisdictional issue concerns EPA's claim that neither Nevada's nor the environmental petitioners' constitutional standing is \"self-evident.\" Respondent's Br. at 21. To establish Article III standing to sue on behalf of their members, NRDC and the other environmental petitioners must show that \"(a) [their] members would otherwise have standing to sue in their own right; (b) the interests [they] seek[ ] to protect are germane to [their] purpose; and (c) neither the claim asserted nor the relief requested requires the participation of individual members in the lawsuit.\" Hunt v. Wash. State Apple Adver. Comm'n, 432 U.S. 333, 343 (1977). Under the first element of this test, the environmental petitioners must show that at least one of their members meets the \"irreducible constitutional minimum\" of standing, i.e., injuryin-fact, causation, and redressability. Lujan v. Defenders of Wildlife, 504 U.S. 555, 560-61 (1992). \"The burden on a party challenging an administrative decision in the court of appeals is to show a substantial probability that it has been injured, that the [respondent] caused its injury, and that the court could redress that injury.\" Rainbow/PUSH Coalition v. FCC, 330 F.3d 539, 542 (D.C. Cir. 2003) (internal quotation marks omitted). Moreover, the asserted injury must be both \"concrete and particularized\" as well as \"actual or imminent.\" Lujan, 504 U.S. at 560.\n\nTo demonstrate standing, the environmental petitioners rely on declarations by several of their members, including one by Ed Goedhart, a member of petitioners Citizen Alert and the Nuclear Information and Resource Service. See Decl. of Ed Goedhart ¶ 1. Goedhart states that he lives and works in Amargosa Valley, Nevada, eighteen miles from Yucca Mountain. Id. ¶ 2. He alleges that EPA's failure to adopt more stringent radiation-protection standards will permit hazardous radionuclides from the buried waste to contaminate his community's ground-water supplies, causing adverse health effects. See id. ¶¶ 2-7.\n\nThese allegations are more than sufficient to give Goedhart standing to sue in his own right. The claimed injury to his ground-water supply is neither hypothetical nor conjectural. Indeed, EPA itself acknowledges that \"[t]he boundaries of the town [of Amargosa Valley] include all of the area where the highest potential doses from a repository at Yucca Mountain are anticipated....\" Final Background Information Document at 8-13. Although radionuclides escaping from the Yucca repository may not reach Goedhart's community for thousands of years, his injury is \"actual or imminent,\" for he lives adjacent to the land where the Government plans to bury 70,000 metric tons of radioactive waste - a sufficient harm in and of itself. See La. Envtl. Action Network v. United States EPA, 172 F.3d 65, 67-68 (D.C. Cir. 1999) (holding that an environmental group established constitutional standing where its members lived near a landfill into which an EPA regulation allegedly would permit certain hazardous wastes to be deposited). In addition, this harm is \"fairly traceable,\" Lujan, 504 U.S. at 560 (internal quotation marks omitted), to EPA's allegedly lax radiation-protection standards, and favorable relief, i.e., requiring EPA to make more stringent each aspect of the rule that petitioners challenge, would likely redress his harm.\n\nNor have we any doubt that Goedhart has prudential standing. To establish prudential standing, a party's \"grievance must arguably fall within the zone of interests protected or regulated by the statutory provision or constitutional guarantee invoked in the suit.\" Bennett v. Spear, 520 U.S. 154, 162 (1997). Goedhart's grievance clearly falls within the Energy Policy Act's \"zone of interests,\" for that Act seeks to ensure that DOE operates the Yucca repository safely, i.e., without endangering the lives or health of the surrounding population. See EnPA § 801(a)(1) (directing EPA to promulgate \"public health and safety standards for protection of the public from releases from radioactive materials\").\n\nBecause the Government does not argue that the environmental petitioners fail either the germaneness or the individual-participation element of associational standing, and because \"we [too] have [no] reason to believe that [they] fail[ ] to satisfy [these] latter two requirements,\" Sierra Club v. EPA, 292 F.3d 895, 898 (D.C. Cir. 2002), we conclude that the environmental petitioners have established standing to bring their petition for review. And since only one petitioner requires standing, we need not consider the Government's separate challenge to Nevada's standing. See Military Toxics Project v. EPA, 146 F.3d 948, 954 (D.C. Cir. 1998). We thus turn to the merits of Nevada's petition.\n\n2. The 10,000-Year Compliance Period\n\nNevada first challenges EPA's decision to establish a compliance period that extends only 10,000 years into the future. According to Nevada, the 10,000-year marker violates EnPA section 801(a) and is arbitrary and capricious under the Administrative Procedure Act (APA), 5 U.S.C. § 706(2)(A) (2000). We begin and end with Nevada's EnPA challenge.\n\nSection 801(a) of the Energy Policy Act requires EPA to promulgate public health and safety standards for Yucca Mountain \"based upon and consistent with the findings and recommendations of the National Academy of Sciences.\" Chartered by Congress during the Civil War, the National Academy of Sciences (NAS or Academy) serves as the federal government's scientific adviser, convening distinguished scholars to address scientific and technical issues confronting society. See NAS REPORT at vi. EnPA directs EPA to contract with NAS to conduct a study to provide \"findings and recommendations on reasonable standards for protection of the public health and safety\" from the potential hazards posed by a Yucca Mountain repository. EnPA § 801(a)(2). To undertake the necessary study, NAS convened a committee organized under the auspices of its principal operating arm, the National Research Council. NAS REPORT at vi-vii. That committee retained two consultants, conducted five open meetings to which it invited over fifty scientists and engineers, and reviewed publicly available research compiled by federal, state, and local agencies, among others. Id. at viiviii.\n\nThe Academy's work culminated in a 1995 report entitled \"Technical Bases for Yucca Mountain Standards.\" With respect to the length of the compliance period, NAS found \"no scientific basis for limiting the time period of the individualrisk standard to 10,000 years or any other value.\" Id. at 55. According to the Academy, \"compliance assessment is feasible for most physical and geologic aspects of repository performance on the time scale of the long-term stability of the fundamental geologic regime - a time scale that is on the order of 10 6 [one million] years at Yucca Mountain.\" Id. at 6. NAS also explained that humans may not face peak radiation risks until tens to hundreds of thousands of years after disposal, \"or even farther into the future.\" Id. at 2. Given these findings - and central to the issue before us - NAS \"recommend[ed] that compliance assessment be conducted for the time when the greatest risk occurs, within the limits imposed by the long-term stability of the geologic environment.\" Id. at 6 (emphasis omitted). That said, NAS explained that \"although the selection of a time period of applicability has scientific elements, it also has policy aspects that we have not addressed,\" such as the goal of establishing consistent policies for managing various kinds of long-lived, hazardous materials. Id. at 56.\n\nFollowing issuance of the NAS Report, EPA promulgated its draft part 197 standards in which it proposed a 10,000-year compliance period. In so doing, EPA \"request[ed] comments upon the reasonableness of adopting the NAS-recommended compliance period or some other approach in lieu of the 10,000-year compliance period which we favor....\" 64 Fed. Reg. at 46,995. DOE, responding to EPA's request, supported the 10,000-year compliance period, claiming that a \"significantly longer time period for assessing compliance would be unprecedented, unworkable, and probably unimplementable.\" Letter from Lake H. Barrett, Acting Director, Office of Civilian Radioactive Waste Management, to United States Environmental Protection Agency 2 (Nov. 1999). By contrast, Nevada submitted comments opposing the 10,000-year marker, urging that EPA adopt a period of compliance covering the time of projected peak doses, as NAS had recommended. See Letter from Robert R. Loux, Executive Director, Office of the Governor, Agency for Nuclear Projects, to United States Environmental Protection Agency 8 (Nov. 23, 1999).\n\nAfter the comment period closed, EPA promulgated its final rule, in which it adopted a 10,000-year compliance period. Expressly acknowledging that NAS had recommended that the compliance period cover the time when the greatest risk of radiation exposure occurs and that the Academy had found it scientifically possible to predict repository performance for approximately one million years, EPA nevertheless concluded that \"such an approach is not practical for regulatory decisionmaking.\" 66 Fed. Reg. at 32,097. The agency explained:\n\nDespite NAS's recommendation, we conclude that there is still considerable uncertainty as to whether current modeling capability allows development of computer models that will provide sufficiently meaningful and reliable projections over a time frame up to tens-of-thousands to hundreds-of-thousands of years. Simply because such models can provide projections for those time periods does not mean those projections are meaningful and reliable enough to establish a rational basis for regulatory decisionmaking.\n\nId. Moreover, EPA maintained that selecting a compliance period for the individual-protection standard \"involves both technical and policy considerations.... In addition to the technical guidance provided in the NAS Report, we considered several policy and technical factors that NAS did not fully address, as well as the experience of other EPA and international programs.\" Id. at 32,098. According to EPA, five considerations guided its decision: (1) the agency uses 10,000 years for programs involving the disposal of other long-lived, hazardous materials, (2) the individual-protection requirements in 40 C.F.R. part 191, EPA's generally applicable nuclear waste disposal standards, use such a time frame, and \"consistency [is] appropriate because both sets of standards apply to the same types of waste,\" (3) many international geologic disposal programs use 10,000 years, (4) setting the standard to peak dose times \"could lead to a period of regulation that has never been implemented in a national or international radiation regulatory program,\" and focusing on 10,000 years forces more emphasis on features that humans can control such as repository design, and (5) projecting human exposure levels over long periods of time involves great uncertainty. Id. at 32,098-99. On this last point, EPA stated that \"we believe that NAS might not have fully addressed two aspects of uncertainty,\" specifically (1) \"the impact of long-term natural changes in climate and its effect upon choosing an appropriate RMEI,\" and (2) \"the range of possible biosphere conditions and human behavior.\" Id.\n\nIn the final rule's preamble, EPA also explained why it believed that part 197 complied with EnPA's requirement that the rule be \"based upon and consistent with\" NAS's findings and recommendations. Id. at 32,082-84. That mandate, EPA stated, \"does not bind us absolutely to follow the NAS Report. Instead, we used it as a starting point for this rulemaking.... [W]e do not believe the statute forces our rulemaking to adopt mechanically NAS's recommendations as standards.\" Id. at 32,083. Thus, because part 197 was \"guided by the [Academy's] findings and recommendations [in light] of the special role Congress gave it,\" id., EPA concluded that it had acted in accordance with EnPA's directive.\n\nChallenging EPA's determination, Nevada contends that part 197's 10,000-year compliance period deviates from the NAS Report and that EPA therefore failed to promulgate a rule \"based upon and consistent with\" NAS's findings and recommendations, as required by EnPA section 801(a). Because Congress has charged EPA with implementing section 801(a) of the Energy Policy Act, we analyze this claim under the two-part test of Chevron U.S.A. Inc. v. Natural Resources Defense Council, Inc., 467 U.S. 837 (1984). See United States v. Mead Corp., 533 U.S. 218, 226-27 (2001). Under Chevron 's first step, we ask \"whether Congress has directly spoken to the precise question at issue,\" for if \"the intent of Congress is clear, that is the end of the matter.... [T]he court, as well as the agency, must give effect to the unambiguously expressed intent of Congress.\" Chevron, 467 U.S. at 842-43. If the statute is \"silent or ambiguous with respect to the specific issue,\" we proceed to Chevron 's second step, asking whether the agency's interpretation \"is based on a permissible construction of the statute.\" Id. at 843. At this stage, although we defer to agency statutory interpretations, \"our judicial function is neither rote nor meaningless,\" Natural Res. Def. Council, Inc. v. Daley, 209 F.3d 747, 752 (D.C. Cir. 2000), and we will reject an interpretation \"that diverges from any realistic meaning of the statute,\" id. at 753 (quoting Massachusetts v. Dep't of Transp., 93 F.3d 890, 893 (D.C. Cir. 1996)) (internal quotation marks omitted).\n\nBeginning at Chevron Step One, then, we ask whether Congress's directive that EPA issue standards \"based upon and consistent with the findings and recommendations of the National Academy of Sciences\" is clear and unambiguous. In considering this question, we do not write on a clean slate. In a recent case interpreting the Clean Air Act, we observed that \"[t]here is no question that the phrase `based on' is ambiguous.\" Sierra Club v. EPA, 356 F.3d 296, 305-06 (D.C. Cir. 2004), amended by No. 03-1084, 2004 WL 877850 (D.C. Cir. Apr. 16, 2004). Although the words \"based on\" do not necessarily mean \"rest solely on,\" we concluded, they prohibit actions that \"abandon[ ]\" or \"supplant[ ].\" Id. at 306. In another Clean Air Act case, we reached a similar conclusion about the phrase \"consistent with,\" explaining that this \"flexible statutory language\" requires not \"exact correspondence ... but only congruity or compatibility.\" Envtl. Def. Fund, Inc. v. EPA, 82 F.3d 451, 457 (D.C. Cir. 1996) (per curiam) (describing the phrase \"consistent with\" as requiring the court to defer to reasonable agency determinations), amended by 92 F.3d 1209 (D.C. Cir. 1996). Likewise, in Natural Resources Defense Council, Inc. v. Daley, we held that a statute requiring fishing quotas to be (among other things) \"consistent with\" a fishery management plan was ambiguous. 209 F.3d at 754. Because \"[t]he statute does not prescribe a precise quota figure,\" we reasoned, \"there is no plain meaning on this point.\" Id. (\"[W]e ... view this case as governed by Chevron Step Two.\"). Given this case law, we are not free to conclude that section 801(a) clearly and unambiguously answers the precise question before us.\n\nNor can we discern an unambiguous congressional command from EnPA's legislative history. See id. at 752 (\"Under the first step of Chevron, the reviewing court must exhaust the traditional tools of statutory construction to determine whether Congress has spoken to the precise question at issue.\" (internal quotation marks omitted)). The Conference Report explains:\n\nThe Conferees do not intend for the National Academy of Sciences, in making its recommendations, to establish specific standards for protection of the public but rather to provide expert scientific guidance on the issues involved in establishing those standards. Under the provisions of section 801, the authority and responsibility to establish the standards, pursuant to a rulemaking, would remain with the [EPA] Administrator, as is the case under existing law. The provisions of section 801 are not intended to limit the Administrator's discretion in the exercise of his authority related to public health and safety issues.\n\nH.R. CONF. REP. NO. 102-1018, at 391, reprinted in 1992 U.S.C.C.A.N. at 2482. Rather than answering the specific question at hand, this discretion-conferring language supports our view that nothing in section 801(a) specifies precisely how EPA must use the NAS Report.\n\nFor its part, EPA insists that Congress actually intended it to adopt a 10,000-year compliance period. In support of this argument, EPA relies on EnPA section 801(a)(2)(C), which directed the agency to engage NAS to examine whether it is possible to predict the probability that humans will breach Yucca Mountain's engineered or geologic barriers over a 10,000-year period. EPA also points out that at the time Congress enacted EnPA, the First Circuit had upheld a 10,000-year compliance period contained in EPA's generic part 191 standards. See NRDC v. EPA, 824 F.2d at 1292-93. By failing to specify an alternate time frame in the Energy Policy Act, EPA argues, Congress tacitly endorsed 10,000 years.\n\nEPA misreads EnPA's contextual clues. Although EnPA mentions 10,000 years in section 801(a)(2), section 801(a)(1) - the provision that requires EPA to issue a Yucca-specific rule - tells the agency exactly how to set any compliance period, i.e., it must be \"based upon and consistent with\" NAS's recommendations. In view of this express directive, moreover, Congress's failure to establish a compliance period cannot be viewed as tacit approval of the part 191 time frame.\n\nGiven section 801's ambiguity, Nevada's challenge turns on whether EPA's 10,000-year compliance period can be reasonably described as \"based upon and consistent with\" NAS's findings and recommendations. We think it cannot. It would have been one thing had EPA taken the Academy's recommendations into account and then tailored a standard that accommodated the agency's policy concerns. But that is not what EPA did. Instead, it unabashedly rejected NAS's findings, and then went on to promulgate a dramatically different standard, one that the Academy had expressly rejected. Although section 801's \"based upon and consistent with\" standard does not require EPA to walk in lock-step with the Academy, we think it entirely unreasonable for EPA to have acted inconsistently with NAS findings and recommendations. As in Daley, \"[t]his case presents a situation in which the [agency's action] so completely diverges from any realistic meaning of the [statute] that it cannot survive scrutiny under Chevron Step Two.\" 209 F.3d at 753.\n\nTo begin with, there is little question that EPA's 10,000-year compliance period deviates dramatically from the Academy's findings. Most important, NAS unequivocally recommended a standard pegged to the time when radiation doses reach their peak:\n\nWe believe that compliance assessment is feasible for most physical and geologic aspects of repository performance on the time scale of the long-term stability of the fundamental geologic regime - a time scale that is on the order of 10 6 [one million] years at Yucca Mountain - and that at least some potentially important exposures might not occur until after several hundred thousand years. For these reasons, we recommend that compliance assessment be conducted for the time when the greatest risk occurs, within the limits imposed by long-term stability of the geologic environment.\n\nNAS REPORT at 6-7. NAS reiterated this conclusion throughout its report: \"[W]e recommend ... [t]hat compliance with the standard be measured at the time of peak risk, whenever it occurs,\" id. at 2 (footnote omitted); \"we have recommended that the standard for individual risk should apply at times when the peak potential risks might occur,\" id. at 55-56; \"we see no technical basis for limiting the period of concern to a period that is short compared to the time of peak risk or the anticipated travel time,\" id. at 56; \"[t]he period over which this level of protection should be assessed should extend over the period of duration of hazard potential of the repository, that is, until the time at which the highest critical group risk is calculated to occur, within the limits imposed by the longterm stability of the geologic environment at Yucca Mountain, which is on the order of [one million] years,\" id. at 67.\n\nNot only did NAS recommend that EPA set its compliance period based on peak risk, but it expressly rejected 10,000 years as a proper benchmark: \"The current EPA standard [in part 191] contains a time limit of 10,000 years for the purpose of assessing compliance. We find that there is no scientific basis for limiting the time period of an individualrisk standard in this way.\" Id. at 6; see also id. at 55 (\"[W]e believe that there is no scientific basis for limiting the time period of the individual-risk standard to 10,000 years or any other value.\"). A 10,000-year limitation, NAS explained, \"might be inconsistent with protection of public health.\" Id. at 55. NAS continued:\n\n[A]s noted in a previous National Research Council study, EPA's 10,000-year time limit ... makes compliance rather easy. This we do not support because ... we see no valid justification for this time limit.... Th[is] ... calculational approach may seem to simplify licensing, but we do not understand how such an exercise can support the finding, required in licensing, that there be no unreasonable risk to the health and safety of the public.\n\nId. (internal quotation marks omitted) (second and third omissions in original).\n\nDescribing its recommendation as differing from a 10,000-year standard, NAS went on to state:\n\nPerhaps the most significant difference between our recommendations and 40 CFR 191 concerns the time period over which the standard is applicable. In 40 CFR 191, the standard applies for a period of 10,000 years. In our proposal, we have specified that the basis for the standard should be the peak risk, whenever it occurs [within the limits imposed by the long-term stability of the geologic environment]. Based on performance assessment calculations provided to us, it appears that for some reasonable combinations of parameters, peak risks are likely to occur after 10,000 years.\n\nId. at 119 (footnote omitted) (emphasis added); see also id. at 2 (same).\n\nEPA's own explanation of its treatment of the NAS Report also reveals that the agency consciously and outrightly rejected the Academy's findings and recommendations. For example, in the final rule's preamble, EPA acknowledged that NAS had found \"no scientific basis for limiting the time period of the individual-risk standard to 10,000 years or any other value,\" but \" [d]espite NAS's recommendation,\" it concluded that a 10,000-year standard was appropriate. 66 Fed. Reg. at 32,097 (internal quotation marks omitted) (emphasis added); see also id. (concluding that NAS's recommended peak dose standard is \"not practical for regulatory decisionmaking, which involves more than scientific performance projections using computer models\").\n\nThis case is quite similar to Daley, where, as we explained above, see supra at 25, we held that a statute directing that agency fishing quotas be \"consistent with\" applicable fishery management plans was not free from ambiguity. See 209 F.3d at 753-54. Because the agency's quota in that case had only an eighteen percent likelihood of achieving its conservation target, we held that it failed Chevron 's Step-Two reasonableness test. Id. \"Only in Superman Comics' Bizarro world, where reality is turned upside down,\" we explained, \"could the [agency] reasonably conclude that a measure that is at least four times as likely to fail as to succeed offers [the requisite degree of] confidence.\" Id. at 754 (internal quotation marks omitted). So too here. Only in a world where \"based upon\" means \"in disregard of\" and \"consistent with\" means \"inconsistent with\" could EPA's adoption of a 10,000-year compliance period be considered a permissible construction of section 801.\n\nEPA nevertheless insists that it acted consistently with the Academy's conclusions because it based the 10,000-year compliance period on several policy concerns beyond the ken of NAS's technical expertise. In support of this argument, EPA relies on NAS's acknowledgment that agency standardsetting implicates policy considerations: \"[W]e note that although the selection of a time period of applicability has scientific elements,\" NAS stated, \"it also has policy aspects that we have not addressed. For example, EPA might choose to establish consistent policies for managing risks from disposal of both long-lived hazardous nonradioactive materials and radioactive materials.\" NAS REPORT at 56 (citations omitted).\n\nWe think the Academy's statement far too thin a reed on which to find that EPA reasonably interpreted EnPA's \"based upon and consistent with\" command. Simply stating that standard-setting has \"policy aspects\" cannot transform NAS's statement that \"we recommend that compliance assessment be conducted for the time when the greatest risk occurs, within the limits imposed by long-term stability of the geologic environment,\" id. at 6-7 (emphasis omitted), into, as EPA would seemingly have it, \"we recommend that compliance assessment be conducted for the period that lacks scientific basis but that best meets EPA's policy goals.\" Furthermore, NAS's conclusion that EPA \"might choose to establish consistent policies\" is of little importance here, given that this court - not the Academy - is charged with determining whether EPA has exercised its rulemaking discretion in compliance with EnPA. And although our case law makes clear that a phrase like \"based upon and consistent with\" does not require EPA to hew rigidly to NAS's findings, EnPA section 801(a) cannot reasonably be read to allow a regulation wholly inconsistent with NAS recommendations.\n\nEPA also claims that it complied with EnPA because it based the 10,000-year compliance period on the Academy's finding that \"there is no scientific basis for prediction of future states [of human activity], and the limit of our ability to extrapolate with reasonable confidence is measured in decades, or at most, a few hundreds of years.\" Id. at 55. This statement helps EPA not at all, for NAS nonetheless concluded that despite this uncertainty, limiting the compliance period to 10,000 years was inappropriate. Id.\n\nFinally, at oral argument, EPA counsel insisted that part 197 is consistent with NAS's findings because it requires DOE to \"calculate the peak dose of the reasonably maximally exposed individual that would occur after 10,000 years following disposal but within the period of geologic stability\" and to \"include [those] results and their bases in the environmental impact statement for Yucca Mountain as an indicator of long-term disposal system performance.\" 40 C.F.R. § 197.35; see also Oral Argument Tr. at 32 (\"[W]e certainly think that the ultimate result was consistent with the NAS recommendations insofar as the projections out to time of peak dose are required to be performed and submitted in the [Environmental Impact Statement].\"). Although EPA's addition of this provision might well represent a nod to NAS, it hardly makes the agency's regulation consistent with the Academy's findings. NAS recommended that the compliance period extend to the time of peak risk, yet EPA's rule requires only that DOE calculate peak doses and expressly provides that \"[n]o regulatory standard applies to the results of this analysis.\" 40 C.F.R. § 197.35; see also 66 Fed. Reg. at 32,096 (\"The rule does not ... require that DOE meet a specific dose limit after 10,000 years.\").\n\nIn sum, because EPA's chosen compliance period sharply differs from NAS's findings and recommendations, it represents an unreasonable construction of section 801(a) of the Energy Policy Act. Although EnPA's \"based upon and consistent with\" mandate leaves EPA with some flexibility in crafting standards in light of NAS's findings, EPA may not stretch this flexibility to cover standards that are inconsistent with the NAS Report. Had EPA begun with the Academy's recommendation to base the compliance period on peak dosage and then made adjustments to accommodate policy considerations not considered by NAS, this might be a very different case. But as the foregoing discussion demonstrates, EPA wholly rejected the Academy's recommendations. We will thus vacate part 197 to the extent that it requires DOE to show compliance for only 10,000 years following disposal. On remand, EPA must either issue a revised standard that is \"based upon and consistent with\" NAS's findings and recommendations or return to Congress and seek legislative authority to deviate from the NAS Report. It was Congress that required EPA to rely on NAS's expert scientific judgment, and given the serious risks nuclear waste disposal poses for the health and welfare of the American people, it is up to Congress - not EPA and not this court - to authorize departures from the prevailing statutory scheme.\n\nBecause EPA's 10,000-year compliance period violates EnPA section 801, we have no need to consider Nevada's alternative argument that the standard is arbitrary and capricious under the APA.\n\n3. The Controlled Area\n\nNevada next attacks part 197's controlled area. Part 197 contemplates that the Yucca Mountain disposal system will include not just a repository in which the waste packages are placed, but also a controlled area surrounding the repository. Under the rule, the controlled area may extend five kilometers from the repository in every direction, except that toward the south - the direction in which ground water flows - the area may extend to a specified geographic coordinate that is roughly eighteen kilometers away. See 40 C.F.R. § 197.12; 66 Fed. Reg. at 32,094.\n\nThe controlled area serves three distinct functions. First,it operates as the natural barrier portion of the disposalsystem, the land dedicated to isolating and diluting radionuclides released from the waste packages. See 66 Fed. Reg. at32,117. Second, it designates the area that EPA will makeoff-limits to human settlement through \"institutional controls\"such as signs or guards. Id. Third, and central to Nevada'schallenge here, the controlled area's borders establish themaximum distance from the repository that the Energy Department may locate the reasonably maximally exposed individual for purposes of demonstrating compliance with theindividual-protection standard, see 40 C.F.R. §§ 197.20-197.21, as well as the greatest distance from the repositorythat DOE may place the point of compliance for the groundwater-protection standard, see id. §§ 197.30, 197.31(a)(1).Under the individual-protection standard, DOE must showthat the RMEI living in the \"accessible environment,\" definedas any point outside the controlled area, id. § 197.12, andspecifically, \"above the highest concentration of radionuclidesin the plume of contamination,\" id. 197.21(a), will incur radiation doses no greater than prescribed by the rule, id. § 197.20. Under the ground-water-protection standard, DOEmust show that radiation levels in the representative volumeof water, including \"the highest concentration level in theplume of contamination\" outside the controlled area, id.§ 197.31(a)(1), do not exceed maximum contaminant limits, id.§ 197.30.\n\nIn the final Yucca rule, EPA selected a point approximately eighteen kilometers south of the repository as the presumed location of the RMEI and the ground-water standard's point of compliance. EPA explained that after considering locations ranging from a few kilometers to roughly thirty kilometers from the repository, it selected the eighteen-kilometer point as the RMEI's location for two primary reasons. First, after warning signs and other institutional controls lapse with the passage of time (the Academy was unable to predict how long such controls would last, see NAS REPORT at 106), rural residents - those with the lifestyle traits upon which EPA chose to model its RMEI, see 66 Fed. Reg. at 32,090 - are unlikely to settle farther north because living conditions become less hospitable the closer one gets to the repository. In particular, terrain becomes rougher, and depth to ground water increases. See id. at 32,094. Second, EPA concluded that even if individuals, notwithstanding these conditions, chose to live closer to Yucca Mountain, they would incur less overall exposure than rural residents at eighteen kilometers away, so placing the RMEI at the eighteen-kilometer point would provide greater overall protection than a more northerly location. Id. \"[E]ven though the ground water nearer the repository could contain higher concentrations of radionuclides,\" EPA explained, if individuals lived closer to the repository, they would incur lower overall doses. Id. at 32,093. According to the agency:\n\n[Such individuals] would be unlikely to withdraw water from the significantly greater depth for other than domestic use, and in the much larger quantities needed for gardening or farming activities because of the significant cost of finding and withdrawing the ground water. It is possible, therefore, for an individual located closer to the repository to incur exposures from contaminated drinking water, but not from ingestion of contaminated food.\n\nId. Based on these findings, EPA concluded, \"the exposure for an RMEI located approximately 18 [kilometers] south of the repository (where ingestion of locally grown contaminated food is a reasonable assumption) actually would be more conservative than an RMEI located much closer to the repository who is exposed primarily through drinking water.\" Id.\n\nWith respect to the ground-water standard's point of compliance, EPA explained:\n\n[A]s one gets closer than about 18 [kilometers] to the repository footprint, the depth to water begins to increase dramatically from about 100 [meters] at a distance of 20 [kilometers] to a few hundred meters at a distance of 5 [kilometers]. Given the expectation of future population growth and the precious nature of ground water resources in the area, it is reasonable to assume that a small group may annually extract the representative volume of ground water at a distance slightly closer than 20 [kilometers].... This approach is protective of the ground water resources reasonably anticipated to be accessed in the vicinity of Yucca Mountain.\n\nId. at 32,119-20.\n\nNevada contends that EPA's factual assumptions lack record support and that the agency therefore acted arbitrarily and capriciously in allowing the controlled area's southern boundary to extend eighteen kilometers from the repository. In particular, Nevada argues that the record shows that humans are likely to settle and grow food at locations much closer to the repository and that individuals living nearer to the buried waste will incur greater radiation exposure than those a full eighteen kilometers away. Based on this view of the record, Nevada claims that EPA's controlled area is both irrational and insufficiently protective of public health and safety. We disagree.\n\nTo begin with, contrary to Nevada's assertion, record evidence supports EPA's finding that humans are unlikely to cultivate crops within the controlled area. The Final Background Information Document, which explains much of the technical basis for EPA's rule, shows not only that costs for drilling water increase as depth to water increases, but also that drilling and pumping water for irrigation purposes at depths exceeding 300 feet is economically infeasible, i.e., that when \"[c]ombining ... pumping cost estimates ... with ... capital cost estimates ..., the marginal value of water for irrigation is exceeded at depths to water greater than 300 feet.\" Final Background Information Document at IV-12; see also id. at IV-10, IV-12 (estimating the costs of drilling wells and pumping water for irrigation purposes at various depth-to-water levels). EPA therefore concluded that accessing water for irrigation is cost-prohibitive at locations closer than eighteen kilometers. In reaching this conclusion, EPA, relying on the Academy's recommendation, found that since it was \"impossible to predict either human activities or economic imperatives,\" it would assume \"current conditions\" would persist indefinitely. 66 Fed. Reg. at 32,094 (\"[W]e followed NAS's recommendation to use current conditions to avoid highly speculative scenarios.\"). Because Nevada does not challenge this odd aspect of EPA's reasoning and because depth to water generally surpasses 300 feet at points closer to the repository than the eighteen-kilometer mark, see Final Background Information Document at 8-33, EPA's conclusion that humans would be unlikely to pursue agricultural activities in such unfavorable terrain seems reasonable to us.\n\nWe also think it reasonable for the agency to have found that humans will likely choose to settle outside the controlled area. Although the record does show that a community could feasibly settle within the controlled area and use local water for domestic (as opposed to agricultural) purposes, see id. at IV-11 to IV-12, and that institutional controls cannot deter settlement within the controlled area for the entire compliance period, see id. at 8-89, EPA's Final Background Information Document demonstrates that the costs of settling nearer to the repository are substantially higher than establishing a community farther away, see id. at IV-8 to IV-9. In any event, to satisfy the APA's rational-decisionmaking standard, EPA need not prove that humans will never settle within the controlled area; the agency needs only a reasonable basis for believing that they are unlikely to do so. See City of Waukesha v. EPA, 320 F.3d 228, 247 (D.C. Cir. 2003) (per curiam) (\"[W]e will give an extreme degree of deference to the agency when it is evaluating scientific data within its technical expertise.\" (internal quotation marks omitted)). Indeed, deciding where to locate the RMEI and the groundwater standard's point of compliance involves a complex linedrawing judgment to which we owe great deference. See Sinclair Broad. Group, Inc. v. FCC, 284 F.3d 148, 159 (D.C. Cir. 2002) (\"Where issues involve elusive and not easily defined areas ..., our review is considerably more deferential, according broad leeway to the [agency's] line-drawing determinations.\" (citation and internal quotation marks omitted)).\n\nEPA's conclusion that individuals who could settle closer to the repository will incur less radiation exposure than those living eighteen kilometers away, though seemingly counterintuitive, also finds support in the record. Although ground water nearer to the repository could contain higher radiation concentrations than ground water farther away, see 66 Fed. Reg. at 32,093, well-drilling data in the record and the Energy Department's analysis of relative radiation-exposure levels support EPA's ultimate RMEI-location decision. As discussed above, EPA's well-drilling cost estimates show that individuals who may settle closer to the repository are unlikely to extract water for agricultural purposes. Record data also demonstrate that individuals living closer to the repository who consume smaller quantities of more highly contaminated water (water for drinking alone) will experience less overall exposure than those living farther from the repository who consume greater amounts of less contaminated water (water for both drinking and agriculture). DOE's draft environmental impact statement projects that the mean peak dose rate for an individual at five kilometers, whose radiation intake is through drinking contaminated water alone, will be lower than that for a person at twenty kilometers who consumes contaminated drinking water and contaminated food. See United States Department of Energy, Draft Environmental Impact Statement for a Geologic Repository for the Disposal of Spent Nuclear Fuel and High-Level Radioactive Waste at Yucca Mountain, Nye County, Nevada 5-26 to 5-36 (July 1999).\n\nNevada's remaining challenges to EPA's well-drilling data are without merit. Although it is true that EPA found it \"difficult to reconcile\" cost figures in a particular set of wellconstruction cost estimates, Final Background Information Document at IV-2, the agency did not rely on those analyses, resting its conclusions instead on calculations that estimated the overall cost of water based on construction and pumping costs for wells of various depths, see id. (stating that the agency estimated \"the significance of drilling costs on the overall cost of water ... by estimating the costs of various wells (different uses and depths) from the data available and then calculating the capital cost per acre-foot\"); see also id. at IV-11 (describing the mathematical equation used to compute water-pumping costs). And despite the State's claim to the contrary, the fact that DOE itself uses two wells within the proposed controlled area to support its Yucca siteinvestigation activities, see id. at 8-80; 66 Fed. Reg. at 32,123, provides no basis for questioning EPA's reasoning, for how a government agency chooses to allocate public funds tells us little (if anything) about how individuals, motivated by economic and personal considerations, decide where to live.\n\nFinally, Nevada contends that the rule's controlled area boundaries violate what the State describes as the \"nonendangerment\" provision of the Safe Drinking Water Act. 42 U.S.C. § 300h(b)(3)(C) (2000) (\"Nothing in this section shall be construed to alter or affect the duty to assure that underground sources of drinking water will not be endangered by any underground injection.\"). Although conceding both that EPA need not apply the SDWA to ground water within the controlled area and that EPA has imported its SDWA-based, maximum-contaminant-level standards to regulate ground water outside the controlled area, Nevada nevertheless insists that the SDWA compels EPA to draw a smaller controlled area. This argument fails for a simple reason: SDWA standards do not apply to the Yucca Mountain repository. On this score, EnPA could not be clearer: \"[EPA's Yucca standards] shall be the only [public health and safety] standards applicable to the Yucca Mountain site.\" EnPA § 801(a)(1); see also H.R. CONF. REP. NO. 102-1018, at 390, reprinted in 1992 U.S.C.C.A.N. at 2481 (\"[T]he standards established by the authority in this section would be the only such standards for protection of the public from releases of radioactive materials as a result of the disposal of spent nuclear fuel or high-level radioactive waste in a repository at the Yucca Mountain site.\"). Thus, even assuming that the SDWA applies to nuclear waste disposal at Yucca Mountain, Congress, acting through EnPA, exempted the Nevada repository from that statute. Therefore, the SDWA cannot limit the size of Yucca's controlled area, and because \"the intent of Congress is clear, that is the end of the matter.\" Chevron, 467 U.S. at 842.\n\n4. The Definition of \"Disposal \"\n\nFor its final challenge to part 197, Nevada claims that EPA exceeded its statutory authority by adopting a definition of the term \"disposal\" that deviates from the one contained in the NWPA. While the NWPA defines \"disposal\" as \"the emplacement in a repository of high-level radioactive waste, spent nuclear fuel, or other highly radioactive material with no foreseeable intent of recovery, whether or not such emplacement permits the recovery of such waste,\" 42 U.S.C. § 10101(9) (2000), EPA's rule adds a \"for as long as reasonably possible\" qualifier, 40 C.F.R. § 197.12. The rule defines \"disposal\" as \"the emplacement of radioactive material into the Yucca Mountain disposal system with the intent of isolating it for as long as reasonably possible and with no intent of recovery, whether or not the design of the disposal system permits the ready recovery of the material.\" Id. According to Nevada, the additional \"for as long as reasonably possible\" language \"could be read as requiring only temporary delay of radiation releases with engineered barriers to qualify as `disposal,' mark[ing] a departure from the [c]ongressional objective in the NWPA to base repository siting primarily on the principle of long-term geologic isolation.\" Nev. Br. at 2.\n\nNevada's claim fails, again for a simple reason: EnPA, the statute pursuant to which EPA promulgated part 197, does not require the agency to use NWPA definitions. See EnPA § 801(a)(1) (requiring EPA to promulgate standards to govern Yucca Mountain \"[n]otwithstanding\" other authority of the agency to issue generally applicable standards); see also id. § 801(a)(3) (stating that only EnPA, \"rather than any other authority of the Administrator to set generally applicable standards for radiation protection,\" applies to the Yucca Mountain site). Rather, EnPA is silent as to the meaning of \"disposal,\" and Nevada has failed to show that in filling that statutory gap, EPA acted unreasonably. See Chevron, 467 U.S. at 843 (stating that administering a congressionally created program requires \"the making of rules to fill any gap left, implicitly or explicitly, by Congress\").\n\nC. NEI's Challenge to the Ground-Water Standard\n\nThe Nuclear Energy Institute, a trade association representing the nuclear energy industry, also takes issue with part 197. Specifically, it challenges EPA's inclusion of a separate ground-water-protection standard. See 40 C.F.R. § 197.30. As NEI sees it, requiring DOE to demonstrate compliance with a distinct ground-water standard is unnecessary because the rule's individual-protection standard already limits overall radiation exposure, including exposure received through contaminated ground water.\n\n1. Standing\n\nBefore addressing the merits of NEI's challenge, we must consider EPA's claim that the organization lacks standing. To maintain its petition for review, NEI, like the environmental petitioners, must demonstrate that it satisfies both associational and prudential standing requirements. See Hunt, 432 U.S. at 343 (articulating the standing requirements for associations); Reytblatt v. United States Nuclear Regulatory Comm'n, 105 F.3d 715, 720 (D.C. Cir. 1997) (stating that the Hobbs Act, which authorizes \"[a]ny party aggrieved\" to challenge final agency orders, 28 U.S.C. § 2344 (2000), requires parties to demonstrate both constitutional and prudential standing).\n\nNEI claims that it has associational standing because part 197's ground-water standard will complicate and delay the completion of the Yucca Mountain repository. According to NEI, EPA's addition of a separate ground-water requirement will force the Energy Department to expend additional resources - both time and money - which will in turn inflict concrete harm on NEI members who, under the NWPA, not only bear the cost of storing their spent nuclear fuel until the Yucca Mountain repository is constructed, but also foot the repository's bill through fee assessments paid into the Nuclear Waste Fund. See 42 U.S.C. § 10131(a)(5) (stating that nuclear waste generators \"have the primary responsibility to provide for, and the responsibility to pay the costs of, the interim storage of [nuclear] waste ... until [it] is accepted by the Secretary of Energy\" for disposal); id. § 10222 (requiring nuclear waste generators to pay fees into the Nuclear Waste Fund to finance the building and operation of the Government's underground repository). Affidavits submitted by NEI state (1) that nuclear power plants spend millions of dollars constructing and operating storage facilities, see Decl. of Eileen M. Supko ¶¶ 16, 18-21, and (2) that imposition of a ground-water standard will require DOE to undertake additional work at the characterization, design, and licensing stages - which will both delay the date on which the Energy Department will take stored waste off NEI members' hands and increase repository costs, see Decl. of Steven P. Kraft ¶¶ 8-11.\n\nDisputing these contentions, EPA argues that the separate ground-water standard imposes no additional cost on the repository program because the data and analysis required to assess compliance with the ground-water standard are the same as those required for the individual-protection standard. See United States Environmental Protection Agency, Public Health and Environmental Radiation Protection Standards for Yucca Mountain, Nevada - Final 40 CFR 197: Evaluation of Potential Economic Impacts of 40 CFR Part 197 (Economic Impact Assessment) at ES-1 to ES-2, 6-5, 7-1 (June 2001); see also Decl. of Ronald A. Milner ¶ 10 (\"[I]t is speculative whether compliance with the final EPA groundwater standard would increase costs to the [Nuclear Waste] Fund so as to require an increase to the ... per kilowatt-hour fee in the future or whether compliance with the standard would cause delays in the construction of a repository....\"). Moreover, the agency argues that NEI's requested relief - striking the ground-water standard from part 197 - will not redress the organization's alleged injury because, with or without a separate ground-water standard, DOE will retain the same repository design.\n\nBased on the record before us, we conclude that NEI has standing to bring its petition for review. As to injury-in-fact, we have no doubt that delaying the opening of the Yucca Mountain repository would inflict concrete harm on NEI members, for as NEI's affidavit explains, NEI members expend substantial sums to operate their own storage facilities. See Supko Decl. ¶¶ 16, 19. We likewise think NEI has shown a \"substantial probability,\" Rainbow/PUSH Coalition, 330 F.3d at 542, that the addition of a separate ground-water standard will cause these delays and that the organization's requested relief will likely redress this harm. As NEI points out, part 197 requires DOE to demonstrate compliance with a separate ground-water standard in NRC licensing proceedings, see 40 C.F.R. §§ 197.13, 197.30 - a requirement that both DOE and NAS found could complicate the licensing process, see Letter from Lake H. Barrett, to United States Environmental Protection Agency at B-4 (\"[T]he proposed separate, single-pathway, groundwater standard could, depending on how it was implemented, prohibitively complicate licensing....\"); Letter from Michael Kavanaugh, Chair and John Ahearne, Vice Chair, Board on Radioactive Waste Management, National Research Council, to Carol M. Browner, Administrator, Environmental Protection Agency 11 (Nov. 26, 1999) [hereinafter \"NAS Comments\"] (\"Such separate [ground-water] limits may greatly complicate the licensing process....\"); see also Kraft Decl. ¶ 10 (asserting that during the NRC licensing process, DOE and NRC will have to spend time and resources ensuring that the repository complies with the separate ground-water standard). Moreover, although EPA vigorously disputes NEI's claim that the ground-water standard will increase the cost of repository design and construction, the agency says virtually nothing about possible delays in the licensing process. Given this record, NEI has carried its burden of satisfying Article III's \"irreducible constitutional minimum.\" Finally, pursuing litigation to speed the licensing of a permanent repository is \"germane to the organization's purpose[,] and ... neither the claim asserted nor the relief requested requires the participation of individual members in the lawsuit.\" Hunt, 432 U.S. at 343. EPA never suggests otherwise.\n\nTo demonstrate prudential standing, NEI must show that its members' \"grievance[s] ... arguably fall within the zone of interests protected or regulated by the statutory provision ... invoked in the suit.\" Bennett, 520 U.S. at 162. This test is \"not meant to be especially demanding. Indeed, a petitioner is outside the statute's zone of interests only if [the petitioner's] interests are so marginally related to or inconsistent with the purposes implicit in the statute that it cannot reasonably be assumed that Congress intended to permit the suit.\" Nat'l Petrochemical \u0026 Refiners Ass'n v. EPA, 287 F.3d 1130, 1147 (D.C. Cir. 2002) (per curiam) (citation and internal quotation marks omitted). Furthermore, \"there does not have to be an indication of congressional purpose to benefit the would-be [petitioner].\" Nat'l Credit Union Admin. v. First Nat'l Bank \u0026 Trust Co., 522 U.S. 479, 492 (1998) (internal quotation marks omitted). To analyze prudential standing, we look \"to the particular provision of law upon which the [petitioner] relies,\" Bennett, 520 U.S. at 175-76; \"Congress's purposes in enacting the overall statutory scheme are relevant only insofar as they may help reveal its purpose in enacting the particular provision,\" Grand Council of the Crees v. FERC, 198 F.3d 950, 956 (D.C. Cir. 2000).\n\nEPA contends that NEI falls outside the \"zone of interests\" that EnPA section 801(a) protects or regulates because that provision was designed to safeguard public health and safety, not to minimize regulatory burdens. Although EPA is correct that Congress enacted section 801(a) to protect the public from radiation releases at Yucca Mountain, we think it equally obvious that Congress intended section 801(a) to facilitate construction of a permanent nuclear waste repository - the very interest that NEI advances here. As evinced in the NWPA and later in EnPA, Congress viewed EPA standards as a basic prerequisite for developing an underground repository. Indeed, because section 801(a) focuses exclusively on a disposal facility at Yucca Mountain - the statute regulates no pre-existing environmental or health threat - the required EPA standards would have no purpose whatsoever were repository construction not to move forward. Finally, section 801's requirement that EPA promulgate health and safety standards no later than one year after receiving NAS's recommendations further demonstrates Congress's intent to move the federal government expeditiously toward licensing and operating a repository at Yucca Mountain. In light of this congressional purpose, NEI's interests \"arguably\" fall within section 801(a)'s zone of interests, thus giving the organization prudential standing to pursue its petition for review. We therefore turn to the merits.\n\n2. Alleged Conflicts with the Energy Policy Act\n\nNEI argues that EPA's inclusion of a separate groundwater standard conflicts with EnPA's plain language in three ways. First, NEI claims that by relying on the \"critical organ dose\" methodology, EPA's ground-water standard violates EnPA section 801(a) because, according to the association, that section authorizes EPA to promulgate only standards that protect individual members of the public based on the \"effective dose equivalent\" (EDE) methodology. EnPA section 801(a)(1) contains three sentences: The first states that \"the Administrator shall, based upon and consistent with the findings and recommendations of the National Academy of Sciences, promulgate, by rule, public health and safety standards for protection of the public from releases from radioactive materials stored or disposed of in the repository at the Yucca Mountain site\"; the second sentence, emphasized by NEI, then says, \"[s]uch standards shall prescribe the maximum annual effective dose equivalent to individual members of the public from releases to the accessible environment from radioactive materials stored or disposed of in the repository\"; the third sentence concludes, \"[t]he standards shall be promulgated not later than 1 year after the Administrator receives the findings and recommendations of the National Academy of Sciences ... and shall be the only such standards applicable to the Yucca Mountain site.\"\n\nParsing this language, NEI argues that the provision's second sentence - \"[s]uch standards shall prescribe the maximum annual effective dose equivalent to individual members of the public\" - defines the scope of the \"public health and safety standards\" that the first sentence requires EPA to promulgate. Therefore, NEI argues, in executing Congress's mandate to issue public health standards, the agency may promulgate only EDE-based safety rules that protect the public, not rules using a different methodology that protect ground water. If Congress had thought of EDE standards as merely a subset of EPA's overall public health standards, NEI continues, then it would have used the word \"include\" in section 801(a)(1)'s second sentence, not \"prescribe.\" NEI also claims that the third sentence's phrase, \"shall be the only such standards applicable to the Yucca Mountain site,\" limits EPA's authority to promulgation of the EDE-based standards referenced in the preceding sentence. In other words, each time Congress used the term \"standards,\" NEI argues, it meant only the EDE standards described in section 801(a)(1)'s second sentence.\n\nIn Chevron terms, the \"precise question\" presented by NEI's challenge is this: Did Congress clearly authorize EPA to promulgate more than just individual-protection, EDE-based standards? Unlike NEI, we think it did. To begin with, section 801(a)(1)'s first sentence expressly requires EPA to develop \"public health and safety standards\" - not just \"EDE-based standards.\" The second sentence's directive - that EPA's standards \"shall prescribe the maximum annual effective dose equivalent to individual members of the public\" - neither restates nor defines the first sentence's directive that the agency promulgate \"public health and safety standards for protection of the public.\" Rather, the two sentences, read together, require EPA to establish a set of health and safety standards, at least one of which must include an EDE-based, individual-protection standard. Indeed, NEI's reading of section 801(a)(1) would render much of that provision's first sentence superfluous, for if Congress had intended to delegate to EPA authority to adopt an EDE standard only, it would not have directed the agency to promulgate \"public health and safety standards for protection of the public.\" For essentially the same reason, section 801(a)(1)'s third sentence, which provides that \"[t]he standards ... shall be the only such standards applicable to the Yucca Mountain site,\" offers no support for NEI's position. As we have explained, Congress required EPA to promulgate \"public health and safety standards,\" not just EDE-based standards. Therefore, the limitation contained in section 801(a)(1)'s third sentence cannot plausibly be read as referring to the second sentence's EDE-based standards.\n\nNEI also calls our attention to EnPA section 801(a)(3), which provides that \"[t]he provisions of this section shall apply to the Yucca Mountain site, rather than any other authority of the Administrator to set generally applicable standards for radiation protection.\" According to NEI, this section \"precludes the Government's interpretation of the first sentence of (a)(1) as giving [it] general authority to prescribe any health and safety standards.\" Oral Argument Tr. at 73. This argument begs the question: Precisely what authority does section 801(a)(1) delegate to the agency? The answer, as we just explained, is that section 801 authorizes EPA to promulgate not merely EDE-based standards, but rather \"public health and safety standards for protection of the public.\"\n\nFor its second statutory argument, NEI, echoing Nevada's challenge to the 10,000-year compliance period, contends that part 197's ground-water standard violates EnPA's requirement that EPA's rule be \"based upon and consistent with the findings and recommendations of the National Academy of Sciences.\" EnPA § 801(a)(1). As NEI sees it, EPA impermissibly promulgated a separate ground-water standard, like the one in the generic part 191 standards, despite what NEI regards as NAS's conclusion that adding such a standard to regulate Yucca Mountain waste disposal is unnecessary and lacks scientific foundation.\n\nAlthough we concluded earlier in this opinion that EPA violated section 801's \"based upon and consistent with\" requirement by adopting a 10,000-year compliance period, see supra at 20-31, we reach the opposite conclusion here because NAS treated the compliance-period and ground-water issues quite differently. Whereas NAS expressly rejected a 10,000-year compliance period, it said nothing at all about the need to add a separate ground-water standard. The NAS Report states:\n\n40 CFR 191 includes a provision to protect ground water from contamination with radioactive materials that is separate from the 40 CFR 191 individual-dose limits. These provisions have been added to 40 CFR 191 to bring it into conformity with the Safe Drinking Water Act, and have the goal of protecting ground water as a resource. We make no such recommendation, and have based our recommendations on those requirements necessary to limit risks to individuals.\n\nNAS REPORT at 121. In other words, the Academy never even considered a ground-water standard. As EPA explained:\n\nIn its report, NAS did not recommend specifically that we include a separate ground water protection provision in our environmental protection standards for Yucca Mountain. Neither, however, did NAS state that we should not include such a provision.... Our decision to include separate ground water standards is a policy decision that we make pursuant to our statutory authority under the Energy Policy Act.\n\n66 Fed. Reg. at 32,107; see also Response to Comments at 6-16 (stating that the ground-water standard is not inconsistent with NAS's findings because \"NAS clearly identified the ground-water pathway as one of the significant pathways of exposure\" and because the Academy did not \"make a specific recommendation that EPA either include or not include a separate ground-water protection provision\"). Put another way, NAS made no \"finding\" or \"recommendation\" that EPA's regulation could fail to be \"based upon and consistent with.\" We thus agree with EPA that section 801 left it free to add a ground-water standard.\n\nNEI points out that the Academy sharply criticized EPA's ground-water standard in a letter submitted during part 197's notice-and-comment period. See NAS Comments at 10-12. But EnPA does not require EPA to conform its rule to comments that NAS submits during the rulemaking process. Instead, EnPA section 801(a)(1) requires EPA to base its standards on the Academy's \"findings and recommendations.\" EnPA section 801(a)(2), in turn, requires EPA to obtain those findings through a formal study conducted by the Academy: \"[T]he [EPA] Administrator shall contract with the National Academy of Sciences to conduct a study to provide ... findings and recommendations on reasonable standards for protection of the public health and safety....\" EnPA § 801(a)(2) (emphasis added). Reading these provisions together, we think it clear that Congress directed EPA to conform its rule to those \"findings and recommendations\" that appear in the NAS Report. See Gustafson v. Alloyd Co., 513 U.S. 561, 570 (1995) (\"[I]dentical words used in different parts of the same act are intended to have the same meaning.\"). Indeed, NAS itself stated that its \"[f]indings and recommendations to EPA on the technical bases for Yucca Mountain standards were provided in the [NAS Report].\" NAS Comments at 2. Given that report's silence on the need for a separate ground-water standard, EPA's decision to add distinct ground-water protections rests on \"a permissible construction\" of EnPA section 801. See Chevron, 467 U.S. at 843.\n\nNEI's final statutory argument requires little discussion. Pointing out that EnPA directs EPA to protect \"the public from releases from radioactive materials stored or disposed of in the repository at the Yucca Mountain site,\" EnPA § 801(a)(1), NEI argues that the regulation impermissibly applies not just to \"releases,\" but to pre-existing background radiation as well. It is true, as NEI observes, that the ground-water standard caps the permissible level of radiation contamination by requiring inclusion of \"natural background\" radiation in the calculation of \"[c]ombined radium-226 and radium-228\" as well as \"[g]ross alpha activity.\" 40 C.F.R. § 197.30 (Table 1); see also 66 Fed. Reg. at 32,114 (requiring that \"DOE combine certain estimated releases from the Yucca Mountain disposal system with the pre-existing naturally occurring or man-made radionuclides to determine the concentration in the representative volume [of ground water]\"). Part 197, however, does not regulate background radiation. See 40 C.F.R. § 197.30 (requiring DOE to demonstrate that \" releases of radionuclides from waste in the Yucca Mountain disposal system into the accessible environment will not cause the level of radioactivity ... to exceed the limits in ... Table 1.\" (emphasis added)). As EPA explains, the rule requires only that DOE take background levels into account when measuring permissible releases of radionuclides from the repository. See id. (Table 1). Therefore, part 197 could not possibly run afoul of EnPA's focus on released radiation.\n\n3. Arbitrary and Capricious Challenge\n\nNEI also attacks EPA's ground-water standard as arbitrary and capricious. Part 197 requires DOE to show that the level of radioactivity in the ground water outside the designated controlled area will not exceed the maximum contaminant levels for radionuclides that the agency established under the Safe Drinking Water Act. See id.; 66 Fed. Reg. at 32,106. Challenging these MCL limits, NEI claims that their underlying \"critical organ dose\" methodology rests on obsolete science, yields erratic health risks beyond the high and low limits of EPA's risk range, and conflicts with other federal radiation-protection standards. NEI advances a number of highly complex scientific arguments in support of these attacks, but we need not address them here because we rejected the same arguments last year in City of Waukesha v. EPA.\n\nIn City of Waukesha, we denied NEI's challenge to EPA's Safe Drinking Water Act regulations, finding the agency's chosen methodology for its beta/photon MCLs consistent with the SDWA's \"best available science\" requirement and reasonable under the APA. See 320 F.3d at 255-57. Specifically, we saw \"nothing unreasonable about EPA's assertion that [its] approach was consistent with the `best available science,' and nothing arbitrary about its decision to [use older MCL standards] under these circumstances.\" Id. at 256. NEI's \"obsolete science\" claim therefore cannot prevail here. Nor can we accept NEI's second argument - that EPA acted arbitrarily by failing to choose a methodology for the Yucca Mountain site that would yield consistent risk levels - because City of Waukesha upheld EPA's decision to use the selected MCLs despite their failure to provide uniform protection levels. See id. at 256-57 (concluding that the agency acted reasonably in declining to promulgate uniform standards because risk variations in virtually all cases were confined to the acceptable range). NEI's third argument - that EPA's Yucca rule conflicts with other federal radiationprotection standards - likewise founders in light of City of Waukesha, which concluded that EPA's MCL standards relied on prevailing federal radiation guidance. See id. at 255-56. Finally, even if City of Waukesha had not disposed of this issue and even were there some inconsistency between part 197's ground-water standard and other official radiationprotection guidance, NEI has nonetheless failed to show why any such inconsistency would make EPA's use of these standards at Yucca unreasonable. See id. at 248 (\"We may reject an agency's choice of scientific model only when the model bears no rational relationship to the characteristics of the data to which it is applied.\" (internal quotation marks omitted)).\n\nNEI also contends that EPA acted arbitrarily by justifying its decision to adopt a ground-water standard on cost grounds without first conducting a cost-benefit analysis. The preamble to part 197's final version states that \"[b]ecause of the expenses and difficulties associated with remediation of contaminated ground water, it is prudent and cost-effective to prevent the occurrence of such contamination.\" 66 Fed. Reg. at 32,106. In our view, however, EPA adequately explained its reasons for adopting the ground-water standard: Not only did the agency conclude (unremarkably) that an ounce of prevention is worth a pound of cure, but it explained that adding a ground-water standard would produce other salutary effects, i.e., \"encourag[ing] a robust containment and isolation design that will not result in unacceptable contamination during the regulatory time frame.\" Id. at 32,108; see also Response to Comments at 6-12 (\"We believe that ground-water protection standards will confer greater protection to aquatic or biological communities [than an individualprotection standard alone] by limiting the contamination of ground water that would discharge to the surface, such as springs or seep areas.\").\n\nFinally, NEI contends that EPA acted unreasonably by regulating ground water with MCLs that were designed to apply \"at the tap,\" i.e., after treatment. But even if the MCLs were intended to apply \"at the tap\" in the SDWA context, NEI gives us no basis for second-guessing EPA's decision to import these standards to the Yucca Mountain site. As we have explained, EPA has offered an entirely rational reason for protecting water resources while they remain underground: Preventing ground water contamination is more cost-effective and environmentally protective, and applying MCL standards will encourage a robust containment and isolation design. See 66 Fed. Reg. at 32,106-08. By contrast, if the repository contaminates local ground water, \"future generations will have to decide whether to forego use of the ground-water resource or to expend substantial resources to clean [it] up.... This would violate one of the primary principles in radioactive waste management ... that radioactive waste disposal should place no undue burdens upon future generations.\" Response to Comments at 6-13.\n\nIII. THE NRC CASES\n\nNevada and two of its political subdivisions - Clark County and the City of Las Vegas (collectively, Nevada or the State) - challenge two NRC actions in separate cases which we have consolidated for review. In case number 02-1116, Nevada petitions for review of the requirements and criteria promulgated by NRC in part 63 of its regulations for licensing the Department of Energy's planned repository at Yucca Mountain for the disposal of spent nuclear fuel and high-level radioactive waste. See Disposal of High-Level Radioactive Wastes in a Proposed Geologic Repository at Yucca Mountain, NV, 66 Fed. Reg. 55,732 (final rule Nov. 2, 2001) (codified at 10 C.F.R. pt. 63) [hereinafter part 63]. In a related case, number 03-1058, Nevada petitions for review of NRC's denial of its petition for rulemaking (submitted eight months after NRC published part 63 in the Federal Register) seeking various amendments to NRC's requirements and criteria, all of which were directed at ensuring that DOE, as part of the anticipated licensing process, demonstrate that Yucca Mountain's geologic makeup provides the \"primary\" barrier for isolating radioactive waste from the human environment. See State of Nevada; Denial of a Petition for Rulemaking, 68 Fed. Reg. 9023 (Feb. 27, 2003). Although Nevada's two cases take different tacks, both essentially challenge NRC's requirements and criteria for licensing a radioactive waste repository at Yucca Mountain.\n\nNevada challenges part 63 on multiple grounds. First, Nevada claims that NRC violated the NWPA by permitting the licensing of a repository that does not isolate waste primarily by geologic means and does not provide multiple, independent barriers to prevent the escape of radionuclides from the repository. As part of this claim Nevada further maintains that, by abandoning the so-called multiple-barrier approach, NRC acted arbitrarily and capriciously, in violation of the Administrative Procedure Act. Second, Nevada claims that NRC violated EnPA by failing to require that DOE's planned repository comply with EPA's part 197. See Public Health and Environmental Radiation Protection Standards for Yucca Mountain, NV, 66 Fed. Reg. 32,074 (June 13, 2001) (codified at 40 C.F.R. pt. 197) [hereinafter part 197]. Next, Nevada claims that NRC violated the NWPA, the Atomic Energy Act (AEA), 42 U.S.C. §§ 2011 et seq. (2000), and the National Environmental Policy Act (NEPA), 42 U.S.C. §§ 4321 et seq. (2000), by precluding challenges to DOE's peak radiation dose calculations required by part 63 and violated the APA by limiting the period for evaluating the repository's performance to 10,000 years following the placement of waste there. Finally, Nevada claims that NRC violated the APA by adopting a \"lax\" \"reasonable expectation\" standard of proof for assessing the repository's ultimate performance. See Petitioners' Br. at 66-75.\n\nFor the reasons set forth below, we grant Nevada's petition for review in part and deny it in part. Before we turn to the merits of Nevada's claims, however, we must address NRC's assertion that, for the most part, we lack jurisdiction to do so.\n\nA. Jurisdiction and Timeliness\n\nNRC contends that we lack jurisdiction to entertain Nevada's petition for review of the part 63 licensing requirementsand criteria (case No. 02-1116) because it was untimely filedunder the Hobbs Act, 28 U.S.C. § 2342, which allows 60 daysfor filing a petition for review of final agency action, id. § 2344. See Respondent's Br. at 18-25. NRC argues thatNevada is not entitled to the benefit of the NWPA's longer,180-day window for commencing a civil action challengingagency action taken \"under\" subtitle A of the Act provided insection 119,\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e 42 U.S.C. § 10139(c), because in promulgatingpart 63 NRC did not take action \"under\" the NWPA.\n\nNRC first observes that, while the NWPA requires NRC to promulgate \"technical requirements and criteria,\" it directs NRC to do so \"pursuant to authority under other provisions of law.\"\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e 42 U.S.C. § 10141(b)(1)(A) (emphasis added). NRC next points out that the NWPA manifests that NRC's authority under \"other provisions of law\" refers to the AEA and the Energy Reorganization Act of 1974 (ERA), 42 U.S.C. §§ 5801 et seq. (2000). Because the NWPA directs NRC to promulgate \"requirements and criteria\" under pre-existing authority conferred by the AEA, NRC did not promulgate part 63 \"under\" the NWPA but \"under\" the AEA. Therefore, as NRC regulations issued under the AEA are reviewable under the Hobbs Act, 42 U.S.C. § 2239(a)-(b), which requires a petition for review to be filed within sixty days following issuance of the agency's final rule, see 28 U.S.C. §§ 2342, 2344, Nevada's petition - filed 160 days after NRC issued its final licensing criteria - is untimely. NRC does concede that we retain jurisdiction to address the sole claim made in Nevada's second petition for review (case No. 03-1058) - i.e., that the NWPA requires Yucca Mountain's geology to serve as the repository's primary mechanism for isolating radioactive waste from the human environment - because \"in the Hobbs Act context this [c]court has approved the petition for rulemaking device to trigger a new opportunity to seek substantive judicial review of agency rules.\" Respondent's Br. at 28; see also Nat'l Mining Ass'n v. DOI, 70 F.3d 1345, 1350 (D.C. Cir. 1995) (\"[O]ur cases ... have permitted challenges to rules beyond the statutory period. We have repeatedly recognized that such challenges may be brought as petitions for a new rule and thereafter as petitions for review of an agency denial.\"). We do not accept NRC's theory and, as set forth below, hold that Nevada's petition for review of NRC's part 63 - case No. 02-1116 - was timely filed under section 119 of the NWPA. See 42 U.S.C. § 10139(c).\n\nStatutes providing for judicial review, including section 119 of the NWPA, 42 U.S.C. § 10139, \"are jurisdictional in nature and must be construed with strict fidelity to their terms.\" Stone v. INS, 514 U.S. 386, 405 (1995); accord Slinger Drainage, Inc. v. EPA, 237 F.3d 681, 682-83 (D.C. Cir. 2001). While the NWPA's judicial review provisions admittedly are far from a \"model of clarity,\" Natural Res. Def. Council v. Abraham, 244 F.3d 742, 743 (9th Cir. 2001); accord Tennessee v. Herrington, 806 F.2d 642, 647 (6th Cir. 1986) (\"NWPA's provisions on judicial review are unclear.\"), we conclude that NRC issued part 63 \"under\" section 121 of the NWPA as we understand that section's use of this critical term. See 42 U.S.C. § 10139(a)(1)(A)-(C). NRC, relying on the Ninth Circuit's decision in Natural Res. Def. Council v. Abraham, 244 F.3d at 746-47, maintains that \"the sine qua non of NWPA jurisdiction is that the agency action come `at least under the Act.' \" Respondent's Br. at 20 (emphasis in original (citing and quoting Natural Res. Def. Council v. Abraham, 244 F.3d at 747)). We have no quarrel with the commonsensical proposition that section 119 brings within judicial purview only those final agency actions embraced by the express language of the NWPA. See Natural Res. Def. Council v. Abraham, 244 F.3d at 747 (\"NWPA's provision for judicial review is limited to decisions `under' the part, or at least under the Act when the decision is pursuant to a part of the Act and relates to the purposes of the part in which the judicial review provision is placed.\" (emphases in original)); Herrington, 806 F.2d at 647 (section 119 provides for review of \"certain actions arising under the Act\" (emphasis added)); Gen. Elec. Uranium Mgmt. Corp. v. DOE, 764 F.2d 896, 901 (D.C. Cir. 1985) (section 119 provides for review of \"any final decision or action `under' \" the NWPA (quoting 42 U.S.C. § 10139(a)(1)(A))). We do, however, part company with NRC when it asserts that NRC's challenged actions \"implicated\" the NWPA but were not taken \"under\" it. Respondent's Br. at 19-20.\n\nSection 121 of the NWPA provides that NRC pursuant to authority under other provisions of law, shall, by rule, promulgate technical requirements and criteria that it will apply, under the [AEA] ... and the [ERA] ..., in approving or disapproving -\n\n(i) applications for authorization to construct repositories;\n\n(ii) applications for licenses to receive and possess spent nuclear fuel and high-level radioactive waste in such repositories; and\n\n(iii) applications for authorization for closure and decommissioning of such repositories.\n\n42 U.S.C. § 10141(b)(1)(A). NRC seizes on section 121's instruction that NRC use authority granted \"under other provisions of law\" - as well as its explicit reference to those authorities (the AEA and the ERA) - to accomplish what the section commands it to do: promulgate \"requirements and criteria\" to apply to the three types of listed applications. In focusing on section 121's reference to \"authority under other provisions of law,\" however, NRC overlooks the fact that section 121 itself - and not any of NRC's pre-existing authority under the AEA and the ERA - specifically directs NRC to adopt \"requirements and criteria\" to review the specified applications. See id. § 10141(b).\n\nNRC likewise ignores that, in addition to directing NRC to adopt \"requirements and criteria,\" section 121 imposes constraints on the form the \"requirements and criteria\" may take. Id. § 10141(b)(1)(B)-(C). Section 121 provides, for example, that the \"requirements and criteria\" promulgated by NRC \"shall provide for the use of a system of multiple barriers in the design of the repository and shall include such restrictions on the retrievability of the solidified high-level radioactive waste and spent fuel emplaced in the repository as the Commission deems appropriate.\" Id. § 10141(b)(1)(B). Section 121 also requires that NRC's \"requirements and criteria shall not be inconsistent with any comparable standards promulgated by\" EPA. Id. § 10141(b)(1)(C).\n\nOur conclusion that NRC promulgated its licensing criteria, at least in part, \"under\" the NWPA is buttressed by section 801 of EnPA. See EnPA § 801(b)(1). That section, in the plainest of language, directs NRC to \"modify its technical requirements and criteria under section 121(b) of the [NWPA], as necessary, to be consistent with [EPA's] standards.\" Id. (emphasis added). Therefore, it is simply impossible for us to say, as NRC would have us do, that NRC did not act \"under\" the NWPA, at least in part, when it promulgated part 63.\n\nNRC insists that NRC's authority to regulate the DOE's disposal of high-level radioactive wastes predated the passage of the NWPA and therefore NRC had no need to, and did not, act \"under\" the NWPA in promulgating part 63. Specifically, NRC alleges that section 202 of the ERA, 42 U.S.C. § 5842, (not the NWPA) \"gave the NRC the power (and the obligation) to regulate DOE's proposed Yucca Mountain repository.\" Respondent's Br. at 22. NRC's argument, however, is somewhat beside the point. That Congress may have authorized NRC to regulate DOE's disposal of radioactive waste before it enacted the NWPA, compare 42 U.S.C. § 5842(3) (providing for licensing and related regulatory authority over \"[f]acilities used primarily for the receipt and storage of high-level radioactive wastes resulting from activities licensed under such Act\"); Disposal of High-Level Radioactive Wastes in Geologic Repositories: Licensing Procedures, 46 Fed. Reg. 13,971 n.1 (final rule Feb. 25, 1981) (\"The Commission interprets `storage' as used in the [ERA] to include disposal.\"), with 42 U.S.C. § 10134(d) (under the NWPA \"[t]he Commission shall consider an application for a construction authorization for all or part of a repository in accordance with the laws applicable to such applications\"), hardly negates the fact that in the NWPA Congress specifically directed NRC to issue \"requirements and criteria\" for evaluating repository-related applications and, not insignificantly, how to do so.\n\nWe also think that NRC's reliance on the First Circuit's decision in NRDC v. EPA, 824 F.2d 1258 (1st Cir. 1987), is misplaced. There, the First Circuit decided to exercise Hobbs Act jurisdiction regarding a petition for review of standards promulgated by EPA \"pursuant to the directive of the NWPA\" because the Hobbs Act authorizes \"judicial review of final orders under the [AEA].\" Id. at 1263, 1267 n.7. NRC says a similar result should occur here because the First Circuit based the exercise of Hobbs Act jurisdiction on Congress's instruction to EPA to promulgate its standards \"pursuant to authority under other provisions of law,\" which is the precise instruction it gave NRC in section 121 of the NWPA. See Respondent's Br. at 20. But the First Circuit did not confront the issue we confront; section 119 expressly authorizes judicial review of actions taken by NRC under the NWPA but does not do so for those taken by EPA. See 42 U.S.C. § 10139(a)(1)(A)-(B). Thus, the First Circuit in NRDC v. EPA had no occasion to, and in fact did not, choose between NWPA and Hobbs Act jurisdiction. See 824 F.2d at 1267 n.7. Nor has any other court addressed precisely this issue so far as the parties or we can tell.\n\nSection 119 requires that \"any civil action\" seeking review of a final NRC \"decision or action\" under the NWPA, as well as any action challenging NRC's failure to make a decision or take an action under the Act, must be filed \"not later than the 180th day\" following the challenged decision, action or failure to act. 42 U.S.C. § 10139(a), (c). Nevada filed its petition for review of part 63 on April 11, 2002, 160 days after NRC published part 63 in the Federal Register. See 66 Fed. Reg. 55,732. Because Nevada filed its petition for review of NRC's action in promulgating part 63 - an action it took \"under\" the NWPA - well within the time allowed by section 119, see 42 U.S.C. § 10139(c), we conclude that its petition is timely.\n\nHaving found Nevada's petition for review in case number 02-1116 timely, we accordingly turn now to its merits. Because we address (and reject) the sole claim raised in Nevada's petition for review in case number 03-1058 - that is, its challenge to NRC's denial of its petition for rulemaking - in reviewing its first petition, however, we need not separately address that petition.\n\nB. Nevada's Merits Claims\n\nWe review NRC's challenged actions under the familiar administrative law standards noted above. We defer to NRC's interpretation of the NWPA under Chevron, 467 U.S. at 842-43. See Op. supra at 24; see also Barnhart v. Walton, 535 U.S. 212, 218 (2002). Outside the arena of statutory interpretation, we will affirm the Commission's action unless it is \"arbitrary, capricious, an abuse of discretion, or otherwise not in accordance with law[.]\" 5 U.S.C. § 706(2)(A); see City of Brookings Mun. Tel. Co. v. FCC, 822 F.2d 1153, 1164 (D.C. Cir. 1987). We require only that the agency \"examine the relevant data and articulate a satisfactory explanation for its action including a `rational connection between the facts found and the choice made.' \" Motor Vehicle Mfrs. Ass'n v. State Farm Mut. Auto. Ins. Co., 463 U.S. 29, 43 (1983) (quoting Burlington Truck Lines v. United States, 371 U.S. 156, 168 (1962)). We are \"extreme[ly]\" deferential, however, to an agency \" `evaluating scientific data within its technical expertise.' \" Huls Am. Inc. v. Browner, 83 F.3d 445, 452 (D.C. Cir. 1996) (quoting Int'l Fabricare Inst. v. EPA, 972 F.2d 384, 389 (D.C. Cir. 1992)). With the exception of the selection of a 10,000-year compliance period, discussed below, see Op. infra at 72-74, the NRC actions under review meet these standards.\n\n1. Primary Barrier and Multiple Barriers Claims\n\na. The Primary Barrier Claim\n\nNevada first charges that part 63 flouts Congress's unambiguous directive that Yucca Mountain's geologic features must serve as the repository's primary means of isolating radioactive waste from the human environment. Nevada acknowledges that part 63 provides that the \"geologic reposi-tory must include multiple barriers, consisting of both natural barriers and an engineered barrier system.\" 10 C.F.R. § 63.113(a). Likewise, it recognizes that part 63 requires DOE to identify the features \"that are considered barriers important to waste isolation\" of both the natural geologic setting and the engineered barrier system and to describe, with technical support, their respective capabilities to isolate waste. Id. § 63.115(a)-(c). Nevada argues that part 63 is nevertheless flawed, however, because nowhere does it require that Yucca Mountain's geologic features provide \"independent or primary waste isolation capabilities.\" Petitioners' Br. at 43.\n\nNevada calls to our attention various provisions of the NWPA that it believes demonstrate that Congress intended the geologic features of the DOE's planned repository to act as the primary barrier for isolating waste from the human environment. The NWPA defines \"repository\" as \"any system\" for \"the permanent deep geologic disposal of high-level radioactive waste and spent nuclear fuel.\" 42 U.S.C. § 10101(18). Nevada also invokes sections 112 and 113 of the NWPA which, in its view, \"emphasize the central importance of a site's physical characteristics to determining its suitability [as a repository].\" Petitioners' Br. at 45. Nevada points out that section 112 requires \"geologic considerations\" to serve as the \"primary criteria for the selection of sites in various geologic media.\" 42 U.S.C. § 10132(a). It also notes that section 113 contemplates that DOE may find a candidate site \"unsuitable\" for development as a repository, see 42 U.S.C. § 10133(c)(3), a finding it believes would not make sense \"unless the site itself, without engineered barriers, could fail to meet disposal safety requirements.\" Petitioners' Br. at 45. Based on these statutory references, Nevada concludes that \"[i]t would make little sense for Congress to require that DOE focus on a site's physical characteristics in analyzing the site's suitability, only to be indifferent to whether NRC reduced such characteristics to an afterthought in any subsequent licensing proceedings.\" Id.\n\nNevada further explains that section 113 requires that, in determining a candidate site's suitability as a repository, DOE must conduct site-characterization activities in accordance with section 112, 42 U.S.C. § 10133(b)(1)(A)(iv), which section provides that \"geologic considerations ... shall be [the] primary criteria.\" Id. § 10132(a). Moreover, because the NWPA limits DOE's site-characterization activities to those necessary to evaluate the site's suitability to apply to NRC for construction authorization, see id. § 10133(c)(1), Nevada maintains that it necessarily follows that NRC's licensing criteria must also require that a repository's geologic features serve as the \"primary\" means for isolating waste. Otherwise, according to Nevada, \"it would have made no sense for Congress to have required DOE to make this the primary factor in determining whether\" to file an application with NRC. Petitioners' Br. at 46 (emphasis in original).\n\nNRC initially faults Nevada for failing to take up this statutory claim with the Commission before raising it on review. It maintains that Nevada never asserted during NRC's public comment period that the NWPA requires the repository's geologic features to serve as the primary barrier and, consequently, Nevada has waived that argument. We conclude, however, that Nevada adequately raised the primary barrier claim to avoid the consequences of our waiver doctrine. \"Absent special circumstances, a party must initially present its comments to the agency during the rulemaking in order for the court to consider the issue.\" Tex Tin Corp. v. EPA, 935 F.2d 1321, 1323 (D.C. Cir. 1991) (emphasis added); accord Nebraska v. EPA, 331 F.3d 995, 997 (D.C. Cir. 2003). \"As a general rule, claims not presented to the agency may not be made for the first time to a reviewing court.\" Omnipoint Corp. v. FCC, 78 F.3d 620, 635 (D.C. Cir. 1996). To preserve a legal or factual argument, we require its proponent to have given the agency a \"fair opportunity\" to entertain it in the administrative forum before raising it in the judicial one. Wash. Ass'n for Television \u0026 Children v. FCC, 712 F.2d 677, 681 (D.C. Cir. 1983); see Nat'l Ass'n of Mfrs. v. DOI, 134 F.3d 1095, 1111 (D.C. Cir. 1998).\n\nNevada has the better of this argument; we believe that it did not waive its primary barrier claim. It contends that it, and others, made the claim to NRC during the public comment period which closed on June 30, 1999. See 66 Fed. Reg. at 55,732-33. As far as we can tell from the two record citations the State offers us, however, neither it nor any other commenter advanced the argument it presses here during NRC's public comment period. See Tr. of Proceedings, United States of America, Nuclear Regulatory Commission, Public Meeting on Proposed Regulations (10 Part 63) For a High-Level Waste Repository at Yucca Mountain, NV, June 16, 1999, at 82-84, reprinted in Joint Appendix (J.A.) 76-78 (stating that DOE definition of defense-in-depth\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e originally meant that \"geologic barriers were supposed to supply the main barrier to transport of radioactive waste once the repository started leaking\" and inquiring of NRC staff whether DOE could \"acceptabl[y]\" rely primarily on man-made containers to secure waste); Comments of the Inst. for Energy \u0026 Env't Research on the Draft NRC Rule on Disposal of High-Level Radioactive Wastes in a Proposed Repository at Yucca Mountain, NV, June 30, 1999, at 1-2, reprinted in J.A. 108-09 (\"Allowing primary reliance on engineered barriers for waste isolation would be inappropriate.\" (emphasis added)).\n\nNevada did raise the argument it advances here during a public meeting NRC held on November 2, 1999 to discuss the defense-in-depth notion \"as applied to a possible high-level waste repository at Yucca Mountain.\" Official Tr. of Proceedings, United States of America, Nuclear Regulatory Commission, Pubic Meeting - A Facilitated Roundtable Discussion on Defense in Depth as Applied to a Possible High-Level Waste Repository at Yucca Mountain, NV, Nov. 2, 1999, at 1, 76-77, reprinted in J.A. 113, 119-20 (capitalization altered). There, a representative of the Nevada Agency for Nuclear Projects observed that NRC had to follow the NWPA's command, expressed in section 112, that \"geologic factors shall be primary\" in evaluating both Yucca Mountain's natural features and DOE's engineered barriers and their respective roles in waste isolation. See id. at 119-20. This is in essence the same point Nevada raises here.\n\nNRC maintains, however, that the statement does not count because it came too late. It asserts that the Nevada representative made the statement during a public meeting that occurred several months after the public comment period closed and that NRC had made clear that the meeting was not intended to reopen that period. But NRC's representations were far more equivocal than NRC would lead us to believe and, taken together, indicate that the public comments it received during the meeting would in fact figure in its decision-making process. Compare J.A. 122 (\"[T]his is not an extra public comment period. It is a way to help us make more clear what we've put out in our proposal and to understand better the comments that we've received....\"), with J.A. 117 (\"[W]e're here in the process of responding to public comments on Part 63, and we are here to get your input on this particular issue [the defense-in-depth issue] as we finalize Part 63. \" (emphasis added)); J.A. 126 (\"[T]hat comment, as well as all of the other very fine comments that we've heard today, will be carried back [to NRC].\"). Our conclusion is further bolstered by NRC's own words. In the Supplemental Information accompanying the final version of part 63, NRC referred to this very meeting in a context which plainly suggests that it considered what occurred there in developing its regulation.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e See 66 Fed. Reg. at 55,732-33.\n\nAccordingly, we conclude that Nevada gave NRC a \"fair opportunity\" to pass on its primary barrier claim. See Wash. Ass'n for Television \u0026 Children, 712 F.2d at 681. The State made its point - more than two years before part 63 was published - during a public meeting held, as we have noted, for the express purpose of discussing defense-in-depth. And NRC expressly acknowledged that meeting in the Supplemental Information. See Op. supra at note 4. Nevada wins the battle, however, only to lose the war.\n\nUnder Chevron Step One, we use the customary statutory construction tools of text, structure and purpose. See Ca. Metro Mobile Communications, Inc. v. FCC, 365 F.3d 38, 44-45 (D.C. Cir. 2004). Using those tools, we find nothing that unambiguously prohibits NRC from deciding not to require DOE to build a repository that relies on the repository's geologic setting to provide the primary mechanism for isolating waste from the human environment. Indeed, the NWPA's language instructs otherwise. In section 121 Congress specifically directs NRC to issue \"technical requirements and criteria\" that \"provide for the use of a system of multiple barriers in the design of the repository.\" 42 U.S.C. § 10141(b)(1)(B) (emphasis added). The NWPA contains no language indicating that NRC is to assign a rating to any single barrier - whether natural or artificial - in a repository with a \"system of multiple barriers.\" Id.; cf. id. § 10101(12) (\" `[E]ngineered barriers' means manmade components of a disposal system designed to prevent the release of radionuclides into the geologic medium involved.\"); id. § 10101(18) (\" `[R]epository' means any system licensed by the Commission that is intended to be used for, or may be used for, the permanent deep geologic disposal of high-level radioactive waste and spent nuclear fuel....\" (emphasis added)).\n\nNor does section 121 say anything about the barrier the repository's geologic composition must provide in the \"system of multiple barriers.\" Id. § 10141(b). Congress did, however, circumscribe NRC's rulemaking authority in section 121 in three significant respects, only one of which is directly relevant here - i.e., NRC must require a repository to \"use ... a system of multiple barriers.\" Id. § 10141(b)(1)(B). We find it telling that Congress refrained from further delimiting NRC's authority in section 121. If Congress had intended to mandate that the \"requirements and criteria\" give primacy to a repository's geologic makeup, it would have expressly so provided - especially given that such an additional restriction on NRC's authority would be significant. See Indep. Ins. Agents of Am., Inc. v. Hawke, 211 F.3d 638, 643-44 (D.C. Cir. 2000) (relying on expressio unius est exclusio alterius canon to find provision of National Bank Act expressly authorizing banks in smaller locales to sell insurance \"strongly confirm[ed] the view that the more general grant in [a second provision of the Act] did not include broad insurance powers\"). We are therefore hard pressed to conclude that Congress \"has directly spoken to the precise question at issue\" here and decline to do so. Chevron, 467 U.S. at 842. Accordingly, we move to Chevron Step Two and defer to NRC's interpretation of section 121 so long as it is based on a permissible construction. See Chevron, 467 U.S. at 842-43; Barnhart, 535 U.S. at 218.\n\nSection 121 authorizes NRC to adopt \"requirements andcriteria\" to license a waste repository at Yucca Mountainsubject to the limitations outlined above. See 42 U.S.C.§ 10141(b); see generally 10 C.F.R. § 63.113(a) (\"The geologic repository must include multiple barriers, consisting ofboth natural barriers and an engineered barrier system.\");see also id. § 63.113(b)-(d) (\"engineered barriers ..., workingin combination with natural barriers,\" must meet certainspecific performance standards). None of the restrictions,however, specifies how the requirements and criteria \"shallprovide for the use of a system of multiple barriers in thedesign of the repository\" or the role that any particularbarrier must play in the system. 42 U.S.C. § 10141(b)(1)(B).While Congress contemplated that the repository's geologicmakeup was to play a significant role in isolating radioactivewaste, see id. §§ 10101(18), 10132(a), we cannot say that NRCacted unreasonably in declining to read into section 121'sotherwise plain wording a requirement that it serve as therepository's principal barrier for isolating waste. See id. § 10141(b)(1)(B).\n\nNot surprisingly, Nevada eschews reliance on section 121 -which speaks directly to NRC's duty to issue requirementsand criteria for licensing a repository - in favor of otherprovisions of the NWPA. None of the provisions to which itdirects our attention, however, even remotely compels NRCto adopt requirements and criteria that put the greatestburden for isolating waste on a repository's geologic barrierpotential. In fact, the State relies on NWPA provisions thatgovern actions taken by DOE, not NRC. It relies principallyon section 112 of the NWPA, which directs the DOE Secretary to issue \"general guidelines for the recommendation ofsites for repositories ... [that] specify detailed geologic considerations that shall be primary criteria for the selection ofsites in various geologic media.\" Id. § 10132(a); see also id. §§ 10133(b)(1)(A)(iv) (DOE to submit criteria used to determine a site's suitability), 10133(c)(3)(A)-(F) (describing DOE'sobligations upon determining site unsuitable).\n\nThe argument Nevada puts together from various provisions of the NWPA - i.e., that NRC's licensing criteria must track DOE's site-selection criteria emphasizing the site's geology - is similarly flawed in relying on the NWPA's commands to DOE. Of course, it would be strange for Congress in one breath to require DOE to select a site suitable for a repository based on geologic considerations, while in the next authorizing NRC to ignore them. Congress's directives to the agencies were plainly intended to be complementary not contradictory. NRC acknowledges as much. See 68 Fed. Reg. at 9027 (\"It may be readily acknowledged that it would make little sense for Congress to establish a system for selecting a repository where DOE guidelines for selection of sites and NRC regulations for licensing a repository would contradict each other.\"). But complementary duties do not have to be identical. No statutory language requires it and there is nothing contradictory about Congress requiring DOE to recommend a suitable repository site based on geologic considerations, while instructing NRC to issue requirements and criteria for licensing a repository based on the use of a system of multiple barriers, including but not emphasizing, the geologic barrier. See 68 Fed. Reg. at 9028.\n\nIndeed, NRC's requirements and criteria to license a repository designed by DOE come into play only after DOEselects a suitable site based on geologic considerations. See42 U.S.C. §§ 10132(a); 10133(b); 10134; see also 68 Fed.Reg. at 9027. Under the scheme the NWPA establishes,DOE submits an application for authorization to construct arepository with NRC after it selects a site under section 112based on guidelines \"specify[ing] detailed geologic considerations that shall be primary criteria for selection of sites invarious geologic media,\" 42 U.S.C. § 10132(a), and performscharacterization activities under section 113 to determine the\"suitability of [the] site for the location of a repository,\" id. § 10133(b)(1)(A)(iv). Thus, by statutory design, NRC's licensing regulations are used to evaluate a repository proposed by DOE at a site also selected by DOE after DOE hasconsidered the site's geologic makeup. See id. §§ 10132(a),10133(b)(1)(A)(iv). As NRC itself recognized, Congress had\"no need to require, and did not require, NRC to issueregulations making geologic considerations the `primary' criteria for approval of DOE's license application for the repository.\" 68 Fed. Reg. at 9027.\n\nNevada's non-textual contentions are equally unconvincing. It relies on the First Circuit's decision in NRDC v. EPA, which declared that in the NWPA \"Congress ordered that these highly dangerous wastes be placed underground with the intent that the surrounding geologic formations would be the major component of the containment mechanism.\" 824 F.2d at 1279. The court made the statement, however, in treating a different issue - namely, whether EPA departed from the \"non-endangerment\" mandate of the Safe Drinking Water Act by permitting groundwater contamination within the repository's \"controlled area.\" Id. at 1276-79. Because the court's observation came in resolving EPA's apparently conflicting obligations under the SDWA and the NWPA, it offers minimal support for Nevada's contention.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e Id. at 1279.\n\nFor the foregoing reasons, we conclude that NRC's \"requirements and criteria\" to license a nuclear waste repository reasonably and permissibly implement section 121 of the NWPA.\n\nb. The Multiple Barriers Claims\n\nNevada next argues that NRC violated the NWPA's requirement that a repository incorporate a \"multiple barriers\" system by failing to include \"any specific requirement for any barrier to provide any degree of protection that is substantially independent of the others.\" Petitioners' Br. at 49. In not providing \"safety redundancy\" by specifying minimum performance standards for each of the multiple barriers, Nevada maintains, NRC \"deprived\" the multiple barriers requirement of any \"vitality.\" Petitioners' Br. at 49. We disagree.\n\nAlthough Congress statutorily required NRC's \"technicalrequirements and criteria\" to provide for multiple barriers, 42U.S.C. § 10141(b)(1)(B), it did not address this precise issue.See Chevron, 467 U.S. at 842-43. Nevertheless we find thatNRC's interpretation of section 121 is \"based on a permissibleconstruction of\" the section. See Chevron, 467 U.S. at 843.Pursuant to section 121, NRC must adopt technical requirements and criteria that \"provide for the use of a system ofmultiple barriers in the design of the repository.\" 42 U.S.C.§ 10141(b)(1)(B) (emphasis added). This is just what NRCdid. Section 63.113 of the NRC regulations requires that\"[t]he geologic repository must include multiple barriers,consisting of both natural barriers and an engineered barriersystem.\" 10 C.F.R. § 63.113(a); see also id. § 63.102(h)(\"uncertainties are addressed by requiring the use of a multiple barrier approach; specifically, an engineered barrier system is required in addition to the natural barriers providedby the geologic setting\"). The NRC regulations also requirethat the \"engineered barriers, working in combination withnatural barriers\" meet certain performance standards. Id. § 63.113(b)-(d). Furthermore, in order to comply with section 63.113, DOE must identify the design features of theengineered barriers and the natural features of the repository's geologic makeup \"that are considered barriers importantto waste isolation\" as well as describe - backed by technicalsupport - their capabilities \"to isolate waste, taking intoaccount uncertainties in characterizing and modeling the behavior of the barriers.\" Id. § 63.115(a)-(c). Section 121 doesnot, as Nevada contends, require that each barrier typeprovide a quantified amount of protection or, indeed, independent protection. See 42 U.S.C. § 10141(b)(1)(B). Its silenceinstead gives NRC flexibility in determining how best to\"provid[e] for the use of a system of multiple barriers in thedesign of the repository.\" See id. We think that NRC, inimplementing this requirement in the manner discussedabove, acted reasonably and permissibly. See Chevron, 467U.S. at 843.\n\nNevada next asserts that even if section 121 does not require barrier-by-barrier performance assessment, NRC arbitrarily and capriciously abandoned its longstanding regulatory philosophy of \"defense-in-depth.\" See Petitioners' Br. at 50-54. The defense-in-depth concept ensures that a geologic repository system is robust; that is, that the system is capable of withstanding unanticipated failures and other challenges to its integrity through the deployment of multiple and redundant safety barriers. Specifically, Nevada contests NRC's use of defense-in-depth at the proposed Yucca Mountain repository through an overall system performance assessment rather than using the approach of its older regulations, which approach tests the individual performance of the repository's \"system elements.\" See Disposal of High-Level Radioactive Wastes in a Proposed Geologic Repository at Yucca Mountain, NV, 64 Fed. Reg. 8640, 8648 (proposed rule Feb. 22, 1999. (\"Commission opted to prescribe minimum performance standards for each of the major system elements\" in part 60)); see 10 C.F.R. § 60.113 (performance standards for particular barriers). At bottom, Nevada maintains that NRC failed to explain adequately its departure from the approach it took in part 60, which governs the disposal of high-level radioactive wastes in geologic repositories other than Yucca Mountain and uses the sort of subsystem performance assessment that part 63 eschews. See 10 C.F.R. § 60.113. We do not agree.\n\nAn agency is free to discard precedents or practices it no longer believes correct. See, e.g., Motor Vehicle Mfrs. Ass'n, 463 U.S. at 57 (\"[A]n agency changing its course must supply a reasoned analysis.\"); Ramaprakash v. FAA, 346 F.3d 1121, 1124-25 (D.C. Cir. 2003). Indeed we expect that any agency may well change its past practices with advances in knowledge in its given field or as its relevant experience and expertise expands. See Ramaprakash, 346 F.3d at 1124. If an agency decides to change course, however, we require it to supply a \"reasoned analysis indicating that prior policies and standards are being deliberately changed, not casually ignored.\" Greater Boston Television Corp. v. FCC, 444 F.2d 841, 852 (D.C. Cir. 1970); see also Ramaprakash, 346 F.3d at 1124-25. And NRC has done so.\n\nNRC set out its rationale in opting to evaluate the proposed Yucca Mountain repository based on a total system performance assessment in the Supplemental Information accompanying both the proposed and the final part 63. See 66 Fed. Reg. at 55,758-59; 64 Fed. Reg. at 8647-50. NRC initially observed that advances in knowledge of the earth sciences undermined the need, reflected in part 60, to compensate for the major uncertainties inherent in assessing the long-term performance of geologic repositories. See 64 Fed. Reg. at 8648-49. NRC stated that \"experience and improvements in the technology of performance assessment, acquired over more than [fifteen] years, now provide significantly greater confidence in the technical ability to assess comprehensively overall repository performance, and to address and quantify the corresponding uncertainty.\" Id. at 8649. Moreover, NRC noted that its early approach, adopted at a time when quantitative techniques for assessing repository performance were in their infancy, had failed to \"gain[ ] broad acceptance in the technical community\"; it cited both the National Academy of Sciences and its own Advisory Committee as holding views critical of its approach. Id. Accordingly, NRC concluded that \"advances in performance assessment technology support the use of performance assessment results for estimating long term repository performance\" and that these advances \"obviate[d] ... the need to prescribe arbitrary, minimum performance standards for subsystems to build confidence in a system's overall performance.\" 66 Fed. Reg. at 55,758.\n\nMoreover, NRC expressed concern that, based on its fifteen years' experience working with part 60, the application of part 60's subsystem performance standards \"may impose significant additional expenditure of resources on the nation's [high level waste] program, without producing any commensurate increase in the protection of public health and safety.\" 64 Fed. Reg. at 8649. NRC thus determined in the final rule to give DOE \"flexibility for deciding the extent and focus of site characterization\" and concluded that DOE, as the repository's designer, \"may place greater or lesser reliance on individual components of the repository system when deciding how best to achieve the overall safety objective.\" 66 Fed. Reg. at 55,758.\n\nFinally, NRC explained that part 60's subsystem criteria, as originally conceived, were \"intended to be separate, `independent,' easily-determined measures of subsystem performance, determination of which would require only application of technology that was readily available.\" 64 Fed. Reg. at 8649. According to NRC, however, \"[e]xtensive experience with site-specific performance assessment has shown [the subsystem criteria] to be none of these.\" Id. Indeed, as NRC explained in the final rule, \"[e]stimates of subsystem performance are subject to many, if not all, of the same sources of uncertainty as are estimates of overall system performance\" and concluded that \"[i]t is questionable, therefore, whether the subsystem criteria in part 60, or any other criteria, could provide truly independent assurance of total system performance.\" 66 Fed. Reg. at 55,758. In light of NRC's detailed analysis supporting its decision to evaluate the performance of the Yucca Mountain repository based on the barrier system's overall performance, we believe that it adequately explained its change in course. See, e.g., Motor Vehicle Mfrs. Ass'n, 463 U.S. at 57. Accordingly, we conclude that NRC acted neither arbitrarily nor capriciously in rejecting part 60's subsystem performance approach in favor of the overall performance approach.\n\n2. Compliance With EPA's Part 197 in Construction Authorization\n\nNevada alleges that NRC violated the NWPA and EnPA by permitting construction of the Yucca Mountain repository without first determining that there is a reasonable expectation that the repository will comply with the EPA standards. Nevada maintains that, because NRC is required under both the NWPA and EnPA to promulgate licensing requirements and criteria that are consistent with the EPA standards, NRC must ensure that the proposed repository will meet those standards before it authorizes construction. According to Nevada, however, NRC's pertinent regulation, section 63.31, does not require the Commission to find that DOE's application for construction authorization complies with the EPA standards set out in part 197, see 40 C.F.R. pt. 197, or that the application satisfies the EPA standards as incorporated in part 63. Nevada points to paragraph 63.31(a)(3)(ii), which provides that, in making its construction authorization decision, NRC must simply \"consider\" whether \"the site and design comply with the performance objectives and requirements contained in subpart E\" (requiring compliance with EPA standards set forth in subpart L of part 63, see 10 C.F.R. § 63.113(b)). In Nevada's view, NRC has \"[c]learly ... unlawfully reserved for itself the discretion to authorize repository construction even in the face of authoritative evidence that it will not comply with NRC's own (and EPA's) safety requirements.\" Petitioners' Br. at 56.\n\nNRC in turn asserts that Nevada offered \"no hint\" of this argument during NRC's rulemaking proceedings and, as a consequence, cannot now challenge section 63.31 on this ground. Respondent's Br. at 26. While Nevada does not deny that it failed to raise the argument below, offering no citation in the voluminous record where it did so, it counters that it did not have to. Petitioners' Reply Br. at 12-13. Nevada maintains that its oversight was \"both understandable and excusable\" in that EPA did not propose its standards until after the window for public comment on part 63 had closed, and thus, the timing of NRC's rulemaking proceedings \"discourag[ed]\" the public from commenting \"on the interrelationship\" of the two agencies' regulations. Petitioners' Reply Br. at 12-13. We are unconvinced.\n\nIt is a hard and fast rule of administrative law, rooted in simple fairness, that issues not raised before an agency are waived and will not be considered by a court on review. See United States v. L.A. Trucker Truck Lines, Inc., 344 U.S. 33, 37 (1952) (\"Simple fairness to those who are engaged in the tasks of administration, and to litigants, requires as a general rule that courts should not topple over administrative decisions unless the administrative body not only has erred but has erred against objection made at the time appropriate under its practice.\"); see also Nat'l Wildlife Fed'n v. EPA, 286 F.3d 554, 562 (D.C. Cir. 2002) (\"[T]here is a near absolute bar against raising new issues - factual or legal - on appeal in the administrative context.\"); Nat'l Ass'n of Mfrs., 134 F.3d at 1111 (\" `Our cases ... require complainants, before coming to court, to give the [agency] a fair opportunity to pass on a legal or factual argument.' \" (quoting Wash. Ass'n for Television \u0026 Children, 712 F.2d at 681 (alteration and emphasis in original))). The rule applies with no less force to a statutory interpretation claim not brought to an agency's attention: \"[R]espect for agencies' proper role in the Chevron framework requires that the court be particularly careful to ensure that challenges to an agency's interpretation of its governing statute are first raised in the administrative forum.\" Natural Res. Def. Council v. EPA, 25 F.3d 1063, 1074 (D.C. Cir. 1994); see also Ohio v. EPA, 997 F.2d 1520, 1528 (D.C. Cir. 1993); Linemaster Switch Corp. v. EPA, 938 F.2d 1299, 1308-09 (D.C. Cir. 1991). Nevada failed to raise this claim before NRC and consequently waived it.\n\n3. 10,000-Year Compliance Period\n\nNevada next alleges that NRC breached its duty under the AEA and the NWPA to safeguard the public health and safety and arbitrarily and capriciously limited the period for evaluating the repository's performance to 10,000 years following the placement of waste there. According to Nevada, NRC chose - based on political realities rather than hard science - to assess the repository's performance only for the period preceding the time the repository will pose the greatest health risk to future generations, ignoring the advice of experts that there are no technical impediments to evaluating the repository's performance for a much longer period as well as its own recognition that such an evaluation is feasible. Nevada claims that it is unreasonable for NRC to require DOE to compute the peak dose of radiation much further out but for NRC not to consider the repository's performance at that time, claiming that the uncertainties related to human behavior and exposure pathways in predicting the repository's performance during the 10,000 years following waste placement can be addressed as well in assessing its performance thereafter. Nevada additionally faults NRC's decision to confine its evaluation of the repository's performance to 10,000 years because, Nevada claims, NRC knows that a reasonably maximally exposed individual will \"likely\" receive a peak dose of radiation that exceeds NRC's and EPA's limits. Petitioners' Br. at 59.\n\nIn its proposed rule, NRC named three factors in proposing the 10,000-year compliance period: (1) it \"correspond[ed] to the time period when the waste is inherently most hazardous\"; (2) it \"is sufficiently long, such that a wide range of conditions will occur which will challenge the natural and the engineered barriers, providing a reasonable evaluation of the robustness of the geologic repository\"; and (3) it \"is consistent with other regulations involving geologic disposal of longlived hazardous materials, including radionuclides.\" 64 Fed. Reg. at 8647. In the Supplemental Information accompanying part 63 in its final form, NRC used the same three factors as the basis for adopting a 10,000-year compliance period. See 66 Fed. Reg. at 55,760. In addition, in rejecting NAS's recommendation that \"the time over which compliance should be assessed should include the time when greatest risk occurs, within the limits imposed by the stability of the geologic system,\" NRC acknowledged that its judgment involved policy as well as technical considerations. Id. at 55,759. It explained:\n\nThe fact that it is feasible to calculate performance of the engineered and geologic barriers making up the repository system for periods much longer than 10,000 years does not mean that it is possible to make realistic or meaningful projections of human exposure and risk, attributable to releases from the repository, over comparable time frames.\n\nId. at 55,760. NRC therefore concluded that for periods approaching one million years, as NAS had suggested, \"significant climatic and even human evolution would almost certainly occur\" rendering it \"all but impossible to make useful and informed assumptions about human behaviors and exposure pathways.\" Id. at 55,760.\n\nNRC contends that Nevada waived its AEA claim, see Respondent's Br. at 26, but we need not decide the waiver issue or the merits of the State's challenge to NRC's choice of a 10,000-year compliance period now. In light of NRC's obligation under EnPA to maintain licensing criteria that are consistent with the public health and safety standards promulgated by EPA, see EnPA § 801(b)(1); see also 64 Fed. Reg. at 8647 (\"Should EPA issue final standards for Yucca Mountain ... that specify a different compliance period, the NRC will amend its criteria at 10 CFR Part 63, as necessary, to comply with EnPA requirements for consistency with final EPA standards.\"), and our holding above vacating EPA's selection of a 10,000-year period for assessing compliance with its public health and safety standards, see Op. supra at II.B.2, we likewise vacate NRC's identical compliance period\n\nin part 63 and direct NRC to reconsider the period on remand once EPA has complied with our opinion.\n\n4. Reviewability of DOE's Peak Dose Calculations\n\nNevada next challenges NRC's decision to require DOE to \"calculate the peak dose of the reasonably maximally exposed individual that would occur after 10,000 years following disposal but within the period of geologic stability,\" 10 C.F.R. § 63.341, while \"categorically\" prohibiting any challenge to the calculation during the upcoming licensing hearing on the Yucca Mountain repository. See Petitioners' Br. at 57-65. Nevada bases this claim, not surprisingly, on NRC's statement to this effect in the Supplemental Information accompanying part 63: \"[T]here is no finding that the NRC must make with respect to these peak dose calculations nor may they be the subject of litigation in any NRC licensing proceedings for a repository at Yucca Mountain.\" 66 Fed. Reg. at 55,760. Nevada contends that, in so providing, NRC violated the NWPA, see 42 U.S.C. § 10134(f)(4), the AEA, see id. § 2077(c), the NEPA, see id. § 4332(2)(C), and its own regulations promulgated thereunder, see 10 C.F.R. § 51.109(a)(2), as well as our precedent, see Union of Concerned Scientists v. NRC, 735 F.2d 1437 (D.C. Cir. 1984), cert. denied sub nom. Ark. Power \u0026 Light Co. v. Union of Concerned Scientists, 469 U.S. 1132 (1985). While NRC intimates that Nevada waived the argument by failing to raise it during NRC's rulemaking proceedings, NRC has plainly, and wisely, retreated from its position that DOE's peak dose calculations are unassailable.\n\nIn its brief NRC states that parties to the future proceedings on the Yucca Mountain repository will be permitted to challenge DOE's peak dose calculations under certain circumstances. Respondent's Br. at 44-45. While NRC correctly points out that it is obligated under the NWPA to adopt DOE's environmental impact statement (EIS) \"to the extent practicable,\" 42 U.S.C. § 10134(f)(4), it concedes that it has imposed no \" `categorical' limitation\" on any challenge to DOE's peak dose calculations and that, under its regulations, parties to the proceeding may challenge the practicability of adopting aspects of DOE's EIS, including the peak dose calculations, based on \"substantial new information\" to the contrary. Respondent's Br. at 44; see also 10 C.F.R. § 51.109(c)(2) (adoption practicable unless, inter alia, \"[s]ignificant and substantial new information or new considerations render such [EIS] inadequate\"); id. at § 63.341 (\"DOE must include the results and their bases in the [EIS] for Yucca Mountain\"). NRC has, in fact, abandoned the statement in the Supplemental Information that provides the sole footing for Nevada's argument. See Respondent's Br. at 45. It explains that the challenged statement is \"not part of the rule itself and must be construed in a manner consistent with NRC regulations\" - namely, the ones expressly allowing parties to the proceeding to challenge DOE's dose calculations as part of a challenge to the \"practicability\" of adopting DOE's EIS. Respondent's Br. at 45 (citing 10 C.F.R. §§ 51.109, 63.341). NRC's volte face apparently satisfies Nevada, see Petitioners' Reply Br. at 29, and we need not treat it further.\n\n5. NRC's \"Reasonable Expectation\" Standard\n\nFinally, Nevada challenges NRC's adoption of a \"reasonable expectation\" standard for evaluating whether, in a future licensing proceeding, DOE's proposed repository complies with the post-closure performance requirements set forth in the NRC regulations. See 10 C.F.R. §§ 63.31(a)(2), 63.101(a)(2), 63.303; 66 Fed. Reg. at 55,739-40. Nevada argues that in other contexts NRC requires \"reasonable assurance\" that the licensed activity adequately protects the public health and safety and that, in jettisoning the timetested and Supreme Court-approved standard, see Power Reactor Dev. Corp. v. Int'l Union of Elec., Radio \u0026 Mach. Workers, 367 U.S. 396, 407-08 (1961), in favor of a \"vague\" \"reasonable expectation\" standard, NRC \"overt[ly]\" violated the AEA and the NWPA and otherwise acted arbitrarily and capriciously. Petitioners' Br. at 69-70. We need not, however, resolve this matter.\n\nNRC explained in its brief that there is \"no consequential difference\" between the reasonable assurance and reasonable expectation standards and that the two are, in fact, \"[v]irtually [i]ndistinguishable.\" Respondent's Br. at 47-48. Moreover, during oral argument, counsel for NRC confirmed that the two standards are substantively identical. See Oral Argument Tr. at 106-07. Nevada deemed NRC's representation sufficient to satisfy its claim. See Petitioners' Reply Br. at 29 (noting NRC's \"welcome\" concession that reasonable assurance and reasonable expectation are \"identical\" standards).\n\nTo summarize briefly, then, Nevada prevails on only one of its challenges in these cases. Because NRC must set licensing requirements and criteria that are consistent with the EPA standards, and because we have determined that EPA's 10,000-year compliance period is not \"based upon and consistent with\" the NAS recommendations, we vacate NRC's identical standard in part 63 for reconsideration once EPA reviews its standard. We reject, on the merits, Nevada's argument that the NWPA required NRC to provide that the geologic composition of DOE's proposed repository must constitute the primary barrier for isolating waste from the human environment. So, too, do we reject Nevada's multiple barriers claims. Section 121 of the NWPA requires that NRC promulgate requirements and criteria that provide for the use of multiple barriers and this NRC did. We conclude, moreover, that NRC adequately explained its decision to evaluate the performance of the proposed repository based on a total system performance assessment rather than on the performance of the repository's individual subsystems.\n\nOf Nevada's remaining arguments, the State waived one of them and the parties resolved the other two inter se. Nevada waived its contention that NRC acted unlawfully in permitting construction of the Yucca Mountain repository without first finding a reasonable expectation that the repository complies with the EPA standards because Nevada did not so contend at the agency level. Nevada's challenges to NRC's original assertion that DOE's peak dose calculations cannot be assailed in a future licensing hearing and to NRC's \"reasonable expectation\" standard have been resolved by the parties.\n\nIV. THE SITE-DESIGNATION CASES\n\nOn February 14, 2002, the Secretary of Energy submitted to the President his recommendation that the Yucca Mountain site be developed as a repository. The recommendation was based in part upon the Secretary's determination that the Yucca site satisfied DOE's site-suitability criteria and in part upon a final environmental impact statement (FEIS), developed by DOE pursuant to § 114(f) of the NWPA. The day after receiving the Secretary's recommendation, the President submitted to Congress his recommendation that the Yucca site be developed.\n\nNevada exercised its right under sections 115 and 116 of the NWPA to submit to Congress a timely \"notice of disapproval.\" In the absence of further congressional action, this notice would have nullified the President's site designation. See 42 U.S.C. § 10135(b). After legislative hearings at which Nevada and other parties testified and submitted documentary evidence, Congress enacted a joint \"resolution of repository siting approval\" (Resolution) overriding Nevada's notice of disapproval and approving the Yucca site for a repository. See 42 U.S.C. § 10135(a), (c) (prescribing the form and effect of the Resolution). The Resolution was enacted pursuant to the legislative procedures prescribed by the NWPA, see 42 U.S.C. § 10135(d), (e), and was signed into law by the President on July 23, 2002. The legislation provides:\n\nResolved by the Senate and House of Representatives of the United States of America in Congress assembled, That there hereby is approved the site at Yucca Mountain, Nevada, for a repository, with respect to which a notice of disapproval was submitted by the Governor of the State of Nevada on April 8, 2002.\n\nPub. L. No. 107-200, 116 Stat. 735 (2002).\n\nIn State of Nevada v. United States Department of Energy (No. 01-1516 and consolidated cases) (DOE Case), Nevada challenges the actions of the Secretary of Energy and the President leading to the approval of the Yucca site. In other words, Nevada does not challenge the legislation itself, but, rather, agency and executive branch actions that preceded the passage of the Resolution.\n\nNevada's primary claim is that DOE's site-suitability criteria violate the NWPA by failing to incorporate certain geological considerations set forth in § 112(a) of the statute. In addition, Nevada asserts that the Secretary violated the NWPA by failing to complete site-characterization activities at Yucca before recommending the site and by failing to take certain mandatory actions after allegedly determining that the Yucca site was unsuitable. Finally, Nevada challenges the FEIS, claiming that DOE violated procedural and substantive requirements of the National Environmental Policy Act of 1969 and its implementing regulations. Nevada requests, on the basis of these alleged defects, that we set aside the site-suitability criteria, the Secretary's site recommendation, the FEIS, and the President's site designation.\n\nIn State of Nevada v. United States (No. 03-1009), Nevada challenges the constitutionality of the Resolution approving the Yucca site. Nevada asserts that the Constitution requires Congress, when it regulates federal lands in a manner that imposes a unique burden on a particular state, to do so by means of facially neutral and generally applicable criteria. Nevada claims that the Resolution violates this asserted \"equal treatment\" requirement and accordingly should be set aside.\n\nWe will address Nevada's challenge to the Resolution's constitutionality first. We reject Nevada's claim and uphold the Resolution. Yucca Mountain is located on federal land, and Congress has the authority under the Property Clause to designate the site for development as a repository. To the extent that the Constitution requires that legislation regulating federal lands have a rational basis, the Resolution meets this standard. In exercising its Property Clause power to enact the Resolution, Congress has not regulated Nevada's activities so as to infringe upon State sovereignty interests of the type recognized under the Tenth Amendment. We find no viable basis in the Constitution supporting Nevada's claim that Congress must in all instances exercise its Property Clause powers solely pursuant to neutral criteria that are generally applicable to all federal lands. Nevada cites no case law that endorses such a sweeping proposition and we have found none.\n\nTurning to the DOE Case, we hold that Congress's enactment of the Resolution - which independently approved the Yucca site for development - was a final legislative action once it was signed into law by the President. The passage of this law rendered moot Nevada's challenges to the preceding site-selection-related actions of executive branch officials, federal agencies, the Secretary, and the President. Whatever the legal infirmities vel non of those actions, the Resolution is law and cannot be set aside absent a constitutional defect. Having found no such defect, we conclude that Nevada's claims are moot. Congress has settled the matter, and we, no less than the parties, are bound by its decision. If DOE or NRC uses the FEIS to support future decisions relating to the Yucca project, Nevada may challenge the substance of the FEIS in the relevant proceedings. But any such challenge is not yet ripe and must await another day.\n\nA. The Constitutional Case\n\n1. Issue Preclusion\n\nBefore turning to Nevada's constitutional challenge, we address the Government's claim that the Ninth Circuit's decision in Nevada v. Watkins, 914 F.2d 1545 (9th Cir. 1990), cert. denied, 499 U.S. 906 (1991), precludes consideration of the issues Nevada seeks to raise. In Watkins, Nevada challenged the constitutionality of the 1987 amendments to the NWPA, which limited site-characterization activities under the statute to Yucca Mountain. The Ninth Circuit held that Congress had the constitutional authority under the Property Clause to enact the 1987 amendments. Id. at 1553. The court went on to hold that none of the other constitutional provisions or doctrines relied upon by Nevada - including the Tenth Amendment, the Federal Enclave Clause, the Privileges and Immunities Clause, the Port Preference Clause, and the equal footing doctrine - precluded Congress from exercising its Property Clause authority in this manner. Id. at 1554-58. We have no disagreement with the Ninth Circuit's resolution of the claims at issue in Watkins. Indeed, many of the basic principles articulated in that decision are central to our resolution of the case before us. But we cannot agree that Watkins precludes us from considering the issues now raised by Nevada.\n\nFor issue preclusion to apply, the same issue now raised must have been contested by the parties and submitted for judicial determination in the prior case, the issue must have been \"actually and necessarily determined,\" and preclusion must not \"work a basic unfairness\" to the party that would be bound by resolution of the issue in the prior case. Yamaha Corp. of Am. v. United States, 961 F.2d 245, 254 (D.C. Cir. 1992), cert. denied, 506 U.S. 1078 (1993). The issues Nevada now seeks to raise simply are not precisely the same as those decided in Watkins. Nevada's claim in the instant case requires us to determine whether the Constitution requires that a national nuclear waste repository site on federal land be selected on the basis of facially neutral, generally applicable criteria, and, if so, whether the Resolution violates this asserted \"equal treatment\" requirement. No such issue was or could have been decided in Watkins. Most important, the two cases involve different statutes with different effects. The statute at issue in Watkins limited site-characterization activities under the NWPA to Yucca but did not select the site for development as a repository. The legislation challenged in this case, by contrast, approved the Yucca site for development and authorized DOE to seek a license to construct and operate a repository there. Moreover, the constitutional claims at issue in the two cases are distinct. Nevada did not challenge the 1987 amendments on the basis of the purported \"equal treatment\" requirement that it now asserts. The Watkins court therefore had no opportunity to pass on the precise issues raised by the claim now before us.\n\nWe are aware of no precedent - and the Government has cited none - remotely suggesting that a prior decision addressing the constitutionality of one statute bars consideration of a later challenge, on different constitutional grounds, to a different statute with different effects. In short, Watkins did not \"actually and necessarily\" determine the same issues raised by Nevada's claim in the case before us, and therefore we are not precluded from considering and deciding those issues on the merits.\n\n2. Merits of the Constitutional Challenge\n\nThe Property Clause of the U.S. Constitution provides that \"Congress shall have Power to dispose of and make all needful Rules and Regulations respecting the Territory or other Property belonging to the United States.\" U.S. CONST. art. IV, § 3, cl. 2. Under the Clause, \"Congress exercises the powers both of a proprietor and of a legislature over the public domain.\" Kleppe v. New Mexico, 426 U.S. 529, 540 (1976). Indeed, the Supreme Court has repeatedly declared that Congress's power over federal lands is \"without limitations.\" Cal. Coastal Comm'n v. Granite Rock Co., 480 U.S. 572, 580 (1987) (quoting Kleppe, 426 U.S. at 539). Accordingly, our role in reviewing Congress's exercise of this power is narrow. We must determine whether the Resolution \"can be sustained as a `needful' regulation `respecting' the public lands.\" Kleppe, 426 U.S. at 536. But in so doing, \"we must remain mindful that, while courts must eventually pass upon them, determinations under the Property Clause are entrusted primarily to the judgment of Congress.\" Id.\n\nThe Property Clause clearly provides an adequate source of constitutional authority for Congress's enactment of the Resolution. The disputed Resolution is a law \"respecting\" federal property. And we defer to Congress's judgment that the Resolution is a \"needful\" regulation. See id.; United States v. San Francisco, 310 U.S. 16, 29-30 (1940) (\"[I]t is not for the courts to say how [the public trust over federal lands] shall be administered. That is for Congress to determine.\" (quoting Light v. United States, 220 U.S. 523, 537 (1911))). Our review extends, at most, to determining whether there is a rational relationship between Congress's stated end and its chosen means. See Peter A. Appel, The Power of Congress \"Without Limitation\": The Property Clause and Federal Regulation of Private Property, 86 MINN. L. REV. 1, 82 (2001); see also Kleppe, 426 U.S. at 535-36 (discussing the basis for Congress's enactment of the statute at issue); cf. Hodel v. Va. Surface Mining \u0026 Reclamation Ass'n, Inc., 452 U.S. 264, 291 (1981) (\"The only limitation on congressional authority [preemptively to regulate private activities under the Commerce Clause] is the requirement that the means selected be reasonably related to the goal of regulating interstate commerce.\"). The Resolution easily passes this test.\n\nThe Resolution is best understood as a step in the repository-development process established by the NWPA two decades before. Congress enacted the NWPA on the basis of findings that the accumulation of spent nuclear fuel and radioactive waste had created a \"national problem\" and that \"the Federal government has the responsibility to provide for the permanent disposal of high-level radioactive waste and such spent nuclear fuel as may be disposed of in order to protect the public health and safety and the environment.\" 42 U.S.C. § 10131(a)(2), (4). One of the primary purposes of the NWPA, therefore, was \"to establish a schedule for the siting, construction, and operation of repositories that will provide a reasonable assurance that the public and the environment will be protected from the hazards posed by\" such wastes. 42 U.S.C. § 10131(b)(1). The Senate Committee Report on the Resolution referred back to the NWPA findings and reaffirmed the judgment that \"[a] geologic repository is needed to isolate high-level radioactive waste and spent nuclear fuel from the public and the environment.\" S. REP. NO. 107-159, at 4 (2002). The Report concluded that the Administration had adequately demonstrated that the Yucca site was likely to be suitable for development, subject to the outcome of future NRC licensing proceedings. Id. at 13. Approval of the site and continuation of the repositorydevelopment process therefore was determined to be in the national interest. Id. at 14.\n\nThere clearly is a rational relationship between Congress's stated purpose - the development of a geologic repository for the safe disposal of radioactive waste - and its decision to approve the Yucca site. It is not for this or any other court to examine the strength of the evidence upon which Congress based its judgment. See Kleppe, 426 U.S. at 541 n.10 (\"What appellees ask is that we reweigh the evidence and substitute our judgment for that of Congress. This we must decline to do.\").\n\nIt remains only to determine whether the Resolution violates some other provision of the Constitution. See Watkins, 914 F.2d at 1553-54 (citing Williams v. Rhodes, 393 U.S. 23, 29 (1968)). Nevada asserts that the Constitution requires Congress, when it decides to use federal property in a manner that imposes a unique burden on a particular State, to choose the relevant site on the basis of facially neutral criteria that are applicable nationwide. The Resolution runs afoul of this \"equal treatment\" requirement, as Nevada styles it, because Congress approved the Yucca site based on sitesuitability criteria that are applicable only to Yucca and that allegedly \"reduce[d] to a virtual irrelevancy the actual geologic characteristics of the site.\" Petitioners' Br. at 24.\n\nThe so-called \"equal treatment\" claim Nevada asserts is not based upon any specific provision of the Constitution, but rather on principles of federalism ostensibly inherent in the Constitution as a whole. Although Nevada purports to find support for its claim in the Guarantee Clause, the Port Preference Clause, the Uniformity Clause, the Bill of Attainder Clause, and the equal footing doctrine, its argument is based primarily on the Supreme Court's interpretation of the Tenth Amendment in South Carolina v. Baker, 485 U.S. 505 (1988). In Baker, the Court suggested \"the possibility that some extraordinary defects in the national political process might render congressional regulation of state activities invalid under the Tenth Amendment.\" Id. at 512. Such a defect might arise, the Court indicated, where a State \"was singled out in a way that left it politically isolated and powerless.\" Id. at 513. Nevada argues that this occurs when Congress legislates in violation of the asserted \"equal treatment\" principle: \"A State can negotiate and politick with other States when the issue before Congress is what general standards to apply in deciding where to bury nuclear waste, because all States have an interest in fair, reasonable and workable rules, given that all are at risk of being stuck with an unpopular burden.\" Petitioners' Br. at 53. Where, by contrast, Congress is asked to give an up-or-down vote on a single preannounced site, \"then the State where that site is located loses its natural allies in the national political process.\" Id. We find no basis in the Constitution for Nevada's proposed \"equal treatment\" requirement. Accordingly, we reject Nevada's challenge to the Resolution.\n\nTo begin with, the Resolution does not infringe upon state interests of the kind protected by the Tenth Amendment. Baker, upon which Nevada bases its claim, construed the Tenth Amendment as broadly as possible to refer to \"any implied constitutional limitation on Congress' authority to regulate state activities, whether grounded in the Tenth Amendment itself or in principles of federalism derived generally from the Constitution.\" 485 U.S. at 511 n.5 (emphasis added). Baker then unequivocally states that \"the possibility that some extraordinary defects in the national political process might render congressional regulation ... invalid under the Tenth Amendment\" would be an issue only with respect to \" congressional regulation of state activities.\" 485 U.S. at 512 (emphasis added). Congress's decision to designate Yucca Mountain for development as a repository does not in any way regulate Nevada's activities; it merely prescribes the use of a particular piece of federal property. Nor, of course, does the Resolution \"commandeer\" the state legislative process or state officials so as to violate the Tenth Amendment constraint on federal powers recognized in New York v. United States, 505 U.S. 144 (1992), and Printz v. United States, 521 U.S. 898 (1997). Congress's decision to use the Yucca site as a repository does preempt Nevada from adopting conflicting legislation or regulations. But this is merely the natural and constitutionally unobjectionable result of the Supremacy Clause. See Kleppe, 426 U.S. at 543; see also Hodel, 452 U.S. at 290 (\"Although such congressional enactments obviously curtail or prohibit the States' prerogatives to make legislative choices respecting subjects the States may consider important, the Supremacy Clause permits no other result.\"). In short, while the designation of Yucca as a repository may impose a burden on Nevada, it does not infringe upon state sovereign interests of the limited type protected by the Tenth Amendment.\n\nMoreover, the Tenth Amendment limitation adumbrated by the Court in Baker applies to defects in the political process. But the \"equal treatment\" claim asserted by Nevada plainly goes to the substantive basis of congressional legislation over federal property and does not involve the political process at all. The Court made clear in Baker that \"nothing in ... the Tenth Amendment [broadly construed] authorizes courts to second-guess the substantive basis for congressional legislation. Where, as here, the national political process did not operate in a defective manner, the Tenth Amendment is not implicated.\" 485 U.S. at 513 (citation omitted). If anything, therefore, Baker appears positively to preclude us from subjecting congressional legislation to the so-called \"equal treatment\" requirement conjured up by Nevada.\n\nAs noted above, Nevada purports to find support for its \"equal treatment\" claim in the Guarantee Clause, the Port Preference Clause, the Uniformity Clause, the Bill of Attainder Clause, and the equal footing doctrine. Nevada does not assert that the Resolution violates any of these provisions or doctrines taken individually, and it is clear that any such claim would fail. Rather, Nevada contends that these provisions and doctrines express fundamental principles of state equality and a general constitutional preference for legislation based on neutral and generally applicable criteria. Nevada attempts to distill these principles and to synthesize from them a novel constitutional \"equal treatment\" requirement. But in so doing, Nevada effectively discards the text, the substantive context, and the jurisprudential history of each of the individual provisions or doctrines upon which it relies. The end product is an entirely new creation. It has no textual basis in the Constitution. And, perhaps not surprisingly, Nevada cites no juridical precedent or historical practice hinting at the existence of such a restraint on congressional authority over federal lands.\n\nWe are aware, of course, that the Supreme Court has recognized - in the context of its state sovereign immunity and \"commandeering\" decisions - constitutional limitations on congressional authority that are not solely or strictly based upon the text of the Constitution. See, e.g., Printz, 521 U.S. at 918-25; Alden v. Maine, 527 U.S. 706, 713 (1999). Those limitations, however, were rooted \"in historical understanding and practice, in the structure of the Constitution, and in the jurisprudence of th[e Supreme] Court.\" Printz, 521 U.S. at 905. The Court's sovereign immunity decisions are premised on the conclusion that, \"as the Constitution's structure, its history, and the authoritative interpretations by this Court make clear, the States' immunity from suit is a fundamental aspect of sovereignty which the States enjoyed before the ratification of the Constitution.\" Alden, 527 U.S. at 713. This pre-existing immunity was \"confirmed ... as a constitutional principle\" by the ratification of the Eleventh Amendment. Id. at 728-29. The Court's recognition of the anticommandeering principle similarly was rooted in the history and structure of the Constitution, Printz, 521 U.S. at 905-23, and, \"most conclusively,\" in the Court's prior jurisprudence, id. at 925.\n\nNevada's proposed \"equal treatment\" requirement has no such roots in Supreme Court precedent or the history of the Constitution. As for Nevada's contention that the requirement is inherent in the Constitution's structure, we have already shown that the Tenth Amendment does not protect the type of state interests implicated by this case. As the following discussion makes clear, the inferential leap from the remaining constitutional sources relied upon by Nevada to the proposed \"equal treatment\" requirement is too great to be plausible.\n\nThe Uniformity Clause provides that \"all Duties, Imposts and Excises shall be uniform throughout the United States.\" U.S. CONST. art. I, § 8, cl. 1. The Port Preference Clause provides that \"[n]o Preference shall be given by any Regulation of Commerce or Revenue to the Ports of one State over those of another.\" U.S. CONST. art. I, § 9, cl. 6. These provisions have been narrowly construed to prohibit certain forms of direct discrimination between States within the legislative spheres to which the provisions apply: taxation and port-related commerce-and-revenue regulation, respectively. See, e.g., United States v. Ptasynski, 462 U.S. 74, 85-86 (1983) (upholding against a Uniformity Clause challenge an oil taxation scheme that had the effect of giving a unique exemption to Alaskan oil, on the grounds that the exemption was based on \"neutral factors\" and was not intentionally discriminatory); Pennsylvania v. Wheeling \u0026 Belmont Bridge Co., 59 U.S. (18 How.) 421, 433-35 (1856) (holding that the Port Preference Clause prohibits only \"positive legislation by [C]ongress\" that gives \"a direct privilege or preference to the ports of any particular State over those of another,\" not federal enactments that merely confer \"incidental advantages\" on one port over others). Nevada correctly notes that the Supreme Court has upheld legislation challenged under these provisions on the grounds, inter alia, that the legislation was based on neutral factors or only incidentally burdened or benefitted a particular State. See id. The conclusion that tax or port-related legislation having these characteristics may be insulated from challenge under these provisions, however, cannot plausibly be converted into a constitutional mandate that all legislation whatsoever have such characteristics.\n\nThe equal footing doctrine, upon which Nevada also relies, applies to the terms on which new states enter the Union. Utah Div. of State Lands v. United States, 482 U.S. 193, 195-96 (1987). Its principal application has been to guarantee that newly admitted States take title to the bed of all navigable waters in their territories, just as did the original thirteen States. Id. But the Supreme Court has made clear that the doctrine \"negatives any implied, special limitation of any of the paramount powers of the United States in favor of a State.\" United States v. Texas, 339 U.S. 707, 717 (1950). This includes, of course, Congress's exercise of its Property Clause powers. See Watkins, 914 F.2d at 1555 (rejecting Nevada's equal footing challenge to the 1987 amendments to the NWPA).\n\nThe other purported constitutional bases of the \"equal treatment\" claim are even more tenuous. The Guarantee Clause provides, in relevant part, that \"[t]he United States shall guarantee to every State in this Union a Republican Form of Government.\" U.S. CONST. art. IV, § 4. The Supreme Court has indicated that this provision is implicated only where legislation poses some \"realistic risk of altering the form or method of functioning of [a State's] government.\" New York v. United States, 505 U.S. at 186. The Bill of Attainder Clause, U.S. CONST. art. I, § 9, cl. 3, proscribes legislation singling out individuals for punishment. See, e.g., United States v. Brown, 381 U.S. 437, 447 (1965). The Clause cannot be invoked on behalf of a State. South Carolina v. Katzenbach, 383 U.S. 301, 324 (1966).\n\nWe find it beyond serious dispute that Nevada's proposed \"equal treatment\" requirement cannot reasonably be inferred from the provisions and doctrines upon which Nevada purports to rely. We fail to see, moreover, how the constraints demanded by Nevada's claim would be consistent with the plenary nature of Congress's Property Clause authority or the considerable deference that we accord to Congress's judgment in exercising that authority. Under Nevada's proposed requirement, each time Congress decides to use federal property in a manner that incidentally burdens a State - for example by designating such property for use as a military installation, a prison, a dam, a storage or disposal site, or a conservation area - it must formulate neutral selection criteria and apply those criteria to every piece of federal property in the Nation before selecting a site. Courts presumably would be required to scrutinize the substantive basis of the legislation in question to ensure that the criteria were genuinely neutral and generally applied. This is far more intrusive than any requirement that there be a rational basis for Congress's judgment that a particular regulation respecting a particular property is \"needful.\" The substantive constraint on legislation and the judicial role implicit in Nevada's \"equal treatment\" requirement are, in our view, totally at odds with the broad interpretation given to Congress's Property Clause powers. See Biodiversity Assoc. v. Cables, 357 F.3d 1152, 1161-62 (10th Cir. 2004) (rejecting a constitutional challenge to legislation prescribing in \"minute detail\" the management of a single national forest on the grounds that Congress, in exercising its Property Clause powers, \"is permitted to be as specific as it deems appropriate\" and that \"[i]t would be difficult if not impossible to control the use of federal lands without reference to specific actions affecting specific tracts of land\"); see also Nat'l Coalition to Save Our Mall v. Norton, 269 F.3d 1092, 1097 (D.C. Cir. 2001) (finding no constitutional objection to the specificity of legislation requiring construction of a World War II Memorial on the National Mall). As the Supreme Court declared long ago: \"The power over the public land ... entrusted to Congress [under the Property Clause] is without limitations. `And it is not for the courts to say how that trust shall be administered. That is for Congress to determine.' \" San Francisco, 310 U.S. at 29-30 (quoting Light, 220 U.S. at 537) (footnotes omitted).\n\nFor all of the foregoing reasons, we reject Nevada's constitutional challenge to the Resolution. We now turn to Nevada's challenge to the administrative and executive decisions leading up to the Resolution's enactment.\n\nB. The DOE Case\n\n1. DOE Criteria, Secretary's Alleged Failure to Take Mandatory Actions, and Site Recommendations\n\nNevada's challenges to DOE's site-suitability criteria, the Secretary's recommendation, the FEIS, and the President's recommendation are all directed to the fundamental question of whether the Yucca site was properly selected for development as a repository. Congress's enactment of the Resolution, however, has rendered that question moot. The Resolution affirmatively and finally approved the Yucca site for a repository, thus bringing the site-selection process to a conclusion. No determination as to the soundness of the administrative and executive actions leading up to the Resolution's enactment would undo the Resolution's binding effects. \"It has long been settled that a federal court has no authority `to give opinions upon moot questions or abstract propositions, or to declare principles or rules of law which cannot affect the matter in issue in the case before it.' \" Church of Scientology v. United States, 506 U.S. 9, 12 (1992) (quoting Mills v. Green, 159 U.S. 651, 653 (1895)). Where Congress enacts intervening legislation that definitively resolves the issues a litigant seeks to put before us, the claims are moot and we are precluded from deciding them. See Cook Inlet Treaty Tribes v. Shalala, 166 F.3d 986, 990 (9th Cir. 1999); Mobil Oil Corp. v. EPA, 35 F.3d 579, 585 (D.C. Cir. 1994); State of Nevada v. Watkins, 943 F.2d 1080, 1083-84 (9th Cir. 1991); Bunker Ltd. P'ship v. United States, 820 F.2d 308, 311 (9th Cir. 1987).\n\nThere is no question that the Resolution is a law, enacted in accordance with the bicameralism and presentment requirements of Article I, section 7, clause 3 of the Constitution. See Bowsher v. Synar, 478 U.S. 714, 756 (1986) (Stevens, J., concurring in judgment) (\"The joint resolution, which is used for `special purposes and ... incidental matters,' makes binding policy and `requires an affirmative vote by both Houses and submission to the President for approval' - the full Article I requirements.\" (citations omitted)); Consumer Energy Council of Am. v. FERC, 673 F.2d 425, 459 n.140 (D.C. Cir. 1982) (stating that joint resolutions become law upon presentment to and approval by the President).\n\nAs with any other statute, our interpretation of the Resolution begins with its text and the presumption that Congress \"says in a statute what it means and means in a statute what it says there.\" Conn. Nat'l Bank v. Germain, 503 U.S. 249, 254 (1992); see also Ann Arbor R.R. Co. v. United States, 281 U.S. 658, 666 (1930) (stating that a joint resolution is construed according to general rules of statutory construction). Congress, in enacting the Resolution, spoke in concise and unambiguous language: \"[T]here hereby is approved the site at Yucca Mountain, Nevada, for a repository, with respect to which a notice of disapproval was submitted by the Governor of the State of Nevada on April 8, 2002.\" 116 Stat. 735 (2002), 42 U.S.C. § 10135 note. The Resolution's meaning is clear on its face: It overrides Nevada's notice of disapproval and affirmatively approves the Yucca site for the development of a repository. The practical effect of the legislation is to conclude the site-selection process and to permit DOE to seek authorization from NRC to construct and operate a repository at this site.\n\nThe legislative history of the Resolution confirms this interpretation. The Senate Committee Report on the Resolution states that \"[t]he purpose of [the Resolution] is to approve the site at Yucca Mountain, Nevada for the development of a repository for the disposal of high-level radioactive waste and spent nuclear fuel, pursuant to the Nuclear Waste Policy Act of 1982.\" S. REP. NO. 107-159, at 1 (2002). The House Committee Report contains virtually identical langauge. H.R. REP. NO. 107-425, at 2 (2002). Both Reports state that the effect of the Resolution's enactment will be to allow DOE to go forward with its application for authorization from NRC to build and operate the repository. See S. REP. NO. 107-159, at 1 (2002); H.R. REP. NO. 107-425, at 7 (2002) (Congressional Budget Office Estimate).\n\nThe floor debate on the Resolution likewise confirms that the members of Congress intended the Resolution to approve the Yucca site, conclude the site-selection process, and permit DOE to proceed to seek a license for the repository. See generally 148 CONG. REC. H2180-H2205 (daily ed. May 8, 2002); 148 CONG. REC. S6444-S6491 (daily ed. July 9, 2002). As Senator Murkowski, one of the Senate sponsors of the Resolution, declared, \"The resolution ... reaffirms the present recommendation of Yucca Mountain as a suitable site for this Nation's permanent geologic repository ... [and] gives the Department of Energy the go ahead to begin the licensing process with the Nuclear Regulatory Commission....\" 148 CONG. REC. S5886 (daily ed. June 21, 2002). Representative Shimkus, one of the House sponsors, similarly stated that \"[t]he vote that Congress will be taking today says that after 20 years of exhaustive scientific analysis the government is ready to designate Yucca Mountain ... a safe site and move to the licensing phase for the development of an underground disposal facility.\" 148 CONG. REC. H2185 (daily ed. May 8, 2002).\n\nThere is good reason, moreover, to conclude that both Nevada and the Members of Congress understood that enactment of the Resolution would render moot most of the claims raised in this suit. Nevada, in its statement of the reasons for its notice of disapproval, notified Congress of its pending law suits challenging \"the legal soundness of both the Secretary's and the President's Yucca Mountain site recommendations.\" Statement of Reasons Supporting the Governor of Nevada's Notice of Disapproval of the Proposed Yucca Mountain Project 5-6 (Apr. 8, 2002), reprinted in Add. of Leg. Materials at 10-11. Nevada asserted the central claim in the case now before us: that DOE changed its site-suitability criteria because Yucca could not meet the pre-existing criteria.\n\nId. Nevada urged Congress to delay approval of the repository until its legal claims were decided by the courts and stated that direct legislative approval of the Yucca site would mean that \"DOE's bogus site suitability determination could never be reviewed on the technical merits.\" Id.\n\nThe Senate Committee Report considered and rejected Nevada's objections to approval of the Yucca site, including the legal argument against the site-suitability criteria. S. REP. NO. 107-159, at 6-13 (2002). The authors of the Report reviewed the Administration's case for selecting the Yucca site and concluded that the Secretary's recommendation and the supporting documents and testimony \"me[t] the burden of going forward imposed by the [NWPA].\" Id. at 13. Nevada's arguments, the Committee declared, did not \"outweigh the national interest in proceeding\" with the repository program. Id. at 14. Despite Nevada's public prediction that approval of the Yucca site would render its site-selectionrelated claims unreviewable, Congress ultimately enacted the Resolution.\n\nIn summary, everything in the text and legislative history of the Resolution confirms that Congress intended affirmatively to approve the Yucca site, thus concluding the siteselection process and permitting DOE to seek authorization from NRC to build and operate a repository at the site. In the absence of any constitutional defect in the Resolution, we have no authority to review the substantive basis for this decision. \"Once the meaning of an enactment is discerned and its constitutionality determined, the judicial process comes to an end. We do not sit as a committee of review, nor are we vested with the power of veto.\" Tenn. Valley Auth. v. Hill, 437 U.S. 153, 194-95 (1978). The Resolution's meaning is clear, and we have already rejected Nevada's sole constitutional challenge. There consequently remains nothing left for us to decide. No pronouncement from this court as to the legal soundness of the administrative and executive decisions preceding the enactment of the Resolution could provide Nevada with any effective relief. The Resolution is the law, the Yucca site has been finally approved, and DOE has been authorized to seek permission from NRC to construct and operate the repository.\n\nNevada concedes that its claims are moot to the extent that the Resolution affirmatively approved the Yucca site for development. Nevada argues, however, that the Resolution is merely a \"legislative veto\" that \"cancels\" Nevada's notice of disapproval and restores the status quo ante. This narrow construction is untenable and must be rejected. The Resolution's text and legislative history make inescapably clear that it not only \"canceled\" Nevada's notice of disapproval but also affirmatively approved the Yucca site. Nevada's arguments to the contrary are unpersuasive.\n\nFirst, the fact that the Resolution approves the Yucca site \" with respect to which a notice of disapproval was submitted \" cannot plausibly be read to limit the effect of the approval. Rather, this secondary clause merely makes clear that Congress intended its affirmative approval to override Nevada's notice of disapproval. Nevada's narrow focus on this language, by contrast, would render meaningless the Resolution's primary clause: \"There hereby is approved the site at Yucca Mountain, Nevada, for a repository.\"\n\nContrary to Nevada's assertions, our interpretation of the Resolution is entirely consistent with NWPA section 114(b). That provision states that DOE shall submit a license application to NRC if the President's \"site designation is permitted to take effect under section [115].\" 42 U.S.C. § 10134(b). The President's site designation may be \"permitted to take effect\" under section 115 in one of two ways: without any further action if Nevada does not submit a timely notice of disapproval, or, if Nevada does submit such a notice, through enactment of a joint resolution meeting the requirements of section 115. See 42 U.S.C. § 10135(b), (c). Nevada submitted a notice of disapproval. Under this scenario, the President's original site designation was nevertheless \"permitted to take effect\" precisely because Congress enacted a law affirmatively adopting that designation.\n\nWe find no merit in Nevada's contention that our interpretation of the Resolution somehow renders the NWPA's judicial review provision meaningless. Section 119 of the NWPA gives the U.S. courts of appeals exclusive jurisdiction over, inter alia, any civil action \"for review of any final decision or action of the Secretary [of Energy], the President, or the [Nuclear Regulatory] Commission under this part.\" 42 U.S.C. § 10139(a)(1). It is elementary that this provision does not supercede Article III of the Constitution, which requires that a case or controversy remain \"live\" in order for this or any other court to have jurisdiction. See Church of Scientology, 506 U.S. at 12 (\"[A] federal court has no authority `to give opinions upon moot questions....' \"). Section 119 contemplates the possibility of actions challenging decisions of the Secretary and the President. But it does not follow that the section is rendered meaningless when, as a result of intervening legislation, a particular action challenging a particular decision becomes moot and therefore unreviewable. It should be noted, moreover, that section 119 continues to govern other suits challenging actions taken under the relevant portion of the NWPA. Nevada's constitutional challenge to the Resolution, addressed on the merits above, was brought pursuant to section 119(a)(1). And section 119 presumably will govern future actions including, for example, any petitions for review of DOE's final decision selecting an alternative for transporting waste to Yucca Mountain and NRC decisions relating to construction authorization or licensing.\n\nFinally, we reject Nevada's contention that the Resolution's meaning or effect is cabined by the fact that it was enacted pursuant to accelerated legislative procedures. We repeat: The Resolution is a law, validly enacted under Article I, section 7 of the Constitution, and its meaning is to be interpreted according to standard tools of statutory interpretation, beginning with its text. That the Resolution was enacted pursuant to the special procedures set forth in the NWPA has no particular bearing on our interpretation of its content.\n\n2. The Final Environmental Impact Statement\n\nDOE's Final Environmental Impact Statement was used to support the Secretary's and the President's recommendations of the Yucca site. Insofar as Nevada's instant challenge to the FEIS is intended to reverse the decision to select the Yucca site, the challenge is moot for the reasons stated above. The Resolution approved the site, and no finding that the FEIS is legally defective would change Congress's final and binding decision. Because the FEIS is expected to play a continuing role in decision making related to the Yucca site, however, we clarify the limits of our holding.\n\nSection 114(f)(4) of the NWPA provides, in relevant part, that the DOE's FEIS \"shall, to the extent practicable, be adopted by [NRC] in connection with the issuance by [NRC] of a construction authorization and license for such repository.\" 42 U.S.C. § 10134(f)(4). To the extent NRC adopts the FEIS, NRC's responsibilities under the National Environmental Policy Act shall be deemed satisfied and \"no further consideration shall be required.\" Id. In addition, DOE is expected to use the FEIS to support one or more future decisions related to Yucca Mountain, including the selection of an alternative for transporting waste to the site.\n\nWe agree with DOE that any challenge to the FEIS, insofar as it may be adopted in support of a future NRC construction-authorization or licensing decision or used by DOE in support of a future transportation-alternative selection, is not yet ripe for review. In determining ripeness, we assess \"both the fitness of the issue for judicial decision and the hardship to the parties of withholding court consideration.\" AT\u0026T Corp. v. FCC, 349 F.3d 692, 699 (D.C. Cir. 2003) (quoting Abbott Labs. v. Gardner, 387 U.S. 136, 149 (1967)). In examining the fitness of an issue for our consideration, we are primarily concerned with whether the claims raise \"purely legal questions [that] would ... be presumptively suitable for judicial review,\" or whether the court and the agency would instead benefit from postponing review until the agency's policy has \"crystallized\" through implementation in a concrete factual setting. AT\u0026T Corp., 349 F.3d at 699-700 (quoting Better Gov't Ass'n v. Dep't of State, 780 F.2d 86, 92 (D.C. Cir. 1986)). Where an issue is not yet fit for judicial review, we must weigh the benefits of postponing review against the hardship suffered by the petitioner as a result of such delay. See id. at 700.\n\nNevada's substantive claims against the FEIS will not be fit for judicial review until the FEIS is used to support a concrete and final decision. DOE has not yet selected a transportation alternative or sought to use the existing FEIS to support such a decision. We do not yet know whether or to what extent NRC will adopt DOE's FEIS in support of any decision to authorize construction or license the operation of a repository at Yucca. NRC has indicated that it may require that DOE supplement the FEIS, or it may itself supplement the FEIS. See NEPA Review Procedures for Geologic Repositories for High-Level Waste, 53 Fed. Reg. 16,131, 16,142-43 (May 5, 1988) (Proposed Rule); 10 C.F.R. § 51.109(a) (2003). In the face of such uncertainty, it is clear that the relevant agency positions have not yet \"crystallized.\" Our review of the FEIS therefore would benefit from postponing consideration until the FEIS has been used to support a specific, concrete, and final decision. See Ohio Forestry Ass'n, Inc. v. Sierra Club, 523 U.S. 726, 733-37 (1998) (withholding consideration of a forest management plan where it was uncertain whether and to what extent the plan would be used to support specific future logging decisions).\n\nTurning to the second prong of our ripeness inquiry, we conclude that withholding consideration of Nevada's substantive claims at this time imposes no hardship on Nevada. Nevada itself has not sought immediate review of the FEIS insofar as it may relate to future DOE or NRC decisions. Putting the now-unreviewable site-selection decisions to one side, the effect of the FEIS will not be felt in a concrete way by Nevada until it is used to support some other final decision of DOE or NRC. Nevada may raise its substantive claims against the FEIS if and when NRC or DOE makes such a final decision. Our decision to postpone consideration of Nevada's claims therefore works no hardship on Nevada sufficient to render its claims ripe. See id. at 735 (holding that requiring a party to participate in further administrative or judicial proceedings is not a hardship sufficient to outweigh a determination that an issue is unfit for review); AT\u0026T Corp., 349 F.3d at 700 (same).\n\nIn reaching this conclusion as to hardship, we rely on the assurances of counsel for both NRC and DOE at oral argument that Nevada will be permitted to raise its substantive challenges to the FEIS in any NRC proceeding to decide whether to adopt the FEIS and in any DOE proceeding to select a transportation alternative. Oral Argument Tr. at 149-52, 169-71. It was noted at oral argument that an NRC decision to adopt the FEIS may present special concerns, because NRC is required under the NWPA to adopt the FEIS \"to the extent practicable.\" See 42 U.S.C. § 10134(f)(4). In setting forth regulations to govern review of DOE's FEIS, NRC has acknowledged that it would not be \"practicable\" to adopt the FEIS unless it meets the standards for an \"adequate statement\" under the NEPA and the Council for Environmental Quality's NEPA regulations. See 53 Fed. Reg. at 16,142. We agree. The NWPA's mandate that the FEIS be adopted by NRC \"to the extent practicable\" is intended to avoid duplication of the environmental review process. See H.R. REP. NO. 97-491, pt. 1, at 48, 53-54 (1982). But it cannot reasonably be interpreted to permit NRC to premise a construction-authorization or licensing decision upon an EIS that does not meet the substantive requirements of the NEPA or the Council on Environmental Quality's NEPA regulations. See id. at 48 (\"The Committee intends that throughout the repository development program, the Secretary and other agencies meet the general requirements and the spirit of NEPA.\" (emphasis added)).\n\nNRC's current regulation governing review of DOE applications for construction authorization or licensing of a repository states that adoption of the DOE's FEIS shall be deemed \"practicable\" unless:\n\n(1) ... The action proposed to be taken by [NRC] differs from the action proposed in the license application submitted by the Secretary of Energy[,] and [t]he difference may significantly affect the quality of the human environment; or (2) Significant and substantial new information or new considerations render such environmental impact statement inadequate.\n\n10 C.F.R. § 51.109(c) (2003). The regulation also notes that, if the FEIS is adopted in accordance with this requirement, \"no further consideration under NEPA or this subpart shall be required.\" 10 C.F.R. § 51.109(d) (2003). When questioned at oral argument about the meaning of this regulation, Government counsel assured the court that NRC will not construe the \"new information or new considerations\" requirement to preclude Nevada from raising substantive claims against the FEIS in administrative proceedings. Oral Argument Tr. at 171.\n\nOn January 15, 2004, following oral argument, counsel for NRC purported to clarify the Government's position in a letter submitted to the court. Letter from Steven F. Crockett, Office of the General Counsel, U.S. Nuclear Regulatory Commission (Jan. 15, 2004). The letter states that the relevant NRC regulations, including 10 C.F.R. § 51.109(c), \"affect[ ] issues that can be raised and litigated at NRC administrative hearings, not issues that can be raised on judicial review.\" Id. The suggested distinction makes no sense. Nevada's claims have not been adjudicated on the merits here and presumably will not have been passed upon by any court prior to the relevant NRC proceedings. The claims thus would certainly raise \"new considerations\" with regard to any decision to adopt the FEIS. Moreover, as noted above, any substantive defects in the FEIS clearly would be relevant to the \"practicability\" of adopting the FEIS. Government counsel's unequivocal representation to the court during oral argument that Nevada will not be foreclosed from raising substantive claims against the FEIS in administrative proceedings comports with the terms of the regulation and reflects a reasonable and compelling interpretation. Therefore, on the record at hand, there is no reason to assume that the regulation will bar consideration of Nevada's substantive claims in the relevant NRC administrative proceedings.\n\nV. CONCLUSION\n\nIn sum, we vacate 40 C.F.R. part 197 to the extent that it incorporates a 10,000-year compliance period because, contrary to EnPA section 801(a), that compliance period is not \"based upon and consistent with\" the recommendations of the National Academy of Sciences. The remaining challenges to the EPA rule are without merit. We vacate the NRC rule insofar as it incorporates EPA's 10,000-year compliance period. In all other respects, we deny Nevada's petition for review challenging the NRC rule. We also reject the State's challenge to the constitutionality of the resolution approving the Yucca Mountain site, and we dismiss the State's petition attacking the Department of Energy's and the President's actions leading to passage of that resolution, as those actions are unreviewable.\n\nSo ordered.\n\n\u003cspan class=\"fn\"\u003e1. Judge Tatel wrote Parts I and II. Judge Edwards wrote Part IV.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Section 119 of the NWPA provides in pertinent part: [T]he United States courts of appeals shall have original and exclusive jurisdiction over any civil action - (A) for review of any final decision or action of the Secretary, the President, or the Commission under this part; (B) alleging the failure of the Secretary, the President, or the Commission to make any decision, or take any action, required under this part; [or] (C) challenging the constitutionality of any decision made, or action taken, under any provision of this part.... 42 U.S.C. § 10139(a)(1)(A)-(C) (emphases added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Section 121 of the NWPA provides in pertinent part: [T]he Commission, pursuant to authority under other provisions of law, shall, by rule, promulgate technical requirements and criteria that it will apply, under the Atomic Energy Act of 1954 (42 U.S.C. 2011 et seq. and the Energy Reorganization Act of 1974 (42 U.S.C. 5801 et seq. ), in approving or disapproving - (i) applications for authorization to construct repositories; (ii) applications for licenses to receive and possess spent nuclear fuel and high-level radioactive waste in such repositories; and (iii) applications for authorization for closure and decommissioning of such repositories. 42 U.S.C. § 10141(b)(1)(A).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. NRC uses \"defense-in-depth\" to mitigate the uncertainties involved in ensuring the safety of complex facilities by requiring multiple and redundant safety barriers. See 64 Fed. Reg. at 8647; see also Op. infra at 68.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. NRC explained that \"[i]n developing this final rule, [it] considered comments received at\" various public meetings, noting that it \"also held a facilitated round table discussion on defense in depth as applied to a possible repository at Yucca Mountain on November 2, 1999, in Las Vegas.\" 66 Fed. Reg. at 55,733.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The State also resorts to the legislative history of the NWPA, asserting that it \"leaves no doubt about the primacy of geologic isolation.\" Petitioners' Br. at 46. But Nevada's proffered citations say not a word about whether Congress intended NRC to ensure that the repository's geologic features provide the primary barrier for isolating waste from the human environment. See, e.g., H.R. REP. NO. 97-491, pt. 1, at 30 (1982) (\"Commitment to a waste disposal technology relying on primary geologic containment provided by a solid rock formation located deep underground, together with containment by engineered barriers including the form and packaging of the nuclear waste, which will provide safe containment of the waste without reliance on human monitoring and maintenance....\" (emphasis added)).\u003c/span\u003e\n\n",
    "body_length": 208581,
    "citedas": [
      "373 F.3d 1251"
    ],
    "attorneys": "Antonio Rossmann, Geoffrey Fettus, Martin G. Malsch,and Charles J. Cooper argued the causes for petitioners Stateof Nevada and Natural Resources Defense Council, et al.With them on the briefs were Joseph R. Egan, Charles J.Fitzpatrick, Howard K. Shapar, Brian Sandoval, AttorneyGeneral, Attorney General's Office of the State of Nevada,Marta A. Adams, Senior Deputy Attorney General, Robert J.Cynkar, Brian S. Koukoutchos, Vincent J. Colatriano, andWilliam H. Briggs Jr. John C. Martin argued the cause for petitioner NuclearEnergy Institute, Inc. With him on the briefs were Jean V.MacHarg, Susan M. Mathiascheck, Robert W. Bishop, andMichael A. Bauser. Christopher S. Vaden, Michele L. Walter, and Ronald M.Spritzer, Attorneys, U.S. Department of Justice, and StevenF. Crockett, Special Counsel, U.S. Nuclear Regulatory Commission, argued the causes for respondents. With them onthe briefs were Jeffrey B. Clark, Deputy Assistant AttorneyGeneral, U.S. Department of Justice, G. Scott Williams, JohnA. Bryson, and Greer S. Goldman, Attorneys, Karen D. Cyr,General Counsel, U.S. Nuclear Regulatory Commission, JohnF. Cordes Jr., Solicitor, E. Leo Slaggie, Deputy Solicitor, andMarc Johnson, Deputy General Counsel, U.S. Department ofEnergy. John C. Cruden, Assistant Attorney General, U.S.Department of Justice, and Elizabeth A. Peterson, Attorney,entered an appearance. Michael A. Bauser argued the cause for intervenor NuclearEnergy Institute, Inc. With him on the briefs of intervenor/amicus Nuclear Energy Institute, Inc. and amicus National Association of Regulatory Utility Commissioners wereRobert W. Bishop, James Bradford Ramsay, and Sharla M.Barklind.",
    "category": [
      "251"
    ],
    "judges": "Before: Edwards, Henderson, and Tatel, Circuit Judges.",
    "citation_count": 98
  }
}
