{
  "id": "CM2MYWYBTlTomsSBOPb4",
  "document": {
    "title": "State v. Brown",
    "full_title": "STATE OF WASHINGTON v. CAL COBURN BROWN",
    "jurisdiction": "Washington Supreme Court",
    "date": "1997-07-24T00:00:00.000Z",
    "docket": "Number 61320-6",
    "body": "En Banc\n\nSMITH, J. Appellant Cal Coburn Brown upon direct review appeals his conviction and sentence for aggravated first degree murder. A jury in the King County Superior Court, after a finding of \"guilty,\" determined he did not merit leniency. The trial court then on January 18, 1994 sentenced Appellant to death as required by statute. We affirm the conviction and sentence.\n\nQUESTIONS PRESENTED\n\nThe following questions are presented by this appeal:\n\n(1) Whether, under RCW 10.95, the capital punishment statute, (a) there was sufficient evidence to justify the affirmative finding by the jury that there were not sufficient mitigating circumstances to merit leniency; (b) the sentence of death is excessive or disproportionate to the penalty imposed in similar cases, considering both the crime and the defendant; (c) the sentence of death was brought about by passion or prejudice; or (d) the defendant was mentally retarded;\n\n(2) Whether the proportionality review mandated by RCW 10.95.130 is void for vagueness under the Eighth and Fourteenth Amendments to the United States Constitution and Article I, sec.sec. 3 and 14 of the Washington Constitution;\n\n(3) Whether statements made by prosecuting attorneys during the guilt and penalty phases of the trial constituted prosecutorial misconduct which denied Appellant a fair trial;\n\n(4) Whether the trial court erred in admitting the testimony of Ms. Susan J. Schnell, surviving victim in a criminal encounter with Appellant in California;\n\n(5) Whether the trial court erred in admitting the testimony of Ms. Jan M. Gray and Ms. Brieanna C. West, who had noncriminal encounters with Appellant in California and Washington;\n\n(6) Whether Appellant was adequately advised of his Miranda rights before making statements to Palm Springs, California police detectives;\n\n(7) Whether Appellant's statements to Palm Springs, California police, which were recorded without his knowledge as permitted by California law, violated Washington's Privacy Act, RCW 9.73 et seq., and thus were inadmissible in Washington courts;\n\n(8) Whether there is before this court a record of \"sufficient completeness\" for adequate appellate review of the issues presented in Appellant's appeal;\n\n(9) Whether the trial court erred in allowing prospective jurors to be \"death qualified\" during voir dire examination;\n\n(10) Whether certain prospective jurors were properly excused for cause;\n\n(11) Whether the terms \"premeditation\" and \"intent\" were sufficiently explained in the trial court's instructions to the jury;\n\n(12) Whether the trial court properly instructed the jury concerning the aggravating factors in the case;\n\n(13) Whether the trial court erred in refusing to give the jury certain instructions proposed by the defense in the penalty phase;\n\n(14) Whether Appellant was properly served with the Notice of Special Sentencing Proceeding required by RCW 10.95.040(2);\n\n(15) Whether Criminal Rule 4.7 (CrR 4.7) mandates reciprocal pretrial discovery of evidence relevant to the penalty phase in a capital case; and (16) Whether the trial court erred in refusing to admit victim impact evidence in the penalty phase of the trial.\n\nSTATEMENT OF FACTS\n\nOn May 27, 1991, Memorial Day, King County police, following a telephone call from police detectives in Palm Springs, California, discovered the body of a twenty-one-year-old woman, Ms. Holly C. Washa, in the trunk of her 1985 blue Oldsmobile automobile parked in space 266 of a Budget Park and Ride lot near the Seattle-Tacoma Airport. She was wearing a leather jacket covered with blood, and the strap of her purse was tied and knotted tightly around her neck. The strap was sunken into the cavity of a deep slash wound across her neck.\n\nThe events surrounding Ms. Washa's death began on May 18, 1991 when the appellant in this case, Cal Coburn Brown, was in La Jolla, California at the Hyatt Regency Hotel. While in the hotel lounge, Appellant met Ms. Jan M. Gray from the Seattle area, who was in La Jolla with her mother on vacation. While socializing with Ms. Gray and her mother, Appellant told them he was an architect who built houses. He also told them he had trouble meeting single women. Ms. Gray mentioned that she had a single friend named Brieanna West who also lived in the Seattle area and who had similar problems meeting single men. After some coaxing by Appellant, Ms. Gray telephoned Ms. West and arranged a blind date for them in Seattle.\n\nOn May 20, 1991, Appellant traveled by air to Seattle. En route, there was a scheduled stop in Ontario, California, where Ms. Susan J. Schnell boarded for a business trip to Lewiston, Idaho. Appellant and Ms. Schnell, who were sitting near each other, began talking during the flight. She found him friendly and interesting. He told her he was a \"home designer\" and spoke with an Australian accent. He also told her he wanted to see her again. She gave him her home and business telephone numbers and the name of the hotel where she would be staying in Lewiston. That same evening Appellant met with Ms. Brieanna C. West for drinks at the Seattle-Tacoma Red Lion Inn. She found him physically unattractive and did not want to see him again. Appellant stayed at the Red Lion Inn that night and Ms. West returned to her apartment.\n\nAppellant telephoned Ms. Susan J. Schnell in Idaho at 9:00 p.m. the next evening and asked her if she could spend some time with him in Seattle. She told him she planned to fly back to California the next day, May 22, 1991, and would be in Seattle on a brief layover. She and Appellant made plans to meet at the Seattle-Tacoma Airport during her layover. Appellant then telephoned the Shadow Motel in the airport area and made arrangements to leave his luggage there. He told an employee of the motel he had met a woman and was going to fly to Palm Springs to meet with her again.\n\nOn May 22, 1991, Appellant met with Ms. Schnell at the Seattle-Tacoma Airport for dinner. They discussed getting together in Palm Springs for the upcoming Memorial Day weekend. Without making definite plans, Ms. Schnell took her flight back to Ontario, California. Later that evening, Appellant telephoned Ms. Schnell in California and arranged to spend Memorial Day weekend with her in Palm Springs.\n\nAppellant's Statement to Police On May 27 and 28, 1991, Appellant made statements to police detectives in Palm Springs, California in three interviews which were recorded without his knowledge. In his statements he related in calm, deliberate, clear, graphic and specific detail a narrative of his activities, with few questions from the detectives, who courteously allowed him to relate his story. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e His statements may fairly be characterized as admissions or confessions. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e On the morning of May 23, 1991, Ms. Holly C. Washa was at the Wyndham Garden Hotel near the Seattle-Tacoma Airport where she had just quit her part-time job. As she was driving out of the parking lot in her 1985 Oldsmobile, Appellant pointed to one of the tires on her automobile suggesting something was wrong. She stopped. Appellant then forced his way into her automobile, stuck a knife \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e in her face, and grabbed her by the hair. He demanded that she \"drive or die,\" and began rummaging through her purse for money. Finding only a small amount of change, he looked at her checkbook. He then forced her to write a check for $350.00, the entire balance in her checking account. They went through the drive-up window at a Seafirst Bank in Federal Way and cashed the check. Then they went to the Seattle waterfront area where Appellant tied Ms. Washa's hands behind her back with her purse strap and forced her into the passenger seat of her automobile. He asked her several questions concerning her schedule on a typical day, who her roommates were and what they did. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e He then purchased some handcuffs at a gun shop while leaving Ms. Washa tied up in the automobile. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e After purchasing the handcuffs, Appellant took Ms. Washa back to his room at the Shadow Motel where he paid for an extra night. He demanded that she remove all her clothing, after which he tied her to the bed with his neckties and her purse strap. He cut up her shirt and stuffed it into her mouth for a gag. He then ordered her to get dressed again and took her to get something to eat. While at a Burger King drive-through, he held the knife in a threatening position where she could see he might use it. Upon their return to the motel room, he ordered her to remove her clothing and lie face down on the bed. He also told her not to scream or do anything. Appellant said Ms. Washa began fellating him, which he took as her consent for sexual activity. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e Appellant then engaged in sexual intercourse with Ms. Washa for about two hours, during which time he noticed she was looking at the door and possibly thinking of escape. Appellant decided it was time \"to have a little control, . . . make her a little more scared of me, basically.\" He then tied her in a face up, spread eagle position, with her hands behind her back and her mouth gagged, and whipped her \"maybe half a dozen times . . . .\" \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Appellant allowed Ms. Washa to get dressed again, tied her hands behind her back, and drove her to Federal Way for pizza. When they returned to the motel, Appellant again forced her to undress and tied her to the bed in a face down, spread eagle position with her hands tied behind her back. He then had sexual intercourse with her again. At about 11:00 p.m. that evening, he telephoned Ms. Susan J. Schnell in California to reconfirm their weekend plans in Palm Springs. After that, he crawled into bed with Ms. Washa, who was still bound and gagged, and they \"dozed.\" \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e The next day, Friday, May 24, 1991, Appellant forced Ms. Washa to drive him to her apartment where he hoped to find checks belonging to her roommates that he could forge. He found some checks and attempted to cash them in $500.00 amounts, but was thwarted when the banks wanted to compare signatures with signature cards on file. Appellant became irritated with Ms. Washa when the check-cashing plan did not go as he had hoped. She began to drive somewhat erratically, making him even angrier. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e When they returned to the motel, Appellant again tied Ms. Washa to the bed face down in a spread eagle position with her hands handcuffed behind her back and her mouth gagged with a washcloth. He penetrated her vaginally and anally with an aftershave lotion bottle. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e He shaved her pubic hair and held a hot hair dryer close to her vagina, breasts and stomach. He also shocked her by using an electric extension cord with the end cut off. He described these acts as \"torture\" and acknowledged that the electric shock was particularly painful. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e At 8:45 on the evening of May 24, 1991, Appellant left for the Seattle-Tacoma Airport to embark on his trip to California. He forced Ms. Washa into the trunk of her blue 1985 Oldsmobile automobile with her hands handcuffed behind her back and drove to the Doug Fox Travel Agency parking lot where he momentarily parked the automobile. Because shuttle buses were driving around the lot, Appellant was concerned that someone might discover Ms. Washa since \"she could just bang and clang and crunch and scream and be out very quickly.\" \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e He then went to the trunk and cut her throat with \"three swipes\" and stabbed her several times in the chest and abdominal areas. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e Because Ms. Washa's blood began leaking from the trunk of the automobile, Appellant moved from the Doug Fox lot to the Budget Park and Ride lot near Shumsky's Restaurant in the airport area. He told detectives:\n\nI was going to do her at one place and leave her there and the blood started coming out from underneath the car .\n\nEvents in California Appellant telephoned Ms. Susan J. Schnell from the airplane while en route to California to confirm the time he would meet her at a hotel near the Ontario Airport. Upon arrival there he had some drinks and later checked into a hotel. Appellant and Ms. Schnell met at about noon the next day, Saturday, May 25, 1991, and drove in her sports car to Palm Springs where they checked into a Ramada Inn. They had planned to stay in separate bedrooms, but because of a reservation mix-up, they had to stay in the same room with only one bed. They slept in the bed that night but did not have intercourse.\n\nAppellant and Ms. Schnell spent Sunday, May 26, 1991, touring the Palm Springs area together. She was driving her burgundy red 1981 Corvette sports car. Upon returning from dinner around midnight, they began kissing and fondling. Appellant performed cunnilingus on Ms. Schnell and then offered to give her a back rub. Appellant straddled her while she lay face down on the bed. Suddenly he violently jerked her arms back and told her not to scream. When she did, he slit her throat. As she continued to scream, Appellant restrained her with handcuffs and brought the knife around to her chest and threatened her with it. She saw the knife. He told her he just wanted her money. Appellant repositioned Ms. Schnell on the bed and tied her to it, using her pantyhose. He shaved her pubic hair and, raped her vaginally and orally. He then ordered her to write him a check for $4,000.00, which she had difficulty completing to his satisfaction until her third attempt.\n\nAppellant became concerned about Ms. Schnell's bleeding and told her he was going out for medical supplies. He tried to gag her with a sock and restrain her arms above her head, but abandoned the effort when she began coughing up blood. Her feet, however, remained handcuffed to the bed. While he was gone, she was somehow able to reach the telephone and call the desk clerk. Palm Springs police arrived and took a description of Appellant from Ms. Schnell. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e When Palm Springs police officer Glen Haas saw a man who fit Appellant's description in the hotel parking lot, near a red Corvette sports car, he drew his firearm and told him to stop and put his hands up. Appellant identified himself as \"Cal.\" Officer Haas asked him where the knife was, and Appellant responded \"in my right front pocket.\" When asked his last name, Appellant replied \"Brown.\" Officer Haas then arrested Appellant on suspicion of attempted murder.\n\nAfter being processed by the Palm Springs police, Appellant was interviewed by Detective Mark Harvey and his partner, Detective Al Franz. Three interviews took place between May 27 and May 28, 1991, with the first two initiated by the detectives and the third initiated by Appellant. Before each interview, Appellant was read his Miranda rights, stated he understood them, and agreed to talk with the detectives. Each interview was tape recorded without Appellant's knowledge or consent. During the first interview, Appellant in specific detail admitted his attack upon Ms. Schnell. Later in that interview, he admitted killing Ms. Washa before coming to Palm Springs. He told the detectives where the killing took place in Washington and where Ms. Washa's automobile could be found. The Palm Springs police immediately contacted King County police who dispatched local officers to the Budget parking lot near the Seattle-Tacoma Airport where they located the 1985 blue Oldsmobile in space 266 with Ms. Washa's body in the trunk. Appellant still had the keys to Ms. Washa's automobile in his possession.\n\nBased upon his behavior with Ms. Schnell, Appellant pleaded \"guilty\" in California to attempted murder in the first degree, aggravated mayhem, torture, robbery in the first degree, and false imprisonment. On November 26, 1991 he was sentenced to life imprisonment in that state.\n\nCorroborating Evidence\n\nKing County Medical Examiner Donald T. Reay, M.D. performed an autopsy on Ms. Holly C. Washa. He concluded her death was caused by an extensive incised wound to her neck and strangulation by a ligature with a very rigid knot. He also noted that both stabbing and slicing occurred in the throat, requiring at least two motions to inflict the incised wound. It was his opinion that the hemorrhages in her eyes indicated the strangulation occurred first.\n\nIn addition to the lethal injuries, Dr. Reay described other trauma to Ms. Washa's body. Her pubic hair had been shaved. Her face was severely bruised. Both the inside and outside of her vaginal area were bruised. There was also bruising around her anus. The vaginal and anal injuries indicated forcible penetration with a hard object consistent with an aftershave bottle belonging to Appellant found in his Palm Springs hotel room. Her nipples showed abrasions and a linear pattern of bruising consistent with being whipped by a belt or cord. Similar bruising was found on her inner thigh, which also indicated whipping. Her feet and ankles were covered with bruises consistent with having been restrained. Her chest and abdomen had multiple stab and slicing wounds. An \"irregular blemish-like area of red drying\" on her inner thigh indicated burning. The stab wounds were consistent with the knife blade of the Leatherman tool Appellant had in his pocket when he was arrested. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e Appellant was charged by information on June 11, 1991 in the King County Superior Court with aggravated murder in the first degree. He was arraigned on February 26, 1992. A notice to determine whether the death penalty should be imposed was filed on March 24, 1992. He was tried by jury before the Honorable Ricardo S. Martinez. The trial began with jury selection on October 25, 1993. Guilt phase testimony began on November 30, 1993. On December 10, 1993, the jury returned a verdict of \"guilty\" of premeditated murder in the first degree, finding that Appellant committed the murder to conceal commission of a crime or to protect or conceal his identity; and found aggravating circumstances of robbery in the first or second degree, rape in the first or second degree and kidnapping in the first degree. The penalty phase of the trial began on December 15, 1993, and on December 27, 1993, the jury returned a verdict finding there were not sufficient mitigating circumstances to merit leniency. The trial court on January 28, 1994 imposed upon Appellant a sentence of death.\n\nDiscussion\n\nStatutory Review\n\n(1) Whether, under RCW 10.95, the capital punishment statute, (a) there was sufficient evidence to justify the affirmative finding by the jury that there were not sufficient mitigating circumstances to merit leniency; (b) the sentence of death is excessive or disproportionate to the penalty imposed in similar cases, considering both the crime and the defendant; (c) the sentence of death was brought about by passion or prejudice; or (d) the defendant was mentally retarded.\n\n(2) Whether the proportionality review mandated by RCW 10.95.130 is void for vagueness under the Eighth and Fourteenth Amendments to the United States Constitution and Article I, sec.sec. 3 and 14 of the Washington Constitution.\n\nUnder our capital punishment statute, RCW 10.95, this court must review a death sentence imposed by a trial court to determine (a) whether there was sufficient evidence to justify the affirmative finding by the jury that there were not sufficient mitigating circumstances to merit leniency; (b) whether the sentence of death is excessive or disproportionate to the penalty imposed in similar cases, considering both the crime and the defendant; (c) whether the sentence of death was brought about by passion or prejudice; and (d) whether the defendant was mentally retarded. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e This review is in addition to the basic review on appeal. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nSufficiency of the Evidence\n\nIn the sentencing phase the jury in this case concluded the State had proved beyond a reasonable doubt that there were not sufficient mitigating circumstances to merit leniency for Appellant Brown. \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e In deciding whether there is sufficient evidence to support that Conclusion, this court must determine whether, after viewing the evidence in the light most favorable to the prosecution, any rational trier of fact could have found sufficient evidence to justify that Conclusion beyond a reasonable doubt. \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e At the penalty phase of his trial, Appellant offered mitigating evidence for the jury to consider in determining his sentence. He presented the testimony of family members who observed that Appellant's mother did not appropriately bond with or \"attach\" to him as an infant and seemed frustrated and impatient when interacting with him. \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e There was testimony that Appellant suffered a traumatic birth experience, \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e appeared \"agitated\" as an infant, and began to display behavior characterized as \"out of bounds\" by the age of two or three. \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e As Appellant grew, his difficult behavior had the effect of putting people off, causing them to reject and avoid him. \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e Testimony was also offered concerning his mother's five marriages, \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e the second of which reportedly involved physical and psychological abuse of both Appellant and his mother. \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e The main focus of Appellant's mitigating evidence was testimony by psychologist Dr. Roland D. Maiuro, Ph.D., who diagnosed Appellant as suffering from anti-social personality disorder, sexual sadism, and manic syndrome. \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e Dr. Maiuro was of the opinion that Appellant also suffered from attention deficit disorder and conduct disorder as a child, \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e perhaps as a result of the trauma he suffered at birth. \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e He also testified that records of lithium therapy while Appellant was in prison in Oregon indicated the drug produced some progress in stabilizing his manic mood disorder, but concluded the state of Oregon did not adequately monitor Appellant's continued use of lithium after he was paroled. \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e Viewing all the evidence in a light most favorable to the prosecution, a rational trier of fact could have found sufficient evidence to support the jury's Conclusion that leniency was not merited in this case. The jury could well have discounted evidence of Appellant's difficult childhood and troubled family life as mitigating factors. Appellant raped, tortured and murdered twenty-one-year-old Holly Washa. Considering such a heinous crime, a rational trier of fact could have concluded that a difficult childhood and troubled family life, faced by many persons who do not resort to criminal behavior, did not constitute sufficient mitigation to deserve leniency in this capital case.\n\nThe State offered rebuttal testimony of a psychiatrist, Dr. John R. Brinkley, M.D., who concluded that Appellant does not suffer from organic brain damage. \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e The jury could rationally have believed this testimony, which tended to rebut Appellant's suggestion that his behavioral problems can at least partially be explained by his birth trauma. Dr. Brinkley also testified, based upon his review of Appellant's Oregon prison records, that lithium did not seem to effectively alter Appellant's behavior and concluded he would not have prescribed lithium in Appellant's case. \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e The jury could have rationally believed this testimony as well and discounted as a mitigating factor Appellant's assertion of irresponsibility on the part of the state of Oregon in monitoring his continued use of lithium. In any event, Appellant makes no persuasive argument that any inadequacy on the part of the State of Oregon in monitoring his drug therapy which is his personal responsibility mitigates in favor of leniency. The jury doubtless discounted Appellant's diagnosed personality disorders, since those disorders perhaps explained, but did not excuse, his violent behavior. \u003cspan class=\"fnref\"\u003e34\u003c/span\u003e \"The mere presence of mitigating factors does not require that the jury grant leniency, if the jurors are convinced that the circumstances of the crime outweigh the mitigating factors.\" \u003cspan class=\"fnref\"\u003e35\u003c/span\u003e The jury in this case could reasonably have determined that none of the mitigating factors presented by Appellant were relatively persuasive against Appellant's brutal and tortuous treatment of Ms. Holly C. Washa. Under these circumstances, we conclude there was sufficient evidence to support the determination by the jury that leniency was not merited in this case.\n\nProportionality\n\nUnder RCW 10.95.130(2)(b), this court must conduct a proportionality review to determine:\n\nWhether the sentence of death is excessive or disproportionate to the penalty imposed in similar cases, considering both the crime and the defendant. For the purposes of this subsection, \"similar cases\" means cases reported in the Washington Reports or Washington Appellate Reports since January 1, 1965, in which the Judge or jury considered the imposition of capital punishment regardless of whether it was imposed or executed, and cases in which reports have been filed with the supreme court under RCW 10.95.120[.] RCW 10.95.120 requires filing of reports \"in all cases in which a person is convicted of aggravated first degree murder.\" This pool of similar cases includes those in which the death penalty was sought and those in which it was not. \u003cspan class=\"fnref\"\u003e36\u003c/span\u003e Appellant argues that the proportionality review mandated by RCW 10.95.130 is void for vagueness under the Eighth and Fourteenth Amendments to the United States Constitution and Article I, sec.sec. 3 and 14 of the Washington Constitution. \u003cspan class=\"fnref\"\u003e37\u003c/span\u003e He cites in support of this claim the case of Harris ex rel. Ramseyer v. Blodgett, in which the United States District Court for the Western District of Washington held that Washington's proportionality review violates procedural due process because RCW 10.95.130 \"does not establish adequate standards or guidelines on which the Court or the parties can rely.\" \u003cspan class=\"fnref\"\u003e38\u003c/span\u003e However, as the State correctly points out, this court considered and rejected that argument in State v. Brett \u003cspan class=\"fnref\"\u003e39\u003c/span\u003e and in State v. Pirtle. \u003cspan class=\"fnref\"\u003e40\u003c/span\u003e Appellant Brown has not convinced us we should reexamine the issue in this case.\n\nIn conducting proportionality review the court is principally concerned with avoiding two systemic problems associated with imposition of capital punishment: random arbitrariness and imposition of the death sentence in a racially discriminatory manner. \u003cspan class=\"fnref\"\u003e41\u003c/span\u003e \"Technical inconsistencies in a line-by-line comparison cannot be equated with those core concerns.\" \u003cspan class=\"fnref\"\u003e42\u003c/span\u003e The focus in this case is on random arbitrariness. There is no claim of racial discrimination. \u003cspan class=\"fnref\"\u003e43\u003c/span\u003e Proportionality review under RCW 10.95 does not guarantee there will be no variations from case to case, nor that a sentence of death will be uniformly imposed in all superficially similar circumstances. \u003cspan class=\"fnref\"\u003e44\u003c/span\u003e Mathematical precision is unworkable \u003cspan class=\"fnref\"\u003e45\u003c/span\u003e and unnecessary. \"There is no constitutional or statutory requirement to ensure an unattainable degree of identity among particular cases which are invariably unique.\" \u003cspan class=\"fnref\"\u003e46\u003c/span\u003e Instead, we must determine whether a death sentence has been imposed generally in similar cases, and not imposed wantonly and freakishly. \u003cspan class=\"fnref\"\u003e47\u003c/span\u003e We have explored in prior cases the most effective way to reach this determination. \u003cspan class=\"fnref\"\u003e48\u003c/span\u003e Under the proportionality statute, RCW 10.95.130 (b), this court must consider both \"the crime and the defendant\" in examining \"similar cases.\" \u003cspan class=\"fnref\"\u003e49\u003c/span\u003e In carrying this out, we examine four factors: (1) the nature of the crime, (2) the aggravating circumstances, (3) the defendant's criminal history and (4) the defendant's personal history. \u003cspan class=\"fnref\"\u003e50\u003c/span\u003e\n\n(1) Nature of the Crime\n\nThe nature of the crime committed by Appellant Brown was particularly brutal. He kidnapped Ms. Holly C. Washa and robbed, raped and tortured her over a two-day period before killing her. He repeatedly raped her vaginally after he gagged and tied her to a bed in his motel room. At one point he used an aftershave bottle to rape her anally and vaginally. He whipped her naked body with a belt several times. He burned her on various parts of her naked body with a hot hair dryer. He shocked her on various parts of her naked body with the exposed end of an electric extension cord, which he acknowledged was quite painful. Appellant himself described these acts as \"torture,\" explaining that he wanted to gain control over Ms. Washa through intimidation. He strangled her, stabbed her, cut her throat with \"three swipes\" and left her to die in the trunk of her automobile. She was found dead.\n\nComparing the facts of this case with \"similar cases\" reported reveals the nature of this crime is at least as brutal and callous as any other considered by this court. A case fairly comparable to this one is State v. Dodd, in which we upheld imposition of the death penalty after proportionality review under RCW 10.95.130(2)(b). \u003cspan class=\"fnref\"\u003e51\u003c/span\u003e In conducting review in that case, the court considered the \"extraordinarily vicious and cold-blooded manner\" in which the appellant killed his victims, noting that two of them suffered for a significant time before their deaths. \u003cspan class=\"fnref\"\u003e52\u003c/span\u003e Although the Dodd case involved three victims instead of one, it also involved physical and mental torture of one of the victims over a prolonged period before death, in a manner similar to the torture inflicted upon Ms. Washa. The victim in Dodd, a four-year-old child, was raped and strangled over the course of an entire day, evening, and subsequent morning before he was killed. \u003cspan class=\"fnref\"\u003e53\u003c/span\u003e Ms. Washa's ordeal lasted two days.\n\nIn State v. Gentry, this court found the death penalty was not disproportionate where the victim experienced terror while being chased through a wooded area before she was sexually assaulted and bludgeoned to death with a rock. \u003cspan class=\"fnref\"\u003e54\u003c/span\u003e While the duration of the victim's suffering in Gentry was unknown, \u003cspan class=\"fnref\"\u003e55\u003c/span\u003e the record in this case indicates Ms. Washa experienced substantial pain and terror for almost two days before she was killed by Appellant Brown.\n\nComparing Ms. Washa's suffering to that endured by victims in other cases considered by this court shows that Appellant's crime is at least as vicious as those committed in other cases in which we upheld imposition of the death penalty after proportionality review. \u003cspan class=\"fnref\"\u003e56\u003c/span\u003e \"A brutal murder involving substantial conscious suffering of the victim makes the murderer more deserving of the death penalty.\" \u003cspan class=\"fnref\"\u003e57\u003c/span\u003e\n\n(2) Aggravating Circumstances\n\nThe jury found Appellant \"guilty\" of premeditated first degree murder, specifying four aggravating factors. It found he committed the murder of Ms. Washa (1) to protect or conceal his identity; (2) in the course of, in furtherance of, or in immediate flight from robbery in the first or second degree; (3) in the course of, in furtherance of, or in immediate flight from rape in the first or second degree; and (4) in the course of, in furtherance of, or in immediate flight from kidnapping in the first degree. \u003cspan class=\"fnref\"\u003e58\u003c/span\u003e Only one aggravating factor is needed for imposition of the death penalty unless the person charged is found to be mentally retarded. \u003cspan class=\"fnref\"\u003e59\u003c/span\u003e There is absolutely no suggestion in the record that Appellant was retarded. He has tested in the gifted intelligence range (an I.Q. of 144). The aggravating factors found by the jury in this case sufficiently support our Conclusion that Appellant's sentence of death is not disproportionate when compared to other cases in which the death penalty was imposed. \u003cspan class=\"fnref\"\u003e60\u003c/span\u003e\n\n(3) Criminal History\n\nAppellant's death sentence is not disproportionate when his criminal history is considered. His record includes prior convictions for (1) assault with a deadly weapon, (2) grand theft, (3) attempted assault in the first degree, (4) assault in the second degree, (5) attempted murder in the first degree, (6) aggravated mayhem, (7) torture, (8) false imprisonment, and (9) robbery in the first degree. \u003cspan class=\"fnref\"\u003e61\u003c/span\u003e His criminal record shows a history of violence towards others. His criminal history is comparatively more extensive than that of other appellants who received the death penalty. \u003cspan class=\"fnref\"\u003e62\u003c/span\u003e\n\n(4) Personal History\n\nThe subjective factors in Appellant's personal history are not sufficient to override the circumstances and consequences of his crime. \"The role of mitigation evidence is to reduce culpability for a crime that has already been proved.\" \u003cspan class=\"fnref\"\u003e63\u003c/span\u003e Appellant's mitigation evidence ranged from testimony about his troubled and sometimes abusive family life to medical testimony concerning his diagnosed personality disorders. \u003cspan class=\"fnref\"\u003e64\u003c/span\u003e Although commonly asserted, a history of abuse as a child seldom affects the outcome of aggravated first degree murder cases. \u003cspan class=\"fnref\"\u003e65\u003c/span\u003e Also, we have upheld death sentences imposed on appellants with medically diagnosed personality disorders similar to, or more severe than, Appellant's. \u003cspan class=\"fnref\"\u003e66\u003c/span\u003e\n\nConclusion on Proportionality\n\nAppellant's death sentence is not disproportionate to sentences imposed in similar cases. The factors employed by this court in considering both the \"crime and the defendant\" justify our Conclusion that Appellant Brown's case is sufficiently similar to other cases in which the death penalty has been imposed and upheld on appeal. The nature of his crime is as brutal and heinous as any considered by this court. His criminal history is extensive and shows a pattern of violence towards others. The jury found numerous aggravating factors in convicting him of aggravated first degree murder. His mitigating evidence was doubtless not sufficient to convince the jury that he merited leniency, the consequence being that he would be sentenced to death. Under these circumstances, we conclude the death sentence imposed upon Appellant Brown was not disproportionate to the crime committed and that it was not wantonly and freakishly imposed.\n\nPassion or Prejudice\n\nAppellant Brown presents no independent argument that his sentence was the result of passion or prejudice. He claims only \"the jury was not properly advised of the 'crime' it was asked to weigh against the mitigating factors,\" and that the jury was not instructed \"that the deterrence of others, the cost of incarceration, and the purely emotional response to . . . the heinousness of the crime or the evil of the defendant should not be part of the weighing process.\" \u003cspan class=\"fnref\"\u003e67\u003c/span\u003e From this Appellant somehow concludes the jury based its sentence upon an unfavorable emotional response to him and not upon reason. \u003cspan class=\"fnref\"\u003e68\u003c/span\u003e There is no evidence in the record to support that claim. We therefore conclude the jury's verdict in the sentencing phase was not based upon passion or prejudice.\n\nMental Retardation\n\nRCW 10.95.030(2) proscribes imposition of capital punishment upon persons who were mentally retarded at the time they committed the crimes for which they are being sentenced. To be considered \"mentally retarded\" under the statute a person must have, among other things, \"significantly subaverage general intellectual functioning,\" which is defined as achieving an I.Q. of 70 or below. \u003cspan class=\"fnref\"\u003e69\u003c/span\u003e Appellant does not claim he is mentally retarded. Nor is there even the slightest evidence to support such a claim. To the contrary, the record shows he had a measured I.Q. of 144 in the seventh or eighth grade, placing him at a gifted level of intelligence. \u003cspan class=\"fnref\"\u003e70\u003c/span\u003e\n\nProsecutorial Misconduct\n\n(3) Whether statements made by prosecuting attorneys during the guilt and penalty phases of the trial constituted prosecutorial misconduct which denied Appellant a fair trial.\n\nAppellant claims the prosecuting attorney engaged in prosecutorial misconduct which deprived him of a fair trial. He cites instances in which he claims the prosecutor made personal or emotional appeals to the jury. Where prosecutorial misconduct is claimed, the defense bears the burden of establishing the impropriety of the prosecuting attorney's comments and their prejudicial effect. \u003cspan class=\"fnref\"\u003e71\u003c/span\u003e To establish prejudice, the defense must demonstrate there is a substantial likelihood the misconduct affected the jury's verdict. \u003cspan class=\"fnref\"\u003e72\u003c/span\u003e A prosecuting attorney's allegedly improper remarks must be reviewed in the context of the total argument, the issues in the case, the evidence addressed in the argument, and the instructions given to the jury. \u003cspan class=\"fnref\"\u003e73\u003c/span\u003e Failure to object to an improper comment constitutes waiver of error unless the comment is so flagrant and ill-intentioned that it causes an enduring and resulting prejudice that could not have been neutralized by a curative instruction to the jury. \u003cspan class=\"fnref\"\u003e74\u003c/span\u003e \"Reversal is not required if the error could have been obviated by a curative instruction which the defense did not request.\" \u003cspan class=\"fnref\"\u003e75\u003c/span\u003e\n\nOpening Statement (Guilt Phase)\n\nAppellant first complains of two statements made by the prosecuting attorney during the State's opening statement in the guilt phase of the trial. In suggesting the jury could come to know the deceased Ms. Holly C. Washa only through the testimony of witnesses, the prosecutor stated:\n\nI've sort of lived with Holly [Washa] over the last two years or so preparing for this case, and perhaps I've personalized her a little bit. Maybe by the time this trial is over, you will know enough about her that maybe you'll personalize her a little bit. The one thing I do hope though is that Justice can be done by the end of this trial and we can put Holly [Washa] to rest. The defense did not object to this statement.\n\nNear Conclusion of the State's opening statement, the prosecutor stated:\n\nI want to assure you at the end of this case you're not going to look at me and say, \"Did he do it?\" I suggest you're going to look at me and you're going to say, \"How could he have done it?\" And, you know, that's one question that I won't be able to answer for you. I don't have to answer it for you. I can't imagine how any person could have done this to Holly Washa or to any other living human being. How could he have done it? The defense did not object to this comment.\n\nUpon Conclusion of its opening statement, the defense moved for a mistrial based upon the prosecuting attorney's personalized and emotional appeal to the jury in his opening statement. The defense in the alternative requested a remedial instruction to the jury. The trial court denied the motion for mistrial, but did instruct the jury that \"counsels' opinions, statements, whatever else they say in openings are certainly not evidence.\"\n\nDenial of a motion for mistrial for alleged prosecutorial misconduct lies within the sound discretion of the trial court. \u003cspan class=\"fnref\"\u003e76\u003c/span\u003e This court will not disturb that decision absent an abuse of discretion. \u003cspan class=\"fnref\"\u003e77\u003c/span\u003e Here, the trial court did not abuse its discretion because the prosecutor's statements were not improper. Even assuming they might have been improper, there was no prejudice to Appellant. Besides, the court timely instructed the jury it was not to consider counsel's opinions or statements as evidence.\n\nAppellant has not sustained his burden of establishing that either of the statements were improper. The first statement was introductory in nature and focused on the prosecutor's preparation for trial. The second statement merely informed the jury what the state's evidence was expected to show. There is no indication either statement was made to elicit an emotional response from the jury. Neither was improper.\n\nAssuming the two statements might have been improper, Appellant has not established he was prejudiced by either of them. The context in which they were made demonstrates that Appellant suffered no prejudice which would have affected the jury's verdict. The trial court properly instructed the jury that remarks by counsel in opening statements were not evidence. In fact, the defense made similar remarks in its opening statement. Defense counsel told the jury that \"like the [prosecution] has personalized this case for a couple of years with Holly Washa, we have done so with Mr. Brown . . . .\" Defense counsel also stated in the jury's presence that Appellant's killing of Ms. Washa was \"incredibly horrible, brutal and bizarre\" and asked the jury how any person could be so \"twisted, so full of bottled up rage to commit this type of crime.\" Appellant now claims error by the State for less provocative statements than those made by his own counsel in opening statement. This weakens the claim the remarks of the prosecutor were prejudicial and resulted in denial of a fair trial for Appellant. \u003cspan class=\"fnref\"\u003e78\u003c/span\u003e\n\nClosing Argument (Guilt Phase)\n\nAppellant Brown next takes issue with two statements made by the prosecuting attorney during closing argument in the guilt phase of the trial.\n\nThe first statement was made near the beginning of the State's closing argument when the prosecutor referred to Appellant's motive for murdering Ms. Washa: \"He saw Holly Washa as a vehicle for getting cash so that he could get to Susan Schnell.\" The trial court overruled a defense objection.\n\nThe second statement was made later in closing argument when the prosecuting attorney was urging the jury to reject the lesser included offense of murder in the second degree. The prosecutor asked the jury not to \"negotiate\" with Appellant:\n\nThe defendant does not deserve a compromise. You should not negotiate with Cal Brown. You should not even think about negotiating with Cal Brown. Cal Brown didn't allow Holly Washa to negotiate with him. She didn't get to negotiate for her life. She didn't get to negotiate for her money. She didn't get to negotiate for her dignity.\n\nYou should refuse any thought of negotiating with Cal Brown. Defense counsel objected to this statement. The trial court overruled the objection and reminded counsel the jury had been instructed that counsel's statements were argument and not testimony or evidence.\n\nThe defense moved for a mistrial at the Conclusion of the State's closing argument, claiming the prosecutor's statements improperly appealed to the passion or prejudice of the jury. The defense in the alternative requested a curative instruction to the jury. The trial court denied the defense motion and noted, out of the presence of the jury, that \"the argument of counsel [for the prosecution] was within reasonable bounds. The jury has been instructed . . . . They have been told the arguments of counsel are not testimony, not evidence.\"\n\nThe trial court did not abuse its discretion in denying the defense motion for a mistrial. The prosecuting attorney's statements were not improper. \"In closing argument a prosecuting attorney has wide latitude in drawing and expressing reasonable inferences from the evidence.\" \u003cspan class=\"fnref\"\u003e79\u003c/span\u003e Both statements complained of were reasonably supported by evidence admitted in trial. Appellant admitted in his recorded statement to California police officers that he kidnapped Ms. Washa because he was out of money and wanted to rob her so he could go to California. He also admitted he forced her to write and cash checks for him. Under this evidence, it was reasonable for the prosecuting attorney to state in closing argument that Appellant had a financial motive for abducting Ms. Washa. Similarly, there was substantial evidence to support the prosecuting attorney's argument to the jury that the lesser included offense of second degree murder would not be appropriate in Appellant's case. Counsel's description of the lesser included offense as a \"compromise,\" while overly simplistic, did not constitute misconduct. Both statements were fair comments on the evidence. Any prejudicial effect was minimized by the court's instruction to the jury.\n\nRebuttal Closing Argument (Guilt Phase)\n\nUpon completion of the prosecuting attorney's rebuttal closing argument, the defense moved for a mistrial, claiming three instances of misconduct.\n\nThe first instance was when the prosecuting attorney described as \"ludicrous\" the defense claim that Ms. Holly C. Washa had been asleep in Appellant's motel room while he made telephone calls to Ms. Susan J. Schnell and for airline reservations. Defense counsel's objection to this characterization was overruled. The defense made the claim in response to the State's theory that Appellant killed Ms. Washa to prevent her from informing the police of his future plans and whereabouts. The defense argued it was not necessary for Appellant to eliminate Ms. Washa as a witness because she was asleep during the telephone calls and was thus not aware of his plans. The remark by the prosecuting attorney was not improper. \"It is not misconduct . . . for a prosecutor to argue that the evidence does not support the defense theory.\" \u003cspan class=\"fnref\"\u003e80\u003c/span\u003e As an advocate, the prosecuting attorney is entitled to make a fair response to the arguments of defense counsel. \u003cspan class=\"fnref\"\u003e81\u003c/span\u003e The prosecutor's characterization of the defense theory as \"ludicrous\" was reasonable in light of the evidence. Appellant admitted raping and torturing Ms. Washa over a prolonged period of time. It was the prosecution's contention that, under those circumstances, she was not likely asleep while Appellant was anywhere nearby. The use of the word \"ludicrous\" was simply editorial comment by the prosecuting attorney which was a strong, but fair, response to the argument made by the defense.\n\nThe second instance was the prosecuting attorney's characterization of Appellant as one who needs to \"control.\" The evidence at trial supports that characterization. Appellant himself said in his recorded statement that he used torture to gain \"control\" over Ms. Washa. From this evidence alone the prosecuting attorney could reasonably draw and express the inference that Appellant used control to acomplish his purposes. Under these circumstances, use of the word \"control\" was not improper.\n\nThe third instance focuses on the prosecutor's use of transcripts of Appellant's recorded statements to the Palm Springs police officers. Appellant argues it was improper for the prosecuting attorney to read from the transcripts of the tapes during rebuttal because only the tapes, and not the transcripts, were admitted into evidence. This argument is without merit.\n\nThe jury was informed the transcripts were not evidence of Appellant's statements. When the jurors listened to the tapes during trial, they were provided with transcripts to assist them in following the words. They were instructed at that time, however, that the words on the tapes, not the transcripts, were evidence of Appellant's statements, and that any inconsistency between the two should be resolved by reference to their collective memory of the contents of the tapes. They were reminded of this instruction again by the court after a sidebar conference requested by the defense immediately prior to reference to the transcripts by the prosecuting attorney. Under these circumstances, it was not improper for the prosecuting attorney to repeat portions of Appellant's statements by reading from the transcripts. Because the actual tapes were admitted into evidence at trial, as State's Exhibit 89, Appellant was not prejudiced by any reference to portions of his statements during rebuttal since the jury had already heard the tapes. The trial court's denial of the motion did not constitute an abuse of discretion because none of the prosecuting attorney's statements or actions during rebuttal were improper.\n\nClosing Argument (Penalty Phase)\n\nAppellant claims the prosecuting attorney made two statements during closing argument in the penalty phase of the trial which constituted misconduct. The first was near the beginning of the state's closing argument when the prosecuting attorney stated:\n\nThe legislature enacted the death penalty law so that it would be used in the most serious murder cases. So that in cases where the crime calls out for a death sentence, the jury, in its discretion and its common sense and its good judgment, would impose such a sentence. I suggest to you that this crime screams out for the death sentence. (emphasis added).\n\nNear the Conclusion of the prosecutor's rebuttal closing argument, the prosecuting attorney stated:\n\nI talk about reasons why the death penalty is appropriate. And one of the reasons it is appropriate, is just exactly the acts that he [Appellant] carried out, that is one of the reasons it's appropriate.\n\nIf the death penalty is not appropriate in this case, I'd ask you to try to think of a case that it would be appropriate in, considering his acts, considering his evil. (emphasis added).\n\nBecause the defense did not object to either statement, this court will consider any error waived unless either remark was so flagrant and ill-intentioned that it caused an enduring and resulting prejudice that could not have been neutralized by a curative instruction to the jury. \u003cspan class=\"fnref\"\u003e82\u003c/span\u003e Reversal is required only if there is a substantial likelihood either statement affected the jury's verdict. \u003cspan class=\"fnref\"\u003e83\u003c/span\u003e Both statements were supported by the evidence and thus were not improper. Appellant was convicted of committing a brutal murder with several aggravating factors. There was overwhelming evidence to support his conviction. Under these circumstances, the prosecuting attorney had wide latitude to make the argument that the evidence strongly supported imposition of the death penalty. \u003cspan class=\"fnref\"\u003e84\u003c/span\u003e While the words used to make that argument (such as \"screams out\" and \"evil\") may be somewhat dramatic, they do not constitute misconduct warranting reversal in this case.\n\nTestimony of Susan J. Schnell\n\n(4) Whether the trial court erred in admitting the testimony of Ms. Susan J. Schnell, surviving victim in a criminal encounter with Appellant in California.\n\nEvidence Rule 404(b)\n\nAppellant claims the trial court erred in admitting the testimony of Ms. Susan J. Schnell under ER 404(b) in both the guilt and penalty phases of his trial. He argues that the reasons offered by the trial court for admitting the testimony were not adequate and that admission of the evidence violated his double jeopardy rights.\n\nPrior to trial Appellant sought to exclude Ms. Schnell's testimony as inadmissible character evidence under ER 404(b). Acknowledging that the testimony was prejudicial to Appellant, the trial court concluded its probative value substantially outweighed any unfair prejudice. The court ruled the testimony was admissible because it placed in context the crime for which Appellant was charged by describing the \"fabric of events\" or \"res gestae\" surrounding Ms. Holly C. Washa's murder. It also found the testimony was probative of intent, premeditation and the aggravating factors.\n\nAppellant asked the trial court to reconsider its ruling admitting Ms. Schnell's testimony. The court adhered to its prior ruling and reemphasized the testimony was admissible as res gestae evidence and was probative of motive, intent and premeditation. It noted the testimony was also probative of the issue whether Appellant's acts constituted a common scheme or plan. The court again acknowledged the prejudicial nature of the testimony, but concluded its probative value far outweighed any unfair prejudice.\n\nJust before Ms. Schnell testified during the guilt phase of the trial, the court did, however, instruct the jury concerning the limited basis for admitting her testimony. The court stated:\n\nLadies and gentlemen, regarding the evidence you are about to hear, the Court advises you now that you may consider evidence of the defendant's conduct towards Ms. Susan J. Schnell only insofar as it bears on the issues of premeditation, intent and the four aggravating factors charged in the crime against Ms. Washa. You may not consider such evidence for any other purpose. In particular you must not use it to draw a Conclusion about the defendant's character or propensity to commit criminal acts. (emphasis added). \u003cspan class=\"fnref\"\u003e85\u003c/span\u003e Jury Instruction 8, given by the court, was substantially similar to that oral instruction. \u003cspan class=\"fnref\"\u003e86\u003c/span\u003e ER 404(b) provides:\n\nEvidence of other crimes, wrongs, or acts is not admissible to prove the character of a person in order to show action in conformity therewith. It may, however, be admissible for other purposes, such as proof of motive, opportunity, intent, preparation, plan, knowledge, identity, or absence of mistake or accident.\n\nUnder Evidence Rule 404(b) evidence of other misconduct is not admissible to show a defendant is a \"criminal type.\" \u003cspan class=\"fnref\"\u003e87\u003c/span\u003e However, crimes or misconduct other than the acts for which a defendant is charged may be admitted for other reasons. \u003cspan class=\"fnref\"\u003e88\u003c/span\u003e In addition to the non-exhaustive list of exceptions identified in Rule 404(b) itself, this court has recognized a res gestae or \"same transaction\" exception to the rule. \u003cspan class=\"fnref\"\u003e89\u003c/span\u003e Under this exception, evidence of other crimes or misconduct is admissible to complete the story of the crime by establishing the immediate time and place of its occurrence. \u003cspan class=\"fnref\"\u003e90\u003c/span\u003e Where another offense constitutes a \"link in the chain\" of an unbroken sequence of events surrounding the charged offense, evidence of that offense is admissible \"in order that a complete picture be depicted for the jury.\" \u003cspan class=\"fnref\"\u003e91\u003c/span\u003e Additionally, the rule itself allows evidence of other misconduct to establish motive, opportunity, intent, preparation, plan, knowledge, identity, or absence of mistake or accident. \u003cspan class=\"fnref\"\u003e92\u003c/span\u003e To admit evidence of other crimes or misconduct under ER 404(b), the trial court must identify on the record the purpose for which it is admitted. \u003cspan class=\"fnref\"\u003e93\u003c/span\u003e Even if otherwise admissible for a valid purpose, Rule 404(b) evidence still must be relevant to a material issue and its probative value must outweigh its prejudicial effect. \u003cspan class=\"fnref\"\u003e94\u003c/span\u003e Evidence is relevant if it makes the existence of a consequential fact more or less probable. \u003cspan class=\"fnref\"\u003e95\u003c/span\u003e The trial court must also find by a preponderance of the evidence that the claimed misconduct occurred. \u003cspan class=\"fnref\"\u003e96\u003c/span\u003e The decision to admit evidence of other crimes or misconduct lies within the sound discretion of the trial court \u003cspan class=\"fnref\"\u003e97\u003c/span\u003e and will not be disturbed on appeal absent an abuse of discretion. \u003cspan class=\"fnref\"\u003e98\u003c/span\u003e There is an abuse of discretion when the trial court's decision is manifestly unreasonable or based upon untenable grounds or reasons. \u003cspan class=\"fnref\"\u003e99\u003c/span\u003e On December 6, 1993, Ms. Susan J. Schnell testified on direct examination concerning the circumstances leading to her encounter with Appellant. She related how she and Appellant first met and eventually made plans to spend Memorial Day weekend together in Palm Springs. She testified about Appellant's assault upon her in the hotel in Palm Springs:\n\nSuddenly during the back rub he jerked my arm behind my back very fast in a brutal way. My arms were jerked. As he was jerking my arms back, he said, \"Don't scream.\" And at that point I did scream. And when I did scream, he slit my throat. \u003cspan class=\"fnref\"\u003e100\u003c/span\u003e Ms. Schnell also testified about Appellant's sexual assault upon her:\n\nA. After the bandages, he had me sideways on the bed.\n\nAnd he was tying my legs with panty hose and turned different parts of the, would move the handcuffs from my hands to my feet and change the . . . place, change the restraints.\n\nQ. Did the defendant do anything more after that?\n\nA. He did sexually assault me.\n\nQ. Is this something that is difficult to talk about?\n\nA. Yes. It is difficult to talk about.\n\nQ. Would you tell the jury the nature of the sexual assault?\n\nA. He shaved my hair off.\n\nQ. He shaved the hair located, where?\n\nA. My pubic hair. And had intercourse with me and asked me to perform oral sex on him. \u003cspan class=\"fnref\"\u003e101\u003c/span\u003e There was testimony from Ms. Schnell that, following the sexual assault, Appellant forced her to write several checks to him upon her account. She recalled that he rejected the first two checks because she had not matched to his satisfaction her signature on the checks with the signature on her driver's license. \u003cspan class=\"fnref\"\u003e102\u003c/span\u003e On cross examination, Ms. Schnell testified that, prior to Appellant's initial assault upon her, they engaged in some consensual sex. She stated they kissed and fondled each other, and that Appellant performed oral sex on her. \u003cspan class=\"fnref\"\u003e103\u003c/span\u003e There was no abuse of discretion in admitting the testimony of Ms. Susan J. Schnell. The trial court identified on the record the reasons for its admission under ER 404(b). The testimony was relevant to material issues in the case relating to premeditation, intent, and the four aggravating factors. It also qualified as res gestae evidence because it provided the jury with a more complete picture of events surrounding the crimes committed against Ms. Holly C. Washa. The trial court properly weighed the probative value of the testimony against its prejudicial effect and concluded its probative value substantially outweighed its prejudicial effect.\n\nAdmission of the testimony of Ms. Schnell was proper under ER 404(b) because it was probative of Appellant's motive, intent, preparation and plan to kidnap, rob, and murder Ms. Holly C. Washa. It was the State's theory at trial that Appellant used Ms. Washa to finance his trip to join Ms. Susan J. Schnell in California. He was in contact with Ms. Schnell while he held Ms. Washa captive. Evidence of his encounter with Ms. Schnell supported the State's theory. That evidence also supported the State's argument that Appellant intended and premeditated Ms. Washa's killing to conceal his crimes so he could go to California to meet Ms. Schnell. Evidence that Appellant slit the throats of two captive women in two days tended to rebut his contention that his killing of Ms. Washa was merely an impulsive \"spur of the moment\" act.\n\nThe testimony of Ms. Schnell was similarly probative on the issue of Appellant's rape of Ms. Washa. Appellant contended at trial that the sexual contact between him and Ms. Washa was consensual. Ms. Washa was dead and not available to relate the true facts. Evidence of a sexual assault against Ms. Schnell would tend to rebut Appellant's contention. Just two days after his assault upon Ms. Washa, Appellant sexually assaulted Ms. Schnell in a markedly similar manner. Both women were bound with the same pair of handcuffs, gagged, and had their pubic hair shaved by Appellant before he raped them. Because of these similarities, evidence of the attack on Ms. Schnell made it more probable that the sexual contact between Appellant and Ms. Washa was by forcible compulsion, and less probable that it was consensual.\n\nAlthough Appellant was not actually convicted of sexually assaulting Ms. Schnell in California, her testimony concerning the entire incident was supported by a preponderance of the evidence. Appellant pleaded \"guilty\" in California to the crimes of attempted murder in the first degree, aggravated mayhem, torture, robbery in the first degree, and false imprisonment with Ms. Schnell as his victim. \u003cspan class=\"fnref\"\u003e104\u003c/span\u003e This satisfies the preponderance of the evidence standard with respect to those crimes. Ms. Schnell's testimony concerning her sexual encounter with Appellant satisfies this standard as well. Her description of the assault upon her was consistent with the sexual assault upon Ms. Holly C. Washa. Although she testified she and Appellant earlier engaged in some consensual sexual activity, that activity occurred prior to Appellant's assault upon her. After having her throat cut, her pubic hair shaved, and being bound and gagged by Appellant, it is not reasonable to believe she consented to any further sexual activity with him. Under these circumstances, her testimony concerning the sexual assault was sufficient to satisfy the preponderance of the evidence standard.\n\nThe testimony of Ms. Schnell was also admissible as res gestae evidence because the crimes against Ms. Washa and against her were linked in significant ways. Appellant's kidnapping, assault and robbery of Ms. Schnell was similar to the crimes he committed against Ms. Washa. Appellant sexually assaulted both women in a similar manner. He forced both women to write checks to him upon their respective bank accounts. He also used the same weapon to threaten both women into submission and to slit their throats. From this we can reasonably conclude that Appellant was engaged in an ongoing criminal enterprise of restraining, raping, robbing, and assaulting Ms. Washa and Ms. Schnell. Additionally, while Appellant was committing the crimes against Ms. Washa in Washington, he was also contacting Ms. Schnell to finalize his plans to meet her in California. He admitted to Palm Springs police officers that he kidnapped, assaulted, robbed and abused Ms. Washa because he needed money to get back to California, where he ultimately met Ms. Schnell and embarked on a similar pattern of criminal behavior. The events in California culminated a sequence of events which began in Washington with the crimes involving Ms. Holly C. Washa as victim. Under these circumstances, the jury was entitled to know about the events in Palm Springs with Ms. Schnell as victim in order to have a more complete picture of the circumstances surrounding Ms. Washa's death.\n\nAppellant argues that Ms. Schnell's testimony did not qualify as res gestae evidence because he committed the crimes against her more than two days after he committed the crimes against Ms. Washa and \"hundreds of miles away in another state.\" This argument is without merit for two reasons. First, Rule 404(b) applies to evidence of other crimes or misconduct regardless whether they occurred before or after the conduct for which a defendant is currently charged. \u003cspan class=\"fnref\"\u003e105\u003c/span\u003e Second, while res gestae evidence is, as Appellant argues, restricted to proving the immediate context within which a charged crime took place, \u003cspan class=\"fnref\"\u003e106\u003c/span\u003e geographical distance and the passage of two days between these two similar and connected crimes do not defeat immediacy of context in this case. \u003cspan class=\"fnref\"\u003e107\u003c/span\u003e Appellant claims that even if the evidence of his crimes against Ms. Susan J. Schnell was admissible for a valid purpose, it was too prejudicial to be admitted. He concludes that because it was admitted, he is now entitled to a new trial. This claim, too, is without merit. The trial court considered the prejudicial nature of Ms. Schnell's testimony and determined its probative value outweighed that prejudice. As a cautionary measure, the court gave the jury limiting instructions which explained that the testimony was not to be considered as character or propensity evidence.\n\nDouble Jeopardy\n\nAppellant maintains that permitting the jury to hear Ms. Schnell's testimony placed him twice in jeopardy for the same offense in violation of the state and federal constitutions.\n\nThere is no violation of double jeopardy in this case. A defendant is subjected to multiple prosecutions for the same offense in violation of double jeopardy when (1) the charged offenses have identical statutory elements or one is a lesser included offense of the other, and (2) conduct constituting an offense for which the defendant has already been prosecuted will be used to establish an essential element of an offense charged in a subsequent prosecution. \u003cspan class=\"fnref\"\u003e108\u003c/span\u003e Appellant does not minimally satisfy this double jeopardy test because he was not prosecuted in Washington for the same conduct for which he was prosecuted in California. In California he was charged with and pleaded \"guilty\" to attempted murder in the first degree, aggravated mayhem, torture, robbery in the first degree and false imprisonment, with Ms. Susan J. Schnell as his victim. In this case, he was prosecuted for the crimes he committed in the state of Washington with Ms. Holly C. Washa as his victim. \u003cspan class=\"fnref\"\u003e109\u003c/span\u003e\n\nTestimony of Jan M. Gray and Brieanna C. West\n\n(5) Whether the trial court erred in admitting the testimony of Ms. Jan M. Gray and Ms. Brieanna C. West, who had noncriminal encounters with Appellant in California and Washington.\n\nAppellant argues that the trial court abused its discretion and committed reversible error by admitting the testimony of Ms. Jan M. Gray and Ms. Brieanna C. West during the guilt phase of his trial. He claims the court did not identify the relevance of this evidence and also did not balance its probative value against its prejudicial effect as required by ER 404(b).\n\nDuring the trial the defense moved to exclude Ms. West's and Ms. Gray's testimony as irrelevant. It also argued their testimony was prejudicial because it might lead the jury to conclude Appellant was stalking Ms. West as another potential victim. \u003cspan class=\"fnref\"\u003e110\u003c/span\u003e The court concluded the testimony of Ms. West and Ms. Gray did not constitute ER 404(b) character evidence because Appellant's contact with both women involved no crime or misconduct. \u003cspan class=\"fnref\"\u003e111\u003c/span\u003e It also stated that:\n\nThe State will not be allowed to argue that Ms. West or Ms. Gray were other potential victims that were simply waiting to happen . . . but I think that all of this information goes to setting the ground work, setting the scene . . . in front of the jury so that they can look at all the evidence before having to make the very difficult decisions in this case. \u003cspan class=\"fnref\"\u003e112\u003c/span\u003e Following the testimony of both Ms. West and Ms. Gray, the court orally instructed the jury there was no indication or allegation that Appellant intended to harm either of the two women. The court also instructed the jury that the testimony was presented \"simply to place Mr. Brown's actions and activities in some sort of logical context. You are not to consider the testimony for any other reason.\" \u003cspan class=\"fnref\"\u003e113\u003c/span\u003e The jury was similarly instructed at the Conclusion of the guilt phase of the trial. \u003cspan class=\"fnref\"\u003e114\u003c/span\u003e The admission of evidence lies within the sound discretion of the trial court and will not be reversed on appeal absent an abuse of discretion. \u003cspan class=\"fnref\"\u003e115\u003c/span\u003e The trial court did not abuse its discretion in allowing the testimony of Ms. Gray and Ms. West. The testimony was relevant because it established background information on Appellant's trip to Seattle where he committed the crimes in this case. He was not prejudiced by the testimony of Ms. Gray and Ms. West because his contact with both women involved no crime or misconduct. Thus, it did not come within the purview of ER 404(b). \u003cspan class=\"fnref\"\u003e116\u003c/span\u003e Any possibility the jury might have speculated that Appellant was stalking Ms. West or Ms. Gray was obviated by the trial court's limiting instructions. \u003cspan class=\"fnref\"\u003e117\u003c/span\u003e\n\nMiranda Rights\n\n(6) Whether Appellant was adequately advised of his Miranda rights before making statements to Palm Springs, California police detectives.\n\nAppellant contends he was not adequately advised of his Miranda rights by the Palm Springs police before making his recorded statements and that those statements therefore should have been suppressed. He claims the warnings required under Miranda v. Arizona were inadequate because they did not explicitly inform him of his right to speak with an attorney before questioning. \u003cspan class=\"fnref\"\u003e118\u003c/span\u003e Although Appellant's trial counsel did not move to suppress his statements to the Palm Springs police at trial on the grounds of inadequate advisement of Miranda rights, Appellant may nevertheless raise this issue for the first time on appeal. \u003cspan class=\"fnref\"\u003e119\u003c/span\u003e On May 27, 1991, Appellant was questioned for the first time by Palm Springs police detectives. One of the detectives informed Appellant of his rights before questioning began:\n\nDetective: Basically, you have the right to remain silent. Anything you say can and may be used against you in court. You have the right to an attorney and have him present while you're being questioned, and if you can't afford one, one will be appointed for you by the court.\n\nAppellant: All right.\n\nDetective: Okay, having those rights, all of those rights . . . .\n\nAppellant: Okay.\n\nDetective: Are you willing to talk?\n\nAppellant: I'm willing to talk.\n\nDetective: Are you willing to talk with us Cal?\n\nAppellant: Okay. (emphasis added). \u003cspan class=\"fnref\"\u003e120\u003c/span\u003e Later that day, the Palm Springs detectives conducted another interview with Appellant, at the beginning of which he was again advised of his rights:\n\nDetective: I want to make sure that I've advised you of your rights on their case [King County's] too. You have the right to remain silent. Anything you say can and may be used against you in court.\n\nDetective: You have the right to an attorney and to have him present when you're being questioned. If you cannot afford one, one will be appointed for you.\n\nDetective: Do you understand those rights?\n\nAppellant: I understand those rights. (emphasis added). \u003cspan class=\"fnref\"\u003e121\u003c/span\u003e On May 28, 1991, the detectives spoke with Appellant at his request and he was again advised of his rights:\n\nDetective: Okay. Cal, we're here because you asked us to come in and before we talk to you, I go over your rights every time.\n\nAppellant: Okay.\n\nDetective: You have the right to remain silent.\n\nAnything you say can and may be used against you in court. You have the right to an attorney and to have him present when you're being questioned.\n\nIf you cannot afford an attorney, one will be appointed for you if you desire.\n\nAppellant: Right.\n\nDetective: Do you understand those rights?\n\nAppellant: Right. (emphasis added). \u003cspan class=\"fnref\"\u003e122\u003c/span\u003e Under Miranda, a suspect in custody \"must be warned prior to any questioning that he has the right to remain silent, that anything he says can be used against him in a court of law, that he has the right to the presence of an attorney, and that if he cannot afford an attorney one will be appointed for him prior to any questioning if he so desires.\" \u003cspan class=\"fnref\"\u003e123\u003c/span\u003e The right to the presence of an attorney includes the right to consultation with counsel both before and during questioning. \u003cspan class=\"fnref\"\u003e124\u003c/span\u003e Violation of any of the Miranda requirements results in exclusion of any statements given by the suspect. \u003cspan class=\"fnref\"\u003e125\u003c/span\u003e However, there is no requirement that the warnings be given in the precise language stated in Miranda. No \"talismanic incantation\" is required. \u003cspan class=\"fnref\"\u003e126\u003c/span\u003e \"Reviewing courts . . . need not examine Miranda warnings as if construing a will or defining the terms of an easement.\" \u003cspan class=\"fnref\"\u003e127\u003c/span\u003e The question is whether the warnings reasonably and effectively conveyed to a suspect his rights as required by Miranda. \u003cspan class=\"fnref\"\u003e128\u003c/span\u003e The case of People of the Territory of Guam v. Snaer is on point. There, the United States Court of Appeals for the Ninth Circuit held this warning was adequate under Miranda: \"You have a right to consult with a lawyer and to have a lawyer present with you while you are being questioned.\" \u003cspan class=\"fnref\"\u003e129\u003c/span\u003e The defendant in that case argued, as Appellant does here, that his Miranda warnings were inadequate because he had not been specifically advised he had a right to consult with an attorney before being questioned. \u003cspan class=\"fnref\"\u003e130\u003c/span\u003e The court rejected that claim and concluded the first part of the warning, when read with the latter part, adequately conveyed notice of the right to consult with counsel before questioning. \u003cspan class=\"fnref\"\u003e131\u003c/span\u003e In reaching that Conclusion, the court noted that \"if a defendant has been told the substance of his constitutional rights, it is not fatal if irrelevant words or words with no independent substance are omitted.\" \u003cspan class=\"fnref\"\u003e132\u003c/span\u003e As with the warnings at issue in Snaer, the Miranda warnings given Appellant by Palm Springs detectives adequately advised him of his constitutional rights. Prior to each of his three interviews with the detectives, Appellant was warned (1) that he had the right to an attorney and (2) that he had the right to have that attorney present during questioning. When read with the latter portion of that statement, the first part adequately advised Appellant he had the right to consult with counsel before questioning. Although the actual words \"before questioning\" were not included in the first part of the statement, the second part which read \"and to have him present when you're being questioned\" made that point sufficiently clear. \u003cspan class=\"fnref\"\u003e133\u003c/span\u003e\n\nRecording of Appellant's Custodial Statements and RCW 9.73.090\n\n(7) Whether Appellant's statements to Palm Springs, California police, which were recorded without his knowledge as permitted by Califonia law, violated Washington's Privacy Act, RCW 9.73 et seq., and thus were inadmissible in Washington courts.\n\nAppellant claims his recorded statements should have been suppressed because they violated either or both RCW 9.73.030 and .090(1)(b)(i) and because the Palm Springs, California police officers were agents of the King County Police Department.\n\nWashington's Privacy Act, RCW 9.73 et seq., is designed primarily to protect private persons from public dissemination of illegally obtained information. \u003cspan class=\"fnref\"\u003e134\u003c/span\u003e This Court has concluded that \"RCW 9.73.090 is specifically aimed at the specialized activity of police taking recorded statements from arrested persons, as distinguished from the general public.\" \u003cspan class=\"fnref\"\u003e135\u003c/span\u003e In State v. Rupe, this Court again confirmed that \"RCW 9.73.090, unlike RCW 9.73.030, applies specifically to individuals who have been arrested.\" \u003cspan class=\"fnref\"\u003e136\u003c/span\u003e Appellant made his statements to Palm Springs police officers after his arrest. Thus RCW 9.73.090, and not RCW 9.73.030, initially would be applicable in this case. \u003cspan class=\"fnref\"\u003e137\u003c/span\u003e RCW 9.73.090(1) provides in pertinent part:\n\n(1) The provisions of RCW 9.73.030 through 9.73.080 shall not apply to police, fire, emergency medical service, emergency communication center, and poison center personnel in the following instances:\n\n(b) Video and/or sound recordings may be made of arrested persons by police officers responsible for making arrests or holding persons in custody before their first appearance in court. Such video and/or sound recordings shall conform strictly to the following:\n\n(i) The arrested person shall be informed that such recording is being made and the statement so informing him shall be included in the recording;\n\n(ii) The recording shall commence with an indication of the time of the beginning thereof and terminate with an indication of the time thereof;\n\n(iii) At the commencement of the recording the arrested person shall be fully informed of his constitutional rights, and such statements informing him shall be included in the recording;\n\n(iv) The recordings shall only be used for valid police or court activities.\n\nThe Palm Springs police officers recorded Appellant's statements. This is standard practice for Palm Springs police in serious felony cases. \u003cspan class=\"fnref\"\u003e138\u003c/span\u003e But they did not inform Appellant of the recording. It is not disputed that they could record Appellant's statements without his consent under California law. \u003cspan class=\"fnref\"\u003e139\u003c/span\u003e But if this were done in Washington, it most probably would be in violation of RCW 9.73.090(1)(b). Our concern then becomes whether evidence lawfully obtained by police authorities in California should be suppressed in a criminal case in Washington State if similar action by Washington authorities would be in violation of Washington law.\n\nAppellant claims State v. Gwinner, \u003cspan class=\"fnref\"\u003e140\u003c/span\u003e State v. Mollica \u003cspan class=\"fnref\"\u003e141\u003c/span\u003e and State v. Johnson \u003cspan class=\"fnref\"\u003e142\u003c/span\u003e support the argument that his recorded statements to California police should have been suppressed. Those cases addressed a question similar to this one, that is, whether evidence lawfully obtained by federal agents under federal law is admissible in Washington criminal proceedings when similar action by state authorities would violate the Washington Constitution. Those cases are at least pertinent to the issue in this case.\n\nIn Gwinner, the Court of Appeals, Division One, adopted the principle that evidence independently obtained by federal officers in compliance with federal law, but in violation of state constitutional guarantees, is admissible in Washington state criminal proceedings. \u003cspan class=\"fnref\"\u003e143\u003c/span\u003e In that case a Washington detective telephoned a federal officer with information on the defendant, who was suspected of carrying drugs. Federal officers arrested the defendant as he was walking to his automobile. They also conducted a warrantless search of his vehicle, permissible under federal law but impermissible under Washington Constitution article I, sec. 7. The search yielded cocaine, the evidence defendant sought to suppress. In determining the evidence was admissible, the court in Gwinner looked to State v. Mollica, \u003cspan class=\"fnref\"\u003e144\u003c/span\u003e a New Jersey case which addressed the same question.\n\nThe court in Mollica traced the history of the \"silver platter\" doctrine, which developed when federal standards for searches and seizures were more protective than many state standards. \u003cspan class=\"fnref\"\u003e145\u003c/span\u003e Because of the different standards, federal courts adopted the principle that any evidence independently obtained by state officials could be given to federal officials on a \"silver platter.\" \u003cspan class=\"fnref\"\u003e146\u003c/span\u003e The court concluded that under federalism principles, state constitutions do not dictate federal action, \u003cspan class=\"fnref\"\u003e147\u003c/span\u003e and no legitimate state interests would be furthered by forbidding transfer of criminal evidence from federal to state authorities when the evidence was lawfully obtained by the former. \u003cspan class=\"fnref\"\u003e148\u003c/span\u003e Employing the \"silver platter\" doctrine, the court thus determined such evidence need not be suppressed if the federal officers acted without the assistance or cooperation of the state officers. \u003cspan class=\"fnref\"\u003e149\u003c/span\u003e The \"key element of the silver platter doctrine requires that the officers of the federal jurisdiction not act as agents of the forum state jurisdiction nor under color of state law.\" \u003cspan class=\"fnref\"\u003e150\u003c/span\u003e To determine whether the federal authorities are acting in such a manner, the courts consider, among other things:\n\nAntecedent mutual planning, joint operations, cooperative investigations, or mutual assistance between federal and state officers may sufficiently establish agency and serve to bring the conduct of the federal agents under the color of state law. On the other hand, mere contact, awareness of ongoing investigations or the exchange of information may not transmute the relationship into one of agency. \u003cspan class=\"fnref\"\u003e151\u003c/span\u003e The court in Gwinner found the contact between the Washington detective and the federal agents to be a mere \"transfer of information by telephone.\" \u003cspan class=\"fnref\"\u003e152\u003c/span\u003e There was no evidence that the detective requested the federal officers to search the defendant's car or that the detective knew beforehand they would do it. The court held no agency relationship existed between the federal officers and the state. Thus the conduct of the federal officers was not under color of state law and the evidence was not suppressed.\n\nIn Johnson, the Court of Appeals, Division Two, reached a different Conclusion than Gwinner on the same question because the federal authorities did not independently obtain the evidence at issue. In Johnson, state and federal officers worked together in investigating and arresting the defendants, a Washington couple. The court found numerous contacts between the state and federal authorities: (1) a Washington detective went with federal officers to investigate the defendants' property; (2) the detective helped federal officers verify information; (3) state authorities took pictures of the defendants' property at the request of federal authorities and gave the photographs to them; (4) both state and federal authorities executed the warrant to search defendants' property; (5) evidence seized from the defendants' property was turned over to the state; and (6) the husband was turned over to the state of Washington after his arrest. The court concluded the federal authorities acted with the \"cooperation and assistance\" of state authorities and this conduct triggered state constitutional protection. \u003cspan class=\"fnref\"\u003e153\u003c/span\u003e The reasoning of Gwinner, Mollica and Johnson leads to the preliminary Conclusion that whether Appellant's recorded confessions should be suppressed depends upon the answer to the question whether the Palm Springs police were \"agents\" of this state, as defined under those cases, or whether the Palm Springs police merely acted with the \"cooperation and assistance\" of King County police, as interpreted in Johnson.\n\nThe Palm Springs police arrested Appellant and questioned him concerning events surrounding the injuries to Ms. Susan J. Schnell in California. During the initial interview, Appellant asked the officers to tell the King County police to come and talk with him. He articulately and unhesitatingly described in great detail the events surrounding Ms. Holly C. Washa's death and told them her body would be found in the trunk of a 1985 Oldsmobile parked in space 266 at the Budget Parking lot next to Shumsky's Restaurant near the Seattle-Tacoma Airport. After the interview, the officers contacted the King County Police and told them about the information Appellant had given. After locating the 1985 Oldsmobile as Appellant directed and finding Ms. Washa's body in the trunk, the King County police contacted the Palm Springs Police Department and asked them to get a statement from Appellant. The Palm Springs police told Appellant about the King County police request and asked if he was willing to give a statement. Appellant explained what he would say and then told them \"Okay, you can let them know that I'm willing to cooperate up there . . . .\" \u003cspan class=\"fnref\"\u003e154\u003c/span\u003e The State correctly points out that the facts here are more similar to Gwinner than to Johnson. In Gwinner, the Washington state detective merely contacted the federal officers with information about the defendant. The detective did not ask them to search the defendant's automobile and did not know beforehand they would conduct the search. In this case, the State simply telephoned Palms Springs police and asked them to get a statement from Appellant. The King County police did not tell the Palm Springs police what to ask or how to conduct the interview. Nor did they know the Palm Springs police would record Appellant's statements.\n\nAppellant contends the Palm Springs police were \"cooperating and assisting\" King County police by questioning him about the Washington incidents. But the pertinent question is whether King County police cooperated with and helped Palm Springs police so extensively that the latter did not \"independently\" obtain Appellant's statements. When compared to Johnson, the facts here do not support a Conclusion that King County police were \"cooperating [with] and assisting\" the Palm Springs police. The King County police merely telephoned Palm Springs police and asked them to question Appellant. Unlike in Johnson, in this case there was no collaborative effort between the two police departments in obtaining statements from Appellant.\n\nAppellant's argument that his recorded statements should have been suppressed under Gwinner, Johnson and Mollica is thus not convincing. \u003cspan class=\"fnref\"\u003e155\u003c/span\u003e The Palm Springs police lawfully and independently recorded the statements under California law. Those statements were therefore admissible at trial, even though similar action in Washington might have been in violation of RCW 9.73.090(1)(b).\n\nAppellant does not identify any state interest to be advanced by suppressing the recorded statements. No Washington state officer violated RCW 9.73 and no one's privacy interests protected by the statute were infringed. As suggested by the State, suppression of the statements would serve only to keep highly probative and lawfully obtained evidence from the jury.\n\nThe State asks this Court to adopt and affirm the reasoning of State v. Mayes \u003cspan class=\"fnref\"\u003e156\u003c/span\u003e in resolving the question whether evidence lawfully obtained in another state should be admissible in Washington state, even if similar action by officers in this state would violate Washington law. In Mayes the Court of Appeals, Division Two, concluded the Privacy Act, RCW 9.73, did not apply to evidence obtained by police officers of another state within that state and according to its laws. Mayes acknowledged that \"Washington has no criminal jurisdiction over actions having no effect in this state.\" \u003cspan class=\"fnref\"\u003e157\u003c/span\u003e In State v. Williams this court noted the Mayes decision was based upon the doctrine that \"a state legislature's enactment of a privacy statute creates a privacy expectation only for individuals who are within the borders of that state.\" \u003cspan class=\"fnref\"\u003e158\u003c/span\u003e Other jurisdictions have reached the same Conclusion. \u003cspan class=\"fnref\"\u003e159\u003c/span\u003e However, the court noted in Williams it had not yet addressed the validity of that doctrine. \u003cspan class=\"fnref\"\u003e160\u003c/span\u003e This Court in In re Teddington declared the Gwinner decision \"correctly\" held that evidence \"independently and lawfully obtained by federal officers acting pursuant to federal law may be transferred to state authorities for use in a Washington State criminal proceeding.\" \u003cspan class=\"fnref\"\u003e161\u003c/span\u003e We agree with the Conclusion reached in Mayes and rule that RCW 9.73 does not apply to Appellant's statements taken by Palm Springs police and lawfully recorded without his knowledge or consent.\n\nSufficiency of the Record for Appellate Review\n\n(8) Whether there is before this court a record of \"sufficient completeness\" for adequate appellate review of the issues presented in Appellant's appeal.\n\nAppellant argues there is not a record of sufficient completeness for adequate review of his conviction and sentence of death and that therefore he is entitled to a new trial. He takes issue with the absence of a portion of the CrR 3.5 pretrial hearing verbatim report of proceedings involving the July 10, 1992 testimony of one of the Palm Springs detectives who interrogated him. He concludes that because this portion of the record (which addresses his Miranda warnings) is missing, appellate counsel is unable to effectively assign and argue error on appeal, denying him the right to effective assistance of counsel and due process. He also concludes that the missing transcript prevents this court from properly considering his arguments on appeal relating to his Miranda warnings, ER 404(b) evidence, and RCW 9.73. This claim is without merit.\n\nDue Process requires that a record of \"sufficient completeness\" be provided for appellate review of the errors raised by a criminal defendant. \u003cspan class=\"fnref\"\u003e162\u003c/span\u003e RCW 10.95.100 provides that a death sentence must be reviewed by this court \"on the record.\" RAP 9.1(a) provides that the \"record on review\" may consist of (1) a report of proceedings, (2) clerks papers, (3) exhibits, and (4) a certified record of administrative adjudicative proceedings. RAP 9.1(b) provides that \"the report of proceedings may take the form of a 'verbatim report of proceedings' . . ., a 'narrative report of proceedings' . . ., or an 'agreed report of proceedings' . . . .\" And RAP 9.3 authorizes use of a narrative report of proceedings if the court reporter's notes are lost.\n\nThere is no verbatim report of proceedings for the portion of the CrR 3.5 pretrial hearing held on July 10, 1992 because the court reporter was unable to find the notes for that day. As a result, this court directed the trial court to \"settle all issues regarding the completion of the record for review\" in this case. The trial court accordingly prepared from its notes taken at the July 10, 1992 hearing a Supplementation of Report of Proceeding. This provided a record of sufficient completeness for adequate review of the issues raised by Appellant.\n\nThe trial court's Supplementation of Report of Proceedings, based upon contemporaneous notes taken by the court on July 10, 1992, constitutes a narrative report of proceedings for that portion of the hearing sufficient to make the record complete. Appellant's assertion that the trial court's narrative report is \"conclusory at best\" on the issue of Miranda warnings is rebutted by the fact that, along with the trial court's narrative report, the record on review also contains the tape recordings of Appellant's statements to the Palm Springs Police which included Miranda warnings, \u003cspan class=\"fnref\"\u003e163\u003c/span\u003e as well as the trial court's oral ruling on the issues of Miranda warnings and RCW 9.73. \u003cspan class=\"fnref\"\u003e164\u003c/span\u003e Additionally, there are verbatim reports of all other proceedings, including the testimony of Ms. Schnell, Ms. West and Ms. Gray. We reject Appellant's claim that the record is not sufficiently complete for review of the issues in this case.\n\nDeath Qualification of jurors\n\n(9) Whether the trial court erred in allowing prospective jurors to be \"death qualified\" during voir dire examination.\n\nThe Sixth Amendment to the United States Constitution and Washington Consti. Art. I, sec. 22 both warrant a defendant \"the right to . . . an impartial jury.\" To ensure an impartial jury in capital cases, prospective jurors opposing the death penalty can be challenged for cause and excluded if their \"views would 'prevent or substantially impair the performance of [their] duties as . . . jurors,'\" according to their instructions and their oath. \u003cspan class=\"fnref\"\u003e165\u003c/span\u003e This process is termed \"death qualification.\" \u003cspan class=\"fnref\"\u003e166\u003c/span\u003e In this case, the State \"death qualified\" the jury during voir dire. The Supreme Court has consistently held that the United States Constitution does not prohibit the states from death qualifying juries in capital cases. \u003cspan class=\"fnref\"\u003e167\u003c/span\u003e However, Appellant claims death qualifying a jury violates the Washington Constitution, Article I, sec.sec. 21 and 22 because it produces a jury more prone to convict. \u003cspan class=\"fnref\"\u003e168\u003c/span\u003e Whether the Washington Constitution should be independently analyzed as granting more protection than the federal constitution is determined by examining six nonexclusive factors set forth in State v. Gunwall. \u003cspan class=\"fnref\"\u003e169\u003c/span\u003e Those factors are: (1) the textual language of the state constitutional provision at issue; (2) differences in the parallel texts of the federal and state constitutions; (3) state constitutional and common law history; (4) preexisting state law; (5) structural differences between the federal and state constitutions; and (6) matters of particular state or local concern. \u003cspan class=\"fnref\"\u003e170\u003c/span\u003e This Court will address a state constitutional claim only if the claimant sufficiently briefs the Gunwall factors. \u003cspan class=\"fnref\"\u003e171\u003c/span\u003e Appellant has satisfied that requirement. Gunwall Analysis The first Gunwall factor requires this Court to examine the text of the state constitutional provisions at issue. Const. art. I, sec. 21 provides that \"the right of trial by jury shall remain inviolate, but the legislature may provide for a jury of any number less than twelve in courts not of record . . . .\" Const. art. I, sec. 22 (amend. X) provides that \"in criminal prosecutions the accused shall have the right to . . . a speedy public trial by an impartial jury . . . .\" Const. art. I, sec. 21 emphasizes the importance of the right to trial by jury, by declaring the right \"shall remain inviolate.\" Nothing in the state constitutional provisions suggests that death qualifying a jury is prohibited.\n\nThe second Gunwall factor requires this Court to consider significant differences between the texts of parallel provisions of the federal and state constitutions. The Sixth Amendment and Const. art. I sec. 22 are similar in that both grant the \"right to . . . an impartial jury.\" But Const. art. I, sec. 21, which declares \"the right of trial by jury shall remain inviolate . . . .\" has no federal counterpart. This Court in Pasco v. Mace \u003cspan class=\"fnref\"\u003e172\u003c/span\u003e found that difference between the state and federal constitutions significant enough to hold that the right to a jury trial under the state constitution, unlike the federal constitution, extended to the case of any adult criminal offense, including petty offenses. But Pasco did not address death qualification and is of little relevance to this case. \u003cspan class=\"fnref\"\u003e173\u003c/span\u003e Under the third Gunwall factor this Court must look to common law and constitutional history. Appellant relies on Pasco v. Mace, \u003cspan class=\"fnref\"\u003e174\u003c/span\u003e State v. Lane \u003cspan class=\"fnref\"\u003e175\u003c/span\u003e and State v. Stegall \u003cspan class=\"fnref\"\u003e176\u003c/span\u003e to argue that case law supports the proposition that the right to a jury trial under the state constitution is broader than under the federal constitution. Appellant's reliance on those cases in this context is misplaced. The Court in Pasco held the state constitutional right to a jury trial extended to all cases of adult criminal offenses, including petty offenses. In Lane the Court determined an accused can waive his right to trial by a jury of twelve \"and submit his cause to eleven jurors,\" as the defendants did in that case. \u003cspan class=\"fnref\"\u003e177\u003c/span\u003e Stegall recognizes the right to a 12-person jury and sets forth requirements for a valid waiver of that right. \u003cspan class=\"fnref\"\u003e178\u003c/span\u003e Neither of these cases addresses the constitutionality of death qualification under the state constitution.\n\nAppellant further asserts that Pasco, Lane and Stegall evidence this state's intent to expand federal constitutional protections relating to jury questions. Appellant's assertion has little merit. In State v. Schaaf \u003cspan class=\"fnref\"\u003e179\u003c/span\u003e this Court applied the Gunwall analysis and held that the state constitution gives no greater right to a jury trial for juveniles than does the federal constitution. Additionally, the constitutional history shows there is no indication the framers intended the state constitutional right to a jury to be broader than the federal right and particularly in the context of death qualification. \u003cspan class=\"fnref\"\u003e180\u003c/span\u003e Under the fourth Gunwall factor we look for guidance to preexisting law, or law existing prior to adoption of the Washington Constitution. \u003cspan class=\"fnref\"\u003e181\u003c/span\u003e At the time Const. art. I, sec.sec. 21 and 22 were adopted, Code of 1881 sec. 1083, p. 202, provided:\n\nNo person whose opinions are such as to preclude him from finding any defendant guilty of an offense punishable with death, shall be compelled or allowed to serve as a juror on the trial of any indictment for such an offense. As that passage indicates, preexisting law supports the process of death qualification. And, as the State points out, no preexisting body of state law supports a broader interpretation of Const. art. I, sec.21 and sec. 22 in this context.\n\nThe fifth Gunwall factor requires this Court to examine the structural differences between the federal constitution and the state constitution. That factor always favors independent state constitutional analysis \"because the federal constitution is a grant of power from the states, while the state constitution represents a limitation of the State's power.\" \u003cspan class=\"fnref\"\u003e182\u003c/span\u003e Under the sixth Gunwall factor this Court examines whether the matter at issue is of particular state interest or local concern. In Taylor v. Louisiana, the United States Supreme Court stated:\n\nThe States remain free to prescribe relevant qualifications for their jurors and to provide reasonable exemptions so long as it may be fairly said that the jury lists or panels are representative of the community. \u003cspan class=\"fnref\"\u003e183\u003c/span\u003e The Supreme Court has also emphasized there is not \"any one right way for a State to set up its capital sentencing scheme.\" \u003cspan class=\"fnref\"\u003e184\u003c/span\u003e Those statements suggest the death qualification process is a matter of purely local state concern. Even though that may be true, this court has shown no inclination to provide broader protection of defendants' constitutional rights in the context of death qualification. \u003cspan class=\"fnref\"\u003e185\u003c/span\u003e Applying the Gunwall factors leads us to conclude there is no basis for Appellant's argument that Const. art. I, sec.sec. 21 and 22 should be independently analyzed as affording broader protection in the context of death qualification than the Sixth Amendment. Washington's common law, statutory history and constitutional history do not support Appellant's claim that death qualifying a jury violates the Washington Constitution article I, sec.sec. 21 and 22. \u003cspan class=\"fnref\"\u003e186\u003c/span\u003e Previous capital cases, including State v. Hughes \u003cspan class=\"fnref\"\u003e187\u003c/span\u003e and State v. Mak, \u003cspan class=\"fnref\"\u003e188\u003c/span\u003e in which a Gunwall analysis was not conducted, properly upheld death qualification as valid under the Washington Constitution.\n\nAppellant argues death qualification produces a conviction-prone jury in violation of his right to an impartial jury. But that argument overlooks the fact that the State also has a right to an impartial jury. \u003cspan class=\"fnref\"\u003e189\u003c/span\u003e This Court acknowledged in Hughes that the voir dire process is aimed at excluding persons who cannot be fair to both sides of the case:\n\nThe guarantee of impartiality cannot mean that the state has a right to present its case to the jury most likely to return a verdict of guilt, nor can it mean that the accused has a right to present his case to the jury most likely to acquit. But the converse is also true. The guarantee cannot mean that the state must present its case to the jury least likely to convict or impose the death penalty, nor that the defense must present its case to the jury least likely to find him innocent or vote for life imprisonment.\n\nThe logical converse of the proposition that death-qualified jurors are conviction prone is that non-death-qualified jurors are acquittal prone, not that they are neutral. \u003cspan class=\"fnref\"\u003e190\u003c/span\u003e In Hughes this Court declined \"to define 'impartial' as 'a middle ground that involves a jury with persons who are in effect defendant prone.'\" \u003cspan class=\"fnref\"\u003e191\u003c/span\u003e Impartiality of jury members is presumed when they are selected from a fair cross-section of the community and they can properly follow their oath to apply the law to the facts of the case \"regardless of the mix of individual view points actually represented\" by the jurors. \u003cspan class=\"fnref\"\u003e192\u003c/span\u003e Appellant also refers to studies reviewed in the United States Court of Appeals for the Eighth Circuit in Grigsby v. Mabry \u003cspan class=\"fnref\"\u003e193\u003c/span\u003e to support his claim that death qualified juries are more prone to convict. But in Hughes this Court considered and rejected a similar claim by defendant which relied on the studies in Grigsby. \u003cspan class=\"fnref\"\u003e194\u003c/span\u003e\n\nStatutory Basis\n\nAppellant asserts death qualification is unconstitutional because it has no statutory basis after former RCW 10.49.050 \u003cspan class=\"fnref\"\u003e195\u003c/span\u003e was repealed in 1981. He relies chiefly upon Witherspoon v. Illinois \u003cspan class=\"fnref\"\u003e196\u003c/span\u003e to support his assertion. He also contends no court rules authorize the death qualification process.\n\nThe State argues RCW 4.44.170(2) and CrR 6.4(c) provide sufficient basis for death qualification. RCW 4.44.170(2) provides for challenging a juror for cause for actual bias:\n\nFor the existence of a state of mind on the part of the juror in reference to the action, or to either party, which satisfies the court that the challenged person cannot try the issue impartially and without prejudice to the substantial rights of the party challenging, and which is known in this code as actual bias.\n\nAlthough the statute does not specifically refer to death qualification, it does support that process. CrR 6.4(c)(2) provides that \"RCW 4.44.150 through RCW 4.44.200 shall govern challenges for cause.\" Those provisions include RCW 4.44.170(2). In addition, our cases have consistently upheld the process of death qualification even without a statute which specifically refers to it. \u003cspan class=\"fnref\"\u003e197\u003c/span\u003e Appellant's reliance upon Witherspoon is misplaced. Although the Supreme Court in that case evaluated an Illinois statute requiring death qualification, the case does not stand for the proposition that a specific statute is required to permit death qualification by the State. As Appellant acknowledges, the Supreme Court has stated there is not \"any one right way for a State to set up its capital sentencing scheme.\" \u003cspan class=\"fnref\"\u003e198\u003c/span\u003e The State points to the more recent Supreme Court decision of Wainwright v. Witt \u003cspan class=\"fnref\"\u003e199\u003c/span\u003e in which the Court reviewed a trial court decision granting a challenge for cause in a capital case. The Court did not examine a death qualification statute, but found the trial court properly excused a juror for cause because of her views on the death penalty. \u003cspan class=\"fnref\"\u003e200\u003c/span\u003e RCW 4.44.170(2), CrR 6.4(c)(2) and our case law provide sufficient authority for death qualifying a jury. We reject Petitioner's argument that because there is no statutory authority for it, death qualification of jurors is unconstitutional.\n\nTrial Court Exclusion of Jurors Challenged For Cause\n\n(10) Whether certain prospective jurors were properly excused for cause.\n\nAppellant claims the trial court abused its discretion in excusing prospective jurors Ms. Lisa Denis, Ms. Kristin A. Henderson and Richard Deal upon challenges for cause by the State.\n\nA trial court's ruling on challenge of a prospective juror for cause is reviewed for manifest abuse of discretion. \u003cspan class=\"fnref\"\u003e201\u003c/span\u003e This Court gives deference to the trial court's finding that a prospective juror's views on the death penalty will prevent that person from trying the case fairly and impartially. \u003cspan class=\"fnref\"\u003e202\u003c/span\u003e This is because \"the trial Judge is in the best position upon observation of the juror's demeanor to evaluate the responses and determine if the juror would be impartial.\" \u003cspan class=\"fnref\"\u003e203\u003c/span\u003e In Wainwright v. Witt the Supreme Court quoted from Reynolds v. United States that \"the manner of the juror while testifying is oftentimes more indicative of the real character of his opinion than his words. That is seen below, but cannot always be spread upon the record . . . .\" \u003cspan class=\"fnref\"\u003e204\u003c/span\u003e The standard for ruling on challenges for cause in a death penalty case is whether the prospective juror's views would prevent or substantially impair the performance of that person's duties as a juror according to instructions and the oath taken by jurors. \u003cspan class=\"fnref\"\u003e205\u003c/span\u003e\n\nVoir Dire of Ms. Lisa Denis\n\nWhen questioned on voir dire about whether she had ever made a life or death decision, Ms. Lisa Denis answered \"No. I don't know . . . I don't know if I could vote, I don't know if I could.\" \u003cspan class=\"fnref\"\u003e206\u003c/span\u003e She also indicated the death penalty \"would be a very difficult position\" for her. \u003cspan class=\"fnref\"\u003e207\u003c/span\u003e Defense counsel asked her \"Do you think that you could follow [the Judge's] instructions to consider the possibility of a death penalty as a sentence?\" She answered \"Oh, yeah, I could follow the instructions. I think that actually making that decision, no.\" \u003cspan class=\"fnref\"\u003e208\u003c/span\u003e The court asked Ms. Denis if, given her knowledge, background and opinion, she could actually vote to impose the death penalty. Ms. Denis replied \"I don't think I could. It would have to be so crystal clear. It would just have to be [.]\" \u003cspan class=\"fnref\"\u003e209\u003c/span\u003e The trial court did not abuse its discretion in excusing Ms. Denis for cause. The record supports the court's finding that her views about the death penalty would have substantially impaired her ability to follow the court's instructions.\n\nVoir Dire of Ms. Kristin A. Henderson\n\nOn voir dire, Ms. Kristin A. Henderson agreed she could follow the court's instructions and make a decision under the law. But she also voiced strong feelings against the death penalty. She said she felt the death penalty made \"brutes of us all\" and was \"barbaric.\" \u003cspan class=\"fnref\"\u003e210\u003c/span\u003e The court asked if she would seriously be willing to consider both the alternatives of life without possibility of parole and the death penalty, given her strong feelings. She replied \"It would be difficult. I mean, I can see myself, I guess I could express it in body language perhaps. Pardon me. I would be sitting there like this.\" \u003cspan class=\"fnref\"\u003e211\u003c/span\u003e The trial court did not abuse its discretion in excusing Ms. Henderson for cause because her oral responses and body language showed she would be substantially impaired in performing her duties as a juror.\n\nVoir Dire of Richard Deal\n\nAppellant did not object at trial to the State's challenge of Richard Deal for cause. At any rate, Mr. Deal was properly excused. On voir dire he indicated he would impose the death penalty where the defendant \"would reviolate if released,\" which is not a correct statement of the law. He also misunderstood the State's burden of proof in a criminal case and understood it to be \"beyond a shadow of a doubt,\" although he was corrected later. The trial court did not abuse its discretion in excusing Mr. Deal for cause.\n\nJury Instructions on Premeditation and Intent\n\n(11) Whether the terms \"premeditation\" and \"intent\" were sufficiently explained in the trial court's instructions to the jury.\n\nAppellant contends the trial court committed reversible error by not instructing the jury that premeditation and intent are separate elements of aggravated first degree murder. He assigns error to the court giving Instruction 11 defining premeditation:\n\nPremeditation means thought over beforehand. When a person, after any deliberation, forms an intent to take human life, the killing may follow immediately after the formation of the settled purpose and it will still be premeditated. Premeditation must involve more than a moment in point of time. The law requires some time, however long or short, in which a design to kill is deliberately formed. \u003cspan class=\"fnref\"\u003e212\u003c/span\u003e Instruction 11 is Washington Pattern Instruction (Criminal) (WPIC) 26.01, which we have upheld in other capital cases. \u003cspan class=\"fnref\"\u003e213\u003c/span\u003e Appellant objected to Instruction 11 at trial and argues the trial court should instead have given his proposed Instruction 7 which read:\n\nIntent and premeditation are not synonymous.\n\nPremeditation cannot simply be inferred from the existence of a criminal intent.\n\nPremeditation involves the mental process of thinking beforehand, deliberation, reflection, weighing or reasoning for a period of time, however short. Although no specific period of time is required, sufficient time must have elapsed to allow deliberate formation of the intent to act and reflection upon the act intended. Premeditation necessarily involves an appreciable length of time. \u003cspan class=\"fnref\"\u003e214\u003c/span\u003e Errors in instructions are reviewed de novo. \u003cspan class=\"fnref\"\u003e215\u003c/span\u003e Jury instructions are to be read as a whole and each instruction is read in the context of all others given. \u003cspan class=\"fnref\"\u003e216\u003c/span\u003e \" specific instruction need not be given when a more general instruction adequately explains the law and enables the parties to argue their theories of the case.\" \u003cspan class=\"fnref\"\u003e217\u003c/span\u003e The court need not give a party's proposed instruction if it is repetitious or collateral to instructions already given. \u003cspan class=\"fnref\"\u003e218\u003c/span\u003e A review of the instructions given in this case satisfies us the trial court did not err. In addition to Instruction 11, the court defined \"intent\" in Instruction 26, WPIC 10.01, which reads: \"A person acts with intent or intentionally when acting with the objective or purpose to accomplish a result which constitutes a crime.\" \u003cspan class=\"fnref\"\u003e219\u003c/span\u003e Instruction 26 is almost identical to RCW 9A.08.010(1)(a). \u003cspan class=\"fnref\"\u003e220\u003c/span\u003e The court also gave Instruction 10:\n\nTo convict the defendant of the crime of first-degree premeditated murder, each of the following elements of the crime must be proved beyond a reasonable doubt:\n\n(1) That on or about the 24th day of May, 1991, the defendant caused the death of Holly Washa;\n\n(2) That the defendant acted with intent to cause the death of Holly Washa;\n\n(3) That the intent to cause the death was premeditated;\n\nand (4) That the acts occurred in King County, Washington.\n\nIf you find from the evidence that each of these elements has been proved beyond a reasonable doubt, then it will be your duty to return a verdict of guilty.\n\nOn the other hand, if, after weighing all of the evidence, you have a reasonable doubt as to any one of these elements, then it will be your duty to return a verdict of not guilty. A reading of Instructions 10, 11 and 26 indicates the court instructed the jury that \"premeditation\" and \"intent\" were separate elements of aggravated first degree murder. \u003cspan class=\"fnref\"\u003e221\u003c/span\u003e The instructions adequately follow the law in defining premeditation and intent. The trial court thus was not required to give Appellant's proposed Instruction 7. The court did not commit reversible error in giving Instruction 11 and refusing to give Appellant's proposed Instruction 7.\n\nAggravating Factors\n\n(12) Whether the trial court properly instructed the jury concerning the aggravating factors in the case.\n\nInsufficiency of Evidence\n\nThe State charged Appellant with aggravated first degree murder by committing first degree murder in the course of, in furtherance of, or in immediate flight from robbery in the first or second degree, rape in the first or second degree, and kidnapping in the first degree. \u003cspan class=\"fnref\"\u003e222\u003c/span\u003e Appellant contends there was not sufficient evidence to prove he killed Ms. Holly C. Washa during, in the course of, in furtherance of, or in immediate flight from the crimes of robbery, rape, or kidnapping. He thus claims he was denied due process when the trial court denied his motion to dismiss the aggravated murder charge, in which he claimed there was insufficient evidence of the aggravating circumstances of rape and robbery at the close of the State's case in the guilt phase.\n\nIn challenges to the sufficiency of evidence to prove an aggravating factor in aggravated murder, this Court must view the evidence most favorably towards the nonmoving party to determine whether any rational trier of fact could have found the presence of the aggravating factor beyond a reasonable doubt. \u003cspan class=\"fnref\"\u003e223\u003c/span\u003e To establish that a killing occurred in the course of, in furtherance of, or in immediate flight from a felony, there must be an \"intimate connection\" between the killing and the felony. \u003cspan class=\"fnref\"\u003e224\u003c/span\u003e The killing must be part of the \"res gestae\" of the felony, that is, in \"close proximity in terms of time and distance.\" \u003cspan class=\"fnref\"\u003e225\u003c/span\u003e A \"causal connection\" must clearly be established between the two. \u003cspan class=\"fnref\"\u003e226\u003c/span\u003e In other words, \"more than a mere coincidence of time and place is necessary.\" \u003cspan class=\"fnref\"\u003e227\u003c/span\u003e The trial court in this case relied primarily upon State v. Leech \u003cspan class=\"fnref\"\u003e228\u003c/span\u003e and State v. Dudrey \u003cspan class=\"fnref\"\u003e229\u003c/span\u003e in denying Appellant's motion to dismiss the aggravated murder charge. This Court in Leech declined to apply a literal reading of \"in furtherance of.\" In that case, a fire fighter died while fighting a fire set by the defendant. The defendant, charged with felony murder, argued his act of arson ended once he set the fire and that any death caused by the fire was not within the res gestae or \"in furtherance of\" that crime. But we concluded that because the fire fighter died while the arson fire was still engaged, his death was sufficiently close in time and place to the arson to be within the res gestae of that felony.\n\nThe Court of Appeals, Division Three, in Dudrey, another felony murder case, concluded the killing was part of the res gestae of the felony where a burglary and a killing were closely related and occurred at about the same time and place. The defendant and a friend planned to burglarize the victim's home, where they knew she was sleeping. She awoke when the defendant threw a rock through the window. As she investigated, she was killed by either the defendant or his friend. The court found there was an \"intimate and close connection\" between the homicide and the burglary. \u003cspan class=\"fnref\"\u003e230\u003c/span\u003e But in State v. Golladay \u003cspan class=\"fnref\"\u003e231\u003c/span\u003e this Court found no intimate connection between a homicide and a larceny allegedly committed by the defendant. The defendant claimed he gave the victim and her male companion a ride in his automobile. He stated he then dropped them off. Later, while still driving, he accidentally hit an embankment. Witnesses at the accident scene saw him dispose of the victim's purse and shoes. The victim was later found dead. We determined the larceny was separate, distinct, and independent from the homicide. We concluded there was no \"legal relation\" between the killing and the larceny, pointing to the fact the larceny occurred after the killing \u003cspan class=\"fnref\"\u003e232\u003c/span\u003e and that the killing was not within the res gestae of the larceny. \u003cspan class=\"fnref\"\u003e233\u003c/span\u003e Neither Leech, Dudrey nor Golladay completely addresses the specific issue raised by Appellant. He argues the killing of Ms. Washa was not in furtherance of either the rape or robbery because the killing occurred \"hours\" after those crimes were committed or completed, and thus the killing would not be within the res gestae of those crimes, or the killing was not committed to \"further\" those crimes. In Leech, Dudrey and Golladay, the killings and related felonies occurred within close proximity of time and place. In the circumstances presented by this case, the felonies occurred sometime within a two-day period, presumably \"hours\" before the actual killing.\n\nAlthough Appellant claims his killing of Ms. Washa did not \"further\" the rape, robbery or kidnapping, following Leech we will not apply too literal an interpretation of \"in furtherance of,\" but will look instead to whether the killing was part of the res gestae of the felony. We have also recognized the need for a \"causal\" or \"intimate\" connection between a killing and a related felony to establish the killing was committed in the course of, in furtherance of, or in immediate flight from the felony.\n\nThe record in this case supports our Conclusion that Appellant's killing of Ms. Holly C. Washa was within the res gestae or had a \"causal connection\" to the rape, robbery and kidnapping. The crimes are linked by Appellant's motive to obtain money to pay for his California trip. He made plans to meet Ms. Susan J. Schnell in Palm Springs, California and admitted to California police that he kidnapped Ms. Washa because he needed money to go there. He held Ms. Washa captive after robbing her. He told the Palm Springs police he had thought about robbing someone and letting that person go but \"it would be just the same as waltzing into a bank and have my picture taken.\" He held Ms. Washa captive for two days and raped and tortured her during that time. He admitted killing her because he did not want to leave a witness alive. Immediately after killing Ms. Washa, Appellant went to California. The killing and other felonies are intimately connected. From the beginning of Appellant's criminal acts against Ms. Washa, he was not separated from her until he killed her and left for California.\n\nViewing the record in the light most favorable to the State leads us to conclude there was sufficient evidence from which any rational trier of fact could have found beyond a reasonable doubt that the murder in this case was committed in furtherance of, in the course of, or in immediate flight from rape, robbery and kidnapping. \u003cspan class=\"fnref\"\u003e234\u003c/span\u003e The trial court did not err in denying Appellant's motion to dismiss his aggravated murder charge. Appellant was not denied due process.\n\nJury Instructions\n\nAppellant asserts the trial court committed reversible error and denied him due process by not instructing the jury on \"in the course of,\" \"in furtherance of,\" and \"in immediate flight\" as elements of the aggravating factors, as he proposed at trial. Appellant also complains the trial court erred in not giving that proposed instruction when, on December 9, 1993, the jury during deliberations asked in writing \"Do we have a (legal) definition of in Furterance off [sic] and or Imidiate [sic] flight.\" \u003cspan class=\"fnref\"\u003e235\u003c/span\u003e The court refused the defense request for the proposed instruction and told the jury, after affording all counsel an opportunity to consider it, \"You have all of your instructions in this area. No further instructions will be given.\" \u003cspan class=\"fnref\"\u003e236\u003c/span\u003e Considering the jury's request, Appellant complains the phrases \"in the course of,\" \"in furtherance of,\" \"in flight from,\" and \"immediate flight\" are technical terms in the context of this case and the court should have instructed the jury concerning them. A term is \"technical\" when it has a meaning that differs from common usage. \u003cspan class=\"fnref\"\u003e237\u003c/span\u003e The phrases here are not defined by statute. No appellate court has defined them and no pattern jury instructions address them. We conclude the phrases are expressions of common understanding to be given meaning from their common usage.\n\nTrial courts must define technical words and expressions used in jury instructions, but need not define words and expressions that are of ordinary understanding or self-explanatory. \u003cspan class=\"fnref\"\u003e238\u003c/span\u003e For example, upon request, the trial court must give instructions on the statutory meaning of \"intent.\" \u003cspan class=\"fnref\"\u003e239\u003c/span\u003e But jury instructions need not define terms such as \"common scheme or plan,\" \u003cspan class=\"fnref\"\u003e240\u003c/span\u003e \"single act,\" \u003cspan class=\"fnref\"\u003e241\u003c/span\u003e \"leniency,\" \u003cspan class=\"fnref\"\u003e242\u003c/span\u003e or \"mitigating circumstances.\" \u003cspan class=\"fnref\"\u003e243\u003c/span\u003e This Court has recognized that \"trial courts should exercise sound discretion to determine the appropriateness of acceding to requests that words of common understanding be specifically defined.\" \u003cspan class=\"fnref\"\u003e244\u003c/span\u003e And when a jury has begun deliberating, the trial court also has discretion to determine whether to give further instructions upon request. \u003cspan class=\"fnref\"\u003e245\u003c/span\u003e The trial court in this case properly exercised its discretion by not giving Appellant's proposed instructions defining the phrases \"in the course of,\" \"in furtherance of,\" or \"in immediate flight from\" a felony.\n\nAppellant also claims the court's refusal to define those phrases violated his due process rights because they were \"essential elements of the aggravators.\" And he argues jury instructions omitting essential elements of the crime prevent an accused from arguing its theory of defense and requires reversal. Even assuming those phrases are essential elements of the crimes charged, this Court has recognized that failure to give a definitional instruction is not failure to instruct on an essential element. \u003cspan class=\"fnref\"\u003e246\u003c/span\u003e The record in this case shows the trial court instructed the jury on all essential elements of the crimes charged. \u003cspan class=\"fnref\"\u003e247\u003c/span\u003e The defense was not prevented from arguing its theory of the case. Appellant's claim is without merit.\n\nThe trial court did not commit reversible error or violate Appellant's due process rights by not giving instructions defining \"in the course of,\" \"in furtherance of,\" or \"in immediate flight from\" a felony.\n\nPenalty Phase Instructions\n\n(13) Whether the trial court erred during the penalty phase in refusing to give the jury certain instructions proposed by the defense.\n\nAppellant claims the trial court erred by not giving several of his proposed penalty phase instructions to the jury. \u003cspan class=\"fnref\"\u003e248\u003c/span\u003e To support his claim, he argues Washington is a \"weighing state\" and his proposed instructions were necessary to appropriately channel the jury's discretion during sentencing. And, he asserts, without his proposed instructions, the jury's decision was \"an illusion of rational decisionmaking\" in violation of the 8th and 9th Amendments to the United States Constitution and Washington Constitution, Article I, sec. 14.\n\nWeighing and Non-weighing Death Penalty Statutes\n\nThe United States Supreme Court has classified state death penalty statutes as either \"non-weighing\" or \"weighing.\" \u003cspan class=\"fnref\"\u003e249\u003c/span\u003e The terms refer to the process in a death penalty case in which the sentencer considers or weighs a variety of factors in deciding whether to impose the death penalty. \u003cspan class=\"fnref\"\u003e250\u003c/span\u003e\n\nIn weighing states, such as Arizona or Mississippi, aggravating factors are weighed against mitigating evidence. The death penalty may be imposed only where specified aggravating factors outweigh all mitigating evidence. \u003cspan class=\"fnref\"\u003e251\u003c/span\u003e For example, under Arizona's statute, the sentencer is required to evaluate both mitigating and aggravating circumstances and impose the death penalty if it finds one or more aggravating circumstances specified in the statute and finds no sufficiently substantial mitigating circumstances in favor of leniency. \u003cspan class=\"fnref\"\u003e252\u003c/span\u003e The Supreme Court read it as requiring the sentencer to weigh both circumstances to determine the relative \"substance\" of the two. \u003cspan class=\"fnref\"\u003e253\u003c/span\u003e In weighing states, it is constitutional error for the sentencer to give weight to an unconstitutionally vague aggravating factor, even if the other aggravating factors are valid. \u003cspan class=\"fnref\"\u003e254\u003c/span\u003e This Conclusion arises from the assumption that the weighing process has been \"skewed.\" An invalid aggravating factor creates the possibility the sentencer may be biased in favor of the death penalty, based upon an illusory circumstance. \u003cspan class=\"fnref\"\u003e255\u003c/span\u003e And \"a reviewing court may not assume it would have made no difference if the thumb had been removed from death's side of the scale.\" \u003cspan class=\"fnref\"\u003e256\u003c/span\u003e Thus, an aggravating factor should give principled guidance to the sentencer to assure that determining whether a human life should be taken is not a product of \"unbridled discretion.\"\n\nIn contrast, in a non-weighing state, like Georgia, the fact finder considers all the circumstances from both the guilt phase and penalty phase in deciding the penalty. \u003cspan class=\"fnref\"\u003e257\u003c/span\u003e These circumstances relate to both the crime and the defendant. In Georgia, for example, the jury must find at least one aggravating factor before imposing a death sentence, but the aggravating factors do not have a specific function in the jury's decision whether to impose the death penalty. The fact finder or sentencer is not required to weigh mitigating factors against aggravating factors. \u003cspan class=\"fnref\"\u003e258\u003c/span\u003e Appellant urges us to determine Washington is a \"weighing\" state. But Washington's death penalty statute actually aligns this state with \"non-weighing\" states. At sentencing, the jury must answer only the statutory question \"Having in mind the crime of which the defendant has been found guilty, are you convinced beyond a reasonable doubt that there are not sufficient mitigating circumstances to merit leniency?\" \u003cspan class=\"fnref\"\u003e259\u003c/span\u003e The statute does not require the jury to weigh specified aggravating factors against mitigating factors. And, as in other non-weighing states, a jury in Washington considers not only the crime proved, but all the evidence presented in both the guilt and penalty phases. \u003cspan class=\"fnref\"\u003e260\u003c/span\u003e Appellant concedes this Court has not previously analyzed Washington's death penalty statute under the United States Supreme Court's weighing or non-weighing classification. By citing Washington cases which employ the words \"weigh\" or \"weighs\" or \"outweighed,\" he attempts to convince this Court to implicitly recognize RCW 10.95 et seq., as a \"weighing\" statute. We are not convinced.\n\nIn Williams v. Calderon \u003cspan class=\"fnref\"\u003e261\u003c/span\u003e the United States Court of Appeals for the Ninth Circuit reasoned that:\n\nThe Supreme Court's weighing/non-weighing distinction may involve both procedural and substantive components.\n\nProcedurally, is the sentencer restricted to a \"weighing\"\n\nof aggravation against mitigation? Substantively, is the sentencer prevented from considering evidence in aggravation other than discrete, statutorily-defined factors? Our review of federal and state court decisions reveals that where both constraints are present, the regimes involved are uniformly treated as weighing; where neither is present, the regimes are uniformly treated as non-weighing . . . .\n\nApplying the Williams approach to our death penalty statute supports our Conclusion that RCW 10.95 et seq. is a \"non-weighing\" statute. \u003cspan class=\"fnref\"\u003e262\u003c/span\u003e Under the statute, the jury is not restricted to weighing aggravating factors against mitigating factors, but may consider all evidence presented during both the guilt and penalty phases. The jury may also consider non-statutory aggravating factors. \u003cspan class=\"fnref\"\u003e263\u003c/span\u003e\n\nPenalty Phase Instructions\n\nAppellant argues the trial court erred by not giving his proposed instructions P-9A, P-9B, 11, 12, 13, 17, 21, 22, and 23 during the penalty phase. He claims his proposed instructions were necessary to meet the constitutional requirement that the discretion of the jury be adequately focused by clear and objective standards.\n\nAn instruction must correctly state applicable law. \u003cspan class=\"fnref\"\u003e264\u003c/span\u003e The trial court does not err in refusing to give an instruction when, evaluated in the context of all the instructions, it is collateral to or repetitious of those already given. \u003cspan class=\"fnref\"\u003e265\u003c/span\u003e A jury is presumed to follow instructions given. \u003cspan class=\"fnref\"\u003e266\u003c/span\u003e Jury instructions are sufficient if they correctly state applicable law, are not misleading, and permit counsel to argue their theory of the case. \u003cspan class=\"fnref\"\u003e267\u003c/span\u003e Claimed errors at the penalty phase of a capital case are reviewed under heightened scrutiny. This requires an appellate court to review the record more carefully, but does not entail a different standard of review. \u003cspan class=\"fnref\"\u003e268\u003c/span\u003e Appellant's proposed Instructions P-9A and P-9B sought to remind the jury of the limited purpose for which certain evidence had been admitted, including Ms. Brieanna C. West's testimony, Ms. Jan M. Gray's testimony, and the events in California. As Appellant acknowledged in those proposed instructions, the court had already given those instructions to the jury in the guilt phase. \u003cspan class=\"fnref\"\u003e269\u003c/span\u003e The trial court did not err in refusing to give Appellant's proposed instructions P-9A and 9-9B again in the penalty phase.\n\nIn Appellant's proposed Instruction P-11, he identified as the \"crime\" the jury was to have in mind the elements of premeditated first degree murder and the aggravating circumstances found by the jury in the guilt phase. It further instructed the jury \"You must not consider any other feature of the crime that is not necessarily reflected in the elements and aggravating circumstances.\" That is a misstatement of the law.\n\nUnder RCW 10.95.070, the jury may consider other factors at the beginning of the special sentencing process, including [2] whether the murder was committed while the defendant was under the influence of extreme mental disturbance; [3] whether the victim consented to the act of murder; [5] whether the defendant acted under duress or domination of another person; and [8] whether there is a likelihood the defendant will pose a danger to others in the future. It is not unconstitutional for the jury to consider the circumstances of the crime for which Appellant was convicted. \u003cspan class=\"fnref\"\u003e270\u003c/span\u003e Thus, the trial court did not err in refusing to give Appellant's proposed Instruction P-11.\n\nAppellant's proposed Instruction P-12 states that the phrase \"having in mind the crime of which the defendant has been found guilty\" was \"intended merely to provide a context for [the jury's] determination\" of the death penalty. That misstates the law and is misleading. Under RCW 10.95.060(4), in answering the question on leniency, the jury is required to \"have in mind the crime of which the defendant has been found guilty . . . .\" The jury may thus consider all the evidence submitted in the guilt phase proving the crime the defendant committed. It is not correct to state the question is merely a context for the jury's consideration.\n\nProposed Instruction P-12 also stated the jury must \"not weigh the crime, any of its elements, any aspect of it or any circumstance surrounding it against the mitigating evidence\" and that its \"sole focus\" should be whether there were insufficient mitigating circumstances to merit leniency. However, under non-weighing statutes, such as Washington's RCW 10.95, \"A capital sentencer need not be instructed how to weigh any particular fact in the capital sentencing decision.\" \u003cspan class=\"fnref\"\u003e271\u003c/span\u003e The jury was correctly instructed by the court to consider all the evidence from both the guilt and penalty phases, and not just whether there were insufficient mitigating circumstances.\n\nAppellant's proposed Instruction P-13 states \"The number and nature of the aggravating factors found by you in the first phase of these proceedings should have no effect on your decision regarding the question posed by these instructions.\" This instruction is misleading and confusing. The jury was required to \"have in mind\" the crimes committed by Appellant, which included the aggravating factors found during the guilt phase. The trial court also instructed the jury it was to consider the evidence submitted during both the guilt phase and penalty phase, which include the aggravating factors. The trial court did not err in refusing to give a proposed instruction which was misleading and contradicted instructions already given.\n\nFour of Appellant's proposed instructions would advise the jury not to consider certain factors as \"weighing\" against any mitigating evidence presented. Those factors include (1) any impression they may have of the crime as heinous, depraved or cruel, or any related emotional response they have which weighs against any mitigating circumstance (P-17); (2) the future dangerousness of Appellant (P-21); \u003cspan class=\"fnref\"\u003e272\u003c/span\u003e (3) the expense of imprisoning Appellant for life (P-22) and (4) the deterrence of others (P-23). However, as the State correctly observes, RCW 10.95 is not a weighing statute. Appellant's proposed instructions incorrectly assumed Washington is a \"weighing\" state and that the jury would weigh aggravating factors against mitigating factors in its decision.\n\n\"The Constitution does not require a State to adopt specific standards for instructing the jury in its consideration of aggravating and mitigating circumstances[.]\" \u003cspan class=\"fnref\"\u003e273\u003c/span\u003e The Constitution does not require the jury to ignore other possible aggravating factors to determine who will actually be sentenced to death. \u003cspan class=\"fnref\"\u003e274\u003c/span\u003e \"What is important at the selection stage is an individualized determination on the basis of the character of the individual and the circumstances of the crime.\" \u003cspan class=\"fnref\"\u003e275\u003c/span\u003e Washington's death penalty statute properly provides for \"categorical narrowing\" of those eligible for the death penalty in the guilt phase and for individualized determination and appellate review. \u003cspan class=\"fnref\"\u003e276\u003c/span\u003e Under RCW 10.95.020 the jurors consider statutory aggravating circumstances in the guilt phase to select the class of persons eligible for the death penalty. In this case the jurors found aggravating circumstances, among which were that Appellant killed Ms. Holly C. Washa in the course of, in furtherance of, or in immediate flight from the related felonies of rape, robbery and kidnapping.\n\nThe jury's determination was based upon evidence admitted at trial. The jury was instructed in the guilt phase not to permit \"sympathy or prejudice\" to influence their decision. \u003cspan class=\"fnref\"\u003e277\u003c/span\u003e During the penalty phase, the court instructed the jury that the evidence it was to consider consisted of \"testimony of the witnesses and the exhibits admitted into evidence in phase one [the guilt phase] of this trial and during this special sentencing hearing.\" \u003cspan class=\"fnref\"\u003e278\u003c/span\u003e In addition, during the penalty phase, Appellant presented mitigating evidence to the jury. The jury heard evidence of Appellant's traumatic birth and difficult childhood. There was also testimony that Appellant suffered from anti-social personality disorder, sexual sadism and manic syndrome. The jury was given full opportunity to consider those mitigating factors. Thus, Appellant's argument that the court's refusal to give his proposed instructions resulted in an unconstitutional \"illusion of rational decisionmaking\" is without merit.\n\nRCW 10.95.130 requires this Court to determine upon review whether the death sentence was arbitrary, excessive, disproportionate, or brought about through passion or prejudice. In answering that inquiry in the negative, we conclude the trial court did not err in refusing to give Appellant's proposed sentencing phase instructions.\n\nCriminal History\n\nAppellant assigns error to the trial court's denial of his motion to exclude his criminal history during the penalty phase. However, our death penalty statute authorizes the jury to consider a defendant's prior criminal history in the penalty phase. RCW 10.95.070(1) states:\n\nIn deciding the question posed by RCW 10.95.060(4), the jury . . . may consider any relevant factors, including but not limited to the following:\n\n(1) Whether the defendant has or does not have a significant history, either as a juvenile or as an adult, of prior criminal activity[.]\n\nDuring the penalty phase the State presented Appellant's criminal history limited to his record of convictions. This is constitutionally permissible. \u003cspan class=\"fnref\"\u003e279\u003c/span\u003e The trial court did not err in denying Appellant's motion to exclude his criminal history.\n\nNotice of Special Sentencing Proceeding\n\n(14) Whether Appellant was properly served with the Notice of Special Sentencing Proceeding required by RCW 10.95.040(2).\n\nAppellant argues this Court should set aside his death sentence because there is no proof the State served him or his attorneys with its notice of intent to seek the death penalty. In support of his claim he relies upon RCW 10.95.040(3) and State v. Dearbone, 125 Wash. 2d 173, 177, 883 P.2d 303 (1994). \u003cspan class=\"fnref\"\u003e280\u003c/span\u003e RCW 10.95.040 imposes upon the State specific requirements for notifying a defendant it intends to seek the death penalty. When a person is charged with aggravated first degree murder, the State must file a \"notice of a special sentencing proceeding\" to determine whether the death penalty should be imposed when there is reason to believe there are insufficient mitigating circumstances to merit leniency. \u003cspan class=\"fnref\"\u003e281\u003c/span\u003e The State must file and serve the notice on the defendant or defendant's counsel within 30 days after arraignment unless the court extends or reopens the filing period upon showing of good cause. \u003cspan class=\"fnref\"\u003e282\u003c/span\u003e RCW 10.95.040(3) states that if the notice is not filed and served as provided under RCW 10.95.040, the State \"may not request the death penalty.\" \u003cspan class=\"fnref\"\u003e283\u003c/span\u003e The record in this case shows the notice of special sentencing proceeding was properly filed on March 24, 1992 within 30 days after Appellant's arraignment on February 26, 1992. \u003cspan class=\"fnref\"\u003e284\u003c/span\u003e But Appellant claims \"there is absolutely no proof that the State ever served [him] or his attorneys with this Notice.\" \u003cspan class=\"fnref\"\u003e285\u003c/span\u003e He notes \"there may be a hearing at which the Notice was served, but there is no evidence of which hearing that is in the clerk's papers.\" \u003cspan class=\"fnref\"\u003e286\u003c/span\u003e RCW 10.95.040 requires the State to serve a defendant with the notice of special sentencing proceeding, but does not require proof of service. Appellant does not claim he was not served with the notice, but only there is no proof he was served. His argument is without merit.\n\nDearbone cited by Appellant is distinguishable from this case. In that case, the State did not serve defense counsel with the notice of special sentencing proceeding until four days after expiration of the time for service under RCW 10.95.040(2). The defendant moved to preclude the State from requesting the death penalty because of violation of RCW 10.95.040(2). The State then moved to reopen the time for service and served defense counsel another copy of the notice. The trial court found good cause for reopening the time for service and granted the State's motion, allowing the State to seek the death penalty. On review, this Court determined the State did not show good cause and reversed the trial court. In its reasoning, this Court stated that \"filing and service of notice is mandatory no notice, no death penalty.\" \u003cspan class=\"fnref\"\u003e287\u003c/span\u003e In this case, Appellant did not raise the issue of service in the trial court, does not claim the notice was untimely served under RCW 10.95.040(2), and only bases his claim before this court on the fact there is no proof he was served. Appellant does not argue he was not served with the notice. Dearbone does not apply.\n\nA review of the record supports a reasonable Conclusion Appellant was properly served with the notice of special sentencing proceeding. On March 25, 1992, a day after the notice was filed, Appellant and one of his attorneys appeared before the court and signed an order setting trial date. \u003cspan class=\"fnref\"\u003e288\u003c/span\u003e An omnibus hearing was also held on that date. The record does not show any objections concerning service of the notice. On June 5, 1992 Appellant filed a motion to set aside the notice of special sentencing proceeding to determine whether the death penalty should be imposed. \u003cspan class=\"fnref\"\u003e289\u003c/span\u003e In the motion, Appellant argued the notice should be set aside for violation of RCW 10.95.040(1) because the State had information showing mitigating circumstances sufficient to merit leniency. At that time he made no claim the State had not properly served him or his attorney with notice. His attorneys appeared numerous times before the trial court after March 24, 1992, but never raised the issue of service of the notice.\n\nAppellant's claim that his death sentence should be set aside for absence of proof of service of notice under RCW 10.95.040 is without merit.\n\nReciprocal Discovery\n\n(15) Whether Criminal Rule 4.7(CrR 4.7) mandates reciprocal pretrial discovery of evidence relevant to the penalty phase in a capital case.\n\nOn cross appeal, the State assigns error to the trial court's ruling denying its pretrial motion to compel disclosure of Appellant's penalty phase mitigation evidence. The State argues this court should hold that CrR 4.7 mandates reciprocal pretrial discovery of information pertinent to the penalty phase of a capital case.\n\nOn February 12, 1993, the State filed a pretrial motion to compel disclosure of any mitigation evidence in Appellant's possession which he intended to present in the penalty phase of the trial. \u003cspan class=\"fnref\"\u003e290\u003c/span\u003e In response the defense argued, among other things, that forced disclosure of this evidence before completion of the guilt phase of the trial might compromise one or more of Appellant's constitutional rights, such as the right against self incrimination. \u003cspan class=\"fnref\"\u003e291\u003c/span\u003e The trial court denied the State's motion by order dated February 25, 1993, concluding that reciprocal discovery of penalty phase evidence was not required before completion of the guilt phase of the trial. \u003cspan class=\"fnref\"\u003e292\u003c/span\u003e The court did, however, order the defense to disclose before trial the identities of any experts it was consulting and planned to call as witnesses at sentencing, but did not allow the State to contact those persons. \u003cspan class=\"fnref\"\u003e293\u003c/span\u003e The court observed that this disclosure would not \"constitute waiver of any right to confidentiality or against self-incrimination . . . .\" \u003cspan class=\"fnref\"\u003e294\u003c/span\u003e In general, the scope of discovery is within the sound discretion of the trial court and its decisions will not be disturbed absent a manifest abuse of that discretion. \u003cspan class=\"fnref\"\u003e295\u003c/span\u003e CrR 4.7, a reciprocal discovery rule, guides the trial court in the exercise of its discretion over discovery. \u003cspan class=\"fnref\"\u003e296\u003c/span\u003e The rule applies to all \"criminal proceedings.\" \u003cspan class=\"fnref\"\u003e297\u003c/span\u003e The principle of \"full and free\" pretrial discovery underlies CrR 4.7 to provide adequate information for informed pleas and to \"expedite trials, minimize surprise, afford opportunity for effective cross-examination, and meet the requirements of due process . . . .\" \u003cspan class=\"fnref\"\u003e298\u003c/span\u003e The State does not claim the trial court abused its discretion in making its discovery ruling. It asks this court to hold that CrR 4.7 provides for reciprocal pretrial discovery of penalty phase evidence in capital trials subject only to the trial court's discretion over the scope of discovery. The State contends the general requirement of reciprocity in criminal discovery applies equally to the guilt and penalty phases of a capital case and, thus, that reciprocal pretrial discovery of penalty phase evidence is required. It cites in support of that contention the California Supreme Court decision of People v. Mitchell. \u003cspan class=\"fnref\"\u003e299\u003c/span\u003e In Mitchell, the court was asked to decide whether and to what extent California's general criminal discovery rule, requiring reciprocal pretrial discovery by the parties to a criminal action, was applicable to the penalty phase of a capital case. The rule had been enacted into law in 1990 by initiative and codified in Cal. Penal Code, sec. 1054 et seq. Section 1054.3 of the code requires criminal defendants and their attorneys to disclose to the prosecuting attorney the names and addresses of persons they intend to call \"at trial,\" any relevant statements or reports of those persons, and any real evidence intended to be offered into evidence. The prosecuting attorney has similar obligations under the statute. \u003cspan class=\"fnref\"\u003e300\u003c/span\u003e The defendant in that case refused to provide the prosecution with any pretrial discovery pertinent to the penalty phase of his trial. \u003cspan class=\"fnref\"\u003e301\u003c/span\u003e He argued, as Appellant did here, \u003cspan class=\"fnref\"\u003e302\u003c/span\u003e that the discovery rule requiring reciprocity did not apply to the penalty phase of a capital case because the penalty phase was a sentencing hearing and not part of a criminal \"trial\" within the meaning of the rule. \u003cspan class=\"fnref\"\u003e303\u003c/span\u003e The court rejected that argument and held that the penalty phase of a capital trial \"is merely a part of a single, unitary criminal proceeding\" and embraced within the concept of a \"trial\" or \"criminal trial.\" \u003cspan class=\"fnref\"\u003e304\u003c/span\u003e The court in Mitchell found more persuasive the defendant's claim that premature disclosure of his penalty phase evidence might jeopardize his defense at the guilt phase of his trial and potentially violate his privilege against self-incrimination. \u003cspan class=\"fnref\"\u003e305\u003c/span\u003e However, the court reasoned that such concerns could be eliminated by deferring a ruling on the prosecution's penalty phase discovery in appropriate cases pending completion of the guilt phase of the trial. \u003cspan class=\"fnref\"\u003e306\u003c/span\u003e The court reasoned that trial courts possess broad discretion to order a general continuance of a prosecutor's discovery request upon a showing that the continuance is appropriate or necessary to protect a criminal defendant's constitutional rights. \u003cspan class=\"fnref\"\u003e307\u003c/span\u003e A continuance might be based upon such considerations as the probable duration of the guilt phase, the likelihood that a guilty verdict with special circumstances will be returned, and the potential adverse effect disclosure could have on the guilt phase defense. \u003cspan class=\"fnref\"\u003e308\u003c/span\u003e And where necessary, the court may permit such a showing to be made in camera. \u003cspan class=\"fnref\"\u003e309\u003c/span\u003e Mitchell suggests a similar resolution in this case. Like the California discovery rule in Mitchell, CrR 4.7 is a general criminal discovery rule applicable to all \"criminal proceedings.\" \u003cspan class=\"fnref\"\u003e310\u003c/span\u003e In the absence of an express statutory provision to the contrary, it applies to criminal proceedings involving the death penalty as well. \u003cspan class=\"fnref\"\u003e311\u003c/span\u003e The rule applies equally to the penalty phase of a capital case as it does to the guilt phase because the former is neither more nor less than the whole \"single, unitary criminal proceeding.\" \u003cspan class=\"fnref\"\u003e312\u003c/span\u003e Although Appellant argues that the penalty phase is a separate\n\nsentencing proceeding to which the discovery rules applicable to \"criminal proceedings\" do not apply, he has cited no authority for that Conclusion.\n\nThe State's position on the discovery issue is nothing more than actual practice and is merely a restatement of the law which is not in genuine dispute in this case.\n\nVictim Impact Evidence\n\n(16) Whether the trial court erred in refusing to admit victim impact evidence at the penalty phase of the trial.\n\nThe State relies upon State v. Gentry \u003cspan class=\"fnref\"\u003e313\u003c/span\u003e in asserting the trial court erred in refusing to admit the testimony of Ms. Holly C. Washa's father as victim impact evidence. Our decision in Gentry had not been announced at the time of trial in this case. \u003cspan class=\"fnref\"\u003e314\u003c/span\u003e At the penalty phase, the State, in absence of the jury, made an offer of proof of testimony by John L. Washa concerning his daughter's interests and the impact of her murder upon her family. The trial court ruled the testimony was not admissible \"under current law and current interpretation . . . .\" \u003cspan class=\"fnref\"\u003e315\u003c/span\u003e In Gentry, the trial court admitted a similar statement by the victim's father concerning his murdered daughter and the effect of the murder on her family. We agreed with that court's ruling:\n\nWe . . . conclude that victim impact evidence is admissible in the sentencing phase of capital cases and that trial courts, which are experienced in balancing the probative against the prejudicial, should exercise their informed discretion in deciding the scope of permissible victim evidence in a given case. In the case before us, there was no error in the admission of the victim's father's statements about his young murdered daughter or about the profound effect of the murder upon her family . . . victim impact evidence may properly include a description of the emotional trauma suffered by the victim's family. \u003cspan class=\"fnref\"\u003e316\u003c/span\u003e If Gentry had been decided before the trial in this case, the trial court could have, in its discretion, admitted the testimony of John L. Washa as victim impact evidence at the penalty phase. But it would not have been error not to admit it. At any rate, the trial court did not commit error in denying victim impact evidence in this case.\n\nSUMMARY AND CONCLUSIONS\n\n(1) There was sufficient evidence to justify the affirmative finding by the jury that there were not sufficient mitigating circumstances to merit leniency. The sentence of death was not excessive or disproportionate to the penalty imposed in similar cases, considering both the crime and the defendant. The sentence of death was not brought about by passion or prejudice. Nor is the defendant mentally retarded.\n\n(2) The proportionality review mandated by RCW 10.95.130(b) is not void for vagueness under either the Eighth or Fourteenth Amendments to the United States Constitution, nor under article I, sec.sec. 3 and 14 of the Washington Constitution.\n\n(3) None of the statements made by the prosecuting attorneys during either the guilt or penalty phases of the trial constituted prosecutorial misconduct requiring a new trial.\n\n(4) The trial court did not abuse its discretion in admitting the testimony of Ms. Susan J. Schnell. Her testimony did not violate Evidence Rule 404(b), nor did it constitute double jeopardy.\n\n(5) The trial court did not abuse its discretion in admitting the testimony of Ms. Jan M. Gray or Ms. Brieanna C. West. Their testimony merely served to establish the context of the case and was not prejudicial to Appellant.\n\n(6) Appellant was adequately advised of his Miranda rights before giving statements to the Palm Springs, California police.\n\n(7) The trial court did not err in admitting Appellant's statements which were recorded by the Palm Springs police without his knowledge or consent. The officers lawfully recorded the statements under California law and were not acting as agents of the King County police at that time. Thus RCW 9.73, Washington's Privacy Act, does not require suppression of that evidence. Suppressing the evidence would not further legitimate state interests and would only suppress highly probative evidence lawfully obtained in California.\n\n(8) There is a record of \"sufficient completeness\" for adequate appellate review of Appellant's case.\n\n(9) \"Death qualification\" of jurors does not violate the Washington Constitution, article I, sec.sec. 21 and 22.\n\n(10) The trial court properly exercised its discretion in excusing for cause prospective jurors Ms. Lisa Denis, Ms. Kristin A. Henderson and Richard Deal during voir dire. Their views would have prevented or substantially impaired their ability to follow the court's instructions and abide by their oaths as jurors.\n\n(11) RCW 10.95.040 requires the State to serve a defendant with notice of its intent to seek the death penalty within 30 days of arraignment. The record supports a reasonable Conclusion that Appellant was served in fact with the notice. The statute does not require proof of service. Thus, Appellant's claim that his death sentence should be set aside merely because there is no proof of service is without merit.\n\n(12) Viewing the record in the light most favorable to the State, any rational trier of fact could have determined, beyond a reasonable doubt, that Appellant committed first degree murder in the course of, in furtherance of or in immediate flight from robbery, rape and kidnapping. The court's refusal to give instructions defining \"in furtherance of,\" \"in the course of,\" or \"in immediate flight from\" was within its discretion and did not violate Appellant's due process rights.\n\n(13) The record shows the trial court properly instructed the jury that premeditation and intent were separate elements of aggravated first degree murder.\n\n(14) The trial court properly refused Appellant's proposed instructions P-9A, P-9B, P-11, P-12, P-13, P-17, P-21, P-22 and P-23 at the penalty phase. P-9A, P-9B, P-11, P-12 and P-13 were misleading, repetitious, or misstatements of the law. The trial court's refusal of P-17, P-21, P-22 and P-23 did not render the jury's sentencing decision a product of irrational decision making. The jury received adequate instructions from the trial court. RCW 10.95 properly provides for \"individualized determination\" of the death penalty and appellate review to ensure the sentence is not imposed arbitrarily, disproportionately or as a result of passion or prejudice.\n\n(15) CrR 4.7 mandates reciprocal pretrial discovery of evidence relevant to the penalty phase of a capital case.\n\n(16) Our decision in State v. Gentry was filed only after the trial in this case. That decision allows victim impact testimony during the penalty phase of a capital case. Even under Gentry it would not have been error for the trial court to exercise its discretion not to allow victim impact testimony. The trial court did not err in denying victim impact testimony in this case.\n\nWe affirm the conviction and death sentence of Appellant Cal Coburn Brown in the King County Superior Court for the aggravated first degree murder of Ms. Holly C. Washa.\n\nConcurring: Barbara Durham\n\nJames M. Dolliver\n\nRichard P. Guy\n\nCharles W. Johnson\n\nPhilip A. Talmadge\n\nMADSEN, J. (concurring in part, Dissenting in part) -- I concur with the majority that Cal Brown's conviction should be affirmed. However, I would hold the trial court erred in admitting the testimony of Ms. Schnell, the victim in a criminal encounter with Brown in California. Further, I would hold the admission of that evidence was reversible error as to the sentencing phase of Defendant's trial. Consequently, although I concur in affirming Brown's conviction, I would remand for resentencing.\n\nI. Guilt Phase\n\nIn this case, the trial court permitted the California victim, Ms. Schnell, to testify, over objections by defense counsel, regarding the Defendant's violent behavior toward her during the days following the murder of Ms. Washa. Ms. Schnell testified how Brown restrained her with handcuffs and other devices, sexually assaulted her, forced her to write a check to him for $4,000, threatened her with a knife, and slit her throat.\n\nThe trial court ruled that Ms. Schnell's testimony was admissible under two exceptions to Evidence Rule (ER) 404, the res gestae exception and the common scheme or plan exception. The court stated the evidence \"was relevant to material issues . . . relating to premeditation, intent, and the four [statutory] aggravating factors\" and that the \"probative value of the testimony . . . substantially outweighed its prejudicial effect.\" Majority at 45 (referring to the aggravating factors found by the jury pursuant to RCW 10.95.020). The majority agrees.\n\nIn my view, the majority and the trial court were wrong in concluding that under ER 404(b) it was proper to admit Ms. Schnell's testimony during the guilt phase of Brown's trial. First, the Schnell testimony is not res gestae evidence. The trial court erred in admitting her testimony under that legal exception to ER 404. Second, ER 404 requires a trial court to balance the probative value against the prejudicial effect of evidence of other crimes and bad \"acts\" committed by the defendant. The trial court here correctly acknowledged the very prejudicial nature of the Schnell testimony. The court failed to recognize, however, that ER 404(b) evidence is generally inadmissible and the burden is on the State to establish that evidence of other offenses is not only relevant but \"necessary to prove an essential ingredient of the crime charged.\" (Emphasis added). State v. Goebel, 40 Wash. 2d 18, 21, 240 P.2d 251 (1952), overruled on other grounds by State v. Lough, 125 Wash. 2d 847, 860, 889 P.2d 487 (1995); State v. Saltarelli, 98 Wash. 2d 358, 362, 655 P.2d 697 (1982) (quoting Goebel, 40 Wash. 2d at 21); State v. Brown, 113 Wash. 2d 520, 782 P.2d 1013, 80 A.L.R.4th 989 (1989); State v. Lane, 125 Wash. 2d 825, 831-32, 889 P.2d 929 (1995) (citing Saltarelli, 98 Wash. 2d 358, 655 P.2d 697 and Goebel, 40 Wash. 2d 18, 240 P.2d 251). Because the need for the testimony to prove an essential ingredient of the crimes charged did not overcome the extreme prejudice of that testimony, the admission of Schnell's testimony was error.\n\nA. Res Gestae\n\nEvidence of other misconduct may be admissible under the res gestae exception \"to complete the story of the crime on trial by placing it in the context of nearby and nearly contemporaneous happenings.\" 1 McCormick on Evidence sec. 190 at 799 (4th ed. 1992). See State v. Tharp, 96 Wash. 2d 591, 594, 637 P.2d 961 (1981) (other misconduct admissible \"in order that [the jury] have the entire story of what transpired on that particular evening\"). In this case, the crimes against Ms. Washa were completed with her death, well before the Defendant's conduct with Ms. Schnell occurred. Thus, evidence that Defendant raped and cut Ms. Schnell's throat two or three days after the completion of his crimes \"on trial\" does not constitute res gestae evidence.\n\nIn oral argument before this Court the State conceded the same.\n\nTalmadge, J.: You would not be contending that if common plan or scheme were not part of this case that all the details of the crimes that were committed against Ms. Schnell would be at all relevant in terms of res gestae as an exception?\n\nMs. Pahmeier: That's true.\n\nMadsen, J.: Are you conceding that the evidence of the rape and the slashing of the throat would not be relevant if it were offered only for res gestae purposes?\n\nMs. Pahmeier: Yes, I would say it was definitely admitted under the ER 404(b) common scheme or plan.\n\nMs. Pahmeier: I'm not sure that the evidence of the incidents that took place then in California when he got there would come in except under the court's . . . .\n\nAlexander, J.: So it comes in under common scheme or plan or it doesn't come in at all?\n\nMs. Pahmeier: That's correct. Tape of Oral Argument, side 7: 539-570.\n\nMs. Schnell's testimony does not meet the definition of res gestae evidence and its admission under that exception was erroneous.\n\nB. Necessity of Evidence\n\nTo constitute evidence of a common scheme or plan the prior misconduct must be an integral part of a larger or \"overarching\" scheme or plan. State v. Lough, 125 Wash. 2d 847, 889 P.2d 487 (1995). Alternatively, the evidence may demonstrate a commonly used scheme or plan. See id. at 854-55. The State argues here that Schnell's evidence was admissible under the common scheme or plan exception because his crimes against Ms. Washa were part of his overarching plan to rape, rob, and assault Ms. Schnell. Assuming that the evidence was part of a common scheme or plan, it should, nevertheless, have been excluded because it was not necessary to prove an essential element of the crime charged.\n\nThe State says the Schnell evidence was necessary to rebut Defendant's claim that Ms. Washa's murder was an accident or an act of panic, not premeditated murder, and Defendant's claim that the sexual intercourse with Ms. Washa was consensual.\n\nInitially, I find the State's justification for the Schnell evidence disingenuous, considering Defendant never testified and, in fact, offered no defense at all. Most of the evidence against Defendant came from his confession, which Defendant attempted to keep out of evidence. The confession was offered by the State in its case in chief as substantive evidence. Thus, it is the State's own evidence, contained in the confession, which the State is attempting to discredit with Schnell's testimony. The State should not be allowed to offer confession evidence, over defense objection, and then claim that ER 404 evidence is necessary to rebut Defendant's claim that he lacked premeditation to murder or that sex was consensual. This is particularly true where Defendant has not testified or offered any evidence regarding premeditation, motive, or intent. See State v. Lavaris, 106 Wash. 2d 340, 346, 721 P.2d 515 (1986) (State may not call witness for primary purpose of impeaching him with otherwise inadmissible testimony).\n\nMore importantly, the State's assertions regarding the need for Schnell's testimony are simply not born out by the evidence. Rather than casting doubt on premeditation, Defendant's confession establishes it. In his confession, Defendant stated:\n\nI realized if I left her there, she could just bang and clang and crunch and scream and be out very quickly. Otherwise, I would have just left her there and that's when I went to the back of the truck and I . . . killed her. Ex. 89, tape 2, side 1, at 630-650. Moreover, Defendant's Discussion of being panicked was in relation to moving the car after he had killed her. \"I forgot that trunks have like holes and things like that. So I panicked and left that place and drove around . . . .\" Ex. 89, tape 1, side 2 at 50-60. Defendant said he killed Ms. Washa because she was a stranger and it made sense for him to kill her. Ex. 89, tape 1, side 1 at 625-635. Clearly, Ms. Schnell's testimony was not necessary on the issue of premeditation.\n\nNor was the evidence necessary on the issue of consent. He stated in his confession that during intercourse he noticed she was looking at the door and thinking of escape. In response, Brown stated he decided \"to have a little control . . . make her a little more scared of me.\" Ex. 89, tape 2, side 1. Further, the physical evidence overwhelmingly proved that intercourse was not consensual. See Majority at 9.\n\nFinally, it is difficult to see how Defendant's conduct with Ms. Schnell had any bearing on his premeditation in the Washa murder or the consensual nature of his sexual contact with Ms. Washa. Defendant was not charged with premeditation in the Schnell crime, nor was he charged or convicted of sexual assault on Ms. Schnell.\n\nConsidering the overwhelmingly strong case for the State based on the physical evidence and Defendant's confession, it is clear that the real reason the State offered Schnell's testimony was to demonstrate the Defendant's propensity to rape, rob, and slash women's throats. The State candidly stated the \"exclusion of Schnell's testimony would not have changed the outcome of this case.\" Br. of Resp't at 109. The State thus concedes the evidence was not necessary.\n\nIn the present case, the exclusion of Schnell's testimony would not have changed the outcome of this case. The remaining evidence, including Brown's confession, is overwhelming. The heinous acts the defendant committed upon Washa were far more compelling than the streamlined testimony from Schnell concerning what the defendant did to her.\n\nBr. of Resp't at 109.\n\nC. Prejudice\n\nThe Schnell evidence also fails the second part of the admissibility test; i.e., the probative value of the evidence must outweigh its prejudicial effect. Even assuming Schnell's testimony was admissible under the common scheme or plan exception to ER 404, her testimony was, at best, cumulative and of marginal probative value. See DeVore v. United States, 368 F.2d 396, 398 (9th Cir. 1966) (evidence of other bad acts deemed improperly admitted because, in view of the cumulative nature of the evidence, the \"prejudice to appellants was not balanced by any substantial gain to the government's case\"). More importantly, the Schnell evidence was obviously \"dragged in\" for its prejudicial effect and the emotional response it would evoke. Carson v. Fine, 123 Wash. 2d 206, 224-25, 867 P.2d 610 (1994). The prosecution was adding frosting to the cake.\n\nD. Harmless Error\n\nThe State's case, including the Defendant's confession and the physical evidence, was overwhelming. Thus, while admission of Schnell's testimony was error, it was harmless as to the guilt phase of this trial. It was not, however, harmless as to the penalty phase.\n\nII. Penalty Phase\n\nUnlike the guilt phase, admission of the Schnell testimony is reversible error as to the penalty phase of this capital case. The majority and the trial court fail to recognize that the balancing of the potentially undue prejudicial effect of Ms. Schnell's testimony against its probative value cannot be limited only to issues relevant to the guilt phase of this trial. A jury in a capital crime trial deliberates on an entirely separate question during the sentencing phase. Therefore, in deciding whether to admit evidence in the guilt phase of a capital trial, the trial court must weigh the effect of such potentially prejudicial evidence against the probative value in the sentencing phase of the trial. Because any probative value of Ms. Schnell's testimony was far outweighed by its prejudicial impact during the penalty phase, admission of such testimony during the guilt phase of the trial was an abuse of discretion.\n\nThe decision to admit evidence of other crimes, wrongs, or acts \"lies largely within the sound discretion of the trial court\" and \"will not be reversed on appeal absent a showing of abuse of discretion.\" State v. Laureano, 101 Wash. 2d 745, 764, 682 P.2d 889 (1984). However, a review of the evidentiary decision at issue here is also influenced by the fact that the evidence that was admitted had the potential to affect the imposition of the death penalty, which this Court recognizes \"qualitatively differs from all other punishments.\" State v. Lord, 117 Wash. 2d 829, 888, 822 P.2d 177 (1991), cert. denied, 506 U.S. 856, 121 L. Ed. 2d 112, 113 S. Ct. 164 (1992). Because of this qualitative difference, review of a claimed error associated with the sentencing phase of a capital case must receive a more careful review of the record to assure that \"there [is] reliability in the determination that death is the appropriate punishment.\" Id. See also Mak v. Blodgett, 754 F. Supp. 1490, 1493-94 (W.D. Wash. 1991) (\"The Constitution requires the most careful scrutiny of every case in which a person has been sentenced to death.\"), aff'd, 972 F.2d 1340 (9th cir. 1992), cert. denied, 507 U.S. 951, 122 L. Ed. 2d 742, 113 S. Ct. 1363 (1993).\n\nA careful review of the record of this case indicates that the State properly notified the Defendant of the State's intent to seek the death penalty, and that each member of the jury was questioned at voir dire about his or her views with respect to the death penalty. It is, therefore, beyond debate that the parties, as well as the trial Judge, were well aware that a special sentencing proceeding, as provided by RCW 10.95.020-.070, would be required if the jury found Brown guilty as charged of aggravated first degree murder. We must also assume that the trial Judge was aware that it \"is well settled that all evidence which is admissible in the guilt phase [of a capital case] is also admissible in the penalty phase.\" In re Lord, 123 Wash. 2d 296, 322, 868 P.2d 835, cert. denied, 513 U.S. 849, 130 L. Ed. 2d 86, 115 S. Ct. 146 (1994) (citing State v. Bartholomew, 101 Wash. 2d 631, 643, 683 P.2d 1079 (1984) and State v. Mak, 105 Wash. 2d 692, 720-21, 718 P.2d 407, cert. denied, 479 U.S. 995, 93 L. Ed. 2d 599, 107 S. Ct. 599 (1986)).\n\nDuring the penalty phase, the essential question that the jury must answer is whether it is \"convinced beyond a reasonable doubt that there are not sufficient mitigating circumstances to merit leniency.\" RCW 10.95.060(4). In order to assure that the special sentencing proceeding in a capital case comports with \"state and federal constitutional standards,\" the Court has specifically held that the province of the jury in such proceedings \"must be limited to mitigating evidence . . . . and mitigating factors only.\" Bartholomew, 101 Wash. 2d at 642 (emphasis added). As we stated in Bartholomew, \"in most cases the prosecution may open only with the defendant's criminal record and evidence which would have been admissible at the guilt phase of the trial.\" Bartholomew, 101 Wash. 2d at 643. Therefore, the State acted properly in this case when it sought to admit evidence that Brown has a criminal record of prior convictions. However, because the \"introduction of a certified copy of the judgment and sentence is the preferred way to introduce a prior conviction when it is admissible,\" Ms. Schnell's detailed testimony would not have been admissible at the penalty phase unless it would have been admissible at the guilt phase, or offered in specific rebuttal to a mitigating factor raised by the Defendant. State v. Gentry, 125 Wash. 2d 570, 638, 888 P.2d 1105, cert. denied, 133 L. Ed. 2d 79, 116 S. Ct. 131 (1995). As explained above, the evidence was not admissible during the guilt phase.\n\nLooking to the penalty phase, it is indisputable that Ms. Schnell's testimony is probative on the question of whether leniency is warranted. However, one of the reasons, if not the primary reason, such evidence is probative is because of its highly prejudicial nature. It is precisely for this reason that it is generally a violation of the Defendant's due process rights for the jury to even consider such evidence, unless it is relevant to rebut a mitigating factor that has been first raised by the Defendant. Lord, 117 Wash. 2d at 890 (\"When the defendant presents evidence of mitigating circumstances, the prosecution is not restricted to the record of convictions. The State is entitled to . . . introduce relevant evidence to rebut defendant's evidence so that the jury receives a balanced and complete picture.\") This is why this Court has ruled that although the State may, in the opening of the special sentencing proceeding, provide the jury with certified copies of judgments and sentences concerning defendant's prior convictions, it may not present additional evidence relating to those crimes unless such evidence relates to mitigating evidence or factors raised by the defendant. See Bartholomew, 101 Wash. 2d at 642.\n\nWith respect to the question of whether leniency is warranted, Ms. Schnell's account of Brown's violent acts constituting sexual assault and rape, offenses Brown was neither charged with nor convicted of, posed a significant danger of being unfairly prejudicial. See, e.g., State v. Bowen, 48 Wash. App. 187, 738 P.2d 316 (1987); State v. Ramirez, 46 Wash. App. 223, 730 P.2d 98 (1986); State v. Harris, 36 Wash. App. 746, 677 P.2d 202 (1984) (admission of such evidence was reversed because of prejudicial effect on a jury's deliberation of a defendant's guilt or innocence). The trial court should have considered the potential prejudice in the penalty phase when deciding in the guilt phase whether to admit the evidence.\n\nThe Supreme Court of New Jersey expressed similar concerns about the impact of guilt phase evidence on the jury's penalty determination in a capital case. State v. Erazo, 126 N.J. 112, 594 A.2d 232 (1991). The court said \"when the same jury hears both phases of such a case, evidence admitted on the guilt phase may sometimes taint the penalty phase. With the stakes so high, the possibility of prejudice on the penalty phase persists as a cause for continuing concern.\" Id. at 242.\n\nUpon properly considering the prejudicial impact of the evidence in the penalty phase, the Conclusion is unavoidable that the evidence was so overwhelmingly prejudicial to the jury's sentencing determination that it should not have been admitted. While admission may have been harmless as to the guilt phase, the same cannot be said when the jury's subjective determination of life or death was at issue.\n\nIn sum, the nature of the ER 404(b) evidence in this case was so inflammatory that the trial court's failure to balance the probative value of the evidence against the prejudicial impact as it relates to the penalty phase inquiry constitutes an abuse of discretion, for it cannot be said that there is reliability in the determination that death is the appropriate punishment. Lord, 117 Wash. 2d at 888. (\"Because the death penalty qualitatively differs from all other punishments, there must be reliability in the determination that death is the appropriate punishment.\")\n\nTo be assured of such reliability, I would remand for a new sentencing proceeding where Ms. Schnell's testimony is not presented to a new jury impaneled to determine Defendant's sentence.\n\nDissenting: Barbara A. Madsen\n\nGerry L. Alexander\n\nRichard B. Sanders\n\n\u003cspan class=\"fn\"\u003e1. A critical issue in this appeal is admissibility of the audio tapes admitted as State's Exhibit 89.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. See Black's Law Dictionary: Confession (\"A voluntary statement made by a person charged with the commission of a crime . . ., communicated to another person . . . [acknowledging oneself] to be guilty of the offense charged, and [disclosing] the circumstances of the act or the share and participation [the person charged] had in it.\") Admission (\"The avowal of a fact or of circumstances from which guilt may be inferred, but only tending to prove the offense charged, and not amounting to a confession of guilt.\")\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The \"knife\" referred to throughout this narrative was actually an all-purpose tool, with the brand name \"Leatherman,\" which contained multiple folding implements, including a knife blade.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Ex. 89, tape 1, side 2.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Ex. 89, tape 2, side 1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Ex. 89, tape 1, side 2.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Ex. 89, tape 2, side 1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Ex. 89, tape 2, side 1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Ex. 89, tape 2, side 1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Ex. 89, tape 2, side 2.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Ex. 89, tape 1, side 2.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Ex. 89, tape 2, side 1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Ex. 89, tape 3, side 1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14 Ex. 89, tape 1, side 2.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15 Ex. 89, tape 1, side 2.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16 She was taken to the hospital for emergency surgery. She survived and testified as a witness in the King County trial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17 The State also presented corroborating witness testimony and physical evidence. See Br. of Resp't at 24-27.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18 RCW 10.95.130(2)(a), (b), (c), and (d).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19 RCW 10.95.130(1).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20 Clerk's Papers at 1594 (Verdict Form).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21 State v. Pirtle, 127 Wash. 2d 628, 682, 904 P.2d 245 (1995), cert. denied, 135 L. Ed. 2d 1084, 116 S. Ct. 2568 (1996).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22 Report of Proceedings, December 16, 1993 at 31-32.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23 Report of Proceedings, December 17, 1993 at 24. Appellant was born April 16, 1953.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24 Report of Proceedings, December 16, 1993 at 31, 33.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25 Id. at 32-36.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26 Id. at 127-29.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27 Report of Proceedings, December 17, 1993 at 25-27.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28 Id. at 30.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29 Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30 Id. at 67.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31 Report of Proceedings, December 20, 1993 at 43-44; Report of Proceedings, December 17, 1993 at 70.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32 Report of Proceedings, December 21, 1993 at 110-13.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33 Id. at 102-10.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34 See State v. Lord, 117 Wash. 2d 829, 906, 822 P.2d 177 (1991) (upholding under RCW 10.95.130(2)(a) a jury's finding that antisocial personality disorder did not mitigate in favor of leniency for a capital appellant, noting that the disorder explained, but did not excuse, appellant's behavior) cert. denied, 506 U.S. 856, 121 L. Ed. 2d 112, 113 S. Ct. 164 (1992); see also State v. Dodd, 120 Wash. 2d 1, 25, 838 P.2d 86 (1992) (diagnosis of severe pedophilia did not merit leniency under RCW 10.95.130(2)(a)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35 Dodd, 120 Wash. 2d at 25.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36 Lord, 117 Wash. 2d at 907.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37 Br. of Appellant at 174.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38 Harris ex rel. Ramseyer v. Blodgett, 853 F. Supp. 1239, 1288 (W.D. Wash. 1994), aff'd, Harris ex rel. Ramseyer v. Wood, 64 F.3d 1432 (9th Cir. 1995).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39 State v. Brett, 126 Wash. 2d 136, 207-09, 212, 892 P.2d 29 (1995), cert. denied, 133 L. Ed. 2d 858, 116 S. Ct. 931 (1996).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40 Pirtle, 127 Wash. 2d at 683 (citing Brett).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41 State v. Gentry, 125 Wash. 2d 570, 655, 888 P.2d 1105 (1995), cert. denied, 133 L. Ed. 2d 79, 116 S. Ct. 131 (1995).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42 Lord, 117 Wash. 2d at 910 (citing Pulley v. Harris, 465 U.S. 37, 54, 104 S. Ct. 871, 79 L. Ed. 2d 29 (1984)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43 Both the appellant and the victim in this case are Caucasian.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44 Lord, 117 Wash. 2d at 910.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45 Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46 Brett, 126 Wash. 2d at 213.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47 State v. Harris, 106 Wash. 2d 784, 798, 725 P.2d 975 (1986), cert. denied sub nom. Harris v. Washington, 480 U.S. 940, 94 L. Ed. 2d 781, 107 S. Ct. 1592 (1987).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48 Compare Lord, 117 Wash. 2d at 911 (suggesting a \"family resemblances\" approach) with State v. Benn, 120 Wash. 2d 631, 680-693, 845 P.2d 289 (suggesting a statistically based approach).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49 RCW 10.95.130(b).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50 Pirtle, 127 Wash. 2d at 686.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51 Dodd, 120 Wash. 2d at 27.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52 Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53 Id. at 8.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54 Gentry, 125 Wash. 2d at 657-58.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55 Id. at 657.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56 See, e.g., Report of the Trial Judge, State v. Rupe (single gunshot wound to head of the victims; no torture); Report of the Trial Judge, State v. Jeffries (multiple gunshot wounds; no torture); Report of the Trial Judge, State v. Benn (gunshot wound to the head of the victims; no torture); Report of the Trial Judge, State v. Harris (gunshot wound to the head and neck of the victim; contract killing; no torture).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57 Gentry, 125 Wash. 2d at 657.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58 Clerk's Papers at 1451-52 (Special Verdict Form B).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59 RCW 10.95.030(2).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e60 See, e.g., Report of the Trial Judge, State v. Gentry (one aggravating factor: concealment of identity); Report of the Trial Judge, State v. Benn (one aggravating factor: multiple victims); Report of the Trial Judge, State v. Harris (one aggravating factor: contract murder); Report of the Trial Judge, State v. Jeffries (two aggravating factors: multiple victims, concealment of a crime).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e61 Report of the Trial Judge, State v. Brown; Report of Proceedings, December 15, 1993 at 45-46.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e62 See Report of the Trial Judge, State v. Rupe (no prior criminal convictions); Report of the Trial Judge, State v. Harris (two prior convictions: assault, manslaughter); Report of the Trial Judge, State v. Benn (many misdemeanors and three prior convictions: first degree theft, grand larceny, first degree theft).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e63 Pirtle, 127 Wash. 2d at 688.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e64 For a more detailed and thorough description of Appellant's mitigation evidence, see the Discussion on \"Sufficiency of the Evidence,\" supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e65 Pirtle, 127 Wash. 2d at 688.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e66 See, e.g., Dodd, 120 Wash. 2d at 11 (severe homosexual pedophilia); Lord, 117 Wash. 2d at 906 (antisocial personality disorder); State v. Rice, 110 Wash. 2d 577, 592-96, 757 P.2d 889 (1988) (evidence presented of \"deep personality disorder and disordered childhood,\" but \"no evidence of any organic central nervous system disease or intracranial abnormalities.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e67 Br. of Appellant at 179.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e68 Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e69 RCW 10.95.030(2)(a), (c).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e70 Report of Proceedings, December 20, 1993 at 114.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e71 State v. Russell, 125 Wash. 2d 24, 85, 882 P.2d 747 (1994).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e72 Pirtle, 127 Wash. 2d at 672.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e73 Id. at 85-86.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e74 Id. at 86.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e75 Russell, 125 Wash. 2d at 85.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e76 Id. at 86.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e77 Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e78 See Russell, 125 Wash. 2d at 89 (incorporation of improper statements made by prosecuting attorney into defense argument weakened defendant's contention the statements denied him a fair trial).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e79 Gentry, 125 Wash. 2d at 641.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e80 Russell, 125 Wash. 2d at 87.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e81 Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e82 Id. at 86.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e83 Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e84 See Gentry, 125 Wash. 2d at 641.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e85 Report of Proceedings, December 6, 1993 at 104-105.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e86 See Clerk's Papers at 1420.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e87 State v. Lough, 125 Wash. 2d 847, 853, 889 P.2d 487 (1995).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e88 Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e89 State v. Lane, 125 Wash. 2d 825, 831, 889 P.2d 929 (1995).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e90 Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e91 State v. Tharp, 96 Wash. 2d 591, 594, 637 P.2d 961 (1981).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e92 ER 404(b); see also State v. Powell, 126 Wash. 2d 244, 258, 893 P.2d 615 (1995) (citing exceptions).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e93 Pirtle, 127 Wash. 2d at 649; Powell, 126 Wash. 2d at 258; Lane, 125 Wash. 2d at 832 (citing State v. Saltarelli, 98 Wash. 2d 358, 362, 655 P.2d 697 (1982)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e94 Lane, 125 Wash. 2d at 831; State v. Smith, 106 Wash. 2d 772, 776, 725 P.2d 951 (1986); Saltarelli, 98 Wash. 2d at 361-62; see also Pirtle, 127 Wash. 2d at 649.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e95 Saltarelli, 125 Wash. 2d at 361-62; Powell, 126 Wash. 2d at 259.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e96 Pirtle, 127 Wash. 2d at 649.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e97 Laureano, 101 Wash. 2d at 764.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e98 Pirtle, 127 Wash. 2d at 648; Lane, 125 Wash. 2d at 831; Laureano, 101 Wash. 2d at 764.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e99 Powell, 126 Wash. 2d at 258.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e100 Report of Proceedings, December 6, 1993 at 135.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e101 Id. at 141.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e102 Id. at 141-42.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e103 Id. at 154-55.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e104 Report of Proceedings, December 15, 1993 at 45-46.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e105 State v. Laureano, 101 Wash. 2d 745, 764, 682 P.2d 889 (1984), overruled on other grounds, by State v. Brown, 111 Wash. 2d 124, 761 P.2d 588 (1988), adhered to on rehearing, 113 Wash. 2d 520, 782 P.2d 1013 (1989) (citing Tegland); 5 Karl B. Tegland, Wash. Prac. Evidence 114, at 386 (3d ed. 1989).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e106 See Lane, 125 Wash. 2d at 831; see also John W. Strong, McCormick on Evidence, 190, at 799 (4th ed. 1992) (res gestae evidence admissible \"to complete the story of the crime on trial by placing it in the context of nearby and nearly contemporaneous happenings.\") (footnote omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e107 See Lane, 125 Wash. 2d at 833 (evidence of events occurring within a 2- or 3-day period of the charged crime admissible under res gestae exception to ER 404(b)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e108 Brett, 126 Wash. 2d at 181; State v. Laviollette, 118 Wash. 2d 670, 676, 826 P.2d 684 (1992) (citing Grady v. Corbin, 495 U.S. 508, 521, 110 S. Ct. 2084, 109 L. Ed. 2d 548 (1990)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e109 Along with his double jeopardy claim, Appellant also argues his due process rights were violated when the trial court refused to \"tell the jury [in the penalty phase] it could not consider the Susan Schnell facts as well as the uncharged sexual offense in deciding whether to impose death or life without parole.\" Br. of Appellant at 129.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e110 Clerk's Papers at 1089-90.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e111 Report of Proceedings, November 16, 1993 at 10.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e112 Id. at 10-11.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e113 Report of Proceedings, November 30, 1993 at 77.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e114 Clerk's Papers at 1419. See Jury Instruction Number 7.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e115 Laureano, 101 Wash. 2d at 764.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e116 Appellant's reliance on State v. Halstien, 122 Wash. 2d 109, 857 P.2d 270 (1993) for the proposition that Rule 404(b) applies to this testimony is misplaced. In Halstien, the defendant was convicted of burglary with a finding of sexual motivation, and the trial court had ruled that evidence of the defendant's prior contacts with the victim did not constitute prior bad acts under ER 404(b). Halstien, 122 Wash. 2d at 125-26. This court held that prior bad acts included \"acts that are merely unpopular or disgraceful\" and concluded that defendant's prior contacts with the victim fell within the scope of Rule 404(b). Id. at 126. However, the defendant in that case had made the victim feel uncomfortable in their prior contacts by \"watching her,\" asking unwelcome and inappropriate questions, and giving her \"the creeps.\" Id. at 112-113. In this case, neither Ms. Gray nor Ms. West expressed any similar concerns regarding their prior contacts with Appellant.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e117 Appellant also argues that admission of the testimony of Ms. Gray and Ms. West \"for eventual use in the penalty phase without the appropriate limiting instruction . . . permitted the jury to consider Mr. Brown's propensity to 'stalk' other victims besides Holly Washa.\" Brief of Appellant at 132. The testimony did not suggest Appellant was stalking either woman. And the court's limiting instruction on the matter, given twice to the jury, made that point sufficiently clear.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e118 Miranda v. Arizona, 384 U.S. 436, 86 S. Ct. 1602, 16 L. Ed. 2d 694 10 A.L.R.3d 974 (1966).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e119 See RAP 2.5(a)(3).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e120 Ex. 89, Tape 1, side 1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e121 Ex. 89, Tape 2, side 1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e122 Ex. 89, Tape 3, side 1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e123 Miranda, 86 S. Ct. at 1630.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e124 See Duckworth v. Eagan, 492 U.S. 195, 109 S. Ct. 2875, 2879 106 L. Ed. 2d 166 (1989); Cooper v. Dupnik, 963 F.2d 1220, 1239-40 (9th Cir.) cert. denied, 506 U.S. 953, 121 L. Ed. 2d 332, 113 S. Ct. 407 (1992); State v. Creach, 77 Wash. 2d 194, 461 P.2d 329 (1969).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e125 Oregon v. Elstad, 470 U.S. 298, 105 S. Ct. 1285, 1292, 84 L. Ed. 2d 222 (1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e126 Duckworth, 109 S. Ct. at 2880.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e127 Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e128 Id. at 2880.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e129 People of the Territory of Guam v. Snaer, 758 F.2d 1341, 1342-43, (9th Cir.), cert. denied, 474 U.S. 828, 106 S. Ct. 90, 88 L. Ed. 2d 74 (1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e130 Id. at 1342.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e131 Id. at 1343.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e132 Id. at 1343 (quoting United States v. Noti, 731 F.2d 610, 614-15 (9th Cir. 1984)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e133 See State v. Koopman, 68 Wash. App. 514, 520, 844 P.2d 1024 (1992), rev. denied, 121 Wash. 2d 1012, 852 P.2d 1091 (1993) (rejecting appellant's claim that her Miranda warnings were defective because she had not been explicitly told she had the right to have counsel present before and during questioning).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e134 State v. Fjermestad, 114 Wash. 2d 828, 834, 791 P.2d 897 (1990); State v. Wanrow, 88 Wash. 2d 221, 233, 559 P.2d 548 (1977).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e135 State v. Cunningham, 93 Wash. 2d 823, 829, 613 P.2d 1139 (1980).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e136 State v. Rupe, 101 Wash. 2d 664, 683, 683 P.2d 571 (1984).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e137 RCW 9.73.030(1)(b) provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(1) Except as otherwise provided in this chapter, it shall be unlawful for . . . the state of Washington, its agencies, and political subdivisions to intercept, or record any:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(b) Private conversation, by any device electronic or otherwise designed to record or transmit such conversation . . . without first obtaining the consent of all the persons engaged in the conversation.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e138 Supplementation of Report of Proceeding, July 10, 1992, at 2.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e139 See Cal. Penal Code 632, 633 and 633.5 (West 1992 Supp.).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e140 State v. Gwinner, 59 Wash. App. 119, 796 P.2d 728 (1990), review denied, 117 Wash. 2d 1004, 815 P.2d 266 (1991).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e141 State v. Mollica, 114 N.J. 329, 554 A.2d 1315 (N.J. 1989).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e142 State v. Johnson, 75 Wash. App. 692, 879 P.2d 984 (1994), review denied, 126 Wash. 2d 1004 (1995).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e143 Gwinner, 59 Wash. App. at 120.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e144 State v. Mollica, 114 N.J. 329, 554 A.2d 1315 (N.J. 1989).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e145 Gwinner, 59 Wash. App. at 124 (citing Mollica, 554 A.2d at 1324-26).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e146 Id. (citing Mollica, 554 A.2d at 1324). However, the Supreme Court rejected the silver platter doctrine in 1960. Elkins v. United States, 364 U.S. 206, 223, 80 S. Ct. 1437, 1447, 4 L. Ed. 2d 1669 (1960).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e147 Gwinner, 59 Wash. App. at 125 (citing Mollica, 554 A.2d at 1327).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e148 Id. (citing Mollica, 554 A.2d at 1327-29).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e149 Id. (citing Mollica, 554 A.2d at 1329-30).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e150 Id. at 125.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e151 Id. (quoting Mollica, 554 A.2d at 1329).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e152 Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e153 Johnson, 75 Wash. App. at 700 (quoting Gwinner, 59 Wash. App. at 125).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e154 Ex. 89, tape 2, side 1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e155 The trial court found an agency relationship was created when the State asked the Palm Springs police to question Appellant further. However, the court concluded that the King County police did not know the statements would be recorded; no evidence suggested King County police were trying to violate Washington law; and the Palm Springs police were following California law. Thus, suppressing the tapes would not further Washington's interest. Report of Proceedings, 4-B, at 53-55.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e156 State v. Mayes, 20 Wash. App. 184, 579 P.2d 999, review denied, 91 Wash. 2d 1001 (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e157 Id. at 193.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e158 State v. Williams, 94 Wash. 2d 531, 540 at n. 1, 617 P.2d 1012 24 A.L.R. 4th 1191 (1980) (citing Mayes, 20 Wash. App. at 193).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e159 Williams, 94 Wash. 2d at 540, n. 1 (citing Commonwealth v. Bennett, 245 Pa. Super. 457, 369 A.2d 493 (Pa. Super. Ct. 1976)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e160 Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e161 In re Teddington, 116 Wash. 2d 761, 772-73, 808 P.2d 156 (1991). See also State v. Bradley, 105 Wash. 2d 898, 902-03, 719 P.2d 546 (1986) (\"Neither state law nor the state constitution can control federal officers' conduct\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e162 See Draper v. Washington, 372 U.S. 487, 496-498, 9 L. Ed. 2d 899, 83 S. Ct. 774, 779-780, cert. denied 374 U.S. 850, 10 L. Ed. 2d 1070, 83 S. Ct. 1914 and 374 U.S. 852 (1963). see also State v. Larson, 62 Wash. 2d 64, 66-67, 381 P.2d 120 (1963). (\"Under the rule of the Draper case, we must have a 'record of sufficient completeness' for a review of the errors raised by the defendant in a criminal case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e163 See Ex. 89. The extensive verbatim record of proceedings consists of more than 50 volumes. The Clerk's Papers number more than 1700. The trial court admitted 93 exhibits.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e164 Report of Proceedings, September 15, 1993 at 2-12.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e165 Wainwright v. Witt, 469 U.S. 412, 424, 105 S. Ct. 844, 83 L. Ed. 2d 841 (1985) (quoting Adams v. Texas, 448 U.S. 38, 45, 100 S. Ct. 2521, 65 L. Ed. 2d 581 (1980)); State v. Brett, 126 Wash. 2d 136, 157, 892 P.2d 29 (1995) (quoting State v. Hughes, 106 Wash. 2d 176, 181, 721 P.2d 902 (1986), quoting Wainwright v. Witt, 469 U.S. at 424) cert. denied, 116 S. Ct. 931 (1996)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e166 See Hughes, 106 Wash. 2d at 180.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e167 Lockhart v. McCree, 476 U.S. 162, 106 S. Ct. 1758, 90 L. Ed. 2d 137 (1986); Wainwright v. Witt, 469 U.S. 412, 83 L. Ed. 2d 841, 105 S. Ct. 844; Adams v. Texas, 448 U.S. 38, 65 L. Ed. 2d 581, 100 S. Ct. 2521; Witherspoon v. Illinois, 391 U.S. 510, 88 S. Ct. 1770, 20 L. Ed. 2d 776 (1968).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e168 Brief of Appellant at 94-101, 105-12. Although Appellant also contends death qualification disproportionately excludes minorities and women from the jury panel, he does so in general terms, and does not claim the jury in this case was disproportionately exclusive of women or minorities. The record does not support that claim. And Appellant presents no evidence showing that death qualification in Washington results in the systematic exclusion of minorities and women from the jury panel.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e169 State v. Gunwall, 106 Wash. 2d 54, 720 P.2d 808, 76 A.L.R. 4th 517, (1986). In State v. Hughes, 106 Wash. 2d 176, 721 P.2d 902 this Court concluded that death qualifying a jury was permissible not only under the federal constitution, but under the state constitution as well. Some cases have relied upon Hughes to reach the same Conclusion. See State v. Gentry, 125 Wash. 2d 570, 634, 888 P.2d 1105, cert. denied, 133 L. Ed. 2d 79, 116 S. Ct. 131 (1995); State v. Kron, 63 Wash. App. 688, 695, 821 P.2d 1248, review denied, 119 Wash. 2d 1004, 832 P.2d 487 (1992); State v. Peerson, 62 Wash. App. 755, 779, 816 P.2d 43 (1991), review denied, 118 Wash. 2d 1012, 824 P.2d 491 (1992). But Hughes did not analyze the six factors in State v. Gunwall to conclude that death qualification is allowed under the Washington Constitution. Thus, in determining whether death qualification violates the Washington Constitution, Hughes and the cases following do not control at this point. See State v. Irizarry, 111 Wash. 2d 591, 595-97, 763 P.2d 432 (1988) (Utter, J., Concurring).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e170 Gunwall, 106 Wash. 2d at 61-62.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e171 State v. Wethered, 110 Wash. 2d 466, 472-73, 755 P.2d 797 (1988); State v. Olivas, 122 Wash. 2d 73, 82, 856 P.2d 1076 (1993). See also State v. Brett, 126 Wash. 2d 136, 159, 892 P.2d 29 (1995) (declining to discuss the defendant's right to an impartial jury under Const. art. I, 22 because the Gunwall factors were not analyzed) cert. denied, 133 L. Ed. 2d 858, 116 S. Ct. 931 (1996).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e172 City of Pasco v. Mace, 98 Wash. 2d 87, 653 P.2d 618 (1982).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e173 See State v. Hobble, 126 Wash. 2d 283, 298-90, 892 P.2d 85 (1995).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e174 Pasco v. Mace, 98 Wash. 2d 87, 653 P.2d 618.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e175 State v. Lane, 40 Wash. 2d 734, 246 P.2d 474 (1952).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e176 State v. Stegall, 124 Wash. 2d 719, 723, 881 P.2d 979 (1994).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e177 Lane, 40 Wash. 2d at 737.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e178 Stegall, 124 Wash. 2d at 729.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e179 State v. Schaaf, 109 Wash. 2d 1, 743 P.2d 240 (1987).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e180 See The Journal of the Washington Constitutional Convention 510-11 (Beverly P. Rosenow ed., 1962).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e181 Gunwall, 106 Wash. 2d at 61-62.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e182 State v. Gocken, 127 Wash. 2d 95, 105, 896 P.2d 1267 (1995) (citing State v. Young, 123 Wash. 2d 173, 180, 867 P.2d 593 (1994)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e183 Taylor v. Louisiana, 419 U.S. 522, 538, 95 S. Ct. 692, 42 L. Ed. 2d 690 (1975).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e184 Morgan v. Illinois, 504 U.S. 719, 725-26, 112 S. Ct. 2222, 119 L. Ed. 2d 492 (1992) (quoting Spaziano v. Florida, 468 U.S. 447, 464, 104 S. Ct. 3154, 82 L. Ed. 2d 340 (1984)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e185 E.g., Hughes, 106 Wash. 2d 176, 181, 721 P.2d 902; Gentry, 125 Wash. 2d 570, 634, 888 P.2d 1105.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e186 Appellant urges this Court to adopt several Dissenting opinions of cases from New Jersey and Utah, including State v. Ramseur, 106 N.J. 123, 524 A.2d 188, 250-57 (1987), cert. denied, 508 U.S. 947, 124 L. Ed. 2d 653, 113 S. Ct. 2433 (1995) State v. Bey (II), 112 N.J. 123, 548 A.2d 887, 900 (1988), State v. Marshall, 123 N.J. 1, 586 A.2d 85, 129-34 (1991) and State v. Young, 853 P.2d 327, 342-43 (Utah 1993), from which Appellant cites extensively to support his claim that death qualification violates the Washington constitution. The Gunwall analysis contradicts his claim. Although informative, those Dissenting opinions do not affect our independent state constitutional analysis.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e187 State v. Hughes, 106 Wash. 2d 176, 721 P.2d 902.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e188 State v. Mak, 105 Wash. 2d 692, 707, 718 P.2d 407, cert. denied, 479 U.S. 995, 93 L. Ed. 2d 599, 107 S. Ct. 599 (1986), sentence vacated on writ of habeas corpus sub nom. Mak v. Blodgett, 754 F. Supp. 1490 (W.D. Wash. 1991), aff'd, 970 F.2d 614 (9th Cir. 1992), cert. denied, 507 U.S. 951, 113 S. Ct. 1363, 122 L. Ed. 2d 742 (1993).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e189 Hughes, 106 Wash. 2d at 185 (citing Hayes v. Missouri, 120 U.S. 68, 70-71, 7 S. Ct. 350, 30 L. Ed. 578 (1887)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e190 Id. at 185-86 (quoting Smith v. Balkcom, 660 F.2d 573, 579 (5th Cir. 1981), modified on other grounds, 671 F.2d 858 (5th Cir.), cert. denied, 459 U.S. 882 (1982)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e191 Id. at 186 (quoting Smith, 660 F.2d at 579).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e192 Id. at 186 (quoting Lockhart v. McCree, 476 U.S. at 184).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e193 Grigsby v. Mabry, 758 F.2d 226 (8th Cir. 1985), rev'd sub nom. Lockhart v. McCree, 476 U.S. 162, 90 L. Ed. 2d 137, 106 S. Ct. 1758 (1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e194 Hughes, 106 Wash. 2d at 182-84. Hughes also rejects Appellant's suggestion that separate juries should be required for the guilt and penalty phase. Id. at 186-88.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e195 Former RCW 10.49.050 provided:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"No person whose opinions are such as to preclude him from finding any defendant guilty of an offense punishable with death shall be compelled or allowed to serve as a juror on the trial of any indictment or information for such an offense.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e196 Witherspoon, v. Illinois, 391 U.S. 510, 88 S. Ct. 1770, 20 L. Ed. 2d 776 (1968).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e197 E.g., Gentry, 125 Wash. 2d at 634; Mak, 105 Wash. 2d at 707; Hughes, 106 Wash. 2d at 180-88.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e198 Spaziano v. Florida, 468 U.S. at 464.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e199 Wainwright v. Witt, 469 U.S. 412, 105 S. Ct. 844, 83 L. Ed. 2d 841 (1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e200 Witt, 469 U.S. at 430.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e201 Brett, 126 Wash. 2d at 158; Gentry, 125 Wash. 2d at 634 (citing State v. Rupe, 108 Wash. 2d 734, 759, 743 P.2d 210 (1987), cert. denied, 486 U.S. 1061, 100 L. Ed. 2d 934, 108 S. Ct. 2834 (1988)); Mak, 105 Wash. 2d at 707).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e202 Gentry, 125 Wash. 2d at 634 (citing Wainwright, 469 U.S. at 425-26; In re Lord, 123 Wash. 2d 296, 309, 868 P.2d 835 (1994)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e203 Brett, 126 Wash. 2d at 158 (citing Rupe, 108 Wash. 2d at 749).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e204 Witt, 469 U.S. at 428, n. 9 (quoting Reynolds v. United States, 98 U.S. 145, 156-57, 25 L. Ed. 244 (1878)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e205 Brett, 126 Wash. 2d at 157; Gentry, 125 Wash. 2d at 635; Wainwright, 469 U.S. at 424.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e206 Report of Proceedings, November 4, 1993, at 79.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e207 Report of Proceedings, November 4, 1993, at 79.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e208 Report of Proceedings, November 4, 1993, at 84.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e209 Report of Proceedings, November 4, 1993, at 93.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e210 Report of Proceedings, November 3, 1993, at 95.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e211 Report of Proceedings, November 3, 1993, at 101. Ms. Henderson crossed her arms, held her hand up and sat back.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e212 Clerk's Papers at 1423.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e213 State v. Rice, 110 Wash. 2d 577, 603, 757 P.2d 889 (1988), cert. denied, 491 U.S. 910, 105 L. Ed. 2d 707, 109 S. Ct. 3200 (1988); State v. Benn, 120 Wash. 2d 631, 657-58, 845 P.2d 289, cert. denied, 510 U.S. 944, 114 S. Ct. 382, 126 L. Ed. 2d 331 (1993).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e214 Clerk's Papers at 1175.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e215 Brett, 126 Wash. 2d at 171, (citation omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e216 Id.; Gentry, 125 Wash. 2d at 613, (citation omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e217 Rice, 110 Wash. 2d at 603.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e218 Benn, 120 Wash. 2d at 655.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e219 Clerk's Papers at 1438.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e220 RCW 9A.08.010(1)(a) states that \"[a] person acts with intent or intentionally when he acts with the objective or purpose to accomplish a result which constitutes a crime.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e221 RCW 9A.32.030(1)(a) provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Murder in the first degree. (1) A person is guilty of murder in the first degree when:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(a) With a premeditated intent to cause the death of another person, he or she causes the death of such person or of a third person . . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e222 Clerk's Papers at 1. Under RCW 9A.32.030(1)(a), a person is guilty of murder in the first degree when, with premeditated intent to cause the death of another person, the accused causes the death of that person or of a third person. RCW 10.95.020(9) provides that a person is guilty of aggravated first degree murder by committing first degree murder \"in the course of, in the furtherance of, or in immediate flight from . . .(a) Robbery in the first or second degree; (b) Rape in the first or second degree . . . (d) Kidnapping in the first degree[.]\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e223 Brett, 126 Wash. 2d at 166.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e224 State v. Golladay, 78 Wash. 2d 121, 132, 470 P.2d 191 (1970), overruled on other grounds, State v. Arndt, 87 Wash. 2d 374, 378, 553 P.2d 1328 (1976).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e225 State v. Leech, 114 Wash. 2d 700, 706, 790 P.2d 160 (1990). See State v. Dudrey, 30 Wash. App. 447, 450, 635 P.2d 750 (1981), review denied, 96 Wash. 2d 1026 (1982).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e226 Golladay, 78 Wash. 2d at 130.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e227 2 Wayne R. LaFave \u0026 Austin W. Scott, Jr. Substantive Criminal Law 7.5, at 225 (discussing \"causal connection\" necessary between felony and murder in felony murder cases).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e228 Leech, 114 Wash. 2d 700, 790 P.2d 160.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e229 Dudrey, 30 Wash. App. 447, 635 P.2d 750.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e230 Id. at 450.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e231 Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e232 Golladay, 78 Wash. 2d at 131.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e233 Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e234 Appellant conceded at trial the kidnapping was a continuing course of conduct and the killing was committed \"in immediate flight from\" the kidnapping. The record shows he kept Ms. Washa captive until her death. Thus, the kidnapping did not terminate until Appellant killed her and immediately left for California. The killing was committed \"in the course of\" and \"in immediate flight from\" the kidnapping.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e235 Clerk's Papers at 1410.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e236 Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e237 See State v. Scott, 110 Wash. 2d 682, 694, 757 P.2d 492 (1988) (Utter, J., Dissenting).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e238 State v. Allen, 101 Wash. 2d 355, 358, 678 P.2d 798 (1984); Scott, 110 Wash. 2d at 689.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e239 Allen, 101 Wash. 2d at 361-62.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e240 Benn, 120 Wash. 2d at 673-74; State v. Jeffries, 105 Wash. 2d 398, 420, 717 P.2d 722, cert. denied, 479 U.S. 995 (1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e241 Benn, 120 Wash. 2d at 674.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e242 Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e243 State v. Bartholomew, 101 Wash. 2d 631, 647, 683 P.2d 1079 (1984).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e244 Scott, 110 Wash. 2d at 692 (citation omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e245 State v. Ng, 110 Wash. 2d 32, 42, 750 P.2d 632 (1988).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e246 Scott, 110 Wash. 2d at 690 (citation omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e247 See Clerk's Papers at 1411-1441 (\"Court's Instructions to the Jury\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e248 See Appellant's proposed instructions P-9A, P-9B, P-11, P12, P-13, P-17, P-21, P-22 and P-23.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e249 Compare Zant v. Stephens, 462 U.S. 862, 873-80, 103 S. Ct. 2733, 77 L. Ed. 2d 235 (1983) (reviewing Georgia's \"non-weighing\" death penalty statute) with Stringer v. Black, 503 U.S. 222, 229-35, 112 S. Ct. 1130, 117 L. Ed. 2d 367 (1992) (concluding Mississippi has a \"weighing\" death penalty statute).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e250 In Williams v. Calderon, 52 F.3d 1465, 1478 n. 11-13 (9th Cir. 1995), cert. denied, 133 L. Ed. 2d 863, 116 S. Ct. 937 (1996), the United States Court of Appeals for the Ninth Circuit noted states with weighing or non-weighing death penalty statutes, according to state and federal court decisions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe following states were identified or treated as having \"non-weighing\" death penalty statutes: Georgia, Zant v. Stephens, 462 U.S. 862, 77 L. Ed. 2d 235, 103 S. Ct. 2733 (1983)(Ga.Code.Ann. 17-10-30 (Michie 1994)); Illinois, People v. Todd, 154 Ill. 2d 57, 607 N.E.2d 1189, 1197-98, 180 Ill. Dec. 676 (1992) (Ill.Comp.Stat.Ann. 5/9-1 (1992)), cert. denied, 510 U.S. 944, 114 S. Ct. 381, 126 L. Ed. 2d 331 (1993)); Kentucky, Wilson v. Commonwealth, 836 S.W.2d 872, 891 (Ky. 1992) (Ky.Rev.Stat.Ann. 532.025 (Michie/Bobbs-Merrill 1994)), cert. denied, 507 U.S. 1034, 113 S. Ct. 1857, 123 L. Ed. 2d 479 (1993)); Louisiana, Ward v. Whitley, 21 F.3d 1355, 1365 (5th Cir. 1994) (La.Code. Crim.Proc.Ann. art. 905.3-.4 (West 1994)), cert. denied, U.S. , 115 S. Ct. 1257, 131 L. Ed. 2d 137 (1995); Virginia, Briley v. Bass, 742 F.2d 155, 166 (4th Cir.) (Va.Code Ann. 19.2-264.2, 19.2-264.4 (Michie 1994)), cert. denied, 469 U.S. 893, 105 S. Ct. 270, 83 L. Ed. 2d 206 (1984); Delaware, Bailey v. Snyder, 855 F. Supp. 1392, 1408-10 (D. Del. 1993) (Del.Code Ann. tit. 11, 4209 (1994) aff'd, 68 F.3d 736. 3rd Cir. 1995), cert. denied; 116 S. Ct. 807, 133 L. Ed. 2d 754 (1996) and State v. LaRette, 648 S.W.2d 96, 102 (Mo.), (Mo.Ann.Stat. 565.030, 565.032 (Vernon 1994)). cert. denied, 464 U.S. 908, 104 S. Ct. 262, 78 L. Ed. 2d 246 (1983).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe following states were identified or treated as having \"weighing\" death penalty statutes: Alabama, Lawhorn v. State, 581 So. 2d 1159, 1176 (Ala.Crim.App. 1990) (Ala.Code 13A-5-46 to -49 (1994)), aff'd, Ex parte Lawhorn, 581 So. 2d 1179 (Ala. 1991) cert. denied. 502 U.S. 970, 116 L. Ed. 2d 463, 112 S. Ct. 445); Arizona, Richmond v. Lewis, 506 U.S. 40, 113 S. Ct. 528, 121 L. Ed. 2d 411; 534-35, 121 L. Ed. 2d 411 (1992) (Ariz.Rev.Stat.Ann. 13-703 (1994)); Arkansas, Ford v. Lockhart, 861 F. Supp. 1447, 1453 (E.D. Ark. 1994) (Ark.Code Ann. 5-4 -602 to -604 (1994)); Colorado, People v. White, 870 P.2d 424, 447-49 (Colo.) (Colo.Rev.Stat. 16-11-103 (1994)), cert. denied, U.S. , 115 S. Ct. 127, 130 L. Ed. 2d 71 (1994); Florida, Parker v. Dugger, 498 U.S. 308, 318, 111 S. Ct. 731, 737-38, 112 L. Ed. 2d 812 (1991) (Fla.Stat.Ann. 921.141 (West 1995)); Indiana, Bellmore v. State, 602 N.E.2d 111, 129-30 (Ind. 1992) (Ind.Code Ann. 35-50-2-9 (West 1994)); Mississippi, Stringer v. Black, 503 U.S. 222, 229-30, 112 S. Ct. 1130, 1136, 117 L. Ed. 2d 367 (1992) (Miss.Code Ann. 99-19-101 (1993)); Nebraska, State v. Reeves, 239 Neb. 419, 476 N.W.2d 829, 836 (1991) (Neb.Rev.Stat. 29-2522 to 29-2523 (1993)), cert. denied, 506 U.S. 837, 113 S. Ct. 114, 121 L. Ed. 2d 71 (1992); Nevada, Canape v. State, 109 Nev. 864, 859 P.2d 1023, 1031-35 (1993) (Nev.Rev.Stat. 200.030, 200.033 (1993)), cert denied, 513 U.S. 862, 115 S. Ct. 176, 130 L. Ed. 2d 112 (1994); New Mexico, State v. Henderson, 109 N.M. 655, 789 P.2d 603, 609-10 (1990) (N.M.Stat.Ann. 31-20A-2, 31-20A-5 (1995)); North Carolina, Smith v. Dixon, 14 F.3d 956, 974 (4th Cir.) ( en banc ) (N.C.Gen.Stat. 15A-2000 (1994)), cert. denied, U.S. , 115 S. Ct. 129, 130 L. Ed. 2d 72 (1994); Ohio, State v. Davis, 38 Ohio St. 3d 361, 528 N.E.2d 925, 933 n. 11 (1988) (Ohio Rev.Code Ann. 2929.03-.04 (Anderson 1993)), cert. denied, 488 U.S. 1034, 109 S. Ct. 849, 102 L. Ed. 2d 980 (1989); Oklahoma, Stafford v. Saffle, 34 F.3d 1557, 1568 (10th Cir. 1994) (Okla.Stat.Ann. 701.10-.12 (West 1995)) cert. denied 131 L. Ed. 2d 751, 115 S. Ct. 1830 (1995); Pennsylvania, 508 Pa. 425, Commonwealth v. Holcomb, 508 Pa. 425, 498 A.2d 833, 849-51 \u0026 n. 16 (1985) (42 Pa.Cons.Stat.Ann. 9711 (1994)), cert. denied, 475 U.S. 1150, 106 S. Ct. 1804, 90 L. Ed. 2d 349 (1986); Tennessee, State v. Howell, 868 S.W.2d 238, 259-62 (Tenn. 1993) (Tenn.Code Ann. 39-13-204 (1994)), cert. denied, U.S. , 114 S. Ct. 1339, 127 L. Ed. 2d 687 (1994); Utah, State v. Archuleta, 850 P.2d 1232, 1247-48 (Utah) (Utah Code Ann. 76-3-207, 76-5-202 (1994), as interpreted by State v. Pierre, 572 P.2d 1338, 1347-48 (Utah 1977)), cert. denied, 510 U.S. 979, 114 S. Ct. 476, 126 L. Ed. 2d 427 (1993); Wyoming, Zant v. Stephens, 462 U.S. at 874 n. 12 (1983) (Wyo.Stat. 6-2-102 (1988)), as interpreted by Hopkinson v. State, 632 P.2d 79, 171 (Wyo. 1981), cert. denied, 455 U.S. 922, 102 S. Ct. 1280, 71 L. Ed. 2d 463 (1982).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e251 E.g., Parker v. Dugger, 498 U.S. 308, 318, 111 S. Ct. 731, 112 L. Ed. 2d 812 (1991).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e252 Richmond v. Lewis, 506 U.S. 40, 47, 113 S. Ct. 528, 121 L. Ed. 2d 411 (1992).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e253 Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e254 Id. at 46.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e255 Stringer, 503 U.S. at 236.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e256 Stringer, 503 U.S. at 232.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e257 Id. at 230 (discussing Georgia death penalty statute).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e258 Id. at 233 (discussing Louisiana death penalty statute).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e259 RCW 10.95.060(4).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e260 RCW 10.95.060; RCW 10.95.070. See State v. Jeffries, 105 Wash. 2d 398, 717 P.2d 722, State v. Mak, 105 Wash. 2d 692, 718 P.2d 407.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e261 Williams v. Carleron, 52 F.3d 1465, 1477-78 (9th Cir. 1995) (footnotes omitted) cert. denied, 116 S. Ct. 937 (1996).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e262 In Campbell v. Blodgett, 978 F.2d 1502, 1512-13 (9th Cir. 1992), the United States Court of Appeals for the Ninth Circuit determined that nothing in RCW 10.95 suggests the jury is required to engage in a balancing test, or impose the death penalty after finding the factors \"in balance.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e263 E.g., State v. Gentry, 125 Wash. 2d 570, 888 P.2d 1105 (victim impact evidence); State v. Bartholomew, 101 Wash. 2d 631, 683 P.2d 1079 (1984) (adult convictions and juvenile court adjudications of guilt); Delo v. Lashley, 507 U.S. 272, 113 S. Ct. 1222, 122 L. Ed. 2d 620 (1993) (unadjudicated criminal conduct).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e264 Benn, 120 Wash. 2d at 654.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e265 Id. at 655.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e266 Lord, 117 Wash. 2d at 861.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e267 Benn, 120 Wash. 2d at 654-55.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e268 Brett, 126 Wash. 2d at 182 (citation omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e269 Clerk's Papers at 1419-20 (Instruction 7 and Instruction 8).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e270 See Tuilaepa v. California, 512 U.S. 967, 114 S. Ct. 2630, 129 L. Ed. 2d 750 (1994).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e271 Tuilaepa, at 114 S. Ct. at 2638.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e272 RCW 10.95.070(8) specifically provides that a jury may consider whether there is a likelihood the defendant will pose a danger to others in the future.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e273 Zant, 462 U.S. at 890.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e274 Stringer, 503 U.S. at 231.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e275 Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e276 Zant, 462 U.S. at 879.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e277 Clerk's Papers at 1413 (Instruction 1).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e278 Clerk's Papers at 1581 (Instruction 1).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e279 E.g., State v. Bartholomew, 101 Wash. 2d at 640-41.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e280 In Appellant's brief, the argument heading for this section states: \"THE STATE FAILED TO SERVE ITS NOTICE OF INTENT TO SEEK THE DEATH PENALTY ON MR. BROWN OR HIS ATTORNEYS WITHIN 30 DAYS OF THE ARRAIGNMENT, REQUIRING THIS COURT TO STRIKE THE DEATH SENTENCE IN THIS CASE.\" Brief of Appellant at 55. However, in the argument section itself, Appellant only claims \"there is absolutely no proof\" the State served him or his attorneys. Id. at 56.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e281 RCW 10.95.040(1).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e282 RCW 10.95.040(2).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e283 RCW 10.95.040(3).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e284 Clerk's Papers at 37.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e285 Brief of Appellant at 56.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e286 Brief of Appellant at 56, n. 8.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e287 Dearbone, 125 Wash. 2d at 177.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e288 Clerk's Papers at 38, 47-49.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e289 Clerk's Papers at 275.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e290 Clerk's Papers at 652-64.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e291 Id. at 665-80.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e292 Id. at 686.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e293 Id.; Report of Proceedings, February 25, 1993 at 26-34.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e294 Clerk's Papers at 686.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e295 State v. Yates, 111 Wash. 2d 793, 797, 765 P.2d 291 (1988) (citing State v. Mak, 105 Wash. 2d 692, 718 P.2d 407).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e296 Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e297 See CrR 1.1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e298 Yates, 111 Wash. 2d at 797 (quoting Criminal Rules Task Force, Washington Proposed Rules of Criminal Procedure 77 (West Pub'g Co. ed. 1971)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e299 People v. Mitchell, 5 Cal. 4th 1229, 859 P.2d 102, 23 Cal. Rptr. 2d 403 (1993).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e300 Id. at 1232 (referencing 1054.1).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e301 Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e302 Clerk's Papers at 669-70, n.1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e303 Mitchell, 5 Cal. 4th at 1233.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e304 Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e305 Id. at 1237.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e306 Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e307 Id. at 1238.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e308 Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e309 Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e310 See CrR 1.1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e311 RCW 10.95 et seq. governs criminal proceedings involving the death penalty in this state. RCW 10.95.060, which sets forth the procedure to be followed in the penalty phase of a capital case, does not address the subject of discovery. Nor is that subject addressed elsewhere in the statute. See generally RCW 10.95.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e312 Mitchell, 5 Cal. 4th at 1233.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e313 Gentry, 125 Wash. 2d 570, 888 P.2d 1105 (1995).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e314 The State was aware the Gentry case was pending at the time. Report of Proceeding, December 15, 1993, at 108. In offering Mr. Washa's testimony the State explained: \"While we wanted to push hard and ask this Court to allow this evidence in front of the jury, we understand that that would put this Court in a very difficult position, but we would like to preserve the issue and be able to cross-appeal it. So essentially what we're asking this Court to do is make a ruling at this time that we don't like so that we would be able to cross-appeal.\" Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e315 Report of Proceedings, December 15, 1993, at 109.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e316 Id. at 632-33.\u003c/span\u003e\n\n",
    "body_length": 217350,
    "citedas": [
      "940 P.2d 546",
      "132 Wash.2d 529"
    ],
    "attorneys": "For Appellant: Ronald D. Ness, Ronald D Ness \u0026 Assoc, 420 Cline St, Port Orchard, WA 98366. Judith M. Mandel, Ronald D Ness \u0026 Assoc, 420 Cline Avenue, Port Orchard, WA 98366. Cal C. Brown (Appearing Pro Se), # 998921, Imu G-8, P.o. Box 520, Walla Walla, WA 99362. For Respondent: Lee D. Yates, Senior Deputy Pros Attny, Pros Atny Offc, 516 3rd Ave, Seattle, WA 98104. Brenda K. Pahmeier, King County Prosecutor's Office, W 554, King Co Courthouse, 516 3rd Ave, Seattle, WA 98104. Theresa L. Fricke, Senior Deputy Prosecuting Attorney, King Co Prosecutor's Ofc, 700 5th Ave, Ste 1850, Seattle, WA 98104. Cynthia S. Gannett, King Co Prosecutor's Ofc, 700 5th Ave, Ste 1850, Seattle, WA 98104.",
    "category": [
      "242",
      "36",
      "253",
      "78",
      "75"
    ],
    "judges": "Authored by Charles Z. Smith. Concurring: Barbara Durham, James M. Dolliver, Richard P. Guy, Charles W. Johnson, Philip A. Talmadge. Dissenting: Barbara A. Madsen, Gerry L. Alexander, Richard B. Sanders.",
    "citation_count": 185
  }
}
