{
  "id": "RojrP2YBTlTomsSBcFMv",
  "document": {
    "title": "United States v. De Aguilar",
    "full_title": "UNITED STATES OF AMERICA v. MARIA DEL SOCORRO PARDO VIUDA DE AGUILAR . UNITED STATES OF AMERICA V. ANTHONY CLARK, A/K/A ANTONIO CLARK . UNITED STATES OF AMERICA V. SISTER DARLENE NICGORSKI, SCHOOL SISTERS OF SAINT FRANCIS . UNITED STATES OF AMERICA V. PHILIP M. WILLIS-CONGER, A/K/A PHILLIP M. CONGER . UNITED STATES OF AMERICA V. JOHN M. FIFE . UNITED STATES OF AMERICA V. MARGARET JEAN HUTCHISON, A/K/A PEGGY HUTCHISON . UNITED STATES OF AMERICA V. WENDY LEWIN . UNITED STATES OF AMERICA V. RAMON DAGOBERTO QUINONES",
    "jurisdiction": "Ninth Circuit",
    "date": "1989-03-30T00:00:00.000Z",
    "docket": "Nos. 86-1208, 86-1209, 86-1210, 86-1211, 86-1212, 86-1213, 86-1214, 86-1215",
    "body": "HALL, Circuit Judge:\n\nAppellants were convicted of masterminding and running a modern-day underground railroad that smuggled Central American natives across the Mexican border with Arizona.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Beginning in Mexico, various appellants directed illegal aliens to several Arizona churches that operated as self-described sanctuaries. From Arizona, appellants sent many of these illegal aliens to Chicago, Illinois, where they were subsequently dispersed throughout the United States to so-called safehouses. Appellants were sentenced to varying terms of probation; none received jail terms.\n\nAppellants contend that the aliens they smuggled, transported, and harbored are bona fide political refugees entitled to political asylum in the United States pursuant to the Refugee Act of 1980, Pub.L. No. 96-212, 94 Stat. 102 (codified in scattered sections of 8 U.S.C. (1982)). Yet appellants counseled the aliens to avoid American immigration authorities at all costs and to lie to them if apprehended. Appellants' disdain for federal immigration law is perhaps best evidenced by an episode at the Sacred Heart Church in Nogales, Arizona. Appellant Anthony Clark had arranged for a government informant to transport to Phoenix several illegal aliens. Two of these aliens had been intercepted and released by American immigration officials. The authorities had issued documents to these aliens requiring them to appear before an immigration judge. Clark took these documents and tore them up, instructing the aliens that they had erred by truthfully identifying themselves as Salvadoran citizens.\n\nAppellants offer two explanations to justify their avoidance of Immigration and Naturalization Service (INS) officials. First, appellants contend that the INS improperly failed to approve the meritorious political asylum applications of aliens who applied at official ports of entry. The INS's misfeasance, according to appellants, necessitated a course of deliberate avoidance of INS officials during and after an alien's entry into the United States. But appellants also seek to justify their policy of discouraging an alien from presenting himself to the INS on the basis that appellants were mistaken as to the necessity of such presentment. Appellants state that they believed the 1980 Refugee Act did not require either an alien's formal presentment to the INS or an application for political asylum in order for an alien to be legally entitled to reside here.\n\nThe tension between appellants' mistake of law explanation and their deliberate avoidance explanation is patent, and it permeates this entire case. On the one hand, appellants acknowledge a detailed understanding of and familiarity with the INS' procedures for the filing of applications for political asylum. But appellants also profess naivete and ignorance of the critical role of such presentment and application as a prerequisite to an alien's legal status.\n\nI\n\nAppellants sought and received extensive media coverage of their efforts on behalf of Central American aliens. Eventually, the INS accepted appellants' challenge to investigate their alien smuggling and harboring activities. The INS infiltrated the sanctuary movement with several undercover informers and agents who tape recorded some meetings. The record developed at trial is mountainous, and the following factual account seeks only to capture some of the more significant events relevant to this appeal.\n\nA\n\nOn March 19, 1982, appellant John M. Fife, in an interview published by a Tucson, Arizona newspaper, announced that he and his church, the Southside Presbyterian Church, \"can no longer cooperate with or defy the law covertly as we have done.\" He challenged the United States government to arrest him as a felon in violation of the immigration laws. Indeed, Fife wrote to the Attorney General of the United States on March 23, 1982, to protest \"the current administration of United States law which prohibits us from sheltering these refugees from Central America.\"\n\nThe following day, several hundred people rallied at the Federal Building in Tucson to protest the government's failure to grant political asylum to Central American aliens. The protesters then marched to Fife's church and, once there, Fife hosted a news conference at which he introduced a person he described as an undocumented Salvadoran alien who was staying at the church.\n\nDefendant James A. Corbett, acquitted below, was featured in a six-page article in the August 9, 1982, issue of People magazine. He described the smuggling of a Salvadoran family across the Mexican border and their reception at Fife's church. In the September 13, 1982, issue of the magazine U.S. News \u0026 World Report, Fife was featured in an article describing his smuggling activities. The magazine quoted Fife as saying he was \"willing to suffer the consequences\" of his smuggling.\n\nAppellants' smuggling operation received continuing publicity. On December 12, 1982, the CBS television program 60 Minutes broadcast a segment featuring Corbett. Before a national television audience, Corbett boasted of having smuggled 250 to 300 illegal aliens from Central America. Later that same month, Fife was featured in a Tucson newspaper article, and again in a February 7, 1983, article. Corbett was interviewed for an article appearing on August 1, 1983 in a Phoenix newspaper. Noting that stepped-up INS border enforcement efforts had proven more effective, Corbett stated that the sanctuary movement had advised aliens to cross the border at different points.\n\nB\n\nThe government initiated an undercover investigation of appellants' smuggling activities on March 27, 1984, when undercover agent Jesus Cruz (\"Cruz\") contacted appellant Ramon Dagoberto Quinones at Quinones' church office in Nogales, Sonora, Mexico. Cruz told Quinones that he supported the sanctuary movement and that he wished to volunteer. Cruz next met Quinones on April 16, 1984, when he accompanied Quinones to the Mexican federal prison in Nogales, where Mexico detains Central Americans who have violated Mexican immigration laws. Quinones introduced Cruz to Maria del Socorro Pardo Viuda de Aguilar (\"Aguilar\"), and the three entered the prison to meet with Central Americans who Mexico was set to deport.\n\nQuinones counseled the Nogales prisoners that if they planned to reattempt their journey to the United States, they should contact certain persons in Mexico who would instruct them on how to avoid Mexican immigration authorities. Quinones also told the prisoners that if they should reach the United States border they should avoid INS officials. He said that if they were apprehended by INS officials, they should lie and claim to be Mexican citizens, as this would avoid their formal deportation to Central America.\n\nFrom this introduction to the sanctuary movement, Cruz quickly became appellants' trusted and valued colleague. Cruz met Philip M. Conger on May 3, 1984, in Nogales, Mexico. Cruz accompanied Conger as he drove the Rodriguez family to a hilltop overlooking the United States border. Once there, Conger identified a hole in the border fence and the steeples of the Sacred Heart Church, where he advised the family to go. Conger assured the family that the church would provide them sanctuary. Conger also asked Cruz to give the family a brief history of Mexico so that they could pretend to be Mexicans if apprehended. The family made their way to the church later that week.\n\nCruz also became involved in Aguilar's and Quinones's plan to smuggle Julio and Ana Benavidez, both Salvadoran citizens, into the United States. On Aguilar's orders, Cruz obtained an envelope from Quinones which contained an immigration document. Cruz gave Aguilar this document, and she instructed Ana to memorize the name, age, and address of the person identified on the document. Aguilar dressed Ana to look like the person portrayed on the document. Cruz, Aguilar, and Ana then went to the Nogales Port of Entry where Aguilar walked 13-year-old Ana through the checkpoint.\n\nQuinones took Julio and Miguel Mejia, another Salvadoran, to the border fence to identify the hole they were to enter through. He told them that if they were caught by the INS they should lie and say they were from Mexico. Julio and Miguel crossed the border in this manner the morning before Aguilar brought Ana through the Nogales checkpoint. Cruz later met with both Julio and Ana at the Sacred Heart Church, and as instructed by Aguilar, Cruz took them to their mother's residence in Phoenix.\n\nConger and Aguilar also arranged for Cruz and John Nixon, another undercover agent, to drive Miguel and two other illegal aliens, Edwin Chavez and Mervin Chavez, to Los Angeles, California. Nixon discussed these plans with Fife, who suggested a route which he said was not patrolled by the United States Border Patrol. Nixon expressed nervousness to Fife, who assured him: \"It's a piece of cake.\"\n\nQuinones took several aliens, including Jose Ruben Torres, to the familiar hole in the border fence in Nogales, Sonora, Mexico. Torres had told Quinones that he was a Salvadoran who wanted to enter the United States to find work. Quinones told Torres and the others that Clark would assist them once they reached the church. On June 18, 1984, Torres crossed the border alone and soon made his way to Clark's church. Once there, he met Clark and told him that he was from El Salvador and wanted to find a job in the United States.\n\nClark was also informed that Aguilar had sent Torres. Clark told Torres he would be sheltered in a guest house adjoining the church, and he gave Torres the room key. Clark also assured Torres that he would be given meals. Subsequently, Aguilar instructed Cruz to take Torres and the others from Clark's church to Phoenix. Clark walked them to the cars and said good-bye.\n\nAguilar assisted Joel Morelos and his wife Gabriela in entering the United States illegally. Gabriela attempted an illegal entry on June 26, 1984, but she was immediately apprehended and returned to Mexico. Joel attempted to enter the same day, but he was also immediately arrested. After being held at a detention facility, he lied to an immigration judge about his nationality, forsaking his Guatemalan citizenship and claiming to be Mexican. He was returned to Mexico by the INS on July 2, 1984. He stayed at Aguilar's house just before attempting a second illegal entry into the United States, this time successfully. Shortly after Joel reached the Sacred Heart Church on July 6, 1984, Conger and Aguilar asked Cruz to transport Joel to Conger's church in Tucson.\n\nGabriela Morelos and her child had also made their way across the border to reunite with Joel. On July 11, 1984 the three arrived at Darlene Nicgorski's apartment in Phoenix. There was another alien family staying at the apartment when they arrived, and Nicgorski asked Cruz to take the other family elsewhere so the Morelos family could be sheltered. Joel told Nicgorski about his initial apprehension by the INS and his subsequent return to Mexico. He also told her about his recent successful crossing the week before. Later that day, Nicgorski arranged for the Morelos family to leave her apartment and to be harbored at another location. Nicgorski had two other Central Americans staying with her at that time.\n\nJoel told Nicgorski that he wished to be transported to Santa Fe, New Mexico, or Philadelphia, Pennsylvania. Cruz met with Nicgorski on July 20, 1984, at the Alzona Lutheran Church in Phoenix. Photographers were present taking pictures, and television interviews were being conducted for later broadcast. Nicgorski told Cruz that the Morelos family and another family were set to be transported to the northern part of the United States. The aliens were wearing handkerchiefs covering their faces.\n\nCruz also met Wendy LeWin, who was designated to drive the Morelos family. The family loaded their luggage into LeWin's vehicle, and then left for Santa Fe, New Mexico. During the fourteen-hour trip, Joel shared his experiences in Guatemala with LeWin and expressed his belief that he was entitled to political asylum. Joel testified that he did not remember telling LeWin about his two recent illegal entries into the United States. He also testified that so many different persons drove his family from Santa Fe to Philadelphia, he could not recollect any of their names.\n\nFrancisco Nieto and his family, Salvadorans, crossed from Mexico to Arizona in July, 1984, with the assistance of sanctuary movement workers. After crossing, they were driven to the Southside Church in Tucson where they met Fife and Nicgorski. Several days later they were driven to Phoenix to be with Nicgorski. Cruz saw Nicgorski and LeWin at the Alzona Church in Phoenix on July 22, 1984. LeWin introduced Cruz to the Nieto family, whom she described as having arrived from El Salvador. Later on, Nicgorski asked Cruz to drive some members of the Nieto family in his car to a trailer in South Phoenix. Nicgorski drove the others in her car and Cruz followed.\n\nNicgorski kept the family at the South Phoenix trailer for one week. She asked Cruz if he would transport the Nieto family to Albuquerque, New Mexico, and he agreed. On July 26, 1984, Cruz and other undercover agents, including Nixon, arrived to drive the family to Albuquerque, as requested. Nicgorski gave Cruz $100 for expenses. She also gave Nixon a card with names and telephone numbers of persons to contact after they arrived in Albuquerque.\n\nBecause of their considerable contribution to the sanctuary movement, Cruz, agent Nixon, and another undercover informer, Soloman Graham, were invited to join meetings of the movement's inner circle at the Southside Church. They attended such a meeting at the church on August 27, 1984. Appellants Fife, Conger, and Corbett participated, along with several other sanctuary movement members.\n\nThe discussion initially focused on a group of four Salvadoran children and a woman, Elba Teresa, who were in Mexico City, Mexico, and sought assistance crossing the United States border. Fife expressed concern that if these aliens were not moved promptly, it would interfere with their efforts to smuggle 23 Guatemalans across the border. Corbett suggested that innovative methods were necessary to aid the Guatemalans, such as concealing them in cars or using remote border crossing points. Conger suggested using a border graveyard in Douglas, Arizona. Finally, Fife stated that they had to sell or trade four vehicles because they operated in border areas so frequently that the INS probably linked them to smuggling.\n\nCruz attended another meeting on September 4, 1984, with Fife, Conger, Nicgorski, Peggy Hutchison and Corbett. Conger said that he had an argument with Quinones about smuggling the 23 Guatemalans who, in any event, already had made their way independently to Colorado. On September 10, 1984, Cruz was invited to attend his third meeting at the Southside Church. Conger, Fife, Hutchison, and others were present. The topic of discussion was how to smuggle the Elba Teresa group across the Mexican border. They debated who amongst them was most qualified to go to Mexico City to assist the aliens, but no decision was reached. Hutchison opposed sending two new recruits to the sanctuary movement, as they were too inexperienced.\n\nHutchison and Fife subsequently brought the Elba Teresa group across the border. On October 29, 1984, Cruz and Graham were at Nicgorski's apartment in Phoenix when the group arrived. Nicgorski asked them to drive the group to Canoga Park, California. A sanctuary worker from Seattle, Washington, came along and covered most of the trip's expenses. Cruz attended his last meeting at the Southside Church on November 26, 1984. Nicgorski, Conger, Hutchison, and others discussed plans to smuggle three separate groups of Central Americans across the border.\n\nII\n\nOn January 10, 1985, the government filed an indictment that ultimately led to the conviction of appellants. Along with the indictment, the government brought a motion in limine, which essentially sought to exclude evidence that appellants believed that the 1980 Refugee Act entitled the Central American aliens to enter or reside in the United States lawfully. The government contended that appellants' sincere belief that the aliens were refugees under the Refugee Act would not, as a matter of law, negate the specific intent that appellants had to bring the aliens surreptitiously into the United States without INS inspection. According to the government, the mere fact that appellants sought to transport the aliens into the United States without inspection satisfied the specific intent requirement under 8 U.S.C. § 1324 (1982). Consequently, pressed the government, \"whatever status to which the appellants concluded these aliens were entitled under the Refugee Act is irrelevant.\"\n\nOn October 28, 1985, the district court granted the government's in limine motion. The lower court excluded from trial \"evidence of appellants' belief that those aliens involved in the charges were refugees\" based on their interpretation of the immigration laws. We review the district court's decision to preclude a mistake of law defense under the nondeferential de novo standard. United States v. Scott, 789 F.2d 795, 797 (9th Cir. 1986).\n\nA\n\nAppellants place principal reliance on the Supreme Court's decision in Liparota v. United States, 471 U.S. 419, 85 L. Ed. 2d 434, 105 S. Ct. 2084 (1985), for their contention that they were entitled to present evidence to the jury about their interpretation of section 1324 and the 1980 Refugee Act. Section 1324 makes it a crime to knowingly or willfully smuggle, transport, or harbor an alien \"not duly admitted by an immigration officer or not lawfully entitled to enter or reside within the United States under the terms of this chapter or any other law relating to the immigration or expulsion of aliens. . . .\" Id.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Because this statute contains a legal element as part of its definition -- \"lawfully entitled to enter or reside within the United States\" -- appellants contend that Liparota permits a mistake of law defense.\n\nLiparota involved a prosecution under 7 U.S.C. § 2024(b), which provides criminal sanctions for anyone who \"knowingly uses, transfers, acquires, alters, or possesses [food] coupons . . . in any manner not authorized by . . . the regulations.\" The government argued that defendant \"violated the statute if he knew that he acquired or possessed food stamps and in fact that acquisition or possession was in a manner not authorized by statute or regulations.\" Liparota, 471 U.S. at 423. Stated differently, the government's position was that the second half of the statute contained no mens rea requirement. Defendant urged a different reading of section 2024(b)(1), claiming that the crime requires both knowledge that he acquired or possessed the stamps and knowledge that he had done so in an unauthorized manner. Id. The Court confronted the issue, therefore, whether Congress intended this statute to contain this mens rea requirement. The Court addressed this question strictly from the perspective of statutory interpretation. Id. at 423, 424 n. 6.\n\nB\n\nThe government in the present case does not take issue with appellants' characterization of the mens rea element of section 1324. 8 U.S.C. § 1324. Nevertheless, appellants cite to a footnote in Liparota for the proposition that section 1324 permits a mistake of law defense. The Liparota majority inserted the following footnote to defend against the dissent's accusation that it was creating a mistake of law defense\n\n:\n\nOur holding today no more creates a \"mistake of law\" defense than does a statute making knowing receipt of stolen goods unlawful. In both cases, there is a legal element in the definition of the offense. In the case of a receipt-of-stolen-goods statute, the legal element is that the goods were stolen; in this case, the legal element is that the \"use, transfer, acquisition,\" etc. were in a manner not authorized by statute or regulations. It is not a defense to a charge of receipt of stolen goods that one did not know that such receipt was illegal, and it is not a defense to a charge of a § 2024(b)(1) violation that one did not know that possessing food stamps in a manner unauthorized by statute or regulations was illegal. It is, however, a defense to a charge of knowing receipt of stolen goods that one did not know that the goods were stolen, just as it is a defense to a charge of a § 2024(b)(1) violation that one did not know that one's possession was unauthorized.\n\nId. at 425 n. 9 (citations omitted).\n\nThis language establishes that appellants were entitled to assert as a defense to their indictment under section 1324 that they did not know that the aliens in question were unlawful. From this entitlement, appellants take the unsupported leap that they may introduce any evidence at all that would advance this defense. The meaning of Liparota does not stretch this far; it states no more than that defendant was entitled to a defense that attempted to negate an element of the crime. That case never even purported to establish the type of evidence that may be used to support a defense that a mental element defined in a criminal statute is lacking. Instead, we are guided by the prudent and deep-rooted principle of ignorantia legis non excusat and the case law. We conclude that appellants may not establish a mistake of law defense by proffering evidence of their misunderstanding of the aliens' status which is based on their statutory construction.\n\n1\n\nIt is axiomatic that ignorance or mistake of law is no defense. See United States v. Fierros, 692 F.2d 1291, 1294 (9th Cir. 1982), cert. denied, 462 U.S. 1120, 77 L. Ed. 2d 1350, 103 S. Ct. 3090 (1983); Liparota v. United States, 471 U.S. 419, 441, 85 L. Ed. 2d 434, 105 S. Ct. 2084 (White, J., dissenting); see also United States v. Sherbondy, 865 F.2d 996, slip op. at 15273 (9th Cir. 1988) (\"[There] are few exceptions to the rule that ignorance of the law is no excuse.\"). Legal scholars have postulated that this ancient doctrine developed out of pragmatic concerns that criminals otherwise would avoid conviction by resorting to the defense of mistake or ignorance of law as a sanctuary. \"Both commentators and courts have argued that such a defense would become a shield for the guilty because . . . defendant's claim of ignorance could not ordinarily be refuted.\" W. LaFave \u0026 A. Scott, Substantive Criminal Law § 5.1, at 586 (1986). Additionally, a defendant, in presenting this defense, easily could convert a trial into a protracted and unruly proceeding. Cf. id. In sum, then, at least two practical considerations underpin the doctrine disallowing a defense of ignorance or mistake of law: (a) the difficulty of refuting this defense and (b) trial management. These considerations, as applied to this case, will be addressed in reverse order.\n\na\n\nAppellants' attempt to admit evidence concerning their understanding of section 1324, in particular, and that section's interaction with other immigration laws, both national and international, in general, cuts to the heart of the concern about trial management. Appellants claim the 1980 Refugee Act as the primary source for their interpretation of \"lawfully entitled to enter or reside in the United States.\" In demonstrating their understanding of how the Refugee Act applies to their case, appellants intended to provide a series of minitrials as to each alien's well-founded fear of persecution. The record makes plain that appellants, in essence, sought to overwhelm the trial judge with a barrage of evidence that would have included graphic descriptions of horrifying torture and human rights abuses in Central America. For example, counsel for appellants instructed the judge that he must \"listen[ ] to the [aliens'] testimony . . . as to whether or not these folks are unlawfully here.\" This must be done, appellants continued, for \"each and every alien\" in order to \"prove that defendants knew that these [aliens] were not entitled to be here under the 1980 Refugee Act.\" Appellants also rely on international law for their understanding of the immigration laws. In their memorandum in opposition to the government's in limine motion, they argued that they believed that international law rendered the aliens lawfully entitled to enter or reside here. At the hearing on this motion, the government's counsel informed the court that one objective for the motion was to avoid \"cross-examining all these aliens about let me hear your life history from the time that you were first born and grew up in San Salvador.\" Appellants' utter silence in the face of this concern is revealing; they did nothing to assuage the government's fears.\n\nb\n\nIt is clear, therefore, that a rule which would allow appellants essentially to put Reagan Administration foreign policy on trial would be foolish. A trial as appellants envisaged not only would have been interminable, but also would have placed an intolerably difficult burden on the government -- to refute appellants' claim of their mistaken understanding of the law.\n\nThe Court in Liparota was mindful of the importance of not placing \"an unduly heavy burden on the Government in prosecuting violators\" of federal crimes, Liparota, 471 U.S. at 434, but concluded that it had not transgressed its own admonition. The government in that case, for example could \"introduce[] evidence that petitioner bought food stamps at a substantial discount from face value . . . [,] that he conducted part of the transaction in a back room of his restaurant . . . [,] and that [the] food stamps themselves are stamped nontransferable.'\" Id. at 434 n. 17. In contrast, it is hard to imagine what evidence the government in this case could have mustered to rebut appellants' purported understanding of section 1324 and the Refugee Act of 1980; this would be tantamount to requiring the government to prove a negative.\n\n2\n\nThe case law also supports the conclusion that appellants could not introduce evidence of their alleged mistaken view of the immigration laws. Preliminarily, it is useful to reexamine the types of possible fact situations that troubled the Court in Liparota. The Court worried that \"[a] strict reading of the statute with no knowledge-of-illegality requirement would thus render criminal a food stamp recipient who, for example, used stamps to purchase food from a store that, unknown to him, charged higher than normal prices to food stamp recipients.\" Liparota, 471 U.S. at 426. The hypothetical food stamp recipient, no doubt, should be allowed to introduce evidence that he was unaware that the store charged exorbitant prices. Liparota, therefore, sanctioned a defense that would negate the mens rea component defined in the statute by permitting factual evidence of the circumstances as the defendant perceived them to be.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nThis interpretation of Liparota is consistent with our decision in United States v. Fierros, 692 F.2d 1291 (9th Cir. 1982), where we analyzed the ignorance or mistake of law defense in the context of a section 1324 prosecution. See also United States v. Sherbondy, 865 F.2d 996, slip op. at 15273 (9th Cir. 1988) (citing Fierros's entire ignorance of law discussion for the proposition that \"ignorance of law is no defense to charge of knowingly or willfully harboring an alien in violation of 8 U.S.C. § 1324(a)\"). Specifically, we examined the very claim made in Liparota -- that defendant was \"ignorant of an independently determined legal status or condition that is one of the operative facts of the crime.\"\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Id. at 1294.\n\nWe began our examination in Fierros with a discussion of United States v. Petersen, 513 F.2d 1133 (9th Cir. 1975):\n\nIn that case defendant was charged with embezzlement or theft of federal property in violation of 18 U.S.C. § 641, a crime requiring proof of specific intent. We held there that Petersen was entitled to an instruction on his defense that he reasonably believed that the person from whom he bought the property was legally authorized to sell it. In such a case, the mistake of the law is for practical purposes a mistake of fact.\n\nFierros, 692 F.2d at 1294. Applying the teaching of Petersen to a case in which a defendant is accused of violating section 1324, we then illustrated the type of defense that properly could be presented. \"This type of defense would have been available to appellants in this case if, for example, they had asserted reasonable grounds to believe\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e that the workers were not aliens or that they had been legally admitted to the United States.\" Id. Significantly, these illustrations depict defendant's understanding of the factual events that formed the basis for prosecution. If the facts were as defendant supposed, he would not have the requisite culpability prescribed by the statute.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nOur holding, which prevents appellants from offering evidence of mistake premised on an erroneous construction of the immigration laws, is also consistent with established Fifth Circuit authority. United States v. Merkt, 764 F.2d 266 (5th Cir. 1985) (Merkt I) is squarely on point. There defendant was charged with transporting illegal aliens in violation of section 1324(a)(2). Defendant proffered the defense that she lacked the requisite knowledge that the aliens were \"in the United States in violation of the law.\" Similar to appellants in the present case, she claimed a good faith belief in the legality of the aliens based on the Refugee Act. The court rejected this defense.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Id. at 273; see also United States v. Merkt, 794 F.2d 950, 965 n. 18 (5th Cir. 1986) (reaffirmation by different panel of Merkt I's rejection of this defense), cert. denied, 480 U.S. 946, 94 L. Ed. 2d 789, 107 S. Ct. 1603 (1987). We come to the same conclusion.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nIII\n\nAppellants contend that the district court erred in instructing the jury that an alien is not lawfully entitled to enter or reside in the United States as a political refugee unless the alien has filed an application for political asylum. The court granted appellants' requested jury instruction that \"the Government must prove beyond a reasonable doubt that an alien was not lawfully entitled to enter or reside within the United States as defined in this instruction.\" But the court rejected appellants' additional requested instruction that \"a person who is a 'refugee' within the meaning of the Refugee Act of 1980 is entitled to enter and reside in the United States.\"\n\nA\n\nEssentially, the court instructed the jury that a person may not lawfully enter the United States unless he is duly admitted by an immigration officer. Significantly, however, the court provided for the possibility that an alien may be lawfully entitled to reside here subsequent to an illegal entry if he has filed an application for political asylum and has been released pending a final ruling on his application.\n\nThe court instructed the jury that \"once an alien has been processed by an [INS] agent and released from custody, following an unlawful entry he may reside in the [United States] pending further order.\" (emphasis added). The court specifically instructed the jury to find appellants not guilty on charges of transportation or harboring if an alien had been previously \"processed and released by the [INS].\"\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e But the court also instructed that prior to an alien's having \"[filed] an asylum application,\" the alien was not lawfully entitled to reside in the United States.\n\nB\n\nThe district court's instruction was proper. Section 1324 prevents the bringing in, transporting, or harboring of any alien \"not duly admitted by an immigration officer or not lawfully entitled to enter or reside within the [United States] under the terms of this chapter or any other law relating to immigration.\" Appellants' requested instruction, that refugees are lawfully entitled to enter and reside in the United States, improperly implies that an alien is entitled to enter and reside here without complying with the procedural formalities of the immigration laws.\n\n1\n\nSince its amendment by the 1980 Refugee Act, the Immigration and Nationality Act has provided two distinct method, for an alien claiming political persecution in his home country to avoid deportation, one discretionary and the other mandatory. See INS v. Cardoz-Fonseca, 480 U.S. 421, 423, 94 L. Ed. 2d 434, 107 S. Ct. 1207 (1987); Vilorio-Lopez v. I.N.S., 852 F.2d 1137, 1140 (9th Cir. 1988). Section 208(a) of the Act, 8 U.S.C. § 1158(a), authorizes the Attorney General, in his discretion, to grant asylum to an alien having a well-founded fear of persecution in his home country. This section permits the Attorney General to grant an asylum application based upon the alien's subjective fear of persecution where this fear \"has enough of a basis that it can be considered well-founded.\" Vilorio-Lopez, 852 F.2d at 1140. The alien need not demonstrate that it is more likely than not that he will be subject to persecution if deported. Cardoza-Fonseca, 480 U.S. at 450.\n\nSection 243(h) of the Act, 8 U.S.C. § 1253(h), prohibits the Attorney General from deporting an alien \"who demonstrates that his 'life or freedom would be threatened' on account of one of the listed factors if he is deported.\" Cardoza-Fonseca, 480 U.S. at 423. This section is a mandatory limitation of the Attorney General's power to deport an alien demonstrating that it is more likely than not that he will be subject to persecution in the country to which he would be deported.\n\nThere are important procedural and substantive differences between sections 208(a) and 243(h). An application for asylum pursuant to section 208(a) has no necessary relationship to deportation proceedings. An alien can file an application for asylum pursuant to section 208(a) before deportation proceedings have begun. Bolanos-Hernandez v. I.N.S., 767 F.2d 1277, 1281 (9th Cir. 1984) (citing 8 C.F.R. § 208.3(a)(2) (1983)). Indeed, an alien can file a section 208(a) asylum application after deportation proceedings have terminated. See 8 C.F.R. § 208.11 (1984). By contrast, an alien can only seek to invoke section 243(h)'s mandatory prohibition against deportation in the course of a deportation proceeding, although such an application is also treated as a request for discretionary asylum under section 208(a). See 8 C.F.R. § 208.3(b).\n\nWhile the Attorney General cannot deport an alien making out a successful case under section 243(h), the alien is clearly far better off if he also receives a favorable ruling on his section 208(a) application for discretionary asylum. Bolanos-Hernandez, 767 F.2d at 1288 n.19. For instance, a successful section 208(a) applicant may seek permanent residency after one year, while no such entitlement is available to an alien who only has obtained a favorable section 243(h) ruling. See 8 C.F.R. § 209.2.\n\n2\n\nAppellants' principal argument is that no asylum application is necessary to render an alien lawfully entitled to enter reside in the United States. \"Thus, a person's status as a refugee does not depend on whether that status has received official acknowledgment; an alien is a refugee under the law before he is officially granted asylum.\" The district court relied on Fifth Circuit precedent to reject this proposition. In United States v. Pereira-Pineda, 721 F.2d 137, 139 (5th Cir. 1983), the court held that \"[the] mere possibility that [an alien] may file asylum applications at some point in the future, and thus be allowed to remain at liberty under bond or parole while their right to asylum is determined, does not make them -- from the moment they enter this country -- entitled to 'reside' here for the purpose of section 1324(a)(2).\" The district court below, as noted, instructed the jury that where an alien had filed an application for asylum and had been processed and released, appellants could not be convicted of transporting or harboring because the alien was lawfully entitled to reside in the United States.\n\n3\n\nNone of the aliens relevant to this case had filed political asylum applications prior to appellants' arrests. Nonetheless, appellants contend that the jury instructions were improper because \"[the] overall structure of U.S. refugee law presupposes that bona fide refugees are lawfully entitled to enter this country, by whatever means, and apply for asylum.\" As support, they cite the 1980 Refugee Act, which changed the law by permitting undocumented aliens already in the United States to file asylum applications. See Cardoza-Fonseca, 480 U.S. at 433 (\"Prior to the 1980 amendments there was no statutory basis for granting asylum to aliens who applied from within the United States.\"). Appellants reason that this change acknowledges an alien's right to cross our borders without due presentment.\n\nThat Congress created a mechanism for those illegal aliens already inside this country to apply for political asylum hardly amounts to granting illegal aliens a license to cross our borders without being duly admitted. Congress has simply recognized that large numbers of undocumented aliens are in fact within our borders and established an administrative procedure to cope with this reality. It did not proclaim that anyone considering himself the victim of political persecution can cross our borders by stealth and then studiously avoid the authorities in perpetuity. Even a successful asylum applicant remains subject to criminal prosecution for previous immigration law violations, such as failing to have been duly admitted to the United States pursuant to section 1325. See 8 C.F.R. § 208.12 (1984).\n\n4\n\nIn United States v. Rodriguez-Rodriguez, 840 F.2d 697 (9th Cir. 1988), the court examined the element of section 1324 requiring the alien to be in the United States in violation of law.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Defendants in Rodriguez were convicted of transporting undocumented aliens under section 1324. The court rejected their contention that the aliens' mere eligibility for an adjustment of status pursuant to the Immigration Reform and Control Act of 1986\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e rendered the aliens lawfully entitled to reside in the United States.\n\nThe Rodriguez court found that as the aliens had not filed applications for an adjustment of status, their mere ability to have done so did not render them lawfully entitled to reside in the United States. The court specifically relied upon the analogous Pereira-Pineda case and described it as having \"held that the possibility that aliens might apply for asylum, allowing them to remain at liberty while their rights were determined, did not mean the aliens resided lawfully in the United States before applying for asylum.\"\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e Rodriguez, 840 F.2d at 700. We adopt the Pereira-Pineda court's holding that an alien must file an application for political asylum in order to be lawfully entitled to reside in the United States pending a final ruling.\n\n5\n\nAppellants argue that the Pereira-Pineda decision incorrectly focuses only upon the role of a discretionary application for asylum pursuant to section 208(a). Appellants argue that section 243(h) provides an independent explanation of why the aliens they assisted were legally entitled to reside in the United States. As the government cannot deport any alien demonstrating a likelihood of persecution, an alien facing such a likelihood is legally entitled to reside here from the moment he crosses into the United States, according to appellants.\n\nAppellants' argument, however, as with their suggested construction of the application provisions of section 208(a), overlooks the procedural formalities of the immigration laws. An alien must file an asylum application under either section 208(a) or 243(h). See 8 C.F.R. §§ 208.3(b) \u0026 208.10(a) (1984).\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e While a section 243(h) application provides a defense to a deportation proceeding and can only be filed subsequent to the institution of such proceedings, the application is nonetheless necessary in order for an alien to be able to invoke relief under section 243(h). Appellants' contention that section 243(h) renders all undocumented aliens legal residents until the government proves differently at a deportation hearing has no support in logic or precedent, and we reject it.\n\nC\n\nFinally, the court rejects appellants' contention that international law entitled the aliens to reside in the United States without presenting themselves to immigration authorities and filing applications for political asylum. Appellants succinctly describe their international law claim: \"[Violations] by the United States of its obligations under the 1967 [U.N. Refugee] Protocol excused the refugees being assisted by appellants from presenting themselves to the I NS and established 'good cause' for their illegal entry and presence.\"\n\nAppellants offer no authority for this court's ability to force the government to conform to supposed international law obligations. \"[In] enacting statutes, Congress is not bound by international law . . . [;if] it chooses to do so, it may legislate [contrary to] the limits posed by international law.\" United States v. Pinto-Meija, 720 F.2d 248, 259 (2d Cir. 1983), modified on other grounds, 728 F.2d 142 (2d Cir. 1984).\n\nFor appellants' argument to have any coherence, they must contend that the Executive Branch has refused to comply with binding international law obligations. The question then arisen whether any such obligations have the force of law. Appellants note that section 1324 provides that an alien is judged to be lawfully entitled to enter or reside in the United States \"under the terms of this chapter or any other law relating to the immigration or expulsion of aliens.\" Appellants contend that the \"any other law\" language incorporates international law. Indeed, the Immigration and Nationality Act, 8 U.S.C. § 1101(a)(17), defines law as \"all laws, conventions, and treaties of the United States relating to immigration, exclusion, deportation or expulsion of aliens.\"\n\nThe only relevant convention or treaty appellants identify is the United Nations Protocol Relating to the Status of Refugees, to which the United States is a party. Congress intended the definition of \"refugee\" in the 1980 Refugee Act to be interpreted in conformance with the Protocol. Cardoza-Fonseca, 107 S. Ct. at 1216. The United Nations has produced a Handbook which provides \"significant guidance in construing the Protocol, to which Congress sought to conform.\" Id. at 1217 n.22 (referring to the Office of the United Nations High Commissioner for Refugees, Handbook on Procedures and Criteria for Determining Refugee Status (Geneva 1979)). But neither the Handbook nor the Protocol have the force of law, as \"the determination of refugee status . . . is incumbent upon the Contracting State in whose territory the refugee finds himself.\" Id. (quoting the Handbook). The Protocol was not intended to be self-executing. INS v. Stevic, 467 U.S. 407, 428, 81 L. Ed. 2d 321, 104 S. Ct. 2489 n. 22 (1984).\n\nAs the Protocol is not a self-executing treaty having the force of law, it is only helpful as a guide to Congress's statutory intent in enacting the 1980 Refugee Act. Consequently, the district court correctly concluded that the Protocol is not \"other law\" under section 1324. Furthermore, the Protocol provides no evidence that Congress intended to permit aliens to reside in the United States without presenting themselves to immigration authorities. Quite the contrary. Indeed, appellants acknowledge that the Protocol, incorporating Article 31(1) of the 1951 Convention, requires that an alien refugee present himself to immigration authorities \"without delay \"following illegal entry into a foreign land. The district court therefore properly rejected appellants' argument that the Act does not require presentment following an illegal entry.\n\nFinally, appellants argue that the international law norms of temporary refuge, humanitarian initiative, and nonrefoulement are self-executing and binding sources of law justifying appellants' actions. First, the Immigration Act's definition of \"law\" does not include international norms; only conventions and treaties. Second, these norms have nothing whatsoever to say about presentment following illegal entry, which the Protocol expressly requires. Appellants' position on these matters is meritless.\n\nIV\n\nAguilar contests her conviction under section 1324(a)(1) for \"bringing in\" Ana Benavidez on May 24, 1984. The trial court instructed the jury that each substantive count of the indictment required the government to prove that the alien had made an entry into the United States. The court defined \"entry\" as \"a crossing into the territorial limits of the United States in either: One, inspection and admission by an immigration officer; or two, an actual and intentional evasion of inspection.\" Aguilar argues that the district court erred by rejecting appellants' proposed instruction on the definition of \"enter.\"\n\nA\n\nThe government does not dispute that a section 1324(a)(1) \"brings into\" conviction requires the alien to enter the United States. In United States v. Bunker, 532 F.2d 1262, 1265 (9th Cir. 1976), the court stated \"we agree that an illegal entry has been at the core of essentially all prosecutions under [section 1324(a)(1)].\"\n\nAs the government correctly notes, Aguilar's statement of the facts essentially concedes that she obtained a fraudulent entry document and gave it to Benavidez for the purpose of effecting Benavidez' illegal entry into the United States. She helped Benavidez use make up and hair rollers to change her appearance to that of the picture on the fraudulent entry document, and she coached Benavidez how to lie to immigration officials at the border. Aguilar walked in front of Benavidez through the check point and then the two joined up and walked to the Sacred Heart Church. Benavidez returned the fraudulent entry document to Aguilar along the way.\n\n1\n\nAppellants requested the following jury instruction:\n\nThere is no violation of the statute making it a crime to bring an illegal alien into the United States unless the alien has \"entered\" this country. To accomplish an \"entry\" within the meaning of the statute, an alien must be present in the United States and be free of official restraint. Thus, unless you find that the alien a defendant is alleged to have brought in was free of official restraint at the time of the acts charged in the Indictment, you must acquit defendant.\n\nIn United States v. Oscar, 496 F.2d 492 (9th Cir. 1974), the court reversed defendant's conviction for aiding and abetting two aliens attempting to enter the United States by eluding inspection under section 1325. Section 1325 makes it a misdemeanor for an alien to effect an illegal entry into the United States, while section 1324(a)(1) makes it a felony to bring in an alien making an illegal entry. As defendant in Oscar was charged with aiding and abetting the entry of aliens, the court's resolution of the central issue whether the aliens actually had entered the United States applies equally to section 1324, which also requires proof of an entry.\n\nThe Oscar court accepted defendant's theory that an entry \"has not been accomplished until physical presence is accompanied by freedom from official restraint.\" Id. at 493. The court found that the aliens defendant was accused of aiding and abetting had not entered the United States, although \"they physically crossed the international border upon arrival at the Port of Entry.\" Id. The aliens were never free from official restraint because immigration inspectors were suspicious from the outset and arrested them at a secondary inspection area.\n\nThe critical aspect of the Oscar decision is its adoption of the definition of \"entry\" derived from deportation cases. In the deportation setting, an alien is entitled to certain procedural protections once he has entered the United States. Illegal aliens who technically had crossed the international border but were in the constructive custody of immigration authorities at that time are not said to have entered the United States. Continuous surveillance by immigration authorities can be sufficient to place an alien under official restraint.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nThe Oscar court held that the definition of entry in the deportation context applies with equal force to a criminal prosecution under section 1325. \"It is unlikely that Congress would define a term in § 1101 for use throughout Chapter 12 if it intended the term to have different meanings in different sections of the chapter.\"\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e Oscar, 496 F.2d at 494.\n\nThe district court clearly did not accept this definition of entry. In rejecting appellants' requested instruction, the court stated \"and also believe that the official restraint with respect to a smuggling cage, using that term with respect to 1324 issues, is not the law.\"\n\nThe government argues that appellants' requested instruction \"illustrates the inappropriate application of the official restraint doctrine as developed in civil deportation/exclusion hearing issues to the criminal feature of 'entry' in 1324(a)(1).\" But the Oscar decision is the law of this circuit and we are bound by it. The government also fails to establish that Oscar is in conflict with either United States v. Harding, 432 F.2d 1218 (9th Cir. 1970), or United States v. Martin-Plascencia, 532 F.2d 1316 (9th Cir.), cert. denied, 429 U.S. 894, 97 S. Ct. 255, 50 L. Ed. 2d 177 (1976).\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\n2\n\n\"A trial court must instruct the jury on a defendant's theory of the case only if the evidence sufficiently supports the theory and the theory is supported by the law.\" United States v. Sommerstedt, 752 F.2d 1494, 1496 (9th Cir.), amended, 760 F.2d 999 (9th Cir. 1985), cert. denied, 474 U.S. 851, 88 L. Ed. 2d 123, 106 S. Ct. 149 (1985). As demonstrated above, the Oscar decision amply supports appellants' legal theory. But the question remains whether the district court \"properly rejected [the proposed instruction] as not applicable to the facts of this case.\" United States v. Cervantes, 542 F.2d 773, 778 (9th Cir. 1976) (quoting United States v. Makekau, 429 F.2d 1403, 1404 (9th Cir.), cert. denied, 400 U.S. 904, 27 L. Ed. 2d 141, 91 S. Ct. 143 (1970)).\n\nAguilar contends that she established facts sufficient to warrant her freedom from official restraint instruction. She cites informer Cruz's transportation of Aguilar and Benavidez to the border crossing and his observation of the two entering the United States. Cruz also had alerted border control agents, through filing control load sheets, \"of the tentative smuggling activities . . . in order that the aliens would not be intercepted by the agents.\" These control sheets alerted border area law enforcement officials that Aguilar and Benavidez were connected to an ongoing investigation and were not to be arrested.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nThe government argues that Aguilar must demonstrate that Benavidez \"was under official restraint before and at all times after her illegal entry.\" (emphasis added). The aliens in Oscar were \"never free from the official restraint of the customs officials\" because they were arrested at the border. Oscar, 496 F.2d at 493 (emphasis added). Similarly, the Board of Immigration Appeals statement concludes that surveillance prior to an arrest is official restraint because the alien \"lacks the freedom to go at large and mix with the population.\" Matter of Pierre, BIA Interim Decision #2239 (October 5, 1973). By contrast, Benavidez stayed at her parents' home from shortly after her entry with Aguilar on May 24, 1984, until her arrest on January 14, 1985.\n\nThe government is correct that, pursuant to our Oscar decision, an alien must be under official restraint at all times during and subsequent to physical entry in order to void a section 1324 conviction.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e Consequently, the question is whether there was any evidence from which a jury could find that Benavidez was under official restraint during the seven months she resided in the United States before her arrest.\n\nAguilar argues that Benavidez was under official re ring her entire residency in the United States due to alleged daily visits to her house by Cruz. Yet the rationale for the official restraint doctrine does not support a finding that such brief visits constitute official restraint. The doctrine is premised on the theory that the alien is in the government's constructive custody at the time of physical entry. By contrast, where an alien is able to exercise his free will subsequent to physical entry, he is not under official restraint. Martin-Plascencia, 532 F.2d 1316.\n\nIt is clear that Benavidez exercised such free will in the seven months she lived with her parents. Cruz's short visits were insufficient to prevent her from escaping. Neither was she free on bond pending a formal immigration hearing, a form of constructive custody. In short, there was no evidence from which a jury could find that Benavidez was under official restraint during her entire residency in the United States. Consequently, the district court did not err in rejecting appellants' requested instruction.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nB\n\nFinally, regarding Aguilar's motion for judgment of acquittal, she contends that the evidence does not support a finding that she brought Benavidez into the United States within the meaning of section 1324. Aguilar relies almost exclusively upon a 1927 Sixth Circuit decision, McFarland v. United States, 19 F.2d 805 (6th Cir. 1927). Defendant in McFarland met with his son in Canada and provided him with another persons entry documents. The two then crossed into the United States by ferryboat where defendant proceeded through immigration. The court concluded that section 1324 was \"distinctly inappropriate, although not necessarily inapplicable, to one who persuades or aids the immigrant to take himself by public conveyance up to the inspection line for examination.\" Id. at 806.\n\nMcFarland was decided under the predecessor to the section 1324(a)(1) at issue in this case. That section emphasized that 'bringing in\" included being brought in \"by vessel or otherwise.\" The court in United States v. Washington, 471 F.2d 402, 405 n. 2 (5th Cir. 1973), cert. denied, 412 U.S. 930, 37 L. Ed. 2d 158, 93 S. Ct. 2759 (1973), distinguished McFarland on the basis that the statute was amended to read \"by any means of transportation or otherwise.\" This amendment made \"an interpretation which limits the meaning of 'or otherwise' to only certain forms of transportation an unreasonable reading of the statute.\" Id.\n\nThe court in Washington upheld the conviction of defendant under section 1324(a)(1). He purchased airline tickets for the aliens and supplied them with fraudulent identification papers. He traveled with them by plane from the Bahamas to Ft. Lauderdale, Florida. This conduct is similar to Aguilar's conduct. She procured false papers for Benavidez and coached her to lie to immigration authorities. Cruz drove Aguilar and Benavidez to the border, where Aguilar walked ahead of Benavidez through immigration. The two met up immediately thereafter and walked to the church. The Washington court was satisfied that the aliens did not \"take themselves\" to the border. Surely the same can be said for Benavidez, a thirteen-year-old girl.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nV\n\nConger was convicted in count 26 of aiding and abetting Alejandro Rodriguez's illegal entry into the United States. Defendant Quinones was convicted in count 28 of aiding and abetting Jose Ruben Torres's illegal entry into the United States. Conger and Quinones appeal the district court's refusal to give the jury an \"official restraint\" instruction regarding the entries of Rodriguez and Torres. We conclude in the preceding section that while an entry requires freedom from official restraint, the evidence must warrant such an instruction. The issue is whether there was evidence from which a jury could find that Rodriguez and Torres were under official restraint during their entire stay in the United States.\n\nA\n\nAppellants contend that the evidence shows that these aliens never entered the United States. In both cases Cruz knew the date and time of the planned crossings, and he alerted INS border officials to ensure that they would not be apprehended. In contrast to Aguilar, however, Cruz did not conduct surveillance of the aliens as they crossed the border. In addition, these aliens crossed through a hole in the border fence, rather than the official port of entry Benavidez used. The aliens were not subject to constant surveillance subsequent to their initial physical entry.\n\nAppellants rely entirely upon the INS's advance notice of the crossing as warranting the requested official restraint instruction. But as the aliens did not cross at an official port of entry, they were not in close proximity to immigration officials at the point of physical entry. Instead, immigration officials in the general area of the illegal entries were alerted. This distinction in the proximity of immigration authorities is important because the official restraint inquiry centers upon an alien's freedom from official scrutiny.\n\nIn addition, as with Benavidez, Rodriguez and Torres States for about eight months prior to their eventual arrests. Conger does not even allege that these aliens were under INS scrutiny for their entire stay in the United States. Under these circumstances, we hold that the evidence was insufficient to warrant an official restraint instruction.\n\nB\n\nQuinones and Conger also argue that the district court improperly rejected their proposed jury instruction on the first amendment. The court instructed the jury that it must determine whether appellants performed the alleged substantive offenses with the intent to violate the law or \"merely joined together for the purpose of engaging in activities protected by the First Amendment.\" But appellants desired an instruction that their expression was protected unless it was intended and likely to produce or incite an imminent lawless act.\n\nAppellants rely upon United States v. Freeman, 761 F.2d 549 (9th Cir. 1985), cert. denied, 476 U.S. 1120, 90 L. Ed. 2d 664, 106 S. Ct. 1982 (1986), in which defendant was charged with aiding and abetting violations of the tax laws by counseling noncompliance with the tax laws at various seminars he conducted. The court found that \"where there is some evidence . . . that the purpose of the speaker or the tendency of his words are directed to ideas or consequences remote from the commission of the criminal act, a defense based on the First Amendment is a legitimate matter for the jury's consideration\" Id. at 551. Based upon the trial court's failure to give such an instruction, the court reversed defendant's convictions connected with the counts alleging only counseling.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e The Freeman decision established as a threshold for a first amendment jury instruction that there be \"some evidence\" that defendant's purpose or the likely effect of his words was \"remote\" from the commission of the crime. Appellants argue that the evidence against Quinones and Conger shows \"that they did nothing more than point out a church on the other side of the border and a hole in the international border fence; a hole that 'a lot of people go through.'\" The government responds that there was no evidence that these two defendants intended their actions to be remote from the commission of a crime.\n\nConger drove Rodriguez to a hilltop and told him \"there is the hole where you can go through, and those steeples or towers that you can see there is the Church of the Sacred Heart in Nogales, Arizona. That's the way you have to walk to get to the church. . . . Once you get to the church, you will have no problems with being arrested.\" Conger asked Cruz to give Rodriguez a history of Mexico so that he could pass himself off as a Mexican if apprehended. Conger told Cruz that \"they\" were going to smuggle Rodriguez into the United States. Rodriguez admitted that Conger told him he would help him enter the United States.\n\nWhen Quinones met Torres he took him to Aguilar's house. The next day he drove him to the hilltop to identify the sanctuary church across the border. He also identified the hole in the border fence. Finally, he gave Torres the name of a contact at the church.\n\nUnder these circumstances, Quinones and Conger have failed to produce \"some evidence\" that their expression was \"remote\" from the commission of a crime. These appellants instructed illegal aliens on how and where to cross the border and supplied them with sanctuary contacts in the United States. Their speech was inextricably intertwined with actions that facilitated the aliens' illegal entry. Freeman does not require a first amendment instruction under these circumstances.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nVI\n\nAppellants challenge the convictions under section 1324(a)(3) for transportation of illegal aliens. Three arguments are advanced to support this challenge: (1) The evidence was insufficient to support Wendy LeWin's (LeWin) conviction; (2) the jury was improperly instructed about the \"in furtherance of\" element; and (3) the district court committed reversible error in excluding evidence of their religious motivation.\n\nA\n\nLeWin was convicted of illegally transporting aliens Joel and Gabriela Morelos (the Moreloses) in violation of section 1324(a)(3). LeWin transported the Moreloses from Phoenix to Santa Fe, a fourteen-hour road trip. As part of its burden of proof, the government must show that she transported them \"knowing or having reasonable grounds to believe that [their] last entry into the United States occurred less than three years prior thereto.\" 8 U.S.C. § 1324(a)(2). At trial, LeWin moved under Fed.R.Crim.P. 29(c) for a judgment of acquittal, claiming that the government failed to establish that she had such knowledge. She now argues that the district court erred in rejecting her motion.\n\nOur review of LeWin's claim is limited: we must inquire \"whether, after viewing the evidence in the light most favorable to the prosecution, any rational trier of fact could have found the essential elements of the crime beyond a reasonable doubt.\" United States v. Lewis, 787 F.2d 1318 (9th Cir. 1986). The evidence required for purposes of sufficiency may be direct or circumstantial. See United States v. Loya, 807 F.2d 1483, 1486 (9th Cir. 1987).\n\nWhile there is no direct evidence that LeWin knew about the recent illegal status of the aliens, there is sufficient circumstantial evidence. A number of significant events were revealed at trial. First, Joel admitted that during the road trip he freely discussed his experiences in Guatemala and his intention to assert refugee status, although he denied informing LeWin of his recent illegal entry into the United States. The jury reasonably could have disbelieved Joel and concluded that he did tell LeWin about his entry. Second, in Phoenix the Moreloses, in the presence of LeWin, were interviewed on television wearing masks. Joel testified that they wore the masks only to avoid being detected by Guatemalan officials, fearing that their family members in Central America would be tortured. However, the jury was free to reject Joel's testimony and conclude that the Moreloses really sought to avoid INS detection because of their illegal entries. Finally, there was evidence indicating that LeWin was generally aware of a plan to smuggle aliens who recently entered the United States illegally. The jury reasonably could have found it incredible that under these circumstances LeWin would not have known, even if she was not told, that the Moreloses were recent illegal aliens.\n\nViewing this circumstantial evidence in the light most favorable to the government, a reasonable jury could have concluded that LeWin knew or had reasonable grounds to know that the aliens entered the United States within the last three years.\n\nB\n\nAppellants contend that the district court improperly rejected their requested jury instruction defining the \"in furtherance of\" element on the transportation convictions and the aiding and abetting transportation convictions. Appellants requested the court to instruct the jury that \"[a] person intending to assist an alien in obtaining legal status is not acting 'in furtherance of' the alien's illegal presence in this county.\" While this language is taken verbatim from the Merkt I case, 764 F.2d at 272, that decision does not support appellants' requested instruction.\n\nThe trial court in Merkt I had improperly instructed the jury that they must find that defendant intended to take the aliens to the nearest INS office for presentment. Defendant contended that she did not willfully act in furtherance of the aliens' illegal presence in this country because she was driving them to an INS office for presentment at the time she was arrested. The district court, however, rejected her defense because there was an INS office closer than the one she had in mind.\n\nThe appellate court found that the trial court's instruction improperly constituted a directed verdict on the willfulness element of section 1324(a)(2). \"This amounts to an instruction that, if Merkt intended to take the aliens to any INS office other than the nearest one, they were to find that she had acted with the requisite intent to support a conviction under section 1324(a)(2).\" 764 F.2d at 271. The court simply concluded that \"the statute is not violated by the act of transporting an alien to an immigration office merely because that office is not geographically closest to the place where transportation begins.\" Id. at 272.\n\nThe trial court instructed the jury that it must find that defendant \"transported or moved . . . an alien . . . in order to further the aliens [sic] unlawful presence in the United States.\" This instruction is all that was required. Appellants' requested instruction fails to acknowledge that defendant's act of transporting the alien must itself assist the alien in obtaining legal status. This was clearly the case in Merkt I, where defendant's transportation of the aliens was directly and substantially related to assisting the alien in obtaining legal status. As the government correctly, notes, however, appellants made no effort to present any aliens to the INS, and they were hardly apprehended while en route to an INS office.\n\nAppellants also argue that the trial court erred by rejecting their suggested jury instruction that \"transporting a person who one knows to be an illegal alien out of purely humanitarian concern is not a crime.\" Appellants cite United States v. Moreno, 561 F.2d 1321 (9th Cir. 1977), as authorizing this instruction.\n\nIn Moreno, the court held that a foreman of an agricultural concern, transporting illegal aliens as part of his ordinary and required duties, was only remotely acting in furtherance of violation of the law. The Moreno court emphasized that the act of transportation must be directly and substantially related to furthering the illegal alien's presence. The court hypothesized that \"based upon purely humanitarian concern, the transportation of a known undocumented alien to a hospital following an injury or illness does not appear to come within the purview of § 1324(a)(2).\" 561 F.2d at 1322 n. 3.\n\nNothing in the Moreno court's dicta suggests that it is proper to instruct the jury that humanitarian initiative is a complete defense to a transportation charge. Instead, the court sought to identify another instance of transportation which was only incidentally related to furthering the alien's presence in this country. Appellants' various acts of transportation are hardly incidentally related to furthering the aliens' illegal status. Appellants transported the aliens throughout the country as part of their plan to shelter illegal aliens out of the INS's grasp.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nC\n\nAppellants next argue that their religious motivation in transporting the illegal aliens would negate the requisite intent to directly or substantially further the alien's presence in the United States. They conclude: \"Proof that the [appellants'] transportation was not intended to further the alien's illegal presence, but to fulfill the [appellants'] religious commitment to assist those in need, would thus constitute a defense to [section 1324(a)(2)].\"\n\nAppellants are confusing intent and motive. So long as appellants intended to directly or substantially further the alien's illegal presence, it is irrelevant that they did so with a religious motive. See United States v. Moylan, 417 F.2d 1002, 1004 (4th Cir. 1969), cert. denied, 397 U.S. 910, 25 L. Ed. 2d 91, 90 S. Ct. 908 (1970).\n\nVII\n\nConger and Nicgorski argue that their convictions for aiding and abetting the transportation of illegal aliens should be reversed. Appellants state that the \" primary\" reason for reversal is that \"the substantive crime defendants are alleged to have aided and abetted was not committed.\" The reason no substantive crime was committed according to appellants is that government agents transported the aliens in each count.\n\nA\n\nAppellants contend that these circumstances are analogous to the case of United States v. Barnett, 667 F.2d 835 (9th Cir. 1982) in which the court overturned a defendant's conviction for aiding and abetting the manufacture of PCP because the government agent whom defendant instructed never actually manufactured the drug. In this case, however the government agents did transport the aliens.\n\nThe government first notes that appellants' argument has no application to Fife's conviction on count five, as no government agent transported that alien. The government then demonstrates that the mere fact that government agents did the actual transportation in the other counts is of no consequence. In United States v. Norton, 700 F.2d 1072 (6th Cir.), cert. denied, 461 U.S. 910, 76 L. Ed. 2d 814, 103 S. Ct. 1885 (1983), the court rejected defendants' contention that their convictions for transporting stolen explosives in interstate commerce were invalid because government agents transported the explosives. The court noted that the aiding and abetting instruction permitted defendants' convictions as principals irrespective of the role of the government agents.\n\nThe government also cites United States v. Ordner, 554 F.2d 24, 29 (2d Cir.), cert. denied, 434 U.S. 824, 54 L. Ed. 2d 82, 98 S. Ct. 71 (1977), in which the court rejected defendant's argument that his conviction for aiding and abetting the unlawful possession of firearms should be reversed because \"it is not illegal for a government agent to possess an unserialed firearm obtained while collecting evidence against an accused[;] it cannot be illegal for the accused to 'cause' that 'possession.'\" The court held that defendant was liable as a principal for aiding and abetting, \"regardless of the fact that the Government agents were themselves immune from criminal responsibility.\" Id. We find the reasoning of the Ordner and Norton decisions persuasive.\n\nB\n\nAppellants assert an alternative argument. They note that the government agents filed control load sheets for each of these aliens to alert law enforcement officers that the aliens were connected to an undercover operation and therefore should not be intercepted. They assert that no substantive crime was committed due to the advance knowledge of INS officials through the control load sheets. Appellants contend that under these circumstances \"the transportation did not further the Central Americans' illegal presence here\" as a matter of law. Appellants argue that the INS' advance knowledge of the 'aliens' transportation means that their illegal presence could not be \"furthered\" as a matter of law.\n\nAppellants state that \"because the [control] forms provided the INS with control over and information about the refugees, their existence rendered it impossible for any person to further the 'aliens' illegal presence in the United States.\" But we reject in section IV, supra, the proposition that INS officials' mere knowledge of the aliens' movements rendered them under \"official restraint\" during their entire presence in the United States. The same reasoning compels the conclusion that these aliens were not under such INS control that no person could further their illegal presence in the United States.\n\nVIII\n\nSome of appellants were convicted under section 1324(a)(3) for harboring illegal aliens. Various claims of error are made in urging the reversal of these convictions. Two of these claims lack merit in light of our conclusions in other parts of this opinion.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e We turn to the contentions that Clark's harboring conviction was unsupported by sufficient evidence, and that the district court erroneously excluded evidence bearing on whether appellants intended to evade INS detection.\n\nA\n\nAppellant Clark contends that his conviction under section 1324(a)(3) for harboring illegal alien Jose Ruben Torres (\"Torres\") must be reversed because the government failed to establish that Clark knew that Torres's entry into the United States was illegal. We must determine \"whether, after viewing the evidence in the light most favorable to the prosecution, any rational trier of fact could have found the essential elements of the crime beyond a reasonable doubt.\" United States v. Lewis, 787 F.2d 1318 (9th Cir. 1986).\n\nThe government details various items of circumstantial evidence that satisfy the Lewis standard. Significantly, Torres testified that he left El Salvador, his native country, for Mexico on his way to the United States. In Mexico he met Quinones, who was to help him get into the United States. Quinones showed Torres a hole in the international border fence, through which Torres illegally entered the United States. Torres went directly to the Sacred Heart Church and met a church secretary named Mary K. Espinosa, who introduced Torres to Clark, saying, \"Socorro [Aguilar] sent him.\" There is evidence in the record indicating that Clark knew about Aguilar's sanctuary work. Torres then told Clark that he was from El Salvador and came to this country to find a job. During their conversation, Clark invited Torres to have lunch with them and to stay in an apartment behind the church.\n\nWhile at the church, two other illegal aliens arrived. Torres and these other two aliens were going to leave the church and go to Phoenix, Arizona. Torres testified that Clark read documents that these two aliens were given by the border patrol and then tore them up. Torres also testified that he overheard Clark advising the two aliens that if stopped in transit, they should lie to the INS agents and claim to be Mexican nationals. Cruz, the government informer who came to the church to transport all three aliens, testified that Clark had informed him that \"these boys were picked up by Immigration.\"\n\nThis evidence amply supports the inference that Clark was aware of Torres's illegal status. Clark contends, however, that this panel must give no credit to this evidence, since the jury apparently rejected it. As proof that the jury discarded this evidence as incredible, Clark notes that the jury acquitted Clark and Espinosa of charges of conspiracy. He concludes that if the jury found this testimony to be credible, then it would have convicted them of conspiracy.\n\nWe disagree. The evidence is not inconsistent with an acquittal on the conspiracy charge. The jury could have believed all this evidence, but have acquitted on the conspiracy count because the prosecution failed to establish the existence of an agreement between Clark and Espinoza beyond a reasonable doubt.\n\nB\n\nAny person who \"willfully or knowingly conceals, harbors, or shields from detection\" an unlawful alien violates section 1324(a)(3). The district court instructed the jury that acts of concealing or shielding consisted of conduct \"tending to directly or substantially facilitate an alien's remaining in the United States unlawfully with the intent to prevent detection by the Immigration and Naturalization Service.\" The court then told the jury that while harboring included \"conduct tending to directly or substantially facilitate the alien's remaining in the United States in violation of law,\" it did not require an intent to aid the unlawful alien for the purpose of evading INS detection. Appellants contend that it was reversible error to strip \"harboring\" of an intent to evade detection. The refusal to provide a requested instruction is reviewed for an abuse of discretion. United States v. Makhlouta, 790 F.2d 1400, 1405 (9th Cir. 1986).\n\nIn United States v. Acosta de Evans, 531 F.2d 428 (9th Cir.), cert. denied, 429 U.S. 836, 50 L. Ed. 2d 101, 97 S. Ct. 103 (1976), this court rejected the very claim that appellants are making in this case. The court examined the legislative history of section 1324(a) and case law from other circuits that already had addressed this issue, concluding that the word \"harbor\" means \"to afford shelter to and does not require an intent to avoid detection. Id. at 430. Appellants enumerate several reasons why we should \"reconsider\" Acosta de Evans.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nEven if Acosta de Evans were incorrectly decided, the appellants' claim would fail given the facts of this case. It is clear beyond any doubt that Clark and Nicgorski, the two appellants convicted under section 1324(a)(3), intended to help the aliens in question to evade INS detection. Indeed, in appellants' proffer for a necessity defense, they candidly acknowledge that their religious beliefs caused them to avoid the INS. See Offer of Proof, United States v. Aguilar, 85-008-PHX-EHC (May 24, 1985).\n\nAppellants next contend that even if harboring does not require an intent to evade government officials, it is undisputably a requirement for \"concealing\" and \"shielding,\" alternative grounds for prosecution under section 1324(a)(3). Consequently, they allegedly were entitled to introduce evidence to establish their belief in the legality of the aliens, \"since a defendant who believes an alien to be legal would not logically act to conceal that alien from detection by the INS.\"\n\nThis argument misstates appellants' position at trial. They candidly explained their belief that they could not present the aliens to the INS because the INS consistently disobeyed the Refugee Act. In their proffer for a necessity defense, appellants stated: \"Given this information regarding the almost automatic deportation of refugees who applied for asylum, religious workers realized that their religious beliefs precluded them from presenting the refugees whose lives were in danger, [sic] to the INS. Id. Thus, appellants' argument is a red herring. When they contend that they believed in the legality of the aliens, they mean only that they thought the aliens were entitled to refugee status under the law. Appellants do not mean that they had no reason to fear the INS. Any claim to the contrary is belied by their proffer.\n\nIX\n\nSix defendants were convicted of conspiring to violate section 1324. The jury specified that the conviction was based on section 1324, a felony, rather than on 8 U.S.C. § 1325, a misdemeanor. The jury did not indicate, however, under which subsection(s) of section 1324 this conviction was based.\n\nA\n\nAppellants contend that the trial court's failure to require the jury to specify the precise subsection(s) upon which the conspiracy convictions were based requires reversal. They argue that reversal is required because (1) an erroneous instruction as to one subsection would render the conviction invalid even if the jury might have convicted under the other subsections; and (2) the conviction may not have been unanimous.\n\nEssentially, appellants fault the trial judge for not providing a special verdict. However, \"it has long been the law that 'it is not the practice of the Federal Courts in criminal cases to call for special verdicts.'\" United States v. Jones, 425 F.2d 1048, 1057 (9th Cir.) (quoting Anderson v. United States, 273 F. 677, 679 (9th Cir. 1921)), cert. denied, 400 U.S. 823 (1970). While a special verdict is the exception and not the rule, there may be cases in which it is appropriate. Id. It is counsel's duty, though, to request a special verdict in order to record the jury's thinking for purposes of appeal. Id. Failure to make a request to the trial court waives any error (except plain error) premised on the lack of a special verdict. Id.\n\nAppellants attempt to distinguish Jones. In that case Jones was charged in counts two through six of mail fraud and in count one of conspiracy to violate the mail fraud statute. The conspiracy count charged that one of the objects of the conspiracy was to commit the mail fraud scheme alleged in counts two through six. The jury convicted on all six counts. On appeal, this court rejected Jones' claim that lack of a special verdict required reversal, holding that Jones waived any error by failing to request a special verdict at the trial court. Appellants in the present case construe Jones to have addressed only the contention that the mere failure to use a special verdict constituted reversible error. In comparison, appellants contend, their\n\npoint is not that the failure to use a special verdict alone caused them prejudice requiring [reversal]. Rather, they argue that if -- unlike in Jones -- this Court finds that the jury was incorrectly instructed regarding the essential elements of any subsection of 1324(a), then this Court must reverse the conspiracy convictions.\n\nAppellants' reading of Jones strips it of any meaning. While not stated explicitly in the opinion, it is evident that Jones did not argue that \"the failure to use a special verdict alone caused [him] prejudice.\" Instead, he was arguing that this failure \"resulted in\" prejudice to him. Jones, 425 F.2d at 1057. Specifically, he complained that the court's instructions permitted conviction without a unanimous verdict.\n\nJones is consistent with the rule in the Fifth Circuit. In Williams v. United States, 238 F.2d 215, 218-19 (5th Cir. 1956), cert. denied, 352 U.S. 1024, 1 L. Ed. 2d 596, 77 S. Ct. 589 (1957), the court held that defendant's failure to request a special verdict precluded his raising on appeal the possibility of error underlying the verdict. The indictment charged defendant with conspiring to violate seven separate provisions of the liquor laws. Six of the provisions were felonies, while one was a misdemeanor. The trial judge advised the jury that the government need only prove that defendant committed one of the seven overt acts as the object of the conspiracy. On appeal, defendant argued that a general verdict left open the possibility that the jury's conspiracy conviction was premised on the violation of the misdemeanor statute. The court concluded that defendant failed to preserve this issue for appeal by failing to call this concern to the trial court's attention by requesting a special verdict. Id. at 219. Defendant was sentenced under the conspiracy count to three years imprisonment, although the misdemeanor's maximum penalty was 30 days imprisonment and a $1,000 fine.\n\nUnder the authority of Jones and Williams, appellants cannot base any errors on the lack of a special verdict, which they failed to request. This requirement is grounded in judicial efficiency and fairness. See Jones, 425 F.2d at 1057. Appellants should not be allowed to set aside a conviction because of the speculative possibility of error, when they could have avoided that speculation merely by requesting a special verdict. Consequently, any of appellants' contentions that seek to impugn the verdict based on possible error concerning a particular subsection fails for lack of preservation, unless they can show plain error. This disposes of their nonunanimous verdict claim.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e It also procedurally bars their argument that the district judge incorrectly defined \"encourage\" and \"induce\" for purposes of section 1324(a)(4).\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e Appellants have not demonstrated plain error.\n\nB\n\nQuinones argues that his conviction for conspiracy violates principles of extraterritoriality. Although unclear, his argument appears to be that the district court lacked subject matter jurisdiction. This claim lacks merit.\n\nIn United States v. Castillo-Felix, 539 F.2d 9 (9th Cir. 1976), this court held that defendant's conviction under section 1324(a)(4) for inducing aliens to enter the United States was not invalid simply because the criminal acts were committed in Mexico. In its discussion, the court quoted United States v. Bowman, 260 U.S. 94, 98, 67 L. Ed. 149, 43 S. Ct. 39 (1922), which observed:\n\n[Some criminal statutes] are such that to limit their locus to the strictly territorial jurisdiction would be greatly to curtail the scope and usefulness of the statute and leave open a large immunity for [crimes] as easily committed by citizens on the high seas and in foreign countries as at home. In such cases, Congress has not thought it necessary to make specific provision in the law that the locus shall include the high seas and foreign countries, but allows it to be inferred from the nature of the offense.\n\nThe court then concluded that the Bowman rule was \"particularly applicable\" to section 1324(a)(4) and thus \"crimes punishable under the laws of the United States were committed.\" Castillo-Felix, 539 F.2d at 13.\n\nCastillo-Felix stands for the proposition, therefore, that a United States court can punish a defendant for violating section 1324(a)(4) when the criminal acts are committed outside our borders. The court emphasized that these crimes negatively affect the United States even when the conduct takes place outside the country: \"In terms of regulation of immigration, it is unimportant where acts constituting the crime occur.\" Id. at 13. This reasoning would extend jurisdiction to each subsection in section 1324, making violation of each a punishable crime even though the criminal acts occurred outside the borders of the United States.\n\nAppellant asserts that the district court had no jurisdiction over him because he is not a U.S. citizen or resident, unlike defendant in Castillo-Felix. Castillo-Felix never discussed defendant's residence or citizenship in analyzing the jurisdictional issue; and appellant fails to show the relevancy of this distinction. He also complains that he was not alleged to have entered the United States as part of the conspiracy, and that the jury was not required to find that his conduct had a negative impact in the United States. Once again, appellant fails to show that these facts are significant.\n\nX\n\nAppellants claim that the district court erred in granting the government's motion to preclude evidence attempting to establish a necessity defense. This court reviews de novo a district judge's decision to bar a necessity defense. United States v. Williams, 791 F.2d 1383, 1388 (9th Cir.), cert. denied, 479 U.S. 869 (1986).\n\nIt is well established in this circuit that a district judge may preclude a necessity defense by granting a motion in limine. See, e.g., United States v. Dorrell, 758 F.2d 427, 430 (9th Cir. 1985); United States v. Contento-Pachon, 723 F.2d 691, 693 (9th Cir. 1984); United States v. Lowe, 654 F.2d 562, 566-67 (9th Cir. 1981). \"The sole question presented in such situations is whether the evidence, as described in the offer of proof, is insufficient as a matter of law to support the proffered defense.\" Dorrell, 758 F.2d at 430.\n\nAs a matter of law, a defendant must establish the existence of four elements to be entitled to a necessity defense: (1) that he was faced with a choice of evils and chose the lesser evil; (2) that he acted to prevent imminent harm; (3) that he reasonably anticipated a causal relation between his conduct and the harm to be avoided; and (4) that there were no other legal alternatives to violating the law. Id. at 430-31. The Dorrell test is stated in the conjunctive; thus, if defendants' offer of proof is deficient with regard to any of the four elements, the district judge must grant the motion to preclude evidence of necessity.\n\nIn the present case, appellants' offer was legally deficient in at least one respect: They failed to establish that there were no other legal alternatives.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e The proffer emphasizes that the INS continuously has frustrated the present legal way of obtaining refugee status. In addition, the immigration judges purportedly deny the due process rights of those granted an asylum hearing and make incorrect determinations of credibility concerning the danger faced in the aliens' homelands. Defendants thus made the following decision:\n\nGiven this information regarding the almost automatic deportation of refugees who applied for asylum, religious workers realized that their religious beliefs precluded them from presenting the refugees whose lives were in danger, [sic] to the INS. Their goal was to protect those from danger, and the results of the asylum process had demonstrated that that process was not only futile, but also extremely dangerous to those who filed and lost.\n\nAccording to defendants, they established the sanctuary movement only after trying \"all these other methods\" and concluding that there was \"no other safe alternative.\" The only \"other methods\" referred to in the proffer were \"attempts at working with and through the INS.\" After purportedly finding that the proper legal channels were futile, appellants resorted to an underground movement.\n\nAs the district judge correctly concluded, however, appellants failed to appeal to the judiciary to correct any improprieties by the INS and the immigration courts.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e In fact, by successfully suing the INS, Salvadorans already have effected changes in INS detention and asylum procedures involving Salvadorans in California. See Orantes-Hernandez v. Smith, 541 F. Supp. 351 (C.D.Cal. 1982) (granting provisional injunctive relief); Orantes-Hernandez v. Meese, 685 F. Supp. 1488 (C.D.Cal. 1988) (granting permanent injunction). Appellants of course do not dispute this; rather, they conclude that \"to the extent the legal alternative of a civil suit could be pursued, it was.\" In the meantime, they continue, many years had passed between filing of the complaint and granting of the permanent injunction, and newly arriving refugees needed immediate help. This argument overlooks the potential for a provisional remedy, such as was provided soon after the complaint was filed in Orantes-Hernandez v. Smith. Moreover, to the extent that aliens were arriving prior to the filing of a class action, appellants themselves could have initiated an action on behalf of the aliens, seeking initial provisional relief and ultimate permanent relief. Since this legal alternative nullifies the existence of necessity for all the underlying crimes stated in section 1324, appellants claim of district court error fails.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nXI\n\nThe first amendment to the Constitution provides in part that \"Congress shall make no law . . . prohibiting the free exercise [of religion].\" U.S. Const. amend I. Appellants contend that this amendment prevents their conviction under sections 1324 and 1325 because their sincere religious beliefs inspired them to commit the forbidden conduct. In analyzing their claim of a first amendment exemption, appellants urge the following examination: (1) the magnitude of burden these laws impose on their religious beliefs; (2) the compelling nature of the government's interest; and (3) the possibility of accommodating a religious exemption without impeding the government's interest. Brief of Appellants 269 (citing EEOC v. Fremont Christian School, 781 F.2d 1362, 1367 (9th Cir. 1986); Callahan v. Woods, 736 F.2d 1269, 1273 (9th Cir. 1984)). The government, on the other hand, presses for a less stringent test, arguing that \"the Supreme Court has never extended the Yoder-type balancing analysis beyond the context of essentially regulatory legislation.\" The Court in Wisconsin v. Yoder, 406 U.S. 205, 230, 32 L. Ed. 2d 15, 92 S. Ct. 1526 (1972), notes the government, emphasized that its ruling did not involve a case in which any harm \"to the public safety, peace, order, or welfare has been demonstrated or may be properly inferred.\" We need not determine the degree of scrutiny that properly should be applied to this case. Even applying the most exacting scrutiny, appellants' first amendment claim cannot withstand analysis.\n\nIn United States v. Merkt, 794 F.2d 950 (5th Cir. 1986) (Merkt II), cert. denied, 480 U.S. 946, 94 L. Ed. 2d 789, 107 S. Ct. 1603 (1987), the Fifth Circuit confronted the claim of a first amendment exemption to sections 1324(a)(1) and (a)(2). After initially doubting the need to apply a form of strict scrutiny to defendants' constitutional claim, the court nonetheless engaged in such an analysis and concluded that the claim lacked merit. First, the court was unconvinced that section 1324 unduly burdened defendants' free exercise of religion, noting: \"Representatives of Catholic and Methodist clergy testified at the pretrial hearing and trial. None suggested that devout Christian belief mandates participation in the 'sanctuary movement.' Obviously, [defendants] could have assisted beleaguered El Salvadorans in many ways which did not affront border control laws. . . .\" Id. at 956. Second, the court found that the government had a compelling need to uniformly enforce its border control laws:\n\nThe statute under which [defendants] were convicted is part of a comprehensive, essential sovereign policy. We cannot engraft judicial exceptions to the illegality of transporting undocumented El Salvadorans without thereby de facto revising, for the unique benefit of El Salvadorans, the legal conditions under which they may abide in this country. This would create [chaos].\n\nId.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e Third and finally, the court was unpersuaded that deportation of the aliens or confiscation of the transporters' vehicles were less restrictive alternatives that would allow a first amendment accommodation. These alternatives, the court concluded, \"would reduce [the government's] efforts to a pitiful farce.\" Id. at 957.\n\nThe reasoning in Merkt persuasively disposes of appellants' constitutional claim in the present case. Unadorned, appellants' assertions are no different from those rejected by the Fifth Circuit. Even assuming that appellants have proved that the enforcement of sections 1324 and 1325 unduly interfered with their religious beliefs, they cannot escape the government's overriding interest in policing its borders.\n\nAppellants repeatedly assail the government for failing to provide evidence to show that it has an overriding interest that cannot accommodate a first amendment exemption. The proposition that the government has a compelling interest in regulating its border hardly needs testimonial documentation. The Court \"has long recognized the power to expel or exclude aliens as a fundamental sovereign attribute exercised by the Government's political departments largely immune from judicial control.\" Shaughnessy v. United States ex rel. Mezei, 345 U.S. 206, 210, 97 L. Ed. 956, 73 S. Ct. 625 (1953); see also Oceanic Navigation Co. v. Stranahan, 214 U.S. 320, 339, 53 L. Ed. 1013, 29 S. Ct. 671 (1909); Fiallo v. Bell, 430 U.S. 787, 792, 52 L. Ed. 2d 50, 97 S. Ct. 1473 (1977).\n\nIn fact, appellants really do not contest the strength of the government's interest. See Brief of Appellants 290 (\"As a general rule, the government has a strong interest in enforcing the immigration laws.\"). Rather, they claim that a limited exemption under the particular facts of this case is appropriate. First, appellants invite us to analyze their first amendment claim by focusing on smuggling, transporting, and harboring individually, requiring the government to demonstrate an overriding interest with respect to each. Id. at 281. We decline this invitation. The government's interest is in controlling immigration, and Congress has determined that this requires penalizing not only smuggling but also transporting and harboring to discourage illegal aliens from crossing the U.S. borders. As the government indicates, one of the aliens involved in this case declared that he was motivated to emigrate to the United States because \"he learned that many congregations were giving assistance to refugees.\" Brief of Appellee 164 n.47 (quoting testimony of Joel Morelos, R.T., v. 55, at 8555). In short, each part of section 1324 \"represents but one facet of the comprehensive legal framework governing entry into the United States and admission to its citizenship.\" Merkt II, 794 F.2d at 955. Second, appellants request that we examine only the facts of this case in determining whether an exemption would be feasible.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e Even on appellants' own terms, it seems clear that a religious exemption for these particular appellants would seriously limit the government's ability to control immigration. In the introduction to their first amendment argument, appellants identify four religious groups that purportedly require their adherents to engage in sanctuary activity -- the Catholic Church, the United Methodist Church, the Presbyterian Church, and the Unitarian Universalist Association. The combined membership of these four groups is incalculable. Appellants cannot seriously contend that they demand a limited exception to the immigration laws.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e Addressing a similar first amendment claim, one court observed:\n\nIf the Government attempted to accommodate into its immigration policy [appellants'] religious beliefs, the Government's efforts would result in no immigration policy at all. As testimony from [appellants'] witnesses indicated, the moral obligation to assist others crosses religious and denominational lines. These widely-held beliefs allow adherents to exercise considerable discretion and would permit religious individuals to form personal immigration policies.\n\nUnited States v. Elder, 601 F. Supp. 1574, 1579 (S.D.Tex. 1985).\n\nIn conclusion, appellants' free exercise claim is without merit. The government's interest in controlling immigration outweighs appellants' purported religious interest,\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e and an exemption would not be feasible.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e As a result, the district court did not err in denying appellants' motion to dismiss the charges.\n\nXII\n\nThe government stipulated at trial that it had used undercover agents and informants since March of 1984 to infiltrate various church meetings and activities. Many of these activities occurred outside the physical boundaries of the church, and the meetings on church property routinely were open to the public and attended by the news media. The government agents observed and tape recorded appellants' activities without a warrant; the absence of a warrant issued by a neutral magistrate is appellant's principal objection.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e\n\nThe government introduced three tape recordings of church meetings during trial, and the government informants testified extensively. The government conceded at trial that if the information derived from these informants was obtained illegally, its entire case would be tainted and dismissal unavoidable. While the government instructed its undercover agents and informants not to tape record overtly religious services, the government conceded at trial that the undercover agents and informants gathered information at religious events.\n\nThe critical aspect of appellants' suppression argument is their suggestion that the first amendment and the fourth amendment necessarily are intertwined in the context of an informer's infiltration of a church. Based upon first amendment principles, appellants contend that society is prepared to recognize as reasonable churchgoers' expectations that \"they could meet and worship in church free from the scrutiny of federal agents and tape recorders.\" A churchgoer need not \"assume[] the risk that apparent fellow worshipers are present in church not to offer homage to God but rather to gain thirty pieces of silver.\"\n\nAppellants' theoretical premise is that the first amendment provides them with an additional expectation of privacy beyond that afforded by the fourth amendment. The first amendment requires this heightened expectation of privacy because a \"community of trust\" is the essence of a religious congregation and the ability of a person to express faith with his fellow believers \"withers and dies when monitored by the state.\" Appellants argue that government \"spying\" on religious activities necessarily chills a person's ability to exercise freely his religious faith.\n\nAppellants' first amendment argument relies upon the principle that under certain circumstances the government's investigation of a political organization may impermissibly burden first amendment rights. In N.A.A.C.P. v. Alabama ex rel. Patterson, 357 U.S. 449, 466, 2 L. Ed. 2d 1488, 78 S. Ct. 1163 (1958), the Court concluded that the state could not compel a politically active organization to disclose its private membership lists because such disclosure would have a \"deterrent effect on the free enjoyment of the right to associate.\" In a similar context, the Court has stated that where \"an investigation . . . intrudes into the area of constitutionally protected rights of speech, press, association and petition,\" \"an adequate foundation for inquiry must be laid before proceeding in such a manner as will substantially intrude upon and severely curtail or inhibit constitutionally protected activities or seriously interfere with similarly protected associational rights.\" Gibson v. Florida Legislative Investigative Committee, 372 U.S. 539, 546, 557, 9 L. Ed. 2d 929, 83 S. Ct. 88 (1963).\n\nAlthough we agree with appellants that the first amendment is relevant to our inquiry in this case, \"appellant[s'] allegation that evidence admitted against [them] should have been suppressed is a Fourth Amendment claim, rather than a First.\" Abell v. Raines, 640 F.2d 1085, 1087 (9th Cir. 1981). The constitutional issues raised herein are reviewed de novo. United States v. McConney, 728 F.2d 1195, 1202 (9th Cir. 1984) (en banc), cert. denied, 469 U.S. 824, 83 L. Ed. 2d 46, 105 S. Ct. 101 (1984).\n\nA\n\nThe government justifies its placement of the informants under the so-called \"invited informer\" or \"misplaced confidence\" cases, the cases permitting consensual recording of conversations without warrants. See United States v. Caceres, 440 U.S. 741, 59 L. Ed. 2d 733, 99 S. Ct. 1465 (1979); United States v. White, 401 U.S. 745, 28 L. Ed. 2d 453, 91 S. Ct. 1122 (1971); Hoffa v. United States, 385 U.S. 293 17 L. Ed. 2d 374, 87 S. Ct. 408 (1966); Lewis v. United States, 385 U.S. 206, 17 L. Ed. 2d 312, 87 S. Ct. 424 (1966); Lopez v. United States, 373 U.S. 427, 10 L. Ed. 2d 462, 83 S. Ct. 1381 (1963); On Lee v. United States, 343 U.S. 747, 96 L. Ed. 1270, 72 S. Ct. 967 (1952). These cases assume that a defendant would have had a legitimate expectation of privacy in his words but for the informer's presence. Hoffa, 385 U.S. at 301 (\"A hotel room can be the object of Fourth Amendment protection as much as a home or an office.\"); Lewis, 385 U.S. at 211 (\"Without question, the home is accorded the full range of Fourth Amendment protections.\"); White, 401 U.S. at 749 (defendant's home).\n\n1\n\nIn Hoffa, for example, a government informer met with defendant in his hotel suite and elsewhere. He subsequently testified about the substance of 'these conversations at trial. The Court found a warrant unnecessary because the informer \"was in the suite by invitation, and every conversation which he heard was either directed to him or knowingly carried on in his presence.\" Hoffa, 385 U.S. at 302. In short, the Court held that the fourth amendment does not \"protect[] a wrongdoer's misplaced belief that a person to whom he voluntarily confides his wrongdoing will not reveal it.\" Id.\n\nIn White, the government informer discussed illegal narcotics transactions with defendant in defendant's home, the informer's car, and a restaurant. Agents monitored these conversations using a radio receiver. The Court described Hoffa as having held that \"however strongly a defendant may trust an apparent colleague, his expectations in this respect are not protected by the Fourth Amendment when it turns out that the colleague is a government agent regularly communicating with authorities.\" 401 U.S. at 749. Accordingly, the Court upheld denial of defendant's motion to suppress.\n\n2\n\nOnce it is determined that it applies, \"the chief remaining limitation on the 'misplaced confidence' doctrine appears to be that the agent or informer may not search for evidence not voluntarily revealed by the unsuspecting criminal.\" Jones v. Berry, 722 F.2d 443, 447 (9th Cir. 1983), cert. denied, 466 U.S. 971, 80 L. Ed. 2d 817, 104 S. Ct. 2343 (1984). In Hoffa, the Court emphasized that \"every conversation which [the informer] heard was either directed to him or knowingly carried on in his presence.\" Hoffa, 385 U.S. at 302. While appellants strenuously object to the application of this doctrine, they do not suggest that the undercover \"agents in this case heard or saw anything that the [appellants] did not intend them to hear or see.\" Jones, 722 F.2d at 447 n.6.\n\n3\n\nThe invited informer doctrine is part of a greater principle of fourth amendment jurisprudence: \"a person has no legitimate expectation of privacy in information he voluntarily turns over to third parties.\" Smith v. Maryland, 442 U.S. 735, 743-44, 61 L. Ed. 2d 220, 99 S. Ct. 2577 (1979). In Smith, the Court cited Hoffa, White, and Lopez, to support its holding that the police do not need a warrant to install a pen register to record the telephone numbers dialed from a person's private residence. Id. at 744. The Court reasoned that in using the telephone, a person \"voluntarily convey[s] numerical information to the telephone company and 'expose[s]' that information to its equipment in the ordinary course of business.\" Id. Consequently, a person \"assume[s] the risk that the [telephone] company would reveal to the police the numbers he dialed.\" Id.\n\nSmith also relied heavily on the Court's prior decision in United States v. Miller, 425 U.S. 435, 48 L. Ed. 2d 71, 96 S. Ct. 1619 (1976), where the Court held that a person has no legitimate expectation of privacy in financial information \"voluntarily conveyed to . . . banks and exposed to their employees in the ordinary course of business.\" Id. at 442. Once again, the Court reiterated the rule that a person \"takes the risk, in revealing his affairs to another, that the information will be conveyed by that person to the Government.\" Id. at 443. This is so, reasoned the Miller Court, \"even if the information is revealed on the assumption that it will be used only for a limited purpose and the confidence placed in the third party will not be betrayed.\" Id. (emphasis added). Most recently, the Court has held that the government can retrieve a person's trash without a warrant because he voluntarily turns it over to garbage workers for collection. See California v. Greenwood, 486 U.S. 35, 108 S. Ct. 1625, 100 L. Ed. 2d 30 (1988).\n\nGiven this unwaivering line of precedent, it is clear that appellants' argument that they had a legitimate expectation of privacy against state scrutiny is inimical to established fourth amendment doctrine. The Supreme Court consistently has rejected such arguments.\n\nB\n\nIn this case, appellants demand the core protection afforded by the fourth amendment -- a search warrant issuable only upon probable cause -- despite the fact that the fourth amendment does not even characterize the government's use of undercover informers as a \"search\" because it does not intrude upon a legitimate expectation of privacy. They argue that the first amendment context of this case makes all the difference.\n\n1\n\nThe Supreme Court has addressed the interplay between the fourth and first amendments in various contexts.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e The Court has noted that seizures of articles protected by the first amendment may \"invoke[] . . . Fourth Amendment warrant requirements because we examine what is 'unreasonable' in the light of the values of freedom of expression.\" Roaden v. Kentucky, 413 U.S. 496, 504, 37 L. Ed. 2d 757, 93 S. Ct. 2796 (1973). \"A seizure reasonable as to one type of material in one setting may be unreasonable in a different setting or with respect to another kind of material.\" Id. at 501.\n\nIn Roaden, the Court overturned the conviction of a drive-in theater manager for exhibiting an allegedly obscene film, because at the time of the defendant's arrest, the arresting officers violated the fourth amendment by seizing without a warrant a film then showing at the theater.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e Crucial to the Court's decision were two factors: first, that the seizure of a film then being exhibited to the general public worked an impermissible \"prior restraint of the right of expression,\" id. at 504, and second, that the judgment of the arresting officer alone was insufficient to insure that the film was contraband obscenity, id. at 506.\n\nRoaden is part of a line of Supreme Court cases addressing the seizure of allegedly obscene materials. These cases recognize that endemic in obscenity is a definitional problem. \"The line between speech unconditionally guaranteed and speech which may legitimately be regulated, suppressed, or punished is finely drawn.\" United States v. Sherwin, 572 F.2d 196, 200 (9th Cir. 1977), cert. denied, 437 U.S. 909, 57 L. Ed. 2d 1140, 98 S. Ct. 3101 (1978) (quoting Speiser v. Randall, 357 U.S. 513, 525, 2 L. Ed. 2d 1460, 78 S. Ct. 1332 (1958)).\n\nTo insure that unconditionally protected speech is not wrongfully seized and suppressed, exceptions to the warrant requirement, perhaps acceptable in other contexts, are unacceptable for the seizure of allegedly obscene material. \"Otherwise, police officers could seize any publication or film they deem unprotected by the First Amendment. . . .\" United States v. Hale, 784 F.2d 1465, 1469 (9th Cir.), cert. denied, 479 U.S. 829, 93 L. Ed. 2d 59, 107 S. Ct. 110 , (1986). For example, as Roaden itself holds, the first amendment requires an exception to \"the general rule under the Fourth Amendment . . . that any and all contraband, instrumentalities, and evidence of crimes may be seized on probable cause (and even without a warrant in various circumstances) . . . .\" Fort Wayne Books, Inc. v. Indiana, 489 U.S. 46, 109 S. Ct. 916, 927, 103 L. Ed. 2d 34 (1989). In addition, the plain view doctrine cannot be used to seize allegedly obscene materials not specified in a warrant. See Hale, 784 F.2d at 1469; Sherwin, 572 F.2d at 200.\n\nThe first amendment insists upon a \"procedure 'designed to focus searchingly on the question of obscenity.' \"A Quantity of Books v. Kansas, 378 U.S. 205, 12 L. Ed. 2d 809, 84 S. Ct. 1723 (1964). Such judicial oversight is necessary in light of the core first amendment interest against the suppression of protected speech. Indeed, the first amendment generally prohibits the seizure of all available copies of an allegedly obscene film without a judicial determination of the obscenity issue in an adversary proceeding. Heller v. New York, 413 U.S. 483, 491, 37 L. Ed. 2d 745, 93 S. Ct. 2789 (1973).\n\nAnother core first amendment value is at work in many of these cases. \"It is 'the risk of prior restraint, which is the underlying basis for the special Fourth Amendment protections accorded searches for and seizure of First Amendment materials' that motivates this rule\" requiring judicial oversight. Fort Wayne, 109 S. Ct. at 928 (emphasis added). Where the police seize books and films from a public bookstore or theater they necessarily effect a prior restraint of speech. Of course, \"any system of prior restraints of expression comes to this Court bearing a heavy presumption against constitutional validity.\" New York Times Co. v. United States, 403 U.S. 713, 714, 29 L. Ed. 2d 822, 91 S. Ct. 2140 (1971).\n\nThe Supreme Court also has acknowledged that first amendment interests may justify scrupulous adherence to the fourth amendment's warrant requirements in contexts other than obscenity, see Stanford v. Texas, 379 U.S. 476, 13 L. Ed. 2d 431, 85 S. Ct. 506 (1965), although it has rejected claims of procedural protections over and above those provided by a warrant, see Zurcher v. Stanford Daily, 436 U.S. 547, 565, 56 L. Ed. 2d 525, 98 S. Ct. 1970 (1978).\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e\n\n2\n\nIn Maryland v. Macon, 472 U.S. 463, 468-69, 86 L. Ed. 2d 370, 105 S. Ct. 2778 (1985), the Supreme Court distinguished the cases mandating \"special constraints on searches for and seizures of presumptively protected [first amendment] material\" where the fourth amendment was not even triggered. \"Absent some action taken by government agents that can properly be classified as a 'search' or a 'seizure,' the Fourth Amendment rules designed to safeguard First Amendment freedoms do not apply.\" Macon, 472 U.S. at 468-69.\n\nIn Macon, undercover detectives entered an adult bookstore and purchased two magazines. 472 U.S. at 465. After concluding that the magazines were obscene, the detectives returned to the bookstore and arrested the clerk for selling obscenity. The Court rejected the defendant's argument that the magazines should have been suppressed as the product of a warrantless search and seizure. In doing so, the Court distinguished Roaden and similar cases on the basis that there unquestionably had been a \"search\" or \"seizure\" under the fourth amendment in these previous cases calling for consideration of the first amendment context. Thus, the Court rejected the relevance of the first amendment context altogether where the fourth amendment was not triggered.\n\nThe Macon Court reasoned that the police officers did not search the bookstore within the meaning of the fourth amendment merely by entering the store and examining its wares as would any other customer. The Court employed the logic of the invited informer cases: \"The mere expectation that the possibly illegal nature of a product will not come to the attention of the authorities, whether because a customer will not complain or because undercover officers will not transact business with the store, is not one that society is prepared to recognize as reasonable.\" 472 U.S. at 469. In addition, the Court concluded that the officers did not seize the magazines within the meaning of the fourth amendment, because the clerk \"voluntarily transferred any possessory interest he may have had in the magazines to the purchaser upon receipt of the funds.\" Id. The Court found helpful a citation to Lewis, an invited informer case.\n\nThe Macon decision obviously distinguishes Roaden and like cases mandating first amendment procedural protections greater than those provided by the fourth amendment. As in Macon, a traditional fourth amendment inquiry in this case yields the conclusion that the police do not conduct a \"search\" when they use an undercover agent who operates at the defendant's invitation. The Macon Court recoiled against the notion that a defendant would be entitled to the core fourth amendment protection, a search warrant issued upon probable cause, although the fourth amendment itself was not even implicated. We also find this sentiment highly persuasive, although we do not end our analysis with the Macon case.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e\n\nWe reached a result similar to that of the Macon case in United States v. Gering, 716 F.2d 615 (9th Cir. 1983). In Gering, we rejected a claim that the first amendment invalidated a police investigation conducted without a warrant where the investigation clearly was permissible under the fourth amendment. In Gering, an ordained minister was convicted of mail fraud by soliciting donations for needy children and missionary work and diverting these funds to other uses. The government learned the names of many contributors through a so-called mail cover operation, where investigators maintained a record of the information on the outside of mail received by the defendant at his house and church. Id. at 618.\n\nThe propriety of a mail cover investigation under the fourth amendment was settled,\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e but the defendant argued that his first amendment free exercise rights were violated by the mail cover operation. Consequently, Gering is directly analogous to this case, because the defendant argued that the first amendment created an expectation of privacy in his religious activities, although the fourth amendment alone granted no such expectation of privacy. The Gering court rejected the defendant's first amendment argument, explaining that the defendant had \"failed to show that the mail covers were improperly used and burdened his free exercise or associational rights.\" Id. at 620. Accordingly, the Gering court rejected the defendant's suggestion that the free exercise clause afforded him an expectation of privacy where the fourth amendment did not.\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e\n\nIn Reporters Committee v. American Telephone \u0026 Telegraph, 192 U.S App. D.C. 376, 593 F.2d 1030 (D.C. Cir. 1978), cert. denied, 440 U.S. 949, 99 S. Ct. 1431, 59 L. Ed. 2d 639 (1979), the court rejected various newspapers' and reporters' challenge to the telephone company's practice of releasing telephone billing records of reporters' long-distance toll calls to government agents investigating felonies. The reporters claimed that the first and fourth amendments required that they be given notice of the government's request and a judicial hearing prior to the release of their billing records. Id. at 1038.\n\nAnticipating Smith, the Reporters Committee court easily dismissed the appellants' fourth amendment claim on the authority of Miller and similar cases supporting the principle that \"to the extent an individual knowingly exposes his activities to third parties, he surrenders Fourth Amendment protections . . . .\" Id. at 1043. Concerning the first amendment, the reporters argued that disclosure of their long-distance billing records would undermine their information-gathering activities, and that even if other citizens had no expectation of privacy in their billing records, the first amendment itself demanded such protection for a reporter's long distance telephone billing records. The Reporters Committee court concluded, however, that the first amendment did not justify the reporters' prayer for an injunction requiring prior notice of any disclosures. While the reasoning of the court was divided between two opinions, both judges concluded that the first amendment afforded the reporters no protection against good faith criminal investigations and that the threat of bad faith investigations was wholly speculative. Id. at 1064, 1075.\n\nC\n\nAppellants assert that privacy, trustworthiness, and confidentiality are at the very heart of many instances of free association and religious expression and communication. We do not take issue with appellants' premise. Yet, simply precluding application of the invited informer doctrine does not assure confidentiality. Even if the government were unable to plant an undercover agent, \"the risk of being overheard by an eavesdropper or betrayed . . . is probably inherent in the conditions of human society.\" Hoffa, 385 U.S. at 303. Nothing would prevent a law abiding church-goer from telling the police that his church was being used for illegal purposes, and unless the informant's conduct is fairly attributable to the government, the Constitution is not even implicated. See United States v. Miller, 688 F.2d 652, 657 (9th Cir. 1982).\n\nIn addition, a fair reading of the invited informer cases teaches that their rationale inherently imposes a rather significant burden on first amendment free association rights. In approving this investigative technique, the Supreme Court unmistakably declared that persons have no expectation of privacy or confidentiality in their conversations and relations with other persons, no matter how secretive the setting. The Court has recognized that legitimate law enforcement interests require persons to take the risk that those with whom they associate may be government agents.\n\n1\n\nIn Lopez, for example, an Internal Revenue Agent told the defendant that he was investigating his business for possible tax evasion. On one of the agent's visits to the business, the defendant gave the agent $420 to drop the investigation. The agent informed his superiors of the bribery attempt and they urged him to \"pretend to play along with the scheme\" by returning to the business with a concealed tape recorder. 373 U.S. at 430. He did so, and the Court upheld the admission of the tape recording because \"it was carried in and out by an agent who was there with petitioner's assent, and it neither saw nor heard more than the agent himself.\" Id. at 439.\n\nIn dissent, Justice Brennan criticized the majority for failing to recognize that \"freedom of speech is undermined where people fear to speak unconstrainedly in what they suppose to be the privacy of home and office.\" Id. at 470. He cited several cases, including N.A.A.C.P. v. Alabama, for the proposition that \"First Amendment freedoms may include the right, under certain circumstances, to anonymity,\" id., and he chastised the majority for failing to heed this principle, id. at 471. The Lopez majority, however, was unmoved by this first amendment argument.\n\nThe argument that the invited informer rationale was incompatible with the first amendment again fell on deaf ears in the White case, where the Court upheld the testimony of agents who had listened to a radio transmitter worn by an undercover informant as he spoke with the defendant in the defendant's home. Justice Douglas' dissent argued that the first amendment precluded the agents' testimony. His reasoning, which bears a striking resemblance to the arguments appellants make in this case in the free exercise context, merits reproduction in full. Justice Douglas stated as follows:\n\nMonitoring, if prevalent, certainly kills free discourse and spontaneous utterances. Free discourse -- a First Amendment value -- may be frivolous or serious, humble or defiant, reactionary or revolutionary, profane or in good taste; but it is not free if there is surveillance. Free discourse liberates the spirit, though it may produce only froth. The individual must keep some facts concerning his thoughts within a small zone of people. At the same time he must be free to pour out his woes or inspirations or dreams to others. He remains the sole judge as to what must be said and what must remain unspoken. This is the essence of the idea of privacy implicit in the First and Fifth Amendments as well as in the Fourth.\n\nWhite, 401 U.S. at 762-63.\n\nFinally, it is significant that this court has not limited the reach of the invited informer rationale in a way that protects privacy and associational interests. For instance, it has been proposed that the doctrine should apply only where the undercover agent proposes an illegal transaction in the first instance, because \"this limit is one which is likely to free innocent persons from intrusions into their privacy.\" 3 W. LaFafe, Search and Seizure § 8.2(m), at 225-26 (1987). Nonetheless, in United States v. Miller, 688 F.2d 652, 659 (9th Cir. 1982), the court upheld an undercover agent's entry onto private property on the pretext that he was interested in buying a trailer, a wholly innocent inquiry. In Jones, the undercover agents only vaguely hinted at possible illegality in their first meeting with the defendant. 722 F.2d at 445.\n\n2\n\nThe courts have recognized the implicit first amendment aspect of the invited informer doctrine in the context of political association. For instance, in United States v. Oaks, 527 F.2d 937, 938 (9th Cir. 1975), cert. denied, 426 U.S. 952, 49 L. Ed. 2d 1191, 96 S. Ct. 3177 (1976), the defendant was \"a leading member of a tax rebellion group,\" the Tax Rebellion Committee, who explained his failure to file an income tax return on the basis that \"he had been paid in Federal Reserve Notes 'which are not lawful money.'\" The Committee's meetings were open to the public, and undercover agents conducted surveillance of \"the participants [who] were openly advocating the willful violation of Internal Revenue laws.\" Id. at 941.\n\nThe Oaks court stated that \"the risk of surveillance of meetings of this type must be assumed.\" Id. Citing Hoffa, the court held that \"no interest legitimately protected by the First and Fifth Amendments is involved.\" Id. The Oaks court explained that \"while Hoffa involved an alleged violation of the Fourth Amendment, we find the reasoning of the Court equally applicable to the First and Fifth Amendments under the facts of this case.\" Id. at 941 n. 7.\n\nAnother case of significance is Socialist Workers Party v. Att'y General, 419 U.S. 1314, 42 L. Ed. 2d 627, 95 S. Ct. 425 (1974), where Justice Marshall, acting alone as Circuit Justice, refused to stay the Court of Appeals' reversal of a district court injunction that had barred undercover government informants from attending the national convention of the Young Socialist Alliance, the youth organization of the Socialist Workers Party. Justice Marshall found it significant that the convention was open to any member of the public under the age of 29, the government had promised not actively to disrupt the convention, and that the government's conduct \"was entirely legal, and if relief was granted [to the YSA], the potential injury to the FBI's continuing investigative efforts would be apparent.\" Id. at 1320.\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e\n\nThe Tenth Circuit's recent decision in Pleasant v. Lovell, 876 F.2d 787 (10th Cir. 1989), amended, June 6, 1989, is also informative. In Pleasant, the government used an undercover agent to infiltrate the National Commodity and Barter Association (NCBA), an organization advocating organized opposition to the federal income tax laws. The 145 members of the NCBA filed a lawsuit alleging first and fourth amendment violations by the government agents in the Criminal Investigation Division of the IRS who received information from this undercover agent.\n\nThe Pleasant court concluded that these government agents were entitled to qualified immunity for the information they received from the undercover agent that was obtained within the scope of the agent's duties as an NCBA employee. The court reasoned that the invited informer cases were applicable to the situation at hand, because \"the government may resort to artifice and stratagem to disclose violations of the law.\" Id. at 36. The Pleasant court concluded that the key limitation on the government's conduct was that the undercover agent must adhere scrupulously to the scope of her invitation. Slip op. at 38. In other words, the court found that the defendants were only entitled to qualified immunity for information the undercover agent obtained with the full knowledge of the NCBA targets. The court rejected the plaintiffs' contention that \"the lawfulness of the consensual monitoring activities under the forth amendment is immaterial for purposes of their first amendment claim.\" Id. at 43.\n\nD\n\nWe take the lesson of these cases to be that the government did not have to obtain a warrant to use undercover informers to investigate the sanctuary movement. These cases establish that there are two limitations on the government's use of undercover informers to infiltrate an organization engaging in protected first amendment activities. First, the government's investigation must be conducted in good faith; i.e., not for the purpose of abridging first amendment freedoms. See Reporters Committee, 593 F.2d at 1061 (\"journalists would have an effective remedy if bad faith harassing subpoenas were employed against them.\") (relying upon Branzburg v. Hayes, 408 U.S. 665, 707, 33 L. Ed. 2d 626, 92 S. Ct. 2646 (1972)); cf. Gering, 716 F.2d at 620 (mail covers were not used \"improperly\"). As we reject appellants' selective investigation and prosecution claim, infra, there is no issue in this case as to the government's good faith in undertaking this investigation.\n\nSecond, the first amendment requires that the undercover informers adhere scrupulously to the scope of a defendant's invitation to participate in the organization. See Pleasant, slip op. at 38. That requirement is satisfied in this case; appellants do not even suggest that the undercover informers' strayed beyond the scope of their invitation.\n\nRelevant to our decision is the sentiment expressed in United States v. Rubio, 727 F.2d 786, 791 (9th Cir. 1983), that \"we strongly disagree with any inference that criminal investigation is somehow prohibited when it interferes with . . . First Amendment interests.\" A search warrant requirement for undercover government agents to investigate an organization concededly engaging in protected first amendment activities indeed would prohibit law enforcement officials from using an indispensable method of criminal investigation appropriate in any other circumstance.\n\n\"The use of undercover officers is essential to the enforcement of vice laws.\" Macon, 472 U.S. at 470 (emphasis added). In many cases a search warrant prerequisite would be tantamount to prohibiting a criminal investigation in its entirety, because the information learned from undercover government agents is often the basis for probable cause. The Constitution does not impose this high cost in the present case.\n\nXIII\n\nAppellants contend that the district court improperly denied their request for an evidentiary hearing and discovery on their motion for dismissal based upon selective prosecution. The motion was filed subsequent to jury selection and the government objected to it as untimely.\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e Appellants contend they were singled out for prosecution because of their \"vocal opposition to U.S. refugee and asylum policy and to U.S. foreign policy in Central America.\"\n\nA\n\nThere is a split in this circuit as to whether the appropriate standard of review is abuse of discretion or clearly erroneous. United States v. Moody, 778 F.2d 1380, 1385 (9th Cir. 1985). The Moody court did not choose between these standards because defendant satisfied neither. Similarly, as we find that appellants have failed to demonstrate that the district court erred under either standard, we need not resolve the conflict.\n\nB\n\n\"To establish impermissible selective prosecution, a defendant must show that others similarly situated have not been prosecuted and that the prosecution is based on an impermissible motive.\" United States v. Lee, 786 F.2d 951 (9th Cir. 1986). Claims of selective prosecution are to be judged under ordinary equal protection standards. Wayte v. United States, 470 U.S. 598, 608, 84 L. Ed. 2d 547, 105 S. Ct. 1524 (1985).\n\nAppellants claim that theirs are the only section 1324 prosecutions in Arizona not involving economic or physical exploitation of aliens. In the three years prior to this prosecution, appellants assert that the indictments in this case represent 100% of the \"non-economic/non-exploitative\" substantive and conspiracy indictments under section 1324, and 80% of the harboring prosecutions under section 1325. By contrast, \"on facts similar to this case,\" growers and ranchers employing illegal aliens had not been prosecuted in the previous ten years, according to appellants.\n\nIn short, appellants contend that they are similarly situated to these growers and ranchers because neither exploits the aliens physically or economically. Appellants must demonstrate as a prerequisite to an evidentiary hearing that similarly situated persons \"are generally not prosecuted for the same conduct.\" United States v. Wilson, 639 F.2d 500, 503 (9th Cir. 1981). This first prong of the selective prosecution prima facie showing insures that the government has at least conducted selective prosecutions; if similarly situated persons are being prosecuted then\" appellants fail to make the required showing.\n\nC\n\nThe goal of identifying a similarly situated class of law breakers is to isolate the factor allegedly subject to impermissible discrimination. The similarly situated group is the control group. The control group and defendant are the same in all relevant respects, except that defendant was, for instance, exercising his first amendment rights. If all other things are equal, the prosecution of only those persons exercising their constitutional rights gives rise to an inference of discrimination. But where the comparison group has less in common with defendant, then factors other than the protected expression may very well play a part in the prosecution.\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e\n\n1\n\nOur task is to identify an appropriate control group. Absent a similarly situated control group, the government's prosecution of a defendant exercising his constitutional rights proves nothing. For example, in the case of Attorney General v. Irish People, Inc., 221 U.S. App. D.C. 406, 684 F.2d 928 (D.C. Cir. 1982), cert. denied, 459 U.S. 1172, 74 L. Ed. 2d 1015, 103 S. Ct. 817 (1983), defendant, a newspaper publisher, claimed that it was selectively prosecuted for failing to register as a foreign agent because of the paper's editorial support for the Irish Republican Army. The court rejected defendant's argument, reasoning that \"discrimination cannot exist in a vacuum; it can be found only in the unequal treatment of people in similar circumstances.\" Id. at 946. \"As the district court found, there was no one to whom defendant could be compared in order to resolve the question of [selection;] it follows that defendant has failed to make out one of the elements of its case.\" Id. at 946.\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e\n\n2\n\nIn tax protest cases, all those who refuse to pay taxes are generally treated as being similarly situated. See United States v. Scott, 521 F.2d 1188, 1195 (9th Cir. 1975), cert. denied, 424 U.S. 955, 47 L. Ed. 2d 361, 96 S. Ct. 1431 (1976). Consequently, were the government only to prosecute vocal opponents of the tax laws, an inference of selective prosecution would arise. Similarly, all persons refusing to complete census forms are considered similarly situated, so that prosecution only of persons expressing vocal opposition to the census gives rise to a claim of selective prosecution.\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e\n\n3\n\nIf all persons breaking the immigration laws were considered similarly situated, then appellants' argument would fail. The government clearly prosecutes persons for immigration law violations who do not vocally oppose United States policy in Central America. The government demonstrates that in the District of Arizona in the three years preceding this indictment, 1983, 1984 and 1985, there were 102 persons charged with conspiracy to violate section 1324, 460 persons charged with substantive offenses under section 1324, and 1,274 persons charged with violating section 1325. These statistics indicate that many persons are generally being prosecuted for violating the immigration laws. Appellants do not contend that all of these prosecutions were against vocal opponents of the government.\n\nRealizing that their selective prosecution claim fails if all persons who violate the immigration laws are considered similarly situated, appellants urge the court to fashion a definition of similarly situated to include only those persons not profiting economically or physically exploiting aliens. Indeed, appellants' argument hinges on their assertion that they are similarly situated to ranchers and farmers but not to organized smuggling rings operating for profit. Using this definition, appellants contend that agricultural growers and farmers are similarly situated law breakers that the government does not prosecute.\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e\n\nAppellants' definition of similarly situated fails because it does not insure that all distinctions extraneous to the first amendment expression are removed. The government argues that appellants are similarly situated to \"well-organized and structured alien smuggling conspiracies that were smuggling high volumes of aliens.\" Agent Rayburn testified that immigration authorities had never uncovered a similar conspiracy by Arizona farmers or growers to transport illegal aliens outside the State of Arizona. The United States Attorney testified that the office's focus was upon organized smuggling rings.\n\nAppellants' suggested definition of similarly situated excludes the one class of immigration law violators with whom they are most analogous: organized smugglers operating for financial gain. This group is unlikely to have a political motivation for their conduct and is consequently unlikely to be a vocal opponent of United States foreign policy. They represent the perfect control group because they present a similar threat to immigration policy in terms of the numbers of aliens they smuggle, but they do not engage in the expression that appellants' claim motivated this prosecution.\n\nAppellants do not contend that the government generally does not prosecute organized alien smugglers. Their suggested focus exclusively upon agricultural employers seeks to distract attention away from the fact that the government generally does prosecute organized alien smugglers, albeit organized smugglers following the dollar instead of the cross. We reject appellants' suggested definition of the similarly situated class and thus their selective prosecution claim.\n\nD\n\nNevertheless, appellants cite the case of United States v. Kerley, 787 F.2d 1147, 1150 (7th Cir. 1986), for the proposition that a defendant need not make a full prima facie showing in order to be entitled to discovery in connection with a selective prosecution claim. The Kerley case establishes a lower threshold for discovery than for the evidentiary hearing. The D.C. Circuit has rejected a lower threshold for discovery. Irish People, 684 F.2d at 948. In any event, the court below did set a hearing in which appellants cross-examined two United States Attorneys and the case agent. This provided them with sufficient discovery on this issue.\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e\n\nXIV\n\nDefendant Conger argues that the district court improperly denied his motion to suppress all evidence of his participation in the sanctuary movement. Conger previously was arrested on March 7, 1984, after INS agents stopped the vehicle in which he was transporting four illegal aliens. Conger was indicted for that offense, but that court suppressed all evidence resulting from the stop because it found the vehicle stop was not based upon founded suspicion. The INS had seized Conger's backpack, which included the names, addresses, and telephone numbers of almost all defendants charged in this indictment, and Conger's personal calendar which recorded meetings with refugees in the Nogales jail. None of the previously suppressed evidence was introduced against Conger in this case, but he argues that all of the evidence of his sanctuary participation is a fruit of the illegal stop on March 7, 1984. This was the first evidence linking Conger to the sanctuary movement.\n\nThe district court found that agent James Rayburn's second application for a covert investigation on April 24, 1984, relied upon the materials illegally seized from Conger in March. The INS did not authorize the undercover investigation until May of 1984. The court also found that the government continued to use copies of these suppressed documents subsequent to the suppression order, although the originals were returned to Conger. Nonetheless, the district court concluded that the government established that the evidence of Conger's sanctuary involvement was not subject to suppression.\n\nThe threshold inquiry is whether the government's evidence against Conger was the fruit of his illegal stop. The test for whether evidence is the fruit of prior illegal conduct is as follows:\n\nWe need not hold that all evidence is 'fruit of the poisonous tree' simply because it would not have come to light but for the illegal actions of the police. Rather, the more apt question in such a case is 'whether, granting establishment of the primary illegality, the evidence to which instant objection is made has been come at by exploitation of that illegality or instead by means sufficiently distinguishable to be purged of the primary taint.'\n\nWong Sun v. United States, 371 U.S. 471, 587-88, 9 L. Ed. 2d 441, 83 S. Ct. 407 (1963).\n\nIn this case, the question is whether the evidence produced by the government's subsequent undercover investigation of the sanctuary movement is sufficiently distinguishable to have been purged of the government's illegal seizure of Conger's papers. The court in United States v. Cales, 493 F.2d 1215 (9th Cir. 1974), addressed a similar issue. An illegal wiretap triggered an investigation which had long been dormant. Id. at 1215. The revived investigation produced evidence that prompted the government to seek defendant's conviction for income tax evasion.\n\nThe Cales court stated that \"evidence need not be suppressed merely because it would not have come to light but for the illegal wiretap.\" Id. The court concluded that the critical issue is \"what kind of direction and impetus the illegal wiretap gave to the . . . investigation: did anything seized illegally, or any leads gained from that illegal activity, tend significantly to direct the investigation toward the specific evidence sought to be suppressed?\" Id. at 1215-16. The court held that even if the illegally seized evidence was a factor in the decision to \"target\" defendant for investigation, the government must be allowed to demonstrate that the evidence it obtained from the investigation was obtained independently from the original illegality. Id. at 1216.\n\nUnder this standard, Cruz's testimony against Conger was properly admitted at trial. While the Cales court concluded that it was not improper to target a particular individual, the government did not even use the illegal evidence to target Conger for investigation. The government's undercover informer Cruz was not given access to the illegal evidence and was directed only to make contact with Quinones. On his third meeting with Quinones, Quinones and Aguilar introduced Cruz to Conger. This is critical, as the Cales court emphasized the necessity for the illegal evidence to direct the government to evidence admitted at trial.\n\nConger's ultimate contention is that the government could not use the evidence it illegally seized from his car to initiate the undercover investigation of the sanctuary movement. But the Cales court was absolutely correct to reject the proposition that law enforcement officials\" are precluded from initiating an investigation after they become aware of illegal conduct through an illegal search. Where the government stumbles upon illegality, albeit through an improper search, the law breaker is not somehow insulated forever thereafter from further independent investigation.\n\nHere, the government used the illegally seized information to initiate an investigation of an entire organization, not to target Conger individually. The natural progress of this investigation resulted in the government discovering additional evidence of Conger's criminality. Under these circumstances, we hold that the evidence resulting from the investigation is not poisonous fruit.\n\nXV\n\nThe appellants have advanced numerous arguments in challenging their convictions for violating the United States immigration laws. We have reviewed each challenge carefully and conclude that none has merit. Accordingly, the judgment is AFFIRMED.\n\n\u003cspan class=\"fn\"\u003e1. Appellants were convicted on the following counts: 1. Maria del Socorro Pardo Viuda de Aguilar (\"Aguilar\"): count 1 charging conspiracy to violate 8 U.S.C. § 1324, and count 2 charging bringing in alien Ana Trinidad Martel-Benavidez in violation of section 1324(a)(1). 2. Anthony Clark (\"Clark\"): count 20 charging harboring alien Jose Ruben Torres in violation of section 1324(a)(3). 3. Philip M. Conger (\"Conger\"): count 1 charging conspiracy to violate section 1324, count 6 charging aiding and abetting the unlawful entry of aliens Angel Mejia, Edwin Chavez, and Mervin Chavez in violation of 1324(a)(2), and count 26 charging aiding and abetting the unlawful entry of alien Alejandro Rodriguez in violation of 1325. 4. John M. Fife (\"Fife\"): count 1 charging conspiracy to violate section 1324, count 4 charging aiding and abetting the unlawful entry of aliens Angel Mejia, Edwin Chavez, and Mervin Chavez in violation of 1324(a)(2), and count 5 charging aiding and abetting the unlawful transportation of alien Elba Teresa de Lopez in violation of 1324(a)(2). 5. Peggy Hutchison (\"Hutchison\"): count 1 charging conspiracy to violate section 1324. 6. Wendy LeWin (\"LeWin\"): count 16 charging unlawful transportation of aliens Joel Morelos-Lopez and Gabriela Ruiz de Morelos in violation of 1324(a)(2). 7. Darlene Nicgorski (\"Nicgorski\"): count 1 charging conspiracy to violate section 1324, count 10 charging aiding and abetting the unlawful transportation of aliens Jose Antonio Nieto Nunez, Sandra Nieto Nunez, and Francisco Nieto Nunez in violation of 1324(a)(2), count 11 charging aiding and abetting the unlawful transportation of alien Elba Teresa Lopez in violation of 1324(a)(2), count 18 charging harboring aliens Frederico Cruz-Antonio, Joel Morelos-Lopez, and Gabriela Ruiz de Morelos in violation of 1324(a)(3), and count 19 charging harboring aliens Jose Antonio Nieto Nunez, Sandra Nieto Nunez, and Francisco Nieto Nunez in violation of 1324(a)(3). 8. Ramon Dagaberto Quinones (\"Quinones\"): count 1 charging conspiracy to violate section 1324, and count 28 charging aiding and abetting the unlawful entry of alien Jose Ruben Torres in violation of 1325.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Section 1324(a) states in full: a) Any person, including the owner, operator, pilot, master, commanding officer, agent or consignee of any means of transportation who -- (1) brings into or lands in the United States, by any means of transportation or otherwise, or attempts, by himself or through another, to bring into or land in the United States, by any means of transportation or otherwise; (2) knowing that he is in the United States in violation of law, and knowing or having reasonable grounds to believe that his last entry into the United States occurred less than three years prior thereto, transports, or moves, or attempts to transport or move within the United States by means of transportation or otherwise, in furtherance of such violation of law; (3) willfully or knowingly conceals, harbors, or shields from detection, or attempts to conceal, harbor, or shield from detection, in any place, including any building or any means of transportation; or (4) willfully or knowingly encourages or induces, or attempts to encourage or induce, either directly or indirectly, the entry into the United States of-- any alien, including an alien crewman, not duly admitted by an immigration officer or not lawfully entitled to enter or reside within the United States under the terms of this chapter or any other law relating to the immigration or expulsion of aliens, shall be guilty of a felony, and upon conviction thereof shall be punished by a fine not exceeding $2,000 or by imprisonment for a term not exceeding five years, or both, for each alien in respect to whom any violation of this subsection occurs: Provided, however, That for the purposes of this section, employment (including the usual and normal practices incident to employment) shall not be deemed to constitute harboring. All references made to, and analysis of, section 1324 are to this version. In 1986 section 1324 was revised. 8 U.S.C. § 1324(a) (Supp. IV 1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The Court in Liparota was candidly uneasy about criminalizing unremarkable behavior. Liparota, 471 U.S. at 426. This concern is simply not raised by the defense appellants wish to present.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Before discussing this exception, the Fierros panel was careful to state the general rule that ignorance or mistake of law is no defense to specific intent crimes. The panel noted: \"A moment's thought is enough to refute the general proposition that ignorance of law is a proper defense to any crime requiring a specific intent.\" Fierros, 692 F.2d at 1294; see also American Surety Co. v. Sullivan, 7 F.2d 605, 606 (2d Cir. 1925) (Judge Learned Hand cautioned that \"[the] word 'willful,' even in criminal statutes, means no more than that the person charged with the duty knows what he is doing. It does not mean that, in addition, he must suppose that he is breaking the law.\"). This proposition causes us to reject United States v. Rhone, 275 U.S. App. D.C. 10, 864 F.2d 832, slip op. (D.C.Cir. 1989). The D.C. Circuit in Rhone permitted defendant in a prosecution for fraudulently claiming state unemployment benefits to present a defense of ignorance or mistake of law. The criminal statutes in question required a specific intent. Based on this fact alone, the court believed that an ignorance of the law instruction, in effect, would remove this element of the crime. The court found the following fault in the jury instruction: \"If ignorance of the law is no excuse, then appellant is guilty regardless of whether she knew she was violating the law.\" The Rhone court then doubted in dicta that an objectively reasonable limitation on an ignorance or mistake of law defense would be proper. This observation also conflicts with language in our Fierros opinion; and for reasons articulated in the following footnote, we disagree with this dicta.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The qualification \"reasonable grounds to believe\" in Fierros contemplates that a defense of ignorance or mistake of law is available only if the ignorance or mistake is objectively reasonable. See also United States v. Kelley, 539 F.2d 1199, 1204 (9th Cir. 1976) (\"Neither civil disobedience nor unreasonable and bad faith mistakes of law should constitute a defense to a prosecution.\") (emphasis added). We express no opinion about whether this limitation exists when a defendant seeks to proffer evidence that his perception of factual events negatives the mens rea provided in the statute; we are not confronted with such a claim in this case. Similarly, we are not called upon to decide whether this limitation applies to cases in which the ignorance or mistake of law defense is allowed because a criminal statute imposes an affirmative legal duty on defendant. See Lambert v. California, 355 U.S. 225, 2 L. Ed. 2d 228, 78 S. Ct. 240 (1957) (ignorance of law claim permitted to defend against prosecution under statute imposing affirmative duty upon felons to register); see also United States v. Golitschek, 808 F.2d 195 (2d Cir. 1986); United States v. Burton, 737 F.2d 439 (5th Cir. 1984). We note, however, that the pragmatic considerations discussed earlier make such a qualification essential were we to adopt appellants' position that they should be allowed to demonstrate their construction of the immigration laws. We note further that appellants' contention that they understood the Refugee Act of 1980 to permit them surreptitiously to smuggle, transport, and harbor aliens while studiously avoiding presentment to the INS is entirely unreasonable. We conclude as an alternative holding, therefore, that the district court did not err in granting the government's in limine motion because appellants' mistake of law defense was objectively unreasonable.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Section 2.04 of the Model Penal Code (\"Code\") proposes a very general statute that would allow a defense for \"ignorance or mistake as to a matter of fact or law.\" Accord W. LaFave \u0026 A. Scott, Substantive Criminal Law § 5.1, at 577 (1986). The comment to the Code counsels against distinguishing between mistake of law and mistake of fact. Model Penal Code § 2.04 comment 1, at 270 n. 2 (1985). Many states, nevertheless, permit only a mistake of fact defense. See id. at 280. The Code itself recognizes that it is putting forth a \"general principle\" concerning the defense of ignorance or mistake of law. Model Penal Code § 2.04 explanatory note. The problem with a proposal that sweeps so broadly, such as section 2.04, is that it may fail to anticipate all possible circumstances or, as in this case, all possible defenses. Nothing in the Code, including the statutory text, the explanatory note, and the comment, indicates that it anticipated the defense appellants present in this case. Appellants intended to assert a unique defense -- that based on their study of the immigration laws, they misapprehended the laws' reach. This sort of defense raises novel concerns not addressed by the Code. The Code recognizes that the touchstone consideration for allowing both a mistake of law and mistake of fact defense is that both eliminate culpability equally. For that reason the Code concludes that any distinction is unwarranted. However, in the unique circumstances of this case, the basis for this conclusion is undermined. Appellants were well aware of the laws regulating their conduct. Indeed, they were provided with a clear articulation of the potential legal consequences of their underground movement, if prosecuted. In \"Sanctuary: A Justice of Ministry,\" the Chicago Religious Task Force on Central America clearly and emphatically warned that \"those who provide help to Salvadoran and Guatemalan refugees are subject to prosecution under the Immigration and Nationality Act.\" (emphasis in original). This informational manual even detailed the precise charges on which violators would be prosecuted and the possible term of imprisonment that each carried. Despite this knowledge and warning of possible legal ramifications, appellants decided to form a sanctuary movement that smuggled, transported, and harbored numerous illegal aliens. Their conduct in the face of their knowledge is itself blameworthy. See Note, Ignorance of the Law as an Excuse, 86 Colum.L.Rev. 1392, 1413 (1986). Moreover, as previously indicated, strong policy concerns require us to resist appellants' attempt to make a mockery out of the trial proceedings by conducting a series of mini-trials. Appellants' proffered defense is more analogous to one that attempts to negate the mental element of a crime through reliance on advice of private counsel. In both instances defendant resorts to a studied interpretation of the law as the basis for action. The Code cautions against permitting this type of defense. See Model Penal Code § 2.04 comment 3, at 280; see also W. Lafave \u0026 A. Scott, supra, at 595 (noting that case law uniformly rejects such a defense and that the Code is in accord).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. It is important to emphasize that appellant in Merkt I was not raising a mistake of law defense based on a factual misperception. Merkt I, 764 F.2d at 273 (recognizing that \"a mistake of fact may constitute a valid defense\"). She did not, for instance, \"assert[] reasonable grounds to believe that the workers were not aliens or that they had been legally admitted to the United States.\" Fierros, 692 F.2d at 1294. Instead, like appellants in this case, she attempted to present a defense that relied on her interpretation of the immigration laws.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. In their discussion about the illegal transportation convictions, appellants reassert their contention that the district court erred in excluding evidence of their alleged good-faith belief in the aliens' lawful status as political refugees. This evidence, they claim, would have negated the \"in furtherance of\" element of section 1324(a)(2). This contention is meritless in light of our conclusion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Appellants mischaracterize the jury instructions, describing them as having \"made the manner of an alien's entry the only factual component of the entitlement issue, limiting aliens legally entitled to enter or reside to those 'duly admitted.' They argue that the instructions improperly state that a person who entered the United States illegally because he was not \"duly admitted\" can never be regarded as lawfully entitled to reside here. The instructions, however, do not state the law in this manner. Quite the contrary, the instructions explicitly provide for the possibility of legal status following an \"unlawful entry\" where the alien has been \"processed and released\" by an INS official. But the instructions properly emphasize an alien's obligation to present himself to the INS and file an application for asylum subsequent to an illegal entry in order to be law f ully entitled to reside herb Consequently, appellants are mistaken in arguing that the instructions made being duly admitted a prerequisite to the alien's ability to reside lawfully here after an illegal entry without due admittance. The 1980 Refugee Act, 8 U.S.C. § 1158(a), expressly permits an alien to apply for asylum as a political refugee either if already \"physically present in the United States or at a land border or port of entry.\" The court correctly instructed the jury that while such an application is pending, an alien is lawfully entitled to remain in the United States irrespective of his initial illegal entry.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Although the indictment in Rodriguez proceeded under the new amended section 1324, both versions require proof that the alien was present in the United States in violation of law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. This Act provides that an illegal alien may file an application to have his status adjusted to that of a legal resident if he entered the United States illegally before January 1, 1982, and has resided continuously in the United States in an unlawful status since that date. 8 U.S.C. § 1255(a)(2)(A). Appellants do not contend that this section renders the aliens they transported and harbored legal residents.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. \"In the alternative, the Rodriguez court stated that \"[even] if mere eligibility for adjustment of status did mean the aliens remained in the United States lawfully, defendants still would have violated 8 U.S.C. 1324 . . . because the aliens had \"entered . . . the United States in violation of law.'\" 840 F.2d at 700. This statement implies that a person violates section 1324 by transporting or harboring an alien lawfully entitled to reside in the United States simply because the alien originally had entered the United States in violation of law. Applied to this case, that would mean that appellants could be guilty of harboring and transporting aliens even if the aliens had applied for political asylum, simply because the aliens had originally effected an illegal entry. The district court specifically rejected this reasoning, and instructed the jury that, to the contrary, appellants should be acquitted of all charges of harboring and transporting if the aliens had pending applications for political asylum, because this renders the aliens lawfully entitled to reside in the United States irrespective of their manner of initial entry. To the extent that the Rodriguez decision implies that section 1324 is violated where a person harbors or transports an alien who has a pending application for political asylum, the district court's instruction to the contrary did not prejudice appellants. Accordingly, we need not confront the wisdom of the Rodriguez court's dicta.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. \"A request for asylum made in exclusion or deportation proceedings shall be made on Form 1-589.\" 8 C.F.R. § 208.10(a).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The government does not dispute appellants' description of the freedom from official restraint doctrine as it applies to the deportation context. Aguilar cites a Board of Immigration Appeals statement that \"there is no entry when the alien is under official restraint [taking] the form of surveillance, unbeknownst to the alien. . . .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. \"The normal rule of statutory construction assumes that 'identical words used in different parts of the same act are intended to have the same meaning.'\" Sorenson v. Secretary of Treasury, 475 U.S. 851, 860, 89 L. Ed. 2d 855, 106 S. Ct. 1600 (1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. In Harding, the court rejected defendant's argument that his convictions for bringing in and transporting under section 1324 were not supported by the evidence. Defendant was discovered at the port of entry to have five illegal aliens in the trunk of his car. The court stated that \"the only question is whether he then knew they were concealed in his car.\" Id. at 1219. While Harding may have been an opportune case for defendant to argue that his convictions were invalid due to the failure of the aliens to effect an entry free from official restraint, no such argument was made. In Martin-Plascencia, the court never questioned the fundamental validity of the Oscar decision. Rather, the court found the facts of the case before it to be \"manifestly distinguishable\" because the alien had \"surreptitiously by-passed the questioning and inspection areas and, out of the view of the immigration officials, crawled through an opening in a six foot chain link fence.\" 532 F.2d at 1317. The court found that the alien was free from official restraint at the time of his entry, exercising his free will, youthful enterprise, and physical agility in evading fixed physical barriers.\" Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. \"It is ironic that Aguilar contends the authorities' decision not to interfere with her smudging placed her under official restraint.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Aguilar argues to the contrary, citing Vitale v. INS, 463 F.2d 579 (7th Cir. 1972), for the proposition that where an alien's original crossing was under official restraint, \"subsequent escape from authorities is insufficient as a matter of law to effectuate entry.\" In Vitale, defendant was apprehended upon his attempted illegal entry at the airport, but then released on parole pending a full inspection the following day. The court found that the alien's one week delay in appearing for the full inspection did not constitute a subsequent entry because his parole status placed him in constructive custody the entire time. Vitale does not establish that an alien cannot become free from official restraint subsequent to physical entry under such restraint; only that an alien in constructive custody has not entered the country.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Aguilar also argues that the district court erred by not granting her motion for judgment of acquittal on count 2. In judging a Rule 29(c) motion for acquittal, a reviewing court must take the evidence in the light most favorable to the government. United States v. Sharif, 817 F.2d 1375, 377 (9th Cir. 1967). Cruz testified that he visited Benavidez's home a \"few times' during the seven months she lived with her parents. In accord with the discussion in subsection B, supra, Aguilar has failed to establish as a matter of law that she was under official restraint for this seven month period.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Aguilar also argues in conclusion that the district court improperly restricted her attorney's cross-examination of Benavidez. Aguilar sought to elicit testimony that Benavidez was in need of protection and that Aguilar was her protector. This testimony would only be relevant if a necessity-type defense was appropriate. As we reject a necessity defense, infra, the trial court did not err in this regard.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. The Freeman court affirmed defendant's two aiding and abetting convictions which charged that he counseled and assisted in the filing of false tax returns. Defendant had prepared a draft false tax return for a taxpayer and reviewed the taxpayer's returns. The court found that the first amendment jury instruction was not necessary for these counts. \"Even if the conviction on these counts rested on spoken words alone, the false filing was so proximately tied to the speech that no First Amendment defense was established.\" Id. at 552. Where defendant's actions move far beyond advocacy to participation in the unlawful activity, the first amendment is no bar to prosecution. See United States v. Moran, 759 F.2d 777, 785 (9th Cir. 1985), cert. denied, 474 U.S. 1102, 88 L. Ed. 2d 920, 106 S. Ct. 885 (1986) (challenging sufficiency of the evidence on first amendment grounds); United States v. Little, 753 F.2d 1420, 1434 (9th Cir. 1984) (seeking acquittal on first amendment grounds).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. In their attack on the conspiracy counts, appellants provide another example of arguably protected conduct that warranted a clear-and-present danger instruction: \"Sister Darlene Nicgorski's conversations with refugees, in which she offered assistance in finding lawyers and explained the process of applying for political asylum, and stated that 'based upon her experiences the Immigration Office in Arizona was not following the law'. . . .\" However, as the government indicates, this example omits the fact that Nicgorski's discussion with Nieto was not intended to direct him to a lawyer for the purpose of being presented to INS officials. Consequently, this activity is not \"remote\" from the commission of the crime of conspiracy, and appellants were not entitled to a first amendment instruction.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Appellants also contend that their religious motivation is a complete defense to the in furtherance element. This is nothing more that another attempt to obtain a first amendment exemption for their criminality. We reject such an exception, infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Parts VI and XI of the opinion hold that appellants were not entitled to a first amendment defense. Consequently, it was not error to exclude evidence of appellants' religious beliefs.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Appellants overlook the fact that a panel not sitting en banc has no authority to overturn Ninth Circuit precedent.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. In any event, the district court emphasized that the government had to prove that appellants conspired to commit one of the offenses under section 1324(a) or section 1325, and the jury had to \"unanimously agree.\" The court later repeated this unanimity requirement.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. The wisdom of this procedural bar is highlighted in the context of this last claim. Appellants are speculating that the jury may have used section 1324(a)(4) as the object of the conspiracy conviction. They then allege error associated with that subsection, which they contend requires reversal of the entire conspiracy conviction because this court cannot discern the basis of the conviction. However, since the jury acquitted all accused of violating this subsection, it is unlikely that it used this subsection as the object of the conspiracy conviction. In any event, appellants could have avoided this speculation by requesting a special verdict.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. We also doubt the sufficiency of the proffer to establish imminent harm. The offer fails to specify that the particular aliens assisted were in danger of imminent harm. Instead, it refers to general atrocities committed by Salvadoran, Guatemalan, and Mexican authorities. The only indication that appellants intended to show that the aliens involved in this action faced imminent harm was their proffer that they adopted a process to screen aliens in order to assure themselves that those helped actually were in danger. Id. at 778. This allegation fails for lack of specificity. See Armour And Co. v. Nard, 463 F.2d 8, 12 (8th Cir. 1972) (\"offer of proof must be specific\"); see also Hennings v. Grafton, 523 F.2d 861, 864 (7th Cir. 1975) (affirming district court's exclusion of evidence based on nonspecific and conclusory proffer). Moreover, even a specific proffer would establish only appellants' deliberative assessment that certain aliens faced imminent harm, and not that these aliens in fact were in danger. In other contexts, perhaps this proffer would be sufficient. In the immigration area, however, allowing this showing to establish a necessity defense essentially would result in sanctioning the creation of religious boards of review to determine asylum status. The executive branch, not appellants, is assigned this task.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Appellants contend that \"while legal challenges to the activities of the INS, including appeals from denials of political asylum applications, are \"options\" for Central Americans who are in the United States, they are not options for those still in Mexico.\" However, section 1158 provides that \"the Attorney General shall establish a procedure for an alien physically present in the United States or at a land border or port of entry. . . .\" 8 U.S.C. § 1158. Appellants' attempt to circumvent this barrier is deceptive. They argue that Orantes-Hernandez v. Meese, 685 F.2d 1488 (C.D.Cal. 1988), the only federal case directly on point, expressly found otherwise. Reply Brief of Appellants 81 n. 48 (providing only a supra cite to that case). That citation only supports the notion that the INS was failing to comply with section 1158, and not that appellants legally could not present aliens at the border for asylum consideration.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. The government argues that appellants should have to proffer that they presented the aliens to government officials immediately after their entry into the United States before a trial court can instruct the jury as to the necessity defense. Cf. United States v. Bailey, 444 U.S. 394, 415, 62 L. Ed. 2d 575, 100 S. Ct. 624 (1980). Because we find the district court properly precluded appellants' necessity defense, we need not reach the question whether a presentment proffer should be a precondition for the defense of necessity.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. Defendants argued that past unsuccessful border control demonstrates a lack of a compelling interest to prosecute violators. This argument was \"emphatically reject[ed].\" As the court persuasively reasoned, this contention would deny a compelling state interest in enforcing criminal drug laws. Merkt II, 794 F.2d at 956.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. Appellants' request is unrealistic. If we were to grant an exemption to these defendants, surely many other religious groups would have a similar entitlement. Courts cannot realistically determine that some religious groups are worthy of an exemption while others are not. In fact, this sort of distinguishing among groups might violate the equal protection clause. As appellants argue in their brief, \"to allow expression of religious views by some and deny the same privilege to others . . . is a denial of equal protection of the law forbidden by the Fourteenth Amendment.\" Brief of Appellant 300 (quoting Niemotko v. Maryland, 340 U.S. 268, 284, 95 L. Ed. 267, 71 S. Ct. 325 (1951) (Frankfurter, J., concurring)). And since many religions undoubtedly require their adherents to be charitable and to help the needy and the persecuted, the bounds of this exemption ultimately would be without definition. See United States v. Elder, 601 F. Supp. 1574, 1579 (S.D.Tex. 1985) (\"moral obligation to assist others crosses religious and denominational lines\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Appellants, no doubt, would like the analysis to be even more focused. They would urge this panel to view only these particular appellants without reference to their religious groups. This is unreasonable. Courts cannot possibly grant an exemption to certain members of a group while denying it to others of that same group. The only basis for distinction would be the sincerity of the member's belief, a standard which is ill-suited for adjudication. See United States v. Ballard, 322 U.S. 78, 87, 88 L. Ed. 1148, 64 S. Ct. 882 (1944) (counseling against entering the \"forbidden domain\" of testing the sincerity of religious beliefs).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. Nonetheless, appellants contend that the harboring convictions must be set aside. The government allows an employment exemption to the crime of harboring. Appellants conclude from this that it would be invidious discrimination to disallow a religious exemption. This argument is meritless. Both Niemotko v. Maryland, 340 U.S. 268, 95 L. Ed. 267, 71 S. Ct. 325 (1951), and Police Dep't of Chicago v. Mosley, 408 U.S. 92, 33 L. Ed. 2d 212, 92 S. Ct. 2286 (1972), the cases cited by the appellants, are concerned about state discrimination among various groups that are trying to engage in protected activity. The state cannot constitutionally squelch unpopular points of view. See Niemotko, 340 U.S. at 284. These two cases, therefore, would support their claim if for example, the government allowed a religious exemption for Jews but not for Catholics. Since employment is not expressive activity, appellants' argument is specious. According to appellants' argument, lawmakers would be severely restricted in tailoring criminal laws in fear that a limited legislative exemption ultimately may become a judicially crafted gaping hole.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. The only less restrictive alternative offered by appellants is that the government can provide a limited exemption. Since an exemption is infeasible, this proffered alternative fails.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. Appellants do not contend that the first amendment required the government to have had reasonable suspicion of criminal activity before placing undercover agents inside the sanctuary movement. See Comment, The Justiciability and Constitutionality of Political Intelligence Gathering, 30 UCLA L. Rev. 976, 1018 (1983) (advocating a reasonable suspicion prerequisite). Accordingly, we do not reach this issue. Appellants' failure to urge a reasonable suspicion standard is hardly surprising. Their argument for suppression depends solely upon the absence of a warrant; they say not one word about the government's probable cause to obtain a warrant. As a reasonable suspicion search does not require a warrant or judicial supervision, a reasonable suspicion standard would not accrue to appellants' benefit. See Terry v. Ohio, 392 U.S. 1, 20, 20 L. Ed. 2d 889, 88 S. Ct. 1868 (1968).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. The cases relied upon by appellants, particularly N.A.A.C.P. v. Alabama, are of marginal assistance because \"each deals with a form of governmentally compelled disclosure of information\" that is not involved where the government gleans information through noncompulsory means. United States v. Gering, 716 F.2d 615, 619 n. 2 (9th Cir. 1983); see also Reporters Committee v. American Telephone \u0026 Telegraph, 192 U.S App. D.C. 376, 593 F.2d 1030, 1055 n. 82 (D.C.Cir. 1978), cert. denied, 440 U.S. 949, 99 S. Ct. 639, 59 L. Ed. 2d 639 (1979). In contrast, the invited informer doctrine is founded on the principle that the organization's disclosure of otherwise confidential information essentially is consensual. In addition, N.A.A.C.P. v. Alabama did not address the interplay between the fourth and first amendments. It certainly did not hold that the organization's first amendment privacy interests were greater than those under the fourth amendment. Finally, in one of N.A.A.C.P. v. Alabama's progeny, the Gibson case, the Court simply held that there must be a substantial relat i onship between the government's investigation and a compelling state interest. The state in Gibson conceded that the propriety of its investigation \"hinge[ed] entirely on the question of whether the evidence before the Committee [was] . . . sufficient to show probable cause or nexus between the [NAACP] and Communist activities.\" Gibson, 372 U.S. at 546. In this case, appellants do not challenge the government's probable cause to investigate the sanctuary movement, and they concede that \"as a general rule, the government has a strong interest in enforcing the immigration laws.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. Roaden, however, does not support the proposition that the first amendment always justifies procedural protections greater than those offered by the fourth amendment. For instance, Roaden does not mean that the first amendment mandates a higher standard of probable cause for the issuance of a warrant to seize books or films. See New York v. P.J. Video, Inc., 475 U.S. 868, 875, 89 L. Ed. 2d 871, 106 S. Ct. 1610 n. 6 (1986). Instead, \"an application for a warrant authorizing the seizure of materials presumptively protected by the First Amendment should be evaluated under the same standard of probable cause used to review warrant applications generally.\" Id. at 875.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. A recent opinion of this court addresses Zurcher in the context of a related civil case. In The Presbyterian Church (U.S.A.), et al. v. United States of America, 870 F.2d 518 (9th Cir. 1989), the churches that INS agents infiltrated during the course of this criminal investigation brought a civil lawsuit. They claimed that the government violated the first and fourth amendments by attending and surreptitiously tape recording various church services without a search warrant. The court held that these churches had alleged sufficient injury in fact to give them standing to proceed with their claims. Id. at 524-35. While the court did not reach the merits of the churches' claims, it did discuss the government's contention that the individual government agents were entitled to qualified immunity because they did not violate clearly established constitutional rights. The court agreed with the government that the agents were entitled to qualified immunity, finding that the Zurcher decision \"cannot be said to clearly settle the Fourth Amendment issue in this case.\" Id. at 22.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. Arguably, the Macon decision is dispositive of appellants' claim, because no fourth amendment search or seizure occurred when the undercover informers observed sanctuary activities. We do not rest on Macon, however, because to do so would require a holding broader than strictly necessary on the facts of this case. Specifically, we can and do reject appellants' suppression argument without deciding that the first amendment is wholly irrelevant to the government's penetration of an organization engaging in protected first amendment activities by undercover informers posing as adherents.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. See United States v. Choate, 576 F.2d 165, 175 (9th Cir.), cert. denied, 439 U.S. 953, 58 L. Ed. 2d 344, 99 S. Ct. 350 (1978), aff'd after remand, 619 F.2d 21 (9th Cir.), cert. denied, 449 U.S. 951, 101 S. Ct. 354, 66 L. Ed. 2d 214 (1980). Indeed, the Choate court also rejected the defendant's claim that the mail cover investigation impermissibly chilled his first amendment rights. 576 F.2d at 180-81.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. Where constitutional interests other than privacy are at stake, however, other amendments to the Constitution may very well provide protections which the fourth amendment does not. This explains why appellants' citation to Massiah v. United States, 377 U.S. 201, 12 L. Ed. 2d 246, 84 S. Ct. 1199 (1964), does not advance their argument. In Massiah, a government informer placed a radio transmitter in his car during conversations with defendant subsequent to defendant's arraignment on drug charges. The Court held that admission at trial of incriminating statements obtained in this manner violated defendant's sixth amendment right to the assistance of counsel. Id. at 205. Assuming that such an investigative technique is permissible under the fourth amendment, the sixth amendment's insistence that a defendant be afforded his counsel's assistance at all critical periods provided a rationale for reversal completely apart from privacy concerns.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. The SWP ultimately prevailed at trial on its claim that the government was liable under the Federal Tort Claims Act for invading the organization's privacy by the use of undercover informers. See Socialist Workers Party v. Attorney General of U.S., 642 F. Supp. 1357, 1422-23 (S.D.N.Y. 1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. The defense of selective prosecution is waived unless properly raised before trial. United States v. Oaks, 508 F.2d 1403, 1404 (9th Cir. 1974); United States v. Taylor, 562 F.2d 1345, 1356 (2d Cir. 1977), cert. denied, 432 U.S. 909, 53 L. Ed. 2d 1083, 97 S. Ct. 2958 (1977). Nonetheless, we do not address the applicability of these cases because of the government's failure to pursue this issue on\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. See, e.g., Lee. In the Lee decision, the court rejected defendant's claim that the Air Force's differing treatment of civilian and military traffic law offenders constituted selective prosecution. The Air Force referred civilians to the U.S. Attorney for prosecution in federal court, while it retained jurisdiction over military personnel for prosecution in military courts. The court found that military personnel and civilians were not similarly situated because of the military's distinct needs and policies, and it therefore rejected defendant's selective prosecution claim. 786 F.2d at 957-58.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. The district judge below apparently employed this reasoning in rejecting appellants' selective prosecution claim: \"I suppose at some time, arguably, a case comes along that is sui generis, it simply doesn't have any counterpart.\" As indicated infra, we find that organized smuggling rings provide the appropriate control group; thus, we do not depend on the ultimate analysis employed in Irish People. Instead, Irish People is relevant to show the significance of locating a control group.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. In the case of United States v. Steele, 461 F.2d 1148 (9th Cir. 1972), the court found that defendant successfully had identified similarly situated persons. Defendant identified six other persons who also \"completely refused on principle to complete census forms,\" but who were not the subjects of prosecution. Id. at 1151. Unlike defendant, however, these six other persons were not vocal advocates of public noncompliance with the census laws, giving rise to an inference that defendant was prosecuted because of his vocal opposition.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. Even were the court to adopt appellants' suggested definition of similarly situated, nothing before the court allows us to say that agricultural growers and farmers fall within it. Certainly employers using illegal alien labor profit economically.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. Appellants desire to take discovery of all those persons who attended a Washington meeting on whether to go forward with an indictment. The district court received documents pertaining to the indictment decision under seal. These documents (still under seal) reveal that the government investigated alternatives to prosecution, but these options were rejected because they were judged inadequate to stop appellants' smuggling activities. There is not the slightest indication in these documents that this prosecution was brought other than reluctantly and with a view to treating all law breakers equally.\u003c/span\u003e\n\n",
    "body_length": 184358,
    "citedas": [
      "883 F.2d 662"
    ],
    "attorneys": "Karen L. Snell, Riordan \u0026 Rosenthal, San Francisco, California; Michael Tigar, University of Texas School of Law, Austin, Texas, for the defendants-appellants. Donald M. Reno, Jr., Special Assistant United States Attorney, Seattle, Washington, for the plaintiff-appellee.",
    "category": [],
    "judges": "Cynthia Holcomb Hall, Charles Wiggins and David R. Thompson, Circuit Judges.",
    "citation_count": 167
  }
}
