{
  "id": "-M2DYWYBTlTomsSBNdcH",
  "document": {
    "title": "Washington v. Hoffman",
    "full_title": "THE STATE OF WASHINGTON v. PATRICK GENE HOFFMAN, ET AL",
    "jurisdiction": "Washington Supreme Court",
    "date": "1991-01-10T00:00:00.000Z",
    "docket": "No. 55948-1",
    "body": "Facts of Case\n\nPatrick Gene Hoffman and his father, Elmer Edward McGinnis seek reversals of their convictions for aggravated murder in the first degree and assault in the first degree. The convictions were based on charges filed after the August 27, 1986, shooting death of tribal police officer Louis Millard and wounding of tribal police officer John Dick.\n\nIn appealing to the Court of Appeals, defendants raised multiple issues including a challenge to the jurisdiction of the State of Washington to bring this prosecution. The shootings occurred near Nespelem, Washington, within the boundaries of the Colville Indian Reservation. Defendants Hoffman and McGinnis were both members of the Colville Confederated Tribe as was John Dick, one of the tribal officers shot. Louis Millard, the tribal police officer who was shot and killed, was of Colville Indian descent but was not an enrolled member of the tribe.\n\nThe Court of Appeals certified the case to this court because of the jurisdictional issue. We accepted review of the case in its entirety. Having now carefully reviewed the voluminous (almost 6,000-page) record and extensive appellate briefs, we conclude that the trial court did have jurisdiction and that the defendants were fairly tried, convicted and sentenced under the law. Accordingly, we affirm the convictions of both defendants.\n\nThe facts which the jury was reasonably entitled to believe from the evidence admitted at the trial of this case are set out in some detail in connection with our subsequent discussion of the challenges to the sufficiency of the evidence. Such facts in broader outline, however, are as follows.\n\nOn August 25, 1986, 2 days before the shooting, several tribal police officers arrested McGinnis at the Tribal Council headquarters pursuant to an outstanding arrest warrant which had been issued by the chief judge of the Tribal Court. The arrest warrant was issued on a trespass-lands charge. It was issued after a Mr. Ferguson had complained to the prosecutor that McGinnis had trespassed on his land several times and had threatened and intimidated Mr. Ferguson, his wife, and his daughter. The Tribal Court had originally mailed a criminal summons to McGinnis on the trespass charge but it was returned unopened with his refusal marked thereon. The warrant for his arrest then issued from the Tribal Court based upon the trespass-lands criminal charge and on the judge's determination that McGinnis was an immediate threat to the community.\n\nMcGinnis physically resisted the arrest and assaulted tribal police officers and the ambulance attendants who were called after McGinnis complained of chest pains. McGinnis was taken to the Tribal Health Clinic and the Coulee Community Health Facility and finally to the Okanogan County Jail where he was booked on the Tribal Court trespass-lands warrant and placed on a tribal police hold for resisting arrest and assaulting the tribal police officers and ambulance crew. McGinnis continued to complain of pain and, therefore, was ultimately taken to the Mid-Valley Hospital.\n\nThe tribal police decided not to post a guard, apparently because of a personnel shortage and because McGinnis was attached to a heart monitor which would sound an alarm if disconnected. The hospital's alarm to the sheriff's office was tested by the officers and the hospital staff was instructed to notify the police when McGinnis was to be medically discharged. The tribal prosecutor informed McGinnis' attorney and his daughters that McGinnis was still under arrest and gave McGinnis' children permission to visit their father in the hospital.\n\nMcGinnis was unexpectedly discharged on August 26, the evening before the shooting. When one of the nurses realized that he was on a tribal police hold, she attempted to detain him and told him to wait or the police would come after him. However, McGinnis, in the company of his son (the defendant Patrick Gene Hoffman) and his four daughters, drove away from the hospital.\n\nThe automobile driven by Hoffman, in which McGinnis and the four daughters were passengers, was observed by a tribal police officer who gave chase in a police vehicle. The officer testified that although he accelerated to 75 or 80 m.p.h., he was unable to overtake the vehicle he was pursuing. He testified that his emergency red and blue rotating lights were on and that he came within 100 yards of the vehicle Hoffman was driving but that it eluded him. Hoffman later admitted to knowing that a police car was following him and that he accelerated to get away from it.\n\nAfter eluding the police, McGinnis and Hoffman set out to walk the 6 to 8 miles through the mountainous terrain to McGinnis' home. McGinnis stated he did not want his daughters to be in the line of fire, and that he would rather die than go back to jail. Hoffman removed a gym bag from the trunk of the car which contained a loaded .45 caliber semiautomatic pistol with 40 rounds of ammunition, a holster and holster belt for the .45 pistol, a loaded .22 caliber revolver, an Interdynamics KG 99 9 mm. semiautomatic pistol with two magazines of ammunition, at least one and possibly two Olin flare guns with flare rounds, a knife, a can of mace and a set of nunchucka sticks. Hoffman testified that it was his habit to carry these weapons at all times.\n\nUpon arriving at the McGinnis' residence, McGinnis and Hoffman hid behind a chicken coop and armed themselves with the guns from Hoffman's gym bag. The police had earlier placed an officer on surveillance of the McGinnis property. An officer also testified that the police believed McGinnis kept a large arsenal of weapons in his house and that they were concerned that McGinnis might return home, acquire weapons and harm Mr. Ferguson and his\n\nfamily, the complainants on the trespass charge, or the officers who had arrested him at tribal headquarters. At approximately 1:30 a.m. on August 27, shortly before the shooting, the officer watching the property observed two individuals whom he could not identify. Pursuant to his orders, the officer on surveillance radioed the police dispatcher for assistance. Five marked police cars and a rescue truck arrived at the scene within a short time. The officers used their patrol car headlights and spotlights and the searchlights on the rescue truck to illuminate and search the property. The floodlights panned the property for approximately 15 minutes before being extinguished.\n\nThe officers searched two abandoned buildings and other areas surrounding the property while the police vehicle lights remained on. Officers Dick and Millard crossed a fence surrounding the McGinnis property and approached the chicken coop. By this time the lights had been extinguished so as not to back light the officers, but Officers Millard and Dick each carried large mag police flashlights. Officer Dick testified that both officers were talking and joking as they climbed the fence. He also testified that their service revolvers were holstered as they climbed the fence and approached the chicken coop. Officer Dick testified that he shined his light behind the coop, turned to walk away and was shot in the back. Gunfire continued after Officer Dick fell wounded. Both Officers Dick and Millard returned the fire. The other officers at the scene testified that they did not fire their weapons. Officer Dick heard Officer Millard moaning and realized he had been shot. As Officer Dick crawled over and attempted to drag Officer Millard to cover, illuminating flares coordinated with gunfire continued to come from behind the chicken coop.\n\nAn autopsy confirmed that Officer Millard had been struck by a 9 mm. bullet in the upper chest; death ensued within about 15 minutes. The bullet which struck Officer Dick passed through his body and was never definitely identified. At trial Hoffman admitted to firing the .22 caliber revolver, the .45 pistol and a flare gun from his position\n\nbehind the chicken coop. Two ejected 9 mm. cartridges were found behind the chicken coop near the .22 revolver and a flare gun.\n\nMcGinnis was discovered by police early the next morning near the scene of the shooting. He had been shot with a bullet which was later identified as consistent with Officer Dick's police revolver and ammunition. Hoffman escaped, to appear 2 days later at the home of one Jeff Epperson in Keller, Washington. Hoffman told Epperson that McGinnis had fired the 9 mm. gun. Epperson testified at trial that when told that an officer had been killed, Hoffman replied \"good deal\".\n\nBoth defendants were originally charged by federal authorities with violations of 18 U.S.C. § 1111 (first degree murder) and 18 U.S.C. § 1114 (attempted murder of a federal officer). Those charges were later dismissed without prejudice and defendants were charged in the Superior Court of the State of Washington for Okanogan County with the crimes of aggravated murder in the first degree and assault in the first degree. Defense motions for dismissal for lack of jurisdiction, change of venue, severance, the appointment of an expert witness on police procedures and for the psychiatric examination of Officer Dick were denied by the trial court.\n\nFollowing a jury trial, both defendants were found guilty of aggravated murder in the first degree for the killing of a police officer and assault in the first degree, as charged. As provided by the law of this state in such cases, defendants were sentenced to life imprisonment without the possibility of parole.\n\nThe defendant Hoffman has appealed setting forth 14 assignments of error. The defendant McGinnis has also appealed arguing 19 assignments of error, most of which are similar to or substantially identical with the defendant Hoffman's arguments. We have identified the following 20 separate issues relevant to the defendants' arguments.\n\nIssues\n\nIssue One. Did the State of Washington have jurisdiction to prosecute the defendants for crimes alleged to have been committed on the Colville Indian Reservation?\n\nIssue Two. Did the trial court abuse its discretion in denying defendants' motions for a change of venue?\n\nIssue Three. Did the trial court err in denying the defendants' motions for separate trials?\n\nIssue Four. Were defendants' rights to a speedy trial violated?\n\nIssue Five. Did the dismissal of the federal charges and the initiation of state criminal proceedings violate the defendants' equal protection rights?\n\nIssue Six. Have the defendants shown they were prejudiced by the failure of the prosecution to disclose evidence?\n\nIssue Seven. Was sufficient evidence presented from which the jury could find premeditation and intent to kill, as it did?\n\nIssue Eight. Was sufficient evidence presented from which the jury could infer, as it did, the presence of a statutory aggravating circumstance in order to enhance murder in the first degree to aggravated murder in the first degree?\n\nIssue Nine. Did the trial court err in admitting photographs of Officer Millard taken at the scene of the shooting after his death?\n\nIssue Ten. Did the trial court abuse its discretion in denying defendants' motions to appoint a psychiatrist to examine Officer Dick?\n\nIssue Eleven. Did the trial court err in refusing to appoint a defense expert witness on police procedures and techniques?\n\nIssue Twelve. Did the trial court err in admitting testimony regarding guns owned by the defendant McGinnis?\n\nIssue Thirteen. Did prosecutorial misconduct prejudice defendants' rights to a fair trial?\n\nIssue Fourteen. Did the trial court's instruction to the jury that Officer Millard was a law enforcement officer constitute reversible error?\n\nIssue Fifteen. Did the trial court invade the fact-finding province of the jury by instructing it that the earlier August 25, 1986, arrest of the defendant McGinnis was a lawful arrest and that the later August 27, 1986, police officers' entry onto the defendant McGinnis' property was lawful?\n\nIssue Sixteen. Were the trial court's conclusions regarding the legality of the defendant McGinnis' arrest and the officers' entry onto his property correct?\n\nIssue Seventeen. Were the trial court's accomplice liability instructions to the jury erroneous?\n\nIssue Eighteen. Did the jury instruction regarding aggravating circumstances allow conviction for murder based solely upon statutory aggravating factors or violate the defendants' rights by creating a mandatory presumption?\n\nIssue Nineteen. Did the jury instructions regarding self-defense and defense of others correctly state the law and allow defendants to argue their theory of the case?\n\nIssue Twenty. Did the trial court err in not giving lesser included offense jury instructions despite both defendants' objections to the giving of such instructions?\n\nDecision\n\nIssue One.\n\nConclusion. The State of Washington lawfully assumed criminal jurisdiction over the Colville Indian Reservation in 1965 based upon the authority of Laws of 1957, chapter 240, as amended by Laws of 1963, chapter 36, codified in RCW 37.12. Subsequent retrocession did not affect this case which was filed before the effective date of retrocession.\n\nThe jurisdictional question is dependent upon an analysis of our state statutes, RCW 37.12, construed in conjunction with federal law. RCW 37.12.010 was enacted pursuant to congressional authority contained in Pub. L. No. 83-280, § 6, 67 Stat. 588 (1953) (hereafter Public Law 280).\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e The\n\nUnited States Supreme Court has held that RCW 37.12.010 complies with Public Law 280 and is constitutional.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nPublic Law 280 was enacted by Congress in 1953 and gave to five enumerated states an immediate cession of criminal and civil jurisdiction over Indian country.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e To the remaining states (including Washington) it gave an option to assume jurisdiction over criminal and civil causes of action in Indian country. Washington is one of the states governed by Public Law 280, section 6 which provides in part that \"the consent of the United States is hereby given to the people of any State to amend, where necessary, their State constitution or existing statutes, as the case may be, to remove any legal impediment to the assumption of civil and criminal jurisdiction in accordance with the provisions of this Act\" over Indians in Indian country within the state.\n\nRCW 37.12.010, as enacted in 1963, binds the State to assume civil and criminal jurisdiction over Indians and Indian territory at the request of the affected tribe, as provided for in RCW 37.12.021 which states in pertinent part:\n\nWhenever the governor of this state shall receive from the majority of any tribe or the tribal council or other governing body, duly recognized by the Bureau of Indian Affairs, of any Indian tribe, . . . a resolution expressing its desire that its people and lands be subject to the criminal or civil jurisdiction of the state of Washington to the full extent authorized by federal law, he shall issue within sixty days a proclamation to the effect that such jurisdiction shall apply to all Indians and all Indian territory, . . . involved to the same extent that this state exercises civil and criminal jurisdiction or both elsewhere within the state: . . .\n\n[1] In 1965, the Colville Business Council issued a resolution requesting the Governor to issue a proclamation\n\nassuming state civil and criminal jurisdiction over the Colville tribe and reservation.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Pursuant to RCW 37.12.021, then Governor Daniel J. Evans issued a proclamation assuming, on behalf of the State, the requested jurisdiction effective January 29, 1965.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e In Tonasket v. State, 84 Wash. 2d 164, 525 P.2d 744 (1974), appeal dismissed, 420 U.S. 915, 43 L. Ed. 2d 387, 95 S. Ct. 1108 (1975), this court held that the State had validly assumed jurisdiction over the Colville tribe and the reservation. We conclude that the trial court in the present case was entitled to rely upon this court's holding in Tonasket as the basis for assuming jurisdiction over the trial of the charges against defendants Hoffman and McGinnis herein.\n\n[2] Defendants make a number of more specific arguments regarding the jurisdictional issue. They argue that the State did not prove jurisdiction in that a copy of Governor Evans' 1965 proclamation assuming State jurisdiction and evidence of the Colville Business Council's authority should have been introduced. This was not necessary. The Governor's proclamation is a matter of public record in the Office of the Governor,\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e and therefore a proper subject of judicial notice even without a party's request.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e This court has previously held that it was for the Governor to decide whether the resolution was from an appropriate tribal body.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Just as recognition of a foreign government by the United States is a political act accepted\n\nas conclusive by state and federal courts, so is such a proclamation by the Governor binding upon this court.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\n[3] Defendants further argue that under the Ten Major Crimes Act, 18 U.S.C. § 1153, which makes it a federal offense to commit certain listed crimes, exclusive jurisdiction is vested in the federal courts over prosecution of the enumerated crimes. In State v. Bertrand, 61 Wash. 2d 333, 378 P.2d 427 (1963), this court explained that when the charge is within the purview of the Ten Major Crimes Act, then in the absence of the state statutes (RCW 37.12) exclusive jurisdiction would be in federal courts. The Bertrand court then proceeded to conclude that the State had properly assumed criminal jurisdiction over the Quinaults under Public Law 280 and RCW 37.12 in a situation where the crime was one of those listed in the Ten Major Crimes Act. Since the State of Washington had, as explained above, assumed jurisdiction over the Colville tribe and reservation, the State had jurisdiction over offenses which otherwise would have been within the purview of the Ten Major Crimes Act.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nDefendants also argue that jurisdiction was invalid in view of 25 U.S.C. § 1326 which provides that tribal consent to state criminal jurisdiction \"acquired pursuant to this subchapter\" shall be by majority vote of the adult members of the tribe at a special election held for this purpose. This statutory language is part of the Indian Civil Rights Act of 1968 which repealed § 7 of the 1953 act and substituted a new regulatory scheme for the extension of state civil and criminal jurisdiction to litigation involving native Americans and arising in Indian country.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\n[4] The flaw in this argument by the defendants is that Congress also provided that repeal of Public Law 280 would not affect any cession of jurisdiction which had been made pursuant to that law prior to its repeal. 25 U.S.C. § 1323(b) (1988) specifically provides:\n\nSection 7 of the Act of August 15, 1953 (67 Stat. 588), is hereby repealed, but such repeal shall not affect any cession of jurisdiction made pursuant to such section prior to its repeal.\n\n(Italics ours.)\n\nAs discussed above, Washington had accepted jurisdiction in 1965. The United States Supreme Court has addressed this issue:\n\nAlthough the Civil Rights Act of 1968 amended Pub. L. 280 by adding tribal consent requirements, those requirements were not made retroactive; the 1968 amendments therefore did not displace jurisdiction previously assumed under Pub. L. 280, . . .\n\n(Footnote omitted.) Three Affiliated Tribes v. Wold Eng'g, P.C., 467 U.S. 138, 150-51, 81 L. Ed. 2d 113, 104 S. Ct. 2267 (1984).\n\nThe defendants next argue that Washington no longer had jurisdiction when it assumed responsibility for their prosecutions because jurisdiction had been retroceded to the federal courts. That is incorrect. The procedure for retrocession of jurisdiction was established by Congress in 25 U.S.C. § 1323(a) which provides in pertinent part:\n\nThe United States is authorized to accept a retrocession by any State of all or any measure of the criminal or civil jurisdiction, or both, acquired by such State pursuant to the provisions of section 1162 of title 18, section 1360 of title 28, or section 7 of the Act of August 15, 1953 (67 Stat. 588), as it was in effect prior to its repeal by subsection (b) of this section.\n\nIn 1986 the Washington Legislature enacted RCW 37.12.100 which provides a procedure for retrocession of jurisdiction over Indians for acts occurring on the Colville reservation. The procedure for transfer of jurisdiction is detailed in former RCW 37.12.120:\n\nWhenever the governor receives from the confederated tribes of the Colville reservation a resolution expressing their desire for the retrocession by the state of all or any measure of the\n\ncriminal jurisdiction acquired by the state pursuant to RCW 37.12.021 over lands of the Colville Indian reservation, the governor may, within ninety days, issue a proclamation retroceding to the United States the criminal jurisdiction previously acquired by the state over such reservation. However, the state of Washington shall retain jurisdiction as provided in RCW 37.12.010. The proclamation of retrocession shall not become effective until it is accepted by an officer of the United States government in accordance with 25 U.S.C. Sec. 1323 (82 Stat. 78, 79) and in accordance with procedures established by the United States for acceptance of such retrocession of jurisdiction.\n\n(Italics ours.)\n\nThe Secretary of the Interior was vested by then President Lyndon B. Johnson with authority to accept retrocession of jurisdiction from a state. Retrocession is effected by publication in the Federal Register which shall specify the effective date of retrocession.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e Retrocession of criminal jurisdiction exercised by the State of Washington over the Colville tribe was accepted at 12:01 a.m. Pacific standard time, the day following publication in the Federal Register, which was on March 17, 1987.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\n[5] Retrocession which was effective March 18, 1987, did not affect state jurisdiction over defendants McGinnis and Hoffman for crimes committed August 27, 1986, where the charging information was filed October 24, 1986, and the trial began on February 17, 1987. RCW 37.12.130 is dispositive of this issue:\n\nAn action or proceeding which has been filed with any court or agency of the state or local government preceding the effective date of retrocession of jurisdiction under RCW 37.12.100 through 37.12.140 shall not abate by reason of the retrocession or determination of jurisdiction.\n\n(Italics ours.)\n\n[6] Defendant Hoffman argues that a \"de facto\" retrocession had occurred depriving the State of jurisdiction and\n\nthat state jurisdiction under RCW 37.12 is exclusive of federal jurisdiction and therefore evidence collected by federal authorities (pursuant to a federal search warrant) should be excluded in state court. No relevant authority is cited to support these arguments. Arguments not supported by relevant citation of authority need not be considered by this court.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e Furthermore, retrocession is governed by the state and federal statutes herein discussed.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nWe conclude from the foregoing that the State of Washington did have, and still has, jurisdiction over the prosecution of the crimes charged in this case and that retrocession did not deprive the trial court of jurisdiction to complete the trial and impose sentence.\n\nIssue Two.\n\nConclusion. Perceiving no probability of prejudice, we conclude that the trial court did not abuse its discretion in denying defendants' motions for a change of venue.\n\n[7] A motion for change of venue should be granted when necessary to effectuate a defendant's due process guaranty of a fair and impartial trial but a defendant must show a probability of unfairness or prejudice from pretrial publicity.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\n[8, 9] The decision to grant or deny a motion for change of venue is within the trial court's discretion and appellate courts are reluctant to disturb such a ruling absent a showing of abuse of discretion.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e This court has repeatedly utilized the factors expressed in State v. Crudup, 11 Wash. App. 583, 524 P.2d 479, review denied, 84 Wash. 2d 1012 (1974), to\n\ndetermine whether the trial court has abused its discretion in refusing to grant a change of venue.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e These factors are as follows:\n\n(1) the inflamatory or noninflammatory nature of the publicity; (2) the degree to which the publicity was circulated throughout the community; (3) the length of time elapsed from the dissemination of the publicity to the date of trial; (4) the care exercised and the difficulty encountered in the selection of the jury; (5) the familiarity of prospective or trial jurors with the publicity and the resultant effect upon them; (6) the challenges exercised by the defendant in selecting the jury, both peremptory and for cause; (7) the connection of government officials with the release of publicity; (8) the severity of the charge; and (9) the size of the area from which the venire is drawn.\n\nCrudup, 11 Wash. App. at 587.\n\nApplying the facts of this case to the Crudup criteria, we observe as follows. (1) The predominant news coverage was factual and even somewhat sympathetic in explaining Elmer McGinnis' past physical infirmities. (2) One newspaper, the Tribal Tribune, which contained some articles to which defendants' arguments are primarily addressed, is a newspaper of very limited circulation distributed to tribal members. (3) Although defendants allege articles continued throughout trial, the specific articles they cite as prejudicial were all published 4 to 6 months before the trial. (4) Defendants have not provided any record of the jury selection process to substantiate their present allegations that difficulty was encountered in empaneling a jury. In fact, the trial judge allowed voir dire to continue for 6 or 7 days. So far as the record before us reflects what occurred in the voir dire process, it appears that the trial judge took great care in the jury selection procedure and offered defendants the opportunity to question individual prospective jurors alone in case any specific publicity may have unduly influenced a particular juror. The trial judge opined that the publicity had not been so adverse as to make empaneling an impartial jury unlikely but that the best test of whether an\n\nimpartial jury could be empaneled was to attempt to empanel one. Prior cases have also approved postponement of the decision on change of venue motions until after voir dire of prospective jurors.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e As the trial court explained, if a fair jury could not be found then a change of venue would be allowed. After the jury was selected, the trial court again denied a change of venue. The trial court regularly and emphatically instructed the jury throughout the trial to avoid seeing or hearing any publicity or conversation regarding the trial. (5) While defendants argue that numerous prospective jurors were excused based on knowledge of pretrial publicity, the prosecution argues few potential jurors could remember anything they had read. Had defendants wanted us to go into this factor in more detail, a record of the voir dire examination should have been provided to this court; it was not. (6) Defendants provide no information on challenges whereas the prosecution alleges that defendants' challenges for cause were all granted except as to one juror who could not remember any publicity. Again, we are without a record to further consider this factor. (7) Neither the record nor the news articles the defense relies upon show improper release of information by government officials. (8) The charges, of course, are severe ones as in the above cited cases of State v. Rupe, 101 Wash. 2d 664, 683 P.2d 571 (1984) and State v. Brooks, 20 Wash. App. 52, 579 P.2d 961, review denied, 91 Wash. 2d 1001 (1978), wherein denials of motions for changes of venue were upheld on appeal. (9) The jury was drawn from Okanogan County.\n\nWeighing the above factors, it is clear to us that the defendants have not shown a probability of prejudice due to pretrial publicity; the trial court's denial of the motions for change of venue was not error.\n\nIssue Three.\n\nConclusion. The defendants failed to show that a joint trial would unfairly prejudice them; the trial court acted within the ambit of its discretion in denying the motion for severance.\n\n[10-12] The granting or denial of a motion for separate trials of jointly charged defendants is entrusted to the discretion of the trial court and will not be disturbed on appeal absent a manifest abuse of discretion.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e Separate trials are not favored in Washington and defendants seeking severance have the burden of demonstrating that a joint trial would be so manifestly prejudicial as to outweigh the concern for judicial economy.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e The existence of mutually antagonistic defenses is not alone sufficient to compel separate trials.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e Rather, it must be demonstrated that the conflict is so prejudicial that defenses are irreconcilable, and the jury will unjustifiably infer that this conflict alone demonstrates that both are guilty.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e The burden is on a moving party to come forward with sufficient facts to warrant the exercise of discretion in his or her favor.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\n[13] Defendant Hoffman argues that the reputation of his father and codefendant (McGinnis) for quarreling with tribal officials prejudiced him by association. His argument that the hostility between the tribe and the defendant McGinnis would somehow taint him lacks supporting authority. No authority is cited for the proposition that one defendant's objectionable background or reputation might\n\nrub off onto a codefendant and thereby constitute cause for separate trials. We perceive no merit in this argument.\n\nThe defendant Hoffman also argues that severance was required because he was prejudiced by the court's ruling that one of his statements to the witness Epperson was inadmissible in the prosecution's case in chief. The background of this is that when Hoffman appeared at Epperson's home after the shooting, Hoffman told him that McGinnis had fired the 9 mm. gun. Upon the defendants' motions for separate trials, the court held that Epperson could not testify to that statement because it tended to incriminate McGinnis. That was a proper ruling under CrR 4.4(c) which provides in pertinent part:\n\n(1) A defendant's motion for severance on the ground that an out-of-court statement of a codefendant referring to him is inadmissible against him shall be granted unless :\n\n(i) the prosecuting attorney elects not to offer the statement in the case in chief ;\n\n(ii) deletion of all references to the moving defendant will eliminate any prejudice to him from the admission of the statement.\n\n(Italics ours.) In this case, the prosecuting attorney elected not to use defendant Hoffman's statement to the witness Epperson in the State's case in chief.\n\nThe above court rule, CrR 4.4(c), was adopted to avoid the constitutional problem dealt with in Bruton v. United States, 391 U.S. 123, 20 L. Ed. 2d 476, 88 S. Ct. 1620 (1968).\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e In Bruton, the United States Supreme Court held that the defendant was deprived of his confrontation rights under the Sixth Amendment when he was incriminated by a pretrial statement of a codefendant who did not take the stand at trial.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e In the present case, however, severance was not mandated by CrR 4.4(c) because the prosecution elected not to use Hoffman's statement to the witness\n\nEpperson about the defendant McGinnis in the State's case in chief. Hoffman, however, ultimately did elect to testify at trial and by so doing eliminated the potential Bruton problem. With Hoffman on the stand, McGinnis had the full opportunity to cross-examine him.\n\nHoffman maintains that he was prejudiced because the prosecution was allowed to impeach him with this statement when he testified that he did not know if McGinnis had fired a gun. This argument, however, does not withstand scrutiny. Only if a defendant has the right to lie on the stand would such an effort at impeachment unfairly prejudice him, but that is not the law. The prosecution had the right on cross examination to impeach the witness with the witness' own prior inconsistent statement. The trial court offered to allow Hoffman to recall Epperson to allow him to testify regarding Hoffman's statement that McGinnis had fired the 9 mm. gun, but Hoffman elected not to recall Epperson.\n\nMutually antagonistic defenses can be sufficient to support a motion for severance, but this is a factual question which must be proved by the defendant.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e In this case the trial court concluded, and we agree, that the defenses were not inherently antagonistic. Both defendants claimed self-defense and that they did not know who was on McGinnis' property. The trial court did not abuse its discretion in denying severance.\n\nIssue Four.\n\nConclusion. The facts do not support defendants' arguments that their right to a speedy trial was violated.\n\nDefendant McGinnis claims that his conviction should be reversed because the State obtained a continuance from December 29, 1986 to February 11, 1987. This is a factually inaccurate allegation. The arraignment was October 30, 1986. On December 24, during the competency hearings on McGinnis, the State moved for a 5-day continuance from December 29, 1986 until January 5, 1987 based upon CrR\n\n3.3(d)(8). The trial court granted that continuance, due to unavoidable circumstances beyond the control of the court or the parties, and finding that all parties had acted with due diligence. The trial court stated that the reasons necessitating the delay included three disqualifications of judges, two of which were at the defendants' request, and a large number of pretrial hearings that were required by the various pretrial motions. Under CrR 3.3(d)(8), that 5-day continuance was appropriate.\n\n[14, 15] Then on December 30, 1986 both defendants moved for a continuance and agreed to a trial date of February 17, 1987. The trial court opined that a solid month of pretrial hearings would be necessary before the trial could commence. Pretrial matters included hearings on a motion to dismiss, a motion to suppress physical evidence, completion of McGinnis' psychiatric evaluation, a motion to sever and a discovery controversy to be resolved. Thus, this continuance too was proper under CrR 3.3. The trial court acted well within its discretion in granting these continuances. Trial within 60 days is not a constitutional mandate.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e There was no violation of defendants' rights to a speedy trial. Had the trial court denied the defense motions for a continuance, given the complexity of the case and the repeated substitution of defense attorneys, the opposite argument would doubtless have been made on appeal -- that the failure to grant defendants' motions for continuance deprived them of effective assistance of counsel.\n\nIssue Five.\n\nConclusion. The dismissal of federal charges and the initiation of state criminal proceedings did not violate defendants' equal protection rights.\n\n[16] Defendant Hoffman argues that the state court prosecution was a \"sham\" and a \"cover\" for a federal prosecution and a violation of his right to equal protection. We\n\nconclude that this argument is without merit. Hoffman cites no authority for the proposition that the criminal charging of a defendant by one sovereignty after dismissal of charges by another sovereignty violates any constitutional right. To the contrary, an act denounced by both federal and state sovereignties is an offense against both, and may be punished by each.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e Nothing prohibits a federal prosecutor from deciding to surrender a suspect to a state for prosecution under applicable state law.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nDefendant Hoffman relies upon two lines of authority, each of which is inapplicable. He first argues that we should look to double jeopardy cases involving consecutive state and federal prosecutions to determine if the defendant's constitutional rights have been violated. Such an issue can arise when a defendant has been acquitted by one jurisdiction and the other jurisdiction seeks to initiate criminal proceedings based on the same conduct. In this case, however, only one prosecution by one jurisdiction is involved. Mere cooperation between different law enforcement agencies does not violate a defendant's constitutional rights. In fact, cooperation between state and federal authorities is encouraged.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\n\nHoffman next argues that his equal protection rights were violated by the federal and state prosecutors' combined decision to charge the defendants under state rather than federal law. He claims that because the punishment is different under state law than under federal law such a decision constituted improper \"forum shopping\", which he also argues is unconstitutional under the rationale of State v. Zornes, 78 Wash. 2d 9, 475 P.2d 109 (1970). This is not a correct reading of the principle enunciated in Zornes and is an untenable argument in this case for two reasons. First,\n\nthe Zornes rule does not apply to the charging discretion of two different charging authorities be they state and federal or officials of two different states. Secondly, regardless of any cooperation or joint decisionmaking by federal and state prosecutors, equal protection has not been violated because the Zornes rule would be inapplicable here even if one prosecutor had decided whether to charge murder in the first degree under 18 U.S.C. § 1111 and attempted murder of a federal officer under 18 U.S.C. § 1114, or aggravated murder in the first degree under RCW 10.95.020 and assault in the first degree under RCW 9A.36.010.\n\n[17] The Zornes rule holds that equal protection is violated when two statutes declare the same acts to be crimes but penalize more severely under one statute than the other thereby giving the prosecutor unbridled discretion. However, this rule does not apply when the two crimes contain different elements.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e Here the federal crimes and the state crimes contain different elements. The element of malice aforethought contained in 18 U.S.C. § 1111 is different from the element of intent required under RCW 10.95.020. RCW 9A.32.030(1)(a) (incorporated in RCW 10.95.020) requires a premeditated intent to cause the death of another person. 18 U.S.C. § 1111 defines murder as the unlawful killing of a human being with malice aforethought. Malice does not require proof of intent to kill. Rather, it may be established by evidence of conduct which is reckless and wanton and a gross deviation from a reasonable standard of care.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e One element of 18 U.S.C. § 1114 requires that the offense be committed against a federal officer; this element is not contained in the state assault charge under RCW 9A.36.010.\n\nWhere elements of alternative crimes differ, the exercise of a prosecutor's discretion does not violate equal protection. It follows that the Zornes rule does not apply in this case and defendants' equal protection rights were not violated.\n\nHoffman further claims that federal authorities sought a state prosecution because the death penalty was unavailable in federal court. The prosecution, however, never sought the death penalty in this case. In any event, we have held that the prosecutorial discretion of whether or not to seek the death penalty does not violate equal protection principles enunciated in Zornes.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\n\nIssue Six.\n\nConclusion. Defendants have not shown that they were prejudiced by any alleged prosecutorial failure to disclose evidence.\n\n[18] As we have recently reiterated, the scope of discovery is within the trial court's discretion and that court's decisions in this regard will not be overturned absent a manifest abuse of discretion.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e In criminal cases, the discovery provisions of CrR 4.7 guide the trial court in the exercise of this discretion. The record in the present case illustrates that the trial judge continually guided discovery and was vigilant in insuring that the defense was provided with all appropriately discoverable evidence. The trial court repeatedly, and on different occasions, inquired of defendants as to whether they needed assistance on discovery matters.\n\nDefendant Hoffman alleges that although the prosecution did provide witness statements, it interfered with the attempt by the defense to interview various witnesses. This claim is not borne out by the record. To the contrary, the\n\nrecord demonstrates that the prosecution offered and provided discovery beyond that strictly required by CrR 4.7. The prosecutor repeatedly offered to make witnesses available to the defense. The prosecution made its forensic expert witness telephonically available to the defense's appointed forensic expert. The record reflects no defense requests for depositions pursuant to CrR 4.6; the present allegation that witnesses were unavailable to the defense is unsubstantiated.\n\n[19] Defendant Hoffman alleges he was surprised by a prosecution witness' testimony that Hoffman may have stood on the chicken cages behind the chicken coop in order to shoot Officer Millard. As is true with other prosecution witnesses, this witness was also available to the defense. Furthermore, no authority has been cited for the proposition that CrR 4.7 requires all prosecution \"theories\" to be disclosed to defendants. We find nothing whatsoever to establish that any evidence which should have been disclosed pursuant to CrR 4.7(a)(3) as tending to negate defendants' guilt was withheld by the prosecution.\n\nHoffman asserts that having five different attorneys appointed prior to trial had a negative effect on his defense. No record is provided, however, as to why the attorneys were allowed to withdraw. It appears that at least one attorney was discharged by Hoffman himself and another was allowed to withdraw because of a potential conflict of interest. Error in this regard has not been shown.\n\nTrial commenced on February 17, 1987. Hoffman alleges that neither he nor his appointed counsel ever saw any of the physical evidence to be introduced in his trial until the evening of the second day of trial. Defendant Hoffman's brief argues that \"[t]he actions of the Federal government in . . . retaining custody of the evidence in Spokane with the F.B.I., to the exclusion of Patrick Hoffman such that the evidence could not even be physically reviewed by defendant's counsel until the second day of trial, should offend even a novice constitutional law scholar.\" This is a misleading argument. When Hoffman alleges that he and\n\nhis attorney were unable to see the physical evidence until the second day of trial, he is referring to a viewing by the defendant which occurred in jail pursuant to a request not made by his attorney until February 17, 1987. The record establishes that the physical evidence had been delivered to defendants' expert prior to trial. In fact, the prosecution sought the trial judge's assistance in getting a portion of the physical evidence back from the defendants' expert on February 10, 1987. That evidence had been delivered to defendants' expert on January 29, 1987. Much of the State's physical evidence had been delivered to that same defense expert on December 22, 1986, and the officer who testified for the prosecution regarding the collection and preservation of physical evidence had spent most of that day with defendants' forensic expert.\n\nDefendants have made no showing of a violation of the discovery rules and Hoffman's arguments regarding denial of access to physical evidence are not well taken.\n\nIssue Seven.\n\nConclusion. The State produced substantial evidence at trial showing that the killing of police officer Millard was both intended and premeditated.\n\n[20] The test for sufficiency of the evidence is whether, after viewing the evidence in the light most favorable to the State, any rational trier of fact could have found the essential elements of the crime beyond a reasonable doubt.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e\n\n[21, 22] Premeditation is an essential element of murder in the first degree as charged herein.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e Premeditation must involve more than a moment in time;\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e it is defined as the deliberate formation of and reflection upon the intent to take a human life and involves the mental process of\n\nthinking beforehand, deliberation, reflection, weighing or reasoning for a period of time, however short.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e Premeditation can be proved by circumstantial evidence where the inferences drawn by the jury are reasonable and the evidence supporting the jury's verdict is substantial.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e\n\n[23] As in State v. Ollens, 107 Wash. 2d 848, 733 P.2d 984 (1987) and State v. Neslund, 50 Wash. App. 531, 749 P.2d 725, review denied, 110 Wash. 2d 1025 (1988), the factual record in this case contains evidence which would allow the jury to reasonably conclude that the defendants each premeditated the killing. There was evidence of prior threats by the defendant McGinnis regarding tribal officers; a number of deadly weapons were brought to the scene of the shooting by the defendant Hoffman; multiple shots were fired by each defendant; one of the victims of the shooting was shot from behind; and several statements indicating premeditation were made by each defendant. The jury was entitled to find premeditation under the testimony presented.\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e\n\nAs just noted, substantial evidence showed that Hoffman transported a number of guns, flare guns and a supply of ammunition to the scene of the shootings. The planned presence of weapons supports an inference of premeditation,\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e and the jury was entitled to disbelieve Hoffman's testimony that he always carried all these weapons.\n\nThere is substantial evidence from which the jury might reasonably have found that both defendants armed themselves, hid and waited for the officers to approach and then\n\nopened fire on the officers. Evidence from a number of witnesses indicated that it was the officers who were fired upon, rather than the other way around, and that the officers were not the ones who initiated the gunfire. Officer Dick testified, and forensic evidence corroborated, that he was shot in the back. An attack on a victim from behind may indicate premeditation.\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e Both physical evidence and testimony indicated that a considerable number of shots were fired by both defendants. Eight .45 caliber shell casings, eight .22 caliber shell casings and two 9 mm. shell casings were recovered near the chicken coop behind which the defendants were hiding, and all of the expended shells were consistent with having been fired from guns owned by Hoffman.\n\nHoffman also admitted reloading the .45 caliber pistol. Evidence of multiple acts of violence also supports an inference of premeditation.\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e After both officers were shot, and Officer Dick was crawling and attempting to drag Officer Millard to cover, the defendants continued to coordinate their gunfire with the flares they fired to illuminate the scene of the shooting. Such conduct is evidence of calculated actions and premeditated intent to kill. There was also testimony which indicated McGinnis had said he was declaring war on the officers if they again tried to detain him. The jury may also have believed that McGinnis said he wanted his daughters out of the line of fire and that Hoffman responded by saying \"good deal\" when he learned an officer had been killed.\n\n[24] There was substantial evidence that one or both of the defendants shot at officers Dick and Millard. Proof that\n\na defendant fired a weapon at a victim is, of course, sufficient to justify a finding of intent to kill.\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e\n\n[25] Hoffman also argues that he could not have intended to kill Officer Millard because he did not know his duty shift and did not know that it was Officer Millard approaching the chicken coop. This is untenable. A slayer does not have to know the identity of the victim in order to form an intent to kill.\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e We hold here that there was substantial evidence from which the jury could have reasonably found the defendants not only intended to kill the decedent, but also premeditated the killing.\n\nIssue Eight.\n\nConclusion. We conclude there was substantial evidence from which the jury could have found that the defendants knew or reasonably should have known that the homicide victim was a law enforcement officer who was engaged in his official duties at the time of the shooting.\n\nMurder in the first degree can be enhanced to aggravated murder in the first degree by the finding of an aggravating circumstance. In this case, the aggravating circumstance charged is that found in RCW 10.95.020(1):\n\nA person is guilty of aggravated first degree murder if he or she commits first degree murder as defined by RCW 9A.32.030(1)(a), as now or hereafter amended, and one or more of the following aggravating circumstances exist:\n\n(1) The victim was a law enforcement officer, corrections officer, or fire fighter who was performing his or her official duties at the time of the act resulting in death and the victim was known or reasonably should have been known by the person to be such at the time of the killing;\n\nThe defendants argue there was insufficient evidence to show that Officer Millard was a police officer or that he was engaged in official duties or that defendants should have\n\nknown he was engaged in official duties at the time of the killing. We disagree.\n\nDefendants first argue that because Officer Millard's commission was not introduced into evidence, there could be no finding that he was a police officer. This is not correct. There was in fact considerable and unrefuted evidence that Officer Millard was a law enforcement officer at the time he was shot down. The chairman of the Colville Tribal Council Law and Justice Committee testified that Millard and Dick were tribal police officers. The tribal police chief testified to the same effect. The Sheriff of Okanogan County testified that Millard was a commissioned sheriff's deputy and a tribal policeman and had been a deputy sheriff from 1979 until the time of his death. Louis Millard and John Dick's certificates of appointment as deputy sheriffs and their oaths of office were introduced into evidence as State's exhibits 2 and 3.\n\nDefendants also argue that there was not substantial evidence to support the jury's finding that Officer Millard was engaged in his official duties at the time he died. This is also an untenable argument. Officer Millard was dressed in his police uniform, driving an official marked police car and was accompanied by his superior officer and several other tribal officers while he was searching for McGinnis and Hoffman. He had been called to the scene by the police dispatcher and the chief of the tribal police force testified that he was on official business for the Colville Confederated Tribal Police Department during the early morning hours of August 27, 1986, when the shooting occurred. Defendants argued throughout the trial, and do so again here, that the chief of the tribal police had called off the search for the defendants prior to the shooting. That, too, is incorrect. An officer had been ordered to maintain surveillance throughout the night at the McGinnis place and to radio for assistance if the suspects appeared. Thus very substantial evidence was presented from which the jury could have concluded, as it did, that Officer Millard was a\n\nlaw enforcement officer engaged in his official duties at the time he was killed.\n\nDefendants also argue that there was not substantial evidence from which the jury could have concluded that the defendants knew or should have known that Officer Millard was a law enforcement officer. Again, we disagree.\n\nAt the time of the shooting, defendants Hoffman and McGinnis knew the tribal authorities had been searching for them; they had eluded a police vehicle in a high speed chase earlier in the evening. There was evidence from which the jury could have reasonably concluded that both defendants knew that McGinnis left the hospital without the consent of the tribal police. Hoffman himself testified that they stopped on a hill overlooking the McGinnis property to check for police presence before entering the area. Within a very short time of the defendants' arrival on the property, five marked police vehicles and an emergency truck arrived at the property. The lights and search lights on the vehicles remained illuminated for approximately 15 minutes while officers carrying flashlights openly searched surrounding buildings and fields. Powerful floodlights on the emergency rig panned across the McGinnis property. As Officers Millard and Dick approached the chicken coop, they each held flashlights. A photograph of Officer Millard taken at the scene after his death showed him to be in full police uniform. Thus, again, there was very substantial evidence from which the jury could find that the defendants knew the people searching the property were law enforcement officers.\n\nIssue Nine.\n\nConclusion. The trial court did not abuse its discretion in admitting the photographs of Officer Millard's body into evidence; the photographs' probative value outweighed any prejudicial effect.\n\nDefendants claim that the trial court abused its discretion by admitting two photographs of Officer Millard lying face up at the scene of the shooting. The trial court reviewed the photographs prior to their admission and\n\nruled them admissible. The trial court observed that the prosecuting attorney had not offered into evidence those photographs that might have been considered inflammatory.\n\n[26, 27] The admissibility of photographs is generally within the sound discretion of the trial court and will not be disturbed on appeal absent a showing of abuse of discretion.\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e There was no abuse of discretion in this connection. Accurate photographs are admissible, even if gruesome, if their probative value outweighs their prejudicial effect.\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e\n\nThe photographs were relevant to several issues. They tended to show that Officer Millard had attempted to crawl, or had been dragged, toward cover and that he was dressed in full police uniform at the time he was killed. Officer Dick testified he had tried to drag Officer Millard to safety as flares and gunfire continued from the area of the chicken coop. This was relevant to the contested issues of intent to kill and premeditation. Furthermore, a hotly contested issue at trial was whether the defendants knew or should have known the victim was a law enforcement officer engaged in official duties when he was shot. We also adhere to our often reiterated holding that a bloody brutal crime cannot be explained to a jury in a lily-white manner.\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e Since the photographs had clear probative value, the trial court did not abuse its discretion in deciding, as it did, that any prejudicial effect did not outweigh their probative value.\n\nIssue Ten.\n\nConclusion. The trial court did not abuse its discretion in declining to appoint a psychiatrist to examine Officer Dick.\n\n[28] Prior to trial, the defendants moved for appointment of a psychiatrist to examine Officer Dick arguing that it was necessary for effective cross examination. The trial court conducted an in camera review of the officer's police personnel files and denied the motion. The trial court held there had been no showing of a compelling reason requiring such an examination and that no question had been raised as to the competency of Officer Dick as a witness. After reviewing the record, and considering the trial court's reasoning, we concur that a psychiatric examination of the wounded police officer was unwarranted. As we have made clear in sexual offense cases, a crime witness or victim should not be ordered to submit to psychiatric examination unless a defendant demonstrates a compelling reason.\u003cspan class=\"fnref\"\u003e50\u003c/span\u003e We perceive no reason for a different rule in this case. To conclude otherwise would smack of our countenancing a practice of placing victims and witnesses on trial in place of defendants; this we decline to do. Review of the record shows no basis for a challenge to Officer Dick's competency to testify and no necessity whatsoever for the appointment of a psychiatrist to examine him.\u003cspan class=\"fnref\"\u003e51\u003c/span\u003e\n\nIssue Eleven.\n\nConclusion. The trial court did not err in refusing to appoint an expert witness on the subject of police procedures, such testimony not having been shown to be necessary to the defense.\n\nDefendants contend that the court should have granted their request for appointment of a former police chief as a\n\ndefense expert on proper police conduct during the apprehension of suspects. They argue that this was necessary to assist the jury in determining whether the tribal officers' actions were appropriate and what responses they might have evoked. The trial court ruled that such an expert's testimony might well prove to be inadmissible at trial in this case, and, in any event, an expert's opinion was unnecessary to the kinds of arguments the defense sought to make to the jury on this issue. We agree. This potential expert witness had no personal knowledge of the events in question or the police conduct on the night of the shooting. Even if the police procedures were determined to be careless, or lacking in the best search techniques, we do not perceive that this would have provided a defense to the charges of murder and assault of the officers.\n\n[29, 30] CrR 3.1(f) controls the authorization of funds for services other than counsel.\u003cspan class=\"fnref\"\u003e52\u003c/span\u003e Pursuant to this rule, a defendant is entitled to the appointment of experts if financially unable to obtain them and if the services are necessary to the defense. A defendant's constitutional right to the assistance of an expert witness is no broader than the defendant's rights under CrR 3.1(f).\u003cspan class=\"fnref\"\u003e53\u003c/span\u003e Denial of funds is proper where the witness' testimony is not a necessity.\u003cspan class=\"fnref\"\u003e54\u003c/span\u003e The determination of whether such services are necessary is within the trial court's informed discretion.\u003cspan class=\"fnref\"\u003e55\u003c/span\u003e\n\nThe record reflects that public funds were authorized and expended for preliminary defense consultations with this expert witness and that the trial judge did consider the affidavit the witness prepared. We agree with the trial court\n\nthat this witness' testimony might well have been inadmissible under the facts of this case and that, in any event, the witness' opinions were not necessary in order for the defendants to argue, and the jury to determine, such relevant issues as self-defense. The trial court did not abuse its discretion in denying the appointment of an expert witness on police procedures.\n\nIssue Twelve.\n\nConclusion. The trial court did not err in admitting evidence regarding guns since it was directly relevant to issues in the case.\n\nDefendant McGinnis argues that the testimony regarding the guns that were observed in his truck after his August 25 arrest at tribal headquarters, and the arsenal of guns the police believed he kept at his residence, and the admission of exhibit 9 (a small handgun which McGinnis asked a doctor to hide after he was arrested at tribal headquarters) and exhibit 13 (a .22 caliber pistol found at the scene of the shooting) penalized constitutionally protected behavior in violation of this court's decision in State v. Rupe, 101 Wash. 2d 664, 683 P.2d 571 (1984) (Rupe I).\n\nRupe I, cited above, held that constitutionally protected behavior, such as possession of legal guns, cannot be introduced as proof of an aggravating circumstance in the penalty phase of a capital case. In Rupe I, the State had attempted to draw adverse inferences from the defendant's mere possession of legal weapons totally unrelated to the crime charged.\u003cspan class=\"fnref\"\u003e56\u003c/span\u003e\n\n[31] Exhibit 13, which defendant McGinnis argues should have been excluded, was the .22 caliber pistol carried by the defendant Hoffman to the scene of the shooting and which was admittedly fired at the time the officers were shot. It was relevant and admissible evidence.\n\nDefendant McGinnis also argues that the testimony regarding the guns observed by officers in his truck after his August 25 arrest at tribal headquarters, the gun he gave to\n\na doctor to hide after that arrest, and the testimony regarding an arsenal believed to be in his home, should have been suppressed under the rationale of Rupe I. Again, we disagree.\n\nGuns do not necessarily have to be used in the commission of a crime to be admissible.\u003cspan class=\"fnref\"\u003e57\u003c/span\u003e Although constitutionally protected behavior alone cannot justify criminal punishment, the corollary to that proposition is that if evidence has probative value, its use is not prohibited simply because constitutional provisions may also be implicated.\u003cspan class=\"fnref\"\u003e58\u003c/span\u003e Here, this testimony and these guns were relevant. Evidence is relevant when it has a tendency to make the existence of any fact that is of consequence to the determination of the action more probable or less probable than it would be without the evidence.\u003cspan class=\"fnref\"\u003e59\u003c/span\u003e Whether or not the police had knowledge of exigent circumstances which might have authorized their entry onto the McGinnis property was an issue in the case. The police testified that McGinnis' repeated threats against his neighbors, combined with their knowledge that he carried and possessed guns, together with other facts led them to believe it was imperative that he be rearrested immediately.\n\nThe trial court has wide discretion in determining whether evidence concerning a criminal defendant's constitutionally protected behavior is relevant and admissible.\u003cspan class=\"fnref\"\u003e60\u003c/span\u003e The trial court did not err in admitting the evidence regarding guns since it was relevant to issues in this case.\n\nIssue Thirteen.\n\nConclusion. There is no showing that prosecutorial misconduct prejudiced defendants' rights to a fair trial.\n\nThe defendant Hoffman complains of a number of statements by the prosecutor which he alleges constituted prosecutorial misconduct. He argues that the prosecuting attorney made statements during closing argument which were unsupported by the evidence, reflected personal beliefs and aroused passion and prejudice. These contentions are not supported by the record.\n\n[32, 33] Where improper argument is charged, the defense bears the burden of establishing the impropriety of the prosecuting attorney's comments as well as their prejudicial effect.\u003cspan class=\"fnref\"\u003e61\u003c/span\u003e Reversal is not required if the error could have been obviated by a curative instruction which the defense did not request.\u003cspan class=\"fnref\"\u003e62\u003c/span\u003e The failure to object to a prosecuting attorney's improper remark constitutes a waiver of such error unless the remark is deemed to be so flagrant and ill intentioned that it evinces an enduring and resulting prejudice that could not have been neutralized by an admonition to the jury.\u003cspan class=\"fnref\"\u003e63\u003c/span\u003e\n\nWe have reviewed the entire transcript of the prosecuting attorney's argument including the many quotes cited in defendants' briefs and find no comments rising to this level. The fact that no defense objections were made during the prosecuting attorney's closing argument also suggests this same conclusion.\n\nSpecifically, defendants now allege that the prosecuting attorney argued that merely pointing a gun and pulling the\n\ntrigger was sufficient proof of premeditation. This misrepresents the prosecuting attorney's argument. Placing the passage in question in context demonstrates that it was not improper:\n\nJust as the officers were coming up to the -- to the chicken coop, did the defendants deliberate at that point? When the flashlight was shined behind the chicken coop, did they deliberate? When the gun was raised and pointed at the officer's back, was there deliberation? When the gun was pointed at Louis Millard and the trigger pulled, was there deliberation thought of beforehand. That's what premeditated is. And as to the death of Louis Millard, that's what we have to prove, that they thought about it -- whoever pulled the trigger thought about it beforehand more than a moment. Minutes, hours, days, weeks, all that satisfies the proof as long as it's more than a moment in time, as long as there is some reflection before the trigger is pulled. And that's not as complicated as it sounds when you stop and think about it, 'cause isn't that what the proof is and isn't that reasonably evaluating the evidence, how the defendants acted in this particular situation.\n\nWe perceive no impropriety in this argument. The jury was not instructed that intent to kill is the same as premeditation. To the contrary, it was argued that defendants premeditated the killing.\n\nDefendants also object to the argument, \"Now, what happened to this gun is that Hoffman knew a police officer had been shot with it and he took it up in the hills and got rid of it. He hid it where nobody would ever find it.\" This argument was supported by the evidence. Hoffman admitted the gun was at the scene; the gun was never found after an exhaustive search of the area, and Hoffman admitted to the witness Epperson that he had disposed of the gun.\n\n[34] Defendants Hoffman and McGinnis also object to the prosecuting attorney's argument wherein he utilized such phrases as \"I think\" or \"I think the evidence shows\". All of the statements objected to in this connection contained material which was supported by the evidence and none were of such nature that any error in the form of the argument could not have been obviated by a curative instruction, had one been requested. In closing argument,\n\nthe prosecuting attorney has a wide latitude in drawing and expressing reasonable inferences from the evidence.\u003cspan class=\"fnref\"\u003e64\u003c/span\u003e\n\nDefendant Hoffman also objects to the following statement made in argument: \"Would a reasonably prudent person have put themselves behind that chicken coop and would a reasonably prudent person shoot a police officer in the back?\" He alleges that this appeals to the jury's passion and prejudice. Again, we disagree. This argument is supported by the evidence and was relevant to defendants' allegations of justifiable homicide and self-defense, both of which defenses involve the issue of reasonable use of force in the light of circumstances known to the defendants.\n\nWe have carefully examined the whole of the prosecutor's argument and conduct in closing argument and conclude that there was no unfair assertion of personal opinions, appeal to the passion or prejudice of the jury or misinformation given to the jury regarding the law.\n\n[35] Defendants further argue that they were prejudiced because the written findings of fact and conclusions of law regarding certain pretrial suppression motions were not actually entered until after trial. This contention has no merit. The trial court made comprehensive findings and conclusions on the record at the time of its decision and the trial court ordered that the record thereof be transcribed in order to assist in the preparation of accurate written findings. In this case, the fact that written findings and conclusions were not entered until a later date has no effect whatsoever on our ability to conduct appellate review. While careful adherence to the requirements of CrR 3.6 is always the safest course, the purpose of CrR 3.6 is to have a record made and that purpose has been served here.\u003cspan class=\"fnref\"\u003e65\u003c/span\u003e\n\n[36] Defendants also claim that their right to cross-examine witnesses was improperly curtailed. The scope of\n\ncross examination lies within the sound discretion of the trial court and will not be disturbed absent a manifest abuse of that discretion.\u003cspan class=\"fnref\"\u003e66\u003c/span\u003e Our review of the record in this case demonstrates that the defendants were afforded very considerable latitude in cross-examining the State's witnesses. There was no abuse of the trial court's discretion in this regard.\n\nIssue Fourteen.\n\nConclusion. The trial court's instruction to the jury that Officers Millard and Dick were law enforcement officers does not constitute reversible error.\n\nIt is defendants' argument that whether Officers Millard and Dick were in fact law enforcement officers was a factual issue to be determined by the jury. The evidence that they were law enforcement officers was overwhelming, unrefuted and, if error at all, any instructional error in this regard was harmless. This issue did not involve an element of the crime of murder or assault; rather, it was a part of the aggravating circumstance which, if found, is a penalty enhancement provision elevating murder in the first degree to aggravated murder in the first degree.\u003cspan class=\"fnref\"\u003e67\u003c/span\u003e Therefore, the failure to submit this issue to the jury did not in any event invade the defendants' rights to have each element of the crime submitted to the jury.\n\n[37, 38] As discussed in connection with Issue Eight regarding the sufficiency of the evidence to show aggravation, there was considerable evidence, all unrefuted, showing that the two officers who were shot were on-duty law enforcement officers at the time. Thus, even if we assume that the failure to submit the \"law enforcement officer\" issue to the jury invaded the defendants' rights to a jury determination, such error is harmless, it being the well established law of this state that even constitutional errors\n\nmay be so insignificant as to be harmless.\u003cspan class=\"fnref\"\u003e68\u003c/span\u003e Under Washington law, an error in instructions is likewise harmless if it did not affect the final outcome of the case.\u003cspan class=\"fnref\"\u003e69\u003c/span\u003e As we recently explained,\n\nA constitutional error is harmless if the appellate court is convinced beyond a reasonable doubt that any reasonable jury would have reached the same result in the absence of the error.\n\nState v. Guloy, 104 Wash. 2d 412, 425, 705 P.2d 1182 (1985), cert. denied, 475 U.S. 1020, 89 L. Ed. 2d 321, 106 S. Ct. 1208 (1986).\n\nGiven the unrefuted evidence in this regard, it is clear beyond a reasonable doubt that any reasonable jury would have decided that Louis Millard was a law enforcement officer on the night he was shot to death, and in the face of the unrefuted and overwhelming evidence to that effect, it cannot reasonably be suggested otherwise.\n\nIssue Fifteen.\n\nConclusion. It was within the proper province of the trial court to determine the lawfulness of the arrest and the lawfulness of the police entry onto defendant McGinnis' property on the night of the shooting.\n\n[39, 40] It is established in this state that the validity of an arrest and the lawfulness of a search are determinations for the court to make. As State v. John Doe, 6 Wash. App. 978, 982, 497 P.2d 599, review denied, 81 Wash. 2d 1004 (1972) explains:\n\nThe validity of an arrest is a constitutional issue to be resolved solely within the province of the court.\n\nWhen the constitutional validity of an arrest is challenged, it is the function of a court to determine whether the facts available to the officers at the moment of the arrest would \"warrant a man of reasonable caution in the belief\" that an offense has been committed.\n\nBeck v. Ohio, 379 U.S. 89, 96, 13 L. Ed. 2d 142, 85 S. Ct. 223 (1964). Although the issue has never been specifically met in\n\nthis jurisdiction, it is clear our courts adhere to the rule that the determination of whether or not there was probable cause to make an arrest without a warrant is a factual question for the court. On a substantially similar issue -- the lawfulness of a search and seizure, often dependent on the existence of probable cause for an arrest -- the factual issue turning on a determination of reasonableness must be decided by the court. Probable cause for an arrest and the legality of a search and seizure involve basic constitutional issues. The duty and obligation of protecting an accused's basic constitutional rights rests with the court, not with a jury. On appeal, it is our function to make an independent review of the evidence to insure that the constitutional safeguards of due process have been afforded the defendant.\n\n(Citations omitted.)\n\nThe lawfulness of an arrest only becomes a jury question if the issue is injected into the trial by reason of the charging language of the information,\u003cspan class=\"fnref\"\u003e70\u003c/span\u003e as, for example, when a defendant is charged with resisting \"lawful\" apprehension. The lawfulness of an arrest is not part of the charging information for murder in the first degree or assault in the first degree. Additionally, in this case the trial court, in an abundance of caution, ruled that an outstanding arrest warrant for Patrick Gene Hoffman (involving an unrelated matter) was not admissible because its probative value was outweighed by the danger of unfair prejudice. Therefore, had the jury been left to decide the legality of the entry onto the property, it would unfairly have been left to do so without knowledge of the arrest warrant for defendant Hoffman. We conclude that the general rule explained in John Doe applies here and the constitutionality of the arrest and search was determined properly by the trial court.\n\nIssue Sixteen.\n\nConclusion. When the officers effected the arrest of the defendant McGinnis on August 25, 1986 at tribal headquarters, 2 days before the officers were shot, the arresting officers were acting pursuant to a valid outstanding arrest warrant which had been issued by the chief judge of the\n\ntribal court. The legality of that warrant is undisputable. Thus, the trial court in the present case did not err in concluding that the arrest was legal.\n\nDefendants argue that the officers were not engaged in performing their \"official duties\" for purposes of the aggravated murder in the first degree statute, RCW 10.95.020(1), because, as they argue, they were infringing upon the defendants' constitutional rights by entering the property without a search warrant. We disagree.\n\n[41] First, defendant McGinnis has submitted no authority for the proposition that a police officer's inadvertent infringement of a defendant's constitutional rights necessarily means that the officer is not engaged in his or her official duties for purposes of RCW 10.95.020(1) (making premeditated murder \"aggravated\" if a law enforcement officer is murdered while in the performance of his or her official duties). Second, the trial court correctly determined that the officers' entry onto the McGinnis property was a lawful attempt to rearrest McGinnis and to arrest the defendant Hoffman. Whether the defendants' constitutional rights might in some possible fashion have been violated is not the determinative factor when deciding whether Officer Millard was \"performing his official duties\" at the time he was murdered. The Legislature has decided that the premeditated first degree murder of a law enforcement officer, who was performing his or her official duties at the time of the act resulting in his or her death, is aggravated murder in the first degree if the slayer knew or reasonably should have known the victim to be such.\u003cspan class=\"fnref\"\u003e71\u003c/span\u003e By its answer to a special interrogatory, the jury unanimously so found in this case.\n\nWhether an officer may have made an incorrect judgment regarding one or more of a suspect's myriad constitutional rights in no way determines whether that officer was killed while doing his or her job, i.e., when \"performing his official duties\". If it did, then anytime an officer infringed upon a\n\nsuspect's rights in any fashion whatsoever, however technical, the officer would have to be considered as not \"performing his official duties\". That is not the law.\n\nAn officer, even if effecting an arrest without probable cause, may still be engaged in \"official duties\", provided the officer is not on a frolic of his or her own, and the officer is entitled to be protected by the law from assault.\u003cspan class=\"fnref\"\u003e72\u003c/span\u003e Cases in which an officer is engaged in a crime of violence upon a citizen are distinguishable from situations wherein an officer may inadvertently infringe upon some constitutional rights of a person. There was no evidence whatsoever in the present case to suggest that at the time in question the officers who were shot were on a frolic of their own unrelated to their proper official duties as tribal police officers.\n\nWe nonetheless have reviewed the correctness of the trial court's decision in this case that the entry onto McGinnis' land was legal because it relates to the issue of whether defendants were entitled to an instruction regarding the right to resist an illegal arrest. We conclude that the trial court was correct in determining that the officers lawfully entered the McGinnis property to arrest defendants McGinnis and Hoffman.\n\nPursuant to RCW 10.31.100, officers may arrest without a warrant if they have probable cause to believe the suspect has committed a felony. When Officers Millard and Dick entered the McGinnis property, they had probable cause to believe McGinnis and Hoffman had committed the felony of attempting to elude a pursuing police vehicle.\u003cspan class=\"fnref\"\u003e73\u003c/span\u003e The officers also had probable cause to believe McGinnis had committed a felonious assault when he had attempted to injure police officers and the ambulance crew during his earlier\n\narrest.\u003cspan class=\"fnref\"\u003e74\u003c/span\u003e It is therefore unnecessary to consider the prosecutor's further arguments that there was also probable cause to arrest for the crime of escape in the second degree or the argument that the arrest warrant for McGinnis was still valid since McGinnis had escaped from custody. Furthermore, the fact that the trial court refused to admit into evidence the outstanding arrest warrant for defendant Hoffman (because of its potential for creating prejudice) did not prohibit the trial court from considering the warrant in making the determination it did regarding the legality of the search for the defendants.\n\n[42] Defendants also argue that even if the police did have probable cause to arrest, their entry onto McGinnis' land violated Payton v. New York, 445 U.S. 573, 63 L. Ed. 2d 639, 100 S. Ct. 1371 (1980). This, too, is incorrect. Payton established that in the absence of exigent circumstances, police may not make a warrantless arrest after a nonconsensual entry into a suspect's home. First, no entry into a residence was ever accomplished or attempted here. Second, even if the officers had searched areas prohibited by Payton, the entry would not be forbidden by Payton because exigent circumstances were present in this case. Federal and state law defines such exigencies: (1) a grave offense, particularly a crime of violence, is involved; (2) the suspect is reasonably believed to be armed; (3) there is reasonably trustworthy information that the suspect is guilty; (4) there is strong reason to believe that the suspect is on the premises; (5) the suspect is likely to escape if not swiftly apprehended; and (6) the entry is made peaceably.\u003cspan class=\"fnref\"\u003e75\u003c/span\u003e All of these elements are present here. This case is factually similar to the Court of Appeals decision in State v. McIntyre, 39 Wash. App. 1, 691 P.2d 587 (1984), review denied, 103 Wash. 2d 1017 (1985), which we specifically approved in\n\nState v. Terrovona, 105 Wash. 2d 632, 644, 716 P.2d 295 (1986).\n\nThe facts in this case show that the defendant McGinnis was dangerous to the police and members of the public. Such a danger has been recognized as one factor relevant to a determination of exigent circumstances justifying a warrantless search and arrest.\u003cspan class=\"fnref\"\u003e76\u003c/span\u003e\n\nIn this regard, the evidence showed as follows. McGinnis was wanted for assault on police officers and others, a serious offense involving violence. The police had good reason to believe that McGinnis was armed. The police also had solid information that McGinnis was guilty of assault and that both Hoffman and McGinnis were guilty of eluding a pursuing police vehicle. There was also good reason to believe that the two suspects were on the McGinnis property since the surveillance officer had seen two individuals walk onto the property at night and disappear. Escape was certainly also a likelihood here since McGinnis had earlier left the hospital (with Hoffman's assistance) despite an attempt by hospital personnel to restrain him; then the pair subsequently engaged in a high speed automobile chase pursued by a police vehicle. Finally, there is also the trial testimony that the officers made a peaceable entry with service revolvers holstered. The trial court did not err in concluding that the arrest of McGinnis and the entry onto his property were lawful.\n\nIssue Seventeen.\n\nConclusion. The accomplice instructions given to the jury correctly declared the law of accomplice liability and did not violate defendants' rights to jury unanimity.\n\nOn the accomplice liability issue, the trial court instructed the jury as follows:\n\nA person who is an accomplice in the commission of a crime is guilty of that crime whether present at the scene or not.\n\nA person is an accomplice in the commission of a crime if, with knowledge that it will promote or facilitate the commission of the crime, he or she either:\n\n(1) solicits, commands, encourages, or requests another person to commit the crime; or\n\n(2) aids or agrees to aid another person in planning or committing the crime.\n\nThe word \"aid\" means all assistance whether given by words, acts, encouragement, support or presence. A person who is present at the scene and ready to assist by his or her presence is aiding in the commission of the crime. However, more than mere presence and knowledge of the criminal activity of another must be shown to establish that a person present is an accomplice.\n\nInstruction 7.\n\nIf you are convinced that both defendants participated in a crime or crimes and that a crime or crimes have been proven beyond a reasonable doubt, you need not determine which defendant was an accomplice and which was a principal.\n\nInstruction 8.\n\n[43] Instruction 7 is very similar to the accomplice instruction given to the jury, which we approved in State v. Mak, 105 Wash. 2d 692, 726, 742, 718 P.2d 407, cert. denied, 479 U.S. 995, 93 L. Ed. 2d 599, 107 S. Ct. 599 (1986). The portion of this instruction to which objection is made is drawn directly from the accomplice statute. Washington courts have on many occasions declared that it is proper for an instruction to incorporate the language of a statute.\u003cspan class=\"fnref\"\u003e77\u003c/span\u003e\n\nDefendant Hoffman argues that the jury must find that he had knowledge of his father's premeditation in order for him to be convicted of murder in the first degree. Hoffman also argues that these instructions improperly allowed the jury to convict for premeditated murder in the first degree without a unanimous decision as to which defendant was the principal and which the accomplice. We have previously decided both of these issues.\n\n[44] The defendant in State v. Guloy, 104 Wash. 2d 412, 413, 705 P.2d 1182 (1985), cert. denied, 475 U.S. 1020, 89 L.\n\nEd. 2d 321, 106 S. Ct. 1208 (1986) argued that in order for him to be convicted of aggravated murder in the first degree the State must prove that the accomplice intended to murder the victim. As we there pointed out, however, the accomplice statute (RCW 9A.08.020(3)(a)) contains no such requirement. Guloy then quoted from State v. Bockman, 37 Wash. App. 474, 491, 682 P.2d 925, review denied, 102 Wash. 2d 1002 (1984):\n\nRCW 9A.08.020(3)(a) states that an accomplice is one who aids a principal: \"[w]ith knowledge that it will promote or facilitate the commission of the crime . . .\" (Italics ours.) The accomplice statute implicitly demonstrates that the State need not prove that the principal and accomplice share the same mental state. There was no error as to the instruction concerning the mental state of the accomplice.\n\nGuloy, 104 Wash. 2d at 431. Other decisions have similarly addressed this issue and have similarly concluded that the accomplice liability statute predicates criminal liability on general knowledge of the crime and not on specific knowledge of the elements of the participant's crime.\u003cspan class=\"fnref\"\u003e78\u003c/span\u003e Accomplice liability represents a legislative decision that one who participates in a crime is guilty as a principal, regardless of the degree of the participation.\u003cspan class=\"fnref\"\u003e79\u003c/span\u003e Additionally, as discussed above, there was substantial evidence in this case from which the jury could reasonably find that each of the defendants premeditated the officer's killing.\n\n[45] Defendants argue that instruction 8 (quoted above) is erroneous as violating their right to jury unanimity. We disagree. We addressed this issue in State v. Carothers, 84 Wash. 2d 256, 525 P.2d 731 (1974) and concluded that it is not necessary that jurors be unanimous as to the manner of an accomplice's and a principal's participation as long as all agree that they did participate in the crime. Carothers held\n\nthat \"it matters not that some jurors may have believed that the petitioner fired the gun, while others may have believed that his only role was in aiding and abetting [the other participant], so long as all twelve agreed that he did participate, . . .\".\u003cspan class=\"fnref\"\u003e80\u003c/span\u003e This court reaffirmed that viewpoint in State v. Davis, 101 Wash. 2d 654, 658, 682 P.2d 883 (1984). The jury in this case need not have decided whether it was Hoffman or McGinnis who actually shot and killed Officer Millard so long as both participated in the crime. The accomplice instructions were not erroneous.\n\nIssue Eighteen.\n\nConclusion. The aggravating circumstance instruction did not allow conviction for murder based solely upon statutory aggravating factors and did not create a mandatory presumption.\n\nDefendants object to the aggravation instruction on two grounds.\n\nDefendants first argue that the instruction allowed conviction for murder in the first degree based only on the elements of aggravation. This is incorrect. Instruction 11 states:\n\nA person commits the crime of Aggravated Murder in the First Degree if he commits the crime of Murder in the First Degree and if the victim was a law enforcement officer who was performing his official duties at the time of the act resulting in death and the victim was known or reasonably should have been known by the defendants to be such at the time of the killing. Aggravation must be proved beyond a reasonable doubt by the state.\n\n(Italics ours.)\n\nThus, the instruction itself makes it entirely clear that the jury had to find both the elements of murder in the first degree and the presence of an aggravating circumstance in order to find the defendants guilty of aggravated murder in the first degree. Additionally, the trial court provided the following verdict form to the jury which underscored that instruction:\n\nWe, the jury, find the Defendant, . . .,\n\n___\n\n(write in Guilty or Not Guilty)\n\nof the crime of MURDER IN THE FIRST DEGREE as charged in Count I of the Information.\n\nSPECIAL INTERROGATORY\n\nAnswer the following question only if you find Defendant . . . guilty of Murder in the First Degree:\n\nHas the State proven beyond a reasonable doubt that Defendant . . . knew or reasonably should have known that Louis A. Millard was a law enforcement officer who was performing his official duties at the time of the killing.\n\n___\n\n(write in \"yes\" or \"no\")\n\n___\n\nPresiding Juror\n\nThe jury answered the special interrogatory in the affirmative as to each defendant.\n\nDefendants also allege that the finding of an aggravating circumstance was erroneously based on an accomplice theory. The record and jury instructions refute this contention. The special interrogatory contained in the verdict form demonstrates that the jury unanimously found the presence of the aggravating circumstance charged. Prosecutorial closing argument was consistent therewith, and the prosecutor told the jury that the State not only had to prove aggravation beyond a reasonable doubt but that the jury had to be unanimous.\n\n[46] Instruction 11, the aggravation instruction, is almost identical to the wording in RCW 10.95.020 and is very similar to the instruction which we approved in State v. Hughes, 106 Wash. 2d 176, 196-97, 721 P.2d 902 (1986). The method which the trial court used in instructing the jury, with the elements of premeditated murder in the first degree being in one instruction and the aggravating factor being in a separate instruction, has been declared by this court to be the \"preferred manner\" of instructing.\u003cspan class=\"fnref\"\u003e81\u003c/span\u003e\n\n[47] Defendants also argue that instruction 11 created an invalid mandatory presumption in violation of State v. Shipp, 93 Wash. 2d 510, 610 P.2d 1322 (1980). This is incorrect. Instruction 12 states:\n\nA person knows or acts knowingly or with knowledge when he or she is aware of a fact, facts or circumstances or result described by law as being a crime.\n\nIf a person has information which would lead a reasonable person in the same situation to believe that facts exist which are described by law as being a crime, the jury is permitted but not required to find that he or she acted with knowledge.\n\n(Italics ours.) Instruction 1 instructed the jury to consider the instructions as a whole. No mandatory presumption was created because the jury was instructed that it was permitted, but not required, to make the inference that defendants acted with knowledge.\u003cspan class=\"fnref\"\u003e82\u003c/span\u003e\n\nIssue Nineteen.\n\nConclusion. The trial court's justifiable homicide and self-defense instructions correctly stated the law and allowed defendants to argue the defense theories to the jury.\n\nDefendants argue that the instructions regarding self-defense and justifiable homicide did not allow them to argue their defense theories to the jury and that the instructions did not tell the jury that for self-defense purposes the circumstances should be viewed as they appeared to the defendants.\n\nThe trial court gave the following instructions to the jury on self-defense.\n\nTo convict a Defendant of the crime of Murder in the First Degree, each of the following elements of the crime must be proved beyond a reasonable doubt:\n\n(1) That on or about the 27th day of August, 1986, the Defendant shot Louis A. Millard;\n\n(2) That the Defendant acted with intent to cause the death of Louis A. Millard;\n\n(3) That the intent to cause the death was premeditated;\n\n(4) That Louis A. Millard died as a result of Defendant's acts; and\n\n(5) That the acts occurred in Okanogan County, Washington.\n\nIf you find from the evidence that each of these elements has been proved beyond a reasonable doubt, then it will be your duty to return a verdict of guilty.\n\nOn the other hand, if, after weighing all of the evidence, you have a reasonable doubt as to any one of these elements, then it will be your duty to return a verdict of not guilty.\n\nInstruction 16.\n\nIt is a defense to a charge of murder that the homicide was justifiable as defined in this instruction.\n\nHomicide is justifiable when committed in the lawful defense of a slayer or any person in a slayer's presence or company when a slayer reasonably believes that the person slain intends to inflict death or great personal injury and there is imminent danger of such harm being accomplished.\n\nA slayer may employ such force and means as a reasonably prudent person would use under the same or similar conditions as they appeared to a slayer taking into consideration all of the facts and circumstances known to him at the time of and prior to the incident.\n\nThe State has the burden of proving beyond a reasonable doubt that the homicide was not justifiable.\n\nInstruction 17.\n\nNo person may, by any intentional act reasonably likely to provide a belligerent response, create a necessity for acting in self-defense or defense of another and thereupon kill or use, offer, or attempt to use force upon or toward another person. Therefore, if you find beyond a reasonable doubt that the defendant was the aggressor, and the defendant's acts and conduct provoked or commenced the fight, then self-defense or defense of another is not available as a defense.\n\nOne who acts in defense of another, reasonably believing the other to be the innocent party and in danger, is justified in using force necessary to protect that person even if, in fact, the person whom the actor is defending is the aggressor.\n\nInstruction 19.\n\nNecessary means that no reasonably effective alternative to the use of force appeared to exist and that the amount of force used was reasonable to effect the lawful purpose intended, under the circumstances as they reasonably appeared to the actor at the time.\n\nInstruction 20.\n\nIt is a defense to a charge of assault in the first degree that the force was lawful as defined in this instruction.\n\nThe use of force upon or toward the person of another is lawful when used by a person who reasonably believes that he is about to be injured or by someone lawfully aiding a person who he reasonably believes is about to be injured in preventing or attempting to prevent an offense against the person and when the force is not more than is necessary.\n\nThe person using the force may employ such force and means as a reasonably prudent person would use under the same or similar conditions as they appeared to the person, taking into consideration all of the facts and circumstances known to the person at the time of and prior to the incident.\n\nThe State has the burden of proving beyond a reasonable doubt that the force used by the defendant was not lawful.\n\nInstruction 25.\n\n[48, 49] Specifically, defendants argue that the self-defense instructions must be part of the \"to convict\" instruction which sets forth the elements of the crime of murder in the first degree. We disagree. As emphasized above, the jury was instructed to consider the instructions as a whole. No prejudicial error occurs when the instructions taken as a whole properly instruct the jury on the applicable law.\u003cspan class=\"fnref\"\u003e83\u003c/span\u003e The self-defense instructions properly informed the jury that the State bore the burden of proving the absence of self-defense beyond a reasonable doubt.\u003cspan class=\"fnref\"\u003e84\u003c/span\u003e In giving a separate instruction on self-defense, which included the State's burden of proof on self-defense, the trial court followed the method for instructing juries recommended by the Washington Supreme Court Committee on Jury Instructions, 11 Wash. Prac., Washington Pattern Jury Instructions 58-63 (Supp. 1986); WPIC 26.02 comment, at 111 (Supp. 1986); WPIC 35.02 comment, at 119 (Supp. 1986). We perceive no error in this instructional mode.\n\nDefendants also argue that the self-defense instructions did not sufficiently apprise the jury that it must view the circumstances as they appeared to the defendants. That is not correct. It is, of course, well settled that the justification for self-defense must be evaluated from a defendant's point of view as conditions appeared to the defendant at the time of the act.\u003cspan class=\"fnref\"\u003e85\u003c/span\u003e That is precisely what the instructions in this case informed the jury. Instruction 17 stated: \"A slayer may employ such force and means as a reasonably prudent person would use under the same or similar conditions as they appeared to the slayer taking into consideration all of the facts and circumstances known to him at the time of and prior to the incident.\" (Italics ours.) This is almost the precise language suggested by this court in State v. Allery, 101 Wash. 2d 591, 595, 682 P.2d 312 (1984). Self-defense in this state includes the essential element that the person using the force must reasonably believe that he or she is in danger.\u003cspan class=\"fnref\"\u003e86\u003c/span\u003e\n\nThe briefs and record herein show that the argument defendants wanted to make was that the police had provoked the event and that the defendants were therefore justified in shooting the officers. Any such theory could be, and was, argued under the self-defense and justifiable homicide instructions given to the jury.\n\n[50-52] Defendants also argue that certain of their proposed instructions were erroneously rejected. The applicable law is clear. A trial court is not required to give an\n\ninstruction which is erroneous in any respect;\u003cspan class=\"fnref\"\u003e87\u003c/span\u003e it is not error to refuse to give an instruction if the subject is adequately addressed in another instruction which is given;\u003cspan class=\"fnref\"\u003e88\u003c/span\u003e a party is entitled to an instruction where there is evidence to support it; and it is error to give an instruction which is not supported by the evidence.\u003cspan class=\"fnref\"\u003e89\u003c/span\u003e\n\nWe have carefully reviewed the defendants' proposed but rejected instructions, which are complained of on appeal. We conclude that they either contained erroneous statements of the law, were not supported by the evidence or were redundant because the instructions given by the trial court covered the issues in question.\n\nWe conclude that the trial court did not err in refusing defendants' proposed instructions and that the instructions given adequately stated the correct law and allowed both defendants to argue their theories of the case.\n\nIssue Twenty.\n\nConclusion. No error was committed when the trial court acquiesced in the defendants' decisions to refuse lesser included offense instructions.\n\n[53] The defendant Hoffman argues that the trial court erred in failing to instruct on the lesser included offenses within murder in the first degree. We are here asked to hold that trial courts must sua sponte instruct on all lesser included offenses over the express objections of the defendants. That is not the law of this state, and we decline to so rule. Generally, the failure to give a particular instruction is not error when no request was made for such\n\nan instruction;\u003cspan class=\"fnref\"\u003e90\u003c/span\u003e nor are lesser included offense instructions required when not requested.\u003cspan class=\"fnref\"\u003e91\u003c/span\u003e\n\nHere, not only did the defendants fail to request any lesser included offense instructions, but they personally, as well as through their attorneys, stated their objections to the giving of any such instructions. The trial court, on the record, discussed lesser included offense instructions, informed the defendants of the specific penalties for such crimes as compared to the crimes charged and instructed on, and ordered defense counsel to again discuss the matter with their clients over a weekend recess of the trial. When trial resumed, the trial court asked each of the defendants and each attorney whether this matter had been fully discussed and whether they still objected to the giving of lesser included offense jury instructions. Each defendant and each defendant's attorney responded that they did not want such instructions to be given to the jury. Then in closing argument, defense counsel argued to the jury that murder in the second degree and manslaughter had not been charged and that the elements of the crimes that were charged had not been proved.\n\nHad the jury decided (as the defendants strenuously argued) that the evidence did not prove the charges of murder in the first degree and assault in the first degree beyond a reasonable doubt, then under the instructions given, the defendants would have been acquitted. The defendants cannot have it both ways; having decided to follow one course at the trial, they cannot on appeal now change their course and complain that their gamble did not pay off. Defendants' decision to not have included offense instructions given was clearly a calculated defense trial tactic and, as we have held in analogous situations, it was not\n\nerror for the trial court to not give instructions that the defendant objected to.\u003cspan class=\"fnref\"\u003e92\u003c/span\u003e Defendants knowingly waived any rights they had to included offense instructions, and did so after their rights were clearly and carefully explained to them by the trial court and after they had fully consulted on the matter with defense counsel.\n\nThe trial court did not err in permitting defendants to pursue their chosen trial strategy.\n\nWe do not reach some of the defendants' remaining arguments because they are precluded by other conclusions we have reached herein. As to the rest of defendants' numerous arguments, we have reviewed each of them and conclude that they are nonmeritorious. Our review of the lengthy record and extensive briefs in this case discloses no reversible error.\n\nThe defendants' convictions are affirmed.\n\nDisposition\n\nHolding that the State had criminal jurisdiction over the Indian reservation; that the trial court did not abuse its discretion in denying the defendants' motions for a change of venue and for severance; that the defendants' speedy trial and equal protection rights were not violated; that the State's failure to disclose evidence did not prejudice the defendants; that there was sufficient evidence that the killing was intentional, premeditated, and committed with knowledge that the victim was a law enforcement officer; that photographs of the murder victim and evidence regarding guns were admissible; that the defendants were not entitled to have a psychiatrist examine a State witness or to have an expert witness on the subject of police procedures appointed; that no prejudicial prosecutorial misconduct occurred; that an instruction identifying the homicide victim as a law enforcement officer constituted harmless error; that the lawfulness of the police conduct was a decision for the trial court; that a questioned arrest of one of the defendants was valid; that the trial court had correctly instructed the jury as to accomplice liability, aggravating circumstances, justifiable homicide, and self-defense; and that the trial court did not err in acquiescing in the defendants' decisions to refuse lesser included offense instructions, the court affirms the judgment.\n\nDore, J. (dissenting)\n\nI dissent. The defendants did not receive a fair trial. The trial court's instructions to the jury improperly instructed the jury regarding an issue of fact. The instructions undermined a defense asserted by defendants, violating article 1, section 22 (amendment 10) and article 4, section 16 of the state constitution. The jury instructions also directed a verdict on aggravation. The issue of aggravation is a jury question and the instructions given removed that factual issue from the jury in violation of defendants' rights of due process, guaranteed by the Fourteenth Amendment. Those constitutional errors were prejudicial. I would reverse and remand for a new trial.\n\nFacts\n\nElmer McGinnis and his son, Patrick Hoffman, are members of the Colville Indian Tribe and, at the time of\n\nthe incidents herein, resided on the Colville Indian Reservation. McGinnis had a stormy relationship with the tribal management. He believed that the Colville Tribe Business Council was corrupt and he attempted to document abuses and misuses of tribal funds. McGinnis often appeared at community meetings where he questioned tribal business council members regarding their business practices. McGinnis contacted tribal council members and the police almost on a daily basis.\n\nMcGinnis was suffering from a personality disorder, diagnosed as paranoid type. McGinnis became convinced that the Tribe was trying to silence him and had placed a bounty on him and Hoffman. McGinnis, concerned for his safety, told tribal police Chief Harry Smiskin that he knew that there were tribal council bounties on himself and Hoffman, and that he had begun to arm himself for protection.\n\nDuring the summer of 1986, McGinnis became embroiled in a dispute with a neighbor, Don Ferguson, over payment for a motorcycle sold by the McGinnis family to the Fergusons. Ferguson complained to tribal authorities concerning what he considered a trespass by McGinnis to demand payment. Subsequently, the tribal prosecutor filed a criminal complaint in Tribal Court alleging Trespass Lands, a class C offense under the Tribal Code. The summons was sent by certified mail to McGinnis' post office box and directed him to appear on August 29, 1986, at 9:30 a.m. On August 21, 1986, the certified mailing was returned marked \"Refused.\" The tribal prosecutor then obtained a bench warrant for McGinnis' arrest based on McGinnis' refusal of the summons, alleged new threats made by McGinnis, and the possession of weapons by McGinnis.\n\nOn August 25, 1986, McGinnis appeared at tribal council headquarters in Nespelem. Tribal council member, Dale Kohler, aware of the bench warrant issued for McGinnis, alerted police Chief Smiskin of McGinnis' presence. Two uniformed police officers arrived to arrest McGinnis on the warrant. Shortly thereafter Chief Smiskin arrived with the\n\nactual warrant. McGinnis asked to see the warrant which he then crumpled and tossed to the floor asserting that the police lacked jurisdiction over him. A scuffle broke out as the police attempted to arrest McGinnis. During the altercation McGinnis was knocked to the floor. He began to complain of chest pains and an ambulance was called.\n\nMcGinnis was initially examined at the Tribal Health Clinic and then was transported to Coulee Community Hospital for further diagnosis. After his examination, McGinnis was released to the tribal police who took him to Okanogan County Jail because of his possible health problems and because of security concerns at the minimum security tribal jail. McGinnis was booked at the Okanogan County Jail on a \"Tribal hold\" in reference to the warrant and on additional charges of resisting arrest and assaulting an officer. Later that evening, McGinnis again appeared to be experiencing medical problems. At 11 p.m. he was taken by ambulance to Mid-Valley Hospital in Omak.\n\nAt the hospital, McGinnis was transferred back to tribal custody because the County did not have the personnel to watch him. The tribal police did not place a guard with McGinnis as he was attached to a heart monitor which would sound an alarm if disconnected and the hospital also had a separate alarm connected to the sheriff's office.\n\nMcGinnis was unexpectedly discharged by the attending physician at 7 p.m. on the following day, August 26. Hospital personnel contacted county and tribal authorities, but received no definite instructions until McGinnis was dressed and preparing to leave the hospital in the company of Hoffman and four of McGinnis' daughters, Lila, Elsie, and Laura McGinnis and Frances Peoples. Susan Peterson, a nurse, attempted to keep McGinnis at the hospital until the police arrived. McGinnis left the hospital with his family. The family, with Hoffman driving, left in Lila McGinnis' car, and headed to Elmer McGinnis' home in Nespelem.\n\nTribal police arrived at the hospital after McGinnis and his children departed. They obtained a description of the\n\ncar carrying McGinnis. A tribal police officer spotted the car 10 miles outside Nespelem traveling in the opposite direction. The police car turned around and followed them. The patrol car, with its rotating blue and red lights turned on, pursued the McGinnis automobile coming within 100 yards of it. Concerned that his children might be hurt, McGinnis demanded to be let out of the car. Wanting to avoid a confrontation with the police, Hoffman turned off the main road and stopped the car.\n\nHoffman and McGinnis then set out on foot toward McGinnis' home, a distance of 6 to 8 miles in mountainous terrain. Before leaving the car, Hoffman removed a gym bag from the trunk of the car which contained a tee shirt, stocking cap, a .45 caliber semiautomatic handgun, a .22 caliber revolver, a 9 mm. semiautomatic handgun, ammunition for the handguns, a marine flare kit, a hunting knife, a can of mace and a set of nunchucka sticks. Hoffman and others testified that it was his habit to carry these weapons at all times. Hoffman held a permit to carry a concealed weapon. He also filed a State Firearms Application when he purchased the 9 mm. semiautomatic handgun.\n\nAfter losing sight of the McGinnis vehicle on the road, the tribal police conducted a search for McGinnis. McGinnis' daughters, who had returned to the main highway, were stopped by the police. Discovering that McGinnis and Hoffman were on foot, the police assumed that they were headed for home. After failing to locate McGinnis and Hoffman, Chief Smiskin discontinued the search until morning and placed the McGinnis property under surveillance.\n\nAt approximately 1:38 a.m., August 27, Officer Phillips was conducting surveillance and observed two individuals he could not identify enter the property. Officer Phillips radioed for assistance. Five marked patrol cars responded and arrived at the scene within 15 minutes. The officers did not employ emergency lights or sirens as they arrived. An emergency rescue truck also responded. The officers used\n\ntheir patrol headlights and spotlights and the three searchlights of the rescue truck to conduct an open view search of the property. The floodlights were employed in that fashion for approximately 15 minutes.\n\nUpon arriving home, Hoffman and McGinnis found themselves locked out of the house as the only key was in the possession of one of McGinnis' daughters. Hoffman and McGinnis, noticing the floodlights being shined on the property, retreated behind the chicken coop in hopes of avoiding a confrontation with the officers.\n\nOfficers John Dick and Louis Millard crossed a fence surrounding the McGinnis property and approached the main house and chicken coop. The headlights, spotlights, and searchlights had been turned off and Officers Dick and Millard approached using police flashlights. At no time did the officers announce themselves as police officers nor was an announcement of their identification or intention ever communicated. Once the lights were dimmed, police officers at the scene testified that the property was in total darkness; they could not clearly distinguish the terrain; they could not distinguish other officers nor their location on the property; and that it was too dark to see the police uniforms and markings on the police vehicles. Officer Dick stated that he did not know whether, in the dark, the people on the property could see the intruders were police officers.\n\nQ. . . . [D]id it occur to you . . . that if there were people on the property that they would not know that you were police officers?\n\nA. I don't know if they could see in the dark . . .\".\n\nReport of Proceedings vol. VII, at 93 (Mar. 6, 1987). The visibility was so poor that the police requested a special night scope be brought to the property, but an officer did not bring the scope to the site until after the exchange of gunfire occurred.\n\nA gun battle ensued. Who fired the first shot is disputed, but after the first shots were fired, gunfire from the chicken\n\ncoop continued and a series of flares were fired, illuminating the area. Officers Dick and Millard returned fire and attempted to seek cover.\n\nOfficer Millard was struck by a 9 mm. bullet in the upper left chest and died within 15 minutes. Hoffman admitted firing the .22 revolver and a flare gun from behind the chicken coop where the guns themselves were later discovered. Two ejected 9 mm. cartridges were found in the same vicinity. Officer Dick was wounded in the shoulder. The bullet which struck Dick was never found, but the entry wound was large, consistent with a .45 round rather than the smaller .22 or 9 mm.\n\nA wounded McGinnis was discovered by police at daybreak near the scene. One of the shots fired by Officer Dick had struck McGinnis in the chest. The police took McGinnis into custody. Hoffman escaped and appeared 2 days later at the home of a friend, Jeff Epperson, near Keller, Washington. Hoffman later voluntarily surrendered.\n\nHoffman and McGinnis were originally charged by federal authorities with violations of 18 U.S.C. § 1111 (first degree murder) and 18 U.S.C. § 1114 (attempted murder of a federal official). That indictment was later dismissed without prejudice, and the defendants were charged by information in Okanogan County Superior Court with aggravated first degree murder and first degree assault. Defense motions for change of venue, severance, the appointment of an expert on police procedures and for the appointment of a psychiatric expert to examine Officer Dick were denied by the trial court. Both defendants were convicted by a jury of aggravated first degree murder and sentenced to life in prison without possibility of parole.\n\nDefendants appealed their convictions to Division Three of the Court of Appeals. That court certified the case to this court to answer the question of whether the State of Washington has jurisdiction over Indian defendants accused of assault and murder committed on Indian lands. This court accepted certification of the case in its entirety.\n\nThe Trial Court Improperly Instructed the Jury Regarding Issues of Fact\n\nIt is a question of fact for the jury as to whether the defendants knew or should have known that the individuals with whom they exchanged gunfire were police officers. The trial court completely removed that factual issue from the jury through three instructions:\n\nInstruction No. 26:\n\nThe arrest of Elmer McGinnis on August 25, 1986 was a lawful arrest.\n\nInstruction No. 27:\n\nLouis A. Millard and John Dick were law enforcement officers on August 27, 1986.\n\nInstruction No. 28:\n\nThe entry by police officers onto the McGinnis property at about 2:15 a.m. on August 27, 1986 was lawful.\n\nClerk's Papers, at 1150, 1149, 1148. In addition, instruction 1 told the jury that\n\n[i]t also is your duty to accept the law from the court, regardless of what you personally believe the law is or ought to be. You are to apply the law to the facts and in this way decide the case.\n\nClerk's Papers, at 1178. The trial court's instructions 26, 27 and 28 stated that those facts existed as a matter of law and the jury was bound to accept those conclusions as the law of the case.\n\nThe conclusions of law stated in the trial court's instructions undermined the defense put forth by the defendants, resulting in the defendants receiving an unfair trial. The defendants asserted a defense of justifiable homicide. Instruction 17 stated:\n\nHomicide is justifiable when committed in the lawful defense of a slayer or any person in a slayer's presence or company when a slayer reasonably believes that the person slain intends to inflict death or great personal injury and there is imminent danger of such harm being accomplished.\n\n(Italics mine.) Clerk's Papers, at 1159. After entering the McGinnis property the officers did not identify themselves\n\nto the defendants as police officers. The defendants undisputedly argue that because it was dark and the police never identified themselves, they did not know who these intruders were. They further testified that they fired their guns in self-defense after the intruders fired the first shots. There is no evidence or inference of evidence on this fact to the contrary.\n\nThe trial court specifically instructed the jury that Millard and Dick were police officers and that they were lawfully on the McGinnis property at the time of the killing. By directing the jury that those facts existed as a matter of law, the trial court precluded the jury from finding that the defendants could have reasonably believed that the person slain intended to inflict death or great bodily harm upon them. Had the defendants been aware that the intruders were police officers, then defendants could not assert that they \"reasonably believed\" that the police intended to kill or injure them. Absent the court's instructions, a reasonable juror could have concluded that the defendants reasonably believed unknown intruders intended to kill or harm them and that the defendants acted in self-defense.\n\nThe defendants' assertion that they did not know that the intruders were police officers is plausible in view of the fact that the police did not identify themselves as they approached the McGinnis home. The incident occurred at approximately 1:38 a.m. in what one police officer described as total darkness.\n\nA. [E]verything was all total dark at that time . . . . I could see no further than twenty, thirty feet . . . it was all black.\n\nReport of Proceedings vol. XIII, at 189 (Mar. 16, 1987) (testimony of Officer Carden). A reasonable juror could have determined that in these circumstances the defendants believed that the intruders were not police officers but were other individuals, attempting to inflict bodily harm. The trial court's instructions precluded the jury from considering that alternative and accepting or rejecting it.\n\nThe Trial Court's Instructions to the Jury Violated Defendants' Constitutional Rights\n\nThe trial court's instructions improperly removed issues of fact from jury determination and undermined the defense asserted by the defendants resulting in a violation of defendants' constitutional rights. The trial court's instructions violated the Washington Constitution article 1, section 22 (amendment 10) guaranteeing the right to a jury trial and article 4, section 16 which provides specifically that \"Judges shall not charge juries with respect to matters of fact . . .\". The trial court's instructions constituted legal conclusions. By definitively stating that those facts were proven, the trial court relieved the jury of its duties as trier of fact.\n\nThe defendant is entitled to argue his theory of the case based on the evidence presented. Even where the evidence is overwhelming, article 1, section 22 (amendment 10) bars instructing the jury that a fact or element has been established as a matter of law. State v. Primrose, 32 Wash. App. 1, 3, 645 P.2d 714 (1982). In simply stating the legal conclusions contained in instructions 26, 27 and 28 the court wrongly performed the jury's function. A new trial is mandated on this issue alone.\n\nThe Trial Court Improperly Directed a Verdict on Aggravation\n\nThe instructions directed a verdict on issues which were for the jury, in violation of the defendants' rights to due process as guaranteed under the Fourteenth Amendment. The instructions in question related to the charge of aggravating circumstances. The category of aggravation with which the State charged Hoffman and McGinnis consists of three elements:\n\nThe victim was a law enforcement officer . . . who was performing his or her official duties at the time of the act resulting in death and the victim was known or reasonably should have been known by the person to be such at the time of the killing[.]\n\nRCW 10.95.020(1). The trial court's instructions directed a verdict on two of these three elements. Instruction 27 explicitly required the jury to find that Millard's status as a law enforcement officer had been proven. Instructions 26 and 28 further limited the jury's power to make an independent determination by directing a finding against the defendants on two theories they advanced against the contention that Millard was engaged in \"official duties.\" The defendants had argued that Millard was not making a valid arrest of Hoffman and/or McGinnis at the time he was killed and that Millard was engaged in an illegal search at the time he was killed.\n\nThe instructions state legal conclusions which on the surface seem clear and unambiguous. However, it is important to keep in mind that those conclusions result from applying the law to the facts, a function which is for the jury to determine, not the court. More important, the underlying facts were vigorously disputed.\n\nFor example, the defendants argued that Millard could not have been engaged in official duties because he was making an invalid arrest at the time of his death. In order to arrest Hoffman and/or McGinnis, the tribal police required either a warrant or an exception to the warrant requirement. Defendants argue that the officers had neither.\n\nA warrant had been obtained for the arrest of McGinnis. If that warrant had already been executed and McGinnis had been released from custody, as a result of due process of law, however, it could not provide authority for a subsequent rearrest. See Carlson v. Landon, 342 U.S. 524, 546, 96 L. Ed. 547, 72 S. Ct. 525 (1952). Whether or not McGinnis had been released from custody turned on the nature of his hospital stay and the circumstances under which he was released. The defendants contended that McGinnis was discharged from custody because neither the County nor the tribal police posted a guard at his door. The State argued that McGinnis had not been released from custody because the police took steps to ensure that they received\n\nnotice of his leaving the hospital and because McGinnis' attorney had been told McGinnis was still in custody. Whether McGinnis was an escapee, so that a warrant was in force and Millard was engaged in official duties at the time of his death, depends on how these factual issues are resolved. Cf. Roberts v. State, 14 Mo. 138, 146, 147 (1851). The trial court substantially prejudiced the defendants when it took this issue from the jury because it precluded proper resolution of these factual issues by the trier of fact.\n\nThe question whether a warrantless arrest might have been proper, again bringing Millard within the scope of official duties for aggravation purposes, turns on many of the same disputed facts. In order to make a valid warrantless arrest of either Hoffman or McGinnis, the case must fall within the terms of RCW 10.31.100. That statute authorizes warrantless arrests where there is probable cause to believe a suspect has committed a felony, where a misdemeanor is committed in the officer's presence and for certain other specified misdemeanors and traffic offenses.\n\nThe State argues that McGinnis committed second degree escape, a felony justifying a warrantless arrest. Second degree escape, however, involves escape from a \"detention facility\" by one who has been \"charged\" with a felony. RCW 9A.76.120(1)(a). The State contends that McGinnis need not have been formally charged with a felony, but even if this court accepted that contention, whether the hospital was, for present purposes, a detention facility is a question of fact. The State also argues that there was probable cause to believe that McGinnis had committed third degree escape, which involves only escape from custody. RCW 9A.76.130(1). Again, however, whether McGinnis was in custody while in the hospital is disputed. Furthermore, third degree escape is only a gross misdemeanor that would not justify a warrantless arrest under RCW 10.31.100 unless it involved physical harm or the threat of physical harm. The State relies on previous threats that McGinnis allegedly made against the Ferguson family in support of this argument. However, those threats and whether they were\n\nsufficiently connected with the alleged escape are disputed factual issues.\u003cspan class=\"fnref\"\u003e93\u003c/span\u003e The question of whether a warrantless arrest was possible, and whether Officer Millard was accordingly engaged in official duties at the time of his death, therefore, were questions for the jury. The defendants were prejudiced by the court's instructions, which foreclosed the jury's deliberations on these issues.\n\nThe defendants also argued that Millard was not engaged in official duties for aggravation purposes because he had made an illegal entry onto the McGinnis property. Payton v. New York, 445 U.S. 573, 63 L. Ed. 2d 639, 100 S. Ct. 1371 (1980) holds that police may not make a warrantless arrest on private property without a warrant or consent authorizing their presence. Payton contains an express exception for arrests made under exigent circumstances, which this court elaborated in State v. Terrovona, 105 Wash. 2d 632, 644, 716 P.2d 295 (1986).\n\nDorman [ v. United States, 435 F.2d 385 (D.C. Cir. 1970)] enumerates six elements to aid in determining when a warrantless police entry into a home is justified: (1) a grave offense, particularly a crime of violence, is involved; (2) the suspect is reasonably believed to be armed; (3) there is reasonably trustworthy information that the suspect is guilty; (4) there is strong reason to believe that the suspect is on the premises; (5) the suspect is likely to escape if not swiftly apprehended; and (6) the entry is made peaceably. Dorman, at 392-93.\n\nArguably, Officer Millard was operating under exigent circumstances in attempting to discover and arrest Hoffman and McGinnis. McGinnis was wanted for assault on police officers, a grave offense involving violence. The police suspected Hoffman and McGinnis to be well armed, and in fact believed that the bulk of their arsenal was at the McGinnis home. There was reason to believe that McGinnis was guilty of third degree assault and that Hoffman and/or\n\nMcGinnis was guilty of eluding a police vehicle, since those crimes were committed in the presence of police officers. There was reason to believe Hoffman and McGinnis were on the property since the two men were known to be at large and could be expected to try to return home and since two persons had been observed walking onto the McGinnis property by Officer Phillips. The suspects were likely to escape since McGinnis had already escaped from the hospital with Hoffman's assistance and Hoffman and McGinnis had eluded a police vehicle earlier in the day. Finally, there was evidence that Dick and Millard made a peaceable entry, with their service revolvers holstered. All of these questions, however, are factual questions. Whether or not exigent circumstances were present in this case is the issue that a jury, not the court, must decide.\n\nEven Millard's status as a law enforcement officer, which was not as hotly contested, was nevertheless a factual issue. In order to meet its burden on aggravation, the State was required to present evidence of Millard's commissions or the testimony of superiors. That evidence was introduced. If the question before this court were the sufficiency of the evidence to support the jury's determination, there would be no difficulty answering it. The problem is that by instructing the jury that Millard was a police officer, the trial court obviated any question of sufficiency by taking the question out of the jury's hands altogether. In doing so, as explained below, the trial court denied the defendants due process.\n\nIf aggravation were an element of the crime charged here, I would have no difficulty in holding that the defendants' rights had been violated by these instructions. It is well established that a trial court may not direct a verdict on an element of the crime charged, because to do so violates the defendant's right to a jury trial, a right guaranteed by the state and federal constitutions. Washington Const. art. 1, § 22 (amend. 10); U.S. Const. amend. 6; State v. Christiansen, 161 Wash. 530, 297 P. 151 (1931); United States v. Martin Linen Supply Co., 430 U.S. 564, 51 L. Ed. 2d 642,\n\n97 S. Ct. 1349 (1977). However, the actual question before us is somewhat more complicated.\n\nThe aggravating factors of RCW 10.95.020 are not, properly speaking, elements of a crime. As this court explained in State v. Kincaid, 103 Wash. 2d 304, 692 P.2d 823 (1985), they relate only to sentencing, not to the substance of the crime:\n\nA statutory aggravating circumstance relates to the crime of premeditated murder in the first degree as a defendant being armed with a deadly weapon relates to the commission of certain felonies while so armed. In the statutory framework in which the statutory aggravating circumstances now exist, they are not elements of a crime but are \"aggravation of penalty\" provisions which provide for an increased penalty where the circumstances of the crime aggravate the gravity of the offense. . . .\n\nConceptually, the crime is premeditated murder in the first degree with aggravating circumstances. Commonly, however, the crime is often referred to by the courts and others as \"aggravated first degree murder\".\n\n(Footnote omitted.) Kincaid, at 312. Accord, State v. Irizarry, 111 Wash. 2d 591, 763 P.2d 432 (1988). This distinction between the elements of a crime and penalty factors is critically important where a defendant claims a right to a jury determination. There is no Sixth Amendment right to a jury trial on penalty factors. Spaziano v. Florida, 468 U.S. 447, 82 L. Ed. 2d 340, 104 S. Ct. 3154 (1984). This court has also held under Const. art. 1, § 22 (amend. 10) that the state jury right extends only to issues of fact which determine guilt or innocence. State v. Price, 59 Wash. 2d 788, 370 P.2d 979 (1962). Even if this court were inclined to do so, this is not a proper case in which to formulate a separate state constitutional rule. See State v. Gunwall, 106 Wash. 2d 54, 61-62, 720 P.2d 808, 76 A.L.R.4th 517 (1986). The jury instructions at issue here, thus, did not violate Hoffman or McGinnis' constitutional rights.\n\nThe fact that the Sixth Amendment and Const. art. 1, § 22 (amend. 10) are inapplicable does not end the inquiry, however. Where a state has provided by statute for a jury determination on a sentencing issue, it is a violation of due\n\nprocess to deprive the defendant of that statutory jury right. Hicks v. Oklahoma, 447 U.S. 343, 65 L. Ed. 2d 175, 100 S. Ct. 2227 (1980). In Hicks, a trial court instructed the jury that, if it found the defendant guilty, it should impose a sentence of 40 years' imprisonment. Oklahoma law, however, provides that punishment shall be fixed by a jury. Okla. Stat. tit. 22, § 926 (1971). The Supreme Court vacated the Oklahoma sentence on the ground that the Fourteenth Amendment's due process clause is violated where a defendant is deprived of a statutory right to a jury determination.\n\nIt is argued that all that is involved in this case is the denial of a procedural right of exclusively state concern. Where, however, a State has provided for the imposition of criminal punishment in the discretion of the trial jury, it is not correct to say that the defendant's interest in the exercise of that discretion is merely a matter of state procedural law. The defendant in such a case has a substantial and legitimate expectation that he will be deprived of his liberty only to the extent determined by the jury in the exercise of its statutory discretion, and that liberty interest is one that the Fourteenth Amendment preserves against arbitrary deprivation by the State.\n\n(Citation omitted.) Hicks, at 346.\n\nThe question, then, is whether the question of aggravating circumstances under RCW 10.95.020 is for the jury to decide. If it is, then Hoffman and McGinnis were deprived of a statutory jury right in violation of due process. I would hold that aggravation is a jury question and that the defendants' rights to a fair trial were violated.\n\nThere is no question that aggravating circumstances is a jury question, even though RCW 10.95.020 does not expressly state that it is. To see why, it is helpful to view the section in the context of RCW 10.95 as a whole. As this court outlined the procedure in Kincaid :\n\nThe statute [RCW 10.95] provides for a bifurcated procedure. At the first, the guilt phase of the trial, it is determined whether the defendant is guilty of premeditated murder in the first degree, and, if so, it is then determined whether one or more of the statutory aggravating circumstances exist. If the death penalty has not been asked (as in this case), the defendant who is found guilty of premeditated murder in the first\n\ndegree where one or more aggravating circumstances exist, is sentenced to life imprisonment without possibility of parole; but, if the death penalty is sought, the trial then shifts into a separate capital sentencing phase where it is determined whether there are sufficient mitigating circumstances to merit leniency and, if not, the death penalty is imposed.\n\n(Footnote omitted.) Kincaid, at 310. In the second, capital sentencing phase, the issue is whether or not sufficient mitigating facts exist to justify not imposing the death penalty. This question is for the jury, and the verdict must be unanimous. RCW 10.95.050(2); 10.95.060(4).\n\nIn the context of this scheme, it is clear that the decision on aggravating factors under RCW 10.95.020 is a question for the jury. Both the elements of the substantive criminal charge and the presence or absence of mitigating factors are jury questions. It is unlikely that the Legislature intended the question of aggravating factors to be plucked from the middle of this process and decided separately by the trial court. In fact, the statute requires that aggravation is to be determined at the first, guilt phase of the trial. This court has noted before that this is an unusual feature of RCW 10.95, since other states decide the question of aggravating circumstances separately, in the second, sentencing phase. State v. Bartholomew, 98 Wash. 2d 173, 189-90, 654 P.2d 1170 (1982) (Bartholomew I), State's cert. granted, judgment vacated and remanded, 463 U.S. 1203, defendant's cert. denied, 463 U.S. 1212 (1983), conviction aff'd on remand, 101 Wash. 2d 631, 683 P.2d 1079 (1984) (Bartholomew II). I would conclude that the Legislature included the question of aggravation in the guilt phase for a reason: because it wanted aggravating circumstances to be determined in the same manner, by the same body, as the substantive questions decided at the guilt phase; that is, by the jury.\n\nThis conclusion is bolstered by other language in Bartholomew I, the case in which this court upheld the relevant portion of RCW 10.95 against a constitutional\n\nchallenge.\u003cspan class=\"fnref\"\u003e94\u003c/span\u003e In summarizing our reasoning there, this court wrote:\n\nIn sum, the Washington statute shares the principal features of the approved schemes: Capital crimes are limited to premeditated murder; the death sentence may not be imposed unless additional aggravating factors are found by the jury ; sentencing is considered at a separate phase of the trial at which the sentencer may consider a variety of factors in addition to the crime itself in determining whether or not to impose death; and each death sentence is subject to an elaborate automatic review procedure which brings it under the scrutiny of this court. The Washington procedure therefore conforms in broad outline to approved schemes.\n\n(Italics mine.) Bartholomew I, at 192. It has always been this court's understanding that aggravating circumstances under RCW 10.95.020 is a jury question. I see no reason to depart from that understanding.\n\nGiven that Hoffman and McGinnis had a statutory right to have aggravation determined by the jury, it was a violation of due process to deprive them of that right. The instructions at issue here are directly comparable to the improper instruction in Hicks. Even though aggravation is a penalty factor rather than an element of a crime, Hoffman and McGinnis have been unconstitutionally deprived of a jury determination. The record demonstrates that Hoffman and McGinnis were prejudiced by the instructions since central facts of the case which relate to aggravation were hotly contested. A new trial is required.\n\nThe State argues that instructions 26, 27 and 28 were given because the questions presented were too complex.\n\nThis argument has some appeal, as our own discussion of the disputed facts in relation to the question of aggravation may indicate. The search and arrest issues relate to the scope of the officers' authority, which relates to their acting within \"official duties\" which relates to the question of aggravation. However, it is well established that the complexity of legal issues cannot be used to deprive a civil defendant of his right to a jury determination under Const. art. 1, § 21. Peters v. Dulien Steel Prods., Inc., 39 Wash. 2d 889, 239 P.2d 1055 (1952). The same conclusion surely follows where a criminal defendant is guaranteed a jury trial by the Fourteenth Amendment.\n\nThe State argues that these questions were of a sort which is ordinarily the province of the court. If that is true, it is only because the questions usually arise in the context of suppression hearings. If the same questions arise, as they did here, in the context of an aggravation charge, they are questions for the jury.\n\nThe record in this case is complete and this court could make a determination of sufficiency of the evidence on all points. However, sufficiency of the evidence to support the jury's verdict is not the issue before this court. Given the trial court's instructions, the jury was not permitted to decide critical factual questions in the first instance. I would hold that instructions 26, 27 and 28 violated the Fourteenth Amendment's guaranty of due process.\n\nConclusion\n\n1. The trial court improperly and prejudicially instructed the jury as a matter of law on factual issues and presented issues of fact as conclusions of law;\n\n2. The trial court's instructions denied defendants a fair trial because it precluded the jury from considering the defendants' contentions that they were unaware they were engaged in a gun battle with law enforcement officers; McGinnis did not escape but was discharged from\n\ncustody when he left the hospital; and the events preceding the police officers' entry onto McGinnis' property did not constitute \"exigent circumstances\";\n\n3. The trial court's instructions violated Const. art. 1, § 22 (amend. 10) which prohibits judges from charging juries with respect to matters of fact;\n\n4. The trial court improperly directed a verdict on two of the three aggravating elements of aggravated first degree murder and, thus, violated defendants' right to due process, guaranteed by the Fourteenth Amendment. I would remand for a new trial.\n\nUtter, J. (dissenting)\n\nI would remand for a new trial on the sentencing phase. The error in failing to submit the \"law enforcement officer\" issue to the jury cannot be said to be harmless beyond a reasonable doubt.\n\n\u003cspan class=\"fn\"\u003e1. State v. Sohappy, 110 Wash. 2d 907, 909, 757 P.2d 509 (1988).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Washington v. Confederated Bands \u0026 Tribes of Yakima Indian Nation, 439 U.S. 463, 493, 58 L. Ed. 2d 740, 99 S. Ct. 740, reh'g denied, 440 U.S. 940, 59 L. Ed. 2d 500, 99 S. Ct. 1290 (1979); Sohappy, 110 Wash. 2d at 909.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Confederated Bands, 439 U.S. at 472; Public Law 280, sections 2, 4.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Tonasket v. State, 84 Wash. 2d 164, 166, 525 P.2d 744 (1974), appeal dismissed, 420 U.S. 915, 43 L. Ed. 2d 387, 95 S. Ct. 1108 (1975).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Tonasket, 84 Wash. 2d at 166.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Tonasket, 84 Wash. 2d at 167.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. ER 201(b), (c).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. State v. Bertrand, 61 Wash. 2d 333, 341, 378 P.2d 427 (1963).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Bertrand, 61 Wash. 2d at 341.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Bertrand, 61 Wash. 2d at 334; Solem v. Bartlett, 465 U.S. 463, 465 n.2, 79 L. Ed. 2d 443, 104 S. Ct. 1161 (1984) (indicating states may assume jurisdiction over offenses enumerated in 18 U.S.C. § 1153); Three Affiliated Tribes v. Wold Eng'g, P.C., 467 U.S. 138, 150, 81 L. Ed. 2d 113, 104 S. Ct. 2267 (1984).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Kennerly v. District Court, 400 U.S. 423, 27 L. Ed. 2d 507, 91 S. Ct. 480 (1971).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Exec. Order No. 11,435 (Nov. 21, 1968), 33 Fed. Reg. 17339 (1968), reprinted in 25 U.S.C. 1323 note at 1570 (1988).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. 52 Fed. Reg. 51 (1987).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Smith v. King, 106 Wash. 2d 443, 451-52, 722 P.2d 796 (1986); State v. Giffing, 45 Wash. App. 369, 376, 725 P.2d 445, review denied, 107 Wash. 2d 1015 (1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. See 25 U.S.C. § 1323 (1968); RCW 37.12.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. State v. Rupe, 108 Wash. 2d 734, 750, 743 P.2d 210 (1987), cert. denied, 486 U.S. 1061, 100 L. Ed. 2d 934, 108 S. Ct. 2834, reh'g denied, 487 U.S. 1263, 101 L. Ed. 2d 976, 109 S. Ct. 25 (1988).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. State v. Rupe, 101 Wash. 2d 664, 674, 683 P.2d 571 (1984); State v. Stiltner, 80 Wash. 2d 47, 52, 491 P.2d 1043 (1971).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. State v. Jeffries, 105 Wash. 2d 398, 717 P.2d 722, cert. denied, 479 U.S. 922, 93 L. Ed. 2d 301, 107 S. Ct. 328 (1986); Rupe, 101 Wash. 2d at 675.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. State v. Crudup, 11 Wash. App. 583, 588-89, 524 P.2d 479, review denied, 84 Wash. 2d 1012 (1974); State v. Brooks, 20 Wash. App. 52, 56, 579 P.2d 961, review denied, 91 Wash. 2d 1001 (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. State v. Grisby, 97 Wash. 2d 493, 507, 647 P.2d 6 (1982), cert. denied sub nom. Frazier v. Washington, 459 U.S. 1211 (1983); State v. Philips, 108 Wash. 2d 627, 640, 741 P.2d 24 (1987).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Philips, 108 Wash. 2d at 640; United States v. John Doe, 655 F.2d 920 (9th Cir. 1980).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. State v. Davis, 73 Wash. 2d 271, 290, 438 P.2d 185 (1968); Grisby, 97 Wash. 2d at 507.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Grisby, 97 Wash. 2d at 508.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Grisby, 97 Wash. 2d at 507.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. State v. Samsel, 39 Wash. App. 564, 567, 694 P.2d 670 (1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Samsel, 39 Wash. App. at 567 (citing State v. Wheeler, 95 Wash. 2d 799, 631 P.2d 376 (1981) and State v. Herd, 14 Wash. App. 959, 546 P.2d 1222 (1976), review denied, 88 Wash. 2d 1005 (1977)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Grisby, 97 Wash. 2d at 508.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. State v. Campbell, 103 Wash. 2d 1, 15, 691 P.2d 929 (1984), cert. denied, 471 U.S. 1094, 85 L. Ed. 2d 526, 105 S. Ct. 2169 (1985); State v. White, 94 Wash. 2d 498, 501, 617 P.2d 998 (1980).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. State v. Tidwell, 32 Wash. App. 971, 976, 651 P.2d 228 (1982).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Tidwell, 32 Wash. App. at 976 and cases cited therein.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. United States v. Simon, 409 F.2d 474, 476 (7th Cir.), cert. denied, 396 U.S. 829 (1969).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. State v. Greco, 57 Wash. App. 196, 203, 787 P.2d 940 (1990); State v. Zornes, 78 Wash. 2d 9, 21, 469 P.2d 552, 475 P.2d 109 (1970); Campbell, 103 Wash. 2d at 25.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. United States v. Johnson, 879 F.2d 331, 334 (8th Cir. 1989); United States v. Fleming, 739 F.2d 945, 947 (4th Cir. 1984), cert. denied, 469 U.S. 1193, 83 L. Ed. 2d 973, 105 S. Ct. 970 (1985); United States v. Shaw, 701 F.2d 367, 392 n.20, reh'g denied, 714 F.2d 544 (5th Cir. 1983), cert. denied, 465 U.S. 1067, 79 L. Ed. 2d 744, 104 S. Ct. 1419 (1984).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. Campbell, 103 Wash. 2d at 25; State v. Dictado, 102 Wash. 2d 277, 297, 687 P.2d 172 (1984).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. State v. Yates, 111 Wash. 2d 793, 797, 765 P.2d 291 (1988); State v. Mak, 105 Wash. 2d 692, 704, 718 P.2d 407, cert. denied, 479 U.S. 995, 93 L. Ed. 2d 599, 107 S. Ct. 599 (1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. State v. Hughes, 106 Wash. 2d 176, 199, 721 P.2d 902 (1986); State v. Green, 94 Wash. 2d 216, 221, 616 P.2d 628 (1980) (citing Jackson v. Virginia, 443 U.S. 307, 319, 61 L. Ed. 2d 560, 99 S. Ct. 2781 (1979)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. RCW 9A.32.030(1)(a).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. RCW 9A.32.020(1).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. State v. Neslund, 50 Wash. App. 531, 558, 749 P.2d 725, review denied, 110 Wash. 2d 1025 (1988); State v. Ollens, 107 Wash. 2d 848, 850, 733 P.2d 984 (1987).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. Neslund, 50 Wash. App. at 558; State v. Luoma, 88 Wash. 2d 28, 33, 558 P.2d 756 (1977).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. Neslund, 50 Wash. App. at 559; Ollens, 107 Wash. 2d at 853.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. Ollens, 107 Wash. 2d at 851; State v. Giffing, 45 Wash. App. 369, 375, 725 P.2d 445, review denied, 107 Wash. 2d 1015 (1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. Ollens, 107 Wash. 2d at 853; Neslund, 50 Wash. App. at 560; Giffing, 45 Wash. App. at 375.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. Hughes, 106 Wash. 2d at 200.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. State v. Gallo, 20 Wash. App. 717, 729, 582 P.2d 558, review denied, 91 Wash. 2d 1008 (1978); State v. Odom, 83 Wash. 2d 541, 550, 520 P.2d 152, cert. denied, 419 U.S. 1013, 42 L. Ed. 2d 287, 95 S. Ct. 333 (1974).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. State v. Collins, 50 Wash. 2d 740, 758, 314 P.2d 660 (1957); State v. Hettrick, 67 Wash. 2d 211, 219, 407 P.2d 150 (1965).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. State v. Crenshaw, 98 Wash. 2d 789, 806, 659 P.2d 488 (1983); State v. Adler, 16 Wash. App. 459, 465, 558 P.2d 817 (1976), review denied, 88 Wash. 2d 1011 (1977).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. Crenshaw, 98 Wash. 2d at 806; Adler, 16 Wash. App. at 465; State v. Tikka, 8 Wash. App. 736, 739, 509 P.2d 101, review denied, 82 Wash. 2d 1007 (1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. Crenshaw, 98 Wash. 2d at 807; State v. Bockman, 37 Wash. App. 474, 489, 682 P.2d 925, review denied, 102 Wash. 2d 1002 (1984).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. State v. Demos, 94 Wash. 2d 733, 738, 619 P.2d 968 (1980); State v. Tobias, 53 Wash. App. 635, 637, 769 P.2d 868 (1989).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. CrR 3.1(f).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. State v. Kelly, 102 Wash. 2d 188, 200, 685 P.2d 564 (1984).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. State v. Mines, 35 Wash. App. 932, 935, 671 P.2d 273 (1983), review denied, 101 Wash. 2d 1010 (1984); Kelly, 102 Wash. 2d at 201; State v. Melos, 42 Wash. App. 638, 640, 713 P.2d 138, review denied, 105 Wash. 2d 1021 (1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. Kelly, 102 Wash. 2d at 200-01; Mines, 35 Wash. App. at 935.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. Melos, 42 Wash. App. at 640; Mines, 35 Wash. App. at 935-36.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. State v. Rupe, 101 Wash. 2d 664, 707, 683 P.2d 571 (1984).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57. State v. Jeffries, 105 Wash. 2d 398, 412, 717 P.2d 722, cert. denied, 479 U.S. 922, 93 L. Ed. 2d 301, 107 S. Ct. 328 (1986); State v. Neslund, 50 Wash. App. 531, 535, 749 P.2d 725, review denied, 110 Wash. 2d 1025 (1988).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58. State v. Kendrick, 47 Wash. App. 620, 627, 736 P.2d 1079, review denied, 108 Wash. 2d 1024 (1987).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59. ER 401; Kendrick, 47 Wash. App. at 627.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e60. Kendrick, 47 Wash. App. at 627.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e61. State v. Hughes, 106 Wash. 2d 176, 195, 721 P.2d 902 (1986); State v. Mak, 105 Wash. 2d 692, 726, 718 P.2d 407, cert. denied, 479 U.S. 995, 93 L. Ed. 2d 599, 107 S. Ct. 599 (1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e62. State v. York, 50 Wash. App. 446, 458, 749 P.2d 683 (1987), review denied, 110 Wash. 2d 1009 (1988).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e63. York, 50 Wash. App. at 458-59; State v. Belgarde, 110 Wash. 2d 504, 507, 755 P.2d 174 (1988).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e64. Mak, 105 Wash. 2d at 726.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e65. State v. Koepke, 47 Wash. App. 897, 902, 738 P.2d 295 (1987). See also State v. Moore, 61 Wash. 2d 165, 175, 377 P.2d 456 (1963).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e66. Mak, 105 Wash. 2d at 710; State v. Campbell, 103 Wash. 2d 1, 20, 691 P.2d 929 (1984), cert. denied, 471 U.S. 1094, 85 L. Ed. 2d 526, 105 S. Ct. 2169 (1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e67. State v. Kincaid, 103 Wash. 2d 304, 312, 692 P.2d 823 (1985); State v. Irizarry, 111 Wash. 2d 591, 594, 763 P.2d 432 (1988).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e68. State v. Guloy, 104 Wash. 2d 412, 425, 705 P.2d 1182 (1985), cert. denied, 475 U.S. 1020, 89 L. Ed. 2d 321, 106 S. Ct. 1208 (1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e69. State v. Rice, 102 Wash. 2d 120, 123, 683 P.2d 199 (1984); State v. Caldwell, 94 Wash. 2d 614, 618, 618 P.2d 508 (1980).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e70. State v. Hutton, 7 Wash. App. 726, 733, 502 P.2d 1037 (1972).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e71. RCW 10.95.020(1).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e72. United States v. Martinez, 465 F.2d 79, 82 (2d Cir. 1972); United States v. Simon, 409 F.2d 474, 477 (7th Cir.), cert. denied, 396 U.S. 829, 24 L. Ed. 2d 79, 90 S. Ct. 79 (1969); United States v. Beyer, 426 F.2d 773, 774 (2d Cir. 1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e73. RCW 46.61.024.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e74. RCW 9A.36.031(1)(a).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e75. State v. Terrovona, 105 Wash. 2d 632, 644, 716 P.2d 295 (1986); Dorman v. United States, 435 F.2d 385 (D.C. Cir. 1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e76. State v. McIntyre, 39 Wash. App. 1, 5, 691 P.2d 587 (1984), review denied, 103 Wash. 2d 1017 (1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e77. State v. Crudup, 11 Wash. App. 583, 591-92, 524 P.2d 479, review denied, 84 Wash. 2d 1012 (1974); State v. Hardwick, 74 Wash. 2d 828, 830, 447 P.2d 80 (1968); State v. Workman, 90 Wash. 2d 443, 449, 584 P.2d 382 (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e78. State v. Davis, 101 Wash. 2d 654, 657-58, 682 P.2d 883 (1984); State v. Carothers, 84 Wash. 2d 256, 261-62, 525 P.2d 731 (1974); State v. Peterson, 54 Wash. App. 75, 78-79, 772 P.2d 513, review denied, 113 Wash. 2d 1007 (1989); State v. Randle, 47 Wash. App. 232, 237, 734 P.2d 51 (1987), review denied, 110 Wash. 2d 1008 (1988).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e79. Randle, 47 Wash. App. at 237.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e80. Carothers, 84 Wash. 2d at 265.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e81. State v. Kincaid, 103 Wash. 2d 304, 312-13, 692 P.2d 823 (1985); State v. Mak, 105 Wash. 2d 692, 742, 718 P.2d 407, cert. denied, 479 U.S. 995, 93 L. Ed. 2d 599, 107 S. Ct. 599 (1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e82. State v. Leech, 114 Wash. 2d 700, 790 P.2d 160 (1990).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e83. Mak, 105 Wash. 2d at 733.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e84. State v. Camara, 113 Wash. 2d 631, 639, 781 P.2d 483 (1989); State v. McCullum, 98 Wash. 2d 484, 490, 656 P.2d 1064 (1983); State v. Acosta, 101 Wash. 2d 612, 616, 683 P.2d 1069 (1984).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e85. State v. Hughes, 106 Wash. 2d 176, 189, 721 P.2d 902 (1986); State v. Allery, 101 Wash. 2d 591, 594, 682 P.2d 312 (1984).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e86. Hughes, 106 Wash. 2d at 189; State v. Painter, 27 Wash. App. 708, 712, 620 P.2d 1001 (1980), review denied, 95 Wash. 2d 1008 (1981); RCW 9A.16.050(1).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e87. State v. Camp, 67 Wash. 2d 363, 369, 407 P.2d 824 (1965); State v. Robinson, 92 Wash. 2d 357, 361, 597 P.2d 892 (1979).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e88. State v. Crudup, 11 Wash. App. 583, 595, 524 P.2d 479, review denied, 84 Wash. 2d 1012 (1974); State v. Passafero, 79 Wash. 2d 495, 499, 487 P.2d 774 (1971).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e89. Hughes, 106 Wash. 2d at 191.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e90. State v. Scott, 110 Wash. 2d 682, 686, 688 n.5, 757 P.2d 492 (1988) (noting that the failure to instruct on a lesser included offense is not a manifest error affecting a constitutional right which would allow review in spite of a failure to object to an instruction); State v. Kroll, 87 Wash. 2d 829, 843, 558 P.2d 173 (1976).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e91. Mak, 105 Wash. 2d at 747.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e92. See State v. Jeffries, 105 Wash. 2d 398, 421-22, 717 P.2d 722, cert. denied, 479 U.S. 922, 93 L. Ed. 2d 301, 107 S. Ct. 328 (1986).\u003c/span\u003e\n\n",
    "body_length": 152238,
    "citedas": [
      "804 P.2d 577",
      "116 Wash. 2d 51"
    ],
    "attorneys": "Richard B. Price, for appellant Hoffman. Elmer Edward McGinnis, pro se, and Paul J. Wasson, for appellant McGinnis. Jack Burchard, Prosecuting Attorney, for respondent. Bruce Didesch and Michael Taylor on behalf of Confederated Tribes of the Colville Indian Reservation, amicus curiae for respondent.",
    "category": [
      "36",
      "75"
    ],
    "judges": "En Banc. Andersen, J. Callow, C.j., Brachtenbach, Dolliver, Durham, and Smith, JJ., and Pearson, J. Pro Tem., concur. Dore and Utter, JJ., dissent by separate opinions; Guy, J., did not participate in the disposition of this case.",
    "citation_count": 109
  }
}
