{
  "id": "F4IzPmYBTlTomsSBC06z",
  "document": {
    "title": "Johnson v. Skateway",
    "full_title": "JAMES H. JOHNSON, A/K/A JAMES H. FEREBEE; COMMONWEALTH OF VIRGINIA v. HUGO'S SKATEWAY; LOIS LEASING FIRM, INCORPORATED . JAMES H. JOHNSON, A/K/A JAMES H. FEREBEE; AND COMMONWEALTH OF VIRGINIA V. HUGO'S SKATEWAY; LOIS LEASING FIRM, INCORPORATED .",
    "jurisdiction": "Fourth Circuit",
    "date": "1992-09-08T00:00:00.000Z",
    "docket": "No. 90-2499, No. 90-2509",
    "body": "NIEMEYER, Circuit Judge:\n\nA jury awarded James H. Johnson, a black male, $25,000 compensatory damages and $175,000 punitive damages for racially motivated harassment and intimidation by Hugo's Skateway, a roller skating rink in Warrenton, Virginia, in violation of § 8.01-42.1 of the Virginia Code. In addition, the district court awarded $15,654 for attorneys fees and expenses, although Johnson had filed requests for almost $138,000. On appeal from the judgment, Hugo's contends that (1) the evidence was insufficient to support the jury's finding of a statutory violation, (2) the award of compensatory damages was excessive, and (3) the award of punitive damages, in addition to being excessive, violated the Due Process Clause of the Fourteenth Amendment. Johnson cross-appealed, contending that the district court abused its discretion in awarding him only $15,000 for attorneys fees.\n\nThe issues were argued before a panel of this Court which affirmed the judgment below, except that the award of punitive damages was remanded for reconsideration by the district court with directions to conduct a post-verdict review, applying \"standards similar to those enumerated by the Alabama courts\" as described in Pacific Mut. Life Ins. Co. v. Haslip, 113 L. Ed. 2d 1, 111 S. Ct. 1032 (1991). 949 F.2d 1338 (4th Cir. 1991). The Court en banc thereafter granted Hugo's petition for rehearing, ordering that the earlier panel opinion be vacated and the case reheard by the Court en banc.\n\nWe now affirm the jury's finding of liability and its award of compensatory damages. Because we conclude, however, that the scheme applied in this case for awarding punitive damages denied Hugo's due process in violation of the Fifth Amendment,\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e we vacate the award of punitive damages and remand for a new trial on punitive damages. Finally, we remand for further consideration the district court's award of attorneys fees and expenses.\n\nI\n\nJames H. Johnson, also known as James H. Ferebee (Johnson), is an adult black male who on February 17, 1989, joined four white friends for an evening of roller skating at Hugo's Skateway in Warrenton, Virginia. Hugo's is an asset of Lois Leasing Firm, Incorporated, which is in turn co-owned by Hugo and Edith Stribling. Johnson was the only black patron at Hugo's that night, the only other black person in attendance at the rink that evening being a Hugo's employee.\n\nAbout an hour before closing time, Hugo's assistant manager, Daniel Wright, at the direction of Edith Stribling, approached Johnson at rinkside and asked Johnson to accompany him off the skating floor. When doing so, however, Wright asked only that Johnson accompany him to the \"back room.\" Wright admitted that he never told Johnson why he wanted to see him. Johnson asked what he had done wrong and offered to correct any perceived misbehavior on his part or to leave the premises if Wright wished him to do so, but Wright did not request that Johnson leave.\n\nJohnson, an out-of-towner, testified that he felt threatened by the white manager's unexplained request, in an overwhelmingly white establishment, to accompany him to a \"back room.\" While Johnson had had occasion to visit a room in the rear of the building previously, there was no evidence that Johnson was familiar with the \"back room\" to which Wright asked him to proceed that night.\n\nWhen Johnson failed to do as he was instructed, Edith Stribling called the Fauquier County Sheriff's office. Some fifteen to thirty minutes later, Deputy Sheriff R. Edward Wines arrived. Deputy Wines had known the Striblings for years, having been formerly employed by the Striblings as a private security guard. Before Deputy Wines arrived at the rink, Stribling did not attempt to talk to Johnson, who sat on a bench directly in front of the glass-enclosed office where Stribling worked.\n\nUpon arriving at the rink, Deputy Wines immediately approached and spoke with Stribling, who directed his attention to Johnson. Thereafter Deputy Wines arrested Johnson by throwing him to the ground, placing him in a choke hold, and handcuffing him. Johnson was transported to a magistrate's office and then to the Fauquier County jail where he was held overnight without bond.\n\nThere is conflicting evidence as to Edith Stribling's motivation for sending the assistant manager to get Johnson off the skating floor or calling the sheriff to effectuate Johnson's removal from the rink. Edith Stribling testified that she saw Johnson, skating too fast, come up behind and lift a child out of Johnson's way so that he could skate through. This dangerous activity was, according to Stribling, the reason for her actions. The assistant manager, Daniel Wright, indicated that he was sent to get Johnson because Johnson was skating in the center of the rink, an area designated for \"special\" skating, which had become too crowded.\n\nOther evidence as to Stribling's motivation came from one of her former employees who testified that Stribling made derogatory comments about mixed-race couples and that the Striblings were \"biased against blacks.\" Other testimony was offered that Stribling sent Wright to remove Johnson \"shortly after\" Johnson and a white female companion were seen skating together in the center of the rink.\n\nJohnson filed this suit against both Hugo's and Deputy Wines in the district court on November 13, 1989, alleging deprivation of his civil rights under 42 U.S.C. § 1983; false arrest and false imprisonment under Virginia common law; and racially motivated harassment and intimidation in violation of § 8.01-42.1 of the Virginia Code. Johnson also charged Deputy Wines with assault and battery under Virginia common law. At trial, the district court directed a verdict in favor of Hugo's on the false arrest, false imprisonment, and § 1983 claims, and the jury returned a verdict against Hugo's for racially motivated harassment and intimidation, awarding Johnson $25,000 compensatory damages and $175,000 punitive damages. The jury returned a verdict against Deputy Wines on all but the racial harassment and intimidation claim, and it awarded Johnson $200 compensatory and $500 punitive damages. On Johnson's application for attorneys' fees and expenses in the amount of $114,778, as amended by a supplemental application for an additional $23,199, the district court awarded Johnson $15,654. The Commonwealth of Virginia was permitted to intervene in this case under 28 U.S.C. § 2403(b) in response to the constitutional challenge to the punitive damages provisions of Va. Code Ann. § 8.01-42.1.\n\nII\n\nHugo's contends first that the jury's verdict against it was not supported by substantial evidence of acts of \"intimidation or harassment\" against Johnson which were \"motivated by racial . . . animosity.\" See Va. Code Ann. § 8.01-42.1(A).\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e In resolving this issue we must view all of the evidence in the light most favorable to Johnson, drawing all reasonable inferences in Johnson's favor, and then determine whether a reasonable jury could have found a verdict in Johnson's favor. See Foster v. Tandy Corp., 828 F.2d 1052, 1055 (4th Cir. 1987). When isolating Hugo's conduct from that of Deputy Wines, the question in this case becomes a close one, involving the sufficiency of circumstantial evidence and rational inferences to be drawn therefrom. Nevertheless, being mindful of the Seventh Amendment's commission of factual questions to the jury and of our limited role of review, we conclude that the evidence was sufficient to support the verdict.\n\nWhen Johnson arrived at Hugo's Skateway on February 17, 1989, Edith Stribling, one of the owners of Hugo's, was working at the cash register and accepted Johnson's payment for himself and two of the white women who accompanied him. According to testimony, Stribling's views as to the propriety of interracial couples had been previously made known to her employees by comments such as \"Did you see that hussy with that nigger?\" Johnson was an accomplished skater and later that evening he endeavored to teach skating techniques to one of the women. The lesson was conducted in the center of the rink, a section set off by painted lines for skaters who would \"like to do something a little out-of-the-ordinary.\" The lesson was described by a Hugo's employee as follows: \"They [were] skating -- one would get at one end, and one would go to the other. And they would come to the middle and meet, and they would grab hands and spin around in circles.\"\n\nShortly after this, the rink's assistant-manager, at Stribling's behest, came up to Johnson and without explanation told Johnson \"they wanted to see him in the back room.\" Although the manager was an \"elderly man,\" Johnson stated that he was threatened and intimidated by him, a statement which the jury might have deemed credible. Johnson responded to the manager,\n\nWhat am I doing wrong? Am I doing anything wrong? You know, tell me what I'm doing wrong because, you know, I can correct it. Or if you want me to, I'll just leave. Whatever you want me to do, I'll do.\n\nSince Johnson refused to go to \"the back room,\" Stribling called the sheriff and, when Deputy Wines arrived at the rink, she instructed that Johnson be removed, despite a rink policy that skaters be warned up to three times for their misbehavior prior to their exclusion from the rink. A jury might reasonably have determined that the acts of sending the manager to intimidate Johnson and calling the sheriff to request Johnson's removal from the rink constituted \"acts of intimidation or harassment\" under Va. Code Ann. § 8.01-42.1(A).\n\nFurthermore, in light of the racial slurs used by Stribling, the testimony of a former employee who considered Stribling biased against blacks, the fact that ejection slips recorded the race of persons removed from the rink, and Hugo's failure to post signs stating \"Hugo's Skateway admits and serves all persons on the same terms, without regard to race or color\" or instruct its employees to admit and treat persons equally, as required by a consent order issued in April 1979, the jury reasonably could have found that the acts of harassment or intimidation by Hugo's were \"motivated by racial . . . animosity.\" Va. Code Ann. § 8.01-42.1(A).\n\nHugo's argues that evidence of the 1979 consent order should not have been placed before the jury, claiming that its admission was contrary to Federal Rules of Evidence 408, 404(b), and 403. However, we will not reverse such an evidentiary decision made by the district court unless the decision constitutes \"an abuse of discretion 'amounting to manifest error.'\" Fiberglass Insulators, Inc. v. Dupuy, 856 F.2d 652, 654-55 (4th Cir. 1988) (quoting Bituminous Constr., Inc. v. Rucker Enters., Inc., 816 F.2d 965, 968 (4th Cir. 1987)).\n\nIn this case, evidence of the consent order was not admitted to prove the truth of the matters on which compromise had been reached, in violation of Fed. R. Evid. 408, i.e., that Hugo's had in the past discriminated against blacks. Indeed, the district court repeatedly cautioned the jury that evidence of the consent agreement could only be considered to determine whether Hugo's had posted the signs or instructed their employees as required by the agreement, which bore directly on the rink owners' racial animus on February 17, 1989. See Yates v. Evatt, 114 L. Ed. 2d 432, 111 S. Ct. 1884, 1893 (1991) (discussing the \"sound presumption of appellate practice, that jurors are reasonable and generally follow the instructions they are given\"). The admission of this past conduct evidence was thus justified under Rule 404(b), which allows evidence of other wrongs for purposes such as proof of motive and intent. See United States v. Gilbert, 668 F.2d 94, 97 (2d Cir. 1981) (admitting civil consent decree under Rules 408 and 404(b) to show defendant knew of SEC reporting requirements), cert. denied, 456 U.S. 946, 72 L. Ed. 2d 469, 102 S. Ct. 2014 (1982). Given the probative value of the evidence that Hugo's failed to comply with terms of the consent decree on the issues of motive and intent and the district court's efforts to minimize any prejudicial effect on the defendants by way of instructions to the jury, we cannot say that the district court abused its discretion in determining that the relevance with regard to Hugo's motive and intent outweighed the prejudicial effect of the consent decree's admission into evidence. See Fed. R. Evid. 403. See also United States v. Heyward, 729 F.2d 297, 301 n.2 (4th Cir. 1984) (\"The trial court has wide discretion [in applying Rule 403] and its determination will not be overturned except under the most 'extraordinary' of circumstances.\"), cert. denied, 469 U.S. 1105, 83 L. Ed. 2d 772, 105 S. Ct. 776 (1985).\n\nHugo's also maintains that, even if the jury's determination of liability was proper, the award of compensatory damages was demonstrably excessive, particularly in view of the small award returned by the jury against Deputy Wines. Deputy Wines was assessed only $200, whereas the jury required Hugo's to pay compensatory damages in the amount of $25,000. Hugo's urges that the only possible explanation for the disparity is that the acts of Deputy Wines inflamed the passions and biases of the jury to the point that the jury punished Hugo's for Wines' behavior.\n\nThe trial Judge's determination that a jury's award of compensatory damages is not excessive will not be set aside unless \"'the verdict is against the clear weight of the evidence, or is based upon evidence which is false, or will result in a miscarriage of Justice.'\" Johnson v. Parrish, 827 F.2d 988, 991 (4th Cir. 1987) (quoting Aetna Casualty \u0026 Sur. Co. v. Yeatts, 122 F.2d 350, 352 (4th Cir. 1941)). Clearly there is a sizable disproportionality of the awards of compensatory damages given by the jury against Hugo's and Deputy Wines, especially when one considers that only Wines physically harmed Johnson. In rendering its verdict, however, the jury found Hugo's but not Wines culpable for racial harassment or intimidation. As the district court stated when it denied Hugo's motion for judgment n.o.v., the jury simply could have chosen to view the racial harassment and intimidation as the more heinous wrong and awarded compensation accordingly. Because of the difficulty in measuring the amount appropriate to compensate for the emotional injuries resulting from these sorts of wrongs and the rational basis for distinguishing between the harm caused by Wines and that caused by Hugo's, we cannot conclude that the award against Hugo's was excessive.\n\nIII\n\nHugo's next maintains, in reliance upon the Supreme Court's decision in Pacific Mut. Life Ins. Co. v. Haslip, 113 L. Ed. 2d 1, 111 S. Ct. 1032 (1991), and ours in Mattison v. Dallas Carrier Corp., 947 F.2d 95 (4th Cir. 1991), that the punitive damages award against it cannot stand because Virginia's scheme for awarding punitive damages provides insufficient standards for fixing the amount of such awards in violation of the Due Process Clause of the Fourteenth Amendment.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nIn Haslip, the Supreme Court upheld Alabama's scheme for awarding punitive damages against an attack that punitive awards in Alabama had become the product of \"unbridled jury discretion\" in violation of the Due Process Clause. Although the Court acknowledged that unlimited jury discretion in the assessment of punitive damages could result in a constitutionally infirm award, Haslip, 111 S. Ct. at 1043, it concluded that Alabama's scheme, with its particular procedural and substantive protections, did not \"cross the line into the area of constitutional impropriety.\" Id. at 1046. While the Alabama jury instructions considered in Haslip resembled those typically given elsewhere, the almost de novo post-verdict and appellate reviews conducted by Alabama's trial courts and the Supreme Court of Alabama provided \"a sufficiently definite and meaningful constraint on the discretion of Alabama fact finders in awarding punitive damages\" to satisfy due process. Id. at 1045. Under Alabama's two-level review of punitive damages awards, the trial courts and the Supreme Court of Alabama review facts, take new evidence, find additional facts, and actually adjust jury awards of punitive damages. See Mattison, 947 F.2d at 104. Undertaking a constitutional calculus that considered all aspects of Alabama's scheme (the jury instructions, the trial level post-verdict review, and the appellate review) in light of due process considerations of adequate guidance and reasonableness in effect, the Supreme Court concluded that punitive damages awarded in Alabama may have been close to the line of constitutional impropriety but did not \"cross the line.\" Haslip, 111 S. Ct. at 1046.\n\nIn Mattison, we applied the Haslip calculus to South Carolina's scheme for awarding punitive damages, as applied in a federal court with diversity jurisdiction, and concluded that it violated the Due Process Clause of the Fifth Amendment. The South Carolina jury instructions authorized the jury to award such amount of punitive damages \"as you believe will serve to punish . . . and deter.\" Mattison, 947 F.2d at 100. The jury was permitted to consider the defendant's ability to pay, but no other constraint or instruction guided the jury. Because the case was tried in federal court, the state post-verdict review process which proved so critical in Haslip was supplanted by federal rules and procedures for reviewing verdicts.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e The combination of undirected jury instructions and federal review standards (which themselves provide little constraint in reviewing jury findings, as mandated by the Seventh Amendment) was thus held to deny the defendant due process.\n\nHugo's argues that the \"standardless\" jury instructions given in accordance with state-formulated instructions in this case, in combination with the limited scope of review afforded by Rules 50(b) and 59 of the Federal Rules of Civil Procedure, provide even less definition than the scheme found unconstitutional in Mattison. We agree.\n\nThe jury in this case was instructed by the district court that it was permitted to award punitive damages to punish and to deter the defendants' conduct if the conduct was \"maliciously or wantonly or oppressively done.\"\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e As to the amount, the complete instruction directed, \"You may add to the award of actual damages such amount as you shall unanimously agree to be proper as punitive or exemplary damages.\" No guidance about what to consider in fixing the \"proper\" amount was given, but, as is standard in instructing a jury, the jury was admonished that when deliberating it must fix the amount \"with calm discretion and sound reason\" and never out of \"sympathy or bias or prejudice.\"\n\nGiven this instruction to the jury, which in essence embodied no standard for quantitatively assessing punitive damages against Hugo's, the only possible source of constraint on the amount of the award of punitive damages in this case was the trial court's review for \"excessiveness\" under Rules 50(b) and 59 of the Federal Rules of Civil Procedure, as well as our review of the district court's decision under an abuse of discretion standard.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e As Mattison made clear, the degree of scrutiny afforded by these processes is insufficient to remedy an instruction which leaves the jury with nearly absolute discretion to enter any amount of punitive damages it deems \"appropriate to punish and deter.\" See 947 F.2d at 101. Thus, under the reasoning of Haslip and Mattison, we conclude that the scheme utilized to award punitive damages in this case violated the Due Process Clause of the Fifth Amendment.\n\nThis Conclusion, however, does not compel final judgment for Hugo's on the issue of punitive damages, as requested by Hugo's. For we do not necessarily agree that Virginia's scheme for awarding punitive damages, as applied in the state courts of Virginia, is also constitutionally inadequate and that, therefore, no punitive damages award by a federal court applying Virginia law could stand. While the jury instructions regarding punitive damages given by the district court in this case were undoubtedly the same as, or quite similar to, those given by the state trial courts in Virginia, the factors applied by Virginia's courts in the post-verdict review process, which appear to provide more constraint on the verdict than was permitted the district court by Federal Rules of Civil Procedure 50(b) and 59, were not considered at any step of the trial. Consequently, to determine whether remand for a new trial is appropriate in this case, we consider (1) whether the district court should have incorporated the post-verdict criteria of Virginia's law into the instructions it gave to the federal jury and (2) whether their addition may allow an award of punitive damages without violating the Due Process Clause of the Fifth Amendment.\n\nThe principles of Erie R.R. Co. v. Tompkins, 304 U.S. 64, 82 L. Ed. 1188, 58 S. Ct. 817 (1938), require a federal court in a diversity case to respect and enforce statecreated rights in a manner such that litigation of state-based rights in federal court does not yield results materially different from those attained in the state courts.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e The Supreme Court, addressing the substantial variations that were then perceived between state and federal litigation, overruled the rule of Swift v. Tyson, 41 U.S. (16 Pet.) 1, 10 L. Ed. 865 (1842), and established a rule, without drawing hard lines, that \"federal courts are to apply state 'substantive' law and federal 'procedural' law.\" Hanna v. Plumer, 380 U.S. 460, 471, 14 L. Ed. 2d 8, 85 S. Ct. 1136 (1965). Generally, then, federal courts applying state-created law are still to conduct those trials under federally established rules of procedure.\n\nThe allocation between Judge and jury of the fact-finding responsibility is a procedural matter, see Burcham v. J.P. Stevens \u0026 Co., Inc., 209 F.2d 35, 40 (4th Cir. 1954) (\"Whether a question is one for the decision of the court or of the jury is a question of federal practice as to which we are governed by federal and not by state decisions.\"), and, in the federal context, is largely informed by the principles embodied in the Seventh Amendment. See Byrd v. Blue Ridge Rural Elec. Coop., Inc., 356 U.S. 525, 537, 2 L. Ed. 2d 953, 78 S. Ct. 893 (1958). Although a state court in assessing punitive damages may apportion fact-finding responsibilities between Judge and jury,\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e we have held that in a federal court the jury performs those functions. See Defender Indus., Inc. v. Northwestern Mut. Life Ins. Co., 938 F.2d 502, 507 (4th Cir. 1991) (en banc). Under these principles a district court applying state law may look beyond the state-formulated jury instructions to the state's postverdict review criteria when incorporating into its instructions the state's substantive punitive damages law, as required by Erie. See Mattison, 947 F.2d at 108-09. We thus conclude that if state law assigns the trial or appellate court a post-verdict role in assessing the reasonableness of a punitive damages award and specifies certain factors to be considered in making that assessment, then this body of substantive law must also be applied in federal court, but in a manner that permits consideration by the jury as the sole fact finder, rather than by the Judge.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e See Mattison, 947 F.2d at 108-110.\n\nHaving concluded that a federal court should incorporate the whole scheme established by a state's substantive law, we next turn to Virginia's scheme for awarding punitive damages. We note at the outset that neither Virginia's Supreme Court nor its legislature has spoken to the scope of review of a jury's award of punitive damages in light of the Haslip decision. Cf. Gamble v. Stevenson, 305 S.C. 104, 406 S.E.2d 350, 354 (S.C. 1991) (establishing eight factor post-trial review of punitive damages awards in wake of Haslip); Alexander \u0026 Alexander, Inc. v. B. Dixon Evander \u0026 Assoc., Inc., 88 Md. App. 672, 596 A.2d 687, 711-12 (Md. Ct. Spec. App.) (establishing \"proper guidance\" for jury's consideration of punitive damages awards in wake of Haslip), cert. denied, 323 Md. 1, 590 A.2d 158 (Md. 1991); Garnes v. Fleming Landfill, Inc., 413 S.E.2d 897, 908 (W. Va. 1991) (establishing \"a new system for the review of punitive damages\" in wake of Haslip). It would appear that the Haslip decision has, at least, compelled most state courts which have subsequently faced the due process issue to reconsider the constitutionality of their schemes for assessing punitive damages. In the absence of a definitive statement from Virginia's highest court, it is thus one part of our duty to predict the effect, if any, that the Haslip decision might have upon Virginia law. See Liberty Mut. Ins. Co. v. Triangle Indus., Inc., 957 F.2d 1153, 1156 (4th Cir. 1992) (In defining substantive state law, if unclear, federal courts must predict the decision of the state's highest court.).\n\nIt is clear that Virginia has made the choice to employ punitive damages as a means to punish malicious, wanton, or reckless behavior which falls within the jurisdiction of the Commonwealth and to provide the proceeds of the punishment to the victims of such behavior. See, e.g., Wallen v. Allen, 231 Va. 289, 343 S.E.2d 73, 78 (Va. 1986). Moreover, with regard to the award of punitive damages in the area of racial harassment or intimidation, the Virginia legislature has explicitly spoken. See Va. Code Ann. § 8.01-42.1(B). Furthermore, unlike South Carolina's scheme for reviewing a jury's assessment of punitive damages that we found lacking in Mattison, Virginia's scheme has never left the award of punitive damages to the unbridled discretion of the jury. See Stubbs v. Cowden, 179 Va. 190, 18 S.E.2d 275, 280 (Va. 1942). Indeed, at one time or another Virginia courts have applied almost all of the Mattison factors to reverse a jury's award of excessive punitive damages. Compare Mattison, 947 F.2d at 110 (considering (1) the relationship of punitive damages to the harm caused (proportionality); (2) other penalties assessed for the punished behavior; (3) benefits obtained from the wrongful conduct and costs incurred by the victim to redress it; and (4) limitations based on the wrong-doer's ability to pay)\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e with Stubbs, 18 S.E.2d at 280 (upholding trial court's decision to set aside punitive damages verdict based on proportionality and ability of defendant to pay); Gazette, Inc. v. Harris, 229 Va. 1, 325 S.E.2d 713, 746-47 (Va.) (reversing jury award of punitive damages based on lack of \"some reasonable relationship\" between actual damages sustained and the amount of punishment required), cert. denied, 472 U.S. 1032 (1985); and Tazewell Oil Co., Inc. v. United Virginia Bank, 243 Va. 94, 413 S.E.2d 611, 621-22 (Va. 1992) (upholding trial court's decision to limit punitive damages award based on double recovery by plaintiff). This suggests, at least, an amenability of the Virginia courts to the use of a Haslip -type inquiry, even if the law would not necessarily appear explicitly to direct in each case the same sort of review deemed acceptable by the Supreme Court in Haslip.\n\nThus, we can safely say that the substantive law of Virginia contemplates punitive damages awards which are proportional to the award of compensatory damages given in a particular case, see Stubbs, 18 S.E. at 280; that do not afford double recovery to the plaintiff, see Tazewell Oil, 413 S.E. at 621-22; and that are given only after consideration of the effect of the award on the defendant, see Harris, 325 S.E.2d at 747. Furthermore, while we find no Virginia case directly on point, based on the Commonwealth's expressed preference for authorizing punitive damages for violation of the statute involved in this case, see Va. Code Ann. § 8.01-42.1(B), and our view of the Supreme Court's decision in Haslip, we also expect that Virginia would consider as part of its double recovery analysis other civil or criminal penalties levied on the defendant and, as part of its proportionality analysis, the benefits derived from the wrongful conduct and plaintiff's costs in redressing the wrong. Cf. Harris, 325 S.E.2d at 747 (requiring relationship between the amount of punitive damages awarded and \"the measure of punishment required\").\n\nTo give effect to Virginia's substantive law of punitive damages, amplified as we expect it would be upon Virginia's review of the implications of Haslip, and to assign the fact-finding responsibility in accordance with federal procedural law, a federal district court applying Virginia's law of punitive damages shall instruct the jury to consider what are essentially the same four factors described in Mattison, 947 F.2d at 110, in making a punitive damage assessment. Because the jury was not so instructed in this case, we vacate the punitive damages award and order a new trial on them.\n\nIV\n\nFinally, on cross-appeal, Johnson contests the district court's limitation on his attorneys fees and expenses to $15,654 in the face of an initial request of $114,778 and a supplemental request of an additional $23,199.\n\nSection 8.01-42.1(B) of the Virginia Code gives to the trial court discretion to make \"an award of the cost of the litigation and reasonable attorneys' fees in an amount to be fixed by the court.\" Such discretionary fee awards are reversed on appeal only if \"'under all the facts and circumstances [the award] is clearly wrong.'\" Lea v. Cone Mills Corp., 467 F.2d 277, 279 (4th Cir. 1972) (quoting United States v. Anglin \u0026 Stevenson, 145 F.2d 622, 630 (10th Cir. 1944), cert. denied, 324 U.S. 844, 89 L. Ed. 1405, 65 S. Ct. 678 (1945)). Because the exercise of discretion in awarding attorneys fees typically is based on first-hand knowledge of the case and factors bearing on the reasonableness of a fee, we will not ordinarily disturb the award \"even though we might have exercised that discretion quite differently.\" National Wildlife Fed'n v. Hanson, 859 F.2d 313, 317 (4th Cir. 1988).\n\nIn this case the district court found Johnson's fee application to be \"manifestly excessive,\" noting that the case was an uncomplicated assault action infected by racial animus, which should have taken much less than the 914.5 hours of work claimed by counsel for Johnson. Moreover, Johnson's counsel apparently asked the district court, as it asks us, to ignore the fact that much of the work done on this case was performed in anticipation of the litigation against Deputy Wines, with whom it appears Johnson ultimately reached a settlement for an unknown amount of money. Considering the standard of review, we find no fault with the district court's decision to reduce Johnson's fee application on these grounds.\n\nIt would appear, however, that the district court may also have reduced the ultimate fee award as a result of Johnson's success on only one of the three counts raised against Hugo's, despite the fact that he received a sizable verdict and that all three counts arose from \"a common core of facts.\" See Hensley v. Eckerhart, 461 U.S. 424, 76 L. Ed. 2d 40, 103 S. Ct. 1933 (1983); Abshire v. Walls, 830 F.2d 1277, 1282-83 (4th Cir. 1987). Because the extent to which that impermissible factor contributed to the final fee award, if at all, is not clear from the record, and in light of our understanding that a second supplemental fee request, not yet considered by the district court, is still pending, we remand the entire attorneys fees issue to the district court for further consideration, as needed, when it considers the second supplemental request and any further requests for fees and expenses.\n\nV\n\nAccordingly, we affirm the judgment insofar as it reflects the jury's finding of liability and award of compensatory damages. We vacate the award of punitive damages and remand for a new trial on punitive damages. Finally, we remand for further consideration the district court's award of attorneys fees.\n\nJUDGMENT AFFIRMED IN PART, VACATED IN PART, AND REMANDED FOR PARTIAL NEW TRIAL AND RECONSIDERATION OF THE AWARD OF ATTORNEYS FEES\n\nDisposition\n\nJUDGMENT AFFIRMED IN PART, VACATED IN PART, AND REMANDED FOR PARTIAL NEW TRIAL AND RECONSIDERATION OF THE AWARD OF ATTORNEYS FEES\n\nMURNAGHAN, Circuit Judge, Dissenting:\n\nWhile I concur with the majority opinion to the extent that it affirms Johnson's compensatory damages award and his entitlement to some amount of punitive damages,\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e I Dissent from the majority's decision, on due process grounds, to vacate and remand the punitive damages award of $175,000 for a new trial as to the amount thereof. Because I believe that the award comports with due process, in that the punitive damages jury instructions and evidence presented sufficiently constrained the jury's discretion, I would affirm the $175,000 punitive damages award.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nAt the outset, I am compelled to point out that, although I am not a great enthusiast of awards of punitive damages, I believe that the law as developed over the years should, nevertheless, be applied. A concentrated effort has been made to limit severely the concept of punitive damages, most recently finding expression in Pacific Mutual Life Insurance Co. v. Haslip, 113 L. Ed. 2d 1, 111 S. Ct. 1032 (1991), and in Mattison v. Dallas Carrier Corp., 947 F.2d 95 (4th Cir. 1991). But in Haslip the Supreme Court expressly refused to curtail the concept of punitive damages, instead only making more precise the principles of due process to be applied in determining whether a grant of punitive damages is to be deemed appropriate. Haslip, 111 S. Ct. at 1043.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nHistorically, the rule has been (and remains after Haslip) that, where egregious tortious conduct has been shown to the factfinder's (usually the jury's) satisfaction to exist, the factfinder in his, her or its discretion may add an additional sum to punish the offender. Haslip, 111 S. Ct. at 1037 n.1 \u0026 1039 (\"for the determination of how large an award of punitive damages is appropriate in a given case, juries are left largely to themselves in making this important, and potentially devastating decision\").\n\nThe amount of the punitive award consequently has been whatever the factfinder has found in its judgment in \"wholly unpredictable amounts,\" subject only to the limitation that it not be excessive.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Id. at 1040 (\"jury discretion over the amounts awarded is limited only by the gentle rule that they not be excessive\"). The \"not excessive\" approach has been treated as sufficient from the founding of our country two hundred years ago until the decision in Haslip. However, Haslip did not end or even redefine the concept of punitive damages. Id. at 1043. Rather, it added precision to the due process requirement by measuring with greater particularity the idea incompletely or too cursively expressed by \"not excessive.\"\n\nHaslip required that a punitive damages award be within the limits of reasonableness, and that the jury's discretion be sufficiently constrained such that the discretion is not \"unlimited.\" Id. Such jury discretion is not \"unlimited\" when it is \"confined to deterrence and retribution, the state policy concerns sought to be advanced\" by punitive damages. Id. at 1044. The Haslip court approved the jury instructions on punitive damages provided under Alabama law, as sufficient in and of themselves to satisfy due process. Id. The Court went on to note that the post-verdict review provided under Alabama law provided additional, but not necessary, due process safeguards. Id. at 1045. In conducting a fact-specific analysis of Alabama's post-verdict review process, the Court outlined and approved seven considerations which Alabama courts took into account when \"scrutinizing damage awards\" for reasonableness. Id. at 1044-45. They are:\n\n(a) whether there is a reasonable relationship between the punitive damages award and the harm likely to result from the defendant's conduct as well as the harm that actually has occurred;\n\n(b) the degree of reprehensibility of the defendant's conduct, the duration of that concealment, and the existence and frequency of similar past conduct;\n\n(c) the profitability to the defendant of the wrongful conduct and the desirability of removing that profit and of having the defendant also sustain a loss;\n\n(d) the \"financial position\" of the defendant;\n\n(e) all the costs of litigation;\n\n(f) the imposition of criminal sanctions on the defendant for its conduct, these to be taken in mitigation; and\n\n(g) the existence of other civil awards against the defendant for the same conduct, these also to be taken in mitigation.\n\nId. at 1045.\n\nIt is critical to note that nowhere does Haslip mandate that the seven factors must be present in a post-verdict review system, nor does the Court require such factors to be given to the jury by way of instructions. Haslip stands merely for the proposition that Alabama's scheme for awarding punitive damages in that case satisfied due process.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Haslip provides little, to no, guidance for determining whether other state schemes, such as Virginia's, comport with due process.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nExcessiveness vel non of compensatory damages has been traditionally treated as a question of law for resolution by the Judge. See Dagnello v. Long Island R.R. Co., 289 F.2d 797, 806 (2nd Cir. 1961) (\"there must be an upper limit [on an award of compensatory damages], and whether that has been surpassed is not a question of fact with respect to which reasonable men may differ, but a question of law\"). I can perceive no principled reason as to why the question of excessiveness or unreasonableness of punitive damages should not, likewise, be resolved by the court. The Fifth Circuit, in a case decided post-Haslip, has held just that. See Eichenseer v. Reserve Life Ins. Co., 934 F.2d 1377, 1382 (5th Cir. 1991) (holding that the reasonableness test for punitive damages \"is not a vehicle for expansive appellate review of punitive damages awards. It creates, instead, a narrow channel for appellate review in which the focus of the reviewing court is to ensure that, under the circumstances of the case in question, the award of punitive damages is not grossly excessive or unreasonable\") (emphasis in original). Furthermore, such an excessiveness review does not run afoul of the Seventh Amendment. See, e.g., Dagnello, 289 F.2d at 797. Accord Grunenthal, 393 U.S. at 159-60.\n\nIt may well be that the Haslip requirement that the jury have \"adequate guidance from the court\" in determining punitive damages contributes to the difference between the majority and myself. See Haslip, 111 S. Ct. at 1043. The phrase has perhaps been construed by the majority to require that the Judge's formal instruction prior to submission to the jury embody, in haec verba, the requisite number of factors, such as those employed by Alabama that were approved in Haslip, to insure that the punitive damages verdict is not unreasonable in amount. I do not read the phrase \"adequate guidance from the court\" in that way. It does not convert into a jury question one traditionally reserved for the court.\n\nObviously, excessiveness has been a question for the Judge, it being inappropriate for a jury to decide whether its own verdict was excessive. See, e.g., Union Nat'l Bank v. Mosbacher, 933 F.2d 1440, 1448 (8th Cir. 1991), cert. denied, 116 L. Ed. 2d 775, 112 S. Ct. 870 (1992) (\"the Arkansas Supreme Court reviews punitive damages awards to determine whether the award shocks the conscience of the court or is so great that it must be the product of passion or prejudice . . .\"); State ex rel. State Highway Comm'n v. Thurman, 552 S.W.2d 42, 44 (Mo. App. 1977) (\"term 'excessive' when used in reference to a verdict is a legal term of art and, generally, test for determining whether verdict is 'excessive' is whether its size is such as to shock the conscience of the court\"). I believe substituting \"unreasonable\" as a more precise definition for \"excessive\" should not bring about a shift, from Judge to jury, of the responsibility for deciding. No doubt the court will be aided, in addressing the question, if it knows the factors which the jury was instructed to consider. Knowledge on that aspect is supplied, however, not by the instruction alone, but by the evidence which had been introduced for jury consideration on the question. All the instructions in the world will not suffice in the absence of sufficient supporting evidence. Therefore, the jury finding as to the amount of punitive damages must be shown to have been supported by the evidence admitted under guidance from the court. While I would agree that it might render the reviewing court's task easier if the Haslip factors were precisely delineated, the question of whether there was sufficient evidence to permit the award of punitive damages in the amount selected by the jury remains one for the Judge.\n\nIn the instant case, the punitive damages award comports with due process. Here, as in Haslip, although the jury's discretion was substantial, it was \"not unlimited\" because it was tied to the goals of deterrence and retribution. See Haslip, 111 S. Ct. at 1044. The jury instructions in the case at bar clearly set forth the limitations applicable to an award of punitive damages. More particularly, the jury instructions provided that Hugo's had to have acted \"maliciously or wantonly or oppressively.\" Cf. Wallen v. Allen, 231 Va. 289, 297, 343 S.E.2d 73, 78 (1986). Second, the instructions carefully defined \"wanton,\" \"oppressive\" and \"malicious\" conduct. Third, the instructions emphasized that entitlement to punitive damages, under Virginia law, was conditioned on the awarding of compensatory damages. Cf. O'Brien v. Snow, 215 Va. 403, 405, 210 S.E.2d 165, 167 (1974). Fourth, the instructions directed that punitive damages \"be fixed with calm discretion and sound reason and must never be awarded or fixed in amount because of any sympathy or bias or prejudice with respect to any party of the case.\" Finally, the instructions pointed out that \"the law permits the jury under certain circumstances to award the injured person punitive and exemplary damages in order to punish the wrongdoer for some extraordinary conduct and to serve as an example and warning to others not to engage in such conduct.\" (Emphasis added). As a whole, the jury instructions clearly set forth the purposes of punitive damages as contemplated by Haslip and sufficiently circumscribed the jury's discretion for due process purposes.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nRelying solely on the adequate jury instructions, I would approve Virginia's punitive damages scheme as comporting with due process, just as the Haslip court approved Alabama's scheme based solely on the sufficiency of the jury instructions. See Haslip, 111 S. Ct. at 104445. However, even if one reads Haslip as requiring a post-verdict review system akin to Alabama's seven factors, when the record is here examined it develops that, of the seven Alabama post-verdict review factors mentioned in Haslip, at least five were supported by substantial evidence.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e First, the record makes clear that the harm likely to result, blatant racial discrimination resulting in harassment and intimidation, is substantial. Additionally, an award of $175,000, less than half of the statutorily imposed cap of $350,000,\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e is rationally related to the degree of that substantial harm. Second, the conduct was long-enduring, as is demonstrated by the failure to observe the terms of the ten-year consent decree, which terms were not being observed for as long as any witness could remember. Third, the existence of profit which should be removed and a concomitant loss from such improper behavior is readily discernible from the record. Fourth, as in Haslip itself, no evidence of Hugo's Skateway's financial position was introduced. Fifth, no evidence was introduced of any other civil or criminal penalty assessed against Hugo's Skateway that would stand to mitigate the instant award of punitive damages. Based upon the foregoing, the evidence supports the Conclusion that the punitive damages were \"reasonable in their amount and rational in light of their purpose to punish what has occurred and to deter its repetition.\" Haslip, 111 S. Ct. at 1045. Thus, a post-verdict review process, utilizing the seven factors approved in Haslip, would result in upholding the punitive damages award in the instant case.\n\nThe question remains, however, whether, in a diversity jurisdiction case, the district court or the appellate court should conduct the postverdict review. In the earlier panel opinion, which was vacated due to the en banc consideration of the instant case, I agreed to a remand principally to allow the district Judge, with his greater and more intimate familiarity with the trial proceedings, to decide whether due process inhered in the jury verdict of $175,000 in punitive damages.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nSuch a decision, at the time,\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e seemed reasonable, especially since the instant punitive damages verdict antedated Haslip so that the jury and the district court did not have the benefit of its teachings.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nAt the level of rehearing en banc, I have reconsidered the matter more closely and am now convinced that jury instructions as to punitive damages were sufficient to satisfy due process. The Conclusion is further supported by the fact that substantial evidence in the record of no less than five of the seven post-verdict review factors approved in Haslip sufficed to require the upholding of the jury's punitive damages award. See Grunenthal v. Long Island R.R. Co., 393 U.S. 156, 158, 21 L. Ed. 2d 309, 89 S. Ct. 331 (1968). While not regarding it as directly relevant to the due process question,\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e I cannot overlook that the $175,000 amount was well within the $350,000 cap on punitive damages enacted by the Virginia legislature.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nFurthermore, I can find no justification for the majority's imposition, in a diversity jurisdiction case, of what are essentially federal jury instructions on state punitive damages. While the majority places great reliance on just such a procedure adopted in Mattison v. Dallas Carrier Corp., 947 F.2d 95 (4th Cir. 1991), I conclude that the Mattison decision should, and could by the en banc court, be overruled for several reasons. First, as a matter of state law, no entitlement to punitive damages was shown under the facts of the Mattison case.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e Second, a federal appellate court, in my opinion, lacks the authority assumed in Mattison to impose federal jury instructions on state punitive damages upon a jury sitting in a federal case arising under diversity jurisdiction. It seems to me that such an imposition clearly violates the directive of Browning-Ferris Industries, Inc. v. Kelco Disposal, Inc., 492 U.S. 257, 279, 106 L. Ed. 2d 219, 109 S. Ct. 2909 (1989), that the jury's punitive damages verdict be bound by the confines of state, and not federal, law. See also Erie R.R. Co. v. Tompkins, 304 U.S. 64, 82 L. Ed. 1188, 58 S. Ct. 817 (1938). Moreover, Mattison appears to rewrite Haslip as Justice O'Connor, the sole Dissenter in that case, would have written it. See Haslip, 111 S. Ct. at 1061 (O'Connor, J., Dissenting) (suggesting that the seven Haslip factors should be given to the juries to assist them in making \"fair, rational decisions\"). As such, Mattison sets forth several lines of analysis either explicitly or implicitly rejected by the Haslip majority, including the void for vagueness analysis.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e Thus, while I would agree that the court in Haslip had no occasion to address the applicability of its decision to federal courts sitting in diversity, such lack of consideration does not justify the adoption of the sole Dissenter's approach as the proper rule. Yet in Mattison, and now in Hugo's Skateway, the Fourth Circuit's imposition of jury instructions patterned after Haslip does just that.\n\nUnlike the majority, I would affirm the jury's punitive damages award to Johnson in the instant case. I do not perceive how affirming the award, i.e., upholding the exact amount the jury has assessed, creates any conflict with the Seventh Amendment. The result, rather, carries out the Seventh Amendment's intent that no fact in a jury verdict \"shall be otherwise reexamined in any Court of the United States, than according to the rules of the common law.\" Cf. Grunenthal, 393 U.S. at 157.\n\nFor the foregoing reasons, I respectfully Dissent from that portion of the majority opinion vacating and remanding, on due process grounds, the punitive damages award.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e Otherwise, I concur.\n\nLUTTIG, Circuit Judge, Concurring in part and Dissenting in part:\n\nA panel of this court in Mattison v. Dallas Carrier Corp., 947 F.2d 95 (4th Cir. 1991), misread the Supreme Court's recent decision in Pacific Mut. Life Ins. Co. v. Haslip, 113 L. Ed. 2d 1, 111 S. Ct. 1032 (1991), constitutionalized under the Fifth and Fourteenth Amendments the \"factors\" that Alabama courts may but are not required to consider when reviewing punitive damages awards for excessiveness, effectively incorporated the equivalent of those seven factors into South Carolina law and, to avoid a perceived violation of the Seventh Amendment, required that federal courts instruct juries as to these factors when applying the law of South Carolina in federal diversity cases. Today, the court en banc embraces this misreading of Haslip and imposes those same factors on yet another state, the Commonwealth of Virginia, effectively directing that it, too, in the name of due process, incorporate these factors into its law on punitive damages and that federal juries in this state as well be instructed to apply these factors.\n\nAs in Mattison, the substance of the court's holding is neither acknowledged by the court nor immediately apparent from its opinion. Its holding effectively invalidates Virginia's punitive damages scheme under the Fourteenth Amendment and imposes upon the state a federal common law. Rather than acknowledge that this is its holding, the court discerns a \"suggestion, at least\" of \"an amenability of the Virginia courts to the use of a Haslip -type inquiry.\" Ante at 16. Then, on the strength of this \"suggestion,\" it concludes that Virginia law must be understood to incorporate the Haslip factors. The court is unable to find an \"amenability\" in Virginia law to all of the factors that it imposes on the state. It imposes these factors nonetheless, on the \"expectation\" that Virginia would read Haslip, as this court did in Mattison, to require their consideration and that the state would \"amplify\" its law accordingly, see id.\n\nNotwithstanding the court's effort to portray it otherwise, the fact remains that Virginia did not require, prior to today, consideration of the factors that the court now impresses upon the Commonwealth. As the court itself ultimately must acknowledge, \"the law [of Virginia] would not necessarily appear explicitly to direct in each case the same sort of review deemed acceptable by the Supreme Court in Haslip.\" Id. In reality, therefore, the court sub silentio invalidates the Commonwealth's punitive damages scheme under the Fourteenth Amendment because it does not require consideration of the seven Haslip factors (or their equivalent), imposes these factors on the state under the same authority, and then directs federal courts pursuant to the Fifth and Seventh Amendments to instruct federal juries as to the factors newly imposed on the state.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003ea\n\nVirginia's punitive damages scheme, when applied by federal courts sitting in diversity cases, provides an array of constraints that focus the jury's discretion on the legitimate state objectives of punishment and deterrence. The jury receives instructions that are in principle indistinguishable from (and indeed more constraining than) those explicitly upheld in Haslip. The district court reviews punitive damages awards for excessiveness under Federal Rules of Civil Procedure 50 and 59, applying, in accordance with the Supreme Court's decision in Browning-Ferris Indus. v. Kelco Disposal, Inc., 492 U.S. 257, 106 L. Ed. 2d 219, 109 S. Ct. 2909 (1989), Virginia's own standards for evaluating the reasonableness of such awards. We, in turn, review the district court's determinations for abuse of discretion. And finally, and not insignificantly, no punitive damages award may exceed $350,000. Va. Code Ann. § 8.0138.1. This \"panoply of procedural protections,\" see Haslip, 111 S. Ct. at 1046, amply satisfies arguably the only due process standard set forth by the Court in Haslip -- namely, that punitive damages awards be rationally related to the legitimate state objectives of punishment and deterrence.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003ea\n\nI would sustain the Commonwealth's punitive damages scheme as applied by the district court below. I respectfully Dissent from the court's sub silentio invalidation of that scheme as violative of the Fourteenth Amendment as well as from its order under the Fifth and Seventh Amendments that federal district courts read into the law of Virginia the \"factors\" constitutionalized by this court in Mattison and instruct federal juries to consider these factors when awarding punitive damages.\n\nI.\n\nThe court's decision was foreordained by its misreading of Haslip in Mattison as holding that trial or appellate court review of punitive damages awards for \"excessiveness\" is insufficient as a matter of federal constitutional law -- regardless of the constraints on the jury's discretion -- and that the Due Process Clauses of the Fifth and Fourteenth Amendments require application of the factors that Alabama courts are permitted to consider, or their equivalent, when that state's courts conduct excessiveness review of punitive damages awards. See 947 F.2d at 105 (\"The inference is left [in Haslip] that the broad discretion given juries under the laws of Vermont and Mississippi is not adequately checked by court review based on a standard of excessiveness.\"); id. at 106 (\"Apparently, the Court in Haslip concurs in [our] assessment that a standard of 'excessiveness' is not meaningful.\") (citing Haslip, 111 S. Ct. at 1045 n.10). The court's misreading of Haslip is traceable directly to its misunderstanding of Haslip's footnote 10, and the opinion text upon which the footnote elaborates. In that passage, the Supreme Court observed that the Alabama Supreme Court's application of \"the detailed substantive standards it has developed for evaluating punitive awards\" distinguished the Alabama scheme from the Vermont and Mississippi schemes about which various Justices had \"expressed concern\" in Browning-Ferris and Bankers Life \u0026 Casualty Co. v. Crenshaw, 486 U.S. 71, 100 L. Ed. 2d 62, 108 S. Ct. 1645 (1988), respectively. 111 S. Ct. at 1045 \u0026 n.10. The Mattison court understood the Supreme Court in this footnote to be distinguishing Alabama's scheme from Vermont's and Mississippi's based on the existence of the seven factors, and on this understanding it read the footnote to impose a constitutional requirement that those factors be applied when awarding punitive damages.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003ea\n\nThe Mattison court's misreading of footnote 10 is somewhat understandable, given that the Court cites to Central Ala. Elec. Coop. v. Tapley, 546 So. 2d 371, 377-78 (Ala. 1989) -- a case that recites in some detail the seven factors that may be considered by the Alabama courts -- as the authority for its observation that Alabama applies \"detailed substantive standards\" and, given further, that immediately thereafter the Court states that \"this\" distinguishes Alabama's from Vermont's and Mississippi's schemes. It is apparent, however, from reading the balance of footnote 10 and the entire textual passage in which footnote 10 appears that the Court distinguished Alabama's scheme not on the basis that Alabama's courts are required to consider the seven factors but, rather, on the basis that its courts \"review to ensure that [punitive damages] awards do[] 'not exceed an amount that will accomplish society's goals of punishment and deterrence,'\" 111 S. Ct. at 1045 (quoting Green Oil Co. v. Hornsby, 539 So. 2d 218, 222 (Ala. 1989)). The Court, for example, went on to explain following the sentence in which it refers to Alabama's detailed standards that:\n\nin particular, [the Alabama Supreme Court] makes its review to ensure that the award does 'not exceed an amount that will accomplish society's goals of punishment and deterrence.' This appellate review makes certain that the punitive damages are reasonable in their amount and rational in light of their purpose to punish what has occurred and to deter its repetition.\n\nId. (citations omitted) (emphasis added). It then contrasted in footnote 10 Alabama's scheme with those in Vermont and Mississippi, where awards are reviewed, respectively, only for \"manifest[] and gross[]\" excessiveness and for \"passion, bias and prejudice on the part of the jury so as to shock the conscience.\" Id. at 1045 n.10.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003ea\n\nThat the review to ensure that awards do no more than further the state's twin interests of punishment and deterrence was the distinguishing feature, and not the existence of the seven-factor inquiry, is confirmed by the fact that not even in Alabama is consideration of the seven factors required\u003cspan class=\"fnref\"\u003e5\u003c/span\u003ea -- a fact of which the Court expressly took note. See, e.g., Haslip, 111 S. Ct. at 1045 (these factors are simply ones that \"could be taken into consideration\") (emphasis added); id. at 1044 (\"among the factors deemed 'appropriate for the trial court's consideration' are . . .\") (quoting Hammond v. City of Gadsden, 493 So. 2d 1374, 1379 (Ala. 1986)); see also id. at 1061 (O'Connor, J., Dissenting) (\"The trial court and other reviewing courts may -- but are not required to -- take these factors into consideration in determining whether a punitive damages award is excessive.\") (citation omitted) (emphasis added). Indeed, the Alabama Supreme Court's opinion reviewed in Haslip, although post-dating both Central Alabama and Green Oil, neither cited these cases nor mentioned the seven factors outlined in those cases\u003cspan class=\"fnref\"\u003e6\u003c/span\u003ea -- also a fact of which the Court was aware.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003ea Therefore, if the Supreme Court had held that consideration of the seven factors or their equivalent was constitutionally required, it would have had to reverse and remand rather than affirm the Alabama Supreme Court decision under review.\n\nIn sum, the panel in Mattison simply misread the Supreme Court's decision in Haslip as requiring, as a matter of constitutional law, consideration of the seven so-called Haslip factors when reviewing punitive damages awards.\n\nII.\n\nAlthough in holding that consideration of the seven Haslip factors is constitutionally required, the court assumes that appellate review is mandated under the Due Process Clause, Haslip does not so hold. If appellate review is required, however, the excessiveness review conducted by the federal courts under Rules of Civil Procedure 50 and 59 amply satisfies the requirements of due process.\n\nA.\n\nThe majority adopts Mattison's unstated assumption that appellate review of jury-awarded punitive damages is essential under the Fifth and Fourteenth Amendments, even if instructions channel a jury's discretion sufficiently to satisfy due process.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003ea Such an assumption finds some support in the Haslip Court's emphasis on the presumptive constitutionality of the common law methodology for imposing punitive damages, which includes judicial review for reasonableness. See Haslip, 111 S. Ct. at 1042; id. at 1043 (\"In view of this consistent history, we cannot say that the common-law method for assessing punitive damages is so inherently unfair as to deny due process and be per se unconstitutional.\"). It is not entirely clear that appellate review is invariably required under the Due Process Clause, however. The\n\nSupreme Court in Haslip did not hold that review of a jury's punitive damages award is constitutionally necessary. The Court simply upheld Alabama's punitive damages scheme as a whole, two features of which happened to be review by both the trial courts and the Alabama Supreme Court. It nowhere stated that each feature of the state's scheme was constitutionally required, and it repeatedly emphasized that its decision was narrowly confined only to whether Alabama's scheme (and perhaps only the single award at issue in that case) comported with the requirements of due process: \"We need not, and indeed we cannot, draw a mathematical bright line between the constitutionally acceptable and the constitutionally unacceptable that would fit every case.\" 111 S. Ct. at 1043; see also id. (\"Our task today is to determine whether the Due process Clause renders the punitive damages award in this case constitutionally unacceptable.\") (emphasis added); id. (\"With these concerns in mind, we review the constitutionality of the punitive damages awarded in this case.\") (emphasis added). Indeed, Justice Scalia, writing separately, criticized the Haslip majority for announcing only a \"jury-like verdict [that] provides no guidance as to whether any other procedures are sufficiently 'reasonable,' and thus perpetuating the uncertainty that our grant of certiorari was intended to resolve.\" Id. at 1046-47 (Scalia, J., Concurring in the judgment).\n\nI question whether appellate review is constitutionally required, at least where as here, the jury not only received specific instructions that substantially constrained its discretion,\u003cspan class=\"fnref\"\u003e9\u003c/span\u003ea but also was statutorily limited in the amount of punitive damages it could award.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003ea The Supreme Court stated in Haslip that \"as long as the [jury's] discretion is exercised within reasonable constraints, due process is satisfied.\" 111 S. Ct. at 1044. It specifically approved the state's jury instructions because they \"confined [the jury's discretion] to deterrence and retribution,\" and \"enlightened the jury as to the punitive damages' nature and purpose.\" Id.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003ea And it characterized the Alabama Supreme Court's review as \"an additional check on the jury's or the trial court's discretion.\" Id. at 1045.\n\nB.\n\nIf some form of appellate review is constitutionally required, however, I believe that a review for \"excessiveness\" under Federal Rules of Civil Procedure 50 and 59 (which in turn is informed by the relevant state law), followed by review in the court of appeals for abuse of discretion, fully satisfies the strictures of the Due Process Clause -- at least where, as here, the jury was adequately instructed as to the limited retributive and deterrent purposes of punitive damages and its award was subject to Virginia's statutory ceiling.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003ea In a federal diversity of citizenship case, the district court reviews punitive damages awards for excessiveness, on either a motion for judgment as a matter of law under Rule 50 or a motion for a new trial under Rule 59. That excessiveness inquiry is framed by the law of the forum state, here Virginia. Writing for a unanimous Supreme Court in 1989, Justice Blackmun set forth the guidelines for this inquiry:\n\nIn a diversity action, or in any other lawsuit where state law provides the basis of decision, the propriety of an award of punitive damages for the conduct in question, and the factors the jury may consider in determining their amount, are questions of state law. Federal law, however, will control on those issues involving the proper review of the jury award by a federal district court and court of appeals.\n\nIn reviewing an award of punitive damages, the role of the District Court is to determine whether the jury's verdict is within the confines set by state law, and to determine, by reference to federal standards developed under Rule 59, whether a new trial or remittitur should be ordered. The Court of Appeals should then review the District Court's determination under an abuse-of-discretion standard.\n\nBrowning-Ferris, 492 U.S. at 278-79 (footnote and citations omitted).\u003cspan class=\"fnref\"\u003e13\u003c/span\u003ea\n\nThe district court thus applies \"the proper state-law standard in considering whether the verdict returned was excessive,\" id. at 280 (emphasis added), by reference to the appropriate federal standard of review (i.e., the review dictated by Rules 50 and 59).\u003cspan class=\"fnref\"\u003e14\u003c/span\u003ea See, e.g., American Business Interiors, Inc. v. Haworth, Inc., 798 F.2d 1135, 1146 (8th Cir. 1986) (\"We are guided by the law of the forum state in weighing the excessiveness of a verdict.\"); Mason v. Texaco, 948 F.2d 1546, 1559-60 (10th Cir. 1991) (same), cert. denied, 118 L. Ed. 2d 547, 112 S. Ct. 1941 (1992). And the court of appeals thereafter reviews the district court's judgment for abuse of discretion.\n\nThis review by the district court and court of appeals, provided the courts consider only the evidence presented to the jury and judicially noticeable facts, see Fed. R. Evid. 201, is unassailable under the Seventh Amendment.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003ea Whether a verdict is \"excessive\" (i.e., whether under Rule 50 there is substantial evidence to support the verdict or whether under Rule 59 the verdict is against the clear weight of the evidence) is a legal question for the court, not a factual question for the jury. See, e.g., Kennon v. Gilmer, 131 U.S. 22, 27-30, 33 L. Ed. 110, 9 S. Ct. 696 (1889) (approving remittitur or new trial order when a court determines damages are legally excessive and recognizing such action as being consistent with the Seventh Amendment); Aetna Casualty \u0026 Sur. Co. v. Yeatts, 122 F.2d 350, 352 (4th Cir. 1941) (Rule 50 \"'does not do away with but emphasizes the necessity of a motion for a directed verdict to raise the legal question whether the evidence is sufficient.'\") (emphasis added) (quoting Baten v. Kirby Lumber Corp., 103 F.2d 272, 274 (5th Cir. 1939)); Fed. R. Civ. P. 50(a), 1991 advisory committee's note (\"Action taken under the rule is a performance of the court's duty to assure enforcement of the controlling law and is not an intrusion on any responsibility for factual determinations conferred on the jury by the Seventh Amendment or any other provision of federal law.\") (emphasis added); see also Browning-Ferris, 492 U.S. at 278-80; cf. Grunenthal v. Long Island R.R., 393 U.S. 156, 159, 21 L. Ed. 2d 309, 89 S. Ct. 331 (1968) (\"'We must give the benefit of every doubt to the judgment of the trial Judge; but surely there must be an upper limit, and whether that has been surpassed is not a question of fact with respect to which reasonable men may differ, but a question of law.'\") (quoting Dagnello v. Long Island R.R., 289 F.2d 797, 806 (2d Cir. 1961)).\u003cspan class=\"fnref\"\u003e16\u003c/span\u003ea\n\nThe district court does not, contrary to the apparent belief of the majority, \"find facts\" when it conducts review under Rules 50 and 59; it simply canvasses the record evidence to ascertain whether, when measured against the state's legal standards, there was sufficient evidence introduced to support the jury's award. (It is because its role is so confined, that the reviewing court cannot simply instate an award in an amount that it deems appropriate but, rather, can only grant or deny a motion for judgment or a motion for new trial.) In fact, the Supreme Court flatly rejected in Arkansas Valley Land \u0026 Cattle Co. v. Mann, the contention that a district court's review of damages for excessiveness \"is in effect a re-examination by the court, in a mode not known at the common law, of facts tried by the jury\" and therefore violates the Seventh Amendment. 130 U.S. 69, 72-74, 32 L. Ed.854, 9 S. Ct. 458 (1889). Said the Court, \"it cannot be disputed that the court is within the limits of its authority when it sets aside the verdict of the jury and grants a new trial where the damages are palpably or outrageously excessive.\" Id. at 74. Tasks such as those performed under Rules 50 and 59 are the essence of much of federal district court and appellate review. If this task is constitutionally invalid, as the majority holds, then many of the appellate review functions now performed by the federal courts are likewise constitutionally infirm.\n\nIII.\n\nBecause I would hold that Virginia's punitive damages scheme, as applied by the federal courts, is not unconstitutional, I would review only whether the district court abused its discretion in denying Hugo's Skateway's motion for a new trial or remittitur. I am unable to conclude that it did. The jury found that Hugo's Skateway intentionally discriminated against Johnson, and that Johnson suffered actual damages in the amount of $25,000. Punitive damages seven times this amount of compensatory damages in a case of intentional racial discrimination is not so excessive as to be wholly without reasonable foundation. Racial discrimination is antithetical to the most fundamental principles of the Constitution, and juries should be given wide berth to express their justified intolerance of its persistence.\n\nIV.\n\nI am, like many others, troubled by the increasing number of punitive damages awards that are almost incomprehensible in their magnitude. The effect that these awards have had, and could well continue to have, on our national economy is inestimable. The question before the court, however, is one of constitutional law, not policy. The Supreme Court has already held that punitive damages may be awarded consistently with the Constitution.\n\nThe court today holds that the difference between a constitutional and an unconstitutional punitive damages scheme is whether the court reviewing punitive awards is required to weigh the particular factors that may be considered by the Alabama courts (in which event the scheme is constitutional) or whether it reviews for excessiveness, under Federal Rules of Civil Procedure 50 and 59 (in which event it is unconstitutional). I fail to understand how this is a difference of constitutional dimension, and I do not read the Supreme Court's decision in Haslip to suggest otherwise. I believe the court in Mattison simply misread Haslip. I would rectify that error by overruling Mattison, upholding the Virginia punitive damages scheme as currently applied by federal courts, and affirming the jury's punitive damages award.\n\nAccordingly, while I join in Parts I, II, and IV of the court's opinion, I Dissent from its holding in Part III.\n\nHAMILTON, Circuit Judge, Dissenting:\n\nToday, the court commits two fundamental errors. In the first appellate decision interpreting and applying the Virginia statute, the court allows liability to be vicariously imposed on a business because of its proprietor's status as a racist without proving the plainly required elements necessary for liability under the statute. Liability under the statute is not imposed for being a racist, but rather for subjecting others to \"acts of (i) intimidation or harassment . . . motivated by racial . . . animosity.\" Second, the court, without cause, overturns the at least two-centuries old common law method of awarding punitive damages, as properly applied in Virginia. In its stead, the court substitutes a methodology which requires application of a different punitive damages law in Virginia federal district courts than that applied in Virginia state courts in contravention of Erie Railroad v. Tompkins, 304 U.S. 64, 82 L. Ed. 1188, 58 S. Ct. 817 (1938). I, therefore, respectfully Dissent.\n\nOn appeal, Hugo's raises four issues, which are addressed in turn: (1) Was there sufficient evidence to find Hugo's liable for racially motivated harassment or intimidation under Va. Code § 8.01-42.1? (2) Did the district court err in admitting into evidence an 11-year old consent decree between the Justice Department and Hugo's concerning public access for all persons regardless of race? (3) Did the district court err in not granting a new trial because the damages awarded against Hugo's were excessive? and (4) Did the award of punitive damages violate due process?\n\nI\n\nHugo's argues on appeal that the jury's verdict against it on the racial harassment claim, Va. Code Ann. § 8.01-42.1(A), the only claim upon which plaintiff prevailed against it,\u003cspan class=\"fnref\"\u003e1\u003c/span\u003ec is not supported by substantial evidence and should be overturned. I agree. The majority acknowledges that the liability question is \"close.\" Maj. op. at 6. While our review on this issue is narrow, Foster v. Tandy Corp., 828 F.2d 1052, 1055 (4th Cir. 1987), we may reverse the jury's verdict where there is, in fact, only a \"scintilla of evidence\" in support of the decision. Austin v. Torrington Co., 810 F.2d 416, 420 (4th Cir. 1987), cert. denied, 484 U.S. 977, 98 L. Ed. 2d 487, 108 S. Ct. 489 (1987). Such is the situation in this case.\n\nThe Virginia statute under which Hugo's was found liable to plaintiff states in relevant part:\n\nCivil action for racial, religious, or ethnic harassment, violence, or vandalism. -- A. An action for injunctive relief or civil damages, or both, shall lie for any person who is subjected to acts of (i) intimidation or harassment or (ii) violence directed against his person; or (iii) vandalism directed against his real or personal property, where such acts are motivated by racial, religious, or ethnic animosity.\n\nB. Any aggrieved party who initiates and prevails in an action authorized by this section shall be entitled to damages, including punitive damages . . . .\n\nVa. Code Ann. § 8.01-42.1 (Michie 1991 Supp.) (emphasis added). The statute, by its express terms, contains two necessary elements of proof as applied in this case. Johnson bore the burden of proving that Hugo's (1) committed acts of intimidation or harassment; and (2) such acts were motivated by racism. Johnson proved neither.\n\nA\n\nFirst, addressing the second element, racial motivation, there is more than substantial evidence that Edith Stribling, one of the owners of Hugo's, is racist in her personal views.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003ec As noted by the majority, there was testimony given by a former employee of Hugo's indicating Stribling's personal bias against blacks. There was also testimony concerning racial epithets about blacks employed by Stribling in Discussions with the office staff at Hugo's on occasions other than the one at issue in this case. Finally, the district court admitted evidence of Hugo's non-compliance with a 1979 consent decree, discussed more fully in Part II, infra, for the purpose of demonstrating racial motive.\n\nThe testimony was equally clear, however, and much, if not all, was provided by plaintiff and plaintiff's own witnesses, that whatever Stribling's private attitudes were with respect to blacks, there was no occasion to which any witness could testify where any person had ever been denied admission to the rink because of race or where the rules of the rink had ever been applied in a racially discriminatory manner. See, e.g., Joint Appendix (J.A.), p. 147 (testimony of plaintiff); 195 (testimony of Steele); 227 (testimony of Lane); 317-18, 326 (testimony of S. Crawford); 332 (testimony of C. Crawford). Far from demonstrating any sinister intent as set forth by the majority, Maj. op. at 7, there was also undisputed documentation in the form of ejection slips for rules violations which showed that both white and black patrons had been ejected for violating the rules. The uncontradicted testimony showed that Stribling had called the sheriff's department on a number of prior occasions to expel both white and black patrons. Sharon Crawford, a witness for the plaintiff, and a former employee of Hugo's who had been fired, noted that none of these ejections were racially motivated:\n\nQ.You've seen the Striblings eject white patrons and call the sheriff on white patrons, haven't you?\n\nA.Yes.\n\nQ.You've seen the Striblings call the sheriff and eject black patrons too, haven't you?\n\nA.Yes.\n\nQ.Weren't the reasons for their behavior rather than for their race?\n\nA.Yes. But I know the things that were said.\n\nQ.But the answer is yes, isn't it?\n\nA.Yes.\n\nJ.A. 317-18. The most compelling testimony on this point was provided by this witness who stated, \"I have seen them [blacks] treated like the whites in there to their face. But I know what they [the management] say behind their backs.\" J.A. 326. The evidence is clear that whatever Stribling may have said or believed about blacks, and the evidence is clear that her statements were vulgar and her attitudes racist, Hugo's served all and ejected patrons without regard to race.\n\nThe only evidence even remotely suggesting that Johnson received disparate treatment from Hugo's concerns warnings given before the police were called. There was testimony that Hugo's normally gave two to three personal verbal warnings to patrons prior to ejecting them. J.A. 45, 218-19, 329. The only personal warning Johnson received was the conversation with assistant manager Wright. Nonetheless, either one or two generalized announcements/warnings were given over the public address system prior to the meeting with Wright. Johnson testified that he and his companions understood that the announcements were directed at them even though the specific content of the warnings was obscured by the loud music in the rink. J.A. 205. The majority notes that Stribling made no personal effort to leave the office and go into the noisy skating area to speak with plaintiff. There was no evidence that she ever left the office to personally warn a patron, white or black, prior to calling the police to handle a problem involving that patron. The evidence indicates that all warnings respecting skating were delivered through the floor guards and their supervisor. This evidence is simply too slim a reed upon which to impose liability under the Virginia statute and amounts to no more than the inadequate \"scintilla of evidence\" that cannot sustain the jury's verdict.\n\nJohnson produced no evidence tending to show that Stribling's status as a racist in any way caused her, and vicariously Hugo's, to treat blacks differently in their use and enjoyment of the skating rink. The Virginia statute does not reprobate a deplorable state of mind, but rather liability is imposed for racially motivated acts. No person testified that any employee of Hugo's ever directed a racial epithet at plaintiff or referred to plaintiff in a racially derogatory manner on the night he was attacked by the police officer. There is no direct evidence that Stribling's racist beliefs motivated her to take action against the plaintiff. To conclude that the acts of Hugo's toward Johnson were racially motivated required the jury to draw an inference from circumstantial evidence that Stribling acted out of her racist attitudes. Where, as here, all of the evidence adduced by plaintiff and defendant showed that Hugo's, despite its owner's racism, treated blacks and whites equally with respect to admission and enforcement of the rules, such inference is forced, not reasonable. Without condoning or excusing Stribling's racist attitudes, allowing the judgment to stand on these facts transforms Va. Code Ann. § 8.01-42.1 from a statute providing redress for racially motivated actions to a remedy against people of a certain status--namely, racists--regardless of how they act.\n\nB\n\nIn addition to racial motivation, Johnson also had the burden of proving Hugo's actions against him constituted harassment or intimidation under the terms of the statute. In the instructions to the jury, the court defined harassment and intimidation as follows:\n\nIntimidation means to make a person timid or fearful, to frighten into submission or obedience.\n\nHarassment is vexing, troubling or annoying a person continually or chronically.\n\nJ.A. 395. These instructions are sound and accord with the plain meaning of those terms. Mallard v. U.S. Dist. Court for the Southern Dist. of Iowa, 490 U.S. 296, 301, 104 L. Ed. 2d 318, 109 S. Ct. 1814 (1989) (common dictionary definition accorded statutory term). None of the actions taken by Hugo's toward plaintiff satisfy these definitions.\n\nHugo's first contact with plaintiff was when he entered the rink and paid his admission. Johnson was freely admitted with his white companions and there is absolutely no evidence that any racial slurs or other derogatory comments were directed at Johnson or his group. Johnson had been to Hugo's on several prior occasions and on each he was always freely admitted. On those prior occasions, Johnson had seen other black patrons frequenting Hugo's. On this particular night there were, by happenstance, no other black patrons. Despite the majority's implication to the contrary, no sinister inference can be properly drawn from the absence of other black patrons on the evening in question. The testimony of Sharon Crawford indicated that the number of black patrons on Saturday nights when she worked could vary from twenty-five to fifty out of 250 to 400 total patrons and that the number of blacks frequenting Hugo's was increasing during her last year of employment. Johnson testified that there were usually two or three black patrons in attendance on the other Friday nights he had skated at Hugo's.\n\nJohnson skated on the floor and patronized the refreshment stand for two to three hours without incident. Johnson skated with a black employee of Hugo's, Clarence Lane. All of this was perfectly consistent with Johnson's treatment on several previous visits to Hugo's.\n\nOn approximately two occasions during the evening, general warnings to slow down and move out of the center of the rink were given over the public address system. The warnings were virtually unintelligible because of the loud music in the rink, but Johnson and his companions testified that they generally understood that the warnings were directed at them and they responded accordingly.\n\nThere are only two \"acts\" by Hugo's which could support a finding of harassment or intimidation: (1) assistant manager Wright's meeting with Johnson at the side of the rink to request that Johnson \"come to the back room\" to discuss his skating, and (2) Stribling's call to the police to send an officer to speak with Johnson when he refused to heed Wright's request.\n\nAs to the incident with Wright, the testimony indicated that Wright motioned plaintiff to the side of the rink and asked him to come to a \"back room\" to discuss some aspect of his skating.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003ec Wright's request was neither loud nor abusive. Plaintiff's testimony as to what was said and what was heard during the encounter was not entirely clear or consistent. Generally, he stated that the loudness of the music prevented him from clearly understanding what Wright said. Johnson testified that he understood that Wright's request had some connection with his skating. Plaintiff did not follow Wright to the \"back room\", but ignored his request, returned to skating, and told one of his companions that the meeting had something to do with his skating, but that it was no big deal. See generally J.A. 106, 153-54, 156-57 (testimony of Johnson); 187-88 (testimony of Steele); 206 (testimony of Bowen); 380 (testimony of Wright).\n\nPlaintiff testified to a subjective feeling of intimidation arising from Wright's request to come to a \"back room.\" From an objective standpoint, however, the evidence in no way demonstrates intimidation as correctly defined in the district court's instructions. First, plaintiff simply skated away from Wright, an elderly white man, after the conversation and told a friend it was nothing. This is hardly evidence of being frightened into submission as the court's definition of intimidation required. Second, plaintiff, on a prior visit to Hugo's, had been directed by Wright to a \"back room\" to obtain appropriate equipment (toe plugs) so that he could continue to skate at Hugo's.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003ec This is hardly the kind of service one would expect from an establishment allegedly looking for excuses to exclude black patrons. On that occasion, Johnson found the equipment he needed without incident. This defuses any sinister inference from such request. There is simply nothing, except Johnson's self-serving subjective statement, that would indicate that Wright's conversation with plaintiff was in any way intimidating. Allowing a subjective claim of \"feeling intimidated,\" unsupported by any objective indicia of intimidation, to satisfy the proof requirements under the statute renders the statute a fertile tool for false claims in this sensitive area.\n\nThe encounter with Wright also cannot qualify as harassment as properly defined by the district court. The encounter was brief and polite. There was no harangue or wild gesturing. There was nothing continual or chronic about Wright's actions as required to show harassment. Plaintiff himself stated to his companion immediately after the incident that it was nothing to be concerned about.\n\nThe only other \"act\" directed at plaintiff by Hugo's, which might constitute harassment or intimidation, is Stribling's phone call to the police requesting that an officer be sent to the rink to speak to plaintiff who had refused to accompany Wright off the skating floor to discuss his skating. For the phoning of the police to constitute harassment, it too, must be part of a chronic or continuous pattern of improper behavior toward plaintiff.\n\nTo satisfy this requirement, Wright's meeting with plaintiff must be taken in conjunction with the phone call, for the single phone call, standing alone, could be neither \"chronic\" nor \"continual\". For Wright's meeting and the phone call to be improper, the jury must conclude that there was absolutely no reason for the management of Hugo's to speak to Johnson. The evidence cannot support such an inference.\n\nJohnson himself testified that he had engaged in\"weaving\" among the skaters because he was moving at a faster speed than others and sought to avoid slower skaters. J.A. 159-60. There was also testimony by Charles Crawford, one of plaintiff's witnesses, that \"reckless weaving in or out\" was prohibited by the posted rules of Hugo's. J.A. 335. The majority itself cites to testimony regarding Johnson and some other individual racing to the middle of the rink, joining hands, and spinning in circles, an activity which plaintiff's own witness affirmed was dangerous.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003ec J.A. 229. Johnson testified that Wright attempted to discuss the manner in which he was skating when he motioned plaintiff to the side of the rink. The testimony at trial was undisputed that Hugo's strictly enforced, indeed overzealously enforced, the rules of the rink. It was equally undisputed, however, that such enforcement was carried out without regard to race.\n\nTaking the evidence as a whole, a reasonable jury could conclude that Johnson's skating that night was not, in fact, endangering the safety of other patrons. To conclude, however, that Wright had absolutely no reason whatsoever to approach the plaintiff, speak to him, and ask him to come to a back room to discuss his skating where the music would not drown out the conversation is not reasonable. To the extent Wright's meeting with plaintiff had a reasonable basis and plaintiff refused to comply, the subsequent phone call cannot be considered harassment.\n\nThe same reasoning applies with respect to intimidation. Even a properly conducted encounter with a police officer can be intimidating, i.e., a person would tend to yield to the officer's request. Here, the officer was summoned to compel compliance with Wright's request of plaintiff to leave the skating floor and discuss his skating in another location.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003ec To the extent there was some basis for the request to plaintiff, the \"intimidation\" of summoning an officer was justified, otherwise, the simple summoning of a police officer where one party is black and another white could lead to liability under the statute even where the call was justified on some basis other than race.\n\nThe majority notes that the police officer involved in this case, Wines, had previously worked for Hugo's. This fact means nothing, however, because, as the district court concluded, there was absolutely no evidence showing that Hugo's had (1) requested Wines be sent when the police were phoned, (2) directed Wines to arrest plaintiff, or (3) instructed Wines to brutalize the plaintiff. The evidence shows that it was mere happenstance that Wines responded to the call that evening.\n\nIn short, the evidence in this case is wholly insufficient to satisfy the requirements of liability under the statute. There is, at best, a mere \"scintilla of evidence\" showing any causal connection between Stribling's racist attitudes and the acts taken with respect to Johnson. In addition, the two acts taken by Hugo's do not meet the defined requirements for liability. Judgment as a matter of law should have been entered for Hugo's. Fed. R. Civ. Proc. 50.\n\nC\n\nThe jury's verdict against Hugo's should also be reversed because it is unreasonable and a miscarriage of Justice when compared with the verdict rendered against Wines. As stated supra, note 1, Hugo's was found liable only under count III, the racial intimidation statute. All other counts, which depended on joint action between Wines and Hugo's, were dismissed by directed verdict. There was no evidence of any concerted activity. As the majority correctly notes, the conduct of Wines must be isolated from the conduct of Hugo's when assessing the liability of Hugo's.\n\nThe only proper evidence of racial motivation by Hugo's was racial epithets employed by Stribling on other occasions. As previously noted, the statute does not reprobate a deplorable state of mind, but rather deplorable acts. There was no direct evidence linking Stribling's racist views to the actions taken against Johnson. As to Wines, the evidence was quite to the contrary. The evidence showed that Wines, who brutally beat the plaintiff and had him imprisoned overnight, employed racial epithets, such as \"stupid nigger,\" against the plaintiff and used profanity at the very time he was brutalizing the plaintiff. J.A. 114, 119, 137, 140-41. No one can seriously dispute that Wines' actions were intimidating or harassing.\n\nIncredibly, the jury did not find Wines liable under the same statute. Other than the direct or indirect nature of the epithets employed, the only difference in the evidence of racial animus on the part of Hugo's and Wines was the consent decree used against Hugo's. As discussed under Part II, infra, it is all the more likely that the jury misused the consent decree and is punishing Hugo's for violation of that decree or for Wines' conduct.\n\nII\n\nHugo's also objected to the admission into evidence of the decadeold consent decree between it and the United States Department of Justice. The decree required Hugo's to post certain notices on the premises stating that the facility was open to all without regard to race. The decree also required Hugo's to specifically instruct employees that equal access, regardless of race, was required. The decree was not an admission that Hugo's had ever, in fact, discriminated in admissions on the basis of race. The evidence was substantial that Hugo's had not posted the notices or so instructed its employees in violation of the decree. The evidence was also unrefuted, however, that Hugo's was open to and served all persons, regardless of race, and that the employees understood this obligation. Though not complying with the form of the decree, Hugo's, at least on the evidence before the district court, was complying with the goal and purpose of the decree.\n\nHugo's initially argued that the decree should be excluded under Fed R. Evid. 408, which generally excludes evidence of settlements and settlement negotiations to prove \"liability for or invalidity of the claim or its amount.\" Id. The decree clearly could not be offered to show that Hugo's had discriminated against blacks in the past. Rule 408 does allow admission for other purposes \"such as proving bias or prejudice of a witness, negativing a contention of undue delay, or proving an effort to obstruct a criminal investigation or prosecution.\"\n\nThe district court admitted evidence of non-compliance with the decree for the limited purpose of demonstrating Hugo's racial motivation on the evening Johnson was attacked by Wines. The district court instructed the jury to that effect. As noted by the majority opinion, the decision to admit this type of evidence is committed to the sound discretion of the district court. United States v. Heyward, 729 F.2d 297, 310 n.2 (4th Cir. 1984). It is also true that we should generally follow the presumption that the jury obeyed the limiting instructions of the court. Yates v. Evatt, 114 L. Ed. 2d 432, 111 S. Ct. 1884, 1893 (1991). This is one of those \"extraordinary\" situations, Heyward, 729 F.2d at 310 n.2, where deference should not be given.\n\nAs to the admission of the decree, the only real question is whether the prejudicial effect outweighed the probative value of the decree with regard to motive, such that it was an abuse of discretion to admit the decree, even with a limiting instruction. Fed. R. Evid. 403. The probative value as to the issue of motivation was slight. Though the testimony was clear that Hugo's had not followed the technical requirements of the decree by posting notices and instructing employees on equal access regardless of race, the evidence was equally clear that Hugo's had never denied admission to any person on the basis of race; therefore, the goal of the decree was fully satisfied. Where, as here, Hugo's failed in technical compliance, but nonetheless conformed to the substance of the settlement, no inference can be reasonably drawn that Hugo's was more likely than not to act from racial motives to the detriment of black patrons as alleged in this particular case.\n\nThe potential abuse of the decree is readily apparent. This was neither a public accommodations case nor a contempt proceeding on the consent decree. Regardless of the instruction, the jury could easily have considered the decree as an admission that Hugo's had discriminated in the past and, therefore, most probably did so on the occasion at issue in this case. At the very least, the jury may have felt compelled to punish non-compliance with the decree's specific terms, a matter established by the evidence although not an issue properly redressable in this case. The ease with which the decree is misused is readily demonstrated.\n\nFirst, plaintiff, in his supplemental brief, constantly refers to a violation of the decree, not for the purpose of showing animus, but for the purpose of arguing that Hugo's failure to comply with the decree should be punished by the jury; therefore, the $175,000 punitive damages award was justified. See Plaintiff's Supplemental Br. at 30-31. Since this is not a contempt hearing with respect to the consent decree, all such argumentation is highly improper. The district court's limiting instruction specifically charged that the decree was to be used for no purpose other than deciding whether or not Hugo's was motivated by racial animus.\n\nSecond, and most compelling, is the manner in which the nowvacated panel opinion addressed the consent decree. As noted, the district court admitted the decree solely for the purpose of determining whether or not Hugo's possessed the necessary animus to satisfy the statute. The opinion for the panel specifically referenced the decree as proof that Hugo's had engaged in \"blatant racial discrimination resulting in harassment and intimidation\" which had \"long endured\" because the evidence indicated that Hugo's had not complied with its terms over the entire period of the decree. This \"fact\" was cited as possible justification for the excessive punitive damages awarded by the jury in this case. See Johnson v. Hugo's Skateway, 949 F.2d 1338, 1351 (4th Cir. 1991), vacated, No. 90-2499 (Order filed January 15, 1992). This use of the consent decree was precisely the type use the limiting instruction was designed to preclude. This was not a contempt proceeding to punish non-compliance with the decree. If this court can so easily confuse this evidence, it is highly probable, indeed likely, given the evidence in the case and the odd disproportionality of the monetary awards, a fact even the majority acknowledges, that the jury misused the evidence in awarding an amount of compensatory and punitive damages.\n\nBecause the prejudicial effect of admitting the decree is readily apparent and the probative value is slight, the judgment of the district court should be reversed. If judgment as a matter of law is not entered, Hugo's should at least receive a new trial excluding the consent decree.\n\nIII\n\nHugo's also challenges the amount awarded by the jury as excessive, therefore, requiring a new trial at least with respect to damages, both compensatory and punitive. As set forth in Part I of this Dissent, no liability should be assessed in the first instance; therefore, any damage award is inappropriate. Even if liability were established, however, remand for a new trial as to damages would be appropriate because the amounts awarded by the jury against Hugo's were \"untoward, inordinate, unreasonable [and] outrageous\" in light of the evidence presented at the trial. See Spell v. McDaniel, 824 F.2d 1380, 1400 (4th Cir. 1987) (citing Grunenthal v. Long Island R.R. Co., 393 U.S. 156, 160, 21 L. Ed. 2d 309, 89 S. Ct. 331 (1968)), cert. denied sub nom., City of Fayetteville v. Spell, 484 U.S. 1027, 98 L. Ed. 2d 765, 108 S. Ct. 752 (1988).\n\nThe jury assessed $25,000 in compensatory and $175,000 in punitive damages against Hugo's. Wines was assessed $200 in compensatory and $500 in punitive damages.\n\nThe district court abused its discretion in not awarding a new trial because the compensatory and punitive damages awarded to the plaintiff against Hugo's are clearly excessive given Hugo's culpability. This is apparent for two reasons. First, as previously noted and as the majority acknowledges, the acts of Wines must be completely isolated from those of Hugo's in determining liability. If Wines had simply come to the rink and merely spoken with the plaintiff about his skating, this case would, in all likelihood, have never been filed. It is utterly preposterous, under those circumstances, to conclude that Johnson would have suffered mental anguish and personal humiliation, the only type of compensatory damages charged with respect to Hugo's, in the amount of $25,000, by a properly conducted encounter with a policeman or that $175,000 was necessary to punish and deter Hugo's from overzealously enforcing the rules of the rink.\n\nThis Conclusion is reinforced when examining the evidentiary foundation for the compensatory damages. The only mental anguish and humiliation to which plaintiff testified was that anguish and humiliation occurring as Wines arrested and brutalized him in front of his companions and other Hugo's patrons. J.A. 115-16. One would rightfully expect plaintiff to suffer anguish and humiliation as a result of Wines' acts. As to plaintiff's encounter with Wright at the side of the skating rink, however, plaintiff's own testimony was that he simply ignored Wright's request and told one of his skating companions that the incident was nothing. It seems intuitively wrong that a proper encounter with a police officer or the meeting with Wright would cause 125 times the mental and emotional anguish ($25,000/$200 = 125) caused by an encounter where the policeman slammed plaintiff to the floor in front of his friends and others, placed his knee in plaintiff's back and choked him so that he foamed at the mouth and could not breathe, cursed at his friends who expressed concern, called him a \"stupid nigger\" and a \"dumb ass,\" handcuffed him, and imprisoned him overnight.\n\nOne must conclude, from the size of the award, that the jury impermissibly punished Hugo's on account of one or two things: (1) the actions of Wines in brutalizing plaintiff, or (2) violation of the consent decree, as discussed under Part II, supra. Simply dismissing the disparity in the awards against Hugo's and Wines on the predilection of the jury for punishing racial harassment as the more heinous wrong is an abandonment of the appellate function. The instructions limited compensatory recovery to mental and emotional anguish. The only evidence of such anguish to which plaintiff testified was that caused by Wines. Common sense and the evidence before the jury indicate that such anguish and distress as plaintiff did experience should be principally, if not totally, attributed to Wines on the facts of this case.\n\nIV\n\nWhile agreeing with Hugo's and the majority that the award of punitive damages should be vacated, I do so only for the reasons set forth in Parts I-III, supra, of this Dissent and on the basis set forth more fully in this part. I emphatically reject Hugo's suggestion and the majority's holding that the Supreme Court's decision in Pacific Mutual Life Ins. Co. v. Haslip, 113 L. Ed. 2d 1, 111 S. Ct. 1032 (1991), mandates that we find the Virginia scheme for assessing punitive damages, as applied in this case, violates the due process provision of the Fifth Amendment. I would overrule our decision in Mattison v. Dallas Carrier Corp., 947 F.2d 95 (4th Cir. 1991), which I believe erroneously elevates the Dissent in Haslip to the law of this circuit, and reaffirm the applicability of the common law methodology for imposing punitive damages as applied in Virginia.\n\nThe resolution of this issue turns on what requirements, if any, are imposed on awards of punitive damages under state law in federal courts following the Supreme Court's ruling in Haslip. The Discussion of this issue is divided into three parts: (A) a Discussion of the holding in Haslip, (B) an application of Haslip to the present case, and (C) a review of the majority's use of Haslip and Mattison in this case.\n\nA\n\nIn Haslip, the Supreme Court specifically noted that the Court, on more than one occasion, both before and after enactment of the Fourteenth Amendment, had approved the common law method of assessing punitive damages and had specifically held that such method does not violate the Fourteenth Amendment. Haslip, 111 S. Ct. at 1042-43. The court stated, \"So far as we have been able to determine, every state and federal court that has considered the question has ruled that the common-law method for assessing punitive damages does not in itself violate due process.\" Id. at 1043 (emphasis added). The opinions of Justice Scalia, id. at 1046-54, and Justice Kennedy, id. at 1054-56, Concurring in the judgment, would have ended the inquiry here. Nonetheless, the majority opinion of five Justices (Justice O'Connor Dissented and Justice Souter did not participate) proceeded to a casespecific analysis of the Alabama law and procedures at issue in the case.\n\nIn concluding that Alabama punitive damages law did not deny due process, the Court first addressed the jury instructions under Alabama law regarding whether punitive damages may be awarded and the amount of such damages. As to whether punitive damages were available, the Alabama instructions stated that willful misconduct, namely fraud, had to be proved as a prerequisite to assessing punitive damages. Id. at 1037 n.1. The Court, on the other hand, focused on those portions of the instructions delimiting the amount of an award. The Court noted that the instructions specifically informed the jury of the purposes of punitive damages: punishment and deterrence. Id. at 1044. Examination of the jury instructions shows that in computing the amount, if any, of punitive damages, the jury was specifically to take into account those purposes and the character and degree of the wrongdoing. Id. at 1037 n.1. Under Alabama law, consideration of defendant's wealth was not permitted. Id. at 1044 (citing Southern Life \u0026 Health Ins. Co. v. Whitman, 358 So.2d 1025, 1026-27 (Ala. 1978)).\u003cspan class=\"fnref\"\u003e7\u003c/span\u003ec\n\nThe Court acknowledged that the instructions \"gave the jury significant discretion in its determination of punitive damages.\" Id. at 1044 (emphasis added). However, the Court held, with regard to the instructions, as follows:\n\nThat discretion was not unlimited. It was confined to deterrence and retribution, the state policy concerns sought to be advanced. And if punitive damages were to be awarded, the jury \"must take into consideration the character and the degree of the wrong as shown by the evidence and necessity of preventing similar wrong.\" . . . The instructions thus enlightened the jury as to the punitive damages' nature and purpose, identified the damages as punishment for civil wrongdoing of the kind involved, and explained that their imposition was not compulsory.\n\nThese instructions, we believe, reasonably accommodated Pacific Mutual's interest in rational decisionmaking and Alabama's interest in meaningful individualized assessment of appropriate deterrence and retribution. The discretion allowed under Alabama law in determining punitive damages is no greater than that pursued in many familiar areas of the law as, for example, deciding \"the best interests of the child,\" or \"reasonable care,\" or \"due diligence,\" or appropriate compensation for pain and suffering or mental anguish. As long as the discretion is exercised within reasonable constraints, due process is satisfied.\n\nId. at 1044 (emphasis added). The court thus held that the Alabama jury instructions, standing alone, were sufficiently specific and restrictive of jury discretion, in determining the amount of punitive damages to be awarded, to satisfy due process concerns.\n\nThe Court went on to discuss post-trial procedures employed by Alabama, as a matter of state law, to evaluate punitive damage awards. The Court, quoting Alabama case law, noted that the legal ground for interfering with a jury's punitive damages award under Alabama law is \"excessiveness.\" Id. at 1044 (quoting Hammond v. City of Gadsden, 493 So. 2d 1374, 1379 (1986)). The Alabama courts have set forth a number of factors to which the trial and appellate courts of Alabama should look to reach the legal Conclusion as to \"excessiveness,\" including, among other things, the culpability of the defendant, the likely deterrent effect, the effect on the parties, and the impact on non-parties. Haslip, 111 S. Ct. at 1044. The Supreme Court approved this methodology as \"meaningful and adequate review.\" Id. The Court did not and never has ruled that a legal standard of \"excessiveness\" governing review of punitive damages violates due process.\n\nThe Court stated that the type of review of punitive damage awards conducted in Alabama was \"an additional check,\" not a necessary check, on jury discretion where the jury instructions already constrained that discretion as noted above. Id. at 1045. Haslip does not hold that review incorporating all or some number of the review factors applied in Alabama is required in order for another state's scheme to satisfy due process. It is also important to note that the Alabama factors are a series of factual determinations, which taken together, lead to a legal Conclusion under Alabama law that an award was or was not excessive. Haslip does not establish Alabama law as the paradigm by which all other state or federal punitive damages schemes are to be Judged. As Justice Scalia properly notes in his concurrence in the judgment, the Haslip majority opinion \"provides no guidance as to whether any other procedures are sufficiently \"reasonable.\" Id., 111 S. Ct. at l046-47 (emphasis in the original).\n\nB\n\nThe jury instructions and the scheme of review provided in this case also satisfy due process as explicated in Haslip.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003ec Hugo's admits, as it must, that the district court's instructions correctly and fully stated Virginia law on the subject of punitive damages.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003ec Hugo's Supplemental Brief at 25. The instructions by the district court are more clear and concise, but otherwise indistinguishable from the instructions specifically approved in Haslip as satisfying due process. Hugo's argument and the majority's holding that these instructions are \"standardless\" with respect to the amount of punitive damages are utterly without support in Haslip. The instructions set forth the purpose for awarding an amount of punitive damages (punish defendant and deter defendant and others), set forth an evidentiary standard for concluding that the evidence warrants a punitive damage award (preponderance), set forth the elements that must be found before punitive damages may be awarded (entitlement to actual damages, intentional wrongdoing, unanimity on the issue), define certain terms, and specifically reiterate that the amount of punitive damages, if any, should be based on the conditions and purposes for such damages, should reflect reasoned and sober judgment, and should exclude passion and prejudice. See supra n.9.\n\nThese instructions, standing alone, satisfy due process under the \"standard\" of Haslip. The instructions do not charge the jury to simply \"do what you think best.\" Haslip, 111 S. Ct. at 1056 (O'Connor Dissenting)(quoting Browning-Ferris Industries v. Kelco Disposal, Inc., 492 U.S. 257, 281, 106 L. Ed. 2d 219, 109 S. Ct. 2909 (1989)(Brennan, Concurring)).\n\nThe jury's discretion is specifically limited by the purposes for which punitive damages are awarded: punishment and deterrence.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003ec Haslip, 113 L. Ed. 2d 1, 111 S. Ct. 1032 . The jury's discretion in setting the amount of a punitive damage award is indeed broad, just as in Haslip. However, the majority's claim that the instructions provide no standard for quantitatively assessing punitive damages in this case is simply without support in the record or in Haslip.\n\nReview of the punitive damage award in this case also comports with due process. The review in Haslip was conducted under Alabama law by Alabama state courts. Alabama courts review jury verdicts awarding punitive damages for \"excessiveness.\" Haslip, 111 S. Ct. at 1044 (citing Hammond v. City of Gadsden, 493 So. 2d 1374). On motions to set aside the verdict as excessive, trial courts must set forth in the record the specific reasons \"for interfering with a jury verdict, or refusing to do so, on grounds of excessiveness of the damages.\" Hammond, 493 So. 2d at 1379. A number of factors are considered, both by the trial court and the appellate courts, in reaching the Conclusion as to \"excessiveness,\" See Haslip, 111 S. Ct. at 1045 (listing factors). Under Alabama law, the trial and appellate courts are apparently permitted to consider evidence not placed before the jury. Cf. Id. at 1044 (evidence of defendant's wealth excluded)(citing Southern Life, 358 So. 2d at 1026-27); Haslip, 111 S. Ct. at 1045 (\"financial position\" of defendant considered on review)(citing, e.g., Central Alabama Electric Cooperative v. Tapley, 546 So.2d 371 (Ala. 1989)). Alabama appellate courts appear to conduct a form of de novo review of punitive damage awards.\n\nThe review standard employed in this case is not identical to that employed by the Alabama court. Nonetheless, it satisfies due process. As noted by the Supreme Court in Browning-Ferris :\n\nIn a diversity action, or in any other lawsuit where state law provides the basis of decision, the propriety of an award of punitive damages for the conduct in question, and the factors the jury may consider in determining their amount, are questions of state law. Federal law, however, will control on those issues involving the proper review of the jury award by a federal district court and court of appeals.\n\nId. at 278 (footnotes omitted). The scope of federal diversity review of a punitive damage award on a motion for new trial is also set forth:\n\nIn reviewing an award of punitive damages, the role of the District Court is to determine whether the jury's verdict is within the confines set by state law, and to determine, by reference to federal standards developed under Rule 59, whether a new trial or remittitur should be ordered. The Court of Appeals should then review the District Court's determination under an abuse of discretion standard.\n\nId. at 279. On a motion for new trial:\n\nIn federal practice, it is the duty of the district Judge to set aside an excessive verdict even when such a verdict is supported by substantial evidence \"if he is of the opinion that the verdict is against the clear weight of the evidence, or is based upon evidence which is false, or will result in a miscarriage of Justice.\"\n\nJohnson v. Parrish, 827 F.2d 988, 991 (4th Cir. 1987)(quoting Aetna Casualty \u0026 Sur. Co. v. Yeatts, 122 F.2d 350, 352 (1941)).\n\nWhere a review of a punitive damage award is instituted through a motion for judgment as a matter of law under Fed. R. Civ. Proc. 50,\u003cspan class=\"fnref\"\u003e11\u003c/span\u003ec the district court reviews the evidence to see if there is substantial evidence upon which the jury could base its award. Defender Industries v. Northwestern Mutual Life Ins. Co., 938 F.2d 502, 505 (4th Cir. 1991).\n\nHugo's moved for both a judgment as a matter of law under Rule 50 and a new trial under Rule 59. Hugo's motion for judgment attacked the sufficiency of the evidence to support any verdict for Johnson, not just the amount of the punitive damages award. Accordingly, the district court was empowered to review the evidence placed before the jury at trial to see if it was legally sufficient, both as to whether an award could be made at all and the amount of an appropriate award. As to amount, the district court's specific task was to determine if there was substantial evidence to support the amount awarded by the jury as commensurate with the culpability of Hugo's and whether such award was tailored only to the stated goals of punishing and deterring future wrongful conduct. Defender Industries, 938 F.2d at 505. This determination of whether substantial evidence supports the punitive damages award represents no greater intrusion upon the jury's fact finding function than a similar assessment of a jury's determination regarding \"reasonable care,\" \"due diligence,\" or \"appropriate compensation for pain and suffering or mental anguish\"; concepts which also involve the exercise of broad discretion by the jury. See Haslip, 111 S. Ct. at 1044. To the extent the reviewing court does not go beyond the evidence in the record, no Seventh Amendment problems arise with this type of review.\n\nAs to the motion for new trial, Hugo's attacked not only whether a factual predicate existed for awarding some amount of damages, but also whether the amount awarded was \"excessive.\" J.A. 435. \"Under traditional procedure, a district court, faced with what it believed to be an excessive damage award by a jury in a diversity case on a common-law cause of action, could set aside the excessive verdict by granting a new trial or a new trial nisi remittitur.\" Defender Industries, 938 F.2d at 505. This procedure, conducted under the review standard set forth above for motions for new trial, satisfies due process and Seventh Amendment concerns about right to a jury trial. Id. at 507.\n\nThe district court's resolution of the new trial motion afforded Hugo's due process. The district court specifically assessed the evidence placed before the jury regarding the culpability of Hugo's and concluded that the award was commensurate with that culpability. The district court could have made a more definitive statement concerning how the award served the purposes and goals of punishment and deterrence. District courts in the future should be directed to make specific findings on this issue. Failure to make such findings in the record should be treated as an abuse of discretion. By making such findings in the record, review by this court is more meaningful. Cf. Haslip, 111 S. Ct. at 1044 (under Alabama law, trial court to state in the record specific reasons for action taken in reviewing a punitive damage award, citing Hammond, 493 So. 2d at 1379).\n\nIn sum, Hugo's claim that it was denied due process is without merit. The jury was correctly instructed on common-law punitive damages with instructions indistinguishable from those approved in Haslip. The procedures for reviewing the award are also more than adequate to afford due process. Though Hugo's was afforded due process, the district court abused its discretion in not awarding a new trial on the issue of punitive damages. The punitive damages awarded against Hugo's were excessive, as were the compensatory damages as discussed in Part III, given the evidence of Hugo's culpability; therefore, absent a directed verdict as to liability, the judgment should have been reversed and a new trial ordered with respect to punitive damages. This reversal is predicated on the \"excessiveness\" of the verdict as determined under Virginia law, not on the notion that Virginia punitive damages law does not provide due process.\n\nC\n\nNothing in Haslip compels nor counsels the actions taken by the majority today. Rather, the majority's decision rests squarely upon the interpretation of Haslip set forth in Mattison v. Dallas Carrier Corp., 947 F.2d 95 (4th Cir. 1991). The majority is faithful to Mattison, which was wrongly decided as set forth below. Mattison should be overruled and the Virginia scheme (but not the amount) of punitive damages in this case should be upheld against Hugo's due process attack.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003ec Mattison struck down the South Carolina scheme for assessing punitive damages as applied in federal district court, because \"its lack of meaningful standards allowed the jury to exercise unconstrained discretion in making its awards.\" Id. at 98. This holding, supposedly grounded in Haslip, actually contradicts Haslip, and elevates the Dissenting opinion of Justice O'Connor in Haslip to the law of the Fourth Circuit.\n\nMattison utterly ignores the specific holding in Haslip that the common law jury instructions on punitive damages used by Alabama, which confined the amount of punitive damages to those necessary to punish and deter willful conduct commensurate with the culpability of the defendant, sufficiently constrain the discretion of the jury to satisfy due process and that the specific review procedures utilized by Alabama were an additional, but not necessary, check on jury discretion. Haslip, 111 S. Ct. at 1044-45. The majority ignores Haslip again today by declaring the Virginia common law instruction \"standardless\" when that instruction is, in fact, clearer and more concise than that approved in Haslip.\n\nThe Discussion of South Carolina standards for setting punitive damages as set forth in Mattison, 947 F.2d at 100-01, shows that the amount of such damages a jury may award is specifically guided by the purposes of punishment and deterrence, the wealth of the defendant, and the seriousness of the defendant's conduct, standards identical to those found sufficient to satisfy due process in Haslip. South Carolina in fact imposes a higher evidentiary standard, \"clear and convincing\" evidence, as opposed to a mere preponderance, for awarding and determining appropriate punitive damages. See Mattison, 947 F.2d at 100. Cf. Haslip, 111 S. Ct. at 1046 n.11. As previously stated, the Virginia instruction in this case, supra n.9, is more clear and concise and should be upheld as satisfying due process.\n\nIn striking down the South Carolina instructions as unconstitutional, Mattison specifically relied on the \"vagueness and lack of standards\" argument employed by Justice O'Connor in her Haslip Dissent. To support this argument, Mattison postulates a hypothetical statute providing that \"anyone who wantonly or recklessly breaches an existing duty of law becomes subject to a penalty in an amount that the fact finder wishes to enter\" and suggests that such statute would be readily struck down. The hypothetical mischaracterizes both South Carolina and Virginia punitive damages law, however. Both, like the instructions approved in Alabama, restrain the amount awardable to that which achieves the state's goals of punishment and deterrence commensurate with the culpability of the defendant.\n\nMattison specifically cites and relies on cases utilized by Justice O'Connor in her Haslip Dissent to justify its Conclusions, particularly Giaccio v. Pennsylvania, 382 U.S. 399, 15 L. Ed. 2d 447, 86 S. Ct. 518 (1966). See Mattison, 947 F.2d at 102; Haslip, 111 S. Ct. at 1057 (O'Connor, Dissenting). This \"void for vagueness\" argument was specifically rejected by the Haslip majority. Id., 111 S. Ct. at 1046 n.12. Because the majority rests its decision against the Virginia instructions on Mattison, this rejected \"void for vagueness\" argument is once again being applied as the law of this circuit despite Haslip's explicit rejection of that approach.\n\nAfter declaring the South Carolina instructions void for vagueness in direct contradiction of Haslip, Mattison next addresses whether or not the review process under Rules 50 and 59 of the Federal Rules of Civil Procedure \"saves\" the scheme from violating due process and concludes it does not.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003ec Mattison holds that an \"excessiveness\" review standard is impermissible because \"no criteria are provided against which to measure excessiveness.\" Id. at 106. This Conclusion is plainly erroneous. Because the jury was specifically instructed that their award must be tailored to the goals of punishment and deterrence and must take into account the nature of defendant's conduct, excessiveness may be measured by how well the jury's verdict serves these goals and accounts for defendants' conduct.\n\nBecause, as Haslip holds, a common law instruction constraining the amount of a punitive damage award to punishment and deterrence commensurate with the wrongdoing of defendant satisfies due process, the Virginia instruction given in this case also satisfies due process. The majority's holding to the contrary finds no support in Haslip, except in Justice O'Connor's Dissent. Because the instruction is adequate, Virginia's \"excessiveness\" standard of review as applied in the federal courts is also adequate to satisfy due process. There is no need for a different federal jury instruction.\n\nThough Virginia courts never grouped them together in one list, Virginia courts' review for excessiveness has incorporated many of the same factors applied in Alabama. The majority acknowledges this fact. Maj. op. at 15-16. There is simply no reason why a federal district court may not apply these same factors to see if, as a matter of law, the jury's award is excessive in relation to the purposes of punishment and deterrence and the culpability of the defendant. See Browning-Ferris, 109 S. Ct. at 2922 (\"The role of the District Court is to determine whether the jury's verdict is within the confines set by state law.\"). No Seventh Amendment problem is posed by such review since none of the factors require the court to assess evidence not before the jury. Cf. Haslip, 111 S. Ct. at 1044-45 (evidence of defendant's wealth excluded from trial, but considered in trial and appellate review of award).\u003cspan class=\"fnref\"\u003e14\u003c/span\u003ec\n\nFollowing its declaration that South Carolina's punitive damage scheme was unconstitutional, Mattison, and the majority today with respect to Virginia, proceed to follow a suggestion made in Justice O'Connor's Dissent in Haslip, 111 S. Ct. at 1061, and impose a jury instruction on federal district courts which does not comport with the jury instructions used in the Virginia or South Carolina state courts. This \"solution\" to the \"vagueness\" of the South Carolina and Virginia schemes violates Erie by creating a federal common law of punitive damages in the South Carolina and Virginia courts distinct from the common law of punitive damages charged in their respective state courts. See Gamble v. Stevenson, 305 S.C. 104, 406 S.E.2d 350, 354 (S.C. 1991)(retaining common law punitive damages charge in South Carolina state courts post-Haslip).\n\nThe full consequences of the majority's decision cannot be readily forecast. One may expect some forum shopping as parties attempt to ascertain whether the detailed federal instructions or the less detailed state instructions best satisfy their goals. Some might assume that the \"vaguer\" state instructions will result in a greater award than the supposedly more constraining federal instructions. Conversely, the attention focused on punitive damage awards by the more complex Mattison -type instructions may result in greater punitive awards being awarded by juries, undoubtedly not the result which parties defendant, who have argued strenuously for such instructions, expect. District courts must already go to great lengths to tell the jury that the instructions on damages do not necessarily indicate any liability on the part of the defendant. See, e.g., J.A. 402 (District court in this case cautions jury that instructions on damages do not indicate entitlement to a verdict.).\n\nThe new federal instructions do not guarantee any greater uniformity of result for the reasons succinctly stated by Justice Kennedy in his concurrence in Haslip: juries are not permanent adjudicatory bodies and do not have the opportunity to \"practice\" over time. Haslip, 111 S. Ct. at 1055 (Kennedy, J., Concurring). That the new instructions do not assure greater uniformity is illustrated by the Disposition of the Defender Industries case subsequent to our remand. We reversed the district court's order reducing a jury verdict for punitive damages from five million dollars to $10,000 and entering judgment without retrying the issue before a jury as violating the Seventh Amendment right to a jury trial. Defender Industries, 938 F.2d at 50507. The case was remanded for a new trial, or new trial nisi remittitur on punitive damages. Though originally tried using the South Carolina common law instructions, the punitive damages issue was retried to a new jury by the district court using the instructions mandated for South Carolina district courts by Mattison. The second jury returned a punitive damages verdict for twenty-five million dollars, five times the original award. See Defender Industries, C/A No. 3:88-3232-17, Judgment entered February 7, 1992 (D.S.C. J. Anderson, Dist. Judge). The district court has subsequently entered another order for a new trial nisi remittitur reducing the punitive damage award to the original amount of five million dollars. Id., Order entered April 29, 1992. No doubt, the matter will find its way back to this court.\n\nThe concise common law punitive damage instructions in this case coupled with review by the district court under Virginia's \"excessiveness\" standard and the Federal Rules of Civil Procedure satisfy due process requirements. The majority's Conclusion that the instructions are vague contradicts Haslip. The formulation of new instructions, in conformity with the reasoning of the Haslip Dissent, creates an unnecessary Erie problem of undetermined impact.\n\nV\n\nIn Conclusion, a finding of liability on the part of Hugo's cannot be sustained.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003ec A directed verdict in Hugo's favor should have been granted. There is, at best, a mere scintilla of evidence showing any causal relationship between Stribling's racist attitudes and the actions taken with respect to the plaintiff James Johnson. There is also no proof showing that the \"acts\" of Hugo's directed at Johnson constituted harassment or intimidation. Finally, there was no evidence of any damages flowing from the acts of Hugo's distinct from the damages suffered at the hands of the rogue policeman Wines. Such mental pain and anguish that Johnson testified to was connected with his treatment by Wines and not Hugo's. In this regard, given the dearth of proof on the necessary elements for imposing statutory liability and the complete absence of distinct evidence as to emotional damage, it is apparent that Hugo's is being punished for the acts of Wines or for violation of the 1979 consent decree, a matter before the jury only for the limited purpose of showing a racial animus for Hugo's conduct. The judgment below should be reversed with directions to enter judgment as a matter of law for Hugo's or for a new trial. Fed. R. Civ. Proc. 50, 59.\n\nWe should also uphold the Virginia common law scheme for imposing punitive damages as applied in federal courts. Support for this proposition is by no means an unqualified endorsement of punitive damages. The majority decision today perpetuates the error begun in Mattison by striking down the Virginia common law instructions on due process grounds utilizing the rationale set forth in the Haslip Dissent. Following that Dissent further, a new federal law of punitive damages is imposed on those using Virginia's federal district courts that raises Erie problems of unspecified magnitude.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003ec\n\nFor the reasons set forth above, therefore, I respectfully Dissent. I am authorized to state that Judge Russell joins this Dissenting opinion.\n\n\u003cspan class=\"fn\"\u003e1. Although Hugo's claims that the \"standardless\" instructions to the jury in this case resulted in an award of punitive damages which violated the Due Process Clause of the Fourteenth Amendment, because the governmental action involved a federal tribunal, we conduct our analysis under the Due Process Clause of the Fifth Amendment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. In full, section 8.01-42.1(A) of the Virginia Code provides: An action for injunctive relief or civil damages, or both, shall lie for any person who is subjected to acts of (i) intimidation or harassment or (ii) violence directed against his person; or (iii) vandalism directed against his real or personal property, where such acts are motivated by racial, religious, or ethnic animosity.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. For the reasons given in footnote 1, above, we consider this claim under the Due Process Clause of the Fifth Amendment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. When Mattison was initially tried, South Carolina's post-verdict review process provided the trial court with discretion to review the award only for excessiveness. See Mattison, 947 F.2d at 100 (citing Hicks v. Herring, 246 S.C. 429, 144 S.E.2d 151, 154 (S.C. 1965)). By the time a panel of this Court resolved the due process issue on appeal, however, the Supreme Court of South Carolina had adopted a more detailed post-verdict review process to comply with Haslip. See id. at 106 (citing Gamble v. Stevenson, 305 S.C. 104, 406 S.E.2d 350 (S.C. 1991)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Hugo's has not contended that this instruction, based on Virginia common law, was erroneously given, and in the absence of further defining language in Va. Code Ann. § 8.01-48.1(B) (authorizing awards of punitive damages for violations of that statute), we agree with the parties' assumption that the statute incorporates the Virginia common law of punitive damages, including its standards for award and restrictions on amount. Under Haslip the instruction would satisfy the requirements of due process for determining whether to award punitive damages. See Haslip, 111 S. Ct. at 1044.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Under Virginia law there is actually a third limit on the jury's discretion in fixing an amount of punitive damages--a statutory cap of $350,000, applicable to any action accruing on or after July 1, 1988. See Va. Code Ann. § 8.01-38.1. We cannot say, however, that the mere existence of the cap will in every case, or even in this case, insulate from attack an otherwise arbitrary award of punitive damages.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Although federal jurisdiction in this case was invoked under 28 U.S.C. §§ 1331 \u0026 1343 based on the counts brought under 42 U.S.C. § 1983, the statutory claim on which Johnson succeeded against Hugo's is a pendent state claim. Accordingly, the federal court was required to apply state law as would a court exercising diversity jurisdiction under 28 U.S.C. § 1332. See United Mine Workers v. Gibbs, 383 U.S. 715, 726, 16 L. Ed. 2d 218, 86 S. Ct. 1130 (1966).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The states are not bound by the U.S. Constitution to give the same degree of deference to the jury's decisions as are the federal courts. See U.S. Const. amend. VII; see also Mattison, 947 F.2d at 99 n.1 (noting that the Seventh Amendment does not bind the states).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. For example, in Haslip the Supreme Court upheld Alabama's scheme, despite jury instructions which gave broad discretion to the jury, in light of the seven-factor review of the punitive damages award by the trial court, in addition to appellate review of the trial court's decision. If the same case were later to arise in federal court in Alabama, Erie would require the same factors considered by the court under state law to be considered in assessing punitive damages in federal court and, in our view, federal procedure would require that these factors be given to the jury for consideration and be reviewed by the district court under the standards given in Fed. R. Civ. P. 50(b) and 59.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. More completely, the four aspects given in Mattison for jury instructions are: (1)Relationship to harm caused: Any penalty imposed should take into account the reprehensibility of the conduct, the harm caused, the defendant's awareness of the conduct's wrongfulness, the duration of the conduct, and any concealment. Thus any penalty imposed should bear a relationship to the nature and extent of the conduct and the harm caused, including the compensatory damage award made by the jury. (2)Other penalties for the conduct: Any penalty imposed should take into account as a mitigating factor any other penalty that may have been imposed or which may be imposed for the conduct involved, including any criminal or civil penalty or any other punitive damages award arising out of the same conduct. (3)Improper profits and plaintiff's costs: The amount of any penalty may focus on depriving the defendant of profits derived from the improper conduct and on awarding the costs to the plaintiff of prosecuting the claim. (4)Limitation based on ability to pay: Any penalty must be limited to punishment and thus may not effect economic bankruptcy. To this end, the ability of the defendant to pay any punitive award entered should be considered. 947 F.2d at 110.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. The majority has concluded that the Virginia requirements for an award of punitive damages have been satisfied, and that the facts present for federal purposes justified an award of an undetermined amount of punitive damages. Insofar as the Virginia law is concerned, it should not be overlooked that the Commonwealth of Virginia has intervened to present arguments in support of the constitutionality of the punitive damages award in the instant case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The fact that we are a fractionated court is evidenced by what Judge Hamilton has written in Dissent. While disagreeing with both the majority and me as to whether, under the state law of Virginia, a right in Johnson to punitive damages has been made out, he ringingly asserts that, going beyond that, Pacific Mut. Life Ins. Co. v. Haslip, 113 L. Ed. 2d 1, 111 S. Ct. 1032 (1991), does not, as here applied, demonstrate a violation of the due process provision of the Fifth Amendment to the United States Constitution. Furthermore, while I agree with Judge Hamilton's opinion that Mattison v. Dallas Carrier Corp., 947 F.2d 95 (4th Cir. 1991), should be overruled, that is, in fact, not necessarily required. The lack of an entitlement, under state law, to any award of punitive damages under the facts in Mattison has rendered the opinion in that case purely dictum, not affording it precedential authority. See Colgrove v. Battin, 413 U.S. 149, 158, 37 L. Ed. 2d 522, 93 S. Ct. 2448 \u0026 n.13 (1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The Solicitor General, Kenneth W. Starr, has recently explained Haslip as indicating that, while there are substantive due process limitations on punitive damages awards, \"the limits are very flexible and not at all clear.\" Vol. XIII Judicial Legislative Watch Report No. 6, at 11.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Such a \"not excessive\" constraint on an otherwise entirely open-ended award would appear to have been a necessary corollary of the due process principle, if the latter is to have any real force at all. See Grunenthal v. Long Island R.R. Co., 393 U.S. 156, 159, 21 L. Ed. 2d 309, 89 S. Ct. 331 (1968): We must give the benefit of every doubt to the judgment of the trial Judge; but surely there must be an upper limit, and whether that has been surpassed is not a question of fact with respect to which reasonable men may differ, but a question of law. The standard has been variously phrased: \"Common phrases are such as: 'grossly excessive,' 'inordinate,\"shocking to the judicial conscience,' 'outrageously excessive,' 'so large as to shock the conscience of the court,' 'monstrous,' and many others.\" Dagnello v. Long Island R.R. Co., supra, at 802. Dagnello v. Long Island R.R. Co., 289 F.2d 797, 806 (2nd Cir. 1961), equates \"excessiveness\" in the compensatory damages context with \"a denial of Justice.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. In Haslip itself, the award of punitive damages was upheld as meeting constitutional due process requirements despite the fact that consideration of at least one of the factors, \"financial position,\" was not permitted under the applicable Alabama law. Similarly, in Eichenseer v. Reserve Life Ins. Co., 934 F.2d 1377, 1384 (5th Cir. 1991), a post-Haslip decision, three factors were deemed sufficient to support a punitive damages award. The Eichenseer court noted that \"the procedural protection need not be exhaustive,\" and that \"if there are any circumstances of probative force that support the amount of the award, then the award meets the 'reasonableness' prong of the due process test in Haslip.\" 934 F.2d at 1385, 1382 (emphasis in original). In this connection, Solicitor General Starr's observation should not be ignored. See supra note 1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Cf, Haslip, 111 S. Ct. at 1046-47 (Scalia, J., Concurring) (noting that Haslip \"provides no guidance as to whether any other procedures [for awarding and reviewing punitive damage awards] are sufficiently 'reasonable'\") (emphasis in original).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. As Judge Hamilton aptly observed, the jury instructions provided in the instant case \"are more clear and concise, but otherwise indistinguishable from the instructions specifically approved in Haslip as satisfying due process.\" See Hamilton, J., Dissenting, slip op. at 61. In sum, we do not confront in the present case \"unlimited jury discretion,\" the evil that the Supreme Court has instructed us to avoid. Haslip, 111 S. Ct. at 1043. To the contrary, cogent limits, in the way of pertinent evidence and adequate jury instructions, have been produced and considered.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. It should not be overlooked that a strong analogy exists between an award of punitive damages and a finding of guilt in a criminal case. Punitive damages \"have been described as quasi-criminal.\" Haslip, 111 S. Ct. at 1044. A guilty verdict in a criminal case and a punitive damages award are each designed to punish egregious conduct. So it is not surprising to find that the existence of substantial evidence is enough, following the jury's award, to sustain a finding of guilt or a punitive damages award. See, e.g., Glasser v. United States, 315 U.S. 60, 80, 86 L. Ed. 680, 62 S. Ct. 457 (1942); Jackson v. Virginia, 443 U.S. 307, 319, 61 L. Ed. 2d 560, 99 S. Ct. 2781 (1979). See also Grunenthal v. Long Island R.R. Co., 393 U.S. 156, 160, 21 L. Ed. 2d 309, 89 S. Ct. 331 (1968) (\"We cannot say that the trial Judge's view that the jury might properly have awarded $150,000 for loss of future earnings is without support in the evidence\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Virginia's $350,000 cap on punitive damages awards is codified at Va. Code Ann. § 8.01-42-1(A).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Cf. Robertson Oil Co. v. Phillips Petroleum Co., 930 F.2d 1342, 1347 (8th Cir. 1991) (holding that \"we deem it advisable to remand for the district court to articulate its analysis under Arkansas law and to review the award under the criteria approved in Haslip. . . as well as principles enumerated in the Arkansas cases\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. On the panel with me were Senior District Judge Young and, in Dissent, my colleague, Judge Niemeyer.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. It must not be forgotten that due process is a two-way street on which a plaintiff, such as Johnson, is as entitled to travel and to enjoy the same protections as a defendant such as Hugo's Skateway. Johnson, abiding fully with the law as it had been declared to be at the time of trial, produced several factors demonstrating egregious conduct warranting deterrence and retribution. The $175,000 amount of punitive damages was reasonable, given the circumstances. The punitive damages award upheld in Haslip was $1,000,000, and that in Eichenseer was $500,000. 111 S. Ct. at 1037; 934 F.2d at 1380. Hence, in my opinion, penalizing Johnson for not foreseeing every jot and tittle of Haslip would smack of inJustice.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. See Haslip, 111 S. Ct. at 1044 n.9 (implying that Alabama's statutory cap for punitive damages might be a factor to consider in determining whether reasonable constraints on jury discretion existed).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. See Va. Code Ann. § 8.01-42-1(A).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. See supra note 2.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. See Haslip, 111 S. Ct. at 1044-45 (rejecting void for vagueness argument).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Judge Widener joins in my Dissent at the en banc level. 1a The Mattison court imposed these same factors on South Carolina in precisely the way that it herein imposes them on the state of Virginia. It held that federal juries in South Carolina must consider four factors \"derived from\" Haslip and from a case that it construed as requiring that \"trial courts in South Carolina . . . parrot the review conducted by the Alabama Supreme Court in Haslip.\" 947 F.2d at 109-10 (citing Gamble v. Stevenson, 305 S.C. 104, 406 S.E.2d 350 (S.C. 1991)). Gamble did not require that the courts of South Carolina consider the Haslip factors when reviewing punitive damages awards; it merely approved those factors for consideration by the courts in their discretion. Compare Gamble, 406 S.E.2d at 354 (trial court \"may consider\" certain factors) with Mattison, 947 F.2d at 109 (Gamble factors \"intended to be the basis for all awards of punitive damages in South Carolina\"). 2a See Haslip, 111 S. Ct. at 1042 (emphasizing that Court \"more than once has approved the common-law method for assessing punitive awards,\" pursuant to which the jury determines the amount of the award after being instructed to \"consider the gravity of the wrong and the need to deter similar wrongful conduct\" and the jury's award \"is then reviewed by trial and appellate courts to ensure that it is reasonable\"); see also id. at 1043 (no bright line between the constitutional and the unconstitutional can be drawn, but \"general concerns of reasonableness and adequate guidance from the court when the case is tried to a jury properly enter into the constitutional calculus\"); id. at 1045 (Alabama's \"appellate review makes certain that the punitive damages are reasonable in their amount and rational in light of their purpose to punish what has occurred and to deter its repetition\"). 3a The predicate for this misreading of the footnote was the court's earlier mistaken assumption that Alabama's jury instructions were of little, if any, relevance to the Supreme Court's decision to uphold Alabama's scheme and that the scheme was saved only by the state's post-verdict reviews. See, e.g., Mattison, 947 F.2d at 99 (\"The Supreme Court turned its attention to the post-verdict process, passing lightly over the pre-verdict process which gave rise to the verdict in the first place.\"); id. (\"This unusual approach of emphasizing post-verdict review to the extent of perhaps slighting a review of the pre-verdict process, . . . raises significant questions . . . .\") (citation omitted); see also ante at 10 (referring to Alabama's post-verdict review as the \"process which proved so critical in Haslip\"). This assumption was in turn based upon the court's belief that \"[Alabama's] instructions to the jury were not significantly different from the [review] schemes [in Vermont and Mississippi],\" under which awards would be invalidated, respectively, only if they were \"manifestly and grossly excessive\" or \"evinced passion, bias and prejudice . . . so as to shock the conscience.\" See Mattison, 947 F.2d at 99 (citing Haslip, 111 S. Ct. at 1045 n.10). In so believing, the Mattison court failed to appreciate the significance to the Supreme Court of the fact that in Alabama, juries are instructed that the purposes of punitive damages are \"'to punish the defendant' and 'for the added purpose of protecting the public by [deterring] the defendant and others from doing such wrong in the future.'\" Haslip, 111 S. Ct. at 1037 n.1 (quoting App. at 105-06). The Supreme Court approved of the Alabama instructions precisely because they included this explanation of the nature and purposes of punitive damages. 4a This reading of footnote 10 as referencing merely the review for excessiveness in relation to the state's objectives of punishment and deterrence, and not in particular Alabama's seven factors, is reinforced by the fact that the Justices whom the note references as having \"expressed concerns\" about the Vermont and Mississippi schemes in Bankers Life \u0026 Casualty and Browning-Ferris did not in any sense focus upon the presence or absence in those schemes of a requirement that reviewing courts be guided by specific factors in their assessments of punitive awards, as in Alabama. Rather, they expressed only the general concern in those cases that a punitive damages scheme might, in an appropriate case, be subject to a due process challenge. See Browning-Ferris, 492 U.S. at 280 (Brennan, J., joined by Marshall, J., Concurring); id. at 283 (O'Connor, J., joined by Stevens, J., Concurring in part and Dissenting in part); Bankers Life \u0026 Casualty, 486 U.S. at 87 (O'Connor, J., joined by Scalia, J., Concurring in part and Concurring in judgment); see also Haslip, 111 S. Ct. at 1038-39. 5a See Central Ala., 546 So. 2d at 377 (\"In making the determination of whether the verdict is excessive (or inadequate), a trial court is authorized to consider the following non-exclusive list of factors . . . .\") (emphasis added); Green Oil, 539 So. 2d at 222-24 (stressing \"society's goals of punishment and deterrence\" as constraints on the amount of punitive damages, while listing the seven factors as ones that \"could be taken into consideration\") (emphasis added). 6a The Alabama Supreme Court simply held that the state's circuit court had faithfully followed the only mandate of Hammond, which is to \"reflect in the record the reasons for interfering with a jury verdict, or refusing to do so, on grounds of excessiveness of the damages,\" see Hammond 493 So. 2d at 1379, and that the evidence supported its findings. Pacific Mut. Life Ins. Co. v. Haslip, 553 So. 2d 537, 543 (Ala. 1988) (\"These guidelines . . . require the trial Judge to reflect on the record his or her reasons for either interfering or not interfering with a jury's verdict.\") (citations omitted); Hammond, 493 So. 2d at 1379 (\"We simply now require the trial courts to state for the record the factors considered in either granting or denying a motion for new trial based upon the alleged excessiveness or inadequacy of a jury verdict.\"). The Supreme Court itself recognized that Hammond requires only that a record statement of the trial court's reasons be made. See 111 S. Ct. at 1044 (quoting requirement and listing factors \"deemed [by Alabama as] 'appropriate for the trial court's consideration'\") (quoting Hammond, 493 So. 2d at 1379). The Alabama Circuit Court, whose decision was reviewed by the Alabama Supreme Court, did not even apply all of the four Hammond factors. Of those factors, the Circuit Court considered only the retributive and deterrent effects of the award. It did not consider the impact of the awards on the individual defendants or on innocent third parties. Haslip v. Pacific Mut. Life Ins. Co., No. CV82-2453 (Ala. Cir. Ct. Dec. 11, 1987), reprinted in Joint Appendix at A14-A15, 111 S. Ct. 1032 (No. 89-1279). 7a The Court noted the historical fact that \"before its ruling in the present case, the Supreme Court of Alabama had elaborated and refined the Hammond criteria . . . .\" 111 S. Ct. at 1045 (citing Green Oil and Central Alabama), but it expressly observed that the Alabama Supreme Court had applied only the Hammond standards. Id. at 1046; see note 12 infra. Indeed, the Court seemed to suggest that retribution and deterrence were the only constitutionally relevant factors. Id. at 1046 (noting that Alabama Supreme Court \"brought to bear all relevant factors recited in [Green Oil v.] Hornsby.\") (emphasis added); see supra note 6. 8a This assumption -- and to a large extent the majority's Conclusion that consideration of the seven Haslip factors is required when awarding and reviewing punitive damages -- derives in part from its belief that Alabama's scheme as a whole only barely passed constitutional muster. See ante at 9 (the Supreme Court in Haslip \"concluded that Alabama's scheme, with its particular procedural and substantive protections, did not 'cross the line into the area of constitutional impropriety'.\") (quoting Haslip, 111 S. Ct. at 1046); id. at 10 (\"The Supreme Court concluded [in Haslip] that punitive damages awarded in Alabama may have been close to the line of constitutional impropriety but did not 'cross the line'.\") (quoting Haslip, 111 S. Ct. at 1046). The Supreme Court, however, never suggested that Alabama's scheme bordered on the unconstitutional; it said only that the particular award there under review did \"not cross the line into the area of constitutional impropriety.\" Haslip, 111 S. Ct. at 1046; see also id. (Scalia, J., Concurring in the judgment) (\"[The Court] says that Alabama's particular procedures (at least as applied here) are not so 'unreasonable' as to'cross the line into the area of constitutional impropriety'.\") (quoting 111 S. Ct. at 1046). At most, therefore, the Court may have considered vacating as excessive the particular jury award against Pacific Mutual. It ultimately decided against even this course because \"the award. . . did not lackobjective criteria.\" Id. (emphasis added). 9a The instructions given the jury in this case were even more detailed and better suited to channeling the jury's discretion than were the instructions given to the jury in Haslip, which the Supreme Court explicitly approved. 111 S. Ct. at 1044. The jury was instructed that the purpose of punitive damages is \"to punish the wrongdoer for some extraordinary conduct and to serve as an example and warning to others not to engage in such conduct\"; that the decision \"whether or not to make any award of punitive and exemplary damages\" is \"a matter within the province of the jury\"; that \"the amount of such extraordinary damages, when awarded, must be fixed with calm discretion and sound reason and must never be awarded or fixed in amount because of any sympathy or bias or prejudice with respect to any party to the case\"; and that the jury could only award punitive damages if \"the defendant's act or omission which proximately caused actual damage to the plaintiff was maliciously or wantonly or oppressively done.\" The court went on to provide definitions of \"maliciously,\" \"wantonly,\" and \"oppressively.\" J.A. at 400-02; see also ante at 60-61 (Hamilton, J., Dissenting). 10a See Va. Code Ann. § 8.01-38.1. While the majority accords dispositive constitutional significance to the seven Haslip factors, it essentially dismisses as inconsequential Virginia's statutory cap on punitive damages. See ante at 11 n.6. In Haslip itself, the Court noted that Alabama had recently enacted a $250,000 statutory cap on punitive damages, 111 S. Ct. at 1044 n.9. The existence of this cap undoubtedly would have entered into the Court's constitutional calculus had the cap been in effect when the cause of action in Haslip arose. See id. at 1064 (O'Connor, J., Dissenting) (suggesting legislative caps \"could function as meaningful constraints on jury discretion\"). 11a The Court explained that the instructions had \"accommodated\" the defendant's due process interest in \"rational decisionmaking.\" See 111 S. Ct. at 1044. It emphasized that \"the discretion allowed under Alabama law in determining punitive damages is no greater than that pursued in many familiar areas of the law as, for example, deciding 'the best interests of the child,' or 'reasonable care,' or 'due diligence,' or appropriate compensation for pain and suffering or mental anguish.\" Id. 12a The retribution and deterrence factors comprise the essence of the Hammond inquiry that Alabama trial courts are authorized to conduct when reviewing jury-awarded punitive damages awards. (The only other specific factors are the \"'impact upon the parties,' and . . . 'on innocent third parties,'\" and the latter is recited only as a possible example of \"other\" factors that might appropriately be considered. See Haslip, 111 S. Ct. at 1044 (quoting Hammond, 493 So. 2d at 1379.)) The Supreme Court held in Haslip that a review including consideration of these factors was \"meaningful and adequate.\" 111 S. Ct. at 1044. 13a The majority does not even citeBrowning-Ferris. It is cited in Mattison, but only for the unexceptional propositions that federal district court review of jury verdicts consists of the application of state substantive law and federal procedural law, and that a federal district court can grant a new trial \"only under the standards permitted by federal law.\" 947 F.2d at 99, 108. The Court's language to the effect that the district court in that case had \"properly instructed the jury on Vermont law . . . and applied the proper state-law standard in considering whether the verdict returned was excessive\" is nowhere cited. See Browning-Ferris, 492 U.S. at 280. 14a On a motion for judgment as a matter of law, the district court reviews for substantial evidence. See Defender Indus. v. Northwestern Mut. Life Ins. Co., 938 F.2d 502, 505 (4th Cir. 1991) (en banc). On a motion for new trial, the district court must sustain the verdict unless it is \"'against the clear weight of the evidence, or is based upon evidence which is false, or will result in a miscarriage of Justice.'\" Id. at 507 (quoting Johnson v. Parrish, 827 F.2d 988, 991 (4th Cir. 1987)). 15a The majority concludes otherwise: \"If [Haslip] were later to arise in federal court in Alabama, . . . federal procedure would require that these factors be given to the jury for consideration . . . .\" Ante at 13 n.9. The Eleventh Circuit apparently disagrees. See, e.g., Braswell v. Conagra, 936 F.2d 1169, 1176 (11th Cir. 1991) (district court properly reviewed verdict under the Hammond factors); American Employers Ins. Co. v. Southern Seeding Servs., Inc., 931 F.2d 1453, 1458 (11th Cir. 1991) (failure of district court to consider factors necessitated remand). 16a The sub-inquiries that might be undertaken by the federal courts under Virginia law are themselves not even \"factual\" in the same sense as typical jury questions in the common law tradition: the proportionality of the punitive award to the underlying compensatory award; the avoidance of double recovery; the financial impact upon the defendant; and a consideration of other civil and criminal penalties leveled on the defendant. As Judge Hamilton observes, \"there is simply no reason\" why a federal district court may not measure an award against these standards in determining whether the award is excessive. Ante at 68. Because its review is limited to the record evidence and judicially noticeable facts, however, even explicit application of standards more akin to those applied in Alabama would not present a problem under the Seventh Amendment. See, e.g., Cash v. Beltmann N. Amer. Co., 900 F.2d 109 (7th Cir. 1990). In Beltmann, after noting that under Illinois law three factors, including \"the nature and enormity of the wrong,\" inform the proper amount of punitive damages in that state, the Seventh Circuit reversed a district court for abuse of discretion and itself reviewed the verdict under the factors, concluding that \"the first factor instructs us to focus on the nature and enormity of the wrong . . . . Therefore, the punitive damages award should be set aside if it exceeds the amount necessary to deter and punish . . . .\" Id. at 111; see also Robertson Oil Co., Inc. v. Phillips Petroleum Co., 779 F. Supp. 994, 996-97 (W.D. Ark. 1991) (review by district court of punitive damages award using specific factors developed by Arkansas Supreme Court to give 6350 35 7 contours to a \"shock-the-conscience\" standard). 1c As noted by the majority, the following causes of action were asserted against Hugo's in the complaint: Count I, Deprivation of Civil Rights based on 42 U.S.C. § 1983; Count III, False Arrest and False Imprisonment; and Count IV, the statutory racial harassment claim. Each of these counts and an additional assault and battery count were alleged against Wines, the policeman who brutalized the plaintiff. The district court directed a verdict as to all counts except the harassment count with respect to Hugo's. Wines was tried on all counts and was found liable on each, except the racial harassment count. 2c Hugo Stribling, the husband of Edith Stribling, also has an ownership interest in the skating rink. The evidence in this case primarily concerns the attitudes of Mrs. Stribling, because she is the individual who called the police. 3c Wright testified that he asked plaintiff to come to the office to discuss his skating. 4c This \"back room\" was apparently a storage room connected with the area where skates were rented to patrons who needed skates. J.A. 144, 146. 5c The majority mixes together two apparently distinct events. The testimony indicated that Johnson attempted to teach Marcia Bowen how to \"spin\" in the center of the rink. Johnson was behind Bowen. While skating slowly, Bowen stumbled and fell on Johnson. J.A. 160, 205. Clarence Lane, apparently describing another event, testified that Johnson and some other unidentified individual or individuals were rushing to the middle of the rink from opposite directions, clasping hands, and spinning in circles. J.A. 229. 6c The majority's statement that Wines arrived at the rink and Stribling \"instructed that Johnson be removed,\" Maj. op. at 7, is not supported by the evidence. Stribling and Wines testified that Wines was only instructed to ask Johnson to come to the office as Wright had requested. This is corroborated by Johnson who testified that Wines first requested that he come to \"the back room.\" J.A. 111, 165. The district court specifically found that there was no agreement between Hugo's and Wines that plaintiff would be arrested, imprisoned, or beaten. Whether Johnson would have been expelled or simply warned at the office meeting is a matter of conjecture. 7c The majority is, therefore, plainly wrong when it characterizes Haslip's Discussion of the jury instructions as only addressing whether the instructions were adequate to determine \"whether\" punitive damages should be awarded. Maj. op. at 11, n.5. The Court's holding in fact gave little or no Discussion of \"whether\" punitive damages were available at all, but instead focused on the \"determination\" and \"meaningful individualized assessment\" of damages. Haslip, 111 S. Ct. at 1044. 8c I emphasize once again that this does not signify my assent to the particular award in this case. No award is justified on these facts, or, to the extent liability is established, the punitive damage award is manifestly excessive given the culpability of Hugo's and the sparseness of the evidentiary foundation for imposing liability. 9c The punitive damage instructions given by the district court state in relevant part: Now, in addition to actual damages, the law permits the jury under certain circumstances to award the injured person punitive and exemplary damages in order to punish the wrongdoer for some extraordinary conduct and to serve as an example and warning to others not to engage in such conduct. If you find from a preponderance of the evidence in the case that plaintiff is entitled to a verdict for actual or compensatory damages and you further find that the act or omission of a defendant which proximately caused actual injury or damage to the plaintiff was maliciously or wantonly or oppressively done, then you may add to the award of actual damages such amount as you shall unanimously agree to be proper as punitive or exemplary damages. . . . . [Definitions of malicious, wanton, and oppressive acts] Whether or not to make any award of punitive and exemplary damages in addition to actual damages is a matter within the province of the jury if you unanimously find from a preponderance of the evidence in the case that the defendant's act or omission which proximately caused actual damage to the plaintiff was maliciously or wantonly or oppressively done. But you should always bear in mind that such extraordinary damages may be allowed only if you should first unanimously award plaintiff a verdict for actual or compensatory damages. You should also bear in mind not only the conditions under which and the purposes for which the law permits an award of punitive and exemplary damages to be made but also the requirement of the law that the amount of such extraordinary damages, when awarded, must be fixed with calm discretion and sound reason and must never be awarded or fixed in amount because of any sympathy or bias or prejudice with respect to any party to the case. J.A. 400-02. 10c Significantly, this limitation is no different from the standard imposed upon district court Judges when determining the amount of sanctions to be at awarded in a Rule 11 proceeding. Cf. In Re Kunstler, 914 F.2d 505, 522 (4th Cir. 1990) cert. denied, 113 L. Ed. 2d 669, 111 S. Ct. 1607 (1991); Miltier v. Downes, 935 F.2d 660, 665 (4th Cir. 1991)(sanction amount should only be minimum amount necessary to deter future wrongdoing). This court in Kunstler specifically analogized sanctions awards to punitive damage awards. Id. at 524. A standard suitable to limit the discretion of a federal Judge in making an award is equally suitable for a jury. It is true that Judges' awards may tend to be more uniform because they have the opportunity to\"practice\" over time. Cf. Haslip, 111 S. Ct. at 1055 (Kennedy, Concurring in the judgment)(disparate punitive awards by juries on similar facts may be expected because they are not permanent bodies, but are empaneled for one case only; nonetheless non uniformity does not equate with unconstitutionality). 11c At the time of trial, this motion was designated a motion for judgment notwithstanding the verdict (j.n.o.v.). The designation was changed to judgment as a matter of law effective December 1, 1991. 12c Mattison was settled by the parties following the panel Disposition and was not subject, therefore, to possible further review by this court or the Supreme Court. 13c The majority and Mattison interpret Haslip such that the Alabama-type review was a necessary check, not an additional check on jury discretion. This Conclusion is apparently based on footnote 10 in Haslip. In that footnote, the Haslip majority, without elaboration, notes that the Alabama review process appears to be more stringent than the process employed in Vermont and Mississippi, systems about which \"Justices expressed concern\" in previous cases. Haslip, 111 S. Ct. at 1045 n.10. Mattison, and by inference the majority in this case, reason that the South Carolina and Virginia schemes are more like the Vermont and Mississippi schemes than Alabama's; therefore, they must violate due process. Mattison, 947 F.2d at 105; Maj. op. at 11-12. This interpretation lacks merit for two reasons. First, the Vermont and Mississippi schemes have never been declared unconstitutional as violating due process by any court. To the contrary, the Fifth Circuit in Eichenseer v. Reserve Life Ins. Co., 934 F.2d 1377 (5th Cir. 1991), rejected just such an attack on the Mississippi scheme after Haslip. Second, the Justices who expressed concern about the Vermont law in Browning-Ferris were Justices Brennan and Marshall, who are no longer on the court, and Justice O'Connor who Dissented in Haslip, and would find any common law scheme, even Alabama's, unconstitutional. Id., 492 U.S. at 281 (Brennan, Concurring); at 282 (O'Connor Concurring in part Dissenting in part). The Justices expressing \"dissatisfaction\" on due process grounds with Mississippi law were Justice O'Connor, joined by Justice Scalia, in her concurrence in Bankers Life and Casualty Co. v. Crenshaw, 486 U.S. 71, 8689, 100 L. Ed. 2d 62, 108 S. Ct. 1645 (1988). Justice O'Connor Dissented in Haslip, and Justice Scalia concluded in Haslip that all common law punitive damages schemes satisfy due process. Mattison's, and by inference, the majority's use of footnote 10 thus elevates the Concurring opinions of two former Justices and the Haslip Dissenter into a constitutional determination that the Vermont and Mississippi schemes, and by comparison the South Carolina and Virginia schemes, are unconstitutional. Whatever meaning should be ascribed to footnote 10 of Haslip --and the Supreme Court is none too clear as to its significance--it certainly cannot be interpreted and applied in that manner. 14c A potential Erie problem created by the majority's approach is illustrated by their statement in footnote 9, ante, where the majority hypothesizes that an Alabama federal district court would be required to create a Mattison -type instruction for use in that court. Would the district court be free to create an instruction placing the defendant's wealth before the jury, since, as the majority states, the court may \"look beyond\" the state jury instruction to the review criteria to determine the state's substantive law? This would, of course, violate the prohibition against introduction of such evidence in the trial. A dual system of punitive damages would be created in Alabama in direct violation of Erie. 15c Consequently, the award of any attorney's fees to plaintiff as a prevailing party should be vacated. The failure of Johnson to cross-petition from the panel's order respecting attorney's fees has foreclosed review of that issue by the en banc court. 16c Unresolved today is the question of how a non-Virginia court, whether state or federal, will choose between the federal and state versions of Virginia punitive damages law when the choice of law dictates the application of Virginia law.\u003c/span\u003e\n\n",
    "body_length": 168383,
    "citedas": [
      "974 F.2d 1408"
    ],
    "attorneys": "ARGUED: Earle Duncan Getchell, Jr., MCGUIRE, WOODS, BATTLE \u0026 BOOTHE, Richmond, Virginia, for Appellants. Douglas Bruce McFadden, MCFADDEN, EVANS \u0026 SILL, Washington, D.C., for Appellee Johnson; William Mark Dunn, Assistant Attorney General, Richmond, Virginia, for Appellee Commonwealth of Virginia. ON BRIEF: Paul G. Gill, Cynthia E. Hudson, MCGUIRE, WOODS, BATTLE \u0026 BOOTHE, Richmond, Virginia, for Appellants. James A. Kline, IV, Jerusa Carl Wilson, Jr., MCFADDEN, EVANS \u0026 SILL, Washington, D.C., for Appellee Johnson; Mary Sue Terry, Attorney General, Richmond, Virginia, for Appellee Commonwealth of Virginia.",
    "category": [
      "243",
      "36",
      "75"
    ],
    "judges": "Before Ervin, Chief Judge, and Russell, Widener, Hall, Phillips, Murnaghan, Sprouse, Wilkinson, Wilkins, Niemeyer, Hamilton, Luttig and Williams, Circuit Judges. Judge Niemeyer wrote the opinion of the Court in which Chief Judge Ervin and Judges Hall, Phillips, Sprouse, Wilkinson, Wilkins and Williams joined. Judge Murnaghan wrote a Concurring and Dissenting opinion in which Judge Widener joined. Judge Luttig wrote a Concurring and Dissenting opinion. Judge Hamilton wrote a Dissenting opinion in which Judge Russell joined.",
    "citation_count": 80
  }
}
