{
  "id": "_bmdTmYBTlTomsSBx0vH",
  "document": {
    "title": "United Nuclear Corp. v. General Atomic Co.",
    "full_title": "UNITED NUCLEAR CORPORATION v. GENERAL ATOMIC COMPANY AND INDIANA \u0026 MICHIGAN ELECTRIC CO. . AND UNITED NUCLEAR CORPORATION V. GENERAL ATOMIC COMPANY AND INDIANA \u0026 MICHIGAN ELECTRIC COMPANY . (PART 1 OF 2)",
    "jurisdiction": "New Mexico Supreme Court",
    "date": "1980-08-29T00:00:00.000Z",
    "docket": "No. 11988, No. 12052",
    "body": "PAYNE, Justice.\n\nThis is an appeal from a default judgment entered against General Atomic Company (GAC) in Santa Fe District Court for its alleged willful and bad faith failure to comply with the court's discovery orders.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nThis case is by far the single largest litigation in the history of New Mexico, both in terms of the dollar value of the judgment, which approaches one billion dollars, and the sheer volume of the record, which contains more than 28,000 pages in the record proper, 13,000 pages of transcripts, thousands of documents, and over 100 depositions containing approximately 16,000 pages of testimony and 2,700 exhibits. The facts are largely disputed and are extremely complex. Although we begin with a general factual background and summary of the proceedings below, additional factual details are contained in the separate discussions of the issues raised on appeal.\n\nThis action was instituted by United Nuclear Corporation (United) against GAC, a partnership made up of Gulf Oil Corporation (Gulf) and Scallop Nuclear Corporation (Scallop).\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Scallop is a wholly-owned subsidiary of Dutch-Shell Oil Company. As amended, United's complaint sought a declaratory judgment that two contracts under which United was to supply approximately\n\ntwenty-seven million pounds of uranium to GAC were void and unenforceable. The complaint alleged that GAC and Gulf committed fraud and economic coercion, breached their fiduciary duties to United, and violated the New Mexico Antitrust Act. United also contended that its performance under the contracts had been rendered commercially impracticable. GAC counterclaimed for actual and punitive damages for United's alleged violations of the New Mexico Antitrust Act, and for specific performance of the two contracts, or alternatively, for damages of almost eight hundred million dollars.\n\nGAC impleaded Indiana and Michigan Electric Company (I\u0026M), a public utility company which provides electrical service to customers in the states of Indiana and Michigan. GAC contended that if United's obligations to supply uranium to GAC were excused, GAC's obligations to supply uranium to I\u0026M from the supplies United was to deliver should also be excused.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e I\u0026M counterclaimed against GAC for specific performance and for other relief.\n\nThe trial of this case began on October 31, 1977. It was terminated on March 2, 1978, when the trial judge entered a sanctions order and default judgment against GAC. The court found that GAC had exercised \"the utmost bad faith in all stages of the discovery process.\" The court entered forty-eight recitals relating to GAC's discovery failures, twelve findings of fact as sanctions pursuant to N.M.R. Civ. P. 37(b)(2)(i), N.M.S.A. 1978, and a default judgment under N.M.R. Civ. P. 37(b)(2)(iii), N.M.S.A. 1978.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e The judgment invalidated United's uranium supply contracts with GAC, declared that United had no other obligations to deliver uranium to GAC, and struck GAC's defenses, counterclaims and cross-claims.\n\nA hearing on damages followed, after which the court entered a final judgment, amended final judgment, and second amended final judgment. In addition to invalidating the United-GAC contracts, the court awarded damages to United of $8,264,723 (reduced by an offset for prepayments that had been made) and to I\u0026M of $15,950,752. The court also granted specific performance of I\u0026M's contract for the supply of five million pounds of uranium from GAC.\n\nGAC appeals from the default judgment, arguing ten main grounds for reversal. We have consolidated these points in this opinion into the following five sections: (1) The propriety of the court's discovery orders; (2) GAC's non-compliance with those orders and the propriety of the sanctions entered for noncompliance; (3) the court's failure to disqualify United's counsel; (4) the trial judge's refusal to disqualify himself; and (5) the propriety of the remedies.\n\nBefore turning to the examination of the issues on appeal, we think it appropriate to comment on the conduct of all parties in these appellate proceedings. We have been faced with the difficult task of wading through an avalanche of motions and papers, much of which has done little to add to our understanding of this case or to expedite the ultimate resolution of it. Perhaps because of the longevity of this litigation, the acrimony which marked the proceedings in the trial court, or the monetary value of the judgment at stake, the over six hundred pages of appellate briefs filed, as well as the arguments of the attorneys in the hearings in this Court, have been filled with unnecessary \"invectives, maledictions, and denunciations which we ignore.\" State of Ohio v. Arthur Andersen \u0026 Co., 570 F.2d 1370, 1372 (10th Cir. 1978), cert. denied, 439 U.S. 833, 99 S. Ct. 114, 58 L. Ed. 2d 129 (1978).\n\nAfter having received the permission of this Court to file briefs which exceed by several times the length generally permitted by the Rules of Appellate Procedure, N.M.R. Civ. P. App. 9(k)(4), N.M.S.A. 1978, GAC and United resorted to the practice of adding additional argumentative material in a device called an appendix, without requesting or receiving permission from this Court. N.M.R. Civ. App. 9(b) and (k)(4). In addition to argument, the parties inserted other material from outside the record in these appendices, including a newspaper article and correspondence, contrary to the rules, N.M.R. Civ. App. 9(b), and to prior decisions of the Court. General Services Corp. v. Board of Com'rs, 75 N.M. 550, 552, 408 P.2d 51, 53 (1965); Porter v. Robert Porter \u0026 Sons, Inc., 68 N.M. 97, 101, 359 P.2d 134, 137 (1961). These we have also ignored.\n\nAlthough the briefs of all three parties are articulate forensic efforts, each, in one form or another, has failed to fully comply with the rules of this Court. Neither the significance of the issues involved nor the magnitude of the dollars at stake excuses noncompliance with those rules. We take this opportunity to serve warning on the bar that this Court fully expects compliance with its rules of procedure in general and its specific orders in particular, and will not hesitate to impose the sanctions provided for in N.M.R. Civ. App. 31, N.M.S.A. 1978, in order to secure adherence to the rules and to our orders.\n\nI.\n\nFACTUAL BACKGROUND\n\nTo understand the issues in this appeal we must begin with a more detailed factual summary than is usual. Many entities have interacted to create the conditions from which this case arose.\n\nA.\n\nTHE GULF URANIUM ORGANIZATION\n\nThe principal contract at issue here was entered into by Gulf and United. GAC's predecessor was at one time a wholly-owned subsidiary of Gulf. Most of United's allegations against GAC involve alleged wrongdoing by Gulf. Therefore, an understanding of the issues on appeal must begin with a background of Gulf's activities in the uranium market.\n\nIn 1967, Gulf entered the uranium business by purchasing a subsidiary of General Dynamics known as General Atomic. General Atomic, which was a manufacturer of nuclear reactors, was renamed Gulf General Atomic and was operated as a subsidiary of Gulf located in San Diego, California.\n\nIn 1970, Gulf formed a new division, called Gulf Energy and Environmental Systems (Gulf Energy). Gulf General Atomic became a part of Gulf Energy. Gulf Energy was the Gulf entity involved in the marketing of uranium and the manufacture of nuclear reactors. Gulf was the only manufacturer in the United States of high temperature gas cooled reactors.\n\nBeginning in 1967, Gulf undertook the exploration and development of uranium ore bearing properties. A Gulf division located in Denver, Gulf Minerals Resources Company (Gulf Minerals), was charged with this, the production end, of Gulf's uranium business. One of Gulf's first substantial uranium discoveries was made in 1967 in the Rabbit Lake area of Canada. Another wholly-owned Gulf subsidiary, Gulf Minerals Canada Limited (Gulf Canada), was responsible for the development of the Rabbit Lake uranium project. Gulf Minerals had administrative responsibility in the Gulf organization for Gulf Canada's operations.\n\nThe following chart outlines the organization, as of 1971, of those aspects of Gulf's uranium business operations which are essential to an understanding of this case.\n\nREFER TO THE BOOK FOR THE PROPER TABLE\n\nIn addition to its Canadian uranium reserves, Gulf, through Gulf Minerals, began to acquire substantial uranium reserves in the United States. By 1971, it had acquired the Mt. Taylor reserves in New Mexico, which contain the largest body of uranium ore in the United States. Through Gulf Energy, Gulf also began to purchase substantial quantities of uranium on the open market from other uranium producers. Two of such purchase agreements, those Gulf and GAC entered into with United, are the principal subjects of this litigation.\n\nB.\n\nTHE CONTRACTUAL RELATIONSHIPS OF THE PARTIES\n\nUnited is a major New Mexico uranium producer. Much of the uranium it produces is used in the nuclear reactors of public utilities. In the 1960's, United entered into the fuel fabrication market. Fuel fabrication is the process by which enriched uranium is manufactured into fuel clusters to power nuclear reactors.\n\nIn 1966, United entered into a contract to sell nuclear fuel to Commonwealth Edison, a commercial utility. It later contracted to sell fuel to I\u0026M, and signed letters of intent to deliver fuel to Detroit Edison, Duke Power, Yankee Atomic and Consolidated Edison, all of which are also commercial utility companies. United also signed a letter of intent with Commonwealth Edison to supply it with additional fuel.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nBy 1970, United's commercial nuclear fuels business required more capital than United had or could obtain on its own. In that year, United entered into negotiations with Gulf, through Gulf Energy, to form a joint commercial light water reactor fuel fabrication business. For its part, Gulf was interested in such a business as an outlet for its uranium supply and as an opportunity to enter the fuel market for such reactors, which might provide a hedge for its high temperature reactor business.\n\nThe negotiations between Gulf and United culminated in July 1971, with the formation of a jointly owned corporation called Gulf United Nuclear Fuels Corporation (Gulf-United). The purpose of Gulf-United was to manufacture and sell nuclear fuel for commercial power reactors. United contributed its expertise in the business and some of its facilities and employees. Gulf was to contribute capital. United assigned its rights under the utility contracts to Gulf-United, thereby obligating the new corporation to supply the utilities with uranium. United in turn agreed to supply the new corporation with the uranium needed to fulfill the utility contracts. This latter agreement will be referred to as the 1971 Supply Agreement. Gulf was to supply Gulf-United with one-half of the uranium required for each existing order and letter of intent, but, upon the advice of United's counsel, this obligation was made an option. Gulf owned fifty-seven percent of the capital stock of Gulf-United, and United owned the remainder.\n\nFrom 1971 to 1973, Gulf-United was jointly operated by Gulf and United. During this period Gulf-United formalized two of the letters of intent. For reasons that are disputed, Gulf-United's business did not prosper. In the summer of 1973, United agreed to sell its interest in Gulf-United to Gulf (the Buyout Agreement). United and Gulf then entered into a new contract, the 1973 Supply Agreement. Pursuant to this contract, which cancelled and rescinded the 1971 Supply Agreement, United agreed to sell Gulf-United the uranium needed to supply the utilities. Gulf-United continued to be obligated to supply the utilities with uranium. Thus, the 1973 Supply Agreement basically replaced the 1971 Agreement, with an upward adjustment in the price.\n\nIn November 1973, Gulf-United was merged into Gulf. Gulf then entered into a\n\npartnership with Scallop. That partnership, known as General Atomic Company (GAC), is the defendant here. Gulf transferred Gulf Energy, including Gulf General Atomic to the new partnership. In the spring of 1974, Gulf transferred the Gulf-United business operation, including the utility contracts and the 1973 Supply Agreement, to GAC. GAC thus became obligated to perform the utility contracts and acquired the right to receive uranium from United. In essence, GAC simply took over the operations of Gulf Energy and Gulf-United.\n\nLater in 1974, the new partnership, GAC, entered into another contract with United, the 1974 Supply Agreement, whereby United became obligated to supply GAC with an additional three million pounds of uranium.\n\nUnited contends that Gulf entered into the formation of Gulf-United and the 1971 Supply Agreement as part of an attempt to monopolize the uranium market, and with the specific intent of eliminating United as a competitor in the fuel fabrication and uranium mining industries. United contends that Gulf fraudulently promised to supply Gulf-United with capital and one-half of the uranium needed for the utility contracts. United alleges that as part of this monopolistic scheme, Gulf refused to honor its obligations, refused to permit Gulf-United to buy uranium on the open market, and forced United to supply all of the uranium necessary to meet Gulf-United's needs. United argues that by deliberately mismanaging Gulf-United and withholding capital and uranium, Gulf successfully forced United to sell its interest in Gulf-United to Gulf at terms Gulf dictated and to execute the 1973 Supply Agreement. United also alleges that Gulf, acting through GAC, planned and attempted to negotiate out of its obligations to the utilities, and to then resell the uranium which United was obligated to supply at prices that Gulf had fixed. Knowing that United was in desperate financial straits, Gulf and GAC are alleged to have sought to secure a security interest on United's Churchrock, New Mexico mine --the largest underground uranium mine in the United States --and the right to control production from that mine. GAC allegedly refused to give United any price relief. This impasse led to the filing of this case.\n\nAll of the foregoing alleged actions are asserted to have been part of a larger conspiracy to control uranium reserves in the United States. United contends that Gulf sought to accomplish this feat by tying up vast quantities of uranium through the contracts it entered into between 1972 and 1974 with other American uranium producers, in addition to the 1973 and 1974 Supply Agreements with United, and by acquiring, and then delaying the production of, uranium from Gulf's enormous Mt. Taylor reserves.\n\nC.\n\nTHE INTERNATIONAL URANIUM CARTEL\n\nSeveral months after this case was filed, United raised a new allegation -- that Gulf's and GAC's monopolistic efforts were part of a worldwide conspiracy of certain international uranium producers to fix the prices, allocate the markets, and control the production of uranium. United's efforts to secure discovery of records relating to this international uranium cartel became the major focus of this litigation, and GAC's failure to supply cartel-related information was the principal basis for the sanctions order and default judgment entered by the trial court.\n\nThe precise facts regarding the development and operation of the cartel are not completely clear, largely because full cartel-related discovery was not made in this case. However, several matters are well established.\n\nFirst, as GAC concedes, there was a uranium cartel made up of various international uranium producers, which operated from at least 1972 to 1975. Foreign governments, including those of Canada, South Africa, France and Australia, played some role in the formation and operation of the cartel. The nature of the roles played by\n\nthose governments, particularly by the Canadian Government, is a disputed question in this case, the resolution of which is critical to the disposition of one of the major issues raised by GAC on appeal. We will examine this question is Section II C, infra, of this opinion.\n\nSecond, it is established that Gulf, acting through Gulf Canada, was a member of the cartel no later than June 1972. It is also clear that the top executives of Gulf Energy, the immediate predecessor of GAC, were aware of the cartel and received information concerning its activities. At least two high-level officials of Gulf Energy attended one or more cartel meetings. All of these executives later became key personnel of GAC.\n\nThird, the basic purposes of the cartel are unquestionably clear. GAC's counsel stated to the trial court:\n\nThe purpose of [the cartel] was to set terms and conditions of sale. It was to set floor prices. And it was to set quotas and divide up who could produce how much. They were going to restrict supply. It was in its intention a cartel in every sense of the word. (Emphasis added.)\n\nOne of the Gulf attorneys who had advised Gulf that it was legal for it to join the cartel later told a Congressional subcommittee impaneled to investigate cartel activities: \"There, of course, was never any doubt about what the 'cartel' intended to accomplish. It was to completely frustrate free competition.\" International Uranium Cartel: Hearings Before the Subcomm. on Oversight and Investigation of the House Comm. on Interstate and Foreign Commerce, 95th Cong., 1st Sess., Serial No. 95-95, p. 89 (1977) [hereinafter cited as Hearings on International Uranium Cartel].\n\nFourth, between 1972, when the cartel apparently began, and 1975, when this suit was filed, the price of uranium in the United States increased from approximately $6.00 per pound to approximately $40.00 per pound.\n\nBeyond these four established facts -- the existence of the cartel, Gulf's active participation therein, the cartel's anticompetitive purposes, and the dramatic increase in uranium prices during the cartel's existence -- there is little about the cartel that is not disputed by the parties. One of the principal disputes is whether the cartel has any relevance to the contracts at issue in this litigation, which will be discussed in Section II B, infra, of this opinion.\n\nD.\n\nHISTORY OF THE PROCEEDINGS IN THE TRIAL COURT\n\nIn Section III A, infra, of this opinion we will discuss in detail the chronology of the proceedings in the court below in the context of analyzing GAC's efforts to comply with the court's discovery orders. At this point, however, it is necessary to provide a brief outline of those proceedings in order to facilitate an understanding of the overall posture of the case and the various issues on appeal.\n\nOn December 31, 1975, United filed this action in Santa Fe District Court. On the same day, United served lengthy interrogatories on GAC. This set of interrogatories will be referred to as the First Set of Interrogatories. The interrogatories called for detailed information concerning the uranium and fuel fabrication businesses of Gulf, Scallop and GAC. Many of the interrogatories specifically asked for information from \"the partnership and the partners.\" Neither the complaint nor the interrogatories specifically mentioned the international uranium cartel.\n\nOn April 5, 1976, GAC filed the first of two sets of answers to the First Set of Interrogatories. The answers provided no information on the cartel and virtually no information on the separate uranium business activities of Gulf and Scallop. The trial court eventually found these answers to have been \"wholly inadequate and evasive.\"\n\nDuring the summer of 1976, extensive discovery efforts were conducted by United. GAC produced its business records, but it did not produce documents which were in\n\nthe separate possession of Gulf or Scallop. On September 23, 1976, the Canadian Government promulgated the Canadian Uranium Information Security Regulations, which prohibited the release of cartel information from Canada.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e One week later, United pointed out for the first time that GAC had failed to produce documents from Gulf and Scallop. GAC then contended that it was not obligated to produce records which were in the separate possession of the partners. See Section II A, infra. The trial court rejected this argument on November 30, 1976. The court held that both the partnership and the partners were subject to its discovery orders, and it warned that sanctions would be imposed if either the partnership or the partners failed to comply with those orders.\n\nUnited then moved to compel production of partner documents and supplemental answers to the First Set of Interrogatories. GAC continued to assert that partner documents were not discoverable, and the court again rejected this argument at three different hearings in January 1977. It ordered GAC to provide supplemental answers and to produce partner documents by April 15, 1977.\n\nIn February 1977, United moved to compel production of cartel-related documents Gulf had produced in other litigation. GAC resisted production of these documents, once again rearguing the question of partner discovery. GAC also suggested for the first time that United's counsel, who had represented Gulf until November 1976 on its operations at Mt. Taylor, might have to be disqualified in this case. See Section IV, infra. On March 1, 1977, for the first time GAC specifically asserted the Uranium Information Security Regulations were a bar to discovery of cartel information. At a hearing on March 7, the court reiterated its previous rulings that Gulf was subject to its discovery orders, granted United's motion to produce the cartel records, and again warned that sanctions, including a default judgment, would be imposed if good faith discovery efforts were not made. GAC then formally moved to disqualify United's counsel. The court denied this motion. In March 1977, I\u0026M, which had been joined as a party in January 1977, filed claims against GAC, specifically asserting Gulf's cartel activities as a basis for the relief it sought. GAC's supplemental answers were filed on April 15. They made no mention of the cartel.\n\nIn August 1977, United filed its Second Set of Interrogatories. This set was specifically addressed to the activities of the cartel. GAC filed objections to these interrogatories. The objections made no mention of the Uranium Information Security Regulations or any other Canadian secrecy laws. The court overruled most of the objections. GAC then filed answers to these interrogatories, which included the assertion that Canadian laws barred production of cartel documents.\n\nUnited moved to compel further answers to the interrogatories and the production of cartel documents, and to have sanctions imposed. The trial court granted the request for further answers. The court found that GAC had not acted in good faith regarding the production of cartel documents up to that time. It ordered GAC to produce cartel records to the extent lawful, and to the extent that it was unlawful, to seek a waiver of Canadian nondisclosure laws. The court again warned that sanctions would be imposed if its order was not complied with.\n\nGAC unsuccessfully sought permission from the Canadian Government to produce cartel documents located in Canada. GAC then submitted its second set of answers which did not identify any cartel documents located in Canada or contain information from such documents.\n\nFive days after the trial began, United again moved to compel the production of cartel documents and for sanctions for GAC's alleged discovery failures. At a hearing on November 8, 1977, the trial judge accused GAC of \"stonewalling\" information.\n\nThe following day, GAC moved to disqualify the judge. The motion was denied. See Section V, infra. The trial court, after a hearing, found that GAC had deliberately housed cartel documents in Canada in an attempt \"to court legal impediments\" to their production. It also found that GAC had violated its prior order to identify cartel documents, and it again ordered such identification.\n\nIn December 1977, United and I\u0026M filed objections to GAC's second set of answers to the Second Set of Interrogatories and moved to compel further answers. The trial court granted this request. On February 1, 1978, GAC filed its third set of answers. Thereafter, United filed its fourth motion for a default judgment, in which I\u0026M joined. The trial court granted the motion, and entered the sanctions order and default judgment which is the subject of this appeal. The trial court found all issues of liability against GAC and in favor of I\u0026M and United. The Court found that GAC had acted in bad faith throughout the discovery process, and had \"willfully, intentionally and in bad faith covered up\" \"highly relevant\" information concerning the cartel and Gulf's role therein. The court said that GAC's answers to the First Set of Interrogatories were \"wholly inadequate and evasive,\" and that its series of answers to the Second Set of Interrogatories amounted to a willful, intentional, deliberate and bad faith failure and refusal to answer. See Section III, infra.\n\nA lengthy trial on the question of damages was conducted following entry of the sanctions order and default judgment. See Section VI, infra. On May 16, 1977, the court entered a final judgment against GAC.\n\nII.\n\nPROPRIETY OF DISCOVERY ORDERS\n\nThe first area we examine is whether the trial court's discovery orders, which the court found GAC had willfully failed to comply with, were within the court's authority to enter. If, as GAC contends, the court's orders were invalid from the outset, then GAC could not have been sanctioned for its failure to comply with them.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nThe orders involve the production of documents or the furnishing of information regarding the international uranium cartel. GAC contends that they were invalid for four reasons: (1) information and documents in the possession of the partners cannot be the subject of discovery orders in a case in which only the partnership, and not the individual partners, is a party; (2) the cartel documents and information are not relevant to any issue in this case; (3) adjudication of any issues regarding the cartel, and therefore discovery orders directed at cartel-related information and documents, are barred by the act of state doctrine and the exclusive federal power over the conduct of foreign relations; and (4) the New Mexico Antitrust Act cannot be applied to the 1973 and 1974 uranium supply agreements, and therefore, the court was without jurisdiction to enter discovery orders based on appellees' allegations of violations of that Act. Each of these contentions will be separately discussed in the sections that follow.\n\nA.\n\nDISCOVERY OF PARTNER DOCUMENTS\n\nGAC contends that a partner, who is not itself a party in a case brought against the partnership, may not be ordered to answer interrogatories under N.M.R. Civ. P. 33, N.M.S.A. 1978, or to produce documents under N.M.R. Civ. P. 34, N.M.S.A. 1978.\n\nThis issue arose when United served its First Set of Interrogatories on GAC. The\n\ninterrogatories clearly called for information from \"the partnership or partners.\" See Section III A, infra, and n. 80, infra. None of these interrogatories was objected to within the time provided by Rule 33.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e GAC provided only limited information from the partners in its original answers to those interrogatories. During several months of document production that followed the filing of those answers, it did not produce any records from the partners' files. In September 1976, United brought GAC's failure to provide information from the partners to the attention of the trial court. In November 1976, the court ruled that the right to discovery extends to \"a party partnership and the individual partners comprising the partnership, and the agents, servants, employees, directors and officers of a party or partner,\" and the court warned that sanctions would be imposed \"for the failure of the defendant partnership or either partner thereof to comply with specific orders of the Court directing discovery.\" (Emphasis added.)\n\nThe court reiterated this ruling on at least five separate occasions in early 1977. It held that the partners \"have the same obligation in relationship to discovery as the partnership,\" because \"[t]he partnership is not an entity in and of the cognizable law.\" The court stated: \"GAC has no substantive separate existence in law. It is not a separate legal entity.\" GAC then argued that even if the court could order production of partnership-related documents in the possession of the partners, it could not require the partners to produce \"non-partnership documents.\" The court rejected this contention on at least two occasions.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Finally, in early March 1977, GAC began to produce documents which were in the possession of the partners. A year later the default judgment was entered because GAC failed to produce all of Gulf's cartel records.\n\nGAC's argument is based on the principle that discovery under Rules 33 and 34 is limited to parties to the case. GAC argues that a partnership is a separate legal entity, and as such, only it, the named defendant in this suit, rather than the non-party constituent partners, is subject to discovery under Rules 33 and 34.\n\nWe find it unnecessary to consider the extent to which a partnership is a separate legal entity as a matter of substantive partnership law, because we conclude that under Rules 33 and 34 the trial court properly ordered GAC to produce partner documents and furnish information from the partners.\n\nIn construing Rules 33 and 34, we must begin with the notion that discovery is designed to \"make a trial less a game of blindman's buff and more a fair contest with the basic issues and facts disclosed to the fullest practicable extent.\" United States v. Procter \u0026 Gamble, 356 U.S. 677, 682, 78 S. Ct. 983, 986-87, 2 L. Ed. 2d 1077 (1958) (citation omitted). In light of that\n\npolicy, Rules 33 and 34 must be liberally construed in order to insure that a litigant's right to discovery is \"broad and flexible.\" Davis v. Westland Development Company, 81 N.M. 296, 299-300, 466 P.2d 862, 865-66 (1970). See also Goldman v. Checker Taxi Company, 325 F.2d 853, 855 (7th Cir. 1963); In Re Folding Carton Antitrust Litigation, 76 F.R.D. 420, 423 (N.D. Ill. 1977); Hart v. Wolff, 489 P.2d 114, 117 (Alaska 1971).\n\nRule 33 provides that interrogatories may be served only on a party, but it states that the interrogatories must be answered by the party served, or \" if the party served is... a partnership,... by any officer or agent, who shall furnish such information as is available to the party.\" (Emphasis added.) In an earlier opinion concerning this litigation, we noted that Gulf is a general agent of the GAC partnership. We stated: \"The agency of a partner is the hallmark of that particular form of business or professional association.\" United Nuclear Corp. v. General Atomic Co., supra, 90 N.M. at 100, 560 P.2d at 164. See ยง 54-1-9A, N.M.S.A. 1978. If, under Rule 33, Gulf is obliged, as an agent of GAC, to furnish answers to interrogatories directed at the partnership, it would be incongruous to hold that information in the possession of Gulf is not \"available\" to GAC for the purpose of giving complete and accurate answers to those interrogatories. Indeed, the rule that \"all information available to the interrogated party must be supplied... includes information possessed by, or within the knowledge of,... agents or representatives of the party.\" Wycoff v. Nichols, 32 F.R.D. 370, 372 (W.D. Mo. 1963) (citations omitted).\n\nAlthough Rule 34 requires production of documents in the \"possession, custody or control\" of a party, and, unlike Rule 33, it does not specifically refer to the discovery obligations of the agents of a partnership, the principle is well-established that Rules 33 and 34 are \"equally inclusive in their scope.\" Wilson v. Volkswagen of America, Inc., 561 F.2d 494, 513 (4th Cir. 1977), cert. denied, 434 U.S. 1020, 98 S. Ct. 744, 54 L. Ed. 2d 768 (1978). See also Davis v. Westland Development Company, supra, 81 N.M. at 299, 466 P.2d at 865.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nGAC concedes that the two rules should be similarly construed, but it argues that the focus should be on the concept of \"control\" under Rule 34, rather than on the phrase \"available\" in Rule 33. However, the proper focus is not so much on one phrase or on the other, as it is on the purposes underlying each limitation on the scope of discovery under those rules. In each instance, the purposes are relatively apparent and very pragmatic. Each phrase embodies only two limitations. First, a party obviously cannot be required to produce materials which he is incapable of procuring. Second, in general a party should not be required to obtain, collect or turn over materials which the opposing party is equally capable of obtaining on its own. Konczakowski v. Paramount Pictures, 20 F.R.D. 588, 593 (S.D.N.Y. 1957); Cinema Amusements v. Loew's, Inc., 7 F.R.D. 318, 321 (D. Del. 1947).\n\nIt is undisputed that neither United nor I\u0026M was capable of procuring on its own the information and documents sought from the partners. Thus, the critical inquiry concerns only the first of the above mentioned principles -- whether the party from whom the materials are sought has the practical ability to obtain those materials. Because the inquiry is a pragmatic one, the phrases \"available\" and \"possession, custody or control\" should not be subjected to formalistic strictures which ignore the policy of liberal discovery and the practical realities of the particular situation at issue. See Hart v. Wolff, supra, 489 P.2d at 117. Thus, it is immaterial under Rules 33 and 34 that the party subject to the discovery orders does not own the documents,\n\n\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e or that it did not prepare or direct the production of the documents,\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e or that it does not have actual physical possession of them.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e It is also clear that the mere fact that the documents are in the possession of an individual or entity which is different or separate from that of the named party is not determinative of the question of availability or control.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nIn light of the fact that partner documents were ultimately produced in this case, there can be little doubt that, as a practical matter, those documents were \"available\" to GAC.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e Therefore, they were subject to discovery orders entered under Rules 33 and 34.\n\nOur holding in this regard is not only supported by the language and underlying purposes of Rules 33 and 34, but also, it is mandated by two practical considerations. The first concerns the nature of a partnership; the second involves the business relationships of the entities involved in this case.\n\nA partnership is composed of and can only act through its constituent partners. As the trial judge pointed out in this case, if the discovery obligations of a partnership do not extend to the individual partners, then the partners could avoid all meaningful discovery by the simple expedient of maintaining the information and documents related to the partnership business in the separately located files of the partners, rather than in the partnership offices. Cf. C. Wright \u0026 A. Miller, Federal Practice and Procedure: Civil ยง 2208, at 616 (1970) (\"[A] party cannot immunize a document from inspection by turning it over to a nonparty so long as it remains in the party's control.\" (Footnote omitted.))\n\nThe second practical consideration which compels the conclusion that documents in the separate possession of the partners should be subject to production concerns the nature of Gulf uranium activities and the history of the General Atomic business operation as they relate to the issues raised in this case.\n\nAlthough GAC is a partnership rather than a subsidiary of Gulf, it simply took over the business of Gulf Energy including that of Gulf General Atomic. Gulf Energy was planned to be and was operated by Gulf as one part of a coordinated, comprehensive uranium business. Thus, through Gulf Minerals, Gulf Canada and Gulf Energy, Gulf was involved in the production of\n\nuranium, the purchase and sale of uranium supplies, the fabrication of uranium fuel and the manufacture of nuclear reactors. Prior to the creation of GAC, these various Gulf divisions or subsidiaries were clearly not operationally divorced from one another.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nThe transformation of Gulf Energy from a Gulf division to a partnership with Scallop changed the form of the business organization, but not the nature of the business it conducted. There was a substantial continuity of identity in the top levels of management.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e GAC succeeded to the business records of Gulf General Atomic, Gulf Energy and Gulf-United. The evidence does not indicate that when GAC took over Gulf Energy -- operating an identical business, in identical offices, with the same records, and with largely the same personnel in essentially unchanged reporting relationships -- it suddenly became totally divorced from the uranium activities of the partners comprising it.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e The flow of information and the transfer of key personnel from one entity to\n\nanother; the past history of close coordination of activities between GAC's predecessor and other Gulf companies; and the continuity of business purpose -- all substantially refute any such implication. We fail to see how what was apparently interrelated for purposes of corporate profit became totally separate and distinct when it became the subject of discovery in litigation.\n\nOther decisions involving discovery from distinct, though related, corporations in cases in which only one corporation is named as a party, support our conclusion that the coordinated nature of the business enterprises of separate entities may justify the imposition of discovery obligations on those entities which are not parties to the action.\n\nIn Societe Internationale, Etc. v. McGranery, 111 F. Supp. 435 (D.D.C. 1953), modified on other grounds sub nom., Societe Internationale, Etc. v. Brownell, 96 U.S. App. D.C. 232, 225 F.2d 532 (D.C. Cir. 1955), rev'd on other grounds sub nom., Societe Internationale v. Rogers, 357 U.S. 197, 78 S. Ct. 1087, 2 L. Ed. 2d 1255 (1958), the court ordered production of documents in the possession of a corporation, which, although related to the corporate-plaintiff, was not itself a party. The court said:\n\nCertain it is that the court can pierce the corporate veil to determine the true character of the interests making up its composition. Subtle relationships are necessarily to be contemplated. Through the interlocked web of corporate organization, management and finance there runs the thread of a fundamental identity of individuals in the pattern of control.\n\n111 F. Supp. at 441-42 (citations omitted). See also In Re Uranium Antitrust Litigation, 480 F. Supp. 1138, 1153 (N.D. Ill. 1979) (\"The formalities separating the two corporations cannot be used as a screen to disguise the coordinated nature of their uranium enterprise\").\n\nThese two decisions are consistent with our own in recognizing not only the practical managerial connections between the various entities, but also, the identity of financial interest in the outcome of the litigation. As GAC pointed out on this appeal, Gulf has \"a very significant interest in this litigation,\" and \"stands to gain or lose immediately from any decision.\" It should not be very startling then that we demand as the price of possible legal victory full participation in the disclosure of relevant information by those who stand to profit from the ultimate outcome. Therefore, we hold that the trial court properly concluded that documents and information in the separate possession of the partners were subject to production in a suit in which only the partnership was named as a party.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nB.\n\nRELEVANCY OF THE INTERNATIONAL URANIUM CARTEL\n\nThe trial court found that information concerning the international uranium cartel was \"highly relevant\" to United's antitrust, fraud, and breach of fiduciary duty allegations against GAC. GAC contests this finding, asserting that the cartel, which became the principal focus of discovery, is completely unrelated to the injury allegedly suffered by United. Therefore, GAC urges that its failure to produce documents and other information regarding the cartel could not be the basis for sanctions under N.M.R. Civ. P. 37(b)(2), N.M.S.A. 1978. See Roberson v. Christoferson, 65 F.R.D. 615, 620 (D.N.D. 1975); Annot., 6 A.L.R.3d 713, ยง 6 (1966). We analyze this question in light of the scope of discovery as defined by N.M.R. Civ.P. 26(b), N.M.S.A. 1978, the nature of United's and I\u0026M's allegations against GAC, and the light shed on those allegations\n\nby the presently available cartel evidence.\n\n1. The Legal Standard of Relevancy\n\nRule 26(b) states, in pertinent part, that a deponent\n\nmay be examined regarding any matter, not privileged, which is relevant to the subject matter involved in the pending action, whether it relates to the claim or defense of the examining party or to the claim or defense of any other party.... It is not ground for objection that the testimony will be inadmissible at the trial if the testimony sought appears reasonably calculated to lead to the discovery of admissible evidence. (Emphasis added.)\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nThis language is subject to a broad interpretation. Fort v. Neal, 79 N.M. 479, 481, 444 P.2d 990, 992 (1968). \"Objections based on alleged irrelevancy must, therefore, be viewed in light of the broad and liberal discovery principle consciously built into\" the rules of civil procedure. Independent Productions Corp. v. Loew's, Incorporated, 22 F.R.D. 266, 271 (S.D.N.Y. 1958). \"The boundaries defining information relevant to the subject matter involved in an action are necessarily vague, making it practically impossible to formulate a general rule by which they can be drawn.\" La Chemise Lacoste v. Alligator Company, Inc., 60 F.R.D. 164, 170 (D. Del. 1973).\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e Because courts \"are not shackled with strict interpretations of relevancy,\" Cox v. E.I. Du Pont de Nemours and Company, 38 F.R.D. 396, 398 (D.S.C. 1965), discovery is permitted as to matters that \"are or may become relevant\"\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e or \"might conceivably have a bearing\" on the subject matter of the action,\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e or where there is \"any possibility\" or \"some possibility\" that the matters inquired into will contain relevant information.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e Conversely, courts have said that discovery will be permitted unless the matters inquired into can have \"no possible bearing upon,\"\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e or are \"clearly irrelevant\" to the subject matter of the action.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e Not only is the term \"relevant\" subject to a broad interpretation as it is generally used in the discovery context, but also, it is given a particularly liberal interpretation for purposes of discovery in antitrust cases.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\n\n2. Summary of Evidence on the Gulf Uranium Business and the Cartel\n\nThe allegations of appellees give great weight to the claim that the cartel is relevant to the subject matter of this litigation. As amended, United's complaint named a number of distinct legal bases for the relief it sought -- the invalidation of the 1973 and 1974 Supply Agreements. The complaint alleged that (1) in violation of their fiduciary duties, Gulf and GAC withheld material facts which, if disclosed, would have had a bearing on United's decision to enter into Gulf-United and the 1971, 1973 and 1974 Supply Agreements; (2) the 1971, 1973 and 1974 Agreements were illegal and void because they had been procured through Gulf's and GAC's fraud; (3) Gulf mismanaged Gulf-United, refused to provide Gulf-United with uranium and capital, and economically coerced United into a position where it had no viable alternative to accepting Gulf's requirement of the 1973 Supply Agreement; (4) Gulf tried to eliminate United as a competitor in the nuclear fuels industry and to restrict its ability to compete in the uranium business; (5) the sudden increase in the cost of producing uranium, unforeseen to all but GAC and Gulf, rendered United's performance under the 1973 and 1974 Agreements commercially impracticable; and (6) the 1971, 1973 and 1974 Supply Agreements were void because they were in violation of New Mexico's antitrust laws prohibiting price-fixing attempts and conspiracies to monopolize, and actual monopolization of trade and commerce.\n\nI\u0026M's counterclaim specifically alleged that by their participation in the cartel, GAC and Gulf had violated the New Mexico Antitrust Act, thereby injuring I\u0026M. I\u0026M also defended against GAC's claim that performance of its obligation to supply I\u0026M with uranium had been rendered commercially impracticable by contending that the cartel was responsible for increases in the price of uranium, and therefore, such price increases were not unforeseen by GAC and Gulf.\n\nThe evidence which has been produced in this case demonstrates that information on the cartel could be crucial to the proper resolution of this litigation. The following review of some of that evidence should not be considered to reflect a view as to the merits of appellees' substantive claims, but rather, as support for their contention that the cartel is relevant to those claims.\n\nIn 1967, Gulf entered the uranium market by purchasing the General Atomic business. Over the next five years, Gulf purchased and began to develop various uranium ore bearing properties in the United States and Canada, including the large Mt. Taylor reserves in New Mexico. Thus, by the early 1970s Gulf was in a position to be a leading producer of uranium, nuclear fuel fabricator, and manufacturer of nuclear reactors. See Section I A, supra. It was therefore directly in competition with United.\n\nHowever, in 1971 Gulf and United formed the jointly owned company, Gulf-United, to fabricate fuel for commercial nuclear reactors, and executed the 1971 Supply Agreement. Independently of Gulf-United, Gulf also began to purchase large quantities of uranium from other American producers.\n\nContemporaneously with these activities, Gulf began to participate in early meetings of the cartel. Top officials of Gulf Energy (Rolander, Gallaway, Gregg, Hunter and Hoffman) were informed of the cartel's creation and Gulf's participation. Hunter, Gallaway and Rolander were the Gulf officials who negotiated the formation of Gulf-United and the execution of the 1971 Supply Agreement with United. All of these individuals later held key positions in GAC. See Section II A, supra, especially n. 16 and 17, supra. All but Gregg served on the Gulf-United board.\n\nOne document reflects that Hoffman, along with Zagnoli of Gulf Minerals in Denver, was participating in cartel discussions in Canada as early as February 1972. The same month Hunter informed Hoffman that Gulf Energy would \"proceed to tie up\" an additional ten million pounds of uranium.\n\nWithin weeks, Gulf Energy signed agreements with two American producers to purchase in excess of that amount of uranium. In March, according to Hunter's account, Hoffman informed the board of directors of Gulf Minerals: \"We've taken low cost supplies now on market.... We've cleaned out cheap material available now.\" Another document dated in the spring of 1972, which reviewed Gulf-United's financial condition, stated that Gulf's objective was to \"minimize UNC's [United's] book income.\"\n\nThroughout the spring of 1972, various Gulf officials from the United States attended meetings of the cartel. In late May, Hoffman and Hunter from Gulf Energy, Allen from Gulf Minerals, and Ediger from Gulf Canada, flew to Johannesburg, South Africa for a meeting of the cartel. The available cartel evidence shows that in Johannesburg, the cartelists adopted a set of rules to govern their organization. The rules allocated markets among the participating nations, set minimum prices for uranium, and established a rigged bidding system with a lead bidder and a runner-up bidder. Under a heading labeled \"Attitude Towards Competitors,\" the Rules stated:\n\nIt was agreed that if a supplier not associated with the organization should quote under the minimum price, the leader will not match that quotation and the [cartel's] Operating Committee will review the situation and decide on a course of action as soon as possible.\n\nThe Rules also provided that all quotations to fuel fabricators and nuclear reactor manufacturers \"should be made on the basis of the minimum prices.\"\n\nAlthough the Johannesburg Rules provided for the exclusion of the United States domestic uranium market, one week after the Johannesburg meeting, Hunter, in referring to \"the agreements which we have reached in the last couple of days with respect to action which we will be taking,\" told Hoffman that Gulf's \"overall strategy must reflect the interrelationship existing between foreign and domestic markets.\" He went on to say that \"foreign and domestic marketing activities are inseparable and indeed should be treated integrally if we are to optimize the company position.\" In the following paragraph, Hunter stated: \"Based on input provided by Gulf Minerals, we conclude that corporation profit is greater if New Mexican production begins in 1978 rather than 1976.\" Hunter then noted that \"[i]n order for us to realistically appraise our U308 competitive position as well as to effectively sell foreign uranium, it is necessary for us to sell uranium directly to the U.S. utilities.\"\n\nThe minutes of a September 5, 1972 cartel meeting indicate that the cartel was considering the prospect of taking anticompetitive actions against the foreign uranium operations of American corporations. The minutes reported:\n\nThere followed a general discussion of the impact of Westinghouse bidding in Europe.... Some members thought that Westinghouse should be approached directly, whereas other views were that it would be a dangerous move. The consensus finally reached was that if the club was to survive as a viable entity, it would be necessary to delineate where the competition was and the nature of its strength, as a prelude to eliminating it once and for all. (Emphasis added.)\n\nIn September 1972, a Gulf attorney observed that \"it is improbable that either the cartel structure or operation will remain static,\" and warned that \"the instinctive reaction of the cartel's Operating Committee will likely be to exert pressure to suppress the new competition one way or another.\" He said:\n\nIt could well be that the governments involved would tacitly approve (or effectively direct) predatory actions by the cartel producer members to suppress outside competition from any source.... (Emphasis added.)\n\nIn March 1973, Hunter, of Gulf Energy, reported that Westinghouse was trying to buy uranium to cover its \"substantial foreign shortage.\" Hunter stated that if successful, the purchase \"would provide Westinghouse with a potential source for U.S.\n\nreactor sales.\" He said that Gulf Energy would \"work with GMCL [Gulf Canada] to try to put pressure on the Australians to block the proposed arrangement.\"\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\n\nGregg, the Gulf Energy employee who became Gulf's representative on the cartel's Operating Committee, testified in a deposition taken in the Westinghouse uranium litigation that\n\nWestinghouse was not necessarily singled out for discussion each and every time. There were others who were discussed from time to time, also; GE [General Electric], KWU in Germany, ASEA in Sweden; other reactor manufacturers, Exxon as a fuel fabricator, Gulf-United as a fuel fabricator, so perhaps Westinghouse was discussed more than any of the others. (Emphasis added.)\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\nBeginning in early 1973, United and Gulf entered into negotiations concerning the disposition of Gulf-United. On January 23, 1973, Mr. Henry, the executive vice-president of Gulf Oil in Pittsburgh, informed the president of United:\n\nIt is our intention that any sale of the shares of Gulf [in Gulf-United], of course, will be done entirely in good faith, on a fair basis, and free of any secret or undisclosed arrangements.\n\nGAC alleges that United had independent knowledge of the cartel, but it does not contend that in the negotiations that followed, Gulf informed United of its role in the cartel.\n\nIn June 1973, Gulf executed the 1973 Supply Agreement with United; and in September it bought United's interest in Gulf-United. In November 1973, the GAC partnership was formed, and along with the operations of Gulf Energy, the Gulf-United business was transferred to GAC.\n\nWithin nine months of the execution of the 1973 Supply Agreement and the buyout of United's interest in Gulf-United, Gulf also purchased several million pounds of uranium from two other American producers. During the same period, it signed definitive contracts with two utilities to formalize the letters of intent United had previously signed and assigned to Gulf-United.\n\nBy March 1974, Mr. Fowler, a GAC employee reported:\n\nWhat appears to be happening is that the international producers are in effect setting the world price via\n\na) establishing a \"floor\" that is higher than the U.S. offers to buy.\n\nb) the U.S. producers refuse to sell at any price that doesn't give them a substantial margin above the \"floor\" being quoted by the non-U.S. producers.\n\nc) Thus, in essence, the international producers can stop any transactions by constantly nudging the floor upward.\n\nIn the interim, the U.S. buyer becomes increasingly frustrated, offers a higher price in order to get some response and the cycle starts over again.\n\nIt seems likely that at some point, the mechanism will break down and if it does, there will again be price competition. However, it doesn't appear likely the break will come in the immediate future.\n\nThree months later, GAC signed the 1974 Supply Agreement, committing United to supply an additional three million pounds of uranium.\n\nWe accept none of the available cartel evidence as conclusive. However, where business records such as these are produced from the files of GAC and Gulf, and where it is undisputed that a uranium cartel existed and that Gulf was a member of it, we are satisfied that cartel information is relevant to the subject matter of this litigation in general, and to the specific allegations of the parties. We look with a jaundiced eye upon any claim of irrelevancy made in the background of (1) the common identity of the individuals who negotiated the contracts at issue here and the information of Gulf-United; who participated in meetings of the cartel on behalf of Gulf or were privy to cartel information; and who later formed the top level of management of GAC; (2) the temporal proximity of cartel activities to the purchase by Gulf and GAC of substantial quantities of uranium from several major American producers -- including the 1971, 1973 and 1974 Supply Agreements with United; to the formation, the buyout and the dissolution of Gulf-United; and to the creation of GAC; and (3) references to \"cleaning out\" and \"tying up\" \"cheap material\"; to objectives of \"minimizing UNC's [United's] book income\"; to the \"inseparability of domestic and foreign uranium marketing\"; to Gulf's need to sell uranium \"directly to the U.S. utilities\"; to working with Gulf Canada to \"block\" a Westinghouse uranium purchase; to the likely need to suppress new competition \"one way or another\"; and most striking of all, to \"the consensus,\" reached by the cartel in the context of discussing an American corporation, \"to delineate where the competition was and the nature of its strength as a prelude to eliminating it once and for all.\" These things are not the stuff of which antitrust irrelevancy is made.\n\nFinally, we cannot accept GAC's argument that the cartel is irrelevant to the commercial impracticability issues in this case.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e We cannot say that such evidence has no possible bearing on United's claim that the cartel itself was responsible for the enormous price increases in uranium that took place contemporaneously with the operation of the cartel. If the cartel is relevant to that claim, it is no less relevant to I\u0026M's defense that GAC is in no position to claim commercial impracticability because, along with Gulf and the other cartelists, it was responsible for, and thus foresaw, those price increases.\n\n3. GAC's Arguments as to the Cartel's Irrelevance\n\nGAC argues that the cartel was irrelevant because United \"has been unable to adduce any evidence whatsoever that the 1973 and 1974 contracts were in any way connected with the activities of the cartel.\" Obviously this proposition is untenable. United sought cartel evidence in order to establish that the 1973 and 1974 Supply Agreements were connected to cartel activities\n\nin one manner or another. It makes no sense whatsoever to say that the cartel is not relevant, and therefore cartel information will not be produced, because the plaintiff who seeks such discovery has failed to produce, from what has been withheld from it, evidence to conclusively establish its case. As the court said in Beler v. Savarona Ship Corporation, 26 F. Supp. 599 (E.D.N.Y. 1939):\n\nThe requirement of materiality does not... compel the person seeking discovery definitely to prove materiality before being entitled to a discovery. Such an interpretation of the rule would place upon it a narrow construction which would severely limit the bounds of the discovery procedure. It might compel a party to know what was in the documents before he had seen them. One of the basic purposes of the new rules is to enable a full disclosure of the facts so that justice might not move blindly.\n\nSee also Radio Corporation of America v. Rauland Corporation, 18 F.R.D. 440, 444-45 (N.D. Ill. 1955).\n\nGAC further argues that the cartel cannot conceivably be relevant because by May 1971, United had \"locked up\" the uranium covered by the 1973 Supply Agreement through supply contracts it had directly entered into with the utilities; and second, that the cartel came into existence in 1972. Because United allegedly had committed the uranium previous to the formation of the cartel, GAC concludes that cartel activities could not possibly have been the cause of any competitive injury United might have suffered.\n\nThere are a number of reasons why this argument must be rejected. In the first place, there is a dispute in this case over the question of whether the uranium covered by the 1973 Supply Agreement was in fact \"locked up\" prior to the formation of the cartel, or even prior to the execution of the 1971 Supply Agreement. Over one-half of the uranium at issue here involves the utility agreements with Detroit Edison and Duke Power. Originally, this uranium was covered by letters of intent United signed with the utilities in 1969 and 1970, respectively. United's contention that these were merely non-binding agreements finds some support in the record.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e But even if we were to assume that they were binding contracts at the time of the formation of Gulf-United in 1971, and that the cartel was not formed prior to 1972, it would not necessarily follow that cartel evidence has no bearing on the issues in this case.\n\nUnited contends that Gulf did not disclose a slippage in the construction of a Commonwealth Edison reactor which allegedly would have waived Gulf-United's obligation to supply the utility with fuel, and that Gulf signed a secret \"side-letter\" with Duke waiving conditions which also allegedly would have denied Duke uranium. These actions were allegedly taken in order that GAC could resell the uranium covered by the 1971 and 1973 Supply Agreements at higher prices. Other allegations which would have a bearing on the case, even if the uranium had all been previously committed by United, are that Gulf wrongfully\n\nrefused to supply Gulf-United with the uranium needed to fulfill the requirements of the utility contracts, wrongfully blocked Gulf-United's efforts to purchase uranium on the open market, and wrongfully interfered with United's efforts to independently negotiate directly with the utilities for price relief and other conditions of sale. Cartel information is relevant to United's claim that Gulf tied up the cheap material on the market, thus denying United alternative sources of uranium to fulfill its commitments to Gulf-United and driving up uranium prices. United argues that the price increases encouraged new exploration and mining which increased the competition for limited mining supplies and labor, and in turn caused United to incur far greater uranium production costs than it otherwise would have.\n\nWe also consider it material to GAC's relevancy argument that Gulf apparently considered it necessary \"to sell uranium directly to the U.S. utilities\" in order to maintain its competitive position; and that GAC now contends that although it is not obligated to supply uranium to I\u0026M or the other utilities,\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e United nonetheless remains obligated to supply GAC with at least a substantial portion of the uranium covered by the 1973 Supply Agreement.\n\nFinally, even were GAC's position sound as to United's allegations of fraud, breach of fiduciary duty, economic coercion and antitrust violations concerning the 1973 Supply Agreement, it would have no bearing on United's allegations concerning the 1974 Supply Agreement, or on United's and I\u0026M's claims based on commercial impracticability. As to the former, GAC contends that it involved a blind transaction, and since it therefore did not know the seller, neither GAC nor Gulf could have entered into that agreement with illicit intentions towards United. However, that fact does not alone dispose of United's claims, for even such a blind agreement could conceivably have been a part of a scheme to achieve monopoly control over United States uranium reserves. As to the commercial impracticability questions, we have previously noted that even GAC does not advance a persuasive argument of irrelevancy. See n. 30, supra.\n\nGAC vehemently contests the merits of each of the foregoing allegations, contending that all are unsubstantiated.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e But in the discovery context, it is not the function of the trial court or of this Court to try every issue prior to the full disclosure of all relevant information.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e Nor is it\n\nthe function of... counsel to rule with finality on the relevancy or irrelevancy of documents in their exclusive possession and thereby to deprive both Court and opposing counsel of an opportunity to evaluate their contentions.\n\nRadio Corporation of America v. Rauland Corporation, supra, 18 F.R.D. at 444. The rules call for something quite different:\n\nUnless it is palpable that the evidence sought can have no possible bearing upon the issues, the spirit of the new rules calls for every relevant fact, however, remote, to be brought out for the inspection not only of the opposing party but for the benefit of the court which in due course can eliminate those facts which are not to be considered in determining the ultimate issues.\n\nHercules Powder Co. v. Rohm \u0026 Haas Co., 3 F.R.D. 302, 304 (D. Del. 1943). See also La Chemise Lacoste v. Alligator Company, Inc., supra, 60 F.R.D. at 171.\n\nAt the present stage of the litigation, we are unable to say that information concerning an international uranium cartel, which had as its avowed purpose the fixing of prices for and the allocation of markets in uranium, and which counted a constituent partner of GAC as one of its members, palpably can have no possible bearing upon the subject matter of this action. Therefore, cartel information satisfies the test of relevancy for purposes of discovery under Rule 26(b).\n\nC.\n\nACT OF STATE DOCTRINE AND EXCLUSIVE FEDERAL POWER OVER FOREIGN RELATIONS\n\nGAC's second basis for challenging the validity of the trial court's discovery orders involves two distinct legal principles -- the act of state doctrine and the exclusive power of the federal government over the conduct of foreign relations. Although distinct, each principle is alleged to be applicable to this case because of two actions of the Canadian Government -- first, the role that Government played in the foreign uranium cartel; and second, the Canadian Uranium Information Security Regulations. GAC contends that both principles, as applied to these actions of Canada, precluded the trial court from considering any claims concerning the cartel or Gulf's role therein and, therefore, from entering discovery orders directed at cartel documents or information. The applicability of each of these principles will be separately examined.\n\n1. The Canadian Government's Role in the cartel a. The Act of State Doctrine\n\nThe classic definition of the act of state doctrine is found in Underhill v. Hernandez, 168 U.S. 250, 252, 18 S. Ct. 83, 84, 42 L. Ed. 456 (1897):\n\nEvery sovereign State is bound to respect the independence of every other sovereign State, and the courts of one country will not sit in judgment on the acts of the government of another done within its own territory.\n\nThe act of state doctrine, which has \"'constitutional' underpinnings,\" reflects \"the proper distribution of functions between the judicial and political branches of the Government on matters bearing upon foreign affairs.\" Banco Nacional de Cuba v. Sabbatino, 376 U.S. 398, 423, 427-28, 84 S. Ct. 923, 940, 11 L. Ed. 2d 804 (1964). The doctrine \"derives from the judiciary's concern for its possible interference with the conduct of foreign affairs by the political branches of the government.\" Timberlane Lbr. Co. v. Bank of America, N.T. \u0026 S.A., 549 F.2d 597, 605 (9th Cir. 1976). The doctrine is a matter of federal law which is binding on state courts. Banco Nacional de Cuba v. Sabbatino, supra, 376 U.S. at 427, 84 S. Ct. at 939; Republic of Iraq v. First National City Bank, 353 F.2d 47, 50-51 (2nd Cir. 1965), cert. denied, 382 U.S. 1027, 86 S. Ct. 648, 15 L. Ed. 2d 540 (1966).\n\nGAC contends that the act of state doctrine is applicable because the Canadian Government participated in the cartel and effectively compelled Gulf, through its Canadian subsidiary, Gulf Canada, to join the cartel, transforming the cartel itself and all actions Gulf or Gulf Canada may have taken pursuant to it into the acts of a foreign state.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e GAC asserts that judicial inquiry\n\ninto the cartel and Gulf's role therein is precluded by the act of state doctrine because such an inquiry would necessarily place in question the legitimacy of the Canadian Government's actions.\n\nThe Canadian Government has repeatedly stated that it \"initiated\" the discussions which led to the formation of the cartel, and that it thereafter \"participated\" in that organization. It has also stated that it \"approved\" of the participation of Canadian uranium producers in the cartel and that Gulf participated at the Government's \"specific written request.\"\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e\n\nWe accept these representations of the Canadian Government. However, the initiation of the cartel and the participation therein by that Government are not sufficient alone to transform the cartel-related activities of a wholly-owned subsidiary of a corporation based in the United States into the sovereign acts of a foreign nation, and thus to immunize those activities from challenge in American courts.\n\nIt is well-settled that the mere fact that a foreign government approved, authorized, tolerated, encouraged, aided, or participated in the anti-competitive actions of a private individual or corporation does not necessarily provide an act of state defense. See Cantor v. Detroit Edison Co., 428 U.S. 579, 592-93, 96 S. Ct. 3110, 3118, 49 L. Ed. 2d 1141 (1976);\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e Continental Co. v. Union Carbide, 370 U.S. 690, 706-07, 82 S. Ct. 1404, 1414, 8 L. Ed. 2d 777 (1962); U.S. v. Sisal Sales Corp., 274 U.S. 268, 276, 47 S. Ct. 592, 593, 71 L. Ed 1042 (1927); Mannington Mills, Inc. v. Congoleum Corp., 595 F.2d 1287, 1293 (3rd Cir. 1979); Timberlane Lbr. Co. v. Bank of America N.T. \u0026 S.A., supra, 549 F.2d at 606; Linseman v. World Hockey Ass'n, supra, 439 F. Supp. at 1324; United States v. The Watchmakers of Switzerland Information Center, Inc., 1963 Trade Case. para. 70,600 (S.D.N.Y. 1963), order modified, 1965 Trade Cas. para. 70,352 (S.D.N.Y. 1965); Annot., 40 A.L.R. Fed. 343, 379-80, ยง 15 (1978); Baker, Antitrust Conflicts Between Friends: Canada and the United States in the Mid-1970's, 11 Cornell Int'l L.J. 165, 177-78 (1978). In the recent case of Industrial Inv. Development v. Mitsui \u0026 Co., Ltd., 594 F.2d 48 (5th Cir. 1979), cert. denied, 445 U.S. 963, 100 S. Ct. 1078, 63 L. Ed. 2d 318 (1980), the court said that \"the instigation of foreign governmental involvement does not mechanically protect conduct otherwise illegal in this country from scrutiny by the American courts.\" Id. at 52.\n\nIt is not sufficient merely to say the Government of Canada played a role in the cartel. The critical inquiry is into the nature of the role played by the foreign government, for \"the very assertion of an act of state defense requires the court to examine into the nature of the conduct complained of and its relationship to the foreign sovereign.\" Hunt v. Mobil Oil Corp., supra, 550 F.2d at 79 (citations omitted) (Van Graafeiland, J., dissenting). Unless a court can examine this initial issue -- \"whether the acts complained of are in reality the acts of the defendants or the acts of a foreign government\"\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e -- it cannot determine\n\nwhether the act of state doctrine applies, for that doctrine requires the act in question to be \"the public act of those with authority to exercise sovereign powers.\" Alfred Dunhill of London, Inc. v. Cuba, 425 U.S. 682, 694, 96 S. Ct. 1854, 1861, 48 L. Ed. 2d 301 (1976).\n\nIn each of the act of state decisions cited above, there appeared to be little doubt as to the nature of the role played by the foreign government. However, in this case, the absence of cartel discovery has made it impossible for our courts to determine the preliminary question -- whether the challenged acts involve any action by the Government of Canada. There are two aspects to this dilemma.\n\nFirst, neither the official statements of the Canadian Government nor the available cartel evidence fully describes the acts of the cartel or the situs of those acts. More specifically, without the cartel records, it is impossible to determine precisely what cartel-inspired actions Gulf Canada, Gulf or GAC may have taken, at whom such actions may have been directed, or where they occurred.\n\nSecond, the absence of cartel information has made it impossible to fully delineate the precise role played by the Government of Canada in the cartel; and more importantly, what specific actions, if any, Gulf was \"compelled\" by that Government to perform, or where those activities took place.\n\nWithout this vital information we cannot determine if the act of state doctrine is applicable, as the following hypotheticals demonstrate. First, if we assume that the cartel, as the Canadian Government has described it, was not intended to, and did not have an adverse impact on, the domestic market of the United States, then cartel activities might well be beyond the scope of American antitrust laws,\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e and shielded by the act of state doctrine.\n\nHowever, we could also assume -- because the absence of cartel records makes it impossible to negate the possibility -- that Gulf, with the knowledge of such anticompetitive, non-United States activities and of the potential business opportunities such activities presented, went beyond the scope of the cartel as the Canadian Government defined it, and took predatory actions in the United States designed to eliminate competitors and to monopolize uranium reserves.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e If this were the case, GAC and Gulf would not be shielded by the act of state doctrine, since the Canadian Government would have played no role in the specific anticompetitive conduct challenged in our courts. See Continental Co. v. Union Carbide, supra, 370 U.S. at 706-07, 82 S. Ct. at 144; W. Fugate, supra, at 148.\n\nThe Canadian Government has repeatedly stated that the United States was excluded from the cartel's operations. However, Prime Minister Trudeau stated in October 1977 that although the exclusion of the domestic markets of the United States and Canada was his government's policy, he did not rule out the possibility that some producers may have gone beyond that policy. He stated: \"We have no knowledge what some companies may have done under the pretext or cover of government policy.\" Official Report of House of Commons Debates, Vol. 121, No. 6, p. 224, 3rd Sess., 30th Parliament (Oct. 25, 1977).\n\nWithout the withheld cartel documents it is impossible to determine whether the limited territorial scope of that policy was adhered to by the cartel or by Gulf. Although the Canadian Government has said that the cartel did not include the United States market, the broad proscriptions of the Canadian Uranium Information Security Regulations are not similarly limited. The language of those Regulations is broad enough to encompass any documents or information concerning the uranium activities of an American corporation in the United States.\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e Thus, the breadth of the regulations effectively precludes our courts from determining whether GAC or Gulf took predatory actions against their competitors in the United States, either as part of the cartel conspiracy or completely independently of it.\n\nIt is clear that the Canadian Government does not wish to permit the courts of this country to inquire into whether Gulf exceeded the original scope of the cartel. However, whether Gulf adhered to the limited territorial scope of the cartel as Canada defined it is an inquiry that the act of state doctrine cannot preclude an American court from making. It is for the courts of this country, and not for the government of a foreign state, to determine whether our nationals took actions in our nation in violation of our laws.\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e The existence of cartel evidence indicating that the cartel might have exceeded its original non-United States scope makes it imperative that our courts be free to conduct such an inquiry in this case.\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e\n\nGAC argues on appeal that United has \"failed to show that the cartel either sought to or did harm United\"; has \"failed to show that the cartel even considered uranium producers\"; and has not cited \"any competent evidence that the cartel engaged in any predatory activity against anyone.\" These assertions are entirely beside the point. It is inconsistent for a party to fail to produce records and to then contend that the opposing party has failed to point to any records to support its allegations. We will not accept the proposition that the broad and vague outlines of a foreign government's activities automatically activate a doctrine which provides a total eclipse of the judicial search for the truth.\n\nThe absence of cartel records makes the second aspect of Canada's alleged involvement\n\nin the cartel -- its compulsion of Gulf Canada -- equally unavailing to GAC under rubric of the act of state doctrine.\n\nIn Interamerican Refining Corp. v. Texaco Maracaibo, Inc., 307 F. Supp. 1291, 1297-98 (D. Del. 1970), the court held that where an American corporation is compelled by a foreign government to commit anti-competitive practices, such compulsion constitutes a complete defense to an antitrust action based on those practices. See also United States v. The Watchmakers of Switzerland Information Center, Inc., supra; K. Brewster, supra, at 92-94; W. Fugate, supra, at 148-49; Annot., 12 A.L.R. Fed. 329, 340-43, ยง 4 (1972); Annot., 40 A.L.R. Fed. 343, 377-79, ยง 14 (1978). However, \"[o]ne asserting the [sovereign compulsion] defense must establish that the foreign decree was basic and fundamental to the alleged antitrust behavior and more than merely peripheral to the overall illegal course of conduct.\" Mannington Mills, Inc. v. Congoleum Corp., supra, 595 F.2d at 1293.\n\nThe reason why the sovereign compulsion defense cannot be invoked here is because the absence of cartel records makes it impossible to determine precisely what acts, if any, were compelled, and where those acts were performed.\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e\n\nThe available cartel evidence bearing on the question of government compulsion is ambiguous and conflicting. The Canadian Government has stated that the participation of all Canadian uranium producers in the cartel was \"a matter of Canadian Government policy,\" which was \"implemented through the [Canadian] Atomic Energy Control Act and Regulations.\" The Government also stated it had \"secured compliance with the terms of the [cartel] arrangement.\" However, Prime Minister Pierre Trudeau stated in response to a question in the Canadian Parliament that the contention \"about the government forcing companies into [the cartel]... is obviously a spurious argument.\" He said that \"the government had a policy which authorized\" the cartel and that the Government had \"requested\" Canadian uranium producers to act within that policy. Official Report of House of Commons Debates, Vol. 121, No. 6, p. 224, 3rd Sess., 30th Parliament (Oct. 25, 1977).\n\nThe cartel records that have been produced do not substantially clarify this issue. Initially, Gulf described its attendance at early cartel meetings as a response to \"a very strong invitation\" from the Government to participate in the cartel; Gulf Canada had been \"forcefully invited\" to attend. From the outset, however, Gulf apparently conditioned its participation upon a determination that it would not result in violations of the United States antitrust laws.\n\nIn April 1972, an associate general counsel for Gulf wrote to Gulf's general counsel in Pittsburgh concerning \"an agreement\" in the making \"among producers of uranium.\" He stated that the producers would present their agreement to the Canadian Cabinet \"for approval,\" and that the Cabinet would thereafter direct the producers to participate in the agreement.\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e He concluded that\n\na decision by Gulf to participate in the cartel was necessary before the cartel's Paris meeting on April 20-21, because \"there is no point in our attending the meeting unless we have decided to go along.\"\n\nGulf apparently decided \"to go along.\" Roger Allen, an attorney for Gulf Minerals in Denver, attended the cartel's Paris meeting, along with Gulf Minerals' president, S.A. Zagnoli. However, Gulf was nevertheless still concerned about its possible liability under United States antitrust laws. Allen told the other cartel members that \"Gulf management was unwilling to take such a risk and, consequently, any participation by Gulf in the arrangement was conditioned upon receiving an expression from the U.S. Department of Justice satisfactory to Gulf.\"\n\nThe following month, Gulf indicated that although it remained concerned about United States antitrust laws, it otherwise agreed \"in principle with the desirability of establishing a marketing arrangement.\" By June 1972, Allen was reporting that Gulf had decided that it \"should not even file a White Paper with the Department of Justice. Gulf Minerals had agreed to take a business risk....\" (Emphasis added.)\n\nAlthough by early June 1972, Gulf had established \"compulsion\" as the \"fountainhead\" of its antitrust defense, in July 1972, Gulf officials were nevertheless describing \"the nature of the Canadian Government activity in fostering the Organization\" as \"still a bit fuzzy.\" As late as September 1972, a Gulf attorney stated that Gulf's antitrust problem was aggravated by the \"ambiguous role played by the cartel governments.\" The following month, the same attorney referred to the \"interchanging and ambiguous capacities in which the Canadian Government had acted.\" Thus, six months after the government \"compulsion\" allegedly occurred, Gulf officials were still having difficulty delineating the role played by the Government.\n\nThe evidence suggests that Gulf officials took steps designed to bolster the sovereign compulsion defense by encouraging Canada to take a more explicit and less flexible position. As early as May 1972, Mr. Ediger, Gulf Canada's president, advised Mr. Hoffman, a member of the Gulf-United board of directors and a vice-president of Gulf Energy, the predecessor of GAC, that Gulf intended\n\nto suggest amendments [to the proposed producers' agreement] which will emphasize the fact that our participation is a result of direction from the Canadian government. Therefore, we will likely suggest [adding language] to indicate that Gulf and UCL [Uranez Canada Limited, a German corporation] are complying at the request of the Canadian government....\n\nIn September 1972, a Gulf attorney complimented Mr. Ediger for telling the other cartel members that \"it was very important for continuity to reside in the [Canadian] Department of E.M.\u0026 R. [Energy, Mines, and Resources].\" The attorney went on to say:\n\nWhatever the occasion for expression of this position, Gulf representatives should take advantage of the occasion and recognize it as the party line. The more intricately involved the Canadian Government and any of its agencies or Departments becomes and remains in this uranium matter, the better the degree of protection for Gulf. (Emphasis added.)\n\nOne reasonable inference that can be drawn from this evidence is that Gulf wanted to be compelled by the Government of Canada; it is not particularly consistent with the notion that Gulf reacted, \"in innocence and good faith, to governmental threats and pressures.\" Graziano, Foreign Governmental Compulsion as a Defense in United States Antitrust Law,\n\n7 Va. J. Int'l L. 100, 117 (1967). The evidence does not establish to our satisfaction that Gulf -- acting without the intent to restrain competition -- innocently responded to foreign governmental pressure. Rather, it would appear that Gulf simply decided \"to take a business risk,\" and thereafter did all it could to minimize that risk by establishing \"the effective Canadian Government direction\" that it join the cartel as \"the fountainhead\" of its antitrust defense.\n\nEven if we were to assume, however, that Gulf had been effectively compelled to join and participate in the cartel operations, such compulsion might not provide an all-encompassing defense in this case, for the critical questions upon which application of the act of state doctrine turns would remain unresolved -- what specific acts were compelled and where did they take place.\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e\n\nUnited has alleged that GAC and Gulf sought to eliminate it as a competitor in the United States and to monopolize American uranium reserves. It further contends that the 1973 and 1974 Supply Agreements were part of that anticompetitive effort. Even if such actions were \"compelled\" by a foreign government the act of state doctrine would provide no protection to Gulf or GAC. By definition, the act of state doctrine applies only to the acts of a foreign state \"done within its own territory.\" Underhill v. Hernandez, supra, 168 U.S. at 252, 18 S. Ct. at 84. See also Republic of Iraq v. First National City Bank, supra, 353 F.2d at 51. \"The doctrine cannot be used to excuse the commission of illegal acts within the territorial boundaries of the United States.\" Linseman v. World Hockey Ass'n, supra, 439 F. Supp. at 1324 (citations omitted). Although the \"compulsion\" may have occurred in Canada, it is the acts that are compelled, rather than the compulsion itself, that are at issue in the present litigation. The act of state doctrine must apply to those acts, if it is to apply at all.\n\nWe cannot agree with the proposition that if a foreign state compels an American corporation to take actions in the United States which are intended to and do have severe adverse consequences to free and fair trade in the United States, the American corporation is thereby immunized from the full force of the laws of its own sovereign.\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e To hold otherwise would render asunder the \"cornerstones of this nation's economic policies\" -- the antitrust laws. United States v. First National City Bank, 396 F.2d 897, 903 (2nd Cir. 1968).\n\nOur conclusion that the act of state doctrine is inapplicable is supported by the position taken towards the cartel by those branches of the federal government that are responsible for the formulation and execution of foreign policy.\n\nThe Proposition that the act of state doctrine should not be applied where the executive or legislative branches of the federal government have indicated that the act of a foreign state is not entitled to recognition under that doctrine was first set forth in Bernstein v. N.V. Nederlandsche-Amerikaansche, Etc., 210 F.2d 375, 376 (2d Cir. 1954). See generally Annot., 12 A.L.R. Fed. 707, ยง 2 [b] (1972). The Bernstein exception to the act of state doctrine was subsequently adopted by three members of the United States Supreme Court in First Nat. City Bk. v. Banco Nacional de Cuba, 406 U.S. 759, 767-70, 92 S. Ct. 1808, 1813, 32 L. Ed. 2d 466 (1972). Although the Bernstein exception has never gained the support of a majority of the Supreme Court,\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e neither in First Nat. City Bk.\n\nnor in any other case has the Court held that the position taken by the executive and legislative branches regarding the subject matter of the particular litigation in which the doctrine is sought to be invoked is irrelevant. The fact that those branches of the federal government which are responsible for the formulation and execution of foreign policy do not consider a certain subject to involve act of state implications is relevant to, but not dispositive of, the question of the applicability of that doctrine.\n\nBoth the executive and legislative branches have taken actions with respect to the uranium cartel which are clearly inconsistent with the notion that judicial examination of Gulf's participation in the cartel is precluded by the act of state doctrine.\n\nThe United States Government declined to state that this litigation involves \"a breach of friendly relations\" between the United States and Canada. In a letter transmitting communications from the Canadian Government to the trial court, the State Department stated that it was taking \"no position with regard to any of the issues raised\" by those letters, and that transmittal of the letters \"should not be understood as having implications with respect to the foreign affairs of the United States.\"\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e\n\nMore significantly, the federal government has affirmatively sought to apply the\n\nlaws of this country to Gulf's cartel activities. A Congressional subcommittee held hearings on the cartel. See Hearings on International Uranium Cartel, supra. A federal grand jury was impaneled to investigate the cartel. In Re Grand Jury Investigation of Uranium Industry, Misc. 78-0173, F.S. 78-0166 (D.D.C. 1978). In May 1978 the Justice Department filed a criminal information against Gulf, charging it with violations of the Sherman Antitrust Act, to which Gulf pled nolo contendere. United States v. Gulf Oil Corp., Cr. No. 78-123 (W.D. Pa. 1978).\u003cspan class=\"fnref\"\u003e50\u003c/span\u003e\n\nThe actions taken by both the legislative and executive branches regarding the cartel, and the detailed position the Justice Department has adopted in the general area of the extraterritorial application of United States antitrust laws (see n. 50, supra), are persuasive evidence that the branches of the federal government having responsibility for the conduct of foreign affairs do not consider the cartel activities of a major United States corporation to be immune from examination by the courts of this country.\n\nThese actions are more than a simple statement that the United States Government does not consider the act of state doctrine to be applicable to specific litigation involving private parties. The Government's position is also not merely an isolated instance involving a single corporation and a specific cartel. See n. 50, supra. Therefore, there is little danger that judicial deference to the executive branch's position will make the judiciary \"a mere errand boy for the Executive Branch which may choose to pick some people's chestnuts from the fire, but not others.\" First Nat. City Bk. v. Banco Nacional de Cuba, supra, 406 U.S. at 773, 92 S. Ct. at 1816 (footnote omitted) (Douglas, J., concurring).\n\nThe fact that these actions involved the public enforcement of the antitrust laws, rather than a civil antitrust action by a private litigant, is immaterial. Recognition of such a distinction would further no national interest. As one commentator noted:\n\nIt would seem that where the branches responsible for formulation of foreign policy have subordinated the sensitivity of foreign governments to having their acts of a particular sort explored in American courts that, at least after a successful prosecution of the American concern, the act of state doctrine should not stand in the way of the injured competitor's antitrust claim. In such a case, the act of state doctrine would thwart antitrust enforcement policies without furthering any separation of powers (judicial non-interference with foreign policy) values.... [T]he decision to review a foreign sovereign's act has already been contemplated by the statute and... already occurred in a prosecution.\n\nNote, \"Sherman Act Jurisdiction and the Acts of Foreign Sovereigns,\" 77 Colum.L. Rev. 1247, 1261 (1977) (footnote omitted).\n\nThe antitrust laws of this State and nation contemplate both public and private actions against those who may have violated them.\u003cspan class=\"fnref\"\u003e51\u003c/span\u003e They do not envision, nor should they be applied in such a way as to bring about, the anomalous situation in which the\n\npublic interest is vindicated by the imposition of a fine of several thousand dollars, but in which the private interest is frustrated by enforcement of a multi-million dollar judgment against what may have been a harmed competitor. To permit such a situation to exist could further the very anticompetitive and monopolistic goals which the multi-national corporation is alleged to have sought to achieve and which the antitrust laws were designed to prevent.\u003cspan class=\"fnref\"\u003e52\u003c/span\u003e\n\nb. Exclusive Federal Power Over Foreign Affairs\n\nGAC claims that even if the act of state doctrine does not bar an American court from examining Gulf's cartel-related actions, the principle of exclusive federal power over the conduct of foreign relations nevertheless precludes an American state court from conducting such an examination.\u003cspan class=\"fnref\"\u003e53\u003c/span\u003e\n\nGAC relies on Zschernig v. Miller, 389 U.S. 429, 88 S. Ct. 664, 19 L. Ed. 2d 683 (1968), in which the United States Supreme Court struck down an Oregon intestacy statute as it had been applied by the Oregon Supreme Court. 243 Or. 567, 412 P.2d 781 (1966). The Oregon statute required that in order to take property belonging to an Oregon resident by succession or testamentary disposition a non-resident alien had to prove that (1) American residents had a reciprocal right to inherit in the alien's country; and (2) the non-resident alien would be able to receive \"the benefit, use or control\" of the proceeds of the Oregon estate \"without confiscation\" by his government.\n\nIn Zschernig, the Court held that, as applied, the statute constituted an impermissible intrusion by the state into foreign affairs, an area which the Court said was entrusted by the United States Constitution solely to the President and Congress. The Court said that the statute required local probate courts to launch \"minute inquiries\" into the nature of foreign governments, the quality of rights which those governments accorded to both American citizens and their own citizens, the credibility of the representations of officials of foreign governments, and the actual administration of foreign legal systems. Zschernig, 389 U.S. at 433-35, 88 S. Ct. at 666-667.\n\nGAC contends that the Zschernig decision precludes state courts from exercising jurisdiction over issues relating to the foreign cartel because of the Canadian Government's relationship to the cartel. GAC argues that because the trial court was without jurisdiction to consider the cartel-related issues, it could not enter discovery orders directing the production of cartel documents.\n\nThe Zschernig decision, which has not been applied by the United States Supreme Court outside of the limited context of the alien inheritance statutes at issue in that case, has nothing to do with this case. Unlike the statute at issue in Zschernig, the causes of action involved in this case are universally accepted by American jurisdictions -- fraud, breach of fiduciary duty, commercial impracticability, economic coercion and antitrust. The effective enforcement of the antitrust laws is essential to the maintenance of free and fair business competition.\u003cspan class=\"fnref\"\u003e54\u003c/span\u003e Unlike the alien inheritance\n\nstatutes in Zschernig,\u003cspan class=\"fnref\"\u003e55\u003c/span\u003e the causes of action in this case do not involve questionable attempts by states to directly affect the rights of citizens in foreign nations, nor are they related to the foreign policy attitudes of this or any other state court.\n\nIn this litigation the courts of this State have not undertaken the type of analysis that Zschernig prohibits. No pejorative criticism has been directed at Canada or any other foreign government. No minute inquiry has been made into the actual administration of foreign law by a foreign government, or into the rights that such a government affords to its own citizens. The veracity of the representations of its diplomats has not been questioned. This case involves nothing more than an inquiry into what an American corporation has done in America, a situation which finds no appropriate analogy in Zschernig or its exceedingly limited progeny.\n\nThe states of this country have little interest in how a foreign government treats its own citizens, but they have every conceivable interest in anticompetitive conduct by American corporations occurring within their own borders. Likewise, foreign governments have a legitimate interest in the rights they choose to afford their own citizens; but they have no legitimate interest in whether a state court in this country will lend its judicial processes to the enforcement of contracts entered into in the United States by corporations based in this country for the supply of a resource to be mined and milled in the United States. Our courts have done no more than seek to enforce state laws which are consistent with federal laws, and with actions of the United States Congress\u003cspan class=\"fnref\"\u003e56\u003c/span\u003e and the United States Justice Department concerning Gulf's cartel activities. We therefore hold that neither Zschernig nor the act of state doctrine precludes the courts of New Mexico from litigating the cartel-related issues present in this case, or from seeking the production of documents which will facilitate the resolution of such litigation.\n\n2. Canada's Uranium Information Security Regulations\n\nGAC also contends that the trial court's discovery orders commanded conduct in violation of the Canadian Uranium Information Security Regulations, and were therefore prohibited by the act of state doctrine and the Zschernig decision.\n\na. Act of State Doctrine\n\nClearly, the Uranium Information Security Regulations were an act of state. They were promulgated by the Canadian Government pursuant to the Canadian Atomic Energy Control Act. They have been upheld by Canadian courts. The Regulations have been considered by both the Canadian executive and judicial branches to be in the public interest of Canada. However, it does not follow that because the Regulations were an act of state, the discovery orders were precluded by the act of state doctrine.\n\nThe trial court never ordered GAC, Gulf, or Gulf Canada to violate the Regulations, and never questioned the validity of those Regulations. In October 1977, the court ordered GAC to produce all non-privileged cartel records, \"[i]nsofar as it is lawful so to do.\" (Emphasis added.) The court went on to say that \"to the extent that it might be a violation of Canadian law to produce... [cartel] documents housed in Canada,\" GAC had an obligation to \"make an immediate diligent and good faith effort to obtain a lawful waiver of or dispensation from such Canadian prohibitions and to the extent thereafter lawful at the earliest possible date, actually produce for inspection and copying of such documents.\" (Emphasis added.) In subsequent orders the trial court expressly refused to order identification or production of cartel documents in violation of Canadian law. Instead, it relied on Rule 37 sanctions to redress the dilemma resulting from the absence of the documents or the identification thereof.\u003cspan class=\"fnref\"\u003e57\u003c/span\u003e\n\nFurther, the act of state doctrine is inapplicable insofar as the Regulations are concerned under the decision of the United States Supreme Court in Societe Internationale v. Rogers, 357 U.S. 197, 78 S. Ct. 1087, 2 L. Ed. 2d 1255 (1958). In that case the plaintiff, a Swiss holding company, had assets seized by the Alien Property Custodian during the Second World War pursuant to the Trading With The Enemy Act. After the War, the plaintiff filed suit against the Attorney General of the United States seeking to recover the property on the ground that it had not been an enemy within the meaning of the Act. The Government sought production of records which were in the possession of a Swiss banking company controlled by the plaintiff, which it claimed were relevant to the issue of the plaintiff's alleged \"enemy taint.\" The plaintiff failed to produce the documents because Swiss law prohibited production of the records. The district court dismissed the plaintiff's complaint, Societe Internationale, Etc. v. McGranery, 111 F. Supp. 435 (D.D.C. 1953). The Court of Appeals affirmed. Societe Internationale v. Brownell, 95 U.S. App.D.C. 232, 225 F.2d 532 (D.C. Cir. 1955). The Supreme Court unanimously reversed the two lower courts.\n\nTwo aspects of the Supreme Court's decision are pertinent to this case -- first, the propriety of a court's order to produce records located in a foreign country whose laws prohibit disclosure of the records; and second, the appropriateness of the sanctions imposed for a party's failure to comply with such an order where the failure is due to the proscriptions of foreign law. In this section of the opinion, we are concerned only with the first question; the latter aspect is considered in Section III A, infra.\n\nIn Societe Internationale, the Court stated:\n\nWhatever its reasons, petitioner did not comply with the production order. Such reasons, and the willfulness or good faith of petitioner, can hardly affect the fact of noncompliance and are relevant only to the path which the District Court might follow in dealing with petitioner's failure to comply.\n\n357 U.S. at 208, 78 S. Ct. at 1094 (emphasis added). This passage implies that foreign nondisclosure laws are not relevant to the propriety of production orders. Rather, it states that the reason for nonproduction is relevant only to the question of appropriate sanctions for noncompliance with the order. This distinction is significant. In Re Westinghouse Elec. Corp. Uranium, Etc., 563 F.2d 992, 997, 999 (10th Cir. 1977); Arthur Andersen \u0026 Co. v. Finesilver, 546 F.2d 338, 341 (10th Cir. 1976), cert. denied, 429 U.S. 1096, 97 S. Ct. 1113, 51 L. Ed. 2d 543 (1977); In Re Uranium Antitrust Litigation, supra,\n\n480 F. Supp. at 1144-48; Wright, \"Discovery,\" 35 F.R.D. 39, 81 (1963); Note, Discovery of Documents Located Abroad in U.S. Antitrust Litigation: Recent Developments in the Law Concerning the Foreign Illegality Excuse for Non-production, 14 Va.J. Int.L. 747, 753 (1974).\n\nIn Societe Internationale the Court did not refer to the act of state doctrine or to principles of international comity. The reason for that lack of reference to these principles is simple. Neither in Societe nor in this case did the trial court order a litigant to violate the nondisclosure laws of the foreign sovereign. Neither court criticized the foreign sovereign or its laws, or engaged in an examination of such laws or the motivations which gave rise to them. Both courts sought only to maintain the integrity of the judicial process and the efficacy of the laws upon which the cause of action in each case was based. In both cases, those laws reflected very significant policies of this country.\u003cspan class=\"fnref\"\u003e58\u003c/span\u003e\n\nb. Exclusive Federal Power over Foreign Relations\n\nThe principles set forth in Zschernig v. Miller, supra, are inapplicable to the Uranium Information Security Regulations for largely the same reasons that the act of state doctrine does not apply. The discovery orders in this case which sought cartel document production involved none of the problems the Supreme Court was confronted with in Zschernig. See e.g., n. 55, supra, and accompanying text.\n\nD.\n\nAPPLICABILITY OF NEW MEXICO ANTITRUST ACT\n\nThe last issue we consider concerning the propriety of the trial court's discovery orders involves the applicability of the New Mexico Antitrust Act, Sections 57-1-1 to 57-1-3, N.M.S.A. 1978.\u003cspan class=\"fnref\"\u003e59\u003c/span\u003e Although GAC filed a counterclaim alleging that United had violated the New Mexico Antitrust Act, it now contends that that Act may not be applied to the specific commerce at issue in this case (the 1973 and 1974 Supply Agreements and the I\u0026M contract) and to the activities of the international uranium cartel. GAC argues that if the Act does not apply, discovery orders pertaining to allegations of violations of the Act could not be\n\nentered, and therefore, sanctions could not be imposed for a failure to comply with such orders.\u003cspan class=\"fnref\"\u003e60\u003c/span\u003e\n\n1. The Commerce Clause\n\nGAC's first contention is that the Commerce Clause of the United States Constitution\u003cspan class=\"fnref\"\u003e61\u003c/span\u003e bars the application of state antitrust laws to activities which occur exclusively or overwhelmingly in interstate and foreign commerce. GAC argues that the supply and utility contracts in this case have no immediate relationship to the State of New Mexico, and therefore, that they involve only interstate commerce. Further, GAC argues that the cartel's operations were concerned solely with foreign commerce.\n\nIt is well-settled that the federal power to regulate commerce is not exclusive, and that states have the inherent police power to regulate commerce within their borders, even though such activities may include or affect interstate and foreign commerce. Merrill Lynch, Pierce, Fenner \u0026 Smith v. Ware, 414 U.S. 117, 140, 94 S. Ct. 383, 396, 38 L. Ed. 2d 348 (1973); Cities Service Co. v. Peerless Co., 340 U.S. 179, 186, 71 S. Ct. 215, 219, 95 L. Ed. 190 (1950); Southern Pacific Co. v. Arizona, 325 U.S. 761, 766-67, 65 S. Ct. 1515, 1518-19, 89 L. Ed. 1915 (1945); K.S.B. Tech. Sales v. North Jersey, Etc., 75 N.J. 272, 381 A.2d 774, 784 (1977). Specifically, a state may exercise its power by removing restraints on the trade and commerce of that state even though interstate commerce may thereby be affected. Giboney v. Empire Storage Co., 336 U.S. 490, 495, 69 S. Ct. 684, 687, 93 L. Ed. 834 (1949); Watson v. Buck, 313 U.S. 387, 403-04, 61 S. Ct. 962, 967, 85 L. Ed. 1416 (1941); J. Flynn, Federalism and State Antitrust Regulation 63 (1964).\n\nThe following standards for the states' power to regulate commerce were established in Pike v. Bruce Church, Inc., 397 U.S. 137, 142, 90 S. Ct. 844, 847, 25 L. Ed. 2d 174 (1970):\n\nWhere the [state] statute regulates evenhandedly to effectuate a legitimate local public interest, and its effects on interstate commerce are only incidental, it will be upheld unless the burden imposed on such commerce is clearly excessive in relation to the putative local benefits.... If a legitimate local purpose is found, then the question becomes one of degree. And the extent of the burden that will be tolerated will of course depend on the nature of the local interest involved, and on whether it could be promoted as well with a lesser impact on interstate activities.\n\nSee also Philadelphia v. New Jersey, 437 U.S. 617, 624, 98 S. Ct. 2531, 2536, 57 L. Ed. 2d 475 (1978).\n\nThus, the first inquiry is whether the state regulation effectuates \"a legitimate local public interest.\" There are two aspects to this requirement. First, the type of regulation -- here antitrust -- must be one within the state's inherent police powers. Second, the specific activity to which the state regulation is applied in a particular case must involve a matter of local concern which is \"local in character and effect.\" Southern Pacific Co. v. Arizona, supra, 325 U.S. at 767, 65 S. Ct. at 1519.\n\nIt has consistently been held that the type of regulation at issue here -- the prevention of anti-competitive, monopolistic and predatory trade practices -- is a legitimate exercise of the state's inherent police powers. See United Nuclear Corp. v. General Atomic Co., supra, 93 N.M. at 124-27, 597 P.2d at 309-12 (1979); Giboney v. Empire Storage Co., Page 195} supra; German Alliance Ins. Co. v. Hale, 219 U.S. 307, 316-17, 31 S. Ct. 246, 55 L. Ed. 229 (1911); J. Flynn, supra, at 76-77.\n\nGAC's principal argument is that the second element of \"a legitimate local public interest\" is not present in this case because the specific contracts at issue and the uranium cartel are not \"local in character and effect.\" GAC relies on four points to support its position. First, the cartel had \"no immediate relationship\" to New Mexico and never conducted meetings in this state. GAC contends that cartel operations were \"plainly in foreign commerce outside the United States.\" Second, none of the entities involved in this case are incorporated in New Mexico. Third, the 1973 Supply Agreement was not executed in and does not require the performance of any act in New Mexico. Fourth, the uranium market is national in scope.\n\nWe are not persuaded that the matters at issue in this case occurred exclusively in interstate and foreign commerce and had no significant local aspects. It has been recognized that state antitrust laws may reach up to include the regulation of interstate commerce. See R.E. Spriggs Co. v. Adolph Coors Company, 37 Cal. App.3d 653, 112 Cal. Rptr. 585, 589; J. Flynn, supra, at 71, and cases cited therein at n. 251; Wechsler, supra, 9 N.M.L. Rev. at 3. As the Massachusetts Supreme Judicial Court stated:\n\nIf State laws have no force as soon as interstate commerce begins to be effected, a very large area will be fenced off in which the States will be practically helpless to protect their citizens without, so far as we can perceive, any corresponding contribution to the national welfare. (Citation omitted.)\n\nCommonwealth v. McHugh, 326 Mass. 249, 93 N.E.2d 751, 762 (1950) (citation omitted).\u003cspan class=\"fnref\"\u003e62\u003c/span\u003e\n\nWe cannot agree that the outer limit of the exercise of that power -- activity of a wholly interstate nature -- has been exceeded in this case. The contracts at issue may be regarded as having no immediate relationship to New Mexico only by relying upon the formalities - the domicile of the parties to the contracts, the place of performance, and the place the contracts were entered into -- and ignoring the practical realities.\n\nUnited alleges that the 1973 and 1974 Supply Agreements were part of a conspiracy to monopolize uranium reserves in the United States and to eliminate it as a competitor in the uranium market. As of 1975, over one-half of the uranium reserves of the United States were located in New Mexico. In all but one year from 1966 to 1976, in excess of forty percent of the annual production of uranium in the United States came from New Mexico mines. As of 1976, over fifty percent of the uranium mining work force in this country and nearly forty percent of the uranium milling work force were located in New Mexico. Nearly half of the capacity of American uranium production mills is in this State. Gulf's New Mexico Mt. Taylor uranium reserves constitute the largest uranium ore body in the United States. United's mine at Churchrock, New Mexico, which GAC is alleged to have attempted to\n\ngain control of as part of the monopolistic conspiracy, is the largest underground uranium mine in the United States. Therefore, it would be impossible to monopolize the American uranium market without having an immediate relationship to, and a substantial effect on, the trade and commerce of this State.\n\nAlthough the contracts at issue do not formally require any activity to take place here, almost all of United's uranium production is from New Mexico mines. New Mexico is also the site of its only uranium mill, which is the place of delivery under the terms of the 1974 Supply Agreement. In its brief on appeal, GAC conceded that New Mexico is \"the state in which [United's] operation is located.\" The uranium sales efforts of GAC and its predecessors were based on Gulf production in New Mexico, foreign uranium imports, and purchases on the open market. Those purchases also included substantial amounts of New Mexico uranium. See Section II B, supra.\n\nIt is simply not the case that this litigation involves exclusively interstate commerce and that this State has no interest in its adjudication. United Nuclear Corp. v. General Atomic Co., supra, 90 N.M. at 101-02, 560 P.2d at 165-66. Therefore, we hold that the State of New Mexico has \"a legitimate local public interest\" in the application of its antitrust laws to this case.\n\nThe remaining inquiries are whether the state law as applied here (1) \"regulates evenhandedly\" and (2) has only \"incidental\" effects on interstate commerce. There is clearly nothing in the New Mexico Antitrust Act or in its application to this case which entails any discrimination against interstate goods or which favors local commerce over the commerce of sister states. Compare Exxon Corp. v. Governor of Maryland, 437 U.S. 117, 125-26, 98 S. Ct. 2207, 2213-14, 57 L. Ed. 2d 91 (1978) with Dean Milk Co. v. Madison, 340 U.S. 349, 71 S. Ct. 295, 95 L. Ed. 329 (1951). GAC makes no contention to the contrary.\u003cspan class=\"fnref\"\u003e63\u003c/span\u003e Further, GAC has made no showing whatsoever that the application of state antitrust laws to this case will have any adverse effects on \"the free flow of commerce across state lines.\" Southern Pacific Co. v. Arizona, supra, 325 U.S. at 770, 65 S. Ct. at 1521. The very purpose of these laws is to remove privately created restraints on free trade.\n\nConsequently, it would be difficult to prove that a policy which removes privately instituted interferences, delays, interruptions, and inconveniences with interstate commerce, is itself a delay, interference, interruption, and inconvenience to interstate commerce when enforced at the local level by the states.\n\nJ. Flynn, supra, at 84.\n\nGAC nevertheless contends that because the uranium market is \"national in scope,\" and because uranium is \"vital to the military posture of the United States\" and to federal energy policy, \"legal and policy questions involving uranium in the uranium industry must be addressed uniformly by the federal government.\" GAC argues that application of state antitrust laws to such matters \"is too fraught with a potential for inconsistent results, lack of uniformity, and consequent burdens upon interstate commerce.\"\n\nGAC places principal reliance on Flood v. Kuhn, 407 U.S. 258, 92 S. Ct. 2099, 32 L. Ed. 2d 728 (1972), aff'g, 443 F.2d 264 (2d Cir. 1971), aff'g, 316 F. Supp. 271 (S.D.N.Y. 1970), in which the Supreme Court upheld lower court rulings that the reserve clause\n\nin professional baseball contracts was not subject to challenge under state antitrust laws. Previous decisions of the Supreme Court had held that professional baseball was not subject to federal antitrust laws. Toolson v. New York Yankees, 346 U.S. 356, 74 S. Ct. 78, 98 L. Ed. 64 (1953); Federal Club v. National League, 259 U.S. 200, 42 S. Ct. 465, 66 L. Ed 898 (1922). In Flood the lower courts had held that \"the nationwide character of organized baseball combined with the necessary interdependence of the teams requires that there be uniformity in any regulation of baseball and its reserve system.\" 316 F. Supp. at 279-80. See 443 F.2d at 267-68.\n\nIn affirming the lower courts' decisions, the Supreme Court did not adopt any broad or rigid limitations on the applicability of state antitrust laws to transactions involving interstate commerce. The Court upheld those holdings \"[a]s applied to organized baseball, and in the light of this Court's observations and holdings in Federal Baseball, [and] in Toolson....\" 407 U.S. at 284, 92 S. Ct. at 2113.\n\nWe believe that Flood is readily distinguishable from this case. First, the time honored, though unusual, exemption from federal antitrust laws which professional baseball enjoys would be meaningless if state antitrust laws were not also inapplicable. Thus, in Flood there was a clear conflict between federal and state antitrust enforcement policies.\n\nSecond, professional baseball is significantly different from the uranium market. Baseball involves \"[a] complex web of franchises, farm teams and recruiters....\" 443 F.2d at 267. Baseball clubs are organized into leagues and\n\nare dependent on the league playing schedule.... Therefore, it is the league structure at which any state antitrust regulation must be aimed.... [E]ach league extends over many states, and..., if state regulation were permissible, the internal structure of the leagues would require compliance with the strictest state antitrust standard.\n\nId. at 267-68.\n\nNo single state has a particularly significant interest in the operation of nationwide professional sports. However, this State has a very substantial relationship to uranium production, and therefore, a significant interest in preventing anti-competitive practices in the uranium industry. Moreover, in energy-related matters, unlike professional baseball, there is uniformity of treatment of anti-competitive practices under both federal and state law. Challenging such activities is federal policy. Challenging the uranium cartel and Gulf's role therein was the federal practice.\u003cspan class=\"fnref\"\u003e64\u003c/span\u003e\n\nThe fact that the uranium market is nationwide in scope does not require a different result. In Flood, state antitrust regulations would have directly affected the entire \"complex web\" of professional baseball, and would have been aimed at league structure. In this case, the state law has been applied solely to private contracts for the sale of specific goods. In Flood the reserve clause being challenged was a recognized practice in the sport. Here, the alleged conspiracy was a secret attempt to dominate an industry, a practice condemned by the Congress, the Justice Department, and the courts. If the fact that the commerce at issue involved a national market were enough to render state law invalid, the states' power to regulate anti-competitive practices would be effectively destroyed.\n\nIn Exxon Corp. v. Governor of Maryland, supra, the United States Supreme Court rejected a similar argument advanced by Gulf and other oil companies regarding the\n\nnational scope of the petroleum industry and a state statute that regulated aspects of that industry in Maryland. The Court said:\n\n[W]e cannot adopt appellants' novel suggestion that because the economic market for petroleum products is nationwide, no State has the power to regulate the retail marketing of gas. Appellants point out that... the cumulative effect of this sort of legislation may have serious implications for their national marketing operations. While this concern is a significant one, we do not find that the Commerce Clause, by its own force, pre-empts the field of retail gas marketing.... [T]his Court has only rarely held that the Commerce Clause itself pre-empts an entire field from state regulation, and then only when a lack of national uniformity would impede the flow of interstate goods.... In the absence of a relevant congressional declaration of policy, or a showing of a specific discrimination against, or burdening of, interstate commerce, we cannot conclude that the States are without power to regulate in this area.\n\n437 U.S. at 128-29, 98 S. Ct. at 2215. (citations and footnote omitted).\n\nNo showing has been made that application of New Mexico law entails \"a specific discrimination against, or burdening of, interstate commerce.\" No embargo has been placed on interstate shipments of uranium. Compare Penna. v. West Virginia, 262 U.S. 553, 43 S. Ct. 658, 67 L. Ed. 1117 (1923) and West v. Kansas Natural Gas. Co., 221 U.S. 229, 31 S. Ct. 564, 55 L. Ed. 716 (1911). Unlike other situations in which state regulations have been invalidated under the Commerce Clause,\u003cspan class=\"fnref\"\u003e65\u003c/span\u003e there is little likelihood that in the area of state antitrust laws an excessive cost of compliance will be imposed by piecemeal state regulation. The cost of compliance is nothing more than refraining from the kind of anti-competitive, predatory trade practices which federal law and the laws of virtually all states condemn. The pervasiveness of antitrust regulation in the economy demonstrates a uniformity between state and federal laws which was not present in Exxon Corp. v. Governor of Maryland, supra. Therefore, the New Mexico Antitrust Act was applied consistently with the Commerce Clause of the federal constitution.\n\n2. Preemption by Sherman Antitrust Act\n\nGAC's second claim is that the New Mexico Antitrust Act is preempted by the Sherman Antitrust Act in the context of this case.\n\nCongress has the unquestioned power to pre-empt state regulations in the field of interstate and foreign commerce.\u003cspan class=\"fnref\"\u003e66\u003c/span\u003e Preemption may be ascertained from the express language of the federal statute,\u003cspan class=\"fnref\"\u003e67\u003c/span\u003e by reference to the statute's legislative history,\u003cspan class=\"fnref\"\u003e68\u003c/span\u003e or from a clear inconsistency, repugnancy, or serious danger of conflict between the state and federal regulations.\u003cspan class=\"fnref\"\u003e69\u003c/span\u003e However, none of these sources evidence a Congressional intent to preempt state antitrust laws in the circumstances present in this case.\n\nWe begin with the well-established principle that \"in a field which the States have traditionally occupied,\" \"the historic police\n\npowers of the States [are] not to be superseded by the Federal Act unless that was the clear and manifest purpose of Congress. (Citations omitted.)\" Rice v. Santa Fe Elevator Corp., 331 U.S. 218, 230, 67 S. Ct. 1146, 1152, 91 L. Ed. 1447 (1947). See also Florida Avocado Growers v. Paul, supra, 373 U.S. at 146, 83 S. Ct. 1219.\n\nNothing in the language of the Sherman Act expresses any intent to preempt state antitrust laws, many of which were enacted prior to the Sherman Act. See United Nuclear Corp. v. General Atomic Co., supra, 93 N.M. at 125, 597 P.2d at 310; J. Flynn, supra at 90-91. The legislative history of the Sherman Act indicates that, rather than intending to supersede state antitrust laws, Congress was seeking to supplement the enforcement of those laws. See remarks of Senator Sherman quoted in United Nuclear Corp. v. General Atomic Co., supra, 93 N.M. at 125, 597 P.2d at 310. See also H.R. Rep. No. 1707, 51st Cong., 1st Sess. 1 (1890). This legislative history has been interpreted as evidence of a lack of an intent to preempt state antitrust laws. United Nuclear Corp. v. General Atomic Co., supra, 93 N.M. at 125, 597 P.2d at 310; R. E. Spriggs Co. v. Adolph Coors Co., supra, 112 Cal. Rptr. at 589.\n\nPreemption may also be inferred where the scheme of federal regulation is so pervasive as to make reasonable the inference that Congress left no room for the states to regulate,\u003cspan class=\"fnref\"\u003e70\u003c/span\u003e or where the state act touches a field in which the federal interest is so dominate that state regulation might interfere with the federal purposes,\u003cspan class=\"fnref\"\u003e71\u003c/span\u003e or where there is a \"direct and positive\" conflict or repugnancy between the state and federal laws.\u003cspan class=\"fnref\"\u003e72\u003c/span\u003e\n\nGAC points to no \"direct and positive\" conflict between state and federal antitrust laws in general, or as the state law has been applied in this case. However, it suggests that if state antitrust laws are applied to interstate commerce of the nature involved in this case, \"intolerable burdens\" would be imposed on that commerce because of \"differing limitations upon competition in each jurisdiction where goods might be produced, transported or sold.\"\n\nIn Exxon v. Governor of Maryland, supra, the Supreme Court rejected a similar argument, stating that the existence of such potential conflicts is \"'entirely too speculative'... to warrant preemption.\" 437 U.S. at 131, 98 S. Ct. at 2216. The Court went on to say that it is not only \"generally reluctant to infer pre-emption,\" but also, that it would be \"particularly inappropriate to do so\" where \"the basic purposes\" of the state and federal statutes are similar. Id. at 132, 98 S. Ct. at 2217.\n\nThe basic purposes of the state and federal antitrust laws in question here are not merely similar; they are identical -- \"to establish a 'public policy of first magnitude;' that is, promoting the national interest in a competitive economy.\" United Nuclear Corp. v. General Atomic Co., supra, 93 N.M. at 125, 597 P.2d at 310 (citation omitted). See also J. Flynn, supra, at 138. The state act in question uses substantially the same language as the Sherman Act. J. Flynn, supra, at 138. The state act has been applied consistently with federal actions regarding the cartel and Gulf's role therein. see n. 50, supra, and accompanying text. There is thus no \"clash of competing fundamental policies.\" United Nuclear Corp. v. General Atomic Co., supra, 93 N.M. at 125, 597 P.2d at 310.\n\nGAC suggests that even in the absence of \"direct and positive\" conflicts between state and federal antitrust laws, the dominate federal interest in foreign commerce precludes application of state antitrust laws to\n\ncartel activities. However, we are not interested in this case in regulating foreign commerce; we are concerned with practices that allegedly were aimed at restraining trade in this State. Without full cartel disclosure, we cannot determine to what commerce the cartel's activities extended. We will not cast aside laws designed to protect the trade of this State without the necessary factual predicate upon which to base a finding that they have been preempted by federal law, particularly where the bad faith conduct of the party charged with violations of those laws has been found to be largely responsible for the missing factual material. See Section III, infra.\n\nGAC also argues that the dominate federal interest in energy matters warrants a finding that state antitrust laws are preempted insofar as they may be applied to anti-competitive practices in the field of energy. However, the concept of preemption based on federal dominance of a subject matter rests on the likelihood that state regulations in the area will interfere with the federal purposes. See City of Burbank v. Lockheed Air Terminal, supra; Head v. New Mexico Board, 374 U.S. 424, 429-30, 83 S. Ct. 1759, 1762-63, 10 L. Ed. 2d 983 (1963). The promotion of anti-competitive trade practices in uranium marketing is not part of any federal energy program. See n. 50, supra, and accompanying text, and n. 64, supra. Thus, the prevention of such practices by the states poses no significant possibility of conflict with federal policy.\n\nTherefore, we find no basis upon which to hold that the New Mexico antitrust laws, as applied to the contracts for the sale of uranium at issue in this case, have been preempted by the federal antitrust laws.\n\n3. Scope of the New Mexico Antitrust Act\n\nGAC's third argument as to the inapplicability of the New Mexico Antitrust Act is that the Act only applies to contracts which are illegal on their face. GAC contends that ordinary purchase and sale contracts -- such as the Supply Agreements at issue here -- which are fair and enforceable on their face, are valid even if they are related in some peripheral way to an antitrust violation.\n\nGAC relies on State v. Electric City Supply Company, 74 N.M. 295, 393 P.2d 325 (1964) and Kelly v. Kosuga, 358 U.S. 516, 79 S. Ct. 429, 3 L. Ed. 2d 475 (1959). We find both cases distinguishable from this case. First, unlike the Sherman Antitrust Act at issue in Kelly v. Kosuga, the New Mexico Act does contain an explicit provision voiding contracts which have as their object or operate to restrict or monopolize any part of the trade or commerce of New Mexico. Section 57-1-3, N.M.S.A. 1978 (current version at ยง 57-1-3, N.M.S.A. 1978 (1979 Supp.)) states:\n\nAll contracts and agreements in violation of the foregoing two sections [57-1-1-, 57-1-2 NMSA 1978] shall be void, and the person or persons, corporation or corporations, association or associations who shall violate the provisions of either of said sections shall be civilly liable to the party injured for any and all damage occasioned by such violation, and any purchaser of any commodity from any individual, corporation or association transacting business in violation of such section shall not be liable for the payment for such commodity.\n\nBy recognizing the defense of contract illegality in this case, we are, rather than creating a new remedy, merely giving effect to the express provisions of the antitrust laws of this State.\u003cspan class=\"fnref\"\u003e73\u003c/span\u003e\n\nSecond, in both Kelly v. Kosuga and Electric City Supply Company, the contracts sued upon had been fully performed, and the courts refused to permit one party to avoid its obligation to pay for the goods it received.\u003cspan class=\"fnref\"\u003e74\u003c/span\u003e Thus, in those cases the courts\n\nfurthered the general policy, as Justice Holmes put it, \"of preventing people from getting other people's property for nothing when they purport to be buying it.\" Continental Wall Paper Co. v. Lewis Voight \u0026 Sons Co., 212 U.S. 227, 271, 29 S. Ct. 280, 296, 53 L. Ed. 486 (1909) (dissenting). See Kelly v. Kosuga, 358 U.S. at 520-21, 79 S. Ct. at 431-32. This policy controlled the Kelly case. See Viacom Intern. Inc. v. Tandeum Productions, Inc., 526 F.2d 593, 599 (2d Cir. 1975); Comment, The Defense of Antitrust Illegality in Contract Actions, 27 U. Chi.L. Rev. 758, 769 (1960).\n\nNo such policy is involved here, for United is not seeking to avoid its obligation to deliver the uranium and yet at the same time recover the contract price for it. In the case of executory contracts, such as those at issue here, the policy of avoiding the unjust enrichment which would result from recognition of an antitrust defense simply is not relevant. See 27 U. Chi.L. Rev. at 769-71; Lockhart, Violation of the Antitrust Laws as a Defense in Civil Actions, 31 Minn.L. Rev. 507, 573 (1947). Compare Atlantic Richfield Co. v. Malco Petroleum, Inc., 471 F.2d 1258, 1260-61 (6th Cir.) with Associated Press v. Taft-Ingalls Corporation, 340 F.2d 753, 769 (6th Cir.) cert. denied, 382 U.S. 820, 86 S. Ct. 47, 15 L. Ed. 2d 66 (1965).\n\nThird, the Supply Agreements at issue here are alleged to be one of the means by which GAC and Gulf sought to monopolize the uranium market of the United States. If proven, United's allegations would establish that the Supply Agreements, rather than being collateral to or independent of the alleged monopolistic conspiracy, were essential parts of a general plan or scheme which the law condemns. Compare Connolly v. Union Sewer Pipe Co., 184 U.S. 540, 546-49, 22 S. Ct. 431, 434-35, 46 L. Ed. 679 (1902) with Continental Wall Paper Co. v. Louis Voight \u0026 Sons Co., supra, 212 U.S. at 258-62, 29 S. Ct. at 290-292. Under such circumstances, the refusal to recognize an antitrust defense would place the court in the position of \"enforcing the precise conduct made unlawful by the [antitrust laws].\" Kelly v. Kosuga, 358 U.S. at 520, 79 S. Ct. at 432. It would be contrary to the public policy of this State to enforce a sale which was in execution or aid of an illegal price-fixing, anti-competitive, monopolistic conspiracy where recovery would aid the alleged law violator to accomplish the very purpose of his illegal agreement.\n\nFinally, we do not read the words in Electric City Supply Company that the contract sued on must \"itself [be] tainted with illegality\" to mean that the contract must overtly call for some illegal act on its face before the antitrust laws can provide a defense. To the extent that that decision can be so construed, it is inconsistent with the language of Section 57-1-3. See generally Bruce's Juices v. Amer. Can. Co., 330 U.S. 743, 763-64, 67 S. Ct. 1015, 1024-25, 91 L. Ed. 1219 (1947) (Murphy, J., dissenting); 31 Minn.L. Rev. at 547, n.211.\u003cspan class=\"fnref\"\u003e75\u003c/span\u003e\n\nBased on the foregoing reasons, we find that the contracts at issue and United's antitrust allegations are within the scope of the New Mexico Antitrust Act.\n\n\u003cspan class=\"fn\"\u003e1. . This case has been the subject of a number of previous decisions of this Court: United Nuclear Corp. v. General Atomic Co., 93 N.M. 105, 597 P.2d 290 (1979) (upholding trial court's refusal to stay its proceedings pending arbitration), cert. denied, 444 U.S. 911, 100 S. Ct. 222, 62 L. Ed. 2d 145 (1979); United Nuclear Corp. v. General Atomic Co., 91 N.M. 41, 570 P.2d 305 (1977) (upholding personal jurisdiction of trial courts) rev'd General Atomic Co. v. Felter, 90 N.M. 120, 560 P.2d 541 (1977) (upholding injunction prohibiting the parties from instituting related actions in other courts), rev'd, General Atomic Co. v. Felter, 434 U.S. 12, 98 S. Ct. 76, 54 L. Ed. 2d 199 (1977); and United Nuclear Corp. v. General Atomic Co., 90 N.M. 97, 560 P.2d 161 (1976) (upholding personal jurisdiction of trial court over GAC). In addition, this Court refused to consider the issue of the disqualification of United's counsel as either an appeal from a final judgment or as a petition for an extraordinary writ (No. 11,469, June 29, 1977, and No. 11,484, July 1, 1977, respectively). In addition to the two decisions mentioned above which were taken to the United States Supreme Court, that Court has had this case before it on at least three other occasions. On May 30, 1978, the Supreme Court held that the trial court could not enjoin GAC from proceeding with its right to arbitration against United. General Atomic Co. v. Felter, 436 U.S. 493, 98 S. Ct. 1939, 56 L. Ed. 2d 480 (1978). GAC applied for a stay of all proceedings in the trial court on the basis that the threat of sanctions under Rule 37 violated the act of state doctrine. This application was denied. General Atomic Co. v. Felter, 435 U.S. 920, 98 S. Ct. 1481, 55 L. Ed. 2d 514 (1978). After sanctions were imposed, GAC sought immediate review by the Supreme Court of the sanctions order and default judgment. This petition was also denied. General Atomic Co. v. Felter, 436 U.S. 904, 98 S. Ct. 2233, 56 L. Ed. 2d 402 (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. . This action was originally filed on August 8, 1975 in Santa Fe District Court. Both GAC and its constituent partners, Gulf and Scallop, were named as defendants in that case. The case was removed to federal district court by Gulf. On December 31, 1975, United voluntarily dismissed the case in federal court, and refiled it on the same day in Santa Fe State District Court, naming only the partnership as a defendant. It is this later case that is the subject of this appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. . Detroit Edison Company, another electric utility company, was also impleaded by GAC, but was dismissed as a party in March 1978 after it reached a settlement with GAC.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. . In 1979, most of the specific New Mexico Rules of Civil Procedure with which we are concerned were amended (e.g., Rules 26, 33, 34, 37). Because this case was decided in the court below prior to the adoption of these amendments, all citations in this opinion are to the former rules.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. . One issue in this case is whether United's so-called letters of intent with the utilities were actually non-binding letters of intent, or rather, binding contracts. We will refer to them here as letters of intent, and discuss the legal nature of them in Section II B, infra, of this opinion. However, collectively, the formal contracts and the letters of intent will be referred to as the utility contracts.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. . Can. Stat. O. \u0026 R. 76-644 (1976). The Regulations were promulgated pursuant to the Canadian Atomic Energy Control Act, 1970, Can. Rev. Stat. c. A-19. Pertinent portions of the original Regulations are set forth in n. 41, infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. . \"If sanctions are imposed under Rule 37(b),... on appeal from the order imposing sanctions the appellate court will consider the propriety of the prior order for discovery.\" C. Wright and A. Miller, Federal Practice and Procedure: Civil ยง 2289, at 791 (1970) (footnote omitted). See also Familias Unidas v. Briscoe, 544 F.2d 182, 191 (5th Cir. 1976); Gordon v. Federal Deposit Insurance Corporation, 138 U.S. App. D.C. 308, 427 F.2d 578, 581 (D.C. Cir. 1970); Hanley v. James McHugh Construction Company, 419 F.2d 955, 957 (7th Cir. 1969).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. . As we discuss in Section III, infra, the failure to raise a timely objection to an interrogatory operates as a waiver of any objection a party might have. However, we address GAC's objection to the production of partner documents notwithstanding its failure to raise a timely objection both because the trial court did not rely on the principle of waiver and because it is a question that has apparently never before been specifically decided by any court in the United States. Our decision to decide the question on its merits in no way detracts from the significance to the issues discussed in Section III, infra, of GAC's failure to comply with the express provisions of Rule 33.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. . The distinction between partnership and non-partnership documents confuses the relevancy of the information under Rule 26(b) with its availability under Rules 33 and 34. It is one thing to say that non-partnership-related documents are not relevant, but quite another to say that they are incapable of being obtained. The trial court repeatedly made this crucial distinction. If the partnership business was conducted as part of a coordinated Gulf effort to monopolize the uranium market, as United contends it was, then various Gulf documents pertaining to production and marketing of uranium might be relevant, even though they did not directly pertain to what was ostensibly the partnership business. To permit the parties to determine what is related to the partnership business is to allow that party to make its own unilateral determination of the scope of discovery, which, of course, it may not do. See United States v. Board of Trade of the City of Chicago, Inc., 18 F.R. Serv. 2d 318, 319 (N.D. Ill. 1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. . For cases construing the term \"control\" to be synonymous with the term \"available,\" see Sol S. Turnoff Drug Dist. v. N.V. Nederlandsche C.V.C. Ind., 55 F.R.D. 347, 349 (E.D. Pa. 1972); Erone Corporation v. Skouras Theatres Corporation, 22 F.R.D. 494, 498 (S.D.N.Y. 1958).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. . See Herbst v. Able, 63 F.R.D. 135, 138 (S.D.N.Y. 1972).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. . See e.g., In Re Folding Carton Antitrust Litigation, supra, 76 F.R.D. at 423; Buckley v. Vidal, 50 F.R.D. 271, 274 (S.D.N.Y. 1970); Smith v. Maryland Casualty Company, 42 F.R.D. 587, 589 (E.D. La. 1967); Schwartz v. Travelers Insurance Company, 17 F.R.D. 330 (S.D.N.Y. 1954); Tollefsen v. Phillips, 16 F.R.D. 348 (D. Mass. 1954); Reeves v. Pennsylvania R. Co., 80 F. Supp. 107, 108-09 (D. Del. 1948); Williams v. Consolidated Investors, Inc., 205 Kan. 728, 472 P.2d 248, 252 (1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. . See e.g., Pennwalt Corp. v. Plough, Inc., 85 F.R.D. 257, 263 (D. Del. 1979); Advance Labor Serv., Inc. v. Hartford Accident \u0026 Ind. Co., supra, 60 F.R.D. at 633-34; Sol S. Turnoff Drug Dist. v. N.V. Nederlandsche C.V.C. Ind., supra, 55 F.R.D. at 349; Erone Corporation v. Skouras Theatres Corporation, supra, 22 F.R.D. at 498 (S.D.N.Y. 1958).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. . Indeed, in its Reply Brief in this appeal, GAC conceded that Gulf's records were \"available\" to it. GAC stated: GAC did not contend in the trial court that it would be unable to persuade Gulf to produce its domestic records if they came within a judicial order to produce. Obviously, Gulf had -- and continues to have -- a very significant interest in this litigation. As one of GAC's constituent partners, it stands to gain or lose immediately from any decision.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. . The record is replete with evidence of the interconnection of the various aspects of Gulf's uranium business. In addition to other examples discussed elsewhere in this opinion with respect to other issues raised on appeal, are the following examples, which should suffice to illustrate the point made here: When the cartel was formed, Gulf Canada informed Gulf's executives in Pittsburgh and Gulf Energy officials in San Diego. Over the next six months, officials from Gulf Oil in Pittsburgh (O'Hara, Jackson, Ramsey), Gulf Minerals in Denver (Zagnoli, Allen) and Gulf Energy in San Diego (Hunter, Hoffman) were sent to Canada, Europe and Africa for cartel meetings. Gregg of Gulf Energy was transferred to Gulf Canada, but remained in contact with officials of Gulf Energy (Hunter, Fowler) for at least several months. Officials in Gulf Oil, Gulf Minerals and Gulf Energy participated in the decision to transfer Gregg. In March 1972, Hoffman of Gulf Energy briefed the Gulf Minerals board on Gulf Energy's marketing activities. In August 1972, Hunter briefed Gulf Oil executives in New York City. Rolander of Gulf General Atomic, Gulf Energy, and later GAC, also sat on the boards of Gulf Canada and Gulf Minerals and was chairman of the board of Gulf-United. Gulf Minerals had administrative responsibility for Gulf Canada, and Gulf Minerals' uranium marketing function was handled by Gulf General Atomic. Gulf Energy's larger supply contracts were approved by Gulf's Pittsburgh executives. Gulf Energy and Gulf Minerals worked together on plans for the development of Gulf's Mt. Taylor uranium reserves. In March 1973, Hunter stated that Gulf Energy would \"work with GMCL [Gulf Canada]... to block\" a Westinghouse effort to secure uranium from Australia.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. . The president of Gulf Energy, Mr. Rolander, became the president of GAC pursuant to the terms of the partnership agreement. Mr. Gallaway, the executive vice-president of Gulf Energy, Mr. Johnston, Gulf General Atomic's vice-president for marketing, and Mr. Dieter, Gulf Energy's chief legal adviser, all continued to perform the same duties for GAC. Mr. Hunter, who had attended the cartel's May 1972 meeting in Johannesburg as an executive of Gulf Energy, worked in a similar capacity for GAC, as did Mr. Fowler. As executives of GAC, Gallaway and Dieter remained on the payroll of Gulf, not GAC. Most of these individuals played some role in the formation and operation of Gulf-United and in the acquisition of uranium by Gulf Energy and GAC. (Rolander, Gallaway and Hunter negotiated the formation of Gulf-United and the execution of the 1971 Supply Agreement with United. All three were members of the Gulf-United board.) All of these individuals at one time or another were either involved in or aware of Gulf's participation in the cartel. Four months after the formation of GAC, Rolander rejoined the Gulf organization in Pittsburgh, where he remained until after this case was filed. Mr. Gregg, the Gulf Energy employee who was transferred to Gulf Canada in Toronto and became a member of the cartel operating committee, returned to the United States in 1974 to work for GAC, where he remained until the month this case was filed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. . One of the more extreme examples of the extent to which GAC has sought to differentiate into distinct compartments the interrelated activities of the various aspects of Gulf's uranium activities is the following: When Hunter and Hoffman flew from Gulf Energy's San Diego headquarters to the cartel meeting in Johannesburg in May 1972, they went, according to GAC, as representatives of Gulf Canada in Canada, and not Gulf Energy, despite the fact that immediately prior to and after their week-long trip they were top officials with Gulf Energy, and despite the fact that they apparently continued to receive cartel information in their San Diego offices for several more months in order to coordinate Gulf's foreign and domestic uranium marketing efforts. The absurdity of GAC's position is highlighted by Hoffman's deposition in the Westinghouse litigation, where he testified that we went to Johannesburg \"as an advisor to -- I don't recall the name of the Canadian company. What was it? GMCL? Was that their initials?\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. . The fact that Gulf and Scallop were named as parties in the original suit, which United voluntarily dismissed after its removal to federal court (see n. 2, supra), is completely immaterial to the question of the proper scope of Rules 33 and 34. The scope of discovery under those rules does not expand or contract depending on whether or not the individual partners once were or now could be named as parties.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. . Although Rule 26(b) refers only to depositions, the scope of discovery permitted under Rules 33 (interrogatories) and 34 (production of documents) is defined in terms of the relevancy standard established in Rule 26(b). See Davis v. Westland Development Company, supra, 81 N.M. at 299-300, 466 P.2d at 865-66.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. . See also Mallinckrodt Chemical Works v. Goldman, Sachs \u0026 Co., 58 F.R.D. 348, 353 (S.D.N.Y. 1973); C. Wright \u0026 A. Miller, Federal Practice and Procedure: Civil ยง 2008, 45 (1970); J. Moore, Federal Practice, para. 26.56[1], at 26-131 (2d ed. 1979).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. . Payer Hewitt \u0026 Company v. Bellanca Corporation, 26 F.R.D. 219, 221 (D. Del. 1960).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. . Triangle Mfg. Co. v. Paramount Bag Mfg. Co., 35 F.R.D. 540, 542 (E.D. N.Y. 1964); Bloomer v. Sirian Lamp Co., 4 F.R.D. 167, 169 (D. Del. 1944).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. . In Re Wheat Farmers Antitrust Class Action, 440 F. Supp. 1022, 1025 (D.D.C. 1977); In Re Folding Carton Antitrust Litigation, supra, 76 F.R.D. at 431 (N.D. Ill. 1977); Detweiler Bros., Inc. v. John Graham \u0026 Co., 412 F. Supp. 416, 422 (E.D. Wash. 1976); Nichols v. Philadelphia Tribune Company, 22 F.R.D. 89, 90 (E.D.Pa. 1958); C. Wright, Law of Federal Courts ยง 81, at 403, n. 47 (3d ed. 1976).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. . E.I. Du Pont de Nemours v. Deering Milliken Res., 72 F.R.D. 440, 443 (D. Del. 1976); Marshall v. Electric Hose and Rubber Company, 68 F.R.D. 287, 295 (D. Del. 1975); La Chemise Lacoste v. Alligator Company, Inc., supra, 60 F.R.D. at 171; Dart Industries, Inc. v. Liquid Nitrogen Proc. Corp. of Cal., 50 F.R.D. 286, 292 (D. Del. 1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. . Bailey v. Meister Brau, Inc., 55 F.R.D. 211, 214 (N.D. Ill. 1972); Independent Productions Corp. v. Loew's, Incorporated, supra, 22 F.R.D. at 271; Steamship Co. of 1949 v. China Union Lines, Hong Kong, 123 F. Supp. 802, 805 (S.D.N.Y. 1954); Bloomer v. Sirian Lamp Co., supra, 4 F.R.D. at 169.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. . Cf. United States v. International Business Machines, Corp., 66 F.R.D. 186, 189 (S.D.N.Y. 1974) (\"discovery in antitrust litigation is most broadly permitted\"). See also Bass v. Gulf Oil Corporation, 304 F. Supp. 1041, 1046-47 (S.D. Miss. 1969); Alexander's Department Stores, Inc. v. E.J. Korvette, Inc., 198 F. Supp. 28, 29 (S.D.N.Y. 1961); Leonia Amusement Corporation v. Loew's, Incorporated, 16 F.R.D. 583, 584 (S.D.N.Y. 1954).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. . Both Westinghouse and General Electric were major manufacturers in the United States of nuclear reactors; as such they were competitors of Gulf Energy.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. . In his deposition in this case, Gregg first testified that United and Gulf-United were never discussed at any cartel meetings. He later qualified that answer by stating that he could not recall those companies being discussed at meetings at which he was present. When specifically questioned regarding the foregoing passage from his Westinghouse deposition, Gregg conceded that he had made the statement, but he said he could not recall \"who or who was not discussed other than Westinghouse.\" He stated that Gulf-United and General Electric were \"representative of who might have been discussed\"; but he could not remember whether or not Gulf-United was ever discussed. Hunter testified in his deposition in this case that Gulf-United was discussed by Gulf officials at the cartel meeting he attended in Johannesburg in 1972. He stated: I raised the point that from my standpoint and understanding in what we were trying to do in the uranium supply, the [cartel's] middleman restriction would affect our ability to buy uranium to serve Gulf-United and HTGR [high temperature gas cooled reactors]. He went on to say that by virtue of the cartel's rules, Gulf-United \"would have to pay the same higher price that... Westinghouse would have to pay.\" But he said that this matter \"wasn't of concern\" to the other Gulf participants.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. . GAC asserts that United's commercial impracticability claim is a \"patent make-weight\" because United's forty page trial brief on the subject contained only six sentences concerning the cartel. Relevancy for purposes of discovery is not measured by such a sentence-to-page ratio. As to I\u0026M's defense to GAC's claim of commercial impracticability, GAC's counsel told the trial court at a hearing on August 26, 1977: We can understand the people like Indiana-Michigan or Detroit-Edison feeling some sort of misery caused by the present prices of uranium, and we suspect that they will be completely unable to establish anything to do with the cartel leading to the existence of the price levels.... Obviously, the cartel is not made irrelevant to I\u0026M's claims simply because GAC's counsel \"suspects\" that those claims would ultimately not be proved. Cf. American Mfrs. M.I. Co. v. American Broadcasting - Para. Th., 388 F.2d 272, 279, n. 9 (2nd Cir. 1967) (\"'[T]hat it might be surmised that the adverse party is unlikely to prevail at the trial is not sufficient to authorize summary judgment against him'\") (citation omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. . The Detroit Edison letter of intent, which is dated September 25, 1969, reads in part: Please be advised that The Detroit Edison Company has determined and intends to enter into a contract with the United Nuclear Corporation for the nuclear materials, fabrication, and services therein defined. United Nuclear Corporation and Detroit Edison will proceed reasonably toward the negotiation, drafting, and execution of a formal written contract which will reflect the pertinent rights and obligations of each party as generally set forth in the referenced documents and as discussed and to be discussed during the various meetings of representatives of our two companies. It is also subject to the receipt of all necessary approvals of regulatory authorities. (Emphasis added.) Formal definitive contracts were signed on the basis of this letter of intent and a letter of intent of December 30, 1970 with Duke Power, on March 19, 1973 by Gulf-United, and on November 7, 1973 by Gulf, respectively. United signed two additional letters of intent with Yankee Atomic and Consolidated Edison. The latter two letters were also assigned to Gulf-United in 1971, but formal contracts were never signed, and the uranium covered by these letters is not included in the 1973 Supply Agreement.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. . Notes of a GAC-Gulf litigation strategy meeting held on January 13, 1976 in San Diego, which were inadvertently produced to United in this case, reflect a GAC \"plan to welch on all utility contracts.\" (Emphasis in original.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. . GAC's arguments are contained in a forty-six page appendix entitled \"Review of Historical Facts.\" This appendix was filed along with GAC's reply brief. It apparently was not included in that brief because GAC had already met the 150 page limit on that brief this Court had specifically set at GAC's request. We note that GAC did not seek leave of the Court to exceed that page limitation in order to include these additional arguments in its reply brief, nor did it seek or receive permission from the Court to file such an argument in an appendix, rather than in a brief. \"[W]e disapprove of and will in the future disregard attempts by counsel to supplement their briefs in a manner not authorized by the rules.\" Lance v. New Mexico Military Institute, 70 N.M. 158, 164, 371 P.2d 995, 999 (1962).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. . \"Ordinarily, in ruling on a discovery motion, the Court will not determine whether a claim in the complaint, if proved, would have a bearing on the ultimate outcome of the action, it being sufficient that the matter to be explored is relevant to the issues made by the pleading.\" Apel v. Murphy, 70 F.R.D. 651, 654 (D.R.I. 1976) (citation omitted). See also Humphreys Exterminating Company, Inc. v. Poulter, 62 F.R.D. 392, 393 (D.Md. 1974); V.D. Anderson Co. v. Helena Cotton Oil Co., 117 F. Supp. 932, 945, n. 9 (E.D. Ark. 1953).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. . In the findings it entered as sanctions against GAC for GAC's failure to comply with its discovery orders, the trial court found that the cartel was made up of uranium producers. Although the court did not mention government participation in the cartel, it did find that the Canadian Government had \"encouraged,\" but neither \"required,\" \"mandated,\" nor \"compelled\" Gulf or Gulf Canada to participate in the cartel.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. . According to that Government, the cartel was created in order to protect the uranium mining industries of the participating nations from the adverse consequences of an embargo the United States Government had established in 1964 on the importation of foreign uranium into this country. See Act of August 26, 1964, P.L. 88-489, 78 Stat. 602.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. . Although this case dealt with the doctrine as it applies to an act of one of the states of the United States, the Court's ruling in Cantor applies to acts of foreign governments as well. See Hunt v. Mobil Oil Corp., 550 F.2d 68, 80 (2nd Cir. 1977) (Van Graafeiland, J., dissenting), cert. denied, 434 U.S. 984, 98 S. Ct. 608, 54 L. Ed. 2d 477 (1977); Linseman v. World Hockey Ass'n, 439 F. Supp. 1315, 1324 (D. Conn.1977).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. . W. Fugate, Foreign Commerce and the Antitrust Laws 49-50 (1958). See also Fugate, Antitrust Jurisdiction and Foreign Sovereignty, 49 Va. L. Rev. 925, 932 (1963): The real question is whose acts are the subject of inquiry. If the acts are those of the foreign government within its own jurisdiction, then the antitrust exception applies. The situation is the same if the foreign government through its laws, regulations, or orders, requires private parties to perform the anticompetitive acts. If, on the other hand, the acts complained of are in reality those of private parties who seek to hide behind the cloak of foreign law, the courts will attach antitrust liability.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. . \"Sherman Act jurisdiction now depends upon a showing of anticompetitive effects within the United States.\" Industrial Inv. Development v. Mitsui \u0026 Company, Ltd., supra, 594 F.2d at 52 (citations omitted). See also K. Brewster, Jr., Antitrust and American Business Abroad 65-75 (1958); W. Fugate, supra at 29-34.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. . GAC itself made this very distinction to the court below. In its opening statement at the trial, GAC's counsel stated: [T]he 1973 and 1974 supply agreements were not the part, product, or in any way connected with an agreement of the cartel. Now, it may be that Gulf was motivated to go into the agreements because of the cartel, or its knowledge of the cartel. There may be a lot of things. And all of those \"maybes\" may come out at trial. (Emphasis added.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. . The Regulations read in pertinent part: No person who has in his possession or under his control any note, document or other written or printed material in any way related to conversations, discussions or meetings that took place between January 1, 1972 and December 31, 1975 involving that person or any other person or any government, crown corporation, agency or other organization in respect of the production, import, export, transportation, refining, possession, ownership, use or sale of uranium or its derivatives or compounds shall (a) release any such note, document or material, or disclose or communicate the contents thereof to any person, government, crown corporation, agency or other organization unless (i) he is required to do so by or under a law of Canada, or (ii) he does so with the consent of the Minister of Energy, Mines and Resources; or (b) fail to guard against or take reasonable care to prevent the unauthorized release of any such note, document or material or the disclosure or communication of the contents thereof. The Regulations were amended in October 1977, but the amendments are not pertinent to the issues in this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. . On appeal, GAC has contended that a court cannot, without violating the act of state doctrine, \"inquire into what was the real scope of the Canadian policy,\" nor \"judge what was the entire contour of the Canadian policy and was anything done outside the contours of that policy.\" That that proposition is untenable should be evident. See Baker, supra, 11 Cornell Int'l L.J. at 177, n. 67. If GAC's position was adopted, then an act of state or sovereign compulsion defense could be irrefutably established by the mere assertion of it by the party seeking its protection.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. . The chairman of the Congressional subcommittee which investigated cartel activities concluded that there could not be \"any serious doubt... that cartel activities did in fact affect domestic American commerce.\" Hearings on International Uranium Cartel, supra, Vol. 1, Serial No. 95-39, p. 247. See also the evidence reviewed in Section II B, supra, and Duquesne Light Co., et al. v. Westinghouse Electric Corporation, (No. G.D. 75-23978) (Pa. Ct. of Comm. Pleas, March 30, 1977) (approving settlement).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. . In his opinion in In Re Uranium Antitrust Litigation, supra, 480 F. Supp. at 1154, Judge Marshall indicated that cartel records could have a vital bearing on the defendants' defenses of sovereign compulsion. Thus, he indicated that merely by raising the sovereign compulsion defense, a defendant could not preclude a court from seeking documents located in a foreign country which might be relevant to the merits of that defense. Compare GAC's position at n. 42, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. . On August 17, 1972, the Canadian Minister of Energy, Mines and Resources wrote to the President of the Canadian Atomic Energy Control Board, informing him that the Canadian Government had approved a regulation governing the export of uranium from Canada \"[i]n order to enforce compliance with the terms of the marketing arrangements.\" The letter began by stating that \"[o]n June 29, 1972, [the Canadian] Cabinet approved the terms of a uranium export marketing arrangement [the cartel] proposed by producers in Canada and several other countries.\" (Emphasis added.) One writer suggested that \"this document reveals an approval by government of a privately proposed arrangement, which was in turn implemented by government orders.\" Baker, supra, 11 Cornell Int'l L.J. at 183, n. 94. Compare W. Fugate, supra, at 148 (\"[I]f private parties... influence foreign government legislation as part of a conspiracy to restrain United States foreign trade, the foreign government sanction of some of their activities will not justify their conspiracy\" (Footnotes omitted)) with Cal. Retail Liquor Dealers Ass'n v. Midcal Alum., 445 U.S. 97, 104-108, 100 S. Ct. 937, 943-44, 63 L. Ed. 2d 233 (1980) (\"The State simply authorizes price-setting and enforces the prices established by private parties.... The national policy in favor of competition cannot be thwarted by casting such a gauzy cloak of state involvement over what is essentially a private price-fixing arrangement.\")\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. . \"Today it is clear that a businessman may do no more than what is required by foreign legislative mandate if he is to claim antitrust immunity.\" 7 Va. J. Int'l L. at 133. See also W. Fugate, supra, at 148.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. . For authorities supporting the position that the sovereign compulsion defense should be limited to activities conducted solely within the foreign sovereign's territory, see Fugate, 49 Va. L. Rev. at 934; Note, Development of the Defense of Sovereign Compulsion, 69 Mich. L. Rev. 888, 901-02 (1971); 7 Va. J. Int'l L. at 140-42; United States Department of Justice Antitrust Guide for International Operations, T. Reg. Rep. (CCH) No. 266, Part II (Feb. 1, 1977).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. . Six members of the Supreme Court in First Nat. City Bk. rejected the notion that the position of the executive branch is dispositive of the question of the applicability of the act of state doctrine in a particular case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. . GAC has brought to our attention two letters written by the Justice Department to the Seventh Circuit Court of Appeals and to Judge Marshall in the Westinghouse uranium litigation now pending before those courts. See In Re Uranium Antitrust Litigation, 617 F.2d 1248 (7th Cir. 1980) and D.C., 480 F. Supp. 1138, supra. On March 18, 1980, the Justice Department sent the Seventh Circuit a letter from the State Department which referred to criticism of foreign governments in a recent decision of that court (see 617 F.2d at 1256). The State Department said that this criticism had \"caused serious embarrassment to the United States in its relations with some of our closest allies.\" It stated that \"the foreign governments concerned have substantial interest not only in [the Westinghouse] litigation, but also in certain broader issues which it raises.\" It said that although \"the United States Government does not share some of the views presented by the foreign governments,\" it recognized \"the genuineness of their concerns,\" and believed that their views should be considered by the courts because they \"may assist the judiciary... in making the necessary accommodations between the laws and policies of various sovereign nations.\" In May of this year, Associate Attorney General John Shennefield asked Judge Marshall to give \"appropriate deference and weight\" to the views and representations of the foreign governments. He stated that because the Westinghouse case \"implicates foreign policy concerns of both the United States and foreign governments,\" \"it would be inappropriate, in the absence of bad faith, to inflict punishment against a defendant... for inability to comply with the discovery order of the court because of a contrary foreign criminal law.\" (Emphasis added.) He urged the court to consider \"the consequences of the absence of complete discovery\" by reference to the factors identified in Societe Internationale v. Rogers, 357 U.S. 197, 78 S. Ct. 1087, 2 L. Ed. 2d 1255 (1958). Unlike the Seventh Circuit's recent decision, nothing either this Court or the trial court below has said in this case was critical of the Government of Canada. In May of this year, the Government of Canada sought leave of this Court to file an amicus curiae brief in this appeal. The motion was filed over two years after entry of the sanctions order and default judgment, and one year after the case had been argued to this Court. No reason was given for the delay in filing the motion, and accordingly, it was denied. In any case, the views of the Canadian Government were presented to the trial court, and are part of the record on appeal. We have fully considered them in reaching our decision. Like the State Department, however, we do not share some of the Canadian Government's views, though we have given full credence to their representations. The State Department's statement that the views of the foreign governments involved \"may assist the judiciary... in making the necessary accommodations between the laws and policies of the various sovereign nations,\" is inconsistent with the notion that judicial examination of the matters at issue is precluded by the act of state doctrine. It is worth noting that neither the State nor the Justice Department has communicated similar concerns either to the court below or to this Court over the course of this litigation. Finally, the default judgment imposed in this case was based on findings that GAC acted in bad faith. Those findings are supported by the record; and they are consistent with the requirements of Societe Internationale (see Section III A, infra), and the concerns the Justice Department expressed in its most recent letter concerning the Westinghouse litigation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. . The Antitrust Division of the Justice Department has an established policy regarding the application of American antitrust laws to the international activities of American corporations which is consistent with the actions taken by the Division regarding this cartel and with the discovery orders entered in this case. In the Antitrust Guide for International Operations, (see n. 47, supra), the Justice Department discusses its position concerning the application of the act of state doctrine to two hypothetical situations (cases \"K\" and \"L\") that have a direct bearing on the allegations against GAC and Gulf in this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. . United States v. Borden Co., 347 U.S. 514, 518, 74 S. Ct. 703, 706, L. Ed. 903 (1954); Battle v. Liberty National Life Insurance Company, 493 F.2d 39, 52 (5th Cir. 1974), cert. denied, 419 U.S. 1110, 95 S. Ct. 784, 42 L. Ed. 2d 807 (1975); In Re Uranium Antitrust Litigation, supra, 480 F. Supp at 1154. Sections 57-1-1 and 57-1-2, N.M.S.A. 1978, make certain anti-competitive trade practices a crime in New Mexico. Section 57-1-3, N.M.S.A. 1978, provides a private party with a cause of action for damages it suffers by reason of the same practices.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. . \"Private litigation under the antitrust laws plays an important role in the enforcement of antitrust violations. It supplements public enforcement, 'increases the likelihood that a violator will be found out, greatly enlarges his penalties, and thereby helps discourage illegal conduct.'\" Wechsler, New Mexico Restraint of Trade Statutes -- A Legislative Proposal, 9 N.M.L. Rev. 1, 20 (1979) (footnote omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. . Although similar to the act of state doctrine, this second principle is distinct in that the former looks to the power of American courts in general, whereas the latter is concerned with the power of an American state court. The act of state doctrine rests on the principle of separation of powers between branches of the federal government; the principle of exclusive federal power over the conduct of foreign relations is based on the concept of federalism.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. . \"Antitrust laws in general, and the Sherman Act in particular, are the Magna Carta of free enterprise. They are as important to the preservation of economic freedom and our free-enterprise system as the Bill of Rights is to the protection of our fundamental personal freedoms.\" United States v. Topco Associates, 405 U.S. 596, 610, 92 S. Ct. 1126, 1135, 31 L. Ed. 2d 515 (1972). \"So crucial are antitrust laws to the economy of the state that the New Mexico Constitution [Art. IV, ยง 38] mandates the enactment of laws 'to prevent trusts, monopolies and combinations in restraint of trade.'\" Wechsler, 9 N.M. L. Rev. at 22.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. . These statutes had largely been applied to Communist countries. In the years following their passage, the statutes were subject to widespread criticism by legal scholars for being unsound legislation which had been both ineffective and prejudicially applied. See e.g. the authorities cited in 32 Alb.L. Rev. 646, 649, n. 15 (1968). In applying these statutes, state courts had on occasion criticized foreign governments in strong and intemperate language. See examples cited in Zschernig, supra at 437-39, n. 8, 88 S. Ct. at 669 n. 8 and in 82 Harv.L. Rev. at 239, n. 8. Commentators were virtually unanimous in condemning these statutes and in applauding the Zschernig decision. One said: \"[C]learly the state has no interest in inquiries of the sort which [ Zschernig] condemned.\" 82 Harv.L. Rev. at 245. See also 32 Alb.L. Rev. at 653-54.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. . It is worth noting that the Congressional subcommittee investigating the cartel held several of its hearings in unprecedented joint sessions with a committee of the New York State Assembly in order to assist that state's independent investigation of the cartel. Hearings on International Uranium Cartel, supra, Vol. I, Serial Nos. 95-39, p. 130 and No. 95-95, p. 1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57. . In ordering production of Gulf's Canadian cartel documents in the Westinghouse litigation, Judge Marshall rejected the very same act of state argument GAC advances here. He stated: Plaintiffs have not challenged the validity of any of the foreign nondisclosure laws which are relied on by defendants. The issue is not whether those laws are valid, but rather, conceding their validity, whether they excuse defendants from complying with a production order. In Re Uranium Antitrust Litigation, supra, 480 F. Supp. at 1149.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58. . In his recent decision ordering Gulf and other parties in the Westinghouse litigation to produce cartel records located in Canada and elsewhere, United States District Judge Marshall stated that \"the policies supporting an inquiry into corporate activities and structure are at least as weighty, and probably stronger, with the antitrust statutes here than they were with the Trading with the Enemy Act in Societe Internationale.\" In Re Uranium Antitrust Litigation, supra, 480 F. Supp. at 1154 (citation omitted). In a decision rendered on March 18 of this year, the Supreme Court of Canada denied an application of Gulf Oil for letters rogatory to secure cartel documents located in Canada. Gulf Oil Corp. v. Gulf Canada Ltd. (Slip Op. March 18, 1980). Gulf sought the letters in order to comply with discovery orders entered by Judge Marshall in the Westinghouse litigation. See In Re Uranium Antitrust Litigation, supra, 480 F. Supp. 1138. The Canadian high court stated that the Canadian Government's \"resistance to disclosure was not so much a matter of the maintenance of secrecy as it was of an assertion of Canadian sovereignty to resist the extra-territorial application of United States anti-trust laws.\" The court stated that it failed to see how such a policy \"can be ignored in the interests of comity towards a foreign court, as if the policy was essentially a reflection of private considerations without any public, governmental interest.\" But it stated: \"It may be that different considerations will operate where a Canadian court is concerned with Canadian litigation arising out of issues turning on Canadian law.\" The antitrust issues in this litigation reflect more than \"private considerations without any public, governmental interest.\" See n. 54, supra. We cannot subscribe to the idea that the fundamental public policy which the antitrust laws embody must be ignored in the interests of comity towards the policy of a foreign state, particularly where the highest court of that state intimates that it would not necessarily be bound by the same policy of its own government in litigation \"turning on Canadian law.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59. . In 1979, the New Mexico Legislature substantially revised the Antitrust Act. See N.M. Laws 1979, ch. 374, ยงยง 1-18 (codified as Sections 57-1-1 to 57-1-15, N.M.S.A. 1978 (Supp. 1979)). In this case, we are concerned with the prior act, Sections 57-1-1 to 57-1-3, N.M.S.A. 1978.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e60. . GAC's argument as to the inapplicability of the New Mexico Antitrust Act relates only to the antitrust issues in this case. However, as we have already held, the information and documents sought were also relevant to United's claims of fraud, breach of fiduciary duty, economic coercion and commercial impracticability. The judgment for I\u0026M was based on commercial impracticability under Section 55-2-615, N.M.S.A. 1978. GAC makes no claim that trial of these issues was precluded by the Commerce Clause or the Sherman Antitrust Act.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e61. . U.S. Const., Art. I, ยง 8, cl. 3 provides: \"The Congress shall have power... to regulate Commerce with the foreign Nations, and among the several States, and with the Indian Tribes....\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e62. . GAC relies on the case of Kosuga v. Kelly, 257 F.2d 48 (7th Cir. 1958), aff'd on other grounds, 358 U.S. 516, 79 S. Ct. 429, 3 L. Ed. 2d 475 (1959), in which the court held that the Illinois Antitrust Act did not apply to a contract for the sale of onions in interstate commerce. That decision indicated that the scope of the Illinois Act extended solely to intrastate commerce. See Henry G. Meigs, Inc. v. Empire Petroleum Company, 273 F.2d 424, 430 (7th Cir. 1960); R.E. Spriggs Co. v. Adolph Coors Co., supra, 112 Cal. Rptr. at 591. To the extent that Kosuga held state antitrust laws to be generally inapplicable to transactions involving interstate commerce, we decline to follow it. The language in Kosuga which supports such a holding has been criticized for its lack of authority and reasoning. See R.E. Spriggs Co. v. Adolph Coors Co., supra, 112 Cal. Rptr. at 591; J. Flynn, supra at 74-75; Pollack, Federal Preemption and State Antitrust Enforcement, 43 Chi. Bar Record 145 (1961). Kosuga relied on a reference to Corpus Juris Secundum, but the cases cited by C.J.S. do not stand for the proposition stated in the text. Two years after Kosuga, the Seventh Circuit applied a Wisconsin antitrust law to a transaction involving interstate commerce. Henry G. Meigs, Inc. v. Empire Petroleum Company, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e63. . GAC does suggest New Mexico will be benefited by invalidation of the contracts because United will be permitted to sell the uranium at higher prices, thus increasing local tax revenues and forcing out-of-state consumers to pay higher utility rates. However, any such consequences are entirely indirect results of the application of laws which, on their face, have no discriminatory aspects. GAC, of course, seeks to avoid its obligations to I\u0026M, which, if successful, would have precisely the same effect on I\u0026M's customers. Furthermore, if United were to sell any of this uranium for use inside New Mexico, New Mexico consumers would pay the same higher price. It is also interesting to note that GAC's argument that higher uranium prices will result in higher tax revenues in this State is based on GAC's recognition that the uranium would have been supplied from New Mexico sources.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e64. . See n. 50, supra, and accompanying text. In addition to the hearings held on the anti-competitive practices of the cartel (see Hearings on International Uranium Cartel, supra), in 1975 another subcommittee of the U.S. House of Representatives held extensive hearings on competition in the energy industry. Energy Industry Investigation: Hearings Before the Subcommittee on Monopolies and Commercial Law of the House Committee on the Judiciary, 94th Cong., 1st Sess., Serial No. 48-49, Parts 1-2 (1975). (Gulf submitted a report on its uranium business as part of those hearings. The report did not, however, reveal Gulf's role in the uranium cartel.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e65. . See e.g., Bibb v. Navajo Freight Lines, 359 U.S. 520, 79 S. Ct. 962, 3 L. Ed. 2d 1003 (1959) (state law required change of mudguards on interstate carriers at state line); Southern Pacific Co. v. Arizona, supra, (state law required change in length of trains at state line).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e66. . De Canas v. Bica, 424 U.S. 351, 357, 96 S. Ct. 933, 937, 47 L. Ed. 2d 43 (1976); Southern Pacific Co. v. Arizona, supra, 325 U.S. at 769, 65 S. Ct. at 1520.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e67. . Florida Avocado Growers v. Paul, 373 U.S. 132, 146-47, 83 S. Ct. 1210, 1219, 10 L. Ed. 2d 248 (1963); Campbell v. Hussey, 368 U.S. 297, 300-01, 82 S. Ct. 327, 328-29, 7 L. Ed. 2d 299 (1961); J. Flynn, supra, at 119.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e68. . De Canas v. Bica, supra, 424 U.S. at 358, 96 S. Ct. at 937; City of Burbank v. Lockheed Air Terminal, 411 U.S. 624, 634-37, 93 S. Ct. 1854, 1860-1861, 36 L. Ed. 2d 547 (1973); J. Flynn, supra, at 125.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e69. . Florida Avocado Growers v. Paul, supra, 373 U.S. at 146, 83 S. Ct. at 1219; Pennsylvania v. Nelson, 350 U.S. 497, 505, 76 S. Ct. 477, 481, 100 L. Ed. 640 (1956).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e70. . See e.g., Ray v. Atlantic Richfield Co., 435 U.S. 151, 157, 98 S. Ct. 988, 994, 55 L. Ed. 2d 179 (1978); City of Burbank v. Lockheed Air Terminal, supra, 411 U.S. at 633, 93 S. Ct. at 1859; Rice v. Santa Fe Elevator Corp., supra, 331 U.S. at 230, 67 S. Ct. at 1152; Note, The Commerce Clause and State Antitrust Regulation, 61 Colum.L. Rev. 1469, 1477-78 (1961).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e71. . Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e72. . Kelly v. Washington, 302 U.S. 1, 10-11, 58 S. Ct. 87, 92, 82 L. Ed. 3 (1937). See also R. E. Spriggs Co. v. Adolph Coors Company, supra, 112 Cal. Rptr. at 593.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e73. . Because the New Mexico Antitrust Act \"does not provide for treble damages as available to federal litigants, the ability to have a contract declared void is the most effective tool provided by New Mexico law.\" Weschler, 9 N.M.L. Rev. at 9 n. 70.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e74. . In Electric City Supply Company, the contract sued upon was not even alleged to have violated the antitrust laws. There, a contractor sold equipment to a municipality which he had purchased from a materialman. After the contractor was paid by the city, he sought to avoid his obligation to pay the materialman on the ground that his contract with the municipality violated state and federal antitrust laws. The materialman was not a party to that contract. Thus, since the contractor had been fully paid by the city, this Court refused to permit him to avoid his obligation to pay the materialman.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e75. . A similar argument was rejected in the unreported decision of General Atomic Company v. Exxon Nuclear Company, Inc., (No. 78-223E) (S.D. Cal., Sept. 6, 1978). Like United here, Exxon sought to have its obligation to supply uranium to GAC declared invalid. The court held that a contract need not call for some overtly illegal act on its face before performance of it is enjoined. The court concluded that it would be enough if it was proved that GAC's contract with Exxon \"would have the effect of securing to GAC monopoly control of the relevant uranium market.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. . See Ghandi v. Police Department of the City of Detroit, 23 F.R. Serv. 2d 35 (E.D. Mich. 1977); United States v. National Broadcasting Company, Inc., 65 F.R.D. 415, 419-20 (C.D. Cal. 1974), appeal dismissed, 421 U.S. 940, 95 S. Ct. 1668, 44 L. Ed. 2d 97 (1975); Advance Labor Serv., Inc. v. Hartford Accident \u0026 Ind. Co., 60 F.R.D. 632, 633-34 (N.D. Ill. 1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e* * * * * * ... GAC did not represent to the trial court that Gulf would refuse to produce its documents if an order directing it to do so were entered. (Emphasis added.) However, GAC had stated to the trial court that it had \"no obligation or ability to furnish... documents from Gulf Oil Corporation or Scallop Nuclear, Inc.\" (Emphasis added.)\u003c/span\u003e\n\n",
    "body_length": 177858,
    "citedas": [
      "96 N.M. 155",
      "629 P.2d 231"
    ],
    "attorneys": "Rodey, Dickason, Sloan, Akin \u0026 Robb, John D. Robb, Jack Eastham, Albuquerque, Montgomery, Andrews \u0026 Hannahs, Seth D. Montgomery, Santa Fe, Howrey \u0026 Simon, Washington, D.C. for defendant-appellant. Bigbee, Stephenson, Carpenter \u0026 Crout, Donnan Stephenson; Harry L. Bigbee, Santa Fe, James T. Paulantis, Albuquerque, Charles D. Olmsted, Santa Fe, Simpson, Thacher \u0026 Bartlett, Rogers M. Doering, New York City, for plaintiff-appellee United Nuclear. Jones, Gallegos, Snead \u0026 Wertherim, James E. Snead, Santa Fe, for defendant-appellee Indiana \u0026 Michigan Elec. Co.",
    "category": [
      "252"
    ],
    "judges": "Payne, J., wrote the opinion. WE Concur: Dan Sosa, Jr., Chief Justice, Mack Easley, Justice.",
    "citation_count": 46
  }
}
