{
  "id": "NrTsTGYBTlTomsSBz0Pr",
  "document": {
    "title": "07/05/90 PEOPLE STATE MICHIGAN v. CHARLES EDWARD",
    "full_title": "PEOPLE OF THE STATE OF MICHIGAN . v. CHARLES EDWARD EASON",
    "jurisdiction": "Michigan Supreme Court",
    "date": "1990-07-05T00:00:00.000Z",
    "docket": "Docket No. 82718",
    "body": "We granted leave to appeal to determine whether the procedural safeguards \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e surrounding a formal trial must be afforded a defendant subjected to an enhanced sentence pursuant to the second-offender provisions of the controlled substance act, MCL 333.7413; MSA 14.15(7413). We hold that a defendant charged under a statute which provides for imposition of an enhanced sentence on an individual previously convicted of an offense under the same statute is not entitled to notice within fourteen days of arraignment of the prosecutor's intent to seek sentence enhancement or to a separate proceeding on the question whether he has previously been convicted of a narcotics offense.\n\nI\n\nThe questions presented in this case are: 1) did the Legislature intend to require a supplementary information and a separate fact-finding proceeding under this statute, and, 2) if not, does the legislative scheme offend the constitution?\n\nDespite recent modification of sentence enhancement provisions, the Legislature has not granted defendants who are subsequent offenders under the same statute a right to early notice of sentence enhancement. Nor has it provided for a separate proceeding to determine the question of a defendant's prior conviction of a drug offense. The sentence enhancement provision is a legislative authorization for Judges to tailor punishment to the criminal on the basis of an objective factor, i.e., a prior conviction under the same statute.\n\nThe Legislature has long provided that where a prosecutor intends to proceed under the habitual offender act, a separate charge must be filed, the defendant is entitled to a full jury trial, and the defendant's prior convictions \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e must be proven beyond a reasonable doubt. The habitual offender statutes are considered alternate sentencing provisions rather than penalty-enhancement provisions. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nIn creating a sentence enhancement provision in the controlled substance act, the Legislature took a factor, the defendant's prior criminal convictions, a traditional consideration in determining a defendant's sentence, and authorized a weight to be given that factor, i.e., not more than twice the term authorized. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e The statute is directed to facts which relate to the criminal, not to the crime, and nothing in the act suggests a proceeding other than that comporting with the fundamental due process requirement that a sentence must be based on accurate information and a defendant have a reasonable opportunity at sentencing to challenge such information.\n\nBy contrast, in situations in which the state creates a statutory scheme and elements of an offense, due process requires both notice of the charge and proof by the prosecutor of each element beyond a reasonable doubt. In re Winship, 397 U.S. 358; 90 S Ct 1068; 25 L Ed 2d 368 (1970). Conversely, a state may define the elements of an offense, and due process does not require the state to satisfy the reasonable-doubt standard as to facts not included in the statutory definition of an offense, so long as the definition does not offend a deeply rooted principle of Justice. Patterson v New York, 432 U.S. 197; 97 S Ct 2319; 53 L Ed 2d 281 (1977). Thus, due process does not require the state to proceed by notice of a separate charge, the right to trial by jury, and proof beyond a reasonable doubt wherever sentence enhancement is authorized.\n\nDue process does not require the prosecutor to charge the prior drug conviction in the information in order for the defendant's sentence to be enhanced on the basis of the prior conviction because the prior offense is not an element of a separate charge. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Nor is the defendant entitled to a trial-type procedure regarding the use of the defendant's prior drug convictions for sentencing purposes. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nIn the instant case, the court informed the defendant prior to sentencing of the increased penalty for a second offense, the defendant had the opportunity at sentencing to contest the accuracy of the information included in the presentence report, and the accuracy of the information was admitted. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nWhere the statute does not contemplate a separate trial-type proceeding but, rather, provides for sentence enhancement, due process requires a reasonable opportunity to challenge the accuracy of the information relied on in passing sentence. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Because the defendant did not challenge the fact that he was a second offender, the Court of Appeals erred in vacating his sentence and remanding the case for resentencing. Accordingly, the decision of the Court of Appeals is reversed and the sentence imposed by the trial Judge is reinstated.\n\nII\n\nOn February 25, 1985, law enforcement personnel raided the defendant's house and seized a small amount of cocaine and more than $30,000 in cash. The defendant was charged with possession with intent to deliver less than fifty grams of cocaine. MCL 333.7401(1) and (2)(a)(iv); MSA 14.15(7401)(1) and (2)(a)(iv). The maximum sentence for this offense is twenty years in prison.\n\nOn July 12, 1985, the defendant was arraigned in Detroit Recorder's Court, and on September 12, 1985, the prosecutor filed a written notice \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e of his intent to seek an enhanced (doubled) sentence pursuant to MCL 333.7413(2); MSA 14.15(7413)(2).\n\nThe defendant was convicted by a jury of possession with intent to deliver less than fifty grams of cocaine, and on January 31, 1986, was sentenced to a maximum of forty years in prison. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Although advised at sentencing that the court was relying on the defendant's prior conviction for possession of heroin, neither the defendant nor counsel contested the accuracy of the prior conviction, and counsel confirmed that the presentence report was accurate.\n\nOn March 7, 1986, the defendant moved to vacate the sentence on the basis that the defendant's prior drug conviction was not charged in either the information or a supplemental information and that the prosecutor had not proven that the defendant was a recidivist drug offender. The defendant relied on People v Stout, 116 Mich App 726, 735; 323 NW2d 532 (1982), in which the Court of Appeals held:\n\nIn our view the quoted language from [ People v ] Urynowicz [412 Mich 137; 312 NW2d 625 (1981)] makes clear that a subsequent drug offender's sentence may not be enhanced unless the prior drug offense is charged in either the information or a supplemental information and the prosecutor proves that the defendant is a recidivist drug offender. [Emphasis in original.]\n\nThe sentencing Judge believed the Court of Appeals erred in Stout, but also that, under Stout, the notice filed was sufficient because the defendant received the notice and had not contested his conviction on the underlying charge. The motion was denied.\n\nIn an unpublished per curiam opinion, the Court of Appeals affirmed the defendant's conviction but remanded the case for sentencing. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e The Court of Appeals agreed with the defendant that the prosecution must charge the defendant as an habitual offender before his sentence could be enhanced under MCL 333.7413, 769.10(1)(c), 769.13; MSA 14.15(7413), 28.1082(1)(c), 28.1085.\n\nRelying on our decisions regarding proceedings under the habitual criminal act, the Court held that the prosecutor must file a supplemental information not more than fourteen days after a defendant is arraigned in circuit court unless the prosecutor is unaware of any prior felony record until after conviction or the delay in filing the information is due to the need to verify out-of-state felony convictions based on the record of a defendant's prior arrests. People v Shelton, 412 Mich 565; 315 NW2d 537 (1982), reh den 413 Mich 1108 (1982). As these exceptions were not applicable, the Court of Appeals vacated the defendant's sentence and remanded the case to the trial court for resentencing \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e solely on defendant's charge of possession with intent to deliver cocaine.\n\nThe prosecution contends that earlier decisions of this Court imposed procedural requirements in the sentence enhancement context that the Legislature never intended. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e See People v Urynowicz, supra, People v Wright, 405 Mich 832; 275 NW2d 1 (1979), and People v Lester, 417 Mich 927; 330 NW2d 854 (1983). The prosecutor further submits that the recent ruling of the United States Supreme Court in McMillan v Pennsylvania, 477 U.S. 79; 106 S Ct 2411; 91 L Ed 2d 67 (1986), provides a justification for reconsideration regarding the issue what procedures are required under due process when the court enhances a defendant's sentence pursuant to MCL 333.7413(2); MSA 14.15(7413)(2).\n\nThe defendant claims that the prior drug offense must be charged in either the information or a supplemental information, and that the prosecutor must prove that the defendant is a recidivist drug offender.\n\nIII\n\nThe issue presented is whether the sentence provision of the controlled substance act, authorizing an enhanced penalty for a defendant previously convicted of a like offense, offends due process by failing to provide prior notice of intent to enhance or a separate adversarial proceeding to establish proof of the prior conviction. People v Stout, supra.\n\nIt is well settled that in a criminal trial, the defendant's conviction must rest on evidence which proves \"beyond a reasonable doubt the existence of every fact necessary to constitute the crime charged\" \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e and includes the right to a trial by jury, \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e a public trial, counsel, confrontation of adverse witnesses, and a fair and speedy trial. The most fundamental of these safeguards in a criminal proceeding is the right to a trial by jury. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e See Duncan v Louisiana, 391 U.S. 145, 158, n 30; 88 S Ct 1444; 20 L Ed 2d 491 (1968); Baldwin v New York, 399 U.S. 66, 72; 90 S Ct 1886; 26 L Ed 2d 437 (1970).\n\nBy contrast, the due process right at a typical sentencing hearing is the right to be sentenced on the basis of accurate information. Trial-type procedures are not required. Williams v New York, 337 U.S. 241; 69 S Ct 1079; 93 L Ed 1337 (1949). \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e In Williams, the United States Supreme Court rejected a claim that the defendant was denied the opportunity to confront and examine his accusers by the trial court's reliance on the presentence investigation as the basis for its sentence. Id., p 244. The Court held the procedure did not violate due process \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e and identified a distinction between guilt determination and sentencing, observing:\n\nIn addition to the historical basis for different evidentiary rules governing trial and sentencing procedures there are sound practical reasons for the distinction. . . . verdict the issue is whether a defendant is guilty of having engaged in certain criminal conduct of which he has been specifically accused. Rules of evidence have been fashioned for criminal trials which narrowly confine the trial contest to evidence that is strictly relevant to the particular offense charged. . . . A sentencing Judge, however, is not confined to the narrow issue of guilt. . . . Highly relevant -- if not essential -- to his selection of an appropriate sentence is the possession of the fullest information possible concerning the defendant's life and characteristics. [ Id., pp 246-247.]\n\nThe Court concluded that the \"due process clause should not be treated as a device for freezing the evidentiary procedure of sentencing in the mold of trial procedure.\" Id., p 251.\n\nDecisions following Williams supported traditional individualized sentencing on the basis of a broad inquiry. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e The Court held that while information obtained in violation of a defendant's right to counsel \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e could not be considered, a sentencing Judge might permissibly take into account a defendant's trial conduct \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e and the defendant's refusal to cooperate with law enforcement officials. \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e The basic tenor of these cases is that an individualized sentence can be based on any relevant and reliable information, and that, while normal sentencing proceedings are not immune from due process attacks, only minimal due process protections are required in those proceedings. United States v Davis, 710 F2d 104 (CA 3, 1983), cert den 464 U.S. 1001 (1983).\n\nHowever, the Supreme Court has required additional procedural safeguards to satisfy due process requirements in situations in which a court seeks to impose additional penalties on a defendant pursuant to a finding of fact equivalent to invoking a new charge. \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e Specht v Patterson, 386 U.S. 605; 87 S Ct 1209; 18 L Ed 2d 326 (1967). In Specht, the defendant was convicted under one Colorado statute for indecent liberties which carried a maximum sentence of ten years. \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e Id., p 607. Thereafter, the defendant was sentenced under a different act \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e for a sentence of one day to life without full notice or a hearing. Id.\n\nThe Court noted that the act made one conviction the basis for invoking a separate proceeding under the sex offenders act, thus requiring a determination that constituted \" a new finding of fact.\" Id., p 608. As such, the defendant was entitled to the \"'full panoply of the relevant protections which due process guarantees in state criminal proceedings . . . all those safeguards which are fundamental rights and essential to a fair trial . . . .'\" Id., pp 609-610, citing Gerchman v Maroney, 355 F2d 302, 312 (CA 3, 1966).\n\nSubsequent to the Specht decision, in 1970, the United States Supreme Court declared that the Due Process Clause \"protects the accused against conviction except upon proof beyond a reasonable doubt of every fact necessary to constitute the crime with which he is charged.\" In re Winship, supra, p 364. Five years later in Mullaney v Wilbur, 421 U.S. 684; 95 S Ct 1881; 44 L Ed 2d 508 (1975), the Court held that Maine's homicide statute impermissibly shifted the burden of proof to the defendant on the issue of heat of passion on sudden provocation. Justice Powell observed:\n\nWinship were limited to those facts that constitute a crime as defined by state law, a State could undermine many of the interests that decision sought to protect without effecting any substantive change in its law. It would only be necessary to redefine the elements that constitute different crimes, characterizing them as factors that bear solely on the extent of punishment. [ Id., p 698.]\n\nHowever, in Riviera v Delaware, 429 U.S. 877; 97 S Ct 226; 50 L Ed 2d 160 (1976), the Court confirmed that it remained constitutional to burden the defendant with proving the insanity defense, and also held that the state could place the burden of proving a new affirmative defense, extreme emotional disturbance, on the defendant when the affirmative defense did \"not serve to negative any facts of the crime which the State is to prove in order to convict of murder.\" Patterson v New York, supra, p 207.\n\nWhile Winship and Specht establish that a Legislature is not wholly free to define elements of an offense as factors bearing only on punishment, it is clear that the limitation is a narrow exception to the deference accorded a state's administration of Justice.\n\nTraditionally, due process has required that only the most basic procedural safeguards be observed; more subtle balancing of society's interests against those of the accused have been left to the legislative branch. [ Patterson v New York, supra, p 210.]\n\nIn McMillan, supra, p 86, the Court recently has reaffirmed the state's ability to pursue \"its chosen course in the area of defining crimes and proscribing penalties.\" The Court rejected a due process challenge to a state statute that provided for imposition of a mandatory minimum sentence where a sentencing Judge finds by a preponderance of the evidence that an individual convicted of an offense \" a firearm\" during its commission. \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nWhile declining to define the express parameters of the state's authority to define the elements of an offense, the Court observed that Patterson had rejected the claim that whenever a state linked the severity of punishment to the presence or absence of an identified fact, McMillan, supra, p 84, the state must prove that fact beyond a reasonable doubt. The Court further distinguished Specht on the basis that in Specht the defendant was confronted with a \"radically different situation\" from the usual sentencing proceeding. The Court observed:\n\nThe Pennsylvania Legislature did not change the definition of any existing offense. It simply took one factor that has always been considered by sentencing courts to bear on punishment -- the instrumentality used in committing a violent felony -- and dictated the precise weight to be given that factor if the instrumentality is a firearm. Pennsylvania's decision to do so has not transformed against its will a sentencing factor into an \"element\" of some hypothetical offense. [ Id., pp 89-90.]\n\nOf significance to the language in Stout, supra, that the prosecution prove the factor that authorizes enhancement, the Court also observed that \"Sentencing courts have traditionally heard evidence and found facts without any prescribed burdens of proof at all,\" McMillan, supra, p 91, and noted \"embracing . . . the clear-and-convincing standard here would significantly alter criminal sentencing, for we see no way to distinguish the visible possession finding at issue here from a host of other express or implied findings sentencing Judges typically make on the way to passing sentence.\" Id., p 92, n 8. \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\n\nThe second-offender provision with which we here deal likewise neither seeks to impose additional penalties on the basis of a finding of fact equivalent to a new charge, Specht, nor changes the definition of an existing offense, Winship. It simply takes one factor that has historically been of paramount importance in imposing an appropriate sentence, a previous conviction for a like offense, and authorizes an increased penalty. Therefore, due process neither compels a separate charge nor imposes trial-type evidentiary burdens on the sentencing process.\n\nIV\n\nIn the present case, the Court of Appeals vacated the defendant's sentence and remanded to the lower court for resentencing on the basis that the defendant did not receive sufficient notice of the prosecutor's intent to seek enhanced sentencing. However, we recognize the existence of precedent from this Court that suggests that it is error for a trial court to enhance a defendant's sentence under the controlled substance act unless a defendant is charged as a second or subsequent offender, as required under the habitual offender act.\n\nDespite the fact that in Oyler v Boles, 368 U.S. 448, 452; 82 S Ct 501; 7 L Ed 2d 446 (1962), the United States Supreme Court held that due process required reasonable notice and an opportunity to be heard relative to a recidivist charge, but not notice prior to trial on the underlying offense, \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e this Court, citing Oyler, thereafter held that the prosecutor separately, or coincidentally, must charge the defendant as an habitual offender prior to trial on the underlying substantive offense. \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e People v Wright, 405 Mich 832; 275 NW2d 1 (1979).\n\nThe apparent purpose of requiring the information to be filed is to provide the accused notice, at an early stage of the proceedings, of the potential consequences should the accused be convicted of the underlying offense. People v Shelton, supra, p 569. In Shelton, the Court defined \"promptly\" as not more than fourteen days after the individual the prosecutor elects to charge as an habitual offender is arraigned in circuit court on the underlying felony (or before trial if the defendant is tried within the fourteen-day period).\n\nIt is clear from a reading of Oyler and McMillan that Shelton is distinguishable, and that due process does not require the filing of a separate charge pursuant to a statute that does not create a new offense but simply authorizes the sentencing court to enhance the sentence. \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e The prosecutor is not required to charge the prior conviction in the information because it is not an element of a new charge, separate from the offense for which the defendant is presently charged. Instead, the prior conviction is a factor which the Judge may consider when imposing the sentence. See People v Mellor, 302 Mich 537; 5 NW2d 455 (1942). \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\n\nWhere, as here, the factor, a prior conviction, has not historically been considered an element of the crime, is objectively ascertainable, and carries little risk of erroneous determination, and there is no indication that the Legislature is seeking to avoid the procedural protections of Winship, \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e due process requires neither the filing of a separate charge nor adversarial proceedings at sentencing. In sum, \" sentencing factors need not be pleaded and proved at trial.\" United States v Affleck, 861 F2d 97, 99 (CA 5, 1988).\n\nThe pertinent sentence enhancement provision of the controlled substance act, MCL 333.7413(2); MSA 14.15(7413)(2) provides:\n\n(2) Except as otherwise provided in subsections (1) and (3), an individual convicted of a second or subsequent offense under this article may be imprisoned for a term not more than twice the term otherwise authorized or fined an amount not more than twice that otherwise authorized, or both.\n\nUnder subsection 2, the trial Judge may consider a defendant's prior offense if the present offense is a drug-related crime involving an amount less than fifty grams. \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e In the present case, the defendant was convicted of a second offense of an amount less than fifty grams, and the trial Judge imposed a maximum sentence of forty years, twice the twenty-year maximum otherwise authorized.\n\nIt is clear that neither the statute nor its predecessor \u003cspan class=\"fnref\"\u003e34\u003c/span\u003e requires an information filed prior to trial charging the defendant as a second offender under the habitual offender act or prior to a separate jury trial. \u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\n\nThis Court's reference to Wright, \u003cspan class=\"fnref\"\u003e36\u003c/span\u003e in Urynowicz, (supra) , a second offense criminal sexual conduct sentence, implied that due process required a separate proceeding whenever a defendant's sentence is increased on the basis of prior offenses. Id. For the reasons stated, we are now of the view that the Court erred in Urynowicz in concluding due process requires a separate proceeding and proof before enhancing the sentence of a second offender. \u003cspan class=\"fnref\"\u003e37\u003c/span\u003e\n\nA defendant may challenge the accuracy of the information contained in the presentencing report and is entitled to an opportunity to be heard on the matter if accuracy is contested. However, enhanced sentences based on prior conviction of the same statute are not subject to the Shelton rule, nor do they require adversarial proceedings.\n\nConclusion\n\nIn this case, the defendant contends he did not receive the notice required under People v Shelton. He does not contend he was denied a reasonable opportunity to contest the information in the presentence report. \u003cspan class=\"fnref\"\u003e38\u003c/span\u003e Although we hold that the fourteen-day rule in Shelton is not applicable to sentence enhancement authorized under this statute, we observe that due process requires notice of the information in the presentence report sufficiently in advance of sentence to provide a meaningful opportunity to contest its accuracy. \u003cspan class=\"fnref\"\u003e39\u003c/span\u003e Thus, we would remand the case to the trial court if we were unable to determine that the defendant was provided a reasonable opportunity to respond to the accuracy of the information in the report.\n\nHere, the record confirms that counsel reviewed the presentence report and guidelines with the defendant, that defendant was given an opportunity to respond to the accuracy of the information contained in the report, \u003cspan class=\"fnref\"\u003e40\u003c/span\u003e and that counsel agreed that the information was accurate.\n\nAccordingly, we reverse the decision of the Court of Appeals and reinstate the sentence imposed below.\n\nCavanagh, J. (concurring).\n\nI agree with the majority that the Legislature did not intend defendant's status as a second offender under subsection (2) of ยง 7413 of the controlled substances act, MCL 333.7413(2); MSA 14.15(7413)(2), to be separately charged and proven. I also agree that neither the federal nor the state constitutional guarantees of due process \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e require that defendant's prior conviction be treated as a new crime that must be separately charged and proven at a separate trial.\n\nHowever, I do not join the lead opinion's suggestion that no additional procedural protections are required under the Due Process Clause in a case, like this one, in which a factual finding at sentencing, unrelated to the proof establishing a defendant's underlying conviction, doubles the maximum sentence to which the defendant is exposed. As I interpret Specht v Patterson, 386 U.S. 605, 610; 87 S Ct 1209; 18 L Ed 2d 326 (1967), and McMillan v Pennsylvania, 477 U.S. 79; 106 S Ct 2411; 91 L Ed 2d 67 (1986), before an enhanced penalty under ยง 7413(2) may be imposed, a defendant is entitled to contest his alleged prior-offender status at an adversarial hearing where the prosecution carries the burden of proving the sentence-enhancing fact by at least a preponderance of the evidence, and where the defendant has the right to be represented by counsel, to present evidence, and to confront and cross-examine any witnesses against him. This hearing need not be conducted whenever a defendant is sentenced under ยง 7413(2), but may be conditioned upon the defendant's choice to contest the existence of his prior conviction. Still, the defendant's decision not to contest, but to admit a prior conviction and waive these safeguards must be preceded by adequate notice so that the decision is knowing and voluntary.\n\nNevertheless, even though the record permits an inference of inadequate notice and unintelligent waiver, this defendant simply has not raised such a claim. The defendant has never suggested that he or his counsel had inadequate time or information to prepare to contest his alleged prior conviction. Nor did he or his counsel request a continuance for that purpose either when the sentencing Judge questioned defense counsel about the accuracy of the allegations in the presentence report, which included reference to defendant's prior drug conviction, or when the enhancement issue was subsequently raised by the Judge. Defendant has never, even in this Court, claimed that he did not commit the prior offense or that the prior conviction is somehow invalid. He claims only that the absence of a separate charge and accompanying proof of his prior conviction requires his enhanced sentence to be vacated, and does not demand an opportunity to contest his prior conviction on remand. Absent either a claim by the defendant that his admission of his prior conviction was not knowing or voluntary, or a showing of prejudice, \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e I conclude that there is no statutory or constitutional basis for vacating defendant's sentence and join the result reached by the majority.\n\nLevin, J. (to affirm).\n\nEason was charged with possession with intent to deliver less than 50 grams of a mixture containing cocaine. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e The prosecutor did not charge Eason as a repeat offender in the information charging the current offense, nor did the prosecutor file a supplemental information within fourteen days after Eason's arraignment. Eason was convicted as charged. On the basis of a prior drug-related conviction, Eason was sentenced to imprisonment for twenty to forty years. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nThe Court of Appeals affirmed Eason's conviction but concluded that the procedures applicable under the habitual offender provisions of the Code of Criminal Procedure \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e also apply where the prosecutor seeks sentence enhancement under the controlled substances article. Since the prosecutor had not filed a supplemental information charging Eason as a repeat offender within fourteen days after Eason's arraignment, \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e as required in habitual offender proceedings, the Court vacated Eason's sentence. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nThe majority holds that the procedures applicable to sentence enhancement under the habitual offender provisions of the Code of Criminal Procedure do not apply to sentence enhancement under the controlled substances article. The majority goes on to hold that the \"procedures\" in the instant case were not violative of the Due Process Clause.\n\nI agree with the majority that the Due Process Clause of the Fourteenth Amendment does not require the prosecutor to notify a defendant before trial on the current offense that, if he is convicted of that offense, he is subject to sentence enhancement on the basis of a prior conviction of a similar offense.\n\nI would hold that the procedures applicable under the habitual offender provisions of the Code of Criminal Procedure apply to sentence enhancement under the controlled substances article. I would affirm the decision of the Court of Appeals because that Court correctly applied this Court's decisions concerning the requisite procedures.\n\nI\n\nUnder both the controlled substances article of the Public Health Code and its predecessor, the Controlled Substances Act, this Court has required the prosecutor to charge the defendant as a second or subsequent offender when seeking sentence enhancement. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nA\n\nThe only decision of this Court concerning the procedures to be followed when the prosecutor sought sentence enhancement under the Controlled Substances Act is People v Wright, 405 Mich 832; 275 NW2d 1 (1979). There, the defendant was charged with delivery of cocaine \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e and conspiracy to deliver cocaine. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e The prosecutor did not charge Wright as a second offender. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Wright was convicted as charged.\n\nWright argued on appeal that he had been denied reasonable notice and an opportunity to be heard as guaranteed by the Due Process Clause of the Fourteenth Amendment. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e The basis for Wright's claim was that at his arraignment he had been misled regarding the maximum possible sentences, \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e and that at the sentencing hearing he was not given an adequate opportunity to explain his prior drug-related conviction. Wright's due process claim was not based on the prosecutor's failure to inform him before trial of the most recent offenses of the possibility of sentence enhancement.\n\nThis Court issued a peremptory order vacating Wright's sentences, and remanded the case for resentencing:\n\nThe sentencing court improperly imposed double sentence pursuant to MCL 335.348; MSA 18.1070(48). Oyler v Boles, 368 U.S. 448; 82 S Ct 501;7 L Ed 2d 446 (1962). See MCL 769.10; MSA 28.1082, as amended by 1978 PA 77.\n\nIn Oyler v Boles, cited by this Court in Wright, the United States Supreme Court said that \"a defendant must receive reasonable notice and an opportunity to be heard relative to recidivist charge,\" but that \"due process does not require that notice be given prior to the trial on the substantive offense.\" \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nThe majority suggests that the reference to Oyler in Wright is evidence that this Court decided Wright on the basis of a mistaken belief that the Due Process Clause required notice of the possibility of sentence enhancement before trial of the current offense, and that Wright was therefore wrongly decided. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nThe suggestion that this Court in Wright misunderstood the United States Supreme Court's ruling in Oyler is unsupported by the language of the order in Wright \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e and (see n 11 and the accompanying text) by the contentions of the parties. There is evidence that the Court understood the applicable law.\n\nB\n\nThe Controlled Substances Act was repealed in 1978 and the Public Health Code was simultaneously enacted. The controlled substances article \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e of the Public Health Code does not specify procedures to be followed when the prosecutor seeks sentence enhancement.\n\nThe procedural requirements for sentence enhancement under the new law were first addressed in People v Stout, 116 Mich App 726; 323 NW2d 532 (1982). Stout was charged with possession of less than 50 grams of cocaine, \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e and possession of marihuana. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e The prosecutor filed a supplemental information charging Stout under the habitual offender provisions of the Code of Criminal Procedure. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e Stout was convicted as charged. The trial court dismissed the supplemental information, and sentenced Stout for the cocaine conviction pursuant to the repeat offender provision of the controlled substances article. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nStout argued on appeal that his sentence should be vacated because he was not given notice of the repeat offender charge and because there was no hearing or trial concerning his prior drug-related convictions. The Court of Appeals agreed. Relying primarily on this Court's opinion in People v Urynowicz, 412 Mich 137; 312 NW2d 625 (1981) (per curiam), \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e the Court of Appeals said:\n\nIn our view . . . Urynowicz makes clear that a subsequent drug offender's sentence may not be enhanced unless the prior drug offense is charged in either the information or a supplemental information and the prosecutor proves that the defendant is a recidivist drug offender. [ Stout, supra, p 735. Emphasis in original.]\n\nSince the trial court dismissed the supplemental information charging Stout under the habitual offender provisions of the Code of Criminal Procedure, and the prosecutor had not proved Stout's prior drug-related convictions, the Court of Appeals held that sentence enhancement was improper. \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nThis Court has twice vacated sentences enhanced under the controlled substances article because the defendant was not charged as a second or subsequent offender. People v Lester, 417 Mich 927; 330 NW2d 854 (1983); People v Cobb, 422 Mich 901; 367 NW2d 335 (1985). In these cases, unlike Wright, supra, the Court's orders mention the prosecutor's failure to charge the defendant as a repeat offender as the basis for holding that sentence enhancement was improper. \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nII\n\nThe Court's decisions applying the sentence enhancement provisions for repeat drug offenders are in a long line of decisions of this Court in which the prosecutor has always been required -- absent unusual circumstances not present in the instant case \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e -- to notify the defendant before trial of the current offense that, if he is convicted, he will be subject to sentence enhancement on the basis of a prior conviction. The Court has imposed this requirement without regard to whether a particular statute that authorizes sentence enhancement specifies the procedures to be followed when the prosecutor seeks an enhanced sentence.\n\nA\n\nThe Michigan liquor law authorized sentence enhancement for a second or subsequent conviction without specifying the procedures to be followed when the prosecutor sought sentence enhancement.\n\n1\n\nIn People v Ancksornby, 231 Mich 271; 203 NW 864 (1925), the defendant was charged with unlawful possession of intoxicating liquor and with selling and furnishing as a first offender. Ancksornby pled guilty to the information and, on the basis of an alleged post-plea acknowledgment of a prior conviction under the liquor law, the trial court imposed an enhanced sentence. \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nAncksornby appealed on the ground that an enhanced sentence could not be imposed because the prosecutor had not charged him as a second offender. The prosecutor confessed error. \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e This Court held that Ancksornby's sentence was excessive and illegal:\n\nThe trial Judge was in error. He sentenced the defendant for an offense of which he had not been convicted. The statute provides an increased punishment for a second or subsequent offense, but it must be charged as such in the information. That was not done in this case. [ Id., p 272.]\n\nIn People v McDonald, 233 Mich 98; 206 NW 516 (1925), the defendant was charged in the complaint and the information with unlawful possession of intoxicating liquor as a second offense. McDonald was tried, convicted and sentenced accordingly. At the preliminary examination, however, the prosecutor did not offer evidence concerning McDonald's prior conviction.\n\nThe Court said that \" information must contain an averment of former conviction . . . to justify a conviction and sentence therefor.\" \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e Although the former conviction was alleged in the information, \" there was no proof of a former conviction submitted on the examination had, the averment thereof should have been stricken from the information and the objection of the defendant to the introduction [at the trial] of proof thereunder sustained.\" \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e McDonald was followed in People v Van Vorce, 240 Mich 75, 78; 215 NW 5 (1927).\n\n2\n\nReferring to Ancksornby, McDonald, and Van Vorce, the majority says that the \"better construction\" of those decisions is that \"the Court construed the legislation in question as necessarily requiring a separate information filed to provide the opportunity for a preliminary examination for the defendant and to provide the circuit court with jurisdiction.\" \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e The majority also appears to suggest that a first offense was a misdemeanor, while a second or subsequent offense was a felony, and that the distinction is somehow significant. \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\nThe majority's attempt to distinguish Ancksornby, McDonald, and Van Vorce is unpersuasive. The assertion that the prosecutor was required to file a separate information to provide the defendant with an opportunity for a preliminary examination ignores that when the Court decided those cases, a defendant who was accused of violating the liquor law was entitled to a preliminary examination and was subject to circuit court jurisdiction without regard to whether he was charged as a first or repeat offender. \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nThe majority is again incorrect when it asserts that in the liquor law cases a first offense was a misdemeanor while a second or subsequent offense was a felony. When the liquor law was initially enacted, a first offense was indeed a misdemeanor. \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e By the time the Court decided Ancksornby, McDonald, and Van Vorce, however, the Legislature had amended the liquor law to make a first offense a felony. \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e In any event, the misdemeanor/felony distinction -- now determinative of whether a preliminary examination is required \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e and the jurisdictions of the district and circuit courts \u003cspan class=\"fnref\"\u003e34\u003c/span\u003e -- was not determinative when the Court decided those cases. \u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\n\nB\n\nAnother statutory scheme that authorizes sentence enhancement for a second or subsequent conviction without specifying the procedures to be followed when the prosecutor seeks sentence enhancement concerns driving under the influence of alcohol.\n\n1\n\nThe Attorney General issued an opinion in 1940 concerning the proper practice when prosecuting a person who had previously been convicted of driving under the influence of alcohol. \u003cspan class=\"fnref\"\u003e36\u003c/span\u003e The Attorney General said:\n\nWe feel that the proper procedure to be followed in cases of this nature is to charge the offender with a second or subsequent offense in the original complaint, have a preliminary examination before the proper magistrate, and in the event that the magistrate finds probable cause, have the accused bound over to the circuit court to stand trial. The information would charge a second or subsequent offense so as to apprize the accused and the court of the fact that such a second offense is charged. [OAG, 1939-1940, p 427 (February 29, 1940). \u003cspan class=\"fnref\"\u003e37\u003c/span\u003e Emphasis added.]\n\nIn People v Bosca, 25 Mich App 455; 181 NW2d 678 (1970), the information charged the defendant as a second offender under the drunk driving law. \u003cspan class=\"fnref\"\u003e38\u003c/span\u003e Bosca moved to quash the information on the basis that it was defective because it alleged both the current and the prior offense. The trial court denied Bosca's motion. The Court of Appeals affirmed, holding that \"before a defendant's punishment for the current offense can be enlarged, the earlier conviction must be charged and proved.\" \u003cspan class=\"fnref\"\u003e39\u003c/span\u003e The Court of Appeals has followed Bosca, \u003cspan class=\"fnref\"\u003e40\u003c/span\u003e and this Court has expressly approved its holding and rationale. \u003cspan class=\"fnref\"\u003e41\u003c/span\u003e\n\n2\n\nThe majority cites People v Mellor, 302 Mich 537; 5 NW2d 455 (1942), a case involving a second conviction of drunk driving, in support of its argument that a prosecutor is not required to charge a prior conviction because an earlier conviction is merely a factor for the Judge to consider in sentencing and not an element of a new charge. \u003cspan class=\"fnref\"\u003e42\u003c/span\u003e The defendant in Mellor was charged, \u003cspan class=\"fnref\"\u003e43\u003c/span\u003e convicted, and sentenced \u003cspan class=\"fnref\"\u003e44\u003c/span\u003e as a second offender. On appeal, Mellor argued that the prior conviction and the current offense should have been set forth in separate counts of the information. \u003cspan class=\"fnref\"\u003e45\u003c/span\u003e\n\nThe Court rejected Mellor's contention and said that it was not error to allege both the current offense and the prior conviction in the same count. \u003cspan class=\"fnref\"\u003e46\u003c/span\u003e The Court did not say that there was no need to charge a defendant as a second offender -- Mellor had been so charged. \u003cspan class=\"fnref\"\u003e47\u003c/span\u003e\n\n3\n\nThe majority appears to attempt to distinguish drunk driving from the case at hand on the basis that a prior conviction is an \"element\" of a repeat drunk driving offense because a first offense is a misdemeanor whereas a subsequent offense may be a felony. \u003cspan class=\"fnref\"\u003e48\u003c/span\u003e\n\nWhen the Court decided Mellor and the Attorney General issued his opinion, a second or subsequent conviction of drunk driving was a misdemeanor. \u003cspan class=\"fnref\"\u003e49\u003c/span\u003e When the Court of Appeals decided Bosca, a second conviction was a misdemeanor and a third or subsequent conviction within a ten-year period was, indeed, a felony. \u003cspan class=\"fnref\"\u003e50\u003c/span\u003e Thus, when the defendant in Bosca was charged as a second offender, \u003cspan class=\"fnref\"\u003e51\u003c/span\u003e he was charged with committing a misdemeanor, not a felony. The premise of the majority's analysis -- that a subsequent offense is a felony and the prior offense was a misdemeanor -- is thus factually incorrect. In all events, the prior conviction is no more an \"element\" when it constitutes a misdemeanor than when it constitutes a felony. \u003cspan class=\"fnref\"\u003e52\u003c/span\u003e\n\nThe majority also says that the \"better construction\" of the drunk driving laws is that \"the Court construed the legislation in question as necessarily requiring a separate information filed to provide the opportunity for a preliminary examination for the defendant and to provide the circuit court with jurisdiction.\" \u003cspan class=\"fnref\"\u003e53\u003c/span\u003e I acknowledge that the difference in the maximum sentence between a first and subsequent conviction of drunk driving is determinative of a defendant's entitlement to a preliminary examination and of the jurisdictions of the Justice of the peace and circuit court.\n\nThe jurisdictional significance of the availability of an enhanced sentence was indeed one basis for the Attorney General's opinion in 1940. \u003cspan class=\"fnref\"\u003e54\u003c/span\u003e It was not, however, the only basis for the Attorney General's opinion. \u003cspan class=\"fnref\"\u003e55\u003c/span\u003e Nor was it a basis of the Court of Appeals decision in Bosca. \u003cspan class=\"fnref\"\u003e56\u003c/span\u003e\n\nC\n\nStill another statutory scheme that authorizes sentence enhancement for a second or subsequent conviction without specifying the procedures to be followed when the prosecutor seeks sentence enhancement is found in the provisions of the Penal Code concerning criminal sexual conduct.\n\n1\n\nThis Court construed those provisions in People v Urynowicz, 412 Mich 137; 312 NW2d 625 (1981) (per curiam). The information charged Urynowicz with first-degree criminal sexual conduct. \u003cspan class=\"fnref\"\u003e57\u003c/span\u003e He pled guilty in exchange for the dismissal of a supplemental information that had been filed under the habitual offender provisions of the Code of Criminal Procedure. \u003cspan class=\"fnref\"\u003e58\u003c/span\u003e The basis of the habitual offender charge was a prior conviction of gross indecency. That conviction also would have justified the imposition of a mandatory five-year minimum sentence under the criminal sexual conduct provisions of the Penal Code, but Urynowicz was not charged under the provision. \u003cspan class=\"fnref\"\u003e59\u003c/span\u003e\n\nWhen taking Urynowicz' plea, the trial court told him that the maximum punishment for first-degree criminal sexual conduct was life imprisonment, but did not inform him of the mandatory five-year minimum sentence for a second conviction of criminal sexual conduct. Urynowicz was sentenced to life imprisonment.\n\nThe Court of Appeals reversed Urynowicz' conviction on the basis of the trial court's failure to inform Urynowicz of the mandatory minimum sentence. \u003cspan class=\"fnref\"\u003e60\u003c/span\u003e The prosecutor argued that the provision requiring a five-year minimum sentence was not operative in Urynowicz' sentencing \u003cspan class=\"fnref\"\u003e61\u003c/span\u003e because he had not been charged under that provision.\n\nThis Court agreed with the prosecutor's analysis. The Court first observed that \" have said in the past that second-offender provisions with mandatory sentence enhancement require that the information must charge the earlier conviction before a defendant may be liable for the additional punishment.\" \u003cspan class=\"fnref\"\u003e62\u003c/span\u003e After reviewing the decisions of this Court and the Court of Appeals, the Urynowicz Court concluded:\n\nWe believe that [the Court of Appeals] captured the essence of this Court's earlier decisions when [it said] in Bosca that \"before a defendant's punishment for the current offense can be enlarged, the earlier conviction must be charged and proved.\" This defendant was not charged under ยง 520f. Consequently, there was no mandatory minimum of which advice . . . was required. [ Id., pp 143-144 (quoting Bosca, supra, p 458).] \u003cspan class=\"fnref\"\u003e63\u003c/span\u003e\n\n2\n\nThe majority would jettison Urynowicz on the basis that \"the Court erred in Urynowicz in concluding due process requires a separate proceeding and proof before enhancing the sentence of a second offender.\" \u003cspan class=\"fnref\"\u003e64\u003c/span\u003e The alleged flaw in Urynowicz is the Court's reference to Wright. \u003cspan class=\"fnref\"\u003e65\u003c/span\u003e The majority says that the reference to Wright \"implied that due process required a separate proceeding whenever a defendant's sentence is increased on the basis of prior offenses.\" \u003cspan class=\"fnref\"\u003e66\u003c/span\u003e\n\nThe majority's contention that Urynowicz was wrongly decided is predicated on two assumptions: 1) this Court decided Wright on the basis of an incorrect reading of the United States Supreme Court's decision in Oyler ; and 2) this Court compounded its error by mentioning Wright in Urynowicz. As previously discussed, however, Wright was not decided on the basis of a mistaken belief that the Due Process Clause of the Fourteenth Amendment always requires notice of the possibility of sentence enhancement before trial on the most recent offense. \u003cspan class=\"fnref\"\u003e67\u003c/span\u003e Further, the decision in Urynowicz contains an accurate description of the United States Supreme Court's holding in Oyler, \u003cspan class=\"fnref\"\u003e68\u003c/span\u003e and of this Court's order in Wright.\n\nEven if the reference to Wright in Urynowicz did evidence a mistaken belief that the Due Process Clause of the Fourteenth Amendment was implicated on the facts of Urynowicz -- which it did not -- that \"error\" would not be an adequate basis on which to overrule Urynowicz. It is incorrect to suggest that the Due Process Clause was the basis of decision in Urynowicz. The Court discussed six different decisions. \u003cspan class=\"fnref\"\u003e69\u003c/span\u003e While Wright was based on the United States Constitution, the other five decisions relied on the statutory and common law of this state.\n\nIII\n\nIn requiring the prosecutor to charge the defendant as a second or subsequent offender when seeking an enhanced sentence, this Court has followed the rule advocated by most legal authorities and adopted in most jurisdictions.\n\nA\n\nThe principle that an accused, subject to a heavier penalty because of his recidivism, must be charged as a recidivist resounds in legal treatises and encyclopedias: \u003cspan class=\"fnref\"\u003e70\u003c/span\u003e\n\nindictment must set out every element of crime which enters into the punishment, since otherwise it does not set out fully the offense . . . . [Bishop, Statutory Crimes, ยง 167, p 184.]\n\nordinary forms of the statutory provision, if the offence is the second or third, and by reason thereof the punishment is to be made heavier, this fact must appear in the indictment; because by the rules of criminal pleading, every particular which makes heavier the punishment to be inflicted must be set out. [Bishop, (9th ed), ยง 961, pp 710-711.]\n\nThe indictment must allege every fact and modification of fact legally essential to the punishment to be inflicted. [I Bishop, New Criminal Procedure (2d ed), ยง 81.]\n\nThe result is that in every case, with no exception, the common law requires each individual thing which itself or a statute has made in that wrongful aggregation out of which the punishment proceeds, to be alleged in the indictment. [ Id., ยง 84.]\n\nIn most jurisdictions, by statute, a person who has been convicted of certain offenses, like larceny or the unlawful sale of intoxicating liquors or drunkenness, for instance, is rendered liable to an increased punishment for a second or third offense. The previous conviction enters into the second or third offense to the extent of aggravating it, and increasing the punishment; and, where it is sought to impose the greater penalty for a second or third offense, the previous conviction or convictions, like every other material fact, must be distinctly alleged in the indictment. [Clark, Criminal Procedure, ยง 84, p 204.]\n\nThere are many cases in which a second conviction changes the grade of the offense or authorizes the infliction of an increased punishment, and where this is the case the former conviction enters as an element into the new offense and should be alleged as a necessary part of the description and character of the crime intended to be punished directly and not by recital. [Joyce, Indictments (2d ed), ยง 449, p 516.]\n\nSo a sentence to an increased penalty, imposed by statute upon a second conviction, cannot be rendered, except upon an allegation in the indictment, and upon proof, of a prior conviction. [Joyce, (supra) , p 518.]\n\nWhere a second conviction changes the grade of an offense, or authorizes a higher penalty than could otherwise be imposed, the former conviction enters as an element into the new offense, and must be alleged and proved as a necessary part of the description and character of the crime intended to be punished. [8 Ruling Case Law, ยง 293, p 276.]\n\nA person accused of crime as a recidivist is entitled to be informed by indictment or information that he is being charged as such. [39 Am Jur 2d, Habitual Criminals, Etc., ยง 20, p 324.]\n\nIn some jurisdictions statutes have been enacted which, without setting up more than one offense or more than one degree of the same offense, permit the infliction of a heavier sentence when it is shown that the accused committed the crime in question under circumstances showing aggravation. The decisions construing these statutes have generally taken the position that in order to justify the imposition of the higher sentence, it is necessary that the matter of aggravation relied upon as calling for such sentence be charged in the indictment or complaint. [4 Anderson, Wharton's \u0026 Procedure, ยง 1788, p 610.]\n\nAn indictment under which it is sought to impose a higher penalty by reason of a previous conviction must allege the fact of such conviction. [1 McClain, , ยง 28, p 28.]\n\nB\n\nIn numerous cases decided in a host of other states, courts have held that repeat offenders, subject to heavier penalties because of their recidivism, must be charged as second or subsequent offenders \u003cspan class=\"fnref\"\u003e71\u003c/span\u003e although the statutes, analogous to the one before this Court, do not specify that an accused must be charged as a recidivist.\n\nMany of these cases, like the instant case, involve sentence enhancement provisions contained in drug offense statutes. Louisiana courts have required that prosecutors seeking heavier sentences against repeat offenders of a statute criminalizing possession of marijuana, \u003cspan class=\"fnref\"\u003e72\u003c/span\u003e include in the bill of information an allegation that the crime is a multiple offense. See State v Bouzigard, 286 So 2d 633 (La, 1973). \u003cspan class=\"fnref\"\u003e73\u003c/span\u003e\n\nIn the case of a defendant charged with distribution under the Controlled Dangerous Substances Act, the Louisiana court held that a defendant not charged as a second offender for distributing ethchlorvynol could not be sentenced as such. \u003cspan class=\"fnref\"\u003e74\u003c/span\u003e\n\nIn Sparkman v State Prison Custodian, 154 Fla 688; 16 So 2d 772 (1944), the Florida Supreme Court, citing numerous Florida and other state cases \u003cspan class=\"fnref\"\u003e75\u003c/span\u003e where it was held that the fact of prior conviction(s) must be alleged to subject an accused to enhanced penalties, held that the general rule applied as well to prosecutions under the Uniform Narcotic Drug Law. \u003cspan class=\"fnref\"\u003e76\u003c/span\u003e\n\nThe defendant in State v Loudermilk, 221 Kan 157; 557 P2d 1229 (1976), contended that his prior convictions should not have been contained in the indictment charging him as a subsequent violator of the narcotics laws. The court disagreed, explaining:\n\nthink the defendant was entitled to know, and to be specifically advised by the information of the specific offense with which he was charged and the seriousness thereof, including the class of felony of which he stood accused. The information before us recited the prior conviction in detail, and noted that the offense charged was a class B felony. This gave the defendant proper notice of the charge. [ Id., p 159.]\n\nCourts have often spoken to this issue in alcohol offense cases. In Quintana v People, 169 Colo 295; 455 P2d 210 (1969), Quintana was charged with drunk driving and, in a separate count, with a prior conviction of drunk driving within the last five years. The allegation of the prior conviction contained in count two subjected the defendant to a higher penalty under the Colorado drunk driving statute. The Supreme Court of Colorado, finding the indictment to be in proper form, said:\n\nA complaint charging the defendant with drunk driving under this statute and also with a second or subsequent conviction within five years, requires procedurally that each be the subject of a separate count. [ Id., p 298.] \u003cspan class=\"fnref\"\u003e77\u003c/span\u003e\n\nIn Smith v State of Florida, 75 Fla 468; 78 So 530 (1918), the defendant was charged with a violation of the beverage laws of that state. The Florida Supreme Court held that the defendant must be charged with prior offenses if it is intended that he be charged as a second offender. Id., p 473. \u003cspan class=\"fnref\"\u003e78\u003c/span\u003e Similarly, Kentucky courts have required that defendants subject to severer punishment under the sentence enhancement provision of the Prohibition Act be charged with the previous convictions. \u003cspan class=\"fnref\"\u003e79\u003c/span\u003e\n\nCourts applied the same rule to various theft statutes containing sentence enhancement provisions. The vehicle theft statute at issue in Studdard v State, 225 Ga 410, 411; 169 SE2d 327 (1969), provided:\n\nThe indictment charging any offense under this section shall contain the same allegations as prior to the adoption of this section. \u003cspan class=\"fnref\"\u003e80\u003c/span\u003e\n\nThe Georgia Supreme Court said:\n\nPrior to the adoption of such section, it had been consistently held that where the State sought to impose a greater penalty for an illegal act because of the defendant's alleged \"incorrigible and dangerous character\" resulting from prior convictions, such prior convictions must be alleged in the indictment. . . . [Citations omitted.] Such allegations are necessary to inform the defendant of the nature of the offense with which he is charged since they involve the penalty which may be invoked. \u003cspan class=\"fnref\"\u003e81\u003c/span\u003e\n\nIllinois cases have similarly so held with respect to sentence enhancement statutes contained in Illinois theft statutes. \u003cspan class=\"fnref\"\u003e82\u003c/span\u003e\n\nIn cases focused on sundry other types of statutes, e.g., statutes prohibiting illegal cohabitation, \u003cspan class=\"fnref\"\u003e83\u003c/span\u003e joyriding, \u003cspan class=\"fnref\"\u003e84\u003c/span\u003e lotteries, \u003cspan class=\"fnref\"\u003e85\u003c/span\u003e unlawful use of weapons, \u003cspan class=\"fnref\"\u003e86\u003c/span\u003e pandering, \u003cspan class=\"fnref\"\u003e87\u003c/span\u003e prostitution, \u003cspan class=\"fnref\"\u003e88\u003c/span\u003e and insufficient fund checks, \u003cspan class=\"fnref\"\u003e89\u003c/span\u003e courts have required that prosecutors seeking increased sentences, charge the accused with the prior conviction(s).\n\nThe majority departs from this long settled and widely accepted rule.\n\nC\n\nParticularly relevant are cases in which this general rule was followed although the Legislature had enacted other sentence enhancement statutes containing explicit procedural safeguards.\n\nIn Haffke v State, 149 Neb 83; 30 NW2d 462 (1948), the Supreme Court of Nebraska was called upon to decide what procedures must be followed when imposing an enhanced sentence for second or subsequent convictions of driving under the influence of intoxicating liquor. \u003cspan class=\"fnref\"\u003e90\u003c/span\u003e Although the applicable statute \u003cspan class=\"fnref\"\u003e91\u003c/span\u003e was silent as to the procedures to be followed when imposing the more severe sentence, the Nebraska Habitual Criminal Act contained explicit procedural safeguards. \u003cspan class=\"fnref\"\u003e92\u003c/span\u003e The Haffke court held that the recently amended procedural requirements in the Habitual Criminal Act were applicable to all situations \"where punishment is sought under any statute defining one crime and providing for an enhanced penalty upon conviction of a second or subsequent offense.\" The court said:\n\nWhile the above statute by its terms applies only to the Habitual Criminal Act, yet it announces rules of practice and procedure that, as a matter of sound public policy, should apply to any statute which imposes the duty upon a court to inflict a greater punishment upon the repetition of an offense. [ Id. at 95.]\n\nOther cases where courts required prosecutors to charge defendants as repeat offenders under \"procedurally silent\" statutes even though habitual offender statutes in the jurisdictions expressly provided that defendants must be charged as habitual violators, include State v McClay, 146 Me 104; 78 A2d 347 (1951), \u003cspan class=\"fnref\"\u003e93\u003c/span\u003e People v Hightower, 414 Ill 537; 112 NE2d 126 (1953), \u003cspan class=\"fnref\"\u003e94\u003c/span\u003e People v Ratner, 67 Cal App 2d Supp 902; 153 P2d 790 (1944), \u003cspan class=\"fnref\"\u003e95\u003c/span\u003e and State v Waller, 167 Ind App 307; 214 NE2d 380 (1966). \u003cspan class=\"fnref\"\u003e96\u003c/span\u003e\n\nD\n\nMany of the cases and authorities cited in the preceding sections predate the enactment of habitual offender provisions in this and other states. \u003cspan class=\"fnref\"\u003e97\u003c/span\u003e Thus, the principle that a defendant may not be sentenced as a recidivist unless he was charged as a recidivist predates the enactment of habitual offender statutes. This principle was developed by the courts over the course of several decades in applying procedurally silent sentence enhancement provisions.\n\nIV\n\nI agree with the majority \u003cspan class=\"fnref\"\u003e98\u003c/span\u003e that the Legislature's intent should be considered in deciding whether the prosecutor must charge a defendant as a repeat offender.\n\nA\n\nA statute should be construed to avoid absurd or unreasonable results. \u003cspan class=\"fnref\"\u003e99\u003c/span\u003e The majority says that it was the Legislature's intention that the prosecutor need not inform the defendant before trial on the current offense that if he is convicted of that offense, he will be subject to sentence enhancement on the basis of a prior drug-related conviction. Adoption of the majority's view would mean that a defendant who was subject to a more severe penalty would be afforded fewer procedural safeguards than a defendant who was subject to a less severe penalty. Absent a clear expression of legislative intent, the majority's construction should be rejected.\n\n1\n\nThe Code of Criminal Procedure provides for sentence enhancement where a defendant who is convicted of a felony has previously been convicted of one or more felonies. \u003cspan class=\"fnref\"\u003e100\u003c/span\u003e These habitual offender provisions are not limited to cases where the defendant's most recent conviction is for the same or a similar offense as his prior conviction(s).\n\nWhen the prosecutor seeks sentence enhancement under the habitual offender provisions, the general rule is that he must file a supplemental information charging the defendant as an habitual offender within fourteen days of the arraignment or before trial if the defendant is tried within that fourteen-day period. People v Shelton, 412 Mich 565, 566; 315 NW2d 537 (1982) (per curiam). \u003cspan class=\"fnref\"\u003e101\u003c/span\u003e If the prosecutor does not learn of the defendant's prior felony conviction(s) until after the defendant's conviction of the most recent offense, the prosecutor may institute post-conviction proceedings to sentence the defendant as an habitual offender. \u003cspan class=\"fnref\"\u003e102\u003c/span\u003e\n\nThe rules of practice and procedure that have been developed for prosecutions under the habitual offender provisions are based on this Court's construction of the relevant statutes, \u003cspan class=\"fnref\"\u003e103\u003c/span\u003e and its exercise of its supervisory power over the practices and procedures in the courts of this state. \u003cspan class=\"fnref\"\u003e104\u003c/span\u003e Those rules are not based on the United States Constitution. \u003cspan class=\"fnref\"\u003e105\u003c/span\u003e\n\n2\n\nUnder the habitual offender provisions, where a defendant with one prior felony conviction is convicted of a felony that is punishable \"by imprisonment for a term less than life,\" the trial court \"may place the person on probation or sentence the person to imprisonment for a maximum term which is not more than 1 1/2 times the longest term prescribed for a first conviction of that offense or for a lesser term.\" \u003cspan class=\"fnref\"\u003e106\u003c/span\u003e\n\nUnder the sentence enhancement provision of the controlled substances article, where a defendant with one prior drug-related conviction is convicted of another drug-related offense, he \"may be imprisoned for a term not more than twice the term otherwise authorized or fined an amount not more than twice that otherwise authorized, or both.\" However, where both the prior and current convictions involved 50 grams or more of a controlled substance, the defendant \" shall be imprisoned for life and shall not be eligible for probation, suspension of sentence, or parole during that mandatory term.\" \u003cspan class=\"fnref\"\u003e108\u003c/span\u003e\n\nThe construction placed on the controlled substances article by the majority attributes to the Legislature an intention to provide a defendant facing a possible fifty percent increase in the maximum sentence with the right to be informed of that possibility at an early stage in the proceedings, but deny early notice to a defendant who is facing a possible one hundred percent increase. It attributes to the Legislature an intention to provide a defendant facing a possible five- or ten-year increase in the maximum sentence with early notice of that possibility, but not a defendant facing the possibility of mandatory imprisonment for life.\n\nThe majority's construction thus attributes to the Legislature a purpose to act in disregard of the conception that the quantity and quality of needed procedural safeguards should be in direct relation to the severity of the possible penalty. I would wait for a clear expression of legislative intent before abandoning the well-established rule that the prosecutor must charge the defendant as a repeat offender when seeking an increased sentence on the basis of a prior conviction.\n\nB\n\nWhen the Legislature enacted the controlled substances article of the Public Health Code, it is presumed to have acted in contemplation of the longstanding and unbroken rule that the prosecutor is required to charge the defendant as a repeat offender whenever sentence enhancement is sought on the basis of a prior conviction. \u003cspan class=\"fnref\"\u003e109\u003c/span\u003e This has been the rule without regard to whether the statute that authorizes sentence enhancement contained an express requirement that the prosecutor charge the defendant as a repeat offender.\n\nThe Legislature could have provided for a departure from this longstanding and unbroken rule by stating that the prosecutor was not required to inform the defendant before trial on the current drug-related offense that, if he is convicted of that offense, he might receive an enhanced sentence on the basis of a prior drug-related conviction. The United States Constitution arguably would permit the Legislature to act in such a manner. \u003cspan class=\"fnref\"\u003e110\u003c/span\u003e When the Legislature disagrees with decisions of the Court, it often amends the statutes to correct the perceived error. \u003cspan class=\"fnref\"\u003e111\u003c/span\u003e The Legislature has not done so in this case. \u003cspan class=\"fnref\"\u003e112\u003c/span\u003e\n\nC\n\nIn not expressly requiring the prosecutor to charge the defendant as a repeat offender, the sentence enhancement provision of the controlled substances article is similar to the sentence enhancement provisions for second or subsequent convictions of criminal sexual conduct, driving under the influence of alcohol, and violation of the liquor law. And in every single case in which the question was raised, this Court has held, or has expressly approved a decision of the Court of Appeals which held, that the prosecutor must charge the defendant as a repeat offender when seeking sentence enhancement. \u003cspan class=\"fnref\"\u003e113\u003c/span\u003e\n\nThis Court has, on several occasions, endorsed the view expressed by Justice Brandeis in his Dissenting opinion in Burnet v Coronado Oil \u0026 Gas Co, 285 U.S. 393, 406; 52 S Ct 443; 76 L Ed 815 (1932), where he said:\n\nStare decisis is usually the wise policy, because in most matters it is more important that the applicable rule of law be settled than that it be settled right. This is commonly true even where the error is a matter of serious concern, provided correction can be had by legislation. \u003cspan class=\"fnref\"\u003e114\u003c/span\u003e [Emphasis in original; citations omitted.]\n\nThis is not to say that it is necessarily improper for a court to abandon a longstanding and unbroken rule in the application of statutes. It does, however, mean that the Court should not do so lightly. \u003cspan class=\"fnref\"\u003e115\u003c/span\u003e The majority's attempt to portray this Court's precedents as wrongly decided is inadequate. That effort is founded on unsupportable characterizations of the Court's decisions. The majority does not claim that the long-established rule has led to unjust results. Nor can the majority relieve itself of the burden of justifying a rejection of settled law by \"distinguishing\" the prior cases. The bases of distinction proffered by the majority either do not explain at all or only explain partially the Court's decisions.\n\nD\n\nThe prosecutor argues, and the majority agrees, that it was the Legislature's intention that the prosecutor would not be required to give early notice of the possibility of sentence enhancement to a defendant who has a prior drug-related conviction. It is said that since the Legislature \"required\" the prosecutor to charge a defendant as a repeat offender under the habitual offender provisions of the Code of Criminal Procedure, the failure to restate a similar requirement in the sentence enhancement provision of the controlled substances article evidences an intention to deny to repeat drug offenders the procedural safeguards that are afforded to other recidivists.\n\nIt is again relevant that this Court has always required the prosecutor to charge the defendant as a repeat offender even when such a requirement was not mandated by the literal language of the statute authorizing sentence enhancement. Given this longstanding and unbroken rule, there was no reason for the Legislature to set forth in the controlled substances article a requirement that the prosecutor charge the defendant as a repeat offender. The Legislature's \"omission\" amounted to nothing more than a failure to restate a proposition that had always been thought obvious.\n\nIt is also relevant that the requirement that a prosecutor give early notice of the possibility of sentence enhancement to a defendant in an habitual offender proceeding is the product of this Court's construction of the applicable statutes and of the exercise of its supervisory authority over the courts of this state. \u003cspan class=\"fnref\"\u003e116\u003c/span\u003e The literal language of the habitual offender provisions no more requires early notice than does the literal language of the other sentence enhancement statutes where the Court has imposed a similar requirement. In this respect, there is no difference between the literal language of the various statutes.\n\nThe majority's argument is based on the \"theory\" that the Legislature acted with a selective memory. The majority asserts that the Legislature enacted the controlled substances article in contemplation of this Court's decisions that the prosecutor must charge the defendant as a recidivist under the habitual offender provisions even though the literal language of the statute does not so require, but in ignorance of this Court's decisions that the prosecutor must charge the defendant as a repeat offender under all the other sentence enhancement provisions which also do not require early notice of the possibility of sentence enhancement.\n\nThe majority says that it is \"highly doubtful that the Legislature was deemed to be aware of decisions of this Court and relied on liquor law cases from the mid-1920's . . . .\" \u003cspan class=\"fnref\"\u003e117\u003c/span\u003e If this is true, then it is also \"highly doubtful\" that the Legislature acted in contemplation of the habitual offender provisions of the Code of Criminal Procedure. Those provisions were enacted in 1927. \u003cspan class=\"fnref\"\u003e118\u003c/span\u003e\n\nIn emphasizing the alleged verbal differences between the habitual offender provisions and the sentence enhancement provision of the controlled substances article, the majority employs a mode of analysis that has never before been thought to be persuasive. In McDonald, \u003cspan class=\"fnref\"\u003e119\u003c/span\u003e the Court held that the information must contain an allegation of prior conviction even though the statute authorizing sentence enhancement did not expressly so require, and in support of the rule there announced cited decisions involving sentence enhancement statutes that expressly required the prosecutor to charge the defendant as a repeat offender. \u003cspan class=\"fnref\"\u003e120\u003c/span\u003e So too in Urynowicz, \u003cspan class=\"fnref\"\u003e121\u003c/span\u003e and so too in the Attorney General's opinion concerning second or subsequent convictions of drunk driving. \u003cspan class=\"fnref\"\u003e122\u003c/span\u003e The \"verbal difference argument\" was the basis of People v McFadden, 73 Mich App 232; 251 NW2d 297 (1977), which was in turn the basis of the Court of Appeals decisions in Wright \u003cspan class=\"fnref\"\u003e123\u003c/span\u003e and Urynowicz, \u003cspan class=\"fnref\"\u003e124\u003c/span\u003e decisions which were reversed by this Court.\n\nIn sum, the basis for the majority's assertion concerning legislative intent is a distinction that has never before been thought significant.\n\nE\n\nThe majority would reject the longstanding and unbroken rule that the prosecutor must charge the defendant as a repeat offender whenever sentence enhancement is sought on the basis of a prior conviction. It is a rule that until today was thought to be obvious -- so obvious that the prosecutor in Ancksornby confessed error for failing to charge the defendant as a second offender, \u003cspan class=\"fnref\"\u003e125\u003c/span\u003e the prosecutor in Urynowicz advanced this rule before the Court, \u003cspan class=\"fnref\"\u003e126\u003c/span\u003e and the Attorney General adopted the rule in his 1940 opinion.\n\nWhen the unsupportable characterizations and unpersuasive distinctions of the Court's precedents are \"set aside,\" \u003cspan class=\"fnref\"\u003e127\u003c/span\u003e the only basis for the majority's abandonment of the longstanding and unbroken rule that the prosecutor must charge the defendant as a repeat offender is that this practice is not required by the Due Process Clause of the Fourteenth Amendment.\n\nThis Court has not said that notice of the possibility of sentence enhancement before trial on the current offense was mandated by the United States Constitution. That such notice is not mandated by the United States Constitution is not a reason for abandoning precedent requiring the prosecutor to give early notice of the possibility of sentence enhancement.\n\nV\n\nEnough prologue. Correct analysis should begin with the Code of Criminal Procedure, enacted in 1927, \u003cspan class=\"fnref\"\u003e128\u003c/span\u003e by which the Legislature adopted a new sentence enhancement scheme for habitual offenders. The prior statute expressly required the prosecutor to charge the defendant as an habitual offender. \u003cspan class=\"fnref\"\u003e129\u003c/span\u003e The Code of Criminal Procedure expressly provides that it is not always necessary to charge the defendant as an habitual offender in the information charging the current offense. \u003cspan class=\"fnref\"\u003e130\u003c/span\u003e The Code, rather, authorized the commencement of a separate sentence enhancement proceeding after conviction of the charged offense if \"at any time after conviction . . . it shall appear that a person convicted of a felony has previously been convicted of crimes . . . . \" \u003cspan class=\"fnref\"\u003e131\u003c/span\u003e\n\nA\n\nIn People v Judge of Recorder's Court, 251 Mich 626; 232 NW 402 (1930), decided three years after passage of the Code, \u003cspan class=\"fnref\"\u003e132\u003c/span\u003e the prosecutor filed a supplemental information charging John Figgins as an habitual offender after he had been convicted of the charged offense. The trial court ruled that Figgins was entitled to a preliminary examination respecting the allegation of prior conviction. The prosecutor petitioned this Court for the issuance of a writ of mandamus to compel the trial court to vacate its order regarding the preliminary examination.\n\nThis Court held that in light of the Code of Criminal Procedure, it was no longer necessary to conduct a preliminary examination concerning the allegation of prior conviction. The Court explained:\n\nPrior to the criminal code [1927 PA 175], there was no provision in the law for an independent trial to determine the fact of a prior conviction. It was tried out in the trial for the subsequent offense. It was necessary to charge it in the complaint and warrant and prove it on the examination and trial unless examination was waived. Otherwise the court was without jurisdiction to consider it in imposing sentence. But [1927 PA 175, ch IX, ยง 13], authorizes an independent trial of that question on the filing of a supplemental information after conviction and sentence for the subsequent offense. . . . The purpose of an examination is to determine if a crime has been committed and if there is probable cause for believing the accused party committed it. If no crime is charged, an examination is not required. In People v Palm, 245 Mich 396 [223 NW 67 (1929)], it was held that a supplemental information, filed after conviction, alleging a prior conviction, does not charge any crime. [ Id., p 627. Emphasis added.] \u003cspan class=\"fnref\"\u003e133\u003c/span\u003e\n\nThe Court's statements indicate that it was not until the enactment of the Code of Criminal Procedure that a trial court had the authority to impose an enhanced sentence where the prosecutor did not proceed from the commencement of the prosecution \u003cspan class=\"fnref\"\u003e134\u003c/span\u003e against the defendant as a repeat offender. \u003cspan class=\"fnref\"\u003e135\u003c/span\u003e\n\nB\n\nThe lack of jurisdiction, adverted to in judge of Recorder's Court and remedied in part by the enactment of the Code of Criminal Procedure, could be distinguished from a prosecution under the controlled substances article on the basis that the pre-Code habitual offender provisions expressly required the prosecutor to charge the defendant as a repeat offender, \u003cspan class=\"fnref\"\u003e136\u003c/span\u003e while the controlled substances article does not prescribe any particular procedure to be followed when seeking sentence enhancement for a second or subsequent drug-related conviction. In other words, the jurisdictional problem with imposing an enhanced sentence where the prosecutor has not proceeded from the commencement of the prosecution against the defendant as a repeat offender could be viewed as being limited to situations where the Legislature has affirmatively required that the prosecutor charge previous convictions.\n\nSuch a narrow reading of this Court's precedents concerning the jurisdiction of trial courts to impose enhanced sentences is, again, negatived by other decisions of this Court applying statutes that did not specify any particular procedures to be followed when seeking sentence enhancement on the basis of a prior conviction, as in People v McDonald, 233 Mich 98; 206 NW 516 (1925), where the Court held that \" information must contain an averment of former conviction, and there must be proof on the trial to maintain it, to justify a conviction and sentence therefor.\" \u003cspan class=\"fnref\"\u003e137\u003c/span\u003e The Court explained:\n\nThe violation complained of is aggravated by the fact of his former conviction. He is thereby subjected to an enhanced penalty. The purpose of averring and proving it is to give the court jurisdiction to impose it. [ Id., p 103. Emphasis added.]\n\nThe jurisdictional significance of proceeding from the commencement of prosecution against the defendant as a repeat offender -- even where the statute authorizing sentence enhancement did not expressly so require -- was confirmed in In re Brazel, 293 Mich 632; 292 NW 664 (1940), where this Court compared the pre-Code habitual offender provisions and the liquor law provisions that were applied in McDonald.\n\nThe Court first noted the statement in People v Campbell, 173 Mich 381, 386; 139 NW 24 (1912), that charging the defendant as a repeat offender was necessary to give the trial court the authority to sentence the defendant as an habitual offender. The Court then said:\n\nIt will be noted that [the habitual offender provisions] contained the express mandate that the prior convictions be alleged in the indictment on which conviction of any offense is had.\n\nThis was not true of the prohibition law of 1917, as amended, which contained certain provisions in respect to increased punishment for second and subsequent offenses. Attention is called to [1917 PA 338], where it will be noted that there was no provision requiring the prior convictions to be alleged in the indictment. However, this court held that in order to confer jurisdiction the information must include allegations which specify the prior convictions and that a respondent under such circumstances was entitled to a preliminary examination. \u003cspan class=\"fnref\"\u003e138\u003c/span\u003e [ Brazel, p 639. Emphasis added.]\n\nIn speaking of \"jurisdiction,\" the Court was not referring to the respective jurisdictions of the circuit court and of the Justice of the peace. \u003cspan class=\"fnref\"\u003e139\u003c/span\u003e When the Court decided the liquor law cases, the circuit court had jurisdiction over both a first and subsequent offense. \u003cspan class=\"fnref\"\u003e140\u003c/span\u003e\n\nThe Court's references to \"jurisdiction\" were references to the authority of a court -- any court -- to impose an enhanced sentence on the basis of a prior conviction. Before enactment of the Code of Criminal Procedure, without regard to whether the particular sentence enhancement statute expressly required the prosecutor to charge the defendant as a repeat offender, a trial court possessed the authority to impose an enhanced sentence only where the prosecutor had proceeded from the commencement of prosecution against the defendant as a repeat offender.\n\nC\n\nIt is against this historical background that the Court should consider the prosecutor's argument that the procedural safeguards applicable under the habitual offender provisions of the Code of Criminal Procedure do not apply where sentence enhancement is sought under the controlled substances article of the Public Health Code. \u003cspan class=\"fnref\"\u003e141\u003c/span\u003e\n\nRather than disregard this Court's precedents concerning the authority of the trial court to impose an enhanced sentence and rather than hold that the trial court in this case did not have the authority to impose an enhanced sentence because the prosecutor did not proceed from the commencement of prosecution against the defendant as a repeat offender, I would hold that the procedures applicable under the habitual offender provisions of the Code of Criminal Procedure also apply where the prosecutor seeks an enhanced sentence pursuant to the provisions of the controlled substances article. \u003cspan class=\"fnref\"\u003e142\u003c/span\u003e\n\nI would thus hold that it is not necessary for the defendant to have been charged in the complaint and warrant as a repeat offender or that some evidence respecting the prior conviction be presented at the preliminary examination. It is necessary, where the prosecutor knows of the defendant's prior conviction before trial on the most recent offense, that the prosecutor file a supplemental information charging the defendant as a repeat offender within fourteen days of the arraignment or before trial if the defendant is tried within that fourteen-day period. \u003cspan class=\"fnref\"\u003e143\u003c/span\u003e Where the prosecutor does not learn of the defendant's prior conviction until after the defendant is convicted of the most recent offense, the prosecutor may commence a post-conviction proceeding to seek an enhanced sentence. \u003cspan class=\"fnref\"\u003e144\u003c/span\u003e\n\nI acknowledge that the habitual offender provisions now state that where the defendant's most recent conviction is a \"major controlled substance offense,\" the defendant \"shall be punished as provided by\" the controlled substances article of the Public Health Code. \u003cspan class=\"fnref\"\u003e145\u003c/span\u003e I would construe those provisions as evidencing a legislative intent to assure that the quantity and quality of a defendant's punishment -- as distinguished from the procedures to be utilized in administering that punishment -- are governed by the controlled substances laws and not by the general habitual offender provisions. In this regard, it is significant that the Legislature first \"excluded\" major controlled substance offenses from the habitual offender provisions at the same time it first adopted mandatory minimum terms of imprisonment for controlled substance offenses. \u003cspan class=\"fnref\"\u003e146\u003c/span\u003e In contrast, the sentencing provisions for habitual offenders are discretionary.\n\nThe prosecutor in this case did not file a supplemental information charging Eason as a repeat drug offender within fourteen days of Eason's arraignment. The Court of Appeals concluded that the exceptions to the fourteen-day rule were not applicable. I agree with that determination and would affirm the judgment of the Court of Appeals vacating Eason's sentence and remanding the case for resentencing.\n\n\u003cspan class=\"fn\"\u003e1. Const 1963, art 1, ยง 17. US Const, Ams V, XIV.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. MCL 769.10-769.13; MSA 28.1082-28.1085.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. See People v Fountain, 407 Mich 96; 282 NW2d 168 (1979). In Fountain, the Court noted that the defendant Jones was incorrectly sentenced for the unarmed robbery conviction, and, as an habitual offender, the defendant may be sentenced only under one or the other charge. Id., p 98, n 2. See also, e.g., People v Kraai, 92 Mich App 398; 285 NW2d 309 (1979).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Although there is no express statutory requirement that the habitual offender act be applied to other sentence enhancement provisions, this Court and the Court of Appeals have implied such requirements in both criminal sexual conduct, MCL 750.520f; MSA 28.788(6), and controlled substance cases. See People v Urynowicz, 412 Mich 137; 312 NW2d 625 (1981). See also People v Wright, 405 Mich 832; 275 NW2d 1 (1979), People v Lester, 417 Mich 927; 330 NW2d 854 (1983), and People v Stout, 116 Mich App 726; 323 NW2d 532 (1982).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Indeed, even if the prosecutor overlooked the prior conviction, if the matter came to the trial court's attention through the presentence investigation, the Judge would be authorized to enhance the sentence provided the defendant did not claim lack of notice or contest the factual accuracy thereof.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. United States v Brown, 381 U.S. 437, 458; 85 S Ct 1707; 14 L Ed 2d 484 (1965).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Had the defendant chosen to contest the accuracy of the information in the presentence report and claimed surprise at the hearing, and had the trial Judge not allowed the defendant an opportunity to address the issue, the proper remedy would be to provide an opportunity for the defendant to contest the accuracy of the report which would be accomplished by a remand to the trial court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eHowever, an evidentiary hearing at the sentencing stage is not an adversary trial, and due process is satisfied so long as the information the sentencing Judge considers has sufficient indicia or reliability. United States v Blade, 811 F2d 461, 468 (CA 8, 1987).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Because sentencing is a critical stage of the proceedings, the defendant has a Sixth Amendment right to counsel. Mempa v Rhay, 389 U.S. 128; 88 S Ct 254; 19 L Ed 2d 336 (1967).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The defendant contended he had no knowledge of the prosecutor's intent to seek sentence enhancement and that there was no documentation indicating that the letter notifying the court and him of the intent was ever time stamped as having been received by a clerk of the trial court. In addition, the defendant asserted there was no proof of service in the file indicating that the opposing side was in fact served. The notice of intent was dated September 12, 1985. However, it did not bear the lower court's date stamp.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe defendant was previously convicted of possession of a controlled substance and was sentenced on March 3, 1980.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. At sentencing the Judge noted that the defendant had previously been convicted of second-degree murder in 1979 and for possession of heroin in 1983. The Judge indicated that he intended to deviate from the sentencing guidelines because, given the defendant's background and the jury's Conclusion that the defendant sold drugs, the guidelines which called for a thirty to forty-two month sentence were totally inadequate.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. People v Eason, unpublished opinion per curiam of the Court of Appeals, decided January 22, 1988 (Docket No. 91429).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. In addition, the defendant claimed he was entitled to be sentenced by the Judge who presided over the trial. Judge Talbot presided over part of the trial and sentenced the defendant, and the Court of Appeals found there had not been any error.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The prosecution notes that this is clear when the language used by the Legislature in MCL 333.7413(2); MSA 14.15(7413)(2), \" individual convicted of a second or subsequent offense under this article may be imprisoned for not more than twice the term otherwise authorized or fined an amount not more than twice that otherwise authorized, or both,\" is compared with the language of MCL 769.13; MSA 28.1085 in which the Legislature requires a full trial if the defendant pleads not guilty to the charge of prior felony convictions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Davis v United States, 160 U.S. 469, 493; 16 S Ct 353; 40 L Ed 499 (1985). See In re Winship, supra, pp 363-364. The policy considerations underlying the reasonable doubt standard include the protection of a defendant's liberty interest, and the reduction of the risk of erroneous convictions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSee also note: -- Fourteenth Amendment Due Process Clause -- preponderance standard satisfies due process where state makes visible possession of firearm sentencing factor rather than component of crime, 18 St Mary's L J 543, 545-546 (1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. See, generally, Duncan v Louisiana, 391 U.S. 145; 88 S Ct 1444; 20 L Ed 2d 491 (1968).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Trial by jury of one's peers has long been regarded as a precious and intractable right and the right is expressly reserved in the constitution, the Bill of Rights, and in the state constitution. Note, Enhanced sentencing under North Carolina's DWI statute: Making due process disappear -- Field v Sheriff of Wake County, NC, 23 Wake Forest L R 517, 525 (1988).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Early principles of sentencing due process doctrine were established by the United States Supreme Court in Williams v New York. Weissman, Sentencing due process: Evolving constitutional principles, 18 Wake Forest L R 523, 524 (1982). See also United States v Satterfield, 743 F2d 827, 840 (CA 11, 1984), cert den 471 U.S. 1117 (1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. The holding of Williams, represented a divergence from another seminal sentencing decision decided in the previous year, Townsend v Burke, 334 U.S. 736; 68 S Ct 1252; 92 L Ed 1690 (1948). In Townsend, the United States Supreme Court held the defendant's due process rights were violated when the defendant was sentenced on the basis of false information concerning his criminal record. Id., p 740. While at first blush the holding of Townsend appears to support the idea that the Court favored increased due process safeguards at sentencing, the decision was limited by the Court's emphasis on the total lack of effort with which the sentencing Judge investigated the truth of the defendant's past convictions, three of which were charges that had either been dismissed or resulted in a finding of not guilty.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. See United States v Tucker, 404 U.S. 443; 92 S Ct 589; 30 L Ed 2d 592 (1972); United States v Grayson, 438 U.S. 41; 98 S Ct 2610; 57 L Ed 2d 582 (1978); Roberts v United States, 445 U.S. 552; 100 S Ct 1358; 63 L Ed 2d 622 (1980).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. The United States Supreme Court held information regarding prior convictions obtained in violation of a defendant's right to counsel could not be considered as sentencing factors by the trial Judge at the sentencing hearing. United States v Tucker, pp 443, 447.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. In Grayson, n 19 (supra) , p 44, the trial Judge discounted the defendant's credibility due to the defendant's testimony during trial in which the defendant denied his guilt.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. The sentencing Judge took into account the defendant's persistent refusal to cooperate with law enforcement authorities in identifying other participants in the drug conspiracy. The United States Supreme Court concluded such refusal was highly relevant on the issue of the defendant's prospects for rehabilitation and thus was properly considered at sentencing. Roberts v United States, n 19 (supra) , p 552.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Note, The constitutionality of statutes permitting increased sentences for habitual or dangerous criminals, 89 Harv L R 356, 364 (1975).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Colo Rev Stat Ann, ยง 40-2-32 (1963).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Pursuant to the Colorado sex offenders act, Col Rev Stat Ann, ยงยง 39-19-1 to 10 (1963), if the trial court was of the opinion that a person convicted of specified sex offenses constituted a threat of bodily harm to the public or was an habitual offender and mentally ill, the state could sentence a defendant to commitment in a mental institution as a sexual psychopath for an indefinite period. Id. The only procedural requirements were that the state have the defendant examined and a psychiatric report prepared for the trial Judge prior to sentencing. Id., p 608.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Relying on In re Winship, petitioners contended that visible possession of a firearm was an element of the crimes for which they were being sentenced and thus must be proved beyond a reasonable doubt.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. While it is true that the Court also observed that the sentencing scheme in question did not alter the maximum penalty for the crime, it is clear that the factor here made relevant for sentencing purposes, a prior conviction of a crime, historically has been considered one of the most significant factors bearing on appropriate punishment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. The United States Supreme Court noted:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAny other rule would place a difficult burden on the imposition of a recidivist penalty. Although the fact of prior conviction is within the knowledge of the defendant, often this knowledge does not come home to the prosecutor until after the trial, and in many cases the prior convictions are not discovered until the defendant reaches the penitentiary. [ Id., p 452, n 6.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. The statute requires a separate charge. It does not require an habitual offender charge prior to trial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIf after conviction and either before or after sentence it appears that a person convicted of a felony has previously been convicted of crimes as set forth in section 10, 11, or 12, the prosecuting attorney of the county in which the conviction was had may file a separate or supplemental information in the cause accusing the person of the previous convictions. The court in which the conviction was had shall cause the person to be brought before it and shall inform him of the allegations contained in the information, and of his right to be tried on the allegations, and require the offender to say whether he is the same person as charged in the information or not. If the offender says he is not the same person, or remains silent, the court shall enter a plea of not guilty, and a jury of 12 jurors shall be impaneled from the petit jurors serving at the then or a following term of court to determine the issues raised by the information and plea. The accused may waive trial by jury in the manner provided by this act. The usual practice in the trial of criminal actions shall be followed in the impaneling of a jury and the trial of the issue. If the accused pleads guilty to the information or if the jury returns a verdict of guilty, the court may sentence the offender to the punishment prescribed in section 10, 11, or 12, and shall vacate the previous sentence deducting from the new sentence all time actually served on the vacated sentence if required. [MCL 769.13; MSA 28.1085.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWhen the Court has considered a statutory scheme incomplete, it has imposed additional requirements in accordance with the object or intent of the statute. While that solution is more appropriately provided by the Legislature, it has been utilized by this Court when as in this situation it was believed necessary. Schwartz, Multiple punishment for the \"same offense\": Michigan grapples with the definitional problem, 25 Wayne L R 825, 856 (1979).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. In circumstances presented by this case, the enhanced sentencing statutes\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003ehave no relation to the circumstances of the wrongdoing constituting the most recent offense but rather to something which is wholly unrelated thereto. Further, they do not relate to determining what the accused has done, but rather to what the state has previously determined that he has done. And that previous determination must have been a formal, judicial determination of guilt ; and hence one as to which the full measure of constitutional protections were available. [See Buckley v Butler, 825 F2d 895, 903 (CA 5, 1987). Emphasis in the original.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. By contrast, when a prior conviction is an element of the charge, the earlier offense must be charged in the information when, for example, an individual charged for a second or subsequent offense of driving under the influence of liquor is found guilty of a felony. While the offense is a misdemeanor, a third or subsequent offender can be charged with a felony. MCL 257.625; MSA 9.2375. However, the defendant must be charged as a second, or subsequent offender, which is an element of the underlying felony charge.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThus, it appears that the better construction of the cases discussed in the Dissent is that the Court construed the legislation in question as necessarily requiring a separate information filed to provide the opportunity for a preliminary examination for the defendant and to provide the circuit court with jurisdiction.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eFurther, the question before the Court is one of legislative intent, and we find it highly doubtful that the Legislature was deemed to be aware of decisions of this Court and relied on liquor law cases from the mid-1920's to require separate charges in the present cases, which involve sentence enhancement and not a separate felony charge as found in the liquor law cases cited by the Dissent.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. The Third, Fourth, Fifth, Sixth, Eighth, Ninth, Tenth, and District of Columbia Circuit Courts have held that the Armed Career Criminal Act, 18 USC App 1202 did not create a separate offense mandating specific pleading or proof of recidivism that triggers enhanced sentencing. United States v Hawkins, 811 F2d 210 (CA 3, 1987); Field v Sheriff of Wake Co, NC, 831 F2d 530 (CA 4, 1987); United States v Affleck, 861 F2d 97 (CA 5, 1988); United States v Brewer, 853 F2d 1319 (CA 6, 1988); United States v Jackson, 262 U.S. App DC 294; 824 F2d 21 (1987); United States v Rush, 840 F2d 574 (CA 8, 1988) (en banc); United States v West, 826 F2d 909 (CA 9, 1987); United States v Gregg, 803 F2d 568 (CA 10, 1986), cert den 480 U.S. 920 (1987).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. The penalties for possession of controlled substances in amounts of fifty grams or more, but less than 650 grams, are addressed in MCL 333.7401(2)(a)(ii) or (iii); MSA 14.15(7401)(2)(a)(ii) or (iii).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. The controlled substance act, 1971 PA 196, MCL 335.348; MSA 18.1070(48) provided:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(1) Any person convicted of a second or subsequent offense under this act may be imprisoned for a term up to twice the term otherwise authorized or fined an amount up to twice that otherwise authorized, or both.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(2) For purposes of this section, an offense is considered a second or subsequent offense, if, prior to his conviction of the offense, the offender has at any time been convicted under this act or under any statute of the United States or of any state relating to narcotic drugs, marihuana, depressant, stimulant or hallucinogenic drugs.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe act authorized the sentencing Judge to enhance the punishment for certain individuals. If a defendant was a second, or subsequent drug offender, the statute did not contemplate a separate proceeding.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn People v McFadden, 73 Mich App 232, 234; 251 NW2d 297 (1977), the defendant argued that the procedural requirements of the habitual offender act should be applied to this section of the controlled substance act. The Court held there was no express statutory requirement that the habitual offender act be applied to this provision and, further, the fact that the Legislature did not write the procedural requirements of the earlier habitual offender act into the controlled substance provision indicated no intent to provide such safeguards. Id., pp 234-235.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eHowever, in 1979 this Court remanded a case for resentencing on the basis that the trial court improperly imposed a double sentence pursuant to MCL 335.348; MSA 18.1070(48). People v Wright, supra. The Court again cited Oyler v Boles, supra, in which the United States Supreme Court held that due process did not require notice prior to the trial that an habitual criminal proceeding would follow, but did require that the defendant have notice and a reasonable opportunity to be heard on the recidivist charge.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. A panel of the Court of Appeals recognized and addressed this issue in People v Bailey, 103 Mich App 619; 302 NW2d 249 (1981). The Court noted that the defendant who claimed the trial court erred in sentencing him to a mandatory five-year minimum sentence pursuant to MCL 750.520f; MSA 28.788(6), despite the fact that no supplemental information was filed, was incorrect. Id., p 627. The Court held that there was no such procedural requirement under the act and declined to infer such a requirement.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. The Court stated:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn People v Wright, supra, the Court examined the sentence enhancement provision of the Controlled Substances Act, MCL 335.348; MSA 18.1070(48). The defendant had been charged only with delivery of cocaine and conspiracy to deliver cocaine, but he was sentenced as a second offender to twice the term of imprisonment authorized. The Court said that doubling the sentence was improper and cited Oyler v Boles, supra, in which the United States Supreme Court required, as a matter of due process, that a defendant receive reasonable notice and an opportunity to be heard on a recidivist charge. [ Urynowicz, supra, p 143.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. Subsequent to that decision, a panel of the Court of Appeals found that Urynowicz overruled, sub silentio, the decision in People v McFadden, supra, that the habitual offender act did not have any application to the sentence-enhancement provision of the former controlled substance act. Stout, supra. The Court of Appeals vacated the defendant's sentence which had been doubled because it was the defendant's second conviction of a drug offense and stated:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn our view the quoted language from Urynowicz makes clear that a subsequent drug offender's sentence may not be enhanced unless the prior drug offense is charged in either the information or a supplemental information and the prosecutor proves that the defendant is a recidivist drug offender. [ Stout, supra, p 735.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eLikewise, this Court remanded a case for resentencing which posed the same issue as Wright, supra, and noted that a drug offender's sentence could not be enhanced unless the prosecutor complied with the procedures under the habitual offender act:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003ePursuant to GCR 1963, 853.2(4), in lieu of granting leave to appeal, the defendant's sentences are vacated and the matter is remanded on March 21, 1983, to the Genesee Circuit Court for resentencing. The defendant's sentence may not be enhanced pursuant to MCL 333.7413; MSA 14.15(7413) because he was not charged with being a subsequent offender. MCL 769.10, 769.13; MSA 28.1082, 28.1085; People v Urynowicz, 412 Mich 137 (1981); People v Stout, 116 Mich App 726, 734-735 (1982). [ People v Lester, supra.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. The prosecutor does not contend the defendant waived the right to challenge the accuracy of the information contained in the report by failing to raise the issue at the sentencing hearing. See MCR 6.411(B).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. Under the Criminal Rules of Procedure, MCR 6.411(B) provides that the court must permit the prosecutor, the defendant's lawyer, and the defendant to review the presentence report at a reasonable time before the day of sentencing.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIf the defendant challenges the information, under MCR 6.411(D)(3), the court must make a finding with respect to the challenge or determine that a finding is unnecessary because it will not take the challenged information into account when sentencing the defendant.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. The sentencing hearing took place on Friday, January 31, 1986, and at this time the court inquired whether counsel had had an opportunity to go over all the presentence report and guidelines with the defendant. Counsel answered in the affirmative.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eCONCURRING FOOTNOTES\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1 US Const, Am XIV; Const 1963, art 1, ยง 17.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2 See Oyler v Boles, 368 U.S. 448, 454; 82 S Ct 501; 7 L Ed 2d 446 (1962); State v Cooper, 744 SW2d 447, 449-450 (Mo App, 1987).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1 MCL 333.7401(2)(a)(iv); MSA 14.15(7401)(2)(a)(iv).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2 The sentence enhancement provision of the controlled substances article of the Public Health Code, provided in pertinent part:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eindividual convicted of a second or subsequent offense under this article may be imprisoned for a term not more than twice the term otherwise authorized or fined an amount not more than twice that otherwise authorized, or both. [MCL 333.7413(2); MSA 14.15(7413)(2).]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWhen Eason was sentenced, a person who was convicted of possession with intent to deliver less than 50 grams of cocaine \"may be imprisoned for not more than 20 years, or fined not more than $25,000.00, or both.\" 1978 PA 368, art 7, part 74, ยง 7401(2)(a)(iv).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3 MCL 769.10-769.13; MSA 28.1082-28.1085.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWhen the prosecutor seeks sentence enhancement under the habitual offender provisions, the general rule is that he must file a supplemental information charging the defendant as an habitual offender within fourteen days of the arraignment or before trial if the defendant is tried within that fourteen-day period. People v Shelton, 412 Mich 565, 566; 315 NW2d 537 (1982) (per curiam). If the prosecutor does not learn of the defendant's prior felony conviction until after the defendant's conviction of the most recent offense, the prosecutor may institute post-conviction proceedings to sentence the defendant as an habitual offender. See MCL 769.13; MSA 28.1085. See also People v Hatt, 384 Mich 302, 309; 181 NW2d 912 (1970), and Shelton, p 569. The only exception to the fourteen-day rule is where the delay in filing the supplemental information is caused by the need to verify an out-of-state conviction based on a rap sheet. See People v Hendrick, 398 Mich 410; 247 NW2d 840 (1976).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSee also MCR 6.112(C).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4 The Court of Appeals also concluded that the prosecutor's failure to timely file a supplemental information was not caused by the need to verify an out-of-state conviction or by a failure to learn of Eason's prior conviction until after the trial on the charged offense.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5 People v Eason, unpublished opinion per curiam of the Court of Appeals, decided January 22, 1988, pp 5-6 (Docket No. 91429).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6 There is one reported decision involving the sentence enhancement provision for a second or subsequent conviction of unlawful possession or control of a narcotic drug under the Narcotic Drugs Act, 1952 PA 266, 1970 CL 335.153. That statute also did not expressly require the prosecutor to charge the defendant as a repeat offender when seeking an enhanced sentence. In People v Griffin, 39 Mich App 464, 466; 198 NW2d 21 (1972), the information charged the defendant as a third offender.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7 1971 PA 196, MCL 335.341(1)(b); MSA 18.1070(41)(1)(b). The maximum sentence was imprisonment for seven years and a fine of $5,000.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8 MCL 750.157a(a); MSA 28.354(1)(a). The maximum sentence for conspiracy is the maximum sentence for the underlying offense plus an additional fine of not more than $10,000 at the discretion of the trial court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9 At his arraignment, however, Wright was told that the maximum penalty for the charged offenses was imprisonment for seven years and a fine of $5,000, plus an additional fine of not more than $10,000 at the discretion of the trial court. These are the maximum sentences for a first offense.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10 The Court of Appeals had affirmed Wright's sentence on the basis of People v McFadden, 73 Mich App 232; 251 NW2d 297 (1977). There, the Court of Appeals held that a procedure set forth in the habitual offender provisions of the Code of Criminal Procedure, MCL 769.13; MSA 28.1085, did not apply to sentence enhancement under the Controlled Substances Act. But see People v Stout, 116 Mich App 726; 323 NW2d 532 (1982).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11 See n 9.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12 Oyler, supra, p 452 (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAt the sentencing hearing in Wright, the trial court elicited an acknowledgment from Wright that he had previously pled guilty to a drug-related offense. The court then informed Wright, apparently for the first time, that he would be sentenced pursuant to the repeat offender provision of the Controlled Substances Act:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAny person convicted of a second or subsequent offense under this act may be imprisoned for a term up to twice the term otherwise authorized or fined an amount up to twice that otherwise authorized, or both. [1971 PA 196, MCL 335.348(1); MSA 18.1070(48)(1).]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eOyler was notified before the sentencing hearing that the prosecutor was filing a supplemental information charging him as an habitual offender. Wright received no notification before the sentencing hearing was under way. Wright did not, however, as noted above, predicate his due process claim on the prosecutor's failure to provide earlier notice.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13 See ante, p 249, n 34.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe majority also suggests that the reference to Wright in People v Urynowicz, 412 Mich 137, 143; 312 NW2d 625 (1981) (per curiam), is further evidence of this Court's misunderstanding of the United States Supreme Court's decisions under the Due Process Clause. See ante, p 250. That assertion is discussed in the text accompanying ns 64-69.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14 The Court's order refers generally to improper sentencing. It does not mention the failure to give pretrial notice of the possibility of sentence enhancement as the basis for the Conclusion that the sentence was improper. The notice in Wright may well, however, have been inadequate under Oyler. See n 12.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15 1978 PA 368, art 7, MCL 333.7101 et seq.; MSA 14.15(7101) et seq.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16 1978 PA 368, MCL 333.7403(2)(a)(iv); MSA 14.15(7403)(2)(a)(iv).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17 1978 PA 368, MCL 333.7403(2)(d); MSA 14.15(7403)(2)(d).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18 1978 PA 77, MCL 769.10 et seq.; MSA 28.1082 et seq.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eTwo of the prior convictions on which the supplemental information was based were drug offenses.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19 individual convicted of a second or subsequent offense under this article may be imprisoned for a term not more than twice the term otherwise authorized or fined an amount not more than twice that otherwise authorized, or both. [1978 PA 368, MCL 333.7413(2); MSA 14.15(7413)(2).]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20 In Urynowicz, the Court held that an enhanced sentence for a second or subsequent conviction of criminal sexual conduct could not be imposed unless the defendant was charged as a repeat offender. That case is discussed more fully in the text accompanying ns 57-69.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21 The majority cites People v McFadden, n 10 (supra) . See ante, p 249, n 34. There, the Court of Appeals said that the procedures set forth in the habitual offender provisions of the Code of Criminal Procedure did not apply to sentence enhancement under the former Controlled Substances Act. The Court of Appeals in Stout concluded that McFadden was overruled by this Court's decision in Urynowicz. See Stout, supra, p 734.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22 The Court's orders in Lester and Cobb did not cite the United States Supreme Court's decision in Oyler, but relied instead on decisions of this Court and the Court of Appeals. In Lester, the Court cited Urynowicz and Stout. In Cobb, the Court cited only Urynowicz.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23 See n 3.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24 When Ancksornby was decided, the sentencing provision of the liquor law read:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAny person, who . . . shall violate any of the provisions of this act . . . shall be deemed guilty of a felony, and upon conviction therof be sentenced to pay a fine of not more than one thousand dollars and the costs of prosecution, or to imprisonment in the State Prison, Michigan Reformatory, or the Detroit House of Correction for a period of not less than six months nor more than one year, or by imprisonment in the county jail for not less than thirty days, nor more than one year, or by both fine and imprisonment in the discretion of the court, and for every second and subsequent offense, so committed, . . . he shall, upon conviction thereof, be sentenced to imprisonment in any penal institution of this State for a term of not less than six months nor more than two years, and in addition thereto the court may impose a fine not to exceed one thousand dollars. [1919 PA (Ex Sess) 3.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25 The brief of plaintiff-appellee stated:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWhere the punishment provided by statute for a second offense is greater than that for a first offense, the authorities are unanimous that the information or indictment should specifically aver that the crime charged is a second offense.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe charge was of a first offense. The sentence was greater than that allowed by law for a first offense. We concede, therefore, that the case should be reversed, and the cause remanded to the Superior Court for a proper sentence . . . . [Emphasis added.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26 Id., pp 100-101. In support of its holding, the Court cited, inter alia, three Michigan decisions: People v Buck, 109 Mich 687; 67 NW 982 (1896), People v Butler, 122 Mich 35; 80 NW 883 (1899), and People v Campbell, 173 Mich 381; 139 NW 24 (1912).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27 Id., pp 106-107.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28 Ante, p 247, n 31.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29 See ante, p 247, n 31 (\"we find it highly doubtful that the Legislature . . . relied on liquor law cases from the mid-1920's to require separate charges in the present cases, which involve sentence enhancement and not a separate felony charge as found in the liquor law cases cited by the Dissent\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30 A preliminary examination was then required whenever the complaint and warrant alleged the commission of an offense \"not cognizable by a Justice of the peace.\" 1846 Rev Stat tit XXXI, ch 163, ยง 13, 1915 CL 15677. (A preliminary examination is now required whenever the complaint and warrant allege the commission of a \"felony.\" See 1974 PA 63, MCL 766.4; MSA 28.922.) A Justice of the peace had jurisdiction over certain statutorily enumerated offenses not here relevant and over \"all other offenses punishable by fine not exceeding one hundred dollars, or punishable by imprisonment in the county jail not exceeding three months . . . .\" 1899 PA 189, 1915 CL 15769. When the Court decided Ancksornby, McDonald, and Van Vorce, a first offense under the liquor law was punishable by a fine of one thousand dollars or imprisonment in a state or county facility for one year. See 1919 PA (Ex Sess) 3 (quoted in n 24).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31 See 1917 PA 338, ยง 51.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32 1919 PA 53, amending 1917 PA 338. The penalty provision was further amended by 1919 PA (Ex Sess) 3 (quoted in n 24).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33 See MCL 766.4; MSA 28.922.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34 See MCL 600.8311(a); MSA 27A.8311(a).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35 Although a \"misdemeanor\" when the liquor law was initially enacted, a first offense was not cognizable by a Justice of the peace--and the defendant was entitled to a preliminary examination--because the maximum penalty for a first offense was a fine of two hundred dollars or imprisonment in the county jail for six months. 1917 PA 338, ยง 51. See n 31 and the accompanying text.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36 At the time, the applicable sentencing provision read:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eEvery person who is convicted of a violation of section 3 of this act relating to . . . driving or permitting driving while under the influence of intoxicating liquor . . . shall be punished by imprisonment in the county jail or Detroit house of correction for not more than 90 days or by a fine of not less than $50.00 nor more than $100.00 or both such fine and imprisonment in the discretion of the court, together with costs of the prosecution. On a second or subsequent conviction he shall be guilty of a misdemeanor and punished by imprisonment for not more than 1 year, and, in the discretion of the court, a fine of not more than $1,000.00. [1939 PA 318.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37 The Attorney General's opinion was based both on the effect of the availability of an enhanced sentence on the respective jurisdiction of the circuit court and Justice of the peace and on established principles of the :\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIf the original complaint did not contain an allegation charging a second offense then the offense would be cognizable by a Justice of the peace and not a circuit court misdemeanor.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIt has been generally held that, in order to subject the accused to the enhanced punishment for a second or subsequent offense, or as an habitual criminal, it is necessary to allege in the indictment the fact of a prior conviction or convictions. [ Id. Citations omitted.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe Attorney General cited, inter alia, Ancksornby and McDonald, supra, and Buck, Butler, and Campbell, n 26.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38 With respect to first and second offenses, the language of the sentencing provision, 1958 PA 113, MCL 257.625; MSA 9.2325, was substantially identical to the language of the statutory predecessor, 1939 PA 318 (quoted in n 36.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39 Id., p 458\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe Court of Appeals also held that the prosecutor would not be allowed to introduce evidence of Bosca's prior conviction unless the jury first returned a guilty verdict on the charged offense.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40 See, for example, People v Leonowicz, 134 Mich App 152, 155; 350 NW2d 770 (1984), and People v Hutchinson, 35 Mich App 128, 131; 192 NW2d 395 (1971).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. See People v Urynowicz, supra, pp 143-144 (\"[The Court of Appeals] captured the essence of this Court's earlier decisions when [it stated] in Bosca that 'before a defendant's punishment for the current offense can be enlarged, the earlier conviction must be charged and proved'\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. Ante, pp 246-247.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. The information read in pertinent part:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e, the said Henry Mellor, having been heretofore, to-wit, on the 21st day of January, A.D. 1935, convicted in the Recorder's Court of the City of Detroit, Traffic and Ordinance Division, of the offense of operating a motor vehicle while under the influence of intoxicating liquor, and the offense heretofore set forth constitutes a second or subsequent offense; and the said Henry Mellor is so herein charged as a second or subsequent offender. [ People v Mellor, Record on Appeal, p 3.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. The transcript of the sentencing hearing read in pertinent part:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe Court: This is a case though of second offense. Sometimes the court feels that if the first offense is not too serious it entitles him to some consideration, but hardly on the second offense. One hundred dollars costs and ninety days and license revoked for one year. [Record on Appeal, n 43 (supra) , p 39.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. See People v Mellor, Brief for Henry Mellor, Appellant, pp 15-16.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. Nor do we think the information is faulty because it does not contain two counts. The prior offense is not an element of the instant offense. It merely applies to punishment after conviction. [ Mellor, supra, p 540.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. To the extent the majority suggests that Mellor supports its holding that the prosecutor is not required to charge the defendant as a repeat offender (ante, pp 246-247), it is clearly mistaken. See Bosca, supra, pp 457-458, where the Court of Appeals explained:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe [ Mellor ] court's statements . . . that the \"former conviction was merely an additional fact or circumstance to be considered in imposing a severer penalty for the second conviction\" and that \"the prior offense is not an element of the instant offense,\" cannot properly be read as negating the need both to charge and prove . . . the earlier conviction before the punishment for the currently charged offense can be enhanced. The currently charged offense can in truth be charged and proved without reference to the earlier conviction. In that sense the earlier conviction is not, as said in Mellor, an element of the \"instant [or current] offense.\" But, nevertheless, before a defendant's punishment for the current offense can be enlarged, the earlier conviction must be charged and proved.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThis Court approved the Bosca Court's analysis in People v Urynowicz, supra, pp 143-144 (quoted in text accompanying n 63).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. By contrast, when a prior conviction is an element of the charge, the earlier offense must be charged in the information when, for example, an individual charged for a second or subsequent offense of driving under the influence of liquor is found guilty of a felony. While the offense is a misdemeanor, a third or subsequent offender can be charged with a felony. MCL 257.625; MSA 9.2375. However, the defendant must be charged as a second, or subsequent offender, which is an element of the underlying felony charge. [ Ante, p 247, n 31.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. See 1939 PA 318 (quoted in n 36).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. See 1958 PA 113, MCL 257.625; MSA 9.2325.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. See Bosca, supra, p 456.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. Even if the subsequent offense had been a felony, the majority's assertion that a prior conviction is an \"element\" of the current offense does not distinguish drunk driving. In drunk driving and in the instant case, proof of the prior conviction is not necessary for conviction of the current offense; the prior conviction is relevant only with respect to the sentence for the most recent offense. To the extent the prior conviction is an \"element\" of the current offense, the prior conviction is no more an \"element\" when it constitutes a misdemeanor than when it constitutes a felony.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. Ante, p 247, n 31.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. See n 37.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. The Attorney General also recognized the importance of notifying the defendant that he was being charged as a repeat offender. See n 37.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. See Bosca, supra, p 458, n 3, where the Court of Appeals explained:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWithout such notice a defendant would not know whether the punishment which he faces upon a conviction is that which may be meted out to first offenders (90 days and $100) or second offenders (1 year and $1,000). A defendant needs this information, not only to decide whether it is in his interest to plead guilty but also in deciding whether to engage an attorney and the vigor of the defense which he may wish to put forth.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57. 1974 PA 266, MCL 750.520b(1)(a); MSA 28.788(2)(1)(a). First-degree criminal sexual conduct was a \"felony punishable by imprisonment in the state prison for life or for any term of years.\" 1974 PA 266, MCL 750.520b(2); MSA 28.788(2)(2).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58. 1978 PA 77, MCL 769.10(1)(b); MSA 28.1082(1)(b).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59. Under 1974 PA 266, MCL 750.520f(1); MSA 28.788(6)(1), where the defendant has a previous conviction of a sexual offense, the sentence for the second or subsequent offense \"shall provide for a mandatory minimum sentence of at least 5 years.\" See also 1974 PA 266, MCL 750.520f(2); MSA 28.788(6)(2) (gross indecency is included within the category of prior sexual offenses requiring a five-year minimum sentence).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e60. Before accepting Urynowicz' guilty plea, the trial court was required to inform Urynowicz of \"the mandatory minimum prison sentence, if any, for the offense.\" GCR 1963, 785.7(1)(d).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e61. Although the trial court was not obligated to impose a five-year sentence, it could nonetheless impose such a sentence because a first conviction of first-degree criminal sexual conduct was punishable by life imprisonment. See n 57.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e62. Id., pp 140-141.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e63. The majority cites People v Bailey, 103 Mich App 619; 302 NW2d 924 (1981) (per curiam). See ante, p 249, n 35. There, the Court of Appeals rejected Bailey's argument that because he had not been charged as a repeat offender, the trial court's imposition of a five-year minimum sentence was improper.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe holding in Bailey is in direct conflict with this Court's subsequent holding in Urynowicz.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e64. Ante, p 250.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e65. In Urynowicz, supra, p 143, the Court said:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn People v Wright, 405 Mich 832 (1979), the Court examined the sentence enhancement provision of the Controlled Substances Act. MCL 335.348; MSA 18.1070(48). The defendant had been charged only with delivery of cocaine and conspiracy to deliver cocaine, but he was sentenced as a second offender to twice the term of imprisonment authorized. The Court said that doubling the sentence was improper and cited Oyler v Boles, 368 U.S. 448; 82 S Ct 501; 7 L Ed 2d 446 (1962), in which the United States Supreme Court required, as a matter of due process, that a defendant receive reasonable notice and an opportunity to be heard on a recidivist charge.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e66. Ante, p 250.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e67. See ยง (I)(A).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e68. Compare Urynowicz, supra, p 143 (\"The [ Wright ] Court . . . cited Oyler v Boles in which the United States Supreme Court required, as a matter of due process, that a defendant receive reasonable notice and an opportunity to be heard on a recidivist charge\") (citation omitted), with Oyler, supra, p 452 (\"a defendant must receive reasonable notice and an opportunity to be heard relative to the recidivist charge even if due process does not require that notice be given prior to the trial on the substantive offense\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e69. People v McDonald (see ns 26-27 and the accompanying text), People v Butler (see n 26), People v Mellor (see ns 42-47 and the accompanying text), People v Miller, 357 Mich 400; 98 NW2d 524 (1959), People v Bosca (see ns 38-41 and the accompanying text), and People v Wright (see ns 7-14 and the accompanying text).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e70. See Evans v State, 150 Ind 651, 653-654; 50 NE 820 (1898):\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe doctrine that when a statute imposes a greater punishment upon second and subsequent convictions of an offense, that the former conviction must be alleged in the indictment and proved at the trial, or the same can only be punished as a first offense, is sustained by the great weight of the authorities.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e71. In State v Edinger, 331 NW2d 553, 554 (ND, 1983), the Supreme Court of North Dakota observed:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe weight of authority supports the view that, with no statutes to the contrary, in order to subject the defendant to an enhanced punishment for a second or subsequent offense, it is necessary to allege the prior conviction in the complaint or information.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAccord State v Ruble, 77 ND 79, 80; 40 NW2d 794 (1950), State v Cameron, 126 Vt 244, 246-247; 227 A2d 276 (1967), In re Harris, 80 Cal App 2d 173, 176-177; 181 P2d 433 (1947), and Haffke v State, 149 Neb 83, 88-89; 30 NW2d 462 (1948).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn People v Ratner, 67 Cal App 2d Supp 902, 903-904; 153 P2d 790 (1944), the court, quoting Massey v United States, 281 F 293, 297 (CA 8, 1922), noted:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"It is the established rule, under such statutes, unless the statute designates a different mode of procedure, that, if the prosecutor desires to invoke the severer punishment provided as to second or subsequent offenders, the indictment or information must allege the fact of prior conviction, and the allegation of such conviction must be proved in the trial to the jury.\" Some forty-five authorities were cited in support of the statement and more may be found in [ State v Scheminisky, 31 Idaho 504, 507-508; 174 P 611 (1918), and the annotations in 58 ALR 64; 82 ALR 366; 116 ALR 229; 132 ALR 107; and 139 ALR 689].\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e72. LSA-RS 40:966.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e73. In accord State v Keys, 328 So 2d 154 (La, 1976); State v Cannon, 409 So 2d 568 (La, 1982); State v Jenkins, 451 So 2d 1142 (La App, 1984); State v Franklin, 449 So 2d 63 (La App, 1984).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e74. State v Murray, 357 So 2d 1121, 1124 (La, 1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e75. Included among those cases was People v Brown, 253 Mich 537; 235 NW 245 (1931). In Brown, this Court held that the charge of an habitual offender must include the fact of his previous convictions. The statute at issue was an habitual offender statute (providing increased penalties for subsequent felonies) rather than a sentence enhancement provision (providing increased penalties for subsequent violations of a particular statute).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe citation in Sparkman, a sentence enhancement case, of Brown, an habitual offender case, bespeaks the court's view (a view shared by many other states) that there is no distinction between the procedures applicable under these two statutory patterns.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e76. State v Fernandez, 156 So 2d 400 (Fla App, 1963), is in accord.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThis case is particularly noteworthy for its rejection of the argument, made by the majority in the instant case, that charging the previous conviction is only required where the sentence enhancement provision changes the nature of the crime from a misdemeanor to a felony. Explained the court:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAdmittedly the statute involved in the instant case differs from those statutes discussed in [ State v Curtis, 152 So 2d 754 (1963)] in that under the Narcotic Drug Law both first and second offenses are felonies while under the lottery laws a second offense changes the character of the crime from misdemeanor to felony. However, the fact that the allegation of a previous conviction was determinative of the proper jurisdiction in Curtis and is not so significant in this case does not preclude application of the rationale of the Curtis case to the instant case. [ Id., p 406.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eOther cases where courts have required that earlier convictions be charged under sentence enhancement provisions of the Uniform Drug Act include: People v Hightower, 414 Ill 537; 112 NE2d 126 (1953), cert den 346 U.S. 875 (1953), app den 346 U.S. 882 (1953), and State v Holloway, 144 Conn 295; 130 A2d 562 (1957).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSee also People v Breitweiser, 44 Ill App 3d 284; 357 NE2d 890 (1976), where the court required that a defendant, subject to higher penalties under a sentence enhancement provision of the Cannabis Control Act, have been charged with his previous convictions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e77. In accord Heinze v People, 127 Colo 54; 253 P2d 596 (1953); Nail v State, 225 Ark 495; 283 SW2d 683 (1955); State v Couture, 151 Conn 213; 196 A2d 113 (1963); Buchanan v State ex rel Morris, 167 So 2d 43 (Fla App, 1964); In re Sobieski, 246 Ind 222; 204 NE2d 353 (1965). See also Buchta v State, 234 Ind 295; 126 NE2d 151 (1955), State v Waller, 167 Ind App 231; 339 NE2d 61 (1975), State v Montgomery, 250 La 326; 195 So 2d 285 (1967), State v Gerald, 250 La 759; 199 So 2d 536 (1967), State v Neal, 347 So 2d 1139 (La, 1977), State v Bass, 254 La 83; 222 So 2d 865 (1969), and Smith v Dep't of Public Safety, 254 So 2d 515 (La App, 1971).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e78. In accord Norwood v Florida, 80 Fla 613; 86 So 506 (1920); Warren v State, 74 So 2d 688 (Fla, 1954).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e79. See Alford v Commonwealth, 216 Ky 405; 287 SW 937 (1926); Blanton v Commonwealth, 210 Ky 571; 276 SW 533 (1925); English v Commonwealth, 216 Ky 608; 288 SW 320 (1926); Beshears v Commonwealth, 239 Ky 554; 39 SW2d 995 (1931); Dunnington v Commonwealth, 231 Ky 327; 21 SW2d 471 (1929).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSee also State v Briggs, 94 Kan 92; 145 P 866 (1915), app dis 242 U.S. 615 (1916), where the Supreme Court of Kansas applied the general rule to the recidivist provision in the Kansas Prohibitory Liquor Law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e80. Ga Laws 1966, p 557, ยง 26-2603(C)(1).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e81. In accord Elrod v Caldwell, 232 Ga 876; 209 SE2d 207 (1974), and Riggins v Stynchcombe, 231 Ga 589; 203 SE2d 208 (1974). The court in this case posed and answered in the negative the following question: \"But is it sufficient to indict an accused for one offense, convict him of the one offense charged, and then impose punishment at the second phase of the trial pursuant to recidivist statutes which permit maximum punishment greater than the maximum punishment for the individual offense for which the accused was indicted and convicted?\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e82. People v Weaver, 41 Ill 2d 434; 243 NE2d 245 (1968), cert den 395 U.S. 959 (1969); People v Ferrara, 11 Ill App 2d 472; 250 NE2d 530 (1969), cert den 398 U.S. 927 (1970); People v Ramey, 22 Ill App 3d 916; 317 NE2d 143 (1974); People v Martin, 97 Ill App 3d 704, 705; 423 NE2d 493 (1981).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSee also Evans v State, n 70 (supra) ; Pickelsimer v State, 440 So 2d 47 (Fla App, 1983).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e83. See Hettle v State, 144 Ark 564, 567; 222 SW 1066 (1920).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e84. See Luna v Krutka, 142 Colo 55, 56-57; 349 P2d 565 (1960).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e85. See State v Curtis, 152 So 2d 754, 755 (Fla App, 1963).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e86. See People v Ostrand, 35 Ill 2d 520; 221 NE2d 499 (1966), People v Owens, 37 Ill 2d 131; 225 NE2d 15 (1967), People v Dixon, 46 Ill 2d 502; 263 NE2d 876 (1970), and Morgan v Commonwealth, 170 Ky 400; 186 SW 132 (1916).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e87. See People v Boykin, 298 Ill 11, 21; 131 NE 133 (1921).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e88. See State v Morgan, 389 So 2d 364 (La, 1980).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e89. See State v Salyer, 196 Kan 32; 410 P2d 248 (1966).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e90. Although the precise issue in Haffke centered on the fact-finding role of the jury with respect to the allegation of prior conviction, the procedures adopted by the court included a requirement that the information contain an allegation of prior conviction. See id. at 94.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e91. Neb Rev Stat, ยง 39-727 (1943).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e92. 1947 Laws, ch 105, ยง 1, p 294. The revised statute provided, inter alia:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWhere punishment of an accused as an habitual criminal is sought, the facts with reference thereto must be charged in the indictment or information which contains the charge of the felony upon which the accused is prosecuted, but the fact that the accused is charged with being an habitual criminal shall not be an issue upon the trial of the felony charged and shall not in any manner be disclosed to the jury.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e93. In McClay, the Supreme Judicial Court of Maine held that the complaint must allege a defendant's prior convictions to support an enhanced sentence for a second or subsequent conviction of driving under the influence of alcohol.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe applicable statute, Me Rev Stat, ch 19, ยง 121 (1944), was silent concerning procedural matters. See 146 Me 106-107 (quoting the text of the statute). At the time McClay was decided, Maine's habitual offender act conditioned the imposition of an enhanced sentence on an allegation of prior conviction. See Jenness v State, 144 Me 40; 64 A2d 184 (1949) (discussing the legislative history of the habitual offender act).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e94. In Hightower, the defendant was charged with dispensing narcotic drugs in violation of ยง 23 of the Uniform Narcotic Drug Act. Ill Rev Stat, ch 38, paras. 192.1-192.28 (1951). Also included in the indictment was a charge that the defendant had a prior conviction.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSection 23 of the Uniform Narcotic Drug Act provided for a severer punishment on subsequent offenses and did not specify whether a defendant's previous convictions must be set forth in the indictment. The defendant objected to the inclusion of his prior convictions in the information. The court disagreed:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWe do not agree with defendant's contention that his prior conviction should have been deleted from the indictment. It is true that the Habitual Criminal Act of this State specifically provides that the fact of prior conviction and sentence in the penitentiary must be pleaded in the indictment for the present offense and that the Illinois Uniform Narcotic Act contains no such provision. However, we are of the opinion that it is necessary to plead this fact to justify a conviction and sentence under the aggravated penalty clause. [414 Ill 544-545.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e95. In Ratner, the court held that the defendant must be charged as a repeat offender to warrant imposition of an enhanced sentence for a second conviction of running a red light.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe applicable statute, Cal Vehicle Code, ยง 762 (1935), did not specify whether it was necessary to allege the defendant's prior conviction when seeking the more severe penalty. See 153 P2d 790. At the time Ratner was decided, the California Penal Code expressly conditioned the availability of an enhanced sentence for habitual offenders on an allegation of prior conviction. See In re Harris, n 71 (supra) , pp 434-435 (quoting Cal Penal Code, ยง 3024).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e96. In Waller, the court held that the defendant's former conviction for driving under the influence had to be alleged and proved if the defendant was to be subject to more serious consequences as a result of his recidivism. In a footnote, the court said:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAlthough [ Barr v State, 205 Ind 481; 187 NE 259 (1933)] notes that the habitual criminal statutes (then Ind Ann Stat ยงยง 2339 and 2340 [Burns 1926], now ยงยง 9-2207 and 9-2208) specifically require the prior convictions to be pleaded and proved, it cites and quotes opinions by English and American courts (including Evans v State, 150 Ind 651, 50 NE 820 [1898]) which require it regardless of statute whenever a greater penalty is imposed for a subsequent conviction. [167 Ind App 236, n 3.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e97. The habitual offender provisions were first enacted as part of the Code of Criminal Procedure in 1927. Michigan essentially adopted the language of New York's habitual offender statute.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe New York statute, authored by State Senator Caleb Baumes, served as a model for recidivist legislation enacted across the nation in the late 1920s. See People v Stoudemire, 429 Mich 262, 267-271; 414 NW2d 693 (1987), for a Discussion of what came to be called the \"Baumes Laws.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e98. See ante, pp 232-233.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e99. See Magreta v Ambassador Steel Co, 378 Mich 689, 695-696; 148 NW2d 767 (1967), (On Rehearing), 380 Mich 513; 158 NW2d 473 (1968), Williams v Secretary of State, 338 Mich 202, 208; 60 NW2d 910 (1953), Ballinger v Smith, 328 Mich 23, 31; 43 NW2d 49 (1950), Gardner-White Co v State Board of Tax Administration, 296 Mich 225, 230; 295 NW 624 (1941), Boyer-Campbell Co v Fry, 271 Mich 282, 297; 260 NW 165 (1935), and Attorney General v Detroit United Railway, 210 Mich 227, 254; 177 NW 726 (1920). See also King v Midland Co Dep't of Social Services, 73 Mich App 253, 258; 251 NW2d 270 (1977), and State Farm Mutual Automobile Ins Co v Kurylowicz, 67 Mich App 568, 578; 242 NW2d 530 (1976). See, generally, 2A Sands, Sutherland Statutory Construction (4th ed), ยง 45.12, p 54.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e100. See MCL 769.10 et seq.; MSA 28.1082 et seq.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e101. The habitual offender provisions describe two sets of procedures. Section 13 provides for a separate proceeding concerning a person's prior felony conviction(s); there are provisions for the filing of a separate or supplemental information, trial by jury, and trial in accordance with the usual practice in criminal cases. See MCL 769.13; MSA 28.1085. The second sentence of ยง 12(3) refers to indictment and conviction as a previous offender. See MCL 769.12(3); MSA 28.1084(3).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn People v Stratton, 13 Mich App 350, 356; 164 NW2d 555 (1968), the Court of Appeals said:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe procedure set forth in section 13 is to be followed whenever it appears to the prosecutor \" after conviction\" of the current charge that the felon has a prior felony record. However, where it appears to the prosecutor before conviction of the current charge that the accused person is a prior felon, the accused person is to be informed against as a prior offender prior to conviction on the current charge . . . . [Emphasis in original.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eTwo years later, this Court approved the analysis in Stratton. See People v Hatt, 384 Mich 302, 309; 181 NW2d 912 (1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eRelying on Hatt and Stratton, this Court in People v Fountain, 407 Mich 96, 98; 282 NW2d 168 (1979) (per curiam), held that \" prosecutor who knows a person has a prior felony record must promptly proceed, if at all, against the person as an habitual offender.\" The Court also said, however, that \" habitual offender charges should have been filed with the information which charged the last felony . . . .\" Id., p 99.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn Shelton, supra, p 568, the Court held that Fountain required \"prompt\" filing of the supplemental information, not a simultaneous filing with the information charging the most recent offense. The Court defined \"promptly\" as within fourteen days of the defendant's arraignment or before trial if the defendant was tried within that fourteen-day period.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe only exception to the requirement that a prosecutor, who knows of the defendant's prior felony conviction(s), must charge the defendant as an habitual offender within fourteen days of the defendant's arraignment is where the delay in filing the supplemental information is caused by the need to verify out-of-state conviction(s) based on a rap sheet. See People v Hendrick, 398 Mich 410; 247 NW2d 840 (1976).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSee also MCR 6.112(C).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e102. See MCL 769.13; MSA 28.1085. See also Stratton, n 101 (supra) , p 356, Hatt, n 101 (supra) , p 309, Fountain, n 101 (supra) , p 98, and Shelton, supra, p 569.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e103. See n 101.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e104. Const 1963, art 6, ยง 5. See People v Young, 410 Mich 363, 367; 301 NW2d 803 (1981) (per curiam), and Fountain, n 101 (supra) , pp 99-100 (Coleman, C.J., Concurring).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe rule requiring that the prosecutor promptly charge the defendant as an habitual offender seeks to avoid the appearance of prosecutorial impropriety and to provide fair notice to the defendant. See Fountain, n 101 (supra) , p 99, Young, p 367, and Shelton, supra, pp 568-569.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e105. Chief Justice Coleman's Concurring opinion in People v Fountain, n 101 (supra) , cites Oyler for the proposition that the result in one of the two cases consolidated for appeal in Fountain was not required by the United States Constitution.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e106. 1988 PA 90, MCL 769.10; MSA 28.1082.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e108 (1) An individual who was convicted previously for a violation of any of the following offenses and is thereafter convicted of a second or subsequent violation of any of the following offenses shall be imprisoned for life and shall not be eligible for probation, suspension of sentence, or parole during that mandatory term:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(a) A violation of section 7401(2)(a)(ii) or (iii).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(b) A violation of section 7403(2)(a)(ii) or (iii).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(c) Conspiracy to commit an offense proscribed by section 7401(2)(a)(ii) or (iii) or section 7403(2)(a)(ii) or (iii). [1988 PA 144, MCL 333.7413(1); MSA 14.15(7413)(1).]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSection 7401(2)(a) proscribes the delivery and manufacture, and possession with intent to deliver or manufacture, a schedule 1 or 2 controlled substance. Section 7403(2)(a) proscribes the knowing or intentional possession of a schedule 1 or 2 controlled substance. Subsection (ii) applies to offenses involving 225 to 650 grams of a mixture containing the controlled substance. Subsection (iii) applies to offenses involving 50 to 225 grams.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWhen a violation of ยง 7401(2)(a) or ยง 7403(2)(a) involves 650 grams or more, the sentence for a first offense is mandatory imprisonment for life without the possibility of probation, suspension, or parole. See 1988 PA 60, MCL 333.7401, 333.7403; MSA 14.15(7401), 14.15(7403).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e109 See People v Evans, 434 Mich 314, 325, n 6; 454 NW2d 105 (1990) (endorsing the \"presumption that the Legislature acts with knowledge of, and in harmony with, existing legislation\"), and People v Harrison, 194 Mich 363, 369; 160 NW 623 (1916) (in enacting the penalty provision of the local-option law, 1889 PA 207, ยง 16, the Legislature was presumed to have acted in contemplation of a general provision concerning the execution of judgments in criminal cases, 1846 RS, ch 168, ยง 4). See also Endykiewicz v State Hwy Comm, 414 Mich 377, 390-391; 324 NW2d 755 (1982). See The Penza, 9 F2d 527, 528 (CA 2, 1925) (Congress was presumed to have enacted a statute in contemplation of both statutory and customary maritime law). See, generally, 2A Sands, Sutherland Statutory Construction (4th ed), n 99 (supra) , ยง 45.12, p 55.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e110 Notice of the possibility of sentence enhancement before trial on the most recent offense is clearly not required by the Due Process Clause of the Fourteenth Amendment. See Oyler v Boles, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIf the Legislature were to enact a statute that relieved the prosecutor from providing pretrial notice only where a defendant's prior and current offenses are drug related, however, there might be a problem under the Equal Protection Clause of the Fourteenth Amendment. With respect to procedural safeguards, there is no apparent justification for treating a recidivist drug offender differently than an habitual armed robber. Statutes should be construed to avoid potential conflicts with the United States Constitution. See, generally, 2A Sands, Sutherland Statutory Construction (4th ed), n 99 (supra) , ยง 45.11, p 46.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e111 For example, compare Beauchamp v Dow Chemical Co, 427 Mich 1; 398 NW2d 882 (1986), with 1987 PA 28, MCL 418.131; MSA 17.237(131).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e112 The sentence enhancement provision of the controlled substances article, MCL 333.7413; MSA 14.15(7413), was enacted by 1978 PA 368. On two separate occasions after this Court's decisions in Lester and Cobb (see the text accompanying n 22), the Legislature has amended the sentence enhancement provision, but has not altered the requirement that the prosecutor charge the defendant as a repeat offender. See 1988 PA 12 and 1988 PA 144.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSimilarly, the Legislature amended the sentencing provisions concerning driving under the influence of alcohol, MCL 257.625; MSA 9.2325, on four separate occasions after the Court of Appeals decision in Bosca (see ns 38-41 and the accompanying text), and on two additional occasions since this Court's approval of that decision in Urynowicz, but did not change the requirement that the prosecutor charge the defendant as a repeat offender. See 1976 PA 285, 1978 PA 57, 1978 PA 391, 1980 PA 515, 1982 PA 309, and 1987 PA 109. The Legislature has not amended the sentence enhancement provision for repeat convictions of criminal sexual conduct, MCL 750.520f; MSA 28.788(6), after Urynowicz was decided.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThis Court has sometimes adhered to statutory precedents on the basis of the Legislature's failure to amend the statute to correct an asserted error in construction, especially when the Legislature has subsequently revised other parts of the same statutory provision. See Dean v Chrysler Corp, 434 Mich 655, 664-666; 455 NW2d 699 (1990), Smith v Detroit, 388 Mich 637, 650-651; 202 NW2d 300 (1972), In re Clayton Estate, 343 Mich 101, 106-107; 72 NW2d 1 (1955), and Consumers Power Co v Muskegon Co, 346 Mich 243, 250-251; 78 NW2d 223 (1956).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e113 I have not found -- nor has the majority cited -- a single case involving any of the sentence enhancement provisions here discussed in which this Court has affirmed an enhanced sentence where the defendant was not charged as a repeat offender.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eUnder the habitual offender provisions of the Code of Criminal Procedure, there are exceptions to the fourteen-day rule of People v Shelton. See n 101. In the instant case, the Court of Appeals concluded that the recognized exceptions were not applicable. See People v Eason, n 5 (supra) at 5-6.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e114 See Dean, n 112 (supra) , p 665, n 11, Li v Feldt, 434 Mich 584, 591, n 7; 456 NW2d 55 (1990), Abendschein v Farrell, 382 Mich 510, 516-517; 170 NW2d 137 (1969), and Smith v Lawrence Baking Co, 370 Mich 169, 177; 121 NW2d 684 (1963). See also Whetro v Awkerman, 383 Mich 235, 247; 174 NW2d 783 (1970) (Black, J., separate opinion), and Park v Employment Security Comm, 355 Mich 103, 145; 94 NW2d 407 (1959) (Black, J., Concurring).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e115 See, for example, Parker v Port Huron Hosp, 361 Mich 1, 10; 105 NW2d 1 (1960) (\"Only in the rare case when it is clearly apparent that an error has been made, or changing conditions result in inJustice by the application of an outmoded rule, should we deviate from following the established rule\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e116 See ns 103-104, and the accompanying text.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e117 Ante, p 247, n 31.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e118 See 1927 PA 175, ch IX, ยงยง 10-13.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e119 See n 26 and the accompanying text.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e120 The Court cited, inter alia, People v Buck, People v Butler, and People v Campbell, n 26 (supra) .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e121 The Court relied in part on Butler (see n 26), and acknowledged that the statute at issue in that case specifically required the prosecutor to charge the defendant as a repeat offender. See Urynowicz, supra, p 141.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e122 The Attorney General relied on Ancksornby and McDonald, which involved a statute that did not expressly require the prosecutor to charge the defendant as a repeat offender, and on Buck, Butler, and Campbell, which involved statutes that did. See n 37.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e123 See n 10.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e124 See Urynowicz, supra, pp 139-140.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e125 See n 25.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e126 See Urynowicz, supra, p 138.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e127 See, generally, Employment Div, Oregon Human Resources Dep't v Smith, 494 U.S. , ; 110 S Ct ; 108 L Ed 2d 876, 905 (1990) (Blackmun, J., Dissenting):\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003emajority is able to arrive at this view only by mischaracterizing this Court's precedents. The Court discards leading free exercise cases . . . as \"hybrid.\" . . . In short, it effectuates a wholesale overturning of settled law concerning the Religion Clauses of our Constitution. One hopes that the Court is aware of the consequences, and that its result is not a product of overreaction to the serious problems the country's drug crisis has generated. [Emphasis added.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e128 1927 PA 175.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e129 When any person shall be convicted of any offence, and shall be duly sentenced therefor to confinement in the state prison of this state, for one year or more, and it shall be alleged in the indictment on which such conviction is had, and admitted or proved on the trial, that the convict has before been sentenced to a like punishment by any court in this state, or in any other of the United States, for a period not less than one year, he shall be sentenced to be punished by imprisonment in the state prison not more than seven years, in addition to the punishment prescribed by law for the offence of which he shall then be convicted. [1846 RS, tit XXX, ch 161, ยง 12. Emphasis added.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWhen any such convict shall have been twice before sentenced to imprisonment at hard labor, for a period of not less than one year at each time, by any court in this state, or in any other of the United States, he shall be sentenced to imprisonment at hard labor for life, or for a term of not less than seven years in addition to the punishment prescribed by law for the offence of which he shall then be convicted. [1846 RS, tit XXX, ch 161, ยง 13.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe Court early held that the pleading requirement of ยง 12 also applied to ยง 13. People v Campbell, n 26 (supra) , p 386.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e130 A person to be punishable under this and the last two preceding sections need not have been indicted and convicted as a previous offender in order to receive the increased punishment therein provided, but may be proceeded against as provided in the following section. [1927 PA 175, ch IX, ยง 12 (last sentence). Emphasis added.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe \"following section\" is ยง 13, which read:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIf at any time after conviction and either before or after sentence it shall appear that a person convicted of a felony has previously been convicted of crimes as set forth in any of the three foregoing sections, it shall be the duty of the prosecuting attorney of the county in which such conviction was had to file an information in such cause accusing the said person of such previous convictions. [1927 PA 175, ch IX, ยง 13. Emphasis added.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e131 1927 PA 175, ch IX, ยง 13.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e132 When judge of Recorder's Court was decided, the Legislature had already once amended the habitual offender provisions of the Code of Criminal Procedure. See 1929 PA 24, 1929 CL 17338-17341. Section 13 and the last sentence of ยง 12 were not amended.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e133 See also People v Hatt, n 101 (supra) , p 308 (quoting judge of Recorder's Court).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e134 That is, the defendant must have been charged in the complaint and warrant as a repeat offender, some evidence respecting the prior conviction must have been presented at the preliminary examination, the information charging the most recent offense must have contained an allegation of prior conviction, and the prior conviction must have been proved at trial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e135 The views expressed in judge of Recorder's Court find support in earlier decisions of the Court applying the pre-Code habitual offender provisions, 1846 RS, tit XXX, ch 161, ยงยง 12-13 (quoted in n 129). See Campbell, n 129 (supra) , p 386 (\"it was necessary that the allegations of such former convictions should be contained in the information, and, if not admitted, proved on the trial, which statutory requirement must be complied with in order to give the court jurisdiction to sentence respondent as for a third offense. . . .\") (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e136 See n 129.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e137 Id., pp 100-101.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe Court also said that \"the rule herein laid down will apply to all future cases and to all statutes wherein increased punishment is provided for offenders who have theretofore been convicted.\" Id., p 106.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e138 The Court cited McDonald, Ancksornby, and Van Vorce, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSee also People v Hendrick, n 3 (supra) , p 417 (the Court, citing Campbell and Ancksornby, said that \" one time the Legislature required that allegations of prior felony convictions be included in the information and proved at the trial on the principal charge. This had to 'be complied with in order to give the court jurisdiction to sentence the respondent as for a third offense'\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e139 See ante, p 247, n 31, where the majority says that the \"better construction\" of the liquor law cases is that \"the Court construed the legislation in question as necessarily requiring a separate information filed . . . to provide the circuit court with jurisdiction.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e140 The jurisdiction of the Justice of the peace was then limited to certain statutorily enumerated offenses not here relevant and to \"all other offenses punishable by fine not exceeding one hundred dollars, or punishable by imprisonment in the county jail not exceeding three months . . . . \" 1889 PA 189, 1915 CL 15769.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA first offense under the liquor law was punishable by a fine of one thousand dollars or imprisonment in a state or county facility for one year. 1919 PA (Ex Sess) 3, amending 1917 PA 338 (quoted in n 24). Thus, the Justice of the peace did not have jurisdiction -- and the circuit court did have jurisdiction -- over a first offense.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe circuit court also had jurisdiction over a first offense in the habitual offender context. Those provisions only applied where the defendant was sentenced for the most recent conviction to imprisonment for one year or more. See 1846 RS, tit XXX, ch 161, ยงยง 12-13 (quoted in n 129). By definition, the habitual offender provisions could only be invoked where the charged offense was punishable by imprisonment for more than three months. Thus, the Justice of the peace would not have had jurisdiction.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e141 1978 PA 368, MCL 333.7413(2); MSA 14.15(7413)(2).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e142 See, generally, People v Lester, 417 Mich 927; 330 NW2d 854 (1983) (the Court, citing, inter alia, the habitual offender provisions of the Code of Criminal Procedure, held that \" defendant's sentence may not be enhanced pursuant to MCL 333.7413; MSA 14.15(7413) because he was not charged with being a subsequent offender\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e143 See n 101 and the accompanying text.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e144 Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e145 MCL 769.10-769.12; MSA 28.1082-28.1084. This proviso was first enacted in 1978 and then specified that a defendant \"shall be punished as provided by\" the Controlled Substances Act, the statutory predecessor to the controlled substances article of the Public Health Code. See 1978 PA 77. Sections 10-12 of the Code of Criminal Procedure were later amended to refer to the controlled substances article. See 1988 PA 90.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eEason was not convicted of a \"major controlled substance offense.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e146 Indeed, the two changes were linked. 1978 PA 77, which first \"excluded\" major controlled substance offenses from the purview of the habitual offender provisions, did not take effect unless and until 1977 HB 4190 was also enacted. See 1978 PA 77, ยง 2. HB 4190 was eventually enacted into law as 1978 PA 147. See 1978 PA 77 (compiler's note). 1978 PA 147 amended the Controlled Substances Act to provide for the first time mandatory minimum terms of imprisonment for certain drug-related offenses. The definition of \"major controlled substance offense\" in the Code of Criminal Procedure corresponded to the offenses for which the Legislature had in the Controlled Substances Act mandated minimum terms of imprisonment.\u003c/span\u003e\n\n",
    "body_length": 162366,
    "citedas": [
      "458 N.W.2d 17",
      "435 Mich. 228"
    ],
    "attorneys": "Frank J. Kelley, Attorney General, Louis J. Caruso, Solicitor General, John D. O'Hair, Prosecuting Attorney, and Timothy A. Baughman, Chief, Criminal Division, Research, Training and Appeals, for the people. Monash, Monash \u0026 Goldberg, P.C. (by Richard A. Monash), for the defendant.",
    "category": [
      "36",
      "75"
    ],
    "judges": "Boyle, J. Riley, C.j., and Brickley and Griffin, JJ., concurred with Boyle, J. Cavanagh, J. (in Agreement). Archer, J., concurred with Cavanagh, J. Levin, J. (to affirm).",
    "citation_count": 0
  }
}
